{
    "relation": [
        [
            "Player",
            "Ichiro Suzuki",
            "Derek Jeter",
            "Robinson Cano",
            "Mark Teixeira",
            "Curtis Granderson",
            "Alex Rodriguez",
            "Nick Swisher",
            "Raul Ibanez",
            "Russell Martin"
        ],
        [
            "AB",
            "12",
            "22",
            "23",
            "5",
            "14",
            "22",
            "7",
            "20",
            "9"
        ],
        [
            "AVG",
            ".583",
            ".318",
            ".348",
            ".400",
            ".214",
            ".364",
            ".286",
            ".250",
            ".111"
        ],
        [
            "OBP",
            ".615",
            ".318",
            ".333",
            ".500",
            ".313",
            ".462",
            ".444",
            ".286",
            ".200"
        ],
        [
            "SLG",
            ".583",
            ".500",
            ".522",
            ".400",
            ".500",
            ".909",
            ".571",
            ".450",
            ".111"
        ]
    ],
    "pageTitle": "Who’s Jason Hammel? | It's About The Money",
    "title": "",
    "url": "http://itsaboutthemoney.net/archives/2012/10/07/whos-jason-hammel/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00114-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 131708527,
    "recordOffset": 131694666,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{19992=It’s somewhat of a surprise that we’re seeing Jason Hammel pitch tonight. He’s been far from a bad pitcher in 2012, showing a 3.23 FIP and a 3.43 ERA, but he’s also thrown just 8.2 innings since mid-July. It’s a risky move for the Orioles, but Buck Showalter and company are playing with house money right now, and his recent decision to start Joe Saunders in the Wild Card playoff game paid off nicely., 24630=As optimistic as I am with these numbers, most come against him when he was pitching with the Rays in his first few seasons. Since then he’s changed his pitching style. Let’s take a look at his pitch repertoire in 2012., 20755=When looking at his numbers against the Yankees, I’d usually select career numbers, as to get the biggest sample size, but as we’ll see later, Hammel is a different pitcher in 2012. Despite this, he’s still been mediocre against the Yankees in 3 starts, posting a 3.94 ERA through 16.0 IP, but also sported a 1.563 WHIP and allowed a 10.1 H/9. Up and down the Yankees lineup, almost every player has a history of hitting the right handed pitcher, in particular Alex Rodriguez, who has 4 homeruns and a 1.371 OPS in 22 at bats., 29622=Here is the overall pitch movement in 2012 from a catcher’s perspective., 29712=Hammel’s pitch repertoire in 2012 has been extremely solid. He sports two great fastballs, a legitimate swing and miss slider, and a decent curveball/changeup. With the type of success the Yankees had off him in the past, the right handed pitcher needs his command  to return in his first game back since September 11th. As we all know, the Yankees are an extremely patient team, and if Hammel can’t locate his pitches, the Bombers will wear him down quickly. If this isn’t the case, the team will likely focus on trying to hit him early in the count due to his heavy fastball approach. The slider is a scary pitch if he has any sort of control, but the lefty heavy lineup Joe Girardi will put on the field should help in avoiding the pitch.}",
    "textBeforeTable": "When looking at his numbers against the Yankees, I’d usually select career numbers, as to get the biggest sample size, but as we’ll see later, Hammel is a different pitcher in 2012. Despite this, he’s still been mediocre against the Yankees in 3 starts, posting a 3.94 ERA through 16.0 IP, but also sported a 1.563 WHIP and allowed a 10.1 H/9. Up and down the Yankees lineup, almost every player has a history of hitting the right handed pitcher, in particular Alex Rodriguez, who has 4 homeruns and a 1.371 OPS in 22 at bats. It’s somewhat of a surprise that we’re seeing Jason Hammel pitch tonight. He’s been far from a bad pitcher in 2012, showing a 3.23 FIP and a 3.43 ERA, but he’s also thrown just 8.2 innings since mid-July. It’s a risky move for the Orioles, but Buck Showalter and company are playing with house money right now, and his recent decision to start Joe Saunders in the Wild Card playoff game paid off nicely. By Michael Eder Who’s Jason Hammel? Who’s Jason Hammel? / PitchFX / Home",
    "textAfterTable": "As optimistic as I am with these numbers, most come against him when he was pitching with the Rays in his first few seasons. Since then he’s changed his pitching style. Let’s take a look at his pitch repertoire in 2012.   Four-Seam The four-seam has a good amount of vertical rise at around 10 inches, but also can vary in horizontal movement such that it looks like a cutter at times. Averaging 93.6 mph, the pitch combines good movement and good velocity, which he locates up in the zone to right handed batters, and away from left handers. He’s sporting almost a 10% whiff rate on the four-seam, which is extremely high for this pitch type. Hammel has always been a heavy fastball pitcher. This season he’s thrown less four-seam fastballs thanks to a new approach throughout the Orioles system. GM Dan Duquette has emphasized that cutters are bad, and his sometime-cutting four-seam was drawing too many extra-base hits in the past. Thus, he’s now added a new fastball to prevent the high flyball outcome from his regular fastball. Two-Seam The two-seam is a new addition to his repertoire. This season, he’s matched the usage of both the four-seam and two-seam at around 30% each. It lacks the typical sinking movement of this pitch type, showing only a 2 inch decrease in vertical movement, and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}