{
    "relation": [
        [
            "",
            "2011-12",
            "2012-13",
            "2013-14",
            "2014-15",
            "Total"
        ],
        [
            "gp",
            "1",
            "10",
            "10",
            "8",
            "29"
        ],
        [
            "rec",
            "1",
            "18",
            "37",
            "20",
            "76"
        ],
        [
            "rec/g",
            "1.0",
            "1.8",
            "3.7",
            "2.5",
            "2.6"
        ],
        [
            "yds",
            "56",
            "374",
            "462",
            "244",
            "1136"
        ],
        [
            "y/g",
            "56.0",
            "37.4",
            "46.2",
            "30.5",
            "39.2"
        ],
        [
            "avg",
            "56.0",
            "20.8",
            "12.5",
            "12.2",
            "14.9"
        ],
        [
            "td",
            "1",
            "2",
            "2",
            "1",
            "6"
        ],
        [
            "lg",
            "56",
            "64",
            "54",
            "32",
            "64"
        ]
    ],
    "pageTitle": "Tim Bartholomew - WUSTL Athletics",
    "title": "",
    "url": "http://bearsports.wustl.edu/sports/fball/2014-15/bios/bartholomew_tim_wt9v?view=career&pos=rb",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 14,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00175-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 25031631,
    "recordOffset": 25016215,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{183654=© 2015 Washington University in St. Louis}",
    "textBeforeTable": "Tim Bartholomew 84 84 Related Bios Brian Crowe Steven Sarbey David Smith Dylan Petre Andrew Freeland Leonardo Zingg Sam Van Doren Hank Childs J.J. Tomlin Alex Hallwachs Dylan Newcomb Nick Annin Seamus Finnegan Quincy Marting Matt Page David Nees Jonathan Paramore Fade Oluokun Alex Hodakowski Will Smith Ryan Wilkin Jonathan Way Austin Smestad Michael Mann Kevin Hammarlund Michael Dwoskin Cody Deterding Patrick Cantwell Ryan Bednar Chris Seager Jack Garton Conrad Devin Mark Barnett Steve Kawer Nick Doctors Blake Avery Andrew Ralph Harding Fears III Billy Cramsie Cody Ratermann Joe Quinlan Danny Nowak Alex Graham Josiah Situmeang Lachlan Athanasiou Dakota Treat Sam Hahn Marcus Ramspott Zach Lonneman Curtis Black Eric Shumacher Alex Ury Luke Duffy Greg Hanich Mark McMillin Brian Douglas Will Thompson Wesley Hsu Collin Holte Jerry Bauer Ron Leach John Doty Michael Mehaffy Chris Fredrickson Jacob Haskins Ryan Rees James Theofilos Drew Pikey Jared Lake Jerry Li Matt",
    "textAfterTable": "2011: Played most of the season on the junior varsity squad … Caught a 56-yard touchdown pass in only varsity appearance in 48-21 win vs. Rhodes (9/10). HIGH SCHOOL: Earned varsity letters in football and two in track at Smoky Hill High School … Team captain in football … Caught 27 passes for 351 yards and six touchdowns as a senior … Two-time second-team all-league … Career numbers include 91 receptions for 1,113 yards and 13 touchdowns … American Chemical Society Award … Outstanding Junior recognized by the University of Colorado and the Free Masons … Outstanding Senior … AP Scholar with Distinction. PERSONAL: Majoring in chemical engineering with a minor in energy … Son of Vince and Mary Bartholomew … Cousin David Harris played football at Washington University. Recent Games Oct 11 Hendrix W, 59-19 Oct 18 Maranatha Baptist Oct 25 at Chicago L, 44-23 Nov 1 Case W, 28-17 Nov 8 Alfred St. W, 47-19 Nov 15 at Carnegie Mellon L, 17-16 Statistics",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}