{
    "relation": [
        [
            "Sport",
            "Basketball",
            "Volleyball",
            "Soccer",
            "Softball",
            "Lacrosse",
            "Field hockey",
            "Ice hockey",
            "Water polo"
        ],
        [
            "1981–82",
            "705",
            "603",
            "80",
            "348",
            "105",
            "268",
            "17",
            "—"
        ],
        [
            "2011–12",
            "1,084",
            "1,047",
            "996",
            "976",
            "376",
            "266",
            "86",
            "64"
        ],
        [
            "Change",
            "+379",
            "+444",
            "+916",
            "+628",
            "+271",
            "–2",
            "+69",
            "+64"
        ],
        [
            "Percent",
            "+54%",
            "+74%",
            "+1245%",
            "+180%",
            "+258%",
            "–1%",
            "+406%",
            "——"
        ]
    ],
    "pageTitle": "National Collegiate Athletic Association - Wikipedia, the free encyclopedia",
    "title": "Women's Team Sports: Number of Schools Sponsoring",
    "url": "https://en.wikipedia.org/wiki/NCAA_Championships",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00098-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 879160019,
    "recordOffset": 879105005,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14231=The NCAA dates its formation to two White House conferences convened by President Theodore Roosevelt to \"encourage reforms\" to college football practices in the early 20th century, which had resulted in repeated injuries and deaths and \"prompted many college and universities to discontinue the sport.\"[1] Following those White House meetings, Chancellor Henry MacCracken of New York University organized a meeting of 13 colleges and universities to initiate changes in football playing rules; at a follow-on meeting on December 28, 1905 in New York, 62 higher-education institutions became charter members of the Intercollegiate Athletic Association of the United States (IAAUS).[1] The IAAUS was officially established on March 31, 1906, and took its present name, the NCAA, in 1910.[1], 60496=Other reports show that 355 college wrestling programs have been eliminated since 2000, and 212 men's gymnastics programs have been eliminated since 1969 with only 17 programs remaining as of 2013.[19], 19607=In 2009, Simon Fraser University in Burnaby, British Columbia, Canada became the NCAA's first non-US member institution.[7][8], 67130=For every NCAA sanctioned sport other than Division I FBS football, the NCAA awards trophies with gold, silver, and bronze plating for the first, second, and third place teams respectively.[citation needed] In the case of the NCAA basketball tournaments, both semifinalists who did not make the championship game receive bronze plated trophies for third place (prior to 1982 the teams played a \"consolation\" game to determine third place).[citation needed] Similar trophies are awarded to both semifinalists in the NCAA football tournaments (which are conducted in Division I FCS and both lower divisions), which have never had a third-place game. Winning teams maintain permanent possession of these trophies unless it is later found that they were won via serious rules violations., 108679=In September 1982, the district court found in favor of the plaintiffs, ruling that the plan violated antitrust laws. It enjoined the Association from enforcing the contract. The NCAA appealed all the way to the United States Supreme Court, but lost in 1984 in the 7–2 ruling NCAA v. Board of Regents of the University of Oklahoma.[29] (If the television contracts the NCAA had with ABC, CBS, and ESPN had remained in effect for the 1984 season, they would have generated some $73.6 million for the Association and its members.), 114952=In cases of particularly egregious misconduct, the NCAA has the power to ban a school from participating in a particular sport, a penalty known as the \"Death Penalty\". Since 1985, any school that commits major violations during the probationary period can be banned from the sport involved for up to two years. However, when the NCAA opts not to issue a death penalty for a repeat violation, it must explain why it did not do so. This penalty has only been imposed three times in its modern form, most notably when Southern Methodist University's football team had its 1987 season canceled due to massive rules violations dating back more than a decade. SMU opted not to field a team in 1988 as well due to the aftershocks from the sanctions, and the program has never recovered; it has only four winning seasons and four bowl appearance since then (mostly under June Jones, the team's head coach from 2008 until his resignation during the 2014 season). The devastating effect the death penalty had on SMU has reportedly made the NCAA skittish about issuing another one. Since the SMU case, there are only three instances where the NCAA has seriously considered imposing it against a Division I school; it imposed it against Division II Morehouse College's men's soccer team in 2003 and Division III MacMurray College's men's tennis team in 2005. In addition to these cases, the most recently division I school to be considered was Penn State. This because of the Jerry Sandusky Incident that consequently almost landed Penn State on the hook for the Death Penalty. They received a 60 million dollar fine, in addition to forfeited seasons and other sanctions as well., 15602=For several years, the NCAA was a discussion group and rules-making body, but in 1921 the first NCAA national championship was conducted: the National Collegiate Track and Field Championships. Gradually, more rules committees were formed and more championships were created, including a basketball championship in 1939.[5], 25588=In 1999, the NCAA moved its 300-member staff to its new headquarters in the White River State Park in a four-story 140,000-square-foot (13,000 m2) facility on the west edge of downtown Indianapolis, Indiana. Adjacent to the headquarters is the 35,000-square-foot (3,300 m2) NCAA Hall of Champions.[12], 71564=Starting in 2014, the College Football Playoff – a consortium of the conferences and independent schools that compete in Division I FBS and six bowl games – has arranged to place the top four teams (based on a thirteen-member committee that selects and seeds the teams) into two semifinal games, with the winners advancing to compete in the College Football Playoff National Championship. The winner of the game receives a trophy; since the NCAA awards no national championship for Division I FBS football, this trophy does not denote NCAA as other NCAA college sports national championship trophies do., 104201=From 1998 to 2013, Electronic Arts had a license to develop college sports video games with the NCAA's branding, which included its NCAA Football and NCAA Basketball (formerly NCAA March Madness) series. The NCAA's licensing was not required to produce the games, as rights to use teams are not licensed through the NCAA, but through entities such as individual schools and the Collegiate Licensing Company. EA only acquired the license so that it could officially incorporate the Men's Division I Basketball Championship into its college basketball game series. The NCAA withdrew EA's license due to uncertainties surrounding a series of lawsuits, most notably O'Bannon v. NCAA, involving the use of player likenesses in college sports video games.[25][26], 24346=In 1997, it asked for bids for a new headquarters., 68448=Starting with the 2001–02 season, and again in the 2007–08 season, the trophies were changed.[citation needed] Starting in the 2006 basketball season, teams that make the Final Four in the Division I tournament receive bronze plated \"regional championship\" trophies upon winning their Regional Championship. The teams that make the National Championship game receive an additional trophy that is gold plated for the winner and silver plated for the runner-up. Starting in the mid-1990s, the National Champions in men's and women's basketball receive an elaborate trophy with a black marble base and crystal \"neck\" with a removable crystal basketball following the presentation of the standard NCAA Championship trophy., 33643=The NCAA currently awards 89 national championships yearly – 44 women's, 42 men's, and coed championships for fencing, rifle, and skiing. In October 2014, Division I leaders approved the formation of a single all-divisions women's beach volleyball championship beginning in 2016, and Division II and Division III leaders approved the new championship in January 2015. This will be the NCAA's 90th annual championship.[16] The NCAA had called the sport \"sand volleyball\" until June 23, 2015, when it announced that it would use the internationally recognized name of \"beach volleyball\".[17], 106310=In the late 1940s there were only two colleges in the country with a national TV contract, a considerable source of revenue. In 1951, the NCAA voted to prohibit any live TV broadcast of college football games during the season. No sooner had the NCAA voted to ban television than public outcry forced it to retreat. Instead, the NCAA voted to restrict the number of televised games for each team to stop the slide in gate attendance. Harold Stassen, president of the University of Pennsylvania, defied the monopoly and signed a $200,000 contract with ABC. Eventually Penn was forced to back down when the NCAA, refusing Penn's request that the U.S. Attorney General rule on the legality of the NCAA's restrictive plan,[27][28] threatened to expel the Quakers from the association., 62650=Source: NCAA Sports Sponsorship and Participation Rates Report • 2012-13, 107531=By the 1980s, televised college football had become a much larger source of income for the NCAA. In September 1981, the Board of Regents of the University of Oklahoma and the University of Georgia Athletic Association filed suit against the NCAA in district court in Oklahoma. The plaintiffs stated that the NCAA's football television plan constituted price fixing, output restraints, boycott, and monopolizing, all of which were illegal under the Sherman Act. The NCAA argued that its pro-competitive and non-commercial justifications for the plan – protection of live gate, maintenance of competitive balance among NCAA member institutions, and creation of a more attractive \"product\" to compete with other forms of entertainment – combined to make the plan reasonable., 4638=In August 1973, the current three-division setup of Division I, Division II, and Division III was adopted by the NCAA membership in a special convention. Under NCAA rules, Division I and Division II schools can offer scholarships to athletes for playing a sport. Division III schools may not offer any athletic scholarships. Generally, larger schools compete in Division I and smaller schools in II and III. Division I football was further divided into I-A and I-AA in 1978. Subsequently the term \"Division I-AAA\" was briefly added to delineate Division I schools which do not field a football program at all, but that term is no longer officially used by the NCAA.[4] In 2006, Divisions I-A and I-AA were respectively renamed the Football Bowl Subdivision (FBS) and Football Championship Subdivision (FCS)., 22847=In 1964, it moved three blocks away to offices in the Midland Theatre., 3143=The National Collegiate Athletic Association (NCAA) is a non-profit association which regulates athletes of 1,281 institutions; conferences; organizations; and individuals. It also organizes the athletic programs of many colleges and universities in the United States and Canada, and helps more than 450,000 college student-athletes who compete annually in college sports. The organization is headquartered in Indianapolis, Indiana. In 2014 the NCAA generated almost a billion dollars in revenue. 80 to 90% of this revenue was due to the Men's Division I Basketball Tournament. This revenue is then distributed back into various organizations and institutions across the United States.[3], 29744=The NCAA had no full-time administrator until 1951, when Walter Byers was appointed executive director.[1] In 1988, the title was changed to President.[13], 23293=In 1989, it moved 6 miles (9.7 km) farther south to 6201 College Boulevard in Overland Park, Kansas. The new building was on 11.35 acres (45,900 m2) and had 130,000 square feet (12,000 m2) of space.[10], 111286=As of 2011, a high school student may sign a letter of intent to enter and play football for a college only after the first Wednesday in February.[32] In August 2011, the NCAA announced plans to raise academic requirements for postseason competition, including its two most prominent competitions, football's now-defunct Bowl Championship Series (replaced in 2014 by the College Football Playoff) and the Men's Division I Basketball Championship; the new requirement, which are based on an \"academic progress rate\" (APR) that measures retention and graduation rates, and is calculated on a four-year, rolling basis.[33] The changes raise the rate from 900 to 930, which represents a 50% graduation rate.[33], 22990=In 1973, it moved to 6299 Nall at Shawnee Mission Parkway in suburban Mission, Kansas in a $1.2 million building on 3.4 acres (14,000 m2)., 12906=Inter-collegiate sports in the US began in 1852 when crews from Harvard University and Yale University met in a challenge race in the sport of rowing.[citation needed] As rowing remained the preeminent sport in the country into the late-1800s, many of the initial debates about collegiate athletic eligibility and purpose were settled through organizations like the Rowing Association of American Colleges and the Intercollegiate Rowing Association. As other sports emerged, notably football and basketball, many of these same concepts and standards were adopted. Football, in particular, began to emerge as a marquee sport, but the rules of the game itself were in constant flux and often had to be adapted for each contest., 18917=In 1999, the NCAA was sued for discriminating against female athletes under Title IX for systematically giving men in graduate school more waivers than woman to participate in college sports. In National Collegiate Athletic Association v. Smith, the U.S. Supreme Court ruled that the NCAA was not subject to that law, without reviewing the merits of the discrimination claim.[6], 59619=In women's sports, the sports with the biggest net gains during the 1988–89 to 2010–11 period were soccer (+599 teams), golf, and indoor track and field, while no women's sports programs experienced double-digit net losses.[18] In men's sports, the sports with the biggest net gains during the 1988/89 to 2010/11 period were indoor track and field, lacrosse, and cross-country (each with more than 100 net gains), but the men's sports with the biggest losses were wrestling (-104 teams), tennis, and rifle, and the men's team sport with the most net losses was water polo.[18], 69455=As of May 2015,[20] UCLA, Stanford, and Southern California (USC) have the most NCAA championships. UCLA holds the most, winning a combined 112 NCAA team championships in men's and women's sports, while Stanford is second with 106 and USC is third with 100., 22199=The Fairmount was a block from Municipal Auditorium which had hosted Final Four games in 1940, 1941, and 1942., 17533=As college athletics grew, the scope of the nation's athletics programs diverged, forcing the NCAA to create a structure that recognized varying levels of emphasis. In 1973, the Association's membership was divided into three legislative and competitive divisions – I, II, and III. Five years later in 1978, Division I members voted to create subdivisions I-A and I-AA (renamed the Football Bowl Subdivision and the Football Championship Subdivision in 2007) in football.[5], 110878=To meet the requirements for grade point average and SAT scores, the lowest possible GPA a student may be eligible with is a 1.70, as long as they have an SAT score of 1400. The lowest SAT score a student may be eligible with is 700 as long as they have a GPA of 2.500.[30], 113568=Member schools pledge to follow the rules promulgated by the NCAA. Creation of a mechanism to enforce the NCAA's legislation occurred in 1952 after careful consideration by the membership., 22440=After Byers moved to Kansas City, the championships would be held in Municipal in 1953, 1954, 1955, 1957, 1961, and 1964., 21410=The modern era of the NCAA began in July 1952 when its executive director, Kansas City, Missouri native Walter Byers, moved the organization's headquarters from the LaSalle Hotel in Chicago (where its offices were shared by the headquarters of the Big Ten Conference) to the Fairmount Building at 101 West 11th Street in Downtown Kansas City. The move was intended to separate the NCAA from direct influence of any individual conference and to keep it centrally located., 18136=Until the 1980s, the association did not offer women's athletics. Instead an organization named the Association for Intercollegiate Athletics for Women (AIAW) governed women's collegiate sports in the United States. By 1982, however, all divisions of the NCAA offered national championship events for women's athletics and most members of the AIAW joined the NCAA. A year later in 1983, the 75th Convention approved an expansion to plan women's athletic program services and pushed for a women's championship program.[5], 16560=The complexity of those problems and the growth in membership and championships demonstrated the need for full-time professional leadership. Walter Byers, previously a part-time executive assistant, was named executive director in 1951, and a national headquarters was established in Kansas City, Missouri in 1952.[5]}",
    "lastModified": "Sat, 01 Aug 2015 19:23:41 GMT",
    "textBeforeTable": "The following tables show the changes over time in the number of NCAA schools across all three divisions combined sponsoring each of the men's and women's team sports. Other reports show that 355 college wrestling programs have been eliminated since 2000, and 212 men's gymnastics programs have been eliminated since 1969 with only 17 programs remaining as of 2013.[19] In women's sports, the sports with the biggest net gains during the 1988–89 to 2010–11 period were soccer (+599 teams), golf, and indoor track and field, while no women's sports programs experienced double-digit net losses.[18] In men's sports, the sports with the biggest net gains during the 1988/89 to 2010/11 period were indoor track and field, lacrosse, and cross-country (each with more than 100 net gains), but the men's sports with the biggest losses were wrestling (-104 teams), tennis, and rifle, and the men's team sport with the most net losses was water polo.[18] The popularity of each of these sports programs has changed over time. Between 1988–89 and 2010–11, NCAA schools had net additions of 510 men's teams and 2,703 women's teams.[18] Sports added and dropped[edit] Triathlon Rugby Equestrian In addition to the above sports, the NCAA currently recognizes three \"emerging sports\" for women. These sports are recognized by the NCAA, with scholarship limitations for each, but",
    "textAfterTable": "Source: NCAA Sports Sponsorship and Participation Rates Report • 2012-13 Women's Team Sports: Number of Schools Sponsoring Sport 1981–82 2011–12 Change Percent Basketball 705 1,084 +379 +54% Volleyball 603 1,047 +444 +74% Soccer 80 996 +916 +1245% Softball 348 976 +628 +180% Lacrosse 105 376 +271 +258% Field hockey 268 266 –2 –1% Ice hockey 17 86 +69 +406% Water polo — 64 +64 —— Source: NCAA Sports Sponsorship and Participation Rates Report • 2012-13 Championships[edit] NCAA National Championship trophies, rings, and watches won by UCLA teams See also: Non-NCAA championships, AIAW Champions, Pre-NCAA intercollegiate championships, Intercollegiate sports team champions and List of NCAA schools with the most NCAA Division I championships Trophies[",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}