{
    "relation": [
        [
            "Pos.",
            "G",
            "G",
            "G",
            "F",
            "C"
        ],
        [
            "No.",
            "11",
            "22",
            "25",
            "33",
            "55"
        ],
        [
            "Player",
            "Molly McDowell",
            "Terica Hathaway",
            "Holly Teague",
            "Geshla Woodard",
            "Kristine Abramowski"
        ],
        [
            "Ht.",
            "5-10",
            "5-10",
            "5-7",
            "6-0",
            "6-3"
        ],
        [
            "Cl.",
            "So.",
            "Sr.",
            "Jr.",
            "Jr.",
            "Sr."
        ],
        [
            "Hometown",
            "Fillmore, Ill.",
            "Providence, Ky.",
            "Poplar Bluff, Mo.",
            "Jackson, Ala.",
            "Freeport, Ill."
        ],
        [
            "GP-GS",
            "2-2",
            "2-2",
            "2-2",
            "2-2",
            "2-2"
        ],
        [
            "PPG",
            "9.0",
            "16.5",
            "10.0",
            "5.5",
            "8.5"
        ],
        [
            "RPG",
            "5.0",
            "6.5",
            "4.5",
            "6.5",
            "7.5"
        ]
    ],
    "pageTitle": "SIU vs. Tennessee Tech Game Notes - Southern Illinois University Official Athletic Site",
    "title": "",
    "url": "http://www.siusalukis.com/sports/w-baskbl/spec-rel/032001aag.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00057-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 723501691,
    "recordOffset": 723478812,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{15216=SIU cut the lead to 77-74 with :26 to play, but the Ragin' Cajuns hit two free throws to seal the victory. SIU battled back from a 13 point deficit with 7:13 to play, with an 18-10 run before the final two Louisiana-Lafayette points ended the scoring., 6559=Junior sensation Janet Holt, the 2000 Ohio Valley Conference Player-of-the-Year, leads the Golden Eaglettes in scoring this season averaging 21.3 points per game while senior Rachael Gobble follows in second with an average of 15.7. Gobble is coming off a remarkable career-high 33-point (9-of-12 from the floor, 6-of-6 from the free throw line) which included an individual school record nine three-pointers. For the game, Tennessee Tech knocked down a total of 13 treys which also marked a school record for most in a single game., 17324=2000-01 HOME OPENER . . . Southern Illinois University's women's basketball team plays host to Tennessee Tech in its 2000-01 home opener Wednesday at 7:05 p.m. The Salukis, who are 145-64 all-time at SIU Arena, will try to put a stop to the Golden Eaglettes' three-game winning streak that currently stands in the 13-year old rivalry., 2764=NO REST FOR THE WICKED . . . After Southern Illinois tangles with Tennessee Tech Wednesday night, the Salukis will head to Dallas, Texas, Fri.-Sat., Dec. 1-2 to compete in the SMU Hoops for Cure Women's Basketball Classic. SIU opens tournament play against SMU Friday at 7 p.m. The Dawgs will then conclude the tourney Saturday against the winner of Boston University and Arkansas Pine Bluff before returning home Sunday., 17539=November 28, 2000, 14614=THE COACHES . . . Southern Illinois University head coach Lori Opp (Western Illinois '88) enters her first season at the helm of the Saluki women's basketball program. Opp (Havana Ill.), who was named head coach in August, spent the last two seasons as the Salukis' assistant coach/recruiting coordinator. Prior to SIU, Opp served as a graduate assistant coach at Western Illinois (1988-90) and an assistant coach at Eastern Illinois (1990-93), Indiana State (1994-95), and Murray State (1995-98). With over 11 years of Division I coaching experience, Opp brings an unlimited amount of knowledge and enthusiasm to this year's squad as she is now the sixth head coach in the program's 41-year history., 8167=ABOUT THE SALUKIS . . . Southern Illinois returns to SIU Arena for its 2000-01 home opener after a two-game roadswing in Chicago, Ill., and Lafayette, La. The Salukis, 1-1, opened their season with a 57-40 win over Illinois-Chicago (11/18), but fell short to Louisiana-Lafayette 79-74 (11/25)., 17490=Southern Illinois (1-1) vs. Tennessee Tech University (1-2) Wednesday, Nov. 29 / 7:05 p.m. / SIU Arena / Carbondale, Ill., 16957=THE SERIES . . . SIU and Tennessee Tech rekindles a series that made its debut in 1987 when the Golden Eaglettes defeated the Salukis 73-65 in Cookeville, Tenn. Since then, both teams have fought to an overall mark of 7-6 which currently stands in favor of TTU. Although the Golden Eaglettes have taken the previous three meetings which included last year's 74-64 win in Cookeville, Tenn., the Salukis will hope to prevail as the Dawgs hold a 25-13 advantage over their opponents in home openers.}",
    "textBeforeTable": "SPORTS Home loadStorePortal(); sPortal.animate = 1; //1 to fade, 0 to pop sPortal.storeRotation = 6000; //in ms sPortal.storeFadeSpeed = 35; var sPortal = new storePortal(); }); googletag.display('div-gpt-4902749'); googletag.enableServices(); googletag.pubads().enableSyncRendering(); .setTargeting(\"sect\", \"wbaskbl\"); .setTargeting(\"dc_ref\", encodeURIComponent(location.href)) .setTargeting(\"dcopt\", \"ist\") .setTargeting(\"firstpage\", adFirstpage) .setTargeting(\"session\", MadisonSessionCode) .setTargeting(\"legacy\", \"top\") .setTargeting(\"pos\", \"top\") .addService(googletag.pubads()) .defineSizeMapping(gptMap_top) googletag.defineSlot('/4177/CSTV.SILU/SPORTS.WBASKBL.SPECREL', [[728,90],[320,50]], 'div-gpt-4902749') googletag.cmd.push(function(){ } build(); addSize([100,50],[728,90]). var gptMap_top = googletag.sizeMapping(). else if(typeof(gptMap_top) == 'undefined'){ // NON-RESPONSIVE MAINTAIN FULL SIZE ONLY } build(); addSize([300,50],[320,50]). addSize([768,90],[728,90]). var gptMap_top = googletag.sizeMapping(). if(typeof(gptMap_top) == 'undefined' && (window.oas_site_config && window.oas_site_config.responsive)){ // RESPONSIVE",
    "textAfterTable": "#nav ul.sponsor li { height: 220px; border-bottom: 0px solid #732334; } #sponsor_porch { float:right; } Audio/Video Multimedia Saluki All-Access Saluki Sports Today with Mike Reis Mike Reis Soundcloud Gametracker Radio Network Go Southern Go! (Fight Song) Live Audio Baseball Football Lennon/Hinson Live Radio Show Men's Basketball Women's Basketball Produced Shows This Week in Saluki Football This Week in Saluki Basketball Athletics Athletics Department Academics Ask the AD Compliance History/Hall of Fame Internship Program Saluki Sports Properties Spirit Groups Sports Medicine Staff Handbook Staff Directory Strength and Conditioning Video Services What's a Saluki   Reports and Plans EADA Report Graduation Rates Mission Statement NCAA Certification For Former Student-Athletes Alumni Association Calling Former Salukis Celebrating Women's Athletics",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}