{
    "relation": [
        [
            "MSA",
            "Stockton, CA",
            "San Francisco-San Mateo-Redwood City, CA Metropolitan Division",
            "New York-White Plains-Wayne, NY-NJ Metropolitan Division",
            "Vallejo-Fairfield, CA",
            "Washington-Arlington-Alexandria, DC-VA-MD-WV Metropolitan Division"
        ],
        [
            "Employment",
            "160",
            "3,600",
            "19,370",
            "90",
            "9,780"
        ],
        [
            "Hourly mean wage",
            "$32.75",
            "$30.81",
            "$30.40",
            "$30.39",
            "$30.34"
        ],
        [
            "Annual mean wage",
            "$68,120",
            "$64,080",
            "$63,230",
            "$63,210",
            "$63,110"
        ],
        [
            "Employment per thousand workers",
            "0.754",
            "3.664",
            "3.826",
            "0.764",
            "4.251"
        ]
    ],
    "pageTitle": "Paralegals and Legal Assistants",
    "title": "",
    "url": "http://stats.bls.gov/oes/2009/may/oes232011.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00230-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 233508717,
    "recordOffset": 233492755,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{21520=U.S. Bureau of Labor Statistics | Division of Occupational Employment Statistics, PSB Suite 2135, 2 Massachusetts Avenue, NE Washington, DC 20212-0001}",
    "TableContextTimeStampAfterTable": "{25035=About May 2009 National, State, Metropolitan, and Nonmetropolitan Area Occupational Employment and Wage Estimates, 27353=Download May 2009 Occupational Employment and Wage Estimates in Zipped XLS files, 27569=Last Modified Date: May 14, 2010, 26922=May 2009 Metropolitan and Nonmetropolitan Area Occupational Employment and Wage Estimates, 27056=May 2009 National Industry-Specific Occupational Employment and Wage Estimates, 26716=May 2009 National Occupational Employment and Wage Estimates, 26820=May 2009 State Occupational Employment and Wage Estimates}",
    "textBeforeTable": "Employment estimate and mean wage estimates for this occupation: National estimates for this occupation: Top National estimates for this occupation Industry profile for this occupation State profile for this occupation Metropolitan area profile for this occupation Assist lawyers by researching legal precedent, investigating facts, or preparing legal documents. Conduct research to support a legal proceeding, to formulate a defense, or to initiate legal action. 23-2011 Paralegals and Legal Assistants Occupational Employment and Wages, May 2009 Subscribe to the OES Update RELATED LINKS SPECIAL NOTICES DOCUMENTATION RESPONDENTS OES TOPICS SEARCH OES CONTACT OES OES FAQs OES DATABASES OES",
    "textAfterTable": "Industry profile for this occupation: Top Industries with the highest published employment and wages for this occupation are provided. For a list of all industries with employment in this occupation, see the Create Customized Tables function. Industries with the highest levels of employment in this occupation: Industry Employment Hourly mean wage Annual mean wage Legal Services 179,350 $23.30 $48,460 Federal Executive Branch (OES Designation) 13,880 $30.08 $62,570 Local Government (OES Designation) 13,250 $24.27 $50,480 State Government (OES Designation) 9,790 $21.23 $44,160 Management of Companies and Enterprises 6,000 $28.05 $58,340 Top paying industries for this occupation: Industry Employment Hourly mean wage Annual mean",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}