{
    "relation": [
        [
            "",
            "0_",
            "1_",
            "2_",
            "3_",
            "4_",
            "5_",
            "6_",
            "7_",
            "8_",
            "9_",
            "A_",
            "B_",
            "C_",
            "D_",
            "E_",
            "F_",
            ""
        ],
        [
            "_0",
            "NUL 0000 0",
            "DLE 0010 16",
            "32",
            "48",
            "SP 0020 64",
            "& 0026 80",
            "- 002D 96",
            "112",
            "128",
            "144",
            "160",
            "176",
            "192",
            "208",
            "224",
            "0 0030 240",
            "_0"
        ],
        [
            "_1",
            "SOH 0001 1",
            "SBA 0011 17",
            "33",
            "49",
            "65",
            "81",
            "/ 002F 97",
            "113",
            "a 0061 129",
            "j 006A 145",
            "161",
            "177",
            "A 0041 193",
            "J 004A 209",
            "225",
            "1 0031 241",
            "_1"
        ],
        [
            "_2",
            "STX 0002 2",
            "EUA 0012 18",
            "34",
            "SYN 0016 50",
            "66",
            "82",
            "98",
            "114",
            "b 0062 130",
            "k 006B 146",
            "s 0073 162",
            "178",
            "B 0042 194",
            "K 004B 210",
            "S 0053 226",
            "2 0032 242",
            "_2"
        ],
        [
            "_3",
            "ETX 0003 3",
            "IC 0013 19",
            "35",
            "51",
            "67",
            "83",
            "99",
            "115",
            "c 0063 131",
            "l 006C 147",
            "t 0074 163",
            "179",
            "C 0043 195",
            "L 004C 211",
            "T 0054 227",
            "3 0033 243",
            "_3"
        ],
        [
            "_4",
            "4",
            "20",
            "36",
            "52",
            "68",
            "84",
            "100",
            "116",
            "d 0064 132",
            "m 006D 148",
            "u 0075 164",
            "180",
            "D 0044 196",
            "M 004D 212",
            "U 0055 228",
            "4 0034 244",
            "_4"
        ],
        [
            "_5",
            "PT 0009 5",
            "NL 0085 21",
            "37",
            "53",
            "69",
            "85",
            "101",
            "117",
            "e 0065 133",
            "n 006E 149",
            "v 0076 165",
            "181",
            "E 0045 197",
            "N 004E 213",
            "V 0056 229",
            "5 0035 245",
            "_5"
        ],
        [
            "_6",
            "6",
            "22",
            "ETB 0017 38",
            "54",
            "70",
            "86",
            "102",
            "118",
            "f 0066 134",
            "o 006F 150",
            "w 0077 166",
            "182",
            "F 0046 198",
            "O 004F 214",
            "W 0057 230",
            "6 0036 246",
            "_6"
        ],
        [
            "_7",
            "7",
            "23",
            "ESC 001B 39",
            "EOT 0004 55",
            "71",
            "87",
            "103",
            "119",
            "g 0067 135",
            "p 0070 151",
            "x 0078 167",
            "183",
            "G 0047 199",
            "P 0050 215",
            "X 0058 231",
            "7 0037 247",
            "_7"
        ],
        [
            "_8",
            "8",
            "24",
            "40",
            "56",
            "72",
            "88",
            "104",
            "120",
            "h 0068 136",
            "q 0071 152",
            "y 0079 168",
            "184",
            "H 0048 200",
            "Q 0051 216",
            "Y 0059 232",
            "8 0038 248",
            "_8"
        ],
        [
            "_9",
            "9",
            "EM 0019 25",
            "41",
            "57",
            "73",
            "89",
            "105",
            "121",
            "i 0069 137",
            "r 0072 153",
            "z 007A 169",
            "185",
            "I 0049 201",
            "R 0052 217",
            "Z 005A 233",
            "9 0039 249",
            "_9"
        ],
        [
            "_A",
            "10",
            "26",
            "42",
            "58",
            "¢ 002E 74",
            "! 0021 90",
            "¦ 00A6 106",
            ": 003A 122",
            "138",
            "154",
            "170",
            "186",
            "202",
            "218",
            "234",
            "250",
            "_A"
        ],
        [
            "_B",
            "11",
            "27",
            "43",
            "59",
            ". 002E 75",
            "$ 0024 91",
            ", 002C 107",
            "# 0023 123",
            "139",
            "155",
            "171",
            "187",
            "203",
            "219",
            "235",
            "251",
            "_B"
        ],
        [
            "_C",
            "12",
            "DUP 001C 28",
            "44",
            "RA 0014 60",
            "< 003C 76",
            "* 002A 92",
            "% 0025 108",
            "@ 0040 124",
            "140",
            "156",
            "172",
            "188",
            "204",
            "220",
            "236",
            "252",
            "_C"
        ],
        [
            "_D",
            "13",
            "SF 001D 29",
            "ENQ 0005 45",
            "NAK 0015 61",
            "( 0028 77",
            ") 0029 93",
            "_ 005F 109",
            "' 0027 125",
            "141",
            "157",
            "173",
            "189",
            "205",
            "221",
            "237",
            "253",
            "_D"
        ],
        [
            "_E",
            "14",
            "FM 001E 30",
            "46",
            "62",
            "+ 002B 78",
            "; 003B 94",
            "> 003E 110",
            "= 003D 126",
            "142",
            "158",
            "174",
            "190",
            "206",
            "222",
            "238",
            "254",
            "_E"
        ],
        [
            "_F",
            "15",
            "ITB 001F 31",
            "47",
            "SUB 001A 63",
            "| 007C 79",
            "¬ 00AC 95",
            "? 003F 111",
            "\" 0022 127",
            "143",
            "159",
            "175",
            "191",
            "207",
            "223",
            "239",
            "255",
            "_F"
        ]
    ],
    "pageTitle": "IBM 3270 - Wikipedia, the free encyclopedia",
    "title": "3270 Character Set (US EBCDIC)",
    "url": "https://en.wikipedia.org/wiki/3270",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00295-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 877911959,
    "recordOffset": 877886380,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{23972=A version of the IBM PC called the 3270 PC, released in October 1983, included 3270 terminal emulation. Later, the 3270 PC/G (graphics) and 3270 PC/GX (extended graphics) followed., 78672=Addresses were encoded in orders in two bytes. For twelve bit addresses the high order two bits of each byte were normally set to form valid EBCDIC (or ASCII) characters. For example, address 0 was coded as X'4040', or space-space, address 1919 was coded as X'5D7F', or ')\"'.[2]:pp.75–90 Programmers hand coding panels usually kept the table of addresses from the 3270 Component Description or the 3270 Reference Card handy., 89331=This article is based on material taken from the Free On-line Dictionary of Computing prior to 1 November 2008 and incorporated under the \"relicensing\" terms of the GFDL, version 1.3 or later., 19590=Many manufacturers, such as Hewlett Packard, Memorex, ITT Courier and Teletype/AT&T created 3270 compatible terminals, or adapted ASCII terminals such as the HP 2640 series to have a similar block-mode capability that would transmit a screen at a time, with some form validation capability. Modern applications are sometimes built upon legacy 3270 applications, using software utilities to capture (screen scraping) screens and transfer the data to web pages or GUI interfaces., 77660=3270 displays and printers had a buffer containing one byte for every screen position. For example, a 3277 model 2 featured a screen size of 24 rows of 80 columns for a buffer size of 1920 bytes. Bytes were addressed from zero to the screen size minus one, in this example 1919. \"There is a fixed relationship between each ... buffer storage location and its position on the display screen.\"[2]:p.13 Most orders started operation at the \"current\" buffer address, and executing an order or writing data would update this address. The buffer address could be set directly using the Set Buffer Address (SBA) order, often followed by Start Field. For a device with a 1920 character display a twelve bit address was sufficient. Later 3270s with larger screen sizes used fourteen or sixteen bits., 1519=The IBM 3270 is a class of block oriented computer terminal (sometimes called display devices) made by IBM originally introduced in 1971[1] normally used to communicate with IBM mainframes. The 3270 was the successor to the IBM 2260 display terminal. Due to the text colour on the original models, these terminals are informally known as green screen terminals. Unlike a character-oriented terminal, the 3270 minimizes the number of I/O interrupts required by transferring large blocks of data known as data streams, and uses a high speed proprietary communications interface, using coaxial cable., 16459=Imperial Chemical Industries (ICI) Mond Division's Works Records System, the first known shared public spreadsheet, used the 3270 successfully for what was, in effect, a high powered version of today's spreadsheets with additional functions. It remained in continual use for 27 years up until 2001 and, despite its lack of a GUI, cells can be defined anywhere on the screen (not necessarily in rows or columns) and can be instantly re-configured for length, content and formulas as required. It is interesting to note that ICI's online, fully interactive system pre-dated PC spreadsheets by quite a few years and allows multiple users to use the spreadsheets at the same time, similar to today's Web based shared spreadsheets., 26329=By 1994 the \"3174 Establishment Controller\" supported features such as attachment to multiple hosts via token ring, ethernet, or X.25 in addition to the standard channel attach or SDLC, and terminal attachment via twisted pair, token ring or ethernet in addition to co-ax. They also supported attachment of asynchronous ASCII terminals, printers, and plotters alongside 3270 devices.[4]}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "The following table shows the 3275/3277/3284/3286 character set for US English EBCDIC. Lower case characters display or print as uppercase. NL, EM, DUP, and FM control characters display and print as 5, 9, *, and ; characters, respectively, except by the printer when WCC or CCC bits 2 and 3 = '00'b, in which case NL and EM serve their control function and do not print.[2]:p.15 Optional characters were available for US ASCII, and UK, French, German, and Italian EBCDIC. 3270 character set[edit] Technical Information[edit] Telnet 3270, or tn3270 describes both the process of sending and receiving 3270 data streams using the Telnet protocol and the software that emulates a 3270 class terminal that communicates using that process. tn3270 allows a 3270 terminal emulator to communicate over a TCP/IP network instead of an SNA network. Telnet 3270 can be used for either terminal or print connections. Standard telnet clients cannot be used as a substitute for tn3270 clients, as they use fundamentally different techniques for exchanging data. Telnet 3270[edit] The IBM 3270 display terminal subsystem was designed and developed by IBM's Kingston, NY, laboratory (which later closed during IBM's difficult time",
    "textAfterTable": "Data stream[edit] Data sent to the 3270 consists of commands and orders. Commands instruct the 3270 control unit to perform some action on a specified device, such a read or write. Orders are sent as part of the data stream to control the format of the device buffer. The following description applies to the 3271, 3272, and 3275 control units. Later models of 3270 have additional capabilities. Commands[edit] Command hexadecimal Code (local) Function[2] Write 01 Writes data to the device Erase/Write 05 Erases device buffer and writes data Read Buffer 02 Reads entire device buffer, for example always 1920 bytes on a 3277-2 Read Modified 06 Reads only modified data from device Copy N/A (Remote only) Copies data from one device buffer to another, for example from a display to a printer attached to the same control unit Select 0B Transfers data from device to control unit Erase All Unprotected 0F Erases all unprotected data and resets modified data tags No Operation 03 May be used to retrieve pending status Sense 04 Retrieves error information after unit check For remote 3270s non-significant bits are set so that the command forms a valid EBCDIC (or ASCII) character. Write",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}