{
    "relation": [
        [
            "",
            "GRID 2",
            "1024x768 Ultra Low Preset",
            "1366x768 Medium Preset",
            "1366x768 High Preset AA:2xMS",
            "1920x1080 Ultra Preset AA:4xMS",
            "BioShock Infinite",
            "1280x720 Very Low Preset",
            "1366x768 Medium Preset",
            "1366x768 High Preset",
            "1920x1080 Ultra Preset, DX11 (DDOF)",
            "Total Average (Program / Settings)"
        ],
        [
            "MSI CX61-i572M GeForce GT 720M, 4200M, WDC Scorpio Blue WD10JPVX-22JC3T0",
            "",
            "105.4",
            "53.8",
            "36.5",
            "12.5",
            "",
            "55.7",
            "30.5",
            "25.5",
            "7.4",
            ""
        ],
        [
            "Acer Aspire V5-573G-54208G50aii GeForce GT 750M, 4200U, Seagate Momentus Thin ST500LT0 12-9WS142",
            "41%",
            "124 18%",
            "79 47%",
            "57 56%",
            "18 44%",
            "68%",
            "86.12 55%",
            "51.18 68%",
            "43.62 71%",
            "13.18 78%",
            "55% / 55%"
        ],
        [
            "Lenovo G710 59397112 GeForce GT 720M, 4702MQ, Seagate Momentus SpinPoint M8 ST1000LM024 HN-M101MBB",
            "",
            "",
            "",
            "",
            "",
            "1%",
            "56.3 1%",
            "30.7 1%",
            "25.7 1%",
            "",
            "1% / 1%"
        ],
        [
            "Toshiba Satellite P70-A-104 HD Graphics 4600, 4700MQ, HGST Travelstar 5K1000 HTS541010A9E680",
            "-23%",
            "84.5 -20%",
            "43.9 -18%",
            "25.3 -31%",
            "",
            "",
            "",
            "",
            "",
            "",
            "-23% / -23%"
        ]
    ],
    "pageTitle": "Review MSI CX61-i572M281BW7 Notebook - NotebookCheck.net Reviews",
    "title": "",
    "url": "http://www.notebookcheck.net/Review-MSI-CX61-i572M281BW7-Notebook.109993.0.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 51,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00336-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 633198555,
    "recordOffset": 633125588,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{26247=The contrast ratio of 653:1 is good, and considerably higher than on the predecessor model. At 0.38 cd/m², the black value is also pleasantly rich. Black appears nice and bold in dark scenes., 59327=Inside, however, our test device has certainly changed. A new Intel Core i5-4200M now plays the role of processor, and an Nvidia GeForce GT 720M takes on graphics tasks. The working memory was expanded to 8 GB, and the hard drive capacity doubled to 1000 GB. Additionally, the panel now has HD resolution and a matte surface. In short, MSI definitely made some alterations. At 649 Euros (~$880), the notebook's cost is a little higher, but considering its hardware features, the new price tag is reasonable., 54982=The MSI CX61-i572M's case measures 383 x 249.5 x 37.6 millimeters (width x depth x height; ~15.1 x 9.8 x 1.5 inches) -- same as its predecessor. Considering that they share the same barebone, this is not particularly surprising. The manufacturer lists the device's weight at 2.4 kg (~5.3 lbs) without a battery. With the battery, the notebook weighs in at 2564 grams (~5.7 lbs)., 32007=In our review of the predecessor model, the CX61's display was a major point of criticism. In that case, MSI did not select the reliable Full HD panel from the GE 60 line, but instead an HD screen from Samsung. Our current test device, however, possesses a display from the same series as in the GE60-i789W7H from LG-Philips. It has a resolution of 1920x1080 pixels (Full HD) and a matte surface. The 15.6-inch panel's aspect ratio comes to 16:9, and at 141 PPI, its pixel density is respectable. Now the device has all the necessary features for displaying HD films.}",
    "TableContextTimeStampAfterTable": "{190539=The Nvidia GeForce GT 720M is a DirectX 11 GPU from the lower middle class. It can draw from 2048 MB of its own DDR3 storage and is somewhat faster than the integrated graphics solution. The big advantage of this supplementary GPU is that it takes a load off of the processor, which mobilizes additional performance reserves., 69388=PCMark 8 confirms our subjective experience. Compared to its immediate competition, our review device's Home score of 2966 points is only surpassed by the Lenovo Z510 (3091 points) and the HP Envy 15 (3127 points), both of which possess a somewhat stronger GPU. The potency of the GPU happens to tip the scales in this particular case. In the Work and Creative disciplines, the system does not do quite as well. The working memory's single-channel mode is mainly at fault for this, as the computer loses performance without a dual-channel mode., 119680=A conventional, mechanical HDD serves as the notebook's hard drive. The WDC Scorpio Blue WD10JPVX-22JC3T0 rotates at 5400 rpm and has 1000 GB of storage space. Around 870 GB remains available to the user after the first system start. The drive is split into three partitions: 552 GB (system), 368 GB (data) and 11.5 GB (recovery)., 189609=The MSI CX61-i572M has two graphics units at its command. For everyday tasks, the Intel HD Graphics 4600's IGP takes the orders. It clocks at a maximum of 1150 MHz and supports Intel's QuickSync. This GPU obtains its storage from the RAM, which is why the RAM's single-channel mode causes a loss in performance here. This is not a huge problem, however, because Nvidia's Optimus technology hands over more demanding graphics computations to the dedicated graphics unit.}",
    "lastModified": "Sun, 02 Aug 2015 06:46:00 GMT",
    "textBeforeTable": "In any case, the display certainly does nothing to spoil the game. We did not observe any streaking. In comparison with the Nvidia GeForce GT 750M, like we find in the Aspire V5-573G (Core i5-4200U, 1.6 GHz), the CX61's dedicated CPU has substantially less computing power. The competing model achieves considerably higher frame rates in our benchmarks. The CX61's stronger CPU makes little difference here. In the CPU-heavy title Grid 2, the MSI notebook comes in at an average of 41% behind the competing device from Acer. The processor is required the most in the low preset, and here the numbers lie closer together, but the V5-573G is still around 18% faster. In games that demand a lot from the GPU, like BioShock Infinite, the difference is even more pronounced. Here the Acer notebook is an average of 68% quicker. The notebook's gaming performance is generally only sufficient for playing current games at a reduced resolution and lower details. Hardware-intensive titles, like Company of Heroes 2, do not run fluidly even at the lowest possible settings. Less demanding games, however, play quite well even at medium detail settings. Casual gamers will certainly be able to enjoy this little GPU. Gaming Performance",
    "textAfterTable": "low med. high ultra BioShock Infinite (2013) 55.7 30.5 25.5 7.4 fps GRID 2 (2013) 105.4 53.8 36.5 12.5 fps Company of Heroes 2 (2013) 21.1 16.3 9 4.1 fps Fifa 14 (2013) 137.7 69.9 fps Batman: Arkham Origins (2013) 70 39 18",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}