{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "#",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Title",
            "Mayo Alanen & Michelle Officer",
            "Mazen Hamza & Izabella Jundzill",
            "Slawek Sochacki & Marzena Stachura",
            "Smooth Q & A Session",
            "Jeannie & Charlie Penatello",
            "Nick & Lena Kosovich",
            "Michael Mead",
            "Tomas Mielnicki & JT Thomas"
        ],
        [
            "Time",
            "27:30",
            "31:46",
            "29:24",
            "21:03",
            "29:01",
            "29:01",
            "24:38",
            "27:00"
        ],
        [
            "Price",
            "$6.99",
            "$6.99",
            "$6.99",
            "$6.99",
            "$6.99",
            "$6.99",
            "$6.99",
            "$6.99"
        ],
        [
            "Points",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Browse by Instructors - New Arrivals - Store - The American Style Congress 2012 - Smooth - Dancevision",
    "title": "",
    "url": "https://dancevision.com/store/browse-by-instructors/new-arrivals/MASCS/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00271-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 869978539,
    "recordOffset": 869964666,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{8139=On February 24th, 2012 the world's top American Style dancers and coaches descended upon New York City, the dance capital of the world, to share their experience and ability of dance techniques and artistry. Their inspired performances and lively discussions about the future of American Style dancing are presented in this exclusive release.}",
    "textBeforeTable": "Individual Steps Please note: Our online videos are streamed live. They cannot be downloaded to your computer or portable electronic device. Buy individual steps below Purchase individual steps and watch them online instantly. Learn as you go or brush up on a figure you may have forgotten. Your online media is stored in your video Library and can be accessed from any device (computer, phone, IPad, etc.) by logging into your Dance Vision Internet account. Instantly watch the full DVD in digital format. Your online media is stored in your video Library and can be accessed from any device (computer, phone, IPad, etc.) by logging into your Dance Vision Internet account. Does not qualify Watch online only Instantly watch the full DVD in digital format. Your online media is stored in your video Library and can be accessed from any device (computer, phone, IPad, etc.) by logging into your Dance Vision Internet account. $49.00 Watch online only Two ways to buy!",
    "textAfterTable": "Return to the top of the page Shop all categories Video Lessons Last Chance American Style Rhythm American Style Smooth Salsa New Arrivals Anyone Can Dance DVIDA Syllabus American Rhythm American Smooth International Latin International Standard Social & Club Dances Country-Western Get DVIDA Certified American Style Cha Cha Rumba Samba Bolero East Coast Swing West Coast Swing Merengue Mambo Waltz Foxtrot Tango Viennese Waltz Peabody International Style Cha Cha Samba Rumba Paso Doble Jive Waltz Foxtrot Tango Quickstep Viennese Waltz Social & Club Dances Argentine Tango Salsa Night Club Two-Step Bachata Hustle Jitterbug/Lindy Hop Line Dancesport Country-Western Specialty DVDs Rhythm/Latin Technique & Exercises Smooth/Standard Technique & Exercises Dips, Drops, Lifts & Tricks Dance Vision Mastery",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}