{
    "relation": [
        [
            "Cited Patent",
            "US3448822 *",
            "US3710383 *",
            "US3725921 *",
            "US3766554 *",
            "US3778826 *"
        ],
        [
            "Filing date",
            "Jun 23, 1966",
            "Sep 2, 1970",
            "Nov 4, 1970",
            "Mar 1, 1971",
            "Sep 25, 1972"
        ],
        [
            "Publication date",
            "Jun 10, 1969",
            "Jan 9, 1973",
            "Apr 3, 1973",
            "Oct 16, 1973",
            "Dec 11, 1973"
        ],
        [
            "Applicant",
            "Micro Electronics Intern Inc",
            "Ford Motor Co",
            "Bendix Corp",
            "Bendix Corp",
            "Pierson M"
        ],
        [
            "Title",
            "Vehicle anti-collision automatic control-system",
            "Automatic headway control system",
            "Traffic responsive speed control system",
            "Range cutoff system for dual frequency cw radar",
            "Anti-collision vehicular radar system"
        ]
    ],
    "pageTitle": "Patent US3978481 - Anti-collision vehicular radar system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US3978481?dq=6948823",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986615.83/warc/CC-MAIN-20150728002306-00027-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 456850431,
    "recordOffset": 456824084,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{36975=The phase displaced signals from the sidearms of the magic tee 18 couple, respectively, to crystal detectors 21 and 22. The output from these crystal detectors in turn couple to the demultiplexer 20. The crystal detectors 21 and 22 are actually mounted in the sidearms of the asymmetrical magic tee. These devices may be conventional square law detectors. There are several components to the detected output. Reference is made here to Electronics by Thomas Benjamin Brown; John Wiley and Sons, 1954, page 400. The above reference will show that all components of the detector output are high frequency of the RF type except for one component. The single component which is not RF is the relatively low frequency which is the difference between the transmitted frequency and the received frequency. This is referred to as the Doppler frequency., 27745=U.S. Pat. No. 3,778,826 which is assigned to the assignee of the present application, teaches the use of an asymmetrical magic tee in an anti-collision vehicular radar system to provide phase information that can be readily detected to determine whether there is an opening or closing between the vehicle and obstacle which may be another vehicle. Work has also been accomplished by James E. Stevens and Louis L. Nagy as set forth in a paper entitled \"Diplex Doppler Radar For Automotive Obstacle Detection\" presented at the IEEE Vehicular Technology Group Conference on Dec. 6th, 1972, in Dallas Texas. This report analyzes the diplex Doppler technique which requires the use of two slightly different RF frequencies which are similarly transmitted by the radar, reflected off the vehicle, received by the radar and each mixed with its corresponding transmitted signal. An interesting relationship is found to exist wherein there is a phase difference between the signals of different RF frequencies which is a function of the exact difference frequency and more importantly the range from the vehicle to the obstacle.}",
    "textBeforeTable": "Patent Citations Having described one system in accordance with this invention it should now become apparent to those skilled in the art that numerous modifications can be made therein all of which are contemplated as falling within the scope of this invention as defined by the appended claims. There are probably a number of different apparatus that could be employed for operating the brakes from the circuitry shown in FIG. 2F. U.S. Pat. No. 3,778,862 shows one arrangement that can be used. FIG. 2E shows one embodiment for the oscillator 19 and also shows the power supply 11 which comprises an integrated circuit sold by RCA and identified as their LM 723. The switching power supply 12 also comprises a similar integrated circuit having associated therewith biasing circuitry 12A including transistors 12B and 12C and associated resistors. When the 100 kilohertz signal from oscillator 19 is at its high level transistor 12B is conductive and the voltage divider 12A is in a first condition wherein a predetermined bias voltage is provided by way of line 12D to the Gunn oscillator 14 shown in FIG. 1. When the signal to the base of transistor 12B goes to ground this transistor turns off and the voltage divider assumes a different condition changing the bias level on line 12D so that the oscillator now oscillates at a slightly different frequency. As indicated previously, the bias is adjusted so that the frequency",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4073359 * Dec 6, 1976 Feb 14, 1978 Nissan Motor Company, Limited Braking system for avoiding a collision of a vehicle with an obstacle thereof US4104632 * Nov 9, 1976 Aug 1, 1978 Nissan Motor Company, Limited System for preventing collision of vehicles US4308536 * Feb 26, 1979 Dec 29, 1981 Collision Avoidance Systems Anti-collision vehicular radar system US4543577 * Jun 15, 1982 Sep 24, 1985 Nissan Motor Company, Limited Moving obstacle detection system for a vehicle US4740045 * Jul 2, 1986 Apr 26, 1988 Goodson & Associates, Inc. Multiple parameter doppler radar US4893125 * Nov 1, 1988 Jan 9, 1990 Delco Electronics Corporation Vehicle diplex doppler",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}