{
    "relation": [
        [
            "Date",
            "Sep 18, 2000",
            "Nov 15, 2004",
            "Aug 26, 2005",
            "Oct 17, 2008",
            "Oct 2, 2009",
            "Oct 30, 2009",
            "May 7, 2012",
            "Jul 3, 2012"
        ],
        [
            "Code",
            "FPAY",
            "FPAY",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: CITICORP NORTH AMERICA, AS ADMINISTRATIVE AGENT, I Free format text: PATENT SECURITY AGREEMENT;ASSIGNORS:ACCO BRANDS CORPORATION, A DELAWARE CORPORATION;ACCO BRANDS USALLC, A DELAWARE LIMITED LIABILITY COMPANY BOONE INTERNATIONAL, INC., A CALIFORNIA CORPORATION GENERAL BINDING CORPORATION, A DELAWARE CORPORATION;BOONE INTERNATIONAL, INC., A CALIFORNIA CORPORATION;AND OTHERS;REEL/FRAME:016914/0813 Effective date: 20050817",
            "Year of fee payment: 12",
            "Owner name: ACCO BRANDS CORPORATION,ILLINOIS Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:CITICORP NORTH AMERICA, INC.;REEL/FRAME:023312/0784 Effective date: 20090930 Owner name: ACCO BRANDS USA LLC,ILLINOIS Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:CITICORP NORTH AMERICA, INC.;REEL/FRAME:023312/0784 Effective date: 20090930 Owner name: BOONE INTERNATIONAL, INC.,ILLINOIS Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:CITICORP NORTH AMERICA, INC.;REEL/FRAME:023312/0784 Effective date: 20090930 Owner name: GENERAL BINDING CORPORATION,ILLINOIS Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:CITICORP NORTH AMERICA, INC.;REEL/FRAME:023312/0784 Effective date: 20090930 Owner name: U.S. BANK NATIONAL ASSOCIATION,ILLINOIS Free format text: SECURITY AGREEMENT;ASSIGNORS:ACCO BRANDS CORPORATION;ACCO BRANDS USA LLC;DAY-TIMERS INC.;AND OTHERS;REEL/FRAME:023312/0902 Effective date: 20090930",
            "Owner name: DEUTSCHE BANK AG NEW YORK BRANCH,NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNORS:ACCO BRANDS CORPORATION;ACCO BRANDS USA LLC;DAY-TIMERS INC.;AND OTHERS;REEL/FRAME:023449/0180 Effective date: 20090930",
            "Owner name: ACCO BRANDS CORPORATION, ILLINOIS Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:DEUTSCHE BANK AG NEW YORK BRANCH, AS COLLATERAL AGENT;REEL/FRAME:028168/0738 Effective date: 20120430 Owner name: ACCO BRANDS CORPORATION, ILLINOIS Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:U.S. BANK NATIONAL ASSOCIATION, AS COLLATERAL TRUSTEE;REEL/FRAME:028168/0713 Effective date: 20120430",
            "Owner name: ACCO BRANDS CORPORATION, ILLINOIS Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE MISSING ASSIGNEES ON THE RELEASE OF SECURITY INTEREST IN PATENTS PREVIOUSLY RECORDED ON REEL 028168 FRAME 0738. ASSIGNOR(S) HEREBY CONFIRMS THE ASSIGNEES ACCO BRANDS USA LLC, AND GENERAL BINDING CORPORATION ARE ADDITIONAL ASIGNEES;ASSIGNOR:DEUTSCHE BANK AG NEW YORK BRANK, AS COLLATERAL AGENT;REEL/FRAME:028488/0056 Effective date: 20120430 Owner name: GENERAL BINDING CORPORATION, ILLINOIS Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE MISSING ASSIGNEES ON THE RELEASE OF SECURITY INTEREST IN PATENTS PREVIOUSLY RECORDED ON REEL 028168 FRAME 0738. ASSIGNOR(S) HEREBY CONFIRMS THE ASSIGNEES ACCO BRANDS USA LLC, AND GENERAL BINDING CORPORATION ARE ADDITIONAL ASIGNEES;ASSIGNOR:DEUTSCHE BANK AG NEW YORK BRANK, AS COLLATERAL AGENT;REEL/FRAME:028488/0056 Effective date: 20120430 Owner name: ACCO BRANDS CORPORATION, ILLINOIS Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE THE MISSING ASSIGNEES ON THE RELEASE OF SECURITY INTEREST IN PATENTS PREVIOUSLY RECORDED ON REEL 028168 FRAME 0713. ASSIGNOR(S) HEREBY CONFIRMS THE ASSIGNEES ACCO BRANDS USA LLC AND GENERAL BINDING CORPORATION ARE ADDITIONAL ASSIGNEES;ASSIGNOR:U.S. BANK NATIONAL ASSOCIATION, AS COLLATERAL TRUSTEE;REEL/FRAME:028487/0671 Effective date: 20120430 Owner name: ACCO BRANDS USA LLC, ILLINOIS Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE THE MISSING ASSIGNEES ON THE RELEASE OF SECURITY INTEREST IN PATENTS PREVIOUSLY RECORDED ON REEL 028168 FRAME 0713. ASSIGNOR(S) HEREBY CONFIRMS THE ASSIGNEES ACCO BRANDS USA LLC AND GENERAL BINDING CORPORATION ARE ADDITIONAL ASSIGNEES;ASSIGNOR:U.S. BANK NATIONAL ASSOCIATION, AS COLLATERAL TRUSTEE;REEL/FRAME:028487/0671 Effective date: 20120430 Owner name: ACCO BRANDS USA LLC, ILLINOIS Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE MISSING ASSIGNEES ON THE RELEASE OF SECURITY INTEREST IN PATENTS PREVIOUSLY RECORDED ON REEL 028168 FRAME 0738. ASSIGNOR(S) HEREBY CONFIRMS THE ASSIGNEES ACCO BRANDS USA LLC, AND GENERAL BINDING CORPORATION ARE ADDITIONAL ASIGNEES;ASSIGNOR:DEUTSCHE BANK AG NEW YORK BRANK, AS COLLATERAL AGENT;REEL/FRAME:028488/0056 Effective date: 20120430 Owner name: GENERAL BINDING CORPORATION, ILLINOIS Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE THE MISSING ASSIGNEES ON THE RELEASE OF SECURITY INTEREST IN PATENTS PREVIOUSLY RECORDED ON REEL 028168 FRAME 0713. ASSIGNOR(S) HEREBY CONFIRMS THE ASSIGNEES ACCO BRANDS USA LLC AND GENERAL BINDING CORPORATION ARE ADDITIONAL ASSIGNEES;ASSIGNOR:U.S. BANK NATIONAL ASSOCIATION, AS COLLATERAL TRUSTEE;REEL/FRAME:028487/0671 Effective date: 20120430"
        ]
    ],
    "pageTitle": "Patent US5628483 - Wrist rest - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5628483?ie=ISO-8859-1&dq=U.S.+Patent+",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987775.70/warc/CC-MAIN-20150728002307-00102-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478105851,
    "recordOffset": 478083048,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39707=FIG. 2A shows an extension pad 2, with only two layers--a surface layer 10 and a support layer 20. The support layer is made as thick as the combined support and base layers of the example of FIG. 1. Surface layer 10 could conceivably be left out as well, provided that the surface of the support layer was smooth and slick enough to allow a user's hand to slide freely across it. An interlocking contour 100 is provided so that the extension pad may be joined with a wrist rest, such as in FIG. 3, which shows extension pad 2 joined to a wrist rest 3. In this embodiment, the radius of curvature of the corners is 3/4 inches; the radius of curvature of the arcs used to define interlocking contour 100 is also 3/4 inches. FIG. 2B illustrates in more detail interlocking contour 100. Contour 100 is a composite of three arc segments from circles 1000, 2000, and 3000. The radius of curvature of each of these circles is about 3/4 inches. Circle 1000 joins the side of pad 2 at a point indicated by segment A--A, therefore having its center 3/4\" left of that point of joinder. Circle 2000 has its center about 13/16 inches left of and about 113/16 inches above the center of circle 1000. Circle 3000 has its center about 23/8 inches directly above the center of circle 1000. These distances are approximate; the circles should meet tangentially at the points indicated by segments B--B and C--C. An arc segment 1100 extends around the lesser portion of circle 1000 from A--A to B--B, where it joins an arc segment 2100. Arc segment 2100 extends around the greater portion of circle 2000 from B--B to C--C, where it joins an arc segment 3100, which extends around the lesser portion of circle 3000 from C--C to D--D. Arc Segments 1100, 2100 and 3100 together form interlocking contour 100., 23676=This application is a continuation of Ser. No. 255,581, Jun. 8 1994, now abandoned, which is a continuation in part application of U.S. patent application Ser. No. 08/006,225, filed Jan. 19, 1993, U.S. Pat. No. 5,358,203 which is a continuation application of U.S. patent application Ser. No. 07/690,742, filed Apr. 24, 1991 and which issued as U.S. Pat. No. 5,197,699.}",
    "textBeforeTable": "Patent Citations It is to be understood that the above description is intended to be illustrative and not restrictive. Many embodiments will be apparent to those of skill in the art upon reviewing the above description. For instance, the interlocking contours could be formed in a dovetail shape. The scope of the invention should, therefore, be determined with reference to the appended claims, along with the full scope of equivalents to which such claims are entitled. The anchor plate 254 can be constructed essentially identical to the anchor plate described in connection with FIG. 11. In another aspect, the anchor plate 254 will preferably be sandwiched between layers of neoprene rubber 262 which serve to prevent the anchor plate 254 from scratching a desktop or other work surface. A notebook wrist rest 250 is shown in FIG. 16. The notebook wrist rest 250 is preferably used with a notebook computer 252. The notebook wrist rest 250 includes an anchor plate 254 and a wrist rest 256. The notebook wrist rest 250 can be configured to be essential identical to the wrist rest described in connection with FIG. 11, except for being sized to the dimensions of the notebook computer 252. When configured like the wrist rest of FIG. 11, the wrist rest 256 includes a low friction layer 258, a support layer 260, and a base layer (not shown) below the support layer 260. Alternatively, the wrist rest",
    "textAfterTable": "19 * Brochure for Wrist Supports, M&M Industries. 20 * Brochure for Wristonics, Marcus Franklin & Associates. * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5826841 * Mar 18, 1997 Oct 27, 1998 Lavore; Joseph S. Therapeutic elbow support system US5845884 * Jul 10, 1996 Dec 8, 1998 Terbrack; William H. Ergonomic tower support device for using data entry systems US5927662 * May 30, 1997 Jul 27, 1999 Haworth, Inc. Keyboard support with multi-positional mouse pad US6000665 * May 15, 1998 Dec 14, 1999 Clementson; David Support device and method for use with a miniature electronic device US6003446 * Dec 28, 1998 Dec 21, 1999 Leibowitz;",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}