{
    "relation": [
        [
            "Cited Patent",
            "US4094704 *",
            "US4295002 *",
            "US4400868 *",
            "US4547622 *",
            "JPS58220475A *"
        ],
        [
            "Filing date",
            "May 11, 1977",
            "Jun 23, 1980",
            "Feb 24, 1982",
            "Apr 27, 1984",
            ""
        ],
        [
            "Publication date",
            "Jun 13, 1978",
            "Oct 13, 1981",
            "Aug 30, 1983",
            "Oct 15, 1985",
            ""
        ],
        [
            "Applicant",
            "Milnes Arthur G",
            "International Business Machines Corporation",
            "Varian Associates, Inc.",
            "Massachusetts Institute Of Technology",
            ""
        ],
        [
            "Title",
            "Dual electrically insulated solar cells",
            "Heterojunction V-groove multijunction solar cell",
            "Method of making a transparent and electrically conductive bond",
            "Solar cells and photodetectors",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US4681982 - Light-electricity conversion semiconductor device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4681982?dq=mirroring+data+in+a+remote+data+storage+system",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00087-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476516668,
    "recordOffset": 476500733,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations As is evident from the foregoing description, according to the present invention, a zinc selenide layer is inserted between the silicon region and the Group III-V compound semiconductor region, thereby enabling transmission of light of that wavelength region which is required for the light-electricity conversion at the pn junction of the silicon region, and improving the crystallinity of the Group III-V compound semiconductor region, resulting in the enhancement of the overall light-electricity conversion efficiency. Furthermore, although electrode 7 is directly connected to the p-GaAs layer 5 in FIG. 1, there arises a resistance in the transverse direction between the electrode 7 and the portions of the p-GaAs layer 5 where the electrode 7 does not exists. In order to avoid this, a p-Alx Ga1-x As layer 13 which comprises material having a light absorption band edge at the shorter wavelength side than the layer 5 and having a small resistivity may be formed on the p-GaAs layer 5, as shown in FIG. 8. In the illustrated embodiment, the Si region 9 overlies the substrate 1, but the Group III-V compound semiconductor region 10 may also overlie the substrate 1 as shown in FIG. 7. In this case, however, the substrate 1 comprises a material such as ZnSe having an absorption band edge at the shorter wavelength side than GaAs, Alx Ga1-x As, Si, and light such as sun light is projected from below in the figure.",
    "textAfterTable": "* Cited by examiner Non-Patent Citations Reference 1 \"First Results on the Development of a Thin Film CdSe MIS Solar Cell\", by D. Bonnett, Photovoltaic Solar Energy Conference, Sep. 27-30, 1977, pp. 631-637 (Reidel Publishing Co.). 2 \"Stacked Multiple-Bandgap Solar Cells Prepared by CVD Techniques\", by R. D. Dupuis et al, Fourteenth IEEE Photovoltaic Specialists Conference (1980) pp. 1388-1389. 3 * First Results on the Development of a Thin Film CdSe MIS Solar Cell , by D. Bonnett, Photovoltaic Solar Energy Conference, Sep. 27 30, 1977, pp. 631 637 (Reidel Publishing Co.). 4 John C. C. Fan et al, \"GaAs/Ge/Si Solar Cells\", Proc. 17th IEEE Photovoltaic Specialists Conf., pp. 440-444 (1984). 5 John C. C. Fan et al, \"Optimal Design of High-Efficiency Tandem Cells\", Proc. 16th IEEE Photovoltaic Specialists Conf., pp. 692-701 (1982). 6 * John C. C. Fan et al, GaAs/Ge/Si Solar Cells , Proc. 17 th IEEE Photovoltaic Specialists Conf., pp. 440 444 (1984).",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}