{
    "relation": [
        [
            "Date",
            "Aug 29, 2002",
            "Jul 24, 2003",
            "Aug 4, 2008",
            "Jan 26, 2009",
            "Jan 26, 2009",
            "Dec 15, 2010",
            "Feb 1, 2012"
        ],
        [
            "Code",
            "AS",
            "AS",
            "REMI",
            "FPAY",
            "SULP",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Surcharge for late payment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: BARZELL-WHITMORE MAROON BELLS, INC., FLORIDA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:BARZELL, WINSTON E.;WHITMORE, WILLET F.;UCCELLO, SALVATORE A.;AND OTHERS;REEL/FRAME:013252/0507;SIGNING DATES FROM 20020812 TO 20020814",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "Owner name: CIVCO MEDICAL INSTRUMENTS CO., INC., IOWA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:BARZELL WHITMORE MAROON BELLS, INC. A/K/A BARZELL-WHITMORE MAROON BELLS, INC.;REEL/FRAME:025504/0596 Effective date: 20070913",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US6846315 - Template grid - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6846315?dq=6,247,130",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00252-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473735995,
    "recordOffset": 473720035,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13048=This application claims the benefit of provisional application No. 60/294,555, filed Jun. 1, 2001, which application is incorporated by reference herein.}",
    "textBeforeTable": "Patent Citations The present invention also encompasses frames that have types and/or arrangements of protrusions that differ from frame 12 as shown and described herein. Therefore, this invention is not to be limited to only the specifically preferred embodiments depicted herein. Further, it should be understood that variations and modifications within the spirit and scope of the invention may occur to those skilled in the art to which the invention pertains. Accordingly, all expedient modifications readily attainable by one versed in the art from the disclosure set forth herein that are within the scope and spirit of the present invention are to be included as further embodiments of the present invention. The first and second protrusions are examples of network supports for supporting or securing a wire network, such as one formed by suture 16, with respect to frame 12. Tabs 20 are the second type of protrusions. Once suture 16 is lodged into one of the cleats 18, suture 16 is pulled across frame 12 and around one of tabs 20. This procedure is repeated so that if suture 16 is pulled with sufficient tension, a set of parallel lines is formed with suture 16. When one complete set of rows is completed, corner tab 20 includes a curved edge and facilitates a transition in suture direction. Specifically, suture 16 is pulled around corner tab 22 so that a second set of suture lines,",
    "textAfterTable": "US5098383 Feb 8, 1990 Mar 24, 1992 Artifax Ltd. Device for orienting appliances, prostheses, and instrumentation in medical procedures and methods of making same US5242373 Sep 17, 1991 Sep 7, 1993 Scott Walter P Medical seed implantation instrument US5590655 * Dec 15, 1994 Jan 7, 1997 Hussman; Karl L. Frameless laser guided stereotactic localization system US5678549 Jul 29, 1993 Oct 21, 1997 Siemens Aktiengesellschaft Stereotactic auxiliary attachment for a nuclear magnetic resonance tomography apparatus US5681327 Nov 29, 1995 Oct 28, 1997 Siemens Aktiengesellschaft Stereotactic auxiliary means for tomogram-guided implementation of a biopsy US5702405 Nov 29, 1995 Dec 30, 1997 Siemens Aktiengesellschaft Stereotactic auxiliary attachment for a tomography apparatus for tomogram guided implementation of a biopsy US5769779 Apr 27, 1995 Jun 23, 1998 Radiology Support Devices, Inc. Method and apparatus for accurate radiation dosage control in breast cancer treatment US5794628 * Jan 31, 1997",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}