{
    "relation": [
        [
            "Date",
            "Jan 27, 1986",
            "Oct 30, 1990",
            "Jan 28, 1992",
            "Feb 8, 1993",
            "Mar 18, 1994",
            "Feb 24, 1997",
            "Feb 15, 2001"
        ],
        [
            "Code",
            "AS",
            "RR",
            "B1",
            "FPAY",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Request for reexamination filed",
            "Reexamination certificate first reexamination",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: APPLIED MEDICAL TECHNOLOGY, INC. 6551 BRECKSVILLE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:PICHA, GEORGE J.;SIEDLAK, DENNIS;REEL/FRAME:004514/0957;SIGNING DATES FROM 19851225 TO 19851229 Owner name: APPLIED MEDICAL TECHNOLOGY, INC., 6551 BRECKSVILLE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:GAUDERER, MICHAEL L.;REEL/FRAME:004513/0751 Effective date: 19860117",
            "Effective date: 19900921",
            "",
            "Year of fee payment: 4",
            "Owner name: APPLIED MEDICAL RESEARCH, INC., OHIO Free format text: ASSIGNMENT OF PATENT RIGHTS;ASSIGNOR:APPLIED MEDICAL TECHNOLOGY, INC.;REEL/FRAME:006898/0878 Effective date: 19940307",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US4863438 - Low profile gastrostomy device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4863438?dq=6948823",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00093-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480923243,
    "recordOffset": 480896097,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although the invention has been shown and described with respect to a certain preferred embodiment, it is obvious that equivalent alterations and modifications will occur to others skilled in the art upon the reading and understanding of the specification. The present invention includes all such equivalent alterations and modifications, and is limited only by the scope of the claims. From the foregoing, it will be apparent that the device of the present invention is easily inserted and self-retaining, with the outer end of the device remaining substantially flush with the skin. Because of the device's low profile, the device is not noticeable beneath the clothes of a patient and is not painful to wear. Also, there is little risk of dislodgement of the device, and the device is easy to use. Furthermore, the material of the device is minimally irritating to the skin, and if irritation should start to occur due to other causes, the device can easily be rotated a part turn to cause the retention wings to engage another portion of the skin that was previously exposed. Moreover, the device can be inserted into other viscera of the body for other applications as well, including, for example, urinary bladder drainage, ileostomy, jejunostomy, and cystostomy. The integrally molded wings 24, 25 at the axial outer end of the tube have a wall thickness of approximately 0.125 inch, a width of approximately 0.400 inch, and a",
    "textAfterTable": "Gastrostomy feeding port US5007900 * Oct 31, 1989 Apr 16, 1991 Applied Medical Technology, Inc. Percutaneous endoscopic gastrostomy device US5084014 * Dec 13, 1990 Jan 28, 1992 Applied Medical Technology, Inc. Package for initial placement of low profile gastrostomy device and method of placement US5092850 * Nov 29, 1990 Mar 3, 1992 Buma Shelley J Catheter with adjustable external locking bolster US5112310 * Feb 6, 1991 May 12, 1992 Grobe James L Apparatus and methods for percutaneous endoscopic gastrostomy US5125897 * Apr 27, 1990 Jun 30, 1992 Corpak, Inc. Gastrostomy device with one-way valve and cuff pin US5167644 * Feb 19, 1991 Dec 1, 1992 Fischell Robert Manually sealable introducer sheath US5213567 * Dec 19, 1990 May 25, 1993 Nobuyuki Masaki Device for preventing abrasive injury from skin and",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}