{
    "relation": [
        [
            "Citing Patent",
            "US8220464",
            "US8277447",
            "US8298232",
            "US8469956",
            "US8561615",
            "US8939973",
            "US8945126",
            "US8945127",
            "US9005200 *",
            "US9039694",
            "US20040250419 *",
            "US20040254573 *",
            "US20050004568 *",
            "US20120083785 *",
            "US20140005662 *",
            "WO2008058056A2 *",
            "WO2014004246A1 *"
        ],
        [
            "Filing date",
            "Nov 5, 2007",
            "Nov 18, 2009",
            "",
            "Jul 21, 2008",
            "Jul 3, 2012",
            "Nov 27, 2013",
            "Nov 27, 2013",
            "Jan 23, 2014",
            "Sep 30, 2010",
            "Oct 20, 2011",
            "Jun 13, 2003",
            "Jun 13, 2003",
            "Apr 6, 2001",
            "",
            "Jun 28, 2012",
            "Nov 5, 2007",
            "Jun 20, 2013"
        ],
        [
            "Publication date",
            "Jul 17, 2012",
            "Oct 2, 2012",
            "Oct 30, 2012",
            "Jun 25, 2013",
            "Oct 22, 2013",
            "Jan 27, 2015",
            "Feb 3, 2015",
            "Feb 3, 2015",
            "Apr 14, 2015",
            "May 26, 2015",
            "Dec 16, 2004",
            "Dec 16, 2004",
            "Jan 6, 2005",
            "Apr 5, 2012",
            "Jan 2, 2014",
            "May 15, 2008",
            "Jan 3, 2014"
        ],
        [
            "Applicant",
            "Pannell William P",
            "Covidien Ag",
            "Tyco Healthcare Group Lp",
            "Covidien Lp",
            "William P. Pannell",
            "Covidien Ag",
            "Covidien Ag",
            "Covidien Ag",
            "Covidien Lp",
            "Just Right Surgical, Llc",
            "Sremcich Paul S.",
            "Dycus Sean T.",
            "Lawes Kate R.",
            "Roy Jeffrey M",
            "Ethicon Endo-Surgery, Inc.",
            "William Pannell",
            "Ethicon Endo-Surgery, Inc."
        ],
        [
            "Title",
            "Vasectomy devices and kit and method of use",
            "Single action tissue sealer",
            "Endoscopic vessel sealer and divider for large tissue structures",
            "Variable resistor jaw",
            "Vasectomy devices, kits, and methods of using same",
            "Single action tissue sealer",
            "Single action tissue sealer",
            "Single action tissue sealer",
            "Vessel sealing instrument",
            "RF generator system for surgical vessel sealing",
            "Method of manufacturing jaw assembly for vessel sealer and divider",
            "Vessel sealer and divider for use with small trocars and cannulas",
            "Electrosurgical instrument reducing thermal spread",
            "Vessel Sealing Instrument",
            "Multi-axis articulating and rotating surgical tools",
            "Vasectomy devices and kit and method for use",
            "Surgical end effectors having angled tissue-contacting surfaces"
        ]
    ],
    "pageTitle": "Patent US20050101952 - Vessel sealing wave jaw - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20050101952?dq=5,815,794",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00331-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475140063,
    "recordOffset": 475115546,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{49043=Handle portion 18 may also include a rotation knob 24 for controlling the rotational movement of the end effector assembly 22 about a longitudinal axis “A” of the elongated shaft 12. Preferably, the ratio of rotation of the knob 24 to the end effector assembly 22 is 1:1, however, it is contemplated that gearing structure may be incorporated to increase or decrease the rotational ratio depending upon a particular purpose.}",
    "textBeforeTable": "Patent Citations There have been described and illustrated herein several embodiments of a forceps having wave-like opposing jaws for clamping, grasping, manipulating, cauterizing, coagulating/desiccating and/or cutting vascular tissue in an atraumatic fashion. While particular embodiments of the disclosure have been described, it is not intended that the disclosure be limited thereto, as it is intended that the disclosure be as broad in scope as the art will allow and that the specification be read likewise. Therefore, the above description should not be construed as limiting, but merely as exemplications of preferred embodiments. Those skilled in the art will envision other modifications within the scope and spirit of the claims appended hereto. In addition, it may be preferable to add other features to the forceps of the present disclosure, e.g., an articulating assembly to axially displace the end effector assembly relative to the elongated shaft. Although it is preferable to vertically align the electrodes on the bipolar version of the forceps, in some cases it may be preferable to offset the opposing electrodes relative to one another either longitudinally or transversely to suit a particular purpose. Although it is preferable to form the upper and lower jaw members such that they are complimentary and intermesh with one another, in some cases it may be preferable to include non-complimentary portions depending upon a particular purpose.",
    "textAfterTable": "US5084057 * May 30, 1990 Jan 28, 1992 United States Surgical Corporation Apparatus and method for applying surgical clips in laparoscopic or endoscopic procedures US5099840 * Jan 23, 1989 Mar 31, 1992 Goble Nigel M Diathermy unit US5176695 * Jul 8, 1991 Jan 5, 1993 Davinci Medical, Inc. Surgical cutting means US5190541 * Oct 17, 1990 Mar 2, 1993 Boston Scientific Corporation Surgical instrument and method US5196009 * Sep 11, 1991 Mar 23, 1993 Kirwan Jr Lawrence T Non-sticking electrosurgical device having nickel tips US5197964 * Nov 12, 1991 Mar 30, 1993 Everest Medical Corporation Bipolar instrument utilizing one stationary electrode and one movable electrode US5275615 * Sep 11, 1992 Jan 4, 1994 Anthony Rose Medical instrument having gripping jaws US5277201 *",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}