{
    "relation": [
        [
            "Citing Patent",
            "US6319715",
            "US6475995 *",
            "US6544790",
            "US6743444",
            "US6916490 *",
            "US6951757",
            "US7217428",
            "US7276594 *",
            "US7700541",
            "US7700542",
            "US8003621",
            "US8192989",
            "US8258235",
            "US8742091 *",
            "US20040126900 *",
            "US20040138154 *",
            "US20040266004 *",
            "US20050026859 *"
        ],
        [
            "Filing date",
            "Apr 21, 2000",
            "Jan 15, 1999",
            "Sep 18, 2000",
            "Jul 3, 2001",
            "Jul 23, 1999",
            "Mar 4, 2003",
            "May 28, 2004",
            "Nov 9, 2000",
            "Apr 2, 2007",
            "Jan 15, 2008",
            "Sep 12, 2008",
            "Sep 26, 2006",
            "Feb 18, 2010",
            "Jun 20, 2002",
            "Apr 13, 2001",
            "Jan 13, 2003",
            "Jun 20, 2002",
            "Nov 12, 2003"
        ],
        [
            "Publication date",
            "Nov 20, 2001",
            "Nov 5, 2002",
            "Apr 8, 2003",
            "Jun 1, 2004",
            "Jul 12, 2005",
            "Oct 4, 2005",
            "May 15, 2007",
            "Oct 2, 2007",
            "Apr 20, 2010",
            "Apr 20, 2010",
            "Aug 23, 2011",
            "Jun 5, 2012",
            "Sep 4, 2012",
            "Jun 3, 2014",
            "Jul 1, 2004",
            "Jul 15, 2004",
            "Dec 30, 2004",
            "Feb 3, 2005"
        ],
        [
            "Applicant",
            "Cornell Research Foundation, Inc.",
            "The Johns Hopkins University",
            "Whitehead Institute For Biomedical Research",
            "Microbiological Research Authority",
            "UAB Research Center",
            "Whitehead Institute For Biomedical Research",
            "Technology Innovations Llc",
            "Cmic Company, Ltd.",
            "Nitto Denko Corporation",
            "Nitto Denko Corporation",
            "Nitto Denko Corporation",
            "Nitto Denko Corporation",
            "Nitto Denko Corporation",
            "Dainippon Sumitomo Pharma Co., Ltd.",
            "Barry Stephen E",
            "Lei Yu",
            "Masaaki Terada",
            "John Hilfinger"
        ],
        [
            "Title",
            "Method of enhancing the delivery of nucleic acids using silica nanoparticles",
            "Oral delivery of nucleic acid vaccines by particulate complexes",
            "Reverse transfection method",
            "Method of making microencapsulated DNA for vaccination and gene therapy",
            "Controlled release of bioactive substances",
            "Transfection method and uses related thereto",
            "Drug delivery apparatus utilizing cantilever",
            "Nucleic acid-containing complex",
            "Biodegradable cationic polymers",
            "Biodegradable cationic polymers",
            "Drug carriers",
            "Solid surface for biomolecule delivery and high-throughput assay",
            "Biodegradable cationic polymers",
            "Method of promoting nucleic acid transfer",
            "High affinity peptide- containing nanoparticles",
            "Solid surface for biomolecule delivery and high-throughput assay",
            "Method of promoting nucleic acid transfer",
            "Methods and compositions of gene delivery agents for systemic and local therapy"
        ]
    ],
    "pageTitle": "Patent US6025337 - Solid microparticles for gene delivery - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6025337?dq=ininventor:oliver+ininventor:steele",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00160-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471940111,
    "recordOffset": 471915502,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{48588=Two genes were used to demonstrate the feasibility of this delivery system. The LAMP-a cDNA is a 6.4 kb circular supercoiled plasmid cDNA with a mouse LAMP-1 gene (2.4 kb) inserted into an Invitrogen plasmid cDNA with a CMV promoter (Guaarnieri, et al., 1993, J. Biol. Chem., 268:1941). Detection of LAMP-1 expression was done by staining cells with anti-LAMP-1 mAb and with secondary anti-IgG mAb conjugated with Texas Red. The gene coding for luciferase enzyme is widely used in cell biology for the study of gene expression because of the high sensitivity of the assay, its simplicity, and low cost. In addition, the enzyme is a good reporter of gene expression because it is a cytosolic protein that does not require post-translational processing for enzymatic activity (de Wet, et al., 1987, Firefly luciferase gene: structure and expression in mammalian cells, Mol. & Cell. Biol., 7:725-37; Wood, et al., 1989, Introduction to beetle luciferases and their applications, J. of Biolumin. & Chemilum., 4:289-301). The presence of luciferase can be readily detected by an enzymatic reaction that involve the oxidation of beetle luciferin with concomitant production of a photon (in the form of chemiluminescence.) The assay was carried out using an assay kit purchased from Promega Corp. (Madison, Wis.)., 47748=mAb PLM-2, a BALB/c mouse anti-porcine LFA-1 (IgG1k) which also cross reacts with murine LFA-1, was isolated and purified as previously described (Hildreth, et al., 1989, Monoclonal antibodies against porcine LFA-1: species cross-reactivity and functional effects of b-subunit-specific antibodies, Molec. Immunol., 26:883-895). IB-4B, a rat anti-mouse LAMP-1 ascite fluid and a mouse anti-human CD44 mAb were isolated as previously described (de Wet, et al., 1987, Firefly luciferase gene: structure and expression in mammalian cells, Mol. & Cell. Biol., 7:725-37). CHA is a IgG1 that does not recognize any known in vivo mouse epitopes (Hybritech Inc., San Diego, Calif.). Affinity-purified FITC and Texas Red-labeled polyclonal anti-rat IgGs were obtained from Sigma., 51519=30 ug of antibodies (biotinylated according to established procedures (O'Shannessy, et al., 1984, A novel procedure for labeling immunoglobulins by conjugation to oligosaccharides moieties, Immunol. Lett., 8:273-277)) was added to 1 ml of avidin-coated microspheres suspension (11 mg/ml) for 1 hour with gentle agitation. Unbound mAb was removed from microspheres by dialysis., 32693=We have previously synthesized microspheres by the complex coacervation of gelatin and chondroitin sulfate (Truong, et al., 1993, A target-specific microspheres drug delivery system made of enzymatically degradable gelatin and chondroitin sulfate coacervates, Controlled Release Society, Abstract #1336; Azhari, et al., 1991, Protein release from enzymatically degradable chondroitin sulfate/gelatin microspheres, Intern. Symp. Control. Rel. Bioact. Mater., 18). These microspheres could be stabilized by cross-linking with glutaraldehyde, the extent of which controls the degradation and drug release rate. Biodegradability of these microspheres in serum is effected by presence of metalloproteinases such as gelatinase, collagenase, and trypsin., 42945=An attractive microparticle delivery system requires a delicate balance among factors such as the simplicity of preparation, cost effectiveness, nucleic acids loading level, controlled release ability, storage stability, and immunogenicity of the components. The gene delivery system described here may offer advantages compared to other particulate delivery systems, including the liposomal system. The problems of instability, low loading level, and controlled release ability are better resolved with the polymeric microparticle systems. Gelatin has received increasing biologic use ranging from surgical tissue adhesive (Weinschelbaum, et al., 1992, Surgical treatment of acute type A dissecting aneurysm with preservation of the native aortic valve and use of biologic glue. Follow-up to 6 years, J. Thorac. Cardiovasc. Surg., 130:369-74) to quantitative immunohistochemical assays (Izumi, et al., 1990, Novel gelatin particle agglutination test for serodiagnosis of leprosy in the field, J. Clinical Microbiol., 28:525-9) and as drug delivery vehicle (Tabata, et al., 1991, Effects of recombinant alpha-interferon-gelatin conjugate on in vivo murine tumor cell growth, Cancer Res., 51:5532-8), due to its biocompatibility and enzymatic degradability in vivo. Compared to other synthetic polymeric systems, such as the extensively studied polylactic/polyglycolic copolymers, the mild conditions of microparticle formulation are appealing. Unlike the solvent evaporation and hot-melt techniques used to formulate synthetic polymeric microparticles, complex coacervation requires neither contact with organic solvents nor heat. It is also particularly suitable for encapsulating bio-macromolecules such as nucleic acids not only through passive solvent capturing but also by direct charge-charge interactions., 29347=This application is a continuation of application Ser. No. 08/265,966, filed Jun. 27, 1994, now abandoned., 38903=Targeting ligands can be directly bound to the surface of the microparticle or can be indirectly attached using a \"bridge\" or \"spacer\". Because of the amino groups provided by the lysine groups of the gelatin, the surface of the microparticles can be easily derivatized for the direct coupling of targeting moieties. Alternatively, spacers (linking molecules and derivatizing moieties on targeting ligands) such as avidin-biotin can be used to indirectly couple targeting ligands to the microparticles. Biotinylated antibodies and/or other biotinylated ligands can be coupled to the avidin-coated microparticle surface efficiently because of the high affinity of biotin (ka ˜1015 M-1) for avidin (Hazuda, et al., 1990, Processing of precursor interleukin 1 beta and inflammatory disease, J. Biol. Chem., 265:6318-22; Wilchek, et al., 1990, Introduction to avidin-biotin technology, Methods In Enzymology, 184:5-13). Orientation-selective attachment of IgGs can be achieved by biotinylating the antibody at the oligosaccharide groups found on the FC portion (O'Shannessy, et al., 1984, A novel procedure for labeling immunoglobulins by conjugation to oligosaccharides moieties, Immunol. Lett., 8:273-277). This design helps to preserve the total number of available binding sites and renders the attached antibodies less immunogenic to FC receptor-bearing cells such as macrophages. Spacers other than the avidin-biotin bridge can also be used, as are known in the art. For example, Staphylococcal protein A can be coated on the microparticles for binding the FC portions of immunoglobulin molecules to the microparticles., 30306=Controlled drug delivery has significantly improved the success of many drug therapies (Langer, R., 1990, New methods of drug delivery, Science, 249:1527-33; Poznansky, et al., 1984, Biological approaches to the controlled delivery of drugs: a critical review, Pharmacol. Rev., 36:277-336). A major goal of drug delivery is to localize the drug to the target site. These targeted delivery systems often take the form of injectables composed of liposomes (Gregoriadis, G., 1988, Liposomes as Drug Carriers, New York: Wiley; Litzinger, et al., 1992, Phosphatidylethanolamine liposomes: drug delivery, gene transfer and immunodiagnostic applications, Biochimica et Biophysica Acta., 1113:201-27) and microspheres made of proteins (Cummings, et al., 1991, Covalent coupling of doxorubicin in protein microspheres is a major determinant of tumor drug deposition, Biochem. Pharm., 41:1849-54; Verrijik, et al., 1991, Polymer-coated albumin microspheres as carriers for intravascular tumor targeting of cisplatin, Cancer Chemother. and Pharm., 29:117-21; Tabata, et al., 1988, Potentiation of antitumor activity of macrophages by recombinant interferon alpha A/D contained in gelatin microspheres, Jpn. J. Cancer Res., 79:636-646), polysaccharides (Rongved, et al., 1991, Crossed-linked, degradable starch microspheres as carriers of paramagnetic resonance imaging: synthesis, degradation, and relaxation properties, Carbohydrate Res., 145:83-92; Carter, et al., 1991, The combination of degradable starch microspheres and angiotensin II in the manipulation of drug delivery in an animal model of colorectal metastasis, British J. Cancer, 65:37-9), and synthetic polymers (Davis, et al., 1984, Microspheres and Drug Therapy, Amsterdam; Eldridge, et al., 1991, Biodegradable microspheres as a vaccine delivery system, Molec. Immunology, 28:287-94; Pappo, et al., 1991, Monoclonal antibody-directed targeting of fluorescent polystyrene microspheres to Peyer's patch M cells, Immunology, 73:277-80). Polymeric systems share some of the advantages of liposomal systems such as altered pharmacokinetics and biodistribution. While liposomes might have better prospects of biocompatibility and potential for fusion with cells, polymeric microspheres have more controllable release kinetics, better stability in storage, and higher drug-loading levels for some classes of compounds.}",
    "textBeforeTable": "Patent Citations Using flow cytometry, we showed that the expression of LAMP-1 was detected in up to 5% of U937 cells in culture (FIG. 5). None of the controls--blank microspheres, microspheres with cDNA but no antibodies, microspheres with cDNA and coated with a mismatched anti-P-glycoprotein antibody (MRK-Msp.), and free cDNA at a concentration six time higher than entrapped in the microspheres--showed any evidence of transfection. The efficiency of transfection appears to be dose-responsive. In general, the transfection efficiency of this particular gene and cell type is comparable between the proposed microspheric delivery system (1-10%) and the calcium phosphate precipitation method (2-15%). FIG. 6 demonstrates the concept in a different cell type using a different monoclonal antibody. Again, free cDNA could not transfect the cells. Eventually the LAMP-1 expression disappeared after several passages. Positive results were also obtained for the luciferase reporter gene system. Transfection was clearly detected by measurement of luciferase enzymatic activity, in 293s cells incubated with luciferase gene-loaded microspheres. We tested the ability of the LAMP-1 DNA loaded microspheres to bind and subsequently transfect a human histiocytic lymphoma cell line (U937) in tissue culture. When coated with either anti-LFA or anti-CD44 monoclonal antibody (both protein targets were expressed in high amount of U937 cell surface), expression LAMP-1 protein was detected by day 3 (FIG. 4A, fluorescent granules) when stained with antibodies recognizing LAMP-1. The staining pattern of U937 cells incubated with LAMP-1 microspheres was identical to",
    "textAfterTable": "* Eldridge et al., Mol. Immunol., 28(3), 1991, 287 294. 8 Eldridge et al., Mol. Immunol., 28(3), 1991, 287-294. 9 * Gao et al, J. Liposome Res., 3(1), 1993, 17 30. 10 Gao et al, J. Liposome Res., 3(1), 1993, 17-30. 11 * Hodgson, Exp. Opin., Ther. Pat., 5(5), 1995, 459 468. 12 Hodgson, Exp. Opin., Ther. Pat., 5(5), 1995, 459-468. 13 * Leong et al., Exp. Biology, 1993, Abstract No. 30839. 14 * Marshall, Science, 269, 1995, 1050 1055. 15 Marshall, Science, 269, 1995, 1050-1055. 16 * Miller et al., FASEB journal, 9, 1995, 190 199. 17 Miller et al., FASEB journal, 9, 1995, 190-199. 18 * Truong et al., Exp. Biology, 1993, Abstract No. 30838.",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}