{
    "relation": [
        [
            "Cited Patent",
            "US4195544 *",
            "US4305319 *",
            "US4383462 *",
            "US4442745 *",
            "US4461199 *",
            "US4502361 *",
            "US4539884 *",
            "DE2553348A1 *",
            "DE3325658A1 *",
            "EP0122634A2 *",
            "EP0124197A2 *",
            "GB2023955A *",
            "JPS5178219A *",
            "JPS5516698A *",
            "JPS5528072A *",
            "JPS6120093A *",
            "JPS54161313A *"
        ],
        [
            "Filing date",
            "Mar 20, 1978",
            "Oct 1, 1979",
            "Aug 8, 1979",
            "Apr 28, 1980",
            "Dec 9, 1982",
            "Dec 8, 1983",
            "Sep 7, 1983",
            "Nov 27, 1975",
            "Jul 15, 1983",
            "Apr 17, 1984",
            "Feb 2, 1984",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Publication date",
            "Apr 1, 1980",
            "Dec 15, 1981",
            "May 17, 1983",
            "Apr 17, 1984",
            "Jul 24, 1984",
            "Mar 5, 1985",
            "Sep 10, 1985",
            "Aug 12, 1976",
            "Apr 5, 1984",
            "Oct 24, 1984",
            "Nov 7, 1984",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Applicant",
            "Nippon Gakki Seizo Kabushiki Kaisha",
            "Linn Roger C",
            "Nippon Gakki Seizo Kabushiki Kaisha",
            "Norlin Industries, Inc.",
            "Nippon Gakki Seizo Kabushiki Kaisha",
            "Allen Organ Company",
            "Nippon Gakki Seizo Kabushiki Kaisha",
            "Nippon Musical Instruments Mfg",
            "Casio Computer Co Ltd",
            "Yamaha Corporation",
            "The Board Of Trustees Of The Leland Stanford Junior University",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Title",
            "Electronic musical instrument with external sound control function",
            "Modular drum generator",
            "Electronic musical instrument",
            "Long duration aperiodic musical waveform generator",
            "Electronic musical instruments",
            "Method and apparatus for dynamic reproduction of transient and steady state voices in an electronic musical instrument",
            "Electronic musical instrument of waveshape memory type with expression control",
            "Elektronisches musikinstrument",
            "Elektronisches musikinstrument mit selbsttaetiger spieleinrichtung",
            "Polyphonic electronic musical instrument",
            "Waveform table modification instrument and method for generating musical sound",
            "Title not available",
            "Title not available",
            "Title not available",
            "Title not available",
            "Title not available",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US4754680 - Overdubbing apparatus for electronic musical instrument - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4754680?ie=ISO-8859-1&dq=5726663",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00192-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481282735,
    "recordOffset": 481260809,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33829=Copending U.S. patent applications Ser. Nos. 760,290 and 760,291 both filed July 29, 1985 and assigned to the same assignee as this application disclose a musical instrument of such a type as described above. The '290 application issued as U.S. Pat. No. 4,681,008 on July 21, 1987, and the '291 application issued as U.S. Pat. No. 4,667,556 on May 26, 1987.}",
    "textBeforeTable": "Patent Citations In summary, according to the invention it is possible to provide an overdubbing apparatus for an electronic musical instrument, which is convenient to use, has high operability and provides pleasant musical effects. Furthermore, while in the above embodiment only the tone volume is displayed, it is also possible to provide a display concerning a timbre, e.g., a filter cut-off frequency, which will be more convenient to the performer. Further, in the above embodiment the tone number of the tone to be overdubbed is indicated by display elements 41a to 44a which are provided separately of display unit 48. However, it is possible to display such data on a single display unit. Further, only particular channels among a plurality of channels may be made exclusive write channels for only writing waveform signal in waveform memory 7, while the other channels are made exclusive read channels for only reading out waveform signal form waveform memory 7. The \"waveform read/write channel\" according to the invention means a channel which is capable of both read and write operations or only either read or write operation. Further, in the above embodiment the tone generation control unit 8 is provided with a plurality of waveform read/write channels constructed by a time division arrangement. However, it is also possible to provide a plurality of waveform read/write channels by using separate hardware of like circuit construction for each channel. Further, in the above embodiment",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4868869 * Jan 7, 1988 Sep 19, 1989 Clarity Digital signal processor for providing timbral change in arbitrary audio signals US4899632 * Feb 8, 1988 Feb 13, 1990 Yamaha Corporation Multi-recording apparatus of an electronic musical instrument US4924744 * Aug 9, 1988 May 15, 1990 Hudson Soft Co., Ltd. Apparatus for generating sound through low frequency and noise modulation US5005459 * Jun 22, 1990 Apr 9, 1991 Yamaha Corporation Musical tone visualizing apparatus which displays an image of an animated object in accordance with a musical performance US5086685 * Mar 9, 1990 Feb 11, 1992 Casio Computer Co., Ltd. Musical tone generating apparatus for electronic musical instrument US5123322 * Oct 7, 1991",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}