{
    "relation": [
        [
            "Date",
            "Dec 1, 1994",
            "Jun 9, 1997",
            "Jun 21, 1999",
            "Nov 27, 2000",
            "May 29, 2001",
            "Apr 17, 2002",
            "Nov 16, 2004",
            "Mar 17, 2006",
            "Aug 8, 2006",
            "Nov 25, 2008",
            "Apr 29, 2014",
            "May 27, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "CC",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Certificate of correction",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: MASIMO CORPORATION, CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:DIAB, MOHAMED K.;KIANI-AZARBAYJANY, ESMAIEL;ELFADEL, IBRAHIM M.;AND OTHERS;REEL/FRAME:007229/0300 Effective date: 19941123",
            "Owner name: COMERICA BANK-CALIFORNIA, CALIFORNIA Free format text: SECURITY AGREEMENT;ASSIGNOR:MASIMO CORPORATION;REEL/FRAME:008587/0043 Effective date: 19970416",
            "Owner name: MASIMO CORPORATION, CALIFORNIA Free format text: MERGER;ASSIGNOR:MASIMO CORPORATION;REEL/FRAME:010043/0066 Effective date: 19960620",
            "Year of fee payment: 4",
            "",
            "",
            "Year of fee payment: 8",
            "Owner name: MASIMO CORPORATION, CALIFORNIA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:COMERICA BANK;REEL/FRAME:017314/0694 Effective date: 20060310",
            "Owner name: MASIMO CORPORATION, CALIFORNIA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:COMERICA BANK;REEL/FRAME:018061/0752 Effective date: 20060728",
            "Year of fee payment: 12",
            "Owner name: JPMORGAN CHASE BANK, NATIONAL ASSOCIATION, ILLINOI Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:MASIMO CORPORATION;MASIMO AMERICAS, INC.;REEL/FRAME:032784/0864 Effective date: 20140423",
            "Owner name: JPMORGAN CHASE BANK, NATIONAL ASSOCIATION, ILLINOI Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE NATURE OF CONVEYANCE PREVIOUSLY RECORDED AT REEL: 032784 FRAME: 0864. ASSIGNOR(S) HEREBY CONFIRMS THE SECURITY AGREEMENT;ASSIGNORS:MASIMO AMERICAS, INC.;MASIMO CORPORATION;REEL/FRAME:033032/0426 Effective date: 20140423"
        ]
    ],
    "pageTitle": "Patent US5632272 - Signal processing apparatus - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5632272?dq=6370535",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00269-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484211447,
    "recordOffset": 484119297,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{250734=In order to obtain the goal, a cost function is defined (e.g., a Lagrangian optimization in the present embodiment) as follows: ##EQU26## where μ is the Lagrange multiplier. Finding the value of ra, rv and μ that solve the cost function can be accomplished using a constrained optimization method such as described in Luenberger, Linear & Nonlinear Programming, Addison-Wesley, 2d Ed., 1984., 220797=2.717182664241813, 134091=The least mean squares (LMS) implementation of the internal processor 32 described above in conjunction with the adaptive noise canceler of FIGS. 5a and FIG. 5b is relatively easy to implement, but lacks the speed of adaptation desirable for most physiological monitoring applications of the present invention. Thus, a faster approach for adaptive noise canceling, called a least-squares lattice joint process estimator model, is used in one embodiment. A joint process estimator 60 is shown diagrammatically in FIG. 8 and is described in detail in Chapter 9 of Adaptive Filter Theory by Simon Haykin, published by Prentice-Hall, copyright 1986. This entire book, including Chapter 9, is hereby incorporated herein by reference., 221022=-0.098294046682706, 89302=One algorithm which may be used for the adjustment of the transfer function of the internal processor 32 is a least-squares algorithm, as described in Chapter 6 and Chapter 12 of the book Adaptive Signal Processing by Bernard Widrow and Samuel Stearns, published by Prentice Hall, copyright 1985. This entire book, including Chapters 6 and 12, is hereby incorporated herein by reference., 46745=This is a continuation-in-part application of U.S. patent application Ser. No. 08/132,812 filed Oct. 6, 1993, and entitled \"Signal Processing Apparatus\" now U.S. Pat. No. 5,490,505 and a continuation-in-part application of U.S. patent application Ser. No. 08/249,690 filed May 26, 1994 entitled \"Signal Processing Apparatus and Method\", now U. S. Pat. No. 5,482,036 which is a continuation of U.S. patent application Ser. No. 07/666,060 filed Mar. 7, 1991, now abandoned., 287335=Furthermore, one skilled in the art will realize that the above described techniques of primary or secondary signal removal or derivation from a composite signal including both primary and secondary components can also be performed on electrocardiography (ECG) signals which are derived from positions on the body which are close and highly correlated to each other. It should be understood that a tripolar Laplacian electrode sensor such as that depicted in FIG. 31 which is a modification of a bipolar Laplacian electrode sensor discussed in the article \"Body Surface Laplacian ECG Mapping\" by Bin He and Richard J. Cohen contained in the journal IEEE Transactions on Biomedical Engineering, Vol. 39, No. 11, November 1992 could be used as an ECG sensor. It must also be understood that there are a myriad of possible ECG sensor geometry's that may be used to satisfy the requirements of the present invention. The same type of sensor could also be used for EEG and EMG measurements., 257267=The complex FFT modules 652,654 perform complex FFTs on respective infrared and red channels on the data snapshots. The data from the complex FFTs is then analyzed in two paths, once which examines the magnitude and one which examines the phase from the complex FFT data points. However, prior to further processing, the data is provided to respective infrared and red select modules 653, 655 because the output of the FFT operation will provide repetitive information from 0-1/2 the sampling rate and from 1/2 the sampling rate to the sampling rate. The select modules select only samples from 0-1/2 the sampling rate (e.g., 0-31.25 Hz in the present embodiment) and then select from those samples to cover a frequency range of the heart rate and one or more harmonics of the heart rate. In the present embodiment, samples which fall in the frequency range of 20 beats per minute to 500 beats per minute are selected. This value can be varied in order to obtain harmonics of the heart rate as desired. Accordingly, the output of the select modules results in less than 256 samples. In the present embodiment, the sample points 2-68 of the outputs of the FFTs are utilized for further processing., 220723=0.098294046682706, 192010=The digital signal processing system 334 is illustrated in additional detail in FIG. 13. In the present embodiment, the digital signal processing system comprises a microcontroller 360, a digital signal processor 362, a program memory 364, a sample buffer 366, a data memory 368, a read only memory 370 and communication registers 372. In the present embodiment, the digital signal processor 362 is an Analog Devices AD 21020. In the present embodiment, the microcontroller 360 comprises a Motorola 68HC05, with built in program memory. In the present embodiment, the sample buffer 366 is a buffer which accepts the 20 Khz sample data from the analog to digital conversion circuit 332 for storage in the data memory 368. In the present embodiment, the data memory 368 comprises 32 KWords (words being 40 bits in the present embodiment) of static random access memory., 220946=-2.717182664241813, 54846=This invention provides improvements upon the methods and apparatus disclosed in U.S. patent application Ser. No. 08/132,812, filed Oct. 6, 1993, entitled Signal Processing Apparatus, which earlier application has been assigned to the assignee of the instant application. The present invention involves several different embodiments using the novel signal model in accordance with the present invention to isolate either a primary signal portion or a secondary signal portion of a composite measured signal. In one embodiment, a signal processor acquires a first measured signal and a second measured signal that is correlated to the first measured signal. The first signal comprises a first primary signal portion and a first secondary signal portion. The second signal comprises a second primary signal portion and a second secondary signal portion. The signals may be acquired by propagating energy through a medium and measuring an attenuated signal after transmission or reflection. Alternatively, the signals may be acquired by measuring energy generated by the medium., 155032=In yet another embodiment, the correlation cancellation is performed with a QRD algorithm as shown diagrammatically in FIG. 8a and as described in detail in Chapter 18 of Adaptive Filter Theory by Simon Haykin, published by Prentice-Hall, copyright 1986.}",
    "textBeforeTable": "Patent Citations While the present invention has been described in terms of a physiological monitor, one skilled in the art will realize that the signal processing techniques of the present invention can be applied in many areas, including but not limited to the processing of a physiological signal. The present invention may be applied in any situation where a signal processor comprising a detector receives a first signal which includes a first primary signal portion and a first secondary signal portion and a second signal which includes a second primary signal portion and a second secondary signal portion. Thus, the signal processor of the present invention is readily applicable to numerous signal processing areas. Furthermore, one skilled in the art will realize that the above described techniques can also be performed on signals made up of reflected energy, rather than transmitted energy. One skilled in the art will also realize that a primary or secondary portion of a measured signal of any type of energy, including but not limited to sound energy, X-ray energy, gamma ray energy, or light energy can be estimated by the techniques described above. Thus, one skilled in the art will realize that the techniques of the present invention can be applied in such monitors as those using ultrasound where a signal is transmitted through a portion of the body and reflected back from within the body back through this portion of the body.",
    "textAfterTable": "US4948248 * Dec 15, 1989 Aug 14, 1990 Invivo Research Inc. Blood constituent measuring device and method US4955379 * Aug 8, 1988 Sep 11, 1990 National Research Development Corporation Motion artefact rejection system for pulse oximeters US4956867 * Apr 20, 1989 Sep 11, 1990 Massachusetts Institute Of Technology Adaptive beamforming for noise reduction US5057695 * Dec 15, 1989 Oct 15, 1991 Otsuka Electronics Co., Ltd. Method of and apparatus for measuring the inside information of substance with the use of light scattering US5273036 * Apr 20, 1993 Dec 28, 1993 Ppg Industries, Inc. Apparatus and method for monitoring respiration US5458128 * Jun 17, 1994 Oct 17, 1995 Polanyi; Michael Method and apparatus for noninvasively measuring concentration of a dye in arterial blood * Cited by examiner Non-Patent Citations",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}