{
    "relation": [
        [
            "Citing Patent",
            "US5895972 *",
            "US5923086 *",
            "US5930117 *",
            "US6251706",
            "US6570247",
            "US6607928",
            "US6894908 *",
            "US7309284",
            "US7361985 *",
            "US7560309 *",
            "US7628021 *",
            "US7841944",
            "US7857700",
            "US7878910",
            "US7951001",
            "US8012010",
            "US8115700",
            "US8118670",
            "US8142273",
            "US8192281",
            "US8199068",
            "US8210922",
            "US8210944",
            "US8259765",
            "US8298081",
            "US8303407",
            "US8318567 *",
            "US8348746",
            "US8357033",
            "US8360847",
            "US8425316",
            "US8460098",
            "US8512139",
            "US8591251 *",
            "US8605114",
            "US8616953",
            "US8715058",
            "US8727855",
            "US8749582",
            "US8758144",
            "US8777737",
            "US8784196",
            "US8968077",
            "US8992304",
            "US9028329",
            "US20040261979 *",
            "US20110201169 *",
            "WO2007065455A1 *"
        ],
        [
            "Filing date",
            "Dec 31, 1996",
            "May 14, 1997",
            "May 7, 1996",
            "Apr 23, 1998",
            "Dec 30, 1997",
            "Sep 28, 2000",
            "Mar 28, 2003",
            "Jan 12, 2004",
            "Oct 27, 2004",
            "Jul 26, 2005",
            "Jun 12, 2006",
            "Aug 6, 2002",
            "Sep 12, 2003",
            "Sep 13, 2005",
            "Jun 27, 2005",
            "Sep 21, 2007",
            "Sep 20, 2007",
            "Nov 9, 2007",
            "Nov 9, 2007",
            "Sep 20, 2007",
            "Nov 12, 2007",
            "Sep 20, 2007",
            "Oct 29, 2007",
            "Dec 6, 2005",
            "Jun 16, 2011",
            "Dec 29, 2008",
            "Jan 28, 2011",
            "Aug 10, 2011",
            "Sep 20, 2007",
            "Sep 20, 2007",
            "Aug 3, 2010",
            "Feb 27, 2012",
            "Nov 9, 2007",
            "Jul 25, 2012",
            "Feb 17, 2012",
            "Aug 31, 2007",
            "Oct 3, 2008",
            "Nov 9, 2007",
            "Nov 26, 2013",
            "Oct 23, 2007",
            "Nov 10, 2006",
            "Nov 10, 2006",
            "May 5, 2009",
            "May 13, 2008",
            "Jul 9, 2007",
            "Jun 30, 2004",
            "",
            "Dec 6, 2005"
        ],
        [
            "Publication date",
            "Apr 20, 1999",
            "Jul 13, 1999",
            "Jul 27, 1999",
            "Jun 26, 2001",
            "May 27, 2003",
            "Aug 19, 2003",
            "May 17, 2005",
            "Dec 18, 2007",
            "Apr 22, 2008",
            "Jul 14, 2009",
            "Dec 8, 2009",
            "Nov 30, 2010",
            "Dec 28, 2010",
            "Feb 1, 2011",
            "May 31, 2011",
            "Sep 6, 2011",
            "Feb 14, 2012",
            "Feb 21, 2012",
            "Mar 27, 2012",
            "Jun 5, 2012",
            "Jun 12, 2012",
            "Jul 3, 2012",
            "Jul 3, 2012",
            "Sep 4, 2012",
            "Oct 30, 2012",
            "Nov 6, 2012",
            "Nov 27, 2012",
            "Jan 8, 2013",
            "Jan 22, 2013",
            "Jan 29, 2013",
            "Apr 23, 2013",
            "Jun 11, 2013",
            "Aug 20, 2013",
            "Nov 26, 2013",
            "Dec 10, 2013",
            "Dec 31, 2013",
            "May 6, 2014",
            "May 20, 2014",
            "Jun 10, 2014",
            "Jun 24, 2014",
            "Jul 15, 2014",
            "Jul 22, 2014",
            "Mar 3, 2015",
            "Mar 31, 2015",
            "May 12, 2015",
            "Dec 30, 2004",
            "Aug 18, 2011",
            "Jun 14, 2007"
        ],
        [
            "Applicant",
            "Intel Corporation",
            "Intel Corporation",
            "Sheldahl, Inc.",
            "Intel Corporation",
            "Intel Corporation",
            "Intel Corporation",
            "Intel Corporation",
            "Igt",
            "Freescale Semiconductor, Inc.",
            "Marvell International Ltd.",
            "Texas Instruments Incorporated",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Google Inc.",
            "Igt",
            "Igt",
            "Semiconductor Energy Laboratory Co., Ltd.",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Tsmc Solid State Lighting Ltd.",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Igt",
            "Idt",
            "Igt",
            "Igt",
            "Meng-Jen Wang",
            "Semiconductor Energy Laboratory Co., Ltd.",
            "Pirelli & C Spa"
        ],
        [
            "Title",
            "Method and apparatus for cooling the backside of a semiconductor device using an infrared transparent heat slug",
            "Apparatus for cooling a semiconductor die",
            "Heat sink structure comprising a microarray of thermal metal heat channels or vias in a polymeric or film layer",
            "Method for cooling the backside of a semiconductor device using an infrared transparent heat slug",
            "Integrated circuit device having an embedded heat slug",
            "Integrated circuit device having an embedded heat slug",
            "Bridge clip with bimetallic leaf and method",
            "Method for using a light valve to reduce the visibility of an object within a gaming apparatus",
            "Thermally enhanced molded package for semiconductors",
            "Drop-in heat sink and exposed die-back for molded flip die package",
            "Solid state heat pump",
            "Gaming device having a three dimensional display device",
            "Three-dimensional autostereoscopic image display for a gaming apparatus",
            "Gaming machine with scanning 3-D display system",
            "Gaming device having a three dimensional display device",
            "Reel blur for gaming machines having simulated rotating reels",
            "Auto-blanking screen for devices having multi-layer displays",
            "Method and apparatus for using a light valve to reduce the visibility of an object within a gaming apparatus",
            "Presentation of wheels on gaming machines having multi-layer displays",
            "Simulated reel imperfections",
            "Single plane spanning mode across independently driven displays",
            "Separable game graphics on a gaming machine",
            "Gaming system having display device with changeable wheel",
            "Passive phase control in an external cavity laser",
            "Gaming system, gaming device and method for providing multiple display event indicators",
            "Single source visual image display distribution on a gaming machine",
            "Thermal treatment equipment and method for heat-treating",
            "Reel blur for gaming machines having simulated rotating reels",
            "Realistic video reels",
            "Multimedia emulation of physical reel hardware in processor-based gaming machines",
            "Methods and systems for improving play of a bonus game on a gaming machine and improving security within a gaming establishment",
            "Gaming system having display device with changeable wheel",
            "Multi-layer display 3D server based portals",
            "Light emitting diode light bar module with electrical connectors formed by injection molding",
            "Gaming system having reduced appearance of parallax artifacts on display devices including multiple display screens",
            "Reel symbol resizing for reel based gaming machines",
            "Reel and video combination machine",
            "Three-dimensional paylines for gaming machines",
            "Gaming system having reduced appearance of parallax artifacts on display devices including multiple display screens",
            "Separable backlighting system",
            "Method and apparatus for integrating remotely-hosted and locally rendered content on a gaming device",
            "Remote content management and resource sharing on a gaming machine and method of implementing same",
            "Methods and systems for interfacing with a third-party application",
            "Methods and systems for tracking an event of an externally controlled interface",
            "Integrating remotely-hosted and locally rendered content on a gaming device",
            "[heat sink structure]",
            "Thermal Treatment Equipment and Method for Heat-Treating",
            "Passive phase control in an external cavity laser"
        ]
    ],
    "pageTitle": "Patent US5376587 - Method for making cooling structures for directly cooling an active layer of ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5376587?dq=6,108,703",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473418351,
    "recordOffset": 473391556,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21632=A great number of similar cooling structures based on the above described principles are known in the art, as there are for example, the European Patent EP 97782, which corresponds to U.S. Pat. No. 4,479,140, entitled \"Thermal Conduction Element For Conducting Heat From Semiconductor Devices To A Cold Plate\", the article \"Bump Internal-Thermal Enhancement\", IBM Technical Disclosure Bulletin, Vol. 27, No. 7B, pp. 4413-4415, (December 1984), and the article \"Chip/Can Conduction Path\", IBM Technical Disclosure Bulletin, Vol. 20, No. 8, page 3223 (January 1978). The disclosure of all of these references is incorporated herein by reference., 21112=These cooling structures, illustrated in FIG. 1 and FIG. 2, are in principle described, for example on pages 48, 49 and 338, in \"Microelectronics Packaging Handbook\", edited by R. R. Tummala and E. J. Rymaszewski, publisher Van Nostrand Reinhold (1989), and in the article \"Semiconductor Module With Improved Air Cooling\", IBM Technical Disclosure Bulletin, Vol. 20, No. 5, page 1768 (October 1977), respectively, and the disclosures of which are incorporated herein by reference., 16297=This Patent Application is a Divisional Patent Application of U.S. patent application Ser. No. 07/874,246, filed Apr. 24, 1992, which has now issued as U.S. Pat. No. 5,287,001, on Feb. 15, 1994.}",
    "textBeforeTable": "Patent Citations While the present invention has been particularly described, in conjunction with specific preferred embodiments, it is evident that many alternatives, modifications and variations will be apparent to those skilled in the art in light of the foregoing description. It is therefore contemplated that the appended claims will embrace any such alternatives, modifications and variations as falling within the true scope and spirit of the present invention. The cooling structures of this invention are also applicable for SMD's (surface mounted device) technology. If heat sources developing different amounts of heat are integrated on one chip and have to be cooled, it is conceivable to adapt the inventive cooling structure to this situation by forming thicker and thinner parts of the structure having different thermal resistances. Thermal coupling of single devices on one chip via heat bridges integrated in the cooling structure and thermal separation of devices on one chip by the employment of heat barriers are additional useful features for this invention. The above described embodiments represent a number of different applications of the present invention. Depending on the requirements, several variations of the described embodiments are conceivable. Choosing different materials or fabrication techniques and/or adapting the described embodiments to other applications, results in additional embodiments of the present invention. The employment of materials with low or negligible thermal resistance and a minimization of the layer thickness allows optimized cooling structures. FIG. 10, is a detailed sketch",
    "textAfterTable": "Separable game graphics on a gaming machine US8210944 Oct 29, 2007 Jul 3, 2012 Igt Gaming system having display device with changeable wheel US8259765 Dec 6, 2005 Sep 4, 2012 Google Inc. Passive phase control in an external cavity laser US8298081 Jun 16, 2011 Oct 30, 2012 Igt Gaming system, gaming device and method for providing multiple display event indicators US8303407 Dec 29, 2008 Nov 6, 2012 Igt Single source visual image display distribution on a gaming machine US8318567 * Jan 28, 2011 Nov 27, 2012 Semiconductor Energy Laboratory Co., Ltd. Thermal treatment equipment and method for heat-treating US8348746 Aug 10, 2011 Jan 8, 2013 Igt Reel blur for gaming machines having simulated rotating reels US8357033 Sep 20, 2007 Jan 22, 2013 Igt Realistic video reels US8360847 Sep 20, 2007 Jan 29, 2013 Igt Multimedia emulation of physical reel hardware",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}