{
    "relation": [
        [
            "Citing Patent",
            "US8312374 *",
            "US8375312 *",
            "US8423916 *",
            "US8581936 *",
            "US8635547 *",
            "US8726153 *",
            "US8824861",
            "US9058403 *",
            "US20090067747 *",
            "US20090150772 *",
            "US20100180222 *",
            "US20100226526 *",
            "US20110047515 *",
            "US20110055762 *",
            "US20110179368 *",
            "US20120166988 *",
            "US20120271545 *",
            "US20140181649 *"
        ],
        [
            "Filing date",
            "Jul 24, 2009",
            "Jun 8, 2007",
            "Nov 6, 2009",
            "Aug 26, 2008",
            "Jan 7, 2010",
            "Dec 4, 2008",
            "Jun 30, 2009",
            "May 18, 2010",
            "Aug 26, 2008",
            "Dec 4, 2008",
            "",
            "Dec 30, 2009",
            "Dec 22, 2009",
            "May 18, 2010",
            "",
            "Aug 16, 2011",
            "",
            "Feb 27, 2014"
        ],
        [
            "Publication date",
            "Nov 13, 2012",
            "Feb 12, 2013",
            "Apr 16, 2013",
            "Nov 12, 2013",
            "Jan 21, 2014",
            "May 13, 2014",
            "Sep 2, 2014",
            "Jun 16, 2015",
            "Mar 12, 2009",
            "Jun 11, 2009",
            "Jul 15, 2010",
            "Sep 9, 2010",
            "Feb 24, 2011",
            "Mar 3, 2011",
            "Jul 21, 2011",
            "Jun 28, 2012",
            "Oct 25, 2012",
            "Jun 26, 2014"
        ],
        [
            "Applicant",
            "Sony Corporation",
            "Apple Inc.",
            "Canon Kabushiki Kaisha",
            "Ricoh Company, Limited",
            "Sony Corporation",
            "Sony Corporation",
            "Yoostar Entertainment Group, Inc.",
            "Lg Electronics Inc.",
            "Hirohisa Inamoto",
            "Takuro Noda",
            "Sony Corporation",
            "Modro Sierra K",
            "Korea Advanced Institute Of Science And Technology",
            "Lg Electronics Inc.",
            "King Nicholas V",
            "Hon Hai Precision Industry Co., Ltd.",
            "Nokia Corporation",
            "9224-5489 Quebec Inc."
        ],
        [
            "Title",
            "Information processing apparatus and method and computer program",
            "Classifying digital media based on content",
            "Information processing apparatus, processing method thereof, and computer-readable storage medium",
            "Method and apparatus for generating image display data",
            "Display device and display method",
            "Multi-user networked digital photo display with automatic intelligent organization by time and subject matter",
            "Interactive systems and methods for video compositing",
            "Data display apparatus using category-based axes",
            "Method and apparatus for generating image display data",
            "Display device, display method and program",
            "Display device and display method",
            "Mobile media, devices, and signaling",
            "Three-dimensional navigation system for contents guide and method thereof",
            "Data display apparatus using category-based axes",
            "3D View Of File Structure",
            "System and method for presenting pictures on touch sensitive screen",
            "Method and apparatus for providing a multi-dimensional data interface",
            "Method of managing arrays of documents"
        ]
    ],
    "pageTitle": "Patent US7716604 - Apparatus with thumbnail display - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7716604?ie=ISO-8859-1&dq=7,194,691",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00198-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481170615,
    "recordOffset": 481140740,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34207=The present application claims priority from Japanese application JP2005-121418 filed on Apr. 19, 2005, the content of which is hereby incorporated by reference into this application., 38578=In the foregoing invention described in JP-A-2004-221672, since thumbnails for each content are scroll-displayed from right to left, it is possible to introduce a lot of contents. However, in order to select a desired content, it is necessary to specify and click a thumbnail of a desired content with a cursor from the thumbnail screen that is scrolling as above, or from a flow of a number of thumbnails. It is difficult to select the desired thumbnail from among the moving numerous thumbnails., 40299=However, in the data display method described in the above JP-A-10-187743 as well, since all categories are simultaneously displayed, as is the case with the apparatus with thumbnail display described in JP-A-2004-221672, each thumbnail is displayed in a small size, thus making it difficult to view the displayed content. Therefore, it becomes more difficult to find out the thumbnail of the desired content. Here, although it may be possible to identify the displayed content of the thumbnail without difficulty by bringing a viewpoint closer to the thumbnail, an operation for that purpose (i.e. an input operation for instructing a change in the viewpoint) is needed. Unless the viewpoint is changed, the display state of the thumbnail screen is held unchanged., 35187=In an exemplary apparatus with thumbnail display, the display screen is divided into sections for a TV program, a library, and the Internet starting from the top. In the TV program section, thumbnails for TV channels are arranged and displayed. In the library section, thumbnails for files for each content stored in folders registered in the library of a hard disc (e.g. video-recorded program file, moving image video file, still image file, voice file, Internet data file or the like) are arranged and displayed. In the Internet section, thumbnails for Internet data introduction information are arranged and displayed. (Reference may be made to JP-A-2004-221672 for example.}",
    "textBeforeTable": "Patent Citations It should be further understood by those skilled in the art that although the foregoing description has been made on embodiments of the invention, the invention is not limited thereto and various changes and modifications may be made without departing from the spirit of the invention and the scope of the appended claims. In addition, when the “on-the-air program” category is the highest rank layer category, a still video image of the program screen at that point of time can be displayed as a TV program thumbnail for every predetermined interval (e.g. seconds or the like). Therefore, for example, every time the thumbnail is displayed, the content of the still video image on the thumbnail changes. Furthermore, when the focus 20 lies on the thumbnail of the TV program, the content of the broadcast received at the point of time may be displayed in moving images. In this embodiment, the category that can be used includes: “on-the-air program”, “unwatched program”, “recorded program”, “picture and still image”, “voice”, “link collection”, “unread e-mail” or the like, and other categories can also be added to them, and the existing categories can be divided into a plurality of categories as required. , thus making it possible to access the desired content rapidly. FIG. 2 . When the desired category layer 22 becomes the highest rank layer, it becomes possible to search the desired thumbnail 17",
    "textAfterTable": "US20070130515 * Nov 16, 2004 Jun 7, 2007 Koninklijke Phillips Electronics N.V. System for displaying images with multiple attributes JP2004221672A Title not available JPH10187743A Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US8312374 * Jul 24, 2009 Nov 13, 2012 Sony Corporation Information processing apparatus and method and computer program US8375312 * Jun 8, 2007 Feb 12, 2013 Apple Inc. Classifying digital media based on content US8423916 * Nov 6, 2009 Apr 16, 2013 Canon Kabushiki Kaisha Information processing apparatus, processing method thereof, and computer-readable storage medium US8581936 * Aug 26, 2008 Nov 12, 2013 Ricoh Company,",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}