{
    "relation": [
        [
            "Cited Patent",
            "US2100235 *",
            "US2235182 *",
            "US2401969 *",
            "US3480114 *",
            "US3557907 *",
            "US3841592 *",
            "US4199122 *",
            "US4223858 *",
            "US4304379 *",
            "US4305558 *",
            "US4332361 *"
        ],
        [
            "Filing date",
            "Apr 20, 1936",
            "Aug 29, 1939",
            "Jul 3, 1945",
            "Aug 11, 1967",
            "Jun 9, 1969",
            "Mar 16, 1973",
            "Jul 10, 1978",
            "Apr 27, 1978",
            "Sep 28, 1979",
            "Jun 26, 1979",
            "Dec 31, 1980"
        ],
        [
            "Publication date",
            "Nov 23, 1937",
            "Mar 18, 1941",
            "Jun 11, 1946",
            "Nov 25, 1969",
            "Jan 26, 1971",
            "Oct 15, 1974",
            "Apr 22, 1980",
            "Sep 23, 1980",
            "Dec 8, 1981",
            "Dec 15, 1981",
            "Jun 1, 1982"
        ],
        [
            "Applicant",
            "Milo Brown",
            "Roy Weston",
            "Joel Schlank",
            "Shoffner Willie M",
            "United Steel & Wire Co",
            "Witten L",
            "Christie Eugene P",
            "Salazar Gerardo P De",
            "Christensen James H",
            "Baker Cal M",
            "Mcclellan Thomas A"
        ],
        [
            "Title",
            "Sack holder",
            "Sack holder",
            "Garment hanger",
            "Merchandise check out system",
            "Checkout counter with pivoted cash register",
            "Bag holder",
            "Support rack for polyethylene bag",
            "Bag holder",
            "Bag holder",
            "Bag check out system",
            "Bag holder support system"
        ]
    ],
    "pageTitle": "Patent US4512540 - Plastic bag rack for checkstand - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4512540?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 485960284,
    "recordOffset": 485936678,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While the invention has been illustrated and described in detail in the drawings and foregoing description, the same is considered to be illustrative and not restrictive in character, it being understood that only the preferred embodiments have been shown and described herein and that all changes and modifications that come within the spirit and scope of the invention are also desired to be protected. To mount the rack 25 on the brackets 75, the heads 93 and 94 of the respective pins 92 and 91 on each of the strip members 56 are inserted into the two spaced holes 82 and 83 on each of the brackets 75 and the rack is initially moved downwardly to position the heads 93 and 94 behind the portions of the longitudinal slots 85 extending below the circular holes 82 and 83 to hold the rack 25 in its concealed position below the panel 20 when the latter is placed over the opening of the well 22. When the panel 20 is moved to its upright position, as illustrated in FIG. 8, the moving of the rack 25 toward its elevated position on the panel 20 causes the pins 91 and 92 to move upwardly along the paths of the longitudinal slots 85 on the respective brackets 75. Upon the upper pins 91 contacting the upper ends of the longitudinal slots 85, the rack 25 is moved sidewise such that",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4953664 * May 4, 1989 Sep 4, 1990 Sonoco Products Company Ergonomically designed check-out counter system for supermarket and merchandising industries US5190253 * Jan 29, 1992 Mar 2, 1993 Mobil Oil Corporation Collapsible holder for thermoplastic bags US5195613 * Jun 3, 1991 Mar 23, 1993 Tokyo Electric Co., Ltd. Commodity data reader US5211263 * Jan 21, 1992 May 18, 1993 In-Store Products Limited Store check-out station US6491218 Dec 21, 2000 Dec 10, 2002 Wal-Mart Stores, Inc. Methods and apparatus for improved register checkout US6533073 * Apr 10, 2001 Mar 18, 2003 Load King Manufacturing Co. Checkout counter construction and method employing bag well feature US6668979",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}