{
    "relation": [
        [
            "Racial composition",
            "White",
            "—Non-Hispanic",
            "Black or African American",
            "Hispanic or Latino (of any race)",
            "Asian"
        ],
        [
            "2010[26]",
            "32.7%",
            "21.5%",
            "25.8%",
            "27.6%",
            "23.7%"
        ],
        [
            "1990[89]",
            "48.2%",
            "36.6%",
            "29.7%",
            "24.2%",
            "11.4%"
        ],
        [
            "1970[89]",
            "77.8%",
            "69.5%[90]",
            "21.0%",
            "9.1%[90]",
            "0.5%"
        ],
        [
            "1940[89]",
            "95.5%",
            "n/a",
            "4.5%",
            "n/a",
            "−"
        ]
    ],
    "pageTitle": "Jersey City, New Jersey - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Jersey_City,_NJ",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00304-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 877986459,
    "recordOffset": 877887896,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{195319=As of May 2010[update], the city had a total of 218.57 miles (351.75 km) of roadways, of which 189.88 miles (305.58 km) were maintained by the municipality, 10.34 miles (16.64 km) by Hudson County and 12.23 miles (19.68 km) by the New Jersey Department of Transportation and 6.12 miles (9.85 km) by the New Jersey Turnpike Authority.[223], 155746=As of March 23, 2011, there was a total of 120,229 registered voters in Jersey City, of whom 58,194 (48.4%) were registered as Democrats, 7,655 (6.4%) were registered as Republicans, and 54,293 (45.2%) were registered as Unaffiliated. There were 87 voters registered to other parties.[173], 49038=From 1917 to 1947, Jersey City was governed by Mayor Frank Hague. Originally elected as a candidate supporting reform in governance, the Jersey City History Web Site says his name is \"synonymous with the early twentieth century urban American blend of political favoritism and social welfare known as bossism.\" Hague ran the city with an iron fist while, at the same time, molding governors, United States senators, and judges to his whims. Boss Hague was known to be loud and vulgar, but dressed in a stylish manner earning him the nickname \"King Hanky-Panky\".[50] In his later years in office, Hague would often dismiss his enemies as \"reds\" or \"commies\". Hague lived like a millionaire, despite having an annual salary that never exceeded $8,500. He was able to maintain a fourteen-room duplex apartment in Jersey City, a suite at the Plaza Hotel in Manhattan, and a palatial summer home in Deal, and travel to Europe yearly in the royal suites of the best ocean liners.[51], 178264=Jersey City is the filming location for the 2012 reality television series Snooki & JWoww, a spinoff of Jersey Shore that stars Nicole \"Snooki\" Polizzi and Jennifer \"JWoww\" Farley living at a former firehouse at 38 Mercer Street at Grove Street in Downtown Jersey City.[206], 47345=Jersey City was a dock and manufacturing town for much of the 19th and 20th centuries. Much like New York City, Jersey City has always been a destination for new immigrants to the United States. In its heyday before World War II, German, Irish, and Italian immigrants found work at Colgate, Chloro or Dixon Ticonderoga. In 1908, the first permanent, drinking water disinfection system in the U.S. was installed on the water supply for the City by John L. Leal.[48] The Hudson Tubes opened in 1911, allowing passengers to take the train to Manhattan as an alternative to the extensive ferry system. The Black Tom explosion occurred on July 30, 1916, as an act of sabotage on American ammunition supplies by German agents to prevent the materials from being used by the Allies in World War I.[49], 133297=Liberty State Park is home to Central Railroad of New Jersey Terminal, the Interpretive Center, and Liberty Science Center, an interactive science and learning center. The center, which first opened in 1993 as New Jersey's first major state science museum, has science exhibits, the world's largest IMAX Dome theater, numerous educational resources, and the original Hoberman sphere.[140] From the park, ferries travel to both Ellis Island and the Immigration Museum and Liberty Island, site of the Statue of Liberty.[141], 169430=Jersey City also has 12 charter schools, which are run under a special charter granted by the Commissioner of the New Jersey Department of Education, including the Mathematics, Engineering, Technology and Science Charter School (for grades 6 - 12) and the Dr. Lena Edwards Charter School (for K-8), which were approved in January 2011.[190], 89664=As of the 2010 Census, Jersey City experienced an increase of 7,542 residents (3.1%) from its 2000 Census population of 240,055.[12][22] Since it was believed the earlier population was under documented, the 2010 census was anticipated with the possibility that Jersey City might become the state's most populated city, surpassing Newark.[94] The city hired an outside firm to contest the results, citing the fact that development in the city between 2000 and 2010 substantially increased the number of housing units and that new populations may have been undercounted by as many as 30,000 residents based on the city's calculations.[95][96] Preliminary findings indicated that 19,000 housing units went uncounted.[97], 127944=Also in 2014, Forbes magazine moved its headquarters to Jersey City, having been awarded a $27 million tax grant in exchange for bringing 350 jobs to the city over a ten-year period.[134], 126214=Jersey City is home to the headquarters of Verisk Analytics[129] and Lord Abbett, a privately held money management firm.[130] Companies such as Computershare, ICAP, ADP, and Fidelity Investments also conduct operations in the city.[131] Goya Foods, which had been headquartered in adjacent Secaucus, opened a new headquarters including a 600,000-square-foot warehouse and distribution center in Jersey City in April 2015.[132], 166204=Dr. Ronald E. McNair Academic High School was the second-ranked public high school in New Jersey out of 322 schools statewide, in New Jersey Monthly magazine's September 2010 cover story on the state's \"Top Public High Schools\", after being ranked second in 2008 out of 316 schools.[185] and was selected as 41st best high school in the United States in Newsweek magazine's national 2011 survey.[186] William L. Dickinson High School is the oldest high school in the city and one of the largest schools in Hudson County in terms of student population. Opened in 1906 as the Jersey City High School it is one of the oldest school sites in the city, it is a four-story Beaux-Arts building located on a hilltop facing the Hudson River.[187] Liberty High School is also one of the top schools in the Heights and the only high school that focuses on all academics. Other public high schools in Jersey City are James J. Ferris High School, Lincoln High School, and Henry Snyder High School. The Hudson County Schools of Technology (which also has campuses in North Bergen and Secaucus) has a campus in Jersey City, which includes County Prep High School.[188], 43890=Soon after the Civil War, the idea arose of uniting all of the towns of Hudson County east of the Hackensack River into one municipality. A bill was approved by the state legislature on April 2, 1869, with a special election to be held October 5, 1869. An element of the bill provide that only contiguous towns could be consolidated. While a majority of the voters across the county approved the merger, the only municipalities that had approved the consolidation plan and that adjoined Jersey City were Hudson City and Bergen City.[39] The consolidation began on March 17, 1870, taking effect on May 3, 1870.[40] Three years later the present outline of Jersey City was completed when Greenville agreed to merge into the Greater Jersey City.[38][41], 116182=There were an estimated 65,604 African Americans in Jersey City, according to the 2013 American Community Survey,[103] representing a 2.5% increase from 64,002 African Americans enumerated in the 2010 United States Census.[104] This is in contrast with Hudson County overall, where there were an estimated 83,576 African Americans, according to the 2013 American Community Survey,[103] representing a 0.4% decrease from 83,925 African Americans enumerated in the 2010 United States Census.[112] However, modest growth in the African immigrant population, most notably the growing Nigerian American and Kenyan American populations[113][114] in Jersey City, is partially offsetting the decline in the city's American-born black population, which as a whole has been experiencing an exodus from northern New Jersey to the Southern United States.[115], 85995=At the 2010 United States Census, there were 247,597 people, 96,859 households, and 57,631 families residing in the city. The population density was 16,736.6 per square mile (6,462.0/km2). There were 108,720 housing units at an average density of 7,349.1 per square mile (2,837.5/km2). The racial makeup of the city was 32.67% (80,885) White, 25.85% (64,002) Black or African American, 0.51% (1,272) Native American, 23.67% (58,595) Asian, 0.07% (161) Pacific Islander, 12.81% (31,726) from other races, and 4.42% (10,956) from two or more races. Hispanics or Latinos of any race were 27.57% (68,256) of the population.[12], 64484=Newport and Exchange Place are redeveloped waterfront areas consisting mostly of residential towers, hotels and office buildings. Newport is a planned mixed-use community, built on the old Erie Lackawanna Railway yards, made up of residential rental towers, condominiums, office buildings, a marina, schools, restaurants, hotels, Newport Centre Mall, a waterfront walkway, transportation facilities, and on-site parking for more than 15,000 vehicles. Newport had a hand in the renaissance of Jersey City although, before ground was broken, much of the downtown area had already begun a steady climb (much like Hoboken). In recent years, this area of Jersey City has undergone gentrification that has seen the improvement in neighborhoods. This has also caused a rise of the standard of living throughout the city. Downtown also includes The Newport Centre area, which is also home of the Westin Hotel.[71] Prior to the September 11 attacks Jersey City had 3 office towers over 100 meters. Since 9-11, another 3 more office towers and 10 residential buildings over 100 meters have been completed.[72], 71289=Previously the city of Hudson City, The Heights was incorporated into Jersey City in 1869.[39], 99581=There were an estimated 68,857 Hispanic Americans in Jersey City, according to the 2013 American Community Survey,[103] representing a 0.9% increase from 68,256 Hispanic Americans enumerated in the 2010 United States Census.[104] Immigrants from South America, led by Ecuador, are a growing component of Jersey City's population/[101] Puerto Rican Americans constitute the largest Hispanic group in Jersey City.[103] While Cuban Americans are not as highly concentrated in Jersey City as they are in northern Hudson County, Jersey City hosts the annual Cuban Parade and Festival of New Jersey at Exchange Place on its downtown waterfront.[105], 36334=Scattered communities of farmsteads characterized the Dutch settlements at Pavonia: Communipaw, Harsimus, Paulus Hook, Hoebuck, Awiehaken, and other lands \"behind Kil van Kull\". The first village (located inside a palisaded garrison) established on what is now Bergen Square in 1660, and is considered to be the oldest town in what would become the state of New Jersey.[32], 50889=After Hague's retirement from politics, a series of mayors including John V. Kenny, Thomas J. Whelan and Thomas F. X. Smith attempted to take control of Hague's organization, usually under the mantle of political reform. None were able to duplicate the level of power held by Hague,[52] but the city and the county remained notorious for political corruption for years.[53][54][55] By the 1970s, the city experienced a period of urban decline that saw many of its wealthy residents leave for the suburbs, rising crime, civil unrest, political corruption, and economic hardship. From 1950 to 1980, Jersey City lost 75,000 residents, and from 1975 to 1982, it lost 5,000 jobs, or 9% of its workforce.[56], 88622=The Census Bureau's 2006-2010 American Community Survey showed that (in 2010 inflation-adjusted dollars) median household income was $54,280 (with a margin of error of +/- $1,460) and the median family income was $58,533 (+/- $2,116). Males had a median income of $49,582 (+/- $1,968) versus $43,458 (+/- $1,837) for females. The per capita income for the borough was $30,490 (+/- $668). About 15.1% of families and 17.5% of the population were below the poverty line, including 28.1% of those under age 18 and 15.6% of those age 65 or over.[93], 111606=Jersey City, highly accessible to Lower Manhattan in New York City and its Chinatown by rapid transit, was home to an estimated 7,437 Chinese Americans, according to the 2013 American Community Survey,[103] representing a notably rapid growth of 31.8% from the 5,643 Chinese Americans enumerated in the 2010 United States Census.[104], 177819=WFMU 91.1FM (WMFU 90.1FM in the Hudson Valley), the longest running freeform radio station in the US, moved to Jersey City in 1998.[205] WSNR-620 AM is also licensed in the city., 102063=There were an estimated 27,108 Puerto Rican Americans in Jersey City, according to the 2013 American Community Survey,[103] representing a 5.6% increase from 25,677 Puerto Rican Americans enumerated in the 2010 United States Census.[104], 16857=Jersey City is the second-most populous city in the U.S. state of New Jersey,[22] after Newark. It is the seat[23][24] of Hudson County, as well as the county's largest city. As of 2014, Jersey City's Census-estimated population was 262,146,[15] with the largest population increase of any municipality in New Jersey since 2010,[25] representing an increase of 5.9% from the 2010 United States Census, when the city's population was enumerated at 247,597.[14][26], 139576=The mayor is Steven Fulop, who won the mayoral election in 2013.[6] The Business Administrator is Robert Kakoleski.[148] The City Clerk is Robert Byrne.[10], 136329=Since 1992, the Hudson Shakespeare Company has been the resident Shakespeare festival of Hudson County performing a free Shakespeare production for each month of the summer throughout various parks in the city. The group regularly performs at Hamilton Park (9th Street & Jersey Avenue), Van Vorst Park (Jersey Avenue & Montgomery Street), and The Historic Jersey City and Harsimus Cemetery (435 Newark Avenue).[146], 158592=In the 2013 gubernatorial election, Democrat Barbara Buono received 66.5% of the vote (20,421 cast), ahead of Republican Chris Christie with 31.8% (9,784 votes), and other candidates with 1.7% (514 votes), among the 32,347 ballots cast by the city's 139,265 registered voters (1,628 ballots were spoiled), for a turnout of 23.2%.[178][179] In the 2009 gubernatorial election, Democrat Jon Corzine received 76.2% of the vote (29,817 ballots cast), ahead of Republican Chris Christie with 18.7% (7,336 votes), Independent Chris Daggett with 3.2% (1,263 votes) and other candidates with 0.9% (371 votes), among the 39,143 ballots cast by the city's 120,269 registered voters, yielding a 32.5% turnout.[180], 127644=In 2014, Paul Fireman proposed a 95-story tower for Jersey City that would include a casino. The project, which endorsed by Mayor Steve Fulop, would cost an estimated $4.6 billion.[133], 107433=Seven per cent (7%) of Jersey City's population is Filipino.[109] The Five Corners district is home to a thriving Filipino community and Jersey City's Little Manila, which is the second largest Asian American subgroup in the city. A variety of Filipino restaurants, shippers and freighters, doctors' officers, bakeries, stores, and an office of The Filipino Channel have made Newark Avenue their home. The largest Filipino-owned grocery store on the East Coast of the United States, Phil-Am Food, has been there since 1973.[citation needed] An array of Filipino-owned businesses can also be found at the section of West Side of Jersey City, where many of its residents are of Filipino descent. In 2006, a Red Ribbon pastry shop, one of the Philippines' most famous food chains, opened its first branch on the East Coast in the Garden State.[1] Manila Avenue in Downtown Jersey City was named for the Philippine capital city because of the many Filipinos who built their homes on this street during the 1970s. A memorial, dedicated to the Filipino American veterans of the Vietnam War, was built in a small square on Manila Avenue. A park and statue dedicated to Jose P. Rizal, a national hero of the Philippines, exists in downtown Jersey City.[110] Jersey City is the host of the annual Philippine-American Friendship Day Parade, an event that occurs yearly in June, on its last Sunday. The City Hall of Jersey City raises the Philippine flag in correlation to this event and as a tribute to the contributions of the Filipino community. The Santakrusan Procession along Manila Avenue has taken place since 1977.[111] There were an estimated 16,974 Filipino Americans in Jersey City, according to the 2013 American Community Survey,[103] representing a 4.7% increase from 16,213 Filipino Americans enumerated in the 2010 United States Census.[104], 156418=In the 2012 presidential election, Democrat Barack Obama received 85.5% of the vote (64,052 cast), ahead of Republican Mitt Romney with 13.5% (10,120 votes), and other candidates with 1.0% (751 votes), among the 75,506 ballots cast by the city's 133,197 registered voters (583 ballots were spoiled), for a turnout of 56.7%.[174][175] In the 2008 presidential election, Democrat Barack Obama received 81.8% of the vote (65,780 cast), ahead of Republican John McCain with 16.8% (13,529 votes) and other candidates with 0.7% (584 votes), among the 80,381 ballots cast by the city's 139,158 registered voters, for a turnout of 57.8%.[176] In the 2004 presidential election, Democrat John Kerry received 74.5% of the vote (52,979 ballots cast), out polling Republican George W. Bush with 22.8% (16,216 votes) and other candidates with 0.5% (559 votes), among the 71,130 ballots cast by the city's 119,723 registered voters, for a turnout percentage of 59.4.[177], 54094=City Ordinance 13.097, passed in October 2013, requires employers with ten or more employees to offer up to five paid sick days a year. The bill impacts all businesses employing workers who work at least 80 hours a calendar year in Jersey City.[59], 41535=The City of Jersey was incorporated by an Act of the New Jersey Legislature on January 28, 1820, from portions of Bergen Township, while the area was still a part of Bergen County. The city was reincorporated on January 23, 1829, and again on February 22, 1838, at which time it became completely independent of North Bergen and was given its present name. On February 22, 1840, it became part of the newly created Hudson County.[38], 201585=A part of the East Coast Greenway, a planned unbroken bike route from Maine to the Florida Keys, will travel through the city. In June 2012, part of the route was officially designated in Lincoln Park and over the Lincoln Highway Hackensack River Bridge.[224][225] Both the Hudson River Waterfront Walkway and Hackensack RiverWalk are bicycle friendly.[226] In April 2012, the city initiated the Morris Canal Greenway Plan to investigate the establishment of a greenway, including a bicycle path, that would follow the route of the Morris Canal to the greatest extent possible.[227][228][229] in the same month, the city established bikes lanes along the length Grove Street, originally meant to temporary. In December 2012, the city announced that Grove Street lanes would become permanent and that it would add an additional 54 miles (87 km) of both dedicated and shared bike lanes.[230] The Harbor Ring is an initiative to create a 50-mile bike route along the Lower Hudson River, Upper New York Bay, and Kill van Kull that would incorporate bike paths in the city.[231][232][233] In 2013, the city simplified the application and reduced the cost for business and residences to install bike racks as well as making them obligatory for certain new construction projects.[234] Hudson County has initiated exploration of a bike-share program.[235] Jersey City, Hoboken and Weehawken intended to operate the program starting 2014[236] but delayed the launch due to lack of sponsorship.[237], 170724=The Roman Catholic Archdiocese of Newark maintains a network of elementary and secondary Catholic schools serve every area of Jersey City. High schools administered by the Archdiocese are Hudson Catholic Regional High School, St. Anthony High School, Saint Dominic Academy and St. Peter's Preparatory School.[191] St. Mary High School closed in June 2011 due to declining enrollment.[192], 102896=There were an estimated 60,922 Asian Americans in Jersey City, according to the 2013 American Community Survey,[103] representing a 4.0% increase from 58,595 Asian Americans enumerated in the 2010 United States Census.[104], 32327=The land comprising what is now Jersey City was inhabited by the Lenape, a collection of tribes (later called Delaware Indian). In 1609, Henry Hudson, seeking an alternate route to East Asia, anchored his small vessel Halve Maen (English: Half Moon) at Sandy Hook, Harsimus Cove and Weehawken Cove, and elsewhere along what was later named the North River. After spending nine days surveying the area and meeting its inhabitants, he sailed as far north as Albany. By 1621, the Dutch West India Company was organized to manage this new territory and in June 1623, New Netherland became a Dutch province, with headquarters in New Amsterdam. Michael Reyniersz Pauw received a land grant as patroon on the condition that he would establish a settlement of not fewer than fifty persons within four years. He chose the west bank of the North River (Hudson River) and purchased the land from the Lenape. This grant is dated November 22, 1630 and is the earliest known conveyance for what are now Hoboken and Jersey City. Pauw, however, was an absentee landlord who neglected to populate the area and was obliged to sell his holdings back to the Company in 1633.[29] That year, a house was built at Communipaw for Jan Evertsen Bout, superintendent of the colony, which had been named Pavonia (the Latinized form of Pauw's name, which means peacock).[30] Shortly after, another house was built at Harsimus Cove and became the home of Cornelius Van Vorst, who had succeeded Bout as superintendent, and whose family would become influential in the development of the city. Relations with the Lenape deteriorated, in part because of the colonialist's mismanagement and misunderstanding of the indigenous people, and led to series of raids and reprisals and the virtual destruction of the settlement on the west bank. During Kieft's War, approximately eighty Lenapes were killed by the Dutch in a massacre at Pavonia on the night of February 25, 1643.[31], 38187=Among the oldest surviving houses in Jersey City are the Newkirk House (1690),[33] the Van Vorst Famhouse (1740),[34][35][36] and the Van Wagenen House (1742). During the American Revolutionary War, the area was in the hands of the British who controlled New York. In the Battle of Paulus Hook Major Light Horse Harry Lee attacked a British fortification on August 19, 1779. After this war, Alexander Hamilton and other prominent New Yorkers and New Jerseyeans attempted to develop the area that would become historic downtown Jersey City and laid out the city squares and streets that still characterize the neighborhood, giving them names also seen in Lower Manhattan or after war heroes (Grove, Varick, Mercer, Wayne, Monmouth, and Montgomery among them). During the 19th century, former slaves reached Jersey City on one of the four routes of the Underground Railroad that led to the city.[37], 113787=There were an estimated 54,626 non-Hispanic whites in Jersey City, according to the 2013 American Community Survey,[103] representing a 2.6% increase from 53,236 non-Hispanic whites enumerated in the 2010 United States Census.[104] Many non-Hispanic whites have settled in the newer developments in the Newport and Exchange Place neighborhoods along the Jersey City waterfront., 92304=As of the 2000 United States Census the population was 240,055 making Jersey City the 72nd most populous city in the U.S.[98] Among cities with a population higher than 100,000 ranked in the 2000 Census, Jersey City was the fourth most densely populated large city in the United States, behind New York City; Paterson, New Jersey; and San Francisco.[99] There were 88,632 households, and 55,660 families residing in the city. The population density was 16,093.7/mi2 (6,212.2/km2). There were 93,648 housing units at an average density of 6,278.3 per square mile (2,423.4/km2). The racial makeup of the city was 34.01% White, 28.32% African American, 0.45% Native American, 16.20% Asian, 0.08% Pacific Islander, 15.11% from other races, and 5.84% from two or more races. Hispanic or Latino of any race were 28.31% of the population.[87][88], 124502=Jersey City has several shopping districts, some of which are traditional main streets for their respective neighborhoods, such as Central, Danforth, and West Side Avenues. Journal Square is a major commercial district. Newport Mall is a regional shopping area.[126] Portions of the city are part of an Urban Enterprise Zone. In addition to other benefits to encourage employment within the Zone, shoppers can take advantage of a reduced 3½% sales tax rate (versus the 7% rate charged statewide) at eligible merchants.[127] In February 2014, New Jersey State Senate President Stephen Sweeney argued that Jersey City, among other distressed cities, could benefit from a casino—were construction of one outside of Atlantic City eventually permitted by New Jersey.[128], 56175=Jersey City is the seat of Hudson County, New Jersey, and the second-largest city in New Jersey.[22] According to the United States Census Bureau, the city had a total area of 21.080 square miles (54.596 km2), including 14.794 square miles (38.316 km2) of land and 6.286 square miles (16.281 km2) of water (29.82%).[4][5] As of the 1990 Census, it had the smallest land area of the 100 most populous cities in America.[60], 20227=After a peak population of 316,715 measured in the 1930 Census, the city's population saw a half-century long decline to a low of 223,532 in the 1980 Census, but since then the city's population has grown, with the 2010 population reflecting an increase of 7,542 (+3.1%) from the 240,055 counted in the 2000 Census, which had in turn increased by 11,518 (+5.0%) from the 228,537 counted in the 1990 Census.[27][28], 104115=India Square, also known as \"Little India\" or \"Little Bombay\",[91] home to the highest concentration of Asian Indians in the Western Hemisphere,[92] is a rapidly growing Indian American ethnic enclave in Jersey City. Indian Americans comprised 10.9% of the overall population of Jersey City in 2010,[12] the highest proportion of any major U.S. city. India Square has been home to the largest outdoor Navratri festivities in New Jersey as well as several Hindu temples;[106] while an annual, color-filled spring Holi festival has taken place in Jersey City since 1992, centered upon India Square and attracting significant participation and international media attention.[107][108] There were an estimated 27,603 Indian Americans in Jersey City, according to the 2013 American Community Survey,[103] representing a 1.8% increase from 27,111 Indian Americans enumerated in the 2010 United States Census.[104], 189374=The Journal Square Transportation Center, Exchange Place, and Hoboken Terminal (just over the city line's northeast corner) are major origination/destination points for buses. Service is available to numerous points within Jersey City, Hudson County, and some suburban areas as well as to Newark on the 1, 2, 6, 10, 22, 64, 67, 68, 80, 81, 82, 83, 84, 85, 86, 87, 88, 123, 125, 305, 319 lines.[216] Also serving Jersey City are various lines operated by Academy Bus and A&C Bus. Increased use of jitneys, locally known as dollar vans, have greatly affected travel patterns in Hudson County, leading to decreased bus ridership on traditional bus lines. After studies examining existing systems and changes in public transportation usage patterns it was determined that a Journal Square-Bayonne bus rapid transit system should be investigated. In 2012 the Board of Chosen Freeholders authorized the identification of possible BRT corridors.[217][218][219][220][221], 118531=Arab Americans numbered an estimated 14,518 individuals in Hudson County as per the 2012 American Community Survey, representing 2.3% of the county's total population.[116] the second highest percentage in New Jersey after Passaic County.[117] Arab Americans are most concentrated in Jersey City, led by Egyptian Americans, including the largest population of Coptic Christians in the United States.[101][102] There is a notable Moroccan American population in Jersey City., 123526=A 2011 survey of census data shows Jersey City to have one the nation's highest percentages of artists-in-residence, leading The Atlantic magazine to call it the 10th most artistic city in the USA.[123][124][125], 142264=Jersey City is split between the 8th and 10th Congressional Districts[151] and is part of New Jersey's 31st and 33rd state legislative districts.[13][152][153] Prior to the 2011 reapportionment following the 2010 Census, Jersey City had been in the 31st, 32nd and the 33rd state legislative districts.[154] Prior to the 2010 Census, Jersey City had been split between the 9th Congressional District, 10th Congressional District and the 13th Congressional District, a change made by the New Jersey Redistricting Commission that took effect in January 2013, based on the results of the November 2012 general elections.[154] The split that went into effect in 2013 placed 111,678 residents living in the city's north and east in the 8th District, while 139,519 residents in the southwest portion of the city were placed in the 10th District.[151][155], 140197=Jersey City is governed under the Faulkner Act (Mayor-Council) form of municipal government by a mayor and a nine-member city council. The city council consists of six members elected from wards[149] and three elected at large, all elected to four-year terms on a concurrent basis in non-partisan elections.[21][69] As of 2015[update], members of the City Council are Council President Rolando R. Lavarro, Jr., Daniel Rivera (at Large), Joyce Watterman (at Large), Frank Gajewski (Ward A - Greenville), Khemraj “Chico” Ramchal (Ward B - West Side), Richard Boggiano (Ward C - Journal Square), Michael Yun (Ward D - The Heights), Candice Osborne (Ward E - Downtown) and Diane Coleman (Ward F - Bergen/Lafayette), all of whom are serving concurrent terms of office running from July 1, 2013 until June 30, 2017.[150], 206432=Jersey City has participated in the sister city program since establishing a relationship with Cusco, Peru in 1988. Currently they have relationships with 12 international cities, showing a spirit of economic and cultural exchange and mutual friendship.[238], 94763=As of the 2000 Census, the most common reported ancestries were Italian (6.6%), Irish (5.6%), Polish (3.0%), Arab (2.8%), and German (2.7%).[100], 112799=New Jersey's largest Vietnamese American population resides in Jersey City. There were an estimated 1,947 Vietnamese Americans in Jersey City, according to the 2013 American Community Survey,[103] representing a robust 21.1% increase from 1,607 Vietnamese Americans enumerated in the 2010 United States Census.[104], 122670=There were 2,726 same-sex couples in Hudson County in 2010, with Jersey City being the hub,[121] prior to the commencement of same-sex marriages in New Jersey on October 21, 2013.[122]}",
    "lastModified": "Fri, 31 Jul 2015 10:16:40 GMT",
    "textBeforeTable": "Population sources: 1840-1920[78] 1840[79] 1850-1870[80] 1850[81] 1870[82] 1880-1890[83] 1890-1910[84] 1840-1930[85] 1930-1990[86] 2000[87][88] 2010[12][13][14] * = Gained territory in previous decade.[38] 5.9% [15][76][77] 262,146 Est. 2014 3.1% 247,597 2010 5.0% 240,055 2000 2.2% 228,537 1990 −14.1% 223,532 1980 −5.7% 260,350 1970 −7.7% 276,101 1960 −0.7% 299,017 1950 −4.9% 301,173 1940 6.2% 316,715",
    "textAfterTable": "2010 Census[edit] India Square, known as Little Bombay, [91] has the highest concentration of Asian Indians in the Western Hemisphere. [92] At the 2010 United States Census, there were 247,597 people, 96,859 households, and 57,631 families residing in the city. The population density was 16,736.6 per square mile (6,462.0/km2). There were 108,720 housing units at an average density of 7,349.1 per square mile (2,837.5/km2). The racial makeup of the city was 32.67% (80,885) White, 25.85% (64,002) Black or African American, 0.51% (1,272) Native American, 23.67% (58,595) Asian, 0.07% (161) Pacific Islander, 12.81% (31,726) from other races, and 4.42% (10,956) from two or more races. Hispanics or Latinos of any race were 27.57% (68,256) of the population.[12] There were 96,859 households, of which 27.3% had children under the age of 18 living with them, 35.5%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}