{
    "relation": [
        [
            "Player",
            "LeBron James",
            "Carmelo Anthony",
            "Josh Smith",
            "Chris Bosh",
            "Kevin Garnett",
            "Ersan Ilyasova",
            "Greg Monroe",
            "Paul Pierce",
            "Ryan Anderson",
            "Andre Iguodala",
            ""
        ],
        [
            "FGA TOC",
            "48",
            "52",
            "32",
            "20",
            "12",
            "17",
            "15",
            "8",
            "8",
            "8",
            "220"
        ],
        [
            "FG% TOC",
            "38.00%",
            "39.00%",
            "44.00%",
            "40.00%",
            "42.00%",
            "40.00%",
            "47.00%",
            "38.00%",
            "25.00%",
            "50.00%",
            "40.24%"
        ],
        [
            "FGA ToB",
            "42",
            "45",
            "40",
            "25",
            "34",
            "23",
            "35",
            "51",
            "30",
            "30",
            "355"
        ],
        [
            "FG% TOB",
            "64.00%",
            "56.00%",
            "45.00%",
            "44.00%",
            "44.00%",
            "70.00%",
            "51.00%",
            "35.00%",
            "29.00%",
            "43.00%",
            "47.75%"
        ]
    ],
    "pageTitle": "Chicago Bulls: Taj Gibson Must Start over Carlos Boozer with Derrick Rose Hurt | Bleacher Report",
    "title": "",
    "url": "http://bleacherreport.com/articles/1286083-chicago-bulls-taj-gibson-must-start-over-carlos-boozer-with-derrick-rose-hurt",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 26088999,
    "recordOffset": 26038225,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{148555=Copyright © 2015 Bleacher Report, Inc. Turner Broadcasting System, Inc. All Rights Reserved. BleacherReport.com is part of Bleacher Report - Turner Sports Network, part of the Turner Sports and Entertainment Network. Certain photos copyright © 2015 by Getty Images. Any commercial use or distribution without the express written consent of Getty Images is strictly prohibited.}",
    "textBeforeTable": "Here are the forwards who rank among the top 30 in Player Efficiency Rating and who have played at least 15 minutes with Gibson on the court versus how they played when he was on the bench.  Of course, the next argument could be that Gibson is benefiting from inferior competition since he is a bench player and not a starter. Of course, this overlooks the fact that he finishes many games and plays plenty of minutes against some of the best forwards in the game.  Only one player, Ronnie Brewer, had a better plus/minus with Gibson off the court, and that is negligibly better. When you couple that with the fact that the team is nearly a net nine points better with Gibson on the court than off of it, it looks like Gibson makes the team better.  -0.9 4.6 3.7 Ronnie Brewer 7.1 5 12.1 Richard Hamilton 6.6 -0.5 6.1 Omer Asik 2.4 5.5 7.9 Luol Deng 4.7 5.4 10.1 Kyle Korver 6.4 6.3 12.7 John Lucas III 1.8 5.1 6.9 Joakim Noah 14.1 -1.6 12.5 Jimmy Butler 4.2 6.5",
    "textAfterTable": "As you can see, the best forwards in the Eastern Conference for the most part fare far worse when Gibson is on the court. I included both small forwards and power forwards because Gibson will frequently guard both. A quick look at the table reveals that only two players had a higher field-goal percentage with Gibson on the court than when he was off of it. This strongly suggests that forwards are better guarded while Gibson is on the court.  It also reveals that he was on it for nearly 40 percent of their field-goal attempts, which disproves the notion that he is \"padding\" his numbers by going against weaker competition. In fact, overall the players who are the best in the league only shot a tad over 40 percent while he was on the court, which is 7.5 percent worse than while he was off it.  So either he is consistently lucky and all his teammates play better while he is on the court, the Bulls suddenly get 10 net-points better, and superstars all start playing at a sub-par level the moment he steps on the court for some completely unrelated reason or he just makes the Bulls better.  Two words: Occam's razor.  When you connect the dots, it's obvious, Gibson makes the Bulls so much better of a team defensively, so they need him to play more minutes, and they need him to be a starter.  There is another reason though, and that has to do with",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}