{
    "relation": [
        [
            "Compound",
            "Cabazitaxel",
            "Epothilone B",
            "Epothilone D",
            "Podofilox",
            "Vincristine"
        ],
        [
            "Synonyms",
            "RPR-116258A",
            "EPO 906",
            "",
            "",
            "22-Oxovincaleukoblastine"
        ],
        [
            "Cas Number",
            "183133-96-2",
            "152044-54-7",
            "189453-10-9",
            "477-47-4",
            "57-22-7"
        ],
        [
            "Type",
            "target",
            "target",
            "target",
            "target",
            "target"
        ],
        [
            "Actions",
            "binder",
            "",
            "",
            "inhibitor",
            "inhibitor"
        ],
        [
            "PubMed IDs",
            "",
            "17016423 17139284",
            "17016423 17139284",
            "1411635 19286405 20657644 20810285 20814887",
            "11168494 20442307 20691709"
        ]
    ],
    "pageTitle": "TUBA4A Gene - GeneCards | TBA4A Protein | TBA4A Antibody",
    "title": "",
    "url": "http://www.genecards.org/cgi-bin/carddisp.pl?gene=TUBA4A&simap=7&rf=/home/genecards/current/website/carddisp.pl",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00201-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479007179,
    "recordOffset": 478923976,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{79913=Microtubules of the eukaryotic cytoskeleton perform essential and diverse functions and are composed of a heterodimer of alpha and beta tubulin. The genes encoding these microtubule constituents are part of the tubulin superfamily, which is composed of six distinct families. Genes from the alpha, beta and gamma tubulin families are found in all eukaryotes. The alpha and beta tubulins represent the major components of microtubules, while gamma tubulin plays a critical role in the nucleation of microtubule assembly. There are multiple alpha and beta tubulin genes and they are highly conserved among and between species. This gene encodes an alpha tubulin that is a highly conserved homolog of a rat testis-specific alpha tubulin. Alternatively spliced transcript variants encoding different isoforms have been found for this gene. [provided by RefSeq, Jun 2013]}",
    "textBeforeTable": "Gene Ontology (GO) - Molecular Function for TUBA4A Gene TBA4A_HUMAN,P68366 UniProtKB/Swiss-Prot Function: Tubulin is the major constituent of microtubules. It binds two moles of GTP, one at an exchangeable site on the beta chain and one at a non-exchangeable site on the alpha chain Molecular function for TUBA4A Gene Flow Cytometry In Situ Assay Cell Line Clone Inhibitory RNA miRNA CRISPR Animal Model Products: Function for TUBA4A Gene eBioscience FlowRNA Probe Sets Flow Cytometry Products",
    "textAfterTable": "Subcellular locations from COMPARTMENTS Compartment Confidence cytoskeleton 5 cytosol 4 extracellular 4 Gene Ontology (GO) - Cellular Components for TUBA4A Gene GO ID Qualified GO term Evidence PubMed IDs GO:0005576 extracellular region TAS -- GO:0005829 cytosol TAS -- GO:0005874 microtubule",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}