{
    "relation": [
        [
            "",
            "January",
            "February",
            "March",
            "April",
            "May",
            "June",
            "July",
            "August",
            "September",
            "October",
            "November",
            "December"
        ],
        [
            "2008 % Change",
            "1.8",
            "-0.2",
            "-1.7",
            "0.6",
            "-0.1",
            "-0.4",
            "0.2",
            "-1.7",
            "-1.0",
            "-1.1",
            "-2.5",
            "-3.6"
        ],
        [
            "2009 % Change",
            "-2.4",
            "2.8",
            "-4.0",
            "-1.6",
            "0.3",
            "1.0",
            "1.6",
            "1.5",
            "-0.5",
            "-0.7",
            "2.9",
            "0.6"
        ],
        [
            "2010 % Change",
            "0.5",
            "1.1",
            "1.2",
            "0.1",
            "0.5",
            "-0.1",
            "0.3",
            "-0.4",
            "1.1",
            "0.2",
            "-0.7",
            "2.4"
        ],
        [
            "2011 % Change",
            "1.0",
            "(R) -1.4",
            "(P) 2.0",
            "(P) -1.0",
            "(P) -1.8",
            "(P) 2.6",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Freight Shipments Rose 2.6% in June from May | Bureau of Transportation Statistics",
    "title": "",
    "url": "http://www.rita.dot.gov/bts/sites/default/files/rita_archives/bts_press_releases/2011/bts040_11/html/bts040_11.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00003-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 679308471,
    "recordOffset": 679284496,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20895=Combined Index: The combined freight and passenger TSI rose 1.7 percent in June from its May level (Table 8). The combined TSI June 2011 level of 110.3 was 3.8 percent higher than the June 2010 level (Table 9). The combined index is down 1.3 percent in five years and up 10.8 percent in 10 years despite recent declines (Table 5). The combined TSI rose 0.5 percent in the second quarter, for the eighth consecutive quarterly increase (Table 12). The combined TSI merges the freight and passenger indexes into a single index., 22367=More information about the comprehensive revision conducted with the March release is provided under 2011 Comprehensive Revision at http://www.bts.gov/xml/tsi/src/index.xml., 21496=Revisions: TSI numbers for February (Freight, Passenger and Combined) were revised because of revisions in the output data of the component transportation services. The February Freight TSI is 106.4, revised from the 106.5 reported in last month's release. The February Passenger TSI is 113.3, revised from 112.9. The February Combined TSI is 108.2, unchanged from 108.2. The TSI for March, April, May and June are preliminary., 19058=Same month of previous year: Although freight shipments rose 4.1 percent from June 2010 to June 2011, they remain below the early recession level of June 2008 (109.7) and the all-time high for the month of June (111.9) reached in 2006 (Table 4)., 57576=NOTE: The percent changes to June 2011 are all preliminary., 17686=Trend: Freight shipments have increased in 18 of the last 26 months rising 1.3 percent in the past six months (Table 2). Shipments rose 14.5 percent over the last 26 months, starting in May 2009 but after declining 15.5 percent in the previous 15 months shipment remain below the February 2008 level. In June 2011, freight shipments returned to about the same level as August 2008 which was the start of six straight months of decline (Table 2A). For additional historic data, go to http://www.bts.gov/xml/tsi/src/index.xml., 18294=Year-to-date: For the first six months of 2011, freight shipments measured by the index were up 1.3 percent (Table 3)., 18820=Long-term trend: Freight shipments are down 3.2 percent in the five years from June 2006. Shipments are up 9.9 percent in the 10 years from June 2001 despite recent declines (Table 5)., 16575=Wednesday, Aug. 10, 2011 - The amount of freight carried by the for-hire transportation industry rose 2.6 percent in June from May, rising after two monthly declines, according to the U.S. Department of Transportation's Bureau of Transportation Statistics' (BTS) Freight Transportation Services Index (TSI) released today (Table 1)., 20167=Passenger Index: The TSI for passengers fell 0.5 percent in June from its May level (Table 6). The Passenger TSI June 2011 level of 115.7 was 2.8 percent above the June 2010 level (Table 7). The index is up 3.9 percent in five years and up 13.8 percent in 10 years (Table 5). The Passenger TSI rose 2.3 percent in the second quarter, following two consecutive quarterly declines (Table 11)., 18466=Index highs and lows: Freight shipments in June (108.3 on the index) rose 14.9 percent from the recent low in April 2009 (94.3). In April 2009, freight shipments were at their lowest level since June 1997 (92.3). The June 2011 level is down 4.4 percent from the historic freight shipment peak reached in January 2005 (113.3)., 16222=Freight Transportation Services Index, July 2009-June 2011, 19357=2nd Quarter Changes: The Freight TSI fell 0.2 percent in the second quarter, the first quarterly decline since the second quarter of 2009 (Table 10)., 16954=BTS, a part of the Research and Innovative Technology Administration, reported that freight shipments in June measured by the Freight TSI rose to their second highest level since August 2008, exceeded only by those in March (Table 2A). The 2.6 percent May-to-June increase was the biggest month-to-month rise since November 2009 (Table 2)., 19559=The TSI is a seasonally adjusted index that measures changes from the monthly average of the base year of 2000. It includes historic data from 1990 to the present. Release of the July index is scheduled for Sept. 14.}",
    "lastModified": "Tue, 04 Aug 2015 07:27:05 GMT",
    "textBeforeTable": "Excel | CSV Table 1: Freight, Passenger and Combined Transportation Services Indexes since December 2010 Percent Change by Month (Seasonally Adjusted, Monthly Average of 2000 = 100) More information about the comprehensive revision conducted with the March release is provided under 2011 Comprehensive Revision at http://www.bts.gov/xml/tsi/src/index.xml. TSI revision policy: TSI is updated monthly with the latest four months' index numbers considered preliminary. Each month BTS releases the latest preliminary TSI, and replaces the oldest preliminary TSI with a revised TSI. More information about the monthly revision policy, is available at http://www.bts.gov/xml/tsi/src/index.xml Revisions: TSI numbers for February (Freight, Passenger and Combined) were revised because of revisions in the output data of the component transportation services. The February Freight TSI is 106.4, revised from the 106.5 reported in last month's release. The February Passenger TSI is 113.3, revised from 112.9. The February Combined TSI is 108.2, unchanged from 108.2. The TSI for March, April, May and June are preliminary. Combined Index: The combined freight and passenger TSI rose 1.7 percent in June from its May level (Table 8). The combined TSI June 2011 level of 110.3 was 3.8 percent higher than the June 2010 level (Table 9). The combined index is down 1.3 percent in five years and up 10.8 percent in 10 years despite recent declines (Table 5). The combined TSI rose 0.5 percent in the second quarter, for the eighth consecutive quarterly increase (Table 12). The combined TSI merges the",
    "textAfterTable": "2011 % Change January 1.8 -2.4 0.5 1.0 February -0.2 2.8 1.1 (R) -1.4 March -1.7 -4.0 1.2 (P) 2.0 April 0.6 -1.6 0.1 (P) -1.0 May -0.1 0.3 0.5 (P) -1.8 June -0.4 1.0 -0.1 (P) 2.6 July 0.2 1.6 0.3   August -1.7 1.5 -0.4   September -1.0 -0.5 1.1   October",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}