{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "101"
        ],
        [
            "Name",
            "HDVideoKalahari",
            "HDVideoSavannah",
            "HDVideoCongo",
            "HDVideoCape",
            "HDVideoSahara",
            "HDVideoThe Future",
            "HDVideoBehind the Scenes: Nambia & Central African Republic"
        ],
        [
            "Description",
            "In Africa’s ancient south west corner, two extraordinary deserts sit side by side and host some",
            "East Africa is a land which is constantly changing. To survive here, creatures must be able to deal",
            "The Congo rainforest covers the very heart of Africa, it is the most dynamic habitat on the planet.",
            "Southern Africa is a riot of life and colour. But if it was not for two great ocean currents that",
            "North Africa is home to the greatest desert on Earth, the Sahara. This vast wilderness, the size of",
            "Over 80 years of wildlife filmmaking, the BBC Natural History Unit has chronicled the greatest",
            "We go behind the scenes with the Africa crew on some of their most challenging expeditions to"
        ],
        [
            "Time",
            "57:54",
            "57:57",
            "57:22",
            "57:05",
            "58:30",
            "58:24",
            "9:03"
        ],
        [
            "Price",
            "£2.49",
            "£2.49",
            "£2.49",
            "£2.49",
            "£2.49",
            "£2.49",
            "Series Only"
        ],
        [
            "",
            "View In iTunes",
            "View In iTunes",
            "View In iTunes",
            "View In iTunes",
            "View In iTunes",
            "View In iTunes",
            "View In iTunes"
        ]
    ],
    "pageTitle": "iTunes - TV Programmes - Africa",
    "title": "",
    "url": "https://itunes.apple.com/gb/tv-season/kalahari/id585233576?i=590495480",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00139-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 880769723,
    "recordOffset": 880749368,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{42827=Copyright © 2014 Apple Inc. All rights reserved.}",
    "lastModified": "Sat, 01 Aug 2015 10:06:00 GMT",
    "textBeforeTable": "An amazing new perspective on the landscapes and creatures of Africa's wildest places. This is the world’s wildest continent as you’ve never seen it before – an intense sensory adventure from the Atlas Mountains, through the Savannah lands to the Cape of Good Hope and from the Roof of Africa and the Kalahari to where the dark rainforests of the Congo meet the Atlantic Ocean. Each episode shifting the focus onto a different region as it contrasts the epic power of the landscape with the dramatic struggles of individual creatures living there. From hidden jungles and ice-blue glaciers to erupting volcanoes and lakes of poison, Africa explores an astonishing array of previously un-filmed locations and discovers bizarre new creatures and behaviours – including some of the rarest fish in the world, exploding insects and lizards that hunt on the backs of lions. This landmark five-part series utilises the latest filming technology to reveal the surprising environments, extraordinary creatures and other fascinating secrets of an amazing continent. Description Open iTunes to preview or buy TV programmes. AfricaHD iTunes for Mac + PC",
    "textAfterTable": "7 Episodes",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}