{
    "relation": [
        [
            "Season",
            "2009-10",
            "2010-11",
            "2011-12",
            "2012-13",
            "2013-14"
        ],
        [
            "G",
            "18",
            "18",
            "20",
            "24",
            "10"
        ],
        [
            "A",
            "31",
            "33",
            "31",
            "41",
            "36"
        ],
        [
            "PTS",
            "49",
            "51",
            "51",
            "65",
            "46"
        ],
        [
            "+/-",
            "-10",
            "-21",
            "5",
            "-10",
            "-31"
        ]
    ],
    "pageTitle": "Can the Edmonton Oilers afford to trade Sam Gagner? Can they afford not to? | OilersNation",
    "title": "",
    "url": "http://oilersnation.com/2014/3/18/can-the-edmonton-oilers-afford-to-trade-sam-gagner-can-they-afford-not-to-trade-him/score/page/1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00321-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 186821231,
    "recordOffset": 186791697,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29010=props to 1260 here..., 149357=LAST GAME - April 11th, 2015, 156499=Copyright © The Nation Network 2012 | Glyphicons Free licensed under CC BY 3.0 | Advertise with us!, 72602=http://blogs.edmontonjournal.com/2013/12/14/should-the-edmonton-oilers-trade-for-toronto-maple-leafs-forward-david-clarkson/, 39378=Gagner + 2015 2nd for Artem Anisimov., 75129=In mid-July 2013, Vic Michaels asked MacTavish if he was going to make any more moves to improve the team., 4610=Jonathan Willis March 18 2014 10:13AM, 149943=OCTOBER 2015, 4908=There is no more controversial player in Edmonton than Sam Gagner. The payoff for the difficult 2006-07 season, the still-young forward was supposed to be a primary piece for the Oilers to build around at centre. Instead, nearly 500 games into his NHL career, he continues to struggle., 126948=It really is too bad the Oiler \"braintrust\" decided they could use a defenseman who can't skate instead of selecting Boone Jenner in the 2011 draft. I guess you can never have enough left hand shooting defence prospects. Especially if they are family., 31016=@TKB2677, 72741=These are Clarkson's numbers so far: 47 games, 4 goals, 6 assists, 10 points, plus/minus -7, $5,250,000 cap hit until 2020.}",
    "textBeforeTable": "The following are Gagner’s totals (projected over 82 games) for the last five seasons: The argument against moving Gagner is equally simple. It’s a stupid idea from an asset management perspective to trade players during low ebbs in value. The Case Against Moving Every player makes mistakes, and thus any player can be made to look terrible on video. But from what I’ve seen, this is a mistake typical of Gagner. He doesn’t have the defensive commitment a centre needs. He cheats for offence. Justin Schultz grabs the puck at the blue line and jumps up ice. Gagner’s in the middle of the zone, behind the pinching Schultz and his two wingers, and sees it all happen. At about the two second mark, he’s at the far left of the screen about halfway up, watching a battle on the side boards. There’s a Carolina player just above and to the right of him. A good centre knows that, knows that Schultz (smartly) pinched, and covers for the defenceman. Gagner wanders past the Hurricanes forward and suddenly there’s a two-on-one, and eventually a goal against. Watch Gagner on this goal against from Edmonton’s last game in Carolina:  (edit: Michal Handzus) there last season, but very few teams can insulate their No. 2 centre with Jonathan Toews in the No. 1 role and people like Patrick Kane and Patrick Sharp and Marian",
    "textAfterTable": "Gagner is at a low ebb in goal-scoring, a low ebb in point-scoring and a particularly low ebb in plus/minus. I think that in this case the basic statistics reflect reality. He started the year injured, he came back and was brutal, and while he’s improved a little bit lately he simply hasn’t been the Gagner of past seasons. If the Oilers had traded Gagner two years ago, they likely would have had a better return. Ditto for last season. This year? We’re talking about the Oilers retaining salary and getting back Kyle Clifford. Bad NHL teams typically bleed talent. One of the reasons is because bad teams generally have managers who make bad decisions, but there’s more to it than that. Bad teams are under more pressure than good teams to move players in off years, because they need everyone performing at a top level just to get within visual range of respectability. Bad teams tend not to have a support system, so when the bottom falls out on a player it really falls out. Moving Gagner right now will see the Oilers get a 50 cents on the dollar return. What Should Edmonton Do? We are in a situation where the team has competing interests. It needs to get better in the No. 2 centre slot, which means trading Gagner away. But it also needs to get full value (or",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}