{
    "relation": [
        [
            "Recipient",
            "Blinn College",
            "Brazosport College",
            "Coastal Bend College",
            "Collin College",
            "Hill College",
            "Houston Community College",
            "Lamar Institute of Technology",
            "Lamar State College",
            "Lee College",
            "Navarro Community College",
            "North Central Texas College",
            "Ranger College",
            "San Jacinto College District",
            "South Plains College",
            "Tarrant County College District",
            "Texas State Technical College",
            "Weatherford College",
            "Alamo CC District Foundation",
            "Brazosport College Foundation",
            "Capital Idea",
            "Northeast Texas CC Foundation",
            "Project Quest",
            "Project Quest",
            "Project Quest",
            "South Texas College",
            "Tarrant County College Foundation",
            "Western Texas College Foundation"
        ],
        [
            "Location",
            "Brenham",
            "Lake Jackson",
            "Beeville",
            "McKinney",
            "Hillsboro",
            "Houston",
            "Beaumont",
            "Port Arthur",
            "Baytown",
            "Corsicana",
            "Gainesville",
            "Ranger",
            "Pasadena",
            "Levelland",
            "Fort Worth",
            "Waco",
            "Weatherford",
            "San Antonio",
            "Gulf Coast",
            "Rural Capital",
            "Northeast Texas",
            "San Antonio",
            "Dallas",
            "South Plains",
            "McAllen",
            "Fort Worth",
            "Snyder"
        ],
        [
            "Project",
            "Nursing (Advanced Simulation Equipment)",
            "Welding Simulation Trainers",
            "Aviation Maintenance Program",
            "Photovoltaic Solar Energy Training",
            "Welding Program Expansion",
            "Equipment for Solar, Thermal and Wind Certificate Programs",
            "Equipment Upgrades for Advanced Arc Welding Programs",
            "Simulated Medical Dispensing Systems",
            "Equipment for Industrial Systems Mechanics",
            "Industrial Welding Certification Program Equipment",
            "Simulated Hospital System",
            "Wind Energy Technician Program Equipment",
            "Newborn Baby Simulation System",
            "Hybrid Automotive Technology",
            "Neonatal Simulators",
            "Supercomputer purchase",
            "Patient Simulators & Virtual IV Systems for EMS Training",
            "Distance Learning Initiative (LVN to RN)",
            "Multiple Programs",
            "Multiple Programs",
            "Multiple Programs",
            "Multiple Programs",
            "Multiple Programs",
            "Multiple Programs",
            "Computer and Info Sciences",
            "CNC Machinists",
            "Multiple Programs"
        ],
        [
            "Grant Type",
            "Equipment",
            "Equipment",
            "Equipment",
            "Equipment",
            "Equipment",
            "Equipment",
            "Equipment",
            "Equipment",
            "Equipment",
            "Equipment",
            "Equipment",
            "Equipment",
            "Equipment",
            "Equipment",
            "Equipment",
            "Equipment",
            "Equipment",
            "Nonprofit",
            "Nonprofit",
            "Nonprofit",
            "Nonprofit",
            "Nonprofit",
            "Nonprofit",
            "Nonprofit",
            "Nonprofit",
            "Nonprofit",
            "Nonprofit"
        ],
        [
            "Award",
            "$350,000",
            "$215,760",
            "$149,700",
            "$124,490",
            "$204,900",
            "$338,300",
            "$62,500",
            "$56,985",
            "$166,286",
            "$243,808",
            "$177,130",
            "$202,182",
            "$294,005",
            "$210,222",
            "$276,494",
            "$126,550",
            "$313,656",
            "$61,754",
            "$170,950",
            "$225,000",
            "$255,000",
            "$180,000",
            "$396,000",
            "$404,000",
            "$500,000",
            "$441,660",
            "$227,500"
        ]
    ],
    "pageTitle": "Comptroller Awards $6.37 Million in Equipment and Job Training Grants",
    "title": "",
    "url": "http://www.cpa.state.tx.us/news2010/100329-jet.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 387078491,
    "recordOffset": 387069437,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18658=In December 2008, Combs released Texas Works, a report detailing the widening gap between the skills required in today’s job market and the number of graduates trained with those skills coming out of our education system. The report called for the state to establish a $25 million education fund to support career technical education, which the 81st Legislature created., 16628=Combs previously announced the first 13 recipients of $2.26 million of Job Building Fund grants in December 2009. In October 2009, the Comptroller awarded $3.5 million in the first round of Launchpad Funds to nine nonprofit organizations., 8900=For Immediate Release March 29, 2010}",
    "textBeforeTable": "“We’re using the Job Building Fund to help schools purchase cutting-edge equipment needed for high-demand career and technical education programs, training students for high-growth industries throughout the state in an era of rapidly increasing enrollment,” Combs said. “With the Launchpad Funds, priority was given to organizations whose students are expected to graduate and find jobs paying salaries equal to or greater than the prevailing wage for high-demand occupations in the region.” The chart below shows the recipient schools and organizations, their location, project, grant type and award amount. The Job Building Fund grants help finance equipment purchases for new career and technical education programs that support high-growth industries throughout the state. The Launchpad Fund supports and expands existing nonprofit programs with a proven track record of good performance. (AUSTIN) — Texas Comptroller Susan Combs today announced 17 colleges across the state will receive more than $3.51 million in Job Building Fund grants, while 10 nonprofit organizations will receive more than $2.86 million in Launchpad Funds through a program to help Texans get technical training for careers in fast-growing, high-demand occupations. Comptroller Awards $6.37 Million in Equipment and Job Training Grants For Immediate Release March 29, 2010 Contact: Allen Spelce R.J. DeSilva (512) 463-4070",
    "textAfterTable": "Combs previously announced the first 13 recipients of $2.26 million of Job Building Fund grants in December 2009. In October 2009, the Comptroller awarded $3.5 million in the first round of Launchpad Funds to nine nonprofit organizations. Texas public community colleges or technical institutes that receive Job Building Fund grants must provide matching funds in the form of cash, equipment, materials, supplies and/or personnel costs. The Comptroller’s office selected grant recipients based on each project’s potential economic return to the state and on endeavors that involve dual-credit programs with local high schools or cooperative arrangements with other colleges. Priority was given to projects that target high-demand occupations and new or emerging industries. Launchpad Funds support Texas nonprofit organizations with programs that prepare low-income students for careers in high-demand technical occupations, such as welding, computer support, engineering technology, nursing and allied health professions. These organizations are governed by boards that include community and business leaders and assist low-income students preparing to attend public community colleges or technical schools. Nonprofit organizations receiving Launchpad Funds must be community-based 501(c)(3) organizations that provide matching funding and can demonstrate that they have achieved or will achieve success, with priority given to those with programs for veterans or partnerships with community colleges, business organizations or economic development organizations. The money administered by the Comptroller comes from components of the Every Chance Funds, which include three categories of grants and scholarships over the biennium for career and technical education. In addition to the $10",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}