{
    "relation": [
        [
            "",
            "RANK",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            ""
        ],
        [
            "",
            "COMPANY",
            "Boeing",
            "Lockheed Martin",
            "Northrop Grumman",
            "General Dynamics",
            "Raytheon",
            "Honeywell International",
            "BAE Systems",
            "EADS",
            "United Technologies",
            "Finmeccanica",
            ""
        ],
        [
            "",
            "RESULTS ENDING",
            "Dec. 12",
            "Dec. 12",
            "Dec. 12",
            "Dec. 12",
            "Dec. 12",
            "Dec. 12",
            "Dec. 12",
            "Dec. 12",
            "Dec. 12",
            "Dec. 12",
            ""
        ],
        [
            "",
            "2012 REVENUE ($ millions)",
            "81,698",
            "47,182",
            "25,218",
            "31,513",
            "24,414",
            "37,665",
            "26,619",
            "73,493",
            "57,708",
            "22,405",
            ""
        ],
        [
            "",
            "TOTAL SCORE",
            "90",
            "84",
            "80",
            "75",
            "75",
            "74",
            "72",
            "66",
            "60",
            "36",
            ""
        ]
    ],
    "pageTitle": "Defense Feels Budget Squeeze, Fuel Savings Boost Civil Airframers | AWIN content from Aviation Week",
    "title": "2013 Aerospace & Defense Rankings, REVENUES GREATER THAN $20 BILLION",
    "url": "http://aviationweek.com/awin/defense-feels-budget-squeeze-fuel-savings-boost-civil-airframers",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00268-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 19587311,
    "recordOffset": 19558092,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14093=That is good news for contractors and suppliers, which are starting to feel the first squeeze from what will likely be a prolonged downturn in the defense market. Sales at BAE Systems, Finmeccanica, General Dynamics, Northrop Grumman and Raytheon declined by a collective $6.4 billion last year, and the onset of deep automatic budget cuts in the U.S.—known as “sequestration”—signals tough times ahead. “Uncertainty is the new normal, and it has created a wait-and-see mode,” says TPC adviser Scott Thompson of PwC. “Last year was devoid of any big strategic acquisitions.” That uncertainty has only grown in 2013, inducing a state of paralysis in an industry coming off a run of prosperity that lasted more than a decade., 18830=For the second consecutive year, Boeing topped the TPC rankings of publicly traded companies with revenues of more than $20 billion, beating out second-place Lockheed Martin. Boeing's score of 90 was the highest of any company in this year's study and the third-highest TPC score posted since 1998, bested only by Lockheed Martin in 2007 and General Dynamics in 1999. The Chicago-based airframer has endured a flood of negative publicity from the grounding of its 787 jet following meltdowns of the aircraft's advanced lithium-ion batteries. But TPC analysts predict the price tag of cleaning up the mess and getting the 787 back into service will not materially affect the balance sheet of a company with more than $82 billion in annual revenue., 29371=2013 Top Performers, 20791=Northrop Grumman, once a laggard among large defense contractors, continued its climb in the TPC rankings, rising to third place with a score of 80. The company posted operating margins of 12.4% while Huntington Ingalls, the ship division that it spun off in 2011, had margins of just 5.1%. And while Raytheon's score was flat from last year, TPC advisers believe the company is uniquely positioned for the downturn, with a strong missile-defense business and roughly a quarter of its sales generated outside the U.S. “In this new affordability environment, existing equipment will be upgraded rather than replaced,” notes Thompson. “That's their sweet spot.”, 75534=Your source for 2015 media kits, editorial planners rates and specs for AW&ST, ATW, B&CA and more!, 26899=A TPC analysis of the 15 U.S. A&D companies with annual sales of at least $5 billion shows they invested an average of 4% of their revenues on independent R&D in 2012, up from 3% in 2003. But raising that further to compensate for declines in government-funded research will be a tough sell for management teams, which face Wall Street's relentless demands for near-term profits., 22284=One of the most improved scores in this year's study went to Finmeccanica, but it was a dubious distinction. The Italian aerospace company's score of 36 was up from 15 last year, but that was only good enough to tie with Curtiss-Wright for the lowest score among the 58 companies ranked this year. Finmeccanica's high-profile acquisition of DRS Technologies in 2008 has proven difficult to integrate, and operations in its home market remain riddled with inefficiencies. TPC advisers speculate the company could seek a merger or—copying a strategy famously executed by General Dynamics in the early 1990s—sell off pieces to generate value for shareholders., 24392=Exelis, the defense business spun off in 2011 by parent ITT, turned in an impressive second-place performance among companies with revenues of $5-20 billion, with a score of 77. Rolls-Royce rounds out the top three with a score of 71. The ailing member of the group is aerostructures producer Spirit AeroSystems, which placed last with a score of 41. The company's results were weighed down by a $590 million pre-tax charge it took after failing to meet cost targets on work for Gulfstream and Boeing. “Aerostructures is a tough business,” says Schwendinger., 13844=“Commercial is taking off,” says Deloitte's Tom Captain, one of nine industry experts who helped analyze the results of Aviation Week's 2013 Top-Performing Companies (TPC) study. “As Boeing and Airbus go, so goes the industry.”, 23806=A large majority of the company's revenues came from its Falcon business jet unit which was hit hard when the bottom dropped out of that market in 2008-09. In 2009, the unit's Falcon business saw 163 net cancellations worth almost $5 billion. And yet the TPC numbers indicate a strong rebound is underway, fueled by demand for the high-end 7X in markets like the U.S., where it employs 2,500, and increasingly China. “Just looking at the numbers, they come across as a well-managed company, with solid and consistent financial performance throughout,” Gelain says., 16682=The consensus among the TPC advisory team is that incremental efficiency gains will not be sufficient to guide defense companies through what is likely to be a protracted downturn as governments in the U.S., Europe and Japan rein in unsustainable spending. Skeptics note the sky did not fall when sequestration took effect on March 1, but that is only because of the drawn-out nature of weapons programs. It could be another year before the full force of budget cuts hits the Pentagon's procurement and research, development, test and evaluation accounts. “I think this continues to be the calm before the storm,” says TPC adviser Jacob Markish of Renaissance Strategic Advisors. “Focusing on operational excellence and hunkering down may be dangerous, because the storm is not passing.”}",
    "lastModified": "Tue, 04 Aug 2015 07:34:19 GMT",
    "textBeforeTable": "AviationWeek.com/awin/tpc Rankings of more than 100 A&D business segments in 14 categories Detailed Interactive charts of TPC-ranked companies with links to spreadsheets AWIN-only rankings of A&D companies with revenues between $250 million and $1 billion Subscribers to the Aviation Week Intelligence Network can access: TPC EXTRAS Source: TPC database 2013 Top Performers EDITOR'S NOTE: This article was updated to correct data in the table labeled “Average Five-Year Ranking: Revenues Between $1-5 Billion.” Thompson has a similar view. “I have not seen any major disruptions,” he says. But the sector “requires vigilance, given that the supply chain is producing at unprecedented volume.” Back on the growth side of the industry—commercial aviation—the key concern is whether the supply chain can keep pace as Airbus and Boeing raise monthly production rates and entrants from Canada, China and Russia push into the lucrative narrowbody jet market. “The commercial suppliers are stressed, but there is no real evidence they can't keep up,” says consultant and TPC adviser Tony Velocci, a former editor-in-chief of Aviation Week & Space Technology. It also is fairly obvious that the slimmed-down defense industry is going to have too many contractors and not enough work. But the potential of new markets in places like India and Brazil is still too",
    "textAfterTable": "PROPULSION GE Aviation RADARS/SENORS/ELECTRONIC WARFARE/C4ISR FLIR Thermal Vision and Measurement ROTORCRAFT Textron Bell Helicopter SPACE SYSTEMS Lockheed Martin Space Systems SUBSYSTEMS/SUBASSEMBLIES Parker Hannifin Aerospace *Revenues greater than $500 million. Complete rankings for each segment are available to Aviation Week Intelligence Network subscribers. 2013 TPC Council of Advisers Tom Captain, Vice Chairman, Global & U.S. A&D Practice Leader, Deloitte LLP Michael Finley, A&D Advisory Principal, PwC Antoine Gelain, A&D Practice Leader, Candesic Harlan Irvine, Principal, Deloitte Consulting Jacob Markish, Principal, Renaissance Strategic Advisors Jim Schwendinger, A&D consultant (ret.), Deloitte LLP John Stack, Managing Director and Aerospace Leader, The McLean Group Scott Thompson, Partner and U.S. A&D Leader, PwC Tony Velocci, A&D consultant 2013 Aerospace & Defense Rankings, REVENUES GREATER THAN $20 BILLION RANK COMPANY RESULTS ENDING 2012 REVENUE ($ millions) TOTAL SCORE 1 Boeing Dec. 12 81,698",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}