{
    "relation": [
        [
            "",
            "",
            "Australia",
            "New Zealand",
            "West Indies",
            "England",
            "Sri Lanka",
            "South Africa"
        ],
        [
            "Won",
            "",
            "3",
            "2",
            "2",
            "1",
            "1",
            "0"
        ],
        [
            "Lost",
            "",
            "0",
            "1",
            "1",
            "2",
            "2",
            "3"
        ],
        [
            "NRR",
            "",
            "+0.483",
            "+1.712",
            "+1.187",
            "+0.320",
            "-2.432",
            "-1.357"
        ],
        [
            "Pos",
            "",
            "6",
            "4",
            "4",
            "2",
            "2",
            "0"
        ]
    ],
    "pageTitle": "BBC Sport - Women's Cricket World Cup: England batting was 'poor'",
    "title": "",
    "url": "http://www.bbc.com/sport/0/cricket/21384087",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00267-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 314692219,
    "recordOffset": 314656250,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4659=8 February 2013 Last updated at 14:06 GMT, 935=With only the top two advancing, England, on two points, need to win their final two matches against South Africa on Sunday and New Zealand on Wednesday if they are to defend the trophy they won in 2009., 1179=Australia, who have not lost to England in a World Cup match since 1993, are top of the Super Six group with six points and are on the verge of making the final.}",
    "TableContextTimeStampAfterTable": "{23932=Copyright © 2015 BBC. The BBC is not responsible for the content of external sites. Read more., 4210=\"If all of a sudden you're on the front page of a newspaper, that would affect anyone,\" said Rainford-Brent, who was part of the England's successful 2009 squad.}",
    "textBeforeTable": "Super Six table \"Batting is where we need to improve, but I'm not worried.\" \"Individually they have all stood up at times, collectively maybe we haven't as a group batted well,\" said the 33-year-old opener. England also saw the middle order wobble in the opening defeat by Sri Lanka and the subsequent win over West Indies, but Edwards says she has no concerns for the rest of the tournament. With only the top two advancing, England, on two points, need to win their final two matches against South Africa on Sunday and New Zealand on Wednesday if they are to defend the trophy they won in 2009. Australia, who have not lost to England in a World Cup match since 1993, are top of the Super Six group with six points and are on the verge of making the final. \"In a tough position you need those people to stand up and they didn't.\" Edwards said: \"There was some poor shot selection. Numbers three, five, six and seven faced 12 balls between them. \"Everything went in England's favour. They won the toss and bowled well but they've given this match away with poor batting and loose shots up top. On a pitch like this, there's no excuse for shots like that. I think Australia captain Jodie Fields",
    "textAfterTable": "Women's World Cup fixtures, results & tables Sarah Taylor, England's number three who has been linked with a move to men's cricket, has so far failed to impress, scoring only 35 runs in the tournament. All of those runs came against India, after the wicketkeeper missed the opening game against Sri Lanka through injury. Her last two innings has resulted in first-ball ducks. \"Sarah Taylor hasn't scored runs in the competition, but she's dangerous and I'm expecting big things to come from her,\" said Kent's Edwards. \"She's too good a player to go through too many games without scoring. Hopefully, with two big games to come, she'll fire for us.\" However, former England batter Ebony Rainford-Brent believes Taylor may have been affected by both the pre-tournament hype and her injury. \"If all of a sudden you're on the front page of a newspaper, that would affect anyone,\" said Rainford-Brent, who was part of the England's successful 2009 squad. \"Also, she's had a niggle. If she's not been training in the same way then that could have hampered her preparations. \"We saw against India that she is a quality player. She and the coaches need to address any problems she might have because England need her runs.\" Also related to this story",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}