{
    "relation": [
        [
            "",
            "January",
            "February",
            "March",
            "April",
            "May",
            "June",
            "July",
            "August",
            "September",
            "October",
            "November",
            "December",
            "Monthly Average",
            "Jan.-Aug. Average"
        ],
        [
            "2002",
            "368",
            "364",
            "364",
            "363",
            "369",
            "371",
            "371",
            "372",
            "369",
            "369",
            "361",
            "356",
            "366",
            "368"
        ],
        [
            "2003",
            "349",
            "342",
            "334",
            "327",
            "322",
            "318",
            "313",
            "311",
            "308",
            "308",
            "305",
            "306",
            "320",
            "327"
        ],
        [
            "2004",
            "305",
            "305",
            "305",
            "306",
            "306",
            "306",
            "306",
            "305",
            "302",
            "302",
            "300",
            "296",
            "304",
            "305"
        ],
        [
            "2005",
            "293",
            "290",
            "289",
            "286",
            "286",
            "285",
            "289",
            "278",
            "275",
            "275",
            "272",
            "271",
            "282",
            "287"
        ],
        [
            "2006",
            "270",
            "268",
            "268",
            "267",
            "266",
            "265",
            "265",
            "265",
            "",
            "",
            "",
            "",
            "",
            "267"
        ],
        [
            "Percent Change 2002-2006",
            "−26.8",
            "−26.4",
            "−26.3",
            "−26.7",
            "−27.9",
            "−28.6",
            "−28.7",
            "−28.8",
            "",
            "",
            "",
            "",
            "",
            "−27.5"
        ]
    ],
    "pageTitle": "August 2006 Passenger Airline Employment Down 3.1 Percent from August 2005 | Bureau of Transportation Statistics",
    "title": "",
    "url": "http://www.rita.dot.gov/bts/sites/default/files/rita_archives/bts_press_releases/2006/bts049_06/html/bts049_06.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00009-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 699228539,
    "recordOffset": 699206475,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21940=SkyWest reported the largest increase in the group, employing 5.5 percent more FTEs in August 2006 than August 2005 (table 15)., 129064=** Note: Four regional airlines, Mesa, Pinnacle, GoJet and PSA, did not meet the reporting standard in 2003. Mesa and Pinnacle began reporting employment numbers in 2004, Pinnacle began reporting in 2005 while GoJet began reporting in 2006., 22291=The seven regional carriers reporting employment data in both 2002 and 2006 employed 8.4 percent more FTEs in August 2006 than in August 2002.  Of that group, Air Wisconsin and Mesaba Airlines were the only carriers to report fewer FTE’s in August 2006 than August 2002 (Table 15)., 52141=*** Percent change comparison for regional airlines and for all passenger airlines is for 2003 to 2006 because of the number of airlines in these categories that did not meet the standard for reporting monthly employment numbers., 20459=Low-cost carrier FTEs declined 0.8 percent in August 2006 compared to August 2005, the 17th consecutive month of decreases from the previous year but the smallest decrease since August 2005 (table 10).  The 70,500 FTEs employed by the seven low-cost carriers in August account for 17.4 percent of the passenger airline total (Table 11 and Table 4)., 79755=(Ranked by August 2006 FTE Employees), 31563=**** Atlantic Southeast Airlines was granted an extension for the filing of September 2005 employment numbers. For year-to-year comparison purposes, its numbers are not included in September 2004., 21804=Regional carrier FTEs were down 2.8 percent in August compared to August 2005 (table 13)., 18044=The seven network carriers employed 265,000 FTEs in August, 65.5 percent of the passenger airline total, while low-cost carriers employed 17.4 percent and regional carriers employed 13.8 percent (table 4).  The network carriers have employed fewer FTEs each August compared to the previous year since 2002, the only carrier group to do so (table 5)., 19179=Two network carriers increased FTEs from August 2005 to August 2006.  Continental’s workforce grew 5.2 percent while Alaska Airlines rose 5.8 percent (table 9)., 18842=Network carrier FTEs declined 4.7 percent in August 2006 compared to August 2005 (table 7).  Numbers from previous years were reported in BTS’ Feb. 21 press release http://www.bts.gov/press_releases/2006/bts009_06/html/bts009_06.html., 19390=Network carrier FTEs dropped from 371,700 in August 2002 to 264,800 in August 2006, a four-year decline of 28.8 percent (table 8).  , 38487=*** Atlantic Southeast Airlines was granted an extension for the filing of September 2005 employment numbers. For year-to-year comparison purposes, its numbers are not included in September 2004., 113841=**Employment numbers in 2003, 2004 and 2005 for Independence Air, which changed its business model from a regional to low-cost carrier in mid-2004, are included with low-cost carriers. The carrier did not meet the standard for filing in previous years. The airline discontinued flights on Jan. 5, 2006., 16770=BTS, a part of the Research and Innovative Technology Administration (RITA), reported that the August 2006 FTE total was the second consecutive monthly increase over the prior month’s FTE total.  It was the first July-to-August increase since 2003 (table 3). FTE calculations count two part-time employees as one full-time employee., 23324=Additional airline employment data can be found on the BTS website at http://www.bts.gov/programs/airline_information/number_of_employees/.  BTS has scheduled release of September airline employment data for Nov. 21., 104743=** Employment numbers in 2003, 2004 and 2005 for Independence Air, which changed its business model from a regional to low-cost carrier in mid-2004, are included with low-cost carriers. The airline discontinued flights on Jan. 5, 2006., 21095=Low-cost carrier FTEs were 66,500 in August 2002, 71,100 in August 2005 and 70,500 in August 2006. The increase from 2002 to 2006 was 6.0 percent (Table 4). , 19579=FTEs at all seven network carriers declined in August 2006 from August 2002.  The biggest percentage declines were at US Airways, down 43.5 percent, a reduction of 14,700 FTEs, and United Airlines, down 33.3 percent, a reduction of 26,600 FTEs.  Collectively, the seven network carriers reduced their FTE headcount by 106,900 over the four-year period (Table 9)., 143266=** Many regional carriers were not required to report employment numbers before 2003, so year-to-year comparisons involving regional carriers, or the total industry, are not appropriate for the years before 2003. The Percent Change 2002-2006 is based on the seven carriers reporting in both years., 17717=Scheduled passenger airlines include network, low-cost, regional and other airlines.  Many regional carriers were not required to report employment numbers before 2003, so year-to-year comparisons involving regional carriers, or the total industry, are not available for the years before 2003. , 17364=Adding FTEs from August 2005 to August 2006 were network carriers Continental Airlines and Alaska Airlines (table 9), low-cost carriers Southwest Airlines, America West Airlines, JetBlue Airways, AirTran Airways and Frontier Airlines (Table 12), and regional carrier SkyWest Airlines as well as other regional carriers (Table 15)., 20883=The five largest low-cost carriers all increased FTEs from August 2005 to August 2006.  JetBlue reported a 24.1 percent rise, the most of any carrier (table 12)., 119832=** Four regional airlines, Mesa, Pinnacle, GoJet and PSA, did not meet the reporting standard in 2003. Mesa and Pinnacle began reporting employment numbers in 2004, Pinnacle began reporting in 2005 while GoJet began reporting in 2006., 22113=Regional carrier FTEs rose from 41,800 in August 2003 to 55,600 in August 2006, an increase of 33.2 percent (table 14).  , 30920=**Employment numbers in 2003, 2004 and 2005 for Independence Air, which changed its business model from a regional to low-cost carrier in mid-2004, are included with low-cost carriers. The airline discontinued flights on Jan. 5, 2006., 94031=Note: Employment numbers in 2003, 2004 and 2005 for Independence Air, which changed its business model from a regional to low-cost carrier in mid-2004, are included with low-cost carriers. The airline discontinued flights on Jan. 5, 2006., 18468=American Airlines employed the most FTEs in August among the network carriers, Southwest Airlines employed the most among low-cost carriers and American Eagle Airlines employed the most among regional carriers. Seven of the top 10 employers in the industry are network carriers (table 6)., 17153=The 3.1 percent dip in FTE’s from August 2005 to August 2006 was the second time in 13 months that the year-to-year decline was less than 5 percent (table 1). , 21479=Employment data for Independence Air, which changed its business model from a regional to low-cost carrier in mid-2004, have been included with low-cost carriers for 2003, 2004 and 2005 for consistency.   The airline discontinued all flights on Jan. 5., 23207=Data are compiled from monthly reports filed with BTS by commercial air carriers as of Oct. 11., 16312=Tuesday, Oct. 17, 2006 - U.S. scheduled passenger airlines employed 3.1 percent fewer workers in August 2006 than in August 2005, the smallest drop since April 2005 in full-time equivalent employee (FTE) levels for the scheduled passenger carriers from the same month of the previous year, the U.S. Department of Transportation’s Bureau of Transportation Statistics (BTS) reported today (table 2).}",
    "lastModified": "Sun, 02 Aug 2015 08:43:26 GMT",
    "textBeforeTable": "Excel | CSV Percent change compared to same month the previous year for the most recent 13 months Table 1: Passenger Airline Full-time Equivalent Employees* Change from the Previous Year Additional airline employment data can be found on the BTS website at http://www.bts.gov/programs/airline_information/number_of_employees/.  BTS has scheduled release of September airline employment data for Nov. 21. Data are compiled from monthly reports filed with BTS by commercial air carriers as of Oct. 11. The Other Carrier category generally reflects those airlines that operate within specific niche markets, such as Aloha and Hawaiian Airlines in serving the Hawaiian Islands. Airlines that operate at least one aircraft with the capacity to carry combined passengers, cargo and fuel of 18,000 pounds – the payload factor – must report monthly employment statistics. Reporting Notes Regional carriers provide service from small cities, using primarily regional jets to support the network carriers’ hub and spoke systems. The seven regional carriers reporting employment data in both 2002 and 2006 employed 8.4 percent more FTEs in August 2006 than in August 2002.  Of that group, Air Wisconsin and Mesaba Airlines were the only carriers to report fewer FTE’s in August 2006 than August 2002 (Table 15). Regional carrier FTEs rose from 41,800 in August 2003 to 55,600 in August 2006, an increase of 33.2 percent (table 14).   SkyWest reported the largest increase in the group, employing 5.5 percent more FTEs in August",
    "textAfterTable": "−4.1 −1.9 −5.4 April −4.4 −2.3 −3.1 −4.8 May −6.7 −0.8 −3.5 −5.0 June −8.3 0.5 −3.8 −5.0 July −9.6 2.5 −3.5 −5.9 August −9.5 2.2 −5.8 −3.1 September*** −9.3 2.4 −5.8   October −10.4 2.5 −6.1   November −9.2 2.2 −6.5   December −8.3 0.9 −5.9   Source: Bureau of Transportation Statistics",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}