{
    "relation": [
        [
            "",
            "Millennium P750",
            "Millennium G550",
            "GeForce FX 5200",
            "Radeon 9000 Pro",
            "Parhelia"
        ],
        [
            "Core clock (MHz)",
            "NA",
            "125",
            "250",
            "275",
            "200"
        ],
        [
            "Pixel pipelines",
            "2",
            "2",
            "4",
            "4",
            "4"
        ],
        [
            "Peak fill rate (Mpixels/s)",
            "NA",
            "250",
            "1000",
            "1100",
            "800"
        ],
        [
            "Texture units per pixel pipeline",
            "4",
            "2",
            "1",
            "1",
            "4"
        ],
        [
            "Peak fill rate (Mtexels/s)",
            "NA",
            "500",
            "1000",
            "1100",
            "3200"
        ],
        [
            "Memory clock (MHz)",
            "NA",
            "332",
            "400",
            "550",
            "500"
        ],
        [
            "Memory bus width (bits)",
            "128",
            "64",
            "128",
            "128",
            "256"
        ],
        [
            "Peak memory bandwidth (GB/s)",
            "NA",
            "2.66",
            "6.4",
            "8.8",
            "16"
        ]
    ],
    "pageTitle": "Matrox's Millennium P750 graphics card - The Tech Report - Page 5",
    "title": "",
    "url": "http://techreport.com/review/5508/matrox-millennium-p750-graphics-card/5",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00262-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 227775515,
    "recordOffset": 227760448,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{6023=In 3DMark2001 SE's single-texturing fill rate test, the Millennium P750's two pixel pipelines don't have a chance. Each pipe's ability to lay down four textures per pass does, however, give the card a more competitive multi-texturing fill rate., 2379=38 comments — Last by dmonroe55 at 5:09 PM on 10/19/03}",
    "TableContextTimeStampAfterTable": "{8909=Copyright ©1999-2015 The Tech Report. All rights reserved. About us | Privacy policy | Mailing list | Mobile}",
    "textBeforeTable": "Anyway, here's our trusty chip chart to give you an idea of how the other cards we're looking at today stack up: Fill rate Unfortunately, Matrox isn't releasing the core and memory clock speeds of the Millennium P750. Also, OEM and retail versions of the card will run at different clock speeds, which further complicates the issue. Taken together with other considerations, the funky clock speed shuffle means the P750 is probably the last card anyone looking for predictable 3D performance should consider. Print Single page • POLL: WINDOWS 10 INSTALL • [Help]Windows 10, connect to the internet at startup? • Windows 10 - Best antivirus? • Win10: My thoughts Hot forum threads • Friday Night Shortbread [95] • Samsung docs detail Linux TRIM bug and fix [104] • Mozilla CEO protests Win10's default application setup process [132] • Windows 10's Solitaire games go freemium [149] Most commented stories Log in",
    "textAfterTable": "If I had to guess, I'd wager that the Millennium P750's memory clock speed is somewhere in the 500MHz range. I doubt the core's clock speed is higher than 200MHz, but given the fact that it requires active cooling, it's probably not much lower. Of course, we don't have to rely on theoretical fill rate specs since we have a few synthetic tests to fall back on. In 3DMark2001 SE's single-texturing fill rate test, the Millennium P750's two pixel pipelines don't have a chance. Each pipe's ability to lay down four textures per pass does, however, give the card a more competitive multi-texturing fill rate. Intriguingly, the Parhelia's fill rate scores are much more than twice the P750's. In fact, Parhelia delivers nearly three times the fill rate. Occlusion detection Parhelia doesn't feature any occlusion detection capabilities, and apparently, neither does the P750. Even so, the P750 hangs just behind the GeForce and Radeon cards in VillageMark. Tags: Graphics Previous page | Next page Page 1 - Introduction",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}