{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,072 topics 2,123,421 replies",
            "85,546 topics 1,153,529 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,756 replies",
            "5,996 topics 75,807 replies",
            "50,535 topics 466,139 replies",
            "22,766 topics 196,279 replies",
            "4,270 topics 60,430 replies",
            "1,128 topics 8,214 replies",
            "3,597 topics 115,129 replies"
        ],
        [
            "Last Post Info",
            "Windows10 - wow, performance! By DavidTheThird 3 minutes ago",
            "Who am I? By RevengeOfSpartacus A minute ago",
            "The Ultimate 100% Save File... By Militia 19 hours ago",
            "The Most Underrated GTA Ever By lataka 11 minutes ago",
            "Why LCS is better than V By GTAKid667 16 hours ago",
            "Favourite glitches By Mr. Fahrenheit 42 minutes ago",
            "Reasons why Vice City is be... By IIOctaneII 5 hours ago",
            "Grand Theft Auto III Pre-Re... By inadequate An hour ago",
            "Anybody has a 100 % savegame? By Cerium 11 hours ago",
            "Create your own vehicle for... By Mr. Fahrenheit 47 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=226&t=556897&p=1062546991",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00076-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 115875803,
    "recordOffset": 115850401,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{90252=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 12459=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9291=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 16356=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 18444=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 20584=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 14097=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 47548=Google, Bing, Yahoo, Special Members, BatFerYou, ryoukai, menny, ItsOnlyMac, fluffydude51, Nahin Bin Kaysar, Zulxer, ZenderAlpha, longhurstgb, Woody112, Google Mobile, Elemunt, Jon3s, souldisposal, Tomasak, Denvas, dyz, TarHeelJohn, EquanoxZ, toxluv, Shotty Pop, NightSpectre, Malcot, RevengeOfSpartacus, bulldog385, Screwe45, Claptrap NL, patriickzz, bryanlee211, Tilley, Osho, Tchuck, Irontis, rvmod, sivispacem, helresa, TheDoombringer, The Yokel, Wolfpac4Life, Mister Pink, SuperGTFan, nkjellman, quadro09, acalmocean, Fireyshotguns51, This Guy Is Here, LL Cool L, Izanagi16, Mr. Fahrenheit, PlayerSince97, hitman774, Lester-The-Molester, Th3MaN1, chainsoar, ALMOST610, size_m, The_Big_Show, psymin, SparkyMark01, bossofzeeland, lataka, doubleg213, MovingTarget268, AmbientZed, Blackbird88, scaldy78, ClaudeSpeed1911, ATastyCookie, CarcerCityMadMan, Tycek, Nenzo, Pat, ji.Ruichi, hornedturtle, MM4477KK, DavidTheThird, EarlyLifeFailure, kuusko, universetwisters, phattoni, Darrel, harvecito, unicornace, WHAT!?, Katabasis, lslseph, JimmyFantastic, guster-von, Phnx., Xevontheus, SevDoggX, Nattyiyaman, Vexate, Zolika1351, Hocko1999_fgc, DaTwista, kzstone, Smesi, Jagri, fjj8, BeckermannDewitt, theaudiobully87, toerage, DMK7, CaptHayes, Terroryaki, NoaJM, The Intellect, Mockingbae, LAmike1, MikeyDLuffy, Bangha, CarimboHanky, eagle152, CJPNE, yakprince, the_wabz, Jobbo, raburs, corbinov420, __TheGovernor__, xTrendSs, Jason Frost, Arachne, Loves GTA, LewisVee, ~Joseph~, RustyShackleford, Fonshway, missanthropy, Bongsquirrel, Free Aim Jesus, Jinx., CH14R1, Tony_Florence, Charmlessrogue, oCrapaCreeper, MeatSafeMurderer, Z i X, GTAVNoob, Halal Cyborg, xGeoThumbs, ayylmao420, Icre8, GamesBoy316, TheBaronOfHell, Azurex, Mastapogi, Dracojinn, stew5556}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By longhurstgb The Paleto Bay Mayors Offic... 613,420 replies 15,183 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By BatFerYou Who are you? 2,278,194 replies 113,159 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,438 topics 416,542 replies beginner to mods - where ca... By TJGM An hour ago Mod Showroom Scripts & Plugins, Maps, Total Conversions,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}