{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,072 topics 2,123,440 replies",
            "85,546 topics 1,153,535 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,756 replies",
            "5,996 topics 75,807 replies",
            "50,535 topics 466,140 replies",
            "22,766 topics 196,279 replies",
            "4,270 topics 60,430 replies",
            "1,128 topics 8,214 replies",
            "3,597 topics 115,129 replies"
        ],
        [
            "Last Post Info",
            "Does rockstar really learn... By SuperGTFan A minute ago",
            "Niko's Wife 2015 By Mona Sax 4 minutes ago",
            "The Ultimate 100% Save File... By Militia 20 hours ago",
            "The Most Underrated GTA Ever By lataka An hour ago",
            "Why LCS is better than V By GTAKid667 17 hours ago",
            "How does your CJ look? By Mister Pink 50 minutes ago",
            "Reasons why Vice City is be... By IIOctaneII 5 hours ago",
            "Grand Theft Auto III Pre-Re... By inadequate 2 hours ago",
            "Anybody has a 100 % savegame? By Cerium 11 hours ago",
            "Create your own vehicle for... By Mr. Fahrenheit An hour ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=226&t=515334&p=1062547021",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 108561375,
    "recordOffset": 108535982,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14245=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 90929=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 9426=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 20737=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12610=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 18597=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 16504=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 47503=Google, Yahoo, Bing, juarez, SuperGTFan, Schleemil, TJGM, Tycek, Craigsters, Ewok626, Ocelot., This Guy Is Here, DeadArashi, Jenna_Taylier, Coleco, Junko Enoshima, Procopius, Kursaal, Tenpenny2015, super_slav, 018361, JakeHorgrove, Mr. Fahrenheit, Shotty Pop, Dutch Psycho, Laguezmer, Chang, Stig, Zolika1351, ChaosIKI, gmwahiid, CarimboHanky, Pyroshox, Abzinth, Carbonox, PhillBellic, AK47-Mentalman, Chuck Finley, XenoxX, kBlaise, DJS, GamesBoy316, Google Mobile, A Paradox from 94, toxluv, Azurex, DonSpeedy, ji.Ruichi, FredZ, __TheGovernor__, Tilley, joe1606, XinU*, DoctahWong, Claptrap NL, furaii, Geometry, Smesi, Mona Sax, FedoraTheExplora, souldisposal, tobisand, kuusko, Saddler, BroodReaver, universetwisters, saintsrow, A Siente, LeAristocrat, John The Grudge, DONZE, Mastah, Jon3s, thewhitehammer99, TheDoombringer, Slam_Jones, tossle, jacka, Jinx., Rico UK, Gte00, SevDoggX, MarshallRawR, PANiC ATTACK3R, Vadim M., Prywatne, TheDeaconBosco, Cripto136, qwerasdzxc, kzstone, Soki93, Katabasis, The Hero, Maresz55, doubleg213, trevorjc2511, Cyberzone2, LoyalRockstarFanboy, Fattypack, Rafli, Facebook, zapotist, Retired Mafia, Sleepingmonster, spudtator, DyVerze, Zoolock, ermaccer, budcat, lolrazz, HipsterHillbilly, MLNVSKY, PrE233, Doc302, adit999, Ondr4H, Stormingz, Zonnex, Mockingbae, 458Speciale, Fuzzknuckles, Ämpäri, Shaundi., ibsmokin, Neos7, DavidTheThird, blitziii, Lochie, NBAKingzFan10, Tomasak, gta4_player, raburs, Receptor, gizmonomono, missanthropy, Pat, Russi4nW4rrior, RustyShackleford, mrsetiaji, RoastedRedRandy, SaL_Leone, GRANDHEIST, Mr Walker, WrongAgainNoobs, swooshboy, vlad polkiujhyt, wh1t31v3y, marvinviray, bronysplatter, KornbreadMaf1a, MusaKhan9876, Scuba 21, zeromanx, Dave_TE, That_cold_sauce, The Yokel, Reid505, OBeef619, Fonshway, Warlord.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By 2281 The GTAForums Official R* Crew 613,425 replies 15,183 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Kursaal Witch small town do you prefer 2,278,262 replies 113,162 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,439 topics 416,543 replies GTASA New Model Army RC Goblin By marvinviray 19 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}