{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,168 topics 2,126,923 replies",
            "85,565 topics 1,154,219 replies",
            "1,071 topics 11,084 replies",
            "4,218 topics 64,772 replies",
            "5,997 topics 75,832 replies",
            "50,557 topics 466,351 replies",
            "22,767 topics 196,348 replies",
            "4,275 topics 60,565 replies",
            "1,127 topics 8,223 replies",
            "3,612 topics 115,976 replies"
        ],
        [
            "Last Post Info",
            "My thoughts on how the map... By Midnight Hitman 3 minutes ago",
            "Bored? Try these... By scania970 A minute ago",
            "The Ultimate 100% Save File... By Militia 4 hours ago",
            "Which Vehicle Do You Prefer? By svanderman 5 hours ago",
            "Which vehicle suits Toni? By thedriver111 8 minutes ago",
            "Compare GTA : San Andreas a... By maoffense01 11 minutes ago",
            "The Ultimate 100% Save File... By GTAGuy1995 13 minutes ago",
            "Grand Theft Auto III Chain... By GTAGuy1995 19 minutes ago",
            "What do you hate of GTA 2? By Cerium 20 hours ago",
            "Lets play a game of \"Wo... By thedriver111 6 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=77&t=503202&p=1061141834",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00206-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 104346755,
    "recordOffset": 104323307,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20791=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 9337=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 18501=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 16348=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 14079=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 47650=Google, VeraVanderpump, Yahoo, Bing, Cautious, Turan, Masny, Imposssible, ledzep71, Sveittjpong, Loc14, lcordadoro, Terroryaki, alex1369, shadowoperative, Jvaz615, elhazard1790000, iiConTr0v3rSYx, Saso70, scania970, Pavle, ChickenAndBeer, Slayer x ViPezZ, REXX93, No_Flex_zone, WHAT!?, Marticus, Quejki, Garbear38, Holo fenix, Between3and20chars, deadx23, MXKN, MotelGuy, leftas, StangOne50, m3tal z_DKI, RedDagger, Payne Killer, SILENCOM, -Z31N-, Ben_GTAV, Claude Liberty, Omoplataha, Player360, Google Mobile, A Maned Wolf, TarHeelJohn, Lost Legend, jollythecat, Street Mix, cjarvis15, josephene123, Paul_silvana10910, ArsMoriendi, Stingray69, statistic, Caffe1ne, AtomicSoviet, staticclingman, atlboy4k, DavidTheThird, C4R3ON, Bradeo, Jinx., Marwin, NikkoCharger, SlaveZer0, StepNaza, gtuned, JON22, Shy, Xing of Virtue, Crunch McThornbody, CaptainMarvel, KiTTYReCkless, Twoddy, 7nvd, RARusk, Zoolock, Heists, Midnight Hitman, TheHellcat, DJROWIENZ, Doktor Gott, GodHatesKittens, GerryM, ScarySKRILLEX, whywontyoulisten, TheIceWarrior, Chief Ryze, SatournFan, soundism, BoomBapPoet, GTCinema, Patgosplat, _Douglas_, Neuling2000, Mantiger308, Modojo, emelen, Pappkasse, 458Speciale, BXHITMAN01, Hitman.Joe, Sentinel Driver, Jon3s, That_cold_sauce, Mona Sax, NBAKingzFan10, Retired Mafia, Tuesdy, CptAngel, JMer23, catmandoza, Extreme_Wrestler, DONTxMESSxABOUT, Zeynohh, C06alt, Hunter241, TalkingPear, Otter, Zyo, JF8494, RmpTebow15, GTA_Matt24, B Dawg, Officer Garza, HaythamKenway, LUC!D, TargetPractice89, Weedell, TheFlareEntercounter, MIXAZZZ, bigjpc777, CMCSAVAGE, Kahkenbols, Mika_0013, d3ighty, cj67890, Craig Kostelecky, Johnny Playert, TheOddGamerYT, svanderman, SneakyPenguin91, Scharkey, x_FRoe__, xTOMMYTROJANx, Furry_Monkey, Outcast, Terra_S4, toxluv, paulhv2, blackindia, Sky_Light12, lol232, 69_black_69, SILENT_Pavel, Cognoscenti, jhall181, Ivan1997GTA, pcguytech, Foxy Stevenson, meta187, *Lola, marhex, sweller, Euda, Videogames888, maoffense01, TwisterVictor1, DrunkenMunkey78, kaasje, supanaut, Rented, A Siente, Gabriela_L, StingR, Slasherr, ZyDevs, ngazi, PreciousWall, xiaoshung, BearClawHD, Craank_AG, Timcatgt5, een57, ISOFX, PS3KillsThe360, DragonSpade, Russell_Brand, kBlaise, An4ucker, Smesi, ash-274, Wheatley, Non Biased GTA 4 fan, Braindawg, CarimboHanky, The House Chef, drewphilly, Claptrap NL, whiteskin, Ex ZuluWarrior, mamoac, Quintenr95, Insincere, MistGoose, timason, chinchin007, adra12, LewisVee, Johnny Spaz, Dondara, abnorm, Bread_, Willplanb_, Citron_XY, iNero, Pyro_Indigo, Mike2232, denis1379, Grizzly322, Majesticnug420, ak47po, Turbocharger, -RONIN-, erkwang, Sunblessed, missanthropy, Darrel, LeopardGecko, synn8773, Lolzz, djbel, Djeli, cmjxvideos, GTAGuy1995, edwardh, WinkingSkeever6, helresa, SirJohnnyStark, SolidUSP, ZANTHERA, wstaylor, hannerfall, gta3masta5000, Kiyone_Alien_Cop, Bob_Dole, Owl Man, Vrock_wave, SteveNYC, esmittystud101, rafaelfiorindo, ol_dirty_b101, AboveAndBeyoncé, Tomasak, kudisanga, iamcornholio, Roadkill01, Gnarwolf, MR.V8, Cornphlake, FlacidJack, Icantthinkofonew, the nameless, Lorajet, psymin, TG_Stig, lolznc, MRSJEIKS, GTA717, gtaguy95, Randy93, Pusman, LH-PLAYS, Pikas_PK, Footballgrl70, Trentallica, _CP_, Abhunter, da_illest101, cameronman1329, Automan, Arms Dealer, Ak47clower, leonardosc, Summertime, PieRGud, TitaniumSphinx, Draclonis, SuperHolySheep, Mach1bud, ChOcOsKiZo, D-WAVE_DDK, 12530=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 123744=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 4 minutes ago By 458Speciale The Duping Crew 614,471 replies 15,213 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By SILENCOM [XBOX ONE] Car/Motorcycle M... 2,291,299 replies 113,690 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support Guides",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,510 topics 416,512 replies [C#] Get Coords you last sh... By leftas A minute ago Mod Showroom Scripts & Plugins, Maps, Total Conversions,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}