{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "TAKE ON MARS TAKE ON MARS - NEWS, TAKE ON MARS - GENERAL, TAKE ON MARS - EDITING, TAKE ON MARS - DEVELOPER DIARIES, TAKE ON MARS - SUGGESTIONS Take On Mars places you in the seat of a Rover Operator, allowing you to control the various, fully simulated mobile Rovers and stationary Landers. With this scientific arsenal at your disposal, you will work your way through the numerous Science Missions in each location, unlocking the secrets of Mars' distant past.",
            "MINIDAYZ MINIDAYZ - GENERAL MINDIAYZ",
            "CARRIER COMMAND: GAEA MISSION CARRIER COMMAND: GAEA MISSION - NEWS, CARRIER COMMAND: GAEA MISSION - GENERAL, CARRIER COMMAND: GAEA MISSION - TROUBLESHOOTING, CARRIER COMMAND: GAEA MISSION - OFFICIAL MISSIONS, CARRIER COMMAND: GAEA MISSION - P&C BETA, CARRIER COMMAND: GAEA MISSION - ADDONS & MODS: DISCUSSION, CARRIER COMMAND: GAEA MISSION - ADDONS & MODS: COMPLETE",
            "IRON FRONT: LIBERATION 1944 IRON FRONT: LIBERATION 1944 - NEWS, IRON FRONT: LIBERATION 1944 - GENERAL, IRON FRONT: LIBERATION 1944 - TROUBLESHOOTING, IRON FRONT: LIBERATION 1944 - MULTIPLAYER, IRON FRONT: LIBERATION 1944 - OFFICIAL MISSIONS, IRON FRONT: LIBERATION 1944 - USER MISSIONS, IRON FRONT: LIBERATION 1944 - ADDONS & MODS: COMPLETE, IRON FRONT: LIBERATION 1944 - ADDONS & MODS: DISCUSSION, IRON FRONT: LIBERATION 1944 - MISSIONS - Editing & Scripting",
            "TAKE ON HELICOPTERS TAKE ON HELICOPTERS - NEWS, TAKE ON HELICOPTERS - DEMO, TAKE ON HELICOPTERS - GENERAL, TAKE ON HELICOPTERS - QUESTIONS & ANSWERS, TAKE ON HELICOPTERS - SUGGESTIONS, TAKE ON HELICOPTERS - TROUBLESHOOTING, TAKE ON HELICOPTERS - BETA PATCH TESTING, TAKE ON HELICOPTERS - OFFICIAL SCENARIOS, TAKE ON HELICOPTERS - CUSTOM SCENARIOS, TAKE ON HELICOPTERS - MULTIPLAYER, TAKE ON HELICOPTERS - ADDONS & MODS: COMPLETE, TAKE ON HELICOPTERS - ADDONS & MODS: DISCUSSION, TAKE ON HELICOPTERS - PRE ORDER BETA, TAKE ON HELICOPTERS - COMMUNITY PREVIEW",
            "TAKE ON HELICOPTERS - EDITING TAKE ON HELICOPTERS : MISSIONS - Editing & Scripting, TAKE ON HELICOPTERS : ADDONS - Configs & Scripting, TAKE ON HELICOPTERS : MODELLING - (O2), TAKE ON HELICOPTERS : TERRAIN - (Visitor), TAKE ON HELICOPTERS : BI TOOLS - TROUBLESHOOTING",
            "BACK CATALOGUE ALPHA PRIME, ALTERNATIVA, FAIRYTALE, FISH FILLETS 2, ORIGINAL WAR, MEMENTO MORI, PAT & MAT, POUND OF GROUND, SHADE: WRATH OF ANGELS, UFO AFTERLIGHT"
        ],
        [
            "Stats",
            "367 topics 2428 replies",
            "13 topics 115 replies",
            "942 topics 8436 replies",
            "331 topics 4096 replies",
            "1640 topics 14333 replies",
            "165 topics 1310 replies",
            "20 topics 122 replies"
        ],
        [
            "Last Post Info",
            "Localized versions By lrogerorrit Yesterday, 09:43 AM",
            "I can't play Minidayz :( By banditslayer Today, 09:53 AM",
            "Deadly Islands mod with Man... By Species1571 18 Jul 2015",
            "Iron Front: Liberation 1944... By Geoffry 02 Aug 2015",
            "Anyone have a copy of close... By nosecone 01 Jul 2015",
            "Help finishing of addon By nosecone 12 Jul 2015",
            "Sequel Potential? (Possible... By KNERD 16 Jul 2015"
        ]
    ],
    "pageTitle": "Bohemia Interactive Forums",
    "title": "",
    "url": "https://forums.bistudio.com/index.php?showtopic=",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00207-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 883614195,
    "recordOffset": 883593973,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{64386=Darce - Today, 01:35 AM, 64971=Tom.Tucka - Today, 12:35 AM, 63612=Makad - Today, 02:40 AM, 62241=UE30Oli - Today, 09:51 AM, 62916=oOKokaKolaOo - Today, 08:35 AM}",
    "textBeforeTable": "Toggle OTHER BI GAMES FORUMS OTHER BI GAMES FORUMS Today, 08:39 AM By kenoxite WW4 Extended - Unofficial e... 569752 replies 42680 topics Operation Flashpoint Coldwar Crisis and Resistance. SQUADS AND FANPAGES ADDONS & MODS: DISCUSSION, ADDONS & MODS: COMPLETE, MULTIPLAYER, USER MISSIONS, OPF MISSIONS, MP Test, OFP EDITING, *TROUBLESHOOTING FAQ, TROUBLESHOOTING, GENERAL, FLASHNEWS, NEWS DISCUSSION, ARMA: COLD WAR ASSAULT / OPERATION FLASHPOINT",
    "textAfterTable": "Toggle OFFTOPIC OFFTOPIC   Forum Stats Last Post Info OFFTOPIC OFFTOPIC - Games & Gaming For discussions not strictly related to our games. Topics should ideally still be related in some way, for example: military, politics, science. Note that just because this is for offtopic it's not a case of \"anything goes\", silly topics and especially topics which don't have any scope for discussion will be closed/deleted. 8917 topics 347102 replies European Politics Thread. By St. Jimmy Today, 08:00 AM PROMOTION Recent Topics",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}