{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,176 topics 2,127,026 replies",
            "85,565 topics 1,154,252 replies",
            "1,071 topics 11,084 replies",
            "4,218 topics 64,772 replies",
            "5,997 topics 75,834 replies",
            "50,559 topics 466,368 replies",
            "22,767 topics 196,354 replies",
            "4,275 topics 60,580 replies",
            "1,127 topics 8,223 replies",
            "3,612 topics 116,016 replies"
        ],
        [
            "Last Post Info",
            "Franklin giving orders in c... By cp1dell A minute ago",
            "Character switch scenarios By cp1dell A minute ago",
            "The Ultimate 100% Save File... By Militia 11 hours ago",
            "Which Vehicle Do You Prefer? By svanderman 11 hours ago",
            "Which vehicle suits Toni? By Nico 5 hours ago",
            "GTA San Andreas Windows 8.1... By Militia 30 minutes ago",
            "Reasons why Vice City is be... By Midnight Hitman 2 hours ago",
            "Grand Theft Auto III Chain... By MrMateczko 56 minutes ago",
            "What do you hate of GTA 2? By Cerium A day ago",
            "Lets play a game of \"Wo... By Xing of Virtue 4 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=267&t=554741&p=1062466703",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00064-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 108487707,
    "recordOffset": 108463481,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16358=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 18616=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 14107=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 47429=Bing, A.O.D.88, ash-274, Yahoo, Google, lol232, Macinho, r.lorenzo13, VikDarkbomb, DJThanos, !M4G3_N4T10N, Retired Mafia, EL_FAPiTaNo_FCB, epoxi, Verstappen, Juicyfer, ReRo, BluePhoenix, Fleckz, Pavle, supanaut, Omnigosh, Ray, Mona Sax, Lord of sandbox, theNGclan, Hjaere, catmandoza, Wolfhuman, glass pipe, MyName'sJeff, Officer Vic, BoomBapPoet, SpooferJahk, totallynotalion, Blackhailer, ChickenAndBeer, Tegan, Madgaz182, That1Psycho, Jake3 HD, PoeticWhisper, GVJLIMA, shivix, Max Payne, eimaj1779, Days Are Gone, HipsterHillbilly, Dan McChill, VideoGameJames, ClaudeSpeed1911, C64fanatic, Purplefireball9, KogerOnControls, Midnight Hitman, IDredMan, Victor Strawn, hyperar, Saint_Jackie, Radius95, darkmajesty06, BewareoftheBears, Dr. Sadler, RmpTebow15, HELLREAVERS MC, KiiWiiDeee, Run, HeavyDuke, Lil Kenzo, Claude Liberty, PSI-Breakaway, ashbashbluesfan, Khumaro, Bellic920, Hyde Original, StepNaza, Sea Bear, Fonshway, ClaudX, adit999, Non Fiction, Kalitu, NikoBellicGTAIV, CaptainDowntown, Wlzeigler, SolidUSP, lowriderlife63, Darrel, Marwin, Videogames888, LordRaijin, joe grizzly, Lewis Jephson, Ritu85, cornealis4, GTAFanClub, JF8494, Fearx--, Xenome13, FUBAR1991, Slasherr, 018361, doubleg213, Xing of Virtue, zz latios, arewenotmen, UlfiDerGeier, Ksurvivor, ardaozkal, thesnowyguitar, Awesom-0, Marpmarp, statistic, a1dopeman, Gamerjman19, BurnettVice, RM76, SonofUgly, missanthropy, NBAKingzFan10, Wolf of Velka, dewtech_2008, TheMariusz700_PL, Furious_Wave, TJGM, nemigaz82, GTA_Matt24, chet87, WinkingSkeever6, pedinhuh, fullxthrottle94, Winedc4, R4gN0r0K, jamrock55, Sketchy James, SNL, MotelGuy, kBlaise, Jon3s, Ledorus, xNCx, fiebru787, Google Mobile, alkaline_, cjarvis15, silverharbinger, o_Marvelous, Killerman78, Vanzant, Arms Dealer, Triton460, MrMateczko, OverdrivePedal, Shakez, ItsThatGuy!, CriminaL277, fireguy109, Quebahombre, Nicinator16, ParsoOnFire, RayB_ThrowaStack, xTOMMYTROJANx, monkb4skunk, Zello, Andreas, Jonsic, U.N.K.N.O.W.N, Vice City criminal, CCPD, Zorvaine, lexustt, Claptrap NL, darthdrillbit, SalvatoreCJ1903, NightTrainCaine, killstreakmx, Setzaroth, Marticus, TexasRocks, Moryachok, DrunkenMunkey78, Johan2599, Shia LaBeouf, deadx23, nkjellman, TheDamnTrainCJ, TheAscended, Freddy1Krueger, Cjs3315, LordMarvel, GradientDruid, hoopz71, AzTec731, Imnotthefiveo, A Maned Wolf, Craank_AG, gtafan26, Noclue_42, thebrianmo, Halal Cyborg, OG Viking, Frantz Fuchs, Stafish, Whitebyte101, Foxtrot64, Matttheking2015, -Velox, TheMcSame, Alfred Packer, TheBITW, Edward Nashton, LZoleee, psymin, TheUnholy, Cymru1991, Epic., s2n vaniish, bamsaidcam, Tony_Florence, Drunkmoons, LittleBlueTroll, SouthfieldGaming, sleepeeboy, StrykerY, Charmlessrogue, 17th, acalmocean, mrfilmpjesmaker123, kaya4195, SakiMonkey, SNEAKRET, NikoB08, Ry595, Coleco, Roadrage158, Facebook, Jinx., El Dorado, the_sniper_29, esdaniel, Tomasak, Smooth Longsack, The Hero, FourFingersOfFun, Chang, TheEroticCherry, BoJack Cognac, Tossin Salad, stonedpimpso, MelloHello, Alex76, XJpostman, Rebel, rlr149, Pyroshox, VercettiGuy, gallardo555, Ermacs, nexja, ElCartelAnonimo, Gridl0k, hamizzzz, ambiency, Vega LVI, ATastyCookie, RobinVerhulstZ, Alaannnn, Chief Ryze, Ezekeil2Ofive17, Speedy1st, rockstarfanboy1987, CaptainNikolai, Carrythxd, Driver333, KiTTYReCkless, The_Anti-tragedy, pcguytech, meta187, marhex, Bane X01, VicRattlehead27, Lay, SnowBell, Frito-Man, Between3and20chars, Ton 1 NL, tealcus, -Z31N-, Bootels, Malcot, Cyberzone2, Totoyeahwhat123, AmbientZed, joe1606, 20766=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12557=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9330=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 123236=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By VikDarkbomb The Groove 614,579 replies 15,219 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By ReRo Has anybody seen this? 2,292,029 replies 113,732 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support Guides & Strategies,",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,516 topics 416,572 replies [3ds Max] San Andreas refle... By MrGTAmodsgerman 5 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}