{
    "relation": [
        [
            "Forum",
            "Woodworking Skill Share Your woodworking skills are displayed for several lifetimes in each project. Have you had to compromise your project...",
            "Woodturning On the lathe, by the lathe: do you have questions? frustrations? tips? This forum is for all the woodturners out there.",
            "Woodcarving Relief, 3D, chip-carving, whittling; carving knives, chisels, pocket-knives, power tools. If you are a carver or want...",
            "Scrollsawing Intarsia, fretwork, intricate design cutting and more! This forum is for scrollsawers: share your tips, ask questions...",
            "Joinery Have a question? a tip/strategy to share? a challenge, perhaps? Share your \"joinery\" discussion here.",
            "Finishing The finish, whether paint, wax, stain, or something else, can make or break a project. What are your tips and questio...",
            "Designing Woodworking Projects Looking for information on designing your projects? Having difficulties reading project plans? Looking for help with ...",
            "Power Tools, Hardware and Accessories Are you unsure of which tools, or hardware, you need, or which brands to buy? Investing in tools and hardware can be ...",
            "CNC Woodworking Questions and answers about CNC machines, tooling, best practices, and projects.",
            "Hand Tools Wood, your hand tools, you and a little know-how. Share your questions, tips and strategies for the use and maintenan...",
            "Jigs & Fixtures Using a jig is like having a couple extra hands helping out. Show us your jigs, share your tips, strategies and, of c...",
            "Wood & Lumber Different wood requires different woodworking strategies - from cutting to finishing. Share your tips and challenges ...",
            "Safety in the Woodworking Shop Before you pick up those woodworking tools, take the time to ensure your safety in the shop! Eyes, ears, fingers, and...",
            "Focus on the Workspace Are you looking for or do you have tips to share regarding the workshop? Storage, equipment placement, efficiency, an...",
            "Sweating for Bucks Through Woodworking If you are selling your work, then you have entered a woodworking dimension with added complexity and stress. If you...",
            "Woodworking Trade & Swap All of us are holding onto treasure in our shops, that we either don't need, don't want, or could part with if presen...",
            "LumberJocks.com Site Feedback Connect with the Website Gurus and tell us what you are thinking, suggestions, problems, functionality issues, and so...",
            "Coffee Lounge Need a break from all the standing and wood dust? Chat with your Forum Friends about their projects, their life, thei..."
        ],
        [
            "Topics",
            "10490",
            "1087",
            "224",
            "204",
            "698",
            "3229",
            "5106",
            "21971",
            "71",
            "3860",
            "1001",
            "4655",
            "1122",
            "1563",
            "1038",
            "3793",
            "1951",
            "7769"
        ]
    ],
    "pageTitle": "Need Advice on Used Power Tools - by normrep @ LumberJocks.com ~ woodworking community",
    "title": "",
    "url": "http://lumberjocks.com/topics/40273",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00330-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 143516519,
    "recordOffset": 143501485,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1940=08-01-2012 04:04 PM, 2114=A friend told me of a neighbor who wants to sell some tools that I need for my shop. He is an 84 year old gentleman who has to give up woodworking because of health problems. He wants to sell me an older Craftsman 12” wood lathe for $50.00. I’ve never done lathe work but figure for that kind of money, I ought to give it a try. What kind of parts and accessories should I be asking about? He also has a 1994 Jet JDP 14JF Drill Press with 1/2 hp motor that looks pretty good. Don’t know how much money I ought to offer for that. He also has a 2001 Porter Cable Omni Jig Dovetail Machine Model 5116 16”. I’ve never tried dovetail jigs either, but wondered if this might be a useful tool if I ever wanted to give it a try or if I should consider something else. I don’t like the machined dovetailed drawers that are real close together like you see in most factory built cabinets. I like the larger dovetails that look like they were done the old fashioned way – don’t know if this jig can do that or not. It looks like it’s not been used much and I think he has all the parts. Anything I should be aware of when considering this – and what kind of money should I offer? I don’t have a clue what would be fair pricing for the press or the jig. I would think 50 bucks for the lathe would be reasonable?, 4831=#1 posted 10-07-2012 08:45 PM, 25742=©2015 Verticalscope Inc. All Rights Reserved. | Terms of Service | Privacy Policy, 6305=#2 posted 10-08-2012 12:15 PM}",
    "textBeforeTable": "Show all forums View all topics Start new topic signed in to reply. You must be Have your say... Sorry, but it’s already sold to another buyer. #2 posted 10-08-2012 12:15 PM 21 posts in 1369 days home | projects | blog normrep Normrep, I ‘m looking for a 5116 jig base, and wondered if you didn’t buy the one from your neighbor, if you would give me the info for contacting him. Thanks #1 posted 10-07-2012 08:45 PM 4 posts in 1031 days home | projects | blog Newsomwoodworks",
    "textAfterTable": "All Posts RSS Projects RSS Blog Entries RSS Reviews RSS Forum Topics RSS Site Blog Entries RSS Go to Pulse page » LumberJocks Pulse   Author Latest activity New comments or replies",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}