{
    "relation": [
        [
            "Poster",
            "myhotwheels22981",
            "Home away from home Joined: 2002/3/22 From: Posts: 247",
            ""
        ],
        [
            "Thread",
            "Posted: 2005/12/16 1:22 Updated: 2005/12/17 1:02",
            "Re: 4-Door Wrangler Undressing I really like what I see so far...The 4 door model pictured here would really appeal to persons like myself, who currently own a Wrangler, have outgrown it with kids, need to upgrade to something with more room and 4 doors, but still want to stay close to the Wrangler line. The removable hardtop panels (and I am still assuming, zip-in soft-top panels) would appeal to condo-dwellers like myself with limited storage space, as well as providing more options for hardtop arrangements (1 or 2 sunroofs, possibly? hardop on the rear half, canvas over the front seats for a 'quickie' dose of sun?) I am getting one A.S.A.P. I like the prospect of a CRD and 6 Spd. trans...throw on the rock-trac transfer case, and some decent axles, and were ready to tackle the Rubicon. I am guessing that it will be called the 'Scout' or 'Wrangler-Scout'---possibly 'Dakar', (or mabye 'Dakar' will show up as a high-end package, like the Rubicon)...Remember, DCX paid some cash to IH for the Scout name, and they haven't used it yet. DEC 16...I have been reading alot of posts calling for the 4-door Wrangler to be called the Cherokee...I don't think that will happen here in the U.S. Way back when, Chrysler/Jeep made an agreement with the Cherokee Indian Nation that when the XJ was replaced (with the Liberty) that the replacement KJ would be named something other than 'Cherokee'. Chrysler/Jeep held onto the name 'Grand Cherokee', with, of course, a large donation to Naitive American Indian Tribes, however pledged to not pick names for any future Jeep which infringe on the Naitive American Indians legacy. So, Unless DCX has since backed out of that agreement, I am not counting on a Naitive American-Based name...Besides, I like DAKAR, because the DAKAR concept was the real impetus for this 4-door Wrangler, and if DCX doesn't offer a high end package which mimics the DAKAR concept, you can be sure the aftermarket is going to grab the ball and run with it.",
            ""
        ]
    ],
    "pageTitle": "mike's totally free jeep news now - News",
    "title": "",
    "url": "http://www.jeepnewsnow.com/modules/news/article.php?storyid=902",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00073-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 519211980,
    "recordOffset": 519195586,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "You must login or register to post a comment. We aren't responsible for their content. The comments are owned by the poster. FlatThreadedNested Oldest FirstNewest First margin:3px;\"> //--> google_color_text = \"000000\"; google_color_url = \"006633\"; google_color_link = \"006699\"; google_color_bg = \"FFFFFF\"; google_color_border = \"006699\"; google_ad_channel =\"\"; google_ad_format = \"468x15_0ads_al\"; google_ad_height = 15; google_ad_width = 468; google_ad_client = \"pub-0495763959545387\"; Reader Reactions",
    "textAfterTable": "Posted: 2005/12/19 11:15   Updated: 2005/12/19 11:15 Home away from home Joined: 2005/11/28 From: TX Posts: 190  Re: 4-Door Wrangler Undressing The \"tub\" is still there (kinda), but it's going to be considerably different than the TJ's tub. The body construction will be more like a regular SUV or pick-up truck, vs the \"tub\" of the CJs and previous Wranglers. The rocker panel angles back under the door like the XJ's rocker panels, and it looks very much like there's a pinch seam under the rocker panel. There won't be a diesel though, nor a V8. Just a 3.8L V6 (yes, 3.8, not the 3.7) and possibly a 4-banger on base models (though I really can't see them trying to get by with a 4-banger in the 4-dr model). The doors are still removeable, but the hinges are quite a bit different than the current ones, judging by how the Gladiator's door were done. And WTJ is correct about the vehicle in the pic being a euro-spec model (RHD, enclosed front fenders, red rear fog ligh on the bumper).",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}