{
    "relation": [
        [
            "",
            "",
            "William J. Schoen",
            "Joseph V. Vumbacco",
            "Kent P. Dauten",
            "Donald E. Kiernan",
            "Robert A. Knox",
            "William E. Mayberry, M.D.",
            "Vicki A. O\u0092Meara",
            "William C. Steere, Jr.",
            "Randolph W. Westerfield, Ph.D."
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Votes For",
            "199,158,064",
            "199,178,130",
            "198,165,942",
            "198,689,771",
            "198,165,515",
            "199,131,562",
            "202,257,872",
            "201,262,925",
            "202,274,099"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Votes Withheld",
            "5,604,567",
            "5,584,502",
            "6,596,690",
            "6,072,860",
            "6,597,116",
            "5,631,069",
            "2,504,760",
            "3,499,706",
            "2,488,533"
        ]
    ],
    "pageTitle": "Edgar Filing: HEALTH MANAGEMENT ASSOCIATES INC - Form 10-Q",
    "title": "",
    "url": "http://thenumbers.marketplace.org/publicradio/action/getedgarwindow?accesscode=119312506106544",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00113-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 237348815,
    "recordOffset": 237303196,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{218864=Pending Acquisition. On April 17, 2006, we announced the signing of a definitive agreement to acquire Gulf Coast Medical Center, a 189-bed general acute care hospital in Biloxi, Mississippi. We expect that this transaction will close on or before July 1, 2006., 333097=Net interest expense increased from approximately $3.8 million during the 2005 Period to $8.4 million during the 2006 Period. Such change is attributable to an increased weighted average revolving credit agreement outstanding balance during the 2006 Period when compared to the 2005 Period and, to a lesser extent, higher interest rates during the 2006 Period. Incremental borrowings under our credit agreement during the 2006 Period were necessary to fund our acquisition activity and repurchase certain of our Exchange Zero-Coupon Convertible Senior Subordinated Notes due 2022 (the \u0093New 2022 Notes\u0094). Specifically, our repurchase of the New 2022 Notes caused our interest expense to increase by approximately $2 million during the 2006 Period because the effective annual interest rate of the New 2022 Notes (i.e., 0.875%) is substantially less than the corresponding variable rate under our credit agreement (see \u0093Liquidity-Capital Resources, Credit Facilities\u0094 below)., 262219=On September 3, 2004, a lawsuit, Olga S. Estrada v. Health Management Associates, Inc., was initiated in the South Carolina Court of Common Pleas, Seventh Judicial Circuit. This case was subsequently removed to the United States District Court for the District of South Carolina, Spartanburg Division. The plaintiff subsequently dismissed this lawsuit and, on December 17, 2004, commenced a new lawsuit, Olga S. Estrada v. Gaffney H.M.A., Inc., d/b/a Upstate Carolina Medical Center, in the South Carolina Court of Common Pleas, Seventh Judicial Circuit, against our subsidiary hospital in Gaffney, South Carolina. The lawsuit challenges the amounts charged for medical services by our South Carolina subsidiary hospital to uninsured patients. The Supreme Court of South Carolina thereafter assigned this and all similar hospital pricing litigation cases to a single judge for common handling of pretrial matters, including discovery and class certification. The order also permits individual trials before the same judge. The plaintiff seeks damages and injunctive relief on behalf of a purported class of uninsured patients who have been or will be treated at our subsidiary hospital., 357606=Exchange Zero-Coupon Convertible Senior Subordinated Notes due 2022 (the \u0093New 2022 Notes\u0094). As more fully discussed at Note 6 to the Interim Condensed Consolidated Financial Statements in Item 1, we were contractually obligated to repurchase certain New 2022 Notes on January 31, 2006 at their accreted amount (i.e., approximately $275.9 million). The holders of approximately $12.7 million in principal face value New 2022 Notes did not require us to repurchase their notes and, accordingly, such notes remain outstanding. The holders of the remaining New 2022 Notes may require us to repurchase such notes for their accreted value on January 28, 2007. We financed the $275.9 million New 2022 Note repurchase with borrowings under our credit agreement. Should we be required to repurchase the remaining New 2022 Notes, we intend to satisfy such obligations with available cash balances, cash provided by operating activities and, if necessary, amounts available under our credit agreement., 140344=On November 10, 2005, the FASB issued Staff Position No. 123(R)-3, Transition Election Related to Accounting for the Tax Effects of Share-Based Payment Awards, which provides an alternative (and simplified) method to calculate the pool of excess income tax benefits upon the adoption of SFAS No. 123(R). Among other things, Staff Position No. 123(R)-3 also provides guidance on how to present excess tax benefits in statements of cash flows when the alternative pool calculation is used. This new guidance became effective upon its issuance; however, companies can generally make a one-time election to adopt the transition method in Staff Position No. 123(R)-3 up to one year from the later of (i) initial adoption of SFAS No. 123(R) or (ii) November 10, 2005. If a company elects to adopt the alternative method after it has already issued financial statements pursuant to the provisions of SFAS No. 123(R), such adoption would be considered a change in accounting principle. We continue to evaluate Staff Position No. 123(R)-3 and, accordingly, we have not yet determined whether we will elect the alternative method thereunder., 264939=On May 2, 2006, we announced that our Board of Directors declared a quarterly cash dividend of $0.06 per share of common stock, payable on June 5, 2006 to stockholders of record at the close of business on May 12, 2006., 238156=On April 21, 2006, we completed an underwritten public offering of $400.0 million of our Senior Notes, which are unsecured obligations that rank equally in priority with our credit agreement. The Senior Notes are expressly senior in right of payment to the 2022 Notes, the New 2022 Notes and the 2023 Notes. Exclusive of transaction-related expenses, the sale of the Senior Notes resulted in our receipt of net proceeds approximating $396.3 million, which we utilized to repay a portion of the balance outstanding under our credit agreement. The Senior Notes mature on April 15, 2016 and bear interest at a fixed rate of 6.125% per annum, payable semi-annually in arrears on April 15 and October 15, commencing on October 15, 2006., 240580=Pursuant to the provisions of SFAS No. 78, Classification of Obligations That Are Callable by the Creditor, approximately $572.0 million of the New 2022 Notes and the 2023 Notes were classified as current liabilities at December 31, 2005. As a result of the increased availability under our long-term credit agreement and our public offering of the Senior Notes, none of the amounts attributable to our potential long-term debt repurchase obligations were classified as current liabilities at March 31, 2006., 269757=Outpatient services continue to play an important role in the delivery of health care in our markets, with approximately half of our total revenue during the 2006 Period and the 2005 Period generated on an outpatient basis. We continue to improve our emergency room and diagnostic imaging services to meet the needs of the communities we serve and have invested capital in nearly every one of our hospitals during the last five years in one of these two areas. As a result of this continuous focus and notwithstanding a decline in same hospital admission activity, our same hospital 2006 Period adjusted admissions, which adjusts admissions for outpatient volume, only declined by 0.1% when compared to the 2005 Period., 276294=2006 Period Compared to the 2005 Period, 156368=Exercisable options at March 31, 2006, 132208=March 31, 2006, 12358=Condensed Consolidated Statements of Cash Flows - Three Months Ended March 31, 2006 and 2005, 172378=Fair value for the sole stock option award during the three months ended March 31, 2006 was estimated at the date of grant using the Black-Scholes option pricing model with the following assumptions: (i) risk-free interest rate of 4.50%; (ii) dividend yield of 1.0%; (iii) volatility factor of the expected market price of our common stock of 0.300; and (iv) weighted average expected life of the option of five years. The expected stock price volatility factor is derived using daily or weekly historical market price data for periods preceding the date of grant. The risk-free interest rate is the approximate yield on five-year United States Treasury Notes on the date of grant. The expected life is an estimate of the number of years an option will be held before it is exercised. The fair value of the sole option award granted during the three months ended March 31, 2006 was approximately $2.0 million ($6.71 per stock option)., 394111=Our business and operations are subject to numerous risks, many of which are described in Part I of our Annual Report on Form 10-K for the year ended September 30, 2005 under the heading \u0093Business\u0097Risk Factors.\u0094 If any of the events described therein should occur, our business and results of operations could be harmed. A description of new risk factors or risk factors that have been modified or have materially changed since September 30, 2005 is included below; however, additional risks and uncertainties that are not presently known to us, or which we currently deem to be immaterial, could also harm our business and results of operations., 230182=FIN 45-3 applies to all of our minimum revenue guarantees issued or modified after December 31, 2005. Retroactive application of FIN 45-3 is not permitted. Accordingly, for contracts or contract modifications executed on or before December 31, 2005, we expense physician and physician group advances as they are paid over the commitment period. For contracts and contract modifications executed thereafter, we capitalize our estimated guarantee costs at the inception of the contract or the date of the contract modification. We then amortize such costs over the remaining life of the contract, including, if applicable, the physician retention period. Our estimated guarantee cost liabilities are predicated on historical payment patterns, industry trends and the related hospital\u0092s regional economic conditions, as well as our evaluation of the facts and circumstances germane to the individual contract/modification under review. There can be no assurances that these estimates will be adequate to provide for our guarantee costs. Adjustments to our estimated liabilities are recognized in the consolidated financial statements in the period that the change in estimate is identified. We believe that the estimated liabilities for physician and physician group guarantees that are recorded in our balance sheet (aggregating approximately $1.7 million at March 31, 2006) are adequate and reasonable; however, there can be no assurances that the ultimate liability will not exceed our estimates. If the costs of these programs exceed our estimates, the liabilities could be materially adversely affected., 273283=Stock-Based Compensation. As more fully discussed at Note 2 to the Interim Condensed Consolidated Financial Statements in Item 1, effective October 1, 2005 we adopted Statement of Financial Accounting Standards (\u0093SFAS\u0094) No. 123(R), Share-Based Payment. Among other things, this new accounting pronouncement significantly modifies the way our stock-based compensation is recorded. Prior to October 1, 2005, we elected to utilize the intrinsic value method, as prescribed by Accounting Principles Board Opinion No. 25, Accounting for Stock Issued to Employees., 266125=At March 31, 2006, we operated 58 general acute care hospitals and two psychiatric hospitals in non-urban communities in Alabama, Arkansas, Florida, Georgia, Kentucky, Mississippi, Missouri, North Carolina, Oklahoma, Pennsylvania, South Carolina, Tennessee, Texas, Virginia, Washington and West Virginia., 354824=We executed a $20.0 million unsecured Demand Promissory Note in favor of a bank, which is to be used as a working capital line of credit in conjunction with our cash management program. Pursuant to the terms and conditions of the Demand Promissory Note, we may borrow and repay on a revolving unsecured basis up to the principal face amount of the note. All principal and accrued interest outstanding under the Demand Promissory Note will be immediately due and payable upon the bank\u0092s written demand. Absent such demand, interest is payable monthly and determined using the LIBOR Market Index Rate, as that term is defined in the Demand Promissory Note, plus 0.75%. The Demand Promissory Note\u0092s effective interest rate on March 31, 2006 was 5.51%; however, there were no amounts outstanding thereunder on such date., 9729=FOR THE QUARTERLY PERIOD ENDED MARCH 31, 2006, 346004=Cash provided by financing activities during the 2006 Period included borrowings of $285.0 million under our revolving credit agreement in order to finance a hospital acquisition during such period and our repurchase of a portion of the New 2022 Notes. Proceeds from exercises of stock options provided an additional $1.7 million during the 2006 Period. As more fully discussed at Note 6 to the Interim Condensed Consolidated Financial Statements in Item 1, on January 31, 2006 we repurchased approximately $275.9 million of the New 2022 Notes, which represented the accreted value thereof on such date. Additionally, cash used by financing activities during the 2006 Period included dividend payments and cash distributions to minority shareholders of approximately $14.4 million and $1.9 million, respectively., 232367=Other Accounting Pronouncements and Guidance. On December 15, 2003, the FASB issued an Exposure Draft entitled Earnings Per Share, an Amendment of FASB Statement No. 128 (the \u0093Amendment\u0094), which requires, in part, that for contracts that can be settled in either cash or shares, issuing entities should assume share settlement for purposes of calculating diluted earnings per share. In conjunction with the Amendment, the FASB determined that retroactive restatement of earnings per share was not required for contracts appropriately modified to eliminate share settlement prior to December 31, 2004. The Amendment was originally proposed to be effective for reporting periods that ended after December 15, 2004. However, the Amendment was subsequently incorporated into a broader FASB Exposure Draft on earnings per share that was issued for comment on September 30, 2005 (comments were due on or before November 30, 2005). As more fully discussed at Note 3 to the consolidated financial statements included with our Annual Report on Form 10-K for the year ended September 30, 2005, we took certain actions with respect to our Zero-Coupon Convertible Senior Subordinated Notes due 2022 (the \u00932022 Notes\u0094) and our 1.50% Convertible Senior Subordinated Notes due 2023 (the \u00932023 Notes\u0094) to prevent the common stock underlying such notes from being immediately included in diluted earnings per share calculations., 360819=At March 31, 2006, we maintained approximately $49.6 million of standby letters of credit in favor of third parties with various expiration dates through March 31, 2007. Should any or all of these letters of credit be drawn upon, we intend to satisfy such obligations with available cash balances, cash provided by operating activities and, if necessary, amounts available under our credit agreement., 220994=The operating results of the hospitals acquired on or before March 31, 2006 have been included in our interim condensed consolidated financial statements from the date of each respective acquisition. The following combined pro forma financial information provides that (i) for purposes of the three months ended March 31, 2005, acquisitions completed subsequent to December 31, 2004 were effected as if they had closed on January 1, 2005 and (ii) for purposes of the three months ended March 31, 2006, acquisitions completed subsequent to December 31, 2005 were effected as if they had closed on January 1, 2006., 266548=Unless specifically indicated otherwise, the following discussion excludes Williamson Memorial Hospital in Williamson, West Virginia. The operations of such hospital during the three months ended March 31, 2006 and 2005 were not material to our consolidated results of operations. We anticipate a disposition of this hospital to occur, via a sale, no later than September 30, 2006. See Note 7, Discontinued Operations, to the Interim Condensed Consolidated Financial Statements in Item 1., 191845=There were no shares issued under our deferred stock or restricted stock programs during the three months ended March 31, 2006 and 2005., 346940=Cash provided by financing activities during the 2005 Period included borrowings of $180.0 million under our revolving credit agreement in order to finance the three hospitals we acquired in February 2005 and the individual hospital we acquired with an effective date of April 1, 2005. Proceeds from exercises of stock options provided an additional $31.1 million during the 2005 Period. Cash used by financing activities during such period included dividend payments of approximately $9.0 million and principal payments on debt and capital lease obligations of $15.0 million., 3226=Commission File Number: 001-11141, 226760=Physician and Physician Group Guarantees. We have committed to provide certain financial assistance pursuant to recruiting arrangements and professional services agreements with physicians and physician groups practicing in the communities that our hospitals serve. For example, when relocating a physician to a community where one of our hospitals is located, we may advance money to such physician in order to assist him or her establish a private practice. Any amount advanced under these recruiting agreements during the commitment period is considered to be a loan. Provided that the physician continues to practice in the community, the loan is generally forgiven on a pro rata basis over a period of 12 to 24 months. At March 31, 2006, we were committed to non-cancelable guarantees of approximately $13.3 million pursuant to various physician and physician group arrangements. The actual amounts advanced will depend upon the financial results of each physician\u0092s or physician group\u0092s private practice during the contractual measurement period, which generally does not exceed one year., 331228=Salaries and benefits increased as a percent of total revenue to 39.3% for the 2006 Period from 39.0% for the 2005 Period. This increase in the salaries and benefits percentage is attributable to the incremental impact of stock-based compensation (i.e., an increase of approximately $3.9 million in the 2006 Period over the 2005 Period). We believe that our Chief Nursing Officers effectively manage their staffs in response to varying patient volume and acuity, thereby reducing nurse turnover, moderating our salaries and benefits cost increases and minimizing our reliance on subcontracted nursing services. Same hospital salaries and benefits, exclusive of the impact of stock-based compensation, increased from 37.4% of net patient service revenue in the 2005 Period to 37.8% in the 2006 Period. The percentage increase is a result of our strategic initiatives to (i) hire more primary care physicians and family practitioners to improve and enhance physician referral patterns and (ii) employ physicians on a short-term basis in order to facilitate their entry into markets where our hospitals operate., 158214=Options vested or expected to vest at March 31, 2006, 364279=Certain statements contained in this quarterly report, including, without limitation, statements containing the words \u0093believe,\u0094 \u0093anticipate,\u0094 \u0093intend,\u0094 \u0093expect,\u0094 \u0093may,\u0094 \u0093plan,\u0094 \u0093continue,\u0094 \u0093should,\u0094 \u0093project\u0094 and words of similar import, constitute \u0093forward-looking statements\u0094 within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These statements may include projections of revenue, income or loss, capital expenditures, capital structure, other financial items, statements regarding our plans and objectives for future operations and acquisitions, statements of future economic performance, statements of the assumptions underlying or relating to any of the foregoing statements, and statements which are other than statements of historical fact., 231917=Our adoption of FIN 45-3 did not have a material impact on our financial position or results of operations as of and for the three months ended March 31, 2006; however, we estimate that the adoption of this accounting guidance will increase our diluted earnings per share up to $0.02 during the year ending December 31, 2006., 367863=At March 31, 2006, the fair value and carrying amount of our fixed rate debt, including capital lease obligations, was approximately $654.3 million and $651.9 million, respectively. Additionally, at such date, both the fair value and carrying amount of our variable rate debt was approximately $553.0 million. See Note 6 to the Interim Condensed Consolidated Financial Statements in Item 1 for a discussion of certain debt transactions we completed subsequent to March 31, 2006., 150363=Outstanding options at January 1, 2006, 330112=Accounts written off as charity and indigent care are not recognized in net patient service revenue. Foregone charges for charity care and indigent write-offs were $149.6 million or 4.1% of gross patient service revenue during the 2006 Period and $135.0 million or 4.2% of gross patient service revenue during the 2005 Period. Effective June 30, 2005, we changed our policy to reserve 100% of all self-pay accounts receivable greater than 120 days old (prior thereto, the policy was to reserve 100% when the account balance reached 150 days old). For commercial accounts receivable over 150 days old, we also reserve 100% of the account balance. We believe that our decentralized management strategy, including maintaining local business office operations in each of our hospitals, significantly contributes to our effective accounts receivable management. Our hospitals also work diligently to help uninsured patients qualify for Medicaid and other state and local financial assistance programs., 142225=General. In recent years, we have utilized our 1996 Executive Incentive Compensation Plan to grant non-qualified stock options and award other stock-based compensation to our key employees. The non-employee members of our Board of Directors were historically granted non-qualified stock options pursuant to our Stock Option Plan for Outside Directors. At our annual meeting of stockholders on February 21, 2006, our stockholders approved the Health Management Associates, Inc. 2006 Outside Director Restricted Stock Award Plan. Such plan provides for annual issuances of restricted stock awards to the outside directors on our Board of Directors., 263544=The above lawsuits are similar to other lawsuits filed against hospitals throughout the country regarding charges to uninsured patients. We believe that the billing and collection practices at all of our subsidiary hospitals are appropriate, reasonable and in compliance with all applicable laws, rules and regulations. Accordingly, we intend to vigorously defend our company and our subsidiaries against the allegations contained in the above lawsuits. As it is not possible to estimate the ultimate loss, if any, relative to such lawsuits, no loss accruals have been recorded for these matters at March 31, 2006 or December 31, 2005., 190187=Balance at March 31, 2006 (non-vested), 328831=Our total revenue for the 2006 Period was $1,032.7 million as compared to $908.2 million for the 2005 Period. This change represents an increase of $124.5 million or 13.7%. Same hospitals provided approximately $56.2 million, or 45.1%, of the increase in total revenue as a result of increases in surgeries and reimbursement rates, as well as favorable case mix trends. Of the remaining $68.3 million increase in total revenue, (i) $67.7 million was attributable to three hospitals we acquired in February 2005 and individual hospitals we acquired in each of April 2005, December 2005, January 2006 and February 2006 and (ii) $0.6 million related to an increase in miscellaneous revenue., 139541=We adopted SFAS No. 123(R) on October 1, 2005 and elected the modified prospective methodology thereunder. As prescribed by this transitional methodology, prior periods have not been restated. Moreover, pursuant to the requirements of the modified prospective methodology, compensation expense is recognized for (i) all stock-based awards granted or modified after September 30, 2005 and (ii) the portion of previously granted outstanding awards for which the requisite service had not been rendered as of the SFAS No. 123(R) adoption date (the unrecognized compensation amount at such date has been computed pursuant to the provisions of SFAS No. 123)., 192946=At March 31, 2006, there was approximately $23.5 million of unrecognized compensation cost attributable to non-vested deferred stock and restricted stock awards. Such cost is expected to be recognized over the remaining requisite service period for each award, the weighted average of which is approximately 3.2 years., 397052=At our Annual Meeting of Stockholders held on February 21, 2006, our stockholders voted on the matters set forth below., 362669=A number of hospital renovation and/or expansion projects were underway at March 31, 2006. We do not believe that any of these projects are individually significant or that they represent, in the aggregate, a significant commitment of our resources. Specifically, we completed construction of our replacement hospital in Carlisle, Pennsylvania in January 2006 and we plan to open our new Collier Regional Medical Center in Naples, Florida, which is currently under construction, in January 2007. Within the next year, we anticipate that we will spend approximately $100 million to $115 million for new and replacement hospital construction. Additionally, we are obligated to construct a new hospital facility at our Monroe, Georgia location within the next three years. The aggregate cost for such project has not yet been determined but the underlying land parcel was acquired for cash in March 2006., 174236=For purposes of pro forma disclosure under SFAS No. 123, the estimated fair values of stock options were determined using a Black-Scholes option valuation model and were amortized to expense on a straight-line basis over the underlying option\u0092s vesting period. Our pro forma information for the three months ended March 31, 2005, which is not recorded in the interim condensed consolidated financial statements, is as follows (in thousands, except per share data):, 192101=During the three months ended March 31, 2006 and 2005, we recognized approximately $1.7 million and $0.9 million, respectively, of compensation expense attributable to deferred stock and restricted stock awards. Except for awards that require the attainment of certain predetermined market prices of our common stock as a vesting requirement (i.e., a market condition), compensation expense is predicated on the fair value (i.e., market price) of the underlying stock on the date of grant. For awards with a market condition, we utilize a lattice valuation model to determine the fair values thereof; however, such awards had a nominal financial impact on our operating results for the three months ended March 31, 2006., 343187=Our cash flows from continuing operating activities increased approximately $38.1 million or 37.6% during the 2006 Period when compared to the 2005 Period. Despite lower net income during the 2006 Period, improved operating asset and liability management led to increased cash flows from continuing operating activities during such period. Additionally, our change in fiscal year end from September 30 to December 31 resulted in the deferral of approximately $20.2 million of federal and state income tax payments from March 2006 to April 2006, thereby favorably impacting our cash flows from continuing operating activities during the 2006 Period. Business interruption insurance proceeds of approximately $5.0 million and $10.0 million were included in cash flows from continuing operating activities during the 2006 Period and the 2005 Period, respectively. Such amounts have generally been utilized to make repairs at the hospitals impacted by hurricane and storm activity., 219255=General. The completed and pending acquisitions described above are in furtherance of that portion of our business strategy that calls for us to acquire hospitals in rural and non-urban areas of 30,000 to 400,000 people, primarily in the southeastern and southwestern United States. The transactions that closed on or before March 31, 2006 were accounted for using the purchase method of accounting. The purchase prices were allocated to the assets acquired and liabilities assumed based upon their respective estimated fair values at the acquisition dates. We regularly utilize an independent third party valuation specialist to help determine the fair values of certain assets underlying our acquisitions. In certain instances, purchase price allocations are subject to refinement upon finalization of such third party appraisals and final settlements of working capital accounts. As a result of the acquisitions that closed on or before March 31, 2006, we recorded goodwill (most of which is expected to be tax deductible) because the final negotiated purchase prices exceeded the net tangible and intangible assets acquired., 81655=Common stock, Class A, $0.01 par value, 750,000 shares authorized, 273,254 and 273,148 shares issued at March 31, 2006 and December 31, 2005, respectively, 358732=1.50% Convertible Senior Subordinated Notes due 2023 (the \u00932023 Notes\u0094). Holders of the 2023 Notes may require us to purchase all, or a portion, of such notes on August 1, 2006 for a cash purchase price per note equal to 100% of their principal amount, plus accrued and unpaid interest to that date. At March 31, 2006, there was $575.0 million of principal outstanding under the 2023 Notes. If some, or all, of the 2023 Notes are put to us, we intend to purchase such notes using a combination of available cash balances, cash provided by operating activities, amounts available under our revolving credit agreement and, if necessary, other long-term financing. We believe that our corporate credit ratings of A- by both Standard & Poor\u0092s and Fitch Ratings are indicative of our ability to procure financing as may be necessary to fully satisfy any obligation that would arise out of a put of all, or a substantial portion, of the 2023 Notes., 260052=The interim condensed consolidated financial statements for the three months ended March 31, 2005 include approximately $2.6 million of revenue attributable to recoveries under business interruption insurance policies for hurricane and storm-related claims. No business interruption insurance revenue was recorded during the three months ended March 31, 2006., 92456=March 31,, 235805=At March 31, 2006 and December 31, 2005, the outstanding balances under our revolving credit agreement were $540.0 million and $255.0 million, respectively. As of May 5, 2006, $240.0 million was outstanding thereunder. The decrease in our outstanding credit agreement balance subsequent to March 31, 2006 was primarily due to the utilization of the net proceeds from our sale of 6.125% Senior Notes due 2016 (the \u0093Senior Notes\u0094), which are described in further detail below, to repay a portion of such outstanding balance, offset by new borrowings to fund our Cleveland Clinic-Naples Hospital acquisition (see Note 4)., 154534=Outstanding options at March 31, 2006, 359930=On February 3, 2006, we announced that our Board of Directors declared a quarterly cash dividend of $0.06 per share of common stock, payable on March 9, 2006 to stockholders of record at the close of business on February 15, 2006. Additionally, on May 2, 2006 we announced that our Board of Directors declared a quarterly cash dividend of $0.06 per share of common stock, payable on June 5, 2006 to stockholders of record at the close of business on May 12, 2006. Our dividend payments are funded with available cash balances, cash provided by operating activities and amounts available under our credit agreement., 216778=2006 Acquisitions. Effective January 1, 2006, we acquired Barrow Community Hospital, a 56-bed general acute care hospital in Winder, Georgia. The cash paid for this acquisition was approximately $33.2 million for property, plant and equipment and other non-current assets and approximately $2.1 million for working capital. Effective February 1, 2006, we acquired an 80% ownership interest in Orlando Regional St. Cloud Hospital, an 84-bed general acute care hospital in St. Cloud, Florida. Orlando Regional Healthcare, a not-for-profit organization, retained a 20% ownership interest in the hospital. The purchase price for the 80% controlling interest in Orlando Regional St. Cloud Hospital was approximately $38.1 million. Additionally, effective May 1, 2006 we acquired Cleveland Clinic-Naples Hospital, an 83-bed general acute care hospital in Naples, Florida, and a vacant land parcel near such hospital. The aggregate cash paid for this acquisition was approximately $125.5 million for property, plant and equipment and other non-current assets and approximately $1.9 million for supply inventories., 275078=Physician and Physician Group Guarantees. As more fully discussed at Note 5 to the Interim Condensed Consolidated Financial Statements in Item 1, we adopted the accounting and financial reporting provisions of Financial Accounting Standards Board Staff Position FIN 45-3, Application of FASB Interpretation No. 45 to Minimum Revenue Guarantees Granted to a Business or Its Owners, on January 1, 2006. Adoption of this new accounting guidance did not have a material impact on our financial position or results of operations during the 2006 Period; however, we estimate that the overall impact will be an increase in our diluted earnings per share of up to $0.02 during the year ending December 31, 2006., 334661=Our effective income tax rates were approximately 38.5% and 38.3% for the 2006 Period and the 2005 Period, respectively., 329652=Net patient service revenue per adjusted admission at our same hospitals increased 6.7% during the 2006 Period as compared to the 2005 Period. Contributing factors to such change included increased patient acuity and improvements in Medicare pricing, as well as the effects of favorably renegotiated agreements with certain commercial providers., 6929=Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days.    Yes  x    No  ¨, 334185=In connection with the aforementioned repurchase of certain of the New 2022 Notes on January 31, 2006, we wrote off approximately $4.6 million of deferred financing costs, which adversely impacted diluted earnings per share by approximately $0.01 during the 2006 Period. See Note 6 to the Interim Condensed Consolidated Financial Statements in Item 1., 367185=We are exposed to interest rate fluctuations, primarily as a result of our revolving credit agreement that has a variable rate. However, the interest rates on substantially all of our long-term debt at March 31, 2006 were fixed and, accordingly, a hypothetical 10.0% change in interest rates would not have a material impact on us but increases in interest rates would correspondingly increase interest expense associated with our future borrowings. We do not currently use derivative instruments to alter the interest rate characteristics of any of our debt., 137170=On December 16, 2004, the Financial Accounting Standards Board (the \u0093FASB\u0094) issued Statement of Financial Accounting Standards (\u0093SFAS\u0094) No. 123 (revised 2004), Share-Based Payment, (\u0093SFAS No. 123(R)\u0094), which supersedes SFAS No. 123, Accounting for Stock-Based Compensation, and Accounting Principles Board (\u0093APB\u0094) Opinion No. 25, Accounting for Stock Issued to Employees, and its related interpretations. SFAS No. 123(R) also amends SFAS No. 95, Statement of Cash Flows. Generally, SFAS No. 123(R) is similar to SFAS No. 123; however, SFAS No. 123(R) requires that the fair value of all share-based payments to employees, including awards of employee stock options, be measured on their grant date and either recognized as expense in the income statement over the requisite service period or, if appropriate,, 258890=In late August 2005, Hurricane Katrina struck the gulf coast of Louisiana, Mississippi and Alabama and caused substantial damage to residential and commercial properties in Mississippi, where we own and operate a number of hospitals. The property damage caused by Hurricane Katrina at our hospitals was not substantial and, therefore, did not have a significant effect on our consolidated results of operations. However, we cannot predict the long-term effect that the damage caused by Hurricane Katrina will have on our patients, payors and vendors or the local economies in Mississippi and other impacted areas. Additionally, during the quarter ended September 30, 2004 four hurricanes and one tropical storm made landfall in Florida, where we own and operate a number of hospitals. Hurricane damage and disruption to our hospitals in the affected areas, as well as to employees\u0092 homes, local businesses and physicians\u0092 offices, was extensive. One of our hospitals in South Carolina also suffered hurricane-related damage during such period., 363825=During the three months ended March 31, 2006, there were no material changes to the information provided by us in Item 7 of our Annual Report on Form 10-K for the year ended September 30, 2005., 8910=At May 5, 2006, 240,769,306 shares of the registrant\u0092s Class A common stock were outstanding., 410911=Pursuant to the requirements of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized., 352179=Under the terms of the credit agreement, we are obligated to pay certain commitment fees based upon amounts available to us for borrowing. In addition, the credit agreement contains covenants that, without the prior consent of the lenders, limit certain of our activities, including those relating to mergers, consolidations, our ability to borrow additional amounts, make guarantees and grant security interests. We have complied with our financial covenants, which are calculated at March 31, 2006 as follows:, 395194=Regions in and around the Gulf of Mexico experience hurricanes and other extreme weather conditions. As of May 5, 2006, twenty-nine of our hospitals were located in the Gulf States of Florida and Mississippi. As a result, these facilities are susceptible to physical damage and interruptions to business. Even if our facilities are not directly damaged, we may experience considerable disruptions in our operations due to property damage experienced in the affected area by our patients, physicians, payors, vendors and others., 421627=(32) Section 1350 Certifications, 276475=The following tables summarize our results of operations for the 2006 Period and the 2005 Period (unaudited):, 274001=The 2006 Period reflects the transitional effects of the modified prospective methodology for adopting SFAS No. 123(R); however, in accordance with such accounting pronouncement, the 2005 Period has not been restated. As a result of applying the principles of SFAS No. 123(R) and shifting from stock option awards to deferred stock and restricted stock awards (in some cases with performance and market conditions as a prerequisite to vesting) to provide incentive compensation and retain key individuals, stock-based compensation expense increased from approximately $0.9 million in the 2005 Period to $4.8 million in the 2006 Period. Additionally, at March 31, 2006 there was approximately $42.5 million of unrecognized compensation cost attributable to all of our stock-based plans and such amount is expected to be recognized over the remaining requisite service period for each award, the weighted average of which is approximately 2.7 years., 271600=As a result of the increased prevalence of uninsured and underinsured patients, our provision for doubtful accounts during the 2006 Period grew 120 basis points to 8.1% of total revenue compared to 6.9% of total revenue in the 2005 Period. We believe that our provision for doubtful accounts as a percentage of total revenue is generally lower than our industry peer group average because our historical charity care and indigent policies have resulted in a higher percentage of uninsured, 344437=Cash used in investing activities during the 2006 Period consisted primarily of (i) $38.1 million that was paid for a hospital we acquired with an effective date of February 1, 2006, (ii) $95.2 million for additions to property, plant and equipment, which primarily consisted of renovation and expansion projects at certain of our facilities, new hospital construction and capital expenditures for hospital replacement projects, and (iii) a net increase in restricted funds of $2.7 million. Offsetting these cash outlays were cash receipts of approximately $3.7 million from sales of property, plant and equipment., 145986=Cash receipts from all of our stock-based plans during the three months ended March 31, 2006 and 2005 were approximately $1.7 million and $31.1 million, respectively. The corresponding realized income tax benefits, as well as those benefits pertaining to deferred stock and restricted stock awards for which we receive no cash proceeds upon issuance of the underlying common stock, were approximately $0.2 million and $9.3 million, respectively. In accordance with the provisions of SFAS No. 123(R), approximately $19,000 of the income tax benefit for the three months ended March 31, 2006 was deemed to be an excess tax benefit and was reclassified to a financing activity in the condensed consolidated statement of cash flows. The pro forma amount of operating cash flows during the three months ended March 31, 2005 for such excess tax benefit under an SFAS No. 123(R) model approach was approximately $0.8 million; however, such amount has not been reclassified in the condensed consolidated statement of cash flows., 141652=Prior to October 1, 2005, we elected to utilize the intrinsic value method, as prescribed by APB Opinion No. 25, to account for our stock-based compensation arrangements. Because all employee and director stock options that were granted had an exercise price equal to the market price of the underlying stock on the date of grant, no stock option compensation expense was previously recognized pursuant to the provisions of APB Opinion No. 25., 134756=The accompanying unaudited interim condensed consolidated financial statements have been prepared pursuant to the rules and regulations of the Securities and Exchange Commission. Certain information and disclosures normally included in financial statements prepared in accordance with U.S. generally accepted accounting principles have been condensed or omitted pursuant to such rules. The interim condensed consolidated financial statements should be read in conjunction with the audited consolidated financial statements included in our Annual Report on Form 10-K for the year ended September 30, 2005., 171267=During the three months ended March 31, 2006, we recognized approximately $3.1 million of compensation expense attributable to stock option awards (no such amount was recorded during the three months ended March 31, 2005). Such expense was predicated on the estimated fair value of stock option awards as determined pursuant to either our previous SFAS No. 123 pro forma disclosure computations or, for awards granted after September 30, 2005, a valuation pursuant to a stock option pricing model. At March 31, 2006, there was approximately $19.0 million of unrecognized compensation cost attributable to non-vested employee and director stock option compensation awards. Such cost is expected to be recognized over the remaining requisite service period for each award, the weighted average of which is approximately 2.1 years. The aggregate fair values of stock options that vested during each of the three months ended March 31, 2006 and 2005 were not significant., 356274=6.125% Senior Notes due 2016 (the \u0093Senior Notes\u0094). As more fully discussed at Note 6 to the Interim Condensed Consolidated Financial Statements in Item 1, on April 21, 2006 we completed an underwritten public offering of $400.0 million of our Senior Notes, which are unsecured obligations that rank equally in priority with our credit agreement. The Senior Notes are expressly senior in right of payment to our 1.50% Convertible Senior Subordinated Notes due 2023, Exchange Zero-Coupon Convertible Senior Subordinated Notes due 2022 and Zero-Coupon Convertible Senior Subordinated Notes due 2022. Exclusive of transaction-related expenses, the sale of the Senior Notes resulted in our receipt of net proceeds approximating $396.3 million, which we utilized to repay a portion of the balance outstanding under our credit agreement. The Senior Notes mature on April 15, 2016 and bear interest at a fixed rate of 6.125% per annum, payable semi-annually in arrears on April 15 and October 15, commencing on October 15, 2006., 11354=Consolidated Statements of Income - Three Months Ended March 31, 2006 and 2005, 267166=During the three months ended March 31, 2006, which we refer to as the 2006 Period, we experienced total revenue growth over the three months ended March 31, 2005, which we refer to as the 2005 Period, of approximately 13.7%. However, consolidated net income and net income per diluted share decreased by 12.6% and 9.8%, respectively, during the 2006 Period when compared to the 2005 Period. Enhanced 2006 Period total revenue resulted from the inclusion of revenue from hospitals acquired after December 31, 2004 and favorable case mix trends, as well as an increase in net patient service revenue from improvements in surgical volume and reimbursement rates. Offsetting the gains in total revenue during the 2006 Period, and ultimately causing a year-over-year reduction in net income, were incremental costs pertaining to a new accounting pronouncement for stock-based compensation, higher levels of uncompensated care, an unfavorable net impact from hurricane and storm activity and lower occupancy rates. Also adversely impacting net income during the 2006 Period were increased costs for utilities, professional fees (i.e., predominately non-employed temporary physicians and physician on call charges), physician recruitment and repairs and maintenance., 1971=For the quarterly period ended March 31, 2006, 350642=We currently have a credit agreement with a syndicate of banks that expires on May 14, 2009. The credit agreement allows us to borrow, on a revolving unsecured basis, up to $750.0 million (including standby letters of credit). Effective February 22, 2006, we utilized a provision in the credit agreement that permitted us to increase our overall unsecured borrowing availability from $600.0 million to $750.0 million. Under the credit agreement, we can elect whether the interest rate we pay is based on the prime rate or the LIBOR rate. Our effective interest rate includes a spread above the base rate we select and is subject to modification if our debt rating changes. Such effective interest rate and our credit availability under the credit agreement at March 31, 2006 were 5.22% and $210.0 million, respectively. Subsequent to March 31, 2006, we reduced the amount outstanding under the credit agreement by $300.0 million, thereby increasing our availability to $540.0 million on May 5, 2006. We utilized the net proceeds from our April 2006 underwritten public offering of 6.125% Senior Notes due 2016, which are further discussed below, to reduce the outstanding credit agreement balance; however, we also borrowed additional amounts thereunder to fund our Cleveland Clinic-Naples Hospital acquisition (see Note 4 to the Interim Condensed Consolidated Financial Statements in Item 1)., 133240=Effective March 1, 2006, our Board of Directors approved a change in our fiscal year end from September 30 to December 31. This first Quarterly Report on Form 10-Q for our new fiscal year supplements our Transition Report on Form 10-Q for the three months ended December 31, 2005 that was previously filed with the Securities and Exchange Commission., 236557=Pursuant to a Limited Consent, dated February 22, 2006, we increased the amount available under our credit agreement from $600.0 million to $750.0 million. The credit agreement, as amended by the Limited Consent, allows us to borrow, on a revolving unsecured basis, up to $750.0 million (including standby letters of credit). No other terms, provisions or conditions of the credit agreement were modified by the Limited Consent., 242067=During September 2005, our Board of Directors approved the divestiture of Williamson Memorial Hospital (\u0093Williamson\u0094) in Williamson, West Virginia. We anticipate a disposition of Williamson to occur, via a sale of the hospital, no later than September 30, 2006. Pursuant to the provisions of SFAS No. 144, Accounting for the Impairment or Disposal of Long-Lived Assets, Williamson\u0092s financial position, operating results and cash flows have been presented as discontinued operations in our interim condensed consolidated financial statements. The underlying details of discontinued operations included in the consolidated statements of income were as follows (in thousands):, 237105=On January 30, 2006, the holders of approximately $317.3 million in principal face value Exchange Zero-Coupon Convertible Senior Subordinated Notes due 2022 (the \u0093New 2022 Notes\u0094) exercised their January 28, 2006 put option to require us to repurchase their New 2022 Notes. As a result thereof, we were obligated to repurchase such New 2022 Notes on January 31, 2006 at their accreted amount (i.e., approximately $275.9 million). The holders of approximately $12.7 million in principal face value New 2022 Notes did not require us to repurchase their notes and, accordingly, such notes remain outstanding. The holders of the remaining New 2022 Notes may require us to repurchase such notes for their accreted value on January 28, 2007. In connection with the January 2006 New 2022 Note repurchase, we wrote off approximately $4.6 million of deferred financing costs during the three months ended March 31, 2006., 185190=Balance at January 1, 2006 (non-vested), 233949=On September 30, 2004, the Emerging Issues Task Force affirmed its previous consensus regarding Issue 04-8, The Effect of Contingently Convertible Debt on Diluted Earnings Per Share. Issue 04-8 requires contingently convertible debt instruments, if dilutive, to be included in diluted earnings per share calculations, regardless of whether or not the market price trigger contained in the applicable convertible debt instrument has been met. Issue 04-8 became effective for reporting periods that ended after December 15, 2004. As more fully discussed at Note 3 to the consolidated financial statements included with our Annual Report on Form 10-K for the year ended September 30, 2005, we took certain actions with respect to the 2022 Notes and the 2023 Notes to prevent the common stock underlying such notes from being immediately included in diluted earnings per share calculations., 215521=2005 Acquisitions. Effective February 1, 2005, we acquired three hospitals with a total of 657 licensed beds. The three acquired hospitals were: Venice Hospital, a 312-bed hospital in Venice, Florida; St. Joseph\u0092s Hospital, a 212-bed hospital in Port Charlotte, Florida; and St. Mary\u0092s Hospital, a 133-bed hospital in Norton, Virginia. The aggregate cash paid for this acquisition was approximately $251.4 million for property, plant and equipment and other non-current assets and approximately $36.6 million for working capital. Effective April 1, 2005, we acquired Bartow Memorial Hospital, a 56-bed hospital in Bartow, Florida. The cash paid for this acquisition was approximately $31.9 million for property, plant and equipment and other non-current assets and approximately $0.8 million for working capital. Effective December 1, 2005, we acquired Gilmore Memorial Hospital, a 95-bed general acute care hospital in Amory, Mississippi. The cash paid for this acquisition was approximately $46.6 million for property, plant and equipment and other non-current assets and approximately $7.1 million for working capital., 133983=The interim condensed consolidated financial statements as of March 31, 2006 and December 31, 2005 and for the three months ended March 31, 2006 and 2005 are unaudited; however, such interim financial statements reflect all adjustments (only consisting of those of a normal recurring nature) which are, in our opinion, necessary for a fair presentation of our financial position and results of operations for the interim periods presented. Due to the seasonal nature of our business, among other things, our results of operations for the interim periods presented are not necessarily indicative of the results to be expected for the full year., 132497=Health Management Associates, Inc. (\u0093we,\u0094 \u0093our\u0094 or \u0093us\u0094) and our subsidiaries provide health care services to patients in owned and leased facilities primarily in the southeastern and southwestern United States. At March 31, 2006, we operated 60 hospitals in 16 states, consisting of 58 general acute care hospitals with a total of 8,363 licensed beds and two psychiatric hospitals with a total of 182 licensed beds. At such date, eighteen and ten of our hospitals were located in Florida and Mississippi, respectively. See Notes 4 and 7 for information concerning pending acquisition and disposition activity, respectively., 228850=In November 2002, the FASB issued Interpretation No. 45, Guarantor\u0092s Accounting and Disclosure Requirements for Guarantees, Including Indirect Guarantees of Indebtedness of Others, an Interpretation of FASB Statements No. 5, 57, and 107 and Rescission of FASB Interpretation No. 34 (\u0093FIN 45\u0094). FIN 45 elaborated on the disclosures to be made by a guarantor in its interim and annual financial statements about its obligations under certain guarantees that it has issued. It also clarified that a guarantor is required to recognize, at the inception of a guarantee, a liability for the fair value of the obligation undertaken in issuing such guarantee. On November 10, 2005, FASB Staff Position FIN 45-3, Application of FASB Interpretation No. 45 to Minimum Revenue Guarantees Granted to a Business or Its Owners, (\u0093FIN 45-3\u0094) was issued. FIN 45-3 requires that a guarantor apply the recognition, measurement and disclosure provisions of FIN 45 to guarantees granted to a business or its owners that the revenue of the business (or a specific portion of the business) for a specified period of time would be at least a specified minimum amount (i.e., a minimum revenue guarantee)., 143807=Compensation expense for the stock-based arrangements described below, which is recorded in salaries and benefits in the consolidated statements of income, was approximately $4.8 million and $0.9 million for the three months ended March 31, 2006 and 2005, respectively. We have not capitalized any stock-based compensation amounts. Stock-based compensation expense is recognized on a straight-line basis over the requisite service period, which is generally aligned with the underlying stock-based award\u0092s vesting period. For stock-based arrangements with performance conditions as a prerequisite to vesting, compensation expense is not recognized until it is probable that the corresponding performance condition will be achieved. Stock-based compensation expense during the three months ended March 31, 2006 and 2005 resulted in income tax benefits of approximately $1.8 million and $0.3 million, respectively, that have been recognized in the consolidated statements of income. Accordingly, the after-tax impact of compensation expense from all stock-based plans for the three months ended March 31, 2006 was approximately $3.0 million, or $0.01 for both basic and diluted earnings per share., 11857=Condensed Consolidated Balance Sheets - March 31, 2006 and December 31, 2005, 136362=Total comprehensive income for the three months ended March 31, 2006 was approximately $87.4 million. The sole difference between net income and total comprehensive income relates to the after-tax effects of changes in unrealized gains and losses on available-for-sale securities., 268556=At our hospitals that were in operation during all of the 2006 Period and the 2005 Period, which we refer to as same hospitals, surgeries increased 3.3%; however, we experienced corresponding same hospital admission and emergency room visit declines of 2.1% and 3.5%, respectively. These declines are primarily attributable to milder winter months during the 2006 Period when compared to the 2005 Period and an approximate 17% decrease in upper respiratory cases. We believe that our adherence to the acquisition criteria we have strictly followed for many years, whereby we acquire hospitals in growing non-urban areas and in areas where we believe the opportunity to reverse outmigration to other hospitals exists, will ultimately be successful. Furthermore, our hospitals continue to add physicians to their medical staffs and medical equipment to their hospitals in order to meet the needs of the communities they serve. We believe that, over time, these investments, coupled with improved demographics, will yield increased hospital surgeries, emergency room visits and admissions., 348127=In connection with our change of fiscal year end, we announced a number of financial and quality objectives for the year ending December 31, 2006, including days sales outstanding, or DSO, which is calculated, in part, by dividing quarterly net patient service revenue by the number of days in the quarter. The result is divided into the net accounts receivable balance at the end of the quarter to obtain our DSO. We believe that this statistic is an important measure of collections on accounts receivable. Our DSO at March 31, 2006 was 66 days, which compares favorably to 69 days and 71 days at December 31, 2005 and March 31, 2005, respectively, and is within our published DSO objective range of 62 days to 69 days., 365244=Forward-looking statements are based on our current plans and expectations and involve known and unknown risks, uncertainties and other factors that may cause our actual results, performance, achievements or industry results to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements. Such factors include, among other things, the risks and uncertainties identified by us under the heading \u0093Risk Factors\u0094 in Item 1 of our Annual Report on Form 10-K for the year ended September 30, 2005 and Item 1A of Part II of this Quarterly Report. We operate in a continually changing business environment and new risk factors emerge from time to time. We cannot predict what these new risk factors may be, nor can we assess the impact, if any, of such new risk factors on our business or the extent to which any factor or combination of factors may cause our actual results to differ materially from those expressed or implied by any forward-looking statement., 239609=In connection with our public offering of the Senior Notes, we entered into an indenture on April 21, 2006. The Senior Notes (and such other debt securities that we may issue from time to time under the indenture) are subject to certain covenants, which include, among other things, limitations and restrictions on (i) the incurrence by us and our subsidiaries of debt secured by liens, (ii) the incurrence of debt by our subsidiaries, (iii) sale and lease-back transactions and (iv) certain consolidations, mergers and transfers of assets. Each of the aforementioned limitations and restrictions are subject to certain contractual exceptions. The indenture also contains customary events of default and related cure provisions. The indenture was included as Exhibit 4.1 to our Current Report on Form 8-K dated April 18, 2006., 261368=On August 5, 2004, a lawsuit, Jose Manual Quintana v. Health Management Associates, Inc., was filed in the Circuit Court for the 11th Judicial Circuit in Miami-Dade County, Florida. The lawsuit challenges the amounts charged for medical services by our subsidiary hospitals to uninsured patients. The plaintiff in this lawsuit seeks damages and injunctive relief on behalf of a purported class of uninsured patients treated at any of our subsidiary hospitals. We have challenged the plaintiff\u0092s standing to bring this action. Discovery related to standing and class certification is underway., 332461=Supplies and other costs increased as a percent of total revenue to 31.4% for the 2006 Period from 29.7% for the 2005 Period. In addition to increased costs for utilities, professional fees, physician recruitment and repairs and maintenance in the 2006 Period, the percentage increase was due to higher costs at the three hospitals we acquired after December 31, 2004. Additionally, we continue to experience higher supply costs for certain surgical procedures (e.g., orthopedic implants, drug-eluting stents, etc.)., 270591=Economic conditions and changes in commercial health insurance benefit plans over the past several years have contributed to an increase in the number of uninsured and underinsured patients seeking health care in the United States. This general industry trend has also affected us, with our self-pay hospital admissions as a percentage of total admissions increasing to approximately 6.5% during the 2006 Period, as compared to 6.0% during the 2005 Period. Notwithstanding this unfavorable historical trend, we experienced a 50 basis point same hospital decline in self-pay admissions as a percentage of total admissions when comparing the 2006 Period to the three months ended December 31, 2005. We continually evaluate our policies and programs in light of these trends and other information available to us and consider changes or modifications to our policies as circumstances warrant., 160046=The aggregate intrinsic values of stock options exercised during the three months ended March 31, 2006 and 2005 were $0.6 million and $24.2 million, respectively., 181273=Restricted stock represents shares of common stock that preserve the incidents of ownership for the holder but are subject to restrictions on transfer and risk of forfeiture until fulfillment of specified conditions. Historically, we did not use restricted stock awards as a means of providing incentive compensation and/or retaining key individuals; however, during the three months ended March 31, 2006 we granted 345,000 shares and 24,500 shares of restricted stock to our senior executive officers and outside directors on our Board of Directors, respectively. In addition to requiring continuous service as an employee, the annual vesting of the senior executive officer restricted stock awards requires the satisfaction of certain conditions, which relate to our pre-tax earnings, return on stockholders\u0092 equity, net patient service revenue growth and common stock price. If these conditions are satisfied, the awards will vest 25% at the conclusion of each of our next four years (commencing with December 31, 2006). The outside directors\u0092 awards will vest in equal installments on January 1, 2007, 2008, 2009 and 2010., 345185=During the 2005 Period, cash used in investing activities consisted primarily of (i) $319.9 million paid for the three hospitals we acquired in February 2005 and the individual hospital we acquired with an effective date of April 1, 2005, (ii) $66.9 million for additions to property, plant and equipment, which primarily consisted of renovation and expansion projects at certain of our facilities and capital expenditures associated with two hospital replacement projects, and (iii) a net increase in restricted funds of $7.3 million.}",
    "lastModified": "Sat, 01 Aug 2015 20:21:06 GMT",
    "textBeforeTable": "  Nine directors were elected and, together, they constitute our entire Board of Directors. The number of shares that voted for the election of each director and the number of shares that withheld authority to vote for each such director are as follows: 1.     At our Annual Meeting of Stockholders held on February 21, 2006, our stockholders voted on the matters set forth below. Item 4. Submission of Matters to a Vote of Security Holders As a result of substantial hurricane-related losses incurred by insurance carriers covering the Gulf Coast region in recent years, we cannot procure affordable insurance policies with the same coverage as in prior years. Accordingly, we will be exposed to greater risk for property damage, business interruption and similar losses. Additionally, we will experience substantial premium increases for any insurance policies we elect to obtain and those policies are likely to impose higher deductibles and limit maximum aggregate recoveries for hurricane-related damage or loss. Our primary property and business interruption insurance policies annually renew on June 1 and, therefore, we are currently modifying our risk management program in response to the changes in the insurance market. Any such modifications to our risk management program could harm our",
    "textAfterTable": "  26 Table of Contents   2. Our stockholders voted to approve the Health Management Associates, Inc. 2006 Outside Director Restricted Stock Award Plan (the \u0093Plan\u0094). The number of shares that voted for, against and abstained from voting on the adoption of the Plan, as well as broker non-votes received, are as follows:   Votes For   Votes Against   Abstain   Broker Non-Votes* 161,580,238   4,464,394   1,837,284   36,880,716 * Under the rules governing brokers who",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}