{
    "relation": [
        [
            "Name",
            "Shield Strike He-Man (aka Stealth Armor He-Man)",
            "Sky Strike Stratos",
            "Roboto",
            "Zodak"
        ],
        [
            "Log Line",
            "Most Powerful Man in the Universe",
            "Heroic Winged Warrior",
            "Heroic Mechanical Warrior",
            "Heroic Cosmic Enforcer"
        ],
        [
            "Allegiance",
            "Heroic Warriors",
            "Heroic Warriors",
            "Heroic Warriors",
            "Heroic Warriors"
        ],
        [
            "Type",
            "Action Figure",
            "Action Figure",
            "Action Figure",
            "Action Figure"
        ]
    ],
    "pageTitle": "Masters of the Universe - Wikipedia, the free encyclopedia",
    "title": "Wave 6 / 2003",
    "url": "https://en.wikipedia.org/wiki/Masters_of_the_Universe",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00231-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 880589683,
    "recordOffset": 880513846,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{114957=A comic book series by DC Comics was relaunched 2012. The series is made up of two ongoing series, two standard mini-series, a digital mini-series and several origin one-shots., 267696=Princess of Power (1985-1987): She-Ra (1985 toy version), Catra (1985 toy version), Starburst She-Ra, Scratchin' Sound Catra, Shower Power Catra, 266948=Masters of the Universe Vintage Concept Art (1981-1988): He-Man (Viking helmet), D-Man (concept Skeletor), Sensor (concept Zodac), Multi Face (concept Man-E-Faces), Tree Man (concept Beast Man), Bird Man (concept Stratos), Teela (blonde, concept), Sorceress (cobra armor, concept), Mer-Man (concept), Red Beast, Horde Mummy, Gore-Tusk, Sharella (seen on the box art of Megator), Gray (seen on prototype Eldor cardback), 272654=In 2014, Masters of the Universe Minis were released via the Mattel toy collector website, Matty Collector. The figures were packed in sets of two with a hero versus a villain. Also included was a build and connect Castle Grayskull playset., 42391=All of the original Mattel action figures came with minicomics that told stories involving the characters, with 49 distinct comics being issued from 1981 until 1987. In the earliest series, featuring the original four minicomics made by Mattel (written by Donald F. Glut with artwork by Alfredo Alcala), He-Man is introduced in 'He-man and the Power Sword' as a wandering barbarian, leaving behind his jungle tribe on Eternia; a world dealing with the aftermath of a Great War that has devastated the civilizations that once reigned, but has left behind fantastical machinery and weapons. The events of the Great War opened a rift between dimensions, which allows the evil warlord Skeletor to travel to Eternia, and he has now set his sights on obtaining both halves of the power sword (split in two in these early stories) and gain entry into the ancient Castle Grayskull, the 'fortress of mystery and power' (depicted, in these early comics, as being inhabited by the ghostly 'Spirit of Castle Grayskull'). Whoever attains control of Grayskull will gain the power to become Master of the Universe. To prevent Skeletor from achieving his goal, He-Man has been given special powers, armor and weapons by the Sorceress (referred to as 'The Goddess' in early stories, appearing to have green skin in her debut appearance and Caucasian skin thereafter, she is shown wearing 'snake armor' similar in appearance to Mattel's first Teela action figure; instead of adorning her later more familiar bird-like attire). He-Man (not yet with the dual-identity of Prince Adam), is supported by several heroic allies, such as his loyal pet Battle Cat (without the dual form of Cringer), Man-At-Arms, the Eternian master of weapons (clean-shaven, without moustache), Teela, (often shown with long blonde hair and accompanied by a horse in these early depictions), and Stratos, the winged warrior. Skeletor, in-turn, enlists the help of the brutish Beast Man and aquatic Mer-Man to battle He-Man and his heroic warriors. Vehicles introduced in this early series include the Wind-Raider and Battle Ram.[19], 101596=The New Adventures of He-Man series was also featured in its' own series of 4 minicomics, and in a monthly comic magazine entitled 'He-Man Adventure' (which ran for about 6 issues before returning to adventures on Eternia), and was published by Egmont's London Editions Magazines in the U.K. World I.P. also produced a New Adventures themed annual in 1990. These publications differed somewhat from the animated series; one change being the character Darius, who did not appear in the cartoon series at all, in a major role as leader of the Galactic Council., 98315=In 1990, several years after the financially disastrous ending of the original Masters of the Universe product line, a second He-Man animated series titled The New Adventures of He-Man, was created by Jetlag Productions to promote Mattel's short-lived attempt to revive the MOTU brand with a new toyline, simply titled He-Man. The new series is radically different from the original fantasy-oriented milieu, shifting to an almost purely science fiction setting which sees He-Man transported to the futuristic planet of Primus. As He-Man leads the heroic Galactic Guardians, Skeletor bases himself on the mutant world of Denebria, forming an alliance with Flogg and his band of Evil Mutants, who are hellbent on conquering Primus for themselves. The series contains clear continuity links to the original Masters of the Universe, and was intended as a continuation of the existing mythology, although some fans see it as a separate canon from the original series due to the differences in style and character portrayal., 270489=MOTUC Mini-Comics (2011-2014): Sorceress-Teela, Gladiator, Beast Lord, Fang-Or, Bandwidth, Red Shadow, The Great Black Wizard, Jet Pak (Castle Grayskull spacesuit), Netta, Compactor, Brainwave, Eyebeam, Ra-Jar, Bubblor, Three-Beast, Major Header, Muckman (replaced Gangstor), Lady Slither, Man Crystal, Robo Woman, Hans Hammer Holder, Zombie-Skeletor, Goldenrod, Snarll the Snow Thief, Stretch Neck, Vypor, Spin-Whiz, Tufos, 266844=Masters of the Universe Vintage Toys (1982-1988): Evil Robot (previously unreleased), 38945=Later on that year, first wave of action figures in 1982 would also include Teela (a heroic female warrior, and an essential character through most of the Masters of the Universe franchise, serving as a potential love interest for He-man), Mer-Man (an aquatic henchman of Skeletor, master of the seas, featured in most He-Man incarnations), Stratos (a bird-like winged warrior and one of He-Man's main allies) and Zodac (an ambiguous neutral 'cosmic enforcer' character, who appeared far less in the series than the other characters released at this time). Also alongside the first wave of figures were the Battle Ram and Wind Raider vehicles and the Castle Grayskull playset. Additional waves of action figures, creatures, vehicles and playsets were released every year until 1987; totaling 70 distinct figures in all (including 24 creatures, 12 vehicles, 6 playsets and 10 accessories) with the final two overseas releases from the original line coming from Italy in 1988. Other major characters introduced in these early waves of action figures and minicomics included He-Man's heroic allies Ram Man, Man-E-Faces and Zoar (an alternate falcon form of the magical Sorceress of Castle Grayskull); along with Skeletor's evil warriors Tri-Klops, Trap Jaw and Faker (evil robot clone of He-Man). Many of the original characters, vehicles and playsets, including Castle Grayskull, were designed by Mark Taylor & Ted Mayer.[18] The final production sculpt of the 1982 He-Man action figure was done by Tony Guerrero.[14], 185120=Masters of the Universe Classics (August 2008-December 2009), 48291=He-Man and company would then make appearances in the actual pages of DC Comics, starting with DC Comics Presents issue #47, followed by a special insert comic in many DC's titles from November 1982, finishing up with a three issue mini-series at the start of 1983 (all written by Paul Kupperberg, with artwork by Curt Swan and George Tuska). In the first two tales of these notable DC publications, Superman ends up joining with He-Man on to combat Skeletor and his minions. This series would introduce Prince Adam and his transformation into He-Man into the series (although Adam was originally portrayed as a blue vest-wearing womanizer, rather than his more wholesome later character and would transform inside 'Cave of Power' instead of his famous 'By the Power of Grayskull!' line). Other entries into the series mythos, such as Zodac the neutral cosmic enforcer, Stratos' home world of Avion, and Adam's mother, Queen Marlena, as an astronaut hailing from Earth, were also partly introduced in these early DC issues.[21][22], 91408=In 1987, a live action He-Man film was made by Cannon Films entitled Masters of the Universe. The release date in the USA was August 7, 1987. The film starred Dolph Lundgren in the title role of He-Man, Frank Langella as Skeletor, with Courteney Cox, Robert Duncan McNeill and James Tolkan in supporting roles (as Julie Winston, Kevin Corrigan, and Detective Lubic, respectively). The other characters from the original cartoon to appear in the film are Evil-Lyn (Meg Foster), Man-At-Arms (Jon Cypher), Teela (Chelsea Field), Beast Man (Tony Carroll), and the Sorceress (Christina Pickles). The character Gwildor (Billy Barty) is included, apparently in place of Orko, because the special effects of the time would have been insufficient and too costly to create him. Skeletor's henchmen Blade (Anthony De Longis), Saurod (Pons Maar) and Karg (Robert Towers) were also introduced, in place of other more familiar villains from the series., 18714=In the race to design the next hit action figure, Roger Sweet, a lead designer working for Mattel's Preliminary Design Department throughout much of the 1970s and 1980s, realized simplicity was the key to success.[5][6] According to his book Mastering the Universe: He-Man and the Rise and Fall of a Billion-Dollar Idea published in 2005, Sweet knew that if he gave marketing something they could sell, he'd won 90% of the battle (although this is not officially acknowledged by Mattel and is disputed by some other contributors).[5][7][note 3][8][note 4][9], 115465=Grayskull: Masters of the Universe was an announced science fiction/fantasy film based on the toy line. According to Variety, it is produced by Joel Silver, and written by Justin Marks, and employing visual special effects to a large degree, as was done with the 2007 war film 300.[46] Warners announced that John Stevenson, director of Kung Fu Panda will direct the upcoming feature. On 12 May 2009, it was announced that the scripting duties had been handed to newcomer Evan Daugherty, with John Stevenson still attached to direct.[47] In September 2009, Sony took over the rights from Warner Bros. to produce the Masters of the Universe live action film after Mattel and Silver couldn't agree on creative direction for the film.[48] Sony and Escape Artists' Todd Black, Jason Blumenthal and Steve Tisch will now start developing the project from scratch for Columbia. In April 2010, Sony hired screenwriters Mike Finch and Alex Litvak to draft a new script.[49] Deadline reports that Jon M. Chu is in talks to direct the film.[50] Original He-Man actor Dolph Lundgren did an interview with IGN about possibly appearing in the film as King Randor.[51] On October 12, 2012, Richard Wenk was hired to rewrite the script for the film.[52] On March 28, 2013, Chu said that the film is still early is in the experimentation and also it would not be campy but an origin story.[53][54] On October 7, 2013, The Hollywood Reporter reported that Terry Rossio will write the film & Todd Black, Jason Blumenthal and Steve Tisch are producing the film and it will be set on Eternia, the site also report that Chu will not direct the film.[55], 105124=The line's faithfulness to the original series made it very popular with collectors, however, suggesting it would have been better served as a collector-based line, akin to DC Direct. This theory was borne out in the wake of the discontinuation of the mass-market toyline, with NECA taking the rather unprecedented step of continuing the toyline through action figure sized mini-statues scaled and sculpted to be aesthetically compatible for display alongside the Mattel toys, thus allowing fans to fill out their collections with other Four Horsemen redesigned characters that had yet to be produced as figures when the toyline was canceled. According to a December 8, 2005 interview with a Mattel representative on he-man.org, NECA offered to produce fully articulated action figures for Mattel without taking any credit, but permission was denied. Instead, NECA was only permitted to produce nonarticulated statues.[40], 30375=Various children's books, magazines, comics, read-along records/cassette tapes and other merchandise were also released worldwide around this time, with much of the content based primarily on the Filmation He-Man and She-Ra series. Masters of the Universe, a live action movie was released in 1987 by Cannon Films, starring Dolph Lundgren and Frank Langella. The later action figure minicomics continued the adventures of He-Man and She-Ra past the end of the two Filmation series; but popularity had waned by the end of 1987 and a planned continuation of the original toyline under the heading of 'The Powers of Grayskull' (set in ancient Eternia, featuring the villain King Hiss, and He-Man's ancestor He-Ro) was started, but eventually scrapped., 21152=\"The only way I was going to have a chance to sell this [to Wagner] was to make three 3D models—big ones. I glued a Big Jim figure [from another Mattel toy line] into a battle action pose and I added a lot of clay to his body. I then had plaster casts made. These three prototypes, which I presented in late 1980, brought He-Man into existence.\", 37278=Created by Mattel in 1981, the 'Masters of the Universe' toyline was first released as 5 1/2 inch action figures in 1982 (as opposed to the 3 3/4 inch size used by Kenner Star Wars and Hasbro's G.I. Joe). Brief descriptions of the characters would appear on the toyline's unique packaging and box art (with illustrations by Errol McCarthy, William George and others); however, the lore of Masters of the Universe would really first be explored through minicomics that accompanied the toys through the duration line. The two main characters, He-man (the muscular blonde hero and most powerful man in the universe) and his arch-enemy Skeletor (the blue-skinned, skull-faced master of evil and sorcery) were the first released in action figure form, along with other core characters of the entire series; Man-At-Arms (He-man's friend and scientific master of weapons), Beast Man (Skeletor's master of beasts and main henchman) and Battle Cat (He-Man's large green, Tiger-like companion)., 103096=In 2002, Mattel launched a new Masters of the Universe toyline with sculpts designed by the Four Horsemen (a prior \"commemorative\" re-release of some of the action figures from the 1980s toyline has been released in 2000). The new toyline was made surprisingly faithful to the original line, with the characters gently \"re-imagined\" and updated in terms of sculpting detail rather than radically reinterpreted.[38], 111460=In 2007 a new incarnation of Masters of the Universe was announced. Based on the look of the original 1980s MOTU toys, this new toyline was aimed primarily at the adult toy collector market. The first action figure released at San Diego Comic Con 2008 was King Grayskull, a character that appeared in one episode of the 200X TV series 'He-Man and the Masters of the Universe'. It came housed in unique Castle Grayskull packaging and was only sold in the USA. Sculpted by the Four Horsemen, these toys were updated versions of previous figures as well as characters that never before had a toy. Not only did the toyline feature action figures from the originals line from the 80s, but it also included Princess of Power, and the He-Man line from 1989-1992. Eventually characters that had exclusively appeared in She-Ra: Princess of Power and 'The New Adventures of He-Man' were added. Characters from other media, such as comic books, are also included. In February 2010, the figures of He-Man and Skeletor are available as Toys R Us exclusives packed in two-packs with Superman and Lex Luthor respectively, from Mattel's DC Universe Classics action figure line. Both lines are designed by the Four Horsemen. This dual line expanded to include two-packs featuring Aquaman and Mer-Man, Hawkman and Stratos, Bizarro and Faker, Supergirl and She-Ra, and finally Green Lantern and Zodac., 125031=Each 1982 action figure featured 5 points of articulation (poseable head, arms and legs), removable armor, a weapon accessory and a spring-loaded \"Power punch\" at the waist. All 8 characters featured the twist waist action, but it was Wave 2 that saw the introduction of additional action features unique to the character, such as Tri-Klops' rotating visor and Ram Man's spring-loaded legs. Each figure would also come packaged with a mini-comic. The line debuted in 1982 with just four figures to begin with: He-Man, Man-At-Arms, Skeletor and Beast Man. Later that year the remaining four characters from Wave 1 were released. They were Stratos, Teela, Mer-Man and Zodac. Each figure came with removable armor, a weapon and mini-comic. The Comet Warriors, Stonedar and Rokkon, arrived in the UK a full year before the rest of their wave 5 counterparts. This may have been due to their appearance in the UK Masters of the Universe fortnightly magazine in 1986. Originally Beast Man was going to be He-Man's arch rival, Stratos was an Evil Warrior and Mer-Man and Tri-Klops were both intended to be Heroic Warriors. This changed by the time of their release., 271937=Masters of the Universe (1987 live action movie): He-Man, Man-At-Arms, Teela, Sorceress, Kevin, Julie, Lubic, Skeletor, God-Skeletor, Beast Man, Evil-Lyn, Karg, Pigboy, Comtech, Eternian Soldiers, Robot Centurions, 108419=An ongoing publication that mirrored tales of the 2002 Mike Young Productions show, the comic series elaborated and added to the mythos by introducing characters that never made it in after the 39 episodes of the television series. The first issue of the comic was seen in September 2002 in the form of a white preview, the series would continue on through 2004/5 where it would see a switch to Image and several successful trade paperback volumes., 112855=Masters of the Universe Classics has surpassed the original 1980s toyline in terms of length, running continuously for 7 years. Over 150 different figures have been made available since its launch in August 2008., 86835=Masters of the Universe and Princess of Power featured in many children's books in the 1980s as well. One of the main producers of these titles was Golden Books, which published several series of hard and softcover children's books from 1983 to 1986 (with the earliest four books being more in line with early minicomics rather than the cartoon series). World I.P. also produced annual Masters of the Universe and Princess of Power storybooks from 1984 until the New Adventures line in 1990 (with the 1984 edition written pre-Filmation, notably naming Orko as 'Gorpo' and King Randor as 'King Miro'). Also notable in the 1980s were the various combination book/record/cassette-tape read-along/tell-a-tale adventures produced by Ladybird Books out of the U.K., by Kid Stuff Records out of the U.S., and by Mattel themselves., 34386=From 2007 to the present, a new assortment of Masters of the Universe action figures has been released under the banner of 'Masters of the Universe Classics'. Primarily geared towards the collector's market, the series took into consideration all aspects of previous Masters of the Universe lore, with characters from all previous incarnations (and also featured a continuation of the original minicomics line, produced by Dark Horse Comics). DC Comics would soon follow suit, and relaunch a new grittier, contemporary version of the Masters of the Universe franchise, releasing various new comic book series from 2012 until present; featuring crossovers with the DC Comics Universe, and a new origin for She-Ra, culminating in Hordak's conquest of Eternia. The current ongoing series is entitled 'He-Man: The Eternity War'., 28094=After the original toy releases, DC Comics would adapt the franchise into special insert appearances in their regular comic series and a three issue mini-series in 1982. These issues introduced elements to the series, such as He-Man being the secret alter ego of Prince Adam, son of the royal family of Eternia; as in Adam's father King Randor and mother Queen Marlena. However, the Masters of the Universe franchise would become much better known through Filmation's He-Man and the Masters of the Universe cartoon series; debuting in the fall of 1983, running 130 episodes through two seasons until the end of 1984 (primarily featuring various moral-themed encounters between He-Man, Skeletor and a wide and expanding cast of heroic and villainous characters; with the notable additions of the childlike Orko and the sinister witch-like Evil-Lyn characters). With the release of the \"He-Man and She-Ra: The Secret of the Sword\" movie in spring 1985 (introducing He-man's twin sister She-Ra, and her arch-villain Hordak on the planet Etheria), Filmation produced 93 episodes of the She-Ra: Princess of Power series, which ran until the end of 1986, along with the He-Man & She-Ra: Christmas Special., 88333=Various video game adaptations of the franchise have been released. Masters of the Universe: The Power of He-Man was released by Intellivision for Atari 2600 and Intellivision in 1983. Two games, Masters of the Universe: The Arcade Game and Masters of the Universe: The Super Adventure, were developed by Adventure Soft and released by U.S. Gold for Amstrad CPC, BBC Micro, Commodore 64 and ZX Spectrum in 1987. A video game based on the movie, Masters of the Universe: The Movie, was released by Gremlin Graphics for Amstrad CPC, Commodore 64, MSX and ZX Spectrum in 1987. Various board games were released in the 1980s and FASA produced The Masters of the Universe Role Playing Game in 1985. Throughout the 1980s a wide array of He-Man merchandise was released, including colouring books, activity books, a Panini Sticker book and much more. Also notable was a complete Masters of the Universe audio-only adventure LP record, which was released by Kid Stuff Records in 1983; written and produced by John Braden, complete with a new He-Man theme song and original voice acting., 32956=After some success with a 'Commemorative Series' re-release of the classic action figures in 2000; Mattel relaunched the toyline with all new action figures, playsets and vehicles, sculpted by Four Horsemen Studios in 2002. As part of the relaunch, a modern updated animated series was also created by Mike Young Productions, lasting for 39 episodes; featuring He-Man and his ensemble of heroic warriors, now called the 'Masters of the Universe', battling Skeletor's minions and later King Hiss and his Snake Men. Several volumes of comic books were also produced to go along with the series by Image Comics and MVCreations. Although popular with longtime fans and collectors (with mini-statue figures being released by NECA until 2007), the new series failed to catch on with a larger audience and was cancelled in 2004.[17], 152026=Mattel revamped the Masters of the Universe concept for this 1989 toyline, which had more slender-looking action figures, and a storyline which featured He-Man and Skeletor taking their adventures beyond Eternia, into outer space., 151428=In 1985 Mattel attempted to broaden the success of Masters of the Universe, by releasing a line of toys aimed at girls. Many of the Princess of Power characters would eventually be incorporated into Masters of the Universe Classics., 45501=The second series, consisting of seven minicomics, released in 1982, were produced by DC Comics, written by Gary Cohn and featured artwork by Mark Texeira. This second wave of comics would introduce the Eternian Palace and Royal Court with King Randor and Queen Marlena (yet unnamed, looking decidedly older than in the later series), along with the heroic warriors Ram Man, Man-E-Faces, the mystical bird-creature Zoar (not yet an alternate form of the Sorceress) and the vehicles known as the Attak-Trak and the Talon Fighter of Point Dread. Skeletor was joined by the evil warriors Tri-Klops and Trap Jaw, portrayed as inter-dimensional bounty-hunter types. The primary characters of Prince Adam, Cringer, Orko, and Evil-Lyn did not yet feature in the series, although the storyline of Teela being the daughter of the Sorceress and adopted daughter of Man-At-Arms was first introduced.[20], 66418=The 'Princess of Power' toyline ran from 1985 to 1987, for which Mattel would release 22 action figure/dolls (with 12 creatures, 2 playsets and 16 clothing accessories). Apart from the main Princess of Power line, the preeminent villains of the She-Ra series, Hordak and the Evil Horde (originally created by Filmation in collaboration with Mattel), were released by Mattel under the Masters of the Universe branding. So, Hordak and the other male Evil Horde characters (Mantenna, Leech, Grizzlor and Modulok), although featuring heavily in the She-Ra cartoon series, were also sold as a new group of villains battling He-Man on Eternia, with the mini-comics debuting them as such. The character Catra was the only Evil Horde villain to be released in the first wave of the Princess of Power toyline, with Mattel downplaying her connection to the Horde (she is later joined in the toy-line by fellow Horde-Villainess Entrapta)., 259538=In 2016 Masters of the Universe Classics will be rebranded with new packaging; the same sculpting style will be used, and they will continue to be sold on MattyCollector., 65373=In 1985, Mattel and Filmation decided to diversify the Masters of the Universe line beyond its traditional realm of \"male action\" in the hopes of bringing in a young female audience as well.[23], 74010=The premise of the She-Ra TV series was the reverse of the He-Man cartoon, where the heroes are actually rebels countering an evil establishment (rather than Skeletor trying to conquer Eternia).[28] The Great Rebellion, hidden within the Whispering Woods, is lead by Queen Angela and her daughter Glimmer, with the main cast of the Princess of Power cartoon also featuring Adora/She-Ra's steed Spirit/Swift Wind, the main male heroic character of the series, Bow, the timid owl-like Kowl, the inept magician Madame Razz and her wise-cracking sidekick, Broom. Also appearing in many episodes are the small imp-like forest-dwelling Twiggits (mainly Sprockett, Spritina, and Spragg) and the mystical character Light Hope, who served as a 'Sorceress of Grayskull-type' guide to She-Ra, residing high atop Mount Skydancer in the Crystal Castle. Throughout the series recurring characters and members/allies of the Rebellion included Adora's swashbuckling love interest Sea-Hawk, the flirtatious Frosta, magical Castaspella, butterfly-like Flutterina, the mermaid Mermista, peacock-like Peakablue, Perfuma, Netossa, Sweet Bee, Sorrowful the dragon, the elephant warrior Snout Spout, and the comet warriors Granita, Rokkon and Stonedar. Some of the other popular one-off heroes and villains were Spinnerella, Huntara, General Sunder, False-Face, Colonel Blast, the Red Knight, King Micah, the Meteorbs and the Star Sisters. She-Ra: Princess of Power would air its' final episode 'Swifty's Baby' on December 5, 1986; with no real conclusion or finale for neither the She-Ra nor He-Man Filmation series., 95810=Although Mattel had hoped that the movie would boost sales of the toyline, it instead had no effect on the line's falling sales, and the MOTU toy line was finally discontinued in early 1988 under immense financial difficulties. A sequel to the film was written, but by 1989, Cannon Films was in such severe financial troubles that it could no longer afford to pay the license fees to Mattel. Thus the script was transformed into the action film Cyborg, starring Jean-Claude Van Damme.[33][34], 68220=In conjunction with the new action figure line, Filmation created a new animated series titled She-Ra: Princess of Power, with She-Ra as its feminine warrior-woman heroine. Filmation had the task of revealing that Prince Adam had a twin sister, Princess Adora, who was first introduced in the animated feature The Secret of the Sword in the spring of 1985. This film was a compilation of what would become the first five episodes of the cartoon series, first airing 'The Sword of She-Ra Part 1: Into Etheria' on September 9, 1985. The series would run for 2 seasons, and 93 episodes from 1985 to 1986. She-Ra: Princess of Power was produced in lieu of continuing He-Man and the Masters of the Universe for a third year; however, He-Man often appeared in special crossover episodes of She-Ra to aid his sister, and many other characters from He-Man and the Masters of the Universe, both heroic and evil, also appeared in multiple crossover episodes. She-Ra would also feature in 13 of her own minicomics (packaged with the figures), along with several children's books, comic magazines, and read-along record/cassette-tape books., 273682=Masters of the Universe Giants In the fall of 2014, a brand new 12\" Masters of the Universe toyline was released. This time the figures were 12\" versions of the original 1980s toys., 50967=The animated series He-Man and the Masters of the Universe was created by Filmation and made its television debut on September 5, 1983 with the episode 'The Diamond Ray of Disappearance', through 2 seasons, totaling 130 episodes until 'The Cold Zone', airing on November 21st, 1985.[23] The series was produced by Lou Scheimer (who also provided the voice for Orko, King Randor, Stratos, Trap Jaw, Tri-Klops and many others), Gwen Wetzler and Hal Sutherland; and featured the voice talents of John Erwin (He-Man/Adam, Beast Man, Ram Man, Whiplash and others), Alan Oppenheimer (Skeletor, Man-At-Arms, Battle Cat/Cringer, Mer-Man and others) and Linda Gary (Teela, The Sorceress, Evil-Lyn, Queen Marlena and others)., 274772=In 2003, Tops Toys, an Argentinian toy company, used the molds from the vintage Masters of the Universe figures and released eight characters in Argentina., 31660=He-Man would be brought back in 1989, in an entirely new, and space-based cartoon series and toy line known as the 'New Adventures of He-Man'. Under the name 'He-Man', Mattel released an entirely new line of action figures, featuring only He-Man and Skeletor as the main returning characters to join the battle between Galactic Guardians and Space Mutants on the planet Primus. Jetlag Productions would go to produce 65 episodes of the New Adventures cartoon, while minicomics and a few adventure magazines were also created for this new series. Ultimately though, the series would not be as successful and the entire franchise would go on a hiatus for more than a decade (although a series about the son of He-Man was pitched in 1996 by Lou Scheimer, but rejected).[16], 176771=Four Horsemen Studios continued the 200X toyline in the form of non-articulated 6\" scale resin statues, which were designed to fit in with the 2002-2004 action figures. They were released by NECA, under licence from Mattel., 25971=From these early concepts, Mattel would finally produce the original 'Masters of the Universe' action figure toyline in 1981. Released as 5 1/2 inch action figures, the lore of Masters of the Universe would first be explored through minicomics that accompanied the toys through the duration line. The two primary characters, 'the most powerful man in the universe', He-man and his nemesis, the evil skull-faced sorcerer Skeletor, were the first released in action figure form, along with other core characters of the entire series; He-Man's allies, Man-At-Arms, Teela, Battle Cat, and Stratos, and Skeletor's henchmen Beast Man and Mer-Man. He-Man was given his power by the Goddess/Sorceress of Castle Grayskull and would defend his planet Eternia from the evil forces of Skeletor (originally described as an evil warlord/demon from another dimension). Set in a hybrid world of sword and sorcery and technological sci-fi, they would battle over the possession of the 'Power Sword', as He-Man tried to stop Skeletor from his ambition to rule Eternia and discover the Secrets of Castle Grayskull., 78396=Series three of Mattel's minicomics would follow a more similar canon to that of the Filmation animated series, sometimes taking stories straight from episodes of the show in 1983. Series four in 1984, would also follow Filmation's continuity, but focus more on new stories featuring the introduction of Princess of Power villain Hordak and the Evil Horde (focusing more on Hordak's attempts to attack He-Man and invade Eternia, rather than anything She-Ra/Princess of Power related). Series five and the final series, six, in 1986 and 1987, would continue on the adventures past the animated series and its' sequel in the She-Ra line, introducing new characters not seen in the cartoon series such as Stinkor, Rio Blast, Clamp Champ, Dragstor, Extendar, Blast-Attak, Ninjor, Scare-Glow, Snake-Face, Sssqueeze, Mosquitor and the Energy Zoids (along with live action movie characters Blade, Saurod and Gwildor). More importantly, the main storyline included the new major villains known the Snake Men. Kobra Khan, Tung-Lashor and Rattlor (previously appearing in the He-Man and She-Ra cartoon series with Skeletor, and/or as members of the Horde), were now under the leadership of the ancient Eternian King Hiss, whose snake men army rose from Eternia's past, joining forces with Skeletor to once again rule Eternia. Other notable storylines included the introduction three-towered fortress of Eternia, and the suggested origin of Skeletor as Keldor; all leading towards what would have been a continuation of the series in the 'Powers of Grayskull' line, before being discontinued. Issues from series 3 through 6 were often edited by Lee Nordling, included writing by Steven Grant, Michael Halperin, Tim Kilpin, Phil White, and Christy Marx; and often featured the artwork of Bruce Timm, Jim Mitchell, Chris Carlson, Alfredo Alcala or Larry Houston., 17360=In 1976, Mattel's CEO Ray Wagner declined a request to produce a toyline of action figures based on the characters from the George Lucas film Star Wars.[5][6][note 1] Upon the commercial success of the film trilogy during the next few years and all related merchandise, Mattel attempted to launch several unsuccessful toylines, none of which captured the public's imagination or made a significant dent in the toy market.[5][note 2], 271040=He-Ro - Son of He-Man (unreleased 1996 Lou Scheimer Productions series): Queen Teela, Old Man-At-Arms, Skeletor, Evil-Lyn, Prince Dare (blonde), He-Ro II (blonde), Kay-La, Air-Bag, Man-E-Faces II, Ram Man II, Fork-Lift, Craven/Battle-Bird, Missile-Toe, Ever-Mean, Bug-Eye, Slob-Boar, Saw-Tooth, Tung Lashor, Odar, 270178=Mike Young Productions MOTU Cartoons (2002-2003): Captain Miro, Captain Randor, King Randor (snake armor), Queen Marlena (white dress), Queen Marlena (snake armor), Queen Andreeno, Evil Giants (Azdar, Belzar, Chazdar), 85024=Generally going along with the established Filmation continuity, Marvel Comics would also release a younger-skewing Star Comics Masters of the Universe series that ran from 1986 to 1988 bi-monthly and produced 13 issues. Comics strips could also be found at this time in newspaper syndication, and various He-Man adventure magazine issues containing Masters of the Universe related comics were released in the United States, United Kingdom, Germany, Argentina, Brazil, Spain, Italy and others.[32] Some of the magazines included the 'He-Man and the Masters of the Universe Magazine', which was a fan club magazine featuring puzzles, fan letters, feature stories/comic strips and very well rendered covers and posters by artist Earl Norem (running 16 issues, 1985-1988; She-Ra also with a similar magazine, running 6 issues). Egmont's London Editions in the United Kingdom, published 72 issues biweekly of their 'By The Power of Grayskull... Masters of the Universe' comic magazine from 1986 to 1988 (also publishing 14 issues of 'For the Honor of Grayskull She-Ra' and 3 specials). The series is often noted for expanding the origins of many characters, and introducing the character 'Scrollos'. Egmont also ran a monthly comic magazine entitled 'Masters of the Universe Adventure', which ran for 18 issues before turning into a 'New Adventures' themed magazine 'He-Man Adventure' for 10 more issues., 270932=He-Ro - Son of He-Man (unreleased 1988 Mattel series): Prince Dare (brunette), Skeleteen, 268288=He-Man Concept Art (1989-1992): Detector (concept Vizar), Crystoll (concept Karatti), Optikk (black armor), 119520=On February 26, 2014, it was reported that directors Jeff Wadlow, Mike Cahill, Harald Zwart, and Chris McKay are on the short list to direct the film.[56][57] On April 9, 2014, Schmoes Know reported that Wadlow will direct the film, but The Hollywood Reporter announced that he was rewriting the script.[58][59] Columbia Pictures Senior Vice President, DeVon Franklin has tweeted that the film's script has been completed by Jeff Wadlow.[60][61] Franklin later tweeted a photo on his Twitter page of Battle Cat.[62], 63631=The series, although still popular, would not be renewed for a third season. Instead Filmation opted to create the She-Ra: Princess of Power Series, and deliberately crossover the existing He-Man and the Masters of the Universe characters and continuity into the new series. The original He-Man series would end and She-Ra begin with animated movie The Secret of the Sword, released theatrically in the spring of 1985, featuring most of the main characters from both cartoons. The two animated series, would however, join up one last time for He-Man & She-Ra: A Christmas Special in December of 1985; in which two children from Earth end up accidentally on Eternia and are protected by Skeletor, who in a rare act of kindness, is overtaken by the Christmas Spirit. The very last appearance of Filmation's He-Man and Skeletor was in one of the final She-Ra episodes, entitled 'Assault on the Hive', airing December 13th, 1986., 22878=In 1980, the rights-holders of Conan the Barbarian began negotiating the character's toy rights with Mattel. They entered in an agreement the following year regarding characters from the Conan movie. Upon Mattel introducing a toy line starring He-Man, the rights-holders sued the toy company claiming the character was a copy of Conan. Mattel eventually won the lawsuit.[13] Taking in consideration that the Conan character was created almost 50 years prior to the development of the He-Man franchise, it is likely that the Masters of the Universe borrowed many aspects from Conan, but it appears that it was not intended to be a toyline for the film after legal agreements were dissolved.[13] Additionally, Roger Sweet has claimed also to have been \"real impressed\" by the paintings of fantasy artist Frank Frazetta when creating He-Man.[6] and the barbarian sculpt was based on an illustration by Mark Taylor.[14] The decision to change He-Man's hair to blonde was made by Mattel's Tom Kalinske. To further expand on this initial barbarian theme, Mattel hired comic book writers such as Donald F. Glut and artists like Earl Norem (who painted covers for the Marvel Comics Savage Sword of Conan since issue #16 in 1976[15]) to create additional characters and their backstory, posters, package inlays, box art and mini-comics to be distributed with the action figures., 109208=A game based on the 2002 series, He-Man: Power of Grayskull, was developed by Taniko and published by TDK Mediactive in October 2002. A follow up developed by Savage Entertainment and published by Midas Interactive Entertainment, He-Man: Defender of Grayskull, was released for PlayStation 2 in February 2005. An iOS game, He-Man: The Most Powerful Game in the Universe, was developed by GlitchSoft and published by Chillingo and Mattel in late 2012.[43][44]}",
    "lastModified": "Tue, 28 Jul 2015 14:17:33 GMT",
    "textBeforeTable": "Masters of the Universe Vintage Toys (1982-1988)[edit] Each 1982 action figure featured 5 points of articulation (poseable head, arms and legs), removable armor, a weapon accessory and a spring-loaded \"Power punch\" at the waist. All 8 characters featured the twist waist action, but it was Wave 2 that saw the introduction of additional action features unique to the character, such as Tri-Klops' rotating visor and Ram Man's spring-loaded legs. Each figure would also come packaged with a mini-comic. The line debuted in 1982 with just four figures to begin with: He-Man, Man-At-Arms, Skeletor and Beast Man. Later that year the remaining four characters from Wave 1 were released. They were Stratos, Teela, Mer-Man and Zodac. Each figure came with removable armor, a weapon and mini-comic. The Comet Warriors, Stonedar and Rokkon, arrived in the UK a full year before the rest of their wave 5 counterparts. This may have been due to their appearance in the UK Masters of the Universe fortnightly magazine in 1986. Originally Beast Man was going to be He-Man's arch rival, Stratos was an Evil Warrior and Mer-Man and Tri-Klops were both intended to be Heroic Warriors. This changed by the time",
    "textAfterTable": "Skeletor Lord of Destruction! Evil Warriors Action Figure Beast Man Savage Henchman! Evil Warriors Action Figure Mer-Man Ocean Warlord! Evil Warriors Action Figure Zodac Cosmic Enforcer! Neutral Action Figure Battle Cat Fighting Tiger Heroic Warriors Creature Battle Ram Mobile Launcher Heroic Warriors Vehicle Wind Raider Assault Lander Heroic Warriors Vehicle Castle Grayskull Fortress of Mystery and Power for He-Man and his Foes Heroic Warriors Playset Wave 2 / 1983 Name Log Line Allegiance Type Man-E-Faces Human...Robot...Monster! Heroic Warriors Action Figure Ram Man Human Battering Ram! Heroic Warriors Action Figure Faker Evil Robot of SKELETOR Evil Warriors Action Figure Trap Jaw Evil & Armed for Combat Evil Warriors Action Figure Tri-Klops Evil & Sees Everything Evil Warriors Action Figure Zoar Fighting Falcon Heroic Warriors Creature Screeech Barbarian Bird Evil Warriors Creature Attak Trak Battle Machine Heroic Warriors Vehicle Point Dread & Talon Fighter Frontier Outpost Heroic Warriors Playset/Vehicle Weapons Pak Arms & Armor N/A Accessories Wave 3 / 1984 Name Log Line Allegiance Type Mekaneck Heroic Human Periscope Heroic Warriors Action Figure Evil-Lyn Evil Warrior Goddess Evil Warriors Action Figure Battle Armor He-Man Most Powerful Man in the Universe Heroic Warriors Action Figure",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}