{
    "relation": [
        [
            "Property Type",
            "Apartments",
            "Apartments"
        ],
        [
            "Bedrooms",
            "2bhk",
            "3bhk"
        ],
        [
            "Area",
            "1496 sq.ft",
            "1579-1944 sq.ft"
        ],
        [
            "Price",
            "53.85L",
            "56.84L - 69.98L"
        ]
    ],
    "pageTitle": "Dehradun Apartments | Residential Projects in Dehradun | Flats in Dehradun",
    "title": "",
    "url": "https://www.commonfloor.com/dehradun-apartments/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00227-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904235571,
    "recordOffset": 904161866,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{193935=Aiming High Infrastructure Pvt. Ltd. was incorporated in 2009. The promoters are thorough – bred to the business and have successfully delivered number of projects on time. The founders have involved with the real estate industry at various level, for over a decade. We specialize in the development of attractive new properties of an exclusive quantity and indescribable quality.  Apartment with all modern facilities set in a mature landscape environment within easy walking distance of all necessary amenities, located strategically in the town and yet far from the hustle and bustle of the urban., 190674=Project is Ready to Occupy and was delivered around Jan 2012, 22199=Expected completion is around Jun 2018, 138420=The Company was incorporated on 28th day of May 2007 under the provision of company Act, 1956 with the object of carrying on the business of real estate developer’s act and having its registered office at New Delhi. The company was promoted by the group of person having well versed in the field of real estate and having the vast experience of the real estate business and its most important resource i.e. Human Resource comprises of highly qualified, young, dynamic, creative professionals with extraordinary business acumen and insatiable thirst to work with passion., 74958=Project is Ready to Occupy and was delivered around Mar 2013, 4042=Established in 1986 by Mr. Gurinder Sikka who now presides over its many operations as the Chairman & Managing Director, the Sikka Group has swiftly evolved into a vast and multi-faceted conglomerate with business interests in a wide range of fields including real estate, automobile, hospitality and oil business. The Group has steadfastly worked over the decades to deliver on the promises it makes to the customers and has as a result grown to be one of the most trustworthy names in the industry with a long list of immensely successful projects, 133978=The company is constructing another project named as “Rock Valley Residency” at 243, Niranjanpur, ITBP Road, GMS Road, Dehradun, Uttarakhand. The construction on ROCK VALLEY RESIDENCY is in full swing. This project is comprises of Three BHK units. The project will be completed by December 2012., 60256=Bharath Hi-Tech Builders was founded in 1984 by Shri. Chetan P Tayal, Chairman & Managing Director. Having our corporate office in Bangalore with roots spreaded over in Mysore, Delhi, Deharadhun and Shimla, likely to extend to other cities all over India. BBL is built on a wealth of experience, earning an excellent reputation for elegantly designed and crafted developments of high quality homes. The Company has vast experience and contacts in acquiring lands all over India directly from the farmers. The company is into the business of construction of residential and commercial complexes, Residential villas, Row Houses, Integrated Townships, Fully serviced apartments and other infrastructure requirements}",
    "textBeforeTable": "Unit Types Sikka Kimaya Greens Located on the Sahastradhara Road, \"IT PARK\" Sidcul  this Residential complex is part of the largest privately/ Govt -owned development in the city that promises to offer retail, entertainment, leisure, best-in-class office space \"Various MNC BPO\" in same compound and high-end residences \"The Kimaya Greens\". Sikka Kimaya Greens offers stylish, spacious and luxurious homes located at Sahastradhara Road, IT Park Sidcul. Sikka Kimaya Greens Residential complex is part of the largest privately/Govt -owned development in the city that promises to offer retail, entertainment, leisure, best-in-class office space \"Various MNC BPO\" in same compound and high-end residences Sikka Kimaya Greens. Its proximity to the prime locations of Dehradun makes it a perfect place for those looking for a home that's secluded and yet, has everything within an arm's reach. Working with best-in-class consultants, internationally acclaimed architects, light and design experts, sound and acoustic specialists and experienced facility management teams, Sikka have earned a name for building Super Luxury quality, themed environments and destinations. These aesthetically designed premium apartments are a fine balance of the optimum use of space and architectural flair. Sikka Kimaya Greens land allotted by state infrastructure and industrial development corporation of Uttrakhand Ltd. and Designed by Renowned Archtect form Singapore 'Broadway Malyan'. Broadway Malyan has been ranked as one of the top architectural practices in the world. Sikka Kimaya Greens will surely be a",
    "textAfterTable": "Apartments 3bhk 2125-2645 sq.ft 85L - 1.05Cr Approvals Project Approving Authorities Project is known to be approved by MDDA Home Loans providers include All Leading Bank Map Amenities Garden Swimming Pool 24Hr Backup Security Intercom Club House Tennis Court Basket Ball Court Other About Builder Established in 1986 by Mr. Gurinder Sikka who now presides over its many operations as the Chairman & Managing Director, the Sikka Group has swiftly evolved into a vast and multi-faceted conglomerate with business interests in a wide range of fields including real estate, automobile, hospitality and oil business. The Group has steadfastly worked over the decades to deliver on the promises it makes to the customers and has as a result grown to be one of the most trustworthy names in the industry with a long list of immensely successful projects",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}