{
    "relation": [
        [
            "Patent application number",
            "20080264284",
            "20120186471"
        ],
        [
            "Description",
            "MAGNETIC CHASE AND GRAPHIC ARTS DIE ASSEMBLY WITH SELECTIVELY ACTUATABLE MEANS FOR RAISING AND SUPPORTING THE DIE PLATE DURING ALIGNMENT - A graphic arts die assembly and chase for use in a graphic arts press are disclosed for use in conjunction with a press. The die assembly includes a die plate formed at least partially of ferromagnetic material and a chase with a plurality of magnet assemblies configured to provide a magnetic coupling force to selectively secure the die plate to the chase. The chase includes an actuatable releasing assembly to exert a disengagement force to separate the magnetic securement between the plates.",
            "MAGNETIC CHASE AND GRAPHIC ARTS DIE ASSEMBLY WITH A SELECTIVELY ACTUATABLE MEANS FOR RAISING AND SUPPORTING THE DIE PLATE DURING ALIGNMENT - A graphic arts die assembly and chase for use in a graphic arts press are disclosed for use in conjunction with a press. The die assembly includes a die plate formed at least partially of ferromagnetic material and a chase with a plurality of magnet assemblies configured to provide a magnetic coupling force to selectively secure the die plate to the chase. The chase includes an actuatable releasing assembly to exert a disengagement force to separate the magnetic securement between the plates."
        ],
        [
            "Published",
            "10-30-2008",
            "07-26-2012"
        ]
    ],
    "pageTitle": "Hutchison, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hutchison-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00181-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 447118683,
    "recordOffset": 447089064,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Larry Hutchison, Overland Park, KS US 09-08-2011 Drink-tray holder keeps a drink-tray level and secure on the passenger seat of your car - When you set a drink-tray on your seat you are running the risk of one of the lids popping off and your drink spilling onto your seat. Also, most seats are slanted, not level, which allows some of the drinks to leak out of the lid onto your seat and seatback. The drink-tray holder provides a sturdy base for the drink-tray to set upon in your vehicle's seat. It also has several reservoirs to catch any spills that may occur. 20110215121 Published Description Patent application number Kevin Michael Hutchison, Liberty, MO US 06-14-2012 Epigentic Markers Associated with Substance Use Disorders - DNA methylations markers are associated with brain and behavioral mechanisms that underlie substance abuse disorders. These methylation markers present novel measures for predicting and/or identifying effective treatment options, risk of cancer development, risk of developing substance abuse disorders, and substance-abuse related behaviors such as binge drinking. These markers may further be useful in developing novel pharmaceuticals and treatment methodologies and provide mechanisms for following the course of an individual's treatment, risks, or behaviors over time. 20120149589 Published Description Patent application number Kent Hutchison, Boulder, CO US 12-31-2009 Apparatus and method for convenient and secure access to websites - A website",
    "textAfterTable": "Patent applications by Larry Hutchison, Overland Park, KS US Larry R. Hutchison, Overland Park, KS US Patent application number Description Published 20090078133 THIN-WALLED HOT FOIL STAMPING CYLINDER AND METHOD OF FABRICATION - A thin-walled hot foil stamping cylinder of predetermined diameter is formed from an extruded cylindrical tube having a wall of initially uniform cross-sectional thickness. Portions of the outer cylindrical surface of the wall are relieved to define raised, outwardly-projecting hot foil stamping indicia. End caps close opposed ends of the cylindrical tube. One of the end caps is provided with a passage therethrough for introduction of hot oil into the cylindrical interior space of the tube. A passage in at least one of the end caps that communicates with the interior of the tube permits selective draining of oil from the tube. The overall outer surface of the tube may be machined to reduce the tube to a predetermined diameter, prior to relieving the surface thereof to form the indicia. In this manner, a single extruded tube may be used to produce hot foil stamping cylinders of individual diameters corresponding to standard image repeats. 03-26-2009 Lonny Hutchison, Bonnie Lake, WA US",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}