{
    "relation": [
        [
            "First Name",
            "Marc",
            "Edwin S."
        ],
        [
            "Last Name",
            "Granowitter",
            "Jayne"
        ],
        [
            "Suffix",
            "",
            "Jr."
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=4282DC98-8B50-47FF-A548-85B9A8BD0E69&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 222312783,
    "recordOffset": 222304035,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{79542=HRes 1092 - Colombia Free Trade Agreement, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 50924=HR 4088, HR 19, HR 5515 - Employment Verification H-2B Visas, labor certification process for H-2B workers (RIN 1205-AB54) REAL-ID Act HR 5924 - Emergency Nursing Supply Relief Act, 56438=HR 3753, S 1638 - Federal Judiciary Salary Restoration Act HR 1512 - State Criminal Alien Assistance Program (SCAAP) Reimbursement Protection Act, 16792=HR 3043, S 1710, S 3230 - Labor-Health & Human Services FY 2009 Appropriations - funding for pandemic preparedness/research for personal protective equipment; increased funding in all three departments, Federal Workforce program appropriations Agriculture Appropriations Financial Services & General Government Appropriations - IRS budget; IRS' spending on private collection agencies HR 5613 -Medicaid funding HR 5268 - State and Local Economic Stimulus Act - funds to states/localities: flexible grants, Medicaid, unemployment benefits S 2819 - Economic Recovery in Health Care Act to provide for a temporary increase in the Federal medical assistance percentage under the Medicaid Program, all provisions Transportation-Housing and Urban Developement-Related Agencies Appropriations - CDBG formula grants; Public Housing Operating Fund; Public Housing Capital Fund S 3182 - Commerce-Justice-Science-Related Agencies Appropriations - BYRNE-JAG formula funding; COPS; Juvenile Justice; State Criminal Alien Assistance Program (SCAAP); Bureau of Justice Statistics; Coastal and Estuarine Land Conservation Program State-Foreign Operations-Related Agencies Appropriations - East West Center HConRes 312 - FY 09 Budget Resolution - funding provisions for domestic discretionary funding HR 2642 - Supplemental 2008 Appropriations Act - Byrne-JAG funding S 3181 - FY 09 Homeland Security Appropriations, 70946=HR 726 - Windfall Elimination Provision Relief Act of 2007 HR 2988, S 1254 - Government Pension Offset Reform Act S 206, HR 82 - Social Security Fairness Act of 2007, 24423=HR 2831 - Ledbetter Fair Pay Act HR 3195 - Americans with Disabilities Restoration Act, 36055=HR 1386, S 803 - The Child Support Protection Act of 2007 - all provisions which would restore federal funding for states' child support enforcement programs HR 3870, S 2187 - Quality Child Care for America Act HR 3289 - Providing Resources Early for Kids (Pre-K) Act of 2007 HR 5781 - Federal Employees Paid Parental Leave Act of 2008 HR 5873, S 1681 - Family Leave Insurance Act of 2008 HR 1542, S 910 - Healthy Families Act, 63744=HR 5613 - Protecting the Medicaid Safety Net Act of 2008 S 2819 - Economic Recovery in Health Care Act of 2008 HR 5268 - State Fiscal Relief, increase in FMAP HR 6331, S 3101 - Improving Medicare; improving stewardship of public funds over Medicare Advantage plans Kohl/Domenici Amendment to S 3101, Background checks on long term care workers HR 2642 - Emergency Supplemental Bill; moratorium on Medicaid regulations; Fiscal Relief S 1070, HR 1783 - Elder Justice Act HR 3078, S 1577 - Patient Safety and Abuse Prevention Act of 2007 HR 2123 - Nurse Staffing Standards for Patient Safety and Quality Care Act of 2007, 42420=HR 5924 - Emergency Nursing Supply Relief Act S 3230 - Labor-HHS Appropriations- funding for pandemic preparedness/research for personal protective equipment Involving workers in pandemic preparedness planning S 1758, HR 3001 - Community Living Assistance Services and Supports Act Health Care Reform HR 3963 - State Children's Health Insurance Program HR 3543 - James Zagroda 9/11 Health and Compensation Act, long term monitoring, treatment and compensation for workers made ill by work at Ground Zero in NYC HR 5613, HR 2642 - Medicaid Regulations Moratorium and Supplemental Appropriations HR 5268, S 2819 - Medicaid fiscal stimulus, 12300=HR 2419, HR 2844 - Farm, Nutrition and Bioenergy Act -nutrition title Agriculture Appropriations - all provisions, 33221=HR 3021 - 21st Century High-Performing Public School Facilities Act HR 4137 - College Opportunity & Affordability Act of 2007 HR 5715 - Ensuring Continued Access to Student Loans Act of 2008, 76171=HR 3896 - National Infrastructure Development Act S 1926, HR 3401 - National Infrastructure Bank Act HR 2881 - FAA Reauthorization HR 6327 - FAA Extension, 59213=HR 493 - Genetic Information Nondiscrimination Act of 2007 S 1070, HR 1783 - Elder Justice Act HR 3078, S 1577 - Patient Safety and Abuse Prevention Act of 2007 HR 5924 - Emergency Nursing Supply Relief Act S 3230 - Labor-HHS Appropriations, funding for pandemic preparedness/research for personal protective equipment Involving workers in pandemic preparedness planning HR 2123 - Nurse Staffing Standards for Patient Safety and Quality Care Act of 2007 Latino workers labor rights National Labor Relations Board nominations HR 3799, HR 5781, S 3140 - Federal Employees Paid Parental Leave S 2123 - Public Safety Employer-Employee Cooperation Act, 81624=HR 3920, S 1848 - Trade Globalization Assistance Act of 2007 HR 2233, S 1871 - Unemployment Insurance Modernization Act HR 5268, S 2819 - Economic Stimulus Bill, unemployment insurance benefits, 54329=HR 493 - Genetic Information Nondiscrimination Act of 2007}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20036 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  CHARLES M. LOVELESS  2024291194  dgouin@afscme.org 5. Senate ID#  2321-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}