{
    "relation": [
        [
            "Patent application number",
            "20080303978",
            "20090027584",
            "20100073596",
            "20110187961"
        ],
        [
            "Description",
            "BACKLIGHT ASSEMBLY, LIQUID CRYSTAL DISPLAY APPARATUS HAVING THE SAME AND METHOD OF MANUFACTURING LAMP-FIXING MEMBER - A backlight assembly includes a receiving container, lamps, a diffusion plate and a lamp-fixing member. The receiving container includes a bottom plate and sidewalls together providing a receiving space. The lamps are arranged substantially parallel to each other on the bottom plate. The diffusion plate is disposed over the lamps. The lamp-fixing member includes a body portion extending substantially perpendicular to the lamps, a buffer protruding upwardly from the body portion, a diffusion plate supporting portion protruding from the buffer to support the diffusion plate and a lamp-fixing portion formed at the body portion to fix the lamps. Therefore, the buffer having elasticity is formed at an area at which the diffusion plate supporting portion is formed, so that rubbing between the diffusion plate and the diffusion plate supporting portion may be reduced.",
            "LIQUID CRYSTAL DISPLAY WITH A BACKLIGHT ASSEMBLY HAVING AN IMPROVED STRUCTURE - A liquid crystal display with improved backlight structure is presented. The liquid crystal display includes a liquid crystal (LC) panel for displaying image, a backlight assembly for providing light to the LC panel and a top frame combined with the bottom frame to complete LCD assembling. The backlight assembly includes a bottom frame, light source, and optical member. The bottom frame includes a light source receiving part, a side wall and a optical member receiving part which extends inwardly to the inner side of the backlight assembly. Thus, the overall size of the LCD can be reduced.",
            "BACKLIGHT ASSEMBLY HAVING AN ELASTIC SUPPORTING MEMBER FOR SUPPORTING OPTICAL MEMBER AND A DISPLAY APPARATUS HAVING THE SAME - A backlight assembly which includes a light source generating light supplied to the liquid crystal panel, optical members controlling characteristics of the light provided from the light source, a receiving container including a receiving area receiving the light source and the optical members, a rear surface defining a plane, and a first recess protruding toward the receiving area from an exterior of the receiving container and an elastic supporting member assembled to the first recess of the receiving container, and supporting the optical members. The first recess has a depth from the plane of the rear surface, such that the supporting member does not protrude past the plane of the rear surface of the receiving container.",
            "DISPLAY APPARATUS - A display apparatus includes a display module and a front case. The display module displays images. The display module includes a boss fixing member having a combination hole. The front case covers a first surface of the display module and has a first boss that is inserted into the combination hole to combine the front case to the display module. The first boss is formed at inside edges of the display module. The boss fixing member is positioned within the edges of the display module which define the outdimension of the display module."
        ],
        [
            "Published",
            "12-11-2008",
            "01-29-2009",
            "03-25-2010",
            "08-04-2011"
        ]
    ],
    "pageTitle": "Han, Cheonan-Si - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/han-cheonan-si-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00160-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 431491359,
    "recordOffset": 431468829,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Sang-Sun Han, Cheonan-Si KR 03-13-2014 BUILT-OFF TEST DEVICE AND TEST SYSTEM INCLUDING THE SAME - A built-off test (BOT) device includes a signal processing block, an output selection block and a signal control block. The signal processing block duplicates a test signal to apply a plurality of duplicated test signals to each of a plurality of devices under test (DUTs) through each of corresponding channels, and the signal processing block provides a plurality of decision signals based upon a plurality of test result signals received from each of the DUTs. The output selection block merges the decision signals as a final decision signal or sequentially outputs the decision signals as the final decision signal, in response to an output mode selection signal. The signal control block provides the test signal to the signal processing block or provides the final decision signal externally, in response to a first switching control signal. 20140074423 Published Description Patent application number Sang-Go Han, Cheonan-Si KR 05-19-2011 BUILT-OFF TEST DEVICE AND TEST SYSTEM INCLUDING THE SAME - A built-off test (BOT) device includes a signal processing block, an output selection block and a signal control block. The signal processing block duplicates a test signal to apply a plurality of duplicated test signals to each of a plurality of devices under test (DUTs) through each of corresponding channels, and the signal processing block provides a plurality of decision signals based upon a",
    "textAfterTable": "Patent applications by Sang-Sun Han, Cheonan-Si KR Sang-Woo Han, Cheonan-Si KR Patent application number Description Published 20150103263 DISPLAY DEVICE - In an aspect, a display device including: an entire window, said entire window including a display area and a non-display area outside the display area; a display panel; a first adhesive layer disposed on the display panel; a touch screen panel disposed on the first adhesive layer; a first light blocking member disposed on the touch screen panel; a second adhesive layer disposed on the touch screen panel and the first light blocking member; and a protection window disposed on the second adhesive layer is provided. 04-16-2015 Sang-Youn Han, Cheonan-Si KR Patent application number Description Published 20090167703 DISPLAY PANEL AND METHOD FOR MANUFACTURING THE SAME - A display panel and a method for manufacturing the same are disclosed. The display panel includes: a first substrate, a touch spacer formed on a first substrate, a common electrode formed on the touch spacer, a second substrate opposing the first substrate, a sensing electrode facing the touch spacer on the second substrate and an alignment layer on the sensing electrode or the touch",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}