{
    "relation": [
        [
            "First Name",
            "Denise",
            "Larson",
            "Thomas"
        ],
        [
            "Last Name",
            "Cardman",
            "Frisby",
            "Susman"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=3BDFDF8E-13F5-4E9B-8FA5-AED3FBAFC7AA&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00218-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 215535069,
    "recordOffset": 215519160,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34492=Draft legislation, Incorporation Transparency and Law Enforcement Assistance Actprovisions requiring states, certain businesses, and company formation agents to obtain and disclose beneficial ownership information regarding new companies and subjecting lawyers that act as formation agents to the anti-money laundering and suspicious activity reporting requirements of the Bank Secrecy Act Department of the Treasury Financial Crimes Enforcement Network Advance Notice of Proposed Rulemaking on Customer Due Diligence Requirements for Financial Institutions, RIN 1506-AB15, 77 Fed. Reg. 13046 (March 5, 2012)provisions requiring law firms that establish accounts at financial institutions on behalf of clients to disclose the identity and beneficial ownership information regarding those clients Draft legislation, Stop Tax Haven Abuse Actprovisions subjecting lawyers that act as formation agents to the anti-money laundering and suspicious activity reporting requirements of the Bank Secrecy Act S. 268, Cut Unjustified Tax Loopholes Actprovisions subjecting lawyers that act as formation agents to the anti-money laundering and suspicious activity reporting requirements of the Bank Secrecy Act, 44337=S. 699, Court Efficiency Act of 2013 H.R. 144, Ninth Circuit Court of Appeals Judgeship and Reorganization Act of 2013 H.R.862, Supreme Court Transparency and Disclosure Act H.R. 312, Juror Non-Discrimination Act S. Res. 4, S. Res. 28, reforming the Senate rules S.575, H.R. 1203, Judicial Transparency and Ethics Reform Act H.R. 917, S. 405, Sunshine in the Courtroom Act of 2013 H. R. 1181, Sequestration of Pay for Members of Congress H.R 933, Consolidated and further Appropriations Act of 2013, Title V, provisions affecting judiciary Draft bills, Crime Victim Restitution and Court Fee Intercept Act S. 716, legislation repealing the website disclosure and transaction reporting provisions contained in Sections 11, 8, and 6 of P.L. 112-105 (S. 2038), the STOCK Act of 2012, applicable to career federal employees Draft legislation amending 28 U.S.C. 1500 to clarify the respective jurisdiction of the U.S. Court of Federal Claims and the U.S. District Court and allowing plaintiffs with claims against the U.S. government to bring simultaneous claims in both courts, with a presumptive stay of the first-filed action, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 15084=FY 2014 Labor, Health and Human Services and Education Appropriations funding for programs authorized under the Preserving Safe and Stable Families Act, funding for programs authorized under the federal Child Abuse Prevention and Treatment Act (CAPTA). Discussion of Legal Services Corporations funding in H.R. 152 (Hurricane Sandy Supplemental), H.R. 933 (funding for FY13), and for FY14 (no bill number yet) FY 2014 Financial Services and General Government Appropriations funding for Defender Services. FY 2014 Department of Commerce and Justice, Science, and Related Agencies Appropriations Act funding for reentry programs under the Second Chance Act; juvenile justice programs, Bureau of Prison programs and indigent defense services administered by the Department of Justice; funding for the Legal Orientation Program., 67621=Activity in support the establishment of veteran treatment courts, including S. 162, the Justice and Mental Health Collaboration Act of 2013. General activity in support of preservation of funding for key veteran homelessness programs and the authorization of legal services funding. General activity in support of improved administration of claims and the enforcement of rights under the Uniformed Services Employment and Re-employment Rights Act. General activity supporting clarification of the Servicemembers Civil Relief Act to make explicit that the Act covers proceedings involving dependent support, custody and visitation. Activity in support of preserving the attorney-client relationship during the veterans claims process., 38358=H.R.332, Equal Access to Justice for Victims of Gun Violence Act H.R.452, Gun Trafficking Prevention Act of 2013 S.54, Stop Illegal Trafficking in Firearms Act of 2013 S.146, School and Campus Safety Enhancements Act of 2013 S.150/H.R.437, Assault Weapons Ban of 2013 S.374/H.R.137, Fix Gun Checks Act of 2013 S.480, NICS Reporting Improvement Act S.649, Safe Communities, Safe Schools Act of 2013, 20343=H.R. 377, S. 84, the Paycheck Fairness Act; S.RES.60: Provisions related to womens rights H.R. 11, S. 47 Violence Against Women Reauthorization Act of 2013 Enforcement and prevention of peer-to-peer violence and bullying based on actual or perceived sexual orientation or gender identity S.372, H.R. 725 Real Education for Healthy Youth Act of 2013: Provisions related to sexual orientation and gender identity., 52051=H.R. 1199, S. 403 Safe Schools Improvement Act of 2013 - Provisions related to bullying, specifically of LGBT students. S.619, Justice Safety Valve Act of 2013 Bureau of Consumer Financial Protection Proposed Rule on Confidential Treatment of Privileged Information, Docket No. CFPB-2012-0010; RIN 3170-AA20, 77 Fed. Reg. 15286 (March 15, 2012) and related Final Rule, 77 Fed. Reg. 39617 (July 5, 2012), 56237=Department of Labor Proposed Rule on the Labor-Management Reporting and Disclosure Act, Interpretation of the Advice Exemption, RIN 1215-AB79 and 1245-AA03, 76 Fed. Reg. 36178 (June 21, 2011), 24618=H.R. 1123, the ''Unlocking Consumer Choice and Wireless Competition Act''. S. 467, the ''Wireless Device Independence Act of 2013''. S. 517, the ''Unlocking Consumer Choice and Wireless Competition Act''. H.R. 1278, the ''Non-Disparagement of Native American Persons or Peoples in Trademark Registration Act of 2013''. S. 214, the Preserve Access to Affordable Generics Act. S. 350, the Fair Access to Science and Technology Research Act of 2013. H.R. 845, the Saving High-Tech Innovators from Egregious Legal Disputes Act of 2013. H.R. 22, the Foreign Counterfeit Merchandise Prevention Act.}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  THOMAS M. SUSMAN  2026621765  thomas.susman@americanbar.org 5. Senate ID#  1808-12 7. Client Name Self Check if client is a state or local government or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}