{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Catalyst",
            "Japanese News",
            "Seven Early News",
            "Today",
            "CBS This Morning"
        ],
        [
            "Time",
            "5:30 am - 6 am",
            "5:40 am - 6:15 am",
            "5:30 am - 6 am",
            "5:30 am - 9 am",
            "5:30 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2013/02/04/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00009-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 715955367,
    "recordOffset": 715887633,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{90625=It won't be long before Sydney moves on from its coolest February weekend in 19 years., 23000=Will 2013 be the year of the big spenders? Property editor Stephen Nicholls reports. (02:30)}",
    "TableContextTimeStampAfterTable": "{122570=February 28 It's been branded the 'baddest tour ever'., 245380=Lewis_Edwards, Feb 3, 2013, 10:38PM, 120502=February 16, 17 Boom! Bap! Pow! will headline the South West Craft Beer Festival's 2013 line-up., 241554=PM announces election for September 14, 258203=February 02 2013, 97819=Start your training for Run Melbourne 2013, to be held on Sunday, July 21., 229776=There's no dragging the heels on this march, 244315=far away, Feb 4, 2013, 3:01AM, 118529=February 9 This year delivers an eclectic international line-up., 121493=February 22 - 24 Part of the PIAF, the Writers Festival is jam-packed., 119461=February 9 -10 Iconic American singer, songwriter and pianist, Carole King will perform., 117536=Perth beauties strutted their stuff at the Perth heats 1 & 2 for Miss Universe 2013., 7090=PAUL SHEEHAN When Craig Thomson rose to speak in Parliament for the first time, on February 19, 2008, within 90 seconds he thanked three key Labor machinists.}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: Preposterousness and pomposity of the protagonists make this new drama strangely endearing. The Paradise What's on TV Tonight A place to express personal views on local news. Gathering of the minds Our local experts give you the advice you ask for. Good Advice Opinion Book your tickets now and win an art adventure in Paris. Line up your laughs Brisbane Comedy Festival Learn to paint like a Tibetan at the Brisbane Powerhouse.",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Gardening Australia 5:02 am - 5:30 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane Sunrise Extra 5 am - 5:30 am Channel Nine Brisbane Nine's Early Morning News 5 am - 5:30 am Network TEN Brisbane Life Today with James Robison 5 am - 5:30 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Catalyst 5:30 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane Seven Early News 5:30 am - 6 am Channel Nine Brisbane Today",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}