{
    "relation": [
        [
            "Poster",
            "Rockabilly",
            "Just popping in Joined: 2006/12/21 From: Posts: 8",
            ""
        ],
        [
            "Thread",
            "Posted: 2008/2/12 17:33 Updated: 2008/2/13 5:05",
            "Re: An Analysis Of Sally Morgan Reading Of William Brough... I know shes crap at being phissic, but why oh why is she so damn sexy!!?? just the sound of her voice is enough to do somethjing to the ghoulies or is that ghoolies .....",
            ""
        ]
    ],
    "pageTitle": "BadPsychics By Jon Donni - News",
    "title": "",
    "url": "http://web.archive.org/web/20080216070152/http:/badpsychics.com/thefraudfiles/modules/news/article.php?storyid=681",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00116-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 265031595,
    "recordOffset": 264987680,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{65966=Many many months ago a self proclaimed journalist approached me demanding proof that Sally Morgan was a fraud, despite being shown numerous examples where she had cheated, lied and been caught out he simply refused to accept any of the evidence. This person claimed he had received a reading from Sally and that she had told him things she had no way of knowing, he also claimed that it was not cold reading. We agreed that he would give me a copy of the reading and in return I would show him exactly how she performed this miracle, he agreed. By Jon Donni & Meercat Unfortunately many many months later we were still waiting for this recording, in the mean time he had started a mini hate campaign on Youtube, posting ridiculous videos attacking me personally as well as this site. Time after time he would promise to provide me with the recording, but time after time he broke his promise, and broke his word. A time came where i simply didn't believe the recording existed and wondered if this was all just some bogus scam by a wannabe media personality to try and gain some free publicity off my back. Now amazingly in what seems like a different life time, he finally handed over his reading to legendary Australian skeptic Richard Saunders, immediately Richard contacted me and said that a quick listen to the recording and he knew it was 100% cold reading. Richard then sent me the recording which we have now transcrbed and analysed. Before that I would like to apologise to him for doubting the recording ever existed, but upon listening to it myself I can now understand why he was so hesitant to hand it over. For it shows some of the worst cold reading any of us here at BP Towers have ever heard. This is bog standard run of the mill stuff that makes Acorah in comparison seem like a genius! I hope that after reading this that he can finally shake off his shackles of woo, step out of the dark and begin his life again as a proper sceptic. All I would say is that you should not feel sad that you were fooled by Sally, nor should you feel embarressed, instead feel empowered by your newly found knowledge and experience, and turn that anger into passion. Ok onto the reading. You can download the original reading at the following link http://rapidshare.com/files/90145107/SallyMorganReading.mp3 Trascript and Analysis performed by Meercat Key: S = Sally W = Person who submitted reading My comments are in bold type. W: Iâ\u0080\u0099ve seen a tarot reader a long time ago in Australia and another woman about six months ago. S: Oh okay, so Iâ\u0080\u0099ll just.... W: She wasn't very good S: Oh what a pity W: (unknown...) An innocent enough statement, but now sally knows that W travels. S: I'll just briefly explain what I do, erm, buts its.. er, I call myself a medium and I would really describe that as someone who's in touch with the spirit world, I know that it can sound quite bizarre but thatâ\u0080\u0099s what I would say I can do, its ability, I donâ\u0080\u0099t possess any power and its something that I've been able to do all my life. So really when I tell you (unknown) I donâ\u0080\u0099t have to do anything to do it, it is just there. Erm, I'm also known as a clairvoyant W: Okay S: Which the true meaning of that is clear view, to see, and I see literally, and you've got a lady that walks with you, by that I mean that's she's passed over, and I can see her very clearly so she's related to you, (The standard Mediums line) she's sort of coming to check me out, but I have a great sense of her and she's sort of standing there. If one wanted to split hairs you could say cause I've got a view of her, I'm clairvoyant, I've no problem being called that but I would choose to call myself a medium, and another term thatâ\u0080\u0099s used is psychic (unknown) and youâ\u0080\u0099re psychic ability is very heightened, (For some reason, Psychics like to tell everyone they're psychic as well...) very sensitive, thereâ\u0080\u0099s a side to you, you're very aware, your very good, a very good judge of character, although you're very trusting, at times when you were younger it would have got you into a lot of trouble, (Typical Barnum statement) and problems around you, but youâ\u0080\u0099re, youâ\u0080\u0099re, you've got no problem in, like sensing something, putting your finger on it, it might have been a bit difficult at times but if you went into a property you didn't like you'd certainly know about it. So thatâ\u0080\u0099s the tool that I use really to look into your life. You've, I donâ\u0080\u0099t know if youâ\u0080\u0099ve come in for specific reasons but Iâ\u0080\u0099m going to look at you life now and a look ahead for you, how does that sound? W: Perfect. S: Now do you wear a wristwatch? W: I donâ\u0080\u0099t, but I have one but I never wear it S: Have you got, do you carry it with you all the time? W: I always carry it S: Can I hold it, thatâ\u0080\u0099s fine W: Does it matter that I never wear it? S: No, not at all. W: I just always carry it S: Ok S: Erm, who's adopted? who do you know around you, someone in the family didnâ\u0080\u0099t grow up with their parents (A question, two questions in fact) W: Not adopted, but someone was in boarding school for a long time ('making it fit') S: Who's that (Another question) W: My Father S: Yeah (Agrees as though she knew that) W: He wasn't adopted but.... S: And did he not know his Father very well... (another question) W: Knew him but not until he was older S: Not until he was older, yeah.. (Once again, agrees as if she knew) S: Is the name Andrew there? (A question) S: Or is there someone called Adrian? (Another one) W: I can't think, no... (No Andrews or Adrian's then...) S: There's someone in the family, that, erm..I can see where you're coming from... thereâ\u0080\u0099s someone in the family that has, erm, I think I've got your Grandmother here.. and erm, thereâ\u0080\u0099s someone who is still on earth plane who's still alive that didn't really know their birth parents. They might have known of them but they never knew them, were never around them.. W: Its possible, I wouldnâ\u0080\u0099t know.. S: Well your Grandmothers is watching, your Grandmother is in spirit world and she's watching this person... W: She's still, they're all still alive... (The Grandmother who is in spirit world, is actually very alive) S: All your Grandparents? (Question) W: Not my Grandfathers but.. S: I'm looking at a lady who is connected to your Mother, so if we took your Grandma, did your Grandmother have a sister who died, that passed? (A question and back tracking now to cover pretty drastic mistake) W: ...no S: Only it could be her Mother, we're going back a long way, but the lady is here, so, and you're Grandmother is still alive so there's a possibility I can see her Mother, if your Grandmother had passed then maybe I wouldnâ\u0080\u0099t be looking at her Mum because it goes back another generation, but I've got a lady here which I can see your Mother through his lady, so thatâ\u0080\u0099s how I know its on your Mothers side, and as your Grandmother is still alive (But you didn't know that until W told you) I think I may have her Mother. Is there the name Edith... (A question) W: Not to my knowledge... no... (not the answer she was hoping for) S: And there's no one called Edwina (Another question) W: No, no... (Once again...) S: I was going to say Eddie or Eady..but it's like an E and a D, thereâ\u0080\u0099s the name Edith here very much on your Mothers side.. (Add a few more names and hope to get close) W: I cant think of anyone....(nope...) S: Do you see Mummy a lot? Do you go... (Another question) W: Once or twice a week.. S: So you're around her quite a bit.. thatâ\u0080\u0099s good (It is, but it has nothing to do with a Psychic) W: You've got changes coming in your life and this lady here is very protective, there's changes in your Mothers life too coming up (Changes for W and his Mother, two bases covered, 'changes' can be defined as pretty much anything) W: Hmm S: And this lady in Spirit will be your Mothers Grandmother unless its an aunt, an elderly aunt.. (adds 'Aunt' now...) W: I'll ask her the names... S: But I think this is relevant to this lady, this name... and she loves you, sheâ\u0080\u0099s very erm, she's very precise sort of side to her and a bit sort of Schoolmarm'ish, when I sort of see her I you know, want to sit up straight and behave, she sort of had that persona about her and she's very much here to protect you and she says I'll take care of your Mother, so everything, now, your Grandma, obviously, she's an elderly lady, she's older than her own daughter of course, (This is an incredible observation, Sally knows that his Mums Mother, is older than her) so you'd think I'd want to go to her, but I want to go to your Mum, so your Mum might have a slight problem at the moment W: Hmm, I cant think... S: She might (unknown) that she hasn't told you... I could be wrong, but, its like I just sense this. If you mention this too her, if you dare to tell her you've come to see me, she might be able to confirm that for you, (Or indeed she might not) erm...lets just put the date down, its February 9th 2005, now, immediately as you sit here I go back to last October so thatâ\u0080\u0099s October 2004 W: Yes S: A bit of change in life then, and if it wasnâ\u0080\u0099t to do with work, or you could say business or your career, then it was definitely a different mindset concerning that or even... W: Hmm S: Or even, you could have been even concerned about where you were going with your future, where financial reward is concerned, well that completes itself in May of this year, so, from October 04 to May 05, erm, you could feel as though you're in no mans land, you could feel as if that you're not getting the answers you want from quite specific area and specific people, but its almost as if youâ\u0080\u0099re communicating and whatâ\u0080\u0099s coming back is still leaving you sort of dangling. (Another Barnum statement) From May, everything changes, you've got a wonderful June and July, amazing... July is very liquid, its like finances and money in July W: Hmm S: Are just amazing for you... Who's Pat?... (A question) W: You mean male of female? S: I think its male... W: My Granddad was called Patrick... S: Yeah, he's here...he's here your Granddad, (Bog standard cold reading, throws in a name and waits for the reader to come up with the connection. Some sitters will come away saying \"She knew my Grandfather was called Patrick\" when in fact all she did was say a name) he's standing right next to me here, and he says \"everything will be fine\", he says, \"tell the boy that in July... he can have whatever he wants, its just there.\" (So this spirit can say all that, but he couldn't say he was W's Grandfather?) Do you sail? (A question) W: ......I... S: Do you ever go to the Isle of Wight? (Another question) W: Not..I have connections.... I havenâ\u0080\u0099t been for many years.... S: You'll go back to the Isle of Wight for something, and Iâ\u0080\u0099m looking at sailing , you think you'd be going to Cowes, but it doesnâ\u0080\u0099t necessarily have to be Cowes, it could be some sort of harbour or bay, but Iâ\u0080\u0099m looking at sail boats, and Iâ\u0080\u0099m looking at boats, I know nothing about boats... (Sailing, harbours and bays, what's the chances of there being any of those on the Isle of Wight?...) W: My Granddad was in the Navy... (Given up some information he really should not have) S: Oh was he.... (Surely the 'Psychic' should know this?) W: I've never been interested in it myself... S: I wonder if erm... I wouldnâ\u0080\u0099t know, its really ignorant of me, if the navy was stationed in the Isle of Wight, Iâ\u0080\u0099ve got no idea... But this year you could almost say, this grandfather, is it Pat that was in the Navy? (Keep up Sally... another question) W: Yes S: Thatâ\u0080\u0099s interesting, because he's saying \"tell him he'll go there, and I'll be with him\", so its a bit like what you've just said, you're quite right, it's almost as if he'd have an interest too, something very important to do with the Isle of Wight of all places, how bizarre is that? (Well actually not bizarre at all) But being quite sort of specific which is good, I like to be like that then you really know when its going to happen, sort of not wishy washy. (Oh no Sally, not 'wishy washy' at all...) You also have Scotland in your life.. (define 'in your life'.... he owns a kilt?) W: .... S: Now thatâ\u0080\u0099s very feminine, it could have something to do with a girl...(or it may not...) W: ...no.... S: Anyone called Emma... or Emily.. (More names thrown in the air) W: Well there's two possibilities.. thereâ\u0080\u0099s a friend called Emma but I'm not close, and a sister called Emily S: What, you've got a Sister...thatâ\u0080\u0099s her, its a sister I wanted then, Emily, that I want, its your sister. (Then why didn't you mention sister, rather than throw a couple of names at him?) This is your, I want to call your Grandmother but I think its your Great Grandma....(Don't forget Great Aunt) She's sort of talking about Emily and she's saying, yeah...(She's saying 'Yeah'?...) Well, I get, with Emily, I donâ\u0080\u0099t know if Iâ\u0080\u0099m in this Country... W: What do you mean by that?.... (Quite...) S: Well I feel as if I want to go abroad.... Does she live here? (Another question) W: She's erm, work, just about (unknown) moving to Japan... S: Yeeeah.. Your Great..this lady's with her,(Ooops, almost forget then Sally didn't you? Best stick with 'this lady') she says \"I'll take care of her.\" This lady is sent to look after the children. How interesting. (No, no it's not...) Was Mother brought up by her Grandmother? Or was she brought up by her Mummy? (More questions) W: I think she was brought up by her Mum but she was close to her here Grandmother.. S: Yeeah....(agrees with him yet again) W: We were a Catholic family, close knit... S: Well why is this lady here, (You're the psychic Sally, why don't YOU tell W) so involved with the kids? And she says to me \"Emily will be fine when she goes abroad, everything, and its like quite a long period that she's away\" (Once again this Spirit tells her lots of things, apart from who she actually is!) W: Hmmm S: And she says \"if anyone wants to see her they'll have to make the effort and go out there\" (The Spirits still talking, but saying little )...... Who's Anna? Or Ann.... (More names thrown about) W: The only Anna I can think of is my Mums, well my cleaner but were not close, I just employ her.... S: You just employ her, yea.. but she, your Grandmothers glad that she's there (Oh good, his Grandmother, who isn't dead if you remember, is glad he has a cleaner...) W: I have a sister who's middle name is Anne... (Trying to make it fit) S: No this is Anna, like she's taking care of you, she's looking after you.... W: Its the only Anna I can think of, I mean we're not close, I hardly ever see her, just leave the money on the table S: Good.. well, actually very pleased, your Gran, your Great Grandmother, (you should stick with 'this lady' Sally, it's easier to remember..) she says thatâ\u0080\u0099s good, she says, \"she takes care of you, I take care of you in another way\"... its so fascinating..(No it's not, W has a cleaner he does not know, or really see, she cleans for him, that's not 'looking after him') Is there a name Robyn? (Another question) W: No not that I can think of.. (Shame...) S: You've got New Zealand in your life.... Youâ\u0080\u0099re going to New Zealand.. (Holiday? Kidnapped?) W: Carry on... S: And you've got the name Robyn connected to it R.O.B.Y.N and it'll be a woman, a girl and she'll be very important in your life.. (A Woman/girl called Robyn who's going to be very important...) W: What can you tell me about New Zealand then.. S: Well you'll settle there, and you'll have a son W: A son.. S: Yeah, you'll have children, you'll have boys...you're going to have two little boys...(not a son now, two of them) you could marry someone who's a Doctor.. W: Gosh.. S: You're going to have the medical profession in your life, what do you do for a living? (Another question) W: I work in radio, I was a journalist, Iâ\u0080\u0099m not here as a journalist, but I work as a radio news reading reporter (unknown) S: Oh are you! You've got an amazing (unknown) like Tony Blackburn, how funny is that! W: (Unknown) S: Well thatâ\u0080\u0099s meant as a compliment darling, (laughs) W: (Unknown) about New Zealand, Iâ\u0080\u0099m in the process of applying to emigrate there S: Oh you'll emigrate, (Sally did not say he would emigrate, W did, she said \"You're going to New Zealand\") you'll marry someone called Robyn, with a 'Y' W: I've never.... what else can you tell me about my, like love life at the moment.. S: Well your love life at the moment isn't going anywhere, by that I mean whoever you're with, its, its a none, its like its stuck, you're very much in no mans land, its not meant as a criticism and I'm not judging at all, but your whole being, all the energy that comes off you is in no mans and its like that, its not here and its not there. But then that goes with the fact that you could really see life somewhere else and immediately I just look at it and think Oh my God this is New Zealand... are you thinking about going to the North Island?...(She has a 50/50 chance of getting this right) W: Yes, Auckland.. S: Yeeah, you're going to live there (Well he has just told her he wants to emigrate there) W: It all depends if I can get work there.. S: You'll get work just like that (clicks fingers) W: Hmm S: Have you done some demo tapes? W: Yes. S: Someoneâ\u0080\u0099s going to love the demo tapes W: Hmm, I originally wanted to move to Australia but.. S: No.. its not Australia, (because W has told her it's New Zealand) well I know its not, there so close and a lot of times I get them, well I donâ\u0080\u0099t think I get them confused, but someone can sit there and if I can see Aus then they'll say no its New Zealand, but with you I see its New Zealand. W: I'm interested about Anna as I've always only had gay relationships (Bit of a bombshell for you there Sally, get out of that one) S: Ahhhhhhhhhhh.... I wonder if Robyn then is a fella? (You mean the woman/girl that he's going to marry?) W: Hmm S: Isn't that interesting!........(No, its called a 'balls-up') W: I know, its all ambiguous names S: But you know, you'll have sons, one of them will be identical to you (Better stick with the children theme, even though you now know he's gay or you've just buggered up half the reading) W: Oh dear, poor son... S: Did you want children? (Question) W: When I was younger I did, now I have no desire... S: And it's quite interesting because... its like.. New Zealand maybe you wouldn't think its the end of the Earth you could say, although nowhere is behind us any more, we're all sort of equal cause it's instant access as you only too know like know only to rightly. (The Worlds worst sentence..)But I think that you're probably unlikely to have any form of facilities for gays to have children really, youâ\u0080\u0099re looking more of that sort of in Europe or America, but I know you'll have.. the only other thing is, this is going to be a man, this Robyn, but its like very, very feminine (Ah! Good move Sally!) W: I never rule anything out, you know S: Yeah but I donâ\u0080\u0099t, if I, thatâ\u0080\u0099s, I think... You've only ever had gay relationships, thatâ\u0080\u0099s going to be W: Hmm.. S: But I think you'll have sons, but you might have, it might be a surrogate and you could have twins, and they're the twin boys W: Intriguing... S: And you know where you'll live? You'll live in a building....(not a tree then?) it really looks like a house, but you donâ\u0080\u0099t have the whole house, its sort of split level.. and its like...erm....its brick....so it's quite solid...(brick houses are solid, excellent) but it's sort of on stilts, and there'll be one part there, and two parts over here, done that two big really (seems to drawing).... and you'll live sort of this part here...and someone else will live here.. W: Hmmm S: And it'll be like on brick pillars...... Iâ\u0080\u0099ve never been to New Zealand... W: A lot of houses are like that there S: Well Iâ\u0080\u0099ve never been, so its, and I want you to know that because, its not like Iâ\u0080\u0099ve been there and Iâ\u0080\u0099m picking up something Iâ\u0080\u0099ve seen, Iâ\u0080\u0099ve never ever been there in my life. (She's never been to New Zealand so how could she possibly know they have houses like that? Of course, she also has no access to a television or the Internet and she's never read a book in her life...) W: How long till I might move there S: Well... this is really interesting because....May, your life alters dramatically in May, now I would like to feel, as this is how I see it, that, that is you moving up a gear, you could say wishes and dreams, and, this feeling of being in no mans land really leaves you, its almost as if what youâ\u0080\u0099re aiming at, every single facet of your life alters. I donâ\u0080\u0099t think for one moment that you could be there in May, you might not get it for solid, it might have it, but its almost as if you'll have dates and its almost as if its going to happen but you might not actually be there but I wouldnâ\u0080\u0099t be surprised if it was about May or June (Even though she has just said \"I don't think for one moment you could be there in May...) W: Have you any idea what sort of career? S: Oh, I think whatever you know... I really sense that,.. whatever you do at the moment you are exceptional at, and I think there's no doubt about it that, that is what you have going for you (Well that covers everything) W: Yes..hmmm S: But you'll definitely be with someone involved with the medical profession, maybe even in Pharmaceuticals.. W: Wow.. S: But how interesting.. if he's involved in that...then there might be the possibility that he knows how to go about getting a child...(What if 'in pharmaceuticals' means 'working in Boots'?...) W: Hmmm S: How interesting is that! (Keep saying it Sally, I'm sure it will be eventually) W: That is! S: You've got an amazing future W: I hope so, I hope its a happy one S: Oh yeah, whoever you're with at the moment.. are you with anyone? Have you got a partner? (More questions, Sally actually appears to know next to nothing about W at this point) W: No, single S: What did we say about Anna then, who's Anna? (Anna is the cleaner Sally, we've been here already) W: I can only think she's my cleaner, but we're not close or anything S: No, but it was to do with your Great Grandmother, giving me, telling me she's full of, how she's looking after you, it's interesting because the cleaner really takes care of things, I know you donâ\u0080\u0099t really know her.... (Why the hell are we talking about a cleaner that W hardly sees and doesn't really know?) W: Unless there's another Anna.. S: No, I donâ\u0080\u0099t think its that... You'll be in a relationship and you'll be standing... I would say its a Church, but it might be...a building, that is.. Spiritual.. (Forget the cleaner, I think even Sally knows at this point it was starting to sound strange) W: Yes.. S: And you'll stand next to someone and there will be vows that will be taken W: Interesting... because Iâ\u0080\u0099m not usually good at commitments so... S: No, but I think you're going to find someone where everything is just so perfect for you, and you'll be a long way from home, so its, its like... I think you're going to be very aware, although it'll be subliminal most of the time, almost sort of subconscious, it, you'll be very aware that you need to put roots down W: Yes S: And build a base, youâ\u0080\u0099re not five minutes from home are you.. W: No..its a long way S: Do you know what I mean... but youâ\u0080\u0099re going to live there (Once again, changes \"you're going to New Zealand to 'you're going to live there after being told by W he wants to emigrate) W: I hope so..hmm thatâ\u0080\u0099s pretty good S: Ermm... there, there, I think that, its interesting because I think something will be confirmed or it'll be like, this is how it'll be and then you'll get this amazing offer here, its a bit of a red herring in life, its like no ones deliberately putting it there except destiny to see if youâ\u0080\u0099re serious about New Zealand, so donâ\u0080\u0099t let it sway you from your choices. (Red Herrings, I love them) W: So still go.. S: Who's Lee? (You tell us Sally...) W: ..... S: Once again an ambiguous name, but I actually think its a man, I donâ\u0080\u0099t think its a woman, (a good bet now that you know he's gay right?) but the name Lee around you and that could have something to do with property. Is there an oriental man around you? (Question) W: Yes, but not called Lee (shame) S: And is he something to do with property? (Question) W: No..(unknown) (shame) S: His names not Li... L.I? (Keep going Sally...*sigh*) W: No... I don't know (unknown) property.... I know so may Lee's though, about five or six S: Isnâ\u0080\u0099t that funny, sometimes with names... (Hilarious) W: I could narrow it down S: No, names... its bizarre this... (unknown) in our life, I know lots of people called Val.. why? (I have no idea Sally, what has this got to do with W?) Do you know what I mean! Its (unknown) God I know about ten! But I can see this name Lee, and someone oriental in your life and its to do with property. Do you own your property? (Question) S: Yes, I do W: You might not sell it, you could let it out, and you might find its someone oriental looking, not necessarily Chinese, someone thatâ\u0080\u0099s got a fantastic job, and you know, your money, its in the bank, no problem at all about it, and I think thatâ\u0080\u0099s its almost like an inside secure feeling of like, well, if I come back, I mean, Iâ\u0080\u0099m not saying youâ\u0080\u0099re going to come back, but, you never, I think you're made for life there..(You don't sound so sure to me Sally) W: You think I'll be successful there? S: Yeah.... 101%.. You know (unknown) you could do, this might be a little bit.. this could be.. 10...15 years away, a long time (unknown) A long term..er..er..prediction..I've got so many words going through my head, people talking to me here there and everywhere... A long term prediction, and I don't normally do this but its there so Iâ\u0080\u0099m going to tell you it. But you could get involved with...erm.. agencies... you could have, you could become an agent, you could, you could book people, you could be...erm...a promoter..erm.. maybe some of those terms Iâ\u0080\u0099ve just used are a bit yucky, and there might be a better term, but its almost as if you could become very well known for having lots of contacts, people that are quite well known, famous you could say, globally, people could approach you, to book them (always good to make a long term prediction, with any luck in 10 to 15 years he'll have forgotten all about you) W: Well!...Iâ\u0080\u0099m good with people... S: Very good with people, I think also your communicative skills, well you could say its not even face to face that Iâ\u0080\u0099m even better. And I think that... you're going to have a little bit of money that, your, you're, you'll take a risk with something that will pay off big time that would never have paid off if you lived here. Its almost as if its a closed shop here, well thatâ\u0080\u0099s not radio for a start, so its something else, but it's got something to do with entertainment, stars, celebrities, VIP's whatever you want, and sort of like making sure that they keep to the deal, well you're not a Lawyer, so its like, you could become like an Agent, its bigger than that, maybe some sort of impresario.. W: What about politics? S: Erm.... you could feel battered and bruised, if you, Iâ\u0080\u0099m not saying don't, Iâ\u0080\u0099m not saying you mustn't take a political path, but I think if you took that route I think that, if, what it is you see, your.. in you, (unknown).. you're a great humanitarian W: Yes S: And, you love the underdog, its innate, just natural, it just comes out of you, you're drawn to it, you know, even when you think to yourself I mustn't do this, this is ridiculous, Iâ\u0080\u0099m going to get hurt, it isnâ\u0080\u0099t going to work, you're just drawn to it, you're right there, I can see where you're coming from with the politics, I just think you'll be very disappointed... I think you would find it,.... thereâ\u0080\u0099s too many bullies in it W: Yes S: For you... S: I see a lot of Politicians, and youâ\u0080\u0099re not a politician, but that I... its not a criticism, I mean, for you to take the knocks, that are there, I donâ\u0080\u0099t, I think it would be very, you would find it... it would leave too many scars... You'd think what am I doing W: I get battered quite easily S: Yes, you'd get battered, you would be, you're very honest, there's a very truthful side to you, and politicians arenâ\u0080\u0099t. They start of with their, I think an innocence, very grand ideas and very wonderful ways, and do you know, I think thatâ\u0080\u0099s brilliant, but very quickly their dreams are shattered. S: And I see for you.... and this is really nice to say this, I see your dreams not being shattered, so if you would say Iâ\u0080\u0099m going to be a Politician, I would say well that doesnâ\u0080\u0099t run with what I see, because you'd have your dreams shattered there (unknown) but Iâ\u0080\u0099m not seeing your dreams shattered. (A very long winded way of saying very little) W: (unknown) S: You've got Canada in your life too...is that connected...(Question) is there someone around you called Brian? (question) W: Ryan...(No, she said 'Brian'...) S: Ryan? Who's that (Well its not Brian, we know that much) (another question) W: Sisters husband, Canadian S: Yeah.....Ryan, I can see him (Of course you can, can you still see Brian though?) W: Thatâ\u0080\u0099s spooky! S: I know darling, it is my work (Ooh, I'm getting shivers...) W: Hmm S: And its spooky Iâ\u0080\u0099m afraid (Yep, its uncannily accurate...) S: I wish I was as clever as that W: (unknown) S: Darling I'm not clever its just, if that was being clever then I'd be worth a fortune, but its like its just there. Canada is quite important to you, and youâ\u0080\u0099re going to go, but it will come in to your life, thatâ\u0080\u0099s the UK there, looking at the globe youâ\u0080\u0099ve got America there, and Europe here, when you are in Canada, thatâ\u0080\u0099s when... when you are in New Zealand, that is when Canada will come into your life, you will go that way round, and, but it could be by radio (So, canada is not important because his brother in law is Canadian, well, that would be important for his sister really wouldn't it, Canada is important because of New Zealand. So why mention Brian? Sorry.... Ryan...) S: Wow... S: It might even be, and why not, a Canadian Company, that has links, or sister company in New Zealand and they give you a job and something that youâ\u0080\u0099re going to specialise in on the radio, they want in Canada (or maybe 'Robyn' is a Lumberjack?) W: (unknown) S: Because, there's quite a French feeling with you as well and of course you've got French Canadian, you know what I mean, it fits in (French as well! So we have New Zealand, Scotland, Canada and now France. If he gets the full set he wins a decanter and glass set) W: Iâ\u0080\u0099m off to Paris this weekend S: Where you..working? W: No, no no, just a trip, I did French A level and used to study there a bit.. S: Its quite interesting this, Iâ\u0080\u0099m sort of seeing France in your life, not because youâ\u0080\u0099re living here, its almost like because youâ\u0080\u0099re living in New Zealand. How bizarre (Oh, totally) W: Maybe Robynâ\u0080\u0099s French, you never know (Or a Lumberjack W!) S: Yeeeah, maybe, maybe Robyn is French!......Yeeeah.... (Maybe he's having a baguette for lunch? I'm just helping, obviously...) W: My Mother loves France S: Your Mother plays a big, big part in your life, I can see her... Mummyâ\u0080\u0099s got to watch..erm.. angina, a problem with her heart W: Not to my knowledge S: She has a very very long life, but she could just have her quality of life, changed slightly because she doesnâ\u0080\u0099t pick up on something, if she gets pain here, its not her lungs, its her heart, if she gets breathless its not her lungs its her heart.. W: She does a lot of exercise... S: Does she, does she monitor her heart, is she very fit? W: Yes, very S: Anything, if she starts to get palpitations when resting, she needs to have a doctor listen to her heart (Dr Morgan is in....) W: Do you see my Dad anywhere S: Yeah...It's interesting, when I see your Dad why am I getting a garden? Is he garden mad? (Questions) W: Not at all, no. (Shame) S: And is he having something landscaped? (Question) W: No..no (Shame again, you don't have two dads do you W? It's just Sally seems to thi... oh never mind) S: Have you got a photograph of your Mum and Dad.. W: No S: And whatâ\u0080\u0099s your Dads first name? (Oi! Psychic! Is there ANYTHING you know without being told?) W: Christopher S: Yeah, who's Francis? (Question) W: Nobody...(Shame) S: And a girl call Frank...there is and its to do with your Dad (A 'girl' called frank?...Blimey...) W: There's someone called Frank but he's not related... S: How is he.. is he a friend?.. W: He doesnâ\u0080\u0099t know my Father but...he knows me but not my Father (No Sally said it was 'to do with your Dad') S: And how does he know you (Question) W: Heâ\u0080\u0099s a friend, Iâ\u0080\u0099ve got a photo of a possible Frank S: Have you, lets have a look... what does your Dad think about your friend, does your Dad know youâ\u0080\u0099re gay? W: Oh yes, he doesnâ\u0080\u0099t really know my friend he's only met him once S: Oh he's going to meet Frank (Wjust said, he's met him once) W: If its that Frank, I donâ\u0080\u0099t know S: Is he a gardener? (Question) (A professional one? Or someone who just has a garden?) W: Used to be... S: Yeeeah!...(Agrees as though she SAID he was a gardener instead of asking) W: What can you tell me about frank? S: Well, this is really bizarre, I can tell you about Frank as I can see what your Fathers going to say, its like, when I talk about Frank its what your Fathers going to say (This is the same father you thought was garden mad and was having something landscaped? I'm not sure you know too much about him really..) W: Hmm S: How twisted! Its like... How upside down is that! (Crazy, crazy woman) W: Is it definitely that Frank? S: Why? Have you got another Frank? (More possibilities coming up...) W: There's a Francis in Australia.... S: No...this is him. Where was this taken? (question) W: South Africa W/S: (unknown) S: (unknown) What do I think of this frank? That... there's duplicity there, he can be two people... W: Hmm, In what way, you mean... S: Well, I think he would like to feel he could share his life with someone, he talks about that, but there will be no action... its like he could be swayed..its quite...its like it has a double meaning, its like he could persuade someone to change their life and then just dump them or just dump the situation, its a wait a minute, Iâ\u0080\u0099ve just done this! for you or us and he's like, well I never asked you too. (garbled). He's almost I could say... he could lead you, and then just drop the situation.. W: Is he a decent person? S: Well I think deep deep down he is but he's very confused and very lonely, I donâ\u0080\u0099t want to basically just analyse him because Iâ\u0080\u0099m not an analyst, but its a bit like, I donâ\u0080\u0099t think your Dad would like him around you, and I think your Dad would be spot on with what he said about him. W: Should I be careful of him? S: Yes... and donâ\u0080\u0099t tell him too much about... about.... keep your own council about (garbled) its a bit like you tell him you want to go to New Zealand and be very enthusiastic, and all of a sudden he could say well Iâ\u0080\u0099m going to New Zealand, and you'd want to think is that because I am thatâ\u0080\u0099s lovely we can be together (garbled) cant put my finger on it, there's something very odd W: Is he a nice guy? S: I think he is...no....hey, whatâ\u0080\u0099s a nice guy? I think he is, if we met him and it was just like (garbled) you'd think thatâ\u0080\u0099s a nice guy, but, people that are nice, once you get to know them, and their character (unknown) and they can be odd, I donâ\u0080\u0099t mean your sexuality being odd, I mean his character. W: Iâ\u0080\u0099m assuming thatâ\u0080\u0099s the Frank connected to my father, Iâ\u0080\u0099m assuming it is, I cant think of any Franks S: Well its probably the Frank connected to your father because it'll be a frank that your father will see. Has your father met this man? W: Briefly, about six years ago S: And are you still around this man now W: yes S: He's not your partner is he? (I think we already established that W is single earlier) W: No no S: Nooo (Agrees.... but why, I have no idea) W: A good friend, one of my best friends S: Oh is he... he's a bit jealous of you W: Not to my knowledge.. S: Well he is, he's envious of you... I can guarantee it W: We get on well... S: Whatâ\u0080\u0099s he said about New Zealand? (Question) W: He says its a good idea... as long as I donâ\u0080\u0099t destroy all my options S: Oh you wont... you'll gain... W: Iâ\u0080\u0099ve got another photo of someone S: Yep, get it out W: Got two actually W: Thatâ\u0080\u0099s Frank again, but this one Iâ\u0080\u0099m interested in.. S: The guy here... W: Yes... S: Straight away I see America with him, I see the West Coast, L.A, California, what does he do for a living? (Question) W: He's a motivational speaker S: Oh, well there's a lot of them there, you know like, erm.. life coach W: Yes, thatâ\u0080\u0099s what he is, more or less S: Is got..is his name Anthony? (Question) W: No.. (Shame) S: And who is Tony? (Question) W: ....... S: It could be.. it could be Hispanic... W: Who, him? S: No..someone connected to him, but he'll have LA in his life (Hey, what happened to 'Tony'?) W: Whatâ\u0080\u0099s he like as a person? S: Well, I donâ\u0080\u0099t think he's bad, but as a person I think that, heâ\u0080\u0099s, very ambitious, and none of this is bad okay....once again not critisising, he's very ambitious and because he feels he's got to do it now, he's right really, he goes and gets it, and yes, he can, in his wake, leave a few casualties, but then can't we all. I look and and I think hey Sally , you know, there but for the Grace of God, you know (unknown)... But I think that.. he is..... he's going places.... I think that he would love to settle down.. but I think that .. he... there's a side, Iâ\u0080\u0099m saying this smiling a little bit, so, this is not meant really maliciously, but he could sleep his way to the top a bit (What's the chance of a Life Coach and a Motivational Speaker being ambitious?) W: He's not gay by the way.. (Better get that one in, Sally needs all the help she can get at this point) S: No..But he's like, there's a side to him where he could do anything to get to the top. Now, he's a life coach, so its a bit like, you want to say, well, he should understand himself, but I donâ\u0080\u0099t know if he does. S: Will he achieve? S: Well I think he will because he's got America in his life, land of milk and honey, so true, for people like him, and the line of work that he's in, they're all in la-la land, It'll be fantastic, (garbled) West Coast. Who's the guy in the blue shirt there? (Question) W: Thatâ\u0080\u0099s me... (Genius! Sally, the 'Psychic' is sat holding a photo of the man sat in front of her and does not know who it is...) S: Were you not well here? (Question) W: That was.. I had an eating problem at the time, that was five years ago now S: Yeah you did... (Sorry Sally, did YOU say he had an eating disorder?...) Its like I look at this here and youâ\u0080\u0099re in such a different frame of mind, and youâ\u0080\u0099re like, not well, you were not seeing how (unknown) were you working? (Question) W: No, no I wasnâ\u0080\u0099t then, we'd just come back from South Africa and it was a reunion S: Hmmm... you found yourself a bit in South Africa W: I changed for the better since then S: Well what youâ\u0080\u0099ve done is... there's a calmness around you, a change for the better, you were lovely then...your no better now, what you are now is, you're more happier in yourself. There's a calmness... I would have said, knowing that was you, and knowing the situation I would have said, you were still maybe struggling.. with ..erm.. recognising you were going to be gay forever W: It was a near thing for me though S: Was it.... S: And yet youâ\u0080\u0099re not bisexual? (question) W: Not to my knowledge.. S: No...no youâ\u0080\u0099re not (Agrees with W on the information HE gave to her) W: I never rule anything out... S: No, I never say never, but I truly donâ\u0080\u0099t think you are, I think your lifestyle is perfect for you, and I actually think that one of the reasons that you have what I call the domino effect, because its already happened because youâ\u0080\u0099re on your way to New Zealand, its like all the dominoes stand up and then destiny knocks one and its (makes noise of dominoes falling down) timing and thereâ\u0080\u0099s absolutely no doubt your in that phase, the domino, and thatâ\u0080\u0099s because your happy with yourself... I mean, we all have ups and downs, and there are going to be moments of doubt, thatâ\u0080\u0099s normal, you know, we wouldnâ\u0080\u0099t be human if we didnâ\u0080\u0099t have those, but on the whole, you know where you should be (blah, blah, blah) W: Good, one more photo? S: Yes, do get them out W: This is the last one, its the only one I have of this person, believe it or not its a man.. him, and him.. Iâ\u0080\u0099m the other on in it.. S: Right.......erm..... W: Its a party.... S: Right... the one in the... Iâ\u0080\u0099m just looking at (garbled) its not observational, but the one in the middle has been very badly hurt, he's on his guard, do you know him quite well? (Question) W: Yes.. but only recently.. S: Because he's a lovely person..erm... who's Paul? (Question) W: Would he be connected to me or him... S: Yes..well, its like someone has been very hurt with the name Paul W: I donâ\u0080\u0099t know, I donâ\u0080\u0099t know enough about him.. S: Did you have a boyfriend called Paul? (Question) W: ..... I was dating someone called Paul S: Oh were you.. W: In Australia S: He's going to try and contact you again W: We speak... we spoke today (Blimey she's good....) S: Yeah, I can see him (unknown) Australia? W: No, he's Spanish, not to my knowledge, I always ask him to come over... S: A Paulo?.. (question) W: I have a Paulo in Australia , but we're just friends, we're not... S: He's going off to Australia this man in the middle, I know that by what Iâ\u0080\u0099ve just picked up (What HAVE you picked up so far Sally? It's just a never ending stream of questions) W: Do you know when? S: Erm.. well definitely 2005 and definitely before September W: really.. wow.. S: What does he do for a living? (Question) W: He's a lot older than me, he's in his 50's, believe it or not he's a drag queen and we're very good friends S: He's a lovely person... and its about time he had success thatâ\u0080\u0099s what I would say, who's Richard? Is there anyone called Ricky? Or Ricardo thatâ\u0080\u0099s connected to him..(More names, more questions) W: I'll ask him all of these S: And he's going to know exactly who they are (Right....) W: Do you see him successful? S: Yes, he's got to go to Australia, and never ever look back, go to Sydney, and you will tell Paul about him, and Paulo about him W: Paulo's met him...(oops..) S: Well he should go over there W: Paulo lives in Sydney as well. S: Its just he'd never look back. This man here, he's not very well W: Thatâ\u0080\u0099s not the best photo of him Iâ\u0080\u0099ve got to say... S: No, he's not very well, not observational, trust me on this, its what I , I cant put it into words, its what I sense. And I very much, when this was taken, I feel that in 2005, it might have to do with an older woman, I don't know if he's recently lost his Mother? (Question) W: No.. S: There's not the name Khan is there? (Question) W: Thatâ\u0080\u0099s his surname. (A hit! But I'm betting the photo does not show Mr Khan to be a Filipino....) S: Yeah... He could have a bit of a shock, to do with his Mum, it is not her death, (She's going to be a Zombie?) not her death, but... it is not her death, but.. it is...erm... it will effect her quality of life...(She IS going to be a Zombie!) The shock could come because he might not be in the same country when it happens (Oh, okay, maybe not...) W: Can you tell me anything else about him? S: Erm........ there's a lot of people he's estranged from...and its so sad.. W: He's fallen out with them? S: Well, not.. is he gay?...(Question) W: Yes.. S: Yeah... its to do with that (But you didn't know he was gay until W told you, how do you know its 'to do with that?)...was he married? (question) W: No, no... S: Well someone tried to fix him up.. (hands up anyone who's friends have tried to 'fix them up' at some time) W: Yes.. S: He ran like the clappers.. W: Hmmm S: Like that... he's a lovely fella W: Will he have love? will he... S: Oh Yeah!! He's got, cause you know why, cause he's quite easy going...like very laid back, its a bit like with him, you know (garbled) he's a nice man! W: He is.. S: Lovely guy!.... I worry about.. he could be anaemic W: (Unknown) S: He is not, it is not, no HIV, okay.. it is not that, or leukaemia, it is like anaemia, my daughter, my youngest daughter suffers from it, he probably be.. its to do with your immune system being run down, as soon as you say that about someone who's gay I know what's going through their head, but it's not that , its something that can be cleared up by extra iron (if in fact it is an iron deficiency he has) W: Iâ\u0080\u0099ll tell him that, any advice for him? S: Yeah, he should (unknown) to his health, he should take kelp and zinc, and he should take extra Iron, but not just as a solid iron tablet, so it should be multi vitamin with iron in it so its just a small amount, okay, thatâ\u0080\u0099s just one advice for his health, (or perhaps see a Dr?...) he's, he's a person, this is lovely, he's (garbled) like taking to a brick wall, (garbled) he'll still be doing the same thing, (garbled) But he's happy! He'll come visit you when you're in New Zealand (Garbled) and he'll come out and he'll have a lovely holiday with you, and he's the sort of guy who say Oh I might buy a house here (garbled) but he's very easy going W: Will our friendship last? S: Oh definitely... W: You've mentioned health, what about my health? S: You're very, thereâ\u0080\u0099s nothing wrong with you.. W: So.. no HIV.. S: Oh donâ\u0080\u0099t tell me that!.... W: (Unknown) I hope not, I pray.. I've never been tested S: You don't need to be tested, I'm looking up to God here (So let me get this right, a 'Psychic' is telling someone they don't need to be tested for HIV?...) W: (Unknown) S: Well I'm looking up to God here and you havenâ\u0080\u0099t got it ('God' has diagnosed him, and he has not got HIV, the rest of the reading is just laughable, THIS is irresponsible) W: Good S: Okay? So as long as you remain sensible with your partners.. you, have not got it. (Now surely there is the possibility of someone gullible actually taking this as fact?) And youâ\u0080\u0099ve got a very very long life. The only problem you'll have is with your feet. W: Not yet... S: Well if you ever get like athletes foot.. W: I've had athletes foot S: Yeah, well you'd really get it bad, and you must, oh this sounds a bit awful, but you must always wear shoes that are fairly new, never let shoes get old on your feet. If youâ\u0080\u0099re going to wear trainers make sure your feet can breath easily, always wear cotton socks, or maybe cashmere, something like that is natural, and you donâ\u0080\u0099t want man made fibres on your feet, if anything your money needs to be spent on what you put over your feet, and what they go in. (Sally changes from 'Psychic' to 'Doctor' to 'Chiropodist'....) W: Going back to my dad.... S: Yeah.. W: I know Iâ\u0080\u0099m going round the houses here.. S: Absolutely, ask questions, cause when you go you'll regret it W: My Father.. is there anything else you can tell me about him, Christopher... S: Christopher, yeah, and does he live at home with your Mum? (question) W: Yes S: Yeah... is he mobile? (Another question) W: What do you mean by that? S: Does he walk... W: Yes S: You donâ\u0080\u0099t think he's lazy then? (Question) W: I donâ\u0080\u0099t live at home so its hard, he has a job... S: Whatâ\u0080\u0099s he do? (Question... seeing the pattern yet?....) W: He's a QC, a barrister S: (unknown) how weird is that?.. (unknown) Well he's commercial law, I donâ\u0080\u0099t think he's psychic, you mean as a profession? S: (Garbled, talking over each other) Well you're father loves you very much, thereâ\u0080\u0099s absolutely no doubt about that, and he does worry about you your Father, and thereâ\u0080\u0099s a bit like there's a distance, and, I donâ\u0080\u0099t know if its got anything to do with your sexuality, I think its to do with since you were a baby really, since you were very very small, I think that...erm.. were you twins? (Question) W: No.. S: What do you think the disappointment was? (Question, look Sally, he came to YOU for the answers...) W: With him or me? S: Well with him, like about you W: Maybe I wasnâ\u0080\u0099t as academic as he would have liked me to have been S: No.. maybe. An I also think a lot of it was to do with, he could see in you from a very very early age that you were not going to following his footsteps, not that he would have said, \"I want a son to follow in my footsteps\" but he could see very quickly that you were not going to follow in his footsteps.. (A brilliant bit of Psychic work, W has said he reads the news, OBVIOUSLY he has not followed in his Fathers footsteps) W: Was I a disappointment? S: Well.. he would have said at times but would never have admitted it. Who's Nick? Nicholas? (More names, more questions) W: His Brother? S: Yeah... (Once again, Sally has NOT said his fathers brother is called Nicholas, W has said that) W: What can you tell me about Nicholas? S: Well thatâ\u0080\u0099s interesting because, how I sense the energy between you and your Dad, is how I sense the energy between your Dad and Nicholas W: You mean a distance? S: Well... Iâ\u0080\u0099m seeing two things and I've just got to try and explain it to you, yes, but no, I sound like Little Britain here, yes but no but yes a disappointment but it would be something he would be highly ashamed of admitting........ maybe even a hint of jealousy, because he can see in you, ambition that he never got a chance to look at... (He's a QC? He never had chance at ambition?) W: He's done pretty well though.. S: Oh I know, (garbled) he's a QC it goes without saying, but sometimes people can have amazing things that really, thatâ\u0080\u0099s okay, its wonderful that they have achieved that, but they hanker after something totally different W: Iâ\u0080\u0099ve been envious of him b.... S: Well isnâ\u0080\u0099t that ironic, well there you go (No, it's not ironic at all..) W: Cause he's good at everything, musician, sportsman (unknown) S: Yeah, it comes very naturally with him W: Is he proud of me at all? S: Very proud of you, very proud of you, a bit amazed that youâ\u0080\u0099re considering New Zealand. Now I know what your father does, no wonder he's not keen on Frank (Sorry, did we establish he's not keen on Frank?) W: Cause he feels he's a little bit (unknown) S: Well he just looks at Frank and doesnâ\u0080\u0099t think Frank does you any favours, its like he wouldnâ\u0080\u0099t impose his opinion on you, he's been a very good father to you... W: He doesnâ\u0080\u0099t really know Frank, he's met him briefly... S: Yeah, but donâ\u0080\u0099t ever underestimate your father, which I'm sure you donâ\u0080\u0099t W: No, he's a very bright spark S: So, your Father could have met this man for two minutes and remembered everything about him (Yes, briefly, and six years ago) W: What can you tell me about Nicholas? S: Erm.. he makes me smile....So perhaps the level of the family, if you took the family and there would be a level, not in the sense of the word, it would be Nicholas. Is Nicholas a QC as well? (Question) W: He's , a Councillor, not (unknown) S: Well I think Nicholas is someone that, erm he knows, and I donâ\u0080\u0099t want to take anything away from what he's achieved, he knows he could have achieved a lot more, he had the opportunities but he thought no, Id much rather do that, and thatâ\u0080\u0099s you.. W: Yes I understand that. Going back to my Dad, will my Dad be successful S: Well he is successful.. W: Well, will he develop or... S: With your father, your fathers a genius isnâ\u0080\u0099t born a genius heâ\u0080\u0099s like genius, and genius is always evolving, thereâ\u0080\u0099s always something thatâ\u0080\u0099s going to come along to challenge and that they reach the top in, so , your Father was actually born successful, born with erm, not just a silver spoon in his mouth but the ability (unknown) a couple on a housing estate, you know one was a dustman and the other was a cleaner, your Dad still would have achieved what he's achieved W: Any more Family members some to mind? S: Yeah, and you donâ\u0080\u0099t have, thereâ\u0080\u0099s not an adopted child in the family? (Question) W: No, not that I've been told S: Yeah, I pick that up with you.. W: Am I adopted? No..I look really like my Dad.... S: No no what Iâ\u0080\u0099m picking up, its really interesting, is that you'll adopt, or that you'll have children, you know you're going to have two sons, you're Father will be very proud of you (Ah, I forgot, the twin boys...) W: Little Kiwis..... S: Little Kiwis! You will let me know wont you.,.. W: I will, Is there anything coming from Fathers family, Mothers... S: Yes, well your Mothers family is there and you Fathers family is here W: Hmm S: Both of them protect you, both of them are saying how wonderful it is to see you... Is there the name Manny? (Question) W: Thatâ\u0080\u0099s really odd you say that, the last psychic, Iâ\u0080\u0099ve only seen one other psychic, the only thing, one of the things she said didnâ\u0080\u0099t ring true, she said I had a spirit called Manny, but I have no idea who Manny is S: Well he's here (is he really....) W: She said I must know that, I have never, its funny you should mention.. S: Well Manny is on your Fathers side, thereâ\u0080\u0099s no one called manual, Emmanuel? Could you ask your Father.. W: Yes I will.... S: Cause Manny's here...he says, \"don't you leave me out, tell him Manny's here\" (But 'Manny fails to mention WHO he is. I would have normally given this a 'hit' but due to the fact that so far Sally has thrown in 26 names, I'm putting it down purely to coincidence.) W: Well, thatâ\u0080\u0099s odd... S: But you've got huge success, when you finishing filling out these papers then? (question) W: Well I'm flying to Sydney, beginning of March and Iâ\u0080\u0099m to New Zealand for about two weeks to check out the work market and have a couple of interviews, than back to Australia for a couple of weeks, and then back here, finish all the paperwork and if I can get work I should get residency S: Do you do a phone in show at the moment (question) W: I read the news, but I'd love to do a phone in show S: Well youâ\u0080\u0099re going to do one where you speak to the public (A phone-in show where he speaks to the public? That'll be opposed to a phone-in show where nobody calls...) W: Hmm.. well I read the news now.... S: But I donâ\u0080\u0099t think youâ\u0080\u0099re just going to read the news I think W: (unknown) S: Yeah... W: Will I make it in New Zealand? S: Oh God yeah... You'll have this amazing home, you are going to own this home, eventually you are going to have this massive home overlooking the sea, like the ocean.. W: Its amazing.. W: Anything else you can tell me? S: I think we've covered everything... W: I think we have.. S: You are just, I think you've got lovely friends W: they are lovely people, I choose my friends well.. S: yeah.. tell Frank he must be very careful with a motorbike W: I will S: Does he ride pillion? with a friend (unknown) with a motorbike (Question) W: He used to ride motorbikes when he was a lot, lot younger, going back 15, 20 years S: Well thereâ\u0080\u0099s someone who has a motorbike and Frank will say, might say, lets have a go on it, he needs to be careful, he's not as agile as he used to be S: Donâ\u0080\u0099t go and have any tattoos, as you suffer from allergies W: I was thinking about getting a tattoo hmmm S: I think if youâ\u0080\u0099re going to have a tattoo, its got to, you've got to really check out the cleanliness, what also the alcohol, I donâ\u0080\u0099t have a tattoo, I donâ\u0080\u0099t know how they do them really.. W: I do have a lot of allergies S: Well the its the alcohol you're going to be allergic to W: Well I donâ\u0080\u0099t drink, Iâ\u0080\u0099m Tee total so.. (being tee total has little to do with having an alergic reaction to a tattoo) S: Well (garbled) you could be allergic to, you could have an arm or whatever, go whoosh! W: So I'll avoid that End. Meercat}",
    "textBeforeTable": "Good expose. One small point: Its the Isle of Wight, not White.  Re: An Analysis Of Sally Morgan Reading Of William Brough... Posts: 14 From: Joined: 2006/12/31 Just popping in Updated: 2008/2/11 11:09 Posted: 2008/2/11 11:05   DrPL Thread Poster The comments are owned by the poster. We aren't responsible for their content. FlatThreadedNested Oldest FirstNewest First margin-right:3px;\"> margin:3px;\">",
    "textAfterTable": "Poster Thread meercat Posted: 2008/2/11 11:19   Updated: 2008/2/11 12:25 Quite a regular Joined: 2006/12/2 From: Posts: 68  Re: An Analysis Of Sally Morgan Reading Of William Brough... Yeah yeah, blame the Meercat as always, maybe it was word blindness and temporary insanity after spending 7 hours transcribing this!! Poster Thread jmclegg Posted: 2008/2/11 12:15   Updated: 2008/2/11 12:26 Just popping in Joined: 2008/2/4 From: Posts: 5  Re: An Analysis Of Sally Morgan Reading Of William Brough...",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}