{
    "relation": [
        [
            "Stock#",
            "GAR 101F",
            "GAR 101S-12",
            "GAR 101S-24",
            "GAR 101S-37",
            "GAR 101S-6",
            "GAR 102F",
            "GAR 102S-12",
            "GAR 102S-24",
            "GAR 102S-37",
            "GAR 102S-6"
        ],
        [
            "Description / Number Pieces Per Pack",
            "37\" Phantom O Flexible Straight/Plastic Ties/Tinplate (12 Pcs.) WAS $130 NOW ONLY $104",
            "12.4\" Phantom O Rigid Straight/Plastic Ties/Tinplate (12 Pcs.) WAS $60 NOW ONLY $48",
            "24.8\" Phantom O Rigid Straight/Plastic Ties/Tinplate (12 Pcs.) WAS $100 NOW ONLY $80",
            "37\" Phantom O Rigid Straight/Plastic Ties/Tinplate (12 Pcs.) WAS $141 NOW ONLY $113",
            "6.2\" Phantom O Rigid Straight/Plastic Ties/Tinplate (12 Pcs.) WAS $41 NOW ONLY $33",
            "37\" Phantom O Flexible Straight/Plastic Ties/Stainless (12 Pcs.) WAS $140 NOW ONLY $112",
            "12.4\" Phantom O Rigid Straight/Plastic Ties/Stainless (12 Pcs.) WAS $65 NOW ONLY $52",
            "24.8\" Phantom O Rigid Straight/Plastic Ties/Stainless (12 Pcs.) WAS $108 NOW ONLY $87",
            "37\" Phantom O Rigid Straight/Plastic Ties/Stainless (12 Pcs.) WAS $150 NOW ONLY $120",
            "6.2\" Phantom O Rigid Straight/Plastic Ties/Stainless (12 Pcs.) WAS $45 NOW ONLY $36"
        ],
        [
            "SALE PRICE",
            "$103.99",
            "$47.99",
            "$79.99",
            "$112.99",
            "$32.99",
            "$111.99",
            "$51.99",
            "$86.99",
            "$119.99",
            "$35.99"
        ],
        [
            "# Packs Ordered",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Hobby Surplus Sales - Traditional Hobbies at Discounts of 20-75%",
    "title": "",
    "url": "http://www.hobbysurplus.com/gargravesO.asp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00260-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 503917747,
    "recordOffset": 503901402,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{148846=|  Check Out | How To Order | Shipping Policies | Guarantee | Contact Us |      ©2012 Amatos, 112063=O Phantom Line Remote Control Switches with Upgraded DZ2500 Switch Motors, 34195=NOTE Extra Shipping Fees May Apply: When ordering 2 or more packs, an additional S&H fee will be applied for every 2 packs of curved or sectional track shipped. This extra amount will not show as part of your order summary total emailed in your order confirmation but will be added when your order is invoiced and charged upon shipment., 87814=NOTE Extra Shipping Fees May Apply: When ordering 6 or more switches, an additional S&H fee will be applied for every 6 switches shipped. This extra amount will not show as part of your order summary total emailed in your order confirmation but will be added when your order is invoiced and charged upon shipment., 125320=NOTE Extra Shipping Fees May Apply: When ordering more than 6 sections an additional S&H fee will be applied for every 6 sections shipped. This extra amount will not show as part of your order summary total emailed in your order confirmation, but will be added to your order total when your order is invoiced and charged upon shipment., 3063=Sat. Aug 1, 28782=NOTE Extra Shipping Fees May Apply: A S&H fee will be applied for every pack of wooden tied track shipped. This extra amount will not show as part of your order summary total emailed in your order confirmation but will be added when your order is invoiced and charged upon shipment.}",
    "textBeforeTable": "NOTE Extra Shipping Fees May Apply: A S&H fee will be applied for every pack of wooden tied track shipped. This extra amount will not show as part of your order summary total emailed in your order confirmation but will be added when your order is invoiced and charged upon shipment. Phantom Track with Wooden Ties- 10 or 50 Pieces Per Pack The 3 foot flexible track is made with stained basswood ties and can easily be bent to the radius curve that you desire. Learn all about using Gargraves track on your layout with this new video.. Phantom Line Flexible 37\" Long Flexible Trackage with Wood Ties   If you want a more realistic and scale looking  layout for your O Gauge trains GARGRAVES TRACKAGE is your answer.  The 3 rail O gauge track features a blackened center rail that almost disappears into the roadbed and realistically sized and spaced ties. The blackened center rail is tinplated steel, choose either tinplated steel outside rails or stainless steel outside rails.  Stainless rails",
    "textAfterTable": "106\"Dia. Circle Phantom O Tinplate/wood ties (12 Pcs.) WAS $138 NOW ONLY $111 $110.99 GAR WT-106-102 106\"Dia. Circle Phantom O Stainless/wood ties (12 Pcs.) WAS $148 NOW ONLY $119 $118.99 GAR WT-113-101 113\"Dia. Circle Phantom O Tinplate/wood ties (16 Pcs.) WAS $148 NOW ONLY $119 $118.99 GAR WT-113-102 113\"Dia. Circle Phantom O Stainless/wood ties (16 Pcs.) WAS $159 NOW ONLY $127 $126.99 GAR WT-120-101 120\"Dia. Circle Phantom O Tinplate/wood ties (16 Pcs.) WAS $153 NOW ONLY $123 $122.99",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}