{
    "relation": [
        [
            "Domain Created On",
            "2005-10-16",
            "9 years, 284 days old"
        ],
        [
            "Last Modified On",
            "2014-08-28",
            "0 years, 333 days ago"
        ],
        [
            "Expires On",
            "2015-10-16",
            "0 years, 80 days from today"
        ]
    ],
    "pageTitle": "dvlotteryhelp.com DV-Lottery Registration DV-2016.Results DV-2015, 2014, 2013 | SEOCert",
    "title": "",
    "url": "http://www.seocert.net/analyzer.dvlotteryhelp.com",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00275-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 699984923,
    "recordOffset": 699966251,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4139=IP address of dvlotteryhelp.com is : 75.127.114.162. The domain dvlotteryhelp.com was created on 2005-10-16 and it is 9 years, 284 days old. It will expire on 2015-10-16 which is 0 years, 80 days from today. The homepage of website dvlotteryhelp.com has a size of 16326 bytes, and a text size of 4072 bytes, its Text to Code Ratio is 33.23% Homepage of dvlotteryhelp.com has 76 links, 71 link to internal pages, while 5 link to pages on other websites. It takes 0.23 s ( 70.71 Kb/s ) to load the website dvlotteryhelp.com.}",
    "textBeforeTable": "DV-Lottery Registration DV-2016.Results DV-2015, 2014, 2013 Words count: 5    Unique Words: 4    Length: 59 characters [ To optimize the page title, Use this SEO Title Optimizer ] : Title Content Analysis Register To View All >> the 33 recommended tasks to improve your SEO performance. ... Implement browser caching for your site. Implement HTTP compression for your site. Host the site closer to the geo location where most of your site visitors come from. Reduce the number of domains hosted on the same server of your site dvlotteryhelp.com. Add more high page-rank back-links to your site. Get rid of the 45 errors and 21 warnings from W3C validation. Create blog entries. Configure the server so that your site IP http://75.127.114.162 is redirected to the site domain name dvlotteryhelp.com. Configure the server so that your site with or without 'www' (http://www.dvlotteryhelp.com, http://dvlotteryhelp.com) are resolved to the same URL. Remove the 2 plain text email address from your (adsbygoogle = window.adsbygoogle || []).push({});",
    "textAfterTable": "Tips: 1. ideally, the title should contain 10 to 70 characters, including spaces. (Google displays up to 70 characters in the title, and takes into account only the first 12 words.) 2. put the most important and relevant keywords in the title, try not to repeat any word. 3. each individual page should have a unique title. Description : USA Governmetn program DV-2016, 2015, 2014, 2013 Results. Green card. Affidavit of support, visa fees, opening date Words count: 14    Length: 115 characters [ To optimize the page description, Use this SEO Meta Description Optimizer ] Excellent! Your meta description contains between 70 and 160 characters. Meta Descriptions provide concise explanations of the contents of web pages, that are commonly used by search engines on search result pages to display preview snippets for a given page. Tips: 1. it is best to keep meta descriptions between 70-160 characters. 2. a readable, compelling description using important keywords can draw a much higher click-through rate of searchers to the given web page. 3. avoid keyword stuffing, ensure each page has its own unique description. Google SERP Preview : DV-Lottery Registration DV-2016.Results DV-2015, 2014, ... www.dvlotteryhelp.com/",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}