{
    "relation": [
        [
            "Patent application number",
            "20140191240",
            "20140231816",
            "20150021667"
        ],
        [
            "Description",
            "High Electron Mobility Transistor and Method of Forming the Same - A High Electron Mobility Transistor (HEMT) includes a first III-V compound layer having a first band gap, and a second III-V compound layer having a second band gap over the first III-V compound layer. The second band gap is smaller than the first band gap. The HEMT further includes a third III-V compound layer having a third band gap over the second III-V compound layer, wherein the third band gap is greater than the first band gap. A gate electrode is formed over the third III-V compound layer. A source region and a drain region are over the third III-V compound layer and on opposite sides of the gate electrode.",
            "HIGH ELECTRON MOBILITY TRANSISTOR AND METHOD OF FORMING THE SAME - A High Electron Mobility Transistor (HEMT) includes a first III-V compound layer having a first band gap, and a second III-V compound layer having a second band gap over the first III-V compound layer. The second band gap is greater than the first band gap. A crystalline interfacial layer is overlying and in contact with the second III-V compound layer. A gate dielectric is over the crystalline interfacial layer. A gate electrode is over the gate dielectric. A source region and a drain region are over the second III-V compound layer, and are on opposite sides of the gate electrode.",
            "High Electron Mobility Transistor and Method of Forming the Same - A semiconductor structure includes a first III-V compound layer. A second III-V compound layer is disposed on the first III-V compound layer and is different from the first III-V compound layer in composition. A carrier channel is located between the first III-V compound layer and the second III-V compound layer. A source feature and a drain feature are disposed on the second III-V compound layer. A gate electrode is disposed over the second III-V compound layer between the source feature and the drain feature. A fluorine region is embedded in the second III-V compound layer under the gate electrode. A diffusion barrier layer is disposed on top of the second III-V compound layer. A gate dielectric layer is disposed over the second III-V compound layer. The gate dielectric layer has a fluorine segment on the fluorine region and under at least a portion of the gate electrode."
        ],
        [
            "Published",
            "07-10-2014",
            "08-21-2014",
            "01-22-2015"
        ]
    ],
    "pageTitle": "Po-Chun - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/po-chun-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00140-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 439994237,
    "recordOffset": 439977843,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Po-Chun Liu, Hsin-Chu TW 10-21-2010 Protection Circuit and Power Supply System for Flash Memory - A protection circuit, applied to a flash memory including a power supply pin, includes a capacitor and a switch. A power supply provides a reference voltage. The capacitor is electrically connected to the power supply pin and a ground point. The switch is electrically connected between the power supply pin and the power supply. When the reference voltage is higher than a threshold voltage, the switch is turned on, such that the reference voltage is inputted into the power pin via the switch. When the reference voltage is lower than the threshold voltage, the switch is turned off. 20100265785 Published Description Patent application number Po-Chun Kuo, Hsinchu Hsien TW 09-18-2008 ELECTRIC GRILL AND METHOD OF USING SAME - An electric grill includes at least one grill pan having a first heating member, a second heating member, and a temperature sensing member for measuring the temperature of the grill pan; and the first heating member, the second heating member and the temperature sensing member connect with a control circuit. The temperature sensing member provides a temperature signal for the control circuit, and the control circuit controls the power on/off of the first heating member and the second heating member. 20080223847 09-11-2008 GRILL DEVICE WITH A REMOVABLE GRILL PLATE - A grill member of a grill device includes a",
    "textAfterTable": "Po-Chun Liu, Hsinchu City TW Patent application number Description Published 20130099243 SUBSTRATE BREAKDOWN VOLTAGE IMPROVEMENT FOR GROUP III-NITRIDE ON A SILICON SUBSTRATE - A circuit structure includes a substrate, a nucleation layer of undoped aluminum nitride, a graded buffer layer comprising aluminum, gallium, nitrogen, one of silicon and oxygen, and a p-type conductivity dopant, a ungraded buffer layer comprising gallium, nitrogen, one of silicon and oxygen, and a p-type conductivity dopant without aluminum, and a bulk layer of undoped gallium nitride over the ungraded buffer layer. The various dopants in the graded buffer layer and the ungraded buffer layer increases resistivity and results in layers having an intrinsically balanced conductivity. 04-25-2013 20130112939 NEW III-NITRIDE GROWTH METHOD ON SILICON SUBSTRATE - A circuit structure includes a substrate and a patterned dielectric layer over the substrate. The patterned dielectric layer includes a plurality of vias; and a number of group-III group-V (III-V) compound semiconductor layer. The III-V compound semiconductor layers include a first layer in the vias, a second layer over the first layer and the dielectric layer, and a bulk layer over the second layer. 05-09-2013 20130140525 GALLIUM NITRIDE GROWTH METHOD ON SILICON SUBSTRATE - A semiconductor structure includes a silicon substrate; more than one bulk layer of group-III/group-V (III-V) compound semiconductor atop the silicon substrate; and each bulk layer of the group III-V compound is separated by an interlayer. 06-06-2013 20140001439 Graded",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}