{
    "relation": [
        [
            "Patent application number",
            "20090327319",
            "20100064296",
            "20120324379"
        ],
        [
            "Description",
            "HYBRID DATA MODEL AND USER INTERACTION FOR DATA SETS IN A USER INTERFACE - A first data model in which a large dataset is stored is maintained, wherein a first set of operations is allowed to be performed on the first data model. The first data model is reduced to a second data model that is of a smaller size than the first data model. Selected operations of the first set of operations are restricted from being performed on the second data model. A second set of operations is performed on the second data model, wherein the second set of operations is a subset of the first set of operations, and wherein the second set of operations does not include the selected operations that have been restricted from being performed on the second data model.",
            "GENERATING INFORMATION ON APPLICATION TASKS FOR COMPONENT OBJECTS GROUPED IN A COMPOSITE OBJECT - Provided are a method, system, and article of manufacture for generating information on application tasks for component objects grouped in a composite object. A composite object in a computer readable medium is comprised of component objects, wherein different application tasks are used to process the component objects. Metadata associates the application tasks for the component objects grouped in the composite object with the composite object. An operation is performed on the composite object by processing the metadata indicating the application tasks for the component objects grouped in the composite object on which the operation is performed.",
            "GENERATING INFORMATION ON APPLICATION TASKS FOR COMPONENT OBJECTS GROUPED IN A COMPOSITE OBJECT - Provided are a method, system, and article of manufacture for generating information on application tasks for component objects grouped in a composite object. A composite object in a computer readable medium is comprised of component objects, wherein different application tasks are used to process the component objects. Metadata associates the application tasks for the component objects grouped in the composite object with the composite object. An operation is performed on the composite object by processing the metadata indicating the application tasks for the component objects grouped in the composite object on which the operation is performed."
        ],
        [
            "Published",
            "12-31-2009",
            "03-11-2010",
            "12-20-2012"
        ]
    ],
    "pageTitle": "Bertram, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/bertram-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00121-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437812375,
    "recordOffset": 437786264,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Randal Lee Bertram, Raleigh, NC US //]]> BarDraw('3274930',['Patent applications by Randal L. Bertram, Raleigh, NC US'],[[1,1,2,1,6,1]],['2005','2007','2008','2009','2014','2015'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3274930\" align=\"center\"></div> </div> <canvas id=\"bg3274930\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Randal L. Bertram, Raleigh, NC US</p> <div class=\"bar3274930\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>01-15-2015</td> <td><a href=\"/patents/app/20150020046\">LOGGING AND PROFILING CONTENT SPACE DATA AND COVERAGE METRIC SELF-REPORTING</a> - A computer-implemented method for generating user stories for a software product, includes collecting, by a processor, a plurality of requirements, creating, by the processor, a plurality of content space specification files that includes the plurality of requirements, processing, by the processor, the plurality of content space specification files to generate the user stories that are related to real time data of the software product, defining, by the processor, a content space, mapping, by the processor, the user stories to the content space and embedding, by the processor, the content space with the software product, wherein user stories include at least one of real time log data, profile statistics data, and coverage metric self-reporting data.</td> <td>20150020046</td> <tr> </tr> <td>12-11-2014</td> <td><a href=\"/patents/app/20140365427\">SMART POLLING FREQUENCY</a> - For smart polling frequency in datastores by a processor device in a computing environment, individual polling operations are performed for refreshing each one of the datastores according to polling frequencies. Each one of the polling frequencies depends on recent system activity and each one of the datastores. Each of the polling frequencies are dynamically",
    "textAfterTable": "Patent applications by Randal Lee Bertram, Raleigh, NC US Raymond A. Bertram, Austin, TX US Patent application number Description Published 20090077286 DATA BUS INVERSION DETECTION MECHANISM - A bus inversion apparatus includes exclusive-OR gates and an inversion detector. The exclusive-OR gates are coupled to an instant data bus and a last data bus. The data buses have a corresponding plurality of bits, where the exclusive-OR gates perform a bitwise comparison of the data buses, and provide an exclusive-OR bus. The states of the exclusive-OR bus indicate whether corresponding bits of the data buses are different. The inversion detector counts the number of the corresponding bits that are different, and indicates that the instant data bus should be inverted. The inversion detector has a plurality of left shift circuits, each configured to perform a logical left shift of input bits as directed by the states of shift bits, where outputs of the each of the plurality of left shift circuits indicate a number of a subgroup of the corresponding bits that are different. 03-19-2009 20100073073 MICROPROCESSOR WITH SUBSTRATE BIAS CLAMPS - A microprocessor including a substrate bias rail providing a bias voltage during a first operating mode,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}