{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "JWU has many career options for all types of people. From Culinary Arts/ Baking & Pastry Arts, to becoming a CIA agent, to majoring in fashion, the possibilities seem endless.",
            "Make sure you have all your information straight. You don't want to begin the new year confused and have unanswered questions. There are several people who can help try to solve your educational problems.",
            "JWU is a bit pricey but so worth it. The expression you get what you pay for definitely apply's here.",
            "The people are friendly, the activities are endless, and the teachers are amazing.",
            "The transition into college is a difficult thing but, JWU made sure i was all set for the new school year. The transition was smooth and the information was very clear."
        ]
    ],
    "pageTitle": "Johnson & Wales University-North Miami Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Johnson-Wales-University-Florida/reviews?_escaped_fragment_=/show/48563",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899550115,
    "recordOffset": 899490859,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17384=i go in july and heard its an amazing school, 269320=© 2015, Cappex.com, LLC, 167250=Traditions we have a christmas party for the school in december. alot of other great activities, 105333=depending on the dorm, they can be very old from back before when the school was a hospital to the brand new ones that just opened up this 2011-2012 school year. some are apartment style dorms while the others are all within the same building., 215868=For Johnson & Wales University all i can say is absolutely amazing! I was supposed to attend back in 2011 and I will say this is my dream school. Everything about JWU was breath taking. The small classes, the campus itself was beautiful, the amount of activities you could do while on campus was perfect. I wish i could have attended but i did not have enough money to attend. Although the school tuition is expensive i would say it would be worth it. Nothing about this school was bad on my weekend visit to see the school I fell in love with it. In two days JWU showed me what a dream school school would be like.}",
    "textBeforeTable": "03/02/2010 Reviewer is A current student here. 23 out of 23 people found this review useful. 1 of 65 Raqiba from Miami, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Login to rate or flag the reviews Toni-anne from fort lauderdale, FL 12/08/2009 Reviewer is A current student here. 18 out of 20 people found this review useful. 1 person found this inaccurate. 2 of 65 Categories Comments Great for these types of students FASHION, COOKING AND ALSO TRAVLING Tips for prospective students IF YOUR LOOKING FOR A WONDERFUL COOKING SCHOOL WITH A SMALL AMOUNT OF STUDENTS JOHNSON & WALES IS FOR YOU. Bang for the buck THE SCHOOL IS VERY COSTLY , BUT I CAN SAY YOU DO GET ALOT FOR YOUR MONEY. Am enjoying being here I DON'T STAY ON CAMPUS SO IT'S HARD TO ENJOY MOST OF THE THINGS THEY OFFER, BUT THEY ALWAYS HAVE SOMTHING GOING ON IN THE DAY. VERY HELPFUL KIDS ALSO. I ENJOY GOING TO SCHOOL EVERY DAY. Am learning a lot",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}