{
    "relation": [
        [
            "Name",
            "Gilmour Boa",
            "Walter Ewing",
            "George Genereux",
            "Susan Nattrass",
            "Gerald Ouellette",
            "John Primrose",
            "Linda Thom"
        ],
        [
            "Category",
            "Athlete",
            "Athlete",
            "Athlete",
            "Athlete",
            "Athlete",
            "Athlete",
            "Athlete"
        ],
        [
            "Year Inducted",
            "1955",
            "1955",
            "1953",
            "1975",
            "1957",
            "1975",
            "1985"
        ]
    ],
    "pageTitle": "Canadian Olympic Hall of Fame | Official Canadian Olympic Team Website | Team Canada | 2014 Winter Olympics",
    "title": "",
    "url": "http://olympic.ca/canadian-olympic-hall-of-fame/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00223-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 173067111,
    "recordOffset": 173035217,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17736=In 2012, Olympic heroes Jean-Luc Brassard (Freestyle Skiing), Daniel Igali (Wrestling), Beckie Scott (Cross-Country Skiing) the 2006 women’s hockey team and 2010 men’s hockey team, as well as (Synchronized Swimming) coach Julie Sauvé and builder Sarah Burke (Freestyle Skiing) were inducted into the Canadian Olympic Hall of Fame. In addition, past Canadian Olympic Committee President Michael Chambers received the Canadian Olympic Order., 134271=On the final day of competition at Toronto 2015 Canada added to its record medal haul, winning three more medals,…, 138452=RT @DivingPlongeon: #Kazan2015 3M Final: Good luck/Bonne chance @JennAbel91 & @PamelaWare1! You got this girls, vous êtes les meilleures! h… 3 hours ago Follow @TeamCanada, 24196=The 2012 Canadian Olympic Hall of Fame Gala Dinner and Induction Ceremony took place September 21 at Toronto’s Air Canada Centre, capping off a week of activities from Ottawa to Toronto., 155467=RT @DivingPlongeon: #Kazan2015 3M Final: Good luck/Bonne chance @JennAbel91 & @PamelaWare1! You got this girls, vous êtes les meilleures! h…, 14188=The 2014 Canadian Olympic Hall of Fame Gala and Induction Ceremony presented by RBC will take place in the city of Calgary. This year’s inductees, which were announced April 2, 2014, include:, 16506=“It is such an honour to be named as an inductee to the Canadian Olympic Hall of Fame,” said Kyle Shewfelt, three-time Olympian and Athens 2004 Olympic gold medallist. “It had been my dream to compete as an Olympian for as long as I could remember, so to be recognized in this way for my Olympic accomplishments is so special.”, 22770=“Sarah was one of those extraordinary women who believed that anything was possible,” said Burke’s mother Jan Phelan. “I think that her belief not only helped her succeed, but inspired others to be the best that they could be. I know that Sarah would be happy that all she worked for and sought to achieve is being honoured with her induction into the Canadian Olympic Hall of Fame., 157542=By sharing our athletes’ stories, we inspire all Canadians through the power of sport. Follow the journey on Facebook, Twitter, Instagram, LinkedIn, Google+, and YouTube. © 2015 Canadian Olympic Committee. All Rights Reserved. Contact Us. Privacy Policy. Terms of Use, 22340=“The 2006 women’s team and the 2010 men’s team were both very special, taking on the world and winning,” said Bob Nicholson, Hockey Canada President and Chief Executive Officer. “Those two teams belong enshrined with the very best in Canadian Olympians and I applaud their induction into the Canadian Olympic Hall of Fame.”, 21725=“The 2006 Olympic team was probably the most talented Team Canada I ever played on,” said team captain Cassie Campbell-Pascall. “We had a great group of veterans and there was an influx of great young talent. To win gold in a convincing fashion was the product of so much passion and commitment from every single player and staff member. It’s hard to believe 6 years have passed already, but this is an honor for our team to be singled out like this as inductees to the 2012 Canadian Olympic Hall of Fame.”, 17139=The Canadian Olympic Hall of Fame Gala and Induction Ceremony form part of the Celebration of Excellence, a three-day celebration (June 4th – 6th ) to celebrate Canada’s tremendous successes within the Olympic Movement., 17379=Proceeds from the Hall of Fame Gala in Calgary will go to the Canadian Olympic Foundation as well as a legacy coaching program in Calgary to support the next generation of Olympians. The 2012 Hall of Fame Gala in Toronto raised more than $3 million for high performance sport and athletes in Canada.}",
    "textBeforeTable": "Alpine Skiing Members of the Canadian Olympic Hall of Fame The 2012 Canadian Olympic Hall of Fame Gala Dinner and Induction Ceremony took place September 21 at Toronto’s Air Canada Centre, capping off a week of activities from Ottawa to Toronto. “It has been my good fortune to personally experience and see the incredible power for good that is brought to this world by the Olympic Rings,” said Chambers. “It has been my privilege, through those Rings, to help bring about positive change for Canadian athletes and coaches from all regions and corners of our country. It has been an honour to serve these many years, just as it is now an honour to be named to the Canadian Olympic Order.” “Coaching the national team for 30 years, through so many amazing athletes, routines, and competitions has been as fulfilling a career as one could dream of,” said Sauvé. “Today, I am truly honoured that I will join so many others whose career has been shaped by a continued search for excellence, both in others and in themselves.” “Sarah was one of those extraordinary women who believed that anything was possible,” said Burke’s mother Jan Phelan. “I think that her belief not only helped her succeed, but inspired others to be the best that they could be. I know that Sarah would be happy that all she worked for and sought to achieve is being honoured with her induction into the Canadian Olympic Hall",
    "textAfterTable": "Karen Percy-Lowe Athlete 1995 Steve Podborski Athlete 1985 Ken Read Athlete 1984 Gerry Sorensen Athlete 1983 Lucile Wheeler Athlete 1958 Rhoda Wurtelle (Eaves) Athlete 1953 Aquatics - Diving Name Category Year Inducted George Athans Sr. Athlete 1953 Sylvie Bernier Athlete 1985 Beverley Boys Athlete 1987 Donald Dion Coach 2000 Eldon Godfrey Builder 2003 Irene MacDonald Athlete 1976 Anne Montminy Athlete 2005 Annie Pelletier Athlete 2003 Alfred Phillips Athlete 1976 Donald Webb Builder 1993 Aquatics - Swimming Inductees Name Category Year Inducted Alex Baumann Athlete 1985 Munroe Bourne Athlete 1972 George Burleigh Athlete 1976 Leslie Cliff Athlete 1997 Angela Coughlin (Arusoo) Athlete 1977 Victor Davis Athlete 1985 Phyllis Dewar (Lowery) Athlete 1972 Howard Firby Coach 2009 Nancy Garapick Athlete 1993 George Gate Coach 2002 Cheryl Gibson Athlete 2001 Phyllis Haslam Athlete 1977 Paul Hauch Builder 1975 George Hodgson Athlete 1949 Ralph Hutton Athlete 1972 Marianne Limpert Athlete",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}