{
    "relation": [
        [
            "First Name",
            "Janice",
            "Sam"
        ],
        [
            "Last Name",
            "Oliver",
            "Loesche"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=771AE6DB-8C23-421B-8F3E-57EB3AF9B7A7&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00232-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 227588108,
    "recordOffset": 227579906,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12258=H.R. 2642 & H.R.1947 Federal Agriculture Reform and Risk Management Act; H.R. 5954 Agriculture Reform, Food and Jobs Act of 2013., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 36942=Independent contractors and taxation: worker misclassification; S. 1706, Fair Playing Field Act of 2013. Tax exclusion for employer sponsored health insurance plans. Tax Expenditures & Tax Reform. S. 410/ H.R 880, the Wall Street Trading and Speculators Tax Act. Corporate Tax Reform. Repatriation Issue. S. 1533, Stop Tax Haven Abuse Act. Tax Extenders. Carried in Trust., 17691=H.R. 2385, CFPB Pay Fairness Act; H.R. 2446, The Responsible Consumer Protection Act; H.R. 3519, Bureau of Consumer Financial Protection Accountability and Transparency Act; H.R. 3193, Consumer Financial Protection Safety and Soundness Improvement Act., 25831=S. 744, The Border Security, Economic Opportunity, and Immigration Modernization Act; H.R. 1773, Agricultural Guest Worker Act. H.R. 15, The Border Security, Economic Opportunity, and Immigration Act., 47794=S. 1476 Stop Subsidizing Multi-Million Dollar Corporate Bonuses Act. Proposed SEC Rulemaking on corporate political disclosures. H.R. 3970, Stop Subsidizing Multi-million Dollar Corporate Bonuses Act. S. 1282, 21st Century Glass-Steagall Act., 22829=Chemical Facility Anti-Terrorism Standards (CFATS); DHS Risk-Based Performance Standards, Personal Surety Regulations; Background checks for workers. H.R. 2999 Accurate Background Check Act of 2013; H.R. 2865, Fairness and Accuracy in Employment Background Checks Act of 2013., 28079=Wage & Hour enforcement; worker misclassification & independent contractors. S. 1687, Payroll Fraud Prevention Act of 2013. Project labor agreements; prevailing wage/ Davis-Bacon Act. H.R. 2083/ S. 1596, Protecting Students from Sexual and Violent Predators Act. H.R. 180, National Blue Alert Act of 2013. S. 84/ H.R. 377, Paycheck Fairness Act. DOL Authority regarding \"hot goods\" provision of FLSA Sec. 215(a) (1). S. 1737, Minimum Wage Fairness Act. Apprenticeship programs and job training. H.R. 4320, Workplace Democracy and Fairness Act. H.R. 4321, Employee Privacy Protection Act., 50701=S. 1747, S. 1845, H.R. 3546, H.R. 3979. Emergency Unemployment Compensation Extension Act and Senate amendments 2631, 2632, 2633, 2634, 2635, 2714, 2874, 2878., 55068=Support for H.R. 4217/ S. 2075, Military Commissary Sustainment Act., 39937=H.R. 3040, Safe Freight Act. H.R. 1906, Safe Highways and Infrastructure Preservation Act of 2013., 19977=Taft-Hartley multi-employer health care plans & implementation of the Affordable Care Act. Affordable Care Act: qualified health plan issue; exchanges. Transitional reinsurance program. H.R. 2575, Save American Workers Act., 45479=Truck Size and Weight. Mexican Truck Pilot Program. H.R. 3403/ S. 1625, Drug Free Commercial Driver Act of 2013; H.R. 3413, TRUE Safety Act; Department of Transportation's Comprehensive Truck Size and Weight Study., 42074=S.1900/ H.R. 3830, Bipartisan Congressional Trade Priorities Act of 2014; Trans Pacific Partnership Trade Negotiations; Transatlantic Trade & Investment Partnership., 14469=Fiscal Year 2014 Appropriations for Departments of Labor, HHS, Education, and related agencies: Funding for Wage and Hour division, DOL UI worker misclassification project, OSHA, National Labor Relations Board, National Mediation Board. Continuing appropriations for FY 2014. FY 2015 President's budget request. FY 2015 funding for Departments of Labor (Wage and Hour Division, DOL UI worker misclassification project, OSHA); National Labor Relations Board; and National Mediation Board. President's budget proposal for TVA. Infrastructure Budget.}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20001 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  FREDERICK P. MCLUCKIE  2026248741  fmcluckie@teamster.org 5. Senate ID#  19855-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}