{
    "relation": [
        [
            "Day",
            "Mon",
            "Tue",
            "Wed",
            "Thu",
            "Fri",
            "Sat",
            "Sun"
        ],
        [
            "Drink Special",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--"
        ],
        [
            "Food Special",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--"
        ]
    ],
    "pageTitle": "Al Capone's Hideaway: Chicago Bar Project Review by Sean Parnell",
    "title": "",
    "url": "http://www.chibarproject.com/Reviews/AlCapone's/AlCapone's.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00317-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 361459311,
    "recordOffset": 361447253,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{37656=Al Capone's is a fun place and we had a great time, in a similar manner to the Safe House in Milwaukee, though the Hideaway lays it on thick with the gangster theme. This seems to be the raison d'être of Alphonse Capone Enterprises of 2222 S. Wabash run by Bill Brooks. This outfit is the same as behind such cleverly named vices as, \"Roaring 20s Beer, Wine and Spirits\" (name of the microbrewery and purveyors of Tommy Guns Vodka), \"Speakeasy Cigar Co.,\" and \"Bootleggers [flavored] Cigars.\" The merchandising never ends... If you're looking for authenticity, you'll find it in the building itself and some of the decor, but the rest is a lot of window dressing that I would say is more for kids if it weren't for the adult themes of booze, steaks and smokes. For those that may be put upon by too much Capone, I would recommend the Green Mill, Twin Anchors and even Butch McGuire's for that former speakeasy and Prohibition Era feel. Chicago Bar Project recommendation: head to Al Capone's Hideaway during daylight hours (at least twilight), so you don't get lost or have to wait an hour even if you have a reservation (Saturdays especially). For more information, check out the Al Capone's Hideaway website. And remember, you can always get further with a smile, a kind word and a gun, than just a smile and a kind word., 29650=The establishment at this bend of the Fox River between Elgin and St. Charles started out as Reitmayer's Beer Garden in 1917. Once Prohibition descended upon this great land in 1920, old Reitmayer himself brewed his own beer, \"...in a hidden cellar behind the chicken coop and pumped it to their thirsty Prohibition Era patrons through an intricate copper tubing system that remains underground to this day,\" according to the Al Capone's Hideaway website. Al Capone's connection to the place now named for him is as murky as the Fox after a storm, though locals say he used the place to \"lay low\" as a patron when the heat got too strong in the City of Big Shoulders, rather than owning the place as he ran a bootlegging and prostitution empire, not an out-of-the-way tavern. Whatever the case, he was there and the Hideaway is a living museum in his name.}",
    "textBeforeTable": "Al Capone's Hideaway 35W337 Riverside Dr. St. Charles, IL 60174 (888) SCARFACE   Written by Sean Parnell   © The Chicago Bar Project  ",
    "textAfterTable": "Wind your way through the woods of Valley View, a fancy name for unincorporated St. Charles that is 40 miles due west of Chicago, and follow the tiny signs stapled to utility poles pointing the way from Route 25. If you're lucky, you'll see the gray wooden barn-like structure, nicely appointed with white trim, nestled amongst the pines after you barrel down a steep hill and make a right angle left turn (or else wind up in the Fox River). A gravel parking lot sprawls out upon the south bank of the Fox, but you'll be parking at the end of it as the vanity plates on the cars parked up front indicate that the owners park there and they're not ashamed to flaunt it. Motorcycles have their own little spot just to the right of a few barrels that harken back to the days of moonshine and the front door with its painted mural of a gangster and lady in red (presumably the latter being a reference to the one that gave away with John Dillinger, just before he was gunned down in front of the Biograph Theatre in Chicago). The establishment at this bend of the Fox River between Elgin and St. Charles started out as Reitmayer's Beer Garden in 1917. Once Prohibition descended upon this great land in 1920, old Reitmayer himself brewed his own beer, \"...in a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}