{
    "relation": [
        [
            "Activity",
            "Visit the incredible ancient Nazca sites of the Chauchilla Cemetery and the nearby Cahuachi Pyramid",
            "Take a scenic flight over the mysterious Nazca Lines, to get the best possible view of the world-famous figures",
            "See a section of the famous Nazca Lines from the viewing tower built by the archeologist Maria Reiche"
        ],
        [
            "Approximate Cost",
            "Included in Kitty",
            "USD 130",
            "PEN 2"
        ]
    ],
    "pageTitle": "Trip Notes for Patagonia & Amazon between Cartagena and Ushuaia",
    "title": "",
    "url": "http://www.dragoman.com/holidays/trip-notes/patagonia-and-amazon-between-cartagena-and-ushuaia?format=dossier&vid=6909&did=75922",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00311-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 416611567,
    "recordOffset": 416518340,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33792=Separatyng Tierra del Fuego from mainland Argeninta are the infamous Strait of Magellan. This treacherous stretch of water is about 500km long and takes it's name from the explorer Magellan who first navigated these waters in 1520. It was the only ship out of a total of 17 attempting the passage that sucessfully managed to reach the Pacific. Before the Panama Canal was built, the Strait provided a useful route between Chile, Peru and Europe, and though they are less important as a major shipping route today, they still see a fair amount of traffic., 76461=+56 2 2688 4849, 373877=For mobile phones, please note that most countries in the Americas operate at 850MHz and 1900 MHz which is not the same frequencies used in Europe, Africa, Asia and Australia. Most modern tri-band and quad-band mobile phones will be able to operate on these frequencies but please check your mobile phone specifications before travelling to ensure that you'll be able to use your phone in the Americas., 189744=Trips coming through Lima before 1 August 2015 are staying in Hotel Inka Path:, 29250=Tel: +54 02901 423459, 190080=+51 1 426 1919, 146449=Discovered in 1911 by the explorer Hiram Bingham, although the ruins were heavily covered by dense jungle foliage, many of the buildings were well preserved and in excellent condition. The city consists of more than 200 buildings, from houses to temples, storage buildings and public spaces. It's fascinating to be able to gaze down on the city from above and imagine how it would have looked during the height of the Inca empire., 174744=Archaeologists believe the lines were created between 200BC and 700AD by three successive, different civilisations. The global importance of the region is reflected in UNESCO's declaration of the Nazca lines as a World Heritage Site in 1994. You can view the lines from viewing towers or take a flight in a small plane to see them from above., 322153=Please note that due to a recent counterfeit scam central banks in several South American countries (Ecuador, Peru, Bolivia and Chile) have temporarily banned the circulation of USD100 notes bearing a series 2001 production date and a serial number starting with the letters CB or CF and ending in B2. The serial number is printed in green on the emblem., 379573=These trip notes were printed on 01/08/2015, 232207=Tel: 00 593 2 22 22721, 301437=Day 2: Paine Grande Campsite The Dragoman truck will drive the group to Pudeto. From here the group will take the catamaran across Lago Grey to Paine Grande at 09:30 hrs. The group will split into 2 groups, one for the base package walkers and one for the extension package walkers, and hike up to Glacier Grey with their respective guides. The groups will return to Paine Grande in time for dinner. The night will be spent camping in Paine Grande campsite. The walk today is mostly flat with easy terrain., 8766=Seafood is Chile's main cuisine and with so many dishes to try, it is an opportunity not to be passed upon. With 2700 miles of astounding coastline, Chile is the perfect location for the variety of dishes available., 189386=Please note that all trips coming through Lima on or after 1 August 2015 will be staying in Hotel Kamana rather than Hotel Inka Path:, 76414=Moneda 1829, 303325=Day 2: Paine Grande Campsite The Dragoman truck will drive the group to Pudeto. From here the group will take the catamaran across Lago Grey to Paine Grande at 12:00 hrs. The group will then split into 2 groups, one for the base package walkers and one for the extension package walkers, and hike up to the Glacier Grey viewpoint with their respective guides. The groups will return to Paine Grande in time for dinner. The night will be spent camping in Paine Grande campsite. The walk today is mostly flat with easy terrain., 270067=The communities that we support are remote Andean farming communities with traditions dating back to the Incas. They are primarily Quechua speaking, with some Spanish, and little contact with the general population. Their daily lives consist of potato cultivation, weaving, and the herding of llamas, alpacas, and sheep. Considered by the Peruvian government to be living in extreme poverty, they often face malnutrition, severely cold weather, poor hygienic conditions, and little medical or health assistance. These communities typically have small schools that often need support with construction, furniture, materials and teachers. Villagers live in thatched-roof stone huts and cook with firewood. Because of the disproportionate supply and demand of native trees and bush, there is a great need for an effective reforestation project in the area. Since 2006, Dragoman has worked with Ecoam (who helps us with our reforestation project) and thanks to the support from Dragoman and our passengers, the area we used to visit around Quishuarani, Cuncani and part of the mountain range of Lares has been declared a Private Landscape Reserve., 28552=Today is an arrival day with a pre departure meeting at 18:00 hrs. There are no activities planned so you can arrive at any time. Your leader will leave a note in reception telling you where this important meeting will take place. Your leader will collect your kitty and check your passport and insurance details at this meeting., 183989=Lima is a city of hidden beauty. Dive in and explore the Peruvian capital's streets, parks and plazas and you will discover a real gem of a city. Infact there's so much to see here, a city tour is a great opportunity to find out about more about the rich history of Lima itself and Peru as a whole. The city was founded by Conquistador Pizarro in 1535 and was originally the administrative centre for Spain’s Vice royalty in South America, making it the continent’s most important city for nearly three centuries. It became a city of great wealth financed by the massive quantities of gold and silver that were mined in the area., 301142=High season runs from 1 November to 30 March., 14610=The most famous Inca legacy is undoubtedly the Inca Trail the ancient set of pathway in the Andes that include the route up to the fantastic site of Machu Picchu. You can trek through the countryside making your way through the unspoilt land and view the breathtaking scenery that carries on to the horizon and beyond. When you reach Machu Picchu you will realise what a beautiful place it is, no photograph can really do the site justice. The long forgotten site was rediscovered by Hiram Bingham in 1911 and is simply awe inspiring and is a must visit place in South America., 339365=United States. http://travel.state.gov/travel/travel_1744.html, 252746=Tayrona National Park is a protected site and an excellent example of ecotourism. Tayrona Natonal Park shows a huge diversity of animal and plant species. This is due to the variation in geology of the area. At sea level the climate is arid, making for perfect beach conditions. Further biodiversity is present offshore, in the warm water of the many coral reefs, which offer an excellent opportunity for snorkeling and swimming. As you travel away from the beach you travel upwards, into the sub tropical climate of the cloud forests, on the foothills of the Sierra Nevada Mountains. In total in the park there are over 2000 species of animal and almost 800 species of plant. This can all be explored on foot by designated paths, an attempt to minimize human impact on the habitat., 180679=Historically the peninsula was the home to the Paracas people from 1200BC through to around 200 AD and some remains of their culture can be found in the area, the most spectacular of which is the enormous candelabra - a giant etching depicting a cactus inscribed onto a coastal hill overlooking the ocean., 13520=The capital is Lima and it is known of the City of the Kings, it was founded by the Conquistador Pizarro in 1535. The elegant architecture runs through the capital and the cultural effects of the museums are all tucked away in this classic city. Any introduction to Peru wouldn't be complete without the Inca civilisation. Cuzco is the ancient capital of the Inca empire. Even today, many of its buildings have original Inca stonework as part of their structure. The Incas had a highly organised and labour intensive society. They managed to conquer vast tracts of land and, through strong central and regional government, retained control over an empire that spanned South America, from mid Colombia in the north, to the middle of Argentina in the south and lasted for over four centuries., 88060=The ruins of Quilmes are located in Tucaman province in north-west Argentina. The people of Quilmes were an indigenous tribe who inhabited this area as far back as 1000AD, resisting Inca invasions in the 15th and 16th centuries and even holding out against the Spanish for over one hundred years, before finally succombing to a siege led by the colonial powers in 1667. After the siege Spanish took the area over, deporting the few surviving indigenous people to a \"reservation\" close to Buenos Aires. The 2000 remaining Quilmes Indians were forced to make this 1500 km journey on foot, which meant that many died along the way, never reaching their final destination. At it's height, the city we see the ruins of here would have housed nearly 5000 people, today there are only a handful of Quilmes descendents left in Tucaman. It is interesting to wander among the ruins here today and imagine the city that would once have been., 150179=+ 51 84 222771, 260053=Please note that this trip spends time above 2800 metres/9200 feet where it is possible for travellers to experience some adverse effects on your health due to the altitude, potentially including Acute Mountain Sickness (AMS), High Altitude Cerebral Edema (HACE) and High Altitude Pulmonary Edema (HAPE)., 175099=Important - Flight over the Nazca Lines - As of November 2010 some western countries' travel advisories advise against this optional activity due to concerns around proper aircraft safety and maintenance standards not being reliably adhered to. For more information please refer to your country's travel advice website. Please note that due to Dragoman's internal safety policy our leaders are specifically prohibited from recommending or assisting with booking this activity.}",
    "lastModified": "Sat, 01 Aug 2015 20:16:32 GMT",
    "textBeforeTable": "Drive time - 9 hours (please note that all drive times given here are approximate estimates only and are given with the best intentions - however please be aware that the drive times are heavily dependent on traffic, road conditions, weather, police roadblocks, and many other factors - flexibility is essential on any overland trip!). Tonight we bush camp for the night. We head north on a full day's drive, including a ferry crossing of the infamous Magellan Straits and enter Chile. Border information: Exit Argentina at San Sebastian, enter Chile at San Sebastian. ( Sun 02 Aug ) Day 2: Strait of Magellan ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2015-08-02 20:16:32.000000 [timezone_type] => 3 [timezone] => UTC ) ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2015-08-02 20:16:32.000000 [timezone_type] => 3 [timezone] => UTC ) ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2015-08-01 20:16:32.000000 [timezone_type] => 3 [timezone] => UTC ) Tierra del Fuego (\"Land of Fire\") is a large island separated from mainland South America by the Magellan Straits. Most of the island belongs to Chile, but 30% of the archipelago is in Argentina, including Argentina's southernmost town, Ushuaia. This is Patagonia at its most remote,with a landscape of windswept plains, forests and swamplands, home to Rheas,",
    "textAfterTable": "ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2015-08-03 20:16:32.000000 [timezone_type] => 3 [timezone] => UTC ) ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2015-08-03 20:16:32.000000 [timezone_type] => 3 [timezone] => UTC ) Day 3: Torres Del Paine National Park ( Mon 03 Aug ) Today we drive to Torres del Paine National Park. This is one of the most outstanding areas of beauty in Chile and the highlight of the trip for many passengers. We stop en rouite in Puerto Natales to pick up our local guides and cook. Tonight we camp for the night at a stunning lakeside campsite with facilities. Drive time - 6 hours. Activity Approximate Cost 4 days to explore and trek the rugged Torres del Paine National Park Included in Kitty About Torres Del Paine National Park: Parque Nacional Torres del Paine is home to what is undoubtedly some of the most spectacular scenery in all of Patagonia, if not all of South America. Rising up high above the Patagonian steppe are the 3 impressive granite towers that give the park it's name, surrounded by towering mountain peaks, the most famous of which are Los Cuernos and Paine Grande.  The park is a magical",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}