{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life"
        ],
        [
            "Comments",
            "Troy has a state of the art in buffet cafe.",
            "I share a bathroom with 3 guys."
        ]
    ],
    "pageTitle": "Troy University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Troy-University/reviews?_escaped_fragment_=/show/82275",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00113-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895176563,
    "recordOffset": 895100234,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{170738=i live in trojan village and the dorms are beautiful, they are better than some of the apartments ive lived in., 318097=I lived in Trojan Village dorms. They were beautiful and spacey with individual rooms for each occupant. It was a very nice introduction to college because it wasn't quite as large of a culture shock., 39155=Troy University gave me a leadership scholarship, which has not only given me financial aid, but also given me the opportunity to be in the leadership course with many wonderful students and teachers. It is free for all students to enter any home sporting event, as long as the student has their Trojan ID card with them. The meal plan has helped me out tremendously because Troy has many places to eat on campus and being able to pay using my Trojan ID card has been a blessing., 337592=Dorm life is not for everyone. Some people prefer Trojan Village over every other dorm on campus. I, however, did not stay on campus my first year and will not be on campus any other years to come. The apartment that I live in does have roommates and I love them., 33448=Troy University is great for international students. Troy University is also into ROTC students. Students at Troy University get extremely excited about Trojan football games as well!, 130967=We have a brand new dining facility! The food is great! There are several eating establishments in the new SAGA building. Another food option would be thee Trojan Center., 24073=Dorm Life can be nice depending on the dormitory you live, but overall dorm living is not that great. Some of the larger units are long due for renovations. The newer dorms however are very nice, but lack stoves to cook. Recommendations: Clements Hall(co-ed), Pace Hall(co-ed), Trojan Village(co-ed), Shackelford Hall(co-ed), or Cowart Hall(female only), 121678=troy university just finished builing a brand new, state of the art dining hall. it is gorgeous and the food is amazing. the dining hall is downstairs and it is buffet style. there is more seating up stairs as well as a moe's. on the other side of campus there is the trojan center. downstairs in the trojan center there is a food court. the food court includes a chick-fil-a, a & w, mein bowl, subconnection, and einstien's bagles., 410330=I live in Trojan Village on the Troy Campus. It is usually just available for upperclassmen. It is apartment style with 4 bedrooms and 2 bathrooms. The building is kept clean, but the laundry room is gross. I hate washing my clothes., 191722=The activities I have been involved in are as followed: ï?§ Sr. Beta-2011: Reporter / 2012: Vice-President ï?§ Future Business Leaders of America ï?§ Student Government Association-2011: Secretary/ 2012: Vice-President ï?§ ASTRA-2010-2011: Historian/Secretary / -2012: President ï?§ Future Farmers of America -Meats ID Team/Scrapbook Team /Spring Turf Crew ï?§ Yearbook Staff ï?§ 2011 Coffee County Youth Leadership Program -2011: Photographer ï?§ Mu Alpha Theta/Math Club-2012: President - Math Bowl Participant ï?§ Diamond Dolls ï?§ Volleyball ï?§ Basketball ï?§ Softball I am currently enrolled in the Leadership Program at Troy University and will conduct several volunteer hours throughout the semesters., 240276=The Trojan Dinning facility is brand new and has a wide variety of menus to choose from. You will not be dissapointed!!, 68344=I actually don't live in the dorms, but my friend lives in Trojan Village and she LOVES it!, 165394=The Trojan Center and the Trojan Dining buildings offer a wide-variety just of dining options for students., 408029=Troy has a Division I Football team who runs the show for Trojan Athletics. None of the teams are winning any National Championships, but basketball games in the new arena are fun to go to., 266227=I live off-campus so take my word with a grain of salt, but the dorms are in varied condition. Alumni, Hamil, Gardner, and to an extent, Cowart seem to be in need of an update. Trojan Village and Shackelford Hall would be my choices for the best housing on campus., 22343=Troy University has the Trojan Walk where anyone interested will meet with the marching band and football team in a march to the stadium prior to football games. During Homecoming, the school has a parade through the downtown area of Troy. Here, various campus organizations design floats to showcase. Also, Troy U. has a Spring Fling., 75300=The Greek chapters here at Troy are a major organizations many students at Troy love to take part in. The Greeks provide students great ways to get involved and meet new people and especially keep students showing their Trojan spirit., 222047=The Trojan Dining Hall is top notch, great food with several different options everyday. The other dining option is in the Trojan Center, wich includes a Chik-fil-a and A&W along with 4 other options., 80478=Again, Troy is what you make of it. All of the dorms on campus are fully capable of meeting any student's needs. Whether the student be assigned to Hamil Hall, Alumni Hall or Trojan Village, there are pros and cons to every dorm here at Troy. The RA's (Resident Assistants) are very well-prepared to help their residents to the best of their abilities. You will never have any questions to go unanswered. There are pros and cons to every college experience you will have at Troy, or anywhere for that matter. It is what you make of it., 46262=There is a whispering wall where sound echoes and is carried from one corner to another with little effort. Welcome week for the freshmen, pep rallies and tailgaters for football games, the Trojan Walk, and parades., 110739=Troy University has been great so far; full of great people and amazing teachers. I was scared coming from a two year and handling the four year college, but they make sure the transition is very smooth. I am really enjoying my Trojan experience., 188490=Visit the campus AT LEAST twice! I visited in February while auditioning for a music scholarship and hated it because I put myself under stress about my audition but now I would never want to go anywhere else than Troy. Go on a nice day when your mind can really focus on the place and talk to the people on campus! They would love to help., 317588=Troy offers many diverse options both on and off campus. Trojan Center Dining offers different restaurant-style options. However, Trojan Dining Hall, or Saga, was recently renovated and upgraded making it the campus favorite., 81303=Troy's classes are just as rigorous as any other 4-year university program. Classes are not hard, but they do require effort. The education you receive at Troy is just as great as the education you will get at the University of Alabama, Auburn University, Florida State University and the University of Florida and any other bordering-state universities. Troy might even be better for students that are new to the college environment. Like me, students that are in need of great teachers that are willing to work with you and help you every step of the way thrive here at Troy University. There is not one time you will walk into the Trojan Center or the dining hall and find professors actually sitting down, enjoying a conversation with a student over a meal., 321584=The Trojan Dining was the biggest turn on for me, I absolutely loved it., 79243=Troy has a variety of food choices for all students on and off campus. The city of Troy has nearly every fast food restraunt you can find in the South-East region of the United States as well as a decent number of good-quality dining. The Trojan Center has a Market Place (cafeteria style food), Chick-Fil-A Express, A&W Burgers, SubConection and an Einstein Bros. Bagel Shop. The brand new Trojan Dining Hall (Saga) also has a variety of foods to choose from. Saga is fully equipped with a salad bar, sandwich bar, pizza and past bar, a cafeteria style bar as well as an all-American food bar with grilled cheese, hot dogs, burgers and fries/chips. Each bar has a new special every day and it is impossible to not find one place to eat. Saga also has a Magellan's (stir-fry) and a Moe's Southwest Grill upstairs. All of Saga's meals are deducted from each student's meal plan and all of the Trojan Center dining (and Moe's) requires flex dollars., 169602=my traditional location is the trojan center because students go there to get food and just to meet up with friends and catch up and talk., 387578=There are a lot of free things on campus and you start off with 12 dollars on your Trojan card for printing., 23403=Troy University recently opened a new, state of the art dining facility that includes a hibachi-style restaurant, Moe's Southwest Grill, and Boar's Head. The Trojan Center (student center) also features a food court which includes Einstein Bros. Bagels, SubConnection, Mein Bowl Asian Cuisine, A&W, Chick-fil-a Express, Marketplace, and hopefully soon-to-be-open Papa John's Pizza., 272680=We have something called the TC which stands for the Trojan Center and its the best place to get food. Go to the Chinese restaurant because they have the best food., 76213=Students that rely on a small, close-knit community (like me) really thrive here at Troy University. The atmosphere is clear and kind all around. Because the campus is generally small, it enables students to really get to know their professors and vice-versa (a major plus for students that tend to need teachers that will get on a one-on-one level). Though Troy is mostly small, the campus is rapidly growing and admissions continues to gain hundreds of students each year. There are many advances the school has taken on just in the past year: a new dining hall, a new sports arena that is to be completed by the fall of 2012, a brand new band room to be completed very soon, and a brand new back quad with a beautiful new fountain. Troy is growing more and more every year, and it is exciting to see the growing number of students that come to Troy., 77281=Sorority Hill and Fraternity Row hold all of their parties and social gatherings after pep rallies on Thursday nights- mostly. The tradition held at Troy University's football games and pep rallies such as Trojan Walk and The Sound of the South (Marching Band) are just the start of the many traditions that continue to live on here at Troy., 74650=Campus safety has increased a lot just in the past year. The minor occurances that have happened in the Spring of 2012 have kept both campus and city police on full alert at all times. There has been an addition of new lighting everywhere on campus and security guards everywhere you turn, especially at night. Things happen at every university, but the campus and city police are definitely on their toes and are determined to keep students away from harm's way at all cost., 154855=Well, if it is any consultation, Troy recently (April 2012) caught a guy that had made multiple sexual assaults against some campus students. To combat that, Troy says that they will add more street lights and hire more security personnel. Perhaps the campus safety could be better. I definitely don't want to be hanging around at night or anywhere unpopulated., 9032=I love sports and the ensuing parties! Since joining the TROY family I have become a FANATIC of Trojan athletics. Last college season - although living in SC - I attended every TROY football game and had the time of my life! Although my guys lost some heart breakers, we put-up a very good fight against some pretty good football teams, and then went on to win our bowl game against Ohio U. Troy Baseball is also one to see. This year we almost made it to the Super Regionals before losing to Belmont in the 1st round. TROY University may be dubbed as a mid major university, inside beats the heart of a true Goliath. Come join me and finally realize The Future of Opportunities. See you class… Mark Brunner - eTroy Gard School..., 39931=I am in love with Troy University. The campus is beautiful and just the right size for me. The people are friendly and I have gotten to know many people in and out of my classes. I am so glad that I decided to become part of the Trojan family!, 416607=© 2015, Cappex.com, LLC, 63693=i stay off campus, but i dine in the cafe, and trojan center sometimes. off campus students are usually not required to buy meal plans, but for the past two years they are required to buy a two hundred dollar one. i didn't agree with this much because i rarely eat on campus, but now that i go on campus more, it is coming in handy. troy offers a big selection of foods from chinese cuisines to subway.}",
    "textBeforeTable": "07/19/2009 Reviewer is A current student here. 28 out of 28 people found this review useful. 1 of 101 Breanna from Pensacola, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. Troy University Reviews Troy University › Alabama › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "This is ultimately a bang for the buck because not only do you get a good education, but compared to other schools this one is cheaper. The campus is also well kept. Am enjoying being here I enjoy being here because I don't feel like I have to do certain things like party, smoke, and drink just to have a good time. With organizations such as the Baptist Campus Ministry, SGA, the Univeristy Activities Counsel, one does not have to be bored and can have good clean fun. Am learning a lot I learn a lot because of the variety of students. Login to rate or flag the reviews Jasmine from troy, AL 07/06/2009 Reviewer is A current student here. 24 out of 25 people found this review useful. 2 of 101 Categories Comments Great for these types of students If you love a school with a diverse range of people. If you",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}