{
    "relation": [
        [
            "The Netherlands Province",
            "Drenthe",
            "Flevoland",
            "Friesland",
            "Gelderland",
            "Groningen",
            "Lemburg",
            "North Brabant",
            "North Holland",
            "Overijssel",
            "South Holland",
            "Utrecht",
            "Zeeland"
        ],
        [
            "Abbreviation",
            "DR",
            "FLD",
            "FR",
            "GLD",
            "GN",
            "LB",
            "NB",
            "NH",
            "OV",
            "ZH",
            "UT",
            "SLD"
        ]
    ],
    "pageTitle": "Internal Revenue Manual - 3.11.249 Processing Form 8752 (Cont. 1)",
    "title": "",
    "url": "http://www.irs.gov/irm/part3/irm_03-011-249r-cont01.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00242-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 512573087,
    "recordOffset": 512536992,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45613=Submission Processing BMF Foreign Address Job Aid (Number 2324-002) provides examples for editing foreign addresses., 114378=The required payment is intended to represent the value of the tax deferral by the owners of those entities through the use of a taxable year other than the required year. Generally, the tax year is a Fiscal Year (FY) ending in September, October, or November. The required payment is considered a deposit., 3929=The document is for a tax period prior to December 31, 1990., 57721=All returns must have a tax period. Edit the tax period under the title of the form in YYMM format. Determine the tax period by the year (printed) on the face of the tax form (e.g., for the 2014 tax form, the tax period should be \"1412\" ). Taxpayers are advised to edit changes on the form to the tax year for prior tax periods., 65160=A received date is required on every Form 8752, Required Payment or Refund Under Section 7519. The due date for Form 8752 is May 15 of the year following the calendar year in which the applicable election year begins., 103495=The \"Deferral Ratio\" is the three-digit code representing the allowable deferral percentage for the taxpayer’s deferral period. The \"Deferral Period\" means the number of months that occur between the last day of the elected tax year and the last day of the required tax year. For example, if the taxpayer elected a tax year ending on September 30 and his/her required tax year is the calendar year, the deferral period would be three months (the number of months between September 30 and December 31). If the deferral period is three months, edit \"250\" as the deferral ratio. Using the same example (e.g., if the required tax year is the calendar year), the deferral period would be two months for an elected tax year ending in October, while the deferral period would be one month for an elected tax year ending in November. (Edit \"167\" for the deferral ratio for a deferral period of two months. For a deferral period of one month, edit \"083\" .), 105005=Generally, the deferral percentage will not exceed 25%. However, entities with taxable years for 1986 and prior to make the IRC Section 444 elections can retain that taxable year even if the deferral period was more than three months. If the taxpayer claims an amount greater than 25%, but less than 91.7%, accept taxpayer’s amount. If the taxpayer claims more than 91.7%, allow only 91.7%., 85671=CCC \"O\" is entered when a Pre-Settlement Manual Refund was made and a Form 3753, Manual Refund Posting Voucher, Form 5792, Request for IDRS Generated Refund (IGR), or Form 12857, Refund Transfer Posting Voucher, is attached. Verify that the Name Control, EIN, and tax period on the return is the same as the data on the form., 86269=If a completed Form 3753, Manual Refund Posting Voucher, or Form 5792, Request for IDRS Generated Refund (IGR), or Form 12857, Refund Transfer Posting Voucher, is attached to the return, verify that the Name Control, EIN, and tax period on the return is the same as the data on the form. Edit CCC \"O\" if the data is the same., 59214=If the election year ends September 30, 2014, the tax period is \"1412,\" not \"1409\" ., 86742=If the data is not the same, refer the return and the attachment to your manager. The manager will send the return and the attached Form 3573, Form 5792, or Form 12857 back to the originating function., 62630=The CAF contains the type of authorization that taxpayers give to representatives regarding the taxpayers' accounts. Representatives may submit Form 2848, Power of Attorney (POA) and Declaration of Representative, or Form 8821, Tax Information Authorization (TIA).}",
    "textBeforeTable": "Determine the EIN as follows: The EIN is located to the right of the Name field in the entity area of the return. The EIN is a nine-digit number (XX-XXXXXXX) assigned to identify the Form 8752. 3.11.249.9.2  (01-01-2015) Entity Perfection - Employer Identification Number (EIN) Tax Period Address Name Employer Identification Number (EIN) The entity of a tax return identifies the taxpayer on the Business Master File. The entity area of the return contains the following: 3.11.249.9.1  (01-01-2015) Entity Perfection - General This section includes information describing perfection of the entity and address areas of the Form 8752. The type of entity present on the return determines the Name Control procedure. 3.11.249.9  (01-01-2015) General Entity Perfection Documents not leaving the campus will be sent to the appropriate function in the campus for the required action. This includes items detached from documents to be processed that require correspondence, accounting, or other action. See IRM 3.11.249.4.2 (2) for preparation of",
    "textAfterTable": "The EIN contains any of the following conditions and cannot be determined from attachments and/or schedules; Illegible Missing Other than 9 digits All zeroes or All nines Numbered return, Circle out all illegible EINs, zeroes, and/or nines. Enter CCC \"U\" on the return. Route to Entity Control following local procedures (e.g., Attach Form 4227 to the return). Leave return in batch. The EIN contains any of the following conditions and cannot be determined from attachments and/or schedules; Illegible Missing Other than 9 digits All zeroes or All nines Unnumbered return, Research IDRS. (e.g., Command Code (CC) NAMES or CC EINAD or other Command Code). If found, edit to the proper location. If not found, route to Entity Control following local procedures.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}