{
    "relation": [
        [
            "First Name",
            "Kristi",
            "Thomas"
        ],
        [
            "Last Name",
            "Gaines",
            "Susman"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=2731E9AA-3EE2-4E6A-8609-DDD1A2581FC6&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00299-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 219830982,
    "recordOffset": 219815069,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{63144=H.R. 1215, Immigration Oversight and Fairness Act S. 577, Immigration Fraud Prevention Act of 2009 S. 729, Development, Relief, and Education for Alien Minors Act of 2009 (DREAM Act) H.R. 1651, Access to Justice Act S.424,H.R. 1024, the Uniting American Families Act of 2009 Recommendation to reconsider a decision issued by the former Attorney General on the constitutional right to effective assistance of counsel in immigration cases. General communications on immigration detention conditions and enforcement of ICE Detention Standards, access to legal representation and notice of legal rights to detainees by ICE., 94164=H.R. 448, Elder Abuse Victims Act of 2009, would authorize the Department of Justice to provide grants to state and local law enforcement agencies, prosecutors and courts for improving the investigation and prosecution of elder abuse and to improve services to victims of such crimes, 32281=S. 379, the Performance Rights Act. H.R. 801, the Fair Copyright in Research Works Act. H.R. 628, to establish a pilot program for litigation of patent cases in U.S. district courts. S. 299, to establish a pilot program for litigation of patent cases in U.S. district courts. S. 515, the Patent Reform Act of 2009. S. 610, the Patent Reform Act of 2009. H.R. 1260, the Patent Reform Act of 2009. H.R. 848, the Performance Rights Act., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 12233=Proposed amendments to the Financial Accounting Standards Board (FASB) Statements 5 and 141(R) involving corporate disclosure of litigation loss contingencies and waiver of attorney-client privilege and work product protections (set forth in the FASB exposure draft titled Disclosure of Certain Loss Contingencies: An Amendment to FASB Statements 5 and 141(R); File Reference 1600-100, issued on June 5, 2008), 27312=S.381, H.R. 862, A bill to express the policy of the United States regarding the United States relationship with Native Hawaiians, to provide a process for the reorganization of a Native Hawaiian and the recognition by the United States of the Native Hawaiian government, and for other purposes. H.R. 64, Military Commissions Habeas Corpus Restoration Act of 2009 H.R. 893, American Anti-Torture Act of 2009 H.R. 1012, S.370, Guantanamo Bay Detention Facility Safe Closure Act of 2009 H.R. 1069, S. 291, Guantanamo Bay Detention Facility Safe Closure Act of 2009 S. 448, H.R. 985, Free Flow of Information Act of 2008 H.J.Res.8 and S.J.Res.2, proposing an amendment to the Constitution to prohibit flag desecration HR 1304 and S 449, Free Speech Protection Act of 2009 H.R. 1315, the Terrorist Dentainees Protection Act of 2009 Native American rights; support for reauthorization of the Tribal Justice and Legal Assistance Act of 2000, and the Indian Tribal Justice Act; request for hearings to reexamine the DHS waiving laws to protect Indian rights in order to expedite securing the border between the U.S. and Mex Regulations regarding the conscience clause, which provides protections to workers in the health care industry who refuse to provide services that violate their religious beliefs. Efforts to influence to National AIDS policies to assure non-discrimination, community support services and access to medical care regardless of finances. H.R. 1255, To protect the interests of each resident of intermediate care facilities for the mentally retarded in class action lawsuits on behalf of such resident., 45062=Proposed changes to Department of the Treasury interim rule involving potential conflicts of interest under the Troubled Asset Relief Program (TARP) issued by the Treasury under the authority granted by Congress under Section 108 of the Emergency Economic Stabilization Act, P.L. 110-343 (set forth in the Treasury Department Interim Rule, TARP Conflicts of Interest, 74 Fed. Reg. 3431, January 21, 2009), 58718=Access to health care proposals--including access issues, privacy issues and legal remedies for those injured by malpractice. H.R. 2 (P.L. 111-3), Children's Health Insurance Program Reauthorization Act of 2009 - support increasing access to care for all children, eliminating five-year waiting period for states to cover legal immigrant children, and access for mental health and addiction treatment Paul Wellstone and Pete Domenici Mental Health Parity and Addiction Equity Act of 2008- comments related to equal access for mental health and addiction treatment., 35461=H.R. 1020 and draft Senate companion legislation, Arbitration Fairness Act, 15263=Draft bankruptcy technical corrections bill prepared by ABA proposing partial repeal of bankruptcy attorney liability provisions contained in Sections 102, 203(a), and 226-229 of P.L. 109-8 (formerly S. 256), Bankruptcy Abuse Prevention and Consumer Protection Act of 2005, to add a new partnership section to the Bankruptcy Code, and to make certain technical amendments to Section 363(f) of the Code regarding certain sales of real property, 84392=H.R. 1478, the Carmelo Rodriguez Military Medical Accountability Act of 2009, would allow members of the Armed Forces to sue the United States for damages for certain injuries caused by improper medical care S. 540 and H.R. 1346, the Medical Device Safety Act of 2009, would amend the Federal Food, Drug, and Cosmetic Act with respect to liability under State and local requirements respecting devices S. 512 and H.R. 1237, the Fairness in Nursing Home Arbitration Act of 2009, would amend the Federal Arbitration Act (FAA) to invalidate mandatory binding pre-dispute arbitration clauses in agreements between long-term care facilities and residents Recommendations related to: federalizing state medical malpractice and product liability laws and health courts, 18370=P.L. 111-8 (formerly, H.R. 1105), Omnibus Appropriations Act, Section 4, Division D, Title V and FY 2009 Financial Services and General Government Appropriations Act provisions providing funding for the Administrative Conference of the United States, the Legal Services Corporation, the Patent and Trademark Office H.R. 1, American Recovery and Reinvestment Act provisions relating to funding for legal aid and competition contracting requirements. S.Con.Res. 13, An original concurrent resolution setting forth the congressional budget for the United States Government for fiscal year 2010, revising the appropriate budgetary levels for fiscal year 2009, and setting forth the appropriate budgetary levels for fiscal years 2011 through 2014 amendment to restore $4 billion to International Affairs budget. Draft FY 2010 Commerce, Justice, Science and Related Agencies Appropriations Act provisions relating to funding for the Legal Services Corporation; funding for reentry programs under the Second Chance Act; juvenile justice programs and indigent defense services administered by the Office of Juvenile Programs, Department of Justice; and funding for the Executive Office of Immigration Review and the Legal Orientation Program. FY2010 Draft Legislative Branch Appropriations Act funding for the Law Library of Congress, including the Global Legal Information Network FY2010 Labor, Health and Human Services and Education Appropriations funding for programs authorized under the Strengthening Abuse and Neglect Courts Act (SANCA), funding for programs authorized under the federal Child Abuse Prevention and Treatment Act (CAPTA), funding for the Social Security Administration. FY2010 Financial Services and General Government Appropriations funding for Defender Services. FY2010 State, Foreign Operations and Related Programs Appropriations Act funding for international rule of law programs, including the ABA Rule of Law Initiative Proposal to reprogram $3.2 million from Department of Homeland Security or other federal executive agency to the Administrative Conference of the United States Activity in support of implementation and funding of the John R. Justice Prosecutor and Defender Incentive Act and a related loan forgiveness program for civil legal aid lawyers under the Higher Education and Opportunity Act, P.L.110-315. Activity in support of legal assistance for low-income military servicemembers and their dependents. Proposal to Establish a Legal Corps to provide assistance to low-income families regarding housing issues, 51583=H.R. 429, S. 446, A bill to permit the televising of Supreme Court proceedings. S. 657, Sunshine in the Courtroom Act of 2009 S. 630, Statutory Time-Periods Technical Amendments Act of 2009 H.R. 156, Stop the Congressional Pay Raise Act H.R. 215, Congressional Pay Reform Act of 2009 H.R. 282, Delay Congressional Pay Raise Act S. 102, S. 317, S. 620, A bill to repeal the provision of law that provides automatic pay adjustments for Members of Congress. H.R. 191, Ninth Circuit Court of Appeals Judgeship and Reorganization Act of 2009 S. 220, H.R. 486, Judicial Transparency and Ethics Enhancement Act of 2009 HR 569, S.357 -- Equal Justice for the Military Act (provides service members with the same opportunity that the government has to petition the supreme court for review of a court martial that carries serious consequences to the Supreme court S. 417, State Secrets Protection Act H.R. 157, S. 160, the District of Columbia House Voting Rights Act of 2009 S. 718, Civil Access to Justice Act of 2009 Draft legislation to establish a new Administrative Law Judge Conference of the United States as an independent agency to assume the responsibility of the United States Office of Personnel Management with respect to Administrative Law Judges, including their testing, selection, and appointment Draft legislation to amend various adjudication provisions of the Administrative Procedure Act P.L. 110-343, formerly, H.R. 1424, Emergency Economic Stabilization Act Section 114 (Market Transparency) relating to possible future federal agency regulations leading to waiver of attorney-client privilege and work product protections Urged the OPM and to use its authority to make locality adjustments to the basic pay of administrative law judges (ALJs) and to grant ALJs the same national pay raise that is expected to be authorized for the General Schedule for fiscal year 2009. Legislative recommendations related to: attorney-client privilege and the Rules Enabling Act, 69147=H.R. 265, the Drug Sentencing Reform and Cocaine Kingpin Trafficking Act of 2009. H.R.1064/S.439, the Youth PROMISE Act H.R.1022/S.132, Gang Abatement and Prevention Act of 2009, provisions related to definition of gang crimes, transfer of juveniles to adult criminal justice system and mandatory minimum sentences. S. 445, Attorney-Client Privilege Protection Act H.R. 265, Drug Sentencing Reform and Cocaine Kingpin Trafficking Act of 2009 - provisions related to elimination of the current disparity in federal sentences for crack versus powder cocaine offenses H.R.1133, Family Telephone Connection Protection Act of 2009, provisions relating to regulation of contracts for telephone service by prison inmates. H.R.1412/S.495, the Justice Integrity Act. H.R.1459, the Fairness in Cocaine Sentencing Act. H.R.1873, the Juvenile Justice Improvement Act of 2009. H.R.1931, Juvenile Crime Reduction Act. S.678, the Juvenile Justice and Delinquency Prevention Reauthorization Act of 2009 Proposed changes to Justice Department internal policy involving waiver of attorney-client privilege, work product, and employee legal protections as conditions for receiving cooperation credit during investigations (set forth in 1999 Holder Memorandum, 2003 Thompson Memorandum, October 2005 McCallum Memorandum, December 2006 McNulty Memorandum, and August 2008 corporate charging guidelines) Proposed Presidential executive order or memorandum applying a strengthened version of the Justice Departments August 2008 corporate charging guidelines provisions dealing with waiver of attorney-client privilege, work product, and employee legal protections to all other federal agencies Proposed changes to Commodity Futures Trading Commission policy involving waiver of attorney-client privilege, work product, and employee legal protections as conditions for receiving cooperation credit during investigations (set forth in the August 11, 2004 and March 1, 2007 Enforcement Advisories titled Cooperation Factors in Enforcement Division Sanction Recommendations issued by the Commissions Division of Enforcement) Proposed changes to Securities and Exchange Commission policy involving waiver of attorney-client privilege, work product, and employee legal protections as conditions for receiving cooperation credit during investigations (set forth in the Commissions Seaboard Report, formally known as the Report of Investigation Pursuant to Section 21(a) of the Securities Act of 1934 and Commission Statement on the Relationship of Cooperation to Agency Enforcement Decisions, issued on October 23, 2001 as Releases 44969 and 1470; and in Section 4.3 of the SECs Enforcement Manual issued on October 6, 2008) Proposed changes to Department of Housing and Urban Development policy involving waiver of attorney-client privilege and work product protections (set forth in the HUDs February 3, 2006 formal Notice to public housing authorities urging them to include an addendum in all contracts with legal counsel that would restrict their attorneys ability to assert the attorney-client privilege on behalf of these clients in regard to HUD investigations and enforcement proceedings) and policy pressuring state and local government entities that administer federal awards to not pay their employees attorneys fees during investigations Proposed changes to Environmental Protection Agency policy involving waiver of attorney-client privilege, work product, and employee legal protections as conditions for receiving cooperation credit during investigations (set forth in the EPA Cooperation Standards, \"Incentives for Self-Policing: Discovery, Disclosure, Correction and Prevention of Violations,\" Effective May 11, 2000) Proposed changes to the Federal Acquisition Regulation (FAR) rules involving waiver of attorney-client privilege, work product, and employee legal protections as conditions for receiving cooperation credit during audits, investigations, or corrective actions (set forth in FAR Case 2007-006, Contractor Compliance Program and Integrity Reporting, 72 Fed. Reg. 64019 (November 14, 2007; Original Proposed Rule) and 73 Fed. Reg. 28407 (May 16, 2008; Second Proposed Rule) P.L. 110-252, including H.R. 5712, Close the Contractor Fraud Loophole Act provisions involving waiver of attorney-client privilege, work product, and employee legal protections as conditions for receiving cooperation credit during audits, investigations, or corrective actions Proposed changes to Department of Treasury Office of Foreign Assets Control (OFAC) interim final rule involving waiver of attorney-client privilege, work product, and employee legal protections as conditions for receiving cooperation credit during OFAC investigations and enforcement actions (set forth in the OFAC Interim Final Rule, Economic Sanctions Enforcement Guidelines, FR Doc. E8, 73 Fed. Reg. 174, September 8, 2008) Proposed changes to Department of Defense policy involving waiver of attorney-client privilege and work product protections (set forth in DOD policy titled Use of DOD Information SystemsStandard Consent Banner and User Agreement requiring military defense lawyers to provide access to client computer files issued on May 9, 2008), 38155=Activity in response to language in 110th Congress, S. 3001, the Duncan Hunter National Defense Authorization Act of 2009, concerning Military Servicemember rights in child custody matters; and legal assistance for low-income military servicemembers and their dependents. Activity in response to federal litigation denying Servicemembers the right to enforce provisions of the Servicemember Civil Relief Act through a private cause of action. Activity in support of treatment of Veterans subject to, or upon their release from, the criminal justice system and/or homeless. Activity concerning the handling of data collected from computer network servers subject to the attorney-client privilege., 81656=H.R. 1423 Legal Services Benefit Act -reinstatement of the pre-tax status of group/prepaid legal services benefits, 48062=Convention on the Elimination of All Forms of Discrimation Against Women (Treaty Doc. 96-53) UN Convention on the Law of the Sea (Treaty Doc. 103-39) General recommendations regarding reforming U.S. foreign assistance programs Recommendations regarding U.S. standing for election to the United Nations Human Rights Council Recommendations regarding strengthening U.S. engagement with the International Criminal Court, including by: restoring U.S. signature to the Rome Statute; initiating the appropriate executive branch process that will lead to the treatys submission before the Senate for ratification; participating as an observer in the Assembly of States Parties (including activities in preparation for and at the 2010 review conference); and ensuring that the U.S. government cooperates and assists in all ongoing ICC investigations and prosecutions., 41524=Activity in response to language in 110th Congress, S. 3001, the Duncan Hunter National Defense Authorization Act of 2009, concerning Military Servicemember rights in child custody matters. S.244, Education Begins at Home Act. H.R.911, the Stop Child Abuse in Residential Programs for Teens Act of 2009., 66480=H.R. 1467, Safe and Secure America Act of 2009}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  Thomas M. Susman  2026621765  susmant@staff.abanet.org 5. Senate ID#  1808-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}