{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I always feel safe on campus! People are always around especially public safety!",
            "None!",
            "So many clubs and things going on on campus! you'll never be bored!",
            "Very expensive, but a really great school.",
            "There are always things going on whether its going to Providence or to another dorm! So much fun!",
            "The food is amazing, both Upper and Lower Commons dining hall is great!",
            "Dorm life is great! Everyone is really friendly. Feels like a home away from home.",
            "I love all my classes, easy to create schedule. The teachers are always there to help.",
            "Be open minded! Give new things a chance.",
            "Roger Williams is the perfect school for me! Its right on the water so I have a 24/7 view of the ocean! All my classes are great and I've made the best of friends!"
        ]
    ],
    "pageTitle": "Roger Williams University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Roger-Williams-University/reviews?_escaped_fragment_=/show/50496",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00159-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894848503,
    "recordOffset": 894806329,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{163694=Take advantage of the involvement fair in early September each year. There is a club for everyone., 174689=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/11/2009 Reviewer is A current student here. 16 out of 16 people found this review useful. 1 of 39 Brittney from Bristol, RI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Bang for the buck Sure this school is expensive, but what school isn't these days. For a great education that will take you places in this growing economy, Roger Williams is a great choice for your dollar. All the hard work and effort that is put into the school is shown, you never feel like your not getting what you deserve for what you pay. Am enjoying being here I love the friendly atmosphere, and the people. From orientation on i have been able to make great friends. I love walking to class and watching people play football or frisbee in the quad. Students are all dedicated to the school and so involved, it really is a family away from home! You will never feel left out! Am learning a lot Ever since going to Roger Williams i learned more about my major alone then i ever could, with the great one on one support from faculty, and my wonderful advisor. It has really opened my eyes life around me in a positive way. Going into the real world is not so bad when you are going to roger William's. You learn not only about your area of study, but you also learn alot about yourself.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}