{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2003-02-11T00:00:00",
            "2003-02-24T00:00:00",
            "2006-01-03T00:00:00"
        ],
        [
            "Description",
            "Transfer raw ALTM 1225 flight data, airborne GPS data collected at 1 Hz using Ashtech receiver, and ground-based GPS data collected at 1 Hz using Ashtech and Trimble 4000SSI receivers to NT workstation. Generate decimated lidar point file from above three data sets using Optech's Realm 2.27 software. This is a 9-column ASCII data set with the following format: time tag; first pulse Easting, Northing, HAE; last pulse Easting, Northing, HAE; first pulse intensity; and last pulse intensity. View decimated lidar point file to check data coverage (i.e. sufficient overlap of flight lines and point spacing). Compute base station coordinates using National Geodetic Survey's PAGES software. Computed aircraft trajectories for both base stations using National Geodetic Survey's KINPOS software. Coordinates for base stations and trajectories are in the International Terrestrial Reference Frame of 2000 (ITRF2000) datum. Trajectories from both base stations were merged into one. Weighting for trajectory merge is based upon baseline length (distance from base station) and solution RMS. Transformed trajectory solution from ITRF2000 to North American Datum of 1983 (NAD83). Use NAD83 trajectories and aircraft inertial measurement unit data in Applanix's POSProc version 2.1.4 to compute an optimal 50Hz inertial navigation solution. Substitute the aircraft position and attitude information from the inertial navigation solution into Realm 2.27. Extract calibration area data set from lidar point file for quality control and instrument calibration checks. If necessary, use multiple iterations to adjust calibration parameters (pitch, roll, and scale) and reprocess sample data set. Then generate entire lidar point file (9-column ASCII file). Transfer point file from NT workstation to UNIX workstation. Parse the 9-column lidar point file into 3.75-minute quarter-quadrangle components and apply elevation bias correction (determined during calibration step). There are some points in the file that only contain 5-columns. These are points that either the first or last pulse was not recorded. Processing done over 20020918-20030211.",
            "The 9-column post-processed data from University of Texas were provided in UTM projection (Zone 15) referenced to NAD83 with vertical elevations in meters referenced to the Geodetic Reference System 80 (GRS80) ellipsoid. The xyz values for the last return were extracted from the 9-column file. The data were converted to geographic coordinates using General Cartographic Transformation Program software developed by the United States Geological Survey. A vertical datum transformation was performed to convert vertical elevations referenced to GRS80 ellipsoid to NAVD88 using National Geodetic Survey (NGS) GEOID99 grids. The data were then converted to a binary format and loaded into the LIDAR Data Retrieval Tool (LDART) database.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Components NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2002_Texas_m13.xml",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2002_Texas_m13.xml&view=ISO19115Components-HTMLTable&title=Components%20NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2002_Texas_m13.xml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 609180969,
    "recordOffset": 609164575,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:2002_Texas_m13Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Component Title Date Citation Identifier 1 2002 Upper Texas Coast Lidar Point Data, Gulf of Mexico Shoreline in the Northeast 3.75-Minute Quadrant of the Lake Como 7.5-Minute Quadrangle: Post Fay Survey 2006-10-17 1 Air and Ground GPS files from 26102 2002-09-18 1 None 1 North American Datum 1983 2007-01-19 1 Raw lidar data output from ALTM 1225 2002-09-18 2 none Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}