{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Stones",
            "Sardonyx",
            "Sard",
            "Topaz",
            "Calcedony.",
            "Jasper.",
            "Emerald.",
            "Beryl.",
            "Amethyst.",
            "Jacinth.",
            "Chrisophrase.",
            "Crystal.",
            "Sapphire."
        ],
        [
            "Plants",
            "Sage",
            "Upright Vervain",
            "Bending Vervain",
            "Comfrey.",
            "Cyclamen.",
            "Calamint.",
            "Garlic.",
            "Wormwood.",
            "Pimpernel.",
            "Dock.",
            "Dragonwort.",
            "Birthwort."
        ],
        [
            "Trees",
            "Olive",
            "Myrtle",
            "Laurel",
            "Hazel.",
            "Chestnut.",
            "Pear.",
            "Box.",
            "Dogwood.",
            "Palm.",
            "Pine.",
            "Buckthorn.",
            "Elm."
        ],
        [
            "Birds",
            "Owl",
            "Dove",
            "Cock",
            "Ibis.",
            "Eagle.",
            "Sparrow.",
            "Goose.",
            "Woodpecker.",
            "Crow.",
            "Heron.",
            "Peacock.",
            "Swan."
        ],
        [
            "Animals",
            "She goat",
            "Billy goat",
            "Bull",
            "Dog.",
            "Stag.",
            "Pig.",
            "Ass.",
            "Wolf.",
            "Deer.",
            "Lion.",
            "Sheep.",
            "Horse.]"
        ]
    ],
    "pageTitle": "The Veritable Clavicles of Solomon (Les Veritables Clavicules de Salomon) (Abognazar) (EXCERPTS)",
    "title": "",
    "url": "http://esotericarchives.com/solomon/l1203.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00173-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 84967495,
    "recordOffset": 84877613,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1087=Edited from British Library, Lansdowne MS. 1203. 74 folios. 4°., 244317=Having made two of these slips, place one in each end of the stick and close the apertures up with pith, afterwards on a Friday in the month of February thou shalt fumigate the aforesaid stick with suitable incense thrice in the air, and having taken it thence thou shalt bury it in the earth under an elder-tree. Afterwards thou shalt expose it in the pathway by which the sportsman will pass, and once he has passed by it, he need not hope to kill any game during that day. If thou shalt wish a second time to lay a spell upon him in like manner, thou needest but to expose the stick again in his path; but take care to bury it again in the earth under an elder tree, so as to be able to take it from thence each time that thou shalt have need of it; and to take it up each time as soon as the Sportsman shall have passed., 4133=There is another manuscript of this text in the Bibliothèque nationale de France numbered Fr. 25,314, dated \"MDCXXXIV\" (1634), which can hardly be that old. Its title reads, \"LES CLAVICULES / DE SALOMON / Traduit de l'Hébreux en Langue Latine, / Par le Rabin Abognazar, / ET / Mis en langue Vulgaire Par M. BARAULT Archevêque d'Arles.\" It is 141 pages long. The calligraphy appears to be the same as Lans. 1203, and both appear to have been executed by 'F. F. FYOT.' Because each of these two manuscripts contain errors not found in the other it is likely that both were copied from a common ancestor, and not one from the other. In general the two texts coincide exactly, but there are also many places where the wording of the two vary slightly. Since the two versions are too close to make a retranslation likely, the apparent explanation for the differences is simply creativity on the part of the scribe., 349810=[46. figure. Cp. Mathers fig. 31. (M: Write thou this upon virgin parchment or paper with the blood of a bat, in the day and hour of Mars; and uncover it within the Circle, invoking the Demons whose Names are therein written; and thou shalt immediately see hail and tempest.) The versicle reads: Posuit pluvias eorum grandinem ignem coinburentem in terra justorum & destruxisti. Cp. Ps 104:32 \"posuit pluvias eorum grandinem ignem conburentem in terra ipsorum (33) et percussit vineas eorum et ficulneas eorum et contrivit lignum finium eorum\"], 227777=Then hang it from your collar with a cord, which has some wool from the stockings of the person that you desire. And every morning before sunrise during the entire the month of October, you will go to his or her door and say distinctly the word Amapoylfae, repeated twelve times. And on the first day of the following month this person will not be able to prevent themself from coming to find you, and ask what you desire and you will be able to do whatever you wish.], 1165=Copyright 2001, Joseph H. Peterson., 1241=This manuscript was one used by S. Liddell MacGregor Mathers in his edition of the Key of Solomon the King (Clavicula Salomonis) (London: George Redway, 1889). According to Mathers, \"1203 Lansdowne MSS. is 'The Veritable Keys of Solomon translated from the Hebrew into the Latin language by the Rabbin Abognazar (?Aben Ezra).' It is in French, exquisitely written in printing letters, and the Pentacles are carefully drawn in coloured inks. Though containing similar matter to the others, the arrangement is utterly different; being all in one book, and not even divided into chapters.\"}",
    "lastModified": "Sat, 13 Mar 2010 00:57:23 GMT",
    "textBeforeTable": "* (Included at least partially in Mathers' edition of the Key of Solomon.) Notice * The pentacles 28 mansions of the moon The characters of the 12 rings for binding spirits How to render yourself master of a treasure possessed by the spirits * How to make the magic carpet proper for interrogating intelligences * How to make the magic garters * How to know who has committed a theft * To hinder a sportsman from killing any game * One to render oneself invisible * Another for the same subject Another for the same subject For Love The ten names of God [Concerning the nature of the spirits] Consecration of the book * Exorcism of the victim Exorcism of the garment Exorcism of the place intended for performing the operations Manner of cutting the other staff, to be used for all the operations Exorcism of the staff for operations of Venus Exorcism of the burner, fire, and incense Exorcism of the pen quills Exorcism for the cup, wherein one puts the blood Blessing of the ink bottle Exorcism of the burin * Exorcism of",
    "textAfterTable": "Premiérement, il faut que tu sache que Dieu ayant fait toutes choses pour lui être soumises, il à bien voulu porter ses oeuvres jusqu'au dégré le plus parfait en faisant un ouvrage qui participe, du Divin & du Terrestre, c'est-à-dire l'homme, [8] dont le Corps est grossier & terrestre, & l'ame Spirituelle & céleste, auquel il a soumis toute la terre & ses habitans, & lui a donné des moyens par lesquels il peut se rendre les Anges familiers que j'appelle Créatures célestes, qui sont déstinés, les vns à regler le mouvement des Astres, les vns a habiter les Elémens, les autres à aider & conduire les hommes, & les autres à chanter continuellement les Louanges du Seigneur; tu peux donc par le moyen de leurs Sceaux & Caracteres teles rendre familiers pourvu~ que tu n'en abuse pas en exigeant d'eux des choses qui leurs sont contraires, car maudit celui qui prendra le Nom de Dieu en vain & qui mal emploira les sciences & les biens dont il nous a enrichis. Firstly. It is necessary for thee to understand that God, having made all things, in order that they may be submitted unto Him, hath wished to bring His works to perfection, by making one which participates of the Divine and of the Terrestrial, that is to say, Man; whose body is gross and terrestrial, while his soul",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}