{
    "relation": [
        [
            "PROPNAME",
            "SecureMode",
            "AXFWalletPath",
            "AXFWalletKey",
            "AXF_SOAP_POLICY",
            "AXF_SOAP_SECURITY",
            "AXF_SOAP_USER",
            "AXF_OAF_REDIRECT_PAGE_URL"
        ],
        [
            "PROPVALUE",
            "OFF",
            "file:walletpath",
            "AXFWalletKey",
            "USER_NAME_TOKEN",
            "TRUE",
            "weblogic",
            "http://EBS Host : EBS Port/OA_HTML/OA.jsp?page=/oracle/apps/ak/ucm/axf/webui/RedirectToAxfPG"
        ]
    ],
    "pageTitle": "B Managed Attachments Solution Tables",
    "title": "",
    "url": "http://docs.oracle.com/cd/E23943_01/doc.1111/e17953/e02_tables_attchmts.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00296-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 77471979,
    "recordOffset": 77442173,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{58432=extraParamName: Extra parameter to be passed as metadata from the business application to Content Server in check-in or scan forms. See Section 6.6.14, \"Passing Extra Metadata Values From a Business Application to Content Server.\", 136691=Use the PS_AXF_CMD_PARAMS Table to configure a label for the list of attachments. You can use a combination of constant and data values to display key information. Similar to configuring labels, you can also add rows to pass in extra metadata values, as described in Section 6.6.14, \"Passing Extra Metadata Values From a Business Application to Content Server.\", 164289=Use the PS_AXF_PROPERTIES table to define properties for AXF integration with Oracle PeopleSoft. See Section 6.6.15, \"Resizing Oracle PeopleSoft Popup Solution Windows.\", 38865=AXF_PAPERCLIP: Set to TRUE to enable the Oracle E-Business Suite native attachments paperclip option, or FALSE (default) to disable it. See Section 6.6.13., 6818=USERNAME_PASS_THROUGH: When set to FALSE for an imaging solution, this parameter allows an authenticated Oracle WebLogic Server user to perform tasks, such as BPEL tasks, rather than the user passed from Oracle E-Business Suite or Oracle PeopleSoft. Note that this parameter must be set to TRUE for Managed Attachments configurations. See Section 6.6.17., 36291=Use the AXF_PROPERTIES table to define properties for AXF integration for Oracle E-Business Suite. You can also use its AXF_PAPERCLIP property to enable or disable the paperclip (display attached document) feature, as described in Section 6.6.13.}",
    "lastModified": "Wed, 13 May 2015 05:20:58 GMT",
    "textBeforeTable": "Table B-23 Example OAF_AXF_PROPERTIES Table This example table shows the default properties values. B.3.2.2 Example Implementation Specifies the property's value. PROPVALUE AXF_OAF_REDIRECT_PAGE_URL: Specifies the URL to the custom intermediate OAF page. This URL is configured in Section 2.3.1. It begins with https:// if SSL is configured on the Oracle E-Business Suite instance. AXF_SOAP_USER: Specify the SOAP userid used in the SOAP header for authentication, as described in Section 2.4.1. AXF_SOAP_SECURITY: Specify TRUE to enable SOAP security, as described in Section 2.4.1. This setting is required. AXF_SOAP_POLICY: Specify the name of the SOAP policy to use. The currently supported policy is USER_NAME_TOKEN. AXFWalletKey: Specify the key for the AXF wallet password, to be retrieved from the Oracle E-Business Suite vault. AXFWalletPath: Certificate location (path). SecureMode: To enable SSL, set this property to ON, and set values for AXFWalletPath and AXFWalletKey properties. Specifies properties to use. Properties include: PROPNAME Description Column",
    "textAfterTable": "B.3.3 OAF_AXF_COMMANDS Table (Oracle E-Business Suite OAF) This table stores the different commands configured for a particular OAF page. Each command is associated with an EVENT_ID, which refers to the ID of the button/link embedded on an OAF page via personalization (configured in Section 2.3). B.3.3.1 Column Description Table B-24 Column Description for OAF_AXF_COMMANDS Table Column Name Description AXF_CMDS_ID Specifies the primary key of the table, used to identify the unique command. AXF_CONFIG_ID Specifies the foreign key to the OAF_AXF_CONFIGS Table (Oracle E-Business Suite OAF), which associates this unique command with a particular page and component on the page. AXF_EVENT_ID Specifies the event being executed in the user interface. The AXF_EVENT_ID corresponds to the ID for the button or link added via personalization to invoke AXF functionality. Available options include: MAButton (for Managed Attachments) IPM_BUTTON",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}