{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The security guards will escort you to your car at night if you feel unsafe when leaving a late class.",
            "I am Phi Theta Cappa.",
            "There is a long list of clubs that put on many events.",
            "This school is great for any type of student, even students with disabilities.",
            "As for unusual, I am not sure. But they do have the Festival of Cultures each year. It covers a lot of different cultures. They serve food (free) from several different cultures. There are live performances, booths that represent each culture, and decorations. It is lively and free to students and the public.",
            "Pellissippi is one of the lowest tuition colleges in the area. They offer an excellent education at a reasonable price.",
            "There are many clubs. There are also a lot of events. The school is very active. And the Knoxville area has lots of attractions.",
            "There are restaurants in the area. The on-campus cafeteria is pretty good too. And there prices are about like any where else.",
            "It really depends on what you are taking. As in all things, some things are easier because you like them and others are harder because you have no interest in them. But this is a college and they expect you to learn.",
            "Keep a schedule. Don't wait until the last moment. Check with your advisers before making changes to your course load.",
            "The college is easy to navigate. The instructors are very helpful and want to see you succeed. It is a great learning environment."
        ]
    ],
    "pageTitle": "Pellissippi State Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pellissippi-State-Community-College/reviews?_escaped_fragment_=/show/67544",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00059-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 882031855,
    "recordOffset": 881981019,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{263602=© 2015, Cappex.com, LLC, 132694=Submit your FAFSA before mid January to ensure funding, most scholarships and grants run out of funds by end of January. Go to your teachers for advising, not the student advising center.}",
    "textBeforeTable": "10/31/2010 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 60 Shannon from Maryville, TN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Am enjoying being here The campus is beautiful, but the ability to go to class in the middle of the night via the Internet is terrific. Am learning a lot The instructors at PSTCC are very good at helping the motivated student learn. The advising is first rate. For those of us that are disabled, Student Services With Disabilities is unparalled. Login to rate or flag the reviews Nicolas from Knoxville, TN 02/23/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 60 Categories Comments Great for these types of students Pellissippi is great for any student just starting college. Tips for prospective students I know it sounds corny but Pellissippi truly deserves all five stars. It would be a great idea to come here. Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}