{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "35.64",
            "39.38",
            "51.71",
            "56.41"
        ],
        [
            "NSE",
            "35.61",
            "39.35",
            "51.70",
            "56.41"
        ]
    ],
    "pageTitle": "Uttam Galva Steel Stock Price, Share Price, Live BSE/NSE, Uttam Galva Steel Bids Offers. Buy/Sell Uttam Galva Steel news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/steel-gp-gc-sheets/uttamgalvasteel/UGS01",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00286-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 582539887,
    "recordOffset": 582488354,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{131878=28 July 2015, 204075=Uttam Galva is in the Steel - GP & GC Sheets sector. The current market capitalisation stands at Rs 503.60 crore. The company management includes Rajinder Miglani - Non Executive Chairman, Anuj R Miglani - Managing Director, Ankit Miglani - Non Executive Director, Gursharan S Sawhney - Director - Finance & CFO, S G Tudekar - Director - Works, Swarna Prabha Sukumar - Director, O P Gahrotra - Independent Director, D L Rawal - Independent Director, S T Parikh - Independent Director. It is listed on the BSE with a BSE Code of 513216 and the NSE with an NSE Code of UTTAMSTL. Its Registered office is at 69, Uttam House, P Dmello Road, Mumbai,Maharashtra - 400009. Their Registrars are Universal Capital Securities Pvt. Ltd., 202768=Zensar Technologies Recommended on Mar 24th 2015, 133096=JSWSteel Jul Fut, 132389=UnitedBrewerie Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}