{
    "relation": [
        [
            "",
            "04/04",
            "11/04",
            "18/04",
            "25/04",
            "01/05",
            "08/05",
            "13/05",
            "22/05",
            "30/05",
            "06/06",
            "13/06",
            "20/06",
            "27/06",
            "05/09",
            "12/09",
            "19/09"
        ],
        [
            "nights min.",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "4",
            "3",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2"
        ],
        [
            "Price per night in €",
            "100€",
            "78€",
            "87€",
            "96€",
            "110€",
            "110€",
            "208€",
            "183€",
            "78€",
            "78€",
            "77€",
            "81€",
            "95€",
            "78€",
            "78€",
            "78€"
        ]
    ],
    "pageTitle": "camping normandie au coeur des plages du débarquement",
    "title": "",
    "url": "http://www.camping-lesvikings.com/en/the-normandy-landings-beaches.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00108-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 344370387,
    "recordOffset": 344346083,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{17811=http://www.arromanches360.com/ http://www.ot-arromanches.fr/ The American Cemetery at Colleville Sur Mer The American Cemetery at Colleville Sur Mer is is an American military cemetery. In the cemetery are buried the bodies of 9,387 soldiers, including 307 unknown and four women, mostly dead on D-Day or in the weeks following the fighting in Normandy. The Caen Memorial, Esplanade Eisenhower BP 55026, 14050 Caen This \"museum for Peace brings together a number of objects of daily life under the occupation by Nazi Germany, plans and models of war machines including a Hawker Typhoon ceiling of the entrance. The different stages of the conflict, particularly the Battle of Normandy and the advance of Allied forces in France, are presented as well as the history of the Holocaust. http://www.memorial-caen.fr/portail/ Mother Church St This is one of the first municipalities in France released June 6, 1944 at the Battle of Normandy. Leaving the Airborne Museum, you'll have the poignant memory of these tragic hours and pulled Sainte Mere Eglise, his church and its surroundings, in history. Private John Steele became famous for being left hanging on the steeple of the church. http://www.airborne-museum.org/page.php?page=presentation, 19793=The landing beaches Museum of liberation in Cherbourg, Fort du Roule, Cherbourg 50100 The visitor is immersed in a scenic route of the invasion reconstruction. The rooms at the rate of successive milestones of this period ... The museum is mainly focused on the daily lives of civilians in and around Cherbourg. Different topics are discussed on the daily access of civilians during the war (the system D, games ...), the soldiers (the equipment of GI'S, prisoners of war ...). It is housed in an old fort of the Second Empire, occupied by the German army during World War II. Was taken over by the Allies, June 25, 1944, is a symbol of the liberation of Cherbourg. http://www.cotentin-tourisme.com/cotentin-tourisme-musee-de-la-liberation.html The Pointe du Hoc, D 514, 14450 Cricqueville-en-Bessin Small step on the Normandy coast in the Channel. It overlooks a cliff 25 to 30 meters high with a shingle beach about ten meters wide at its feet. It was the scene of one of the Allied landings in Normandy June 6, 1944. Located between the beaches of Utah Beach (west) and Omaha Beach (east), the point had been fortified by the Germans and, according to Allied aerial reconnaissance was equipped with heavy artillery which threatened the scope the two nearby beaches. Arromanches Located in the heart of the landing beaches, Arromanches is now a village known worldwide thanks to the presence of the remains of the famous artificial harbor. During the Normandy landings, weeks before D-Day, the Allies established a temporary artificial port to allow the landing of heavy equipment, without waiting for the conquest of deep-water ports such as Le Havre and Cherbourg. Come visit the museum! The film mixes archival footage filmed novel in June 1944 by war correspondents, with current shots on the same site, now restored to peace. Today, Arromanches 360 cinema is the only open circular France.}",
    "textBeforeTable": "Prices Pitches 80m² 2 person(s) accès direct Validate 1 2 3 4 5 6 NB of people. Date of departure Date of arrival",
    "textAfterTable": "7 36€ 30/08 05/09 2 26€ 06/09 19/09 2 22€ Cottage Pirate 2room 25m² 4 person(s) Prices 03/04 17/04 18/04 09/05 10/05 12/05 13/05 16/05 17/05 21/05 22/05 24/05 25/05 06/06 07/06 19/06 20/06 03/07 04/07 10/07 11/07 24/07 25/07 31/07 01/08 15/08 16/08 22/08 23/08 29/08 30/08 19/09 2 7 2 52€ 59€ 52€ 75€ 52€ 75€ 52€ 39€ 55€ 89€ 122€ 130€ 137€ 125€ 89€ 52€ Weekend package 04/04 11/04 18/04 25/04 01/05 08/05 13/05 22/05 30/05 06/06 13/06 20/06 27/06 05/09 12/09 19/09 2 4 3",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}