{
    "relation": [
        [
            "Postage and handling",
            "Free postage",
            "AU $3.00",
            "AU $32.00"
        ],
        [
            "Each additional item",
            "Free",
            "AU $0.50",
            "AU $0.10"
        ],
        [
            "To",
            "United States",
            "United States",
            "United States"
        ],
        [
            "Service",
            "AusPost Air Mail Parcel",
            "Standard International Flat Rate Postage",
            "AusPost Express Courier International"
        ],
        [
            "Delivery*",
            "Estimated between Wed. 12 Aug. and Thu. 3 Sep. Seller ships within 1 day after receiving cleared payment - opens in a new window or tab.",
            "Estimated between Wed. 12 Aug. and Thu. 3 Sep. Seller ships within 1 day after receiving cleared payment - opens in a new window or tab.",
            "Estimated between Wed. 5 Aug. and Fri. 7 Aug. Seller ships within 1 day after receiving cleared payment - opens in a new window or tab."
        ]
    ],
    "pageTitle": "AC 100 240V Converter Adapter DC 6V 1A 6W Power Supply 1000mA AU 5 5mm X 2 1mm | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/AC-100-240V-Converter-Adapter-DC-6V-1A-6W-Power-Supply-1000mA-AU-5-5mm-x-2-1mm-/221399187065",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00193-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 424066652,
    "recordOffset": 424022104,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter five or nine numbers for the postcode. Please enter a valid postcode. Postcode: Select a valid country. There are 476 items available. Please enter a number less than or equal to 476. -Select- Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Republic Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Virgin Islands Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Islands Cayman Islands Central African Republic Chad Chile China Colombia Comoros Congo, Democratic Republic of the Congo, Republic of the Cook Islands Costa Rica",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Will usually post within 1 business day of receiving cleared payment - opens in a new window or tab. Return policy Item must be returned within Refund will be given as 14 days after the buyer receives it Money Back The buyer is responsible for return postage costs.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}