{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "you will get hit by a car on this campus as i have and then the hospital that they take you to up here is worse than useless, they almost killed me. if you are accident prone, the hospitals will not help your case.",
            "the frats are pretty big here but there are only a few along with the sororities.",
            "several clubs affiliated with the school and intramurals are really big here.",
            "quiet students who do not mind not having a nightlife.",
            "one of the dorm houses is apparently haunted.",
            "good not great, i could have done better.",
            "the mall and some bars.",
            "the main cafeteria is awful but there are several places on campus with good food like chik-fil-a.",
            "not much to do. too strict while living in a dorm. only plus is convenience.",
            "prerequisites are easy however, the sciences are extremely difficult here.",
            "consider how much partying you want to do. another school may be a better choice. if you do not like the cold, stay far away.",
            "average school with beautiful view. campus life is dismal at best. there are several things to do during the day but the city quiets down at night."
        ]
    ],
    "pageTitle": "East Tennessee State University (ETSU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/East-Tennessee-State-University/reviews?_escaped_fragment_=/show/71221",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00176-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904161903,
    "recordOffset": 904087563,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{271705=Be aware of Biology for Majors 1110 with Dr. Wild. It is an intense course and would only reccommend it if you are willing to study every night for 3-5 hours., 367952=Touring in December, 130853=There is a nature/ hiking trail on campus. Not to mention, the entire city is surrounded by beautiful mountains. The newest edition to ETSU campus is the disk golf course they added this past 2011-2012 school year., 368155=I look forward to my visit at ETSU in December. I have heard great things about the campus and plan to study pharmacy., 74759=Pay attention to the March 15th deadline to apply for scholarships. There are some scholarships you can only apply for before your first year at ETSU., 367337=Touring in December, 184138=Familiarize yourself with a map of the campus. Get things done early to avoid lines. Parking is hardest to come by in the first couple of weeks, so arrive early, or pick classes later in the afternoon. A parking garage is being added (2012-ish), so parking may get better., 367642=Touring in December, 402926=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/29/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 97 Morgan from Bluff City, TN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Login to rate or flag the reviews Austin from Mountain City, TN 04/27/2012 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 person found it offensive. 3 of 97 Categories Comments Campus Safety Campus police are always around. Greek Life Frats hold plays, parties, and parking lot amusement. Always something going on with the Greeks. Clubs and Activities Every club you can think of. My roommate leads the quidditch club. Great for these types of students If you want a little space. There is lots of room around campus and classes are flexible and varied. Share any unusual traditions or locations on campus Everyone studies. Weird. Bang for the buck Living in Tennessee it was really affordable for me. In a great location mid-town with lots",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}