{
    "relation": [
        [
            "Day",
            "Monday",
            "Monday",
            "Monday",
            "Monday",
            "Monday",
            "Monday",
            "Monday",
            "Monday",
            "Monday",
            "Monday",
            "Monday",
            "Monday",
            "Monday",
            "Monday",
            "Monday",
            "Monday"
        ],
        [
            "Date",
            "September 3",
            "September 10",
            "September 17",
            "September 24",
            "October 1",
            "October 8",
            "October 15",
            "October 22",
            "October 29",
            "November 5",
            "November 12",
            "November 19",
            "November 26",
            "December 3",
            "December 10",
            "December 17"
        ],
        [
            "Visiting Team",
            "Dallas Cowboys",
            "Washington Redskins",
            "Miami Dolphins",
            "San Diego Chargers",
            "Cincinnati Bengals",
            "San Francisco 49ers",
            "Green Bay Packers",
            "Los Angeles Rams",
            "Seattle Seahawks",
            "Atlanta Falcons",
            "Los Angeles Raiders",
            "Pittsburgh Steelers",
            "New York Jets",
            "Chicago Bears",
            "Los Angeles Raiders",
            "Dallas Cowboys"
        ],
        [
            "Final Score",
            "20-13",
            "31-37",
            "21-17",
            "30-33",
            "17-38",
            "31-10",
            "14-17",
            "24-10",
            "24-0",
            "14-27",
            "14-17",
            "24-27",
            "17-28",
            "7-20",
            "24-3",
            "21-28"
        ],
        [
            "Home Team",
            "Los Angeles Rams",
            "San Francisco 49ers",
            "Buffalo Bills",
            "Los Angeles Raiders",
            "Pittsburgh Steelers",
            "New York Giants",
            "Denver Broncos",
            "Atlanta Falcons",
            "San Diego Chargers",
            "Washington Redskins",
            "Seattle Seahawks",
            "New Orleans Saints",
            "Miami Dolphins",
            "San Diego Chargers",
            "Detroit Lions",
            "Miami Dolphins"
        ],
        [
            "Stadium",
            "Anaheim Stadium",
            "Candlestick Park",
            "Rich Stadium",
            "Los Angeles Memorial Coliseum",
            "Three Rivers Stadium",
            "Giants Stadium",
            "Mile High Stadium",
            "Atlanta-Fulton County Stadium",
            "Jack Murphy Stadium",
            "Robert F. Kennedy Memorial Stadium",
            "Kingdome",
            "Louisiana Superdome",
            "Miami Orange Bowl",
            "Jack Murphy Stadium",
            "Pontiac Silverdome",
            "Miami Orange Bowl"
        ]
    ],
    "pageTitle": "List of Monday Night Football results (1970–89) - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/List_of_Monday_Night_Football_results_(1970%E2%80%9389)",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00155-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 880264527,
    "recordOffset": 880225560,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{702=Beginning in the 1970 NFL season, the National Football League began scheduling a weekly regular season game on Monday night before a national television audience. From 1970-2005, the ABC television network carried these games, with the ESPN cable television network taking over beginning in September 2006. Listed below are games played from 1970-1989.}",
    "TableContextTimeStampAfterTable": "{71985=The December 8 game will be forever remembered for Howard Cosell's announcement of the murder of John Lennon during the fourth quarter. ABC News' Nightline provided live coverage of Lennon's death shortly after the conclusion of the game., 110526=The November 18 game between the Giants and the Redskins is infamous for Lawrence Taylor's tackle that ended Joe Theismann's career; as Theismann ended up breaking his leg on the play., 101176=An early season snowstorm in the October 15 game at Denver caused the Packers to fumble on their first two plays. Both fumbles were returned for Broncos touchdowns., 7897=The October 19 game between the Washington Redskins and Oakland Raiders was originally scheduled as a coaching matchup between Vince Lombardi of the Redskins and the Raiders' second-year mentor, John Madden. However, Lombardi died of colon cancer six weeks before the contest., 54980=The September 18 game between the Colts and the Patriots featured a Monday Night Football-record 41 points scored between the two teams in the fourth quarter, 27 by the Colts. Colts running back Joe Washington had a memorable performance, scoring or helping score his teams' final three touchdowns. His catch of a touchdown pass tied the game at 20-20, and then he threw an option pass to Roger Carr to put the Colts ahead 27-20. After the Patriots tied it late, Washington returned the ensuing kickoff 96 yards for the winning touchdown., 8931=The November 23 game became infamous when Howard Cosell slurred his way through the first half and vomited on Don Meredith's boots at halftime. Cosell left Franklin Field prior to the second half, leaving Meredith to finish the game with Keith Jackson., 64568=In the November 12 game between the Eagles and the Cowboys, Eagles kicker Tony Franklin booted a 59-yard field goal., 141074=1989 also marked Monday Night Football's 20th season, and Hank Williams, Jr made his debut to the program with his hit \"All My Rowdy Friends\"., 127686=The November 30 Raiders/Seahawks game marked the memorable Monday Night Football debut of Bo Jackson, with his 91-yard touchdown run., 28788=The October 8 game ended in dramatic fashion as Redskins safety Ken Houston stopped Cowboy running back Walt Garrison at the Washington one-yard-line as time expired to preserve a 14-7 Redskin victory., 110967=The December 2 game between the Bears and the Dolphins, when the Dolphins put an end to the Bears' bid to match their undefeated season in 1972, was and still is the highest rated game in Monday Night Football history., 118215=The October 27 game took place at the same time as Game Seven of the 1986 World Series at Shea Stadium in nearby Flushing, New York., 84782=This was the season in which a nine-week players strike forced the NFL to postpone seven regular season games. The September 20 game between the Packers and the Giants would be the last game played until November 21. The Packers-Giants game was the first Monday Night game hosted by the Giants., 125306=There was a player strike called after the completion of Week 2's games. As a result all games for Week 3 were canceled but unlike the 1982 players' strike, owners decided to resume play with replacement players. Replacement players were used in games played from Week 4 until Week 6 (including the 49ers-Giants, Raiders-Broncos, and Redskins-Cowboys MNF games). Once a new collective bargaining agreement ended the strike, regular players came back and played starting with Week 7., 15932=Wide receiver Dave Smith of the Pittsburgh Steelers became a part of Monday Night Football lore with an infamous mistake in the October 18th game against the Kansas City Chiefs. Smith was en route to scoring on a 50-yard pass play when he raised the ball over his head before reaching the end zone. Smith lost control of the ball, thinking he had already scored, with the mistake resulting in a touchback for the Chiefs., 50275=The September 26 game was decided in overtime on Don Cockroft's 35-yard field goal with 10:15 left in the extra session., 93350=Future Hall of Fame quarterback Dan Marino made his NFL debut in the September 19 game between the Raiders and the Dolphins., 126396=The October 26 game between the Broncos and the Vikings was rescheduled because Game 7 of the 1987 World Series (which was also broadcast by ABC), which featured the Minnesota Twins, had to play at the Hubert H. Humphrey Metrodome on Sunday night, when the Vikings were originally slated to host the Broncos. Therefore, the game was moved to Monday night, and was played simultaneously with the Browns-Rams game. Coincidentally, the Browns had been slated to host the Broncos in the canceled Monday night game (in a rematch of The Drive)., 110015=The October 28 game marked the final Monday night appearance at home for the Los Angeles Raiders until their return to Oakland in 1995., 140285=The December 11 game between the 49ers and the Rams had John Taylor become the first player in NFL history to score two touchdowns of over 90 yards in a single game., 78455=The December 7 game between the Oakland Raiders and Pittsburgh Steelers would mark the final Monday night game played in Oakland prior to the Raiders' move to Los Angeles. The next Monday night game played in Oakland would be held in 1996; one year after the Raiders' return to Oakland in 1995., 92391=The September 5 game between the Cowboys and the Redskins was when Howard Cosell referred to Redskins wide receiver Alvin Garrett as a \"little monkey.\" Cosell would also call his final MNF game on December 12 between the Packers and the Buccaneers, as he did not make the trip to the west coast for the last game of the season., 64927=In the December 3 Raiders/Saints game, Ken Stabler rallied the Raiders from a 35-14 deficit. He threw an 8-yard touchdown pass to Cliff Branch for the winning score., 38924=The Oakland Raiders' defeat of the Miami Dolphins on September 22 ended the Dolphins 31-game home winning streak. During this game, ABC switched at halftime to ABC News anchor Harry Reasoner for an update on the assassination attempt on President Ford by Sara Jane Moore earlier that day., 55854=The November 20 game between the Dolphins and the Oilers featured a memorable performance by Oilers' rookie running back Earl Campbell. Campbell rushed for 199 yards and four touchdowns in a nip-and-tuck game that was capped off by his 81-yard scoring run in the fourth quarter., 117636=The September 8 game between the New York Giants and the Dallas Cowboys marked the NFL debut of Herschel Walker., 45816=1976 also marked the program using a new theme song for the introduction., 140681=The December 25 game between the Bengals and the Vikings was the first NFL game played on Christmas since the 1971 playoffs., 16998=The December 13 game saw the triumphant return of George Allen to the Los Angeles Memorial Coliseum, where he coached the Los Angeles Rams for five seasons (1966–70). Allen's new team, the Washington Redskins, clinched its first playoff berth since 1945 with a 38-24 victory over the Rams, also handing the NFC West championship to the San Francisco 49ers. Ironically, the 49ers ousted the Redskins from the playoffs with a 24-20 victory 13 days later. In addition, one of the contestants for an NFL Punt, Pass and Kick contest shown during the game would be future Philadelphia Eagles and Kansas City Chiefs head coach Andy Reid., 94737=Both of the Redskins' regular season losses during the 1983 season came on Monday Night (Week 1 to Dallas; Week 7 to Green Bay) by a margin of 1 point in each game., 15480=The October 11 game was the final NFL contest played in the Cotton Bowl. The Dallas Cowboys moved into Texas Stadium for its next home game on October 24 vs. the New England Patriots., 64148=The October 1 game at Lambeau Field marked the first time ever that a Monday Night Football game had taken place in Green Bay. The three previous Packers home games in the series had taken place in Milwaukee (1970, 1971, and 1973)., 50462=The October 10 game was Joe Namath's last NFL start and last NFL game., 29110=The Minnesota Vikings entered the November 19th game in Atlanta with a spotless 9-0 record, but left with their first loss. The Falcons jumped out to a 17-7 halftime lead, then held on as the Vikings came up one yard short on fourth down at the Atlanta 39 with 55 seconds to play. The victory was the Falcons sixth in a row., 23010=The November 27 game saw the Miami Dolphins make their lone primetime appearance during their 17-0 season. The Dolphins had little trouble in dispatching the outclassed St. Louis Cardinals, one of seven games the Dolphins won that season against teams which won four or fewer games., 16581=The November 1 game between the visiting Detroit Lions and the Green Bay Packers ended in a 14-14 tie at County Stadium in Milwaukee. The first tie in the history of the Monday Night Football series., 110311=In the November 11 game, a thrown snowball caused the 49ers to miss an extra point, a determining factor in the team's one-point loss., 44504=This season saw the first Monday night overtime game since overtime was instituted in 1974, as the Redskins kicked a field goal in the extra period to beat the Eagles 20-17., 133490=The September 12 game between the Cowboys and the Cardinals was the first game the Cardinals played in Arizona after relocating from St. Louis., 118564=The Sunday, December 7 game between the Los Angeles Rams and Dallas Cowboys is remembered for Cowboys head coach Tom Landry being escorted off the field before the start of the 4th quarter due to Anaheim police learning of a threat on Landry's life. Landry would return after being fitted with a bulletproof vest.[1], 109782=The October 21 game is memorable for rookie Bears defensive lineman William Perry scoring a rushing touchdown after entering the game as an extra backfield blocker., 63424=The September 4 opening game between the Pittsburgh Steelers and New England Patriots was stopped for more than five minutes in the second quarter to acknowledge former Patriots wide receiver Darryl Stingley, who was seated in a luxury box at Schaefer Stadium. Stingley had suffered a career-ending injury 13 months earlier that had left him a quadriplegic., 34182=Facing huge competition from the October 28 CBS broadcast of the wedding of Rhoda Morgenstern on Rhoda and NBC's November 18 broadcast of The Godfather, ratings for Monday Night Football take a hit for those two contests., 108701=The September 19 Thursday night game is memorable for Bears QB Jim McMahon's third quarter performance. Bears coach Mike Ditka elected not to start McMahon because of various ailments keeping him out of practice all week. ABC cameras kept showing McMahon begging Ditka to put him in the game. Finally, with the Vikings leading 17-9, McMahon entered the game and threw a 70-yard TD to Willie Gault on his first snap. The Bears immediately got the ball back at the Vikings' 25-yard line on the next series on a Wilber Marshall fumble recovery, and McMahon hit Dennis McKinnon on the very first play for a TD. Then, on the very next series, McMahon completed 3 of 5 passes and another TD to McKinnon. For the third quarter, McMahon had taken seven snaps and completed five passes for three TD's., 45348=The October 18 game featured Alex Karras singing a fight song written for the New York Jets by then-head coach Lou Holtz before the kickoff (which was repeated for the NFL Top 10 series in the episode on \"Coaches Who Belonged in College\")., 8498=Following their humiliating shutout in the November 16 game, the Cowboys would go on a seven-game winning streak, not losing until a deciding field goal in the final seconds of Super Bowl V against the Baltimore Colts., 71750=The November 24 game was the one where New Orleans Saints fans, watching what would become a dreadful 1-15 campaign that season, began wearing paper bags over their heads and referring to the team as the \"Aints\"., 93893=The October 24 game between the Cardinals and the Giants is the only five-quarter deadlock in MNF history, as the Cardinals' Neil O'Donoghue blows three field goal attempts in the extra period, one of them from extra-point distance. It was also the first overtime game on a Monday night since Howard Cosell announced the death of John Lennon in 1980., 139678=The November 6 game between the Saints and the 49ers was originally scheduled for New Orleans but was switched with their October 8 game when the San Francisco Giants played in the NLCS., 27892=During what would be Don Meredith's final season of his first Monday Night stint, he was the center of three incidents in a three-week stand. In the Oakland-Denver game on October 22, Meredith famous quipped, \"We're in the Mile High City, and so am I\" (referring to his marijuana use at the time), followed by his drinking through the Buffalo-Kansas City game the following week. Finally, on November 5 during the Steelers-Redskins matchup, he referred to President Richard Nixon by the nickname of \"Tricky Dick\"., 138908=The October 9 game between the Raiders and the Jets was the first game for Art Shell as the Raiders head coach, becoming the first African-American NFL head coach in the modern era (Shell had been named interim head coach following the firing of Mike Shanahan)., 5393=First name listed is the stadium/team's name heading into 1990. All names were seen in the package at least once in this era., 22313=The October 9 game between the Oakland Raiders and Houston Oilers at the Astrodome is infamous for an awkward off-field incident. During the game, which the Raiders won in a 34-0 shutout, ABC cameras had panned out and showed several fans leaving. A cameraman caught one of the few to stay in the game, who showed his disgust with the Oilers' performance by raising his middle finger, prompting Don Meredith to quip, \"We're number 1 in the nation.\", 33979=The October 14 game between the Lions and 49ers marked the final Monday Night Football game ever at Tiger Stadium., 56321=The November 27 game between the Pittsburgh Steelers and San Francisco 49ers kicked off at 6 p.m. Pacific time, just hours after San Francisco mayor George Moscone and city supervisor Harvey Milk were murdered at City Hall by former supervisor Dan White. NFL commissioner Pete Rozelle, a former publicity director at the University of San Francisco, did not consider postponing the game. During the game, a large protest march to the steps of City Hall took place. A rarely discussed moment happened before the game just prior the national anthem. The stadium observed a moment of silence to honor the fallen mayor. Between that and the national anthem a truck backed into the stadium flag pole sending it crashing to the ground. It was a large wooden pole near the southern end zone. It shocked the crowd who were already uneasy from a very tragic day in San Francisco., 85291=In the January 3 game between the Cowboys and the Vikings, Cowboys running back Tony Dorsett ran for 99 yards and a touchdown - still the longest running play from scrimmage in the NFL. Worth noting is that the Cowboys had only ten players on offense when the ball was snapped on that play, fullback, Ron Springs did not get on to the field, in time, after Minnesota kicked off to Dallas, in the third quarter., 33494=The season-opening contest in Buffalo on September 16 marked the start of a three-year stint for Alex Karras as a color commentator for the show. Karras had replaced Fred Williamson, who had originally replaced Don Meredith, but was dismissed after a poorly received effort during a few preseason contests., 134004=The October 3 game between the Cowboys and the Saints would be the final MNF game coached by Tom Landry., 44890=The October 11 game marked the first time the Rams had ever been shut out at Los Angeles Memorial Coliseum in their team history. The 49ers sacked Rams quarterback James Harris 10 times, six alone by defensive end Tommy Hart., 117939=The September 29 game was the last MNF game in St. Louis until 2000, when the Rams played their season opener at the Trans World Dome., 101557=The October 21 Sunday special game between the New Orleans Saints and Dallas Cowboys started at 9:45 EST due to ABC covering the second 1984 Ronald Reagan-Walter Mondale debate. This was the latest time a regular season NFL game started until 2006 - beginning that year, MNF would air two games in week 1, the second kicking off after 10:00 PM EDT.}",
    "lastModified": "Tue, 21 Jul 2015 16:28:32 GMT",
    "textBeforeTable": "The November 23 game became infamous when Howard Cosell slurred his way through the first half and vomited on Don Meredith's boots at halftime. Cosell left Franklin Field prior to the second half, leaving Meredith to finish the game with Keith Jackson. Following their humiliating shutout in the November 16 game, the Cowboys would go on a seven-game winning streak, not losing until a deciding field goal in the final seconds of Super Bowl V against the Baltimore Colts. The October 19 game between the Washington Redskins and Oakland Raiders was originally scheduled as a coaching matchup between Vince Lombardi of the Redskins and the Raiders' second-year mentor, John Madden. However, Lombardi died of colon cancer six weeks before the contest. 1970 NFL season[edit] 1970s[edit] Phoenix Cardinals - St. Louis Cardinals Los Angeles Raiders - Oakland Raiders Indianapolis Colts - Baltimore Colts Teams[edit] Jack Murphy Stadium - San Diego Stadium Foxboro Stadium - Schaefer Stadium (the facility did not host a",
    "textAfterTable": "Monday September 27 New York Jets 10-17 St. Louis Cardinals Busch Memorial Stadium Monday October 4 Oakland Raiders 34-20 Cleveland Browns Cleveland Stadium Monday October 11 New York Giants 13-20 Dallas Cowboys Cotton Bowl Monday October 18 Pittsburgh Steelers 16-38 Kansas City Chiefs Municipal Stadium Monday October 25 Baltimore Colts 3-10 Minnesota Vikings Metropolitan Stadium Monday November 1 Detroit Lions 14-14 Green Bay Packers Milwaukee County Stadium Monday November 8 Los Angeles Rams 17-24 Baltimore Colts Memorial Stadium Monday November 15 St. Louis Cardinals 17-20 San Diego Chargers San Diego Stadium Monday November 22 Green Bay Packers 21-28 Atlanta Falcons Atlanta Stadium Monday November 29 Chicago Bears 3-34 Miami Dolphins Miami Orange Bowl Monday December 6 Kansas City Chiefs 26-17 San Francisco 49ers Candlestick Park Monday December 13 Washington Redskins 38-24 Los Angeles Rams Los Angeles Memorial Coliseum 1972 NFL season[edit] The October 9 game between the Oakland Raiders and Houston Oilers at the Astrodome is infamous for an awkward off-field incident. During the game, which the Raiders won in",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}