{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3",
            "Step 4"
        ],
        [
            "Command or Action",
            "configure Example: RP/0/RP0/CPU0:router# configure",
            "interface type interface-path-id Example: RP/0/RP0/CPU0:router(config)# interface POS 0/1/0/3",
            "Do one of the following: ipv6 address ipv6-prefix / prefix-length [eui-64] ipv6 address ipv6-address link-local ipv6 enable Example: RP/0/RP0/CPU0:router(config-if)# ipv6 address 2001:0DB8:0:1::/64 eui-64 or RP/0/RP0/CPU0:router(config-if)# ipv6 address FE80::260:3EFF:FE11:6770 link-local or RP/0/RP0/CPU0:router(config-if)# ipv6 enable",
            "Use one of the following commands: end commit Example: RP/0/RP0/CPU0:router(config)# end or RP/0/RP0/CPU0:router(config)# commit"
        ],
        [
            "Purpose",
            "Enters global configuration mode.",
            "Enters interface configuration mode.",
            "Specifies an IPv6 network assigned to the interface and enables IPv6 processing on the interface. or Automatically configures an IPv6 link-local address on the interface while also enabling the interface for IPv6 processing. The link-local address can be used only to communicate with nodes on the same link. Specifying the ipv6 address eui-64 command configures site-local and global IPv6 addresses with an interface identifier (ID) in the low-order 64 bits of the IPv6 address. Only the 64-bit network prefix for the address needs to be specified; the last 64 bits are automatically computed from the interface ID. Specifying the ipv6 address link-local command configures a link-local address on the interface that is used instead of the link-local address that is automatically configured when IPv6 is enabled on the interface. or Enables IPv6 processing on an interface that has not been configured with an explicit IPv6 address.",
            "Saves configuration changes. When you issue the end command, the system prompts you to commit changes: Uncommitted changes found, commit them before exiting(yes/no/cancel)? [cancel]: Entering yes saves configuration changes to the running configuration file, exits the configuration session, and returns the router to EXEC mode. Entering no exits the configuration session and returns the router to EXEC mode without committing the configuration changes. Entering cancel leaves the router in the current configuration session without exiting or committing the configuration changes. Use the commit command to save the configuration changes to the running configuration file and remain within the configuration session."
        ]
    ],
    "pageTitle": "Implementing Network Stack IPv4 and IPv6 - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/crs/software/crs_r4-0/addr_serv/configuration/guide/ic40crs1book_chapter8.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00279-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 365525007,
    "recordOffset": 365481284,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{63300=A link-local address is an IPv6 unicast address that can be automatically configured on any interface using the link-local prefix FE80::/10 (1111 1110 10) and the interface identifier in the modified EUI-64 format. Link-local addresses are used in the neighbor discovery protocol and the stateless autoconfiguration process. Nodes on a local link can use link-local addresses to communicate; the nodes do not need site-local or globally unique addresses to communicate. Figure 1shows the structure of a link-local address., 142119=The ipv6-address argument in the ipv6 address link-local command must be in the form documented in RFC 2373 where the address is specified in hexadecimal using 16-bit values between colons., 85476=In IPv6, the minimum link MTU is 1280 octets. We recommend using an MTU value of 1500 octets for IPv6 links., 44766=IPv6, formerly named IPng (next generation) is the latest version of the Internet Protocol (IP). IP is a packet-based protocol used to exchange data, voice, and video traffic over digital networks. IPv6 was proposed when it became clear that the 32-bit addressing scheme of IP version 4 (IPv4) was inadequate to meet the demands of Internet growth. After extensive discussion, it was decided to base IPng on IP but add a much larger address space and improvements such as a simplified main header and extension headers. IPv6 is described initially in RFC 2460, Internet Protocol, Version 6 (IPv6) Specification issued by the Internet Engineering Task Force (IETF). Further RFCs describe the architecture and services supported by IPv6., 51172=0:0:0:0:0:0:0:0, 141305=The ipv6-prefix argument in the ipv6 address command must be in the form documented in RFC 2373 in which the address is specified in hexadecimal using 16-bit values between colons., 66317=An IPv6 multicast address is an IPv6 address that has a prefix of FF00::/8 (1111 1111). An IPv6 multicast address is an identifier for a set of interfaces that typically belong to different nodes. A packet sent to a multicast address is delivered to all interfaces identified by the multicast address. The second octet following the prefix defines the lifetime and scope of the multicast address. A permanent multicast address has a lifetime parameter equal to 0; a temporary multicast address has a lifetime parameter equal to 1. A multicast address that has the scope of a node, link, site, or organization, or a global scope has a scope parameter of 1, 2, 5, 8, or E, respectively. For example, a multicast address with the prefix FF02::/16 is a permanent multicast address with a link scope. Figure 1 shows the format of the IPv6 multicast address., 68474=IPv6 routers must also join the all-routers multicast group FF02:0:0:0:0:0:0:2 (scope is link-local)., 50794=0:0:0:0:0:0:0:1, 181031=If you are configuring Intermediate System-to-Intermediate System (IS-IS) across a serial line, you should configure the serial interfaces as unnumbered, which allows you to conform with RFC 1195, which states that IP addresses are not required on each interface., 68049=All-nodes multicast group FF02:0:0:0:0:0:0:1 (scope is link-local), 53335=An IPv6 address prefix, in the format ipv6-prefix/prefix-length , can be used to represent bit-wise contiguous blocks of the entire address space. The ipv6-prefix argument must be in the form documented in RFC 2373, in which the address is specified in hexadecimal using 16-bit values between colons. The prefix length is a decimal value that indicates how many of the high-order contiguous bits of the address compose the prefix (the network portion of the address). For example, 2001:0DB8:8086:6502::/32 is a valid IPv6 prefix.}",
    "textBeforeTable": "DETAILED STEPS commit end Use one of the following commands: 5.    route-tag [ route-tag value ] 4.    ipv6 address ipv6-prefix/prefix-length [eui-64] ipv4 address ipv4-address mask [secondary] Do one of the following: 3.    interface type interface-path-id 2.    configure 1.    SUMMARY STEPS The route tag feature is already available for static routes and connected routes(interfaces) wherein the route tags are matched to policies and redistribution can be prevented. The Route-Tag Support for Connected Routes feature that attaches a tag with all IPv4 and IPv6 addresses of an interface. The tag is propagated from the IPv4 and IPv6 management agents (MA) to the IPv4 and IPv6 address repository managers (ARM) to routing protocols, thus enabling the user to control the redistribution",
    "textAfterTable": "How to Implement Network Stack IPv4 and IPv6 This section contains the following procedures: Assigning IPv4 Addresses to Network Interfaces Configuring IPv6 Addressing Assigning Multiple IP Addresses to Network Interfaces Configuring IPv4 and IPv6 Protocol Stacks Enabling IPv4 Processing on an Unnumbered Interface Configuring ICMP Rate Limiting Configuring IPARM Conflict Resolution Assigning IPv4 Addresses to Network Interfaces This task assigns IPv4 addresses to individual network interfaces. IPv4 Addresses IPv4 Addresses A basic and required task for configuring IP is to assign IPv4 addresses to network interfaces. Doing so enables the interfaces and allows communication with hosts on those interfaces using IPv4. An IP address identifies a location to which IP datagrams can be sent. An interface can have one primary IP address and multiple secondary addresses. Packets generated by the software always use the primary IPv4 address. Therefore, all networking devices on a segment should share the same primary network number. Associated with this task are decisions about subnetting and masking the IP addresses. A mask identifies the bits that denote the network number in an IP address. When you use the mask to subnet a network, the mask is then referred",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}