{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Go out every night that you can. There are always parties, go to them. Two dollar tuesdays are the best.",
            "Rutgers Dining services has improved so much since I got here as a freshman. if you have a meal plan, eat at the Livingston dining hall. its delicious and really nice. There is also now a food truck that accepts meal swipes.",
            "Become friends with your RA, and then your life will be less miserable. Enjoy your roommate and friends down the hall. Make the best of every experience and opportunity.",
            "Intro classes like gen chem and gen bio are 300 person lecture halls. They are difficult and I have heard that they are meant to weed out students who cannot handle RU. Once you get into your major classes, they are enjoyable, but not easy.",
            "Get organized. RU is a huge university, so if you want to make the most of it, make yourself known, for good reasons of course.",
            "Rutgers was not my first choice, but I could not have asked for a better experience. I feel that I received the best education, engaged in on campus activities, and had the best time socially. I've met great friends who have become colleagues and professors who would help me with anything."
        ]
    ],
    "pageTitle": "Rutgers University-New Brunswick Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Rutgers-University-New-Brunswick/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00262-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912769659,
    "recordOffset": 912558396,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{549877=It can be great, and it can also suck. It really depends on who you are living with, and where. Regular dorms are somewhat small, but the apartments that we have are really, really great, there even adding more for Fall Semester 2012., 528428=There are so many activities going around in campus. You can take part in any socities and organizations. There are numerous intramural sports, all campuses have big gyms with many equipment and swimming pools. Downtown New Brunswick has many restaurants and shops that you can visit. New York City is just 40 minutes away. Train ride from New Brunswick to NYC is a great experience. Cook-Douglas campus has natural scenaries and farms with pigs, cows, horses etc. If you are a nature lover you can go there and volunteer their. There will be so many charity events 9/11 memorial charity, charity bed race, dance marathon, big chill (A marathon in December first week), Rutgers Day etc., 1111635=Piscataway relatively safe compared to New Brunswick. Fall 2012 we averaged a crime alert every 1-2 weeks for minor assault or theft. Nonetheless the campus is safe, but just watch your back and travel in groups., 217627=At first I did not want to go to Rutgers because of its proximity from my home (2 hours), I wanted to go to University of Louisville in Kentucky. However, due to some changes, I changed my mind and went to Rutgers. I am so happy with my my choice. For prospective students living in New Jersey in South jersey or North Jersey, this institution is approximately in the middle so you do not have to fear your parents coming up so often or not at all. Rutgers has a lot to offer, it has the courses and it has the activities. The fun does not stop there. They offer a range of living arrangement from city like to rural. College Ave: you have to admit the party campus. I am not a drinker but definitely a dancer. There are some nice parties. If you are not a partier, there are MANY things you can do. I usually plan shopping trips (Cliquers). There is a wide range of shopping areas in Downtown New Brunswick and you will surely find a place you like. College Ave is a city environment. Cook Douglass is the rural-like campus. I love it here though because of the scenery and peacefulness of it. You are bound to have classes on this campus unless you could do some magical trick to change it. Despite the negativity, I love cook douglass. With your meal swipes, you can get breakfast, lunch and dinner at the Campus Center. Livingston: is a campus. Quieter than Busch and College Ave but a little livelier than Cook Douglass. I love it here. I live here for my freshman year. All the underclassman activities are definately found on Livingston. In addition to that, there is a new student center. They are going to finish the new dining hall by the fall of 2011. By the Fall of 2012 or Spring, they will have new apartments and shopping districts. In conclusion Livingston is growing. HOWEVER YOU WILL NEED FANS!!! A LOT Busch: the science campus. The biggest campus I believe. Many students actually shoot for Busch because they believe its the best. However, where you live and how much fun you have depends on how you make it fun. You meet new people every where you go. I recommend visiting the campuses and asking current student if you can check out the rooms because there ARE differences for each campuses. You do not need a car! Besides the fact that you have to pay a permit fee, you have the buses. They are easy to use at times hard to handle during busy times. However, if you know when classes end or begin, getting on a bus with a guaranteed seat is not difficult., 215986=You pay around 22000 a year (not including financial aid deduction or other things). When you stop being a freshman, you will get a choice of doubles, apartments, suites, off campus etc. they make a difference on your tuition. Where you live has an impact on your money. Credits has an impact on your money, the meal plan has an impact on your money. Meal Plans: You get a set 510 required as a first year. The dining hall isn't great (not home cooked delicious) but it is edible. Tillett dining hall on Livingston is actually switching to Busch (The supposed good food dining hall) and Cook Douglass (my opinion awesome place) style food. Brower has the worst food. (I spoke with the chef so I know my infos are valid minus the self opinion). DCC (douglass campus center has 3 times where you can swipe. breakfast. Limited Lunches and dinner. They are great for clearing out the meal swipes because you will have left over swipes. they will go to waste so USE THEM! The rock cafe in the Livingston Student Center is also good for swipes. The Sbarros after 4:30pm in LSC uses swipes too. Sorry Dunkin Donut does not take swipes :( Besides that, you do get free tickets to football games or any other games. Go to them. They are fun. they are something to do. They are a great way to meet people. The buses are hell though (pardon the language)., 775837=I am starting Rutger's in September., 112220=Rutgers is definitely a great value school. It has so much to offer at such a small price, in-state running around $12,600 and out-of-state around $24,500, but they are relatively generous with their financial aid, and almost no one pays the full tuition. Its also really nice that they are a state school because not only do they have a large endowment, but they receive aid from the state on top of that. Rutgers has a great brand name, meaning that other learning institutions and employers respect its reputation. People recognize the name, and they know and trust that people with a degree from Rutgers have learned well. There are rankings to prove it: in 2010 Rutgers Business School – Newark and New Brunswick's undergraduate program was ranked #3 by The Wall Street Journal for producing the best graduates according to recruiters in a new ranking The Top 25 Recruiter Picks.” In all, for the price paid, the opportunities and experiences are well worth every single penny., 772553=Definitely work on your SAT scores when applying to this school because non-need based financial aid is extremely difficult to get if you don't have at least a 1950. But, to actually get into the school SAT scores shouldn't usually be a problem(for certain schools). It really matters for the business, engineering, and pharmacy school., 963019=Do not under estimate Rutgers. May students apply here as a safe school and think it will be easy, but it is not, Rutgers is a very challenging University and many students learn that the hard way., 332055=at commencement the breaking of clay pipes over the class of 1877 cannon monument takes place to symbolize the breaking of ties with the college. the school is steeped in tradition since it is one of first nine colleges founded in the united states., 9670=-Go to class, even though it's so easy to skip. -Pay attention in class. I would suggest NOT bringing a laptop to take notes, because every single person I've ever seen using one is always goofing off. It's too tempting. And studies have shown that doodling improves information recall! http://www.wired.com/wiredscience/2009/02/doodlerecall/ http://www.time.com/time/health/article/0,8599,1882127,00.html -Study! You DON'T need to check Facebook at this very moment, you DON'T need to go hang out with friends. Something I learned the hard way is that you CAN say 'sorry, not tonight' to your friends. It's hard, but nothing should come between you and your studies. -Read for pleasure. Take a speed-reading course if you're not confident in your reading ability. You'll do a lot of reading, even in the visual arts program, and stronger skills will help you so much in both the short and long term. -DON'T PLEDGE during your first semester! Watching some of my peers go through pledging was nightmarish- they never slept, became depressed, and their grades dropped. Nothing is wrong with waiting until second semester, or even sophomore year., 777375=This will be my first year come this September., 737591=We have four dining halls, so you are not stuck with one choice. I would recommend Livingston Dining hall they have a Burger Bar! Also take-out is included in your meal plan and runs until 12:00 for thous late night classes or study sessions., 271752=Definitely do well on your SATs, because a score of 1950 opens up more scholarship opportunities and honors classes for incoming students. Also, make sure you study and do all of your homework. I know it's common sense, but a lot of people do not realize how different college really is from high school, so be sure to stay on top of everything. Most professors will not offer extra credit! Also, when dealing with financial aid or student employment DEFINITELY stay on top of it all. Opportunities are always there but are usually nabbed up within the first few weeks of the semester. If you have an issue with anything related to aid or whatnot, be sure to handle it right away., 30561=Students have an exciting opportunity to live and explore each of the five campuses (Busch, Livingston, College Ave, Cook, and Douglass). Outside of class, students can socialize with peers and friends in the campus dining halls at any time. Although the food courts get crowded during school days, the food is great and is paid through meal swipes or RU Express. In New Brunswick, the Rutgers bus system is very efficient, arriving every 10 minutes to stops in each campus during weekdays and runs to accommodate students in the weekends as well. Often, the buses get overcrowded during days of severe weather. Students can get free tickets to Rutgers football and basketball games and be part of the Scarlet Fever. In the spring semester, Rutgers Day (April 25th) is an auspicious day which is celebrated in each of the five campuses. Along with students, parents and relatives visit and tour on the campus and engage in many outdoor activities on that day. Rutgersfest is a thrilling event, where concerts take place, there is free food, and a great chance to make new friends. For on-campus housing, students get free wireless internet access in their dormitories/apartments as well as in comfortable study lounges and working areas in libraries. Recreational centers are open in each campus for students to stay in reasonable shape with an in-door pool, basketball courts, and weight rooms.}",
    "textBeforeTable": "07/14/2009 Reviewer is A current student here. 42 out of 45 people found this review useful. 1 of 349 Lawrenceville, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Lori from Herndon, VA 08/19/2009 Reviewer is A current student here. 25 out of 27 people found this review useful. 1 person found this inaccurate. 2 of 349 Categories Comments Great for these types of students Anyone except lazy students. Rutgers really pays attention to your performance, and you have to be willing to go the extra mile for stellar grades. Tips for prospective students -Go to class, even though it's so easy to skip. -Pay attention in class. I would suggest NOT bringing a laptop to take notes, because every single person I've ever seen using one is always goofing off. It's too tempting. And studies have shown that doodling improves information recall! http://www.wired.com/wiredscience/2009/02/doodlerecall/ http://www.time.com/time/health/article/0,8599,1882127,00.html -Study! You DON'T need to check Facebook at this very moment, you DON'T need to go hang out with friends. Something I learned the hard way is that you CAN say 'sorry, not tonight' to your friends. It's hard, but nothing should come between you and your studies. -Read for pleasure. Take a speed-reading course if you're not confident in your reading ability. You'll do a lot of reading, even in the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}