{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "the campus is extremely safe. campus security is always driving around, making sure everything is ok.",
            "none.",
            "opportunities to start new clubs and get involved. definitely a lot of fun!",
            "great for students who like to socialize in an academic setting.",
            "welcome week is amazing for all freshmen who go through it!",
            "definitely worth every penny.",
            "activities and programs put on by the school. there is always something to do. the key to avoiding boredom is seeing what events are going on.",
            "there is a variety of food options. we have the cafe for a more buffet style/ order through the machine. it is as much as you can eat. while on the other hand we have the centrum which is more restaurant style, very nice to turn on the fire pit and eat around it.",
            "dorm life is very fun during the week, the dorms are full of students walking by, studying, or just hanging out. however on weekends many students go home and the campus can be a little lonely.",
            "classes can be tough, make sure to take thorough notes and most importantly go to class!",
            "get involved. there are many opportunities out there that students can take advantage from. expose yourself to other students like yourself. make sure to keep the competitive mindset open.",
            "amazing school that is full of professors and counselors who truly want you to succeed in life. beautiful campus and dorms. makes you feel very comfortable and welcome."
        ]
    ],
    "pageTitle": "California Lutheran University - Thousand Oaks Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/California-Lutheran-University-Thousand-Oaks/reviews?_escaped_fragment_=/show/6408",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00081-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890074447,
    "recordOffset": 890025620,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{19682=If you put the work in, you will be pushed to learn and grow to great heights. Professors here really care about your education and will get to know you on a personal level if you are willing. I have some of my professors numbers that are in my major and allow me to contact them if need be. The size of the classes are small with a ratio of about 17:1 (17 students to 1 professor)., 89404=there are many traditions that are unusual here, but one i think is the greatest is the undie run. mid to late october, everyone strips to their undies, gives the clothes they had on to charity, and then goes on a run around campus. it's all about the charity! there's a lot of cool locations that are around the campus, you just have to find them!, 172126=As of right now, our cafeteria is very sub-par. However, we do have a cafe called the Centrum, which is very convenient because you can get all kinds of food to go. We are in the process of building a new dining commons which is going to be VERY nice! It will be finished in 2015., 51305=Set in sunny Southern California where it is close to Malibu Beach, Six Flags, and Disneyland, as well as Downtown Hollywood. The student:professor ratio is generally 20:1 so the professors can offer one on one help and get to know the students' personalities and learning styles. Has extremely competitive Chemistry, Biology, and Communications programs with opportunities for internships at local hospitals and media companies in Hollywood., 162552=The food and dining is okay right now, however, in 2014 a new dinning commons is coming and it will all be updates and better., 52417=There is a cafe called the Centrum that does breakfast specialties, and provides salads, sandwiches, pizzas, and hamburgers for lunch and dinner. As of September 2014, there will be a brand new Cafeteria on campus with all kinds of food, and a coffee shop., 220302=© 2015, Cappex.com, LLC, 126389=The dining options the school has now aren't horrible, but it does get redundant throughout the year. Cal Lu offers a traditional dining hall, Centrum (cafe style), Jamba Juice, Mogen Market (open 5pm-12am), and a small kiosk. Cal Lu is currently starting to rebuild a new two floor dining hall that is scheduled to be finished after summer 2014., 18155=California Lutheran can be expensive, but they are willing to help you. With numerous donors and out side sources I believe its over 85% of students that get some sort of financial aid. CLU already provides $19 million a year in financial aid to students, but in 2009-2010 it plans to increase the amount of scholarship money available to current students to help them meet educational expenses during the recession. source: http://www.callutheran.edu/news/news_detail.php?story_id=5453}",
    "textBeforeTable": "06/08/2009 Reviewer is A current student here. 15 out of 15 people found this review useful. 1 of 51 Michael from San Fernando, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new",
    "textAfterTable": "Categories Comments Great for these types of students Ideal for students that enjoy small classes, close relationships with their professors and don't want to be solely a number! Perfect for the all around students, there are many clubs and activities to get involved in! Tips for prospective students Don't let the cost of the school make you shy away! The school is amazing! Bang for the buck Although it is pricey, it is worth it! Would not transfer for any cost! Am enjoying being here The campus is welcoming and safe. The school also puts on an event every Friday, called Club Lu, that is free to the students (includes a chuckee cheese night, black out socials, snowball fights, etc.). Am learning a lot The professors work with the students and are more than happy to to find time outside of their office hours to help. Login to rate or flag the reviews Philip from Barstow, CA 07/04/2012 Reviewer is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}