{
    "relation": [
        [
            "Patent application number",
            "20100120624",
            "20100300452",
            "20120097172",
            "20130137590",
            "20140315744",
            "20150068532"
        ],
        [
            "Description",
            "ASSESSMENT OF OOCYTE COMPETENCE - Methods are provided for evaluating an oocyte for fertilization and implantation. For example, methods are provided for determining whether an oocyte expresses, or does not express, one or more of a group of markers identified as differently expressed between chromosomally normal and chromosomally abnormal oocytes. Also provided, for example, are methods for determining whether a cumulus cell expresses, or does not express, one or more of a group of markers identified as differently expressed between cumulus cells associated with chromosomally normal oocytes and cumulus cells associated with chromosomally abnormal oocytes. Methods are provided for the detection of marker expression of differentially expressed genes at the RNA level, as well as at the protein level.",
            "INTRAUTERINE DEVICE - An intrauterine device for applying pressure to the walls of the uterine cavity includes a resilient body having an elongated member which includes a first end and a second end which are resiliently biased away from each other. The first end of the elongated member includes a first leg having a first end and a second end. The second end of the elongated member includes a second leg having a first end and a second end. A connection member is positioned between the first end of the first leg and the first end of the second leg. A first plug member is secured at the second end of the first leg and a second plug member is secured at the first end of the second leg. The first and second plug members are shaped and dimensioned for bearing against the walls of the uterine cavity as the elongated member spreads outwardly with the first end and the second end moving apart. A method for preventing conception within the uterine cavity is also disclosed.",
            "INTRAUTERINE DEVICE - An intrauterine device for applying force to a wall of a uterus to promote contraception without blocking the fallopian tubes may include an elongate member formed of a resilient material and having a default expanded configuration and a spring portion disposed approximately at a midpoint between two ends of the elongate member. The IUD may also include two tissue contact members, one tissue contact member disposed at one of the two ends of the elongate member and the other tissue contact member disposed at the other end. The tissue contact members may generate a laterally directed force against the wall of the uterus when the intrauterine device assumes its default expanded configuration.",
            "Assessment of Oocyte Competence - Methods are provided for evaluating an oocyte for fertilization and implantation. For example, methods are provided for determining whether an oocyte expresses, or does not express, one or more of a group of markers identified as differently expressed between chromosomally normal and chromosomally abnormal oocytes. Also provided, for example, are methods for determining whether a cumulus cell expresses, or does not express, one or more of a group of markers identified as differently expressed between cumulus cells associated with chromosomally normal oocytes and cumulus cells associated with chromosomally abnormal oocytes. Methods are provided for the detection of marker expression of differentially expressed genes at the RNA level, as well as at the protein level.",
            "ASSESSMENT OF OOCYTE COMPETENCE BY DETECTING SPSB2 AND/OR TP53I3 GENE EXPRESSION - Methods are provided for evaluating an oocyte for fertilization and implantation comprising analysis of gene expression in cumulus cells wherein the detected genes or polypeptides include at least SPSB2 and TP53I3. For example, methods are provided for determining whether a cumulus cell expresses, or does not express, one or more of a group of markers identified as differently expressed between cumulus cells associated with chromosomally normal oocytes and cumulus cells associated with chromosomally abnormal oocytes. Methods are provided for the detection of marker expression of differentially expressed genes at the RNA level, as well as at the protein level.",
            "INTRAUTERINE DEVICE - An intrauterine device for applying force to a wall of a uterus to promote contraception without blocking the fallopian tubes may include an elongate member formed of a resilient material and having a default expanded configuration and a spring portion disposed approximately at a midpoint between two ends of the elongate member. The IUD may also include two tissue contact members, one tissue contact member disposed at one of the two ends of the elongate member and the other tissue contact member disposed at the other end. The tissue contact members may generate a laterally directed force against the wall of the uterus when the intrauterine device assumes its default expanded configuration."
        ],
        [
            "Published",
            "05-13-2010",
            "12-02-2010",
            "04-26-2012",
            "05-30-2013",
            "10-23-2014",
            "03-12-2015"
        ]
    ],
    "pageTitle": "Pasquale - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/pasquale-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00162-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 457993130,
    "recordOffset": 457977166,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Pasquale Patrizio, Guilford, CT US Pasquale Pallota, Fabriano IT 10-23-2014 DEVICE FOR THE MOVEMENT OF RESTING COMPONENTS OF A SOFA, A CHAIR AND THE LIKE - The present invention relates to a device for the movement of resting components of a sofa, an armchair or the likes, such as a headrest movable between a lowered position and a raised position, a back movable between a substantially erected configuration and a downwardly inclined configuration, a seat movable between a backward position and a forward position, and a footrest movable between a lowered, substantially vertical position and a raised position. Such a device comprises a telescopic member equipped with a movable portion controlled by a motor and able, jointly with further connection members, to place in reciprocal relation and to move said headrest, back seat and footrest. 20140312660 Published Description Patent application number Pasquale Natuzzi, Santeramo In Colle (ba) IT 09-25-2008 Production of Means For Improving the State of Systems and Materials - The invention relates to a method for manufacturing means for improving the condition or function of systems and substances, as well as biological, natural or technical systems, and is used for optimising conditions or processes and/or for increasing resistance to harmful environmental influences. 20080233308 Published Description Patent application number Pasquale Mosaico, Flawil CH 05-22-2014 BASE FOR SANDING MACHINES, GRINDING MACHINES OR THE LIKE",
    "textAfterTable": "Patent applications by Pasquale Patrizio, Guilford, CT US Pasquale Pierimarchi, Abano Terme (padova) IT Patent application number Description Published 20110189265 THERAPEUTIC USE OF NEW PHARMACEUTICAL PREPARATIONS CONTAINING ANTITUMORAL DRUGS BOUND TO HYALURONIC ACID IN THE TREATMENT OF NEOPLASIAS - The present invention describes the new use in the oncologic field of bioconjugates as differentiating agents obtained by the conjugation between hyaluronic acid (HA) and a chemotherapeutic product (identified hereafter with the trade-name ONCOFID®) among which, in particular, Irinotecan, Doxorubicin, Paclitaxel, Cis-platinum and 5-Fluorouracyl (5-FU) for treating primary tumors and metastasis. In particular, the biological behaviour is described in terms of action mechanism, efficacy and tolerability of pharmaceutical preparations of derivative of ONCOFID® soluble in water. More specifically, the invention relates to the surprising biological and pharmacological effect demonstrated by formulations based on ONCOFID-S (HA-SN38 conjugates) and ONCOFID-D (HA-Doxorubicin conjugates) in promoting the differentiation of tumoral cells towards a untransformed phenotype, compared with the reference drug Irinotecan (or CPT11 whose active form is represented by SN38) and Doxorubicin. 08-04-2011 Pasquale Razzino, South Yarra AU Patent application number Description Published 20090118467 Macromolecular Compounds Having Controlled Stoichiometry - The following invention is",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}