{
    "relation": [
        [
            "",
            "Company Name (Ticker)",
            "Community Trust Bancorp, Inc. (CTBI)",
            "ESB Financial Corporation (ESBF)",
            "Farmers Capital Bank Corporation (FFKT)",
            "First Defiance Financial Corp. (FDEF)",
            "First Financial Corporation (THFF)",
            "First Place Financial Corp. (FPFC)*",
            "Independent Bank Corporation (IBCP)",
            "Integra Bank Corporation (IBNK)*",
            "Lakeland Financial Corporation (LKFN)"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Company Name (Ticker)",
            "Macatawa Bank Corporation (MCBC)",
            "MainSource Financial Group, Inc. (MSFG)",
            "Mercantile Bank Corporation (MBWM)",
            "Metro Bancorp, Inc. (METR)",
            "Old Second Bancorp, Inc. (OSBC)",
            "Peoples Bancorp Inc. (PEBO)",
            "Porter Bancorp, Inc. (PBIB)",
            "S. Y. Bancorp, Inc. (SYBT)",
            "Univest Corporation of Pennsylvania (UVSP)"
        ]
    ],
    "pageTitle": "DEF 14A",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/707886/000119312513312533/d571228ddef14a.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00012-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 697231703,
    "recordOffset": 697178115,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{87402=The Nominating and Governance Committee of UCFC is responsible for receiving and evaluating recommendations for potential Board members from directors and shareholders, recommending to the Board a slate of director nominees to be elected by shareholders and overseeing governance matters affecting officers and directors of UCFC and Home Savings. In selecting nominees, the Nominating and Governance Committee considers the criteria discussed above. The Nominating and Governance Committee evaluates nominations properly submitted by shareholders on the same basis that it considers nominations submitted by directors. The current members of the Nominating and Governance Committee, all of whom are independent, are Mrs. Atkinson, Messrs. Burdman, Hunter and Schiraldi and Dr. Sweet. Mrs. Atkinson currently serves as the Chairwoman of the Nominating and Governance Committee until the Annual Meeting. A new chair of the Committee will be appointed at the Board meeting that follows the Annual Meeting on August 27, 2013. The Nominating and Governance Committee met two times during 2012., 137611=James R. Reske.    Mr. Reske was promoted to Executive Vice President of Home Savings in March of 2011. Mr. Reske has also served as the CFO and Treasurer of United Community since May of 2008. Mr. Reske previously served as Senior Vice President, CFO and Treasurer of Home Savings from May 2008 to March 2011. Prior to joining United Community, Mr. Reske was an investment banker with KeyBanc Capital Markets, Inc. from 2002 to May of 2008, focusing on community banks and thrifts in the Midwest. Prior to joining KeyBanc Capital Markets, Mr. Reske was an investment banker in the financial institutions group at Morgan Stanley in New York, and practiced banking law with Wachtell Lipton Rosen & Katz and Sullivan & Cromwell. Earlier in his career, Mr. Reske was employed by the Board of Governors of the Federal Reserve System in Washington, D.C., 268895=In performing its oversight role, the Compensation Committee has considered and discussed the Compensation Discussion and Analysis with executive management. On July 22, 2013, the Compensation Committee recommended to the Board that the CD&A be included in this Proxy Statement for the fiscal year ended December 31, 2012., 111191=During 2012, the directors received four awards of restricted shares representing a portion of their annual retainer, with each award equaling approximately $2,500 in restricted shares. As mentioned above, each restricted share award vests one year from the date of grant. All of these awards were made under the UCFC 2007 Amended and Restated Long Term Incentive Plan. The Compensation Committee and Board believes that directors should have an ownership interest in UCFC and awarding restricted shares and options as part of Board compensation effectively aligns directors and shareholder interests and puts a portion of director compensation at risk. The Compensation Committee and Board contemplate that future equity awards in the form of options or restricted shares will be issued to directors as additional compensation or in lieu of cash compensation., 488907=Section 16(a) of the Exchange Act requires UCFC\u0092s executive officers and directors, and persons who own more than ten percent of UCFC\u0092s common shares, to file reports of ownership and changes in ownership on Forms 3, 4 and 5 with the Securities and Exchange Commission and to provide UCFC with a copy of such form. Based on UCFC\u0092s review of the copies of such forms it has received, UCFC believes that its executive officers and directors complied with all filing requirements applicable to them with respect to transactions during the fiscal year ended December 31, 2012, except that seven Forms 4 were filed late on October 10, 2012, each reporting one late transaction for each of Mrs. Atkinson and Messrs. Buoncore, Burdman, Crewson, Hunter and Schiraldi and Dr. Sweet., 267704=Tax and Accounting Considerations.    Section 162(m) of the Internal Revenue Code places a limit on the tax deduction for compensation in excess of $1 million paid to the Named Executive Officers in a taxable year. All of the compensation UCFC and Home Savings paid in 2012 to the Named Executive Officers is expected to be deductible under Section 162(m). The Committee retains the flexibility, however, to pay non-deductible compensation if it believes doing so is in the best interests of UCFC and Home Savings., 167393=operational goals that we believe support sustained long-term profitable growth of the company, improve asset quality and support value creation for shareholders. The EIP, described below, was adopted by the Compensation Committee and the Board on May 29, 2012, and was disclosed publicly pursuant to the Form 8-K filed on June 4, 2012. The Committee and the Board developed the plan with the goal of combining stock and cash compensation to better align executive compensation with shareholder interests., 380188=As of December 31, 2012, Home Savings had employment agreements with Messrs. Bevack, Reske, Krontiris, Nohra and Garrity, which agreements are for a term of one year but include an \u0093evergreen provision\u0094, meaning that they are extended for one day each day so that the term is always twelve months. The employment agreements were originally executed in April 2010. Each agreement is terminable by Home Savings at any time., 104388=The Home Savings Board Loan Committee, in addition to approving a wide variety of commercial loans and modifications, approves all charge-offs equal to or greater than $1.0 million. Additionally, the Committee receives monthly reports that assist in monitoring credit risk, including loan policy exception reports, asset quality trend reports, new loan reports, maturing and matured loan reports and special assets reports. The Board Loan Committee is comprised of a majority of independent directors. The current members are Mrs. Atkinson and Messrs. Adams, Bevack, Burdman, Crewson, Hunter and Schiraldi. Mr. Hunter is the Chairman of the Board Loan Committee. The Committee met 14 times during 2012, but three of those meetings were brief meetings and no fee was paid to members., 166316=The Named Executive Officers\u0092 bonuses paid during 2012 are set forth in the \u0093Bonus\u0094 column of the Summary Compensation Table., 135322=Matthew T. Garrity.    Mr. Garrity was promoted to Executive Vice President, Commercial Lending and Credit Administration in June 2013. Prior to that time, Mr. Garrity served as Senior Vice President and Chief Credit Officer since June of 2009. Mr. Garrity served as Senior Vice President \u0097  National City Capital Markets Investment Banking in Cleveland, Ohio from 2008 until he joined Home Savings. Prior to that, Mr. Garrity served as National City Corporation\u0092s Deputy Chief Credit Officer \u0097 Northern Ohio Credit Administration in Cleveland, Ohio from 2007 until 2008, and Senior Vice President/Senior Portfolio Manager in Cleveland, Ohio from 2005 until 2007., 90315=The Capital Committee of UCFC and Home Savings is responsible for: overseeing UCFC\u0092s and Home Savings\u0092 efforts to raise capital levels at Home Savings; analyzing various sources and uses of capital as well as potential alternative methods for raising additional capital if deemed necessary by the Board, and, if necessary, recommending to the Board an amount of capital to raise, how to raise capital and over what time period; evaluating and making recommendations on strategic alternatives to raising capital; evaluating UCFC\u0092s and Home Savings\u0092 capital plans and efforts to successfully implement the plan; and monitoring and evaluating capital levels and compliance with regulatory guidelines for capital levels, and if necessary, recommending remedial action in the event of non-compliance. The Board has determined to maintain the Capital Committee at this time even though the Company has completed the offerings. The current members of the Capital Committee are Messrs. Adams, Bevack, Buoncore, Crewson and Schiraldi, all of whom are independent except Messrs. Adams and Bevack. Mr. Schiraldi is the Chairman of the Capital Committee. The Capital Committee met ten times in 2012, but one of those meetings was brief and no fee was paid to members., 83989=public accounting firm to audit UCFC\u0092s financial statements and internal controls over financial reporting. The current members of the Audit Committee are Messrs. Schiraldi, Burdman, Crewson and Buoncore, all of whom are considered \u0093independent\u0094 under the listing standards of NASDAQ. Mr. Buoncore is the Chairman of the Audit Committee. The Board has determined that Messrs. Schiraldi and Buoncore qualify as audit committee financial experts. The Audit Committee met eight times during 2012, but three of those meetings were brief and no fee was paid to members., 159513=For 2012, we updated the Base Study to provide the Committee with a compensation analysis, which compared UCFC\u0092s top executive officers with the top executive officers of the peer group. The Base Study set forth a salary range (minimum, midpoint and maximum) for each officer\u0092s position, which was based upon peer group and compensation survey data from 2010. This same salary range was used in the updated analysis provided to the Compensation Committee, along with the most recent peer group and survey data available. The updated analysis compared each executive officer\u0092s 2011 salary to the salary range originally set forth in the Base Study, and established two more salary ranges that used the most recent data available for the peer group and data from two compensation surveys obtained for the Committee\u0092s benefit. Each officer\u0092s 2011 salary was analyzed to determine whether it fell above, below or within such ranges., 520472=August 27, 2013, 79167=Scott D. Hunter.    Judge Hunter currently serves as a Mahoning County, Ohio, Area Court Judge and Judge of the Mahoning County, Ohio, Misdemeanor Drug Court, positions he has held since July 1999. He also has been the managing member of Hunter-Stevens Land Title Agency, LTD, Canfield, Ohio, since March 1998, and has maintained a private law practice. He previously served as a partner of the Davis & Davis Law Firm. Judge Hunter joined the UCFC and Home Savings Boards in 2009. The Nominating and Governance Committee and the Board believe that the attributes, skills and qualifications that Judge Hunter has developed through approximately 25 years of providing legal services and working in the real estate, title and escrow industries and his vast community, public and political service and experience, give him considerable experience within the banking and lending industry and allow him to provide significant guidance and expertise on regulatory compliance, community perspective, lending and real estate and valuable leadership insight to the Board. Judge Hunter also provides the Board with a diverse background in the public and private sectors., 26415=IMPORTANT NOTICE REGARDING THE AVAILABILITY OF PROXY MATERIALS FOR THE SHAREHOLDER MEETING TO BE HELD ON AUGUST 27, 2013, 502420=The Audit Committee of the Board has selected Crowe Horwath as UCFC\u0092s independent registered public accounting firm for the 2013 fiscal year. The Board is requesting that the shareholders ratify this selection. If the shareholders do not ratify the selection of Crowe Horwath, the selection may be reconsidered by the Audit Committee., 257932=With these intentions in mind, especially retention of the management team (which the Committee believed was imperative to the successful implementation of the Capital Plan), and to provide further incentive to management to execute the Company\u0092s capital raise and the bulk loan sale, on January 24, 2012, the Compensation Committee and Board approved the award of restricted shares to certain employees, including the Named Executive Officers, under the 2007 Plan. The award vested 50% on the date of grant, and the remaining 50% vested in three equal installments on June 30, September 30 and December 31, 2012. The Committee determined that one-half of the shares should vest immediately to reflect the extraordinary efforts that management would expend prior to June 30, and it established the future dates to continue to incentivize management to achieve the successful implementation of UCFC\u0092s and Home Savings\u0092 strategic goals, particularly the capital raise and bulk asset sale., 156849=Long Term Equity Incentive \u0097 awards of equity based compensation that vary depending on UCFC performance, the desire to recruit and retain highly-qualified executives and UCFC\u0092s and Home Savings\u0092 strategic goals. The primary objective of our long-term incentive program in 2012 was to retain our management team and motivate and reward our officers for their efforts related to our strategic goals and the execution of our Capital Plan. We also believe equity based awards support our goals of encouraging stock ownership, align the interests of our key executives with our shareholders\u0092 interest and motive executives to consider our long-term strategic goals., 169726=If an award under the EIP is made, the EIP provides that it will be paid 60% in cash and 40% in restricted stock or stock options, which the Committee and the Board determined provided a balanced approach to awarding past performance and aligning the interests of management with shareholders by providing for future growth potential as share value increases along with UCFC performance. Any restricted stock or stock option awards made under the plan are awarded pursuant to the Amended and Restated United Community 2007 Long-Term Incentive Plan and vest equally over three years, beginning on the first anniversary of the award. The Committee and the Board determined that three-year vesting is an important feature because it helps to retain officers., 73926=David C. Sweet.    Dr. Sweet was the President of Youngstown State University, Youngstown, Ohio from 2000 until his retirement in June 2010. As President of YSU, Dr. Sweet provided leadership to a university with 14,600 students, 2,100 employees and a total budget in excess of $200 million. From 1978 until July 2000, he was the founding Dean and a Professor of the College of Urban Affairs \u0096 Cleveland State University. From 1975 to 1978, he was a Commissioner with the Ohio Public Utilities Commission, responsible for regulation of electric, natural gas, telephone and other utilities. From 1971 to 1974, he was the Director of the Ohio Department of Development, responsible for the State\u0092s economic and community development programs. He also serves as a director of Home Savings, and he has a distinguished record of serving his community as a trustee of numerous not-for-profit entities. The Nominating and Governance Committee and the Board believe that the attributes, skills and qualifications that Dr. Sweet has developed through his presidency at YSU, his long history in education, his extensive civic service and his experience with governmental and regulatory agencies provide significant guidance and expertise on strategic planning and regulatory compliance, community perspective and valuable leadership and financial insight to the Board., 381436=of December 31, 2012. The amounts shown are estimates. Amounts do not include compensation and benefits available generally to all of UCFC\u0092s salaried employees on a non-discriminatory basis., 17871=The 2013 Annual Meeting of Shareholders of United Community Financial Corp. will be held at Mr. Anthony\u0092s, 7440 South Avenue, Boardman, Ohio, on August 27, 2013, at 10:00 a.m., Eastern Time, for the following purposes, all of which are more completely set forth in the accompanying proxy statement:, 232192=For example, if UCFC\u0092s Core ROAE for 2012 fell into the 40th percentile when compared to its peers, Mr. Bevack\u0092s incentive award for that performance measure would have been as follows:, 504217=The aggregate fees billed by Crowe Horwath LLP to UCFC for the years ended December 31, 2012 and 2011 are shown in the table below. All services related to these fees were approved in advance by the Audit Committee., 27220=Only shareholders of record as of the close of business on July 15, 2013, are entitled to vote at the Annual Meeting. As of the voting record date, there were 50,193,288 shares entitled to vote at the Annual Meeting. Each share is entitled to one vote at the Annual Meeting on all matters properly presented at the meeting., 242873=For 2012, UCFC\u0092s performance, percentile rank, and the threshold levels achieved under the EIP for the Named Executive Officers are as follows:, 339324=Outstanding Equity Awards at December 31, 2012, 439189=Pursuant to a Consulting Agreement that MA Consulting entered into with United Community and Home Savings as of February 24, 2011, Mr. Adams, as President of MA Consulting, advised and assisted the Company\u0092s Board and management on their capital raising efforts. The Company paid MA Consulting a monthly fee of $24,500 for the consulting services and reimbursed reasonable expenses up to 15% of the aggregate fee, except as otherwise agreed by the Board. On January 1, 2013, upon United Community\u0092s and Home Savings\u0092 decisions to seek regulatory approval to appoint Mr. Adams to their Board, the parties amended the Consulting Agreement to provide for a fee of $1,000 per month. The Consulting Agreement terminated immediately prior Mr. Adams\u0092 appointment to the Boards of United Community and Home Savings. From January 2012 until the Consulting Agreement terminated, the Company paid Mr. Adams $326,716., 424837=Base Salary.    The employment agreements as entered into in 2010 of Messrs. Bevack, Reske, Krontiris, Nohra and Garrity establish base salaries of $310,000, $200,000, $195,000, $180,000 and $165,000, respectively. The agreements provide that based on each officer\u0092s individual performance and other factors deemed appropriate by the Board or Compensation Committee, the Board may increase the executive\u0092s base salary. Each agreement provides that, in the event that the Board increases any executive\u0092s annual base salary, the amount of the initial annual base salary, together with any such increases, will become the executive\u0092s base salary under the agreement., 110005=Currently, all directors of UCFC also serve on Home Savings\u0092 Board. The directors of Home Savings\u0092 Board do not receive a retainer in addition to that received for service on the UCFC Board. Each outside director also receives a fee of $400 per UCFC or Home Savings Board meeting attended, and in general, each outside director receives a fee of $400 per UCFC or Home Savings Board or management committee meeting attended if he/she is a committee member, or in the case of Board Committees or management committees, $600 per committee meeting attended if he/she is the committee chairperson. The per meeting fee has not been increased by the Board since UCFC\u0092s formation in 1998. In 2008, the Board determined that it would only pay one fee to Directors for simultaneous meetings of both the UCFC and Home Savings Boards, and that Directors would not be compensated for attendance at brief Board or committee meetings (less than thirty minutes) or for a meeting considered by the Board or applicable committee to be a continuation of a previous meeting., 499593=Based on its review of the financial statements and its discussions with management and the representative of Crowe Horwath, the Audit Committee recommended to the Board that the audited financial statements be included in the Annual Report on Form 10-K for the year ended December 31, 2012., 240657=Classified loans were $59.9 million at December 31, 2012, down 72.8% for the year; and, 520625=The undersigned shareholder of United Community Financial Corp. (\u0093UCFC\u0094) hereby constitutes and appoints Jude J. Nohra and James R. Reske, or either of them, as the Proxy or Proxies of the undersigned with full power of substitution and resubstitution, to vote at the Annual Meeting of Shareholders of UCFC to be held at Mr. Anthony\u0092s, 7440 South Avenue, Boardman, Ohio, on August 27, 2013, at 10:00 a.m. Eastern Time (the \u0093Annual Meeting\u0094), all of the shares of UCFC that the undersigned is entitled to vote at the Annual Meeting, or at any adjournment thereof, on each of the following proposals, all of which are described in the accompanying Proxy Statement:, 82435=During 2012, the Boards of UCFC and Home Savings and the Board Committees described below met many times in executive sessions held solely between independent directors, and at times with Mr. Bevack, President and CEO of UCFC and Home Savings. As discussed below under \u0093BOARD LEADERSHIP STRUCTURE AND RISK OVERSIGHT \u0097 Board Leadership\u0094, Mr. Schiraldi served as the independent, non-executive Chairman of the Board and presided over executive sessions of the UCFC and Home Savings Boards, while the chairperson of each specific committee presides over executive sessions of that Committee., 237381=Other performance highlights for 2012 included:, 140305=UCFC\u0092s executive compensation program for 2012 was intended to achieve the following primary objectives:, 144202=We believe our compensation philosophy, practices and programs for 2012 for our executive officers were balanced and risk appropriate, demonstrated alignment with shareholder interests, and provided a competitive and effective program to motivate and retain our management team to meet the challenges we were facing and achieved the strategic goals we set for 2012., 783=Securities Exchange Act of 1934, 152829=The peer group is designed to facilitate the assessment of UCFC\u0092s compensation program against banking industry peers when making compensation decisions. In 2010, the Committee engaged Organizational Consulting Group to conduct a study of UCFC\u0092s compensation program as compared to the peer group that existed in 2010 (the \u0093Base Study\u0094). The Committee used this Base Study, which was updated by Home Savings\u0092 Vice President \u0097 Human Resources, to determine base salaries of UCFC\u0092s executive officers in 2012. The Committee intends to continue utilizing a peer group for benchmarking each year and will annually review the peer group to identify any necessary changes to its composition., 45138=UCFC encourages all directors to attend the annual meetings of shareholders. All of UCFC\u0092s directors attended the 2012 Annual Meeting of Shareholders., 440256=Mr. Adams, along with all other directors and some of the United Community\u0092s officers, also were parties to a Subscription Agreement that each such officer or director entered into with United Community as of January 11, 2013, as part of United Community\u0092s overall $47 million capital raising efforts. Pursuant to Mr. Adams\u0092 Subscription Agreement, Mr. Adams purchased 136,364 United Community common shares at a price of $2.75 per common share, for a total purchase price of $375,001., 22264=The Board of Directors of United Community Financial Corp., an Ohio corporation, is soliciting the enclosed proxy for use at the 2013 Annual Meeting of Shareholders of UCFC to be held at Mr. Anthony\u0092s, 7440 South Avenue, Boardman, Ohio, on August 27, 2013, at 10:00 a.m., Eastern Time, and at any adjournments thereof., 81398=The Board of UCFC met nine times for regularly scheduled meetings and seven times for special meetings during 2012. Four of these meetings were considered brief meetings, and no fee was paid. See \u0093Director Compensation\u0094 below for an explanation of director compensation and for a description of which meetings directors have determined no fee will be paid. The Board of UCFC has an Audit Committee, a Compensation Committee, a Nominating and Governance Committee and a Compliance and Risk Management Committee. The Board of UCFC also has established an ad hoc Capital Committee in connection with implementing UCFC\u0092s and Home Savings\u0092 Capital Plans, which Committee is further described below. The Charters of the Audit, Compensation, Nominating and Governance, and Compliance and Risk Management Committees are available under Corporate Information on UCFC\u0092s website at http://www.ucfconline.com/., 80663=The Board has determined that Messrs. Buoncore, Burdman, Crewson, Hunter and Schiraldi and Dr. Sweet are each considered \u0093independent\u0094 because each such director (a) satisfies the independence requirements prescribed by applicable rules of The NASDAQ Stock Market (\u0093NASDAQ\u0094), (b) is a \u0093Non-Employee Director\u0094 as defined by Rule 16b-3 under the Securities Exchange Act of 1934, as amended (the \u0093Exchange Act\u0094), and (c) is an \u0093Outside Director\u0094 as defined by Section 162(m) of the Internal Revenue Code of 1986, as amended (the \u0093Code\u0094), and the regulations promulgated thereunder., 155433=Annual Cash and Equity Incentive \u0097 pay that varies depending on UCFC\u0092s performance against specific performance measures (described below) that are measured against UCFC\u0092s peer group. These awards are an important part of our compensation philosophy and help us to attract and retain highly qualified management. The objective of our Executive Incentive Plan (EIP) is to motivate and reward executives for achieving (or exceeding) annual financial, strategic, and operational goals that we believe will help us return to long-term profitable growth, improve asset quality and support value creation for shareholders. Incentives paid in 2012 reflect UCFC\u0092s performance in relation to specific factors measured primarily against the performance of the peer group., 136184=Jude J. Nohra.    Mr. Nohra has been General Counsel and Secretary of United Community since July 2009, and he was promoted to Executive Vice President, Corporate Governance and Secretary of Home Savings in June 2013 (he continues to serve as the Company\u0092s General Counsel as well). He served as Senior Vice President, General Counsel and Secretary of Home Savings since July 2009. Mr. Nohra served as Secretary of United Community and Vice President, General Counsel and Secretary of Home Savings from June 2004 until July 2009. Before joining United Community and Home Savings, Mr. Nohra served as an associate attorney for Squire, Sanders & Dempsey, L.L.P. for approximately 5 years where he practiced in the firm\u0092s corporate department and financial services practice group, focusing on general business representation of public and private companies, bank regulatory matters, mergers and acquisitions, securities law matters, real estate transactions and financings, tender offers and corporate governance. Prior to joining Squire, Sanders and Dempsey, Mr. Nohra served for two years as a judicial law clerk in the U.S. District Court for the Northern District of Ohio. Mr. Nohra also is a CPA, but he is currently inactive., 168830=If this net income threshold is met, incentive awards are calculated based upon UCFC\u0092s performance against the peer group in five of the six weighted performance measures as set forth below in the \u0093Weightings\u0094 table. Performance against the peer group is only measured against five of the six weighted performance measures because performance against budgeted net income is intrinsic to UCFC. See \u0093Threshold Levels\u0094 set forth below. For the calendar year 2012, the target and maximum incentive awards, respectively, measured as a percentage of base salary were as follows: Mr. Bevack \u0097 50%, 100%; and Messrs. Reske, Krontiris, Nohra and Garrity \u0097 40%, 80%. These targeted awards were found by the Committee and the Board to be appropriate., 21059=July 26, 2013, 238840=Delinquent loans were $48.2 million at December 31, 2012, down 62.0% for the year;, 239565=Nonperforming assets were $66.2 million at December 31, 2012, down 57.7% for the year;, 235997=UCFC\u0092s 2012 Performance and the EIP., 515270=Shareholders may send written communications to the Board or any of the directors c/o Secretary, United Community Financial Corp., 275 West Federal Street, Youngstown, Ohio 44503-1203. All communications will be compiled by the Secretary of UCFC and submitted to the Board or the individual directors., 134918=Timothy W. Esson.    Mr. Esson has been Senior Vice President, Chief Financial Officer and Treasurer of Home Savings since March of 2011. Prior to that time, Mr. Esson served as Vice President of Finance of Home Savings since May 2003., 153808=With respect to 2012, UCFC\u0092s executive compensation program included the following components:, 241623=In addition to these accomplishments, management had made substantial progress in pursuing the capital plan, which the Board established as one of management\u0092s primary goals, and as a result, the Committee believed in December 2012 when it reviewed the EIP analysis that the likelihood of successfully raising capital was high., 160573=We believe that individual performance appraisals are an important part of the decision making process to establish base salaries. Our governance policies provide that the Nominating and Governance Committee complete the performance appraisal of Mr. Bevack, which it did and presented to the Compensation Committee. Mr. Bevack completed and presented to the Committee the performance evaluations of the other Named Executive Officers, and he made salary recommendations regarding their base salaries. Based upon the updated analysis as discussed above, UCFC\u0092s performance during 2011, the roles each officer had in achieving our strategic goals, primarily related to our Capital Plan, their individual performance and professional experience and with respect to all officers (except his own), Mr. Bevack\u0092s salary recommendations, the Committee determined to establish 2012 salaries of the Named Executive Officers, effective as of January 1, 2012, as follows:, 108159=After conducting a study of the Company\u0092s peer group, the Board determined in April 2010 that to successfully recruit new directors and fairly compensate existing directors, the retainer should be increased to $20,000 annually. The Board updated and used that base study to evaluate Board compensation in 2012. Using that base study, the Board decided to maintain the same compensation levels for 2013. Accordingly, each outside director of UCFC receives a $10,000 annual retainer and $10,000 in UCFC restricted shares. The restricted shares that are awarded vest one year from the date of grant, and the Board believes this award helps to align Board members and shareholders\u0092 interests. Employee directors, which includes only Mr. Bevack, receive no compensation for their Board service., 54324=Scott N. Crewson.    Mr. Crewson retired from BP plc, London, England in 2008, after having served the company more than 27 years in a variety of executive level positions, including most recently as Deputy Director, Business Development in London, England from 2005 through 2008. Prior to that, he served as Commercial Manager, Toledo Refinery from 1998 through 2004. He joined the UCFC and Home Savings Boards in 2009. The Nominating and Governance Committee and the Board believe that the attributes, skills and qualifications, including, but not limited to, profit and loss management, new business development, performance management, risk management and strategic planning that Mr. Crewson has developed through his myriad executive positions held with BP plc and his highly developed business acumen allow him to provide invaluable business insight, valuable leadership and guidance and expertise on strategic planning, risk management and profit and loss management to the Board. Mr. Crewson also presents a diversity of experience to the Board after serving BP internationally across several geographies and cultures., 236157=While we did not report positive net income in 2012, the Committee determined at the time it adopted the EIP that the bulk troubled asset sale, if successful, should be excluded as an extraordinary item because the Board and management established this transaction as a key goal for UCFC and Home Savings in 2012. By completing the bulk troubled asset sale, we achieved a substantial improvement in our asset quality and a dramatic reduction in our risk profile, and as a result of the sale, Home Savings exceeded its regulatory asset quality targets that were set forth in its Consent Order. The sale of those assets resulted in a charge of approximately $33.0 million, and without that charge (and another charge related to a troubled loan relationship that was resolved in a separate transaction for which management obtained a better result than had such relationship been sold in the bulk sale), net income would have been $13.2 million. Of the loans sold in the bulk troubled asset sale, $91.6 million were classified, $63.3 million were nonperforming and $53.0 million were noncurrent., 86252=During 2010, the Compensation Committee engaged Organizational Consulting Group, LLC (\u0093OCG\u0094) to consult with the Board and make recommendations regarding the compensation of UCFC\u0092s and Home Savings\u0092 executive officers. In doing so, OCG was instructed to conduct a study of the compensation paid to such executive officers in relation to UCFC\u0092s peer group and to recommend whether any adjustments should be made to any of the officers\u0092 compensation. The Compensation Committee utilized the compensation study prepared by OCG as updated by Home Savings\u0092 Vice President \u0097 Human Resources to establish the 2012 salaries of UCFC\u0092s and Home Savings\u0092 executive officers, including Messrs. Bevack, Reske, Krontiris, Nohra and Garrity, and will maintain the compensation strategy developed to establish the 2013 salaries of UCFC\u0092s and Home Savings\u0092 executive officers., 29942=The proposals to approve UCFC\u0092s executive compensation and to determine the frequency of holding a vote on executive compensation are advisory, so they will not be binding upon the Board. However, the Compensation Committee will take into account the outcome of the votes when considering the frequency of holding advisory votes on executive compensation and future executive compensation arrangements. The proposal to ratify the selection of auditors is not binding upon the Board. However, if the selection is not ratified by the shareholders, the Audit Committee may re-consider its selection of Crowe Horwath LLP as the independent registered public accounting firm for the fiscal year ending December 31, 2013., 257088=Long-Term Equity Compensation.    Named Executive Officers participate in UCFC\u0092s long-term incentive plans approved by shareholders: the 1999 Amended and Restated Long-Term Incentive Plan and the 2007 Amended and Restated Long-Term Incentive Plan. On May 20, 2009, the 1999 Plan terminated. All existing awards made under that plan generally expire 10 years after the award was made or until otherwise terminated in accordance with the terms and conditions of the 1999 Plan. Long-term equity compensation is intended to align executive officers\u0092 interests with those of shareholders, attract and retain highly-qualified executives and maintain a stable executive management group., 17375=Youngstown, Ohio 44503-1203, 84821=The Compensation Committee of UCFC has the primary responsibility for assisting the Board in discharging its responsibilities relating to the compensation of UCFC\u0092s \u0093executive officers,\u0094 as defined under applicable federal securities laws and regulations. Thus, the Committee annually recommends the compensation package for the Company\u0092s executive officers (which includes some executive officers of Home Savings) and Named Executive Officers (Named Executive Officers are those executives for whom compensation is required to be disclosed in the Summary Compensation table below) to the Board for its approval. From time to time, the Committee invites certain members of management to attend meetings to discuss the performance of UCFC and Home Savings and other matters affecting the compensation of each of the executive officers. Mr. Bevack made no recommendations to the Compensation Committee regarding his own compensation. The current members of the Compensation Committee, all of whom are independent, are Messrs. Buoncore, Crewson, Hunter, and Schiraldi (as Ex-Officio Member) and Dr. Sweet. Mr. Crewson is the Chairman of the Compensation Committee. The Compensation Committee met five times during 2012, but one of those meetings was brief and no fee was paid to members., 242082=However, given UCFC\u0092s consolidated net loss for the year and its net operating losses from prior years, UCFC had no tax liability in 2012. Accordingly, the Committee determined that a comparison of the net income after excluding the loss from the bulk asset sale, which included no income tax expense, to the peer group who earned net income and were in a tax paying position did not result in a fair comparison. Since the EIP includes a provision that permits the Committee to use its discretion in determining awards, the Committee decided to compare UCFC\u0092s performance to the peer group on a pre-tax basis when calculating cash and equity incentive awards., 72431=Richard J. Schiraldi.    Mr. Schiraldi is a CPA and has been a partner at Cohen & Company, Certified Public Accountants, Youngstown, Ohio, since 1990. Mr. Schiraldi served as Director of Tax Operations at Cohen from 1983 until 2003. Prior to that, Mr. Schiraldi worked for Touche Ross. He is an owner and director of Sequoia Financial Group, LLC, which provides a variety of services including financial planning and asset management services, insurance sales, estate planning, and employee retirement design and implementation services. Mr. Schiraldi also serves as a director and the Chairman of the Board of Home Savings, and he has a distinguished record of serving his community as a trustee or director of numerous not-for-profit entities. The Nominating and Governance Committee and the Board believe that the attributes, skills and qualifications that Mr. Schiraldi has developed as a CPA in public practice for approximately 27 years, as an owner and manager of privately held businesses and as a director of numerous not-for-profit entities allow him to provide strategic planning, tax, accounting and financial expertise (including his ability to serve as an Audit Committee financial expert), as well as a local perspective on community affairs and valuable leadership insight to the Board., 165818=Annual Cash Bonus.    The Committee and the Board previously approved a Stay Bonus and Retention Plan. That plan provided for a $1,000 cash bonus to be paid to all participants in January 2012. In addition, the Board determined to give all employees a $50 Visa gift card in December 2012 as a small token of appreciation for their efforts., 453059=\u0093RESOLVED, that the shareholders approve the compensation of UCFC\u0092s named executive officers as named in the Summary Compensation Table of the Company\u0092s 2013 Proxy Statement, as described in the \u0091Compensation Discussion and Analysis,\u0092 the compensation tables and the related disclosure contained on pages 14-27 in the Proxy Statement.\u0094, 46146=Had Mrs. Atkinson not retired, she would have been up for re-election by shareholders at this year\u0092s Annual Meeting, and the Board has determined to maintain and fill this vacancy. As part of UCFC and Home Savings\u0092 goals to recruit additional qualified candidates to the Board, the Nominating and Governance Committee and the other members of the Board have engaged in a recruiting effort to seek a new director to fill the vacancy created by Mrs. Atkinson\u0092s retirement. A Director who is elected by the Board to fill this vacancy will have a term expiring at the Annual Shareholders\u0092 Meeting in 2016., 514366=Any proposals of qualified shareholders intended to be included in the proxy statement for the 2014 Annual Meeting of Shareholders of UCFC should be sent to UCFC by certified mail and must be received by UCFC not later than December 26, 2013. In addition, if a shareholder intends to present a proposal at the 2014 Annual Meeting without including the proposal in the proxy materials related to that meeting, and if the proposal is not received by March 10, 2014, then the proxies designated by the Board of UCFC for the 2014 Annual Meeting of Shareholders of UCFC may vote in their discretion on any such proposal any shares for which they have been appointed proxies without mention of such matter in the proxy statement or on the proxy card for such meeting., 26674=The Proxy Statement and Annual Report on Form 10-K for the year ended December 31, 2012 are available at http://www.cfpproxy.com/4576., 448812=The Board approved the form of Subscription Agreement. The issuance and sale of the common shares to Messrs. Adams, Buoncore and Burdman (including his spouse and affiliates) and to all the others who are considered insiders (collectively, the \u0093Insider Offering\u0094), was subject to shareholder approval at the May 28, 2013 Special Meeting of Shareholders. As previously disclosed, shareholders approved the Insider Offering at the Special Meeting, and the Insider Offering closed on May 29, 2013. The foregoing description of the Subscription Agreement is summary in nature and does not purport to be a complete description of all of the terms of such agreement, and is qualified in its entirety by reference to the form of Subscription Agreement attached as Exhibit 10.2 to United Community\u0092s Current Report on Form 8-K filed on January 15, 2013., 45607=In advance of this year\u0092s Annual Meeting, Eugenia C. Atkinson announced that she will retire from her service on the Board as of the date of the Annual Meeting. Mrs. Atkinson has served as a director of UCFC since 2005 (and as a director of Home Savings since 1999). The Board and management will sincerely miss the dedication and loyalty that Mrs. Atkinson provided to this Company and the Board., 19507=Only shareholders of record at the close of business on July 15, 2013 will be entitled to vote at the Annual Meeting. Whether or not you expect to attend the Annual Meeting, we urge you to consider the accompanying proxy statement carefully and to SIGN, DATE AND PROMPTLY RETURN THE ENCLOSED PROXY SO THAT YOUR SHARES MAY BE VOTED IN ACCORDANCE WITH YOUR WISHES AND THE PRESENCE OF A QUORUM AT THE ANNUAL MEETING MAY BE ASSURED. Submitting a proxy does not affect your right to vote in person in the event you attend the Annual Meeting., 450626=The Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (the \u0093Dodd-Frank Act\u0094), and the rules and regulations adopted by the SEC under the Dodd-Frank Act, require that UCFC\u0092s shareholders have an opportunity to approve, in a non-binding advisory vote, the compensation of the Named Executive Officers as disclosed in this proxy statement. Our Named Executive Officers are those individuals included in the Summary Compensation Table on page 23 in this proxy statement. The compensation being approved is the compensation required to be disclosed in this proxy statement by the rules of the SEC, including the compensation described in the Compensation Discussion and Analysis, accompanying tables and any related material disclosed in this proxy statement., 75458=Marty E. Adams.    Mr. Adams is President of Marty Adams Consulting, LLC (\u0093MA Consulting\u0094), where he serves as an advisor both to banks and their boards of directors and to private equity firms pertaining to bank equity investments. Mr. Adams served as a director of PVF Capital Corp. from January 2010 to February 2013 and as a director of its wholly-owned subsidiary, Park View Federal Savings Bank from September 2009 to February 2013. Mr. Adams served as Interim Chief Executive Officer of PVF Capital Corp. and Park View Federal Savings Bank from March 2009 until September 9, 2009. Previously, Mr. Adams served as President and Chief Operating Officer of Huntington Bancshares, Inc. from July 2007 until December 2007 following Huntington Bancshares\u0092 acquisition of Sky Financial Group, Inc. Mr. Adams previously served as the Chairman and Chief Executive Officer of Sky Financial Group, Inc. Currently, Mr. Adams serves as a trustee for The University of Mount Union and a member of the Foundation Board of West Liberty University. During the past ten years, Mr. Adams also served as a director of Sky Financial Group, Inc. and Huntington Bancshares, Inc. The Board believes that the attributes, skills and qualifications Mr. Adams has developed through more than 30 years\u0092 experience in the banking and financial services industries, as well as his service in significant public company leadership positions, including as a Chief Executive Officer of more than one financial institution, allow him to provide technical knowledge in nearly all operational areas of banking (including administration, operations, marketing, retail banking and mortgage and commercial lending) and invaluable business, strategic planning, capital planning and raising, mergers and acquisitions, financial and leadership insight to the Board., 147021=The Committee originally approved a peer group in 2009, which has been revised as necessary by the Committee, to use as a benchmark for purposes of setting base salaries of, and awarding cash bonuses and equity based compensation to, the Named Executive Officers. For 2012, the peer group established by the Committee included the following 18 companies:, 24111=Proxies may be revoked by (a) delivering a written notice expressly revoking the proxy to the Secretary of UCFC at the above address prior to the Annual Meeting, (b) delivering a later dated proxy to UCFC at the above address prior to the Annual Meeting or (c) attending the Annual Meeting and voting in person (except, if you hold your shares with a bank, broker or other nominee, you cannot vote your shares in person). Proxies may be solicited by the directors, officers and other employees of UCFC and The Home Savings and Loan Company of Youngstown, Ohio, a wholly-owned subsidiary of UCFC, in person or by telephone, telecopy, mail or electronic mail, only for use at the Annual Meeting. All solicitation costs will be borne by UCFC. This proxy statement is first being mailed to the shareholders of UCFC on or about July 31, 2013., 70107=Richard J. Buoncore.    Mr. Buoncore is a CPA (currently inactive) and a managing partner of MAI Wealth Advisors, LLC, Cleveland, Ohio, a position he has held since December 2006. Previously, Mr. Buoncore was Managing Partner of BC Investment Partners LLC, which merged into MAI Wealth Advisors, a position he had held from 2005 to December 2006. From 1999 until 2005, he was the Chief Executive Officer of Victory Capital Management, Cleveland, Ohio, and served as its President and Chief Operating Officer from 1995 until 1999. Additionally, Mr. Buoncore has seven years of audit experience as a CPA with KPMG in New York, and six years of investment banking experience with Lehman Brothers. Mr. Buoncore also serves as a director of Home, 520299=2013 ANNUAL MEETING OF SHAREHOLDERS, 77831=Lee J. Burdman.    Mr. Burdman is Co-Founder and Managing Partner of Redstone Investments, a development, management and acquisitions company focusing on shopping center development, which is headquartered in Youngstown, Ohio, and has an office in Tampa, Florida. Mr. Burdman joined the UCFC and Home Savings Boards in April 2011. The Nominating and Governance Committee and the Board believe that the attributes, skills and qualifications that Mr. Burdman has developed through 26 years of owning, managing and developing real estate, his knowledge of commercial real estate lending through his business operations, his high level of financial literacy, his executive management experience as the Co-Founder and Managing Partner of Redstone Investments, his history of public service on numerous community boards and most importantly his past experience as a member of the board of a local community bank and subsequently as a regional board member of that bank\u0092s successor by merger allow him to provide lending, real estate and strategic planning insight, a local perspective on community affairs and valuable financial and leadership experience to the Board., 52393=Patrick W. Bevack.    Mr. Bevack was appointed President and Chief Executive Officer of UCFC on January 1, 2011. Additionally, Mr. Bevack has served as President and CEO of Home Savings since March 2009. Prior to this, Mr. Bevack had served as President and Chief Operating Officer since January 2007. From June 2003 through January 2007, Mr. Bevack was Executive Vice President, Chief Financial Officer and Treasurer of Home Savings. Mr. Bevack joined Home Savings in June 2000 and served as Senior Vice President of Mortgage Lending until June 2003. Prior to joining Home Savings, he was Executive Vice President, Chief Financial Officer and Assistant Secretary of Metropolitan Bank and Trust. Mr. Bevack, who also serves as a Director of Home Savings, is a CPA (currently inactive), holds an MBA in finance and serves on a number of not-for-profit boards. The Nominating and Governance Committee and the Board believe that the attributes, skills and qualifications that Mr. Bevack has developed through more than 37 years of service in the banking industry allow him to provide technical knowledge in all operational areas of banking (including administration, operations, audit, accounting and finance, marketing, retail banking and mortgage and commercial lending) and invaluable business, strategic planning, financial, mergers and acquisitions and leadership insight to the Board., 89889=The Compliance and Risk Management Committee of UCFC and Home Savings met 12 times in 2012, but one of those meetings was brief meetings and no fee was paid to members., 107630=Messrs. Buoncore, Crewson, Hunter, and Schiraldi (as Ex-Officio Member) and Dr. Sweet served on the Compensation Committee during 2012. There were no Compensation Committee interlocks or insider (employee) participation during 2012., 165554=The Named Executive Officers\u0092 base salaries paid during 2012 are set forth in the \u0093Salary\u0094 column of the Summary Compensation Table., 92820=The Committee has reviewed its current Board leadership structure in connection with the filing of this proxy statement. In doing so, the Committee has concluded that the most effective Board leadership structure for UCFC continues to be for the Chairman of the Board to be an independent, non-executive member of the Board. The Board appointed Mr. Schiraldi to this position in September 2010, and he also serves as the Chairman of the Board of Home Savings. As the independent, non-executive Chairman of the Board, Mr. Schiraldi serves on all Board Committees, either as an appointed member or as an Ex-Officio member, and presides over all executive sessions of the Board. The Board believes this structure is an essential mechanism for enhancing the governance practices of the Board, ensuring that independent and open discussions occur amongst independent directors and between directors and management and facilitating a leadership position within the Board. The Boards maintain the authority at all times to modify this structure if necessary when doing so would be in UCFC\u0092s best interests., 371416=All of the options listed in the table above were either 100% vested on the date of grant or have subsequently vested over time. None of the Named Executive Officers exercised any options during 2012.}",
    "lastModified": "Wed, 31 Jul 2013 20:06:20 GMT",
    "textBeforeTable": "  The following directors will continue to serve on the Boards of both UCFC and Home Savings after the Annual Meeting for the terms indicated: The following information, as of the date of this proxy statement, concerning the age, principal affiliations and business experience of each of the continuing directors of UCFC has been furnished to UCFC by each director. In addition, the information set forth below reflects the evaluation of the Nominating and Governance Committee and the Board regarding the key attributes, skills and qualifications possessed by each continuing director. INCUMBENT DIRECTORS In accordance with UCFC\u0092s Code of Regulations, nominees for election as directors may be proposed only by the directors or by a shareholder entitled to vote for directors in a written nomination received by the Secretary of UCFC by the 60th day before the first anniversary of the most recent annual meeting of shareholders held for the election of directors. If the annual meeting for the election of directors in any year is not held on or before the 31st day following such anniversary, then the written notice shall be received by the Secretary within a reasonable time prior to the date of the annual meeting. Each written nomination must state the name, age, business or residence address of the nominee, the principal occupation or employment of the nominee,",
    "textAfterTable": "     2002         2014    David C. Sweet      74       Director      2004         2014    Marty E. Adams      60       Director      2013         2015    Lee J. Burdman   ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}