{
    "relation": [
        [
            "Name",
            "",
            "Adolphus B. Baker (1)(3)(5) Chairman of the Board, President, Chief Executive Officer and Director",
            "",
            "Timothy A. Dawson (1) Vice President, Chief Financial Officer/Secretary and Director",
            "",
            "Letitia C. Hughes (2)(3)(4)(5) Director",
            "",
            "Sherman Miller (1) Vice President, Chief Operating Officer and Director"
        ],
        [
            "Age",
            "",
            "55",
            "",
            "58",
            "",
            "60",
            "",
            "37"
        ],
        [
            "Tenure and Business Experience",
            "",
            "Mr. Baker was elected Chairman of the Board in July 2012. He was elected President and Chief Operating Officer in 1997. He served as Chief Operating Officer until he was elected Chief Executive Officer in 2010. He was serving as Vice President and Director of Marketing of the Company when elected President. Previously, he had served as Assistant to the President since 1987 and has been employed by the Company since 1986. He has served as a director of the Company since 1991 and is past chairman of American Egg Board, United Egg Producers, Egg Clearinghouse, Inc. and Mississippi Poultry Association. He is a director of United Egg Producers, Eggland’s Best, Inc., Trustmark Corporation and Trustmark National Bank. He is also a member of the board of managers of Eggland’s Best, LLC. Mr. Baker is Fred R. Adams, Jr.’s (our Chairman Emeritus) son-in-law.",
            "",
            "Mr. Dawson joined the Company in 2005 as Vice President and Chief Financial Officer. He has served as a director since 2005. He is also Secretary and Treasurer of the Company. Mr. Dawson served as Senior Vice President and Chief Financial Officer of Mississippi Chemical Corporation from 1999 until the sale of that company to Terra Industries, Inc. in 2004.",
            "",
            "Ms. Hughes has served as a director of the Company since 2001. Since 1974 Ms. Hughes has been associated with Trustmark National Bank, Jackson, Mississippi, in managerial positions. She is presently serving as Senior Vice-President, Manager, Private Banking. Ms. Hughes is an independent director.",
            "",
            "Mr. Miller joined the Company in 1996 and has served in various positions in operations. He was elected Vice President of Operations in 2007 and Chief Operating Officer in 2011. He was elected a director of the Company in July 2012. Mr. Miller is a director of U.S. Poultry and Egg Association."
        ]
    ],
    "pageTitle": "Edgar Filing: CAL MAINE FOODS INC - Form DEF 14A",
    "title": "",
    "url": "http://thenumbers.marketplace.org/publicradio/action/getedgarwindow?accesscode=115752312004786",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00035-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 236190319,
    "recordOffset": 236113103,
    "tableOrientation": "VERTICAL",
    "lastModified": "Sat, 01 Aug 2015 20:29:39 GMT",
    "textBeforeTable": "Check the appropriate box: Filed by a Party other than the Registrant [   ] Filed by the Registrant [X] Exchange Act of 1934 Proxy Statement Pursuant to Section 14(a) of the Securities SCHEDULE 14A WASHINGTON, D.C.  20549 SECURITIES AND EXCHANGE COMMISSION",
    "textAfterTable": "Payment of Filing Fee (Check the appropriate box): [X]  No fee required. [   ]  Fee computed on table below per Exchange Act Rules 14a-6(i)(1) and 0-11.  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}