{
    "relation": [
        [
            "key",
            "F10 or Ctrl-t",
            "?",
            "F10 → Help → User's Manual",
            "u",
            "+",
            "-",
            "_",
            "=",
            "U",
            "g",
            "q",
            "x",
            "Enter",
            "C",
            "l",
            "/",
            "\\"
        ],
        [
            "key binding",
            "menu",
            "display help for keystroke (more complete listing)",
            "display User's Manual",
            "update package archive information",
            "mark the package for the upgrade or the install",
            "mark the package for the remove (keep configuration files)",
            "mark the package for the purge (remove configuration files)",
            "place the package on hold",
            "mark all upgradable packages (function as full-upgrade)",
            "start downloading and installing selected packages",
            "quit current screen and save changes",
            "quit current screen and discard changes",
            "view information about a package",
            "view a package's changelog",
            "change the limit for the displayed packages",
            "search for the first match",
            "repeat the last search"
        ]
    ],
    "pageTitle": "Chapter 2. Debian package management",
    "title": "",
    "url": "http://www.debian.org/doc/manuals/debian-reference/ch02.en.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00185-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 391789427,
    "recordOffset": 391740184,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{222799=The APT system choses the highest Pin-Priority upgrading package from available package sources defined in the \"/etc/apt/sources.list\" file as the candidate version package. If the Pin-Priority of the package is larger than 1000, this version restriction for upgrading is dropped to enable downgrading (see Section 2.7.10, “Emergency downgrading”)., 202820=If system breakage is minor, you may alternatively downgrade the whole system as in Section 2.7.10, “Emergency downgrading” using the higher level APT system., 126725=In reality, it is not so easy to get meaningful understanding quickly out from these logs. See Section 9.2.10, “Recording changes in configuration files” for easier way., 152359=See (re)packaging procedure using \"apt-get source\" in Section 2.7.13, “Porting a package to the stable system”., 89720=Although the aptitude command comes with rich features such as its enhanced package resolver, this complexity has caused (or may still causes) some regressions such as Bug #411123, Bug #514930, and Bug #570377. In case of doubt, please use the apt-get and apt-cache commands over the aptitude command., 79204=The use of \"apt-get dist-upgrade\" is recommended for it. See Bug #411280., 54874=For about few months after a new stable release, most desktop users should use the stable archive with its security updates even if they usually use unstable or testing archives. For this transition period, both unstable and testing archives are not good for most people. Your system is difficult to keep in good working condition with the unstable archive since it suffers surges of major upgrades for core packages. The testing archive is not useful either since it contains mostly the same content as the stable archive without its security support (Debian testing-security-announce 2008-12). After a month or so, the unstable archive may be usable if you are careful.}",
    "lastModified": "Wed, 03 Dec 2014 15:28:27 GMT",
    "textBeforeTable": "Table 2.8. List of key bindings for aptitude Notable key strokes to browse status of packages and to set \"planned action\" on them in this full screen mode are the following. 2.2.4. Key bindings of aptitude Aptitude automatically sets pending actions as it is started interactively. If you do not like it, you can reset it from menu: \"Action\" → \"Cancel pending actions\". Tip If you want to use root's configuration instead of user's one, use \"sudo -H aptitude …\" instead of \"sudo aptitude …\" in the above expression. Tip This updates the local copy of the archive information and display the package list in the full screen with menu. Aptitude places its configuration at \"~/.aptitude/config\". Password: $ sudo aptitude -u For the interactive package management, you start aptitude in interactive mode from the console shell prompt as follows. 2.2.3. Interactive use of aptitude The",
    "textAfterTable": "The file name specification of the command line and the menu prompt after pressing \"l\" and \"//\" take the aptitude regex as described below. Aptitude regex can explicitly match a package name using a string started by \"~n and followed by the package name. Tip You need to press \"U\" to get all the installed packages upgraded to the candidate version in the visual interface. Otherwise only the selected packages and certain packages with versioned dependency to them are upgraded to the candidate version. 2.2.5. Package views under aptitude In the interactive full screen mode of aptitude(8), packages in the package list are displayed as the next example. idA libsmbclient -2220kB 3.0.25a-1 3.0.25a-2 Here, this line means from the left as the following. The \"current state\" flag (the first letter) The \"planned action\" flag (the second letter) The \"automatic\" flag (the third letter) The Package name The change in disk space usage attributed to \"planned action\" The current version of the",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}