{
    "relation": [
        [
            "Time (ET)",
            "6:00 PM",
            "9:37 PM"
        ],
        [
            "Network",
            "TBS",
            "TBS"
        ],
        [
            "Home",
            "Tigers",
            "Giants"
        ],
        [
            "Away",
            "Athletics",
            "Reds"
        ],
        [
            "Pitchers",
            "Undecided vs Verlander",
            "Cueto vs Cain"
        ]
    ],
    "pageTitle": "Television",
    "title": "",
    "url": "http://www.bizofbaseball.com/index.php?option=com_content&view=category&layout=blog&id=57&Itemid=122&limitstart=20",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00255-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 327141151,
    "recordOffset": 327104870,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{178631=Hall of Fame broadcaster Vin Scully, one of the most revered figures in Los Angeles sports history, will return to the broadcast booth for an unprecedented 64th season in 2013, it was announced. Scully will again call all Dodger home and road games in California and Arizona., 54040=Oct. 12th, 89587=5:37 p.m. (ET), 89198=Oct. 9th, 75843=Oct. 12th, 28583=Sat., Oct. 13th, 36162=Fri., Oct. 19th, 180385=Scully began his professional baseball broadcasting career in 1950 with the Brooklyn Dodgers. He was inducted into the National Baseball Hall of Fame in 1982. During his unmatched career, he has called three perfect games, 25 no-hitters, 25 World Series and 12 All-Star Games. Iconic moments called by Scully include Kirk Gibson’s miraculous Game 1 homer in the 1988 World Series, Hank Aaron’s record-setting 715th home run, Sandy Koufax’s four no-hitters, including a perfect game, and the scoreless-inning streaks of Dodger greats Don Drysdale and Orel Hershiser., 87524=4:37 p.m. (ET), 37028=Sat., Oct. 20th, 121963=Oct. 8th, 141677=Tuesday, Oct 9, 40543=^ If ALCS is complete, then NLCS Game 6 will shift to 7:45 p.m. (ET)., 167516=Major League Baseball and ESPN today announced the largest broadcast deal in league history with a new eight-year, $5.6 billion agreement ($700 million annually) that will carry their longstanding relationship into its fourth decade.  The agreement sets the standard going forward for Major League Baseball broadcasting as ESPN’s annual rights fee will increase by 100% over its current deals ($306 million annually), marking a new all-time record for an MLB broadcasting deal. The deal grants ESPN, which first began televising Major League Baseball games in 1990, a significant increase in studio and game content, including the right to broadcast up to 90 regular season MLB games per year across the ESPN networks beginning in 2014 and running through the 2021 season.  ESPN will continue to telecast three Major League Baseball windows each week including Monday nights, Wednesday nights, and the nationally exclusive “Sunday Night Baseball” franchise. , 119102=3:07 p.m. (ET), 126214=TBS will air up to 18 of the potential Division Series games, while MLB Network will air a Division Series game on Sunday, October 7th and Wednesday, October, 29164=8:07 p.m., 50086=1:07 p.m. (ET), 51172=4:07 p.m. (ET), 54518=5:07 p.m. (ET)%, 90602=9:07 p.m. (ET)/6:07 p.m. (PT), 117531=Oct. 7th, 179488=“The Dodgers are ecstatic to have Vin back with the team in 2013,” said Dodger Chairman and Owner Mark Walter. “Vin is a treasure to the Dodgers, baseball and the city of Los Angeles and having him continuing his work in the broadcast booth next season means a great deal to all of us.”, 137402=Saturday, Oct 6, 111229=MLB has released more of the 2012 postseason schedule. Please note that the schedule below is tentative and subject to change based on postponed and/or suspended games., 39603=Mon., Oct. 22nd, 56228=%   Shifts to 7:07 p.m. (ET) on TBS if STL-WSH series ends on Thursday, October 11th., 117996=12:07 p.m. (ET), 138964=9:37 PM, 38511=4:45 p.m., 78034=^    On Thursday, SF-CIN, STL-WSH and BAL-NYY each shift to one hour later if DET-OAK series ends on either Tuesday, October 9th or Wednesday, October 10th., 63020=With the Giants and the A’s staving off elimination yesterday, Major League Baseball has released the remainder of the 2012 League Division Series (LDS) schedule., 155727=Now, it appears that both FOX and TBS will renew their deals with the league, and follow suit with ESPN and double the rights fees. Both extensions would begin in 2014 and would run through 2021, just as the ESPN extension does. FOX will reportedly pay approx. $500 million annually while TBS will jump to $300 million per year., 136792=8:30 PM, 112974=Oct. 5th, 180123=“We’re thrilled to know that in our quest to heighten the fan experience at Dodger Stadium, the fan experience everywhere Vin’s voice can be heard will continue to be maximized through at least the 2013 season,” said Dodger President and CEO Stan Kasten., 138344=6:00 PM, 126379=For the first time in its four-year history, MLB Network will exclusively televise a Postseason game as Matt Vasgersian and Jim Kaat call Game Two of the American League Division Series featuring the Oakland Athletics at Detroit Tigers this Sunday, October 7 at 12:00 p.m. ET, live from Comerica Park., 55696=8:37 p.m. (ET), 66455=9:07 p.m. (ET)/6:07 p.m. (PT), 77902=*    Shifts to 8:37 p.m. (ET) on TBS if the CIN-SF and DET-OAK series both end on Tuesday, October 9th., 135225=Wild Card Play-In Games (Fri, Oct 5), 74108=7:37 p.m. (ET)^, 32817=Wed., Oct. 17th, 92647=4:07 p.m. (ET), 94678=9:37 p.m. (ET)/6:37 p.m. (PT), 31985=Tues., Oct. 16th, 87099=Oct. 8th, 73021=4:07 p.m. (ET)^, 88573=8:07 p.m. (ET), 136188=5:07 PM, 114655=8:37 p.m. (ET)/7:37 p.m. (CT), 64868=Oct. 9th, 49627=Oct. 11th, 37929=Sun., Oct. 21st, 53344=9:37 p.m. (ET)/6:37 p.m. (PT), 65355=5:37 p.m. (ET), 93662=7:37 p.m. (ET)*, 71934=1:07 p.m. (ET)^, 103259=So how did it rank on television? While the NFL must surely be laughing, TBS’s exclusive live doubleheader coverage of Major League Baseball’s first-ever Wild Card averaged a 3.7 overnight rating, based on Nielsen overnight ratings. The network’s telecasts, marking the start of the 2012 MLB Postseason, were up 12 percent compared with an averaged 3.3 overnight rating for the entire Division Series last year. When compared to last year’s opening day of the MLB Postseason (Texas vs. Tampa Bay, ALDS Game 1 – 2.3 overnight rating), the Wild Card games are up 61 percent., 115309=Oct. 6th, 139554=Sunday, Oct 7, 69731=7:37 p.m. (ET)*, 78339=MLB Network will air the St. Louis Cardinals at Washington Nationals Game 3 on Wednesday afternoon, while Turner Sports will air the remainder of the Division Series games (up to 18 games total).  ESPN Radio will provide live national coverage of all 2012 MLB Postseason games., 34488=Thurs., Oct. 18th, 172213=And then there’s the issue of the exclusivity agreements that impact the league’s blackout policy via the MLB Extra Innings television package or MLB.TV, the now decade-old digital streaming of games. With the increase to 90 games a season, more Sunday games will be blacked out nationally. And while the blackout issue on Sunday evenings for ESPN has been difficult, it is nationally televised Saturday day games on FOX that has created the biggest blackout issue. To that, ESPN is really the first of three national broadcast deals that will be addressed shortly as the deals with FOX and TBS still have yet to be addressed. It could be as late asthe end of 2013 when the contracts expire before those addressed., 29449=Sun., Oct. 14th, 180958=When Scully began broadcasting, the Dodgers had yet to win a World Series. Three years later, at the age of 25, he became the youngest person to ever broadcast a World Series game. In 1955, he had his most memorable moment behind the microphone, as he called the Dodgers' first and only championship in Brooklyn., 168700=In addition, ESPN will once again televise Postseason baseball, beginning in 2014 with one of the two Wild Card Games presented by Budweiser.  ESPN will alternate airing the American League and National League Wild Card Games each year.  Also starting in 2014, ESPN will have the rights to all potential regular season tiebreaker games.  This new agreement covers television and radio rights to MLB programming both in the U.S. and internationally, and will include expanded hours of Baseball Tonight and other ancillary baseball programming across ESPN platforms.  In addition, ESPN MLB game telecasts and other baseball programming will be available via ESPN3.com and the Watch ESPN app.  ESPN has also made a commitment to showcase each of the 30 MLB Clubs at least once per season in a live game telecast., 120206=6:15 p.m. (ET), 115774=6:07 p.m. (ET), 30870=8:15 p.m., 67094=Oct. 10th, 91241=Oct. 10th, 91632=1:07 p.m. (ET), 52258=7:37 p.m. (ET), 77406=8:37 p.m. (ET), 143790=Weds, Oct 10, 30030=4:07 p.m., 179782=“It was a treat to be able to listen to Chick Hearn through my years with the Lakers,” said Dodger owner Earvin Johnson, “and it’s been great to be able to listen to Vin work his magic in the broadcast booth since I came to Los Angeles in 1979. Generations of Angelenos have been blessed to have these Hall of Famers in their midst.”, 154787=When MLB inked the largest television rights extension in their history with ESPN in late August (see ESPN Reaches Largest Broadcast Deal Ever for MLB), the question was what would happen with the games that FOX and TBS were covering as the other broadcast partners with the league. Would extensions with the two transpire? Would the games all move to one of the two, or would NBC Sports Network jump into the fray? With ESPN ostensibly doubling their rights fee, it set the table., 95154=*Shifts to 8:37 p.m. (ET) on TBS if the CIN-SF and DET-OAK series both end on Tuesday, October 9th, 113447=5:07 p.m. (ET), 181278=In Los Angeles, Scully called Dodger World Championships in 1959, ’63, ’65, ’81 and ’88 and he was elected the top sportscaster of the 20th century by the non-profit American Sportscasters Association., 145843=Thurs, Oct 11, 85280=As MLB's 2012 postseason rolls on, here are the start times and network broadcast partners for the LDS through Weds., 31120=Mon., Oct. 15th, 123532=8:07 p.m. (ET), 76312=5:07 p.m. (ET)%, 122428=4:37 p.m. (ET)}",
    "lastModified": "Sat, 01 Aug 2015 20:16:35 GMT",
    "textBeforeTable": "With the playoffs now set, here are the playoff game times. Wild Card Play-In Games (Fri, Oct 5) Thursday, 04 October 2012 00:37 Written by Maury Brown    PoorBest  User Rating: / 24 With 2012 Regular Season Over, Here are MLB Playoff Game Times Through Sat   Maury Brown is the Founder and President",
    "textAfterTable": "  Saturday, Oct 6 Time (ET) Network Home Away Pitchers 6:00 PM TBS Tigers Athletics Undecided vs Verlander 9:37 PM TBS Giants Reds Cueto vs Cain   Sunday, Oct 7 Time (ET) Network Home Away Pitchers TBD TBS Tigers Athletics   TBD TBS Giants Reds",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}