{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "-Sykes at dark - Town is right there - Many sporting events",
            "Many, many options for food. It's quite tasty.",
            "Very friendly, nice dorms",
            "Challenging but manageable",
            "- Stay on top of your studies - If you party, monitor what you're doing and stay safe - Open door definitely invites more friendship!",
            "West Chester is the perfect place for people looking for a campus with a home-like environment. The campus is beautiful and has a ton of things to do. It also has very dedicated professors who are always available to help."
        ]
    ],
    "pageTitle": "West Chester University of Pennsylvania (WCU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/West-Chester-University-of-Pennsylvania/reviews?_escaped_fragment_=/show/45963",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00333-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 920533979,
    "recordOffset": 920449352,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{59930=-Banana Day: It'Â?s really hard to explain Banana Day to people that don'Â?t go to West Chester, but it is by far the highlight of everyone'Â?s year. Banana Day is a day all about bananas. All across campus, there are free bananas, and Lawrence serves banana-themed food. In the quad, there are dozens of games you can play in the hopes of winning a coveted Banana Day T-shirt. If you win a T-shirt, you should consider yourself a god amongst men. Do not over think this. It'Â?s literally a day about bananas. -Baker Bob and Diner Dan: These are the two icons of campus. Baker Bob is the most cheerful person in the world. He is in Sykes on Tuesdays and Lawrence on Wednesdays. He makes create-your-own desserts, and he is the happiest person in the world. You will consider him your second grandparent. Diner Dan is a unique, cynical man who works the register at the diner. He is quite a character, and will always wish you luck with your semester after handing you back your swipe card. -The castle's whispering arch: West Chester's campus is beautiful, and my favorite part about it is the castle building, called Philips Memorial Building. It is a beautiful castle at the entrance of campus, and a really cool feature of it is at the arch way, there is a little hole you can whisper into, and only the person standing on the other end of the arch can hear what you'Â?re saying. -Miss and Mr. WCU: Miss WCU is a huge pageant that happens in February. The contestants spend the entire school year preparing for this night, and it is basically the Miss America contest on a college level. Miss WCU is the queen of campus. Mr. WCU is basically a parody of Miss WCU, but it is so entertaining., 78735=Juniors apply early or you will wait till around April to find out if you got in and also walk the campus to see if you really should be here. Apply for scholarships also some of the ones for this school are really hard to get there are easier ones to get, 268565=A new recreational center was built on August 2012. It includes a rock-climbing, three basketball courts, weight room, aerobic room, fitness room, indoor track, etc. A person can easily join an intramural teams. There are several sports to choose from. On the weekends, students can watch movies for only $2 and have other activities as well., 369000=Banana Day is the greatest. Once a year in april the school promotes healthy eating by handing out bananas around campus and pairs with the school radio station to put together a bunch of fun activities to win banana themed shirts, which are a trophy of sorts on campus., 70163=When it comes to picking traditional versus affiliated housing, you get what you pay for. If you live in affiliated housing, you will pay almost twice as much as you would in traditional housing (almost $1000 a month), but you are basically living in a hotel. You only have to share your bathroom with one other person (your roommate), your rooms are much newer and carpeted, and they'Â?re slightly bigger than traditional rooms. The downside of affiliated housing is obviously the price and also the lack of social interaction. Students in affiliated dorms tend to keep their doors closed for some reason. This is not to say that you can'Â?t make friends in affiliated dorms, but it just doesn'Â?t happen as organically. In traditional dorms however, it'Â?s more socially acceptable to keep your door open if you want people to feel free to pop in and say hello. Students in traditional dorms are also more likely to congregate and socialize in the floor lounges, which in most dorms are the central hub you have to pass through in order to get to your room. The downside of traditional dorms is that you have to share a bathroom with everyone else in your wing, and the rooms are a little smaller and nothing fancy. However, these bathrooms are gender-specific, so you won'Â?t have to shower in a stall next to someone of the opposite gender, and these bathrooms are generally really clean. They are cleaned multiple times a day. Traditional dorms are really not as bad as everyone says they are. After a few weeks, a communal bathroom won'Â?t feel weird. I personally would recommend traditional dorms to everyone their freshman year, and then if you want to experience affiliated living, do that sophomore year., 64692=There are two main places to eat your meals on-campus: Lawrence Dining Hall and Ram'Â?s Head located in Sykes Student Union. Lawrence is buffet-style eating: you use one meal swipe to get in and you can eat whatever you want, as much as you want. The food at Lawrence is nothing spectacular, but most of it is not technically bad. It'Â?s what you would expect from college dining. Occasionally they'Â?ll have something that you might actually really enjoy. The great thing about Lawrence is the variety of food. You will always find something you like. There are some stations that have the same options every day, including the salad bar, soup, fruit, pizza, made-to-order pasta, made-to-order wraps, waffle makers, burgers, fries, cereal, bagels, and hot dogs. There are other stations that vary what they make on a day-to-day basis. Some of these options include meatloaf, chicken nuggets (so delicious), grilled chicken, pork, chicken pot pie, cooked vegetables, baked potato bar, fajita bar, Frito salad bar, mashed potato bar, nacho bar, and several other options. The best thing about Lawrence by far is the ice cream. They have a dozen different hard ice cream options, but they also have a soft serve machine. That can't be beat. Sykes is a completely different machine. The way the meal plan works at Sykes is that one meal swipe is worth $4.70. All the food at Sykes has a price, so you can buy up to $4.70 worth of stuff and use one meal swipe. If your food costs over $4.70, you can either pay for the balance with your Flex (you get $250 a semester with your meal plan), or you can use two meal swipes. If you have a lot of roll over meals (your meals roll over from week to week during the semester), then it'Â?s smarter to just use two meals rather than use up all your Flex. Flex rolls over from semester to semester and year to year, so it'Â?s nice to accumulate some roll over Flex that you can use if you ever want to eat on campus once you don'Â?t have a meal plan anymore. The other places for quick eating on campus are Einstein'Â?s Bagels, Starbucks, Java City, Larry'Â?s Market, the Pod in Main Hall, and the Diner. All of these places use your meal plan and accept meal swipes as well as flex. They function on the same system that Sykes does, where your meal swipe is worth $4.70. Einstein'Â?s is a great breakfast option. Their bagels are delicious, and in my opinion they have the best coffee on campus. Also, everyone that works there is super friendly. The only downside of Einstein'Â?s is that if you try to go before your 9:30 or 10:00 class, or if you go on a weekend morning between 10 AM and 1 PM, you will be standing in line for half an hour, because everyone else is doing the same thing as you. If you want to go before your 8 AM or 9 AM, you should have little to no line. The Starbucks on campus functions just like a normal Starbucks, so they carry the full menu. The great thing about using meals here is that instead of having to use $5 to pay for a Frappucino, you can just use a meal swipe. But again, right before and after classes, the line is usually out the door, and you will be standing in line for half an hour. Don'Â?t expect to just be able to grab coffee there before class. Java City is located near the entrance of Sykes, and the line here is rarely ever long. They have a smaller selection of bagels and pastries than Starbucks and Einstein's, and they usually only have two different kinds of coffee brewing. However, their coffee is good and really strong. If I have a cup of coffee from Java City, I am wired for the rest of the day. Larry'Â?s Market is located right outside of Lawrence, and they sell a lot of snack foods, everything from bags of chips, dip, candy, peanut butter, cereal, cleaning products, soda, Ben & Jerry's, and Bagel Bites. You can purchase anything in the store with Flex, which is great. The downside is that you could get anything in Larry's at a Grocery Store for much cheaper, but since you already have the Flex, it'Â?s nice to have the option. Larry's also sells packaged sandwiches, which can be combined with a small bag of chips and a drink for one meal swipe. This meal swipe combination also works at the Pod. Nothing else in Larry'Â?s or the Pod can be purchased with a meal; you have to use Flex. The Pod sells Java City coffee, soup, soda, juice, pre-packaged sandwiches, salads, and wraps, bagels, and pre-packaged cookies and granola bars. The Diner is open for lunch, dinner, and late-night junk food cravings (It's open from 12 to 12 on weekdays and 4PM to 1 AM on weekends). It'Â?s a sit down, order up style. They have everything from burgers to wraps to milkshakes to mac and cheese bites. The food is deliciously greasy and fattening, so if you eat at the diner, you will feel like you need a shower afterwards. If the line is long, you will have to wait a good 15-30 minutes for your food. On a bad night, some people wait up to an hour for their food (if you order a quesadilla, be prepared to wait). But if you go when it'Â?s not crowded, you won'Â?t have a problem., 330759=I'd say this is a very good school for it's price. West Chester University was named a 2012-2013 Best Value Public University by Kiplinger's Personal Finance., 425059=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/01/2009 Reviewer is A current student here. 19 out of 20 people found this review useful. 1 of 91 Amanda from Levittown, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Aliza from Fawn Grove, PA 01/02/2010 Reviewer is A current student here. 7 out of 8 people found this review useful. 2 of 91 Categories Comments Great for these types of students West Chester is great for education majors. That's what the school is known for. The first semester here, you get right into your major and your studies. The other fields here are very in depth as well. I am in the art program here, and although it is not an art school, West Chester's art program is amazing. The faculty are so helpful and understanding. As your get to know the faculty better, the classes get even better. It's a great program to be involved with. I couldn't ask for anything more. Tips for prospective students West Chester is a lot of fun, but you really have to learn how to manage your time here. It is really easy to get caught up in the party scene or to sit around and play video games all day. If you don't go to class and get your work done, you have no shot here. It's fun, but",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}