{
    "relation": [
        [
            "Date of Receipt",
            "7/22/2005",
            "7/22/2005"
        ],
        [
            "Date of review",
            "7/22/2005",
            "7/22/2005"
        ],
        [
            "Action Taken",
            "Approved Plans",
            "Approved Plans 07/26/05 Approval Number: 0529074"
        ]
    ],
    "pageTitle": "ISDH: Hamilton County Plan Review Project Status",
    "title": "Plan Status:",
    "url": "http://www.in.gov/isdh/23076.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 503252618,
    "recordOffset": 503236224,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{36864=Christ Tabernacle 1602 W 236th St Project Number: 2905340 Reviewer: Ed Miller, 95347=Q.C.S.A. 1611 E. 226th Street Project Number: 2913009 Reviewer:, 107123=Sundown Gardens 19653 Six-Points Rd. Project Number: 2912135 Reviewer: Ed Miller, 97688=Reynolds Farm Equipment SW corner US 31 & 276th St Project Number: 2912123 Reviewer: Zach Snively, 39441=Clarksville Christian Church 16600 Lehr St Project Number: 2912021 Reviewer: Zach Snively, 71724=Koteewi Prairie Park Sledding 12308 Edith Ave Project Number: 2915014 Reviewer:, 54888=Elbrecht Red-D-Mix Concrete 22016 US 31 North Project Number: 2906310 Reviewer: Dennis Ehlers (Retired), 32569=Blackhawk Winery 28153 Ditch Rd Project Number: 2911203 Reviewer:, 80166=McCregor Park Office SR 31 & SR 38 Project Number: 2912220 Reviewer: Zach Snively, 116364=World Mission Church of God 1700 SR 19 Project Number: 2914115 Reviewer: Robert Synko, 13159=For information on projects submitted before January 1, 2005, please contact the Environmental Public Health Division., 82022=New Life Assembly of God 11856 Wapiti Way Project Number: 2907019 Reviewer: Dennis Ehlers (Retired), 70793=Koteewi Prairie Park Equine 12308 E Strawtown Ave Project Number: 2915015 Reviewer:, 67763=House Farms pole barn office 26510 SR 37 Project Number: 2911168 Reviewer: Robert Synko, 65666=Hermann Animal Clinic 3/4-mi W of SR 37 on N side 206th Project Number: 2912186 Reviewer: Zach Snively, 115435=Wiatt Grain Co. Office 22755 Six Points Rd Project Number: 2912127 Reviewer: Ed Miller, 109896=Uhrick Mowing & Snow Plowing 10800 E 206th St Project Number: 2911194 Reviewer: Zach Snively, 26192=Beck's Hybrid Addition 6767 E 276th St Project Number: 2911148 Reviewer: Robert Synko}",
    "textBeforeTable": "Mound System Type: No Referred to LHD: Technical Data Sheet issued Action Taken: 12/5/2014 Date of Review: 10/1/2014 Soils Survey Received: Soils: Beck's Hybrids 6767 E 276th St Project Number: 2914195 Reviewer: Robert Synko System Type: No Referred to LHD: Email sent Action Taken: 6/22/2011 Date of Review: 6/15/2011 Soils Survey Received: Soils: Beck's Hybrid Addition 6767 E 276th St Project Number: 2911148 Reviewer: Robert Synko Mound System Type: Yes Referred to LHD: Technical Data Sheet issued Action Taken: 12/1/2006 Date of Review: 11/15/2006 Soils Survey Received: Soils: Beck Hybrids Seed Corn Warehouse S side of 276 St. S and W of Atlanta Project Number: 2906410 Reviewer: Dennis Ehlers (Retired) Mound System Type: Yes Referred to LHD: Technical Data Sheet issued Action Taken: 4/11/2005",
    "textAfterTable": "Beck's Hybrids Multiple Restrooms 6767 E 276th St Project Number: 2913161 Reviewer: Zach Snively Soils: Soils Survey Received: 7/10/2013 Date of Review: 7/31/2013 Action Taken: Additional Information Required Referred to LHD: No System Type: Gravity Beck's Hybrids R & D Bldg. 6767 E 276th St Project Number: 1413109 Reviewer: Ed Miller Soils 1: Soils Survey Received: 5/5/2011 Date of Review: 5/29/2011 Action Taken: Email sent Referred to LHD: No System Type:   Soils 2: Soils Survey Received: 8/4/2011 Date of Review: 8/18/2011 Action Taken: Technical Data Sheet issued Referred to LHD: No System Type: Mound   Soils 3: Soils Survey Received: 9/22/2011 Date of Review: 10/20/2011 Action Taken: Technical Data Sheet issued Referred to LHD: No System Type: Mound",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}