{
    "relation": [
        [
            "Division",
            "AFC East",
            "AFC North",
            "AFC South",
            "AFC West",
            "NFC East",
            "NFC North",
            "NFC South",
            "NFC West"
        ],
        [
            "AFC opponent",
            "West",
            "South",
            "North",
            "East",
            "North",
            "South",
            "West",
            "East"
        ],
        [
            "NFC opponent",
            "West",
            "East",
            "North",
            "South",
            "West",
            "South",
            "North",
            "East"
        ]
    ],
    "pageTitle": "2008 NFL season - The Full Wiki",
    "title": "",
    "url": "http://www.thefullwiki.org/2008_NFL_season",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00133-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 762294895,
    "recordOffset": 762194410,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{134991=On November 16, during Week 11, a game between the Philadelphia Eagles and the Cincinnati Bengals at Paul Brown Stadium ended in a 13-13 tie, the first NFL tie game since November 10, 2002, when the Atlanta Falcons and the Pittsburgh Steelers ended in a 34–34 draw. After the game, Donovan McNabb infamously mentioned that he didn't know there were ties in the NFL. This drew the ire of many fans, who thought that a quarterback of his caliber should know some fundamental rules., 275963=The playoffs began with Wild Card Weekend on January 3–4, 2009. The Divisional Playoffs were played on January 10–11 and the Conference Championship Games on January 18. Super Bowl XLIII was played on February 1 at Raymond James Stadium in Tampa, Florida with the Pittsburgh Steelers winning their record sixth Super Bowl., 14936=In preseason games, the annual Pro Football Hall of Fame Game was played August 3 between the Indianapolis Colts and Washington Redskins, which aired on NBC.[3] Washington won the game, 30–16.[4] Other preseason highlights included the first game of the Toronto Series, which was played August 14 between the Buffalo Bills and the Pittsburgh Steelers at Toronto's Rogers Centre. The Bills won that game, 24–21.[5], 129393=Hurricane Ike forced several changes to the 2008 schedule. The Houston Texans' Week 2 home game against the Baltimore Ravens was first postponed to Monday, September 15, before Ike made landfall; damage to Reliant Stadium forced a further postponement, to Week 10, on Sunday, November 9, giving the Texans and the Ravens their bye weeks in Week 2. Furthermore, to accommodate this move, the Texans' home game against the Cincinnati Bengals was moved up from November 9 to Sunday, October 26, pushing the Bengals' bye week from Week 8 to Week 10.[48], 145622=The 2008 season will mark just the third time in the salary cap era (and first since 2001) that no NFL team made major changes to their uniforms or logo. Since 1993, half of the league's teams (Arizona, Atlanta, Buffalo, Cincinnati, Denver, Minnesota, New England, New York Giants, New York Jets, Philadelphia, San Diego, San Francisco, Seattle, St. Louis, Tampa Bay, and Tennessee) have completely redesigned their uniforms (The Patriots doing it three times, though none since 2000) while another five (Detroit, Green Bay, Miami, New Orleans, and Pittsburgh) making minor, though noticeable, changes. The Titans are swapping home and alternate designations on their light blue and navy blue jerseys though., 300948=Meanwhile, NBC's Football Night in America reunited Dan Patrick with Keith Olbermann on television for the first time since 1997 when they co-hosted SportsCenter., 242403=In preseason games, the annual Pro Football Hall of Fame Game was played August 3 between the Indianapolis Colts and Washington Redskins, which aired on NBC.[3] Washington won the game, 30–16.[4] Other preseason highlights included the first game of the Toronto Series, which was played August 14 between the Buffalo Bills and the Pittsburgh Steelers at Toronto's Rogers Centre. The Bills won that game, 24–21.[5], 24140=The traditional Thanksgiving Day games [12] were held on November 27, with the Detroit Lions hosting the Tennessee Titans at 12:30 PM EST on CBS (with the then 10–1 Titans handily defeating the then 0–11 Lions by a 47–10 score), and the Dallas Cowboys' home game following suit on Fox at 4:15 PM EST against the Seattle Seahawks (Dallas Cowboys defeated the Seattle Seahawks by a score of 34–9). A third game on NFL Network, featuring the Arizona Cardinals and the Philadelphia Eagles followed at 8:15 PM EST.[1][6] It was the first home game for the Eagles on Thanksgiving Day since 1940, and their first Thanksgiving game at any location since the infamous Bounty Bowl Game in 1989; the Eagles defeated the Cardinals by a score of 48–20. (The Cardinals and Eagles would, two months later, rematch in the NFC Championship Game, with Arizona winning this time by a score of 32–25.), 21624=This was the second consecutive season that the league played at least one regular season game outside the United States as part of its International Series. The contest between the San Diego Chargers and the New Orleans Saints was played at Wembley Stadium in London on October 26, with New Orleans winning 37–32.[8][9] The Chargers played at Buffalo the week beforehand on October 19 so they could immediately travel to London afterward in order to get used to the time difference.[8], 305165=The Pittsburgh Steelers 2008 season/Super Bowl XLIII championship home video went on sale on DVD on February 24, 2009. One week later on March 3, it was released on Blu-ray Disc, making it the first NFL Films home video release to be on Blu-ray Disc.[24] The Blu-ray copy is \"officially\" sold exclusively through Amazon.com, though it is also available through the Sports Illustrated Super Bowl offer as well as eBay. Among its exclusive content included having most of the features in high-definition video as well as the NFL on Fox fourth-quarter coverage of the Steelers matchup against the Dallas Cowboys at Heinz Field in its entirety. The matchup, which took place during Week 14 and renewed the rivalry the two teams had in the 1970s & 1990's, saw the Steelers come back from a 4th quarter ten point deficit to win 20-13., 302994=On December 4, the NFL Network broadcast its game between the Oakland Raiders and the San Diego Chargers to theaters in New York City, Boston and Los Angeles using state of the art 3-D technology. The viewings, which were limited to NFL and consumer electronics executives, served as a test for future use of 3D in NFL television games.[23] Because of a technical glitch, the first half was not shown., 137893=The stretch of highway outside Ralph Wilson Stadium along U.S. Route 20A in Orchard Park, New York has been named the Timothy J. Russert Highway. Russert, who was NBC News's chief Washington bureau correspondent and the host of Meet the Press, was a Buffalo native and noted Buffalo Bills fan. He died of a heart attack in June 2008., 71640=This was the third season under the league's current television contracts with its American broadcast partners. CBS Sports and Fox Sports televised Sunday afternoon AFC and NFC away games, respectively.[17] For primetime games, NBC broadcast Sunday Night Football and ESPN airs Monday Night Football.[18] The NFL Network's Run to the Playoffs also broadcast seven Thursday and one Saturday late season night games,[19] although there were reportedly negotiations to move those games to ESPN Classic.[20] This was also the last NFL season to be broadcast over the air in analog television in the United States; the digital television transition occurs on February 17, 2009, just eight days after the Pro Bowl. Border stations in Canada and Mexico will continue to broadcast in analog; cable stations are unaffected and will be distributed in the format of the cable provider's choice., 26543=Despite NFL tradition to play games on Christmas if the holiday lands on a day of the week when the NFL normally plays, and the fact that Christmas landed on a Thursday in 2008, the NFL opted not to hold a Christmas game this season, instead scheduling all of its week 17 matchups for Sunday, December 28., 147752=The Detroit Lions, in celebration of their 75th season in Motown as well as by popular demand by the fans, abandoned their black third jerseys in favor of their '50s style throwback uniforms. They wore these uniforms against Jacksonville (November 9) and Tennessee (Thanksgiving Day – November 27). In addition, the Pittsburgh Steelers will make their throwbacks from the previous season their alternate uniform, wearing them against the Baltimore Ravens on September 29 and the New York Giants on October 26.[65] The Jets wore their New York Titans throwbacks at home against Arizona on September 28 and Cincinnati on October 12 this season, and the Bills donned their retro uniforms at home against Oakland Raiders September 21., 138714=The league is also honoring the memory of NFLPA leader Gene Upshaw, who died suddenly at age 63 on August 20 just three days after being diagnosed with pancreatic cancer. For the entire season, the Oakland Raiders are wearing a patch on the left chest of the jerseys with the initials \"GU\" and his number 63, his jersey number with the Raiders.[55] All NFL teams also honored Upshaw with a video tribute and a replica of the uniform patch painted onto the field during the opening weekend.[56] Originally, the patch on the field and the video tribute were only going to be done in Oakland at the Raiders' home opener against the Denver Broncos as Upshaw played his entire 15 year Hall of Fame career with the Silver and Black, and at Giants Stadium, when the Giants and Redskins opened the NFL season on September 4. All players wore the same patch during Week One, and have since changed to a smaller helmet decal. The Raiders wore the patch through the remainder of the season., 243943=Based on the NFL's scheduling formula, the intraconference and interconference matchups for 2008 were:[6], 18116=The annual NFL Kickoff Game to start the season took place on September 4 and featured the Super Bowl XLII champion New York Giants winning over their division rivals, the Washington Redskins, at Giants Stadium by a score of 16–7. The game's kickoff was ninety minutes earlier than previous years, at 7 p.m. EDT, because of a time conflict with the 2008 Republican National Convention.[1], 131893=The 2008 season saw a marked increase in the use of two new offensive philosophies (at least new to the NFL, these offenses have previously seen extensive use in college football or in Canadian Football for a few years): the \"wildcat formation,\" a formation based on the halfback option play, the \"spread offense,\" which uses multiple wide-receiver sets and the quarterback frequently in shotgun, and the \"Suggs package,\" which features two quarterbacks on the field at once. In week 3 of the season, the wildcat formation, used up until this point primarily as a trick play, was used eight times, including four times in a Miami Dolphins game and three times in a game between the Oakland Raiders and Buffalo Bills.[49] Season-ending injuries to the starting and backup quarterbacks for the Chiefs prompted the team's offensive coordinator Chan Gailey to switch to a spread offense after six games.[50] In Baltimore, the Ravens, led by rookie head coach John Harbaugh, implemented the \"Suggs package,\" which places two quarterbacks on the field at once, Joe Flacco and Troy Smith.[51] Due mainly to the new formations, 837 points were scored league wide in Week 12, the most ever for one NFL weekend.[50] The wildcat formation in particular was credited with turning the Miami Dolphins from a last-place team into the winner of the AFC East,[52] and four of the top ten plays ranked by NFL.com were directly based on the wildcat (two others featured wide receivers throwing passes).[51], 232372=The 2008 NFL season was the 89th season of the National Football League, the major professional American football league in the United States, themed with the slogan \"Believe in Now.\" Super Bowl XLIII, the league's championship game, was at Raymond James Stadium in Tampa, Florida on February 1, 2009,[2] with the Pittsburgh Steelers coming out victorious over the Arizona Cardinals 27–23 and winning their NFL-record sixth Vince Lombardi Trophy. The regular season began on September 4 with the defending Super Bowl champion New York Giants defeating the Washington Redskins 16–7, and concluded with the 2009 Pro Bowl on February 8, 2009 in Honolulu., 81853=The following teams hired new head coaches prior to the start of the 2008 season:, 22804=The league has also approved the Bills' request to play at least one regular season home game at Toronto's Rogers Centre over each of the next five seasons.[10] Team owner Ralph Wilson petitioned the league to play at least one game in Canada to strengthen his club's fan base in Ontario.[11] The game in Toronto was on December 7, after the end of the 2008 CFL season,[10] against the Miami Dolphins; Miami won 16-3. CBS televised both games regionally; the Toronto game was carried across Canada on Rogers Sportsnet and City TV., 297544=This was the third season under the league's current television contracts with its American broadcast partners. CBS Sports and Fox Sports televised Sunday afternoon AFC and NFC away games, respectively.[17] For primetime games, NBC broadcast Sunday Night Football and ESPN airs Monday Night Football.[18] The NFL Network's Run to the Playoffs also broadcast seven Thursday and one Saturday late season night games,[19] although there were reportedly negotiations to move those games to ESPN Classic.[20] This was also the last NFL season to be broadcast over the air in analog television in the United States; the digital television transition occurred in June 2009. Border stations in Canada and Mexico will continue to broadcast in analog; cable stations are unaffected and will be distributed in the format of the cable provider's choice., 318182=This is the first season that the league used a new, updated logo. Unveiled on August 31, 2007 in USA Today, the new design features eight white stars, representing each of the league's eight divisions, instead of 25 on the old logo. The football has been redesigned and rotated to the same angle as the one on the top of the Vince Lombardi Trophy given to the Super Bowl champion. Darker shades of red and blue, specifically navy blue, are also used, along with font lettering to that of the league's current typeface for other logos.[34] The new logo officially made its debut during the 2008 NFL Draft on April 26., 304621=On Internet television, both NFL.com and NBCSports.com are carrying complete live games, for the first time ever, of NBC Sunday Night Football. NFL.com will continue its live coverage of Thursday and Saturday Night Football, which began in 2007, however for the first time show the complete game rather than live look-ins from a studio., 78844=On Internet television, both NFL.com and NBCSports.com are carrying complete live games, for the first time ever, of NBC Sunday Night Football. NFL.com will continue its live coverage of Thursday and Saturday Night Football, which began in 2007, however for the first time show the complete game rather than live look-ins from a studio., 90972=The firing of Kiffin and Linehan marked the first time since the AFL-NFL merger in 1970, the start of the modern era, that multiple head coaches were fired before Week 5 of the season, and the first since 1989 that any coach was fired this early in a season. Both were also released heading into their teams' respective bye weeks, while Nolan was released prior to the game just before the 49ers' bye., 355205=Hurricane Ike forced several changes to the 2008 schedule. The Houston Texans' Week 2 home game against the Baltimore Ravens was first postponed to Monday, September 15, before Ike made landfall; damage to Reliant Stadium forced a further postponement, to Week 10, on Sunday, November 9, giving the Texans and the Ravens their bye weeks in Week 2. Furthermore, to accommodate this move, the Texans' home game against the Cincinnati Bengals was moved up from November 9 to Sunday, October 26, pushing the Bengals' bye week from Week 8 to Week 10.[48], 73839=NBC has the rights to broadcast Super Bowl XLIII, their first Super Bowl since Super Bowl XXXII at the end of the 1997 season.[18], 373559=The Detroit Lions, in celebration of their 75th season in Motown as well as by popular demand by the fans, abandoned their black third jerseys in favor of their '50s style throwback uniforms. They wore these uniforms against Jacksonville (November 9) and Tennessee (Thanksgiving Day – November 27). In addition, the Pittsburgh Steelers will make their throwbacks from the previous season their alternate uniform, wearing them against the Baltimore Ravens on September 29 and the New York Giants on October 26.[65] The Jets wore their New York Titans throwbacks at home against Arizona on September 28 and Cincinnati on October 12 this season, and the Bills donned their retro uniforms at home against Oakland Raiders September 21., 249164=This was the second consecutive season that the league played at least one regular season game outside the United States as part of its International Series. The contest between the San Diego Chargers and the New Orleans Saints was played at Wembley Stadium in London on October 26, with New Orleans winning 37–32.[8][9] The Chargers played at Buffalo the week beforehand on October 19 so they could immediately travel to London afterward in order to get used to the time difference.[8], 81124=The New York Giants 2007 season/Super Bowl video was only released on DVD the previous year despite the fact that Toshiba dropped support of HD DVD (the primary rival of Blu-ray) just two weeks after Super Bowl XLII., 363721=The stretch of highway outside Ralph Wilson Stadium along U.S. Route 20A in Orchard Park, New York has been named the Timothy J. Russert Highway. Russert, who was NBC News's chief Washington bureau correspondent and the host of Meet the Press, was a Buffalo native and noted Buffalo Bills fan. He died of a heart attack in June 2008., 371431=The 2008 season will mark just the third time in the salary cap era (and first since 2001) that no NFL team made major changes to their uniforms or logo. Since 1993, half of the league's teams (Arizona, Atlanta, Buffalo, Cincinnati, Denver, Minnesota, New England, New York Giants, New York Jets, Philadelphia, San Diego, San Francisco, Seattle, St. Louis, Tampa Bay, and Tennessee) have completely redesigned their uniforms (The Patriots doing it four times, though none since 2000) while another five (Detroit, Green Bay, Miami, New Orleans, and Pittsburgh) making minor, though noticeable, changes. The Titans are swapping home and alternate designations on their light blue and navy blue jerseys though., 77144=On December 4, the NFL Network broadcast its game between the Oakland Raiders and the San Diego Chargers to theatres in New York City, Boston and Los Angeles using state of the art 3-D technology. The viewings, which were limited to NFL and consumer electronics executives, served as a test for future use of 3D in NFL television games.[23] Because of a technical glitch, the first half was not shown., 248878=The 2008 season also was the third season of the use of the \"flexible scheduling\" for Sunday games starting with Week 11., 49220=The playoffs began with Wild Card Weekend on January 3–4, 2009. The Divisional Playoffs were played on January 10–11 and the Conference Championship Games on January 18. Super Bowl XLIII was played on February 1 at Raymond James Stadium in Tampa, Florida with the Pittsburgh Steelers winning their record sixth Super Bowl., 136199=On January 18, 2008, Georgia Frontiere, owner of the St. Louis Rams died due to complications with breast cancer.[53] The Rams announced that during the 2008 season they will wear a commemorative patch in her honor, with her signature on their left shoulder., 251699=The traditional Thanksgiving Day games [12] were held on November 27, with the Detroit Lions hosting the Tennessee Titans at 12:30 PM EST on CBS (with the then 10–1 Titans handily defeating the then 0–11 Lions by a 47–10 score), and the Dallas Cowboys' home game following suit on Fox at 4:15 PM EST against the Seattle Seahawks (Dallas Cowboys defeated the Seattle Seahawks by a score of 34–9). A third game on NFL Network, featuring the Arizona Cardinals and the Philadelphia Eagles followed at 8:15 PM EST.[1][6] It was the first home game for the Eagles on Thanksgiving Day since 1940, and their first Thanksgiving game at any location since the infamous Bounty Bowl Game in 1989; the Eagles defeated the Cardinals by a score of 48–20. (The Cardinals and Eagles would, two months later, rematch in the NFC Championship Game, with Arizona winning this time by a score of 32–25.), 130296=The Texans ended up having to wait until Week 5 against the Indianapolis Colts to have their home opener, the latest an NFL team went into the season before playing at home since the New Orleans Saints played their entire schedule on the road in 2005 due to the damages of the city of New Orleans as a result of Hurricane Katrina. (Every other NFL team had at least one home game by the end of Week 2.) With the Ravens eventually advancing to the AFC Championship Game against the rival Pittsburgh Steelers (and having to enter the playoffs as a wild card team), the impromptu decision to give the Ravens and Texans their bye week so early in the season ended up having the unintended effect of the Ravens playing in an NFL-record 18 consecutive weeks without a break in the schedule., 68752=The following rule changes were passed at the league's annual owners meeting in Palm Beach, Florida during the week of March 31:[15], 75101=Meanwhile, NBC's Football Night in America reunited Dan Patrick with Keith Olbermann on television for the first time since 1997 when they co-hosted SportsCenter., 136883=On January 31, 2008, Clark Hunt, chairman of the board for the Kansas City Chiefs announced that henceforth the team's Lamar Hunt/American Football League tribute patch that was introduced in the 2007 season will be a permanent part of the Chiefs' uniform.[54] joining the Chicago Bears (with George Halas) and the Cleveland Browns (with Al Lerner) with such a patch., 357693=The 2008 season saw a marked increase in the use of two new offensive philosophies (at least new to the NFL, these offenses have previously seen extensive use in college football or in Canadian Football for a few years): the \"wildcat formation,\" a formation based on the halfback option play, the \"spread offense,\" which uses multiple wide-receiver sets and the quarterback frequently in shotgun, and the \"Suggs package,\" which features two quarterbacks on the field at once. In week 3 of the season, the wildcat formation, used up until this point primarily as a trick play, was used eight times, including four times in a Miami Dolphins game and three times in a game between the Oakland Raiders and Buffalo Bills.[49] Season-ending injuries to the starting and backup quarterbacks for the Chiefs prompted the team's offensive coordinator Chan Gailey to switch to a spread offense after six games.[50] In Baltimore, the Ravens, led by rookie head coach John Harbaugh, implemented the \"Suggs package,\" which places two quarterbacks on the field at once, Joe Flacco and Troy Smith.[51] Due mainly to the new formations, 837 points were scored league wide in Week 12, the most ever for one NFL weekend.[50] The wildcat formation in particular was credited with turning the Miami Dolphins from a last-place team into the winner of the AFC East,[52] and four of the top ten plays ranked by NFL.com were directly based on the wildcat (two others featured wide receivers throwing passes).[51], 16470=Based on the NFL's scheduling formula, the intraconference and interconference matchups for 2008 were:[6], 141015=On July 7, 2008, owners of the Pittsburgh Steelers, including Art Rooney's five sons who own 80% of the franchise,[57] looked to restructure the ownership plan of the franchise in order to comply with NFL ownership regulations.[58] Current Steelers Chairman, Dan Rooney, and his son, Art Rooney II, President of the franchise, wished to stay involved with the franchise, while the remainder of the brothers — Art Jr., Timothy, Patrick and John — wished to further pursue racetracks that they own in Florida and New York.[59] Since 2006, many of the racetracks have added video slot machines, causing them to violate \"NFL policy that prohibits involvement with racetrack and gambling interests\".[60] On July 11, it was confirmed that investor Stanley Druckenmiller had been in discussion with the five Rooney brothers.[57] A Steelers fan for many years, Druckenmiller \"has been known to paint his face black and gold\" during games.[61] Coach Mike Tomlin stated that the situation could become a distraction, but \"I'm here to coach, they're [the players] here to play. Those questions will be answered by the Rooneys.\"[62] On September 18, Druckenmiller withdrew his bid to purchase the team.[63], 307688=The following teams hired new head coaches prior to the start of the 2008 season:, 254122=Despite NFL tradition to play games on Christmas if the holiday lands on a day of the week when the NFL normally plays, and the fact that Christmas landed on a Thursday in 2008, the NFL opted not to hold a Christmas game this season, instead scheduling all of its week 17 matchups for Sunday, December 28., 79428=The Pittsburgh Steelers 2008 season/Super Bowl XLIII championship home video went on sale on DVD on February 24, 2009. One week later on March 3, it was released on Blu-ray Disc, making it the first NFL Films home video release to be on Blu-ray Disc.[24] The Blu-ray copy is \"officially\" sold exclusively through Amazon.com, though it is also available through the Sports Illustrated Super Bowl offer as well as eBay. Among its exclusive content included having most of the features in high-definition video as well as the NFL on Fox fourth-quarter coverage of the Steelers matchup against the Dallas Cowboys at Heinz Field in its entirety. The matchup, which took place during Week 14 and renewed the rivalry the two teams had in the 1970s & 1990's, saw the Steelers come back from a 4th quarter ten point deficit to win 20-13., 92470=This is the first season that the league used a new, updated logo. Unveiled on August 31, 2007 in USA Today, the new design features eight white stars, representing each of the league's eight divisions, instead of 25 on the old logo. The football has been redesigned and rotated to the same angle as the one on the top of the Vince Lombardi Trophy given to the Super Bowl champion. Darker shades of red and blue, specifically navy blue, are also used, along with font lettering to that of the league's current typeface for other logos.[34] The new logo officially made its debut during the 2008 NFL Draft on April 26., 319226=In addition to the Bills playing one home game in Toronto's Rogers Centre, this was the first season that the Indianapolis Colts played their home games at Lucas Oil Stadium.[35] Meanwhile, 2008 was the final year that the Dallas Cowboys played at Texas Stadium; they moved to Cowboys Stadium in Arlington, Texas in 2009.[36], 91976=On September 23, the Detroit Lions fired President/General Manager Matt Millen after seven seasons. During that time, the Lions compiled the worst record in the league (31-84, .270 percentage) and had many questionable draft choices., 313524=The following head coaches were fired during the 2008 season:, 360747=On November 16, during Week 11, a game between the Philadelphia Eagles and the Cincinnati Bengals at Paul Brown Stadium ended in a 13-13 tie, the first NFL tie game since November 10, 2002, when the Atlanta Falcons and the Pittsburgh Steelers ended in a 34–34 draw. After the game, Donovan McNabb mentioned that he did not know there were ties in the NFL. This drew the ire of many fans, who thought that a quarterback of his caliber should know some fundamental rules., 250340=The league has also approved the Bills' request to play at least one regular season home game at Toronto's Rogers Centre over each of the next five seasons.[10] Team owner Ralph Wilson petitioned the league to play at least one game in Canada to strengthen his club's fan base in Ontario.[11] The game in Toronto was on December 7, after the end of the 2008 CFL season,[10] against the Miami Dolphins; Miami won 16-3. CBS televised both games regionally; the Toronto game was carried across Canada on Rogers Sportsnet and City TV., 351853=The 2008 season marked the first time since September 20, 1992 that someone other than Brett Favre started at quarterback for the Green Bay Packers, as Aaron Rodgers became the new offensive \"Leader of The Pack.\" At first, this was given Favre's announcement on March 4, 2008 that he would retire from the league after seventeen seasons. He owns many NFL records, including most wins as a quarterback, most touchdowns thrown, and most consecutive starts at quarterback, as well as most interceptions. He started every Packers game, regular season and postseason, for nearly sixteen full seasons (September 27, 1992–January 20, 2008). The Packers were scheduled to retire Favre's #4 jersey in a ceremony during the first week of the season. However, on July 2, 2008, he publicly indicated that he wanted to play again as the starting quarterback. On July 11, 2008, Favre sent a letter to the Packers management asking for a unconditional release which will allow him to play for another team. The Packers did not give it to him, but they were unwilling to release him for fear that he would sign with division rival Minnesota Vikings (Favre's choice for an alternate team) also the Packers would not start him as quarterback if he came back to the team and named the other Packers quarterback Aaron Rodgers the starting quarterback and Favre as the backup. From July 14 to July 15, Favre did t.v. interviews discussing his comeback, Packers quarterback Aaron Rodgers taking his place and frustrations on the Packers for not being honest with him, personally and publicly. On July 16, 2008, the Packers filed tampering charges against the Vikings for alleged improper communication between Favre, Vikings head coach Brad Childress and Vikings offensive coordinator Darrell Bevell. Farve filed for reinstatement on July 29, 2008 and by August 4, NFL Commissioner Roger Goodell reinstated Favre. Three days later on August 7, the Packers traded Favre to the New York Jets for a conditional draft pick. He played well for most of the year, but entering December he suffered a shoulder injury which dropped the Jets out of playoff contention. Favre again retired following the 2008 season. The Jets then released Favre in favor of moving in the direction of getting a star college quarterback in the draft, eventually landing Mark Sanchez. Another protracted \"will he/won't he retire\" saga emerged in 2009 which concluded in August of that year when Favre signed with, as expected, the Minnesota Vikings., 299690=NBC broadcast Super Bowl XLIII, their first Super Bowl since Super Bowl XXXII at the end of the 1997 season.[18], 369375=NFL owners unanimously approved the restructuring of ownership on December 17, 2008, with Dan & Art II getting the mandated 30% stake. Meanwhile, brothers Timothy and Patrick (the ones who own race tracks with slot machines, which violate NFL ownership rules) are selling their shares outright, while Art Jr., John, and the McGinley family selling some shares but retaining smaller ownership roles, with the brothers reducing their shares from 16% to 6% and the McGinley family reducing their shares from 20% to 10%. Also coming on as partners are Pilot Corporation & Pilot Travel Centers president Jim Haslam III (son of founder Jim Haslam Jr. and brother of Knoxville, Tennessee mayor Bill Haslam), Legendary Pictures president & CEO Thomas Tull, and the Paul family of Pittsburgh & Los Angeles (who are primarily involved with Pittsburgh-based Ampco Pittsburgh Corporation and serve on numerous boards, including UPMC and Pitt), each getting a 16% stake in the team.[64] Dan Rooney mentioned he has no ill will towards Druckenmiller, mentioning he's a great Steelers fan and wishes he remains one., 245594=The annual NFL Kickoff Game to start the season took place on September 4 and featured the Super Bowl XLII champion New York Giants winning over their division rivals, the Washington Redskins, at Giants Stadium by a score of 16–7. The game's kickoff was ninety minutes earlier than previous years, at 7 p.m. EDT, because of a time conflict with the 2008 Republican National Convention.[1], 361957=On January 18, 2008, Georgia Frontiere, owner of the St. Louis Rams died due to complications with breast cancer.[53] The Rams announced that during the 2008 season they will wear a commemorative patch in her honor, with her signature on their left shoulder., 21370=The 2008 season also was the third season of the use of the \"flexible scheduling\" for Sunday games starting with Week 11., 294688=The following rule changes were passed at the league's annual owners meeting in Palm Beach, Florida during the week of March 31:[15], 4181=The 2008 NFL season was the 89th season of the National Football League, the major professional American football league in the United States, themed with the slogan \"Believe in Now.\" Super Bowl XLIII, the league's championship game, was at Raymond James Stadium in Tampa, Florida on February 1, 2009,[2] with the Pittsburgh Steelers coming out victorious over the Arizona Cardinals 27–23 and winning their NFL-record sixth Vince Lombardi Trophy. The regular season began on September 4 with the defending Super Bowl champion New York Giants defeating the Washington Redskins 16–7, and concluded with the 2009 Pro Bowl on February 8, 2009 in Honolulu., 126991=The 2008 season marked the first time since September 20, 1992 that someone other than Brett Favre started at quarterback for the Green Bay Packers, as Aaron Rodgers became the new offensive \"Leader of The Pack.\" At first, this was given Favre's announcement on March 4 that he would retire from the league after seventeen seasons. He owns many NFL records, including most wins as a quarterback, most touchdowns thrown, and most consecutive starts at quarterback, as well as most interceptions. He started every Packers game, regular season and postseason, for nearly sixteen full seasons (September 27, 1992–January 20, 2008). The Packers were scheduled to retire Favre's #4 jersey in a ceremony during the first week of the season. However, in July he publicly indicated that he wanted to play again as the starting quarterback. The Packers did not give it to him, but they were unwilling to release him for fear that he would sign with division rival Minnesota (Favre's choice for an alternate team). He was reinstated on August 3 by NFL Commissioner Roger Goodell and three days later the Packers traded Favre to the New York Jets for a conditional draft pick. He played well for most of the year, but entering December he suffered a shoulder injury which dropped the Jets out of playoff contention. Favre again retired following the 2008 season. The Jets then released Favre in favor of moving in the direction of getting a star college quarterback in the draft, eventually landing Mark Sanchez. Another protracted \"will he/won't he retire\" saga emerged in 2009 which concluded in August of that year when Favre signed with, as expected, the Minnesota Vikings., 143546=NFL owners unanimously approved the restructuring of ownership on December 17, 2008, with Dan & Art II getting the mandated 30% stake. Meanwhile, brothers Timothy and Patrick (the ones who own race tracks with slot machines, which violate NFL ownership rules) are selling their shares outright, while Art Jr., John, and the McGinley family selling some shares but retaining smaller ownership roles, with the brothers reducing their shares from 16% to 6% and the McGinley family reducing their shares from 20% to 10%. Also coming on as partners are Pilot Corporation & Pilot Travel Centers president Jim Haslam III (son of founder Jim Haslam Jr. and brother of Knoxville, Tennessee mayor Bill Haslam), Legendary Pictures president & CEO Thomas Tull, and the Paul family of Pittsburgh & Los Angeles (who are primarily involved with Pittsburgh-based Ampco Pittsburgh Corporation and serve on numerous boards, including UPMC and Pitt), each getting a 16% stake in the team.[64] Dan Rooney mentioned he has no ill will towards Druckenmiller, mentioning he's a great Steelers fan and wishes he remains one., 317726=On September 23, the Detroit Lions fired President/General Manager Matt Millen after seven seasons. During that time, the Lions compiled the worst record in the league (31-84, .270 percentage) and had many questionable draft choices., 316738=The firing of Kiffin and Linehan marked the first time since the AFL-NFL merger in 1970, the start of the modern era, that multiple head coaches were fired before Week 5 of the season, and the first since 1989 that any coach was fired this early in a season. Both were also released heading into their teams' respective bye weeks, while Nolan was released prior to the game just before the 49ers' bye., 93549=In addition to the Bills playing one home game in Toronto's Rogers Centre, this was the first season that the Indianapolis Colts played their home games at Lucas Oil Stadium.[35] Meanwhile, 2008 was the final year that the Dallas Cowboys played at Texas Stadium; they moved to Cowboys Stadium in Arlington, Texas in 2009.[36], 356106=The Texans ended up having to wait until Week 5 against the Indianapolis Colts to have their home opener, the latest an NFL team went into the season before playing at home since the New Orleans Saints played their entire schedule on the road in 2005 due to the damages of the city of New Orleans as a result of Hurricane Katrina. (Every other NFL team had at least one home game by the end of Week 2.) With the Ravens eventually advancing to the AFC Championship Game against the rival Pittsburgh Steelers (and having to enter the playoffs as a wild card team), the impromptu decision to give the Ravens and Texans their bye week so early in the season ended up having the unintended effect of the Ravens playing in an NFL-record 18 consecutive weeks without a break in the schedule., 362687=On January 31, 2008, Clark Hunt, chairman of the board for the Kansas City Chiefs announced that henceforth the team's Lamar Hunt/American Football League tribute patch that was introduced in the 2007 season will be a permanent part of the Chiefs' uniform.[54] joining the Chicago Bears (with George Halas) and the Cleveland Browns (with Al Lerner) with such a patch., 366853=On July 7, 2008, owners of the Pittsburgh Steelers, including Art Rooney's five sons who own 80% of the franchise,[57] looked to restructure the ownership plan of the franchise in order to comply with NFL ownership regulations.[58] Current Steelers Chairman, Dan Rooney, and his son, Art Rooney II, President of the franchise, wished to stay involved with the franchise, while the remainder of the brothers — Art Jr., Timothy, Patrick and John — wished to further pursue racetracks that they own in Florida and New York.[59] Since 2006, many of the racetracks have added video slot machines, causing them to violate \"NFL policy that prohibits involvement with racetrack and gambling interests\".[60] On July 11, it was confirmed that investor Stanley Druckenmiller had been in discussion with the five Rooney brothers.[57] A Steelers fan for many years, Druckenmiller \"has been known to paint his face black and gold\" during games.[61] Coach Mike Tomlin stated that the situation could become a distraction, but \"I'm here to coach, they're [the players] here to play. Those questions will be answered by the Rooneys.\"[62] On September 18, Druckenmiller withdrew his bid to purchase the team.[63], 364545=The league is also honoring the memory of NFLPA leader Gene Upshaw, who died suddenly at age 63 on August 20 just three days after being diagnosed with pancreatic cancer. For the entire season, the Oakland Raiders are wearing a patch on the left chest of the jerseys with the initials \"GU\" and his number 63, his jersey number with the Raiders.[55] All NFL teams also honored Upshaw with a video tribute and a replica of the uniform patch painted onto the field during the opening weekend.[56] Originally, the patch on the field and the video tribute were only going to be done in Oakland at the Raiders' home opener against the Denver Broncos as Upshaw played his entire 15 year Hall of Fame career with the Silver and Black, and at Giants Stadium, when the Giants and Redskins opened the NFL season on September 4. All players wore the same patch during Week One, and have since changed to a smaller helmet decal. The Raiders wore the patch through the remainder of the season., 87725=The following head coaches were fired during the 2008 season:, 306974=The New York Giants 2007 season/Super Bowl video was only released on DVD the previous year despite the fact that Toshiba dropped support of HD DVD (the primary rival of Blu-ray) just two weeks after Super Bowl XLII.}",
    "textBeforeTable": "Based on the NFL's scheduling formula, the intraconference and interconference matchups for 2008 were:[6] Formula Regular season In preseason games, the annual Pro Football Hall of Fame Game was played August 3 between the Indianapolis Colts and Washington Redskins, which aired on NBC.[3] Washington won the game, 30–16.[4] Other preseason highlights included the first game of the Toronto Series, which was played August 14 between the Buffalo Bills and the Pittsburgh Steelers at Toronto's Rogers Centre. The Bills won that game, 24–21.[5] Preseason GA_googleFillSlot(\"TFW_square\"); Advertisements //]]> if (window.showTocToggle) { var tocShowText = \"show\"; var tocHideText = \"hide\"; showTocToggle(); } // <script type=\"text/javascript\"> </table> </tbody> </tr> </ul> </td> <li class=\"toclevel-1 tocsection-46\"><a href=\"#References\"><span class=\"tocnumber\">11</span> <span class=\"toctext\">References</span></a></li> <li class=\"toclevel-1 tocsection-45\"><a href=\"#See_also\"><span class=\"tocnumber\">10</span> <span class=\"toctext\">See also</span></a></li> </ul> </li> <li class=\"toclevel-2 tocsection-44\"><a href=\"#Apparel\"><span class=\"tocnumber\">9.10</span> <span class=\"toctext\">Apparel</span></a></li> <li class=\"toclevel-2 tocsection-43\"><a href=\"#Steelers_ownership_restructure\"><span class=\"tocnumber\">9.9</span> <span class=\"toctext\">Steelers ownership restructure</span></a></li> </ul> </li> <li class=\"toclevel-3 tocsection-42\"><a href=\"#Sean_Taylor\"><span class=\"tocnumber\">9.8.5</span> <span class=\"toctext\">Sean Taylor</span></a></li> <li class=\"toclevel-3 tocsection-41\"><a href=\"#Gene_Upshaw\"><span class=\"tocnumber\">9.8.4</span> <span class=\"toctext\">Gene Upshaw</span></a></li> <li class=\"toclevel-3 tocsection-40\"><a href=\"#Tim_Russert\"><span class=\"tocnumber\">9.8.3</span> <span class=\"toctext\">Tim Russert</span></a></li> <li class=\"toclevel-3 tocsection-39\"><a href=\"#Kansas_City_Chiefs_and_Lamar_Hunt\"><span",
    "textAfterTable": "Opening Weekend The annual NFL Kickoff Game to start the season took place on September 4 and featured the Super Bowl XLII champion New York Giants winning over their division rivals, the Washington Redskins, at Giants Stadium by a score of 16–7. The game's kickoff was ninety minutes earlier than previous years, at 7 p.m. EDT, because of a time conflict with the 2008 Republican National Convention.[1] Other featured games during the opening week included the NBC Sunday Night Football game between the Chicago Bears and the Indianapolis Colts (the first regular season game at Lucas Oil Stadium, and a rematch of Super Bowl XLI), in which the Kyle Orton-led Bears upset the Colts 29–13. In addition, there were two Monday Night Football contests, both division rivalries, as part of the now annual doubleheader: The Minnesota Vikings at the Green Bay Packers (the Packers' first Monday night game without Brett Favre since 1992) in",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}