{
    "relation": [
        [
            "Test Name",
            "Boltzmann",
            "Franklin",
            "Lassen",
            "Wilson",
            "Priscilla",
            "Coulomb-A",
            "Hood",
            "Diablo",
            "John",
            "Kepler",
            "Owens",
            "Pascal-A",
            "Stokes",
            "Saturn",
            "Shasta",
            "Doppler",
            "Pascal-B",
            "Franklin Prime",
            "Smoky",
            "Galileo",
            "Wheeler",
            "Coulomb-B",
            "Laplace",
            "Fizeau",
            "Newton",
            "Rainier",
            "Whitney",
            "Charleston",
            "Morgan"
        ],
        [
            "Time and Date (GMT)",
            "11:55 28-May-57",
            "11:55 2-Jun-57",
            "11:45 5-Jun-57",
            "11:45 18-Jun-57",
            "13:30 24-Jun-57",
            "17:30 1-Jul-57",
            "11:40.00.4 5-Jul-57",
            "11:30.00.1 15-Jul-57",
            "14:00 19-Jul-57",
            "11:50 24-Jul-57",
            "13:30 25-Jul-57",
            "8:00 26-Jul-57",
            "12:25 7-Aug-57",
            "1:00 10-Aug-57",
            "12:00 18-Aug-57",
            "12:30 23-Aug-57",
            "22:35 27-Aug-57",
            "12:40 30-Aug-57",
            "12:30.00.1 31-Aug-57",
            "12:40 2-Sep-57",
            "12:45 6-Sep-57",
            "20:50 6-Sep-57",
            "13:00 8-Sep-57",
            "16:45 14-Sep-57",
            "12:50 16-Sep-57",
            "16:59.59.5 19-Sep-57",
            "12:30 23-Sep-57",
            "13:00 28-Sep-57",
            "13:00 7-Oct-57"
        ],
        [
            "Location",
            "NTS, Area 7c",
            "NTS, Area 3",
            "NTS, Area 9a",
            "NTS, Area 9a",
            "NTS, Area 5",
            "NTS, Area 3h",
            "NTS, Area 9a",
            "NTS, Area 2b",
            "NTS, Area 10",
            "NTS, Area 4",
            "NTS, Area 9b",
            "NTS, Area 3j",
            "NTS, Area 7b",
            "NTS, Area 12c",
            "NTS, Area 2a",
            "NTS, Area 7",
            "NTS, Area 3c",
            "NTS, Area 7b",
            "NTS, Area 8",
            "NTS, Area 1",
            "NTS, Area 9a",
            "NTS, Area 3g",
            "NTS, Area 7b",
            "NTS, Area 3b",
            "NTS, Area 7b",
            "NTS, Area 12",
            "NTS, Area 2",
            "NTS, Area 9",
            "NTS, Area 9"
        ],
        [
            "Test Type",
            "Tower",
            "Tower",
            "Balloon",
            "Balloon",
            "Balloon",
            "Surface",
            "Balloon",
            "Tower",
            "Rocket",
            "Tower",
            "Balloon",
            "Shaft",
            "Balloon",
            "Tunnel",
            "Tower",
            "Balloon",
            "Shaft",
            "Balloon",
            "Tower",
            "Tower",
            "Balloon",
            "Surface",
            "Balloon",
            "Tower",
            "Balloon",
            "Tunnel",
            "Tower",
            "Balloon",
            "Balloon"
        ],
        [
            "Height (Ft)",
            "500",
            "300",
            "500",
            "500",
            "700",
            "0",
            "1500",
            "500",
            "18,500",
            "500",
            "500",
            "-485",
            "1500",
            "-100",
            "500",
            "1500",
            "-500",
            "750",
            "700",
            "500",
            "500",
            "0",
            "750",
            "500",
            "1500",
            "-899",
            "500",
            "1500",
            "500"
        ],
        [
            "Yield - Actual (Predicted)",
            "12 kt (11 kt)",
            "140 Tons (2 kt)",
            "0.5 Tons (600 Tons)",
            "10 kt (8 kt, 2-12 kt)",
            "37 kt (40 kt)",
            "Zero (1-2 Lb)",
            "74 kt (60-80 kt)",
            "17 kt (11-15 kt)",
            "1.7 kt (1.7 kt)",
            "10 kt (11 kt)",
            "9.7 kt (2-10 kt)",
            "Listed as \"slight\", about 55 tons (predicted 1-2 Lb)",
            "19 kt (10-20 kt)",
            "Zero (100 Lb)",
            "17 kt (11-15 kt)",
            "11 kt (-)",
            "0.3 kt (1-2 Lb)",
            "4.7 kt (2 kt)",
            "44 kt (45-50 kt)",
            "11 kt (-)",
            "197 Tons (200 Tons)",
            "0.3 kt (1-2 Lb, 20 Tons max)",
            "1 kt (1.5-2 kt)",
            "11 kt (8-10 kt)",
            "12 kt (50-70 kt)",
            "1.7 kt (-)",
            "19 kt (15 kt)",
            "12 kt (less than 50-100 kt)",
            "8 kt (2-10 kt)"
        ],
        [
            "Sponsor",
            "LASL",
            "LASL",
            "UCRL",
            "UCRL",
            "LASL/DOD",
            "LASL",
            "UCRL",
            "UCRL",
            "DOD",
            "LASL",
            "UCRL",
            "LASL",
            "LASL",
            "UCRL",
            "UCRL",
            "LASL",
            "LASL",
            "LASL",
            "UCRL",
            "LASL",
            "UCRL",
            "LASL",
            "LASL",
            "LASL",
            "LASL",
            "UCRL",
            "UCRL",
            "UCRL",
            "UCRL"
        ],
        [
            "Purpose",
            "WD",
            "WD",
            "WD",
            "WD",
            "WE",
            "ST",
            "WD",
            "WD",
            "WE",
            "WD",
            "WD",
            "ST",
            "WD",
            "ST",
            "WD",
            "WD",
            "ST",
            "WD",
            "WD",
            "WD",
            "WD",
            "ST",
            "WD",
            "WD",
            "WD",
            "WE",
            "WD",
            "WD",
            "WD"
        ],
        [
            "Comments",
            "XW-40 boosted fission warhead test",
            "Fizzle, XW-30? boosted all-oralloy fission warhead test",
            "Fizzle, unboosted all-oralloy small weapon design",
            "XW-45X1 Swan test, gas-boosted composite pit",
            "Mk-15/39 primary, stockpiled device of known yield",
            "XW-31 1-point safety test",
            "Largest atmospheric test at NTS, 2-stage thermonuclear device",
            "2-stage device, some thermonuclear yield",
            "W-25 warhead for Genie air-to-air missile",
            "XW-35 ICBM warhead development, primary in thermonuclear mockup",
            "Very small boosted plutonium device, XW-51 progenitor",
            "1-point safety test",
            "XW-30 test, all oralloy gas-boosted system",
            "1-point safety test of XW-45X1, oralloy-Pu composite core filled with helium; first shot fired in Ranier Mesa tunnel",
            "Nearly identical to Diablo, DT gas boosted Swan primary",
            "Gas boosted implosion device, possible XW-34 test",
            "1-point test for upper limits of safety, similar to Pascal-A",
            "Retest of Franklin with more U-235 added to core",
            "TX-41 2-stage device, some thermonuclear yield",
            "Boosted fission device, exploratory test",
            "Retest of redesigned Lassen device, possible XW-51 air-to-air warhead progenitor",
            "1-point test for upper limits of safety, similar to Coulomb-A, all-oralloy gas boosted",
            "Fleegle device: all-oralloy gun-type weapon",
            "XW-34 test, boosted fission device",
            "Test of XW-31 variant, boosted primary in thermonuclear system mockup",
            "Deep underground test shot, modified W-25 warhead",
            "Test of boosted Swan primary in W-27 thermonuclear system mockup",
            "Clean tactical 2-stage thermonuclear device, 2nd stage failed to fire",
            "XW-45X1 test, boosted Swan primary and Flamingo secondary"
        ]
    ],
    "pageTitle": "Operation Plumbbob",
    "title": "",
    "url": "http://nuclearweaponarchive.org/Usa/Tests/Plumbob.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00153-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 190346863,
    "recordOffset": 190325166,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{8192=Hood was the largest atmospheric test ever conducted at NTS (and in continental U.S.). This was a test of a two-stage thermonuclear device designed by UCRL (University of California Radiation Laboratory), even though the U.S. government stated at the time that no thermonuclear tests were being conducted in Nevada. The design was intended to fill a gap in 300-400 lb. thermonuclear warhead technology, and was tested at reduced yield. The predicted yield was 60-80 kt. The device used a boosted Swan primary (which gave yields of 12-19 kt in other tests during Plumbbob). About 7 kt of the overall yield was from fusion. The device was a small diameter system (12.1 inches) and was 42.2 inches long. Total device weight was 393 lb. The test also included troop maneuvers by 2500 Marines, and air operations by 124 aircraft., 31927=Smoky became notorious in the 1970s due to the radiation exposures received by over three thousand servicemen who were brought in as part of the Desert Rock exercises to conduct maneuvers in the vicinity of ground zero shortly after the test. This led to Congressional inquiries and epidemiological evaluation of the affected veterans. A 1980 study of the 3224 participants found a significantly elevated number of leukemia cases. Ten cases of leukemia were found, compared to the expected base number for a similar unexposed population of four (see Health Effects of Exposure to Low Levels of Ionizing Radiation: BEIR V, 1990, p. 375)., 38212=UCRL test of a small \"clean\" tactical 2-stage thermonuclear device. Device fizzled when second stage failed to fire. Predicted yield was below 50-100 kt. Swan primary used. Device dimensions: diameter 22.4 inches, length 46.6 inches. Total device weight 1225 lb., 14495=As it happened the test yield was about 50,000 times greater than expected and created a sizable explosion, catching everyone off guard. Official listings of the yield for this shot still describe it only as \"slight\", even though every other test in Plumbbob has a specific yield published. It is possible to calculate the yield though from normalization data given in UCRL-53152 Part 6 Results of Calculations of External Gamma Radiation Exposure Rates from Fallout and the Related Radionuclide Compositions; Operation Plumbbob, 1957 (by Harry G. Hicks, July 1981). This report provides comparative test product information, and if Pascal-A is compared with other low yield (and thus pure fission) tests, a consistent value of 55 tons is obtained., 1629=Plumbbob released some 58,300 kilocuries of radioiodine (I-131) into the atmosphere. This was more than twice as much as any other continental test series. This produced total civilian radiation exposures amounting to 120 million person-rads of thyroid tissue exposure (about 32% of all exposure due to continental nuclear tests). This can be expected to eventually cause about 38,000 cases of thyroid cancer, leading to some 1900 deaths. Chart of fallout exposures from Plumbbob (59 K, 539x577). From National Cancer Institute Study Estimating Thyroid Doses of I-131 Received by Americans From Nevada Atmospheric Nuclear Bomb Test, 1997. To go to the National Cancer Institute and get the full report, click here., 12341=LASL ICBM warhead development test. Probable test of XW-35 primary in thermonuclear mockup. Similar to Hardtack I Koa device (which was tested at 1.37 Mt in 1958). Kepler had a predicted yield of 11 kt. The device had a diameter of 28.5 inches, and a length of 44 inches. The primary weighed 64.4 lb, the total device weight was 1517 lb., 35563=LASL test of XW-31 variant, boosted primary in thermonuclear system mockup. Design yield 50-70 kt. Device dimensions: diameter 28 inches, length 39 inches. Total device weight 1346 lb., 9727=This was a UCRL developmental test of a two stage thermonuclear design. A boosted Swan primary was fired in a mockup of the thermonuclear system. The predicted yield was 11-15 kt, the secondary stage contributed to the total yield. This device was very similar to the Shasta test device. A full yield test of this device was intended for Hardtack I in 1958, and it may be related to the similarly dimensioned Hardtack I Cedar device which produced 220 kt. The diameter of this device was 16.2 inches, length 68.4 inches, and its total weight was 1352 lb., 20295=This was a UCRL developmental test of a two stage thermonuclear design. A DT gas boosted Swan primary was fired in a mockup of the thermonuclear system. Shasta was nearly identical to Diablo, except for changes in case materials and pit geometry. Predicted yield was 11-15 kt. Device dimensions were 16.9 inches in diameter and 69.2 inches long. Total device weight was 1435 lb., 22932=The February/March 1992 issue of Air & Space magazine, published by the Smithsonian, contained an article about nuclear rocket propulsion:, 24654=Although the shaft test goes unnamed in the article, only two shaft shots were fired before Sputnik was launched on 4 October 1957 - Pascal-A and Pascal-B. The nighttime Pascal-A shot could not have been the shot involved, since notably absent from the accounts of Pascal-A are the dazzlingly brilliant fireball streaking into the heavens that such an object would produce. Also Pascal-B was the only one of the two that was fired in summer as the article describes. This conclusion was confirmed to this author by Dr. Robert Brownlee, who has written expressly for this website his own account of this event.}",
    "lastModified": "Sun, 12 Jun 2005 05:28:20 GMT",
    "textBeforeTable": "Last changed 12 July 2003 1957 - Nevada Test Site Operation Plumbbob",
    "textAfterTable": "Stokes (54 K) Stokes (49 K) 607x421, 34 K 800x625, 120 K Test: Shasta Time: 12:00 18 August 1957 (GMT) Location: NTS, Area 2a Test Height and Type: 500 Foot Tower Yield: 17 kt This was a UCRL developmental test of a two stage thermonuclear design. A DT gas boosted Swan primary was fired in a mockup of the thermonuclear system. Shasta was nearly identical to Diablo, except for changes in case materials and pit geometry. Predicted yield was 11-15 kt. Device dimensions were 16.9 inches in diameter and 69.2 inches long. Total device weight was 1435 lb. Shasta (100 K) Test: Doppler Time: 12:30 23 August 1957 (GMT) Location: NTS, Area 7 Test Height and Type: 1500 Foot Balloon Yield: 11 kt LASL gas boosted implosion device, possible XW-34 test. Satisfactory performance. Device dimensions: diameter 17 inches, length 26 inches. Nuclear system weight 144.6 lb, total device weight 275 lb.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}