{
    "relation": [
        [
            "ID",
            "6489168",
            "6511489",
            "6495372",
            "6412668",
            "6067211",
            "5060001",
            "5050378",
            "6267772",
            "5039674",
            "5010038",
            "6190702",
            "4970418",
            "4993601",
            "5008199",
            "None"
        ],
        [
            "Summary",
            "Instructions in the README.txt file in the /se directory need to be revised for clarity. The README.txt currently reads as follows: Installing on Solaris as root user 1) Copy SUNWaspx from the RootInstall directory on the CD to directory on your machine. 2) Change the directory to where SUNWaspx was copied. $ cd /ProxyPlugin Solution: The instructions in README.txt must read as follows: 1) Copy SUNWaspx from the RootInstall directory on the CD to a directory on your machine. $ cp -R /se/WebPlugins/RootInstall/SUNWaspx /var/tmp 2) Change the directory to where SUNWaspx was copied. $ cd /var/tmp",
            "Information regarding KeepAliveFlushes in the Sun Java System Application Server Performance Tuning guide is incorrect. The Performance Tuning guide currently has the following information: The number of times the server had to close a connection because the KeepAliveCount exceeded the MaxKeepAliveConnections. This setting is not tunable. Solution The statement must read as follows: Application Server does not close existing connections when the KeepAliveCount exceeds the MaxKeepAliveConnections. Instead, new keep-alive connections are refused and the KeepAliveRefusals count is incremented.",
            "The section on Dynamic Deployment in Chapter 13 - Application Deployment of the Sun Java System Application Server Standard and Enterprise Edition 7 2004Q2 Update 3 Administration Guide (English) or the Sun ONE Application Server 7 Administration Guide (Japanese) does not warn users about errors that could occur if they attempt dynamic deployment when a client is accessing the server. Solution It is recommended that you execute the online dynamic deployment only when a client is not accessing the server. An error could occur in the data processing for memory and files if a client accesses the server during the application deployment process.",
            "The following statement in the Configuring the File Cache section of the Application Server 7 Performance Tuning Guide is incorrect: By default, Transmit File is enabled on NT, and not enabled on Unix. On Unix, enable Transmit File for platforms that have native OS support for PR_TransmitFile, which currently includes HP-UX and AIX. It is not recommended for other Unix/Linux platforms. Solution The statement must read as follows: By default, Transmit File is enabled on NT, and not enabled on Unix. On Unix, Transmit File is enabled for platforms that have native OS support for PR_TransmitFile, which currently includes Solaris, HP-UX and AIX. It is not recommended for other Unix/Linux platforms.",
            "Change in behavior of sessionFilename for memory persistence in Application Server 7 2004Q2 as compared to Application Server 7.0 series not documented. The sessionFileName property in the manager-properties table from Developer’s Guide to Web Applications should read: Specifies the absolute or relative pathname of the file in which the session state is preserved between application restarts, if preserving the state is possible. A relative pathname is relative to the temporary directory for this web module. The actual name of the file gets prepended with the context information. For example, if you specify fileName to be /tmp/Session and the web app context name is MemoryPersistenceApp, the session state is preserved in /tmp/MemoryPersistenceAppSession. This is applicable only if the persistence-type attribute of the session-manager element is memory.",
            "Typo in sample config.xml in Developing JAX-RPC Web Services chapter. In the Developer’s Guide to Web Services chapter, Developing JAX-RPC Web Services, the sample config.xml incorrectly capitalizes the S in targetNamespace and typeNamespace. Solution targetNameSpace should be targetNamespace. typeNameSpace should be typeNamespace.",
            "Incorrect button label specified in Application Server 7 2004Q2 Getting Started Guide. In Chapter 1, under Session Persistence Types, the guide incorrectly states to use the Save button to complete the procedure. There is no Save button. Use the OK button.",
            "Instructions for configuring Borland OptimizeIt are incorrect. Sun Java System Application Server Developer’s Guide contains a typo in instructions for configuring Borland OptimizeIt Profiler. Solution Use the following parameters for JVM options in the Profiler tab: -DOPTITHOME=Optimizeit_dir-Xbootclasspath/p:/Optimizit_dir/lib/oibcp.jar-Xrunpri:startAudit=t",
            "Error in asadmin create-jdbc-connection-pool man page. The current description of --restype is incorrect. The -restype must be specified to disambiguate when a Datasource class implements both interfaces. An error is produced when this option has a legal value and the indicated interface is not implemented by the datasource class. This option has no default value. Solution --restype must be specified to disambiguate when a datasource class implements more than one of the JDBC interfaces javax.sql.DataSource, javax.sql.ConnectionPoolDataSource or javax.sql.XADataSource. An error is produced when this option has a legal value and the indicated interface is not implemented by the datasource class.",
            "Incorrect information in Administration Console online help on security realms. In Application server Administration console, under Appserver instances>Server1>Security>Realms, the help file lists the different realms as: file, ldap, certificate, solaris. This is incorrect. The actual realms are: file, ldap, certificate, agentRealm. The Application Server installer sets the security realm to agentRealm by default.",
            "hadbm help gives outdated information. Solution For the latest information, see Chapter, “Administering the High-Availability Database (Enterprise Edition),” in Sun Java System Application Server Standard and Enterprise Edition 7 2004Q2 Update 3 Administration Guide (819–2783).",
            "In the create-ssl man page, a space is missing between --certname and cert_name. Solution The correct syntax for the --certname option is as follows: --certname cert_name",
            "Outdated help files from Sun ONE Application Server 7, Enterprise Edition are displayed. Solution If you have previously installed a different version of the Sun Java System Application Server (for example, Sun ONE Application Server 7, Enterprise Edition), make sure that your MANPATH environment variable points to your current installation directory.",
            "Documentation error in the example section of the delete-jvm-options manpage. The example should read as follows: asadmin delete-jvm-options --user admin --password adminadmin --host localhost --port 4848 --instance server1 -- \"-Djava.security.policy=/var/opt/SUNWappserver7/domains/domain1/server1/config/server.policy\"",
            "Installation Guide PDF file in product CD is corrupt. Solution Use the HTML version of the Installation Guide."
        ]
    ],
    "pageTitle": "Chapter 1 Sun Java System Application Server Standard and Enterprise Edition Release Notes (Sun Java System Application Server Standard and Enterprise Edition 7 2004Q2 Update 7 Release Notes)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19229-01/820-5583/6ngvi9oea/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00008-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 68194699,
    "recordOffset": 68149400,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5707=December 2006 , 63253=rpm -e SUNWascmo-zh_CN-7.1.0-02.src.rpm, 6199=April 2005 , 111438=n:3 NSUP INF 2005-02-11 18:00:33.844 p:731 Have not heard from it in 104.537454 sec, 5015=June 2008 , 103789=6291562, 86199=6502888, 123203=4861337, 20524=1.3.29, 2.0.49 , 6687=September 2004 , 6442=January 2005 , 62988=rpm -e SUNWjaso-7.1.0-02.src.rpm, 21006=Windows 2000: Server Service Pack 2Windows 2000: Advanced Server Service Pack 2Windows 2000: Professional Service Pack 2Windows XP: Professional and Windows 2003 (Standard Edition of Application Server Only) , 112874=6232140, 6934=May 2004 , 63369=rpm -e SUNWaso-zh_CN-7.1.0-02.src.rpm, 77735=5089201, 5001994, 4387=January 2009 , 80468=imq.portmapper.backlog=1000, 5953=November 2005 , 62882=rpm -e SUNWjascmo-7.1.0-02.src.rpm, 61323=6222700, 121504=5091280, 138722=5011969, 102671=6301842, 5465=June 2007 , 114614=6171994, 5188=October 2007 , 58414=Changed the symbolic link to 4.4.2-30. , 71659=2082209, 5022904, 104418=To fix the problem, the Windows registry variable HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\Tcpip\\Parameters should be set to a value higher than the default value of 100. We recommend increasing it to 0x1000 (4096). For more information, see article 811003 from the Microsoft support pages: http://support.microsoft.com/default.aspx?scid=kb;en-us;811003, 67901=4762420, 63142=rpm -e SUNWjjmail-7.1.0-02.src.rpm, 111334=n:3 NSUP INF 2005-02-11 18:00:33.844 p:731 Child process noman3 733 does not respond., 126133=HADB does not support double networks on Windows 2003 (bug id 5103186)., 106599=6271063, 63039=rpm -e SUNWjaspx-7.1.0-02.src.rpm, 78596=4951476, 4004=April 2009 , 89887=4742545, 4194=February 2009 , 153694=IIOP port values should not exceed 32767. If the values configured are outside this range, a connection failure occurs during failover. When configuring the IIOP listener for the server, ensure that the port values are within this range. , 45092=The following table lists the critical issues resolved in Sun Java System Application Server Standard and Enterprise Edition 7 2004 Update 1, Update 2, Update 3, Update 4, Update 5, Update 6, and Update 7 releases., 63538=rpm -e SUNWjmail-zh_CN-7.1.0-02.src.rpm, 152987=Creating a new ORB Listener > The IIOP port value cannot be left blank, though the * that signifies a ’must-specify’ entry is not present. The default value shown is 1072, although the listener port value for the default listener created during server installation is 3700., 50028=Need to incorporate JDK 1.4.2_10 or higher for AS 7.1 on T2000 systems. , 4591=December 2008 , 63195=rpm -e SUNWasaco-zh_CN-7.1.0-02.src.rpm, 155579=6511489, 63311=rpm -e SUNWasdmo-zh_CN-7.1.0-02.src.rpm, 73375=4991065, 63425=rpm -e SUNWaspx-zh_CN-7.1.0-02.src.rpm, 115435=5042351, 4456=Added to Resolved Issues section: 6596161 and 6612879. , 62829=rpm -e SUNWjasaco-7.1.0-02.src.rpm, 63482=rpm -e SUNWjaf-zh_CN-7.1.0-02.src.rpm, 113731=6171832, 6172138, 120910=5091349, 157284=6412668, 4838=July 2008 , 97086=4761151, 4825429, 4981545, 62935=rpm -e SUNWjasdmo-7.1.0-02.src.rpm, 95853=6262746, 107892=6262824, 111540=n:3 NSUP INF 2005-02-11 18:00:33.844 p:731 Child process noman3 733 did not start., 137725=4991824, 12684=1024 MB , 63091=rpm -e SUNWjjaf-7.1.0-02.src.rpm, 17110=MS SQL Server 2000 Service Pack 1 , 98887=On Linux, Apache Web Server 1.3.27 does not start after installing load balancer plug-in and sec_db files.}",
    "lastModified": "Wed, 26 Jan 2011 21:05:57 GMT",
    "textBeforeTable": "This section lists the changes that have been made in these release notes after the initial release of the Sun Java System Standard and Enterprise Edition 7 Application Server 7 Standard and Enterprise Edition product. Release Notes Revision History Additional Sun Resources How to Report Problems and Provide Feedback Redistributable Files Known Problems and Limitations Resolved Issues Other Requirements and Limitations Sun ONE Studio 5 Standard Edition Update 1 Using Migration Tool Upgrade Options Solaris Patches Required Platform Summary Release Notes Revision History This document contains the following sections: These release notes contain important information available at the time of the release of the Sun JavaTM System Application Server Standard and Enterprise Edition 7 2004Q2 Update 7. Enhancements, installation notes, known problems, and other late-breaking issues are addressed here. Read this document and associated documents before you begin using the Sun product. Chapter 1 Sun Java System Application Server Standard and Enterprise Edition Release Notes Previous: Index",
    "textAfterTable": "Platform Summary This section provides information on supported platform components for the Sun Java System Application Server Standard and Enterprise Edition 7 2004Q2 Update 7. This section includes:Operating Systems and Distribution Types Operating Systems and Distribution Types System Requirements JDBC Drivers and Databases Web Servers Software Packages Browsers Operating Systems and Distribution Types The following table identifies the supported operating systems and distribution types for Sun Java System Application Server 7 2004Q2 Update 7: Table 1–1 Supported Operating Systems and Distribution Types Platform   Operating System Version   Distribution Type   Application Server 7 2004Q2 Update 1 Edition   Solaris SPARC®  Solaris 8 Update 7, Solaris 9 Update 7, Solaris 101 file-based and package-based2 Standard and Enterprise Edition  Solaris x86  Solaris 9 Update 4, Solaris 10  file-based and package-based  Standard and Enterprise Edition ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}