{
    "relation": [
        [
            "Nominee",
            "Jill Whalen",
            "Greg Boser",
            "Matt Cutts",
            "Stoney DeGeytor",
            "Dave Naylor"
        ],
        [
            "Count",
            "222",
            "110",
            "84",
            "60",
            "23"
        ],
        [
            "Percent %",
            "44.49%",
            "22.04%",
            "16.83%",
            "12.02%",
            "4.61%"
        ]
    ],
    "pageTitle": "SEO Archives - Chris Hooley's -ThinkBait- Chris Hooley's -ThinkBait-",
    "title": "",
    "url": "http://www.chris-hooley.com/tag/seo/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00222-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 356782855,
    "recordOffset": 356725931,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{255725=Digg has roughly 60% of the traffic it generated in December 2006 for a reason. Maybe it has something to do with the fact they ban people for who they are. I am an SEO, not a spammer. I’ve never spammed Digg or misused my account. I am now an internet user who USED TO use digg to find stories I might like., 137688=EDIT- we hit 250 responses in about an hour, so it’s opened up to 1000 responses. There’s STILL TIME to cast YOUR votes!, 265615=Chris, my pubcon buddy circa 2006, we got mo’ in sto’ for 07!, 22202=The time has come to announced the winners for the 2008 SEO Superlatives. But before the announcement, I’d like to thank everybody who contributed. The SEO Superlatives Committee was awesome. All you crazy guys and gals who where socializing this, kick ass. Thanks so much for making this contest so much fun!, 263647=Tamar, maybe you can digg this?  Just kidding it’s a boring post :-p}",
    "textBeforeTable": "1. SEO Most Likely to Succeed Report: SEO Superlatives Summary – Compiled 07/04/08 As you’ll see, the committe only chose one or two winners over the unfiltered voting results. And sorry Michael, but it’s hard to believe you’re more feared than Matt Cutts in the SEO world. Below are the unfiltered results of the vote. Despite attempts at altering the vote, much like Google we also had manual review. And much like Google, the popular vote still overpowered the spam for the most part, so the committee’s job was pretty darn easy in that regard. There were more polls that only voted for one single person than completed surveys. IN all, half the votes were spam. HALF. Numerous nominees, especially in the categories for unknown or up and coming SEOs had bots voting themselves up in an almost embarrasingly traceable way. Same IP from nominee’s city votes for self 100 times in an hour? yep. Lots of that. Rushes of voters from India, Russia, Malaysia, and Poland overnight? Some of that too. The winners were chosen almost 100% from the unfiltered voting results, allowing SEOs to game the voting system to the best of their abilities. And game they did. The Results Jason Gambert",
    "textAfterTable": "2. SEO Conference Clown Nominee Count Percent % Chris Hooley 309 60.00% Neil Patel 166 32.23% Darren Slatten 23 4.47% Gab Goldberg 14 2.72% Gab Goldenberg 3 0.58% 3. Best SEO Couple Nominee Count Percent % Carolyn Shelby and Dave Rohrer 197 38.70% Greg and Barbara Boser 161 31.63% Chris Hooley and Anna Rule 94 18.47% David & Irma Wallace 30 5.89% Jeff Quipp & Jennifer Osborne 27 5.30% 4. Best Dressed SEO Nominee Count Percent % Brett Tabke 208 38.88% Kid Disco 127 23.74% Pamela Lund 87 16.26% Mikkel deMib Svendsen 66 12.34%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}