{
    "relation": [
        [
            "Patent application number",
            "20100208558",
            "20120236703",
            "20130182549",
            "20140160910"
        ],
        [
            "Description",
            "SUPER-RESOLUTION OPTICAL RECORDING MEDIUM, OPTICAL RECORDING MEDIUM REPRODUCTION DEVICE, CONTROL METHOD OF OPTICAL RECORDING MEDIUM REPRODUCTION DEVICE, CONTROL PROGRAM FOR OPTICAL RECORDING MEDIUM REPRODUCTION DEVICE, AND COMPUTER-READABLE RECORDING MEDIUM FOR STORING THE PROGRAM - A super-resolution optical recording medium (",
            "Super-resolution optical recording medium on which information is recorded using train of prepits, optical recording medium reproduction device, and control method - A super-resolution optical recording medium includes: a medium information region on which medium identification information is recorded; a content region on which content information is recorded; and a blank region provided between the medium information region and the content region and in which at least two tracks are provided so as to connect a train of prepits in the medium information region and a train of prepits in the content region. No information is recorded on the blank region. Thus, a super-resolution optical recording medium is provided in which a region on which medium identification information is recorded and a region on which content information is recorded are different in track pitch and in which a reproduction error hardly occurs when reproduction shifts from the region on which the medium identification information is recorded to the region on which the content information is recorded.",
            "SUPER-RESOLUTION OPTICAL RECORDING MEDIUM ON WHICH INFORMATION IS RECORDED USING TRAIN OF PREPITS, OPTICAL RECORDING MEDIUM REPRODUCTION DEVICE, AND CONTROL METHOD - A super-resolution optical recording medium includes: a medium information region on which medium identification information is recorded; a content region on which content information is recorded; and a blank region provided between the medium information region and the content region and in which at least two tracks are provided so as to connect a train of prepits in the medium information region and a train of prepits in the content region. No information is recorded on the blank region. Thus, a super-resolution optical recording medium is provided in which a region on which medium identification information is recorded and a region on which content information is recorded are different in track pitch and in which a reproduction error hardly occurs when reproduction shifts from the region on which the medium identification information is recorded to the region on which the content information is recorded.",
            "OPTICAL RECORDING MEDIUM ON WHICH INFORMATION IS RECORDED USING TRAIN OF PREPITS, AND METHOD FOR REPRODUCING OPTICAL RECORDING MEDIUM - An optical recording medium includes: a medium information region on which medium identification information is recorded; a content region on which content information is recorded; and a blank region provided between the medium information region and the content region and in which at least two tracks are provided so as to connect a train of prepits in the medium information region and a train of prepits in the content region. No information is recorded on the blank region. Thus, an optical recording medium is provided in which a region on which medium identification information is recorded and a region on which content information is recorded are different in track pitch and in which a reproduction error hardly occurs when reproduction shifts from the region on which the medium identification information is recorded to the region on which the content information is recorded."
        ],
        [
            "Published",
            "08-19-2010",
            "09-20-2012",
            "07-18-2013",
            "06-12-2014"
        ]
    ],
    "pageTitle": "Takamori, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/takamori-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00263-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 436713435,
    "recordOffset": 436686371,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Nobuyuki Takamori, Osaka JP 05-13-2010 OPTICAL INFORMATION STORAGE MEDIUM, OPTICAL INFORMATION STORAGE MEDIUM PLAYBACK APPARATUS, METHOD OF CONTROLLING OPTICAL INFORMATION STORAGE MEDIUM PLAYBACK APPARATUS, CONTROL PROGRAM OF OPTICAL INFORMATION STORAGE MEDIUM PLAYBACK APPARATUS, AND STORAGE MEDIUM STORING THE PROGRAM THEREIN - A super resolution medium ( 20100118672 Published Description Patent application number Nobuyuki Takamori, Osaka-Shi JP //]]> BarDraw('2886751',['Patent applications by Nobuyuki Takamori, Nara JP'],[[1,1,1,2]],['2005','2006','2009','2010'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2886751\" align=\"center\"></div> </div> <canvas id=\"bg2886751\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Nobuyuki Takamori, Nara JP</p> <div class=\"bar2886751\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>09-02-2010</td> <td><a href=\"/patents/app/20100220567\">Optical Information Recording Medium, Reproducing Device for Optical Information Recording Medium, Control Method and Control Program for the Reproducing Device, and Medium with the Control Program Recorded Therein</a> - A super-resolution medium (</td> <td>20100220567</td> <tr> </tr> <td>01-21-2010</td> <td><a href=\"/patents/app/20100014407\">OPTICAL INFORMATION RECORDING MEDIUM, REPRODUCING DEVICE FOR OPTICAL INFORMATION RECORDING MEDIUM, AND REPRODUCING METHOD FOR OPTICAL INFORMATION RECORDING MEDIUM</a> - In an optical information recording medium (</td> <td>20100014407</td> <tr> </tr> <td>02-05-2009</td> <td><a href=\"/patents/app/20090034388\">Multi-Format Optical Storage Medium, Optical Pickup, and Optical Read/Write Device</a> - There is provided a storage layer (</td> <td>20090034388</td> <tr> </tr> <th>Published</th> <th>Description</th> <th>Patent application number</th> <tr> <tbody> <table class=\"preltab\" id=\"inv_tab_2886751\"> <h2>Nobuyuki Takamori, Nara JP</h2> </table> </tbody> </tr> <td>02-12-2009</td> <td><a href=\"/patents/app/20090043119\">TANTALUM COMPOUND, METHOD FOR PRODUCING SAME, TANTALUM-CONTAINING THIN FILM AND METHOD FOR FORMING SAME</a> - Objects of the present invention are",
    "textAfterTable": "Patent applications by Nobuyuki Takamori, Osaka JP Satoshi Takamori, Kyoto JP Patent application number Description Published 20090231786 CONNECTION MECHANISM AND MOBILE TERMINAL - A connection mechanism connects a first casing and a second casing so as to move between a closed state in which the casings are superimposed on each other and an open state in which the casings are open and spread out. The connection mechanism includes: opening parts formed on a connection side of the first casing and a connection side of the second casing; connection members of which both ends can be advanced into and retreated from the opening parts of the first casing and the opening parts of the second casing; and an advance/retreat ratio stabilization part for stabilizing a ratio of an advance/retreat amount of the connection member into/from the first casing to an advance/retreat amount of the connection member into/from the second casing to a predetermined value. 09-17-2009 Satoshi Takamori, Shiga-Ken JP Patent application number Description Published 20080318645 Excessive Rotation Preventing Structure for Rotation Supporting Mechanism and Portable Terminal - An excessive rotation preventing structure for a rotation supporting mechanism, which has no torque",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}