{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I often see campus police patroling. I feel safe on campus.",
            "There are a wide variety of academic, sport, or other such clubs available for all students to join.",
            "Surrounding Northern, is the largest of the Great Lakes, Lake Superior. So students are able to enjoy the great nature. Northern also offer a wide variety of sport classes.",
            "Nor do I use diners at the University.",
            "I commute to school, so I can't relate.",
            "I think that some courses, are thought to be difficult, however a person just need to put appropriate time toward each course.",
            "I suggest to all students that college is not the time to party but the time to study. All courses can easily be passed with outstanding achievements if only the student does the required work. Remember being at a university is a time to study.",
            "Northern keeps up with current technology. A notebook computer is available for all full time students, and there is great internet access in surrounding areas via WiMax. As well printing, it is eco-friendly and user friendly. The computers and great internet access give students more resources for studying."
        ]
    ],
    "pageTitle": "Northern Michigan University (Northern) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Northern-Michigan-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00263-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908740207,
    "recordOffset": 908691598,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{176866=There is this unwritten tradition that in September, the incoming freshman have to jump off Black Rocks, a hidden area next to Lake Superior where you jump off the cliffs into the freezing cold great lake. I will admit that the water was numbingly cold, but it was really fun, i would recommend not missing out on it., 229759=© 2015, Cappex.com, LLC, 28220=My best friend I are going to be freshmen fall of 2012 at NMU! Couldnt be more excited to be attending such an amazing school with such great programs are professors!, 115455=Northern is one of the cheapest Universities in the state of Michigan, and yet Northern has a higher placement rate than the more expensive schools. http://colleges.usnews.rankingsandreviews.com/best-colleges/northern-michigan-university-2301}",
    "textBeforeTable": "07/16/2009 Reviewer is A current student here. 22 out of 22 people found this review useful. 1 of 56 Bryanne from Canton, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Great for these types of students Anyone who LOVES the outdoors.. and snow. Snow is a huge part of the school year up at NMU. I can't say anything to generalize the residence halls/dorms, because each one is different! I consider myself to be an open-minded and adventurous person, and NMU has DEFINITELY brought out the best in my character. NMU has several different choices for activities, including a fully-loaded Physical Education center, complete with a ROCK WALL. There are a lot of resources available for students that need help with school, family, friends, and just adjusting to college in general. Anyone who loves the outdoors, hanging out with new people, delicious varieties of foods, and life in general will most likely thrive at NMU. Tips for prospective students Be sure to pack an open mind with your ski boots and notebooks! Moving up to NMU was a life-changing experience for me and I learned a lot about myself and college life in general. Be aware that you are not only going to school to have fun and make connections, but essentially to LEARN and PREPARE yourself for life AFTER college. Don't let yourself get too distracted or you might fall behind. Other than that.. Have fun and take FULL advantage of the campus life and facilities. I know I did :) Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}