{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Top Notch",
            "??? Haven't looked into it",
            "There are a lot!!!",
            "Young students who want to get their pre-requisites out of the way cheaper before transferring to a major University. Working Class Students looking for professional development, older folks looking for a degree, or career change... pretty much anyone looking to attend a reputable college at an affordable price and wants to feel like they belong.",
            "Childcare on campus for those students with kids.",
            "Very reasonable!!!!!",
            "There are a lot of family activities for students with families, and a plethora of sports, entertainment, clubs and activities to suit any student at any age.",
            "The cafeteria is nice and has quality food at reasonable prices.",
            "Stay on schedule and don't give up!!",
            "Tacoma Community College is an excellent school full of diversity, culture, and student activity. The classes and schedules are realistic and doable. The faculty and staff are of the up-most quality and truly care about the success of their students."
        ]
    ],
    "pageTitle": "Tacoma Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Tacoma-Community-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00122-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910635203,
    "recordOffset": 910597383,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{150813=I can't say too much about their academics because I'm starting my first year this September. From what I've heard from friends and family that have attended, I have heard that its a really good community college., 187520=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "02/13/2012 Reviewer is A past student here. 3 out of 3 people found this review useful. 1 of 47 Angela from Tacoma, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Tips for prospective students enter college prepared, knowing in advance what you want to study. line your classes up with any universities programs you plan to transfer into. In three sentences tacoma community college is diverse with many cultures and ages. the courses offered are good, however, i have experience both good and bad teachers. unfortunately though, it is difficult to accomplish anything through the office administration and desk workers aren't very willing to put in effort above what is expected. Login to rate or flag the reviews Nicholle from Puyallup, WA 05/25/2012 Reviewer is A past student here. 2 out of 2 people found this review useful. 2 of 47 Categories Comments Great for these types of students TCC is great for students who work full time because there is usually a variety of times classes are held. Also if you are going back to school they have a lot of certificate programs which don't seem too intimidating to complete. Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}