{
    "relation": [
        [
            "Value",
            "0",
            "1"
        ],
        [
            "Meaning",
            "File was not deleted",
            "File was deleted"
        ]
    ],
    "pageTitle": "Network Protocols : AudioGalaxy Client Protocol",
    "title": "",
    "url": "http://www.alpha-programming.co.uk/software/satellite/agprotocol.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00120-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 287108719,
    "recordOffset": 287098329,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 03 Apr 2008 10:37:55 GMT",
    "textBeforeTable": "Within messages passed between clients, values are passed in big-endian format, ie the largest byte value appears first in the stream. A number of data types are used to describe the content of the stream. Data formats During file transfer server may send message Message_StopFileTransfer with the FILE_ID of the transfer to be shutdown. After the file transfer connection is closed, the Client sends Message_FileTransferState status 8. Transfer shutdown If the file was found, the sender sends a response to the receiver (see below). After finishing, both sides send Message_FileTransferState status 0. And the downloader sends Message_NewSharedFile with the information on new file. After connection is done Client sends FileRequest message which consists of FILE_ID received from Message_FileTransfer. The size of the file to be downloaded, and the position to resume (the first byte of the file is at position 0). If the client downloads The Client sends Message_FileTransferState status 3 The Client makes a connection to the IP and port defined in message Message_FileTransfer If the client make a connection The Client sends Message_FileTransferState status 3 The Client opens a port defined in the message Message_FileTransfer. The IP given in the",
    "textAfterTable": "Byte A single byte value Word A 2-byte value Integer A 4-byte value Redirection message When the Client connects to the redirection server, a reply is sent back to indicate the Server that the Client should connect to. Type Name Contents Integer START_SIGNAL 0x455FD0D5 Integer MESSAGE_SIZE Size of the whole message without START_SIGNAL Integer ID Message count Integer PORT Port to connect to String SERVER_IP IP to connect to Peer-to-peer messages Peer-to-peer connections supply a 'message count' (ID) which is not used by either end of the connection. It is usual to start a counter at zero and with every FileRequest or FileRequestReply to increment this counter. Whilst it might seem obvious to use this field as an additional check to return to the client, this is not done. Using an incrementing counter might be useful for tracing transactions more easily. FileRequest When the Client connects to",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}