{
    "relation": [
        [
            "",
            "Description",
            "Land",
            "Building",
            "Building and land improvements",
            "Tenant improvements",
            "Leasehold improvements",
            "Lease costs",
            "Intangible lease assets and liabilities",
            "Above/below market rent assets/liabilities"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Standard Depreciable Life",
            "Not depreciated",
            "40 years",
            "20 years",
            "Shorter of lease term or useful life",
            "5 \u0096 20 years",
            "Lease term",
            "Average term of leases for property",
            "Lease term"
        ]
    ],
    "pageTitle": "Form 10-Q",
    "title": "",
    "url": "http://www.wikinvest.com/stock/DCT_Industrial_Trust_(DCT)/Filing/10-Q/2009/F2374907",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00002-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 820277367,
    "recordOffset": 820182818,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{750850=The following table illustrates the various components of our Rental Revenues for the three months ended March 31, 2009 and 2008 (in thousands):, 863300=As of March 31, 2009, the estimated fair value of our debt was approximately $1.1 billion based on our estimate of the then-current market interest rates., 487568=Based on the provisions of certain joint venture agreements we have, indirectly through partner level guarantees, guaranteed our proportionate share of $70.1 million in construction financing as of March 31, 2009. In the event the guarantor partner is required to satisfy the guarantee, DCT has indemnified its venture partner for our proportionate share of the guarantee. These guarantees remain outstanding until the construction financing is satisfied., 451811=2012, 276301=Balance at December 31, 2008, as previously reported, 524433=The following table illustrates the noncontrolling interests\u0092 share of our Consolidated Net Income during the three months ended March 31, 2009 and 2008 (in thousands):, 415412=In February 2007, the FASB issued SFAS No. 159, The Fair Value Option for Financial Assets and Financial Liabilities (\u0093SFAS No. 159\u0094) which expanded the use of the fair value measurement to improve financial reporting by providing entities with the opportunity to mitigate volatility in reported earnings caused by measuring related assets and liabilities differently without having to apply complex hedge accounting provisions. Upon adoption of this Statement, we did not elect the fair value option for our existing financial assets and liabilities and therefore adoption of SFAS No. 159 did not have any impact on our Consolidated Financial Statements., 828867=There are no lines of credit, side agreements, or any other derivative financial instruments related to, or between, our unconsolidated joint ventures and us, and we believe we have no material exposure to financial guarantees, except as discussed above. As of March 31, 2009, our proportionate share of non-recourse debt associated with unconsolidated joint ventures is $144.9 million, which includes the $70.1 million related to construction financing discussed above., 620310=We make statements in this report that are considered \u0093forward-looking statements\u0094 within the meaning of Section 27A of the Securities Act of 1933, as amended, or the Securities Act, and Section 21E of the Securities Exchange Act of 1934, as amended, or the Exchange Act, which are usually identified by the use of words such as \u0093anticipates,\u0094 \u0093believes,\u0094 \u0093estimates,\u0094 \u0093expects,\u0094 \u0093intends,\u0094 \u0093may,\u0094 \u0093plans,\u0094 \u0093projects,\u0094 \u0093seeks,\u0094 \u0093should,\u0094 \u0093will,\u0094 and variations of such words or similar expressions. We intend these forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995 and are including this statement for purposes of complying with those safe harbor provisions. These forward-looking statements reflect our current views about our plans, intentions, expectations, strategies and prospects, which are based on the information currently available to us and on assumptions we have made. Although we believe that our plans, intentions, expectations, strategies and prospects as reflected in or suggested by those forward-looking statements are reasonable, we can give no assurance that the plans, intentions, expectations or strategies will be attained or achieved. Furthermore, actual results may differ materially from those described in the forward-looking statements and will be affected by a variety of risks and factors that are beyond our control including, without limitation:, 807750=Our senior unsecured revolving credit facility is with a syndicated group of banks and has a total capacity of $300.0 million and matures December 2010. The facility has provisions, which under certain circumstances, may allow us to increase its total capacity to $500.0 million. At our election, the facility bears interest either at LIBOR plus between 0.55% and 1.1%, depending upon our consolidated leverage, or at prime and is subject to an annual facility fee. As of March 31, 2009 and December 31, 2008, this facility was undrawn. After giving effect for our outstanding letters of credit we had $284.8 million available., 864699=Under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, we conducted an evaluation of the effectiveness of our disclosure controls and procedures, as such term is defined under Rule 13a-15(e) under the Exchange Act, as of March 31, 2009, the end of the period covered by this report. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that our disclosure controls and procedures will detect or uncover every situation involving the failure of persons within DCT Industrial Trust Inc. or its affiliates to disclose material information otherwise required to be set forth in our periodic reports. Based on this evaluation, our principal executive officer and our principal financial officer concluded that our disclosure controls and procedures were effective as of March 31, 2009 in providing reasonable assurance that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission\u0092s rules and forms., 316125=Balance at March 31, 2009, 269965=For the Three Months Ended March 31, 2009, 406077=As of March 31, 2009, all of the hedges entered into by us had been designated as cash flow hedges. For derivatives designated as \u0093cash flow\u0094 hedges, the effective portion of the changes in the fair value of the derivative is initially reported in \u0093Accumulated other comprehensive loss\u0094 in our Consolidated Statements of Stockholders\u0092 Equity and Other Comprehensive Loss (i.e., not included in earnings) and subsequently reclassified into earnings when the hedged transaction affects earnings or the hedging relationship is no longer effective at which time the ineffective portion of the derivative\u0092s changes in fair value is recognized directly into earnings. We assess the effectiveness of each hedging relationship whenever financial statements are issued or earnings are reported and at least every three months as required by SFAS No. 133. We do not use derivatives for trading or speculative purposes., 367793=DCT Industrial Trust Inc. is a leading industrial real estate company that owns, operates and develops high-quality bulk distribution and light industrial properties in high-volume distribution markets in the U.S. and Mexico. We were formed as a Maryland corporation in April 2002 and have elected to be treated as a real estate investment trust (\u0093REIT\u0094) for United States (\u0093U.S.\u0094) federal income tax purposes commencing with our taxable year ended December 31, 2003. We are structured as an umbrella partnership REIT under which substantially all of our current and future business is, and will be, conducted through a majority owned and controlled subsidiary, DCT Industrial Operating Partnership LP (our \u0093operating partnership\u0094), a Delaware limited partnership, for which DCT Industrial Trust Inc. is the sole general partner. As used herein, \u0093DCT Industrial Trust,\u0094 \u0093DCT,\u0094 \u0093the Company,\u0094 \u0093we,\u0094 \u0093our\u0094 and \u0093us\u0094 refer to DCT Industrial Trust Inc. and its consolidated subsidiaries and partnerships except where the context otherwise requires., 436041=Aggregate amortization expense for intangible lease assets recognized in connection with property acquisitions (excluding assets and liabilities related to above and below market rents; see Note 2 for additional information) was approximately $5.1 million and $7.0 million for the three months ended March 31, 2009 and 2008, respectively. Our intangible assets and liabilities included the following as of March 31, 2009 and December 31, 2008 (in thousands):, 434710=2009 Development Projects - Consolidated, 652556=Significant Transactions During 2009, 409058=We record rental revenues on a straight-line basis under which contractual rent increases are recognized evenly over the full lease term. Certain properties have leases that provide for tenant occupancy during periods where no rent is due or where minimum rent payments change during the term of the lease. Accordingly, we record receivables from tenants that we expect to collect over the remaining lease term rather than currently, which are recorded as straight-line rents receivable. When we acquire a property, the terms of existing leases are considered to commence as of the acquisition date for the purposes of this calculation. For the three months ended March 31, 2009 and 2008, the total increase to \u0093Rental revenues\u0094 due to straight-line rent adjustments, including amounts reported from discontinued operations, was approximately $0.3 million and $1.1 million, respectively., 763974=Real estate related depreciation and amortization decreased by approximately $1.5 million, or 5%, for the three months ended March 31, 2009 as compared to the same period in 2008, primarily due to intangible assets recognized in connection with property acquisitions becoming fully amortized. The decrease in interest expense of approximately $1.1 million is primarily attributable to decreases in the average LIBOR rate during the three months ended March 31, 2009 compared to the same period in 2008. Income taxes increased related to activity in our taxable REIT subsidiary., 640845=Although the credit markets for the real estate sector continue to be extremely constrained as a result of the liquidity constraints of major lending institutions and other traditional sources of capital, we believe that our sources of capital are adequate to meet our liquidity requirements in 2009 and 2010. We have no major debt maturities until June 2010 when a $300 million senior unsecured term loan comes due which can be extended at our option for one year so that we would not have any significant debt maturities until 2011. Additionally, as of March 31, 2009, we had $284.8 million available under our unsecured credit facility, which matures in December 2010, and cash and cash equivalents of approximately $16.2 million. These capital resources will be utilized in part to meet our purchase obligations and development project commitments as discussed in \u0093Liquidity and Capital Resources\u0094., 862523=Similarly, our variable rate debt is subject to risk based upon prevailing market interest rates. As of March 31, 2009, we had approximately $225.2 million of variable rate debt outstanding indexed to LIBOR rates. If the prevailing market interest rates relevant to our remaining variable rate debt were to increase 10%, our interest expense for the three months ended March 31, 2009, would have increased by approximately $0.1 million. Additionally, if weighted average interest rates on our fixed rate debt were to change by 1% due to refinancing, interest expense would change by approximately $2.6 million during the three months ended March 31, 2009., 781034=The payment of quarterly distributions is determined by our board of directors and may be adjusted at its discretion at any time. We currently pay annualized distributions of approximately $67 million. We believe this level to be appropriate based upon our anticipated results and taxable income. During February 2009, our board of directors declared a $0.08 per share quarterly cash dividend., 749695=Rental revenues increased by approximately $0.5 million, or 1%, for the three months ended March 31, 2009 compared to the same period in 2008, primarily due to an increase of $1.3 million in early termination fees offset by a decrease in revenue related to straight-line basis accounting. Early lease terminations increased during the three months ended March 31, 2009 compared to prior periods which resulted in increased write-offs of straight-line rent receivables and collection of termination fees. Base rent was relatively flat reflecting a decrease in average occupancy from 93.4% for the three months ended March 31, 2008, to 91.5% for the three months ended March 31, 2009 offset by approximately six more operating properties included in operations for the three months ended March 31, 2009 compared to the same period in 2008. Tenant recovery income decreased as a result of lower average occupancy. Other revenue increased primarily due to a settlement related to a land condemnation and a tenant assignment fee., 535375=During the three months ended March 31, 2009, we granted approximately 1.5 million stock options, at the weighted-average exercise price of $3.41 per share which generally vest 25% annually over four years. The fair value of the aforementioned grants adjusted for estimated forfeitures totaled $0.7 million and is amortized over their respective vesting periods. During the three months ended March 31, 2008, we granted approximately 1.6 million stock options, at the weighted-average exercise price of $8.64 per share which vest 25% annually over four years. The fair value of the aforementioned grants adjusted for estimated forfeitures totaled $0.9 million and is amortized over their respective vesting periods., 695894=Comparison of the three months ended March 31, 2009 to the same period ended March 31, 2008, 776622=During the three months ended March 31, 2009, we used $16.3 million more cash for financing activities compared to the same period in 2008 primarily related to cash used for principal payments of $1.7 million for the three month ended March 31, 2009 compared to net borrowings of $32.0 million during the three months ended March 31, 2008. Offsetting the cash flows related to our borrowings, our cash required for distributions decreased by $16.4 million due to the reduction of our quarterly distribution rate from $0.16 per share to $0.08 per share., 489522=As of March 31, 2009 and December 31, 2008, the fair values of cash and cash equivalents, restricted cash held in escrow, accounts receivable and accounts payable approximated their carrying values because of the short-term nature of these instruments. The estimated fair values of other financial instruments subject to fair value disclosures were determined based on available market information and valuation methodologies believed to be appropriate for these purposes. Considerable judgment and a high degree of subjectivity are involved in developing these estimates. These estimates are our best estimates, however, they may differ from the actual amounts that we could realize upon disposition. The following table summarizes these financial instruments (in thousands)., 874946=Pursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized., 410056=Tenant recovery income includes payments and amounts due from tenants pursuant to their leases for real estate taxes, insurance and other recoverable property operating expenses and is recognized as \u0093Rental revenues\u0094 during the same period the related expenses are incurred. Tenant recovery income recognized as \u0093Rental revenues\u0094 for the three months ended March 31, 2009 and 2008, including amounts from discontinued operations, was $11.6 million and $13.0 million, respectively., 564844=We have excluded from diluted earnings per share the weighted average common share equivalents related to approximately 36.5 million and 41.9 million stock options, phantom stock, warrants, OP Units and unvested LTIP units, for the three months ended March 31, 2009 and 2008, respectively, because their effect would be anti-dilutive., 452577=2013, 368947=As of March 31, 2009, we owned interests in, managed, or had under development 450 industrial real estate buildings comprised of approximately 75.9 million square feet. Our portfolio of consolidated operating properties included 373 industrial real estate buildings, which consisted of 218 bulk distribution properties, 113 light industrial properties and 42 service center properties comprised of approximately 52.1 million square feet. Our portfolio of 373 consolidated operating properties was 89.8% occupied as of March 31, 2009. As of March 31, 2009, we also consolidated 12 development properties and six redevelopment properties. In addition, as of March 31, 2009, we had ownership interests ranging from 4% to 20% in unconsolidated institutional joint ventures, or funds, that owned 45 properties comprised of approximately 14.1 million square feet, and investments in three unconsolidated operating properties and ten unconsolidated development joint venture properties., 639503=We believe near-term operating income from our existing properties will likely decrease as demand for warehouse space declines and the availability of competitive space increases. During the first quarter 2009, the slowing economy impacted our performance in several ways including: negative rent growth on signed leases, fewer lease renewals, decreased leasing of existing vacancies, and an increase in early terminations, bankruptcies and requests for rent relief. The current economic recession is expected to result in a higher level of bankruptcies nationally, which could reduce the demand for leasing space in our business resulting in decreased occupancy and competitive pressure on rental rates. Any increased operating results from operating and development activities may be offset by the loss of income related to tenant bankruptcies or early lease terminations, and other potential impacts of the slowing economy as well as by property dispositions. As market values decline, we could experience additional impairment losses, decreased sales volume compared to prior years and less attractive pricing for any assets that we do sell, while depressed property values may also present us with attractive buying opportunities., 696108=The following table illustrates the changes in rental revenues, rental expenses and real estate taxes, property net operating income, other income and other expenses for the three months ended March 31, 2009 compared to the three months ended March 31, 2008. Our same store portfolio includes all operating properties that we owned for the entirety of both the current and prior year reporting periods for which the operations had been stabilized. Non-same store operating properties include properties not meeting the same-store criteria and by definition exclude development and redevelopment properties. The same store portfolio as of March 31, 2009 totaled 365 buildings comprised of approximately 50.8 million square feet. A discussion of these changes follows the table (in thousands)., 534254=During the three months ended March 31, 2009 and 2008, we granted approximately 0.2 million shares and 0.1 million shares, respectively, of restricted stock to certain officers and employees at the weighted-average fair market value of $3.40 and $8.65 per share, respectively. The restricted stock was recorded at the fair market value of our common stock on the date of issuance and vests 25% annually over four years. These shares of restricted common stock may not be sold, assigned, transferred, pledged or otherwise disposed of and are subject to a risk of forfeiture prior to the expiration of the applicable vesting period. These shares of restricted common stock have voting rights and rights to receive dividends, and the fair values of these shares are amortized over their respective vesting periods., 655041=As of March 31, 2009, there were no customers that occupied more that 5.0% of our consolidated and unconsolidated operating properties and development properties based on annualized base rent or gross leased square feet. The following list reflects the ten largest customers, based on annualized base rent as of March 31, 2009, that occupy approximately 9.5 million square feet in all consolidated and unconsolidated operating properties, and development properties., 603380=In accordance with SFAS No. 144, we report results of operations from real estate assets that meet the definition of a component of an entity and have been sold, or meet the criteria to be classified as held for sale, as discontinued operations. During the three months ended March 31, 2009, no properties were sold, however, our income from discontinued operations included adjustments related to prior period dispositions. During the year ended December 31, 2008, we sold one development property in our bulk distribution segment comprised of approximately 0.3 million square feet and 15 operating properties, 11 in our bulk distribution segment and four in our light industrial segment, comprised of approximately 2.3 million square feet to third parties. For the three months ended March 31, 2008, income from discontinued operations includes the results of operations of these properties prior to the date of sale. We included all results of these discontinued operations in a separate component of income in our Consolidated Statements of Operations under the heading \u0093Income from discontinued operations.\u0094 This treatment resulted in certain reclassifications of financial statement amounts for the three months ended March 31, 2008. As of March 31, 2009 and 2008, we had no properties classified as held for sale., 522580=We may grant limited partnership interests in our operating partnership called LTIP units. LTIP units, which we grant either as free-standing awards or together with other awards under our long-term incentive plan, are valued by reference to the value of our common stock, and are subject to such conditions and restrictions as our compensation committee may determine, including continued employment or service, computation of financial metrics and/or achievement of pre-established performance goals and objectives. During the three months ended March 31, 2009, a total of 0.4 million LTIP units were granted to certain officers and senior executives, which vest 25% annually over four years and had an estimated total fair value of $1.5 million at the date of grant. During the three months ended March 31, 2008, total of 0.4 million LTIP units were granted to certain officers and senior executives, 0.3 million that vest 25% annually over four years and 0.1 million that vest over five years (25% in year three, 25% in year four and 50% in year five) with a total fair value of $3.2 million at the date of grant as determined by a lattice-binomial option-pricing model based on a Monte Carlo simulations using a volatility factor of 23% and a risk-free interest rate of 2.67%. As of March 31, 2009, 1.5 million LTIP units were outstanding of which 0.1 million were vested., 171697=Consolidated Statements of Cash Flows for the Three Months Ended March 31, 2009 and 2008 (unaudited), 451064=2011, 420201=In April 2009, the FASB issued FSP FAS 157-4, Determining Fair Value When the Volume and Level of Activity for the Asset or Liability Have Significantly Decreased and Identifying Transactions That Are Not Orderly (\u0093FSP 157-4\u0094). FSP 157-4 provides guidance regarding how to determine whether there has been a significant decrease in the volume and level of activity for the asset or liability when compared with normal market activity for the asset or liability. In such situations, an entity may conclude that transactions or quoted prices may not be determinative of fair value, and may adjust the transactions or quoted prices to arrive at the fair value of the asset or liability. FSP 157-4 is effective for interim and annual reporting periods ending after June 15, 2009, with early adoption permitted for periods ending after March 15, 2009, and must be applied prospectively. We adopted FAS 157-4 beginning January 1, 2009 with no material impact on our Consolidated Financial Statements., 774209=During the three months ended March 31, 2009 compared to the same period in 2008, cash provided by operating activities decreased $7.1 million, from $27.2 million to $20.1 million, primarily related to $6.4 million more cash used related to the increase in working capital as of March 31, 2009 compared to March 31, 2008 and by $1.0 million less cash provided by our current period operations, as adjusted for non-cash items, for the three months ended March 31, 2009 compared to the same period in 2008. Working capital, including cash and cash equivalents, decreased $0.7 million during the three months ended March 31, 2008 compared to an increase of $5.5 million during the three months ended March 31, 2009. Cash provided by our current period operations adjusted for non-cash items decreased primarily due to slightly higher operating expenses and general and administrative expenses partially offset by lower cash paid for interest., 778273=In April 2007, we began offering shares of our common stock through our new Dividend Reinvestment and Stock Purchase Plan (the \u0093Plan\u0094). The Plan permits stockholders to acquire additional shares with quarterly dividends and to make additional cash investments to buy shares directly. Shares of common stock may be purchased in the open market, through privately negotiated transactions, or directly from us as newly issued shares of common stock. All shares issued under the Plan were acquired in the open market., 433076=During the three months March 31, 2008, we acquired three shell-complete development properties located in Monterrey, Mexico, comprised of approximately 0.5 million square feet for a total cost of approximately $20.7 million, which includes acquisition costs. These properties were acquired from unrelated third parties using existing cash balances and short-term borrowings., 862135=The net liabilities associated with these derivatives would increase approximately $1.2 million if the market interest rate of the referenced swap index, which was LIBOR in each case, were to decrease 10 basis points based upon the prevailing market rate as of March 31, 2009., 486220=We entered into a joint venture agreement with Dividend Capital Total Realty Trust Inc. (\u0093DCTRT\u0094) TRT-DCT Industrial Joint Venture III, G.P. (\u0093TRT-DCT Venture III\u0094) on September 9, 2008. TRT-DCT Venture III has been funded as follows: (i) an equity contribution from DCTRT to the joint venture (which we estimate to be not less than approximately 90% of the joint venture\u0092s required equity capitalization); (ii) an equity contribution from us to the joint venture (which we estimate to be approximately 10% of the joint venture\u0092s required equity capitalization); and (iii) secured debt financing. Our actual ownership percentage may vary depending on amounts of capital contributed and the timing of contributions and distributions. On March 27, 2009, the venture borrowed $12.4 million of secured debt which bears interest at 7.4% and requires monthly interest and principal payments until the debt matures on March 1, 2016. As of March 31, 2009, TRT-DCT Venture III owned approximately $31.0 million of real estate assets., 166342=As of April 30, 2009, 176,089,112 shares of common stock of DCT Industrial Trust Inc., par value $0.01 per share, were outstanding., 508593=As of March 31, 2009, such derivatives as described in the following table were in place to hedge the variability of cash flows associated with forecasted issuances of debt and $100 million of outstanding variable rate debt (dollar amounts in thousands)., 876271=Date: May 11, 2009, 566161=The following table sets forth the rental revenues and property net operating income of our property type segments in continuing operations for the three months ended March 31, 2009 and 2008 (in thousands):, 482674=Net equity investment balances as of December 31, 2008 include total APB No. 18 impairment losses of $4.7 million., 214150=Common stock, $0.01 par value, 350,000,000 shares authorized, 175,979,295 and 175,141,387 shares issued and outstanding as of March 31, 2009 and December 31, 2008, respectively, 633365=In addition, our current and continuing qualification as a real estate investment trust, or REIT, involves the application of highly technical and complex provisions of the Internal Revenue Code of 1986, or the Code, and depends on our ability to meet the various requirements imposed by the Code through actual operating results, distribution levels and diversity of stock ownership., 775689=During the three months ended March 31, 2009, our cash used in investing activities decreased by $25.8 million compared to the same period in 2008, from $30.7 million to $4.9 million primarily related to fewer investing activities during the three months ended March 31, 2009 compared to the same period in 2008. We spent $23.5 million and $14.7 million less on acquisitions of real estate and investments in unconsolidated joint ventures, respectively and spent $5.0 million less on capital expenditures and development activities. These decreases in investing activities were partially offset by $10.8 million less proceeds from the disposition of real estate investments and lower repayments of notes receivable of $4.8 million during the three months ended March 31, 2009 compared to the same period in 2008., 396217=On January 1, 2008, the Company adopted SFAS No. 157, Fair Value Measurements (\u0093SFAS No. 157\u0094), which defines fair value, establishes a framework for measuring fair value and expands disclosures about fair value measurements. SFAS 157 was initially effective as of January 1, 2008, but in February 2008, the FASB delayed the effective date for applying this standard to nonfinancial assets and nonfinancial liabilities that are recognized or disclosed at fair value in the financial statements on a nonrecurring basis until periods beginning after November 15, 2008. We adopted FAS 157 as of January 1, 2008 for assets and liabilities within its scope and the impact was immaterial to our Consolidated Financial Statements. As of January 1, 2009, nonfinancial assets and nonfinancial liabilities were also required to be measured at fair value. The adoption of these additional provisions did not have a material impact on our Consolidated Financial Statements., 516843=Net unrealized gains of approximately $12.7 million and net unrealized losses of $2.0 million, including the noncontrolling interests\u0092 portion, were recorded in \u0093Accumulated other comprehensive loss\u0094 as a result of the change in fair value of our outstanding hedges during the three months ended March 31, 2009 and 2008, respectively. As of March 31, 2009 and December 31, 2008, the \u0093Accumulated other comprehensive loss\u0094 balance pertaining to the hedges were losses of approximately $14.3 million and $26.6 million, respectively, including the noncontrolling interests\u0092 portion., 434135=During the three months ended March 31, 2008, we sold one operating property comprised of approximately 0.1 million square feet to an unrelated third party for total gross proceeds of approximately $6.1 million, which resulted in a gain of approximately $0.4 million. Additionally, we contributed approximately 47 acres of land in Atlanta to the IDI/DCT Buford, LLC joint venture., 370460=The accompanying unaudited Consolidated Financial Statements have been prepared in accordance with United States generally accepted accounting principles (\u0093GAAP\u0094) and with the instructions to Form 10-Q and Article 10 of Regulation S-X for interim financial information. Accordingly, these statements do not include all of the information and footnotes required by GAAP for complete financial statements. In the opinion of management, the accompanying unaudited Consolidated Financial Statements include all adjustments, consisting only of normal recurring items, necessary for their fair presentation in conformity with GAAP. Interim results are not necessarily indicative of results for a full year. The information included in this Form 10-Q should be read in conjunction with our audited Consolidated Financial Statements as of December 31, 2008 and related notes thereto as filed on Form 10-K on March 2, 2009., 413558=In December 2007, the FASB issued SFAS No. 141(R) which requires the acquiring entity in a business combination to record all assets acquired, liabilities assumed and any noncontrolling interest in the acquired entity at their respective acquisition-date fair values, changes the recognition of assets acquired and liabilities assumed arising from contingencies, changes the recognition and measurement of contingent consideration and requires the expensing of acquisition-related costs as incurred. SFAS No. 141(R) also requires additional disclosure of information surrounding a business combination, such that users of the entity's financial statements can fully understand the nature and financial impact of the business combination. Additionally, the FASB also issued FSP 141(R)-1 in April 2009, which modified the guidance in SFAS No. 141(R) related to contingent assets and contingent liabilities. SFAS No. 141(R), as modified by FSP 141(R)-1, is required to be applied prospectively to business combinations for which the acquisition date is on or after the beginning of the first annual reporting period beginning on or after December 15, 2008. The adoption of SFAS No. 141(R), as modified by FAS 141(R)-1 as of January 1, 2009 did not have a material impact on our Consolidated Financial Statements., 781533=During the three months ended March 31, 2009, our board of directors declared distributions to stockholders totaling approximately $16.8 million, including distributions to OP unitholders. During the same period of 2008, our board of directors declared distributions to stockholders totaling approximately $33.4 million, including distributions to OP unitholders. During the three months ended March 31, 2009, we paid distributions using existing cash balances and cash provided by operations., 488134=There are no lines of credit, side agreements, or any other derivative financial instruments related to, or between, our unconsolidated joint ventures and us, and we believe we have no material exposure to financial guarantees, except as discussed above. As of March 31, 2009, our proportionate share of non-recourse debt associated with unconsolidated joint ventures was $144.9 million, which includes the $70.1 million related to construction financing discussed above., 171094=Consolidated Statement of Equity and Other Comprehensive Loss for the Three Months Ended March 31, 2009 (unaudited), 419400=On April 9, 2009, the FASB issued FASB Staff Position (\u0093FSP\u0094) No. 107-1 and APB 28-1 Interim Disclosures about Fair Value of Financial Instruments (\u0093FSP 107-1 and APB 28-1\u0094). FSP 107-1 and APB 28-1 requires that publicly traded companies include the fair value disclosures required by SFAS No. 107 in their interim financial statements and is effective for interim and annual periods ending after June 15, 2009, with early adoption permitted for periods ending after March 15, 2009, and must be applied prospectively. We adopted FSP 107-1 and APB 28-1 for the interim period beginning January 1, 2009 with no impact on our Consolidated Financial Statements., 518311=Prior to October 10, 2006, our operating partnership offered undivided tenancy-in-common interests (\u0093TIC Interests\u0094) in certain of our properties to accredited investors in a private placement exempt from registration under the Securities Act of 1933, as amended. In October 2006, we discontinued the private placement of TIC Interests. We had leased back the portion of the building sold to the unrelated third-party investors and, in accordance with SFAS No. 98, Accounting for Leases (\u0093SFAS No. 98\u0094), a portion of the rental payments made to such investors under the lease agreements were recognized as \u0093Interest expense\u0094 using the interest method., 375583=Certain items in our Consolidated Financial Statements for 2008 have been reclassified to conform to the 2009 presentation., 658316=DCT Industrial Trust Inc. is a leading industrial real estate company that owns, operates and develops high-quality bulk distribution and light industrial properties in high-volume distribution markets in the U.S. and Mexico. As of March 31, 2009, we consolidated 373 operating properties, six redevelopment properties and 12 development properties. We owned, managed or had under development approximately 75.9 million square feet of assets leased to approximately 850 customers, including 14.6 million square feet managed on behalf of three institutional joint venture partners. As of March 31, 2008, we consolidated 381 operating properties, five redevelopment properties and 15 development properties. Subsequent to March 31, 2008, 14 of the operating properties were sold and results of these operations were reclassified to discontinued operations. Subsequent to March 31, 2008, we acquired three operating properties., 416195=In December 2007, the FASB issued Statement of Financial Accounting Standards No. 160, (\u0093SFAS No. 160), Noncontrolling Interests in Consolidated Financial Statements\u0097An Amendment of ARB No. 51. SFAS No. 160 establishes new accounting and reporting standards for the noncontrolling interest in a subsidiary and requires recognition of gains or losses resulting from a change of control. Ownership changes not resulting in a change of control are treated as equity transactions. SFAS No. 160 was adopted beginning January 1, 2009, prospectively, with no material impact on our Consolidated Financial Statements. The presentation and disclosure requirements SFAS No. 160 were applied retrospectively for all periods presented. The adoption of SFAS No. 160 resulted in a reclassification of noncontrolling interests (formerly known as minority interests) to a separate component of total equity and net income attributable to noncontrolling interest is no longer treated as a reduction to net income but as a reduction from net income in calculating net income available to common stockholders., 449523=Remainder of 2009, 602486=Included in rental revenues and segment net assets as of and for the three months ended March 31, 2009 was approximately $1.4 million and $78.9 million, respectively, attributable to operations in Mexico which commenced during 2007., 852854=Our exposure to market risk includes interest rate fluctuations in connection with our credit facility and other variable rate borrowings and forecasted fixed rate debt issuances, including refinancing of existing fixed rate debt. Interest rate risk may result from many factors, including governmental monetary and tax policies, domestic and international economic and political considerations and other factors that are beyond our control. To manage interest rate risk for variable rate debt and issuances of fixed rate debt, we primarily use treasury locks and forward-starting swaps as part of our cash flow hedging strategy. These derivatives are designed to mitigate the risk of future interest rate increases by providing a fixed interest rate for a limited, pre-determined period of time. During the three months ended March 31, 2009 and 2008, such derivatives were in place to hedge some of the variable cash flows associated with forecasted issuances of debt that are expected to occur during the period from 2009 through 2012, and to mitigate fluctuations in certain variable rate borrowings. We do not use derivatives for trading or speculative purposes and only enter into contracts with major financial institutions based on their credit rating and other factors. As of March 31, 2009, such derivatives as described in the following table were in place to hedge the variability of cash flows associated with forecasted issuances of debt and $100 million of outstanding variable rate debt (dollar amounts in thousands):, 762447=Rental expenses and real estate taxes increased by approximately $0.8 million, or 5%, for the three months ended March 31, 2009 compared to the same period in 2008 primarily related to an increase of $0.4 million in property taxes and $0.2 million in reserves for bad debt and approximately $0.2 million primarily related to repairs and maintenance and property management fees., 766070=We owned approximately 85% of our operating partnership as of March 31, 2009 which increased when compared to approximately 81% as of March 31, 2008 primarily due to the redemption of OP Units (see Note 7 to our Consolidated Financial Statements for additional information)., 515726=On a recurring basis, we measure our derivatives at fair value, which was a gross liability of $9.4 million as of March 31, 2009. The fair value of these derivatives was determined using Level 2 inputs, as described in SFAS No. 157. The effective portion of changes in the fair value of derivatives designated and that qualify as cash flow hedges is recorded in \u0093Accumulated other comprehensive loss\u0094 and is subsequently reclassified into earnings in the period that the hedged forecasted transaction affects earnings. The ineffective portion of the change in fair value of the derivatives is recognized directly in earnings and is recorded as \u0093Interest income and other\u0094 in our Consolidated Statements of Operations. During the three months ended March 31, 2009, we recorded no ineffectiveness. During the three months ended March 31, 2008, we recorded a loss of approximately $0.2 million related to the ineffectiveness due to the change in estimated timing of anticipated debt issuances., 421920=Our consolidated real estate assets consist of operating properties, redevelopment properties, properties under development and properties in pre-development including land held for future development or other purposes. Our real estate assets, presented at historical cost, include the following as of March 31, 2009 and December 31, 2008 (in thousands):, 658096=Summary of the three months ended March 31, 2009 compared to the same period ended March 31, 2008, 519090=During the three months ended March 31, 2008, our operating partnership purchased all remaining TIC Interests in the one remaining property for an aggregate of 1.6 million units of limited partnership interest in our operating partnership (\u0093OP Units\u0094) valued at approximately $14.8 million. During the three months ended March 31, 2008, we incurred approximately $0.1 million of rental payments under various lease agreements with certain of the third-party investors. A portion of such amounts was accounted for as a reduction of the outstanding principal balance of the financing obligations and a portion was accounted for as \u0093Interest expense\u0094 in our Consolidated Statements of Operations. Included in \u0093Interest expense\u0094 was approximately $0.1 million for the three months ended March 31, 2008 of interest expense related to the financing obligation., 763149=Other revenue and other income increased by approximately $3.0 million for the three months ended March 31, 2009 as compared to the same period in 2008, as a result of a $3.9 million increase in equity in earnings on unconsolidated joint ventures primarily due to the SCLA land sale gain (see Note 4 to our Consolidated Financial Statements for additional information), which was partially offset by decreased gains of $0.4 million on dispositions of real estate interests reported in continuing operations and other items., 417439=In March 2008, the FASB issued SFAS No. 161, Disclosures about Derivative Instruments and Hedging Activities (\u0093SFAS No. 161\u0094). SFAS No. 161 requires companies with derivative instruments to disclose information that would enable financial statement users to understand how and why a company uses derivative instruments, how derivative instruments and related hedged items are accounted for under SFAS No. 133, \u0093Accounting for Derivative Instruments and Hedging Activities\u0094 (\u0093SFAS No. 133\u0094), and how derivative instruments and related hedged items affect a company\u0092s financial position, financial performance and cash flows. The new requirements apply to derivative instruments and nonderivative instruments that are designated and qualify as hedging instruments and related hedged items accounted for under SFAS No. 133. SFAS No. 161 is effective for financial statements issued for fiscal years and interim periods beginning after November 15, 2008. We adopted SFAS No. 161 as of January 1, 2009 with no impact on our Consolidated Financial Statements., 169936=Consolidated Balance Sheets as of March 31, 2009 (unaudited) and December 31, 2008, 158695=    For the quarterly period ended March 31, 2009, 532214=As of March 31, 2009, approximately 176.0 million shares of common stock were issued and outstanding. The net proceeds from the prior sales of these securities were transferred to our operating partnership for a number of OP Units equal to the shares of common stock sold in our public and private offerings. Our operating partnership has used these proceeds to fund the acquisition and development of our properties. During the three months ended March 31, 2009, we issued 0.8 million shares of common stock related to the redemption of OP Units (see additional information in Note 7 above) and approximately 33,000 shares of common stock related to vested shares of restricted stock and phantom shares., 539083=The following table sets forth the computation of our basic and diluted earnings per common share for the three months ended March 31, 2009 and 2008 (in thousands, except per share information):, 432507=During the three months March 31, 2009, we acquired two parcels of land located in one market within the United States comprised of 8.9 acres and one market within Mexico, comprised of approximately 3.5 acres for a total cost of approximately $0.6 million, which includes acquisitions costs. These land parcels were acquired from unrelated third parties using existing cash balances and represent land available for expansion adjacent to existing properties., 402104=Although the Company has determined that the majority of the inputs used to value its derivatives fall within Level 2 of the fair value hierarchy, the credit valuation adjustments associated with its derivatives utilize Level 3 inputs, such as estimates of current credit spreads to evaluate the likelihood of default by itself and its counterparties. Prior to March 31, 2009, the Company classified all derivatives in Level 2 of the fair value hierarchy. During the period beginning January 1, 2009 and ending March 31, 2009, credit spreads used in the calculation of the credit valuation adjustment increased such that the credit valuation adjustment was determined to be significant to the overall fair value of its derivative positions thereby changing the classification from Level 2 to Level 3., 410648=We maintain an allowance for estimated losses that may result from the inability of our tenants to make required payments. If a tenant fails to make contractual payments beyond any allowance, we may recognize additional bad debt expense in future periods equal to the net outstanding balances. As of March 31, 2009 and December 31, 2008, our allowance for doubtful accounts was $1.6 million and $0.8 million, respectively., 170506=Consolidated Statements of Operations for the Three Months Ended March 31, 2009 and 2008 (unaudited), 681661=Property net operating income, or property NOI, is defined as rental revenues, including reimbursements, less rental expenses and real estate taxes, which excludes depreciation, amortization, general and administrative expenses and interest expense. We consider property NOI to be an appropriate supplemental performance measure because property NOI reflects the operating performance of our properties and excludes certain items that are not considered to be controllable in connection with the management of the property such as depreciation, amortization, general and administrative expenses and interest expense. However, property NOI should not be viewed as an alternative measure of our financial performance since it excludes expenses which could materially impact our results of operations. Further, our property NOI may not be comparable to that of other real estate companies, as they may use different methodologies for calculating property NOI. Therefore, we believe net income, as defined by GAAP, to be the most appropriate measure to evaluate our overall financial performance. See \u0093Notes to our Consolidated Financial Statements, Note 11 \u0096 Segment Information\u0094 for a reconciliation of our property NOI to our reported \u0093Income (Loss) From Continuing Operations\u0094 for the three months ended March 31, 2009 and 2008., 653397=SCLA \u0096 During 2006, we entered into a joint venture agreement with Stirling Airports International, LLC, or Stirling, an unrelated third party, to be the master developer of up to 4,350 acres in Victorville, California, part of the Inland Empire submarket in Southern California. The development project is located at the former George Air Force Base which closed in 1992 and is now known as Southern California Logistics Airport, or SCLA. We refer to this venture as the SCLA joint venture. During the three months ended March 31, 2009, the venture sold 53 acres of land. As of March 31, 2009, the SCLA joint venture had one building comprised of approximately 1.0 million square feet that was under construction and three buildings that were shell-complete comprised of 0.5 million square feet. As of March 31, 2009, 0.1 million square feet of these buildings had been leased., 456523=We enter into joint ventures primarily for purposes of developing industrial real estate and to establish funds or other commingled investment vehicles with institutional partners. Our investments in these joint ventures are included in \u0093Investments in and advances to unconsolidated joint ventures\u0094 in our Consolidated Balance Sheets. The following describes our unconsolidated joint ventures as of March 31, 2009 and December 31, 2008., 434875=As of March 31, 2009, we had six consolidated development projects comprised of 2.9 million square feet and 12 buildings, of which 10 were bulk distribution properties and two were light industrial, located in Dulles, VA, Cincinnati, OH, Atlanta, GA, Memphis, TN and Orlando, FL. As of March 31, 2009, all of these buildings were shell-complete. For information related to our unconsolidated development joint ventures, please see Note 4., 786789=2009 remaining, 799285=In June 2008, DCT closed a two-year $300 million senior unsecured term loan that can be extended for one year at the Company\u0092s option., 411187=In connection with property acquisitions, we may acquire leases with rental rates above or below the market rental rates. Such differences are recorded as an intangible asset or liability, pursuant to SFAS No. 141, and amortized to \u0093Rental revenues\u0094 over the life of the related leases. The unamortized balances of these assets and liabilities associated with the early termination of leases are fully amortized to their respective revenue and expense line items in our Consolidated Statements of Operations over the shorter of the expected life of such assets and liabilities or the remaining lease term. The total net impact to \u0093Rental revenues\u0094 due to the amortization of above and below market rents, including amounts reported from discontinued operations and accelerated amortization due to early terminations, was a decrease of approximately $0.5 million for the three months ended March 31, 2009, and a decrease of approximately $20,000 for the three months ended March 31, 2008., 867775=There have been no material changes to the risk factors set forth in Item 1A. to Part I of our Form 10-K, as filed on March 2, 2009, except to the extent factual information disclosed elsewhere in this Form 10-Q relates to such risk factors., 861445=As of March 31, 2009, derivatives with a negative fair value of $9.4 million were included in \u0093Other liabilities\u0094 in our Consolidated Balance Sheet. As of December 31, 2008, derivatives with a negative fair value of $21.5 million were included in \u0093Other liabilities\u0094 in our Consolidated Balance Sheets. For the three months ended March 31, 2008, a loss of $0.2 million was recorded as a result of ineffectiveness due to the change in estimated timing of the anticipated debt issuances. No ineffectiveness was recorded during the three months ended March 31, 2009., 521779=As of March 31, 2009, there was a total of 31.5 million OP Units outstanding with a redemption value of approximately $100.0 million based on the closing price of our common stock on March 31, 2009. As of December 31, 2008, there was a total of 32.4 million OP Units outstanding with a redemption value of approximately $164.1 million based on the closing price of our common stock on December 31, 2008. As of March 31, 2009, 29.9 million OP Units were redeemable., 450301=2010, 433778=During the three months ended March 31, 2009, we sold one land parcel comprised of approximately 1.8 acres to an unrelated third party for total gross proceeds of approximately $1.1 million, which resulted in a gain of approximately $0.1 million., 533300=In April 2007, we began offering shares of our common stock through our Dividend Reinvestment and Stock Purchase Plan (the \u0093Plan\u0094). The Plan permits stockholders to acquire additional shares with quarterly dividends and to make additional cash investments to buy shares directly. Shares of common stock may be purchased in the open market, through privately negotiated transactions, or directly from us as newly issued shares of common stock. All shares issued under the Plan were acquired in the open market., 773429=\u0093Cash and cash equivalents\u0094 decreased $3.4 million or 17.5% from December 31, 2008 to March 31, 2009 primarily related to cash distributions to stockholders of $16.7 million and capital expenditures related to real estate assets of $8.3 million partially offset by operating cash flows of $20.1 million. Working capital assets and liabilities, including cash, increased $5.5 million as of March 31, 2009 compared to December 31, 2008 primarily related to a reduction of \u0093Accounts payable and accrued expenses\u0094 of $13.7 million offset by decrease of receivables from tenants of $5.7 million and the decrease in \u0093Cash and cash equivalents\u0094 of $3.4 million., 777490=As of March 31, 2009, approximately 176.0 million shares of common stock were issued and outstanding. The net proceeds from the sales of these securities were transferred to our operating partnership for a number of OP Units equal to the shares of common stock sold in our public and private offerings. Our operating partnership has used these proceeds to fund the acquisition and development of our properties., 764816=Income from discontinued operations decreased $1.2 million as no properties were sold or classified as held for sale as of March 31, 2009. We sold 0.1 million square feet during the three months ended March 31, 2008, and the results of these operations and the 14 properties that were sold subsequent to March 31, 2008 are reflected in discontinued operations until the date of sale. Discontinued operations activity for the three months ended March 31, 2009 reflects adjustments to prior period dispositions., 826594=As of March 31, 2009 and December 31, 2008, respectively, we had no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to investors, other than items discussed herein., 483425=During 2006, we entered into a joint venture agreement with Stirling Airports International, LLC, or Stirling, an unrelated third party, to be the master developer of up to 4,350 acres in Victorville, California, part of the Inland Empire submarket in Southern California. The development project is located at the former George Air Force Base which closed in 1992 and is now known as Southern California Logistics Airport (\u0093SCLA\u0094). We refer to this joint venture as the SCLA joint venture. Stirling entered into two master development agreements which gave it certain rights to be the exclusive developer of the SCLA development project through 2019 (including extensions) and assigned these rights to the SCLA joint venture upon the closing of the venture. While our exact share of the equity interests in the SCLA joint venture will depend on the amount of capital we contribute and the timing of contributions and distributions, the SCLA joint venture contemplates an equal sharing between us and Stirling of residual profits and cash flows after all priority distributions., 412296=Early lease termination fees are recorded in \u0093Rental revenues\u0094 on a straight-line basis over the remaining contractual lease term or upon collection if collection is not assured. During the three months ended March 31, 2009 and 2008, early termination fees increased revenues by $1.4 million and $0.1 million, respectively., 520803=As of March 31, 2009 and December 31, 2008, we owned approximately 85% and 84%, respectively, of the outstanding equity interests of our operating partnership, with the remaining equity interest in our operating partnership owned by third-party investors and Dividend Capital Advisors Group LLC (\u0093DCAG\u0094). Subject to certain agreements, OP Units are redeemable at the option of the unitholder after a fixed period. We have the option of redeeming the OP Units with cash or with shares of our common stock on a one-for-one basis, subject to adjustment. During the three months ended March 31, 2009, 0.9 million OP Units were redeemed for approximately $0.3 million in cash and 0.8 million shares of our common stock. During the three months ended March 31, 2008, approximately 0.1 million OP Units were redeemed for $1.1 million in cash., 771993=Although the credit markets for the real estate sector continue to be extremely constrained as a result of the liquidity constraints of major lending institutions and other traditional sources of debt capital, we believe that our sources of capital are adequate to meet our near-term liquidity requirements. We expect these resources will be adequate to fund our operating activities, debt service obligations and equityholder distributions and will be sufficient to fund our ongoing development. We have no major debt maturities until 2010 when a $300 million senior unsecured term loan comes due, which can be extended at our option for one year such that we would not have any significant debt maturities until 2011. As of March 31, 2009, we had purchase obligations of $23.0 million and our estimated construction costs to complete current development projects was approximately $53.9 million of which only $7.8 million is legally committed. As of March 31, 2009 we had $284.8 million available under our unsecured credit facility, which expires in December 2010, and approximately $16.2 million in cash and cash equivalents., 784376=During the three months ended March 31, 2009 and 2008, our debt service, including principal and interest, totaled $16.0 million and $42.0 million, respectively. The following table sets forth the scheduled maturities of our debt, excluding unamortized premiums, as of March 31, 2009 (amounts in thousands)., 163021=Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days.    Yes [X] No [ ], 809535=The following table reflects our contractual obligations as of March 31, 2009 specifically our obligations under long-term debt agreements, operating and ground lease agreements and purchase obligations (amounts in thousands):, 634833=DCT Industrial Trust Inc. is a leading industrial real estate company that owns, operates and develops high-quality bulk distribution and light industrial properties in high-volume distribution markets in the U.S. and Mexico. As of March 31, 2009, the Company owned, managed or had under development approximately 75.9 million square feet of assets leased to approximately 850 customers, including 14.6 million square feet managed on behalf of three institutional joint venture partners, and had 7.7 million square feet under development. Our portfolio primarily consists of high-quality, generic bulk distribution warehouses and light industrial properties. We own our properties through our operating partnership and its subsidiaries. DCT Industrial Trust Inc. is the sole general partner and owned approximately 85% of the outstanding equity interests of our operating partnership as of March 31, 2009. We acquired our first property in June 2003 and our portfolio consists of 373 consolidated operating properties as of March 31, 2009., 780023=As of March 31, 2009, we had three separate forward purchase commitments with Nexxus Desarrollos Industriales (\u0093Nexxus\u0094) to acquire three newly constructed buildings and had three related letters of credit totaling $15.2 million outstanding. The three buildings are located on separate development sites in three submarkets in the metropolitan area of Monterrey, Nuevo Leon, Mexico. The forward purchase commitments obligate us to acquire each of the facilities from Nexxus upon completion, subject to a variety of conditions related to, among other things, the buildings complying with approved drawings and specifications. Closing on the three buildings is expected to occur in late 2009 or early 2010., 577050=The following table is a reconciliation of our property NOI to our reported \u0093Income (Loss) From Continuing Operations\u0094 for the three months ended March 31, 2009 and 2008 (in thousands):, 782763=As of March 31, 2009, our outstanding indebtedness of $1.2 billion consisted of mortgage notes and senior unsecured notes and an unsecured revolving credit facility, excluding $144.9 million representing our proportionate share of debt associated with unconsolidated joint ventures. As of December 31, 2008, our outstanding indebtedness consisted of mortgage debt, unsecured notes and an unsecured revolving credit facility and totaled approximately $1.2 billion, excluding $141.5 million representing our proportionate share of debt associated with unconsolidated joint ventures. As of March 31, 2009 and December 31, 2008, the historical cost of our consolidated properties was approximately $2.9 billion and the historical cost of all properties securing our mortgage debt was approximately $1.2 billion. Our debt has various covenants with which we were in compliance as of March 31, 2009 and December 31, 2008., 604846=The following is a summary of the components of \u0093Income from discontinued operations\u0094 for the three months ended March 31, 2009 and 2008 (in thousands):, 484609=During the three months ended March 31, 2009, the SCLA joint venture sold 53 acres of land. As of March 31, 2009, the SCLA joint venture had one building comprised of approximately 1.0 million square feet that was under construction, three buildings that were shell-complete comprised of 0.5 million square feet and 0.5 million square feet of operating properties. As of March 31, 2009, 0.1 million square feet of the shell-complete buildings had been leased. As of March 31, 2009, the SCLA joint venture owned $91.1 million in real estate assets with $53.9 million in debt., 282568=Balance at December 31, 2008, 799603=To manage the interest rate risk associated with forecasted refinancing of our fixed-rate debt, we have primarily used forward-starting swaps as part of our cash flow hedging strategy. These derivatives are designed to mitigate the risk of future interest rate fluctuations by providing a future fixed interest rate for a limited, pre-determined period of time. As of March 31, 2009, such derivatives as described in the following table were in place to hedge the variability of cash flows associated with forecasted issuances of debt and $100 million of variable rate debt (dollar amounts in thousands)., 507413=To manage interest rate risk for variable rate debt and issuances of fixed rate debt, we primarily use treasury locks, forward-starting swaps and interest rate swaps as part of our cash flow hedging strategy. These derivatives are designed to mitigate the risk of future interest rate increases by providing a fixed interest rate for a limited, pre-determined period of time. During 2009, such derivatives have been used to hedge the variability in existing and future interest expense associated with existing variable rate borrowings and forecasted issuances of debt, which may include the issuances of new debt, as well as refinancings of existing debt upon maturity., 418663=In June 2008, the FASB issued EITF 03-6-1, Participating Securities and the Two Class Method under FASB Statement No. 128 (\u0093EITF 03-6-1\u0094). EITF 03-6-1 requires that unvested share-based payment awards that contain non-forfeitable rights to dividends or dividend equivalents are participating securities as defined in EITF 03-6, Participating Securities and the Two Class Method under FASB Statement No. 128, and therefore, should be included in computing earnings per share using the two-class method. We adopted EITF 03-6-1 beginning January 1, 2009 with no material impact on our earnings per share., 162705=(303) 597-2400, 536599=During 2008, we renewed our transitional services agreement with Overhead Services, Inc., formerly DC Services, LLC, (\u0093Overhead Services\u0094), an affiliate of DCAG for one year, whereby we received enumerated services, including IT services, human resources, payroll and accounts payable services for a monthly fee of approximately $72,000. Overhead Services has continued to provide us shared services in 2009 and, during the three months ended March 31, 2009, we entered into a shared services agreement with Overhead Services whereby Overhead Services agreed to provide us shared services during 2009 for a monthly fee of approximately $50,000 starting January 2009., 680639=Includes 19 operating properties held for contribution as of March 31, 2008, which are included in continuing operations as they do not meet the criteria to be classified as discontinued operations, in accordance with SFAS No. 144., 659377=The following table illustrates the changes in our consolidated operating properties in continuing operations by segment as of, and for the three months ended March 31, 2009 compared to the same period in 2008 (dollar amounts in thousands).}",
    "textBeforeTable": "  The following table reflects the standard depreciable lives typically used to compute depreciation and amortization. However, such depreciable lives may be different based on the estimated useful life of such assets or liabilities. The carrying value of assets sold or retired and the related accumulated depreciation and/or amortization is removed from the accounts and the resulting gain or loss, if necessary, is reflected in our Consolidated Statements of Operations during the period in which such sale or retirement occurs. Depreciation and amortization are computed on a straight-line basis over the estimated useful lives of the related assets or liabilities. Our ability to assess the useful lives of our real estate assets accurately is critical to the determination of the appropriate amount of depreciation expense recorded and the carrying values of the underlying assets. Any change to the estimated depreciable lives of these assets would have an impact on the depreciation expense we recognize. Depreciation and Useful Lives of Real Estate Assets Real estate, including land, building, building and land improvements, tenant improvements and leasing costs and intangible lease assets and liabilities are stated at historical cost less accumulated depreciation and amortization, unless circumstances indicate that cost cannot be recovered, in which case, the carrying value of the property is reduced to estimated fair value.",
    "textAfterTable": "Depreciation is not recorded on buildings currently held for sale or contribution, in pre-development, being developed or redeveloped until the building is substantially completed and ready for its intended use, normally not later than one year from cessation of major construction activity.   7 Table of Contents Impairment of Long-Lived Assets Long-lived assets to be held and used are carried at cost and evaluated for impairment in accordance with SFAS No. 144. SFAS No. 144 provides that such an evaluation should be performed when events or changes in circumstances indicate that the carrying amounts of these assets may not be fully recoverable. Examples of such changes in circumstances include the point at which we deem the long-lived asset to be held for sale or a building remains vacant significantly longer than expected. For long-lived assets that we intend to hold long-term, the recoverability is based on the estimated future undiscounted cash flows. If the asset is not supported on an undiscounted cash flow basis, the amount of impairment is measured as the difference between the carrying value and the fair value of the impaired asset. Long lived assets classified as held for sale are measured at the lower of their carrying amount or fair value less costs to sell.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}