{
    "relation": [
        [
            "Command",
            "authentication (dial peer)",
            "authentication (SIP UA)",
            "credentials (SIP UA)",
            "registrar",
            "voice-class sip localhost"
        ],
        [
            "Description",
            "Enables SIP digest authentication on an individual dial peer.",
            "Enables SIP digest authentication.",
            "Configures a Cisco UBE to send a SIP registration message when in the UP state.",
            "Enables Cisco IOS SIP gateways to register E.164 numbers on behalf of FXS, EFXS, and SCCP phones with an external SIP proxy or SIP registrar.",
            "Configures settings for substituting a DNS localhost name in place of the physical IP address in the From, Call-ID, and Remote-Party-ID headers of outgoing messages on an individual dial peer, overriding the global setting."
        ]
    ],
    "pageTitle": "Cisco IOS Voice Command Reference - K through R - L [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/voice/vcr3/vcr3-cr-book/vcr-l1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00158-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 372014855,
    "recordOffset": 371982834,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{56571=The lmr ip-vad command applies to a voice interface card (VIC) in a Cisco 2800 series integrated services router if the VIC is one of the following types of ear and mouth (E&M) interfaces:, 84854=(Optional) Port number of the local border element, which is used for exchanging Annex G messages. Default is 2099., 137150=This command was introduced on the following platforms: Cisco 2500 series, Cisco 3600 series, and Cisco MC3810., 111916=This command was introduced as a controller configuration command for the Cisco 2600 series and Cisco 3600 series., 112272=This command was modified as a controller configuration command for the Cisco 2600 series., 57314=The lmr ip-vad command configures the LMR DSP to report voice activity detection (VAD) status change events (rather than voice packet arrival events) for a supported voice interface in a Cisco 2800 series integrated services router., 174375=This command was introduced on the following platforms: Cisco 2500 series, Cisco 2600 series, Cisco 3600 series, Cisco 7200 series, and Cisco MC3810., 88554=The following example sets the IP address and port that the BE should use. (Note that this example uses a nonstandard port number. If you do not want to use a nonstandard port number, use the default value of 2099.), 165053=This command was introduced on the Cisco 2500 series and Cisco 3600 series., 53375=To configure the Land Mobile Radio (LMR) digital signal processor (DSP) on a Cisco 2800 series integrated services router to report a voice packet arrival event only if the packet contains voice energy, use the lmr ip-vad command in voice-port configuration mode. To disable this feature, use the no form of this command., 111181=This command was introduced as an ATM interface configuration command for the Cisco 2600 series and Cisco 3600 series., 168227=If this was your only site that had any gateways in it and you wanted your other sites to route all calls that require gateways to this gatekeeper, you can undo the lrq reject-unknown-prefix command by simply using the no lrq reject-unknown-prefix command.Now when the gatekeeper receives an LRQ message for the address 12125551234, it attempts to find an appropriate gateway in either one of the zones gk408 or gk415 to service the call., 141782=When an endpoint or gateway in zone gk-west makes a call to 12125551234, gk-west sends an LRQ message for that E.164 address to gk-directory, which forwards the message to gk-east. Gatekeeper gk-east responds directly to gk-west., 85312=Port number: 2099, 154760=This command was introduced on the following platforms: Cisco 2500 series, Cisco 2600 series, Cisco 3600 series, Cisco 3700 series, Cisco 7200 series, and Cisco 7400 series.}",
    "textBeforeTable": "Syntax Description factor weight loopback-source source ip-address } name | address { hostname link no factor weight loopback-source source ip-address } name | address { hostname link To enable a Redundant Link Manager (RLM) link, use the link command in RLM configuration mode. To disable this function, use the no form of this command. link (RLM) lrq timeout seq delay lrq timeout blast window lrq reject-unknown-prefix lrq reject-unknown-circuit lrq reject-resource-low lrq lrj immediate-advance lrq forward-queries lrq e164 early-lookup loss-plan loop-detect loopback (controller) localhost local load-balance lmr m-lead lmr led-on lmr ip-vad lmr e-lead lmr duplex half listen-port (SIP) link (RLM) L lrq timeout seq delay lrq timeout blast window lrq reject-unknown-prefix lrq reject-unknown-circuit lrq reject-resource-low lrq lrj",
    "textAfterTable": "Command Modes RLM configuration Command History Release Modification 11.3(7) This command was introduced. Usage Guidelines This command is a preference-weighted multiple entries command. Within the same server, the link preference is specified in weighting. Examples The following example specifies the RLM group (network access server), device name, and link addresses and their weighting preferences:  rlm group 1 server r1-server link address 10.1.4.1 source Loopback1 weight 4 link address 10.1.4.2 source Loopback2 weight 3 listen-port (SIP) To manually change the defined Session Initiation Protocol (SIP) listen port for UDP/TCP/TLS calls, use the listen-portcommand in SIP configuration mode. To reset the UDP/TCP/TLS port to the default value, use the no form of this command. listen-port { secure | non-secure } port-number no listen-port non-secure",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}