{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "84.41",
            "96.45",
            "137.77",
            "141.00"
        ],
        [
            "NSE",
            "84.39",
            "96.46",
            "137.81",
            "141.03"
        ]
    ],
    "pageTitle": "Jindal Steel & Power Stock Price, Share Price, Live BSE/NSE, Jindal Steel & Power Bids Offers. Buy/Sell Jindal Steel & Power news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/steel-sponge-iron/jindalsteelpower/JSP",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00334-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 597482679,
    "recordOffset": 597433542,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{213283=Jindal Steel is in the Steel - Sponge Iron sector. The current market capitalisation stands at Rs 6,870.93 crore. The company management includes Savitri Jindal - Chairman Emeritus, Naveen Jindal - Chairman, Ravi Uppal - Managing Director & Group CEO, Dinesh Kumar Saraogi - Whole Time Director, Ratan Jindal - Director, Shallu Jindal - Director, R V Shahi - Independent Director, A K Purwar - Independent Director, Arun Kumar - Independent Director, Haigreve Khaitan - Independent Director, Hardip Singh Wirk - Independent Director, Sudershan Kumar Garg - Independent Director, Rajiv Sharma - Nominee Director, Ratan Jindal - Director, Savitri Jindal - Chairman Emeritus, Naveen Jindal - Chairman, V R Sharma - Deputy Managing Director, Ravi Uppal - Managing Director & CEO, Ajit Ingle - Nominee Director. It is listed on the BSE with a BSE Code of 532286 and the NSE with an NSE Code of JINDALSTEL. Its Registered office is at O.P. Jindal Marg , Hissar,Haryana - 125005. Their Registrars are Alankit Assignment Ltd., 133417=28 July 2015, 134635=JSWSteel Jul Fut, 133928=UnitedBrewerie Jul Fut, 211975=Zensar Technologies Recommended on Mar 24th 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}