{
    "relation": [
        [
            "Track Name",
            "Man of Time",
            "Pictures",
            "Hard-Boiled Babe",
            "Belfast",
            "Shiny Dream",
            "Coming From Darkness",
            "I Never Called You A Dream",
            "Into The Dark",
            "Future Is Now"
        ],
        [
            "Artist",
            "KaS Product",
            "Asylum Party",
            "Lizzy Mercier Descloux",
            "Richard Pinhas",
            "Norma Loy",
            "Trisomie 21",
            "Twilight Ritual",
            "Siglo XX",
            "Nemo"
        ],
        [
            "Album",
            "Try Out",
            "Borderline",
            "Press Color",
            "L'Ethique",
            "Psychic Altercation",
            "The First Songs Vol. II",
            "Rituals",
            "Antler Tracks II",
            "Past and Future"
        ]
    ],
    "pageTitle": "Ask For Wild Bob | KVRX",
    "title": "",
    "url": "http://www.kvrx.org/schedule/programs/6317",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00066-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 565341363,
    "recordOffset": 565319558,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "June 13, 2015 Show Shows Each week, Ask For Wild Bob pays attention to a specific far-flung location and time, examining a (potentially unpopular) musical trend and its context in local and world history. What was South Africa's hair-metal scene like? Could East Europeans rap in the late 90's? Does India produce smooth modern R&B? What were Russians doing with synthesizers at the end of the Cold War? Influential or not, a musician's work carries the historically significant role of representing their respective culture. Trot the globe and stay unstuck in time with DJ Swanky, who encourages you to keep asking around for Wild Bob even though Cody, Wyoming, is nowhere on the show's horizon. Next show: August 1, 2015 Tuesdays at 10:16 AM Ask For Wild Bob DJ Swanky Host // ]]> --> OA_show('OpenX - Button B2'); OA_show('OpenX - Button B1');",
    "textAfterTable": "Os Mutantes Tropicália: ou Panis et Circencis Caminhante Noturno Os Mutantes Mutantes Quero Sambar Meu Bem Tom Ze Grande Liquidação The Rain, Park and Other Things Rogério Duprat A Banda Tropicalista do Duprat Divino, Maravilhoso Gal Costa Gal Costa Charles Jr. Jorge Ben Força Bruta December 2, 2014 Show Track Name Artist Album Pre-Tortoise Dream Music, Pt. II La Monte Young and the Theater Of Eternal Music Terry Riley's \"In C\" Shanghai Film Orchestra December 2, 2014 Show Track Name Artist Album Pre-Tortoise Dream Music, Pt. II La Monte Young and the Theater Of Eternal Music Terry Riley's In C Shanghai Film Orchestra November 25, 2014 Show Track Name Artist Album Stria John Chowning Mortuos Plango, Vivos Voco Jonathan Harvey Spiri Franco Donatoni",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}