{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3",
            "Step 4"
        ],
        [
            "Command or Action",
            "configure Example: RP/0/RSP0/CPU0:router# configure",
            "interface type number Example: RP/0/RSP0/CPU0:router(config)# interface gigabitEthernet 0/0/0/0 RP/0/RSP0/CPU0:router(config-if)#",
            "flow [ipv4 | ipv6 | mpls] monitor monitor_map sampler sampler_map {egress | ingress} Example: RP/0/RSP0/CPU0:router(config-if)# flow ipv4 monitor fmm sampler fsm egress",
            "Use the commit or end command."
        ],
        [
            "Purpose",
            "Enters global configuration mode.",
            "Enters interface configuration mode.",
            "Associates a monitor map and a sampler map with an interface. Enter ipv4 to enable IPV4 NetFlow on the specified interface. Enter ipv6 to enable IPV6 NetFlow on the specified interface. Enter mpls to enable MPLS-aware NetFlow on the specified interface.",
            "commit—Saves the configuration changes and remains within the configuration session. end—Prompts user to take one of these actions: Yes— Saves configuration changes and exits the configuration session. No—Exits the configuration session without committing the configuration changes. Cancel—Remains in the configuration session, without committing the configuration changes."
        ]
    ],
    "pageTitle": "Cisco ASR 9000 Series Aggregation Services Router Netflow Configuration Guide, Release 4.3.x - Configuring NetFlow [Cisco ASR 9000 Series Aggregation Services Routers] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/asr9000/software/asr9k_r4-3/netflow/configuration/guide/b_netflow_cg43xasr/b_netflow_cg43asr_chapter_010.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00019-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 373391527,
    "recordOffset": 373357560,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{166322=This example shows how to create a new flow exporter map called “fem1,” which uses the version 9 (V9) export format for the NetFlow export packets. The data template flow-set is inserted into the V9 export packets once every 10 minutes, and the options sampler table flow-set is inserted into the V9 export packet. The export packets are sent to the flow collector destination 10.1.1.1, where the source address is identical to the interface IP address of Loopback 0. The UDP destination port is 1024, and the DSCP value is 10:, 52838=Default is 1800 seconds., 81872=The default timeout value for the update flow cache is 1800 seconds., 141236=11.    ipv4 address 11.11.11.11 255.255.255.0, 106777=(Optional) Configures the export timeout value for the interface table or the sampler table. Replace seconds with the export timeout value, in the range from 1 through 604800 seconds. The default is 1800 seconds for both the interface table and the sample table., 164424=This example shows how to create a new flow exporter map called “fem1,” which uses the version 9 (V9) export format for NetFlow export packets. The data template flow-set is inserted into the V9 export packets once every 10 minutes, and the options interface table flow-set is inserted into the V9 export packet. The export packets are sent to the flow collector destination 10.1.1.1, where the source address is identical to the interface IP address of Loopback 0. The UDP destination port is 1024, and the DSCP value is 10:, 159632=Configurable Sampling Rate 1:1 ~ 1: 65535, 51087=(Optional) Specifies the destination port for UDP packets. Replace port with the destination UDP port value, in the range from 1024 through 65535., 81607=The default timeout value for the active flow cache is 1800 seconds., 19898=The VRF table is exported at intervals specified by the optional timeout keyword that can be configured manually. The default value is 1800 seconds.}",
    "textBeforeTable": "DETAILED STEPS 13.    show flow exporter-map map_name 12.    exit 11.    exit 10.    Use the commit or end command. 9.    template [data | options] timeout seconds 8.    options {interface-table | sampler-table | vrf-table} [timeout seconds] 7.    version v9 6.    transport udp port 5.    source type interface-path-id 4.    dscp dscp_value 3.    destination hostname_or_IP_address 2.    flow exporter-map map_name 1.    configure SUMMARY STEPS The steps that follow describe how to create and configure an exporter map and enable exporting of the sampler table or the interface table. Cisco IOS XR Software supports the configuration of a single collector only in the exporter map. Note Configure an exporter map and apply it to the monitor map with the flow monitor-map map_name exporter map_name command. You can configure the exporter map prior to configuring the monitor map,",
    "textAfterTable": "transport udp port Example:  RP/0/RSP0/CPU0:router(config-fem)# transport udp 9991   (Optional) Specifies the destination port for UDP packets. Replace port with the destination UDP port value, in the range from 1024 through 65535.   Step 7 version v9 Example:  RP/0/RSP0/CPU0:router(config-fem-ver)# version v9   (Optional) Enters flow exporter map version configuration submode.   Step 8 options {interface-table | sampler-table | vrf-table} [timeout seconds] Example:  RP/0/RSP0/CPU0:router(config-fem-ver)# options sampler-table timeout 2000   (Optional) Configures the export timeout value for the sampler table. Replace seconds with the export timeout value, in the range from 1 through 604800 seconds. Default is 1800 seconds.   Step 9 template [data | options] timeout seconds Example:  RP/0/RSP0/CPU0:router(config-fem-ver)# template data timeout 10000   (Optional) Configures the export period for data packets. Replace seconds with the export timeout value, in the range from 1 through 604800 seconds.   Step 10",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}