{
    "relation": [
        [
            "Patent application number",
            "20080262110",
            "20090221723",
            "20090261587",
            "20090299795",
            "20100000153"
        ],
        [
            "Description",
            "HYDROGENATING PRE-REFORMER IN SYNTHESIS GAS PRODUCTION PROCESSES - A production process includes combining a first feed stream and a second feed stream to produce, in a pre-reforming reactor, a first product stream comprising CH",
            "FISCHER-TROSPCH AND OXYGENATE SYNTHESIS CATALYST ACTIVATION/REGENERATION IN A MICRO SCALE PROCESS - Processes for activating and/or regenerating Fischer-Tropsch and/or oxygenate synthesis catalysts include the transportation of a modular, portable catalyst activation and/or regeneration unit to Fischer-Tropsch and/or oxygenate production units. An alternative process for activating and/or regenerating Fischer-Tropsch and/or oxygenate synthesis catalysts includes activating and/or regenerating the catalyst in a production unit at a catalyst treatment facility. An alternative process for activating and/or regenerating Fischer-Tropsch and/or oxygenate synthesis catalysts includes activating and/or regenerating the catalyst in a synthesis reactor at a catalyst treatment facility.",
            "MICRO SCALE FISCHER-TROPSCH AND OXYGENATE SYNTHESIS PROCESS STARTUP UNIT - A mobile system for providing start-up electrical power to a micro scale liquid hydrocarbon and/or oxygenate synthesis plant is provided including a portable gas or liquid fueled electrical generator, a steam turbine, a plant generator mechanically coupled to the steam turbine, a plant power load; and means for synchronizing electrical power generated by the portable electrical generator with electrical power generated by the plant generator is provided. Also provided is a process for synchronizing electrical power generated by the portable electrical generator with electrical power generated by the plant generator.",
            "TRACKING FEEDSTOCK PRODUCTION WITH MICRO SCALE GAS-TO-LIQUID UNITS - A method of tracking production from an NG source that includes the steps of providing one or more micro-scale GTL units, feeding NG from the source to the micro-scale GTL units, operating the micro-scale GTL units and adjusting the number of micro-scale GTL units employed to track or match the production from the source is provided. In some aspects of the invention, the micro-scale GTL unit includes both syngas manufacture and liquid product synthesis. The liquid product synthesis step may produce methanol, mixed higher carbon number alcohols, dimethyl ether, Fischer-Tropsch liquids, and/or any combination of these products.",
            "REMOTE MICRO-SCALE GTL PRODUCTS FOR USES IN OIL- AND GAS-FIELD AND PIPELINE APPLICATIONS - A method of operating one or more production facilities located at a remote natural gas source is provided including providing one or more micro-scale GTL systems to the remote NG source; supplying natural gas feedstock from the remote source to the micro-scale GTL systems; operating the micro-scale GTL systems to produce a product stream; and utilizing the product stream in the production facilities located at the remote natural gas source. Also provided is a method of operating one or more production facilities located at a remote NG source that includes supplying a product stream to a central processing unit within the remote location to produce a fuel or chemical product."
        ],
        [
            "Published",
            "10-23-2008",
            "09-03-2009",
            "10-22-2009",
            "12-03-2009",
            "01-07-2010"
        ]
    ],
    "pageTitle": "Stephen C. - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/stephen-c-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00055-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 444283751,
    "recordOffset": 444242455,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Stephen C. Leviness, Tulsa, OK US 03-08-2012 MULTIMERS OF S. SOLFATARICUS SINGLE-STRANDED DNA-BINDING PROTEIN AND METHODS OF USE THEREOF - The invention provides multimers of 20120058478 07-21-2011 BIOSENSOR FOR DETECTION AND VISUALISATION OF SINGLE-STRANDED DNA - A modified protein of the single strand DNA-binding domain, SSB family comprising a detectable label is disclosed. The label has detectable characteristics which alter on binding single stranded DNA. The protein is thus useful in an assay for single stranded DNA. 20110177501 Published Description Patent application number Stephen C. Kowalczykowski, Davis, CA US 04-02-2009 METHOD AND SYSTEM FOR ANALYZING FINANCIAL DATA TO DETERMINE THE COST OF FRAUD - A system for analyzing financial data to determine the cost of fraud related to financial presentation devices that are presentable to providers of goods or services is provided. A fraud assessment module executable by a processor receives sales data and operating cost data both related to financial presentation devices and determines a direct fraud loss and fraud operating cost based on the received data. 20090089122 11-20-2008 SYSTEM AND METHOD FOR PROVIDING REFERENCE COST OF FRAUD DATA RELATED TO FINANCIAL PRESENTATION DEVICES THAT ARE PRESENTABLE TO PROVIDERS OF GOODS OR SERVICES - A system for providing industry-wide reference cost of fraud data related to financial presentation devices that are presentable to providers of goods and services is provided. A fraud assessment module executable by a",
    "textAfterTable": "Patent applications by Stephen C. Leviness, Tulsa, OK US Stephen C. Lubard, Woodland Hills, CA US Patent application number Description Published 20100002222 LIDAR WITH STREAK-TUBE IMAGING, INCLUDING HAZARD DETECTION IN MARINE APPLICATIONS; RELATED OPTICS - The system and method relate to detection of objects that are submerged, or partially submerged (e.g. floating), relative to a water surface. One aspect of the invention emits LIDAR fan-beam pulses and analyzes return-pulse portions to determine water-surface orientations and derive submerged-object images corrected for refractive distortion. Another defines simulated images of submerged objects as seen through waves in a water surface, prepares an algorithm for applying a three-dimensional image of the water surface in refractive correction of LIDAR imaging through waves—and also models application of the algorithm to the images, and finally specifies the LIDAR-system optics. Yet another emits nearly horizontal pulses to illuminate small exposed objects at tens of kilometers, detects reflected portions and images successive such portions with a streak-tube subsystem. Still others make special provisions for airborne objects. 01-07-2010 20130125806 Long-range UUVs - In one aspect, the invention is a vehicle working in ambient-pressure liquid or gas medium; in a second, it is a fuel tank for",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}