{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There is a varied selection to choose from for everyday dining, including the Percival Dining Room. You can enjoy a 5 star meal for only a few dollars! There is also a full bakery!",
            "I received all the assistance I needed!",
            "I would definitely recommend talking with a counselor to get started especially if your planning on attending a specified program. This will help eliminate taking unnecessary classes for your degree. And one of the most important tasks, is getting all of your FAFSA paperwork filled out in a timely manner.",
            "I rate this college as Top Notch I love attending South Puget Sound Community College. I am currently in the Culinary Arts Program. This has been one of my greatest experiences."
        ]
    ],
    "pageTitle": "South Puget Sound Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/South-Puget-Sound-Community-College/reviews?_escaped_fragment_=/show/10180",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00225-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893450791,
    "recordOffset": 893407248,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{190678=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/15/2010 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 47 Kate from Olympia, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Am learning a lot This is my 4th quarter at SPSCC and I think the majority of the classes I have taken are really interesting and informative. The professors are very intelligent and know a lot about their subject. The only down-side is when you get a professor who just writes notes on the board which you copy and study for later. This is not teaching! Luckily, this has only happened to me once! Overall, I feel much more informed on the touch subjects the professors are teaching. Login to rate or flag the reviews Hannah from Olympia, WA 02/26/2011 Reviewer is A past student here. 4 out of 4 people found this review useful. 2 of 47 Categories Comments Great for these types of students I recommend SPSCC to anyone. Whether you're a junior in high school, just graduated from high school, or continuing your education after 30 years out of the education system, SPSCC is great at plugging you in and making you fit. They have wonderful resources to help you study",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}