{
    "relation": [
        [
            "Symbol",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "Component",
            "0.1uF",
            "0.33uF",
            "680uF (50V aluminium electrolytic)",
            "1N5822 (schottky diode 3A)",
            "100uH, 3A",
            "2.2kΩ 1/4W resistor",
            "\"for LM2577-adj IC\" 20kΩ multi-turn variable resistor, set to ratio to R2=2kΩ, R1=18kΩ for voltage output of 12Vdc before soldering."
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "DC-DC converter using LM2576",
    "title": "",
    "url": "http://www.siongboon.com/projects/2005-08-07_lm2576_dc-dc_converter/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00254-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 706929507,
    "recordOffset": 706892900,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1300=using LM2576, LM2575, LM2575, LM2576, LM2596, LM2678, LM22678, LM22675, and more.}",
    "TableContextTimeStampAfterTable": "{109015=68uH, 3A  <for LM2596-12>, 121356=LM22675 datasheet, 131869=LM22678 datasheet, 31327=It has been some time since I learn to use LM2576. The circuitry is able to handle a higher current at 3A 5V output. This translate to a higher cost and circuit size, since all component must be able to handle that high power capacity. These component include the LM2576, inductor and the diode. Since most electronics kit requires less than 1A power supply, it is wise learning how to apply a low power dc-dc regulator like LM2575. Cost can be reduce by 50%., 102449=LM2594 (0.5A), 110711=- LM2678-12 (12Vdc output), 225491=Keyword: Buck Regulator, voltage regulator, switching mode power supply, High efficiency, voltage supply, dc-dc converter, LM2576 LM2575 IC, regulated 5Vdc output, Shottky diode, 100uH, 330uH inductor, Low cost, 1A 3A., 73421=- LM2825-ADJ (1.23Vdc to 37Vdc output), 31794=There is one day that I happen to come across this IC LM2575 while searching high and low for LM2576. LM2576 is actually quite difficult to find. There is only 2 shop I know of, but I have rule out one shop because they are selling a faulty batch of LM2576 IC. LM2575 seems very common from shops around and I decided to find out more about this chip. Indeed it is what I have been looking for, a low power regulator. So I purchase the IC and its component to try it out. When I started writing this acticle, only did I realize that I have actually tried it about 6 months ago. The experiment was forgotten after a series of failure., 147380=- LM2577-15 (15Vdc output), 78677=220uH, 3A  <for LM2576-12, LM2576-15>, 131125=- LM22678-ADJ (1.285Vdc to Vin output), 43215=NJM2367, 74619=LM2576 (3A), 102915=- LM2594-3.3 (3.3Vdc output), 75295=- LM2576-15 (15Vdc output), 107339=LM2596 datasheet, 120570=- LM22675-5.0 (5Vdc output), 9047=The interfacing of most dc-dc IC requires the use of inductor. This is the case for LM2576 too. Try sourcing your local electronics shop for one if possible. I am not stopping you to make your own inductor. Just that making your own inductor takes up time and it is very likely to cost you more than what a shop might be selling., 73182=- LM2825-3.3 (3.3Vdc output), 19214=Bill of Material (BOM) for LM2576 circuit, 130605=LM22678 (5A), 106611=- LM2596-5.0 (5Vdc output), 42756=- LM2575-5.0 (5Vdc output), 146864=LM2577 (3A), 153056=Click for MAX1708 circuit, 44476=Click for LM2575-adj circuit, 156109=MCP1640.pdf, 36340=Bill of Material (BOM) for LM2575 circuit, 75056=- LM2576-3.3 (3.3Vdc output), 114597=- LM2574-5.0 (5Vdc output), 76989=Click for LM2576-adj layout, 77230=- AN-946, lm2576 as a charger, 155863=Output 3.3V from a 1.2V alkaline battery using MCP1640, 116410=LM22674 (0.5A), 73991=LM2825 datasheet, 103719=LM2594 datasheet, 22648=Failure, my first prototype circuit to test out the performance of LM2575, LM2576., 33803=The photos on the left column shows the LM2575 circuit using the correct inductance value at 330uH but the inductor is low power rated. It is small and looks like a color coded resistor., 102996=- LM2594-5.0 (5Vdc output), 110632=- LM2678-5.0 (5Vdc output), 22900=Some of the various sizes of inductor tested and seems to be working with LM2576., 114155=LM2574 (0.5A), 108406=180uF (100V aluminium electrolytic, low ESR)<for LM2596-12>, 75374=- LM2576-ADJ (1.23Vdc to 37Vdc output), 165635=LT1308.pdf, 106769=- LM2596-ADJ (1.23Vdc to 37Vdc output), 148420=LM2577 datasheet, 125188=LM22676 datasheet, 42835=- LM2575-12 (12Vdc output), 147930=tested working on 2006, 148470=Click for LM2577-adj circuit, 39914=04 Oct 2011, Lim Siong Boon, 45877=330uH, 1A  <for LM2575-3.3, LM2575-5.0>, 114676=- LM2574-ADJ (1.2Vdc to Vin output), 110551=- LM2678-3.3 (3.3Vdc output), 76441=LM2576 datasheet, 186467=Commercial Stock Availiability Statistics from element14 24 Oct 2013, for resistor value >40 types availability., 153004=MAX1708 datasheet, 106530=- LM2596-3.3 (3.3Vdc output), 24373=The mystery is resolve finally. One fine day I went back to the shop where I first purchase my LM2576 and brought 2 additional LM2576 for more testing. A new circuit was build and the familiar failure was observed. The output voltage of 5V cannot be sustain and eventually drop when more than 1A of current is draw by the load. The lab power supply display a current loading limit warning. IC becomes very hot. The datasheet specify that LM2576 should be able to supply 3A without any  problem. Both brand new IC are tested to have the same problem., 148632=Click for LM2577-adj layout, 143898=LMZ12003 (3A), 116853=- LM22674-5.0 (5Vdc output), 75137=- LM2576-5.0 (5Vdc output), 6916=A switching mode power supply such as LM2576 dc-dc converter, uses switching control to reduce the input dc voltage on average. This is equivalent to a lower input voltage resulting in minimum heat dissipated. The control results in better regulated output, less energy wasted through heat and the use for high current application. Nowadays dc-dc converter are getting smaller and comes in the TO-220 package too. You can simply change your LM7805 to dc-dc converter without any change in your design., 110114=LM2678 (5A), 23807=One day, I visited a shop selling ready made inductors and brought LM2576 at the same time. The circuit was rebuild and it finally works. My deduction at that time was either the inductor or the capacitor is giving me the problem. After further testing, I find out that ordinary capacitor works as well. There is hardly any difference in performance. Various type of inductor were tested (except the resistor like type). All inductor works too, big or small. Quite weird actually, and I couldn't figure it out the actual problem I had in my previous attempt., 120650=- LM22675-ADJ (1.285Vdc to Vin output), 76825=Click for LM2576-adj circuit, 5842=LM2576 circuits perform same function as the commonly known voltage regulator LM7805 from National Semiconductor. The 7805 voltage regulator dissipates a lot heat. The higher input voltage, the more heat is generated. The extra input energy is converted to heat, keeping the output voltage regulated at 5V., 106690=- LM2596-12 (12Vdc output), 42914=- LM2575-15 (15Vdc output), 112530=360uF (100V aluminium electrolytic, low ESR) <for LM2678-3.3, LM2678-5.0>, 137197=Adjustable Vout computation (very similar to LM2576, LM2575) with Vref = 1.25V, 42675=- LM2575-3.3 (3.3Vdc output), 120129=LM22675 (1A), 35594=02 Dec 2008, Lim Siong Boon, 147459=- LM2577-ADJ (1.23Vdc to 37Vdc output), 44324=LM2575 datasheet, 167245=LT1301.pdf, 111355=LM2678 datasheet, 124446=- LM22676-5.0 (5Vdc output), 35960=LM2575 Schematic taken from National Semiconductor LM2575 datasheet, 108913=33uH, 3A  <for LM2596-3.3, LM2596-5.0>, 106093=LM2596 (3A), 113272=22uH, 5A  <for LM2678-12>, 110790=- LM2678-ADJ (1.2Vdc to 37Vdc output), 103076=- LM2594-12 (12Vdc output), 73342=- LM2825-12 (12Vdc output), 78574=100uH, 3A  <for LM2576-3.3, LM2576-5.0>, 24936=This is weird, as the same inductor and capacitor previously tested do not result in this same old problem. However the circuit shows the same failure symptom. The next thing that comes to mind, is the IC. The IC LM2576 from the previous working circuit is then transfer over the new circuit board for testing. Everything works fine. It is then clear that the problem comes from the IC itself., 155981=Output 5.0V from a 3.2V LI-ION battery using MCP1640, 72747=LM2825 (1A), 34744=12 June 2006, Lim Siong Boon, 116933=- LM22674-ADJ (1.2Vdc to Vin output), 177626=To find the range of resistor value that is available in the industrial, multiply the normalise standard found in the table in terms of 100, 1000, 45980=680uH, 1A  <for LM2575-12, LM2575-15>, 148044=tested working on 2007-06-21, 108274=330uF (100V aluminium electrolytic, low ESR) <for LM2596-3.3, LM2596-5.0>, 42993=- LM2575-ADJ (1.23Vdc to 37Vdc output), 147301=- LM2577-12 (12Vdc output), 76060=tested working on 2007-06-26, 117483=LM22674 datasheet, 75216=- LM2576-12 (12Vdc output), 23514=Still it doesn't work. I guess that both IC LM2575, LM2576 must have been damage by my previous attempt. The capacitor used is suspected because the datasheet call for low ESR capacitor. It is very difficult to find these in the local shops, therefore I use a normal capacitor instead., 33530=The following experiment is done during the 1st test on LM2575 circuit. The experiment compare between the performance of using different inductor. One using a wire coil inductor, and the other smaller one inductor that looks like a resistor with it's color bands.., 124526=- LM22676-ADJ (1.285Vdc to Vin output), 113170=15uH, 5A  <for LM2678-3.3, LM2678-5.0>, 76584=Click for LM2576-5.0 layout, 73263=- LM2825-5.0 (5Vdc output), 103155=- LM2594-ADJ (1.23Vdc to 37Vdc output) (57V for HV version), 159181=LM2731.pdf, 8619=Through some research, I get to learn about commercial standard dc-dc IC that perform with only a few external components. The following article discuss on LM2576 IC with rating up to 5V 3A. LM2576 is one of the dc-dc IC product range from National Semiconductor. There are also various brand of dc-dc regulator IC available., 42238=LM2575 (1A), 9937=Jens Moller has contributed a program which generate a table of information for building air core inductor. Simply input the inductance value you need, the program will display a table containing the wire coil height radius and number of turns required. You need not have to understand formula to make your own inductor. Take a look at the following website, http://www.colomar.com/Shavano/inductor_info.html, 124006=LM22676 (3A), 41143=LM2575, LM2576, LM2596, LM2678, 131045=- LM22678-5.0 (5Vdc output), 12675=2009-09-13 dc-dc step up, LED driver using 1.5V alkaline battery, 112662=220uF (100V aluminium electrolytic, low ESR)<for LM2678-12>}",
    "lastModified": "Tue, 30 Sep 2014 16:08:06 GMT",
    "textBeforeTable": "LM2575 datasheet Click for LM2575-adj circuit Component list LM2575 (1A) DC to DC step down voltage regulator. Wide input voltage 8Vdc to 40Vdc.     Part number: - LM2575-3.3 (3.3Vdc output) - LM2575-5.0 (5Vdc output) - LM2575-12 (12Vdc output) - LM2575-15 (15Vdc output) - LM2575-ADJ (1.23Vdc to 37Vdc output) Alternative: NJM2367     Package: TO-220(T)     click here to Buy DC-DC Converter Available Now at the PIC-store          ",
    "textAfterTable": "R1 R2   R1 R2 Vout 1.00kΩ 1.68kΩ   1.0kΩ     3.30kΩ 5.55kΩ   3.3kΩ (3.24kΩ) 5.6kΩ (5.49kΩ) 3.32V 4.70kΩ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}