{
    "relation": [
        [
            "DATE",
            "Friday, July 9",
            "Saturday, July 10",
            "Sunday, July 11",
            "Tuesday, July 13",
            "Thursday, July 15"
        ],
        [
            "OPPONENT",
            "New Orleans Hornets",
            "Detroit Pistons",
            "Washington Wizards",
            "Miami Heat",
            "Phoenix Suns"
        ],
        [
            "TIME (PDT)",
            "7:00 p.m.",
            "5:00 p.m.",
            "5:00 p.m.",
            "7:30 p.m.",
            "3:00 p.m."
        ],
        [
            "LOCATION",
            "COX Pavilion",
            "COX Pavilion",
            "COX Pavilion",
            "Thomas & Mack Center",
            "COX Pavilion"
        ]
    ],
    "pageTitle": "WARRIORS: Warriors 2010 Draft Blog Archive",
    "title": "",
    "url": "http://www.nba.com/warriors/fanzone/2010_draft_blog_archive.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00064-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 599564911,
    "recordOffset": 599507959,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{207220=Tuesday, May 18 (2:00 p.m.) Submitted by: warriors.com Warriors.com Goes Dark As Team Begins Transition To New Logo, 48798=Friday, June 11 (4:14 p.m.) Submitted by: warriors.com It\u0092s Either Aminu, Monroe or Somebody Else, 20525=Friday, June 18 (4:15 p.m.) Submitted by: warriors.com Warriors Work Out Six More Prospects As mentioned in Thursday\u0092s blog entry, the Warriors worked out the following six prospects today during a pre-draft workout at the team\u0092s practice facility: Derrick Caracter (UTEP, F, 6-9, 275), Landry Fields (Stanford, F, 6-7, 210), Luke Harangody (Notre Dame, F, 6-8, 246), Dior Lowhorn (USF, F, 6-7, 230), A.J. Slaughter (Western Kentucky, G, 6-3, 180) and Jeremy Wise (Bakersfield Jam, G, 6-1, 165). The workout was closed to all but a few select basketball operations people, but afterward we were able to catch up with a few of the prospects. Hear what they had to say in the interviews below:, 146040=Thursday, June 3 (10:01 a.m.) Submitted by: warriors.com Catching Up With Ronny Turiaf Earlier this week, we got a glimpse into the off-season life of Stephen Curry. Today, we catch up with Ronny Turiaf. The energetic big man has stayed quite busy this off-season. He\u0092s taken part in graduation ceremonies from Gonzaga University, spoken at California Lobby Day and even visited a high school French class. Don\u0092t just take our word for it. Hear from Ronny himself in the video below:, 134742=Thursday, June 3 (12:45 p.m.) Submitted by: warriors.com Warriors To Host Pre-Draft Workouts; Fan Voting Will Decide Prospect Interviews, 24283=Friday, June 18 (11:28 a.m.) Submitted by: warriors.com New Video: Anthony Morrow Off-Season Workout And Interview Few people in the NBA work as hard as Anthony Morrow. After going undrafted in 2008, Morrow parlayed a jaw-dropping Summer League performance into a training camp invite and now, he has played his way into the team\u0092s rotation and has even started 54 games over his first two NBA seasons. It\u0092s safe to say that Morrow has \u0093made it\u0094 in the NBA, but he\u0092s not stopping there. Once a pure shooter, his overall game has grown, so much so that he earned a spot on the sophomore squad of the 2010 Rookie Challenge at All-Star Weekend. The 24-year-old product of Georgia Tech is continuing to improve his game this off-season. During a break in one of his recent workouts, Morrow sat down with Jim Barnett to discuss his young career and off-season workout regimen:, 193151=Tuesday, May 18 (6:16 p.m.) Submitted by: warriors.com Lottery Reaction From Warriors GM Larry Riley As discussed in the prior blog entry, the Warriors fell two spots from their pre-Lottery position and were awarded with the sixth pick in next month\u0092s NBA Draft at today\u0092s NBA Draft Lottery. The Wizards were the big winners in the annual event, moving up four spots to grab the No. 1 pick. Philadelphia also moved up four spots to pick No. 2 and the Nets, who had the best chance of securing the first pick, wound up with the third selection. Shortly after the draft order was revealed, Warriors General Manager Larry Riley, who represented the team on stage at the made-for-TV event, spoke with our very own Tim Roye with reaction to the pick. Listen to that interview below:, 59739=Wednesday, June 9 (12:34 p.m.) Submitted by: warriors.com Warriors Draft Workout Interview With Lance Stephenson To show our appreciation to all those who voted in the recent warriors.com poll questions, we have decided to share with you even more video interviews with 2010 draft prospects. Yesterday, we brought you an interview with Hassan Whiteside, and today we offer you Jim Barnett\u0092s conversation with Cincinnati forward and 2010 Big East Rookie of the Year Lance Stephenson:, 65161=Monday, June 7 (4:47 p.m.) Submitted by: warriors.com Warriors Pre-Draft Workout Interview With Al-Farouq Aminu According to our Mock Drafts page, the majority opinion among NBA experts \u0096 and that term is used lightly \u0096 is that Al-Farouq Aminu will be selected by the Warriors with the sixth pick of the 2010 NBA Draft. Perhaps that explains why fans overwhelmingly voted to see an interview with the Wake Forest forward over any of the other five prospects taking part in today\u0092s pre-draft workout at the Warriors Practice Facility. By popular demand, here is Warriors broadcaster Jim Barnett\u0092s conversation with Aminu that took place after today\u0092s workout:, 4085=Wednesday, June 23 (9:25 a.m.) Submitted by: warriors.com Local Prospects Work Out For Warriors It\u0092s always fun to follow the draft prospects of local players. Whether it\u0092s a high school on the Peninsula or a small college in the East Bay, the Bay Area certainly has had no shortage of players on the brink of turning pro. From Gary Payton to Jason Kidd to more recent players such as Leon Powe and Patty Mills, the list could go on for days. This year, two of the top NBA draft prospects with local ties are Omar Samhan and Jeremy Lin. Many Bay Area basketball fans were familiar with Samhan as a high school standout at San Ramon Valley High School, but the St. Mary\u0092s center made a name for himself on a national level in this year\u0092s NCAA Tournament. As charismatic as they come, the 6-foot-11, 265-pound Samhan led the Gaels to the Sweet 16 with averages of 25.3 points and 9.3 rebounds per game in the Tournament. After working out alongside Greg Monroe on Sunday, Samhan sat down with warriors.com:, 174182=Friday, May 21 (9:30 a.m.) Submitted by: Warriors PR The Poking And Prodding That Is The NBA Draft Combine As the 2010 NBA Draft Combine continued in Chicago on Thursday for Warriors GM Larry Riley and his staff, one of the much-anticipated events of the three-day evaluation period was conducted at a downtown hotel ---- the official measurements of the players. With the draft order revealed on Tuesday, this is the next step in the draft process. The entire collection of players who traveled to Chicago, roughly 60 strong, were scheduled to participate in the measurements, regardless if they have chosen to compete in any of the drills and workouts in front of NBA GMs, scouts and other player personnel evaluators. This is a day when NBA teams and fans REALLY find out about a player and his size. Before this, you just don\u0092t know., 35637=Tuesday, June 15 (1:02 p.m.) Submitted by: warriors.com Pre-Draft Workout Interview With Xavier Henry The Warriors had success last year in drafting the son of a former professional basketball player. If they were to do so again this year, there\u0092s a strong chance that they\u0092d select Kansas guard Xavier Henry. Carl Henry, Xavier\u0092s father, had a brief NBA career but also played professionally in Belgium. Find out how Carl Henry playing in Belgium influenced the pronunciation of Xavier Henry\u0092s first name and much more in Jim Barnett\u0092s conversation with the Kansas guard in the video below., 133283=Thursday, June 3 (7:20 p.m.) Submitted by: warriors.com New Warriors 2010-11 Commercial If you\u0092re like us, watching the NBA Finals has made you ready for another season of Warriors basketball. Agree or disagree, you should check out this sneak peek of the new Warriors commercial that will air tonight during KGO-TV\u0092s postgame coverage of the NBA Finals., 28057=Thursday, June 17 (4:07 p.m.) Submitted by: warriors.com Warriors Get A New Look & Larry Riley Talks Draft With Tim Roye We\u0092re sure by now that you\u0092ve noticed that warriors.com has a bit of a new look to it. The re-designed Web site launched earlier this morning and the new logo and colors are prevalent throughout all warriors.com pages. If you\u0092re a bit short on time, we definitely recommend that you click on the following links so you can get an idea of exactly what has changed and why., 67280=Monday, June 7 (9:18 a.m.) Submitted by: warriors.com Warriors Host Third Pre-Draft Workout Today; Still Time To Vote On Prospect Interview, 85488=Saturday, June 5 (6:19 p.m.) Submitted by: warriors.com Warriors Pre-Draft Workout Interview With Gordon Hayward Warriors fans spoke, and we listened. By popular demand, here is today\u0092s post-workout interview with Gordon Hayward:, 63420=Tuesday, June 8 (9:25 a.m.) Submitted by: warriors.com Warriors Highlight Video: Centers Over the last few weeks, we have broken down the 2009-10 Warriors position by position. Today, we finish that look by going big, literally. Enjoy this highlight video starring Warriors centers Andris Biedrins, Ronny Turiaf and Chris Hunter:, 159657=Thursday, May 27 (2:03 p.m.) Submitted by: warriors.com Draft Talk With Len Elmore; Plus New Small Forwards Video We\u0092re now less than a month away from the NBA Draft and prospects are beginning to have workouts with individual teams. With that in mind, our very own Tim Roye spoke with iHoops CEO Len Elmore this morning about last week\u0092s NBA Draft Combine and other Draft-related topics. Listen to the interview below:, 169817=Monday, May 24 (2:25 p.m.) Submitted by: warriors.com New Video: Warriors Shooting Guards One of the Warriors\u0092 greatest strengths from last season was that of their backcourt. Both Monta Ellis and Stephen Curry have the ability to play both guard positions at a high level, and both Anthony Morrow and Reggie Williams have proven to be quality additions. Have a look at some of the top plays turned in by the Warriors\u0092 shooting guards during the 2009-10 campaign in the video below. And if you missed our point guards video, click here., 7492=Tuesday, June 22 (7:52 p.m.) Submitted by: warriors.com Riley Speaks On Trade With Milwaukee Earlier today, the Warriors acquired Charlie Bell and Dan Gadzuric from the Milwaukee Bucks in exchange for Corey Maggette and the 44th pick in the 2010 NBA Draft. Shortly after the move was made, Warriors GM Larry Riley spoke to the media. Watch that interview in the video below:, 163247=Thursday, May 27 (12:00 a.m.) Submitted by: warriors.com Challenge #7, 10965=Monday, June 21 (4:16 p.m.) Submitted by: Tim Roye A Conversation With NBA Scouting Director Ryan Blake, Plus The Return Of The Journal The journal is back! After a year\u0092s hiatus, I have decided to once again answer your questions, put down some random thoughts and get everyone updated on the latest Warrior and NBA news. Also, I want and need your input. This journal is really about you, the best fans of the NBA who make Oracle Arena one of the great atmospheres in all of sports. So, what would you like to see in the Journal? What kinds of features and ideas would you like me to pursue? 2010 NBA Draft The NBA Draft is just three days away and I hope that you have been following my interviews to better prepare you for Thursday's event. Today, I spoke with Ryan Blake, the NBA Director of Scouting, and you can access that interview in the audio player below., 196364=Tuesday, May 18 (5:28 p.m.) Submitted by: warriors.com Warriors To Select No. 6 In 2010 NBA Draft, 52593=Friday, June 11 (12:45 p.m.) Submitted by: warriors.com Anthony Randolph Off-Season Workout Anthony Randolph taking part in an off-season workout at the Warriors Practice Facility was certainly a sight for sore eyes on Thursday. The Warriors forward suffered a sprained left ankle in January and that injury caused him to miss the final 47 games of the season. Just seeing him take part in basketball-related activities had to give Warriors fans a good feeling. That\u0092s not to say that the soon-to-be third-year forward was just going through the motions. Instead, he didn\u0092t hold anything back and he\u0092s been going full throttle for some time now during workouts in his hometown of Dallas. Randolph has certainly added some bulk to his lengthy frame this off-season, and his ankle injury will be nothing but a distant memory once the team convenes for training camp in October. Take a look at his workout session in the video below:, 54730=Thursday, June 10 (5:09 p.m.) Submitted by: warriors.com Pre-Draft Workout Interview With Patrick Patterson The NBA Draft is pretty unpredictable, but there are a few things about it that stay consistent from year to year. One, nearly everyone has a prediction on how the event will turn out; and two, just about every one of those predictions will be wrong when it's all said and done. Take a look at Patrick Patterson for example. According to the Mock Drafts scoured across the Internet, the Kentucky forward is projected to go anywhere from a top-10 selection to a mid-late first rounder. Obviously, not everyone will be correct in predicting which team will select him. We can\u0092t tell you with any certainty where he\u0092ll end up either, but we can offer this interview with the prospect recorded during his recent workout with the Warriors:, 171992=Monday, May 24 (12:02 a.m.) Submitted by: warriors.com Warriors Draft Challenge Continues; Login Or Register Today, 205277=Tuesday, May 18 (3:33 p.m.) Submitted by: warriors.com Farewell To The \u0091Flying W\u0092, 45147=Monday, June 14 (10:20 a.m.) Submitted by: warriors.com Pre-Draft Workout Interview With Ryan Richards Other than those who closely monitor developing prospects in foreign countries, few had heard of Ryan Richards before last month\u0092s NBA Draft Combine in Chicago. But the buzz quickly started to build around the English born big man who played last season with the Gran Canaria junior team (Spain) and BBC Monthey (Switzerland). At 6-foot-10 and 225 pounds, Richards showed tremendous athleticism and definitely held his own with the top collegiate players who took part in the workout portion of the Draft Combine. Since then, he has embarked on the pre-draft workout tour with individual teams. After his recent workout with the Warriors, Richards sat down with team broadcaster Jim Barnett, and you can watch the resulting interview in the video below., 76027=Sunday, June 6 (4:49 p.m.) Submitted by: warriors.com Warriors Host Another Pre-Draft Workout; Cole Aldrich Interview The Warriors hosted their second pre-draft workout in as many days today. And just like Saturday, six draft prospects participated in the workout. Among those on hand at the Warriors Practice Facility today was Cole Aldrich, the 6-foot-11 center out of Kansas who many predict to be a top-10 pick in the draft. Fans voted right here on warriors.com to see a post-workout interview with Aldrich, and that video can be seen below:, 189421=Wednesday, May 19 (10:30 a.m.) Submitted by: Warriors PR (Raymond Ridder) Lottery All About Luck, 177929=Friday, May 21 (7:44 a.m.) Submitted by: warriors.com Challenge #3, 147555=Wednesday, June 2 (5:32 p.m.) Submitted by: warriors.com Warriors Highlight Video: Power Forwards Whether it is through the NBA Draft, the NBA D-League or via a trade, the Warriors have used any means necessary to bring in an effective power forward. Unfortunately for the Warriors, injuries took their toll on the team\u0092s crop of power forwards during the 2009-10 season. Brandan Wright was lost for the season in training camp, and Anthony Randolph and Vladimir Radmanovic each missed most of the season with injuries as well. As a result, Anthony Tolliver took full advantage of the opportunity after signing with the Warriors out of the D-League in January. The team figures to be fully healthy for the start of the 2010-11 season. And with that, we anticipate the power forwards to make many plays similar to the ones shown in the video below:, 56743=Thursday, June 10 (11:36 a.m.) Submitted by: warriors.com Randolph And Williams Working Out At Warriors Practice Facility As you saw last week, Reggie Williams has been training hard this off-season, but we\u0092d be lying if we told you that he was the only one. Anthony Randolph is also putting in some serious work at the Warriors Practice Facility. After last season was cut short due to injury, Randolph is anxious for the 2010-11 campaign to begin. With that in mind, the Warriors forward is working with the Warriors coaching staff on skill development in addition to a grueling strength and conditioning program. Randolph and Williams were working out together earlier today. Have a quick look in the video below and stay tuned for more workout coverage., 149990=Wednesday, June 2 (9:19 a.m.) Submitted by: warriors.com Breaking Down The Draft With Jay Bilas As the NBA Draft draws nearer \u0096 three weeks from Thursday to be exact \u0096 we will continue to bring you behind-the-scenes coverage of the Warriors. From the logo unveiling (did you take the Warriors 2010 Draft Challenge?) to \u0093expert\u0094 opinions on who the Warriors will select at No. 6 (check out our expansive Mock Drafts page), warriors.com has and will continue to be the best place to find the most up-to-date Warriors draft news. With that in mind, we bring you Tim Roye\u0092s interview with college basketball expert Jay Bilas. A basketball analyst for ESPN and CBS Sports, Bilas has one of the most informed opinions about many of the draft prospects and who might fit best with the Warriors at No. 6. Check out the interview below, and if you missed Roye\u0092s interview last week with iHoops CEO Len Elmore, click here., 154880=Monday, May 31 (12:00 a.m.) Submitted by: warriors.com The FINAL Challenge Is Revealed, 179678=Thursday, May 20 (5:28 p.m.) Submitted by: Warriors PR Ronny Turiaf Speaks At AHA's Lobby Day In Sacramento, 186567=Wednesday, May 19 (2:21 p.m.) Submitted by: Warriors PR (Raymond Ridder) Time For The Draft Workout & Interview Circuit To Begin Earlier this morning, Warriors General Manager Larry Riley boarded a plane for Chicago and the NBA's pre-draft camp, which will be held at Attack Athletics on Thursday and Friday. The three-day event tips off today with the interview portion of the camp and drills begin tomorrow. Each team will have the opportunity to sit down with many of this year\u0092s draft prospects and get to know them in a one-on-one setting. It is an important part of the entire evaluation process and teams put a lot of stock into their meetings, and rightfully so. Finding out about a person, his thought process, drive, what makes him tick, his background and his family is sometimes almost as valuable as knowing about his jump shot, rebounding and passing skills., 47139=Sunday, June 13 (8:34 a.m.) Submitted by: warriors.com Pre-Draft Workout Interview With Ekpe Udoh It\u0092s certainly interesting how a run in the NCAA Tournament can raise a profile for a potential draft prospect. That was certainly the case for Ekpe Udoh, the Baylor big man who played a large role in leading the Bears to the Elite Eight before falling to the eventual national champion Duke. Following his recent workout with the Warriors, Udoh discussed his March Madness experience and much more with Warriors broadcaster Jim Barnett., 167824=Tuesday, May 25 (8:22 a.m.) Submitted by: warriors.com Challenge #5, 61489=Tuesday, June 8 (4:51 p.m.) Submitted by: warriors.com Bonus Interview With Hassan Whiteside Warriors.com thanks everyone who voted on our draft prospect interview poll questions over the last week. Because the fan vote was so popular, we decided to interview multiple prospects on each of the three days of pre-draft workouts at the Warriors Practice Facility. We\u0092ll continue to bring you bonus interviews throughout the week, beginning with this one between Warriors broadcaster Jim Barnett and Marshall center Hassan Whiteside:, 8763=Tuesday, June 22 (10:50 a.m.) Submitted by: warriors.com Curry Hosts Golf Tournament, Weighs In On Draft At this time last year, Stephen Curry was waiting in anticipation of where he would be selected in the 2009 NBA Draft. Fast forward to present day and the young guard is now offering his thoughts on which prospects from this year\u0092s draft class could be joining him on the 2010-11 Warriors., 34096=Tuesday, June 15 (5:15 p.m.) Submitted by: warriors.com Sneak Peek At New Warriors Commercial With the NBA Draft coming up in just nine days, anticipation is building pretty much on an hourly basis, and the video below will do nothing to dampen that excitement. Who will the Warriors select at No. 6? Will the team go big, small or perhaps go with a swingman? Stick with a college prospect or maybe go international? All those questions will be answered at the Warriors 2010 Draft Party on Thursday, June 24, at Oracle Arena. In the meantime, enjoy a sneak peek at this Warriors commercial that will air on KGO-7 tonight following Game 6 of the NBA Finals., 37482=Tuesday, June 15 (11:45 a.m.) Submitted by: warriors.com Warriors Heading To Las Vegas This Summer The NBA has announced its Summer League plans, and the Warriors will play five games next month in the NBA Summer League in Las Vegas. Including the Warriors, 22 NBA teams will have Summer League entries in Las Vegas and another team will be made up of select players from the NBA Development League. All NBA Summer League games will be played at the COX Pavilion and the Thomas & Mack Center on the campus of UNLV. While an announcement on the Warriors\u0092 Summer League roster will be made in the near future, we can tell you that Golden State\u0092s 2010 Draft picks (Nos. 6 and 34) are expected to participate. The Warriors\u0092 NBA Summer League schedule can be found below:, 17721=Sunday, June 20 (3:05 p.m.) Submitted by: warriors.com Six More Prospects Work Out In Oakland; Greg Monroe Interviewed The Warriors conducted yet another six-man pre-draft workout at their practice facility on Sunday. With the draft less than a week away, it's getting down to crunch time for NBA teams, as well as potential draftees. The following prospects were included in today's workout: Gerard Anderson (Cal State Fullerton, F, 6-6, 205), Tweety Carter (Baylor, G, 5'11, 185), Jeremy Lin (Harvard, G, 6-3, 200), Greg Monroe (Georgetown, F/C, 6'11, 253), Omar Samhan (St. Mary's, F/C, 6'11, 265) and Seth Tarver (Oregon State, G/F, 6'5, 210). Over the last few weeks, Monroe has steadily been tabbed as one of the early favorites among the mock draft 'experts' on the web who are looking to predict the Warriors pick - including fans who have made their voice heard on the Warriors' official Facebook page. All that being considered, warriors.com sat down with the Georgetown big man for an exclusive interview, which you can see below:, 120511=Friday, June 4 (5:15 p.m.) Submitted by: warriors.com An Off-Season Workout & Interview With Reggie Williams While anticipation is building regarding this weekend\u0092s pre-draft workouts, other workouts have been taking place lately at the Warriors Practice Facility. More specifically, Warriors guard Reggie Williams has been an absolute gym rat recently. During this circuit, he has worked out under the supervision of Warriors Director of Athletic Development Mark Grabow, Assistant Coach Stephen Silas and Strength and Conditioning Coach John Murray. Williams has gone through a number of strength and agility exercises, as well as plenty of basketball work. Following a recent workout, Warriors broadcaster Tim Roye caught up with the second-year guard, and you can watch that interview below:, 165411=Wednesday, May 26 (12:01 a.m.) Submitted by: warriors.com Bonus Video: Movie Time With Ronny Turiaf With the 2010 NBA Draft now less than one month away, Warriors HQ is buzzing as the organization makes preparations for the June 24th event. And while we will continue to give fans exclusive coverage of these preparations, we're starting things off today with a bonus video not related to the draft. Check out Ronny Turiaf's latest DVD movie reviews in the video below, and for those of you participating in the Warriors Draft Challenge, find out today's challenge question and look for the clue within the video., 98896=Saturday, June 5 (10:05 a.m.) Submitted by: warriors.com Three Days Of Pre-Draft Workouts Begin Today; Vote For Player Interviews, 122802=Friday, June 4 (11:51 a.m.) Submitted by: warriors.com Sunday's Pre-Draft Workout Prospects Revealed; Vote For Who You'd Like To See Interviewed, 157430=Friday, May 28 (12:00 a.m.) Submitted by: warriors.com Challenge #8, 131696=Friday, June 4 (8:51 a.m.) Submitted by: warriors.com Behind-The-Scenes Remix Video Over the course of the season, Warriors Weekly gave fans a look at the lives of players and coaches away from the court. Enjoy this behind-the-scenes compilation featuring Stephen Curry, C.J. Watson and Ronny Turiaf., 152638=Tuesday, June 1 (5:05 p.m.) Submitted by: warriors.com ESPN Takes A Look At Stephen Curry In The Off-Season If you\u0092ve ever wondered what the players do during the off-season, check out this ESPN video featuring Stephen Curry and his father, former NBA player and current Bobcats broadcaster Dell Curry:, 184446=Thursday, May 20 (12:03 a.m.) Submitted by: warriors.com Challenge #2, Featuring Stephen Curry, 210024=Tuesday, May 18 (1:30 p.m.) Submitted by: warriors.com Welcome To The Warriors Draft Blog During the weeks leading up to and following the 2010 NBA Draft, this blog will be the place to get complete draft coverage from a variety of Warriors sources. With submissions from warriors.com, Warriors PR and more, plus plenty of behind-the-scenes videos, photos and interviews, the Warriors 2010 Draft Blog is the best place for Warriors fans wanting the inside scoop on this year's draft. And while you're here, check out the 2010 Draft Challenge by registering for the Warriors Draft Party. Check back each day for a new challenge, plus a chance to win one of our daily prizes. Complete all nine challenges and you will become eligible to win 2010-11 season tickets! Enjoy the challenge and stay tuned for much more in the coming weeks!, 182475=Thursday, May 20 (11:48 a.m.) Submitted by: warriors.com A Look At The Warriors Point Guards With the NBA Draft set to take place in a little more than a month, the anticipation is beginning to build with who the Warriors will select with the sixth pick. According to our Mock Draft page, speculation is already running rampant. As discussed in one of Wednesday\u0092s blog entries submitted by Warriors PR, General Manager Larry Riley is currently in Chicago attending the Pre-Draft Camp. This is the first of several workouts that Riley will attend, and the chances are that the Mock Drafts will continue to be adjusted throughout the course of the workout circuit and right up until the first pick of the 2010 NBA Draft is announced on June 24 in New York City. As the excitement builds on who will be joining the Warriors next month, we decided to take a deeper look at who is already on the team. Today we focus on the point guards: Monta Ellis, Stephen Curry and C.J. Watson. Without further ado, enjoy the video:, 31810=Wednesday, June 16 (11:39 a.m.) Submitted by: warriors.com A Conversation With Draft Expert Chris Monter As we get closer to the NBA Draft, Warriors broadcaster Tim Roye will interview different experts around the country to find out their take on how this year\u0092s event will turn out. Already he has spoken to ESPN\u0092s Jay Bilas and iHoops CEO Len Elmore, and now we bring you his conversation with Chris Monter of the Monter Draft News at CollegeBasketballNews.com. Hear that interview below:, 211483=Monday, May 10 (4:05 p.m.) Submitted by: Warriors PR The Perfect Script In Secaucus}",
    "textBeforeTable": "WARRIORS 2010 SUMMER LEAGUE SCHEDULE Tuesday, June 15 (11:45 a.m.) Submitted by: warriors.com Warriors Heading To Las Vegas This Summer The NBA has announced its Summer League plans, and the Warriors will play five games next month in the NBA Summer League in Las Vegas. Including the Warriors, 22 NBA teams will have Summer League entries in Las Vegas and another team will be made up of select players from the NBA Development League. All NBA Summer League games will be played at the COX Pavilion and the Thomas & Mack Center on the campus of UNLV. While an announcement on the Warriors\u0092 Summer League roster will be made in the near future, we can tell you that Golden State\u0092s 2010 Draft picks (Nos. 6 and 34) are expected to participate. The Warriors\u0092 NBA Summer League schedule can be found below: Be sure to read our previous blog entry for news on the Warriors\u0092 involvement in the NBA Summer League in Las Vegas. And check out all our draft prospect interviews on our Multimedia page. &lt;p&gt;Your browser does not support iframes.&lt;/p&gt; Tuesday, June",
    "textAfterTable": "Tickets for the 2010 NBA Summer League are on sale and can be purchased by calling 702-739-FANS, through UNLVtickets.com or by visiting the Thomas & Mack Center Box Office and UNLV Ticket Outlets. All general admission tickets are $25 for the day; seniors and children (3-12) are $15 for the day; and children two years and under are admitted free of charge. Monday, June 14 (10:20 a.m.) Submitted by: warriors.com Pre-Draft Workout Interview With Ryan Richards Other than those who closely monitor developing prospects in foreign countries, few had heard of Ryan Richards before last month\u0092s NBA Draft Combine in Chicago. But the buzz quickly started to build around the English born big man who played last season with the Gran Canaria junior team (Spain) and BBC Monthey (Switzerland). At 6-foot-10 and 225 pounds, Richards showed tremendous athleticism and definitely held his own with the top collegiate players who took part in the workout portion of the Draft Combine. Since then, he has embarked on the pre-draft workout tour with individual teams. After his recent workout with the Warriors, Richards sat down with team broadcaster Jim Barnett, and you can watch the resulting interview in the video below.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}