{
    "relation": [
        [
            "Title",
            "Large SUV",
            "Luxury SUV",
            "Pickup Truck",
            "Small SUV",
            "Van"
        ],
        [
            "Model",
            "Honda Pilot",
            "Land Rover Range Rover",
            "Chevrolet Silverado",
            "Honda CR-V",
            "Honda Odyssey"
        ],
        [
            "Times on List",
            "6",
            "1",
            "5",
            "2",
            "7"
        ]
    ],
    "pageTitle": "Car and Driver 10Best - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Car_and_Driver_Ten_Best",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00214-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 862453655,
    "recordOffset": 862433769,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17840=From 1983 through 2013, the following individual models were represented on the list the most times. In 2007, Honda's Odyssey and Pilot trucks appeared in the top ten, a first for any truck., 82513=For 2005 and 2006, the magazine named one winner in each category., 97647=Beginning with the 2009 list, Car and Driver considered the Porsche Boxster and Cayman to be the same car., 15053=Note also that changing ownership can affect the count. Chrysler and Dodge products from 1999 through 2007 were counted for Daimler-Benz/DaimlerChrysler/Daimler AG, as that company had wholly acquired Chrysler in that period. Similarly, Saab's post-2000 products, had they won a place on the list, would be counted for General Motors. Despite strong corporate ties through this period, Mazda remains separate from Ford, Subaru from General Motors and Toyota, Nissan from Renault, and Mitsubishi from Chrysler., 99834=In conjunction with the 2009 10Best Cars list, Car and Driver issued a list of what it called \"The 10 Most Embarrassing Award Winners in Automotive History\", spotlighting cars previously honored by a major automotive magazine (including CD itself) that, with the passage of time, is considered to be anything but award-worthy.[2], 67230=For 2001, Car and Driver created a separate \"Five Best Trucks\" award with a single winner in each of five categories., 12394=From 1983 through 2008, the following marques were represented on the list the most times, including both the car and truck lists (except for the 2008 trucks).}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "From 1983 through 2008, the following marques were represented on the list the most times, including both the car and truck lists (except for the 2008 trucks). Top Ten Marques[edit] 37 References 36.1 10Best Cars 36 2015 35.1 10Best Cars 35 2014 34.1 10Best Cars 34 2013 33.1 10Best Cars 33 2012 32.2 5Best Trucks 32.1 10Best Cars 32 2011 31.1 10Best Cars 31 2010 30.2 \"Dishonorable Mention\" 30.1 10Best Cars 30 2009 29.1 10Best Cars 29 2008 28.2 5Best Trucks 28.1 10Best Cars 28 2007 27.2 5Best Trucks",
    "textAfterTable": "6 Acura 16 7 Porsche 15 7 Nissan 15 7 Audi 15 10 Chrysler 13 Top Manufacturers[edit] Further breaking down the marques into their controlling manufacturers amplifies Honda's dominance of the contest over the last 25 years. Note that this number is skewed by the multiple products picked over the years. For example, the Chrysler minivans were picked three times, totalling 8 \"points\" for Chrysler from three wins. The Diamond-Star cars were a similar problem, double-dipping \"points\" for both Mitsubishi, Plymouth, and Eagle. These situations were not \"fixed\"; rather, they are left as-is, skewing the totals. Note also that changing ownership can affect the count. Chrysler and Dodge products from 1999 through 2007 were counted for Daimler-Benz/DaimlerChrysler/Daimler AG, as that company had wholly acquired Chrysler in that period. Similarly, Saab's post-2000 products, had they won a place on the list, would be counted for General Motors. Despite strong corporate ties through this period, Mazda remains separate from Ford, Subaru from General Motors and Toyota, Nissan from Renault, and Mitsubishi from Chrysler. Rank Manufacturer Number of wins 1 Honda Motor Company 80 2 Toyota Motor Company 38 3 General Motors 31 4",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}