{
    "relation": [
        [
            "Variable",
            "max_topicicon_width",
            "max_topicicon_height",
            "max_topicicon_size"
        ],
        [
            "Default Value",
            "48",
            "48",
            "65536 (equals 64 KB)"
        ],
        [
            "Description",
            "Max. width of a topic icon in pixels. If it exceeds this, it is either rejected or resized (depending on the setting of $_CONF['image_lib'] above).",
            "Max. height of a topic icon in pixels. If it exceeds this, it is either rejected or resized (depending on the setting of $_CONF['image_lib'] above).",
            "Max. size of a topic icon in bytes. If it exceeds this, it is rejected (even if you're using a graphics package to resize images)."
        ]
    ],
    "pageTitle": "Geeklog Documentation - Configuration",
    "title": "",
    "url": "https://www.geeklog.net/docs/english/config.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00224-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 919661415,
    "recordOffset": 919630506,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sun, 09 Mar 2014 16:46:36 GMT",
    "textBeforeTable": "Site: Site Site File Manager Miscellaneous Languages and Locale Images Users and Submissions Blocks Theme Stories and Trackback Site Geeklog's configuration options are grouped like this: Configuration options These files are updated when you install Geeklog and you will not normally have to edit them manually. siteconfig.php db-config.php For technical reasons, some configuration options still have to be stored in files. There are two such configuration files now: Previous versions of Geeklog used one huge file called config.php that held all the core configuration options. As of Geeklog 1.5.0, most of the configuration options have been moved to the database and can now be reached from the Configuration admin panel within Geeklog. Configuration files Geeklog Configuration Geeklog Documentation - Configuration",
    "textAfterTable": "site_slogan Another Nifty Geeklog Site Slogan for your site. This is added to the HTML title field. site_disabled_msg 'Geeklog Site is down. Please come back soon.' This contains the message to display when a Geeklog site is disabled. If the text begins with \"http:\" then visitors are redirected to that URL. Note: The option actually disable the site can be found in the siteconfig.php file. owner_name The name of the owner of the site. This is used in the copyright notice if set, else the site name is used. copyrightyear (disabled) Set this to the year you want to appear in the copyright notice of your site's footer. If not set, Geeklog will use the current year. url_rewrite false Enable (true) or disable (false) URL rewriting. Also see the section on URL Rewriting below. cdn_hosted false Enable (true) or disable (false) Google CDN-hosted source for jQuery and jQuery UI. meta_tags disabled Enabled - The meta tags for stories and topics will be displayed. If none are found, then the default will be used. The default will also be used for any page that doesn't have meta tags. Enabled (Default for Homepage only) - The same as Enabled except, the defaults are used only for the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}