{
    "relation": [
        [
            "Religion",
            "Mainline Protestant",
            "Catholic",
            "Evangelical Protestant",
            "Orthodox",
            "Other",
            "None"
        ],
        [
            "Adherents",
            "17,886",
            "11,961",
            "6,909",
            "-",
            "-",
            "32,185"
        ],
        [
            "Congregations",
            "78",
            "11",
            "63",
            "-",
            "2",
            "-"
        ]
    ],
    "pageTitle": "Leechburg, Pennsylvania (PA 15656) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Leechburg-Pennsylvania.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00013-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 367429931,
    "recordOffset": 367300416,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{122879=Leechburg: 2006 Iasi Romania, 122005=Leechburg: Snowfall in Leechburg 2010, 18508=Incorporated on 03/22/1850, 4291=According to our research of Pennsylvania and other state lists there were 7 registered sex offenders living in Leechburg, Pennsylvania as of July 29, 2015. The ratio of number of residents in Leechburg to the number of sex offenders is 303 to 1.}",
    "TableContextTimeStampAfterTable": "{43273=2000 Presidential Elections Results, 13352=On 5/31/1985, a category F3 (max. wind speeds 158-206 mph) tornado 9.1 miles away from the borough center killed 9 people and injured 120 people and caused between $5,000,000 and $50,000,000 in damages., 40120=School Enrollment by Level of School (%) in 2013, 59928=4.07% of this county's 2010 resident taxpayers moved to other counties in 2011 ($33,295 average adjusted gross income), 27248=Carbon Monoxide (CO) [ppm] level in 2012 was 0.442. This is significantly worse than average. Closest monitor was 15.2 miles away from the city center., 39722=Educational Attainment (%) in 2013, 30142=Particulate Matter (PM10) [µg/m3] level in 2012 was 23.4. This is about average. Closest monitor was 6.3 miles away from the city center., 58089=3.58% of this county's 2011 resident taxpayers lived in other counties in 2010 ($33,510 average adjusted gross income), 28712=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.90. This is about average. Closest monitor was 7.6 miles away from the city center., 43845=2008 Presidential Elections Results, 124584=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 13061=On 6/3/1980, a category F4 (max. wind speeds 207-260 mph) tornado 6.4 miles away from the Leechburg borough center injured 140 people and caused between $50,000,000 and $500,000,000 in damages., 29437=Ozone [ppb] level in 2012 was 25.4. This is better than average. Closest monitor was 6.7 miles away from the city center., 42987=1996 Presidential Elections Results, 31640=Lead (Pb) [µg/m3] level in 2006 was 0.0471. This is significantly worse than average. Closest monitor was 6.3 miles away from the city center., 67477=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population), 30891=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 10.8. This is about average. Closest monitor was 6.6 miles away from the city center., 44131=2012 Presidential Elections Results, 27985=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 7.35. This is about average. Closest monitor was 6.7 miles away from the city center., 44415=Graphs represent county-level data. Detailed 2008 Election Results, 23543=Hotel: Crossroads Inn & Motel (1127 State Route 356)., 43559=2004 Presidential Elections Results, 123222=Total of 46 patent applications in 2008-2015., 26600=Air Quality Index (AQI) level in 2012 was 101. This is worse than average.}",
    "textBeforeTable": "Religion statistics for Leechburg borough (based on Armstrong County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results No fuel used (1%) Bottled, tank, or LP gas (1%) Electricity (8%) Utility gas (90%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 18 Armstrong County: 2.61 / 10,000 pop. Pennsylvania: 2.04 / 10,000 pop. Number of convenience stores (no gas): 5 Armstrong County: 0.72 / 10,000 pop. Pennsylvania: 0.88 / 10,000 pop. Number of convenience stores (with gas): 22 Armstrong County: 3.19 / 10,000 pop. State: 2.52 / 10,000 pop. Number of full-service restaurants: 40 Here: 5.80 / 10,000 pop. State: 7.12 / 10,000 pop. Adult diabetes rate: This county: 10.5% Pennsylvania: 9.1% Adult obesity rate: Armstrong County: 29.7% Pennsylvania: 27.2%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}