{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9"
        ],
        [
            "RxCUI",
            "866018",
            "866018",
            "866018",
            "866083",
            "866083",
            "866083",
            "866094",
            "866094",
            "866094"
        ],
        [
            "RxNorm NAME",
            "busPIRone HCl 15 MG Oral Tablet",
            "buspirone hydrochloride 15 MG Oral Tablet",
            "buspirone hydrochloride 15 MG (as buspirone 13.7 MG) Oral Tablet",
            "busPIRone HCl 10 MG Oral Tablet",
            "buspirone hydrochloride 10 MG Oral Tablet",
            "buspirone hydrochloride 10 MG (buspirone 9.1 MG) Oral Tablet",
            "busPIRone HCl 5 MG Oral Tablet",
            "buspirone hydrochloride 5 MG Oral Tablet",
            "buspirone hydrochloride 5 MG (equivalent to buspirone 4.6 MG) Oral Tablet"
        ],
        [
            "RxTTY",
            "PSN",
            "SCD",
            "SY",
            "PSN",
            "SCD",
            "SY",
            "PSN",
            "SCD",
            "SY"
        ]
    ],
    "pageTitle": "DailyMed - BUSPIRONE HCL- buspirone hydrochloride tablet",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?id=23835",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00020-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 59220603,
    "recordOffset": 59185177,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4811=10 mg tablets: White, oval, biconvex, scored tablets, debossed WATSON and 658, in bottles of 100, 500, and 1000., 16049=The following definitions of frequency are used: Frequent adverse events are defined as those occurring in at least 1/100 patients. Infrequent adverse events are those occurring in 1/100 to 1/1000 patients, while rare events are those occurring in less than 1/1000 patients., 1190=Manufactured for: Watson Laboratories, Inc. Corona, CA 92880 USA, 4679=15 mg tablets: White, oval shaped, scored tablets, debossed with the Watson logo and 718, and scoring on both sides so it can be either bisected or trisected, in bottles of 60, 180, 500, and 1000., 3848=1. American Psychiatric Association. Ed.: Diagnostic and Statistical Manual of Mental Disorders - lll. American Psychiatric Association, May 1980., 29001=One guide to the relative clinical importance of adverse events associated with buspirone is provided by the frequency with which they caused drug discontinuation during clinical testing. Approximately 10% of the 2200 anxious patients who participated in the buspirone premarketing clinical efficacy trials in anxiety disorders lasting 3 to 4 weeks discontinued treatment due to an adverse event. The more common events causing discontinuation included: central nervous system disturbances (3.4%), primarily dizziness, insomnia, nervousness, drowsiness, and lightheaded feeling; gastrointestinal disturbances (1.2%), primarily nausea; and miscellaneous disturbances (1.1%), primarily headache and fatigue. In addition, 3.4% of patients had multiple complaints, none of which could be characterized as primary., 32952=The safety and effectiveness of buspirone were evaluated in two placebo-controlled 6-week trials involving a total of 559 pediatric patients (ranging from 6 to 17 years of age) with GAD. Doses studied were 7.5-30 mg b.i.d. (15-60 mg/day). There were no significant differences between buspirone and placebo with regard to the symptoms of GAD following doses recommended for the treatment of GAD in adults. Pharmacokinetic studies have shown that, for identical doses, plasma exposure to buspirone and its active metabolite, 1-PP, are equal to or higher in pediatric patients than adults. No unexpected safety findings were associated with buspirone in these trials. There are no long-term safety or efficacy data in this population., 5012=Buspirone HCl Tablets USP are supplied as follows: 5 mg tablets: White, oval, biconvex, scored tablets, debossed WATSON and 657, in bottles of 100, 500, and 1000., 3363=Revised: October 2007, 3668=Manufactured for: Watson Laboratories, Inc. Corona, CA 92880 USA, 877=Thousand Oaks, CA 91320}",
    "textBeforeTable": "Number of versions: 1 BUSPIRONE HCL- buspirone hydrochloride tablet View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close RELABEL, REPACK 118802834 Rebel Distributors Corp. Business Operations ID/FEI Address Name Establishment Labeler - Rebel Distributors Corp. (118802834) 03/28/2001 ANDA074253 ANDA Marketing End Date Marketing Start Date Application Number or Monograph Citation Marketing Category",
    "textAfterTable": "SCD 6 866083 buspirone hydrochloride 10 MG (buspirone 9.1 MG) Oral Tablet SY 7 866094 busPIRone HCl 5 MG Oral Tablet PSN 8 866094 buspirone hydrochloride 5 MG Oral Tablet SCD 9 866094 buspirone hydrochloride 5 MG (equivalent to buspirone 4.6 MG) Oral Tablet SY Get Label RSS Feed for this Drug BUSPIRONE HCL- buspirone hydrochloride tablet To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=0eefdd8d-7745-47ae-a204-f35687f3db11 To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To view updated drug label links, paste the RSS feed address (URL) shown below into a RSS reader, or use a browser which supports RSS feeds, such as Safari for Mac OS X. How to discontinue the RSS feed If you no longer wish to have this DailyMed RSS service, simply delete the copied URL from your",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}