{
    "relation": [
        [
            "Release",
            "10.0",
            "12.2(33)SRA",
            "12.2(33)SRB",
            "12.2SX"
        ],
        [
            "Modification",
            "This command was introduced.",
            "This command was integrated into Cisco IOS Release 12.2(33)SRA.",
            "This command was made available in router address family topology configuration mode.",
            "This command is supported in the Cisco IOS Release 12.2SX train. Support in a specific 12.2SX release of this train depends on your feature set, platform, and platform hardware."
        ]
    ],
    "pageTitle": "Cisco IOS IP Routing: OSPF Command Reference, Cisco IOS XE Release 3SE (Catalyst 3850 Switches) - OSPF Commands: A through Z [Cisco Catalyst 3850 Series Switches] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/iproute_ospf/command/iro-xe-3se-3850-cr-book/ospf-a1-xe-3se.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00175-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 374827643,
    "recordOffset": 374745732,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{52509=compatible rfc1587, 34988=compatible rfc1587}",
    "TableContextTimeStampAfterTable": "{205392=(Optional) Maximum metric value for LSAs. The configurable range is from 1 to 16777215. The default value is 16711680., 288296=The following example shows how to set a maximum of 1200 prefixes that can be redistributed into IS-IS. If the number of prefixes redistributed reaches 80 percent of 1200 (960 prefixes), a warning message is logged., 289811=The following example shows how to set a maximum of 1200 prefixes that can be redistributed into OSPF process when the number of prefixes redistributed reaches 80 percent of 1200 (960 prefixes), a warning message is logged. Another warning is logged when the limit is reached, and no more prefixes are redistributed., 569931=1000 milliseconds, 545419=Routing process \"ospfv3 1\" with ID 10.10.10.1, 575419=The following example sets the minimum interval for accepting the same LSA at 2000 milliseconds:, 607147=When you configure the ospfv3 network manet command on any interface attached to the OSPFv3 process, the default values for the spf-start, spf-hold, and the spf-max-wait arguments are reduced to 1000 milliseconds, 1000 milliseconds, and 2000 milliseconds respectively., 607913=The following example shows how to configure a router with the delay, hold, and maximum interval values for the timers throttle spf command set at 5, 1000, and 90,000 milliseconds, respectively., 531968=Hello due in 0:00:08, 289312=The following example shows how to set a maximum of 2000 prefixes that can be redistributed into OSPF process when the number of prefixes redistributed reaches 75 percent of 2000 (1500 prefixes), a warning message is logged. Another warning is logged when the limit is reached, and no more prefixes are redistributed., 569401=Minimum delay in milliseconds that must pass between acceptance of the same LSA arriving from neighbors. The range is from 0 to 600,000 milliseconds. The default is 1000 milliseconds., 573204=This command was introduced on Cisco ASR 1000 Series Routers., 608476=The following example shows how to configure a router using IPv6 with the delay, hold, and maximum interval values for the timers throttle spf command set at 500, 1000, and 10,000 milliseconds, respectively., 226510=(Optional) A number value that represents the poll interval time (in seconds). RFC 1247 recommends that this value be much larger than the hello interval. The default is 120 seconds (2 minutes). This keyword does not apply to point-to-multipoint interfaces. The range is from 0 to 4294967295 seconds., 334161=The following is sample output from the showipospf command. In this example, the user had configured the redistributionmaximum-prefix command to set a limit of 2000 redistributed routes. SPF throttling was configured with the timersthrottlespf command., 285910=This command was introduced on Cisco ASR 1000 Series Aggregation Services Routers., 170046=This command was modified. This command was implemented on the Cisco ASR 1006 Series Device. This command is now supported in address-family configuration mode., 217863=In older OSPF implementations (RFC 1247 and earlier implementations), the router link costs in received LSAs with a metric of LSInfinity are not used during SPF calculations, which means that no transit traffic will be sent to the routers that originate these LSAs., 342210=The following is sample showipospfcommand. In this example, the user had configured the redistributionmaximum-prefix command to set a limit of 2000 redistributed routes. SPF throttling was configured with the timersthrottlespf command., 55993=In Cisco IOS Release 15.1(2)S and later releases, RFC 3101 replaces RFC 1587, and RFC 3101 behavior is automatically enabled. You can choose the route selection behavior by configuring a router to run as RFC 3101 or RFC 1587 compatible., 249657=The following partial example initializes OSPF routing process 109, and defines four OSPF areas: 10.9.50.0, 2, 3, and 0. Areas 10.9.50.0, 2, and 3 mask specific address ranges, and area 0 enables OSPF for all other networks., 549850=NULL Encryption SHA-1 Auth, SPI 1001, 553228=Minimum LSA arrival 1000 msecs, 253=Configuring the OSPF Forwarding Address Suppression in Translated Type-5 LSAs feature causes the router to be noncompliant with RFC 1587. Also, suboptimal routing might result because there might be better paths to reach the destination’s forwarding address. This feature should not be configured without careful consideration and not until the network topology is understood., 356421=via 172.16.1.53, 56253=See Appendix F of RFC3101 The OSPF Not-So-Stubby Area (NSSA) Option for a detailed list of differences between RFC1587 and RFC3101., 52187=To replace RFC 3101 compatibility with RFC 1587 compatibility for route selection in not-so-stubby area (NSSA) Area Border Routers (ABRs), use the compatible rfc1587command in router configuration mode or address family configuration mode. To restore RFC 3101 compatibility, use the no form of this command., 492622=This command was integrated into Cisco IOS Release 12.0(21)ST, and support for Cisco 12000 series Internet Router was added.}",
    "textBeforeTable": "Syntax Description [nssa-only] [no-summary] [metric-type] ] [metric] [ default-information-originate [no-redistribution] nssa area-id area no [nssa-only] [no-summary] [metric-type] ] [metric] [ default-information-originate [no-redistribution] nssa area-id commandarea nssa area To configure a not-so-stubby area ( NSSA), use the area nssa command in router address family topology or router configuration mode. To remove the NSSA distinction from the area, use the no form of this command. area nssa timers throttle spf timers pacing retransmission timers pacing flood timers lsa arrival summary-address (OSPF) show ipv6 ospf show ip ospf virtual-links show ip ospf summary-address show ip ospf statistics show ip ospf sham-links show ip ospf request-list show ip ospf nsr show ip ospf neighbor show ip ospf interface show ip ospf flood-list show ip ospf database show ip ospf border-routers show",
    "textAfterTable": "nssa-only (Optional) Limits the default advertisement to this NSSA area by setting the propagate (P) bit in the type-7 LSA to zero. Command Default No NSSA area is defined. Command Modes Router address family topology configuration (config-router-af-topology) Router configuration (config-router) Command History Release Modification 10.0 This command was introduced. 12.2(33)SRA This command was integrated into Cisco IOS Release 12.2(33)SRA. 12.2(33)SRB This command was made available in router address family topology configuration mode. 12.2SX This command is supported in the Cisco IOS Release 12.2SX train. Support in a specific 12.2SX release of this train depends on your",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}