{
    "relation": [
        [
            "",
            "a) Total number of instructional faculty",
            "b) Total number who are members of minority groups",
            "c) Total number who are women",
            "d) Total number who are men",
            "e) Total number who are non-resident aliens (international)",
            "f) Total number with doctorate or other terminal degree",
            "g) Total number whose highest degree is master's (not terminal)",
            "h) Total number whose highest degree is a bachelor's",
            "i) Total number whose highest degree is unknown or other",
            "j) Total number in stand-alone graduate/professional programs"
        ],
        [
            "Full-time",
            "165",
            "27",
            "80",
            "85",
            "7",
            "157",
            "6",
            "2",
            "0",
            "0"
        ],
        [
            "Part-time",
            "66",
            "10",
            "34",
            "32",
            "2",
            "39",
            "18",
            "8",
            "1",
            "0"
        ],
        [
            "Total",
            "231",
            "37",
            "114",
            "117",
            "9",
            "196",
            "24",
            "10",
            "1",
            "0"
        ]
    ],
    "pageTitle": "Macalester Common Data Set",
    "title": "",
    "url": "http://www.macalester.edu/ir/institutionaldata/cds2010.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00326-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 562961311,
    "recordOffset": 562940434,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{32047=D2. Provide the number of students who applied, were admitted, and enrolled as degree seeking transfer students in fall 2010., 80315=6 October 2010, 37092=27 October 2010, 76327=Fall 2010 Number of Class Sections with Undergraduates Enrolled:, 29742=Does your institution have an application closing date? Yes. Application closing date (fall): January 15 Priority date: None., 30972=If yes, please complete the following: First or only early decision plan closing date: November 15. First or only early decision plan notification date: December 15 Other early decision plan closing date: January 3 Other early decision plan notification date: February 7, 30079=C17. Reply policy for admitted applicants: must reply by May 1. Deadline for housing deposit: May 1. Amount of housing deposit: $300 Refundable if student does not enroll? No, 72396=15 April 2011, 6439=Total all undergraduates: 2033, 13211=8 December 2010, 21813=C9. First-time first-year (freshmen) students enrolled in Fall 2010 who submitted SAT/ACT test scores., 63326=For graduates and loan types for questions H4 and H5: Include: 1) the 2010 undergraduate class who graduated between July 1, 2009 and June 30, 2010 who started at your institution as first-time students and received a bachelor's degree between July 1, 2009 and June 30, 2010 2) only loans made to students who borrowed while enrolled at your institution 3) co-signed loans Exclude: 1) those who transferred in 2) money borrowed at other institutions, 67736=Students notified on or about (date): April 1 Students notified on a rolling basis: No., 53047=Indicate academic year for which data are reported: 2010-2011 estimated, 49784=G1. Undergraduate full-time tuition, required fees, room and board for 2011-2012., 41660=29 September 2010, 29990=C16. Notification to applicants of admission decision sent: by March 30., 9783=B3. Persistence - Degrees Awarded from July 1, 2009 to June 30, 2010., 75989=Report the fall 2010 ratio of full-time equivalent students (full-time plus 1/3 part time) to full-time equivalent instructional faculty (full-time plus 1/3 part time)., 77866=10 November 2010, 41830=F1. Percentages of first-time, first-year (freshmen) students and all degree-seeking undergraduates enrolled in fall 2009 who fit the following categories:, 13503=Total first-time, first-year (freshmen) men who applied: 1773 Total first-time, first-year (freshmen) women who applied: 2544, 76167=Fall 2010 student to faculty ratio: 10.7 to 1. (based on 2002 students and 187 faculty), 6537=GRAND TOTAL ALL STUDENTS: 2033, 67406=Priority date for filing required financial aid forms: February 8 Deadline for filing required financial aid forms: March 1, 2714=29 September 2010, 78040=Degrees conferred between July 1, 2009 and June 30, 2010., 52040=9 March 2011, 20489=B. If your institution will make use of the ACT in admission decisions for first-time, first-year, degree seeking applicants for Fall 2012, please indicate your institution's policies, regardless of whether the writing score will be used in the admission process: ACT with or without Writing component accepted., 72575=I-1. Number of Instructional Faculty for Fall 2010, 1625=Name of college or university: Macalester College Mailing address: 1600 Grand Ave, St. Paul, MN 55105-1899 Street address (if different): same as above Main phone number: 651-696-6000 WWW home page address: www.macalester.edu Admissions phone number: 651-696-6357 Admissions toll-free number: 1-800-231-7974 Admissions office mailing address: same as above Admissions fax number: 651-696-6724 Admissions e-mail address: admissions@macalester.edu Is there a separate URL application site on the internet? No. Do you have a mailing address other than the above to which applications should be sent? No., 13645=Total first-time, first-year (freshmen) men who were admitted: 741 Total first-time, first-year (freshmen) women who were admitted: 1096, 21111=E. Latest date by which SAT or ACT scores must be received for fall-term admission: January 15. Latest date by which SAT Subject Test scores must be received for fall-term admission: N/A., 48=Macalester College 2010 Common Data Set, 48811=NOTE: Undergraduate full-time tuition for 2011-2012 is available after February 1, 2011. Tuition for 2010-2011 is available in the 2009 Common Data Set., 67951=Students must reply by (date): May 1., 51782=Books and supplies: $990 Transportation: $100 to $1000 Other (personal) expenses: $870, 10885=For the Fall 2004 cohort:, 19971=If yes, reflect your institutions policies for admission for Fall 2012 below:, 31277=For the Fall 2010 entering class: Number of early decision applications received: 234 Number of applicants admitted under early decision plan: 129, 31611=26 October 2010, 14251=If yes, please answer the questions below for fall 2010 admissions:}",
    "textBeforeTable": "Instructional faculty is as defined by the American Association of University Professors (AAUP) in its annual Faculty Compensation Survey. I-1. Number of Instructional Faculty for Fall 2010 I. INSTRUCTIONAL FACULTY AND CLASS SIZE 15 April 2011 --> Back to Contents H15. If your insitution has recently implemented any major financial aid policy, program, or initiative to make your institution more affordable to incoming students such as replacing loans with grants, or waiving costs for families below a certain income level, please provide details.   ----------   ROTC     State/district residency     Job skills     Religious affiliation     Athletics     Music/drama     Art     Minority status    X Alumni affiliation     Leadership     Academics    X   Need -based Non -need based   Need -based Non -need based H14. Check off criteria used in awarding institutional aid. Check all that apply. NEED-BASED: Federal Pell SEOG",
    "textAfterTable": "I-2. Student to Faculty Ratio Report the fall 2010 ratio of full-time equivalent students (full-time plus 1/3 part time) to full-time equivalent instructional faculty (full-time plus 1/3 part time). Fall 2010 student to faculty ratio: 10.7 to 1. (based on 2002 students and 187 faculty)   I-3. Undergraduate Class Size Fall 2010 Number of Class Sections with Undergraduates Enrolled:   2-9 10-19 20-29 30-39 40-49 50-99 100+ Total Class Sections 54 218 107 29 9 6 0 423 Class Sub-Sections 54 74 14 0 0 0 0 142 --> Back to CDS Contents 10 November 2010 J. DEGREES CONFERRED Degrees conferred between July 1, 2009 and June 30, 2010. Percentages of degrees awarded are based on number of majors, not headcount (e.g. students with one degree but a double major will be represented twice). Percentages are calculated using the sum of first and second majors in each area of the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}