{
    "relation": [
        [
            "Name",
            "01 - Lonely Road (Nu Nu).mp3",
            "02 - From A Lover To A Friend.mp3",
            "03 - She Given Up Talking.mp3",
            "04 - Driving Rain.mp3",
            "05 - I Do.mp3",
            "06 - Tiny Bubble.mp3",
            "07 - It Must Have Been Magic.mp3",
            "08 - Your Way.mp3",
            "09 - Spinning On An Axis.mp3",
            "10 - About You.mp3",
            "11 - Heather.mp3",
            "12 - Back In The Sunshine Again.mp3",
            "13 - Loving Flame.mp3",
            "14 - Riding Into Jaipur.mp3",
            "15 - Rinse The Raindrops.mp3"
        ],
        [
            "Size",
            "6 284 434",
            "7 315 957",
            "9 514 422",
            "6 640 535",
            "5 645 792",
            "8 360 019",
            "7 638 622",
            "5 609 012",
            "10 127 987",
            "5 583 098",
            "6 586 200",
            "8 401 815",
            "7 156 297",
            "7 934 537",
            "19 467 702"
        ],
        [
            "Length",
            "03:16",
            "03:48",
            "04:57",
            "03:27",
            "02:56",
            "04:21",
            "03:58",
            "02:55",
            "05:16",
            "02:54",
            "03:25",
            "04:22",
            "03:43",
            "04:07",
            "10:08"
        ],
        [
            "Bitrate",
            "256",
            "256",
            "256",
            "256",
            "256",
            "256",
            "256",
            "256",
            "256",
            "256",
            "256",
            "256",
            "256",
            "256",
            "256"
        ]
    ],
    "pageTitle": "Paul McCartney. Discography. Music. Albums. Tracks.",
    "title": "",
    "url": "http://www.moodbook.com/music/paul-mccartney.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00309-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 590718287,
    "recordOffset": 590697108,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{653=Paul McCartney is the most commercially successful rock composer of all time, both as a solo performer (with his '70s band Wings) and, most notably, as a member of The Beatles. McCartney's songs have hundreds of millions of copies worldwide; \"Yesterday,\" written for the Beatles in 1965, has been played over six million times on U.S. radio stations, making it the most popular song in history. McCartney also holds the world record for largest paid audience at a concert given by a solo performer, drawing over 184,000 fans at a 1990 concert in Rio de Janeiro. Paul McCartney is a multi-billionaire., 3735=Things quickly grew worse. Later in the year Klein brought in famed pop producer Phil Spector to prepare the abandoned 1969 Get Back sessions for release as Let It Be. McCartney became angry when Spector began inserting his trademark string arrangements and female backup vocals in several songs, most notably McCartney's own \"The Long And Winding Road.\" Frustrated with the Beatles, McCartney, like the three other members of the group, began working on a solo album. The album, simply titled McCartney, was ready in early 1970, but Klein insisted it be withheld for several months to avoid cutting into sales of Let It Be. For McCartney, this was the last straw. He ignored Klein and released McCartney in April 1970, a full month before the scheduled release of Let It Be. In an April 10, 1970 magazine interview promoting his solo album, McCartney stated that he was no longer with the Beatles, that the group was no more. Though talk of a breakup had been brewing for many months, Paul's announcement angered the other Beatles, especially John, who accused McCartney of using the breakup to boost sales of his solo album when in fact John had been the first to suggest an end to the Beatles, nearly a year before. McCartney burned his bridges when on December 31, 1970 he filed suit against Klein and the other Beatles to dissolve their artistic and commercial partnership, forming his own company, McCartney Productions., 8413=In 1982 McCartney released his third solo album, Tug of War, a critical and commercial hit recorded with former Beatles producer George Martin. The album showcased the No. 1 single \"Ebony and Ivory,\" a duet recorded with Stevie Wonder. The following year McCartney began working closely with Michael Jackson, contributing vocals to Jackson's first hit single \"The Girl Is Mine,\" while Jackson sang on McCartney's next single, the No. 1 charting \"Say Say Say,\" featured on 1983's Pipes of Peace. Not long after McCartney made his directorial debut with the 1984 film flop Give My Regards to Broad Street (to which he naturally contributed the top-selling soundtrack), the infatuated Jackson purchased the publishing rights to the Lennon-McCartney catalog, angering McCartney and ending their creative relationship., 1384=Born James Paul McCartney in Liverpool, England on June 18, 1942, McCartney showed an early interest in music, no doubt encouraged by his father, who was a part-time jazz musician. At age 14 Paul's mother died of cancer, but despite the trauma McCartney remained an outstanding student and even began playing guitar, learning the instrument before he was 15. While at a church picnic in the summer of 1957, McCartney was introduced by a friend to an older schoolmate, John Lennon, who played in a skiffle band called the Quarrymen. Paul soon joined the group and, along with John, became its principle songwriter. Over the next few years the group evolved into the Beatles, with Paul switching to bass. McCartney and Lennon agreed early on to share all songwriting credits, even though they directly collaborated on only a handful on songs; throughout the Beatles years \"McCartney-Lennon\" wrote and sang the vast majority of Beatles tunes., 5183=While the Beatles breakup drama was being played out before a distraught public, sales of McCartney were booming. The album, recorded with Paul playing all instruments and Linda on backup vocals, was composed of McCartney compositions rejected by the Beatles as well as new songs, and sat at the top of the U.S. charts for nearly a month. In 1971 McCartney released the hit single \"Another Day\" in advance of his second solo work, Ram, produced in full collaboration with Linda. After the release of Ram, McCartney formed the band Wings, consisting of Paul on bass and lead vocals, Linda on keyboards and backing vocals, ex-Moody Blues members Denny Laine on guitar and Denny Seiwell on drums. Wings released their first album, Wild Life, in December of 1971; the record was lambasted by critics as shallow, and consequently sold rather poorly., 6049=Adding guitarist Henry McCulloch, formerly with Joe Cocker's band, Wings began touring the U.K. in 1972, releasing three British singles. Like Wild Life, 1973's Red Rose Speedway earned poor reviews, but unlike Wild Life it reached No. 1 in the U.S. The McCartney-penned theme to the James Bond movie Live and Let Die also became a Top 10 hit. McCulloch and Seiwell left Wings, leaving the McCartneys to record 1973's Band on the Run. The new album was considered quite a comeback, McCartney's best post-Beatles material, and went to No. 1 in the U.S., selling over three million copies., 6648=Encouraged by his changing fortunes, McCartney revitalized Wings by adding session guitarist Jeff McCulloch and ex-East of Eden drummer Geoff Britton to the lineup. The McCartneys also became outspoken proponents of animal rights, and frequently discussed their vegetarian lifestyle. The new Wings scored another hit with 1975's Venus and Mars. McCartney allowed other band members to help write songs for 1976's At the Speed of Sound, the first true group effort by Wings. The album was another hit, and was followed by the band's first and only U.S. tour (commemorated on the live Wings Over America album). After taking most of 1977 off, Wings returned in 1978 with the platinum-selling London Town, featuring the U.K. No. 1 single \"Mull of Kintyre,\" which sold over two million copies on its own, an all-time British record. McCulloch left the group later that year to join the re-formed Small Faces, but Wings continued on without him, releasing Back to the Egg in 1979, another commercial hit., 2359=After signing with EMI in 1962 the Beatles began releasing a string of hit singles, mostly McCartney-Lennon originals, and soon became the most popular band in Britain. By 1964 \"Beatlemania\" had spread to the U.S., and soon the Beatles were the most popular band in the world, producing numerous commercially successful and increasingly artistic albums over the next decade. Unfortunately by 1968 troubles began surfacing in the band, as the superstars began disagreeing over the band's musical direction and pursued increasingly independent personal lives. On March 12, 1969 McCartney married American photographer Linda Eastman. When it came time to select a new business manager for the Beatles several months later, McCartney suggested Linda's father, Lee Eastman. Other members, particularly Lennon, favored the savvy American businessman Allen Klein. McCartney was outvoted and Klein was hired, creating further tensions in the already troubled group and straining the relationship between Paul and his longtime friend Lennon (who was increasingly under the influence of his new wife, Yoko Ono). At the same time, McCartney had to fend off irritating rumors that he had died several years before and that \"Paul\" was actually a Paul look-alike. Though amusing, this was the last thing McCartney needed at this stressful time in his career., 10250=Though he delivered another standard McCartney pop-rock record in 1993, Off the Ground, McCartney began to experiment with other genres of music. In 1991 he composed the Liverpool Oratorio, later performed by the London Symphony Orchestra, while in 1994 McCartney worked with former Killing Joke member Youth on an ambient album called Strawberries Oceans Ships Forest, released under the name \"Fireman.\" McCartney became very busy in 1995, penning another classic piece (\"The Leaf\"), hosting a syndicated American radio show, and working with BBC producers on a documentary on the Beatles. Recognizing the Beatles' enduring popularity, when the three remaining members met while contributing to the documentary, they began working with EMI/Capitol to record music for two unreleased John Lennon demo tapes, \"Free As a Bird\" and \"Real Love.\" These \"new\" Beatles songs, along with numerous long-forgotten Beatles demos and outtakes, were packaged as the multi-platinum selling Anthology series of double albums. Riding high on the resulting wave of Baby Boomer nostalgia, McCartney released a new solo album in early 1997, Flaming Pie. The album entered the charts at No. 2 in both the U.S. and U.K. and received a Grammy nomination for Album of the Year. The same year, McCartney was knighted by Queen Elizabeth II, becoming Sir Paul McCartney., 11656=1998 brought sadness with the death of Linda McCartney, who lost a long battle with cancer on April 17. Paul McCartney remained inactive for almost a year, returning in 1999 with Run Devil Run, a lighthearted collection of classic rock 'n roll tunes by the likes of Carl Perkins, Larry Williams and Little Richard. Despite the inevitable difficulty of coping with personal loss, things began to look up for McCartney. In 2000, he confirmed his romantic involvement with former model Heather Mills, who he met through his activity in animal rights causes. Later that year, Capitol released his next album, an ambient project titled Liverpool Sound Collage, on which he collaborated with Youth as well as Welsh rockers Super Furry Animals. McCartney and Mills announced their engagement the following year., 7746=In early 1980 Wings prepared for a Japanese tour, only to encounter trouble at the border: A small amount of marijuana was found in Paul McCartney's luggage, and the singer-songwriter was imprisoned. After 10 days McCartney was released without any charges being filed, though he had to leave the country and the tour was canceled. Following a U.K. tour McCartney went on hiatus from Wings to record McCartney II, another solo album on which he played all of the instruments himself. After longtime friend John Lennon was murdered in December 1980, McCartney decided not to lead a planned Wings tour. Laine left the band in protest, breaking up the group., 9268=After scoring the 1985 comedy Spies Like Us and delivering a sensational performance of \"Let It Be\" at that summer's Live Aid extravaganza, McCartney returned to recording with the 1986 album Press to Play, followed by the Russian cover album Snova v SSSR, which was not released in the West until 1991. In 1989 McCartney began working with Elvis Costello, much as he had worked with Michael Jackson a few years earlier: Costello assisted with McCartney's 1989 hit Flowers in the Dirt, while McCartney wrote a few songs with Costello for his new album, Spike. McCartney, accompanied by a backup band, embarked on a world tour, his first since 1979 and easily one of the most popular in concert history, breaking attendance records in several countries. After appearing on MTV's new \"Unplugged\" show, McCartney released sessions recorded at the show as 1991's Unplugged, the first of what was to become a franchise of \"MTV Unplugged\" albums.}",
    "lastModified": "Tue, 09 Apr 2013 16:57:36 GMT",
    "textBeforeTable": "McCartney (1970) 2007, Memory Almost Full 2005, Chaos And Creation In The Backyard 2003, Back In The World 2001, Wingspan (CD2) 2001, Wingspan (CD1) 2001, Driving Rain 1999, Working Classical 1999, Run Devil Run 1997, Flaming Pie 1993, Paul Is Live 1993, Off The Ground 1991, Unplugged (The Official Bootleg) (Live) 1991, Back In The USSR 1990, Tripping The Live Fantastic 1989, Flowers In The Dirt 1986, Press To Play 1984, Give My Regards To Broad Street 1983, Pipes Of Peace 1982, Tug Of War 1980, McCartney II 1979, Back To The Egg 1978, London Town 1977, Thrillington 1976, Wings Over America (Live) 1976, Wings At The Speed Of Sound 1975, Venus And Mars 1973, Red Rose Speedway 1973, Band On The Run 1971, Wild Life 1971, Ram 1970, McCartney ♪ Discography //--> google_ad_height = 90; google_ad_width = 728; google_ad_slot = \"9096547833\"; google_ad_client = \"ca-pub-5539422814247692\";",
    "textAfterTable": "01 - Too Many People.flac 27 709 187 04:10 880 02 - 3 Legs.flac 16 130 729 02:47 770 03 - Ram On.flac 13 248 473 02:27 720 04 - Dear Boy.flac 13 309 719 02:12 800 05 - Uncle Albert - Admiral Hasley.flac 30 031 972 04:54 810 06 - Smile Away.flac 25 002 330 03:51 860 07 - Heart Of The Country.flac 13 324 914 02:21 750 08 - Monkberry Moon Delight.flac 34 819 029 05:21 860 09 - Eat At Home.flac 20 076 594 03:19 800 10 - Long Haired Lady.flac 37 875 763 06:04 830 11 - Ram On.flac 5 045 258 00:54 740 12 - The Back Seat Of My Car.flac 26 717 927 04:29 790 Wild Life (1971) Name Size Length Bitrate 01 - Mumbo.flac 28 193 014 03:57 940 02 - Bip Bop.flac 22 861 893 04:09 730 03 - Love Is Strange.flac 30 706 786 04:51 840 04 - Wild Life.flac 40 129 556 06:41 790 05 - Some People Never Know.flac 39 671 213 06:36 800 06 - I Am Your Singer.flac 10 616 385 02:18 610 07 - Tomorrow.flac 20 617 719 03:27 790 08 - Dear Friend.flac 27",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}