{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "for students who like a smaller learning environment, and to feel like you are not just a number, webster is the place for you.",
            "there are plenty of opportunities to get involved in at webster. there are plenty of clubs and organizations. if you like sports there are so many sporting events going on at all times.",
            "the menu at webster is phenomenal. a lot of options and great tasting food. my mom is afraid i won't like her cooking anymore because their cooking is so good.",
            "get involved. ask questions.",
            "webster university in webster groves, missouri is has the small school environment, and also a big school experience. the class sizes are small and the professors are very helpful. i feel like they care about my success at webster!"
        ]
    ],
    "pageTitle": "Webster University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Webster-University/reviews?_escaped_fragment_=/show/14572",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 888021755,
    "recordOffset": 887960477,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{231119=Webster University has provided me with the skills I need to move forward with my professional career. The small classes and updated curriculum assures me that my education equips me with the most current skill set available. I graduate in May 2013 and feel extremely confident in my abilities to get a successful career., 285664=There's a Yule Ball every December, held by Webster Quidditch. As far as locations OF campuses, we have several international campuses in Europe, Asia, and Africa!, 314031=© 2015, Cappex.com, LLC, 201796=Go to the library, the Delmar Loop, downtown St. Louis or make friends! There is a lot to do if you know what to look for. Connect with upperclassmen for this.}",
    "textBeforeTable": "08/23/2009 Reviewer is A current student here. 5 out of 7 people found this review useful. 1 of 70 Kevin from St Louis, MO Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Campus Safety incredibly safe. check out the crime statistics for webster, and you will see (especially compared to many other local universities) a low amount of crimes and virtually no sexual assaults. Greek Life there is one sorority on campus. Clubs and Activities there are multiple language and game clubs available. language clubsa re a great way to meet people that speak a language you are learning/ already know, and game clubs range from board games to video games to quidditch on the quad. Great for these types of students conservatory and art students. Share any unusual traditions or locations on campus i like to walk near the lake every now and then. it's relaxing. What to do for fun enjoy a play, party at the apartments, or enjoy the hot tub that is open year round. humans versus zombies is amazing every season. Food and Dining few choices with on campus dining. there are many places to eat out nearby, including mcdonalds and subway. Dorm Life",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}