{
    "relation": [
        [
            "Shipping and handling",
            "Free shipping",
            "US $8.99",
            "US $18.99"
        ],
        [
            "Each additional item",
            "Free",
            "US $6.99",
            "US $8.99"
        ],
        [
            "To",
            "United States",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Shipping",
            "Expedited Shipping (FedEx Express Saver®)",
            "Express Shipping (FedEx Standard Overnight®)"
        ],
        [
            "Delivery*",
            "Estimated within 2-7 business days",
            "Estimated within 2-5 business days",
            "Estimated within 2 business days"
        ]
    ],
    "pageTitle": "CAR Cassette Tape Adapter FOR MP3 Ipod Nano CD Iphone White | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/Car-Cassette-Tape-Adapter-for-MP3-IPOD-Nano-CD-IPHONE-White/380845715685?hash=item58ac2c70e5",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00231-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 411297271,
    "recordOffset": 411234480,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{180853=Copyright © 2006-2015 YallStore. All rights reserved.}",
    "textBeforeTable": "Please enter 6 digits for the Postal Code. Please enter a valid Postal Code. Postal Code: Select a valid country. There are 1,487 items available. Please enter a number less than or equal to 1,487. -Select- Afghanistan American Samoa Angola Anguilla Antigua and Barbuda Armenia Aruba Azerbaijan Republic Bahamas Bahrain Bangladesh Barbados Belize Benin Bermuda Bhutan Bolivia Botswana Brazil British Virgin Islands Brunei Darussalam Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Islands Cayman Islands Central African Republic Chad Chile Colombia Comoros Congo, Democratic Republic of the Congo, Republic of the Cook Islands Costa Rica Cote d Ivoire (Ivory Coast) Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin Postal Code, destination Postal Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Will usually ship within 1 business day of receiving cleared payment - opens in a new window or tab. Return policy Item must be returned within Refund will be given as 30 days after the buyer receives it Money back or replacement (buyer's choice) The buyer is responsible for return shipping costs.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}