{
    "relation": [
        [
            "Rank",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20"
        ],
        [
            "Team",
            "Louisiana State",
            "Iowa",
            "Army",
            "Auburn",
            "Oklahoma",
            "Air Force",
            "Wisconsin",
            "Ohio State",
            "Syracuse",
            "Texas Christian",
            "Mississippi",
            "Clemson",
            "Purdue",
            "Florida",
            "South Carolina",
            "California",
            "Notre Dame",
            "Southern Methodist",
            "Oklahoma State",
            "Rutgers"
        ]
    ],
    "pageTitle": "1958 college football season - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/1958_college_football_season",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 847638127,
    "recordOffset": 847608707,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{10165=September 27 #1 Ohio State narrowly beat SMU at home, 23-20, and fell to third in the next poll. #2 Oklahoma, on the other hand, rolled over visiting West Virginia 47-14, and rose to first place. #3 Auburn beat Tennessee in Birmingham, 13-0, and #4 Michigan State beat California 32-12. #5 Notre Dame beat Indiana 18-0, but fell to 7th, while #8 Army, which beat South Carolina 45-8, took the place of the Irish., 13630=On October 18 at West Point, New York, #1 Army beat Virginia 35-6. #2 Auburn tied with Georgia Tech 7-7 in Atlanta and fell in the polls. #3 Ohio State beat Indiana 49-8. #4 Wisconsin lost to Iowa at home, 20-9, and #5 Michigan State began a five-game losing streak with a 14-6 defeat at Purdue. The Spartans would finish the season with a 3-5-1 record after starting 2-0-1. #7 Texas (24-6 over Arkansas) and #9 LSU (32-7 over Kentucky) rose in the polls., 8775=Most teams did not begin play until September 27. On September 13, Kentucky beat Hawaii 51-0 in a game in Louisville, and attempted the 2-point conversion, but without success [5] One of the first successful 2-point conversions in an NCAA game happened when Iowa State Teachers College hosted Bradley University at Cedar Falls, Iowa on September 13. Max Huffman carried the ball over twice on conversion attempts to give the Panthers of Iowa Teachers a 29-12 win over the Braves.[6] On September 20, #6 Mississippi and #8 Texas Christian were among the winners, beating Memphis State (17-0) and Kansas (42-0) respectively, but the Top Five schools had not yet started play., 4103=During the 20th century, the NCAA had no playoff for the college football teams that would later be described as \"Division I-A\". The NCAA did recognize a national champion based upon the final results of \"wire service\" (AP and UPI) polls. The extent of that recognition came in the form of acknowledgment in the annual NCAA Football Guide of the \"unofficial\" national champions. The AP poll in 1958 consisted of the votes of as many as 203 sportswriters. Though not all writers voted in every poll, each would give their opinion of the twenty best teams. Under a point system of 20 points for first place, 19 for second, etc., the \"overall\" ranking was determined. Although the rankings were based on the collective opinion of the representative sportswriters, the teams that remained \"unbeaten and untied\" were generally ranked higher than those that had not. A defeat, even against a strong opponent, tended to cause a team to drop in the rankings, and a team with two or more defeats was unlikely to remain in the Top 20. The top teams played on New Year's Day in the four major postseason bowl games: the Rose Bowl (near Los Angeles at Pasadena), the Sugar Bowl (New Orleans), the Orange Bowl (Miami), and the Cotton Bowl (Dallas)., 11507=October 4 #1 Oklahoma got past visiting Oregon, 6-0, and dropped to second. #2 Auburn, which beat UT-Chattanooga 30-8 at home, moved up to the top spot. #3 Ohio State beat Washington at home, 12-7. #4 Michigan State played Michigan to a 12-12 tie, and fell to 9th. #5 Army beat Penn State 26-0. #7 Notre Dame, which beat SMU in Dallas, 14-6, returned to the Top Five., 19880=The final AP Poll was released on December 1, and the #1 LSU Tigers, at 10-0-0, won the AP Trophy with 130 of the first place votes. The other 73 votes were spread among 12 schools, including Rose Bowl bound #2 Iowa (17), #3 Army (13), #4 Auburn (9), #5 Oklahoma (10), #6 Air Force (2), #7 Wisconsin (13), #8 Ohio State (3), and #9 Syracuse Orangemen. The United States Air Force Academy football team, nicknamed the Falcons, had a 9-0-1 record in only their second year of playing college football, and accepted a bid to face Texas Christian University in the Cotton Bowl., 19422=On November 29 #2 Auburn defeated Alabama 14-8 in Birmingham to finish its season at 9-0-1. #3 Oklahoma won at Oklahoma State 7-0. In Philadelphia, #5 Army beat Navy, 22-6, to finish its season 8-0-1., 2488=The 1958 NCAA University Division football season was notable in that it was the first to feature the two-point conversion. On January 13, 1958, the 11-man NCAA Rules Committee unanimously approved a resolution to allow teams to choose between kicking an extra point after a touchdown, or running or passing from the 3-yard line for 2 points. University of Michigan athletic director Fritz Crisler said at the meeting in Fort Lauderdale, \"It's a progressive step which will make football more interesting for the spectators,\" adding that the rule \"will add drama to what has been the dullest, most stupid play in the game.\"[3], 16038=November 1 #1 LSU beat Ole Miss 14-0 #2 Iowa won at Michigan, 37-14. #3 Army crushed Colgate, 68-6. #4 Auburn won 6-5 at Florida. In Columbus, #5 Ohio State was upset by visiting#11 Northwestern, 21-0. The next poll was: 1.LSU 2.Iowa 3.Army 4.Northwestern 5.Auburn, 12475=October 11 #5 Ohio State won at Illinois, 19-13 #1 Auburn won at Kentucky, 8-0. #2 Oklahoma sustained a 15-14 loss at Dallas in their annual meeting with the Texas Longhorns. In South Bend, Indiana, the visiting #3 Army Cadets (or Black Knights) beat #4 Notre Dame, 14-2, and were voted #1 in the next poll. #6 Wisconsin, which beat Purdue 31-6, and #9 Michigan State, which beat Pittsburgh 22-8, rose in the polls, to put Big Ten schools at #3, #4 and #5. The poll:, 18444=November 22 In New Orleans, the #1 LSU Tigers crushed Tulane 62-0, to close their season with a 10-0-0 record. They would face the Clemson Tigers in the Sugar Bowl. Behind them, were the #2 Auburn Tigers, who beat Wake Forest at home 21-7. #3 Army was idle as it prepared for the annual Army-Navy game. #4 Oklahoma crushed Nebraska 40-7. #5 Wisconsin beat Minnesota to close its season at 6-1-1. #6 Iowa, which beat Notre Dame 31-21, returned to the Top 5. 1.LSU 2.Auburn 3.Oklahoma 4.Iowa 5.Army, 14736=October 25 For the top-ranked teams, a tie was only slightly better than a loss. #1 Army played to a 14-14 tie against the Panthers at Pittsburgh, and #2 Ohio State tied with Wisconsin at home 7-7. #3 LSU beat Florida 10-7, and the win was enough to propel it to first place. #4 Texas lost to the Rice Owls in Houston, 34-7. #5 Auburn beat Maryland at home, 20-7. #7 Iowa, which beat Northwestern 26-20, rose to 2nd in the next poll., 17566=November 15 #1 LSU beat Mississippi State at Jackson 7-6. #2 Iowa lost at home to Ohio State 38-28. #3 Army beat Villanova 26-0. #4 Auburn met the Georgia Bulldogs halfway in Columbus, Georgia, and won 21-6. #5 Wisconsin. #6 Oklahoma, which beat Missouri 39-0, rose to 4th. The poll was: 1.LSU 2.Auburn 3.Army 4.Oklahoma 5.Wisconsin, 7823=In the preseason poll released on September 15, 1958, the Buckeyes of Ohio State University were the first place choice for 46 of 99 writers casting votes, followed by Oklahoma, Notre Dame, Michigan State and 1957's champion, Auburn .[4] As the regular season progressed, a new poll would be issued on the Monday following the weekend's games., 16800=November 8 #1 LSU beat Duke 50-18. #2 Iowa won at Minnesota 28-6. #3 Army beat the Rice Owls in Houston, 14-7. #4 Northwestern lost at Madison to #7 Wisconsin, 17-13. #5 Auburn beat Mississippi State 33-14 at home. The next poll was: 1.LSU 2.Iowa 3.Army 4.Auburn 5.Wisconsin, 105560=The UPI conducted a \"small college\" coaches' poll. In 1958, the first year for the poll, Mississippi Southern (now USM), which had beaten N.C. State and Virginia Tech en route to a 9-0-0 record, was #1 from start to finish, followed by #2 Miami University (Oxford, Ohio), #3 Arizona State College (Flagstaff), #4 Northeastern (Oklahoma), and #5 East Texas State. .[9] The third annual NAIA championship game, held in St. Petersburg, Florida, and called the Holiday Bowl, pitted the #4 Northeastern State Redmen against the Lumberjacks of #3 Arizona State College (Flagstaff) (now Northern Arizona University). Northeastern won, 19-13., 78718=Notably, the Tangerine Bowl initially extended a bid to Buffalo. However, when the bowl organizers told the school that its two black players would not be allowed to play, the team unanimously voted to turn down the bid.[8] The Bulls would not appear in a bowl game until the 2008 season.}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "Bowl games[edit] † – Conference champion Rankings from AP Poll 0 – 7 – 3     0 – 5 – 1 Baylor 0 – 6 – 4     0 – 4 – 2 Texas A&M 0 – 6 – 4     0 – 4 – 2 Arkansas 0 – 3 – 7     0 – 3 – 3 Texas 0 – 5 – 5     0 – 2 – 4 Rice 0 – 4 – 6     0 – 2 – 4 #18 SMU 1 – 2 – 8     0 – 1 – 5 #10 TCU † T   L   W     T   L   W Team Overall     Conf e t",
    "textAfterTable": "1 Ohio State 2 Oklahoma 3 Notre Dame 4 Michigan State 5 Auburn 6 Mississippi 7 Navy 8 TCU 9 Army 10 North Carolina 11 Texas 12 Oregon State 13 Iowa 14 Wisconsin 15 Mississippi State 16 Miami 17 SMU 18 Clemson 19 Pittsburgh 20 Texas A&M Week 1: 9/22/58 Rank Team 1 Ohio State 2 Oklahoma 3 Auburn 4 Michigan State 5 Notre Dame 6 TCU 7 Pittsburgh 8 Army 9 Mississippi 10 Washington State 11 Mississippi State 12 Navy 13 West Virginia 14 Wisconsin 15 LSU 15 Miami 17 Kentucky 18 Florida 18 South Carolina 20 SMU Week 2: 9/29/58 Rank Team 1 Oklahoma 2 Auburn 3 Ohio State 4 Michigan State 5 Army 6 Mississippi 7 Notre Dame 8 Iowa 9 Wisconsin 10 Clemson 11 Mississippi State",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}