{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Evangelical Protestant",
            "Other",
            "Mainline Protestant",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "280,324",
            "221,258",
            "63,064",
            "53,412",
            "17,866",
            "5,648",
            "1,106,494"
        ],
        [
            "Congregations",
            "47",
            "701",
            "143",
            "88",
            "45",
            "16",
            "-"
        ]
    ],
    "pageTitle": "Deerfield Beach, Florida (FL) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Deerfield-Beach-Florida.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00062-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 364783567,
    "recordOffset": 364643052,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{132928=Deerfield Beach: Winter Sunrise Feb 2009 Deerfield Beach, 7628=According to our research of Florida and other state lists there were 40 registered sex offenders living in Deerfield Beach, Florida as of July 29, 2015. The ratio of number of residents in Deerfield Beach to the number of sex offenders is 1,936 to 1. The number of registered sex offenders compared to the number of residents in this city is a lot smaller than the state average.}",
    "TableContextTimeStampAfterTable": "{41360=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 5.98. This is significantly better than average. Closest monitor was 1.7 miles away from the city center., 61785=2008 Presidential Elections Results, 191886=Total of 204 patent applications in 2008-2015., 39906=Ozone [ppb] level in 2012 was 25.1. This is better than average. Closest monitor was 1.7 miles away from the city center., 62355=Graphs represent county-level data. Detailed 2008 Election Results, 37809=Air Quality Index (AQI) level in 2012 was 65.3. This is about average., 17332=On 3/1/1980, a category F3 (max. wind speeds 158-206 mph) tornado 4.5 miles away from the Deerfield Beach city center killed one person and injured 33 people and caused between $5,000,000 and $50,000,000 in damages., 31996=Tourist attractions: Deerfield Beach Historical Society-Butler House (Museums; 380 East Hillsboro Boulevard), Broward County - Deerfield BCH Percy White Branch- Libraries Division- Branch Libraries- Courth (Cultural Attractions- Events- & Facilities; 837 East Hillsboro Boulevard), African Safari Trails (Tourism Consultants; 2621 North Federal Highway), Broward County - Libraries Division- Branch Libraries- Courthouse- Century Plaza Br (Cultural Attractions- Events- & Facilities; 1892 West Hillsboro Boulevard)., 39173=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 4.99. This is better than average. Closest monitor was 4.8 miles away from the city center., 20878=Birthplace of: Brent Schaeffer - Football player, Canton Jones - Christian musician and Christian hip-hop artist, Charlene Honeywell - Judge, Brandon McThay - College basketball player (Lamar Cardinals), Elton Nesbitt - College basketball player (Georgia Southern Eagles), Jimmie Sutton - College basketball player (Florida Gators)., 60927=1996 Presidential Elections Results, 57709=Educational Attainment (%) in 2013, 61499=2004 Presidential Elections Results, 17658=On 2/23/1965, a category F3 tornado 9.4 miles away from the city center injured 6 people and caused between $50,000 and $500,000 in damages., 85149=8.22% of this county's 2011 resident taxpayers lived in other counties in 2010 ($37,316 average adjusted gross income), 32563=Hotels: Ashley Brooke Motel (665 Southeast 20th Avenue), Block-To-Beach Inns (381 Southeast 20th Avenue), Beach Villas of Deerfield (1907 Northeast 2nd Street Apt 5), Avalon Resort (735 Southeast 20th Avenue), Berkshire Beach Club of Deerfield (500 Northeast 21st Avenue), Beachside Gardens Convenience Suites (2019 Northeast 4 Court), Carriage House Resort Motel (250 Southeast 20th Avenue), Carriage House Resort (Ip) (250 SE 20th Ave), Cagney's Crabhouse (950 Southeast 20th Avenue)., 62071=2012 Presidential Elections Results, 61213=2000 Presidential Elections Results, 40611=Particulate Matter (PM10) [µg/m3] level in 2012 was 22.7. This is about average. Closest monitor was 3.6 miles away from the city center., 87382=7.20% of this county's 2010 resident taxpayers moved to other counties in 2011 ($37,956 average adjusted gross income), 193243=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 38456=Carbon Monoxide (CO) [ppm] level in 2008 was 0.362. This is about average. Closest monitor was 6.1 miles away from the city center., 58107=School Enrollment by Level of School (%) in 2013}",
    "textBeforeTable": "Religion statistics for Deerfield Beach city (based on Broward County data) West Deerfield Beach neighborhood Shorewood neighborhood Little Harbor on the Hillsboro (Little Harbor) neighborhood Lakeview neighborhood Fairlawn neighborhood Coral Manor neighborhood College Park neighborhood Carver Heights neighborhood Broward Highlands neighborhood Barwal neighborhood Arlington Park neighborhood Deerfield Beach, Florida Neighborhood Map) Neighborhoods in Deerfield Beach:( Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 359 Broward County: 2.05 / 10,000 pop. Florida: 2.04 / 10,000 pop. Number of supercenters and club stores: 15 This county: 0.09 / 10,000 pop. State: 0.11 / 10,000 pop. Number of convenience stores (no gas): 268 Broward County: 1.53 / 10,000 pop. Florida: 1.28 / 10,000 pop. Number of convenience stores (with gas): 391 Broward County: 2.24 / 10,000 pop. State: 3.04 / 10,000 pop. Number of full-service restaurants: 1,399 Here: 8.00 / 10,000 pop. State: 7.45 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}