{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They always have events going on that involve something educational and will include food with it.",
            "I can not rate it because it is a community college. I live with my parents.",
            "The professors are always so motivated to teach. Everyday is a chance to learn something new.",
            "Stay involved inside and outside of school! There are so many things to learn and people are always so anxious to tell you what they know. Be alert, open to new things, and spend your time wisely!",
            "I rate Germanna Community college a 9 out of 10. I truly enjoy my school. It has a relaxing atmosphere and the people are so friendly."
        ]
    ],
    "pageTitle": "Germanna Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Germanna-Community-College/reviews?_escaped_fragment_=/show/112296",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00309-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897525071,
    "recordOffset": 897496418,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{130952=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/01/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 35 Carolyne from Fredericksburg, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Campus Safety very safe campus. Greek Life None really Clubs and Activities there are different sport teams to choose from. Great for these types of students trying to get some place in life Share any unusual traditions or locations on campus don't dress up for classes Bang for the buck this is a great place to start you college. What to do for fun interact with classmates Food and Dining food is great. Dorm Life there is no choice for living on campus. Academic Rigor Germanna is a great place to learn. The teachers are always willing to help every student. Also, the students sometimes form study groups which is a great way to learn. Tips for prospective students Stay in contact with you selected guidance counselor, they are",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}