{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Alot of clubs and activites, but again they seem to be held without consideration of the commutor/working students. I'd love to be more involved like at my last college, but I find the hold alot events at times I'm not available during. Again, I'm employed outside of college though, so this may just be an issue for me.",
            "The Berkshires is the place to be for entertainment, especially during the summer months. There's alot of history and art to be seen in the area, and plenty of winter sport activites.",
            "There is food located on campus which is good, but I'm not sure how great for those who plan to live on campus and eat it regularly. The food in the local area is excellant though! Angelina's, Water Street Grill, etc.",
            "Don't Live in Dorms",
            "Again, things I already meationed above involving administration: Not very commutor friendly, assumes most live on campus Having to chase advisor/teachers around for signitures during add/drop period for the convience of the professor so they know if they have room left in their calss; this is what the computer system/ registrar is for! Again, at my previous college, you could asses online registration during add/drop so it was quick and convenient for everyone! I was accepted to the college in early Dec, and wasn't able to reigistrar for classes until the day before they started, Jan 14th. I was, also, told that there was no one from admisement center I could talk to.",
            "Apply Early, otherwise you'll end up registring the day before classes. due to lack of being able to meet with someone from admissions.",
            "Lots of extra activites going on constatantly, and lots of care towards fitness/health resources. The adminstration is seems to treat the student population a lot more like high schoolers then the previous community college I graduated from. They also seem to forget that not all students live on campus and are local commuter students."
        ]
    ],
    "pageTitle": "Massachusetts College of Liberal Arts Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Massachusetts-College-of-Liberal-Arts/reviews?_escaped_fragment_=/show/3205",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00328-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 918856515,
    "recordOffset": 918817279,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{102424=Again, things I already meationed above involving administration: Not very commutor friendly, assumes most live on campus Having to chase advisor/teachers around for signitures during add/drop period for the convience of the professor so they know if they have room left in their calss; this is what the computer system/ registrar is for! Again, at my previous college, you could asses online registration during add/drop so it was quick and convenient for everyone! I was accepted to the college in early Dec, and wasn't able to reigistrar for classes until the day before they started, Jan 14th. I was, also, told that there was no one from admisement center I could talk to., 64789=The campus store and cafeteria don't always have the best variety of food and the campus store is in some cases over priced. We do also have a starbucks and subway on campus that expand the variety of what you can eat but they may be more expensive than the store depending on what you get. The cafeteria closes at 7:30 and the rest of the marketplace, where the other food establishments are located closes at 11. The quality of food is decent but the hours of operation aren't so desirable., 33049=get involved in campus clubs, obviously! we have 55 different student organizations as of the spring 2012 semester., 121576=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "10/14/2009 Reviewer is Researching this school. Reviewer has not been to campus. 4 out of 4 people found this review useful. 1 of 28 Katlynn from Bucksport, ME Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({",
    "textAfterTable": "Tips for prospective students For potential students, I would recommend getting to class on time every day, it helps with your grade, classes are only five minutes from the dorm rooms, and the teachers take notice and you get on their good side. Get involved in clubs that you enjoy, do not just join clubs for the number. Clubs become more beneficial when you actually enjoy them and want to participate. Attend all of the first days activities because it is the best way to meet your friends early on when everyone is still looking to find their place. Paper plates, plastic cups and dining ware are essentials if you are going to be living in a dorm room since it is difficult to wash dishes in the bathroom. Oh, and one last tip; become friends with an upperclassmen so they can drive you grocery stores such as Wal-Mart, or Price Chopper. Bang for the buck MCLA Is probably one of the only schools that can offer its great resources for a price this low. I considered MCLA at first because of its low price, but when I visited I fell even more in love. The scenery, the people, and the campus itself make you feel at home away from home. Am enjoying being here",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}