{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "hang out with friends and attend college events sports clubs etc",
            "they are starting to kick up the healthy food selections",
            "Columbia basin does not have dorms",
            "if you are a new student visit the campus before your classes start even though the campus isn't big you can get confused on where to go.",
            "all the staff are helpful and nice. professors are willing to work with you and the campus is always clean"
        ]
    ],
    "pageTitle": "Columbia Basin College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Columbia-Basin-College/reviews?_escaped_fragment_=/show/79258",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00097-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907208667,
    "recordOffset": 907156902,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5815=Admission was not expensive. There was a $29 application fee. Then you have to take a placement test called the COMPASS test, which has a $50 fee. The cost of attending CBC is more affordable than a university. It costs around $1000 per quarter, depending on how many credits you take. I am able to drive there from home and not have to pay additional housing costs., 110420=Finicial Aid is helpful if you apply. Books are always expensive if you buy from the campus book store, obviously. Usually tuition for 15 credits is $2000, that for one quarter., 194369=I'm in Running Start, so the cost is minimal, but others that I've talked to say that it's pretty cheap. About....1500 per quarter I think. Obviously, it depends on how many classes you take, though., 140362=Check out the CBC Foundation scholarship due February 21st. If you are a hard-worker, chances are you can get one. Make sure to register the first day available, thus, always check the CBC calendar. They have some cool classes such as Cardio Kickboxing and Lord of the Rings. Also, always arrive early for class at CBC. Plan to arrive twenty minutes before your first class, so you can find parking!, 14496=about $1500 a quarter, before paying for books. considering there are not really any other choices in the area, it's a good deal. if you're willing to move there are financial aid transfer options that make even an out-of-state college just as/more reasonably priced, too., 251344=© 2015, Cappex.com, LLC, 177069=5 stars all the way. I pay roughtly $1600 a quarter for 18 credits a quarter. That is the cheapest (least expensive) college education I could find. And most of my professors are PhD's, which is awesome., 137699=If you are wanting to transfer and are tight on money, this is the way to go. You need about $1500 per quarter plus books which can be around $400. Then it's three quarters per year. Schools like the UW and WSU will honor your credits but they were less expensive.}",
    "textBeforeTable": "12/15/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has not been to campus. 6 out of 6 people found this review useful. 1 of 57 Sendy from Toppenish, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({",
    "textAfterTable": "Categories Comments Tips for prospective students Love this school. It's great to have teachers and other people know what they are doing. Also, I love the enviroment on the campus. It also has really great 2 year programs. Login to rate or flag the reviews Mitchell from Kennewick, WA 10/30/2010 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 57 Categories Comments Great for these types of students CBC is great for people wanting to save money, people with not perfect academic records, and people wanting to ease into college life. Tips for prospective students You can register and pay for your classes online. You can even order your books from the bookstore online and they’ll hold them for you. After you sign up for classes, you have to take an FYI class before you begin. It’s a three hour class, three days in a row. You learn about educational planning, take a campus tour, and learn",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}