{
    "relation": [
        [
            "Citing Patent",
            "US8209246 *",
            "US8341180",
            "US8730843",
            "US8832012",
            "US8924274 *",
            "US9058581",
            "US9063985",
            "US20080275742 *",
            "US20090276259 *",
            "US20120185477 *",
            "US20120226519 *"
        ],
        [
            "Filing date",
            "Jun 18, 2003",
            "Sep 13, 2011",
            "Jan 14, 2011",
            "Oct 26, 2011",
            "Dec 10, 2008",
            "Aug 9, 2013",
            "May 10, 2013",
            "May 1, 2007",
            "May 2, 2008",
            "",
            "Mar 2, 2012"
        ],
        [
            "Publication date",
            "Jun 26, 2012",
            "Dec 25, 2012",
            "May 20, 2014",
            "Sep 9, 2014",
            "Dec 30, 2014",
            "Jun 16, 2015",
            "Jun 23, 2015",
            "Nov 6, 2008",
            "Nov 5, 2009",
            "Jul 19, 2012",
            "Sep 6, 2012"
        ],
        [
            "Applicant",
            "Goldman, Sachs & Co.",
            "International Business Machines Corporation",
            "Hewlett-Packard Development Company, L.P.",
            "Hewlett-Packard Development Company, L. P.",
            "Riskmetrics Solutions, Llc",
            "Goldman, Sachs & Co.",
            "Goldman, Sachs & Co.",
            "Oracle International Corporation",
            "Karol Bliznak",
            "Shah Amip J",
            "Kilpatrick, Stockton & Townsend LLP"
        ],
        [
            "Title",
            "Proprietary risk management clearinghouse",
            "Risk analysis for data-intensive stochastic models",
            "System and method for tree assessment",
            "System and method for tree discovery",
            "For and method of providing portfolio risk information to investors without revealing position information",
            "Systems and methods for managing information associated with legal, compliance and regulatory risk",
            "Method, system, apparatus, program code and means for determining a redundancy of information",
            "Nested hierarchical rollups by level using a normalized table",
            "Aggregating risk in an enterprise strategy and performance management system",
            "System and method for supplying missing impact factors in a database",
            "Methods and systems for determining risk associated with a requirements document"
        ]
    ],
    "pageTitle": "Patent US20100235300 - System and method for multi-layer risk analysis - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20100235300?ie=ISO-8859-1&dq=5083039",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00301-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 469079387,
    "recordOffset": 469034402,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{81398=For a query to calculate the MTM and Exposure for the entire portfolio, simple netting and grossing operations on the data in Table 8 would produce the erroneous results of MTM=1000 and Exposure=220. Instead, the corrects results arc given in Table 9, which is the same as Table 7, and are obtained by going back to the 2D (Currency, Issuer) cube and performing a netting operation by issuer, analogous to the operation resulting in Table 6. Then, a netting operation is performed on the MTMs, and a grossing operation is performed on the Exposures., 33011=This application is a continuation application of U.S. patent application Ser. No. 11/100,841 filed on Apr. 7, 2005, which claims benefit of U.S. Provisional Application No. 60/600,653 filed Aug. 11, 2004 and is a continuation in part application of U.S. patent application Ser. No. 10/384,721 filed Mar. 11, 2003. U.S. patent application Ser. No. 10/384,721 claims benefit of U.S. Provisional Patent Application No. 60/363,641 filed Mar. 11, 2002. The entire disclosures of U.S. Provisional Patent Application Nos. 60/600,653 and 60/363,641, and U.S. patent application Ser. Nos. 10/384,721 and 11/100,841 are incorporated herein by reference., 77917=The results in Table 7 would not have been obtained by performing netting and grossing operations on the data in Table 5, which would have given the erroneous results of MTM=1000 and Exposure=140.}",
    "textBeforeTable": "Referenced by As will be appreciated, the inventive methods may be embodied on computer-executable code that is stored on a computer-readable medium, for example, a floppy disk, a hard drive, removable media, an optical memory, a magneto-optical memory, a RAM, a ROM, a flash memory, so-called “memory sticks,” and the like. For example, although VaR is identified as a measure of risk used by financial institutions for quantitative assessment and comparison purposes, the present invention is applicable to other non-linear measures of risk assessment and management. While the present invention has been described with respect to what is presently considered to be the preferred embodiment(s), it is to be understood that the invention is not limited to the disclosed embodiment(s). To the contrary, the invention is intended to cover various modifications and equivalent arrangements included within the spirit and scope of the appended claims. The scope of the following claims is to be accorded the broadest interpretation so as to encompass all such modifications and equivalent structures and functions. The results in Table 20 are the same as those in Table 7 but were obtained in a generic manner. Through the use of multi-layered and multi-dimensional cubes, context independent and heterogeneous aggregations are possible. Whereas conventional aggregation schemes result in the loss of information as dimensions are eliminated by projections, the data analysis method of the present invention preserves all",
    "textAfterTable": "* Cited by examiner Classifications U.S. Classification 705/36.00R, 707/603, 707/E17.009 International Classification G06F17/30, G06Q40/00 Cooperative Classification G06Q40/08, G06Q40/06 European Classification G06Q40/08, G06Q40/06 Rotate Original Image Google Home - Sitemap - USPTO Bulk Downloads -",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}