{
    "relation": [
        [
            "Date",
            "Jan 11, 2005",
            "Feb 14, 2013"
        ],
        [
            "Code",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: RICOH COMPANY, LTD., JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:MOTOYAMA, TETSURO;FONG, AVERY;REEL/FRAME:016160/0517 Effective date: 20050107",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7581000 - Monitoring device having a memory containing data representing access ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7581000?dq=6,455,937",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00233-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473864811,
    "recordOffset": 473795571,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6838=FIG. 13 shows the sequence of the init( ) function to describe the calling sequence of Monitor module 1006 as illustrated in FIG. 10. The MonitorManager 1102 initializes the HWaccess module 1116 to start the initialization function. Subsequently, the MonitorManager 1102 obtains information about a monitored device and uses an IP address assigned to the monitored device to communicate with the monitored device. The MonitorManager 1102 accesses DeviceODBC 1104 to obtain configuration information of the monitored device. The configuration information returned to the MonitorManager 1102 includes, for example, an IP address of the monitored device, parameter names and associated values for each protocol, and vendor/manufacturer and model information of the monitored device. Once the IP address is obtained, the MonitorManager 1102 sets the IP address, parameter names and associated values for each protocol, to create a software object based on class structure of the Device module 1110 through the CDeviceFactory class 1302 of FIG. 35. When the device software object is successfully created, the HWaccess module 1116 is used to obtain Vendor, Model, and Unique ID from the monitored device to be stored in the created device software object.}",
    "TableContextTimeStampAfterTable": "{67254=28. Ser. No. 10/764,582 entitled “Method and System for Initializing Protocol Information Used to Extract Status Information from Networked Devices,” filed Jan. 27, 2004;, 66234=23. Ser. No. 10/670,505 entitled “Method and System for Extracting Information from Networked Devices in a Multi-Protocol Remote Monitoring System,” filed Sep. 26, 2003;, 62633=5. Ser. No. 09/953,358 entitled “Method and System of Remote Support of Device Using Email Through Data Transfer Module,” filed Sep. 17, 2001;, 64939=17. Ser. No. 10/328,026 entitled “Method of using Vectors of Structures for Extracting Information from the Web Pages of Remotely Monitored Devices,” filed Dec. 26, 2002;, 65561=20. Ser. No. 10/460,151 entitled “Method for Efficiently Extracting Status Information Related to a Device Coupled to a Network in a Multi-Protocol Remote Monitoring System,” filed Jun. 13, 2003;, 64320=14. Ser. No. 10/225,290 entitled “Method and System for Monitoring Network Connected Devices with Multiple Protocols,” filed Aug. 22, 2002;, 66641=25. Ser. No. 10/764,467 entitled “Method and System for Determining the Type of Status Information to Extract from Networked Devices in a Multi-Protocol Remote Monitoring System,” filed Jan. 27, 2004;, 61812=1. Ser. No. 09/453,937 entitled “Method and System of Remote Diagnostic, Control, and Information Collection using a Dynamic Linked Library of Multiple Formats and Multiple Protocols with Intelligent Formatter,” filed May 17, 2000;, 62221=3. Ser. No. 09/782,064 entitled “Method and System of Remote Diagnostic, Control, and Information Collection using a Dynamic Linked Library of Multiple Formats and Multiple Protocols with Three-Level Formatting,” filed Feb. 14, 2001;, 63598=10. Ser. No. 10/142,992 entitled “Method for Scrambling Information about Network Devices That is Placed in Email Message,” filed May 13, 2002;, 156967=Computer 360 includes a ROM 370 and a flash memory 371, although any other type of non-volatile memory (e.g., Erasable Programmable ROM, or an EEPROM) may be used in addition to or in place of the flash memory 371. An input controller 372 has connected thereto a keyboard 374 and a mouse 376. There is a serial interface 378 connected to a serial device 380. Additionally, a parallel interface 382 is connected to a parallel device 384, a universal serial bus (USB) interface 386 is connected to a universal serial bus device 388, and also there is an IEEE 1394 device 400, commonly referred to as a fire wire device, connected to an IEEE 1394 interface 398. A system bus 390 connects the various elements of the computer 360. A disk controller 396 is connected to a floppy disk drive 394 and a hard disk drive 392. A communication controller 406 allows the computer 360 to communicate with other computers (e.g., by sending e-mail messages) over a network 404. An I/O (Input/Output) controller 408 is connected to a printer 410 and a hard disk 412, for example using a SCSI (Small Computer System Interface) bus. There is also a display controller 416 connected to a CRT (Cathode Ray Tube) 414, although any other type of display may be used including a liquid crystal display, a light emitting diode display, a plasma display, etc., 122701=Transmission Control Protocol/Internet Protocol (TCP/IP) related communication is described, for example, in the book “TCP/IP Illustrated,” Vol. 1, The Protocols, by W. R. Stevens, from Addison-Wesley Publishing Company, 1994, the entire contents of which is incorporated herein by reference. Volumes 1-3 of “Internetworking with TCP/IP” by Corner and Stevens are also incorporated herein by reference in their entirety., 171261=This function saves the status information into the DeviceODBC 1104. The function returns true when saving is successful, false otherwise., 63009=7. Ser. No. 09/975,935 entitled “Method and System for Remote Support of Device Using Email Based Upon Pop3 With Decryption Capability Through Virtual Function,” filed Oct. 15, 2001;, 65314=19. Ser. No. 10/460,150 entitled “Method for Efficiently Storing Information used to Extract Status Information from a Device Coupled to a Network in a Multi-Protocol Remote Monitoring System,” filed Jun. 13, 2003;, 67617=31. Ser. No. 10/927,283, filed Aug. 27, 2004., 65142=18. Ser. No. 10/372,939 entitled “Method and System for Monitoring Network Connected Devices with Multiple Protocols,” filed Feb. 26, 2003;, 65789=21. Ser. No. 10/460,404 entitled “Method for Parsing an Information String to Extract Requested Information Related to a Device Coupled to a Network in a Multi-Protocol Remote Monitoring System,” filed Jun. 13, 2003;, 63417=9. Ser. No. 10/142,989 entitled “Verification Scheme for Email Message Containing Information About Remotely Monitored Devices,” filed May 13, 2002;, 280193=The method used by the FirstHTTPImplementation package to obtain the desired information from the web pages of a device is described in related application Ser. No. 10/328,026 entitled “Method of using Vectors of Structures for Extracting Information from the Web Pages of Remotely Monitored Devices,” filed Dec. 26, 2002, the contents of which are incorporated herein by reference. The method of the FirstHTTPImplementation package uses the first occurrence of the key word to locate the desired information, which might be incorrect for some of the desired information., 258043=As discussed above, status information can be obtained by SNMP from the network device even if the vendor and model are not obtained or supported. As long as the network device supports SNMP and can be accessed by SNMP, information can be obtained from the Management Information Base (MIB) of the network device. In step 3702, if the network device cannot be accessed through SNMP, then the SNMP protocol may be removed from the protocol parameter map 1400 in step 3704. However, if the network device can be accessed through SNMP, then the SNMP protocol remains in the protocol parameter map 1400 whether or not the vendor or model is obtained and supported. Network devices that support SNMP provide a MIB so that the remote system can always obtain information from the devices. However, the type and number of information that can be obtained from the network device depends upon if the vendor and model are obtained and supported. More information can be obtained from the network device by SNMP is the vendor and model are obtained and known. If the vendor and model cannot be obtained, SNMP is still able to obtain information that all devices can provide, such as the system description or the time the system has been running. SNMP can be used to obtain information from the network device under the three conditions: (1) vendor and model are supported, (2) vendor supported but model not supported, and (3) vendor and model are not supported. HTTP and FTP do not have the characteristics as SNMP. Where SNMP has a standard MIB that all network devices can follow so that information can be obtained, web pages and FTP files will vary among network devices of different vendors and models. There is no standard for web pages and FTP files which network devices follow to obtain information., 67457=29. Ser. No. 10/927,158, filed Aug. 27, 2004;, 62808=6. Ser. No. 09/953,359 entitled “Method and System for Remote Support of Device using Email for Sending Information Related to a Monitored Device,” filed Sep. 17, 2001;, 63945=12. Ser. No. 10/162,402 entitled “Method and System to Use HTTP and Html/Xml for Monitoring the Devices,” filed Jun. 5, 2002;, 198498=This section describes the definition of the infoType (int). The value range 0 through 99 is assigned to the data type. The value range 100 to 499 is assigned to Device Information. The value range 500 to 1999 is assigned to the common parameters including standard MIB parameters. The range 2000 to 3999 is assigned to Ricoh-specific information. The range 4000 to 4999 is assigned to Xerox. The range 5000 to 5999 is assigned to Lexmark. The range 6000 to 6999 is assigned to HP. The values are defined as follows:, 64492=15. Ser. No. 10/328,003 entitled “Method of Accessing Information from Database to be used to Obtain Status Information from the Web Pages of Remotely Monitored Devices,” filed Dec. 26, 2002;, 66436=24. Ser. No. 10/670,604 entitled “Method and System for Supporting Multiple Protocols Used to Monitor Networked Devices in a Remote Monitoring System,” filed Sep. 26, 2003;, 170894=This function obtains the map from DeviceODBC 1104 for the device information in the given format and the map of protocols and associated parameters. The function returns true if there is data returned, false if there is no more data., 180161=When the value, such as, for example, model name of the monitored device, is found within the same data line of the key (Product Name), the m_nPosition field is “0.” m_sDelimiter 1210 indicates a specific delimiter used to extract the value associated with the key. The SKeyValueInfo data structure indicates how to extract the value information from information received from a monitored device in an HTML format., 67535=30. Ser. No. 10/927,257, filed Aug. 27, 2004; and, 166825=Once the IP address of a monitored device is obtained, the IP address is used by the monitoring system to contact the monitored device to obtain information such as, manufacturer (vendor) and model information. Some of the functions executed by the monitoring system 1000 include:, 170098=Before this function is called, the calling function is preferred not to replace the vendor and model entries if obtain functions return a null string. This function updates the device information database of the current record in the DeviceODBC 1104. This function is most efficient when the ObtainConfig below is called initially. First, this function checks if the IP address is the same at the DeviceODBC 1104. If the IP address fields are not the same, the record with the correct IP address is obtained from the database. Then, the other fields are copied and the record is updated., 132511=A local connection interface 171 is a connection through local ports such as RS232, the parallel printer port, USB, and IEEE 1394. FireWire (IEEE 1394) is described in Wickelgren, I., “The Facts About “FireWire”, IEEE Spectrum, April 1997, Vol. 34, Number 4, pp. 19-25, the entire contents of which are incorporated herein by reference. Preferably, a “reliable” communication protocol is used which includes error detection and retransmission., 62076=2. Ser. No. 09/756,120 entitled “Method and System of Remote Support of Device Using Email,” filed Jan. 9, 2001;, 62487=4. Ser. No. 09/921,707 entitled “Universal Controller in The Wireless Networked Environment,” filed Aug. 6, 2001;, 67060=27. Ser. No. 10/764,569 entitled “Method and System for Managing Vendor and Model Information in a Multi-Protocol Remote Monitoring System,” filed Jan. 27, 2004;, 63774=11. Ser. No. 10/157,903 entitled “Method and Apparatus for Modifying Remote Devices Monitored by a Monitoring System,” filed May 31, 2002;, 66874=26. Ser. No. 10/764,527 entitled “Method and System for Managing Protocols Used to Obtain Status Information from a Network Device,” filed Jan. 27, 2004;, 63224=8. Ser. No. 10/068,861 entitled “Method and Apparatus Utilizing Communication Means Hierarchy to Configure or Monitor an Interface Device,” filed Feb. 11, 2002;, 64716=16. Ser. No. 10/328,008 entitled “Method of using Internal Structure to Store Database Information for Multiple Vendor and Model Support for Remotely Monitored Devices,” filed Dec. 26, 2002;, 64103=13. Ser. No. 10/167,497 entitled “Method and System of Remote Position Reporting Device,” filed Jun. 13, 2002, which is a continuation of Ser. No. 09/575,702 (U.S. Pat. No. 6,421,608);, 66038=22. Ser. No. 10/460,408 entitled “Method and System for Extracting Vendor and Model Information in a Multi-Protocol Remote Monitoring System,” filed Jun. 13, 2003;, 199047=infoType {eNotDefine=0, eDeviceInformation=1, eStatusInformation=2, eVendor=100, eModel, eUniqueID, eIPAddress, eCompanyName, eStreet, eCity, eState, eZipCode, eLocation, eContactPerson, ePhoneNumber, eEMailAddress, eDateTime=500, eHrDeviceErrors, eLowPaper, eNoPaper, eLowToner, eNoToner, eDoorOpen, eJammed, eOffline, eServiceRequested, ePrtGeneralConfigChanges=600, ePrtLifecount, ePrtAlertDesc1, ePrtAlertDesc2, ePrtAlertDesc3, ePrtAlertDesc4, ePrtAlertDesc5, eBlack=700, eMagenta, eCyan, eYellow, eTonerCollector=800, eBlackDeveloper=810, eColorDeveloper, eFuser=820, eDrum=830, eTransfer=840, eMaintenanceKit=850, eOilKit=860, eStationInfo1=901, eStantionInfo2, eStationInfo3, eStationInfo4, eStationInfo5, eRicohEngineCounterTotal=2000, eRicohCounterPrinter, eRicohEngineCounterFax, eRicohEngineCounterCopier}.}",
    "textBeforeTable": "Patent Citations </center> </table> </tr> </td> </table> </tr> </td> </center> </table> </tr> </font></td> <td valign=top width=“148” height=“18”><font class=“s2” face=“Arial,Helvetica” size=“2”> 100% Yellow </font></td> <td valign=top width=“144” height=“18”><font class=“s2” face=“Arial,Helvetica” size=“2”> <tr> </tr> </font></td> <td valign=top width=“148” height=“18”><font class=“s2” face=“Arial,Helvetica” size=“2”> 100% Magenta </font></td> <td valign=top width=“144” height=“18”><font class=“s2” face=“Arial,Helvetica” size=“2”> <tr> </tr> </font></td> <td valign=top width=“148” height=“18”><font class=“s2” face=“Arial,Helvetica” size=“2”> 100% </font></td> <td valign=top width=“144” height=“18”><font class=“s2” face=“Arial,Helvetica” size=“2”> Cyan <tr> </tr> </font></td> <td valign=top width=“148” height=“18”><font class=“s2” face=“Arial,Helvetica” size=“2”> 100% </font></td> <td valign=top width=“144” height=“18”><font class=“s2” face=“Arial,Helvetica” size=“2”> Black <tr>",
    "textAfterTable": "US6516345 * Dec 21, 2001 Feb 4, 2003 Cisco Technology, Inc. Approaches for determining actual physical topology of network based on gathered configuration information representing true neighboring devices US6757714 Jul 28, 2000 Jun 29, 2004 Axeda Systems Operating Company, Inc. Reporting the state of an apparatus to a remote computer US6889264 Oct 9, 2002 May 3, 2005 Hewlett-Packard Development Company, L.P. Imposing a delay for indication of a status board to provide a time for self-rectification of a service event detected from peripheral status information US7053767 May 6, 2002 May 30, 2006 Statsignal Systems, Inc. System and method for monitoring and controlling remote devices US7099947 * Jun 8, 2001 Aug 29, 2006 Cisco Technology, Inc. Method and apparatus providing controlled access of requests from virtual private network devices to managed information objects using simple network management protocol US7383333 * Dec 28, 2004 Jun 3, 2008 L.V. Partners, Lp Method and apparatus for tracking user profile and habits on a global network",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}