{
    "relation": [
        [
            "SR#",
            "1",
            "2"
        ],
        [
            "Country",
            "India",
            "United States"
        ],
        [
            "Visitors",
            "22.6%",
            "55.7%"
        ],
        [
            "Rank",
            "152,510",
            "121,044"
        ]
    ],
    "pageTitle": "Shoeocean.com Cheap Shoes - Get Quality Discount Boots, Fashion Boots & More at ShoeOcean - Web Analysis",
    "title": "",
    "url": "http://websiterecord.com/dm/shoeocean.com",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00328-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 252290469,
    "recordOffset": 252274805,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "  Popular Pages Analysis Why this?: Top pages as seen on google. These pages means highest ranked pages by google's algorithm. either sorted by ranking, PR, or by user interaction/liking. Many factors are involved in this calculation. Confidence Its Reputation in Child Safety is 78/100. 78 Reputation Child Safety Confidence Its Reputation in Privacy is 72/100. 72 Reputation",
    "textAfterTable": "4 Cheap Shoes Over The Knee Boots Size 7 http://www.shoeocean.com/saleoverthekneebootssize7.html 5 ShoeOcean Return Policy - Cheap Shoes http://www.shoeocean.com/return.html 6 Qupid Bikini-178A Camel Leopard Women Wedge Sandals http://www.shoeocean.com/41147.html 7 Anne Michelle Motive-04 Black Women Fashion Boots - Cheap Shoes http://www.shoeocean.com/41045.html 8 Bamboo Mariela-15 Leopard Women Wedge Sneakers http://www.shoeocean.com/44710.html 9 Anne Michelle Rapture-22 Silver Women Sandals - Cheap Shoes http://www.shoeocean.com/44538.html 10 Bonnibel Tiara-1 Red Women Platform Pumps - Cheap Shoes http://www.shoeocean.com/44218.html   Subdomains of Shoeocean.com Why this?: Top pages as seen on google. These pages means highest ranked pages by google's algorithm. either sorted by ranking, PR, or by user interaction/liking. Many factors are involved in this calculation. SR# Subdomain Visitors Percentage 1 shoeocean.com 96.62%   10 Most Popular Keywords Why this?: Those terms which matches the most and gains higher ranking in search.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}