{
    "relation": [
        [
            "Patent application number",
            "20080233785",
            "20100218373"
        ],
        [
            "Description",
            "Electrical connector assemblies and joint assemblies and methods for using the same - An electrical joint assembly for connecting a plurality of conductors includes a busbar hub and a plurality of limiter modules. The busbar hub includes an electrically conductive busbar body and a plurality of conductor legs extending from the busbar body. The limiter modules each include a fuse element. Each of the limiter modules is connected to a respective one of the conductor legs and is connectable to a respective conductor to provide a fuse controlled connection between the respective conductor leg and the respective conductor. Each of the limiter modules is independently removable from the respective one of the conductor legs.",
            "ELECTRICAL CONNECTOR ASSEMBLIES AND JOINT ASSEMBLIES AND METHODS FOR USING THE SAME - An electrical joint assembly for connecting a plurality of conductors includes a busbar hub and a plurality of limiter modules. The busbar hub includes an electrically conductive busbar body and a plurality of conductor legs extending from the busbar body. The limiter modules each include a fuse element. Each of the limiter modules is connected to a respective one of the conductor legs and is connectable to a respective conductor to provide a fuse controlled connection between the respective conductor leg and the respective conductor. Each of the limiter modules is independently removable from the respective one of the conductor legs."
        ],
        [
            "Published",
            "09-25-2008",
            "09-02-2010"
        ]
    ],
    "pageTitle": "Blue, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/blue-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00041-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 452241019,
    "recordOffset": 452210923,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kenton Archibald Blue, Fuquay-Varina, NC US 05-27-2010 CONNECTION ENCLOSURE ASSEMBLIES, CONNECTOR SYSTEMS AND METHODS FOR FORMING AN ENCLOSED CONNECTION BETWEEN CONDUCTORS - An enclosed connection system for connecting first and second elongate electrical conductors includes a transverse wedge connector and an enclosure. The transverse wedge connector includes an electrically conductive first connector member, an electrically conductive second connector member, and a clamping mechanism. The first connector member includes: a first body having inner and outer opposed ends; a first hook portion on the outer end of the first body, the first hook portion defining a first channel to receive the first conductor; and a first abutment portion on the inner end of the first body. The second connector member includes: a second body having inner and outer opposed ends; a second hook portion on the outer end of the second body, the second hook portion defining a second channel to receive the second conductor; and a second abutment portion on the inner end of the second body. The clamping mechanism is selectively operable to displace the first and second connector members relative to one another from an open position to a clamping position to clamp the first conductor in the first channel and between the first hook portion and the second abutment portion and to clamp the second conductor in the second channel and between the second hook portion and the first abutment portion to thereby form a connection. The enclosure is configured to receive and",
    "textAfterTable": "Marion R. Blue, Richton, MS US Patent application number Description Published 20100305282 METHOD FOR MODIFYING SURFACE PROPERTIES WITH NANOSTRUCTURED CHEMICALS - A method of using metallized and nonmetallized nanostructured chemicals as surface and volume modification agents within polymers and on the surfaces of nano and macroscopic particulates and fillers. Because of their 0.5 nm-3.0 nm size, nanostructured chemicals can be utilized to greatly increase surface area, improve compatibility, and promote lubricity between surfaces at a length scale not previously attainable. 12-02-2010 20140221544 Method for Modifying Surface Properties with Nanostructured Chemicals - A method of using metallized and nonmetallized nanostructured chemicals as surface and volume modification agents within polymers and on the surfaces of nano and macroscopic particulates and fillers. Because of their 0.5 nm-3.0 nm size, nanostructured chemicals can be utilized to greatly increase surface area, improve compatibility, and promote lubricity between surfaces at a length scale not previously attainable. 08-07-2014 Patent applications by Marion R. Blue, Richton, MS US Mark Blue, Palm Bay, FL US Patent application number Description Published 20150088427 METHOD FOR HYDROCARBON RECOVERY WITH CHANGE DETECTION AND RELATED APPARATUS - A method",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}