{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Find something or group to keep you engaged because it tends to get boring after a while.",
            "Midwestern state is a nice school in a beautiful neighbourhood. Everything is conveniently located around the school including public buses."
        ]
    ],
    "pageTitle": "Midwestern State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Midwestern-State-University/reviews?_escaped_fragment_=/show/69646",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00228-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898391663,
    "recordOffset": 898351566,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{56934=check out the academic scholarship: $1000 per academic year apply early and look for department scholarships., 148484=Im a very outgoing person but i couldn't find much to do in the small town. GET TO KNOW YOUR PROFESSORS. I felt like a lot of mine had picks. Just stay on top of things and do your work. Don't believe the hype on the food, just like any other college, the food gets nasty after a while. Plus, the cafe hours suck, especially around dinner time, I'm starving around 7:30. Not a lot to do around the campus, especially if you're from the city and you a use to doing things. Friendly but weird people. Advisors don't do a lot. Not a party school at all. Dead on weekends, well pretty much every night. If you're from Dallas/Fort Worth, DO NOT come. The dorms are really nice but NO WIFI!!!! You will make friends quickly though, everyone's friendly. The percentage of returning students from other cities is low. Mostly athletes and commuters., 657=Need money? Join the Honors program, you'll get 1500 a year if you're in good standing with the program. Come check it out, it's a great campus!, 203615=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "09/01/2009 Reviewer is A current student here. 18 out of 18 people found this review useful. 1 of 56 Matthew from Springtown, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. Midwestern State University Reviews Midwestern State University › Texas › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck School was in some big magazine about being #1 in Texas for the Bang for your buck. And currently, I think so too. Am enjoying being here Very enjoyable, everyone is friendly, upper classmen are helpful. Food is pretty good too! Am learning a lot My professors/instructors are really great at what they do! None of them make the classroom boring and they keep the information fresh with new ways of presenting it to you. Login to rate or flag the reviews Rachel from Holliday, TX 07/28/2009 Reviewer is A current student here. 15 out of 15 people found this review useful. 2 of 56 Categories Comments Tips for prospective students Make sure you pay attention to scholarship deadlines. If you live off campus, make sure you come to class early because you will not find a parking spot close to your",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}