{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "GN Docket No.",
            "FCC"
        ],
        [
            "regulations.gov",
            "2014-30079",
            "",
            "12-268",
            "14-143"
        ]
    ],
    "pageTitle": "47 CFR 1.46 - Motions for extension of time. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/47/1.46",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00270-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 922644479,
    "recordOffset": 922609413,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1027=Title 47 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{185775=The Auction 1000 Request for Comment initiates the pre-auction process by which the Federal Communications Commission will develop detailed procedures for the broadcast television spectrum incentive auction, taking into account public comment received in response to its proposals. The Auction 1000 Request for Comment includes specific proposals, including on determination of the initial broadcast television spectrum clearing target, opening bid prices, benchmarks for the final stage rule, and the final television channel assignment process, and seeks comment on those proposed procedures., 87341=§ 1403 - Enforcement, 179973=In this document, the Wireless Telecommunications Bureau (Bureau) further extends the deadline for filing comments on the Auction 1000 Request for Comment, which initiates the pre-auction process by which the Federal Communications Commission will develop detailed procedures for the broadcast television spectrum incentive auction, taking into account public comment received in response to its proposals., 87952=Title 47 published on 2014-10-01, 68493=This document amends procedural rules implemented by the Commission's 2011 determination that docketing and electronic filing be utilized in proceedings involving “[n]ewly filed formal common carrier complaints and newly filed pole attachment complaints before the Enforcement Bureau.” The rule changes also apply to future filings made in existing Section 208 formal complaints and pole attachment complaints. In addition, the amendments make a few procedural changes to existing Section 208 formal complaint and pole attachment complaint filing rules to create uniformity among them and ease of administration for parties and staff when initiating service of pleadings or filing confidential matters with the Commission. The rules further establish a single electronic inbox within Electronic Comment Filing System (ECFS) to handle the initial filing of the above-identified new complaints. Accepted complaints will receive a distinct ECFS docket number; rejected complaints will remain on ECFS but will be stored within the Inbox., 160320=In this document, the Federal Communications Commission (Commission) proposes to authorize radar applications in the 76-81 GHz band. The Commission seeks to develop a flexible and streamlined regulatory framework that will encourage efficient, innovative uses of the spectrum and to allow various services to operate on an interference-protected basis. In doing so, it further seeks to adopt service rules that will allow for the deployment of the various radar applications in this band, both within and outside the U.S. The Commission takes this action in response to a petition for rulemaking filed by Robert Bosch, LLC (Bosch) and two petitions for reconsideration of the 2012 Vehicular Radar R&O., 87566=§ 1451 - Deadlines for auction of certain spectrum, 87423=§ 1404 - National security restrictions on use of funds and auction participation, 102054=In this document, the Federal Communications Commission (Commission) will revise its Schedule of Regulatory Fees in order to recover an amount of $339,844,000 that Congress has required the Commission to collect for fiscal year 2015., 251344=The Federal Communications Commission published a document in the Federal Register of October 27, 2014 (79 FR 63883), regarding Petitions for Reconsideration filed of Action in a rulemaking proceeding. The document contained the incorrect deadline for filing replies to an opposition to the Petition. This document revises the deadline for replies to an opposition to the Petition., 63720=This document contains corrections to the final regulations to the Commission's rules which were published in the Federal Register on Thursday, November 6, 2014 (79 FR 65906). The Commission published a clarification in the Declaratory Ruling, which clarifies how the Commission intends to preserve the “coverage area” of eligible broadcasters in the repacking process associated with the broadcast television spectrum incentive auctions. This document contains corrections to the adopted date., 121445=The Incentive Auction Task Force provides the results of several staff simulations of the initial clearing target optimization procedure proposed in the Auction 1000 Comment PN and/or Comment PN as discussed further in this under the Supplementary Information. In this document, the Federal Communications Commission's (Commission) Incentive Auction Task Force seeks comment on the data and analyses released in this document and the attached Appendix.}",
    "lastModified": "Tue, 14 Jul 2015 19:13:19 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 38653 - The Commission's Rules To Improve Wireless Coverage Through the Use of Signal Boosters 2015-07-07; vol. 80 # 129 - Tuesday, July 7, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 47. Title 47 published on 2014-10-01. 63 FR 24124, May 1, 1998] [39 FR 43301, Dec. 12, 1974, as amended at 41 FR 9550, Mar. 5, 1976; 41 FR 14871, Apr. 8, 1976; 42 FR 28887, June 6, 1977; If a motion for extension of time in which to make filings in proceedings other than notice and comment rule making proceedings is filed less than 7 days prior to the filing day, the party filing the motion shall (in addition to serving the motion on other parties) orally notify other parties and",
    "textAfterTable": "FEDERAL COMMUNICATIONS COMMISSION Final rule; announcement of effective date. 47 CFR 20.21(f)(1)(iv)(A)(2) published at 79 FR 70790, November 28, 2014, are effective on July 7, 2015. 47 CFR Parts 1 and 20 Summary In this document, the Federal Communications Commission (Commission) announces that the Office of Management and Budget (OMB) has approved, for a period of three years, certain information collection requirements associated with the Commission's Order on Reconsideration regarding the Commission's rules to Improve Wireless Coverage Through the Use of Signal Boosters, FCC 14-138. This document is consistent with the Order on Reconsideration, which stated that the Commission would publish a document in the Federal Register announcing OMB approval and the effective date of the new information collection requirements. 80 FR 38812 - WRC-07 Implementation Report and Order and WRC-12 Order GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-15249",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}