{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Bang for the buck",
            "Food and Dining",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Toga Toga!!!",
            "It's more cost than Bervard C.C by $20. per credit hour but you get what you pay for no matter where you are. I like Indian River State College so far. I felt like they wanted to treat me rite. Clean facility... Everyone was friendly :). Short wait time.",
            "Didn't have any food, but I know it's important.",
            "If you're a student that has filled out a FAFSA and plan on attending, make sure you bring in your federal taxes, W2s, and a verification worksheet for financial aid. Go to there website and apply it's real easy and no cost. I am a transfer student from AZ so I've had to wait 1.5 years to qualify for in-state.... if you're in this boat then you will need to submit all of your other transcripts + H.S. All in all it seemed like a nice place to continue my education b/c I checked out Bervard C.C... and it was really crowded + when I was waiting for the financial aid office their TV had Price is Rite on.... I though it was supposed to be an institute for higher education!",
            "The atmosphere there was good. Good help when asking questions, friendly people. Less students so that means more attention for yourself."
        ]
    ],
    "pageTitle": "Indian River State College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Indian-River-State-College/reviews?_escaped_fragment_=/show/69037",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00203-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891423743,
    "recordOffset": 891360853,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{358679=© 2015, Cappex.com, LLC, 111895=Classmates school work may sometimes be difficult, but always keep your head up. IRSC well save you so much money comparing going to a University. See you at IRSC starting the fall 2012.}",
    "textBeforeTable": "05/17/2011 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 95 Crista from Fort Pierce, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Login to rate or flag the reviews Billy from Fort Pierce, FL 10/13/2010 Reviewer is A current student here. 3 out of 4 people found this review useful. 2 of 95 Categories Comments Am enjoying being here Staff and students are very friendly and helpful. Am learning a lot professors are willing to work one-on-one with students having difficulty in their class. Login to rate or flag the reviews Brittany from Port St Lucie, FL 11/11/2010 Reviewer is A current student here. 3 out of 4 people found this review useful. 3 of 95 Categories Comments Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}