{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "0.26",
            "0.29",
            "0.57",
            "1.65"
        ],
        [
            "NSE",
            "0.26",
            "0.28",
            "0.59",
            "1.68"
        ]
    ],
    "pageTitle": "Rasoya Proteins Stock Price, Share Price, Live BSE/NSE, Rasoya Proteins Bids Offers. Buy/Sell Rasoya Proteins news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/edible-oils-solvent-extraction/rasoyaproteins/RP22?sc_did=RP22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00089-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 598181851,
    "recordOffset": 598134681,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{133630=JSWSteel Jul Fut, 132923=UnitedBrewerie Jul Fut, 199996=Zensar Technologies Recommended on Mar 24th 2015, 132412=28 July 2015, 201306=Rasoya Protein is in the Edible Oils & Solvent Extraction sector. The current market capitalisation stands at Rs 42.72 crore. The company management includes A N Lonkar - Chairman & Managing Director, P G Duehakke - Executive Director, Sameer Y Damle - Executive Director, V D Bhagade - Ind. Non-Executive Director, S R Khankhoje - Ind. Non-Executive Director, A N Deshpande - Ind. Non-Executive Director, Manik Anil Lonkar - Director. It is listed on the BSE with a BSE Code of 531522 and the NSE with an NSE Code of RASOYPR. Its Registered office is at Village- Wanjari, Taluka - Wani, Yavatmal,Maharashtra - 445304. Their Registrars are System Support Services}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}