{
    "relation": [
        [
            "Option",
            "General tab",
            "Inventory tab",
            "Installed Firmware tab",
            "Faults tab",
            "Events tab",
            "FSM tab",
            "Statistics tab",
            "Temperatures tab",
            "Power tab"
        ],
        [
            "Description",
            "Provides an overview of the status of the server, including a summary of any faults, a summary of the server properties, and a physical display of the server and its components.",
            "The sub-tabs display the properties and status of the components of the server.",
            "Displays the current firmware versions on the BMC and interface cards in the server. You can also use this tab to update and activate the firmware on those components.",
            "Provides details of faults generated by the server.",
            "Provides details of events generated by the server.",
            "Provides details about and the status of FSM tasks related to the server. You can use this information to diagnose errors with those tasks.",
            "Provides statistics about the server and its components. You can view these statistics in tabular or chart format.",
            "Provides temperature statistics for the components of the server. You can view these statistics in tabular or chart format.",
            "Provides power statistics for the components of the server. You can view these statistics in tabular or chart format."
        ]
    ],
    "pageTitle": "Cisco UCS Manager GUI Configuration Guide, 1.0(2) - Managing the Servers [Cisco UCS Manager] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/unified_computing/ucs/sw/gui/config/guide/1-0-2/b_GUI_Config_Guide/GUI_Config_Guide_chapter28.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00116-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 374979931,
    "recordOffset": 374953183,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "In the Work pane, click one of the following tabs to view the status of the server: Step 4   Click the server that you want to monitor. Step 3   On the Equipment tab, expand Equipment > Chassis > Chassis Number > Servers. Step 2   In the Navigation pane, click the Equipment tab. Step 1   Procedure Monitoring a Server Click OK. Click Reset iBMC (Server Controller). In the Recover Server dialog box, do the following: Step 6   In the Actions area, click Recover Server. Step 5   In the Work pane, click the",
    "textAfterTable": "Step 5   In the Navigation pane, expand Server_ID > Interface Cards > Interface_Card_ID. Step 6   In the Work pane, you can view the status of one or more of the following components of the interface card: Interface card DCE interfaces HBAs NICs Tip    If you expand these nodes, you can view the status of the components of that element. For example, if you expand a NIC node, you can view the properties and status of each VIF created on that NIC. Viewing the POST Results for a Server You can view any errors collected during the Power On Self-Test process for a server and its adapters. Procedure Step 1   In the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}