{
    "relation": [
        [
            "First Name",
            "David",
            "Manal",
            "Jason"
        ],
        [
            "Last Name",
            "Markarian",
            "Yamout",
            "Utton"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=5CF1496B-6B9E-4C4D-BDD1-D3303F3329C1&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00108-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 221937385,
    "recordOffset": 221929183,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30265=H.R. 2055, Consolidated Appropriations Act, 2012 (Low Income Home Energy Assistance Program, appropriations issues generally). S. 1599, Departments of Labor, Health, and Human Services, and Education and Related Agencies Appropriations Act, 2012. H.R. 3671, Consolidated Appropriations Act, 2012 (Low Income Home Energy Assistance Program, appropriations issues generally). H.R. 1, the Senate vehicle for Disaster Relief Appropriations, (Super storm Sandy Assistance). H.R. 152, the Disaster Relief Appropriations Act, 2013 (Super storm Sandy Assistance). H.R. 5325, the Energy and Water Development and Related Agencies Appropriations Act, 2013, (appropriations issues generally). S. 2465, the Energy and Water Development and Related Agencies Appropriations Act, 2013, (appropriations issues generally). S. 3295, the Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, 2013, (appropriations issues generally)., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 12295=S.J. Res. 37, disapproving the EPA Cross-State Air Pollution Rule. S. 1815, the Cross State Air Pollution Act, to codify and delay the implementation dates for a final EPA rule relating to interstate transport of air pollution. H.R. 97, the \"Free Industry Act\". To amend the Clean Air Act to provide that greenhouse gases are not subject to the Act, and for other purposes. S. 1815, the Cross State Air Pollution Act, to codify and delay the implementation dates for a final EPA rule relating to interstate transport of air pollution. S. 3053, the EPA Regional Oversight Act, to require Senate confirmation of EPA Regional Administrators. Environmental provisions in draft text of FY 2013 Interior, Environment and Related Agencies appropriations bill released by Senate Committee on Appropriations. Clean Air Act proposed rules in general; including but not limited to new source performace standards 316(b); CASPR; utility MACT., 16606=S. 3469, Nuclear Waste Administration Act of 2012. A bill to establish a new organization to manage nuclear waste, provide a consensual process for siting nuclear waste facilities, ensure adequate funding for managing nuclear waste, and for other purposes. H.R. 8, the American Taxpayer Relief Act of 2012, (electric vehicle tax credits). H.R. 909, A Roadmap for Americas Energy Future to address domestic energy policy, including renewable energy. H.R. 5325, Energy and Water Development and Related Agencies Appropriations Act, Fiscal Year 2012, (energy efficiency, electric transportation). S. 2146, the \"Clean Energy Standard Act of 2012\". S. 2465, \"Energy and Water Development and Related Agencies Appropriations Act, Fiscal Year 2013\", (energy efficiency, electric transportation). S. 3240, \"Agriculture Reform, Food, and Jobs Act of 2012\", (LIHEAP, rural transportation). H.R. 3307, American Renewable Energy Production Tax Credit Extension Act of 2011, extension of renewable energy production tax credit. H.R. 3626, the \"LIHEAP Protection Act.\" To provide level funding for the Low Income Home Energy Assistance Program. S. 3275, Master Limited Partnerships Act, a bill to amend the Internal Revenue Code of 1986 with respect to the tax treatment of publicly traded partnerships as corporations. H.R. 6533, to establish minimum levels of assistance for certain States under the Low-Income Home Energy Assistance Program, (LIHEAP). S. 1961, \"LIHEAP Protection Act\". S. 3295, the \"Departments of Labor, Health and Human Services, and Education and Related Agencies Appropriations Act, Fiscal Year 2013\", (LIHEAP). S. 3591, the \"Commercial Building Modernization Act,\" energy efficiency\". Sucommitee Draft, the \"Departments of Labor, Health and Human Services, and Education and Related Agencies Appropriations Act, Fiscal Year 2013\", (LIHEAP)., 34515=Regulatory reform issues in general. H.R. 6533, to establish minimum levels of assistance for certain States under the Low-Income Home Energy Assistance Program, (LIHEAP). S. 1961, \"LIHEAP Protection Act\". S. 3295, the \"Departments of Labor, Health and Human Services, and Education and Related Agencies Appropriations Act, Fiscal Year 2013\", (LIHEAP). S. 3591, the \"Commercial Building Modernization Act,\" energy efficiency\". Sucommitee Draft, the \"Departments of Labor, Health and Human Services, and Education and Related Agencies Appropriations Act, Fiscal Year 2013\", (LIHEAP)., 47868=S. 1222, \"Digital Accountability and Transparency Act (DATA)., 21981=S. 21, \"Cyber Security and American Cyber Competitiveness Act\". H.R. 174, \"Homeland Security Cyber and Physical Infrastructure Protection Act\". H.R. 76, \"Cybersecurity Education Enhancement Act\". H.R. 668, \"SHIELD Act\". H.R. 3523, Cyber Intelligence Sharing and Protection Act. S. 413, \"Cybersecurity and Internet Freedom Act\". S. 1342, Grid Cyber Security Act. S. 2105, the Cybersecurity Act of 2012., 25770=H.R. 3307, \"American Renewable Energy Production Tax Credit Extension Act of 2011.\" Renewable energy tax incentives in general. Issues related to tax rates in general. H.R. 4196, To amend the Internal Revenue Code of 1986 to extend the allowance for bonus depreciation for certain business assets. S. 2240, A bill to amend the Internal Revenue Code of 1986 to extend the allowance for bonus depreciation for certain business assets. S. 2201, \"American Energy and Job Promotion Act\". H.R. 3091, To make permanent the individual income tax rates for capital gains and dividends. H.R. 3630, Temporary Payroll Tax Cut Continuation Act of 2011, relating to inclusion of production tax credit. S. 1813, Moving Ahead for Progress in the 21st Century (MAP-21), relating to extension of production tax credit. S. 2201, the American Energy and Job Promotion Act. S. 3275, Master Limited Partnerships Parity Act. H.R. 8, the Job Protection and Recession Prevention Act of 2012, (extension of current rate on dividends). S. 2204, Repeal Big Oil Tax Subsidies Act, (electric vehicles). H.R. 6437, Master Limited Partnerships Parity Act., 44587=S. 3457, the Veterans Job Corps Act of 2012, (workforce training, credentials)., 51136=Alternative fuels and bio fuels in general. H.R. 6083, the Federal Agriculture Reform and Risk Management Act of 2012, (LIHEAP, transportation).}",
    "textBeforeTable": "",
    "textAfterTable": "State FL Zip Code 33408 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  Dirk Smith  2022713872  dirk.smith@nexteraenergy.com 5. Senate ID#  40030260-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}