{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21"
        ],
        [
            "Car Number",
            "70.",
            "252",
            "7L",
            "M74",
            "61",
            "71",
            "51.",
            "0",
            "00",
            "6",
            "18",
            "3",
            "69",
            "13",
            "5.",
            "21",
            "50",
            "71.",
            "70",
            "28",
            "10"
        ],
        [
            "Name",
            "Ronald Heeney",
            "Rob Patrick",
            "Marc Long",
            "Nate Moon",
            "Chuck Ammerman",
            "Harold Morence",
            "Dave Thorburn",
            "Chuck Ewing",
            "Randy Squires",
            "Ian Sprague",
            "Harold Patrick",
            "Michael Daley",
            "AL Williams",
            "Ray Heatherington",
            "Marc Smith",
            "Jim Johnson",
            "Mike Ammerman",
            "Kyle Ballard",
            "Anthony Salazar",
            "Spencer Drake",
            "Russel Potter III"
        ],
        [
            "Behind Leader",
            "",
            "0.823",
            "1.419",
            "2.599",
            "2.804",
            "3.186",
            "6.740",
            "9.108",
            "9.689",
            "11.310",
            "11.730",
            "14.898",
            "--1 Lap--",
            "--3 Laps--",
            "--6 Laps--",
            "--8 Laps--",
            "--11 Laps--",
            "--16 Laps--",
            "--17 Laps--",
            "--22 Laps--",
            "1.589"
        ],
        [
            "Gap",
            "",
            "0.823",
            "0.596",
            "1.180",
            "0.205",
            "0.382",
            "3.554",
            "2.368",
            "0.581",
            "1.621",
            "0.420",
            "3.168",
            "--1 Lap--",
            "--2 Laps--",
            "--3 Laps--",
            "--2 Laps--",
            "--3 Laps--",
            "--5 Laps--",
            "--1 Lap--",
            "--5 Laps--",
            "1.589"
        ]
    ],
    "pageTitle": "Spartan Speedway Recap Sept 8, 2006",
    "title": "",
    "url": "http://www.spartanspeedway.com/numbers/archives/2006/recap0908.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00101-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 730533503,
    "recordOffset": 730517109,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1312=The final night of competition is always exactly what it says it is, fun! The WMMQ Classic Rock 94.9 MI Modifieds pulled out all the stops. Some of the cars sported Lexan wings (some the size of a billboard) and Late Model tires, while others opted to go the topless (the car, not the driver) route. These modifications were perfectly legal on \"no rules\" night, and were encouraged, as a way to showcase what these powerhouses can do. Brian Heeney set fast time of the night, with a 13.094, proof positive that a small billboard will improve your time. Steve Scellenberger and Matt Szecodi brought the field down for the start of their 35-lap feature, with Szecodi charging into the lead after the drop of the green. Szecodi led for six laps before receiving the first speeding ticket of the night for running under his qualifying time. Larry Wallace, 2006 Spartan, Springport, and MMA Asphalt Champion assumed the lead, with Chad Pray in tow. Perry Davenport was on the move though, as was Heeney, running just behind Wayne Haughton and Dick Maurer. Davenport ducked under Wallace and took away the top spot on lap 10. Heeney also made his way around Wallace, as Wallace faded to third. Gary Sherman made his way around Wallace into second, as Dan Loughan drove into the third spot. Davenport drove away from the lead pack, as Loughan challenged Sherman for second on lap 18. Ron Parish joined the top five and went to work on the lead pack. As the leaders entered lapped traffic, Davenport wove his way through the gaggle of cars ahead of him, leaving Loughan, Sherman, Heeney, and Parish on their own. At the line, it was Davenport, Loughan, Sherman, Heeney, and Parish. Scellenberger, Sherman, and Loughan won their heats. Nine vintage racers, all members of VROA, showed what they could do, as the closely matched cars lined up for their 20-lap feature. Steve Fuller and Fred Otterbein made up the front row, as the field took the green. Otterbein led for six laps, with Larry Mollohan making his move to the front. Steve Fuller sat in second, until Rick Nelson and Mollohan made their way into second and third. Mollohan took away the top spot on lap eight, with Bob Martin and Don Deyman running second and third by lap 10. At the stripe, it was Mollohan, Martin, Deyman, Nelson, and Mike Becker. Mollohan scored the heat win. Twenty-two Performance Automotive NW Street Stocks turned out for the season ender, as Kyle Ballard set fast time, with a 14.281. A complete invert set up a \"slug-fest\" as the faster cars tried to make their way up through the field. Ray Hetherington and Anthony Salazar brought the field down to the start, with Randy Squires jumping out to take the lead on lap one. Bubber Patrick took over the top honors and started to pull away from the field on lap four. Mike Ammerman gave chase, with Ron Heeney and Butch Morence close behind. Caution on lap nine for Ballard closed the field up behind B. Patrick, with Heeney breathing down his neck. Rob Patrick was on the move, making his way around Nate Moon, bringing Marc Long along with him. B. Patrick and Heeney got together coming out of turn two on lap 17, bringing out the caution on lap 17. Heeney assumed the lead on the restart, with R. Patrick, Long, Moon and C. Ammerman rounding out the top five. They finished in that order, with Morence, Dave Thorburn, Chuck Ewing, Squires, and Ian Sprague rounding out the top ten. C. Ammerman, R. Patrick, and Morence took home heat wins. Nineteen Holiday Powersports Pony Stocks were red-hot and ready to go, with a couple finding two or three extra horses to boot. Scavarda smoked the field in qualifying with a 15.575. Obviously he was taking the \"run what you brung\" to the limit. Bill McBride and John Anderson paced the field, with Dennis O'Neil racing into the lead. Brian Beckner assumed the lead on lap five with Doug Allen, John Anderson, Mark Garland and Wayne Beckner Jr. running him down. Garland made his way under Allen for second on lap 8, and took over the lead on the very next lap. Allen hung on to second, with Beckner Jr. and Tina Anderson in hot pursuit. Scavarda worked his way up from the back of the field to sit in second by lap 13, but it was too little, too late. Garland was able to hang on, for the next seven laps, to take the win. Scavarda, Beckner Jr., George Wyers, and Doug Allen rounded out the top five. Brian Beckner, Russ Potter III, and Garland all tallied heat wins. Dane Long has not only mastered the art of driving the truck, but can also wheel a big ol' school bus around the Figure 8. Marc Smith and Jon McNett did give him a run for his money though, as Jimmy Scavarda helped Randy Kretzinger Jr. dump his bus, coming out of what would normally be turn one. The three, Long, Smith, and McNett, battled for position, until George Wyers slowed, then stopped, just shy of the intersection, making Long and Smith go around him on the grass. Long regained the lead from Smith with his baja move around Wyers. McNett slowed coming through the intersection on lap 13, then clipped Smith on his way through on lap 14. Overcoming his mechanical problems, McNett dropped down low, trying to get around Long, but couldn't get it done. After 15 laps, it was Long who came home the winner. Powderpuff action saw Sarah Ammerman take the win in her husband's street stock. Jessica Haughton held off Kim Loomis for the win in Dan Loughan's modified, while Misty Allen battled Reba Yeager for a hard, fought win in John Conroy's pony stock. Hope to see you at the races in 2007!}",
    "textBeforeTable": "WMMQ 94.9 MMA Modifieds Qualifying Results By: Michelle Sprague The final night of competition is always exactly what it says it is, fun! The WMMQ Classic Rock 94.9 MI Modifieds pulled out all the stops. Some of the cars sported Lexan wings (some the size of a billboard) and Late Model tires, while others opted to go the topless (the car, not the driver) route. These modifications were perfectly legal on \"no rules\" night, and were encouraged, as a way to showcase what these powerhouses can do. Brian Heeney set fast time of the night, with a 13.094, proof positive that a small billboard will improve your time. Steve Scellenberger and Matt Szecodi brought the field down for the start of their 35-lap feature, with Szecodi charging into the lead after the drop of the green. Szecodi led for six laps before receiving the first speeding ticket of the night for running under his qualifying time. Larry Wallace, 2006 Spartan, Springport, and MMA Asphalt Champion assumed the lead, with Chad Pray in tow. Perry Davenport was on the move though, as was Heeney, running just behind Wayne Haughton and Dick Maurer. Davenport ducked under Wallace and took away the top spot on lap 10. Heeney also made his way around Wallace, as Wallace faded to third. Gary Sherman made his way around",
    "textAfterTable": "Ryan Hensley 15.408 2.314 15.639 Performance Automotive Northwest Street Stocks Pos Car Number Name Best Time Behind Leader 2nd Best Time 1 71. Kyle Ballard 14.281 -.--- 14.511 2 70. Ronald Heeney 14.481 0.200 14.547 3 50 Mike Ammerman 14.536 0.255 14.708 4 7L Marc Long 14.538 0.257 14.606 5 18 Harold Patrick 14.619 0.338 14.647 6 252 Rob Patrick 14.715 0.434 14.813 7 M74 Nate Moon 14.812 0.531 14.901",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}