{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Free expression tunnel",
            "Get involved early!",
            "Great school with a broad range of subjects to study! Awesome staff focused on you getting the most out of your education! Large campus with a small campus feeling."
        ]
    ],
    "pageTitle": "North Carolina State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/North-Carolina-State-University/reviews?_escaped_fragment_=/show/85698",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00245-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903506791,
    "recordOffset": 903356735,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{191102=After having a tour of the campus and dorms, it looks like there will never be a dull moment. It has one of the best engineering programs and the cost is moderate. I am definitely looking forward to going on another tour this October., 277076=Make sure you make the priority deadline! I missed it by two days, and had to wait until the end of March to hear back. By making the priority deadline, you also are applying for all of their university based scholarships. So, APPLY EARLY!, 478521=When I began school in August, I didn't know anyone here. I was an out-of-state student from Virginia. My roomate was from California and I had 2 suitemates. One of them was from NY and the other from Rocky Mount, NC. We have become best friends. I love living in the dorm because you get to meet so many new people. My RA made me feel comfortable and helped me out when I didn't know what to do or where I was supposed to be. The showers are kind of gross, but other than that, it's great., 835369=My father attended NC State as an engineering student. Growing up, I wanted to follow in his footsteps and always assumed I would go here. After moving to Florida, my plans changed and I never entertained the thought of going back to NC, especially for college. I applied for the heck of it my senior year and was extremely shocked to be deferred to a later decision as a legacy student, top 10 of my class, 5.06 GPA, AA degree upon graduation, and 1800 SAT. Later on, I was accepted. I went back to NC to visit family and thought we could just stop by the campus and see how it has changed. Seeing NC State as a senior in high school was so different from seeing it as a child. After touring the best schools in Florida, I wish I could go to THIS school. I loved the vibe, layout, and tradition on the campus. I felt like I was welcome. I had mostly committed to University of Florida, but after visiting NC State I tried everything in my power to get aid and make the out-of-state tuition affordable. I just didn't happen for me., 477039=We have a tradition at North Carolina State called the Krispy Kreme Challenge. I was so psyched when I heard about this because I love donuts....You run from the Belltower 2 miles to the Krispy Kreme downtown store, eat a dozen donuts, and run back. Your goal is to do this in under an hour without throwing up. It happens in January and I think that I might give it a try!, 750714=1) Be sure to visit their Open House day in November each year while in high school as each time you learn more and more and will really feel at home as they are sooooo welcoming. 2) Numerous opportunities on campus to work or involvement/participation - something for everyone regardless of financial situation or interests. 3) May not be an ACC giant, but definitely a giant in the engineering and science fields., 598444=The state fair comes to Raleigh around October, which is always supposed to be fun. You can also go downtown for First Friday every month, which features free entry to galleries, free food, and giveaways. The museums are all downtown and my favorite, the museum of natural sciences, features a daily cafe on Thursday nights with guest speakers and trivia. Also, Hillsborough street has a lot of small businesses such as the bowling alley, coffee shops, and and other fun places to hang out., 443708=Some unusual traditions on NC State is the Target Run which is basically a HUGE group of students get together and go to Target at 2 o'clock in the morning and run to get what they need and out before anyone else does. There is also the doughnut run, where you eat as many Krispy Kreme doughnuts that you possibly can and then run like 5 miles. There is one unusual location on campus and that is the free expression tunnel. It is this tunnel that connects the two parts of northern campus that is split by the rail road. In this tunnel anyone can grab a can of spray paint and paint on the walls. Just nothing with profanity or racist. You have to be nice., 110375=Keep at least a 4.0 GPA and a 1800 on the SAT., 107140=North Carolina State University is number nine on the Princeton Review Best Overall Public University Value for 2011. That alone proves NCSU is good for your wallet. With NCSU being a top notch public North Carolina Public University, it's economical and a good education., 846976=© 2015, Cappex.com, LLC, 308881=I stayed in the Sullivan Residence Hall for the 2011 - 2012 school year and I enjoyed the on-campus experience. Although, the morals and values of various students get tested and you may not agree with the things other students do in their spare time, you gain an incredible amount of independence as far as being away from home, deciding (for yourself) when you need to get out of bed, how long it takes for you to get yourself ready in the morning and go to your class. I absolutely LOVED the dorm life. I can't wait to be back. It's almost like living in an apartment with a roommate :-), 755770=There are plenty of things to do throughout the school year for fun. In October, the North Carolina State Fair comes to Raleigh and the state fairgrounds are less than two miles away from campus. Individual housing halls throw parties for various key events during the year. From promoting stress-free exams before midterms and finals, to having competitions between different dorm rooms, there will always be an even around the corner. Parties are optional, however be careful that you don't party too hard. Because Raleigh is the capital of North Carolina, there are tons and tons of historical locations and artifacts located in the city. You can tour the capital and legislature buildings, or tour the museums of Natural Sciences and History., 655171=The krispy kreme challenge, I never participated but Im told its amazing to watch. 4 miles, 12 dounuts, 2400 calories..... what could go wrong., 543784=There has only been one problem for me and its the cold. We had snow here today and the school canceled classes after 12 but I had a class at 10:15 all the way across campus that was a very interesting walk.}",
    "textBeforeTable": "06/17/2009 Reviewer is A current student here. 63 out of 64 people found this review useful. 1 of 194 Wolfpackfan124 Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Am enjoying being here I live off-campus and deal with much more Raleigh traffic than a student that might live on-campus. Otherwise, my experience is alright. When I need to get around at the campus, I can take the Wolfline to get where I need to go. Also, there are places like Taco Bell and Chic-fil-a on campus to eat at as well as dining halls. Am learning a lot Great school; learn new things even in introductory classes. The majority of my engineering professors at NCSU have been top notch. They have helped me to go beyond the formulas and math by teaching the concepts related to the subject as well as problem solving skills. Login to rate or flag the reviews Joseph from Concord, NC 07/18/2009 Reviewer is A current student here. 35 out of 35 people found this review useful. 2 of 194 Categories Comments Great for these types of students Great for anyone interested in",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}