{
    "relation": [
        [
            "Symbol",
            "=",
            "<>",
            ">",
            "<",
            ">=",
            "<=",
            "()",
            "||",
            "+",
            "-",
            "*",
            "DIV",
            "IN",
            "NOT IN"
        ],
        [
            "Usage",
            "Equal to test. Used in the IF control structure only.",
            "Not equal to test. Used in the IF control structure only.",
            "Greater than test. Used in the IF control structure only.",
            "Less than test. Used in the IF control structure only.",
            "Greater than or equal to test. Used in the IF control structure only.",
            "Less than or equal to test. Used in the IF control structure only.",
            "Function argument and expression group delimiter. The expression group inside \"()\" is always be evaluated first. \"()\" can be nested.",
            "String concatenation operator.",
            "Addition operator. Implicit type conversion may be performed if any of the operands are not numbers.",
            "Subtraction operator. Implicit type conversion may be performed if any of the operands are not numbers.",
            "Multiplication operator. Implicit type conversion may be performed if any of the operands are not numbers.",
            "Division operand. Implicit type conversion may be performed if any of the operands are not numbers. Note that \"/\" is not used because it is part of the XPATH syntax.",
            "Equal-to-any-member-of test.",
            "Negates the IN operator. Not-Equal-to-any-member-of test."
        ]
    ],
    "pageTitle": "Creating eText Templates",
    "title": "",
    "url": "http://docs.oracle.com/cd/E28280_01/bi.1111/e22254/create_etext_tmpl.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00144-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 72782003,
    "recordOffset": 72757117,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27692=1234.568, 27509=1234.56789, 94276=FORMAT_DATE(\"1900-01-01T18:19:20\", \"YYYY/MM/DD HH24:MI:SS\"), 94401=1900/01/01 18:19:20, 36820=1234,568, 116010=If the report data contains Simplified Chinese characters and the <OUTPUT CHARACTER SET> is set to GBK, then the Chinese characters do not display properly in Internet Explorer 7 with gbk2312 encoding. This issue may also occur in other non-English encodings as well, such as native Japanese and Korean. The output renders appropriately with Firefox 3.5, when setting the character set to be GBK in the eText template and setting the browser encoding to be GBK or GB2312. You can work around this issue by setting <OUTPUT CHARACTER SET> to utf-8. Note that this is a browser display issue only. The text file is generated correctly.}",
    "lastModified": "Wed, 14 Jan 2015 14:06:12 GMT",
    "textBeforeTable": "Table 8-12 Operators Table 8-12 lists the operators and describes their usage. There are two groups of operators: the boolean test operators and the expression operators. The boolean test operators include: \"=\", \"<>\", \"<\", \">\", \">=\", and \"<=\". They can be used only with the IF control structure. The expression operators include: \"()\", \"||\", \"+\", \"-\", and \"*\". They can be used in any expression. 8.9.6 Operators IS NULL, IS NOT NULL - these phrases are used in the IF control structure. They form part of boolean predicates to test if an expression is NULL or not NULL. IF THEN ELSE IF THEN ELSE END IF - these key words are always used as a group. They specify the \"IF\" control structure expressions. Key words and phrases used in expressions must be in capital letters and bold fonts. 8.9.5 Expression Key Words L, R- in the <PAD> column, specifies the side of the padding (Left or Right). Date - in the <FORMAT> column, specifies the data type is date. Decimal - in the <FORMAT> column, used with the Number key word. Takes the decimal part of the number. This has the same functionality as the DECIMAL function, except the DECIMAL function is used in expressions, while the",
    "textAfterTable": "8.9.7 Reference to XML Extract Fields and XPATH Syntax XML elements can be used in any expression. At runtime they are replaced with the corresponding field values. The field names are case-sensitive. When the XML extract fields are used in the template, they must follow the XPATH syntax. This is required so that the BI Publisher engine can correctly interpret the XML elements. There is always an extract element considered as the context element during the BI Publisher formatting process. When BI Publisher processes the data rows in a table, the level element of the table is the context element. For example, when BI Publisher processes the data rows in the Payment table, Payment is the context element. The relative XPATH you use to reference the extract elements are specified in terms of the context element. For example to refer to the PayeeName element in a Payment data table, specify the following relative path: Payee/PayeeInfo/PayeeName Each layer of the XML element hierarchy is separated by a backslash \"/\". You use this notation for any nested elements. The relative path for the immediate child element of the level is just the element name itself. For example, you can use TransactionID element name as is in the Payment table. To reference a parent level element in a child level table, you can use the \"../\" notation. For example, in the Payment table if",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}