{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "join greek life, a business fraternity, play collegiate sports",
            "the food is limited and after being here four years it will probably get old but for now it isn't too bad.",
            "i love living in the dorms especially since my walk to class is very short.",
            "the classes are hard but i have heard some teachers are a little harder when you have 300+ students in the class.",
            "living on campus is a lot easier because the parking is limited for off-campus students.",
            "missouri western is a great school with an awesome community. the campus is beautiful and it is very easy to get around. also, the teachers and students are always there for you."
        ]
    ],
    "pageTitle": "Missouri Western State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Missouri-Western-State-University/reviews?_escaped_fragment_=/show/2766",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 922905719,
    "recordOffset": 922860975,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{164963=Pretty much all of the activities around campus are free and open to all students. There is a new Walter Cronkite memorial in the history department, the School of Fine Arts has had some remodeling done to accommodate theatrical productions, and in 2015 the football stadium will also be remodeled to allow for more fans and VIPs., 169876=© 2015, Cappex.com, LLC, 3159=When I started college in the fall of 2008 I was really unsure of what my major was going to be and what I wanted to do for the rest of my life. Taking the general studies classes at Missouri Western has really helps students figure out what they enjoy and want to pursue. At Missouri Western everyone learns so much due to the great professors. Granted, not all the professors are wonderful but the majority of them are and they truly care about teaching and making sure every student in the class receives all of the materials and resources needed in order for them to succeed., 31111=i have never personally lived in dorm since i have an exemption i mentioned above. however, i have several good friends that live in dorm and they all enjoy it. the university has several greek sororities and fraternities with members from all backgrounds that you can chose to get involved in. two new buildings were completed in 2011 that accepted students for housing this semester spring 2012. another building was completed in 2010 for student housing., 95202=Arriving at Missouri Western located in St. Joseph, Mo in Fall 2011 I didn't know what to expect. I had never been on a tour and I missed registration. I didn't even know what the town looked like. I was moving four and a half hours away from home and I was sure I would hate it, but to my surprise I am actually enjoying Missouri Western. The quiet and small town is a great environment and a perfect place to put a school. The small town helps you focus on why you are there to begin with and everyone needs a little reminder from time to time.}",
    "textBeforeTable": "08/22/2009 Reviewer is A current student here. 18 out of 18 people found this review useful. 1 of 40 Bethany from Saint Joseph, MO Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Danielle from Kansas City, MO 06/09/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 10 out of 10 people found this review useful. 2 of 40 Categories Comments Great for these types of students Those that want to be on their own but sometimes get home sick. Those that want to stay close to home for a few years. Tips for prospective students Not very far from Kansas City, metro area. Login to rate or flag the reviews Joseph from Trenton, MO 05/23/2011 Reviewer is Researching this school. Reviewer has been to campus. 3 out of 3 people found this review useful. 3 of 40 Categories Comments Great for these types of students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}