{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "1317.27",
            "1280.51",
            "1279.19",
            "1241.59"
        ],
        [
            "NSE",
            "1317.03",
            "1280.38",
            "1279.47",
            "1241.89"
        ]
    ],
    "pageTitle": "Apollo Hospitals Enterprises Stock Price, Share Price, Live BSE/NSE, Apollo Hospitals Enterprises Bids Offers. Buy/Sell Apollo Hospitals Enterprises news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/hospitals-medical-services/apollohospitalsenterprises/AHE?sc_did=AHE",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00161-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 589089923,
    "recordOffset": 589038209,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{136072=28 July 2015, 136583=UnitedBrewerie Jul Fut, 216851=Apollo Hospital is in the Hospitals & Medical Services sector. The current market capitalisation stands at Rs 18,441.74 crore. The company management includes Prathap C Reddy - Founder & Executive Chairman, Suneeta Reddy - Managing Director, Sangita Reddy - Joint Managing Director, Preetha Reddy - Executive Vice Chairperson, Shobana Kamineni - Executive Vice Chairperson, Deepak Vaidya - Director, Habibullah Badsha - Director, Rafeeque Ahamed - Director, Raj Kumar Menon - Director, N Vaghul - Director, G Venkatraman - Director, Sanjay Nayar - Director, Vinayak Chatterjee - Additional Director. It is listed on the BSE with a BSE Code of 508869 and the NSE with an NSE Code of APOLLOHOSP. Its Registered office is at No.19, Bishop Gardens, Raja Annamalaipuram, Chennai (Madras),Tamil Nadu - 600028. Their Registrars are Integrated Enterprises (India) Ltd., 137290=JSWSteel Jul Fut, 215540=Zensar Technologies Recommended on Mar 24th 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}