{
    "relation": [
        [
            "Parameter",
            "String jobInstanceID",
            "String bipSessionToken"
        ],
        [
            "Description",
            "The ID assigned to the job instance. The jobInstanceID is a string of integers.",
            "The proprietary token string generated for the user by the BI Publisher server. With the bipSessionToken string, the user no longer needs to provide user credentials. The BI Publisher server can validate this token string and restore the BI Publisher server session to perform needed operation."
        ]
    ],
    "pageTitle": "ScheduleService - 11g Release 1 (11.1.1)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E25178_01/fusionapps.1111/e26385/scheduleservice.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00205-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 66327156,
    "recordOffset": 66311561,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{91051=Specifies a ScheduleRequest object for the report that you want to run. See Section 2.3.48, \"ScheduleRequest.\", 22703=The DeliveryRequest object. See Section 2.3.21, \"DeliveryRequest.\", 36672=The JobFilterProperties object specifies the specific criteria for the report jobs you want to return information about. See Section 2.3.30, \"JobFilterProperties.\", 93905=Specifies the delivery channels through which the report will be delivered. See Section 2.3.20, \"DeliveryChannels.\", 60630=Use the getScheduledReportdeliveryInfo() method to retrieve information about the delivery of a scheduled job output. For each scheduled Job, it could have multiple outputIDs. For each outputID, there could be multiple delivery info. See Section 2.3.35, \"JobOutputDeliverysList.\", 93524=Specifies a ScheduleRequest object for the report that you want to run. See Section 2.3.48, \"ScheduleRequest.\".}",
    "lastModified": "Thu, 20 Sep 2012 17:32:48 GMT",
    "textBeforeTable": "Table 3-22 Parameters for getScheduledJobInfoInSession() Method JobDetail getScheduledJobInfoInSession(String jobInstanceID, String bipSessionToken); Signature For more information about in-session methods, see Section 1.2, \"About In-Session Methods.\" Returns a JobDetail object that provides the details for the job that's associated with a given jobInstanceID and the bipSessionToken of a given user. 3.22 getScheduledJobInfoInSession() Method Specifies the password for the user name. String password Specifies the BI Publisher user name. String userID The ID of the job for which to return job information. int jobInstanceID Description Parameter Table 3-21 Parameters for getScheduledJobInfo() Method JobInfo getScheduledJobInfo(int jobInstanceID, String userID, String password); Signature Use the getScheduledJobInfo() method to return a JobDetail object that provides the details about a submitted job,",
    "textAfterTable": "3.23 getScheduledReportDeliveryInfo() Method Use the getScheduledReportdeliveryInfo() method to retrieve information about the delivery of a scheduled job output. For each scheduled Job, it could have multiple outputIDs. For each outputID, there could be multiple delivery info. See Section 2.3.35, \"JobOutputDeliverysList.\" Signature JobOutputDeliverysList getScheduledReportDeliveryInfo(String jobOutputID, String userID, String password); Table 3-23 Parameters for getScheduledReportDeliveryInfo() Method Parameter Description String jobOutputID The ID assigned to the output of the job for which you want information. The jobOutputID is a string of integers. String userID Specifies the BI Publisher user name. String password Specifies the password for the user name. 3.24 getScheduledReportDeliveryInfoInSession() Method Returns a JobOutputDeliverysList object that provides the details for a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}