{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Keep up with the Center for Student Development. They always have activities planned.",
            "Food is okay. A little expensive.",
            "From what i hear dorm life is good.",
            "I have learned a lot.",
            "Be involved in the Center for Student Development.",
            "Texas Woman's University is an amazing school. I have the best fo luck with getting great professors. The class rooms are not too large and you get more attention from the professors."
        ]
    ],
    "pageTitle": "Texas Woman's University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Texas-Womans-University/reviews?_escaped_fragment_=/show/97471",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 889678339,
    "recordOffset": 889544482,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{392602=If you go here, take this advice, get the University Meal Plan. If you get one of the ones with the meals and only some dining dollars you will regret it. You can only use those meals at the Underground and the majority of the time, that food sucks. When you get the University Meal Plan you get 1500 dollars that you can spend on anything at the university so its much more worth it., 67638=TWU is pretty cheap, even for out of state students. If you receive a scholarship of $1000, they give you in state tuition., 815225=© 2015, Cappex.com, LLC, 774053=Overall, I am impressed with TWU. They have several programs that would fit for anybody. Currently, I am a senior graduating in May and my past fours years at TWU have been great. They have great staff in all departments, very friendly and always willing to help., 694006=There are a few activities to join like right now I am in boot camp it 6:30 a.m.-7:30a.m. they have sports for boys and girls and wild out doors activity., 35790=Tuition does go up every year, but what college doesn't? Right now for Fall 2011, tuition and fees for undergrad resident students taking about 12 hours (full time) is $2,714.32. That is not including housing. You can check it out here: http://www.twu.edu/bursar/6107.asp}",
    "textBeforeTable": "01/06/2010 Reviewer is A current student here. 24 out of 26 people found this review useful. 1 of 202 L.D.M. Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp =",
    "textAfterTable": "Alelia from Mesquite, TX 06/27/2011 Reviewer is A current student here. 15 out of 16 people found this review useful. 2 of 202 Categories Comments Great for these types of students Students interested in Nursing or any other medical major. Students who are serious about their education. Students who do not find homecoming and football games important Commuter students: TWU is a great school for commuters who live in the area. Students with a family or Nontraditional students: This school is no stranger to nontraditional students. I had a woman in my class who was 55 and we are great friends today! We also have a daycare and a playground for children. However, I would not recommend the daycare because I have heard that they cost too much money and only watch your children for a small amount of time. I still say this school is great for students who have a family because our classes teach so much about family structure, and child development. Tips for prospective students Find friends that have your same goals in mind. Watch who your friends are because you do not want",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}