{
    "relation": [
        [
            "",
            "1",
            "2"
        ],
        [
            "RxCUI",
            "855288",
            "855288"
        ],
        [
            "RxNorm NAME",
            "warfarin sodium 1 MG Oral Tablet",
            "Warfarin Sodium 1 MG Oral Tablet"
        ],
        [
            "RxTTY",
            "PSN",
            "SCD"
        ]
    ],
    "pageTitle": "DailyMed - WARFARIN SODIUM - warfarin sodium tablet",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=ab50f13c-7ec9-44b4-9a9f-ee3ddda6c8ea",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00288-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 61333363,
    "recordOffset": 61284865,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1625=Revised: November, 2011 90145-1111-13, 1837=Revised: October 2011, 42462=In a randomized trial in 210 patients comparing two intensities of warfarin therapy (INR 2.0-2.25 vs. INR 2.5-4.0) for a three-month period following tissue heart valve replacement, thromboembolism occurred with similar frequency in the two groups (major embolic events 2.0% vs. 1.9%, respectively, and minor embolic events 10.8% vs. 10.2%, respectively). Major hemorrhages occurred in 4.6% of patients in the higher intensity INR group compared to zero in the lower intensity INR group., 1159=1000 Tablets, 17671=Revised: November 2011 90145-1111-13, 133351=Revised: 11/2011, 5908=Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088., 73238=Of the total number of patients receiving warfarin sodium in controlled clinical trials for which data were available for analysis, 1885 patients (24.4%) were 65 years and older, while 185 patients (2.4%) were 75 years and older. No overall differences in effectiveness or safety were observed between these patients and younger patients, but greater sensitivity of some older individuals cannot be ruled out., 136431=To report SUSPECTED ADVERSE REACTIONS, contact FDA at 1-800-FDA-1088 or www.fda.gov/medwatch., 41729=WARIS (The Warfarin Re-Infarction Study) was a double-blind, randomized study of 1214 patients 2 to 4 weeks post-infarction treated with warfarin to a target INR of 2.8 to 4.8. The primary endpoint was a composite of total mortality and recurrent infarction. A secondary endpoint of cerebrovascular events was assessed. Mean follow-up of the patients was 37 months. The results for each endpoint separately, including an analysis of vascular death, are provided in Table 7:}",
    "textBeforeTable": "Number of versions: 1 WARFARIN SODIUM - warfarin sodium tablet View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Boxed Warnings, Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close repack 156893695 PD-Rx Pharmaceuticals, Inc. Business Operations ID/FEI Address Name Establishment Registrant - PD-Rx Pharmaceuticals, Inc. (156893695) Labeler - PD-Rx Pharmaceuticals, Inc. (156893695) 07/15/1999 ANDA040301 ANDA",
    "textAfterTable": "RxNorm WARFARIN SODIUM - warfarin sodium tablet RxCUI RxNorm NAME RxTTY 1 855288 warfarin sodium 1 MG Oral Tablet PSN 2 855288 Warfarin Sodium 1 MG Oral Tablet SCD Get Label RSS Feed for this Drug WARFARIN SODIUM - warfarin sodium tablet To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=ab50f13c-7ec9-44b4-9a9f-ee3ddda6c8ea To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To view updated drug label links, paste the RSS feed address (URL) shown below into a RSS reader, or use a browser which supports RSS feeds, such as Safari for Mac OS X. How to discontinue the RSS feed If you no longer wish to have this DailyMed RSS service, simply delete the copied URL from your RSS Reader. More",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}