{
    "relation": [
        [
            "Joseph Tucker",
            "Thomas Bull",
            "Joshuah Child",
            "Benjamin Phillips",
            "William Field"
        ],
        [
            "Thomas Hoppen",
            "John Craft",
            "Richard Puffer",
            "William Deane",
            "Thomas Betell"
        ],
        [
            "James Hadlock",
            "Benjamin Merifield",
            "John Parker",
            "Daniel Harris",
            "John Holbrooke, Capt."
        ]
    ],
    "pageTitle": "Men and Officers who served in King Philips War = soldiers.htm",
    "title": "",
    "url": "http://bigelowsociety.com/rod/soldiers.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00114-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 23586983,
    "recordOffset": 23562791,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{40121=The following lists of men impressed in several towns where Capt. Davenport's company was raised will serve to identify many of the names. Of course, many impressed were either excused for disability or escaped from the service in some other manner. The returns were dated from Nov. 25 t0 Dec. 3, 1675., 48483=Ephraim Turner, lieutenant of Captain Oliver's company, was the son of Robert Turner, who came to Boston, September 4, 1633, in the ship Griffin, with Rev. John Cotton. Robert and his wife Penelope had their eldest son Ephraim who was born December 13, 1639. He was a freeman in 1666 and a member of the Artillery Company. From 1675 to 1680 he was an Ensign in Capt. Oliver's First Boston company. He married Sarah Philips, daughter of Major William, of Charlestown, Boston and Saco, and through her came into possession of large tracts of land in what is now Sanford, Alfred and Waterboro. His children, all born in Boston, were: Derlow born Dec. 3, 1663; Robert born June 17, 1665; Sarah born March 24, 1666-7; Abigail born June 8, 1669; Ephraim born Nov. 23, 1670; Elizabeth born August 19, 1672; Deliverance born August 1, 1673. , 16521=Isaac John was the son of John of Roxbury. He was born in England and came to Massachusetts with his father's family, probably in the company with Gov. Winthrop. He was admitted freeman March 4, 1635., 15547=A Lyst of Capt. Joseph Gardiner Company yt wounded and Slayne of his Company, some ye 16 Decr & Other 19th dec 75, 61225=Capt. Holbrooke was a very enterprising man of business, and his real estate operations were quite extensive for his day. He was also prominent in military affairs, was Lieutenant of the local company, and, August 8th, 1664, was chosen to go upon some service as Lieutenant in the company of Capt. Hudson, but his wife and family being sick at the time, Ensign John Thurston, was appointed in his stead. In the time of Philip's war he was in command of the local company, and in the spring of 1676 was appointed to command one of the companies raised and sent out to suppress the \"Insolences\" of the Indians and to \"range the woods towards Hassanamesit\". Capt. Holbrooke died November 23, 1699. , 25521=The following list of Capt. Johnson's company, made at Dedham December 10th 1675, is preserved in Mass. Archives, vol. 67, p. 293  , 16732=He was of the Artillery Company in 1645, and was its captain in 1667. He was ensign of the \"Rocksberry\" military company previous to 1653, and on June 13th of that year was elected captain. He was representitive 1671., 61976=In a letter written from Concord on April 29, 1676:, 60556=All the data we have concerning Capt. John show the above age to have been some six years less than given upon his headstone, and to have been incompatible with many points in history. He married Elizabeth Stream, who died June 25th, 1688, aged 64 years; and second, widow Mary Loring, who survived him. His children were- John, married Abigail Pierce, daughter of Capt. Michael; a daughter, married Simon Whitmarsh; Abiezer; Hannah, married Ephraim Pierce, son of Capt. Michael; Grace, married Joseph Nash of Boston; Samuel; Lois and Eunice, twins; Eunice, married Benjamin Ludden; Experience, married Joseph Edson; Ichabod, married Sarah Turner., 32794=In December 1675 Nathaniel Davenport was serving on the jury at the Court of Assistants when he was summoned to take command of the 5th Company in the Massachusetts Regiment for the Naragansett Campaign. This company was made up chiefly of men from Cambridge and Watertown. The company mustered at Dedham Plain and marched to Naragansett with the army. On December 19th , at the Great Fort fight, Capt. Mosely and Capt. Davenport led the way and were the first officers to enter the fort., 1055=On May 12, 1675, the militia of Salem was divided into two companies by order of the Court, and by the same order the election of Joseph gardiner as captain of the First Company in Salem was confirmed. When the expedition against the Naragansetts was organized, Capt. Gardiner was appointed, November 3, 1675, to command a company raised at Salem and the adjoining towns, and mustered his men, ninety-five strong, at Dedham Plain, December 10th , and marched with his army towrds the rendezvous at Wickford. During the march several skirmishes took place, and Mr. Hubbard relates that some of Stone-wall-John's crew \"met with some of Capt. Gardiner's men that were stragling about their own business contrary to order, and slew his Sergeant with one or two more.\" In \"Capt. Oliver's Narrative\" it is related that on this occasion the Indians \"killed two Salem men within a mile of our quarters and wounded a third so that he his dead.\" The fall of Capt. Gardiner is thus related in Church's \"Entertaing History\":, 3073=His widow, then aged about thirty-four, married June 6, 1676, Gov. Simon Bradstreet, whose age was about seventy-three. She died April 19, 1713, aged 79. Leaving no children, Capt Gardiner's Naragansett claim fell to the oldest male heir of his eldest brother Thomas. This heir was Habkkuk Gardiner, son of the Captain's nephew Thomas, who in the list of claimants claims in the \"right of his uncle, Capt. Joseph Gardiner.\" , 46740=James Oliver was the son of Thomas and Ann, who came from England, Bristol, Somersetshire, in the ship \"William and Francis\" March 8, 1632 with their family of six sons and two daughters. They settled in Boston, where Thomas died June 1, 1658. James was admitted freeman on October 12, 1640. He was a selectman in 1653 and inspector of the port of Boston. He was a member of the Artillery Company and chosen Ensign, 1651; Lieutenant 1653; Captain 1656 and again in 1666. He was a member of the First Military Company of Boston and elected Captain, probably, in 1673. On November 17, 1675 he was appointed to command the Boston company for the Naragansett campaign. He was one of the few officers who made it through the Swamp Fight uninjured., 2540=After the death of Capt. Gardiner, the command of his company fell upon his lieutenant, William Hathorn, under whom the men served the remainder of the campaign, until disbanded about February 7th to 10th. It is thus that the men were credited sometimes under Gardiner, sometimes under Hathorn, occasionally both; the latter's name signed to the voucher on \"debenter\" which each soldier presented to the paymaster, doubtless confused the clerks and caused this appearance of double command., 16292=Source- Soldiers in King Philips War, George Madison Bodge, pub. 1906, page 167, 48149=James Oliver married between 1641 and 1655, Mary, widow of John Frend, and daughter of Thomas Dexter, who died before he did and left no issue to him; at his death in 1682, two of his nephews, John and Nathaniel Oliver, administered his estate, and his nephew, Daniel Oliver, inherited his Naragansett claim. , 784=He was a man of energy and ability and held many positions of honor and importance in Salem. In May, 1672, he was appointed by the General Court of Massachusetts, lieutenant of the foot company under Capt. William Price of Salem (Mass. Colony Records, V, 517)., 23288=Under Capt. Johnson, June 24th  , 31837=Capt. Nathaniel Davenport was born in Salem, Mass., and was the son of Richard Davenport and his wife Elizabeth Hathorn. Richard came to Salem with Endicott in 1628, from Weymouth in Dorsetshire, was admitted a freeman September 3, 1634, was an ensign in the local militia same year, and served in 1637 as a lieutenant in the Pequod expedition, where he was wounded. He was representitive in 1637 and joined the Artillery company in 1639. Removed to Boston in 1642 and was appointed Captain at the Castle, which post he filled for many years, and was there killed by lighting on July 15, 1665. His children were Nathaniel; Truecross, born in 1634-5; Experience, baptized August 27, 1637; John, baptized September 19, 1641 at Salem; Samuel, baptized June 28, 1656 at Boston; Sarah, September 30, 1649; Elizabeth, September 13, 1652; William, born May 11, 1656. The widow died June 28, 1678. Nathaniel married Elizabeth Thacher, daughter of Thomas., 62928=June 24th 1676  , 34018=Lieutenant Ting (or Tyng) commanded the company during the rest of this campaign, and many credits are given under him as Captain. He was the son of Capt. Edward Tyng of Boston, and was born March 26, 1649. He removed to Falmouth in 1680, and soon after married Elizabeth, daughter of Thaddeus Clark and great-grandaughter of George Cleeves. He was in command of Fort Loyal 1680 and 1681; was counsellor and magistrate for Maine under President Danforth, and in 1686 was appointed by the King one of the council of his brother-in-law Joseph Dudley, and afterward under Andros, who made him lieutenant-colonel and placed him in command in the province of Sagadahoc in 1688 and 1689, and after the reduction of Nova Scotia was appointed governor of Annapolis, but on his way to that place his vessel was captured by the French, and he was taken to France where he died. , 47503=In a petition to the Court, May 19, 1680 he ask to be relieved as captain of the Boston company due to age and \"Lameness\" and also aske to be granted \" the Island wheron the Indian Wianenset lately dwelt lying neer Dunstable.\" In answer the Deputies passed a vote \" he dweling with his kinsman Nathaniel Barns Doe for the Relife of ye petitioner, give grant unto sd Barns, his heires and Assignes forever, a small Island of upland Containing about twenty acres wch lyeth in the Merimak Tiver near to Mr. Jonathan Tings farme, wch Isalnd hath been Commonly Caled & knowne by y name of Tinker's Island.\", 16981=He married Elizabeth Porter, of Roxbury, January 20, 1637, and had Elizabeth, born Dec. 24, 1637; John born Nov. 3, 1639, died 1661; Mary born Apr. 24, 1642; Isaac baptized Jan'y 7, 1644; Joseph baptized Nov. 9, 1645, died soon; Nathaniel born May 1, 1647. The daughter Elizabeth married Henry Bowen, who became lieutenant of his company and was in the Swamp Fight, naturally extended him wedding invitations. The Bowens, with many other Roxbury people, removed sometime after 1686 to the township of New Roxbury, granted them by Massachusetts Colony, but afterwards found to be within the Connecticut bounds and was renamed Woodstock. The eldest son Isaac married Mary Harris and removed to Middletown, Conn. Isaac's son Joseph inherited his grandfather's Naragansett claim, being then of Woodstock. The captain's daughter Mary married in 1663, William Batholomew, and removed to Branford, Conn. The youngest son Nathaniel, married Mary Smith in 1667, and sometime after 1683 removed, probably to Marlborough. His widow died August 13, 1683, 15437=Source- Soldiers in King Philips War, George Madison Bodge, pub. 1906, pages 166-167 , 59033=A List of ye Slayne & wounded in Capt. Olliver's. 19th of December, 1675, 31330=Joso Watson of Roxbury; Wm Linckorn of Roxbury; John Spur of Dorchester, Benj. Crane of Milton; Jno Langley of Hingham; Jno faxton of Hingham; Isaack King of Weymouth; Left. Phineas Upham of Malden- wounded eight, and were taken to Road Island Jan. 6th 1675-6., 3590=February 29th 1675 & 6  , 18136=On July 6, 1675, Capt. Johnson was sent with a small escort to conduct 52 friendly Indians to the army at Mount Hope. On July 15, 1675, on news of the attack upon Mendon, he was sent out there to relieve the town and was ordered back on July 26th. Upon mustering at Dedham Plain for the Naragansett campaign, Capt. Johnson was placed in command of a company made up of men from Roxbury, Dorchester, Milton, Braintree, Weymouth, Hingham, and Hull, numbering 75 all told. At the battle of the Great Swamp fight Capt. Johnson was killed when leading his men against the barrier at the entrance to the fort. After his death and the mortal wound of Lt. Upham, the command of the company passed to Ensign Henry Bowen, later promoted to lieutenant. Some of the men below are credited with serving under Capt. Johnson and Captain Jacob, the latter is probably Captain John Jacob of Hingham who assumed command of the company. , 31069=The following is a list of those soldiers yt slayne & wounded of Capt. Johnson's Compa December 1675}",
    "lastModified": "Thu, 12 Jan 2012 18:22:00 GMT",
    "textBeforeTable": "February 29th 1675 & 6   Capt. Joseph Gardiner and his men His widow, then aged about thirty-four, married June 6, 1676, Gov. Simon Bradstreet, whose age was about seventy-three. She died April 19, 1713, aged 79. Leaving no children, Capt Gardiner's Naragansett claim fell to the oldest male heir of his eldest brother Thomas. This heir was Habkkuk Gardiner, son of the Captain's nephew Thomas, who in the list of claimants claims in the \"right of his uncle, Capt. Joseph Gardiner.\"  After the death of Capt. Gardiner, the command of his company fell upon his lieutenant, William Hathorn, under whom the men served the remainder of the campaign, until disbanded about February 7th to 10th. It is thus that the men were credited sometimes under Gardiner, sometimes under Hathorn, occasionally both; the latter's name signed to the voucher on \"debenter\" which each soldier presented to the paymaster, doubtless confused the clerks and caused this appearance of double command. \"Mr. Church spying Capt. Gardiner of Salem amidst the Wigwams at the east end of the Fort, made towards him; but on a sudden while they were looking each other in the face, capt. Gardiner settled down, Mr. Church stepped to him, seeing the blood run down his cheek lifted his cap and calling him by name, he looked up in his face but spake not a word, being mortally Shot through the head.\" On May 12, 1675, the militia of",
    "textAfterTable": "Christopher Read William Bassett  Samuel Graves John Farrington William Driver  Andrew Townsend Jonathan Looke Charles Knight  John Prince Andrew Sargeant Edward Haradine  John Trask Joseph Houlton Isaac Welman  William Pritchett John Matson Benjamin Chadwell  Stephen Greenleaf Amos Gurdon Peter Emmons William Webb Robert Sibly Andrew Ringe  Benjamin Langdon James Briarly Benjamin Webster  Freegrace Norton Israel Thorne Ezekiel Woodward  John Wheeler William Wainwright John Boutwell  Jonathan Clark William Williams Samuel Rust  Benjamin Sweet, Lieut Henry Dow Sylvester Hayes  Thomas Tenney Joseph Jewett John Boynton  Peter Coomes Jonathan Copp John Mann March 24 th 1675-6   John Vowden Lawrence Majore  Thomas Flynt Thomas Greene John Read Adam Gold Zacheus Perkins William Pabody  Joseph Gardiner, Capt. James Fry Leonard Toser April 24 th 1676   Thomas Kenny John Stacy June 24 th 1676",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}