{
    "relation": [
        [
            "Outsourcer name",
            "Akebono / GoiHata, S.L.",
            "Giuseppe Tricarico"
        ],
        [
            "Country",
            "Spain",
            "Germany"
        ],
        [
            "LWA",
            "5",
            "5"
        ],
        [
            "Comment",
            "Hidden",
            "Hidden"
        ],
        [
            "Outsourcer feedback",
            "...",
            "..."
        ]
    ],
    "pageTitle": "English/German/Spanish Translator specializing in automotive, machines, computing, technichal",
    "title": "",
    "url": "http://www.proz.com/translator/598346",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00330-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 672049217,
    "recordOffset": 672032823,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Access to Blue Board comments is restricted for non-members. Click the outsourcer name to view the Blue Board record and see options for gaining access to this information. 2 entries Blue Board entries made by this user  PRO-level points: 4, Questions answered: 8 KudoZ activity (PRO) Less More Automation & Robotics Ships, Sailing, Maritime Environment & Ecology Fisheries General / Conversation / Greetings / Letters Food & Drink Electronics / Elect Eng Art, Arts & Crafts, Painting Astronomy & Space Biology (-tech,-chem,micro-) Agriculture Construction / Civil Engineering Cooking / Culinary Cosmetics, Beauty Education / Pedagogy History Science (general)",
    "textAfterTable": "More Less Payment methods accepted MasterCard, Check, Wire transfer, Money order, Visa, PayPal, Skrill Translation education Master's degree - University of Vigo Experience Years of translation experience: 6. Registered at ProZ.com: Sep 2006. Became a member: Jun 2007. ProZ.com Certified PRO certificate(s) N/A Credentials English to Spanish (Master's degree in Translation and Interpretation, verified) German to Spanish (Master's degree in Translation and Interpretation, verified) English to Spanish (Cambridge University - ESOL, verified) English to Spanish (Trinity College London, Spoken English for Speaker, verified) English to Spanish (Instituto Europeo Campus Stellae: Master de Comerc) Memberships N/A Teams Docu-Trans Software Across, Adobe Acrobat, Adobe Illustrator, Adobe Photoshop, FrameMaker, Frontpage, Indesign, Microsoft Excel, Microsoft Word, Excel, Framemaker, Pagemaker, Word, Pagemaker, Powerpoint, QuarkXPress, SDL TRADOS, SDLX, Wordfast Studio 2009 - Getting Started (Level 1) Training sessions attended SDL Trados Studio 2009 Getting Started for Translators European Translators: Adapt Your Marketing Materials to Target US-based Clients [download] SDL Trados Studio 2009 Intermediate for Translators SATURDAY",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}