{
    "relation": [
        [
            "Day",
            "Mon",
            "Tue",
            "Wed",
            "Thu",
            "Fri",
            "Sat",
            "Sun"
        ],
        [
            "Drink Special",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--"
        ],
        [
            "Food Special",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--"
        ]
    ],
    "pageTitle": "Goose Island Brew Pub: Chicago Bar Project",
    "title": "",
    "url": "http://www.chibarproject.com/Reviews/GooseIsland/GooseIsland.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00111-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 370038763,
    "recordOffset": 370017080,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{32240=Prior to its existence as this side of hell, Cabrini Green and greater Goose Island area was host to a series of barrack-like buildings that were built to house families whose homes had been destroyed in the Great Chicago Fire of 1871, according to Ken Schessler's Unusual Tour of Chicago. Once these families got back on their feet and moved out, the \"Barracks\" filled with ruffians who spent all their time drinking and fighting and the area grew to a population of about 32,000 with 400 saloons. The worst of these dives were in a poor Italian slum section called \"Little Hell,\" that centered around Oak Street and Cleveland. At this particular intersection, there were 42 unsolved murders between January 1, 1910 and March 26, 1911, causing it to be called \"Death Corner\" or \"Deadman's Corner.\", 44683=Thankfully, Goose Island successfully renegotiated their lease in 2009 to stay open at this, their flagship location, for at least three more years. The lease was up in December and, up until November 12, this Chicago classic was in serious jeopardy of being lost forever... Click here for Chicago Tribune story., 29942=Back when Goose Island originally opened, the neighborhood was a different place. This slice of Lincoln Park was gang-ridden and rough, especially considering its close proximity to the notorious Cabrini Green housing project \u0096 a \"project\" that was a miserable failure. Since it opened in 1941, Cabrini Green became one of the most wretched public housing in the world and synonymous with abject poverty, oppressive violence, children falling out of high-rise windows, prostitution, gang warfare, and drug trafficking even though it was located next to one of the wealthiest parts of the city. Fifteen buildings were constructed in all to house 7,000 residents, primarily consisting of African-Americans escaping the ignorance and racial struggles of the South. Since then, the urban blight known as Cabrini Green was the site where two Chicago policemen were killed by sniper fire in 1970, was the only place where I saw a McDonald's close, was formerly host to an El stop on the Blue Line that was shut down, and was a place where cops would not get out of their cars if there was a traffic accident (they would tell you to drive to the nearest police station). In the winter of 1993, I got a job over Christmas break at Artist's Frame Service, located a few blocks from the Goose Island Brew Pub on Clybourn, working for the entrepreneurial visionary, HR-guru and former Northern Illinois University graduate, Jay Goltz. My parents actually paid me over $200 to quit so that I did not have to drive through the grunge of the West Side or anywhere near Cabrini Green. My parents would be horrified to know that I actually played softball on a field there in 1997, just after they boarded up the most visible high rise and just before to its demolition. This particular season was highlighted by the final game in which an Australian on the team bunted with the bases loaded \u0096 he was immediately called out as you cannot bunt in softball, and the game, and our season, was abruptly over., 37044=What has become one of the most popular and prevalent beers in Chicago is brewed here. A large chalkboard that hangs upon the south wall illustrates all 10 beers on tap and those planned for the rotation. You'll find such old favorites as Honker's Ale (their flagship ale with 4.0% alcohol content, actually brewed at their Fulton Street brewery), India Pale Ale (6.0%), Blonde Ale (4.0%), Goose Pils (4.9%), Cask Conditioned Pale Ale (5.2%), Demolition 1800 Ale (8.0%), and Hex Nut Brown Ale (4.5%). These staples can be found alongside a wide variety of continuously updated seasonal ales, such as the Colonial Pumpkin Ale, Smooth Oatmeal Stout, Honest Stout, Winter Warmer (a hearty Porter), Bourbon County Stout, Yorkshire Bitter, Maduro, Oatzen, Kolsch, New Glarus Zwickel, Robert Burns Scottish Ale, Islay Stout, Russian Stout, Old Aberration Barley Wine, Hefe Weizen, Dunkel Weizenbock, Icarus Barley Wine, Smoked Porter, Anniversary Ale, Bayou Bitter, Blue (Belgian-style), Kilgubbin Ale, XXX Porter, Willow Street Wheat, 15-Year ESB, Goose Bite, and Jubilation Ale just to name a few. About 50 different beers in total are available throughout the year and each one is served in a glass designed specifically to hold it. Expect to pay at least $4 a beer, which just goes to show that happiness doesn't come cheap. The only non-Goose Island beer served is Bud Light in bottles., 19690=1800 N. Clybourn Ave. (1800N, 1000W) Chicago, IL 60614 (312) 915-0071, 35351=Another thick wooden door opens up into the main barroom of the Goose Island Brew Pub. Here, a large, square mahogany bar reminiscent of the one in Cheers (inspired by that found at the Bull & Finch Pub in Boston) dominates a spacious room lined with wooden booths. The hardwood floor and exposed brick walls give this room a very warm and comfortable feel. Additional restaurant-style seating and non-smoking area is available in the sunken room located a few steps below the main room, at the extreme west end of the bar. According to Shecky's Bar, Club & Lounge Guide 2002, this part of the bar was, \"once home to abandoned railway cars, wary hookers and bums.\" With that in mind, this enclosed porch area with its stone tile, circular tables, wooden ice cream parlor chairs, beige walls, and plate glass windows is somewhat duller than its origins but fine to have a meal in \u0096 only if all the booths in the main barroom are taken as it is somewhat more quiet and sterile. Alternatively, there is a carpeted entertainment area with a pool table above the main bar area but in the same room, accessible via wooden steps in the southeast corner. To the right of the Golden Tee machine, more steps lead down to a library-like room with hardwood floors and shelves stocked with books. This area is closed except for private events. Yet another, rather large room can be found past the bar on your right, beyond the sizeable bathrooms. This area hosts occasional bands. Throw in the \"Cellar,\" a semi-private room with a big screen TV located on a lower level, and you've got enough space to holds up to 500 people., 40283=The beer isn't the only story at the Goose Island Brew Pub. The fare is well known for its above average quality and compliment to the beer. In fact, The Official Chicago Bar Guide (1995) points out: an \"alarming percentage of the menu is made with beer.\" Every meal starts out with their homemade chips \u0096 they've got a little kick to them, not only in terms of flavor but also from the $1 basket refill after you've gobbled up the first batch. The appetizer selection is highlighted by the Blonde Ale Cheese Fondue (served in a bread bowl), the Fresh Baked Pretzel (served with Düsseldorf mustard and garlic cheddar cheese spread), calamari marinated with Honker's Ale, Blue Crab Cakes (served with tomatillo, smoked corn salsa and horseradish cream sauce), and grilled goat cheese flatbread. For the health conscious, Goose Island serves an intriguing selection of salads, as well as a few types of soup and chili. An excellent selection of sandwiches is also available, with the Brewer's Stilton Burger being the standout due of its half-pound of black pepper-crusted ground beef, grilled and topped with roasted garlic cloves, English Stilton cheese, and more Düsseldorf mustard on a pumpernickel roll. The pulled pork is also a crowd-pleaser, as is the wild mushroom turkey burger, \"Paulina Market\" half-pound brat, the blackened catfish po' boy, and the smoked turkey grinder. Entrées include the Stockyard Pepper Crusted Strip Steak, Grilled Cider Rubbed Atlantic Salmon, and Shepherd's Pie. Daily specials include the flatiron pot roast (Sunday), Honker's Ale BBQ meatloaf (Thursday), the self-proclaimed, \"World's Best Fish & Chips\" made with Honker's Ale-battered Lake Superior Walleye (Friday), and prime rib (Saturday). Sunday brunch features French toast, frittatas, and Bloody Marys that are topped with a large stuffed olive, a marinated pepper, a chunk of salami, and are served with a wine glass-sized chaser of the ever present Honkers Ale. Cheese cake, apple pie, chocolate fudge cake, and the \"Extra Special Root Beer Float\" tops it all off (before more beer, of course). In the 2002 edition of Zagat's Chicago restaurant survey, Goose Island was rated as \"good\" for food, decor and service, with an average meal costing you about $19. Zagat's went on to say, \"...given their 'great variety' of suds and 'better-than-bar-food' munchies, most pronounce them 'worth a gander.'\" Goose Island probably would have fared better in Zagat's if they had somewhat more consistent quality of food and service. While the servers are often quite helpful in describing the complex flavors of each beer along with the food best suited to be consumed with them, service can sometimes be slow and the food served cold (though this is not as bad at the Clybourn location as at the Wrigleyville location)., 28968=Goose Island is located just north of the landmass that it was named after, and just east of the Chicago River in a somewhat obscure part of Lincoln Park known as the \"Ranch Triangle.\" Tucked away at the corner of Willow and Marcey Street, the brew pub lies just a few yards \"west-ish\" from the intersection of Willow, Sheffield and Lincoln where the US Beer Company can be found (merely a bar despite its promising name). Goose Island opened its doors in 1988 to a beer-swilling public that was just itching for something better than the boredom of Budweiser, Miller Lite and Heineken even if the joint was originally part of an indoor shopping mall. According to Hanging Out on Halsted... and Chicago's North Side (1991): \"Constructed in 1919, the 1800 Clybourn Building has housed a manufacturer and finally The Turtle Wax Company.\" Such former tenants included Muddler's pool hall, Edith's Bar-BQ and the Original Mitchell's.}",
    "lastModified": "Mon, 30 May 2011 01:37:20 GMT",
    "textBeforeTable": "1800 N. Clybourn Ave. (1800N, 1000W) Chicago, IL 60614 (312) 915-0071 Goose Island Brew Pub Written by Sean Parnell   © The Chicago Bar Project  ",
    "textAfterTable": "Welcome to one of the most universally loved pubs in all of Chicagoland. Those who are thirsty will appreciate the endless rotation of handcrafted brews made with superb quality. Those who are hungry will appreciate the well-designed menu that provides the ideal accompaniment to the fine selection of ale. Those who are bored will appreciate the pool tables, the Golden Tee and the general camaraderie that accompanies a room full of people getting sauced on some of the best beer they've ever had. As a result, few pubs in the city are more talked about, recommended, or more frequented by locals and travelers than the Goose Island Brew Pub since it opened in 1988. While their newer location in Wrigleyville is hard to beat after a Cubs game, the original location remains a true Chicago classic. Goose Island is located just north of the landmass that it was named after, and just east of the Chicago River in a somewhat obscure part of Lincoln Park known as the \"Ranch Triangle.\" Tucked away at the corner of Willow and Marcey Street, the brew pub lies just a few yards \"west-ish\" from the intersection of Willow, Sheffield and Lincoln where the US Beer Company can be found (merely a bar despite its promising name). Goose Island opened its doors in 1988 to a beer-swilling public that was just itching for something better than the boredom of Budweiser, Miller Lite and Heineken even if the joint was originally part of an indoor",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}