{
    "relation": [
        [
            "First Name",
            "Mark",
            "Dorothy",
            "Marc-Anthony"
        ],
        [
            "Last Name",
            "Bescher",
            "Coleman",
            "Signorino"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=518AD9AD-9FEB-45AC-8469-DA66562F80E8&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00322-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 221026271,
    "recordOffset": 221008586,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{168612=H.R. 2194, Comprehensive Iran Sanctions Accountability and Divestment Act Bilateral Investment Treaties Doha Round Small Business Exports Export Control Reform NAFTA Repeal National Export Initiative Mexican Trucking Dispute Product Counterfeiting and Piracy International Standards and Conformity Assessment Innovation Pending Bilateral Free Trade Agreements Cotton Subsidy China Policy Brazil Cotton Retaliation Customs Reauthorization Chinese Indigenous Innovation Guidelines International Intellectual Property Rights H.R. 4128, Conflict Minerals Trade Act Custom and Border Protection Trade Facilitation S. 3084, Export Promotion Act Business Visas International Standards Ex-Im Bank H.R. 4645, to ease travel restrictions and sanctions to Cuba Korea Trade Agreement Panama Trade Agreement Columbia Trade Agreement Preference Reform ATPA Preference Program China Currency, 157616=Transportation of Lithium Batteries Transportation Authorization S. 1451, H.R. 1586, FAA reauthorization NextGen Highway Trust Fund extension H.R. 1799, Americans for a Safe and Efficient Transportation System Act (Truck Weights) FAA Authorization Act Proposed Trucking Rules Exemptions Mexican Trucking Retaliation Infrastructure Spending Build America Bonds extension Water Resources Development Act (WRDA) Asian Carp FMCSA Hours of Service Trucking Rules S. 3302, Motor Vehicle Safety Act H.R. 5604, Surface Transportation Savings Act Liner Container Capacity/Ocean Transportation Issues Specialized Freight Mobility and Goods Movement Sanitary Food Act Implementation, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 97961=OSHA Proposed Rule re. Musculoskeletkal disorders Protection America's Works Act H.R. 2847, HIRE Act H.R. 2847, Jobs for Main Street Act Employee Free Choice Act S. 182, Paycheck Fairness Act Healthy Families Act H.R. 4855, Work-Life Balance Award Act H.R. 3721, Protecting Older Workers Against Discrimination OSHA Compliance Assistance Programs Ergonomics Regulations H.R. 4677, Protecting Employees and Retirees in Business Bankruptcies Act America Works Bill Electronic Voting Services H.R. 5107, S. 3254, Employee Misclassification Prevention Act OSHA Increased Penalties Proposal Employee Classification Issues Proposed Miner Safety and Health Act of 2010 Amendment to H.R. 5013, To Improve Acquisition Act of 2010 H.R. 3936, Preserve Benefits and Jobs Act of 2009 S. 3157, Create Jobs and Save Benefits Act of 2010, 87288=H.R. 4061, Cybersecurity Enhancement Act S. 773, Cybersecurity Act of 2010 S. 3480, Protecting Cyberspace as a National Asset Act, 150989=Consumer Product Safety Enhancement Act Tort Reform - health care S. 537, H.R. 1508, Sunshine in Litigation Act S. 148, H.R. 3190, Discount Consumer Pricing Act Medical Malpractice/health care General preemption issues S. 1504, H.R. 4115, Notice Pleading Restoration Act of 2009 H.R. 5503, Securing Protections for the Injured from Limitations on Liability Act H.R. 4678, S. 1606, Foreign Manufacturers Legal Accountability Act S. 1551, H.R. 5042, Liability for Aiding and Abetting Securities Violations Act, 78549=H.R. 3590, Patient Protection and Affordable Care Act H.R. 4872, Health Care and Education Reconciliation Act H.R. 3962, Affordable Health Care for America Act Health Care Reform, general S. 540, H.R. 1346, Medical Device Safety Act Medical Loss Ratios, 132274=H.R. 4173, Financial Reform bill Estate tax Derivatives Medicare/Prescription drug subsidies H.R. 4849, Small Business and Infrastructure Jobs Tax Act Say-on-Pay Advanced Energy Manufacturing Tax Credit H.R. 4213, American Workers, State and Business Relief Act of 2010 S. 1203, H.R. 422, R&D tax credit Restoring American Financial Stability Act of 2010 Pension funding International tax increases Bonus Depreciation Medicare tax S. 569, re. forced corporate disclosure S.A. 3816, Chambliss/Shelby Amendment to S. 3217 S. A. 3776, Specter Amendment to S. 3217 S. 3217, Restoring American Financial Stability Act H.R. 4213, American Jobs and Closing Tax Loopholes Act IRS Proposal on Uncertain Tax Provision H.R. 5297, Small Business Lending Fund Act Superfund tax S. 3513, Bonus Depreciation Extension to Create Jobs Act Dividends tax Individual Rates S.A. 4369, S.A. 4386, Baucus Amendments to H.R. 4213 H.R. 5600, Pomeroy/S. Johnson - Make Section 127 Permanent, 23550=Intellectual Property Rights S. 515, Patent Reform Act of 2010 S. 1368, H.R. 3059, Right to Repair Act H.R. 4954, False Marking bill, 110161=Offshore Exploration and Development Moratorium Inland waterways Outer Continental Shelf S. 1856, S. 1134, re. Carbon capture and sequestration S. 3346, to retroactively increase offshore drilling liability limit, 12247=President's FY2011 Budget H.R. 4899, Supplemental Appropriations bill, 188467=Internet Address: http://web.nam.org/Disclosures/Q2-2010.pdf, 17834=S. 2995, Clean Air Act Amendments S. 787, Clean Water Restoration Act H.R. 5088, America's Commitment to Clean Water Act Upper Mississippi River Arsenic TMDL}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20004 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  QUENTIN RIEGEL  2026373058  qriegel@nam.org 5. Senate ID#  26912-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}