{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I always feel safe on campus at night. However, it never hurts to walk with a friend late at night or even in the early hours of the morning. There are emergency phones strategically placed on campus for those who need them.",
            "Greek life has a minimal impact on campus.",
            "Forestry students, Law students, Journalism students, English students",
            "Every October a Jack-O-Lantern mysteriously appears on the spire of the University Hall.",
            "DEFINITELY worth the money I'm paying for my education.",
            "Biking, river rafting, hiking, jogging, skiing, snowboarding... you name it, Missoula is the hotspot for it! Downtown hosts several bars, theaters, and the famous Big Dipper for homemade ice cream. Missoula is the place for dreamers.",
            "The University of Montana has great coffee shops and places to get sandwiches. The dining hall, also known as the Food Zoo has various types of food all the time, buffet style, especially a great brunch on Saturdays and Sundays.",
            "Dorm life can be loud, as all colleges will sometimes find- but you make friends quite easily as long as you leave your doors open and are welcoming.",
            "Classes are definitely tougher once you get into the upper levels.",
            "Get to know your professors! Take your classes seriously- they may not be the most rigorous, (specifically your general education credits) but it's up to you to get what you can out of them.",
            "The University of Montana at Missoula is perfect for those who are looking for a wonderful education close to nature. I consider Missoula my second home, and I'm from Hawaii! The community is extremely closely-knit, and there's never a dull moment on campus."
        ]
    ],
    "pageTitle": "The University of Montana (UMT) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-University-of-Montana/reviews?_escaped_fragment_=/show/14412",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00066-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 931222707,
    "recordOffset": 931127642,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{381074=There are all types of things to do. Everything from club sports to playing Frisbee in the oval, to joining a club is available. Some big name bands come through; we have Old Crow Medicine Show coming in July and just had Lamb of God and Dropkick Murphy's in fall 2012. There is hiking, camping, fishing, hunting, snow sports, and pretty much any type of outdoor activity., 105708=Every October a Jack-O-Lantern mysteriously appears on the spire of the University Hall., 505018=© 2015, Cappex.com, LLC, 256917=As a college student in today's economy, nothing is affordable. The nice thing about UM is that it gives away a lot of scholarships, but you need to apply early. It is an especially good deal if you are a Montana resident. It is also easy to work while you take classes, and if you start applying for jobs in August, you can get a good one on campus. The relatively inexpensive cost (compared to out-of-state schools) and the quality of the classes makes UM an excellent choice., 298969=Is this school a commuter campus? Also, if I have a 3.57 unweighted GPA (3.8 weighted) and a 1770 SAT score, what are the chances I will receive the WUE scholarship?, 380164=Every year around October someone places a pumpkin on the top of University Hall and it stays there year round. There is the Oval in the center of campus where people are always doing something., 59478=an unusual tradition on campus is every halloween night, the rock climbing club scales the clock tower and places a pumpkin on the very top. also, there is a 95 year old tradition of having a forester's ball at the end of january., 96623=the forester's ball since 1918, 146692=Unusual, well that is to be expected when an university established in 1879.}",
    "textBeforeTable": "07/07/2009 Reviewer is A past student here. 16 out of 18 people found this review useful. 1 of 113 Molly from Kinsey, MT Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Am enjoying being here Originally, UM was not where I intended to go. However, since attending I cannot think of a place I would rather be. Missoula and UM feel like home. I feel like the entire campus and the people that live and work there are now my new home and family. Am learning a lot The courses I have taken helped me to develop and expand on the skill I already had in high school. This is a tremendous help. I find that I can recall this information at will and I believe I will retain what I have learned this past semester. Login to rate or flag the reviews Juliann from Arcadia, CA 10/23/2010 Reviewer is A current student here. 9 out of 9 people found this review useful. 3 of 113 Categories Comments Great for these types of students People who are feeling like city life is a bit much for them. Needing a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}