{
    "relation": [
        [
            "Play Type",
            "Out",
            "Double",
            "Walk",
            "Fielders-choice",
            "Out"
        ],
        [
            "Play",
            "Adam Eaton grounded out to first. None on with one out and A.J. Pollock due up.",
            "A.J. Pollock doubled to right, deflected by center. Runner on second with one out and Paul Goldschmidt due up.",
            "Paul Goldschmidt intentionally walked. Runners on first and second with one out and Martin Prado due up.",
            "Martin Prado grounded into a fielder's choice, third to first. Paul Goldschmidt out at second. A.J. Pollock advances to third. Runners on first and third with two outs and Miguel Montero due up.",
            "Miguel Montero flied out to left to end the inning."
        ]
    ],
    "pageTitle": "Tuesday, September 24, 2013 Arizona Diamondbacks - San Diego Padres Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/diamondbacks_padres/2013/09/24",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00212-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 53977219,
    "recordOffset": 53960606,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2353=View all MLB box scores for 9/24/2013}",
    "textBeforeTable": "Top of the 1st Hunter Wendelstedt  3B Jerry Layne  2B Mark Ripperger  1B Alan Porter  H Umpires 2.84 13 16 1 0 1 1 2 1 Luke Gregerson (L, 6-8) 3.52 18 32 0 1 0 0 1 2 Tim Stauffer  2.43 11 17 2 0 0 0 1 1 Huston Street  3.10 61 90 6 3 1 1 3 8 Tyson Ross  ERA Strikes Pitches SO BB ER R H IP Name 2.28 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Padres pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/padres_22t.png 8 11 2 0 0 0 0 1 Brad Ziegler (S, 12) 3.07 7 10 2 0 0 0 0 1 Josh Collmenter (W, 5-4) 2.43 9 16 2 1 0 0 0 0.2 J.J. Putz  3.23 1 1 0 0 0 0 0 0.1 Joe Thatcher  3.10 9 11 0 0 0 0 0 1 Chaz Roe  4.70 20 32 2 1 0 1 2 1 David Hernandez (BS, 6) 3.02 9 13 2 0 0 0 0 1 Will Harris (H, 4) 3.63 67 107 7 1 0 0 4 6 Wade Miley  ERA Strikes Pitches SO BB ER R H IP",
    "textAfterTable": "Out Chris Denorfia lined out to first. None on with one out and Jesus Guzman due up. Out Jesus Guzman grounded out third to first. None on with two outs and Jedd Gyorko due up. Out Jedd Gyorko flied out to right to end the inning. Top of the 2nd Play Type Play Single Martin Prado infield single to third. Runner on first with none out and Miguel Montero due up. Out Miguel Montero popped out to short. Runner on first with one out and Gerardo Parra due up. Double Gerardo Parra doubled to right. On the play, Martin Prado advances to third. Runners on second and third with one out and Chris Owings due up. Out Chris Owings struck out swinging. Runners on second and third with two outs and Didi Gregorius due up. Walk Didi Gregorius intentionally walked. Bases loaded with two outs and Wade Miley due up. Out Wade Miley struck out swinging to end the inning. Bottom of the 2nd Play Type Play Out Chase Headley struck out swinging. None on with one out and Tommy Medica due up.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}