{
    "relation": [
        [
            "Show",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24",
            "25",
            "26",
            "27",
            "28",
            "29",
            "30",
            "31",
            "32",
            "33",
            "34",
            "35",
            "36",
            "37"
        ],
        [
            "Episode",
            "\"New York City Auditions\"",
            "\"Chicago Auditions\"",
            "\"Charlotte Auditions\"",
            "\"New Orleans Auditions\"",
            "\"San Antonio and Los Angeles Auditions\"",
            "\"Oklahoma City Auditions\"",
            "\"Hollywood Round, Part 1\"",
            "\"Hollywood Round, Part 2\"",
            "\"Hollywood Round, Part 3\"",
            "\"Hollywood Round, Part 4\"",
            "\"Las Vegas, Girls Perform\"",
            "\"Las Vegas, Guys Perform\"",
            "\"Las Vegas, Girls Perform 2\"",
            "\"Las Vegas, Guys Perform 2\"",
            "\"Semifinalists Girls Perform\"",
            "\"Semifinalists Boys Perform\"",
            "\"Finalists Chosen\"",
            "\"Top 10 Perform\"",
            "\"Top 10 Results\"",
            "\"Top 9 Perform\"",
            "\"Top 9 Results\"",
            "\"Top 8 Perform\"",
            "\"Top 8 Results\"",
            "\"Top 7 Perform\"",
            "\"Top 7 Results\"",
            "\"Top 6 Perform\"",
            "\"Top 6 Results\"",
            "\"Top 5 Perform\"",
            "\"Top 5 Results\"",
            "\"Top 4 Perform\"",
            "\"Top 4 Results\"",
            "\"Top 4 Redux Perform\"",
            "\"Top 4 Redux Results\"",
            "\"Top 3 Perform\"",
            "\"Top 3 Results\"",
            "\"Top 2 Perform\"",
            "\"Finale\""
        ],
        [
            "Air date",
            "January 16, 2013",
            "January 17, 2013",
            "January 23, 2013",
            "January 24, 2013",
            "January 30, 2013",
            "January 31, 2013",
            "February 6, 2013",
            "February 7, 2013",
            "February 13, 2013",
            "February 14, 2013",
            "February 20, 2013",
            "February 21, 2013",
            "February 27, 2013",
            "February 28, 2013",
            "March 5, 2013",
            "March 6, 2013",
            "March 7, 2013",
            "March 13, 2013",
            "March 14, 2013",
            "March 20, 2013",
            "March 21, 2013",
            "March 27, 2013",
            "March 28, 2013",
            "April 3, 2013",
            "April 4, 2013",
            "April 10, 2013",
            "April 11, 2013",
            "April 17, 2013",
            "April 18, 2013",
            "April 24, 2013",
            "April 25, 2013",
            "May 1, 2013",
            "May 2, 2013",
            "May 8, 2013",
            "May 9, 2013",
            "May 15, 2013",
            "May 16, 2013"
        ],
        [
            "Ratings",
            "10.2",
            "9.2",
            "9.3",
            "8.7",
            "9.2",
            "7.9",
            "8.4",
            "7.7",
            "7.9",
            "7.4",
            "8.5",
            "7.9",
            "7.9",
            "7.5",
            "6.9",
            "7.6",
            "7.7",
            "8.0",
            "6.9",
            "7.7",
            "7.3",
            "7.4",
            "6.8",
            "7.0",
            "7.0",
            "7.4",
            "7.7",
            "7.5",
            "7.5",
            "7.5",
            "6.9",
            "7.1",
            "6.8",
            "6.7",
            "7.0",
            "7.2",
            "8.3"
        ],
        [
            "Share",
            "15",
            "14",
            "14",
            "13",
            "14",
            "12",
            "13",
            "12",
            "12",
            "12",
            "13",
            "12",
            "12",
            "12",
            "10",
            "12",
            "12",
            "13",
            "12",
            "12",
            "12",
            "12",
            "12",
            "11",
            "11",
            "12",
            "13",
            "12",
            "12",
            "12",
            "12",
            "12",
            "11",
            "11",
            "12",
            "12",
            "14"
        ],
        [
            "Rating/share 18–49",
            "6.0/16",
            "5.6/15",
            "5.5/15",
            "5.2/14",
            "5.5/15",
            "4.5/13",
            "4.6/13",
            "4.1/12",
            "4.3/12",
            "3.7/12",
            "4.1/11",
            "3.9/10",
            "3.9/11",
            "3.8/11",
            "3.5/10",
            "3.8/10",
            "3.6/10",
            "3.8/10",
            "3.1/10",
            "3.6/10",
            "2.9/9",
            "3.2/9",
            "2.8/9",
            "3.1/9",
            "2.9/9",
            "3.2/9",
            "3.2/10",
            "3.4/10",
            "3.0/10",
            "3.3/9",
            "2.8/9",
            "2.9/9",
            "2.6/9",
            "2.9/8",
            "2.9/9",
            "3.0/10",
            "3.6/11"
        ],
        [
            "Viewers (millions)",
            "17.93",
            "16.28",
            "16.07",
            "15.65",
            "15.78",
            "13.80",
            "14.27",
            "13.28",
            "13.45",
            "12.59",
            "14.37",
            "13.66",
            "13.30",
            "12.56",
            "11.72",
            "12.84",
            "13.12",
            "13.44",
            "11.93",
            "12.94",
            "11.65",
            "12.33",
            "11.43",
            "11.76",
            "11.72",
            "12.23",
            "13.19",
            "12.71",
            "12.42",
            "12.46",
            "11.40",
            "11.08",
            "11.27",
            "11.11",
            "11.57",
            "12.11",
            "14.31"
        ],
        [
            "Weekly rank",
            "4",
            "6",
            "1",
            "2",
            "7",
            "9",
            "6",
            "8",
            "4",
            "5",
            "7",
            "9",
            "3",
            "4",
            "8",
            "7",
            "6",
            "3",
            "8",
            "4",
            "5",
            "7",
            "9",
            "12",
            "13",
            "9",
            "6",
            "5",
            "7",
            "9",
            "12",
            "10",
            "9",
            "10",
            "8",
            "6",
            "3"
        ],
        [
            "Note",
            "[66][67][68]",
            "[68][69][70]",
            "[71][72][73]",
            "[73][74]",
            "[75][76]",
            "[76][77]",
            "[78][79]",
            "[79][80]",
            "[81][82]",
            "[82][83]",
            "[84][85]",
            "[84][86]",
            "[87][88][89]",
            "[88][90]",
            "[91][92]",
            "[91][93]",
            "[91][94][95]",
            "[96][97][98]",
            "[98][99][100]",
            "[101][102][103]",
            "[102][104][105]",
            "[106][107][108]",
            "[108][109][110]",
            "[111][112][113]",
            "[113][114][115]",
            "[116][117][118]",
            "[117][119][120]",
            "[121][122][123]",
            "[122][124][125]",
            "[126][127][128]",
            "[126][129][130]",
            "[131][132][133]",
            "[133][134][135]",
            "[136][137][138]",
            "[138][139][140]",
            "[141][142][143]",
            "[143][144][145]"
        ]
    ],
    "pageTitle": "American Idol (season 12) - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/American_Idol_(season_12)",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00074-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 869395303,
    "recordOffset": 869327461,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{125788=^Note 1 Cleland received the most votes in the sing-off and was permitted to participate in the summer tour along with the Top 10 finalists. ^Note 2 During the week of April 25, there was no eliminated contestant and it was not announced if Candice Glover or Amber Holcomb had the least amount of votes. This was due to the fact that the save was not used during the Top 5 so the Top 4 remained intact for another week. That week's votes were added to the votes for the week of May 2., 107036=Each contestant will perform a hit song of 2013 and a song from the Great American Songbook standards.[35], 16455=Producer Nigel Lythgoe indicated on January 9, 2013, that during the Hollywood rounds, the girls and boys would perform on separate weeks. The separation of the sexes would continue in the Vegas round right up until the Top 10.[11] There would not be a Top 12 or wild cards, but he publicly stated he was contemplating the idea of ranking the singers by their vote totals as well as the possibility of breaking out voting data by geographic region.[12] This is the first season to introduce the \"Sudden death\"-round in which the top 40 already has to perform in front of a live audience. The judges pick five out of the ten contestants per show to proceed to the top 20. The amount of finalists was limited to ten which happened last in the inaugural season., 78420=The contestants performed a song that a previous American Idol winner performed while on the show, including their coronation songs, or a song they recorded in their post-Idol career.[33] Two more acts were presented on the Top 10 results show, for one last spot in the Idol tour 2013. They were Aubrey Cleland and Charlie Askew, who were the sixth place finishers for each respective gender group. The results were announced the next episode., 67987=Amber Holcomb (born March 17, 1994) is from Houston, Texas. She originally auditioned in the eleventh season, but was cut in the Las Vegas round, where she grouped with Curtis along with the eleventh season finalists Shannon Magrane and Joshua Ledet. She performed \"My Funny Valentine\" in Vegas sudden death rounds which received standing ovation from the judges. Holcomb performed \"I Believe in You and Me\" at the semi-final voting round receiving standing ovation from all of the judges. Prior to Idol, she graduated from Dekaney High School in 2012. Her musical influences are Celine Dion, Karen Carpenter and Whitney Houston. Holcomb was eliminated on May 2, 2013 and came in fourth place., 4041=The twelfth season of American Idol premiered on January 16, 2013, as part of the mid-season of the 2012–13 network television season.[1] Ryan Seacrest returned to host. Randy Jackson returned for his twelfth season as judge and was joined by new judges Mariah Carey, Nicki Minaj and Keith Urban, who replaced Jennifer Lopez and Steven Tyler., 75821=Curtis Finch, Jr. (born August 19, 1988) is from St. Louis, Missouri. He has previously auditioned in the fourth and eleventh seasons, where he made it to the Las Vegas round, where he grouped with Amber along with eleventh season finalists Shannon Magrane and Joshua Ledet. He had performed \"Jar of Hearts\" as his final solo in the Hollywood rounds. Finch sang \"Superstar\" at the sudden death rounds. He performed \"I Believe I Can Fly\" at the semi-final round. His personal musical style is his gospel background. He was the first finalist eliminated on March 14, 2013, and came in tenth place., 146993=In April 2013, Carey noted during an episode of American Idol that Minaj had not had a number one song on the US Billboard Hot 100. The following day, Minaj took to Twitter to post what have been described as \"extremely harsh\" insults against Carey. She labelled the singer as \"insecure\" and \"bitter\", while also referencing a widely spread rumor that the producers of American Idol wanted to bring Jennifer Lopez back to the panel after a significant decline in ratings this season; \"All dem #1s but JLo phone ringin? Lol. I guess having a personality, being a secure woman, and giving genuine critique still trumps that\", Minaj tweeted.[59][60][61][62] In November 2013, Carey stated that \"American Idol was like going to work everyday in hell with Satan\".[63], 6213=On May 16, 2013, Candice Glover was announced the winner of the twelfth season of American Idol, making Kree Harrison the runner-up. Glover also became the third African-American female behind Fantasia Barrino and Jordin Sparks to win the show. In a series first, Glover's debut album, Music Speaks, was available for pre-order immediately following the finale broadcast. So far, two finalists, Candice Glover and Angie Miller, are signed to record deals. This was the only season to feature Carey and Minaj as judges, who both decided to leave the show in May 2013 to focus on their music careers.[2][3], 30472=The semi-finals round took place at The Beatles Love by Cirque De Soleil at The Mirage. The forty people who made it then faced the \"sudden death\" Las Vegas round and only twenty moved on. The contestants were divided into four gender-separated groups of ten, with the female groups airing on Wednesdays and the male groups airing on Thursdays between February 20 and 28. Each group performed in front of the judges and a studio audience, singing a standard ninety-second solo with the judges critiquing them at the end. When everyone had performed, they were called out one by one to face the judges, who – based on how they performed – would either eliminate them or advance them to the live semi-final voting round., 73519=Devin Velez (born April 22, 1994) is from Chicago, Illinois. He auditioned in Chicago as well. Velez sang \"What a Wonderful World\" at the Hollywood rounds. Then, he sang \"Listen\" at the sudden death rounds. Velez performed \"Somos Novios (It's Impossible)\" at the semi-final round. He draws his musical influences anywhere from Israel Houghton, Cece Winans, Smokie Norful, Donnie McClurkin, Beyoncé Knowles and his mother. After his performance of \"The Tracks of My Tears\", he was eliminated on March 28, 2013, and came in eighth place., 69360=Janelle Arthur (born December 12, 1989) is from Oliver Springs, Tennessee. She auditioned in Charlotte, where she sang \"Where the Blacktop Ends\". She has auditioned twice before, in seasons the tenth and eleventh seasons. In the tenth season, she was cut in the group round, and in the eleventh season she made it to the Las Vegas round. Arthur performed \"I Told You So\" at the Hollywood rounds. Then, she performed \"Just a Kiss\" at the Vegas sudden death rounds. She sang \"If I Can Dream\" at the semi-final round. Prior to Idol, Arthur was a Zumba instructor. Her musical influences are Vince Gill and Eva Cassidy. After singing, \"When I Call Your Name\" and \"Dumb Blonde\", Arthur was eliminated on April 18, 2013, and came in fifth place., 14340=After a sharp drop in ratings during the eleventh season, Fox entertainment president Kevin Reilly announced that the show would undergo \"some creative tweaking\" for the following season.[4] After two seasons, judges Steven Tyler and Jennifer Lopez announced their exits from the series on July 12 and 13, 2012, respectively.[5][6] On July 23, Mariah Carey was announced as a judge for the twelfth season.[7] On September 16, returning judge Randy Jackson and new hires Nicki Minaj and Keith Urban were confirmed to be serving on the panel.[8][9] On December 31, 2012, it was announced that Ryan Seacrest has signed on to remain the host for at least two more seasons.[10], 143262=A video was leaked to TMZ in October 2012 which showed Nicki Minaj erupting in a tirade against Mariah Carey during the audition in Charlotte, North Carolina.[44] It was also claimed that Minaj was heard saying off-camera, \"If I had a gun, I would shoot that bitch.\"[45][46] Minaj however denied that she had made the threat.[47] Ryan Seacrest said that the dispute \"went a little too far\",[48] while Keith Urban jokingly said \"I was the UN\",[49] and the feud elicited a comment from President Barack Obama that Carey and Minaj will \"sort it out\".[50] In an interview with Barbara Walters on The View aired on January 7, 2013, Carey said that, due to Minaj's threats, it \"felt like an unsafe work environment,\" and claimed that she had boosted her personal security.[51] Minaj has stated that Barbara Walters never attempted to contact her for comment regarding her side of the story.[52] Carey also said that she has since made up with Minaj. Carey's husband Nick Cannon claimed that the feud was used by American Idol producers to generate interest and ratings.[53] Producer Nigel Lythgoe however denied that he was responsible for leaking the video or that it was a publicity stunt, and said that he had no plans to use the footage in advance of or during the season.[54][55] Fox executive Mike Darnell described the buzz due to the feud as being great,[56] but later said that \"a rogue crew member probably took the video and sent it to TMZ. We did not encourage it.\"[57] The aired episode of the Charlotte audition did not show the tirade and what was shown appeared to have no real linear connection with the leaked footage.[58], 70931=Lazaro Arbos (born December 27, 1990) is originally from Cuba but has lived in Naples, Florida, since he was ten years old. He auditioned in Chicago, where he sang \"Bridge over Troubled Water\". He sang \"The Edge of Glory\" at the Hollywood rounds as his final solo. Arbos performed \"Tonight I Wanna Cry\" at the Vegas sudden death rounds. He performed \"Feeling Good\" at the semi-finals. When Lazaro was six, he began stuttering to the point where he could barely talk. He has gone through speech and language therapy, but it never improved his stutter. His musical influence is Selena. He was eliminated on April 11, 2013, and came in sixth place.[32], 60347=All of season 12's finalists will participate in the American Idols LIVE! Tour 2013. Semifinalist Aubrey Cleland will also participate in the tour., 74852=Paul Jolley (born January 27, 1990) is from Palmersville, Tennessee. He auditioned in Baton Rouge, singing \"I Won't Let Go\". He sang Carrie Underwood's \"Blown Away\" at the Hollywood rounds. He sang \"Tonight I Wanna Cry\" at the Vegas sudden death rounds. Jolley performed \"Just a Fool\" at the semi-final round. His musical style came from his family. He dubbed himself as the male version of Carrie Underwood. After his performance of \"Eleanor Rigby\", he was eliminated on March 21, 2013, and came in ninth place., 72253=Burnell Taylor (born April 14, 1993) is from New Orleans, Louisiana. He auditioned in Baton Rouge, singing \"I'm Here\" which received standing ovation from the judges. He sang \"Jar of Hearts\" at the Hollywood rounds. Taylor performed \"This Time\" at the Vegas sudden death rounds. He also performed the same song at the semi-finals. He stated in his audition that he and his family were survivors of Hurricane Katrina. His musical influence is India.Arie. After his performance of \"You Give Love a Bad Name\", he was eliminated on April 4, 2013, and came in seventh place., 66092=Angie Miller (born February 17, 1994) is from Beverly, Massachusetts. She auditioned in New York City, with \"Mamma Knows Best.\" She stated at her audition that she is partially deaf, with twenty percent hearing loss in her right ear and forty percent in her left. Prior to auditioning for American Idol, Miller had a successful YouTube channel, earning a current total of 3.7 million views. Miller performed her original composition \"You Set Me Free\" for her final solo in the Hollywood rounds receiving standing ovation from the judges. Miller sang Jessie J's \"Nobody's Perfect\" at the Vegas sudden death rounds. She sang \"Never Gone\" at the semi-finals. Her personal musical influences are Jessie J and Beyoncé Knowles. Miller finished in third place on May 9, 2013. Prior to her elimination, Miller had never been in the bottom group. During the season finale, she sang a duet with her idol Jessie J, singing Domino. After the performance, Jessie J invited Miller to come on tour in Europe with her to perform her original song \"You Set Me Free.\" \"You Set Me Free\" was also released on iTunes the night of the season finale., 19963=In an attempt to refresh the show's audition process, new ways to audition were announced. First is the \"American Idol Small Town Audition Bus Tour\", a ten town nationwide tour that will give hopefuls who couldn't make it to one of the large audition cities a chance to try out. The cities are Idaho Falls, Idaho; Billings, Montana; Casper, Wyoming; Rock Rapids, Iowa; Iowa City, Iowa; Bowling Green, Kentucky; Clarksdale, Mississippi; Joplin, Missouri; Dodge City, Kansas and Grand Junction, Colorado. Idol is also starting the \"Nominate an Idol\" program, which will let friends and family of individuals they think could be the next American Idol nominate said person in secret by filling out an online form and existing video or URL of their nominee—they must be singing solo and a capella. The chosen auditions will then be surprised on location by a film crew and given an opportunity to advance to the next round. Finally, online auditions for season 12 were open from August 1 to 14, 2012,[1][14] and October 12 to November 4, 2012.[15] Auditions took place in the following cities:[16][17], 28392=For the first time, the Hollywood rounds were held in the Valley Performance Arts Center in Northridge, California.[26] The contestants were separated by gender, with the male contestants performing in the first week, and the female the next. There were three rounds in each week – the a cappella, the group, and the solo rounds.[27] Unlike previous seasons, the groups in the group round were chosen by the producers, although each group was able to select a song from a list of twenty songs to perform. The males performed February 6 and 7 and the females performed February 13 and 14. The contestants sang a capella solos in groups of eight and the judges chose only a few of them to move on to group round that same night and for the first time, the producers picked the groups. On the second night, the contestants performed solos. They were then divided into groups of eight, and only a few of them moved on. The judges picked 20 males and 20 females to perform in front of a live studio audience at The Beatles Love by Cirque De Soleil at The Mirage. Beginning this season, the contestants no longer took \"the long walk\" to find out if they made it to the Semi-finals. Five were eliminated, while five advanced., 63658=Kree Harrison (born May 17, 1990) is from Woodville, Texas, but lives in Nashville, Tennessee. She auditioned in Oklahoma City. Her father died in an airplane crash when she was 12, and her mother died in a car accident after Kree turned 16. She also signed a deal with Lyric Street Records when she was twelve but was dropped after creative differences. She has also had a song publishing deal. She performed \"Sin Wagon\" at the group round in Hollywood. Harrison performed \"Stars\" as her final solo in the Hollywood rounds which received praises from the judges. Then, she sang \"Up to the Mountain (MLK song)\" in the sudden death rounds. She sang \"Stronger\" at the semi-finals. She stated that her musical influence is her family.[30][31] Harrison was announced as the runner-up on May 16, 2013., 61425=Candice Glover (born November 22, 1989) is from Beaufort, South Carolina. She currently lives in St. Helena Island, South Carolina. She auditioned in Charlotte, singing \"Syrup & Honey\". She previously auditioned in the ninth and eleventh seasons, where she made it to the Las Vegas round during the eleventh season and grouped with that season's finalists DeAndre Brackensick and Jessica Sanchez. She performed Alicia Keys's \"Girl on Fire\" in her final solo in the Hollywood rounds. Glover performed \"(You Make Me Feel Like) A Natural Woman\" at the sudden death round which received high praises from the judges. She performed \"Ordinary People\" at the semi-finals. At Top 6 Week Glover performed \"Lovesong\" her performance earned high praise and was called the best performance in the show's history. Her musical influences are Christina Aguilera and Jazmine Sullivan.[29] Glover was announced as the winner on May 16, 2013. Her debut album, Music Speaks was released on February 17, 2014.}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "Episode list The Wednesday episodes had an average viewer number of 15.04 million with a 4.6 rating in the 18/49 demo, while the Thursday episodes had an average viewer number of 14.64 million and a 4.3 in 18/49 demo.[64] The average figure represents a drop 23% from the previous year.[65] U.S. Nielsen ratings[edit] Sarina-Joi Crowe – auditioned in Charlotte, cut on the last day of Hollywood week One contestant from season 12 also auditioned for the subsequent season and made into the Top 24. Season 14 contestants[edit] Briana Oakley – auditioned in Los Angeles, cut in the last day of the girls section of Hollywood week Brandy Neelly – auditioned in Chicago, cut in the group day of the girls section of Hollywood week Two of the contestants from season 12 also auditioned for the subsequent season and made into the Top 30. Season 13 contestants[edit] Other Idol contestants[edit] In April 2013, Carey noted during an episode of American Idol that Minaj had not had a number one song on the US Billboard Hot 100.",
    "textAfterTable": "References[edit] ^ a b \"Three More Ways to Audition for Season 12\". Retrieved 2012-07-23. ^ \"Mariah Carey not returning to Idol\". ABC News. May 31, 2013.  ^ Nicki Minaj Confirms 'American Idol' Exit Retrieved May 31, 2013 ^ Nellie Andreeva (May 14, 2012). \"American Idol To Undergo Creative Changes Next Season\". Deadline Hollywood. Retrieved May 29, 2012.  ^ Anna Chan (July 12, 2012). \"Steven Tyler quits 'American Idol'\". MSNBC. Retrieved July 12, 2012.  ^ Erin Strecker (2012-07-13). \"Jennifer Lopez leaving 'American Idol': 'The time has come'\". Entertainment Weekly. Retrieved July 13, 2012.  ^ Hibberd, James (2012-07-23). \"Mariah Carey joins 'American Idol'\". Entertainment Weekly. Retrieved July 23, 2012.  ^ Andreeva, Nellie (September",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}