{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "DA"
        ],
        [
            "regulations.gov",
            "2014-26429",
            "",
            "14-1507"
        ]
    ],
    "pageTitle": "47 CFR 73.9008 - Interim approval of authorized digital output protection technologies and authorized recording methods. | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/47/73.9008",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00030-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910293219,
    "recordOffset": 910209969,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{998=Title 47 published on 2014-10-01}",
    "TableContextTimeStampAfterTable": "{1122304=The Commission has before it a petition for rulemaking filed by Entravision Holdings, LLC (“Entravision”), the licensee of station KCEC(TV), channel 51, Denver, Colorado, requesting the substitution of channel 26 for channel 51 at Denver. While the Commission instituted a freeze on the acceptance of full power television rulemaking petitions requesting channel substitutions in May 2011, it subsequently announced that it would lift the freeze to accept such petitions for rulemaking seeking to relocate from channel 51 pursuant to a voluntary relocation agreement with Lower 700 MHz A Block licensees. KCEC(TV) has entered into such a voluntary relocation agreement with T-Mobile USA, Inc. and states that operation on channel 26 would eliminate potential interference to and from wireless operations in the adjacent Lower 700 MHZ A Block., 388235=The Audio Division, at the request of Ashley A. Bruton, allot Channel 280A at McCall, Idaho, as the community's eighth local transmission service. A staff engineering analysis confirms that Channel 280A can be allotted to McCall, Idaho consistent with the minimum distance separation requirements of the rules with a site restriction 0.4 kilometers (0.2 miles) southwest of the community. The reference coordinates are 44-54-30 NL and 116-06-00 WL. See SUPPLEMENTARY INFORMATION, supra., 1142026=In this document, the Commission issues a Further Notice of Proposed Rulemaking (FNPRM) seeking comment on amending the definition of Telecommunications Relay Services (TRS) in the Commission's rules to conform to changes made to this definition by the Twenty-First Century Communications and Video Accessibility Act of 2010 (CVAA), which allows compensation for TRS calls between two or more individuals with disabilities. The Commission also seeks comment on eliminating as a mandatory minimum standard the requirement that TRS providers provide voice-carry-over to voice-carry-over (VCO-to-VCO) and hearing-carry-over to hearing-carry-over (HCO-to-HCO), subject to exceptions for Captioned Telephone Service (CTS) and Internet Protocol Captioned Telephone Service (IP CTS), as HCO-to-HCO and VCO-to-VCO calls would not require a communications assistant (CA) to provide functionally equivalent communication. These proposals are made to ensure that the intent of Congress in enacting the CVAA is implemented and that the mandatory minimum standards imposed for TRS are applicable and appropriate for each type of TRS to which they are applied., 1167201=This document requests comments on a Petition for Rule Making filed by Chris Samples Broadcasting, Inc, licensee of Station KXDJ(FM), Channel 252C2, Spearman, Texas, proposing to substitute Channel 221A for vacant Channel 252A at Silverton, Texas. A staff engineering analysis indicates that Channel 221A can be allotted to Silverton, Texas consistent with the minimum distance separation requirements of the Commission's Rules with a site restriction located 7.8 kilometers (4.9 miles) east of Silverton. The reference coordinates are 34-28-15 NL and 101-13-09 WL. The purpose of the channel substitution is to accommodate the “hybrid” application requesting to upgrade the facilities of Station KXDJ(FM) from Channel 252C2 to Channel 252C1 at Spearman, Texas, File No. BPH-20140519AHY., 597577=This document requests comments on a Petition for Rule Making filed by Red Wolf Broadcasting Corporation, proposing to amend the FM Table of Allotments, Section 73.202(b) of the Commission's Rules, by allotting Channel 233A at Sagaponack, New York, as a first local service. A staff engineering analysis indicates that Channel 233A can be allotted to Sagaponack consistent with the minimum distance separation requirements of the Commission's Rules with a site restriction located 3.2 kilometers (2 miles) northwest of the community. The reference coordinates are 40-56-01 NL and 72-18-55 WL., 280669=This document corrects errors in the dates section, the supplementary information portion, and Final Rules section of a Federal Register document regarding the Commission taking major steps to modernize the E-rate program (more formally known as the schools and libraries universal service support mechanism). Building on the comments the Commission received in response to the E-rate Modernization NPRM, and the E-rate Modernization Public Notice, as well as recommendations from the Government Accountability Office (GAO), the program improvements the Commission adopts as part of this document begin the process of reorienting the E-rate program to focus on high-speed broadband for our nation's schools and libraries. The document was published in the Federal Register on August 19, 2014., 271230=The Audio Division, at the request of Threshold Communications, substitutes FM Channel 235C1 for Channel 249C1 at Altamont, Oregon. Channel 235C1 can be allotted at Altamont in compliance with the Commission's minimum distance separation requirements with a site restriction of 20 km (12.6 miles) northeast of Altamont, at 42-08-37 North Latitude and 121-30-19 West Longitude., 56501=In this document, the Federal Communications Commission (Commission) takes momentous strides towards fully implementing a modernized universal service regime capable of meeting consumer demands for 21st century networks. The Commission also finalizes decisions necessary to proceed with the offer of support to price cap carriers in early 2015., 76241=This document modifies the rules governing the operation of Unlicensed Personal Communications Service (UPCS) devices in the 1920-1930 MHz band (UPCS band) to reference the 2013 version of the American National Standards Institute (ANSI) C63.17 standard, Methods of Measurement of the Electromagnetic and Operational Compatibility of Unlicensed Personal Communications Service (UPCS) Devices, ANSI C63.17-2013, by which UPCS devices must be measured for compliance with the technical requirements in the Commission's regulations., 588021=This document requests comments on a Petition for Rule Making filed by Charles Crawford, proposing to amend the FM Table of Allotments, of the Commission's rules, by allotting Channel 247A at Bogata, Texas, as a first local service. A staff engineering analysis indicates that Channel 247A can be allotted to Bogata, Texas consistent with the minimum distance separation requirements of the Commission's rules with a site restriction located 12.9 kilometers (8 miles) northwest of Bogata. The reference coordinates are 33-33-21 NL and 95-18-28 WL., 8412=In this document, the Commission announces that the Office of Management and Budget (OMB) has approved, for a period of three years a non-substantive change to a currently approved information collection requirements contained in the regulations in the “Commercial Operations in the 1695-1710 MHz, 1755-1780 MHz, and 2155-2180 MHz.” The information collection requirement was approved on December 23, 2014 by OMB., 61233=In this document, the Federal Communications Commission (Commission) announces that the Office of Management and Budget (OMB) has approved, for a period of three years, the information collection associated with the Commission's Report and Order implementing provisions of the Twenty-First Century Communications and Video Accessibility Act of 2010 (CVAA) related to accessible user interfaces and video programming guides and menus. This document is consistent with the Report and Order, which stated that the Commission would publish a document in the Federal Register announcing OMB approval and the effective date of the requirements., 936520=This document corrects errors in the supplementary information section of a Federal Register document regarding the Commission taking major steps to modernize the E-rate program (more formally known as the schools and libraries universal service support mechanism). The Commission sought further comment on meeting the future funding needs of the E-rate program in light of the goals it adopted for the program in an accompanying Report and Order. The Commission acknowledges that modernizing a program of this size and scope cannot be accomplished at once and so it will continue to seek public input and additional ideas to bring 21st Century broadband to libraries and schools throughout the country. The document was published in the Federal Register on August 19, 2014., 275701=The Audio Division, at the request of Bryan King (“petitioner”), deletes FM Channel 227A and allots FM Channel 277A at Pearsall, Texas. Channel 277A can be allotted at Pearsall, consistent with the minimum distance separation requirements of the Commission's rules, at coordinates 28-56-40 NL and 99-11-44 WL, with a site restriction of 11.4 km (7.1 miles) northwest of the community. The Government of Mexico has concurred with the allotment of Channel 277A at Pearsall, which is located within 320 kilometers (199 miles) of the U.S.-Mexican border. See Supplementary Information infra., 396790=This document corrects errors in the supplementary information portion of a Federal Register document finalizing decisions to use, on a limited scale, Connect America funding for rural broadband experiments in price cap areas that will deploy new, robust broadband to consumers. The Commission will use these rural broadband experiments to explore how to structure the Phase II competitive bidding process in price cap areas and to gather valuable information about interest in deploying next generation networks in high-cost areas. The summary was published in the Federal Register on August 6, 2014., 411400=This Order on Remand responds to the court's directive, and specifically examines the interplay between the T-Mobile Order and the rural exemption rule. The Ninth Circuit found that the Commission's T-Mobile Order did not adequately analyze the order's affects upon the rural exemption rule in of the Communications Act of 1934, remanding the order to the Commission for “for further consideration.”, 231607=At the request of The Navajo Nation, the Audio Division amends the FM Table of Allotments, by allotting FM Channel 258C2 at Rough Rock, Arizona, as a first local Tribal Allotment and a first local service to the community. A staff engineering analysis confirms that Channel 258C2 can be allotted to Rough Rock consistent with the minimum distance separation requirements of the Commission's Rules with the imposition of a site restriction 7.1 km (4.4 miles) southeast of the community. The reference coordinates are 36-21-08 NL and 109-49-54 WL., 335570=In this document, the Commission announces that the Office of Management and Budget (OMB) has approved, for a period of three years, an information collection associated with the Commission's Report and Order, FCC 13-158, published at 79 FR 3123 on January 17, 2014, and at 79 FR 7589 on February 10, 2014. This document is consistent with the Report and Order, which stated that the Commission would publish a document in the Federal Register announcing OMB approval and the effective date of requirements subject to OMB approval. Specifically, this document announces the effective date of rules requiring Covered 911 Service Providers to notify Public Safety Answering Points (PSAPs) and other “911 special facilities” of major disruptions in 911 service within time limits established by the Commission., 111924=On July 23, 2014, the Federal Communications Commission (Commission) released a document in (WC Docket No. 13-184, FCC 14-99; 79 FR 49160, August 19, 2014) which contained information collection requirements for the schools and libraries universal service mechanism (E-rate) which required approval from the Office of Management and Budget (OMB). The Office of Management and Budget (OMB) granted approval on October 27, 2014, under emergency processing for certain of the information collection requirements contained in the Report and Order as required by the Paperwork Reduction Act (PRA) of 1995 (44 U.S.C. 3501-3520)., 1009141=The Federal Communications Commission published a document in the Federal Register of October 27, 2014 (79 FR 63883), regarding Petitions for Reconsideration filed of Action in a rulemaking proceeding. The document contained the incorrect deadline for filing replies to an opposition to the Petition. This document revises the deadline for replies to an opposition to the Petition., 846174=In this document, the International Bureau granted a request for an extension of time to file comments in response to a Further Notice of Proposed Rulemaking that initiated a comprehensive review of the Commission's rules governing space stations and earth stations. The original deadline for filing comments was December 15, 2014; the original deadline for filing reply comments was January 14, 2015. The International Bureau extended the deadlines for filing both comments and reply comments by 45 days., 144174=On April 1, 2014, the Commission released a Report and Order, “Unlicensed National Information Infrastructure (U-NII) Devices in the 5 GHz Band.” This document contains corrections to the final regulations for “Unlicensed National Information Infrastructure (U-NII) Devices in the 5 GHz Band” that appeared in the Federal Register on May 1, 2014 (79 FR 24569)., 95810=The Commission published in the Federal Register of December 10, 2014, a document concerning an Order on Reconsideration ( Order ) affirming the Commission's commitment to ensuring that high quality telephone service must be available to all Americans. In the Order, the Commission established rules to combat extensive problems with successfully completing calls to rural areas, and created a framework to improve the ability to monitor call problems and take appropriate enforcement action. In the Order, the Commission denies several petitions for reconsideration that, if granted, would impair the Commission's ability to monitor, and take enforcement action against, call completion problems. The Commission does, however, grant one petition for reconsideration because the Commission finds that modifying its original determination will significantly lower providers' compliance costs and burdens without impairing the Commission's ability to obtain reliable and extensive information about rural call completion problems., 378322=The Audio Division, at the request of Bryan Broadcasting License Corporation, substitutes Channel 274A for vacant Channel 267A at Centerville, Texas, and grant the Application for Station KKEE, Centerville, Texas, File No. BMPH-20140324ADD. A staff engineering analysis indicates that Channel 274A can be allotted to Centerville, Texas consistent with the minimum distance separation requirements of the Commission's Rules with a site restriction located 4.3 kilometers (2.7 miles) east of Centerville. The reference coordinates are 31-15-00 NL and 95-56-00 WL., 765524=The Commission has before it a petition for rulemaking filed by KCEB License Company, LLC (“KCEB License”), the licensee of KCEB(TV), channel 51, Longview, Texas, requesting the substitution of channel 26 for channel 51 at Longview. While the Commission instituted a freeze on the acceptance of full power television rulemaking petitions requesting channel substitutions in May 2011, it subsequently announced that it would lift the freeze to accept such petitions for rulemaking seeking to relocate from channel 51 pursuant to a voluntary relocation agreement with Lower 700 MHz A Block licensees. KCEB License has entered into such a voluntary relocation agreement with T-Mobile USA, Inc. and states that operation on channel 26 would eliminate potential interference to and from wireless operations in the adjacent Lower 700 MHZ A Block., 509569=The Auction 1000 Request for Comment initiates the pre-auction process by which the Federal Communications Commission will develop detailed procedures for the broadcast television spectrum incentive auction, taking into account public comment received in response to its proposals. The Auction 1000 Request for Comment includes specific proposals, including on determination of the initial broadcast television spectrum clearing target, opening bid prices, benchmarks for the final stage rule, and the final television channel assignment process, and seeks comment on those proposed procedures., 203467=On August 15, 2014, the Commission released a Report and Order, “Expanding the Economic and Innovation Opportunities of Spectrum Through Incentive Auctions.” This document announces an effective date for several sections in the final regulations that appeared in the Federal Register on August 15, 2014 (79 FR 48442)., 415861=The Audio Division, at the request of JER Licenses, LLC, substitute alternative Channel 281C for vacant Channel 280C at Toquerville, Utah to accommodate the “hybrid” application that requests the downgrade of the new FM station from Channel 281C3 to Channel 280A at Peach Springs, Arizona. A staff engineering analysis confirms that Channel 281C can be allotted to Toquerville, Utah consistent with the minimum distance separation requirements of the Rules without a site restriction. The reference coordinates for Channel 281C at Toquerville are 37-15-12 NL and 113-17-00 WL. See Supplementary Info. supra., 363557=The Federal Communications Commission (Commission) announces that a certain rule adopted in its Public Safety 700 MHz Narrowband proceeding (WT Docket No. 96-86; FCC 00-348 and FCC 01-10) between 2000 and 2001, to the extent it contained an information collection requirement that required approval by the Office of Management and Budget (OMB) was approved, and became effective August 21, 2014, following approval by OMB., 492873=On December 23, 2014, the Wireless Telecommunications Bureau and the Consumer and Governmental Affairs Bureau published a document seeking updated input to better understand the current consumer experience with hearing aid compatible wireless handsets, to explore technical or other barriers to the provision of hearing aid compatible devices on new wireless technologies, and to consider changes to its rules that may be necessary to ensure that wireless handsets used with advanced communications services are accessible in light of directives contained in the Twenty-First Century Communications and Video Accessibility Act (CVAA). The comment date was erroneously published as an effective date and neither the comment nor the comment-reply date was provided. We also failed to provide an address for submission of comments. This document corrects those errors and extends the time within which to file comments and reply comments., 148402=This document contains corrections to the final regulations to the Commission's rules which were published in the Federal Register on Thursday, November 6, 2014 (79 FR 65906). The Commission published a clarification in the Declaratory Ruling, which clarifies how the Commission intends to preserve the “coverage area” of eligible broadcasters in the repacking process associated with the broadcast television spectrum incentive auctions. This document contains corrections to the adopted date., 193763=This document amends procedural rules implemented by the Commission's 2011 determination that docketing and electronic filing be utilized in proceedings involving “[n]ewly filed formal common carrier complaints and newly filed pole attachment complaints before the Enforcement Bureau.” The rule changes also apply to future filings made in existing Section 208 formal complaints and pole attachment complaints. In addition, the amendments make a few procedural changes to existing Section 208 formal complaint and pole attachment complaint filing rules to create uniformity among them and ease of administration for parties and staff when initiating service of pleadings or filing confidential matters with the Commission. The rules further establish a single electronic inbox within Electronic Comment Filing System (ECFS) to handle the initial filing of the above-identified new complaints. Accepted complaints will receive a distinct ECFS docket number; rejected complaints will remain on ECFS but will be stored within the Inbox., 266590=On July 23, 2014, the Federal Communications Commission (Commission) released a document which contained information collection requirements for the schools and libraries universal service mechanism (E-rate) which required approval from the Office of Management and Budget (OMB). The Office of Management and Budget (OMB) granted approval on October 27, 2014, under emergency processing for certain of the information collection requirements contained in the Report and Order as required by the Paperwork Reduction Act (PRA) of 1995 (44 U.S.C. 3501-3520)., 478350=In this document, the Wireless Telecommunications Bureau (Bureau) further extends the deadline for filing comments on the Auction 1000 Request for Comment, which initiates the pre-auction process by which the Federal Communications Commission will develop detailed procedures for the broadcast television spectrum incentive auction, taking into account public comment received in response to its proposals., 626777=This document requests comments on a Petition for Rule Making filed by Charles Crawford, proposing to amend the FM Table of Allotments, Section 73.202(b) of the Commission's Rules, by allotting Channel 295A at Wright City, Oklahoma, as the community's first local service. A staff engineering analysis indicates that Channel 295A can be allotted to Wright City consistent with the minimum distance separation requirements of the Commission's Rules with a site restriction located 14 kilometers (8.6 miles) east of the community. The reference coordinates are 34-04-44 NL and 94-51-15 WL., 355097=In this document, the Federal Communications Commission (Commission) announces that the Office of Management and Budget (OMB) has approved, for a period of three years, the information collection associated with the Commission's Report and Order, 2014 Quadrennial Regulatory Review, FCC 14-28. This notice is consistent with the Report and Order, which stated that the Commission would publish a document in the Federal Register announcing OMB approval and the effective date of the requirements., 42411=In this document, the Federal Communications Commission (Commission) announces that the Office of Management and Budget (OMB) has approved, for a period of three years, the information collection requirements associated with the Commission's Report and Order for Commercial Operations in the 1695-1710 MHz, 1755-1780 MHz, and 2155-2180 MHz Bands (Service Rules for Advance Wireless Service (AWS)), FCC 14-31. This notice is consistent with the Report and Order, which stated that the Commission would publish a document in the Federal Register announcing OMB approval and the effective date of the new or modified information collection requirements., 71004=At the request of Chris Samples Broadcasting, Inc., licensee of Station KXDJ(FM), Channel 252C2, Spearman, Texas, the Audio Division amends the FM Table of Allotments, by substituting Channel 221A for vacant Channel 252A at Silverton, Texas to accommodate the Application that requests to upgrade the facilities of Station KXDJ(FM) from Channel 252C2 to Channel 252C1 at Spearman, Texas. The channel substitution at Silverton, Texas would be in the public interest because it would accommodate the Application and eliminate the Station KICA-FM 73.215 short-spacing. A staff engineering analysis indicates that Channel 221A can be allotted to Silverton, Texas consistent with the minimum distance separation requirements of the Commission's Rules with a site restriction located 7.8 kilometers (4.9 miles) east of Silverton. The reference coordinates are 34-28-15 NL and 101-13-09 WL., 602459=The Commission has before it a petition for rulemaking filed by WLAJ-TV LLC, the licensee of station WLAJ-TV, channel 51, Lansing, Michigan, requesting the substitution of channel 25 for channel 51 at Lansing. While the Commission instituted a freeze on the acceptance of full power television rulemaking petitions requesting channel substitutions in May 2011, it subsequently announced that it would lift the freeze to accept such petitions for rulemaking seeking to relocate from channel 51 pursuant to a voluntary relocation agreement with Lower 700 MHz A Block licensees. WLAJ-TV LLC has entered into such a voluntary relocation agreement with T-Mobile USA, Inc. and states that operation on channel 25 would eliminate potential interference to and from wireless operations in the adjacent Lower 700 MHZ A Block., 383438=In this document, the Commission announces that the Office of Management and Budget (OMB) has approved, for a period of three years, an information collection associated with the Commission's Report and Order, FCC 13-158, published at 79 FR 3123 on January 17, 2014, and at 79 FR 7589 on February 10, 2014. This notice is consistent with the Report and Order, which stated that the Commission would publish a document in the Federal Register announcing OMB approval and the effective date of requirements subject to OMB approval. Specifically, this document announces the effective date of initial and annual reliability certification requirements for covered 911 service providers, including any associated record retention requirements., 435835=In this document, the Commission proposes to expand to cable operators, satellite TV providers, broadcast radio licensees, and satellite radio licensees the requirement that public inspection files be posted to the FCC's online database. In 2012, the Commission adopted online public file rules for broadcast television stations that required them to post public file documents to a central, FCC-hosted online database rather than maintaining the files locally at their main studios. Now that television broadcasters have completed their transition to the online file, the Commission believes it is appropriate to commence the process of expanding the online file to other media entities to extend the benefits of improved public access to public inspection files and, ultimately, reduce the burden of maintaining these files., 582533=In this document the Federal Communications Commission (Commission) affirms core principles guiding its approach to 911 governance and proposes mechanisms to ensure, in cooperation with state and local partners, that the nation's 911 governance structure keeps pace with evolving technology so that all entities providing 911 service capabilities remain accountable for reliable 911 call completion and accurate situational awareness. This document proposes steps to address vulnerabilities in 911 reliability that have been revealed by a series of recent “sunny day” 911 outages, including the April 2014 multi-state outage that was the subject of a recent report by the Public Safety and Homeland Security Bureau (Bureau). Specifically, this document proposes to amend the Commission's 911 reliability certification rules to cover additional entities and network reliability practices; require public notification for major changes in multi-state 911 networks and services, and Commission approval for discontinuance of existing 911 services; require entities seeking to provide new 911 capabilities to certify as to their technical and operational capability to provide reliable service; and designate certain 911 service providers to take lead responsibility for situational awareness and coordination with other service providers in the event of a 911 outage., 558270=This document requests comments on a Petition for Rule Making filed by Red Wolf Broadcasting Corporation, proposing to amend the FM Table of Allotments, § 73.202(b) of the Commission's rules, by allotting Channel 277A at Shelter Island, New York, as a first local service. A staff engineering analysis indicates that Channel 277A can be allotted to Shelter Island consistent with the minimum distance separation requirements of the Commission's rules with a site restriction located 12 kilometers (7.5 miles) south of the community. The reference coordinates are 40-57-54 NL and 72-22-59 WL., 236907=In this document the Commission implements certain changes to the rules governing the 700 MHz public safety narrowband spectrum (769-775/799-805 MHz). We eliminate the requirement for licensees to narrowband to 6.25 kHz technology by December 2016, thereby enabling licensees to extend the life of existing systems and providing public safety with greater flexibility in determining the optimal future use of the band. In addition, we revise and update the technical rules for the band to enhance interoperability and open up certain channels to new uses, and we release reserve spectrum to provide additional capacity, particularly for public safety licensees relocating to the 700 MHz band from the T-Band (470-512 MHz). These rule changes enhance the ability of public safety licensees to use this spectrum to protect the safety of life and property., 32429=In this document, the Federal Communications Commission (Commission) takes the next critical steps to modernize the Universal Service Fund's Schools and Libraries program, known as E-rate. Building on the E-rate Modernization Order, the Commission adopted in July, the improvements to the program that the Commission adopts in this Order seek to close the high-speed connectivity gap between rural schools and libraries and their urban and suburban counterparts, and provide sufficient and certain funding for high-speed connectivity to and within all eligible schools and libraries. The Commission takes these actions to ensure the continued success of the E-rate program as it transitions from supporting legacy services to focusing on meeting the high-speed broadband connectivity needs of schools and libraries consistent with the recently adopted program goals and long-term connectivity targets. In the Order on Reconsideration, the Commission grants in part the petitions for reconsideration of the areas designated as urban for purposes of the E-rate program. The Commission also denies petitions for reconsideration of the document retention period, the phase out of support for telephone components and other services, and funding commitments that cover multiple years. At the same time, the Commission clarifies our cost effectiveness test for individual data plans and the cost allocation rules for circuits carrying voice services., 121882=In this document, the Commission announces that the Office of Management and Budget (OMB) approved on December 5, 2014, for a period for three years, a revision to an information collection for the FCC Application for Radio Service Authorization for the Wireless Telecommunications Bureau and the Public Safety and Homeland Security Bureau, FCC Form 601. With this document, the Commission is announcing OMB approval and the effective date of the revised requirements for FCC Form 601.}",
    "lastModified": "Thu, 26 Feb 2015 02:55:01 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 9392 - Television Broadcasting Services; Lansing, Michigan 2015-02-23; vol. 80 # 35 - Monday, February 23, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 47. Title 47 published on 2014-10-01 Petitioners seeking revocation of a content protection technology or recording method's approval for use in covered demodulator products shall articulate in detail the extent to which the content protection or recording technology has been compromised and demonstrate why alternative measures are insufficient to address the breach in security. (2) If the security of a content protection technology or recording method approved for use in covered demodulator products has been compromised, a person may seek revocation of such approval pursuant to § 76.7 of this chapter. (1)",
    "textAfterTable": "DA 15-210 FEDERAL COMMUNICATIONS COMMISSION Final rule. Effective February 23, 2015. 47 CFR Part 73 Summary A petition for rulemaking was filed by WLAJ-TV LLC (“Petitioner”), the licensee of WLAJ-TV, channel 51, Lansing, Michigan, requesting the substitution of channel 25 for channel 51 at Lansing. Petitioner filed comments reaffirming its interest in the proposed channel substitution stating that if the proposal is granted, it will promptly file an application for the facilities specified in its rulemaking petition and construct the station. Petitioner also reiterates that the grant of the petition would serve the public interest because its operation on channel 25 would eliminate potential interference to and from wireless operations in the adjacent Lower 700 MHz A Block. The proposed substitution will permit the wireless licensee to expand operations in service to subscribers. 2015-02-17; vol. 80 # 31 - Tuesday, February 17, 2015 80 FR 8248 - Commercial Operations in the 1695-1710 MHz, 1755-1780 MHz, and 2155-2180 MHz Bands GPO FDSys XML |",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}