{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Commuters and returning adults.",
            "You get a decent degree for half the cost of UM Ann Arbor.",
            "Hang out in the University Center.",
            "Needs more choices.",
            "There is no on campus housing.",
            "General classes aren't a challenge.",
            "Take morning classes to get a parking spot.",
            "The psychology department has great faculty. Parking is terrible no matter where on campus you are. Location is easy to get to."
        ]
    ],
    "pageTitle": "University of Michigan-Dearborn Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Michigan-Dearborn/reviews?_escaped_fragment_=/show/6731",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894815839,
    "recordOffset": 894758690,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{161218=Right now there are only dorms for grad students, but student dorms are being opened in Fall 2013., 35521=The massive size might make me feel out of place; I'm from a small town, attended a high school (9-12) with less than 900 students and the college I currently attend is bout 1800-2000 students., 218681=Didn't have dorms my freshman and sophomore year. Fall of 2013 is the first time students will be able to live on campus in the new dorms. They come fully stocked with furniture, appliances, granite counter tops and a HD TV. However, they are expensive if you ask me., 157712=There are no dorms as of 2012., 138207=There aren't any dorms until Fall 2013. We are all excited for that., 195293=No dorms until 2013 Fall, 185662=No on campus housing yet, but will be available Fall 2013, 172320=There are no dorms yet. There will be soon, after this Winter 2013 semester, but not yet. The upcoming dorms will be called The Union., 30497=The web page is incorrect. There WILL be on-campus housing for students enrolling for the fall of 2013. Here is a link for more information: http://www.umd.umich.edu/housing . I'm looking forward to it!, 207451=Dorm life will be coming in Fall 2013, 208376=Visit the campus. If you are considering attending the University of Michigan Dearborn, you're probably nearby, and even if you're not, go on a campus tour. Pick a rainy day, because it'll help you remember to keep an umbrella in the car, and all your other weather essentials. Seeing as The Union (dorms) will be opening up in Fall 2013, some students may opt for the dorm experience, so you don't want to forget your basics. Just as you are taking the proactive steps to research your future college in your Junior and Senior years, remember at the end of each semester to find out the earliest dates you can register for your next classes. You do not want to be put behind in your credit schedule, just because you didn't know the first day you could register. Also, your professor can honestly make or break the class. If no one you know has taken a certain professor before, then check out the ratemyprofessors website. But it's always better to ask a friend, or mutual friend. If possible, take the same professor as a friend of yours did previously (if they recommend the professor), and ask your friend if they have previous exams or quizzes, to help you prepare for your own exams and quizzes. Make friends in each class, and try to work out your schedules to meet up and study together. There are plenty of studies that show that group study is more effective. If you're not comfortable with that, and you see yourself potentially struggling with a subject, don't hesitate to get the free one-on-one tutoring the University provides. Whether it's the one-on-one tutoring the University Center provides, or the Supplemental Instruction (SI) sessions for your science classes, take advantage of them. It's usually the students who perform at the A level who do take advantage, so don't hesitate., 265300=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "10/14/2010 Reviewer is A current student here. 10 out of 10 people found this review useful. 1 of 64 Rachel from Redford, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Michigan-Dearborn Reviews University of Michigan-Dearborn › Michigan › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Campus Safety the safety offered on this campus is excellent. the campus itself is contained to students and staff, so there is much less risk to begin with. but they also have security driving around continuously all around campus and the option of having a security officer escort you to your vehicle if you ever want it. Greek Life yes, you can still join a frat or sorority here even though they are not hosting drink 'til you puke parties on campus. these groups are more for camaraderie and socializing. Clubs and Activities there is at least one club for every school on campus. find yours and join it. it will give you the edge on networking, externships, and support from staff and fellow students. most of the clubs are informal and flexible, there are usually no requirements or demanding commitments involved. Great for these types of students this college is great for the practical student who doesn't want to end up with huge debt hanging over them when they graduate. with the economic outlook in our state being what it is, it's the smartest decision you can make to minimize post college debt and begin your life as an independent adult without that hanging over you.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}