{
    "relation": [
        [
            "",
            "Name",
            "Symeon Palios",
            "Anastasios Margaronis",
            "Ioannis Zafirakis",
            "Andreas Michalopoulos",
            "Konstantinos Fotiadis",
            "Antonios Karavias",
            "Nikolaos Petmezas",
            "Reidar Brekke"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Age",
            "68",
            "54",
            "39",
            "39",
            "59",
            "67",
            "60",
            "48"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Position",
            "Class III Director, Chief Executive Officer and Chairman",
            "Class II Director and President",
            "Class I Director, Chief Operating Officer and Secretary",
            "Chief Financial Officer and Treasurer",
            "Class III Director",
            "Class I Director",
            "Class III Director",
            "Class II Director"
        ]
    ],
    "pageTitle": "Prospectus",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/1481241/000119312510231710/d424b3.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00043-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 706517875,
    "recordOffset": 706368578,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1114660=In the opinion of Seward & Kissel LLP, the Company\u0092s U.S. counsel, the following are the material U.S. federal income tax consequences to the Company of its activities and to U.S. Holders and Non-U.S Holders, each as defined below, of the common stock. The following discussion of U.S. federal income tax matters is based on the U.S. Internal Revenue Code of 1986, as amended, or the Code, judicial decisions, administrative pronouncements, and existing and proposed regulations issued by the U.S. Department of the Treasury, all of which are subject to change, possibly with retroactive effect., 347419=In May 2010, we issued a total of 213,331 restricted common shares to our executive officers pursuant to our 2010 Equity Incentive Plan and related restricted stock grant award agreements. Of these shares, 25% have become vested and the remaining shares vest ratably over three years by one-third each year., 857755=adopted amendments to Annex VI regarding emissions of sulfur oxide, nitrogen oxide, particulate matter and ozone-depleting substances, which amendments are expected to enter into force on July 1, 2010. The amended Annex VI will reduce air pollution from vessels by, among other things, (i) implementing a progressive reduction of sulfur oxide, emissions from ships, by reducing the sulfur fuel cap with the global sulfur cap reduced initially to 3.50% (from the current cap of 4.50%), effective from January 1, 2012, then progressively to 0.50%, effective from January 1, 2020, subject to a feasibility review to be completed no later than 2018; and (ii) establishing new tiers of stringent nitrogen oxide emissions standards for new marine engines, depending on their date of installation. The United States ratified the Annex VI amendments in October 2008, requiring the United States to promulgate emissions standards equivalent to IMO requirements, which standards are still in the process of being finalized. Once these amendments become effective, we may incur costs to comply with the revised standards., 227398=Under the United States Internal Revenue Code of 1986, or the Code, 50% of the gross shipping income of a vessel owning or chartering corporation, such as us and our subsidiaries, that is attributable to transportation that begins or ends, but that does not both begin and end, in the United States may be subject to a 4% United States federal income tax without allowance for deduction, unless that corporation qualifies for exemption from tax under section 883 of the Code and the applicable Treasury Regulations promulgated thereunder., 596286=In July 2010, the containership newbuilding orderbook in terms of TEU size was 3.97 million TEU, equivalent to 29.8% of the existing cellular containership fleet., 1098972=The following is a summary of certain considerations associated with an investment in our common stock by employee benefit plans that are subject to Title I of the Employee Retirement Income Security Act of 1974, as amended (\u0093ERISA\u0094), plans, individual retirement accounts (\u0093IRAs\u0094) and other arrangements that are subject to Section 4975 of the United States Internal Revenue Code of 1986, as amended (the \u0093Code\u0094), or provisions under any other federal, state, local, non-U.S. or other laws or regulations that are similar to such provisions of ERISA or the Code (collectively, \u0093Similar Laws\u0094), and entities whose underlying assets are considered to include \u0093plan assets\u0094 of any such plan, account or arrangement (each, a \u0093Plan\u0094)., 387084=General and Administrative Expenses. General and administrative expenses for the period from inception to June 30, 2010 amounted to $1.8 million and consist mainly of consultancy fees, broker services fees, compensation cost on restricted stock, legal fees and audit fees., 474315=and Trans-shipments 2000 to 2009, 475130=Regionally, the Far East and South East Asia markets accounted for 49% of global port throughput in 2008, compared with the other major markets of Western Europe and North America. Collectively, these four regions accounted for 78% of all container port throughput in 2009., 916097=Andreas Michalopoulos has served as our Chief Financial Officer and Treasurer since January 13, 2010 and has served in these positions with Diana Shipping since March 8, 2006. Mr. Michalopoulos started his career in 1993 where he joined Merrill Lynch Private Banking in Paris. In 1995, he became an International Corporate Auditor with Nestle SA based in Vevey, Switzerland and moved in 1998 to the position of Trade Marketing and Merchandising Manager. From 2000 to 2002, he worked for McKinsey and Company in Paris, France as an Associate Generalist Consultant before joining from 2002 to 2005, a major Greek Pharmaceutical Group with U.S. R&D activity as a Vice President International Business Development, Member of the Executive Committee. From 2005 to 2006, he joined Diana Shipping Agencies as a Project Manager. Mr. Michalopoulos has graduated from Paris IX Dauphine University with Honours in 1993 obtaining a MSc in Economics and a master\u0092s degree in Management Sciences specialized in Finance. In 1995, he also obtained a master\u0092s degree in business administration from Imperial College, University of London. Mr. Andreas Michalopoulos is married to the youngest daughter of Mr. Symeon Palios., 433143=The following table presents the breakdown of global seaborne trade by type of cargo in 2000 and 2009., 70765=DSS performs commercial and technical management services for the vessels in our fleet. DSS currently manages a modern, high quality fleet of 22 Panamax and Capesize drybulk carriers and two Newcastlemax newbuildings with expected deliveries in the second and third quarter of 2012 for which DSS provides supervisory services, and maintains the quality of its vessels by carrying out regular inspections, both while in port and at sea, and adopting a preventative maintenance program for each vessel. DSS currently employs approximately 60 shore-based personnel in Athens, Greece and 460 offshore employees and, including its predecessors, has, since 1972 managed more than 100 vessels, including nine vessels that were containerships or multi-purpose vessels that were modified to transport containers. DSS provides comprehensive ship management services including technical supervision, such as repairs, maintenance and inspections, safety and quality, crewing and training, as well as supply provisioning. We believe that the resources and reputation of our Manager as a safe and reliable technical manager will provide us with favorable charter opportunities with well established charterers, many of whom consider the reputation of the vessel manager when seeking vessels. DSS will supervise the construction of any newbuilding vessels that we may agree to acquire as well as provide administrative services to us such as accounting and financial reporting services., 62890=Declining volumes and increasing containership supply have led to a decline in containership time charter rates and asset values. One-year time charter rates for a 3,500 TEU containership declined by 78% from 2007 to 2009. Secondhand containership values have dropped by more than 50% since late 2007. However, while certain analysts believe that the containership shipping sector is likely to remain volatile, others point to economic indicators that suggest both rates and secondhand values have stabilized in the first few months of 2010, and in some cases rates have increased., 796109=Vessel values are primarily driven by supply and demand for vessels. During extended periods of high demand, as evidenced by high charter rates, vessel values tend to appreciate and vice versa. However, vessel values are also influenced by age and specification and by the replacement cost (newbuilding price) in the case of vessels up to five years old. The following chart indicates average secondhand prices for containerships in the period from 2000 to July 2010., 716693=2003, 634420=Containership Operating Costs: 2000 to 2009, 255889=As a privately held company, we have not been responsible for the corporate governance and financial reporting practices and policies required of a publicly traded company. Following the effectiveness of the registration statement of which this prospectus is a part, we will be a public reporting company. As a public company, we will incur significant legal, accounting, investor relations and other expenses that we do not currently incur. In addition, we will be subject to the provisions of the Sarbanes-Oxley Act of 2002, Securities and Exchange Commission rules as well as stock exchange requirements. We expect these rules and regulations to increase our legal and financial compliance costs and to make some activities more time-consuming and costly. We estimate that we will have increased costs of approximately $1.0 million per year as a public company., 1018703=Under the registration rights agreement, in the event that (i) we determine that the Exchange Offer registration is not permitted or may not be completed as soon as practicable after the last Exchange Date (as defined therein) because it would violate any applicable law or applicable interpretations of the Staff of the Securities and Exchange Commission, or because the Exchange Shares received by holders are not or would not be, upon receipt, transferable by each such holder without need for further compliance with Section 5 of the Securities Act (except for the requirements to deliver a prospectus in connection with any resale by a Participating Broker-Dealer), (ii) the Exchange Offer is not for any other reason completed by December 1, 2010 or (iii) upon completion of the Exchange Offer any of the holders shall so request in connection with any offering or sale of the Registrable Shares (as defined therein), we have agreed to cause to be filed with the Securities and Exchange Commission as soon as practicable after such determination, date or request, as the case may be (but in no event later than the date that is 60 days after the date of the earlier of such determination, date or request), one resale Registration Statement on Form F-1 or such other form under the Securities Act then available to the Company providing for the resale of the outstanding Registrable Shares pursuant to Rule 415 from time to time by the holders. We have agreed to use our reasonable efforts to cause such resale registration statement to be declared effective by the Securities and Exchange Commission as soon as practicable after the initial filing thereof and to remain effective, subject to applicable black-out provisions, until the earlier of (A) such time as all Registrable Shares covered thereby have been sold in accordance with the intended distribution of such Registrable Shares, (B) there are no Registrable Shares outstanding or (C) the first anniversary of the effective date of such resale registration statement (subject to extension under certain circumstances) and the condition that the Registrable Shares have been transferred to an unrestricted CUSIP and are listed on the New York Stock Exchange or the Nasdaq Global Market, or on an alternative trading system with the Registrable Shares qualified under the applicable state securities or \u0093blue sky\u0094 laws of all fifty (50) states); provided, however, that if we have an effective resale registration statement on Form F-1 (or other form then available to the Company) under the Securities Act and becomes eligible to use Form F-3 or such other short-form registration statement form under the Securities Act, we may, upon thirty (30) business days\u0092 prior written notice to all holders, register any Registrable Shares registered but not yet distributed under the effective resale registration statement on such a short-form shelf registration statement and, once the short-form shelf registration statement is declared effective, withdraw the previous registration statement and, if permitted, transfer the filing fees from the previous registration statement (such transfer pursuant to Rule 429, if applicable) unless any holder registered under the, 225031=Arabian Gulf, have included attacks on ships and mining of waterways. In addition, terrorist attacks outside this region, such as the attacks that occurred against targets in the United States on September 11, 2001, Spain on March 11, 2004, London on July 7, 2005, Mumbai on November 26, 2008 and continuing hostilities in Iraq and Afghanistan and elsewhere in the Middle East and the world may lead to additional armed conflicts or to further acts of terrorism and civil disturbance in the United States and elsewhere. Any such attacks or disturbances may disrupt our business, increase vessel operating costs, including insurance costs, and adversely affect our financial condition and results of operations. Our operations may also be adversely affected by expropriation of vessels, taxes, regulation, tariffs, trade embargoes, economic sanctions or a disruption of or limit to trading activities or other adverse events or circumstances in or affecting the countries and regions where we operate or where we may operate in the future., 183881=If, on April 6, 2012, we have not completed an initial public offering, nor have we applied at least 90% of the net proceeds of the private offering to certain vessel related and other purposes, we may be required to distribute the net proceeds of the private offering that have not been used for such purposes to our shareholders., 318481=the payment of Euro 33,570,000 or $42,697,430 representing the final installment to the yard for the acquisition of the vessel Centaurus, delivered on July 9, 2010, from the net proceeds of the private offering and the drawdown under our loan agreement with DnB NOR Bank ASA., 143028=Vessel operating expenses include the costs of crew, provisions, deck and engine stores, lube oil, bunkers, insurance and maintenance and repairs, which depend on a variety of factors, many of which are beyond our control. Some of these costs, primarily relating to insurance and enhanced security measures implemented after September 11, 2001 and as a result of a recent increase in the frequency of acts of piracy, have been increasing. If our vessels suffer damage, they may need to be repaired at a drydocking facility. The costs of drydock repairs are unpredictable and can be substantial. Increases in any of these costs could have a material adverse effect on our business, results of operations, cash flows and financial condition., 747299=Containership Newbuilding Prices: 2000 to 2010, 385920=Vessel Operating Expenses. Vessel operating expenses for the period from inception to June 30, 2010 amounted to $375,549 and mainly consist of expenses for the initial supply of our newbuilding containerships Sagitta and Centaurus, consisting of stores and other consumables., 283781=We were incorporated on January 7, 2010. The following table sets forth our selected financial data. The selected financial data as of January 7, 2010 (date of inception) are derived from our audited financial statements included elsewhere in this prospectus. We refer you to the notes to our audited financial statements for a discussion of the basis on which our financial statements are presented. The information provided below should be read in conjunction with \u0093Management\u0092s Discussion and Analysis of Financial Condition and Results of Operations\u0094 and our financial statements, related notes and other financial information included herein., 1125559=The regulations define an \u0093established securities market\u0094 to include a national securities exchange that is registered under section 6 of the Securities Act of 1934, a \u0093United States over-the-counter market,\u0094 and certain foreign securities exchanges. We do not believe that the FBR PLUSTM System qualifies as an \u0093established, 819711=DSS performs commercial and technical management services for our vessels. DSS also manages Diana Shipping\u0092s drybulk carrier fleet with a combined cargo carrying capacity of approximately 2.9 million dwt, including two vessels under construction with deliveries expected in the second and third quarter of 2012. Commercial management includes, among other things, negotiating charters for vessels, monitoring the performance of vessels under charter, managing our relationships with charterers, obtaining insurance coverage for our vessels, as well as supervision of the technical management of the vessels. Technical management includes managing day-to-day vessel operations, performing general vessel maintenance, ensuring regulatory and classification society compliance, supervising the maintenance and general efficiency of vessels, arranging the hire of qualified officers and crew, arranging and supervising drydocking and repairs, arranging for the purchase of supplies, spare parts and new equipment for vessels, appointing supervisors and technical consultants and providing technical support. Our Manager also provides to us accounting, administrative, financial reporting and, 383051=We incur general and administrative expenses, including our onshore related expenses such as legal and professional expenses. Certain of our general and administrative expenses are provided for under our Administrative Services Agreement with DSS and the Broker Services Agreement between DSS and Diana Enterprises. We expect general and administrative expenses to reflect the costs associated with running a public company including board of director costs, director and officer insurance, investor relations, registrar and transfer agent fees and increased legal and accounting costs related to our compliance with public reporting obligations and the Sarbanes-Oxley Act of 2002., 50672=by our Chairman and Chief Executive Officer Mr. Symeon Palios, who has served as the Chairman and Chief Executive Officer of Diana Shipping since 2005 and as a director since 1999. Mr. Palios is a qualified naval architect and engineer who has 40 years of experience in the shipping industry and expertise in technical and operational matters. Mr. Anastasios Margaronis, our President and a director, also serves as President and as a director of Diana Shipping and has been employed by the Diana Shipping group of companies since 1979. Mr. Ioannis Zafirakis, our Chief Operating Officer, Secretary and a director, serves as Executive Vice President and Secretary of Diana Shipping and has been employed by the Diana Shipping group of companies since 1997. Mr. Andreas Michalopoulos, our Chief Financial Officer and Treasurer, has held these same offices with Diana Shipping since 2006. Our management team has experience in multiple sectors of the international shipping industry, including in the containership sector, and a proven track record of strategic growth beginning with the formation of the Diana Shipping group of companies in 1972. Our management team is responsible for identifying assets for acquisition and for the operation of our business in order to build our fleet and effectively manage our growth., 867673=The U.S. Oil Pollution Act of 1990, or OPA, established an extensive regulatory and liability regime for the protection and cleanup of the environment from oil spills. OPA affects all owners and operators whose vessels trade in the United States, its territories and possessions or whose vessels operate in U.S. waters, which includes the U.S. territorial sea and its 200 nautical mile exclusive economic zone. The United States has also enacted the Comprehensive Environmental Response, Compensation and Liability Act, or CERCLA, which applies to the discharge of hazardous substances other than oil, whether on land or at sea. Although OPA is primarily directed at oil tankers (which are not operated by us), it also applies to non-tanker ships, including containerships, with respect to the fuel oil, or bunkers, used to power such ships. CERCLA also applies to our operations., 914519=Ioannis Zafirakis has served as our Director, Chief Operating Officer and Secretary since January 13, 2010 and has served as Director and Executive Vice President and Secretary of Diana Shipping since February 14, 2008, as the Vice President and Secretary of that company since February 21, 2005 and as a director of that company since March 9, 1999. Mr. Zafirakis also serves as an employee of DSS. Prior to February 21, 2005, Mr. Zafirakis was employed by Diana Shipping Agencies S.A. and performed on the behalf of Diana Shipping the services he now performs as Executive Vice President of that company. He joined Diana Shipping Agencies S.A. in 1997 where he held a number of positions in its finance and accounting department. He holds a bachelor\u0092s degree in Business Studies from City University Business School in London and a master\u0092s degree in International Transport from the University of Wales in Cardiff., 912004=Symeon Palios has served as our Chief Executive Officer and Chairman since January 13, 2010 and has served as Chief Executive Officer and Chairman of Diana Shipping since February 21, 2005 and as a Director of that company since March 9, 1999. Mr. Palios also serves as an employee of DSS. Prior to November 12, 2004, Mr. Palios was the Managing Director of Diana Shipping Agencies S.A. and performed on our behalf the services he now performs as Chief Executive Officer. Since 1972, when he formed Diana Shipping Agencies, Mr. Palios has had the overall responsibility of our activities. Mr. Palios has 40 years experience in the shipping industry and expertise in technical and operational issues. He has served as an ensign in the Greek Navy for the inspection of passenger boats on behalf of Ministry of Merchant Marine and is qualified as a naval architect and engineer. Mr. Palios is a member of various leading classification societies worldwide and he is a member of the board of directors of the United Kingdom Freight Demurrage and Defense Association Limited. He holds a bachelor\u0092s degree in Marine Engineering from Durham University., 79108=We operate as an efficient and reliable owner of containerships as a result of the experience of our Manager. DSS currently manages a modern fleet of 22 Panamax and Capesize drybulk carriers and two Newcastlemax newbuildings with deliveries expected in the second and third quarter of 2012 for which DSS provides supervisory services. We believe we can build on the reputation of our Manager for safe vessel operations and intend to comply with rigorous health, safety and environmental protection regulation. We further believe we will benefit from economies of scale in maintenance, supply and crewing of our vessels, as well in purchasing bunkers and spare parts., 55280=We were formed on January 7, 2010 as a wholly-owned subsidiary of Diana Shipping and on that date, we issued 500 common shares to Diana Shipping at par value. We sold 3,333,333 common shares to Diana Shipping in the private offering for consideration of $50.0 million. Pursuant to the registration rights agreement, dated April 6, 2010, we have agreed to register the resale of the common shares owned by Diana Shipping. See \u0093Exchange Offer\u0097Registration Rights Agreement.\u0094 As of the date of this prospectus, Diana Shipping owns approximately 55% of our common shares. Under the Administrative Services Agreement with the Manager, a, 465124=In 2009, approximately 1.21 billion tons of containerized cargo was transported by sea, comprising 15.2% of all seaborne trade by weight. However, as the chart below indicates, the rate of growth slowed tremendously in 2008 as the world economy weakened., 141761=While the size of the containership orderbook has declined over the last 12 months, newbuilding containerships with an aggregate capacity of 5.0 million TEU were on order, representing 39.1% of the total fleet capacity as of December 31, 2009. The size of the orderbook is large relative to historical levels and will result in the increase in the size of the world containership fleet over the next few years. An over-supply of containership capacity, combined with a decline in the demand for containerships, may result in a further reduction of charter hire rates., 618581=Not all of the vessels on order, especially those for delivery in 2011 and beyond, will have financing in place and in the current climate securing funding is proving difficult for many shipowners. Delays in accessing funding may contribute to ships being delayed beyond scheduled delivery dates., 725639=The same factors that drive freight rates also affect charter rates. The growth in demand for container shipping and the increasing trend among major container operators to charter-in tonnage have generally increased demand pressure and over time have caused an increase in time charter rates. The following chart indicates annual average charter rates for representative containerships from 2000 to the July 2010., 917475=Konstantinos Fotiadis has served as an independent Director and as the Chairman of our Audit Committee since the completion of the private offering. From 1990 until 1994 Mr. Fotiadis served as the President and Managing Director of Reckitt & Colman (Greece), part of the British multinational Reckitt & Colman plc, manufacturers of cosmetics and health care products. From 1981 until its acquisition in 1989 by Reckitt & Colman plc, Mr. Fotiadis was a General Manager at Dr. Michalis S.A., a Greek company manufacturing and marketing cosmetics and health care products. From 1978 until 1981 Mr. Fotiadis held positions with Esso Chemicals Ltd. and Avrassoglou S.A. Mr. Fotiadis has also been active as a business consultant and real estate developer. Mr. Fotiadis holds a degree in Economics from Technische Universitaet Berlin and in Business Administration from Freie Universitaet Berlin., 798273=With the rise in freight rates in the period 2005-2008 secondhand values for containerships also increased for all major ship sizes. However, when demand fell in 2008 rates and values went into a steep decline. Since then there have been very few reported secondhand sales and the estimation of secondhand value is very difficult. The number of vessels sold so far in 2010 indicates that the market has picked up, and owners not usually prevalent in this sector have bought ships at relatively low prices, attracted by decent charter rates in an improving market. With asset prices now stabilizing and even increasing, buyers can look to sell in the future at a profit., 592648=The non-weighted average age of containerships currently in service is 10 years, as of July 30 2010., 796708=Containership Secondhand Prices: 2000 to 2010, 901228=We procure protection and indemnity insurance coverage for pollution in the amount of $1 billion per vessel per incident. The 13 P&I Associations that comprise the International Group insure approximately 90% of the world\u0092s commercial tonnage and have entered into a pooling agreement to reinsure each association\u0092s liabilities. As a member of a P&I Association which is a member of the International Group, we are subject to calls payable to the associations based on the group\u0092s claim records as well as the claim records of all other members of the individual associations and members of the pool of P&I Associations comprising the International Group. Supplemental calls are made by the P&I Association based on estimates of premium income and anticipated and paid claims and such estimates are adjusted each year by the Board of Directors of the P&I Association until the closing of the relevant policy year, which generally occurs within three years from the end of the policy year. The Standard Steamship Owners\u0092 Protection & Indemnity Association (Bermuda) Limited, the P&I Association in which the Company\u0092s vessels are entered, did not charge any supplemental calls for the 2007/08, 2008/09, or 2009/10 policy years. The Company does not know whether any supplemental calls will be charged in respect of 2010/11, which is the first year in which the Company\u0092s vessels were entered with the P&I Association. To the extent we experience supplemental calls, our policy is to expense such amounts., 920863=Reidar Brekke has served as an independent Director since June 1, 2010. Mr. Brekke has been an advisor and deal-maker in the international energy and transportation sector for the last 15 years. He founded Energy Capital Services Inc. in March 2008 which provides strategic and financial advisory services to international shipping and energy related companies. In addition, he served as President of ECS Inc., a shipping and energy industry consulting and advisory services company, from March 2008 to December 2009. Previously, he served as Manager of Poten Capital Services LLC, a registered broker-dealer specializing in the maritime sector, from 2003 to January 2008. Prior to 2003, Mr. Brekke was C.F.O., then President and C.O.O., of SynchroNet Marine, a logistics service provider to the global container transportation industry. From 1994 to 2000, he held several, 82082=Our amended and restated by-laws provide that, by April 6, 2012, we are obligated to either complete an initial public offering of common stock pursuant to an effective registration statement under the Securities Act, or use at least ninety percent (90%) of the net proceeds of the private offering (i) to fund containership acquisitions; (ii) for capital expenditures relating to our vessels; (iii) for vessel operating expenses, which may include expenses incurred in the lay-up of our vessels, and reasonable reserves established by our board of directors for any such operating or lay-up expenses; (iv) general and administrative expenses; and (v) other expenses related to the ownership, operation, management and maintenance of our containerships (the items set forth in clauses (i) to (v) above are referred to collectively as a \u0093Permitted Purpose\u0094). It is our intention that no more than ten percent (10%) of the net proceeds of the private offering shall be used for general corporate purposes other than Permitted Purposes., 951691=We sold the Original Shares in a private transaction pursuant to a purchase/placement agent agreement, dated March 29, 2010, by and between us and FBR Capital Markets & Co. In connection with the offering of the Original Shares, we also entered into a registration rights agreement with FBR Capital Markets & Co. and Diana Shipping Inc., which governs our obligation to file a registration statement with the Securities and Exchange Commission and commence the Exchange Offer to exchange the Exchange Shares for the Original Shares. The Exchange Offer is intended to satisfy certain of our obligations under the registration rights agreement., 1017315=We have entered into a registration rights agreement, dated April 6, 2010, with FBR Capital Markets & Co. and Diana Shipping Inc. The registration rights agreement covers the shares sold in the private offering, including shares purchased by Diana Shipping Inc., plus any additional shares of common stock issued in respect thereof whether by stock dividend, stock distribution, stock split, or otherwise. This exchange offer is intended to satisfy certain of our obligations under the registration rights agreement. Pursuant to the registration rights agreement, we have agreed to maintain the effectiveness of this exchange offer registration statement until the earlier of (a) 120 days after the closing of the Exchange Offer and (b) such time as all Participating Broker-Dealers (as defined in the agreement) no longer own any Registrable Shares (as defined in the agreement). We have further agreed to use our reasonable best efforts to complete the Exchange Offer not later than 60 days after the effective date of the Exchange Offer registration statement., 614668=The size of the orderbook built up rapidly in the period 2006 to 2008, when strong freight rates and robust demand on the key arterial east-west routes encouraged high levels of new ordering. Since then, however, with a combination of deliveries, orderbook cancellations and conversions, and a total absence of new orders in 2009, the size of the total orderbook has substantially contracted. In the last few months a few major operators have started to come back into the market and placed orders with Asian yards., 913334=Anastasios Margaronis has served as our Director and President since January 13, 2010 and has served in these positions with Diana Shipping since February 21, 2005. Mr. Margaronis also serves as an employee of DSS. Prior to February 21, 2005, Mr. Margaronis was employed by Diana Shipping Agencies S.A. and performed on our behalf the services he now performs as President. He joined Diana Shipping Agencies in 1979 and has been responsible for overseeing our insurance matters, including hull and machinery, protection and indemnity and war risks cover. Mr. Margaronis has 27 years of experience in shipping, including in ship finance and insurance. He is a member of the Governing Council of the Greek Shipowner\u0092s Union and a member of the board of directors of the United Kingdom Mutual Steam Ship Assurance Association (Bermuda) Limited. He holds a bachelor\u0092s degree in Economics from the University of Warwick and a master\u0092s of science degree in Maritime Law from the Wales Institute of Science and Technology., 462535=Reduced Shipping Time. Containerships can travel at speeds of up to 25 knots per hour, even in rough seas, thereby transporting cargo over long distances in relatively short periods of time. This speed reduces transit time and facilitates the timeliness of regular scheduled port calls, compared to general cargo shipping. However, since 2008, due to higher fuel prices and the negative effects of the global recession, most operators are deploying more ships on single voyages which has ultimately increased overall round voyage times and changed shippers\u0092 supply chains. Many post-Panamax vessels are now sailing at under 20 knots on backhaul routes as part of global slow-steaming strategies to reduce costs., 932881=In April 2010, we issued in the private offering an aggregate of 3,333,333 common shares to Diana Shipping, which amounts to approximately 55% of our outstanding common shares, in exchange for $50.0 million., 718713=2005, 56854=wholly-owned subsidiary of Diana Shipping, we pay the Manager a monthly fee of $10,000 for administrative services. We, through our vessel-owning subsidiaries, have entered into vessel management agreements with the Manager for the provision of commercial and technical management services. Pursuant to each vessel management agreement, the Manager receives a commission of 1% of the gross charterhire and freight earned by the vessel and a technical management fee of $15,000 per vessel per month for employed vessels and $20,000 per vessel per month for laid-up vessels. Pursuant to the Broker Services Agreement, dated June 1, 2010, the Manager has appointed Diana Enterprises Inc., or Diana Enterprises, a related party controlled by our Chief Executive Officer and Chairman, Mr. Symeon Palios, as broker to assist the Manager in providing services to the Company. Under the Broker Services Agreement, the Manager pays a commission of $1,040,000 per year to Diana Enterprises. We reimburse this cost to the Manager pursuant to the Administrative Services Agreement. Please see \u0093Business\u0097Administrative Services Agreement,\u0094 \u0093Business\u0097Broker Services Agreement\u0094 and \u0093Business\u0097Vessel Management Agreements.\u0094 We have issued an aggregate of 213,331 restricted common shares to our executive officers pursuant to the 2010 Equity Incentive Plan. Of these shares, 25% have vested and the remaining shares vest ratably over three years by one-third each year. Following the completion of an initial public offering, we expect to issue an additional 53,333 restricted common shares to our executive officers pursuant to the 2010 Equity Incentive Plan of which 25% will vest upon the grant of such shares, and the remainder will vest ratably over three years from their date of grant. See \u0093Management\u00972010 Equity Incentive Plan.\u0094, 743205=July 2010, 34073=Set forth below is summary information concerning our fleet as of October 1, 2010., 880994=Since the terrorist attacks of September 11, 2001, there has been a variety of initiatives intended to enhance vessel security. On November 25, 2002, the U.S. Maritime Transportation Security Act of 2002, or the MTSA, came into effect. To implement certain portions of the MTSA, in July 2003, the U.S. Coast Guard issued regulations requiring the implementation of certain security requirements aboard vessels operating in waters subject to the jurisdiction of the United States. Similarly, in December 2002, amendments to SOLAS created a new chapter of the convention dealing specifically with maritime security. The new chapter became effective in July 2004 and imposes various detailed security obligations on vessels and port authorities, most of which are contained in the International Ship and Port Facilities Security Code, or the ISPS Code. The ISPS Code is designed to protect ports and international shipping against terrorism. After July 1, 2004, to trade internationally, a vessel must attain an International Ship Security Certificate from a recognized security organization approved by the vessel\u0092s flag state. Among the various requirements are:, 650688=2004, 30181=Diana Containerships Inc. is a corporation formed under the laws of the Republic of the Marshall Islands on January 7, 2010 founded to pursue vessel acquisitions in the container shipping industry. Diana Shipping Inc. (NYSE:DSX), or Diana Shipping, a global provider of drybulk transportation services, owns approximately 55% of our outstanding common stock as of the date of this prospectus. In April 2010, we completed the sale, with FBR Capital Markets & Co. acting as initial purchaser/placement agent, of an aggregate of 5,892,330 common shares in a private transaction, which we refer to as the private offering, with net proceeds of $85.3 million, including the sale of 290,000 common shares pursuant to the exercise of FBR Capital Markets & Co.\u0092s option to purchase additional shares. Affiliates of ours (within the meaning of Rule 405 under the Securities Act) including Diana Shipping, may not participate in the Exchange Offer., 350260=On July 7, 2010, we entered into a new secured term loan facility with DnB NOR Bank ASA for up to $40.0 million. We have drawn down $10.0 million per vessel in connection with the acquisition of the two newbuilding containerships and expect that the remaining $20.0 million will be available to draw down within one year from the entry into the loan agreement. Please see \u0093\u0097Liquidity and Capital Resources,\u0094 below., 922298=senior positions with American Marin Advisors, including Fund Manager of American Shipping Fund I LLC, and C.F.O. of its broker-dealer subsidiary. Prior to this, Mr. Brekke was an Advisor for the Norwegian Trade Commission in New York & Oslo, Norway, and a financial advisor in Norway. Mr. Brekke graduated from the New Mexico Military Institute in 1986 and in 1990 he obtained a MBA from the University of Nevada, Reno. He has been an adjunct professor at Columbia University\u0092s School of International and Public Affairs\u0097Center for Energy, Marine Transportation and Public Policy, and is currently on the board of directors of three privately-held companies involved in container logistics, container leasing and drybulk shipping., 845603=related party controlled by our Chief Executive Officer and Chairman, Mr. Symeon Palios, as broker to assist it in providing these services to the Company pursuant to the Broker Services Agreement, dated June 1, 2010. Pursuant to the agreement, DSS is obligated to pay a commission to Diana Enterprises in the amount of $1,040,000 per year for a term of five years. The commission shall increase to $1,300,000 following the completion of an initial public offering. DSS may pay additional commissions with respect to a transaction as the same may be agreed in writing. In the event that Diana Enterprises terminates the agreement within six months following a Change of Control (as defined in the agreement), Diana Enterprises shall be entitled to a lump sum payment equal to three years\u0092 annual commission., 877580=In October 2009, the European Union amended a directive to impose criminal sanctions for illicit ship-source discharges of polluting substances, including minor discharges, if committed with intent, recklessly or with serious negligence and the discharges individually or in the aggregate result in deterioration of the quality of water. Criminal liability for pollution may result in substantial penalties or fines and increased civil liability claims., 669180=In general most operators experienced rising ship operating costs in the period 2000 to 2008, due to increases in manning and insurance costs. However, the downturn in shipping markets in the second half of 2008 has halted the rise in costs and it would appear that for the first time in the decade costs fell in 2009., 878822=In February 2005, the Kyoto Protocol to the United Nations Framework Convention on Climate Change, or UNFCC, which we refer to as the Kyoto Protocol, entered into force. Pursuant to the Kyoto Protocol, adopting countries are required to implement national programs to reduce emissions of certain gases, generally referred to as greenhouse gases, which are suspected of contributing to global warming. Currently, the emissions of greenhouse gases from international shipping are not subject to the Kyoto Protocol. However, a new treaty may be adopted at the United Nations climate change conference in Copenhagen in December 2009 or at subsequent conferences, and restrictions on shipping may be included. The European Union has indicated that it intends to propose an expansion of the existing European Union emissions trading scheme to include emissions of greenhouse gases from vessels, if such emissions are not regulated through the IMO or the UNFCC by December 31, 2010. In the United States, the EPA has issued a proposed finding that greenhouse gases threaten public health and safety and has been petitioned by the California Attorney General to regulate greenhouse gas emissions from ocean-going vessels. Other federal regulations relating to the control of greenhouse gas emissions may follow, including the climate change initiatives that are being considered in the U.S. Congress and by the EPA. In addition, the IMO is evaluating various mandatory measures to reduce greenhouse gas emissions from international shipping, including market-based instruments. Any passage of climate control legislation or other regulatory initiatives by the EU, the U.S., IMO or other countries where we operate that restrict emissions of greenhouse gases could require us to make significant financial expenditures that we cannot predict with certainty at this time., 887568=The U.S. Coast Guard regulations, intended to align with international maritime security standards, exempt from MTSA vessel security measures non-U.S. vessels that have on board, as of July 1, 2004, a valid International Ship Security Certificate attesting to the vessel\u0092s compliance with SOLAS security requirements and the ISPS Code. We intend to implement the various security measures addressed by the MTSA, SOLAS and the ISPS Code., 715693=2002, 52273=DSS performs commercial and technical management services for our vessels. DSS also manages Diana Shipping\u0092s drybulk carrier fleet with a combined cargo carrying capacity of approximately 2.9 million dwt, including two vessels under construction with deliveries expected in the second and third quarter of 2012. Commercial management includes, among other things, negotiating charters for vessels, monitoring the performance of vessels under charter, managing our relationships with charterers, obtaining insurance coverage for our vessels, as well as supervision of the technical management of the vessels. Technical management includes managing day-to-day vessel operations, performing general vessel maintenance, ensuring regulatory and classification society compliance, supervising the maintenance and general efficiency of vessels, arranging the hire of qualified officers and crew, arranging and supervising drydocking and repairs, arranging for the purchase of supplies, spare parts and new equipment for vessels, appointing supervisors and technical consultants and providing technical support. Our Manager also provides to us accounting, administrative, financial reporting and other services necessary for the operation of our business. We actively monitor the performance of our Manager. Pursuant to the Administrative Services Agreement, we have agreed to pay our Manager a monthly fee of $10,000 for administrative services. We, through our vessel-owning subsidiaries, have entered into vessel management agreements with DSS for the provision of commercial and technical management services for the vessels in our fleet. Pursuant to each vessel management agreement, DSS receives a commission of 1% of the gross charterhire and freight earned by the vessel and a technical management fee of $15,000 per vessel per month for employed vessels and will receive $20,000 per vessel per month for laid-up vessels, if any. Pursuant to the Broker Services Agreement, dated June 1, 2010, the Manager has appointed Diana Enterprises Inc., or Diana Enterprises, a related party, as broker to assist the Manager in providing services to the Company. Under the Broker Services Agreement, the Manager pays a commission of $1,040,000 per year to Diana Enterprises. We reimburse this cost to the Manager pursuant to the Administrative Services Agreement. We believe that the above management fees and commissions are consistent with fees and commissions charged by third party managers and are consistent with fees and commissions charged by DSS to Diana Shipping. Please see \u0093Business\u0097Administrative Services Agreement,\u0094 \u0093Business\u0097Broker Services Agreement\u0094 and \u0093Business\u0097Vessel Management Agreements.\u0094, 10904=This prospectus is dated October 19, 2010., 161744=Acts of piracy have historically affected ocean-going vessels trading in regions of the world such as the South China Sea and in the Gulf of Aden off the coast of Somalia. Throughout 2008 the frequency of piracy incidents increased significantly, and continued at a relatively high level during 2009, particularly in the Gulf of Aden off the coast of Somalia, with drybulk vessels and tankers particularly vulnerable to such attacks. In November 2008, the Sirius Star, a tanker vessel not affiliated with us, was captured by pirates in the Indian Ocean while carrying crude oil estimated to be worth $100 million, and was released in January 2009 upon a ransom payment of $3 million. In April 2009, the \u0093Maersk Alabama,\u0094 a 17,000-ton containership not affiliated with us, was seized by Somali pirates. The ship was later released. If these piracy attacks result in regions in which our vessels are deployed being characterized as \u0093war risk\u0094 zones by insurers, as the Gulf of Aden temporarily was in May 2008, or Joint War Committee \u0093war and strikes\u0094 listed areas, premiums payable for such coverage could increase significantly and such insurance coverage may be more difficult to obtain. In addition, crew costs, including due to employing onboard security guards, could increase in such circumstances. We may not be adequately insured to cover losses from these incidents, which could have a material adverse effect on us. In addition, any detention hijacking as a result of an act of piracy against the vessels we plan to acquire, or an increase in cost, or unavailability, of insurance for our vessels, could have a material adverse impact on our business, financial condition and results of operations., 617981=Containership Orderbook by Country of Build \u0096 July 2010, 644658=2002, 257646=As a public reporting company, we will become subject to Section 404 of the Sarbanes-Oxley Act of 2002, which will require us to include in our annual report on Form 20-F our management\u0092s report on, and assessment of, the effectiveness of our internal controls over financial reporting. In addition, our independent registered public accounting firm will be required to attest to and report on the effectiveness of our internal controls over financial reporting, which requirement we expect will first apply to our annual report on Form 20-F for the year ended December 31, 2011. Because we outsource accounting and other services to our Manager, our management and our independent registered public accounting firm will be required to also assess the design and operating effectiveness of our Manager\u0092s internal controls over financial reporting. If we or our Manager fail to maintain the adequacy of our internal controls over financial reporting, we will not be in compliance with all of the requirements imposed by Section 404. Any failure to comply with Section 404 could result in an adverse perception of the Company in the financial marketplace., 257371=Investor confidence may be adversely impacted if we are unable to comply with Section 404 of the Sarbanes-Oxley Act of 2002., 333427=Except as disclosed herein, there have been no material changes to our consolidated capitalization since June 30, 2010., 1054256=Under our amended and restated articles of incorporation, our shareholders have the right, including Diana Shipping, to purchase, at the same price per share as new investors, such additional shares of our common stock in order to maintain their respective beneficial ownership percentages in the event we issue further equity, other than pursuant to the 2010 Equity Incentive Plan, prior to the completion of an initial public offering., 63747=Historically, growth in container trade volumes has been driven primarily by the growth of economic output and consumption, increases in global sourcing and changes in patterns of world trade. GDP serves as an indicator of prospective container volumes. The preliminary indications are that global GDP will rebound in 2010., 794862=Containership Newbuilding Prices 2000 to 2010, 458266=Seaborne Trade Growth Rates: 2000 to 2009, 385512=Voyage Expenses. Voyage expenses for the period from inception to June 30, 2010 amounted to $25,114, mainly representing losses due to changes in bunker prices during the period between the delivery of the Sagitta and the delivery of the vessel to the charterers., 620954=Scheduled deliveries based on the orderbook as of January 1, 2008 and 2009, 746561=Newbuilding prices have risen steadily since 2002, due to a shortage in newbuilding capacity during a period of high ordering and increased shipbuilders\u0092 costs as a result of rising raw material prices, mainly steel. However, since the second half of 2008 weak market conditions significantly slowed new ordering to the point that virtually no new orders were placed for containerships in 2009. Given the lack of new orders it is very difficult to assess the trend in newbuilding although all the evidence suggests that prices weakened substantially in 2009, as indicated by the figures in the table below., 726185=One Year Time Charter Rates for Geared/Gearless Containerships (US$ per Day): 2000 to 2010, 457563=In 2009, approximately 7.9 billion tons of cargo of all types was transported by sea, of which 4.8 billion tons were dry cargo and 3.1 billion tons were liquids. Collectively, in the period 2000 to 2009 the compound average annual growth rate (CAGR) in world seaborne trade was 3.3%. However, as the figures in the table below indicate, there is considerable variation by sector in the rate of growth, with containers being the fastest growing sector by a significant margin during this period (although global container volumes declined by over 9% year-on-year in 2009)., 873277=Effective July 31, 2009, the U.S. Coast Guard adjusted the limits of OPA liability for non-tank vessels to the greater of $1,000 per gross ton or $0.85 million per non-tank vessel that is over 3,000 gross tons (subject to possible adjustment for inflation), and we expect our fleet will be composed of such vessels. CERCLA, which applies to owners and operators of vessels, contains a similar liability regime and provides for cleanup, removal and natural resource damages. Liability under CERCLA is limited to the greater of $300 per gross ton or $5 million for vessels carrying a hazardous substance as cargo and the greater of $300 per gross ton or $0.5 million for any other vessel. These OPA and CERCLA limits of liability do not apply if an incident was directly caused by violation of applicable U.S. federal safety, construction or operating regulations or by a responsible party\u0092s gross negligence or willful misconduct, or if the responsible party fails or refuses to report the incident or to cooperate and assist in connection with oil removal activities., 317715=The following unaudited table sets forth our capitalization at June 30, 2010, on an actual basis and as adjusted to give effect to:, 433378=World Seaborne Trade: 2000 & 2009, 473815=In the period from 2000 to 2009, port movements of loaded containers almost doubled from just over 200 million TEU in 2000 to just under 500 million TEU in 2009., 866390=In addition, IMO adopted an International Convention for the Control and Management of Ships\u0092 Ballast Water and Sediments, or BWM, in February 2004. BWM\u0092s implementing regulations call for a phased introduction of mandatory ballast water exchange requirements, to be replaced in time with mandatory concentration limits. BWM will not become effective until 12 months after it has been adopted by 30 states, the combined merchant fleets of which represent not less than 35% of the gross tonnage of the world\u0092s merchant shipping. To date, there has not been sufficient adoption of this standard for it to take force., 653696=2005, 129011=Negative trends in the global economy that emerged in 2008 continue to adversely affect global economic conditions. The deterioration in the global economy has caused, and may continue to cause, a decrease in worldwide demand for certain goods and, thus, shipping. Continuing economic instability could have a material adverse effect our ability to implement our business strategy., 31276=On June 8, 2010, we, through our wholly-owned subsidiaries, entered into memoranda of agreement to purchase two newbuilding containerships, identified as Hull 558 (named Sagitta) and Hull 559 (named Centaurus), from a third-party seller, each with a carrying capacity of approximately 3,400 TEU for a purchase price of Euro 37,300,000 per ship (or $45.7 million and $47.2 million, respectively, excluding any predelivery expenses). We took delivery of the vessel Sagitta on June 29, 2010 following which the vessel commenced time charter employment with A.P. Møller-Maersk A/S for a minimum period of nine months and a maximum period of 12 months at a gross daily rate of $16,000. We took delivery of the Centaurus on July 9, 2010, following which the vessel commenced time charter employment with Hapag Lloyd AG, Hamburg for a minimum period of 30 days and a maximum period of 60 days at a gross daily rate of $8,400, and on September 4, 2010 following the expiration of this time charter the vessel was delivered to CSAV, Valparaiso for a period of 24 months plus or minus 45 days at a gross daily rate of $20,000. On July 7, 2010, we, through our wholly owned subsidiaries, entered into a new secured term loan facility with DnB NOR Bank ASA for up to $40.0 million. We have drawn down $10.0 million per vessel in connection with the acquisition of the two newbuilding containerships and expect that the remaining $20.0 million will be available for future vessel acquisitions. Please see \u0093Management\u0092s Discussion and Analysis of Financial Condition and Results of Operations\u0097Liquidity and Capital Resources.\u0094, 727154=Period Averages of One Year Containership Time Charter Rates ($ per Day): 2000 to 2010, 476216=and Trans-shipments (Million TEU): 2000 to 2009, 388021=Our working capital requirements relate to the acquisition and operation of our fleet. We applied a portion of the net proceeds of the private offering of approximately $85.3 million, which includes consideration of $50 million from Diana Shipping\u0092s investment in our common shares and approximately $20.0 million of indebtedness under our new secured loan agreement for up to $40.0 million, which we entered into with DnB NOR Bank ASA on July 7, 2010, to fund the acquisition of the two newbuilding containerships in our initial fleet. Our operating cash flow is generated from charters on our vessels, through our subsidiaries. We expect that our proceeds from operations will be sufficient to fund our working capital requirements. We intend to finance our future growth with future debt and equity offerings as deemed appropriate by our management and board of directors., 863983=Pollution Damage, or the CLC, although the United States is not a party. Under this convention and depending on whether the country in which the damage results is a party to the 1992 Protocol to the CLC, a vessel\u0092s registered owner is strictly liable, subject to certain defenses, for pollution damage caused in the territorial waters of a contracting state by discharge of persistent oil. The limits on liability outlined in the 1992 Protocol use the International Monetary Fund currency unit of Special Drawing Rights, or SDR. The right to limit liability is forfeited under the CLC where the spill is caused by the shipowner\u0092s actual fault and under the 1992 Protocol where the spill is caused by the shipowner\u0092s intentional or reckless conduct. Vessels trading with states that are parties to these conventions must provide evidence of insurance covering the liability of the owner. In jurisdictions where the CLC has not been adopted, various legislative schemes or common law govern, and liability is imposed either on the basis of fault or in a manner similar to that of the CLC. We believe that our protection and indemnity insurance will cover the liability under the plan adopted by the IMO., 465510=World Container Cargo (Million Tons): 1997 to 2009, 722755=2009, 86001=Diana Containerships Inc. is a corporation incorporated under the laws of the Republic of the Marshall Islands on January 7, 2010. Each of our vessels is owned by separate wholly-owned subsidiaries. Diana Containerships Inc. is the owner of all the issued and outstanding shares of the subsidiaries listed in Exhibit 21.1 to the Registration Statement of which this prospectus is a part. We maintain our principal executive offices at Pendelis 16, 175 64 Palaio Faliro, Athens, Greece. Our telephone number at that address is 011 30 210 947 0000. Our office space is provided to us by DSS pursuant to our Administrative Services Agreement with DSS., 394200=We generate all of our revenues in dollars. However, we incur some of our expenses in other currencies, primarily the Euro. The amount and frequency of some of these expenses (such as vessel repairs, supplies and stores) may fluctuate from period to period. In addition, the purchase price of the two newbuilding containerships is in Euros. On June 4, 2010 we converted $50.0 million of cash available to Euro (an approximate Euro value of 41.0 million). Since approximately 2002, the dollar has depreciated against the Euro. Depreciation in the value of the dollar relative to other currencies increases the dollar cost to us of paying such expenses. The portion of our expenses incurred in other currencies could increase in the future, which could expand our exposure to losses arising from currency fluctuations., 2311=We are offering to exchange, commencing on October 19, 2010, an aggregate of 2,558,997 common shares we sold previously in a private offering, or the Original Shares, for new registered exchange shares (including preferred stock purchase rights), or the Exchange Shares., 918562=Antonios Karavias has served as an independent Director and as the Chairman of our Compensation Committee and member of our Audit Committee since the completion of the private offering. Since 2007 Mr. Karavias has served as an Independent Advisor to the Management of Société Générale Bank and Trust and Marfin Egnatia Bank. Previously, Mr. Karavias was with Alpha Bank from 1999 to 2006 as a Deputy Manager of Private Banking and with Merrill Lynch as a Vice President from 1980 to 1999. He holds a bachelor\u0092s degree in Economics from Mississippi State University and a master\u0092s degree in Economics from Pace University., 659731=2007, 927103=2010 Equity Incentive Plan, 1129514=For purposes of being able to determine the persons who actually or constructively own 5% or more of the vote and value of our common stock, or \u00935% Shareholders,\u0094 the regulations permit us to rely on those persons that are identified on Schedule 13G and Schedule 13D filings with the Securities and Exchange Commission, as owning 5% or more of our common stock. The regulations further provide that an investment company which is registered under the Investment Company Act of 1940, as amended, will not be treated as a 5% Shareholder for such purposes., 719732=2006, 384671=Net Loss. Net loss for the period from inception to June 30, 2010 amounted to $1.9 million and resulted from the expenses for starting up and running the Company. Revenues from vessels for the period were insignificant, as our first newbuilding containership Sagitta was delivered to us on June 29, 2010., 4766=The exchange offer will expire at 5:00 p.m., New York City time, on November 18, 2010 unless we extend it., 314781=In the event that on April 6, 2012 (i) we have not completed an initial public offering of common stock pursuant to an effective registration statement under the Securities Act, and (ii) we have not applied at least ninety percent (90%) of the net proceeds of the private offering to a Permitted Purpose then our Board of Directors shall call within 60 days of such date a special meeting of shareholders in accordance with our amended and restated by-laws to consider and vote upon a proposal to distribute to our shareholders the amount of net proceeds of the private offering that has not been expended by the Company for a Permitted Purpose as of such date. Diana Shipping has agreed to vote its shares in accordance with the majority of the votes cast by shareholders that are not affiliated with Diana Shipping at such special meeting. No assurance can be given that the Company will be continuing operations on such date or that any proceeds of the private offering will be available for distribution on such date., 591734=The fleet has grown rapidly to meet the increases in trade rising from just under 5 million TEU at the end of 2000 to 13.3 million TEU at the beginning of July 2010., 713671=2000, 799867=Diana Containerships Inc. is a corporation formed under the laws of the Republic of the Marshall Islands on January 7, 2010, founded to pursue vessel acquisitions in the container shipping industry. Diana Shipping, a global provider of drybulk transportation services, purchased $50.0 million of our common shares in the private offering. On June 8, 2010, we, through our wholly owned subsidiaries, entered into memoranda of agreement to purchase two newbuilding containerships, identified as Hull 558 (named Sagitta) and Hull 559 (named Centaurus), from a third-party seller, each with a carrying capacity of approximately 3,426 TEU, for a purchase price of Euro 37,300,000 per ship (or $45.7 million and $47.2 million, respectively, excluding any predelivery expenses). We took delivery of the vessel Sagitta on June 29, 2010 following which the vessel commenced time charter employment with A.P. Møller-Maersk A/S for a minimum period of nine months and a maximum period of 12 months at a gross daily rate of $16,000. We took delivery of the Centaurus on July 9, 2010 following which the vessel commenced time charter employment with Hapag Lloyd AG, Hamburg for a minimum period of 30 days and a maximum period of 60 days at a gross daily rate of $8,400, and on September 4, 2010 following the expiration of this time charter the vessel was delivered to CSAV, Valparaiso for a period of 24 months plus or minus 45 days at a gross daily rate of $20,000. On July 7, 2010, we entered into a new secured term loan facility with DnB NOR Bank ASA for up to $40.0 million. We have drawn down $10.0 million per vessel in connection with the acquisition of the two newbuilding containerships and under the loan agreement, we are permitted to draw down up to the lower of (a) $20 million and (b) 50% of the market value of the vessels. Please see \u0093Management\u0092s Discussion and Analysis of Financial Condition and Results of Operations\u0097Liquidity and Capital Resources.\u0094, 64204=Since reaching a peak in late 2008, new ordering has slowed and the containership orderbook has declined in size due to a combination of deliveries, cancellations and conversions to other types of vessels. According to Drewry, more than 15% of the orderbook has already been cancelled and delays have pushed out the deliveries of many containerships., 821443=other services necessary for the operation of our business. We actively monitor the performance of our Manager. Pursuant to the Administrative Services Agreement, we have agreed to pay our Manager a monthly fee of $10,000 for administrative services. We, through our vessel-owning subsidiaries, have entered into vessel management agreements with DSS for the provision of commercial and technical management services. Pursuant to each vessel management agreement, DSS receives a commission of 1% of the gross charterhire and freight earned by the vessel and a technical management fee of $15,000 per vessel per month for employed vessels and will receive $20,000 per vessel per month for laid-up vessels, if any. Pursuant to the Broker Services Agreement, dated June 1, 2010, the Manager has appointed Diana Enterprises Inc., or Diana Enterprises, a related party controlled by our Chief Executive Officer and Chairman, Mr. Symeon Palios, as broker to assist the Manager in providing services to the Company. Under the Broker Services Agreement, the Manager pays a commission of $1,040,000 per year to Diana Enterprises. We reimburse this cost to the Manager pursuant to the Administrative Services Agreement. We believe that the above management fees and commissions are consistent with fees and commissions charged by third party managers and are consistent with fees and commissions charged by DSS to Diana Shipping. Please see \u0093\u0097Administrative Services Agreement,\u0094 \u0093\u0097Broker Services Agreement\u0094 and \u0093\u0097Vessel Management Agreements.\u0094, 61515=The size of the newbuilding orderbook increased rapidly in the period from 2006 to 2008, when strong freight rates encouraged high levels of new ordering. As of July 30, 2010, newbuilding containerships with an aggregate capacity of 3.97 million TEU were on order, representing 29.8% of the total capacity of the existing cellular containership fleet., 638628=2000, 184364=Pursuant to our amended and restated bylaws, we have agreed that, upon April 6, 2012, we will either complete an initial public offering of common stock pursuant to an effective registration statement under the Securities Act, or use at least ninety percent (90%) of the net proceeds of the private offering (i) to fund containership acquisitions; (ii) for capital expenditures relating to our vessels; (iii) for vessel operating expenses, which may include expenses incurred in the lay-up of our vessels, and reasonable reserves established by our board of directors for any such operating or lay-up expenses; (iv) general and administrative expenses; and (v) other expenses related to the ownership, operation, management and maintenance of our containerships (the, 714672=2001, 656722=2006, 135328=The Chinese economy differs from the economies of most countries belonging to the Organization for Economic Cooperation and Development in such respects as structure, government involvement, level of development, growth rate, capital reinvestment, allocation of resources, rate of inflation and balance of payments position. Prior to 1978, the Chinese economy was a planned economy. Since 1978, increasing emphasis has been placed on the utilization of market forces in the development of the Chinese economy. Annual and five-year State Plans are adopted by the Chinese government in connection with the development of the economy. Although state-owned enterprises still account for a substantial portion of the Chinese industrial output, in general, the Chinese government is reducing the level of direct control that it exercises over the economy through State Plans and other measures. There is an increasing level of freedom and autonomy in areas such as allocation of resources, production, pricing and management and a gradual shift in emphasis to a \u0093market economy\u0094 and enterprise reform. Limited price reforms were undertaken, with the result that prices for certain commodities are principally determined by market forces. Many of the reforms are unprecedented or experimental and may be subject to revision, change or abolition based upon the outcome of such experiments. If the Chinese government does not continue to pursue a policy of economic reform, the level of imports to and exports from China could be adversely affected by changes to these economic reforms by the Chinese government, as well as by changes in political, economic and social conditions or other relevant policies of the Chinese government, such as changes in laws, regulations or export and import restrictions, all of which could, adversely affect our business, operating results and financial condition., 928680=Following the completion of an initial public offering of our common stock, we expect to issue an additional 53,333 restricted common shares to our executive officers pursuant to the 2010 Equity Incentive Plan, of which 25%will vest upon the grant of such shares, and the remainder of which will vest ratably over three years from their date of grant., 568018=The process of globalization, China\u0092s entry into the World Trade Organization in 2001 and the subsequent boom in cheap manufacturing have fueled global economic development and demand. As a result, almost all trade routes with the Far East have experienced significant annual growth in container traffic since 2001., 592041=Development of World Container Fleet Capacity: 2000 to 2010, 83299=In the event that on April 6, 2012 (i) we have not completed an initial public offering of common stock pursuant to an effective registration statement under the Securities Act, and (ii) we have not applied at least ninety percent (90%) of the net proceeds of the private offering to a Permitted Purpose then our Board of Directors shall call within 60 days of such date a special meeting of shareholders in accordance with our amended and restated by-laws to consider and vote upon a proposal to distribute to our shareholders the amount of net proceeds of the private offering that has not been expended by the Company for a Permitted Purpose as of such date. Diana Shipping has agreed to vote its shares in accordance with the majority of the votes cast by shareholders that are not affiliated with Diana Shipping at such special meeting., 319399=The drawdown on July 9, 2010 of $20,000,000 under our loan agreement with DnB NOR Bank ASA to partly finance the acquisition cost of vessels Sagitta and Centaurus., 60593=Preliminary data suggests that in 2009 the volume of container trade decreased for the first time in recent history, due to the severity of the worldwide recession. For the year as a whole, the volume of global container trade was approximately 10% below that of the corresponding period in 2008. As a result of declining volume and falling rates, global carrier revenues in 2009 were approximately 35% below those of 2008. For the global container industry (excluding the non-operating owners), losses were in excess of $22 billion in 2009, which will make it the worst year in the recent history of the industry in terms of losses. However, based on limited data, there is some evidence to suggest that market conditions have improved in tandem with renewed growth in the world economy., 895893=The United States signed into law the 9/11 Commission Act on August 3, 2007. The Act requires that all containers destined to the United States be scanned by x-ray machines before leaving port. This new requirement for 100% scanning is set to take effect in 2014. Ports that ship to the United States will likely have to install new x-ray machines and make infrastructure changes in order to accommodate the screening requirements. Such implementation requirements may change which ports are able to ship to the United States and shipping companies may incur significant increased costs. It is impossible to predict how this requirement will affect the industry as a whole, but changes and additional costs can be reasonably expected., 466439=In 2009 the volume of container trade contracted for the first time in history, due to the severity of the worldwide recession. For the year as a whole the volume of global container trade was about 9.5% below that of the corresponding period in 2008, which was itself low by historical standards. As a result of declining volume and falling rates global carrier revenues for 2009 were approximately 35% below those of 2008. However, based on the evidence of the first half of 2010, global container trade is starting to recover in the wake of renewed growth in the world economy., 970528=Upon the terms and subject to the conditions set forth in this prospectus and in the accompanying letter of transmittal, we will accept for exchange any and all Original Shares validly tendered and not properly withdrawn prior to 5:00 p.m., New York City time, on the Expiration Date. The Exchange Offer will remain open for at least 20 full business days (as required by Exchange Act Rule 14e-1(a)) and will expire at 5:00 p.m., New York City time, on November 18, 2010, or such later date and time to which we extend it. Holders may tender some or all of their Original Shares pursuant to the Exchange Offer. The date of acceptance for exchange of the Original Shares, and completion of the Exchange Offer, will be the exchange date, which will be the first business day following the Expiration Date (unless such period is extended as described in this prospectus). The Exchange Shares issued in connection with this Exchange Offer will be delivered promptly following the exchange date., 1024265=In addition, under the registration rights agreement, we propose to file a registration statement on Form F-1 or such other form under the Securities Act providing for the initial public offering of shares of our common stock before the later of (A) April 6, 2011 and (B) the earlier of (i) the completion of the Exchange Offer or (ii) the effectiveness of a resale registration statement, then holders of the Registrable Shares have certain \u0093piggy-back\u0094 registration rights., 662761=2008, 572412=Post Panamax: Ships with a capacity of 5,000 to 7,999 TEU, so-called because of their inability to trade through the existing Panama Canal due to dimension restrictions. However, there are plans to widen the existing Panama Canal, with completion scheduled in 2014, which will allow ships up to 12,000 TEU to transit the waterway., 386633=Management Fees. Management fees amounted to $23,000 and consist of fees payable to DSS pursuant to the vessel management agreements that we, through our vessel-owning subsidiaries, entered into on June 8, 2010 for the provision of commercial and technical management services for the vessels in our fleet., 647664=2003, 396156=financed approximately $20.0 million of the aggregate purchase price for the two vessels with our new secured loan agreement, which we entered into with DnB NOR Bank ASA on July 7, 2010 and the remaining amount with the net proceeds of the private offering., 113932=The ocean-going shipping container industry is both cyclical and volatile in terms of charter hire rates and profitability. Containership charter rates peaked in 2005 and generally stayed strong until the middle of 2008, when the effects of the recent economic crisis began to affect global container trade. Rates have fallen significantly and are now estimated to be at late 2001 levels, with further pressure expected through 2010. In the future, rates may continue to decline. Fluctuations in charter rates result from changes in the supply and demand for ship capacity and changes in the supply and demand for the major products internationally transported by containerships. The factors affecting the supply and demand for containerships and supply and demand for products shipped in containers are outside of our control, and the nature, timing and degree of changes in industry conditions are unpredictable., 387501=Foreign Currency Gain. Foreign currency gain for the period from inception to June 30, 2010 amounted to $242,490 and mainly consists of unrealized gains from the valuation of the cash account that is maintained in Euros., 621171=2009 actual deliveries may be subject to late reports, 823264=We were formed on January 7, 2010 as a wholly-owned subsidiary of Diana Shipping and on that date, we issued 500 common shares to Diana Shipping at par value. We sold 3,333,333 common shares to Diana Shipping in the private offering for consideration of $50.0 million. Pursuant to the registration rights agreement, dated April 6, 2010, we have agreed to register the resale of the common shares owned by Diana Shipping. See \u0093Exchange Offer\u0097Registration Rights Agreement.\u0094 As of the date of this prospectus, Diana Shipping owns approximately 55% of our common shares. Under the Administrative Services Agreement with the Manager, a wholly-owned subsidiary of Diana Shipping, we pay the Manager a monthly fee of $10,000 for administrative services. We, through our vessel-owning subsidiaries, have entered into vessel management agreements with the Manager for the provision of commercial and technical management services. Pursuant to each vessel management agreement, the Manager receives a commission of 1% of the gross charterhire and freight earned by the vessel and a technical management fee of $15,000 per vessel per month for employed vessels and $20,000 per vessel per month for laid-up vessels. Pursuant to the Broker Services Agreement, dated June 1, 2010, the Manager has appointed Diana Enterprises Inc., or Diana Enterprises, a related party controlled by our Chief Executive Officer and Chairman, Mr. Symeon Palios, as broker to assist the Manager in providing services to the Company. Under the Broker Services Agreement, the Manager pays a commission of $1,040,000 per year to Diana Enterprises. We reimburse this cost to the Manager pursuant to the Administrative Services Agreement. Please see \u0093\u0097Administrative Services Agreement,\u0094 \u0093\u0097Broker Services Agreement\u0094 and \u0093\u0097Vessel Management Agreements.\u0094 We have issued an aggregate of 213,331 restricted common shares to our executive officers pursuant to the 2010 Equity Incentive Plan. Of these shares, 25% have vested and the remaining shares vest ratably over three years by one-third each year. Following the completion of an initial public offering, we expect to issue an additional 53,333 restricted common shares to our executive officers pursuant to the 2010 Equity Incentive Plan of which 25% will vest upon the grant of such shares, and the remainder will vest ratably over three years from their date of grant. See \u0093Management\u00972010 Equity Incentive Plan.\u0094, 641634=2001, 592886=Container Fleet Age Profile: July 30, 2010, 832065=DSS performs commercial and technical management services for the vessels in our fleet. DSS currently manages a modern, high quality fleet of 22 Panamax and Capesize drybulk carriers and two Newcastlemax newbuildings with expected deliveries in the second and third quarter of 2012 for which DSS provides supervisory services, and maintains the quality of its vessels by carrying out regular inspections, both while in port and at sea, and adopting a preventative maintenance program for each vessel. DSS currently employs approximately 60 shore-based personnel in Athens, Greece and 460 offshore employees and, including its predecessors, has, since 1972 managed more than 100 vessels, including nine vessels that were containerships or multi-purpose vessels that were modified to transport containers. DSS provides comprehensive ship management services including technical supervision, such as repairs, maintenance and inspections, safety and quality,, 634048=The costs of operating a ship comprise five main elements\u0097manning, insurance, repairs and maintenance, stores and supplies and administration. The trend in these costs for a range of containerships in the period 2000 to 2009 is shown below., 865331=The IMO adopted the International Convention on Civil Liability for Bunker Oil Pollution Damage, or the Bunker Convention, to impose strict liability on ship owners for pollution damage in jurisdictional waters of ratifying states caused by discharges of bunker fuel. The Bunker Convention, which became effective on November 21, 2008, requires registered owners of ships over 1,000 gross tons to maintain insurance for pollution damage in an amount equal to the limits of liability under the applicable national or international limitation regime (but not exceeding the amount calculated in accordance with the Convention on Limitation of Liability for Maritime Claims of 1976, as amended). With respect to non-ratifying states, liability for spills or releases of oil carried as fuel in ship\u0092s bunkers typically is determined by the national or other domestic laws in the jurisdiction where the events or damages occur., 107197=The Company is treated as a corporation for U.S. federal income tax purposes. Depending upon the identity of its shareholders, the Company may be exempt from U.S. federal income tax on its U.S.- source shipping income pursuant to Section 883 of the United States Internal Revenue Code of 1986, as amended. If the Company is not so exempt, it will be subject to a 4% gross basis tax on its U.S.-source shipping income., 348456=On June 8, 2010, we, through our wholly-owned subsidiaries, entered into memoranda of agreement to purchase two newbuilding containerships, identified as Hull 558 (named Sagitta) and Hull 559 (named Centaurus), from a third-party seller, each with a carrying capacity of approximately 3,400 TEU for a purchase price of Euro 37,300,000 per ship (or $45.7 million and $47.2 million, respectively, excluding any predelivery expenses). We took delivery of the vessel Sagitta on June 29, 2010 following which the vessel commenced time, 349541=charter employment with A.P. Møller-Maersk A/S for a minimum period of nine months and a maximum period of 12 months at a gross daily rate of $16,000. We took delivery of the Centaurus on July 9, 2010 following which the vessel commenced time charter employment with Hapag Lloyd AG, Hamburg for a minimum period of 30 days and a maximum period of 60 days at a gross daily rate of $8,400, and on September 4, 2010 following the expiration of this time charter the vessel was chartered to CSAV, Valparaiso for a period of 24 months plus or minus 45 days at a gross daily rate of $20,000., 710046=Container Rates for East/West Routes: 2000 to 2009, 335431=We are a newly formed development stage company that was incorporated on January 7, 2010 under the laws of the Republic of the Marshall Islands. We were formed to acquire containerships engaged in the seaborne transportation of finished consumer and industrial products. We received net proceeds from the private offering of approximately $85.3 million. Following the acquisition of the two vessels in our initial fleet and the drawdown of $20.0 million under our secured loan facility, we have applied approximately 85% of the net proceeds of the private offering to a Permitted Purpose, as defined in our amended and restated by-laws. We intend to employ our vessels in the spot market or on short-term or long-term time charters or lay-up vessels as market conditions warrant. Both vessels in our initial fleet are employed on time charter with a remaining duration of about 6 to 9 months for the vessel Sagitta and about 23 months plus or minus 45 days for the Centaurus as of October 1, 2010. We expect to grow our fleet primarily through the acquisition of containerships ranging from 2,500 TEU to 7,500 TEU in size; however, we will consider acquisitions of all sizes of containerships if the returns associated with these acquisitions are deemed appropriate by our board of directors and management team. We believe that depressed charter rates and vessel values in the containership sector have created opportunities to acquire containerships at attractive prices. Please read \u0093Summary\u0097Industry Review & Trends\u0094 and \u0093Business Strategy.\u0094, 620001=The extent to which delays in deliveries have already occurred can be seen by comparing scheduled and actual deliveries in the years 2008 and 2009. As can be seen in the chart below, delays in delivery increased dramatically in 2009, with only 1.0 million TEU of the 2.0 million TEU due to be delivered in 2009 being delivered by the end of the year. Although late reports will no doubt increase the volume of tonnage delivered in 2009, it is clear that delays or slippage rates increased in 2009., 615874=Since reaching a peak in late 2008, almost no new orders have been placed and the containership orderbook has declined somewhat in size due to a combination of deliveries of vessels and cancellations. It is impossible to determine exactly how many vessels have been cancelled since the downturn in the market, although it would appear that perhaps as much as 15% of the orderbook at its peak has already been cancelled. It is evident that the original peak for deliveries which was scheduled for 2010-11 is being flattened out and extended out towards 2012-14 as owners have negotiated considerable delays with Asian yards. As such, deliveries from the current orderbook will be spread out over a much longer period of time., 346786=In April 2010, we completed the sale of an aggregate of 5,892,330 common shares in a private offering under Rule 144A, Regulation S and Regulation D under the Securities Act pursuant to the initial purchaser/placement agreement, dated March 29, 2010, by and between us and FBR Capital Markets & Co., including 290,000 common shares issued pursuant to the exercise of FBR Capital Markets & Co.\u0092s option to purchase additional shares, with aggregate net proceeds of $85.3 million., 66282=One of our key strengths is our experienced management team comprised of four executive officers of Diana Shipping who have experience in multiple sectors of the international shipping industry, including in the containership sector. We believe that we will be able to capitalize on the industry experience and reputation of our management team who have successfully developed the business of Diana Shipping, a leading provider of seaborne transportation services, from the formation of the Diana Shipping group of companies in 1972, to a fleet of nine vessels at the time of Diana Shipping\u0092s initial public offering in 2005. As of the date of this prospectus, Diana Shipping owns a fleet of 24 vessels, including two newbuilding vessels with deliveries expected in the second and third quarters of 2012. As a result of decades of experience, we believe our management team has developed strong relationships with major international charterers, shipbuilders and financial institutions that reflect the quality of Diana Shipping\u0092s operations and the strength of its management team., 131324=Continued economic turmoil in the Asia Pacific region, especially in Japan and China, may exacerbate the effect on us of the recent slowdown in the rest of the world. Before the global economic financial crisis that began in 2008, China had one of the world\u0092s fastest growing economies in terms of gross domestic product, or GDP, which had a significant impact on shipping demand. China and other countries in the Asia Pacific region may continue to experience slowed economic growth in the future. Moreover, the current economic slowdown in the economies of the United States, the European Union and other Asian countries may further adversely affect economic growth in China and elsewhere. Our ability to establish our operations and implement our growth successfully would be impeded by a continuing or worsening economic downturn in any of these countries., 721753=2008, 794591=* July 2010, 146780=Since the events of September 11, 2001, U.S. authorities have significantly increased the levels of inspection for all imported containers. Government investment in non-intrusive container scanning technology has grown, and there is interest in electronic monitoring technology, including so-called \u0093e-seals\u0094 and \u0093smart\u0094 containers that would enable remote, centralized monitoring of containers during shipment to identify tampering with or opening of the containers, along with potentially measuring other characteristics such as temperature, air pressure, motion, chemicals, biological agents and radiation., 384494=Period ended June 30, 2010, 919361=Nikolaos Petmezas has served as an independent Director and as a member of our Compensation Committee since the completion of the private offering. Mr. Petmezas has served since 2001 as the C.E.O. of Maersk-Svitzer-Wijsmuller B.V. and, prior to its acquisition by Maersk, as a Partner and as C.E.O. of Wijsmuller Shipping Company B.V. He has also served since 1989 as the C.E.O. of N.G. Petmezas Shipping and Trading, S.A., and since 1984 as the C.E.O. of Shipcare Technical Services Shipping Co. LTD. Since 1995 Mr. Petmezas has served as well as the Managing Director of Kongsberg Gruppen A.S. (Hellenic Office) and, from 1984 to 1995, as the Managing Director of Kongsberg Vaapenfabrik A.S. (Hellenic Branch Office). Mr. Petmezas served on the Board of Directors of Neorion Shipyards, in Syros, Greece from 1989 to 1992. Mr. Petmezas began his career in shipping in 1977, holding sales positions at Austin & Pickersgill Ltd. and British Shipbuilders Corporation until 1983. Mr. Petmezas has been an Advisor at Westinghouse Electric and Northop Grumman since 1983 and a Honorary Consul under the General Consulate of Sri Lanka in Greece since 1995. Mr. Petmezas holds degrees in Law and in Political Sciences and Economics from the Aristotle University of Thessaloniki and an LL.M. in Shipping Law from London University., 393401=We have $20.0 million of indebtedness under our new secured loan agreement for up to $40.0 million, which we entered into on July 7, 2010, in connection with the acquisition of the two vessels in our initial fleet and are subject to interest rate fluctuations. When determined appropriate by our management team based on prevailing conditions and our outlook for the container market, we will consider incurring additional indebtedness in the future to enhance returns to our shareholders., 859012=In March 2010, the IMO accepted the proposal by the United States and Canada to designate the area extending 200 nautical miles from the Atlantic/Gulf and Pacific coasts of the United States and Canada and the Hawaiian Islands as Emission Control Areas under the MARPOL Annex VI amendments, which will subject ocean-going vessels in these areas to stringent emissions controls and may cause us to incur additional costs. We cannot assure you that the jurisdictions in which our vessels operate will not adopt more stringent emissions standards independent of the IMO., 567427=East/West Container Trade Routes: 2001 to 2009, 975328=The term \u0093expiration date\u0094 means 5:00 p.m., New York City time, on November 18, 2010, unless we, in our sole discretion, extend the Exchange Offer, in which case the term \u0093Expiration Date\u0094 means the latest date and time to which we extend the Exchange Offer. To extend the Expiration Date, we will notify the Exchange Agent of any extension by written notice. We will notify holders of the Original Shares of any extension by press release or other public announcement., 665774=2009, 397457=The following table presents our contractual obligations as of June 30, 2010, as adjusted to reflect our entry into the loan agreement with DnB NOR Bank ASA., 712230=Average Container Rates for East/West Routes: 2000 to 2010, 567141=The chart below shows the growth, in volume, of the three East/West trades from 2001 to 2009. These trades constitute approximately 30% of global volume., 90166=Any holder electing to have Original Shares exchanged pursuant to this Exchange Offer must properly tender such holder\u0092s Original Shares for Exchange Shares prior to 5:00 p.m. on the Expiration Date (defined below)., 386340=Depreciation. Depreciation for the period from inception to June 30, 2010 amounted to $7,886 and represents the depreciation expense of the Sagitta., 593812=In tandem with the growth in size of the overall fleet there have also been steady increases in ship size. The average size of containerships in service in 1997 was 1,590 TEU, but by July 2010 the average size had increased to 2,864 TEU. It will continue to rise due to the number of large-sized containerships on order. Indeed, the average size of containership on order as of July 2010 was 5,521 TEU., 817778=Our management team is comprised of four executive officers of Diana Shipping who together have an aggregate of over 87 years of experience in the shipping industry and have demonstrated ability in managing the commercial, technical and financial aspects of an international shipping company. Our management team is led by our Chairman and Chief Executive Officer Mr. Symeon Palios, who has served as the Chairman and Chief Executive Officer of Diana Shipping since 2005 and as a director since 1999. Mr. Palios is a qualified naval architect and engineer who has 40 years of experience in the shipping industry and expertise in technical and operational matters. Mr. Anastasios Margaronis, our President and a director, also serves as President and as a director of Diana Shipping and has been employed by the Diana Shipping group of companies since 1979. Mr. Ioannis Zafirakis, our Chief Operating Officer, Secretary and a director, serves as Executive Vice President and Secretary of Diana Shipping and has been employed by the Diana Shipping group of companies since 1997. Mr. Andreas Michalopoulos, our Chief Financial Officer and Treasurer, has held these same offices with Diana Shipping since 2006. Our management team has experience in multiple sectors of the international shipping industry, including in the containership sector, and a proven track record of strategic growth beginning with the formation of the Diana Shipping group of companies in 1972. Our management team is responsible for identifying assets for acquisition and for the operation of our business in order to build our fleet and effectively manage our growth., 717713=2004, 576563=In July 2010 the world fleet of fully cellular containerships consisted of 4,652 vessels totaling 13.32 million TEU in nominal capacity. These figures exclude multipurpose and ro-ro vessels with container carrying capability., 186112=In the event that on April 6, 2012 (i) we have not completed an initial public offering of common stock pursuant to an effective registration statement under the Securities Act, and (ii) we have not applied at least ninety percent (90%) of the net proceeds of the private offering to a Permitted Purpose then our Board of Directors shall call within 60 days of such date a special meeting of shareholders in accordance with our amended and restated by-laws to consider and vote upon a proposal to distribute to our shareholders the amount of net proceeds of the private offering that has not been expended by the Company for a Permitted Purpose as of such date. Diana Shipping has agreed to vote its shares in accordance with the majority of the votes cast by shareholders that are not affiliated with Diana Shipping at such special meeting. The Exchange Offer does not satisfy the requirement to complete an initial public offering of common stock pursuant to an effective registration statement under the Securities Act for purposes of this provision contained in our amended and restated by-laws. No assurance can be given that the Company will be continuing operations on such date or that any proceeds of the private offering will be available for distribution on such date. In addition, the U.S. federal income tax consequences of any distribution may vary depending on the form of such distribution, if any., 474891=Regional trends in container port throughput in the period from 2000 to 2009 are shown in the table below., 720734=2007, 1034224=We have entered into a stockholders rights agreement dated August 2, 2010, or the Stockholders Rights Agreement, with Mellon Investor Services LLC as Rights Agent. Pursuant to this Stockholders Rights Agreement, each share of our common stock includes one right, which we refer to as a Right that entitles the holder to purchase from us a unit consisting of one one-thousandth of a share of our preferred stock at an exercise price specified in the Stockholders Rights Agreement, subject to specified adjustments. Until a Right is exercised, the holder of a Right will have no rights to vote or receive dividends or any other stockholder rights., 347859=On June 1, 2010, we terminated our existing Consultancy Agreements with companies controlled by each of the executive officers and the services that were previously provided to the Company by the consultants are provided by DSS under the Administrative Services Agreement. DSS has appointed Diana Enterprises Inc., a related party, as broker to assist it in providing services to the Company pursuant to the Broker Services Agreement, dated June 1, 2010., 615316=Most major containership operators have concentrated on investments in large and very large containerships (8,000+ TEU) and this sector alone currently accounts for a third of all current containership orders, measured by capacity. After Maersk deployed the first 10,000+ TEU vessels in the Far East/Europe trade in 2006, further orders for vessels of similar size followed from some of the other largest container operators., 389195=On July 7, 2010, we entered into a new secured term loan facility with DnB NOR Bank ASA for up to $40.0 million to partially finance the acquisition of the two vessels in our initial fleet. The loan is available in two advances for each vessel with each advance not exceeding the lower of $10.0 million and 25% of the market value of the relevant ship and is available until July 31, 2011. Each advance is repayable in 24 quarterly installments of $165,000 plus one final balloon installment of $6.04 million to be paid together with the last, 744736=With some exceptions, time charter rates for all vessel sizes increased steadily from 2002 into 2005, in some cases rising by as much as 50.0%, as charter markets experienced significant growth. Demand for vessels was largely spurred on by growth in the volume of exports from China. In 2006, time charter rates weakened due to supply rising faster than demand and also market perception. This trend continued in 2007 and 2008, and in 2009 rates fell even farther due to rising supply and very weak demand. Certain analysts believe that the containership shipping sector is likely to remain volatile, but with demand increasing in the first half of 2010, operators have gone back to the charter market for more vessels and indeed many vessels have come out of lay-up. As a result, charter rates across most sizes have significantly improved from the lows of 2009, although in historical context they remain poor. For shipowners this is good news as demand for ships has improved their earnings and has increased fixture periods., 467151=Global container trade has increased every year since the introduction of long-haul containerized shipping routes in the late 1960s, with the likely exception of 2009. This momentum is primarily driven by the growth of economic output and consumption, increases in global sourcing and changes in patterns of world trade. Therefore, container trade growth is in part dependent on levels of economic growth and regional/national gross domestic product, or GDP. GDP serves as the best indicator of prospective container volumes, although the drastic events of 2008 and 2009 prove that the link between GDP growth and container growth is not as strong as it was., 875855=The U.S. Environmental Protection Agency, or the EPA, regulates the discharge of ballast water and other substances in U.S. waters under the CWA. Effective February 6, 2009, EPA regulations require vessels 79 feet in length or longer (other than commercial fishing and recreational vessels) to comply with a Vessel General Permit authorizing ballast water discharges and other discharges incidental to the operation of vessels. The Vessel General Permit imposes technology and water-quality based effluent limits for certain types of discharges and establishes specific inspection, monitoring, recordkeeping and reporting requirements to ensure the effluent limits are met. U.S. Coast Guard regulations adopted under the U.S. National Invasive Species Act, or NISA, also impose mandatory ballast water management practices for all vessels equipped with ballast water tanks entering or operating in U.S. waters, and the Coast Guard recently proposed new ballast water management standards and practices, including limits regarding ballast water releases. Compliance with the EPA and the U.S. Coast Guard regulations could require the installation of equipment on our vessels to treat ballast water before it is discharged or the implementation of other port facility disposal arrangements or procedures at potentially substantial cost, and/or otherwise restrict our vessels from entering U.S. waters., 385124=Voyage and Time Charter Revenues. Voyage and time charter revenues for the period from inception to June 30, 2010 amounted to $1,322, representing revenues from the hire of our containership Sagitta from the time of delivery to the charterers., 617217=Containership Orderbook by Size and Scheduled Delivery Year \u0096 July 2010, 844741=On June 1, 2010, we terminated our existing Consultancy Agreements with companies controlled by each of the executive officers and that services that were previously provided to the Company by the consultants are provided by DSS under the Administrative Services Agreement. DSS has appointed Diana Enterprises Inc., a, 856336=In September 1997, the IMO adopted Annex VI to MARPOL to address air pollution from ships. Effective May 2005, Annex VI sets limits on sulfur oxide and nitrogen oxide emissions from all commercial vessel exhausts and prohibits deliberate emissions of ozone depleting substances (such as halons and chlorofluorocarbons), emissions of volatile organic compounds from cargo tanks, and the shipboard incineration of specific substances. Annex VI also includes a global cap on the sulfur content of fuel oil and allows for special areas to be established with more stringent controls on sulfur emissions. Additional or new conventions, laws and regulations may be adopted that could require the installation of expensive emission control systems and adversely affect our business, cash flows, results of operations and financial condition. In October 2008, the IMO, 5517=You may withdraw tenders of Original Shares at any time before 5:00 p.m., New York City time, on the date of the expiration of the Exchange Offer.}",
    "lastModified": "Tue, 19 Oct 2010 20:13:42 GMT",
    "textBeforeTable": "  TABLE OF CONTENTS   Table of Contents This prospectus is dated October 19, 2010. NEITHER THE SECURITIES AND EXCHANGE COMMISSION NOR ANY STATE SECURITIES COMMISSION HAS APPROVED OR DISAPPROVED OF THESE SECURITIES OR DETERMINED IF THIS PROSPECTUS IS TRUTHFUL OR COMPLETE. ANY REPRESENTATION TO THE CONTRARY IS A CRIMINAL OFFENSE.     See \u0093Risk Factors \u0094 beginning on page 13 of this prospectus for a discussion of certain factors that you should consider before participating in the Exchange Offer. In connection with resales of Exchange Shares, any participating broker-dealer must acknowledge in that it will deliver a prospectus meeting the requirements of the Securities Act. The Securities and Exchange Commission has taken the position that broker-dealers who acquired the Original Shares as a result of market-making or other trading activities may use this prospectus to fulfill their prospectus delivery requirements with respect to the Exchange Shares. The exchange of shares will not be a taxable exchange for U.S. federal income tax purposes.   \u0095  ",
    "textAfterTable": "BUSINESS      70    MANAGEMENT      85    RELATED PARTY TRANSACTIONS      89    PRINCIPAL SHAREHOLDERS      90    THE EXCHANGE OFFER      91    DESCRIPTION OF EXCHANGE SHARES      101    DESCRIPTION OF CAPITAL STOCK   ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}