{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2015-07597",
            "",
            "FR-5829-F-01"
        ]
    ],
    "pageTitle": "24 CFR 0.1 - Cross-reference to employees ethical conduct standards and financial disclosure regulations. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/24/0.1?qt-cfr_tabs=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00059-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899797231,
    "recordOffset": 899774896,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1032=Title 24 published on 2015-04-01.}",
    "TableContextTimeStampAfterTable": "{132139=Section 8(c)(1) of the United States Housing Act of 1937 (USHA) requires HUD to publish Fair Market Rents (FMRs) periodically, but not less than annually, adjusted to be effective on October 1 of each year. Some examples of uses of FMRs are to determine payment standard amounts for the Housing Choice Voucher (HCV) program, to establish a limit on the amount of rent to owner for project-based vouchers, to determine initial and renewal rents for some new and expiring project-based Section 8 contracts, to determine initial rents for housing assistance payment (HAP) contracts in the Moderate Rehabilitation Single Room Occupancy program (Mod Rehab), and to serve as a rent ceiling in the HOME rental assistance program. This document announces HUD's intention to amend HUD's FMR regulations applicable to the HCV program (24 CFR part 888) to provide HCV tenants with subsidies that better reflect the localized rental market, including subsidies that would be relatively higher if they move into areas that potentially have better access to jobs, transportation, services, and educational opportunities. Specifically, this document requests public comments on the use of small area FMRs (SAFMRs) for the HCV program within certain metropolitan areas. Small areas FMRs vary by ZIP code and support a greater range of payment standards than can be achieved under existing regulations., 122540=On December 5, 2011, HUD published an interim rule entitled “Homeless Emergency Assistance and Rapid Transition to Housing: Emergency Solutions Grants Program and Consolidated Plan Conforming Amendments” (interim rule). The comment period for the interim rule ended on February 3, 2012. Because recipients and subrecipients have now had more experience implementing the interim rule, HUD recognizes that they may have additional input and comments for HUD to consider in its development of the ESG final rule (final rule). Therefore, this document takes comments for 60 days to allow additional time for public input, and for HUD to solicit specific comment on certain issues., 75885=Title 24 published on 2015-04-01, 45680=The U.S. Department of Housing and Urban Development (HUD) and the U.S. Department of Agriculture (USDA) have determined that adoption of the 2009 edition of the International Energy Conservation Code (IECC) for single family homes and the 2007 edition of the American Society of Heating, Refrigerating and Air-conditioning Engineers (ASHRAE) 90.1 for multifamily buildings will not negatively affect the affordability and availability of certain HUD- and USDA-assisted housing specified in section 481 of the Energy and Independence and Security Act of 2007 (EISA). This determination fulfills a statutory requirement established under EISA that HUD and USDA adopt revisions to the 2006 IECC and ASHRAE 90.1-2004 subject to: A determination that the revised codes do not negatively affect the availability or affordability of new construction of single family and multifamily housing covered by EISA; and a determination by the Secretary of Energy that the revised codes “would improve energy efficiency.” For the more recent IECC and ASHRAE codes that have been published since the publication of the 2009 IECC and ASHRAE 90.1-2007, HUD and USDA intend to follow this Notice of Final Determination with an advance notice that addresses the next steps the agencies plan to take on the 2015 IECC and ASHRAE 90.1-2013 codes., 56512=This document advises that HUD's portion of the governmentwide joint interim rule that implements the Uniform Administrative Requirements, Cost Principles, and Audit Requirements for Federal Awards, published on December 19, 2014, displayed an incorrect RIN number. This document advises of the correct RIN number, 2501-AD66, which is also shown above in the heading of this document., 3092=Through this final rule, HUD provides HUD program participants with an approach to more effectively and efficiently incorporate into their planning processes the duty to affirmatively further the purposes and policies of the Fair Housing Act, which is title VIII of the Civil Rights Act of 1968. The Fair Housing Act not only prohibits discrimination but, in conjunction with other statutes, directs HUD's program participants to take significant actions to overcome historic patterns of segregation, achieve truly balanced and integrated living patterns, promote fair housing choice, and foster inclusive communities that are free from discrimination. The approach to affirmatively furthering fair housing carried out by HUD program participants prior to this rule, which involved an analysis of impediments to fair housing choice and a certification that the program participant will affirmatively further fair housing, has not been as effective as originally envisioned. This rule refines the prior approach by replacing the analysis of impediments with a fair housing assessment that should better inform program participants' planning processes with a view toward better aiding HUD program participants to fulfill this statutory obligation. Through this rule, HUD commits to provide states, local governments, public housing agencies (PHAs), the communities they serve, and the general public, to the fullest extent possible, with local and regional data on integrated and segregated living patterns, racially or ethnically concentrated areas of poverty, the location of certain publicly supported housing, access to opportunity afforded by key community assets, and disproportionate housing needs based on classes protected by the Fair Housing Act. Through the availability of such data and available local data and knowledge, the approach provided by this rule is intended to make program participants better able to evaluate their present environment to assess fair housing issues such as segregation, conditions that restrict fair housing choice, and disparities in access to housing and opportunity, identify the factors that primarily contribute to the creation or perpetuation of fair housing issues, and establish fair housing priorities and goals., 65413=Through this rule, HUD removes the regulations for its Section 235 Program, which authorized HUD to provide mortgage subsidy payments to lenders to assist lower-income families who are unable to meet the credit requirements generally applicable to FHA mortgage insurance programs. Authority to provide insurance to mortgagees under this program was terminated under the Housing and Community Development Act of 1987 and HUD has not provided new mortgage subsidy payments under this program since then. Because the regulations governing this program are no longer operative, they are being removed by this final rule. To the extent that any Section 235 mortgages remain in existence, or second mortgages for the recapture of subsidy payment pursuant to HUD's regulations governing the Section 235 Program (which was reserved by regulatory streamlining in 1995), the removal of these regulations does not affect the requirements for transactions entered into when Section 235 Program regulations were in effect. Assistance made available under the Section 235 Program will continue to be governed by the regulations that existed immediately before the effective date of this final rule.}",
    "lastModified": "Wed, 29 Jul 2015 23:42:09 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 42272 - Affirmatively Furthering Fair Housing 2015-07-16; vol. 80 # 136 - Thursday, July 16, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 24. Title 24 published on 2015-04-01. 61 FR 36251, July 9, 1996] [ 42 U.S.C. 3535(d) 7301; 5 U.S.C. 301, 2634. 7501 which supplements the executive branch-wide standards, and the executive branch-wide financial disclosure regulation at 5 CFR part 2635, the Department's regulation at 5 CFR part Employees of the Department of Housing and Urban Development (Department) are subject to the executive branch-wide standards of ethical conduct at 5 CFR part § 0.1 Cross-reference to",
    "textAfterTable": "DEPARTMENT OF HOUSING AND URBAN DEVELOPMENT, Office of the Secretary, HUD Final rule. Effective Date: August 17, 2015. 24 CFR Parts 5, 91, 92, 570, 574, 576, and 903 Summary Through this final rule, HUD provides HUD program participants with an approach to more effectively and efficiently incorporate into their planning processes the duty to affirmatively further the purposes and policies of the Fair Housing Act, which is title VIII of the Civil Rights Act of 1968. The Fair Housing Act not only prohibits discrimination but, in conjunction with other statutes, directs HUD's program participants to take significant actions to overcome historic patterns of segregation, achieve truly balanced and integrated living patterns, promote fair housing choice, and foster inclusive communities that are free from discrimination. The approach to affirmatively furthering fair housing carried out by HUD program participants prior to this rule, which involved an analysis of impediments to fair housing choice and a certification that the program participant will affirmatively further fair housing, has not been as effective as originally envisioned. This rule refines the prior approach by replacing the analysis of impediments with a fair housing assessment that should better inform program participants' planning processes with a view toward better aiding HUD program participants to fulfill this statutory obligation. Through this rule, HUD commits to provide states, local governments, public housing",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}