{
    "relation": [
        [
            "Title",
            "A Good Day to Die Hard",
            "Hooked 2. Next Level",
            "Hooked 2. Next Level",
            "Hooked 2. Next Level",
            "Hooked",
            "Hooked",
            "Newsmakers (Goryachie Novosti)",
            "War, Inc.",
            "War, Inc."
        ],
        [
            "Actor",
            "",
            "Marina Petrenko",
            "Evgeniy Kharlanov",
            "Aleksey Bardukov",
            "",
            "Nodar Siradze",
            "",
            "",
            "John Cusack"
        ],
        [
            "Character",
            "Russian Troop",
            "Rita",
            "Komar",
            "Max",
            "Muslim terrorists",
            "Yan",
            "MVD sniper",
            "Tamerlane personnel",
            "Hauser"
        ],
        [
            "Note",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Date",
            "2013",
            "2010",
            "2010",
            "2010",
            "2009",
            "2009",
            "2009",
            "2008",
            "2008"
        ]
    ],
    "pageTitle": "AK-47 - Internet Movie Firearms Database - Guns in Movies, TV and Video Games",
    "title": "",
    "url": "http://www.imfdb.org/index.php/AK-47",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00108-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 512570395,
    "recordOffset": 512494243,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2349=The AK-47 is a selective-fire (semi-automatic and automatic), gas-operated 7.62×39mm assault rifle, developed in the Soviet Union by Mikhail Kalashnikov. It is officially known in the Soviet documentation as Avtomat Kalashnikova (Russian: Автомат Калашникова). Even after six decades, the model and its variants remain the most popular and widely used assault rifles in the world because of their substantial, outstanding reliability under harsh conditions, low production costs compared to contemporary Western weapons, availability in virtually every geographic region and ease of use. These factors led the AK-47 to be named the greatest combat rifle of all time by the Military Channel. The AK-47 has been manufactured in many countries and has seen service with armed forces as well as irregular forces worldwide, and was the basis for developing many other types of individual and crew-served firearms. As of 2004, out of the estimated 500 million firearms worldwide, approximately 100 million belong to the Kalashnikov family, three-quarters of which are AK-47s.}",
    "TableContextTimeStampAfterTable": "{365831=(1980 - Present), 110248=(1959 - Present), 387714=(1965 - ), 26862=(1949 - Present), 423979=(1987 - 2000), 219793=(1994 - Present), 308280=The Type 84 was imported and sold with an AK birdcage flash hider and had a deep polished factory blue. Several other variants of the 84S Rifle (that are mostly unfamiliar to American Gun Owners) were victims of the 1989 Import Ban that barred most new 'assault rifles' from entering the United States. These rifles were thus mostly exported to Canada and Australia, and as a result, appeared in television shows or movies that were filmed in those countries. Listed here are two of the variants seen in Canadian or Australian television (the Target and the Match versions). If it were not for Canadian or Australian movie armorers, most of us in the U.S. would never have known these variants existed., 327139=(1970 - Present), 24890=It is noteworthy that the U.S. government had a ban on all weapons imported from Warsaw Pact nations during the Cold War years (1947-1989). Communist nations which were not part of the Warsaw pact, such as Yugoslavia and Mainland China, were allowed to negotiate trade agreements with the U.S., thus the influx of Chinese AK type rifles and Yugo AKs (Zastava). The Maadi ARMs (the US version of the MISR) were allowed because Egypt was never a Communist country nor a member of the Warsaw Pact. But, as a result of this, virtually no U.S. movie has a real original AK-47 prior to a certain date. The exceptions are, custom build ups after the mid 1990s when original AK-47 rifle kits were available (as was done on We Were Soldiers, using original blueprints and US-made milled receivers), and movies filmed overseas where foreign movie armorers had no such restrictions. This is particularly true for films made in Israel and some parts of Europe. This is not the case now, with the current crop of films made outside the U.S., mostly in the newly democratic Eastern European nations (Bulgaria, Hungary, Romania, Poland, Czech Republic, etc.) However, Russia has firmly blocked the export of their old AK-47 surplus guns outside of the country, having distributed most of them to client nations and guerrillas throughout the world in the previous five decades. So the AK-47 one 'thinks' one sees may very well be a Poly Technologies Legend series AK (from China) or another AK Variant., 396560=The Hungarian FEG NGM-81 was a domestic rifle based on the indigenous Hungarian AK74, but built for export. For that reason, it was chambered in 5.56x45mm, though some 5.45x39mm variants exist. The Rifle was built between 1981-1990. The original rifles were only offered with a fixed butt and a wooden fore-end, made in the same Hungarian Blonde wood as the SA-85M export rifle. The folding stock version of this rifle was called the NGV-81. Due to Cold War prohibitions against Combloc weapons within the U.S. (except those exempted by treaty), the vast majority of the export NGM-81 rifles went to Europe and Africa. Most versions omit the large PKM style flash hider, opting instead for the standard AK-47 style muzzle nut. The FEG NGM rifle was noteworthy in that it kept the AK-47/Type 56 style of gas block system, with the gas relief holes in the gas tube, not the gas block (as is the case with the AKM and later style rifles). The Gas block itself and the front sight is the AKM style in shape and the rifle takes a Hungarian stamped metal 5.56mm magazine similar but not identical to the Wieger style AK magazine.}",
    "lastModified": "Thu, 30 Jul 2015 15:18:08 GMT",
    "textBeforeTable": "Film The AK-47 and variants can be seen in the following films, television series, video games, and anime used by the following actors: Fire Modes: Semi-Auto/Full-Auto Feed System: 10, 20, 30, 40, 75 or 100-round box/drum magazine Muzzle velocity: 2,350 ft/s (715 m/s) Barrel length: 16.4 in (41.6 cm) Length: 34.3 in (87 cm) Weight: 11.5 lbs (5.2 kg) Caliber: 7.62x39mm Type: Assault Rifle (1949 - Present) Specifications NOTE: while the English-speaking tradition is to call the Russian 7.62x39 assault rifle by Mikhail Kalashnikov \"AK-47\", its official nomenclature is in fact was always AK\\AKM, withouth 47 added to it. The AK-74 and all its variants, though, include the year in its original naming. It is noteworthy that the U.S. government had a ban on all weapons imported from Warsaw Pact nations during the Cold War years (1947-1989). Communist nations which were not part of the Warsaw pact, such as Yugoslavia and Mainland China, were allowed to negotiate trade agreements with the U.S., thus the influx of Chinese AK type rifles and Yugo AKs (Zastava). The Maadi ARMs (the US version of the MISR) were allowed because Egypt was never a Communist country nor a member of the Warsaw Pact. But, as a result of this,",
    "textAfterTable": "Hamilton: I nationens intresse Russian smugglers 2012 Hamilton: I nationens intresse Somali soldiers/prison guards 2012 Hamilton: I nationens intresse Ethiopian terrorists 2012 Safe House Hitmen 2012 Guardian Angel (Schutzengel) several assailants M4-style stocks, AKM-style flash hider and synthetic hand guards 2012 Red State Jennifer Schwalbach Smith Esther continuity error 2011 X-Men: First Class Soviet soldiers 2011 Elephant White several versions in weapons caches 2010 Balibo Indonesian soldiers 2009 Kandahar Break Shaun Dooley Richard 2009 Kandahar Break Anti-Taliban fighters 2009 Vengeance",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}