{
    "relation": [
        [
            "Eric Zagala",
            "Allyson Zavala",
            "Kaya Zekioglu",
            "Johnny Zhang",
            "Nerissa Zhang",
            "Steven Zhong",
            "Jake Zidow",
            "Adam Zimmerman",
            "Elizabeth Zitzer",
            "Olivia Zuffi"
        ],
        [
            "Rocio Zamora",
            "Maira Zavala",
            "Marissa Zeller",
            "Junyong Zhang",
            "Yingdong Zhang",
            "Sherie Zhou",
            "Lulu Zilinskas",
            "Shahar Zimmerman",
            "Eleeka Zolfaghari",
            "John Zwart"
        ],
        [
            "Anna Zaret",
            "Victoria Zdeb",
            "Kristen Zerda-Andrews",
            "Lucy Zhang",
            "Jessica Zhen",
            "Stephanie Zhou",
            "Megan Ziman",
            "Nicholas Zinter",
            "Daniella Zuccolotto",
            ""
        ]
    ],
    "pageTitle": "Dean's Honors List - Spring Quarter 2012",
    "title": "",
    "url": "http://honors.ucsc.edu/honors-programs/deans-honors/spring-2012.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00259-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 119950919,
    "recordOffset": 119919378,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{143819=UC Santa Cruz, 1156 High Street, Santa Cruz, Ca 95064 ©2015 Regents of the University of California. All Rights Reserved. 128.114.113.115, 2920=Home / Honors Programs / Dean's Honors List: Current / Spring Quarter 2012}",
    "textBeforeTable": "Z Chantale Yunt Andrew Yueh Alisa Yuasa Tianyao Yuan Lucy Yu Lihui Yu John Yu Anna Yu Lindsay Young Lauren Young Jenee Young Carol Young Ashley Young Alyssa Young Jisu Youn Marinel Yoro Victoria York Diana Yip Michael Yi Justin Yeo Ryan Yenovkian Iden Yekan Jessica Yee Gregory Yee Brittany Yee Adriana Yedidsion Julia Yeager Camryn Yaros Michael Yarnell Jerry Yao Henry Yao Brandon Yang Audrey Yang Jacob Yanez Tammy Yan Parker Yamasaki Andre Yahyavi Daniel Yabrove Y Manqi Xu Mailor Xiong Kang Xiong Ming Xi X Curnesha Wyatt Peter Wu Naomi Wu Jiayi Wu Gary Wu Ashley Wu Claire Wright-Coleman Trevor Wright Sloane Wright Brandy Wright Max Worrin Leesann Worley Danielle Woolcott Kaleigh Woods Emily Woods Gwendolyn Woodhead Alonna Woodfin Anna Woodburn Evyn Woodall Sarah Wood Dillon Wood David Woo",
    "textAfterTable": "In accordance with the Santa Cruz Academic Senate regulations, students qualify for the Dean's Honors List for a given term when they have completed a minimum of 15 units of which 10 are units for letter grade with a grade point average in the range required for University Honors at graduation for the current academic year (i.e. the top 15% of their academic group). Please visit the Honors frequently asked questions http://registrar.ucsc.edu/faqs/students/honors/index.html and contact us at ugrdhnrs@ucsc.edu if you have questions about Dean's Honors lists. Honors Programs Overview Dean's Honors List: Current Winter Quarter 2015 Fall Quarter 2014 Spring Quarter 2014 Winter Quarter 2014 Fall Quarter 2013 Spring Quarter 2013 Winter Quarter 2013 Fall Quarter 2012 Spring Quarter 2012 Winter Quarter 2012 Fall Quarter 2011 Spring Quarter 2011 Winter Quarter 2011 Archive: 2008-2010 First-Year Honors Honors Societies Intensive Programs of Study CONTACT US GIVING Feedback UC Santa Cruz, 1156 High Street, Santa Cruz, Ca 95064 ©2015 Regents of the University of California. All Rights Reserved. 128.114.113.115 Privacy Policy and Terms of Use",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}