{
    "relation": [
        [
            "List",
            "FJP",
            "Al-Nour",
            "Al-Wafd",
            "Arab Egyptian Union",
            "New Independents",
            "Egyptian Bloc",
            "Egyptian Citizen",
            "Al-Wasat",
            "Nasserist",
            "Democratic Peace",
            "National Party of Egypt",
            "Al-Ghad",
            "Reform and Development",
            "Revolution Continues",
            "Egyptian Tahrir",
            "Conservatives",
            "Modern Egypt",
            "Al-Adl",
            "Egyptian Revolution",
            "Total"
        ],
        [
            "Votes",
            "425,680",
            "249,119",
            "167,101",
            "58,107",
            "46,753",
            "45,680",
            "40,328",
            "36,045",
            "26,792",
            "17,284",
            "15,954",
            "11,993",
            "11,069",
            "10,803",
            "9,496",
            "8,696",
            "7,030",
            "6,066",
            "3,879",
            "1,197,875"
        ],
        [
            "%Votes",
            "35.54",
            "20.80",
            "13.95",
            "4.85",
            "3.90",
            "3.81",
            "3.37",
            "3.01",
            "2.24",
            "1.44",
            "1.33",
            "1.00",
            "0.92",
            "0.90",
            "0.79",
            "0.73",
            "0.59",
            "0.51",
            "0.32",
            "100.00"
        ],
        [
            "Seats",
            "4",
            "2",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "10"
        ]
    ],
    "pageTitle": "Egyptian Elections: Preliminary Results [UPDATED]",
    "title": "",
    "url": "http://www.jadaliyya.com/pages/index/3331/egyptian-elections_preliminary-results_updated",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00317-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 515179687,
    "recordOffset": 515120017,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{192259=Nasr Al-Hafi (FJP) won the professional seat and Gamal Shehata (FJP) won the worker/farmer seat, according to Al-Masry Al-Youm. (3:47 pm, Jan 5) , 461308=Mohamed Shaker Al-Omda (independent/former Al-Wafd), Abdel Razeq Hasan (FJP), Faragallah Gadallah Ahmad (Al-Nour), and Mohamed Abul Ela Hussein (FJP) will enter into a runoff, according to Tahrir News. (4:13 am, Dec 17), 149198=Sameh Abdel Hamid Shawqi Amer (FJP) and Abdel Mohsen Kamel Abul Kheir (independent/former NDP) will enter into a runoff for the professional seat, whereas Yehia Al-Misiri (FJP) and Hamed Galal Gahga (independent/former NDP) will enter into a runoff for the worker/farmer seat, according to Al-Masry Al-Youm. (3:50 pm, Jan 5)    , 447616=Mohamed Abdel Rahman (FJP/professional), Adlan Morsy (Al-Nour/worker),  Khaled Abul Gihad (independent/worker), Afifi Al-Sherif (independent/former NDP/worker) will enter into a runoff next week, according to Al-Masry Al-Youm. (10:27 pm, Dec 16), 303109=Unofficial final vote-count indicates that Nihad Al-Qasem (FJP) and Mohamed Rabie Abdel Hadi (Al-Nour) will enter into a runoff for the professional seat, while Abdel Qader Abdel Wahhab (FJP) and Ahmad Mokhtar (independent/former NDP) will enter into a runoff for the worker/farmer seat, according to Al-Masry Al-Youm. (1:10 pm, Dec 16) , 214984=Hisham Hanafi Al-Qadi (FJP) and Sabry Yousef Dawood (independent/former NDP) will enter a runoff for the worker/farmer seat, whereas Essam Mohamed Aly (Al-Nour) and Mohamed Younes (independent) will faceoff for the professional seat, according to Al-Masry Al-Youm. (4:07 pm, Jan 5), 476351=Election Update Alert (3:29 am, Dec. 7): Hisham Soliman (Independent/former NDP/W) won the worker/farmer seat. (Al-Masry Al-Youm), 489734=District #9 (single winner races)           Votes (% of valid ballots)            Result Ramadan Omar (FJP/W)                                     431,639 (71%)                     Winner Mostafa Bakri (Independent/P)                            376,162 (62%)                   Winner Valid Ballots: 608,503, 550453=Election Update Alert (3:14 am, Dec. 7): Abdel Aziz Khalaf (FJP) won the professional race and Ahmad Hassan (Al-Nour) won the worker/farmer race. (Tahrir News), 323771=Tahrir News reports that Mohamed Anwar Al-Sadat (Reform and Development) has won the professional seat, beating Ismail Aly (FJP). Said Al-Azab (FJP) and Mahmoud Qabil (Al-Nour) will likely enter into a runoff for the worker/farmer seat. (9:34 pm, Dec16) , 273063=Amr Al-Shoubki (Al-Adl) and Amr Darrag (FJP) will enter into a runoff for the professional seat, while Ayman Sadeq (FJP) and Essam Bahy Eddin (independent/Egyptian Bloc-endorsed) will enter into a runoff for the the worker/farmer seat, according to Al-Masry Al-Youm. (2:02 am, Dec 18), 75533=*Includes all but Cairo's party-list district #1 (Al-Sahel voters are scheduled to re-vote on 10-11 January 2012 due to a court ruling annulling the initial results)., 190559=Mohsen Rady (FJP/P), Hany Gad Faheem Gad (FJP/F), Aly Wanees (Al-Nour/F) and Ramy Magdy Berbish (independent/F) will enter into a runoff for the district's two seats, according to Youm7. (3:48 am, Jan 8) , 547508=In response to a court order, the Higher Elections Commission announced that election results for Assiut district #2 were annulled with respect to single-winner race votes. A re-vote will be convened for that district on 10-11 January with runoff races scheduled for 17-18 January. Thus the above results for district #2 are not final., 460337=RUNOFF WINNERS: Mohamed Shaker Al-Omda (independent/former Al-Wafd), Faragallah Gadallah Ahmad (Al-Nour) (12:26 am, Dec 24), 542557=Election Update Alert (3:14 am, Dec. 7): Samir Khashaba (FJP) won the professional seat, and Bayomi Ismail (Building & Devlopmt) won the worker/farmer seat. (Tahrir News), 265886=Mohamed Ibrahim (FJP) and Mohamed Eid Abu-Karim (Al-Nour) will enter into a runoff for the professional seat, while Khattab Sayed Khattab (FJP) and Hamdy Haroun (independent/former NDP) will enter into a runoff race for the worker/farmer seat, according to Tahrir News. (7:56 pm, Dec16) , 376547=Hisham Al-Souly (FJP) and Mohamed Ghannam Ahmad (independent) will enter into a runoff for the professional seat, while Mohamed Al-Hawary (Al-Nour) and Issa Zeen Al-Abadeen (independent/sponsored by former NDP figures) will enter into a runoff for the worker/farmer seat, according to Al-Masry Al-Youm  (1:38 am, Dec18), 295287=Unofficial final vote-count indicates that Gaber Mansour (FJP) and Amer Bassel (Al-Nour) will enter into a runoff race for the professional seat, whereas Younis Sarhan (FJP) and Nagm Al-Din Fadel (Al-Nour) will enter into a runoff for the worker/farmer seat, according to Al-Masry Al-Youm. (1:10 pm, Dec 16), 418185=Abdel Hamid Shukr (FJP) and Hamed Al-Tahhan (Al-Nour) will enter into a runoff for the worker/farmer seat, while Abdallah Saad (Al-Nour) and Adel Makram (FJP) will enter into a runoff for the professional seat, according to Al-Wafd. (3:25 am, Dec 17) , 495997=Election Update Alert (3:24 am, Dec. 7): Al-Mohamedi Sayed Ahmed (FJP) won the worker/farmer seat and Mohamed Al-Khodeiri (FJP- sponsored) won the professional seat. (Tahrir News)., 164957=Aly Omran (FJP) and Aly Abdel Hamid Abdel Gawad (independent) will enter into a runoff for the professional seat, whereas Gomaa Yousef Kafafy (FJP) and Ahmed Abdel Ghani Al-Qishiri (independent) will enter into a runoff for the worker/farmer seat, according to Al-Wafd. (3:25 am, Jan 7), 422789=Unofficial final vote-count indicates that Saad Abu Taleb (FJP) and Abdel Salam Ottman (Al-Nour) will enter into a runoff for the professional seat, while Ahmad Khater (FJP) and Marwan Khalil (Al-Nour) will enter into a runoff for the worker/farmer seat, according to Al-Masry Al-Youm. (10:34 pm, Dec 16) , 356605=According to Tahrir News, Sayed Nageeda (FJP) and Ahmad Talal Mohamed Mukhtar (Egyptian Bloc-sponored) will enter into a runoff for the professional seat.  Saleh Aly (FJP) and Awadallah Al-Moselmy (Al-Nour) will enter into a runoff for the worker/farmer seat (2:43 am, Dec 17)  , 225678=Othman Al-Qataani (Al-Nour) won the professional seat, whereas Mansour Qawiyya Anoun (Al-Nour) and Rezqallah Galy Nasrallah Nouh (independent) will enter into a runoff for the worker/farmer race, according to Youm7. (4:09 am, Jan 8), 167577=Mohamed Al-Basel (FJP/P), Alaa Eddin Abdel Fattah (Al-Nour/F), Hegazy Mohamed Haroun (Al-Nour//W) and Hamdy Khalifa Abdel-Naby (FJP/W) will enter into a runoff for the district's two seats, according to Al-Wafd. (3:25 am, Jan 7), 507825=Election Update Alert (3:00 am, Dec. 7): Aly Al-Dai (FJP) won the professional seat and Mohamed Abu-Mousa (FJP) won the worker/farmer seat., 457028=Raafat Abul Kheir (independent/former NDP) and Heshmat Bekheit (FJP) will enter into a runoff next week for the professional seat, and Yousef Abu-Hamoudy (independent/former NDP) and Fathy Rashwan (independent) will enter into a runoff for the worker/farmer seat, according to Egynews. (2:15 am, Dec 16), 481835=Election Update Alert (3:29 am, Dec. 7): Mohamed Abu-Hamed (Egyptian Bloc) won the professional seat and Mostafa Farghali (FJP) won the worker/farmer seat. (Tahrir News), 46198=Estimated Seat Breakdown (as of 9 January 2012), 493123=Election Update Alert (3:24 am, Dec. 7): Mostafa Mohamed (FJP) won the worker/farmer race and Hosni Dowidar (FJP-sponsored) won the professional race. (Tahrir News), 450800=Unofficial final vote-count shows that Mohamed Mosaad (FJP) and Nour Abdel Razeq (Egyptian Bloc) will enter into a runoff for the professional seat, whereas Lahzy Ahmad (Al-Nour) and Ahmad Hasballah (independent) will enter into a runoff for the worker/farmer seat, according to Al-Masry Al-Youm. (11:36 pm, Dec 16), 408297=Unofficial final vote-count indicates that Mahmoud Abdel Gawwad (FJP) and Mahmoud Heeba (Al-Nour) will enter into a runoff race for the professional seat, while Yaser Abdel Rafe (FJP) and Sherif Al-Halawany (Al-Nour) will enter into a runoff for the worker/farmer race, according to Masrawy. (3:31 am, Dec 17) , 511100=Election Update Alert (3:00 am, Dec. 7): Mohamed Al-Falahgy (FJP) won the professional seat and Omran Mogahed (independent, former Al-Wafd) won the worker/farmer seat., 467805=In response to a court order, the Higher Elections Commission announced on 5 December that election results for \"Al-Sahel\" district in Cairo (district #1) were annuled. A re-vote will be convened for that district on 10-11 January with runoff races scheduled for 17-18 January., 539196=Election Update Alert (2:41 am, Dec. 7): Abdel Baset Quota (Egyptian Citizen) won the worker/farmer seat, and Mohamed Katamish (FJP) won the professional seat, according to Youm7., 521632=Election Update Alert (6:10 am, Dec. 7):  Youm7 reports that Mohamed Abdel Aleem (Al-Wafd) won the worker/farmer seat, and that Yousef Al-Badri (National Party of Egypt) won the professional race. Earlier reports from Tahrir News had indicated that Mohamed Al-Helisy (FJP) won the professional race., 77518=*****Does not include forty-five seats that will be determined through stage #3 runoff races scheduled for 10-11 January., 281092=Mahmoud Mohamed Amer (FJP) will enter into a runoff with Emad Abdel-Naby (Al-Nour) for the professional seat. Mostafa Gaafar Soliman (independent/former NDP) will enter into a runoff with Yousef Abdel Naby (Egyptian Bloc-endorsed) for the worker/farmer seat, according to A-Masry Al-Youm. (2:08 am, Dec 18) Khaled Al-Telemma (Revolution Continues Alliance) was eliminated in the first round., 146330=Hamdy Al-Fakharani (independent) and Abdel-Haleem Helal (FJP) will enter into a runoff for the professional seat, while Mohamed Tawfiq (FJP) and Neemat Qamar (independent/former NDP) will enter into a runoff for the worker/farmer seat, according to Al-Wafd. (3:41 am, Jan 7)    , 514820=Election Update Alert (4:18 am, Dec. 7): Mohamed Abdel Meguid (Al-Nour) won the professional seat and Mohamed Ibrahim Mansour (Al-Nour)  won the worker/farmer seat., 413008=Unofficial final vote-count shows that Masry Abu-Keshek (FJP) and Bashir Abul Kheir (Al-Nour) will enter into a runoff for the worker/farmer seat, while Kamel Al-Deeb (Al-Nour) and Ahmad Zoheer (FJP) will enter into a runoff for the professional seat, according to Al-Wafd. (3:25 am, Dec 17), 503958=Election Update Alert (4:05 am, Dec. 7): Hamdy Hassan (FJP) won the professional seat, and Mahmoud Mohamed (FJP) won the worker/farmer seat. (Tahrir News)., 551957=In response to a court order, the Higher Elections Commission announced that election results for Assiut district #3 were annulled with respect to single-winner race votes. A re-vote will be convened for that district on 10-11 January with runoff races scheduled for 17-18 January. Thus the above results for district #3 are not final., 250967=Mohamed Farrag (Al-Nour) and Abdo Abdel Razeq (Independent) will enter into a runoff for the professional seat. Ghareeb Hassan (independent) and Farag Breeq (Egyptian Bloc) will enter into a runoff for the worker/farmer race, according to Al-Masry Al-Youm. (4:22 pm, Jan 5), 194360=Ahmed Diab (FJP) will enter into a runoff with Ashraf Al-Labban (Al-Nour) for the professional seat, whereas Sayyed Al-Qadi (FJP) will enter into a runoff with either Hussein Al-Ashmawy (independent/former NDP), according to Youm7. (3:48 am, Jan 8)    , 77072=****Does not include Sharqiya's districts #5 and #2, which are scheduled for a re-vote on 10-11 January 2012 due to a court ruling annulling the initial results. \"IC\" stands for individual-candidacy races., 464007=A more detailed breakdown of stage #1 results (by district and governorate) is displayed below. It should be noted, however, that results for some stage #1 races remain pending. In response to a court order, the Higher Elections Commission announced on 5 December that election results for \"Al-Sahel\" district in Cairo (party-list district #1 and single-winner races district #1) were annulled. A re-vote will be convened for that district on 10-11 January with runoff races scheduled for 17-18 January. A re-vote is also scheduled for single winner races in Assiut districts #2 and #3, as well as Alexandria district #3. The total number of seats up for grabs in stage #1 is 166, 16 of which remain pending due to scheduled re-votes., 76640=***Does not include Aswan party-list race, which is scheduled for a re-vote on 10-11 January 2012 due to a court ruling annulling the initial results., 529162=Election Update Alert (3:02 am, Dec. 7): Sayed Gabr (FJP) and  Osama Yahya (FJP) won the worker/farmer and professional seats, respectively. (Al-Masry Al-Youm), 118761=Ibrahim Abu-Auf (FJP) will enter into a runoff with Al-Doudi Mohamed Mohamed Mehleb (independent) for the professional seat, whereas Mohamed Nabih Hassaneen (independent) and Khalid Kamel Al-Haddad (independent) will enter into a runoff for the worker/farmer seat, according to Ahram Online. (5:41 pm, Jan 6)., 532562=Election Update Alert (4:22 am, Dec. 7): Gamal Hassan (FJP) won the professional seat, and Fawzi Abdel Aziz (FJP) won the worker/farmer seat. (Youm7), 171081=Mosharraf Ahmad Mohamed (Al-Nour) and Khaled Amr Ismail (FJP) will enter into a runoff for the professional seat, whereas Ahmad Hassan Sayed (Al-Nour) and Emil Habib (Egyptian Bloc) will enter into a runoff for the worker/farmer seat, according to Al-Wafd. (3:25 am, Jan 7), 545993=Election Update Alert (3:14 am, Dec. 7): Mohamed Madar (FJP) won the worker/farmer seat and Mohamed Salama Bakr (FJP) won the professional seat. (Tahrir News), 360932=Former Minister of Social Solidarity Aly Meselhy (independent/former NDP) will enter into a runoff with Mohamed Fayad (FJP) for the professional seat, while Ibrahim Saleem (FJP) and Aly Gouda Keshk (independent) will enter into a runoff for the worker/farmer seat, according to Tahrir News. (4:06 am, Dec 17) , 212761=Ahmed Al-Sayed Al-Sagheer (FJP) and Abdel Aaty Abu-Zeid (independent) will enter into a runoff for the professional seat, whereas Adel Mohamed Ebeid (endorsed by Islamic Group, which is allied with Al-Nour) and Hamdy Mohamed Hassan (independent) will enter into a runoff for the worker/farmer seat, according to Al-Masry Al-Youm. (6:23 pm, Jan 5), 319403=According to Al-Masry Al-Youm, Saad Hussein (FJP) and Qadry Gaafar (Egyptian Bloc/former NDP) will enter into a runoff for the worker/farmer seat. Osama Abdel Monsef (Al-Nour) and Helmy Bakr (FJP) will enter into a runoff for the professional seat (7:33 pm, Dec16), 473406=Election Update Alert (3:29 am, Dec. 7): Mustafa Al-Naggar (Al-Adl) won the professional seat, and Amr Auda (Independent) won the worker/farmer race. (Al-Masry Al-Youm), 174948=Medhat Abdel Gabber (Al-Nour) and Ahmed Farghally Mohamed Mounir (independent) will enter into a runoff for the professional seat, whereas Ahmed Yousef Touny (Al-Nour) and Riyad Abdel Sattar (independent/former NDP) will enter into a runoff for the worker/farmer seat, according to Al-Wafd. (3:25 am, Jan 7), 217146=Abdel Reheem Al-Ghul (independent/former NDP) and Fathy Qandil (independent/former NDP) will enter into a runoff for the worker/farmer seat, whereas Khaled Khalafallah (independent/former NDP) and Ahmed Al-Dabee (Al-Nour) will enter into a runoff for the professional seat, according to Al-Ahram (3:40 pm, Jan 6), 465250=In response to a court order, the Higher Elections Commission announced that election results for \"Al-Sahel\" district in Cairo (district #1) were annulled with respect to both the party-list votes and single-winner race votes. A re-vote will be convened for that district on 10-11 January with runoff races scheduled for 17-18 January. Thus the above results for party-list district #1 are not final., 40279=[This entry will be regularly updated. Last update: 6:50 pm, Monday, January 9, Egypt time], 121219=Khaled Al-Deeb (FJP) and Mortada Mansour (independent/formerly NDP allied) will enter into a runoff for the professional seat, whereas Al-Sayed Mansour (FJP, Labor Party) and Taher Al-Ghafeer (independent) will enter into a runoff for the worker/farmer seat, according to Al-Masry Al-Youm. (6:20 pm, Jan 5), 365554=Scheduled for a re-vote on 10-11 January 2012 due to a court ruling annulling the initial results, 459217=Scheduled for a re-vote on 10-11 January 2012 due to a court ruling annulling the initial results, 485233=Election Update Alert (3:29 am, Dec. 7): Khalid Mahmoud (FJP) won the professional seat, and Nasir Othamn (FJP) won the worker/farmer seat., 501476=In response to a court order, the Higher Elections Commission announced that election results for Alexandria district #3 were annulled with respect to single-winner race votes. A re-vote will be convened for that district on 10-11 January with runoff races scheduled for 17-18 January. Thus the above results for district #3 are not final., 363581=Safwat Saweilem (FJP) and Sayed Abdel Salam (Al-Nour) will enter into a runoff for the professional seat, while Mohamed Awad Shawish (FJP) and Essam Mohamed Al-Sayed will enter into a runoff for the worker/farmer seat, according to Tahrir News. (4:00 am, Dec 17) , 404548=Unofficial final voe-count shows that Osama Soliman (FJP) and Ibrahim Ghallab (Al-Nour) wil enter into a runoff for the professional seat, while Tarek Saleh (FJP) and Mohamed Al-Rikabi (Al-Nour-sponsored) will enter into a runoff for the worker/farmer seat, according to Al-Masry Al-Youm. (10:34 pm, Dec 16) , 139094=Al-Sayed Askar (FJP) has won the worker/farmer seat, whereas Medhat Meshaal (﻿Al-Nour) and Mohamed Al-Fiqi (Al-Wafd) will enter into a runoff for the professional seat, according to Youm7. (3:48 am, Jan 8), 478906=Election Update Alert (4:26 am, Dec. 7): Ashraf Saad (FJP)  won the worker/farmer seat, and Sayed Gadallah (FJP) won the professional seat. (Tahrir News), 243451=Abdel Rahman Al-Shorbagy (FJP/P), Aly Salman (independent/FJP-endorsed/W), Aly Yahya Al-Ghul (independent/F) is leading Mohamed Sayed Al-Kashef (independent/W), according to Al-Masry Al-Youm. (4:20 pm, Jan 6)., 107982=Yousry Hany (﻿FJP) won the professional seat, whereas Tarek Qutb (FJP) and Waheed Fouda (independent) are leading the vote-count for the worker/farmer seat, according to Youm7. (3:58 pm, Jan 8)     , 43037=Background: On 3 and 4 January, Egyptians completed voting in nine governorates. The vote is part of the last of three stages of elections for the People’s Assembly, the parliament’s lower house. Each voting stage involves polling in nine governorates (out of total 27 governorates). According to Egypt’s elections law, two-thirds of the parliamentary seats will be allocated through party list races, while one-third of the seats are allocated through concurrent single-winner races. After each initial vote, run-off elections are held a week later between front-runners in single-winner races where none of the candidates got 50%+ of the total vote. Run-offs for stage #3 are scheduled on 10 and 11 January. The total number of seats up for grabs in stage #3 voting is 150 seats (100 party-list races and 50 individual-candidacy seats). , 387265=Tahrir News reports that Mohamed Adel (Building and Development) and Abbas Abdel Aziz (FJP) will enter into a runoff for the professional seat, while, Abdel Hamid Kamal (Al-Tagammu) and Hani Nour Al-Din (Al-Nour) will go into a runoff for the worker/farmer seat. (4:53 pm, Dec 16), 505935=District #1 (single winner races)        Votes (% of valid ballots)               Result Mohamed Al-Taeel (Al-Nour/W)                          89,947 (34%)                      Runoff Mohamed Abu-Mousa (FJP/W)                           84,062 (32%)                      Runoff Aly Al-Dai (FJP/P)                                               125,734 (48%)                       Runoff Nagy Sheta (Al-Nour/P)                                       50,796 (19%)                       Runoff Valid Ballots: 262099, 488296=Election Update Alert (3:29 am, Dec. 7): Yousri Bayoumi (FJP) won the professional seat, and Khalid Hanafi (FJP) won the worker/farmer seat. (Tahrir News), 557672=Election Update Alert (3:14 am, Dec. 7): Abdul Mawgood Dardeer (FJP) won the professional seat, and Khaled Megahed (FJP-sponsored & Former NDP) won the worker/farmer seat., 142689=According to Al-Masry Al-Youm, Alam Al-Deen Al-Sekhawy (FJP) and Aly Abdel Fattah Negm (﻿Al-Nour) will enter into a runoff for the worker/farmer seat, whereas Salah Al-Hasawy (independent/former NDP) and Mahmoud Mohdeda (FJP) will enter into a runoff for the professional seat, according to Al-Masry Al-Youm.  (3:51 pm, Jan 6), 525865=Election Update Alert (2:59 am, Dec. 7): Hamdy Taha (FJP) and Adel Ismail Abdul Hamid (FJP) won the worker/farmer and professional races, respectively. (Tahrir News), 76037=**Includes all but two races in Cairo’s district #1, two races in Alexandria's district #3, two races in Assiut district #2 and two races in Assiut's district #3 (scheduled for a re-vote on 10-11 January 2012 due to a court ruling annulling the initial results). \"IC\" stands for individual-candidacy races., 454281=Mohamed Al-Gebaly (independent/former NDP) and Gaber Al-Gahlan (﻿Al-Nour) will enter into a runoff for the professional seat, while Herqal Wafqi (independent/former NDP) and Faysal Al-Shaybani (independent) will enter into a runoff for the worker/farmer seat, according to Tahrir News. (6:40 pm, Dec 16), 114764=Emad Shams (FJP) will enter into a runoff with Ahmed Ismail Shoukry (Al-Adl) will enter into a runoff for the professional seat, whereas Abd Al-Hamid Eissa (FJP) and Soleiman Hamed Soleiman (Al-Nour) will enter into a runoff for the worker/farmer seat, according to Youm7. (3:58 pm, Jan 8)   , 123438=Al-Sayed Al-Adawy (FJP/P), Abdel Qadir Ibrahim Abdel Rahman (Al-Nour/F), Ramadan Al-Imam (FJP/W), and Osama Abdel Aaty (independent/former NDP/F) will enter into a runoff for the district's two seats, according to Youm7. (3:58 pm, Jan 8)   , 499567=Election Update Alert (4:05 am, Dec. 7): Saber Abul Futtuh (FJP) won the worker/farmer seat, and Mohamed Attiya (FJP) won the professional seat. (Tahrir News)., 470069=Election Update Alert (3:29 am, Dec. 7): Amr Zaki (FJP) won the professional seat, and Yasser Abdallah (FJP) won the worker/farmer seat. (Tahrir News), 233944=Mohamed Abdel Meguid (FJP) and Sayed Al-Yamani (Al-Nour) will enter into a runoff for the professional seat, whereas Alaa Abdel Latif (Al-Nour) and Abd Moneim Ismail (FJP) will enter into a runoff for the worker/farmer seat, according to Al-Masry Al-Youm. (4:15 pm, Jan 6), 151647=Ibrahim Zakariya Younis (FJP) and Abdallah Shaheen (﻿Al-Nour) will enter into a runoff for the professional seat, whereas Ahmed Al-Alfy (Al-Nour) and Gamal Shehata (independent) wil enter into a runoff for the worker/farmer seat, according to Al-Masry Al-Youm.  (3:51 pm, Jan 6), 518340=Election Update Alert (2:48 am, Dec. 7): Mohamed Amer (FJP) and Ashraf Al-Saeed (FJP) won the professional and worker/farmer seats, respectively. (Tahrir News), 530647=District #3 (single winner races)           Votes (% of valid ballots)              Result Fawzi Abdel Aziz (FJP/F)                                    107,381 (39%)                        Runoff Omar Al-Zeiny (Al-Nour/F)                                   85,301 (31%)                         Runoff Gamal Hassan (FJP/P)                                       107,422 (39%)                        Runoff Mohamed Ibrahim (Al-Nour/P)                            67,940 (24%)                        Runoff Valid Ballots: 277,772, 276813=Abdel Salam Bashandi (FJP) and Ismail Al-Edami (Al-Nour) will enter into a runoff for the worker/farmer race, according to Ahram Online. Mohamed Al-Sawy, former minister of culture and the founder of Al-Hadara Party (a member of the FJP-led Democratic Alliance for Egypt)  will enter into a runoff with Mohamed Mahmoud Mohamed (Al-Nour) for the professional seat. Candidates who were eliminated in the first round include Islam Lotfy of the Egyptian Current Party (a member of the Revolution Continues Alliance) and a member of the Revolution’s Youth Coalition.  (3:38 pm, Dec 18) , 269398=Tahrir News reports that Gamal Al-Ashry of the FJP and Mohamed Fouad (Egyptian Bloc) will enter into a runoff for the professional seat. Sahfiq Al-Gendy (Al-Nour) and Hassan Al-Bareeq (FJP) will enter into a runoff for the worker/farmer seat. (3:29 am, Dec18), 443464=Essam Al-Shawayekh (independent/Egyptian Bloc-endorsed) and Ahmad Wael Al-Moshanab (independent/former NDP) will enter into a runoff for the worker/farmer seat, while Mostafa Galous (FJP) and Waleed Ibrahim Abdel-Awal (Al-Nour) will enter into a runoff for the professional seat, according to Al-Wafd. (3:18 am, Dec 17) , 463508=Stage #1 recap: On 28 and 29 November, Egyptians had completed voting in nine governorates, including Cairo and Alexandria. Based on official results released by the Higher Elections Commission, as well as media reporting on the affiliations of various candidates, the table above summarizes the election results across various stage., 554444=Election Update Alert (3:14 am, Dec. 7): Hassan Abdel Aal (FJP) won the professional seat and Amer Abd Al-Reheem (Al-Nour) won the worker/farmer seat. (Tahrir News) , 299155=Unofficial final vote-count indicates that Mohamed Shaker (FJP) and Abdel Aziz Mohamadeen (independent) will enter into a runoff race for the professional seat, while Abdel Hakim Masoud (Al-Nour) and Abdel Azeem Abu-Gomaa (FJP) will faceoff next week in the worker/farmer seat runoff, according to Al-Masry Al-Youm. (1:10 pm, Dec 16)  , 110724=Ali Qatamesh (Al-Nour) and Hassan Gomaa (FJP) will enter into a runoff for the professional seat, whereas Saad Al-Halougy (FJP) and Mohamed Ismail (Al-Nour) will enter into a runoff for the worker/farmer seat, according to Ahram Online. (5:41 pm, Jan 6)., 600721=©2010-2015 by the Arab Studies Institute. All Rights Reserved. info@jadaliyya.com site by concepcion design, 536053=Election Update Alert (2:54 am, Dec. 7): Al-Badri Farghali (Al-Tagammu) won the worker/farmer race. (Al-Masry Al-Youm)}",
    "textBeforeTable": "District #1 (list)—final Single-winner [Districts #1-5 (2 each)] Seat Breakdown: Party list [District #1 (10); District #2 (10)] Giza (30 seats) Stage #2 Results      Mohamed Farrag (Al-Nour) and Abdo Abdel Razeq (Independent) will enter into a runoff for the professional seat. Ghareeb Hassan (independent) and Farag Breeq (Egyptian Bloc) will enter into a runoff for the worker/farmer race, according to Al-Masry Al-Youm. (4:22 pm, Jan 5) RUNOFF RESULTS: Results annulled in response to a court order. District #1 (single winner races)—final (unofficial) 4",
    "textAfterTable": "0 Democratic Peace 34,249 2.37 0 Freedom 25,875 1.79 0 Egypt Revolution 21,581 1.49 0 Reform and Development 13,938 0.96 0 Egyptian Revolution 11,166 0.77 0 Conservatives 4,283 0.30 0 Total 1,445,699 100.00 10 District #1 (single winner races)—final (unofficial) RUNOFF WINNERS: Khattab Sayed Khattab (FJP) & Mohamed Ibrahim (",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}