{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Good, safe campus, no fear of nothing. Provides a good system for disabled people. Easy to get around the campus.",
            "There is the Wood Center you can play billiard,ping pong, bowling,arcade games. There is a gym, exercise, working out, weight room, play indoor sports. Ice arena and swimming pool provide with recreational use and sport use.",
            "The food is great and a good clean environment. A good variety of different foods you can get. Lots of good places you can sit down and relax and eat your food. Provide really good beverages.",
            "Everything is possible, all it takes is some study time and you will be successful. Was never really good with school but i find it really easy when you study. This school provides lots of time to study and flexible opportunities. It can match your needs to how your most comfortable with it.",
            "This college provides great help and a cooperative system. It is nice and expandable in lots of aspects. This is a welcome, relaxing college that provides you with a great tuition and lots of benefits."
        ]
    ],
    "pageTitle": "University of Alaska Fairbanks Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Alaska-Fairbanks/reviews?_escaped_fragment_=/show/29307",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898080363,
    "recordOffset": 898019923,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{48081=If you plan on transferring to UAF after a few years in a different, perhaps closer college, take all of your math first; don't take it at UAF. That's what I did, but I have heard from many how much more difficult it is to take a math course here, especially upper level. Also for transfer students, be sure to compare courses so that you transfer ALL of your credits; UAF is notoriously hard on transfer students. Other than that, in general, be prepared for an extremely cold winter: -30 to -40 degrees Fahrenheit is normal from November to February and maybe even March., 107656=On the campus, groups are always throwing activities. There is a Pub that has Karaoke and live bands play. Sometimes there are dance parties and every September there is Starvation Gulch, where groups on campus build multiple two story bonfires celebrating the anniversary of when the campus became no longer a dry campus., 168064=Pub opens at 4:30 during the week and noon on Fridays., 35030=After enduring -40 F temperatures and as little as 3 hours of sunlight the during winter months, students at UAF welcome spring with open arms. This celebration is Spring Fest. There are no classes on the last Friday in April, and the students engage in all sorts of outdoor activities., 44896=Spit in -50 degrees and watch it shatter as it hits the ground. Cross country skiing is fun and inexpensive to students if you rent skis at the Outdoor Adventures found in the Wood Center. There is one movie theater in the whole city of Fairbanks, but there is another one on the outskirts of town, if you can stand watching a movie in a barn. Chena Hot Springs is about an hour's drive from Fairbanks and is fun to go to in the winter to feel the extreme differences of temperature and watch your hair freeze. The Ice Park exhibits cool sculptures, literally, and the Pioneer Park offers mechanical engineering porn with its engines and whatnot. On campus, there is a gym of sorts. . . with a rock climbing wall. The Northern Lights are often very visible any time between December and February (about), although you might have to stay up a little late in the cold (or in a warm vehicle) to see them., 157699=Starvation Gultch: a celebration of the beginning of the school year dating back to 1914. There are usually 6 teams which build huge wooden structures, and then they are set on fire! SUPER AWESOME and so much fun. Don't get too close though... your face might melt off... There are underground tunnels that connect the buildings, 'cause we're cool and produce all our own electricity and heating. Join the -40 club and dance around the streets in your under-garments at night when its FORTY DEGREES BELOW ZERO. It's awesome fun, and you'll be the most hardcore person on the planet when you get home :), 171046=40 Below Club. You stand outside at -40 F or colder, in a bikini or swim trunks, (or in shorts and a tank top) and you take a picture standing in front of the sign. Every February, the engineering students build an ice arch., 266327=© 2015, Cappex.com, LLC, 7422=My time at UAF so far has been nothing less than enjoyable. It was strange when snow first fell in the third weekend of September, but it quickly warmed up to 40 degrees for a week or two. Now (almost the winter solstice), the sun rises at 11:30 and sets at 2, and the average temperature is a tad cold at 30 below zero, but you walk into a building and the first thing you feel is a rush of hot air being provided by ceiling heaters! The food here is fairly decent. Being allergic to eggs, I find breakfasts a little challenging, but fruits, cereals, and yogurts are always available. For lunches and dinners, I have noticed that the vegetarian food is often better than the normal people food like the burgers, pizza, and rice. They have specialty meats every Sunday, which is a welcoming gesture to the students. Ohh! And the soft-serve machine is amazing!, 165857=Be prepared for cold, 2 months of highs around -20 F is not uncommon. Living expenses are high expect $1400/ living frugally., 206176=Cardio - the whole campus is one great, big hill! Don't skimp on the winter clothes, but it doesn't get really into the negatives until mid-November. Don't be shy about asking for help, and don't fall behind!, 239319=Average food. But it is being updated to a new building fall 2014., 142448=Starvation Gulch is a tradition celebrated at the end of September where there's a festival of sorts with massive bonfires, fire dancing and food to welcome new students. Spring Fest is another tradition where classes are cancelled and marks the end of winter with picnics and watermelon dropping from the tallest building on lower campus.}",
    "textBeforeTable": "07/08/2009 Reviewer is A current student here. 16 out of 16 people found this review useful. 1 of 61 Seaira from wasilla, AK Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Alaska Fairbanks Reviews University of Alaska Fairbanks › Alaska › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Shaun from Juneau, AK 12/18/2009 Reviewer is A current student here. 8 out of 9 people found this review useful. 2 of 61 Categories Comments Great for these types of students UAF is great for engineering and undergraduate research, as well as music, language, and education. If you LOVE the outdoors and enjoy hiking, camping, cross-country skiing, snowshoeing, snow machining, or ice climbing, the outdoors program here is amazing and has trips almost every week to take advantage of all of these opportunities. Also, if the cold is Too cold for you, it's a short drive over to the hot springs. Just... try to forget about all of the ice everywhere =P Tips for prospective students Don't be intimidated by the cold weather. You can always add more clothes whereas down south you can only take off so many. If you're looking for cold, or for a very unique experience, UAF is the place to be. Also, what will all of your friends back home think when you say, Yeah, you're going",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}