{
    "relation": [
        [
            "Virtual IP Address",
            "172.26.2.115",
            "172.26.2.116",
            "172.26.2.117"
        ],
        [
            "Virtual Host NameFoot 1",
            "STBYADMINVHN",
            "STBYBIVHN1",
            "STBYBIVHN2"
        ],
        [
            "Alias Host Name",
            "ADMINVHN",
            "BIVHN1",
            "BIVHN2"
        ]
    ],
    "pageTitle": "Design Considerations",
    "title": "",
    "url": "https://docs.oracle.com/cd/E28280_01/doc.1111/e15250/design_consid.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00086-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 862452335,
    "recordOffset": 862416733,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{2451=When configuring each component, use host-name-based configuration instead of IP-based configuration, unless the component requires you to use IP-based configuration. For example, if you are configuring the listen address of an Oracle Fusion Middleware component to a specific IP address (such as 172.16.10.255), then use the host name SOAHOST1.EXAMPLE.COM, which resolves to 172.16.10.2555.}",
    "lastModified": "Wed, 14 Jan 2015 14:05:04 GMT",
    "textBeforeTable": "Table 3-26 Virtual IP Addresses, Virtual Host Names, and Alias Host Names for Oracle Business Intelligence Standby Site Hosts If you use separate DNS servers to resolve host names, then you can use the same virtual IP addresses and virtual host names for the production site hosts and standby site hosts, and you do not need to define the alias host names on the standby site hosts that are recommended in Table 3-11. See Section 3.1.1.3 for more information about using separate DNS servers to resolve host names. Note: Table 3-26 shows the virtual IP addresses, virtual host names, and alias host names that will be used for the Oracle Business Intelligence EDG deployment standby site hosts. Figure 4-11 shows the configuration for the Oracle Business Intelligence EDG deployment at the standby site. Footnote 1 See Section 3.1.1.3 and Section 3.1.1.4 for information about defining physical host names. None BIVHN2 172.16.2.117 None BIVHN1 172.16.2.116 None ADMINVHN 172.16.2.115 Alias Host Name Virtual Host Name",
    "textAfterTable": "Footnote 1 See Section 3.1.1.3 and Section 3.1.1.4 for information about defining physical host names. 3.1.3 Load Balancer Considerations Oracle Fusion Middleware components require a hardware load balancer when deployed in high availability topologies. Oracle recommends that the hardware load balancer have the following features: Ability to load balance traffic to a pool of real servers through a virtual host name: Clients access services using the virtual host name (instead of using actual host names). The load balancer can then load balance requests to the servers in the pool. Port translation configuration. Monitoring of ports (HTTP and HTTPS). Virtual servers and port configuration: Ability to configure virtual server names and ports on your external load balancer. The virtual server names and ports must meet the following requirements: The load balancer should allow configuration of multiple virtual servers. For each virtual server, the load balancer should allow configuration of traffic management on more than one port. For example, for Oracle Internet Directory clusters, the load balancer must be configured with a virtual server and ports for LDAP and LDAPS traffic. The virtual server names must be associated with IP addresses and be part of your DNS. Clients must be able to access the load balancer through the virtual server names.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}