{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Wonderful, call them whenever and they are happy to escort you. Be good and you could get free pizza!",
            "It doesn't really exist except for a service organization",
            "There are tons to choose from, you won't have a problem finding anything to do, especially if you go to Involvement in the fall.",
            "Outdoorsy since we are surrounded by an extensive arboretum and lake and religious since there is an abbey and monastery on campus with really nice monks and nuns.",
            "There are plenty of ghost stories :)",
            "The school is great about finding everyone scholarships, it cost me about the same to go here as it would have to attend my local state university.",
            "Concerts, sports outings, going to the beach and walks through the arboretum, JEC sponsored events.",
            "The food is outstanding; there is a great variety and it is quite healthy. Easy to find vegetarian options.",
            "Fairly social, the dorms are very nice, large and every room has a sink, though you are required to live on campus all four years.",
            "Depending on the major and the classes you choose, it is often up to the student how rigorous their classes end up being.",
            "Definitely try to tour the campus or spend a night before if possible, you won't regret it.",
            "It's a friendly Benedictine college with a gorgeous campus. Located in central MN alongside a lake and arboretum, there is tons to do every week from seeing the MN orchestra to watching the famous football to lunch with a monk. The classes are great and everyone on the faculty is willing to meet with anyone."
        ]
    ],
    "pageTitle": "College of Saint Benedict and Saint John's Univ. Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/College-of-Saint-Benedict-and-Saint-Johns-Univ/reviews?_escaped_fragment_=/show/22192",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00191-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895157583,
    "recordOffset": 895090453,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{311542=© 2015, Cappex.com, LLC, 160085=CSB/SJU currently requires students to live on campus all four years. I am a student worker with the Residential Life department and we are always available at the office to answer any questions, either over the phone, email or in person. CSB/SJU offers amazing living situations and currently is building beautiful new town homes which will be open Fall of 2012. There is plenty of housing for every student and many options of living., 116757=The only club I was involved with this past year was the Climbing Club. I also volunteered as a Student Ambassador. There are plenty of things to get involved with, though, if you want to do that. There is a fair around October in the athletic center where every club can set up a table to advertise what they do. Students are free to browse the tables and sign up for whatever they would like to participate in.}",
    "textBeforeTable": "08/06/2009 Reviewer is A current student here. 13 out of 13 people found this review useful. 1 of 63 Trish from Mankato Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp",
    "textAfterTable": "Categories Comments Great for these types of students I would say that this school is great for any students who want to attend small size class. It is a good school and I believe all colleges are good, but everyone who decided to attend whatever college they choose will still have to study hard and have fun. As long as you are committed and know that this school is your passion college ,after reviewing the class size and knowing that it is private college, than it is the right one for you. Tips for prospective students One of the best tip is to have fun and study hard. I'll advice anyone who is having trouble in class, should immediately seek help from their professor. As you may already have heard from other college students' saying that don't be afraid to speak to your professor. Also if you need more time on tests or need a tutor to help you on any course subject, all you need to do is ask. Asking others to help you is very supportive and makes life a lot easier if you need help just ask. Also when you are at College of Saint Benedict take all the adventure you have and just remember to balance your time. College is all about time management, too. If you are heading to college, too, hope you will choose the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}