{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "College of the Ozarks has a campus security that is on call 24/7. There is also a gate that closes during the night that is watched by security. I feel very safe on this campus.",
            "There is no Greek life.",
            "There are a few clubs to be apart of and many campus activities. We have monthly coffee houses where a performer comes in to sing and intramural sports to be apart of. College of the Ozarks gets many famous people to come in and speak including former presidents and historical figures.",
            "Any hardworking student would fit right in at College of the Ozarks. We have a very good nursing, education, and agriculture program.",
            "College of the Ozarks has a beautiful campus with many old buildings and unique landscaping. The school is in the middle of the hilly Ozarks, so there is a bluff to climb down that has the lake below. There is also a rope swing on the lake that we jump in from.",
            "At College of the Ozarks, students do not pay anything for tuition. We work to pay it off during the week and two forty hour workweeks. They also accept students from low income families, so if you don't have a lot of money for college, it is worth it to attend College of the Ozarks.",
            "For fun I go to the Garrison Activity Center. It is a very nice workout facility that also has a basketball court, a pool, and racquetball courts. I also like to go with friends around Branson. Point Lookout is only five minutes away from Branson, MO.",
            "Cafeteria meals are provided in the room and board amount so we can eat in the cafeteria as much as we want. The food is pretty good most days and there are many different options on what to eat during that meal.",
            "The girl's dorms are very small here. A friend of mine measured a room, and they are a little bigger than a parking space. Upperclassmen get larger rooms. There is a no drinking policy on campus so if you are looking for a party school, College of the Ozarks is not the school for you.",
            "I would give the academics four stars. My classes are medium hard and I have to study to do well in them. If you are struggling, teachers are there to help and set up tutoring hours.",
            "Some tips would be to come in to College of the Ozarks with a positive attitude and expect to work hard. Keep up with your homework, because it is easy to fall behind in classes. Lastly, even though there is a strict dress code and order of conduct, stay true to yourself and do not change.",
            "College of the Ozarks is a good school, but it is not for everyone. The school has very strict rules and we are required to work on two weeks of our break along with fifteen hours in the week. Overall, I would have to give College of the Ozarks a low rating for college life."
        ]
    ],
    "pageTitle": "College of the Ozarks Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/College-of-the-Ozarks/reviews?_escaped_fragment_=/show/121442",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00299-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891955439,
    "recordOffset": 891924667,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{3643=White, Republican (90% of the campus voted for Bush in 2004,) Christian (at least if you are from a similarly ultra-conservative denomination,) and impeccably mannered and well-groomed. Everyone else need not apply., 77426=I am excited to begin my classes at the end of August. As a Freshman, the school fixes your schedule after you fill out a survey. This makes life much less stressful as your life is already changing. Academic rigor is based on what classes you are in and what year student you are., 125202=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "09/10/2009 Reviewer is Researching this school. Reviewer has been to campus. 17 out of 22 people found this review useful. 1 of 30 Natalie from virginia, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp =",
    "textAfterTable": "Did learn a lot I can think of a couple of professors here who I felt were knowledgeable in their fields, and will say that studying under them was a joy, but overall, the teaching staff's caliber is overrated and average. Login to rate or flag the reviews Jennifer from Pea Ridge, AR 09/30/2010 Reviewer is Researching this school. Reviewer has been to campus. 9 out of 11 people found this review useful. 3 of 30 Categories Comments Will learn a lot I visited this college and it is nicely spread out, and easy to get around. The people are nice and helpful, I hope I get accepted!!!! Login to rate or flag the reviews Mike 03/11/2012 Reviewer is A current student here. 9 out of 9 people found this",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}