{
    "relation": [
        [
            "Date",
            "xx.xx.2013",
            "xx.xx.2013"
        ],
        [
            "Competition",
            "xxxxxxxxxxxxxxxxxxxx",
            "xxxxxxxxxxxxxxxxxxxx"
        ],
        [
            "Cnt.",
            "xxx",
            "xxx"
        ],
        [
            "Cat.",
            "B",
            "B"
        ],
        [
            "Type",
            "Q",
            "F"
        ],
        [
            "Nr.",
            "1",
            ""
        ],
        [
            "Pl.",
            "xx",
            "xx"
        ],
        [
            "Result",
            "xxxx",
            "xxxx"
        ],
        [
            "Wind",
            "+0.6",
            "0.0"
        ],
        [
            "Score",
            "xxxx",
            "xxxx"
        ]
    ],
    "pageTitle": "Profile of Tatyana LEBEDEVA | All-Athletics.com",
    "title": "",
    "url": "http://www.all-athletics.com/node/144823",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00067-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 283003487,
    "recordOffset": 282985762,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sat, 01 Aug 2015 20:16:17 GMT",
    "textBeforeTable": "Born: 21.07.1976 Country: Russia  Tatyana LEBEDEVA Links News Videos Photos Athlete profile Subscribe Contact us Get Involved About us Polls Link Browser Partner Links More Photos Videos Videos/Photos US College News Diamond League News News Wire All-Athletics News News About Countries Rankings Women's Events Men's Events Women's Overall Men's Overall",
    "textAfterTable": "7 x World Championships finalist 12 x Golden League meeting winner 1 x Current World Record holder - Triple Jump ind. 1 x Current European Record holder - Triple Jump ind. 1 x World Records in career All-Access Statistics Detailed statistics for All-Access Pass holders. Chapters Short biography All-Athletics.com World Rankings Personal bests Annual bests Progression of annual bests All-Time Personal Top 10 Results by limits Honours Major championships All Results Description Winning Streaks Head-to-Head All-Athletics.com World Rankings Event Group Place Score Personal Bests Event Result Wind Venue Date Long Jump 7.33 +0.4 Tula (RUS) 31.07.2004 Long Jump ind. 6.98 Budapest (HUN) 07.03.2004 Triple Jump 15.34 -0.5 Herakleion (GRE) 04.07.2004 Triple Jump ind. 15.36 Budapest (HUN) 06.03.2004 Annual Bests Event Result Venue Date",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}