{
    "relation": [
        [
            "Statistic",
            "Δ Housing Units / Housing Units",
            "Δ Housing Units / Housing Units (s.d.)",
            "100% Urban",
            "100% Urban(s.d.)",
            "< 100% Urban",
            "< 100% Urban(s.d.)",
            "Net New Grants Per Pupil ($)",
            "Net New Grants Per Pupil ($)(s.d.)",
            "Predicted Net New Grants Per Pupil ($)",
            "Predicted Net New Grants Per Pupil ($)(s.d.)",
            "Total Housing Units, 1980",
            "Total Housing Units, 1980(s.d.)",
            "Number of Observations"
        ],
        [
            "Value",
            "0.12",
            "(0.20)",
            "0.03",
            "(0.13)",
            "0.15",
            "(0.21)",
            "1054",
            "(817)",
            "1147",
            "(1719)",
            "77620",
            "(191585)",
            "9076"
        ]
    ],
    "pageTitle": "FRB: Finance and Economics Discussion Series: Screen Reader Version - FISCAL AMENITIES, SCHOOL FINANCE REFORM AND THE SUPPLY SIDE OF THE TIEBOUT MARKET",
    "title": "Table 10 Summary Statistics : National Sample of School Districts",
    "url": "http://www.federalreserve.gov/pubs/feds/2009/200918/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438175235,
    "recordOffset": 438118054,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6328=This distortion speaks to the long running debate on the incidence of the property tax - i.e. the debate over who bears the burden of the tax. There are two views. The `benefit view' extends the Tiebout model by adding zoning regulations and capitalization of average tax price differences. Capitalization and zoning prevent individuals from free riding on public expenditures, ensure that the property tax is a payment for the use of local public services, and promote the efficient provision of public goods.6 Alternatively, under the `new view', the property tax is a distortionary tax on capital and both reduces the total amount of capital in the economy and causes capital to flee high-tax jurisdictions.7 Determining the relative validity of the two views is important as they have very different implications for the incidence of the property tax and for assessing the efficiency of local public goods provision (Nechyba 2000, Oates 2000, Oates 1994). Existing empirical work, however, largely fails at this task (Nechyba 2000). Although the work here cannot be viewed strictly as a test between the theories - the type of redistributive policies examined simply rule out the benefit view - they do test, and confirm, the prediction of the new view that property tax differences not associated with differences in service levels will cause capital to flee high tax jurisdictions., 17037=Although the reform grants can be viewed as an exogenous shock to a municipality's budget constraint, they may still be correlated with for several reasons. First, the reform grants were recalculated annually after the second year of the reform. The recalculated reform grants may reflect adjustment to the reform. Of particular concern, they may reflect residential investment endogenous to the reform - i.e. increased investment in response to the reform will increase aggregate property values and, all else equal, reduce the size of grant. The grant is therefore held fixed at its initial level. The changes in the grants from year to year were small and the initial grant level can be considered a proxy for the grants received over the 2000 to 2004 period.17 Second, the fiscal shock measure is a function of the time-invariant arguments of the grant formula (primarily per-pupil property wealth) and the municipal tax burden in the year prior to the reform. Municipal fixed-effects, , control for possible correlation between these variables and unobserved determinants of capital investment., 4651=Third, the paper contributes to the emerging literature on housing supply elasticity by using a credibly exogenous housing demand shock to examine the within-MSA elasticity of supply. Most recent papers have examined the across-MSA elasticity of supply (e.g. Glaeser, Gyourko and Saks 2006, Gyourko and Saiz 2006, Gyourko 2008, and Saiz 2008). The analysis suggests that the housing supply response to a region-wide demand shock is intensely concentrated at the urban fringe - far more concentrated than the geographic distribution of overall building activity., 13800=Do local governments that provide more public goods per tax dollar attract more residential capital investment than other governments? Individuals choose their optimal bundle of public services through their decision on where to live (Tiebout 1956) and governments which provide public goods at a lower tax cost would be expected to experience elevated housing demand. Although a voluminous empirical literature examines the influence of public goods on the housing market, it has typically been assumed that the stock of housing is fixed.1 2 With supply fixed, the housing market clears shocks to local amenities exclusively through price adjustments (i.e. through capitalization). If housing supply is elastic, however - and a developing literature suggests it is (Glaeser and Gyourko 2002, Glaeser, Gyourko, Saks 2006, Saiz 2008, and Saks 2008) - a shock to a community's fiscal amenities will induce both a price and a quantity response. This paper, therefore, examines the response of residential construction to differences in fiscal amenities across communities. Stated somewhat more broadly, the paper explores the interaction of the Tiebout market for local public goods and the supply side of the housing market. As discussed below, this topic has implications for a host of important issues, including the equity and efficiency of local public goods provision, the determination of who bears the burden of local taxation, and land use issues such as the location and pace of residential development and the determinants of land use regulation., 10646=The empirical estimates suggest that the supply of new homes is quite sensitive to fiscal amenities. The New Hampshire analysis exploits the fact that in 1999 the state began issuing extremely large lump-sum grants to municipalities as part of a school finance reform. Eighty to one hundred percent of the grants were used to fund property tax reduction and the remainder funded increased education spending (Lutz 2009). As a result, the New Hampshire analysis focuses on a particular fiscal (dis)amenity - property tax burdens. The estimates suggest that a community receiving the mean grant, equal to 15 percent of local property tax revenue, experiences an 11 percent to 22 percent increase in residential investment, implying an elasticity of roughly (negative) one. The analysis also reveals significant heterogeneity in the response. There is no evidence of an increase in investment in the New Hampshire communities within fifty miles of the nearest large city, Boston, whereas the response is most intense just outside this ring, at the urban periphery. Mirroring this result, although there is no evidence for a capitalization effect in the state as a whole, there is strong evidence of capitalization within the suburban ring. The differing responses are interpreted as reflecting differing housing supply elasticities in the suburban ring relative to the rest of the state.3 The national sample analysis focuses on a different type of fiscal amenity, education spending, as the grants provided by school finance reforms during the 1980s were used primarily to increase education funding (Barrow and Rouse 2004). The results support the two primary conclusions of the New Hampshire analysis: Residential capital investment is sensitive to fiscal amenities in many locations but not in dense, urban areas where the housing supply is less elastic.}",
    "TableContextTimeStampAfterTable": "{122710=Oates, Wallace, \"The Many Faces of the Tiebout Model.\" In The Tiebout Model at Fifty: Essays in Public Economics in Honor of Wallace Oates, ed. William A. Fischel, Cambridge, MA, Lincoln Institute of Land Policy, 2005., 120647=Lutz, Byron, \"Taxation with Representation: Intergovernmental Grants in A Plebiscite Democracy\", Finance and Economics Discussion Series 2006-6. Washington: Board of Governors of the Federal Reserve System, 2006., 64454=The final column of Table 2 presents the falsification check, enacted as follows: A \"placebo\" fiscal shock is generated by assigning each New Hampshire municipality in 1998 the shock it actually received in 1999, 114713=Chay, Kenneth and Michael Greenstone, \"Does Air Quality Matter? Evidence from the Housing Market\", Journal of Political Economy, Vol. 113, No. 2, 2005., 119450=Johnson, Erik and Randall Walsh, \"The Effect of Property Taxes on Location Decisions: Evidence from the Market for Vacation Homes\", NBER Working Paper #14793, March 2009., 83401=Columns (3) and (4) replace the density measure with an indicator for having a growth management ordinance in 1999. Although there is no evidence that investment responds to the reform in communities with growth management (see the p-tests at the bottom of the table), the effect for these communities cannot be distinguished from the effect for communities without growth management. Additional specifications (unreported) fail to find evidence that elements of a town's zoning code as of 2000, including minimum lot size and required frontage, impact the investment response., 90320=The growth management results suggest that demand shocks cause land use regulation. They are therefore consistent with theoretical work suggesting relatively more dense and developed areas endogenously engage in more stringent land use regulation (Rudel 1989, Fischel 2001a, Hilber and Robert-Nicoud 2006 and Ortalo-Magné and Prat 2007). The results can also be seen as complementary to those in Saiz (2008) which document a similar causal relationship running from development and density to regulation, but over a much longer time horizon than examined here., 74484=The logic of the classic monocentric land use model (Alonso 1964, Mills 1967 and Muth 1969) and more recent models of urban growth based upon it (e.g. Arnott and Lewis 1979, Capozza and Helsley 1989, Wheaton 1982) suggests that the amount of land available for development will increase with distance from the urban center. Table 5 shows that this prediction holds in New Hampshire, as both housing unit density and the percent of land which is developed are higher in the area within 50 miles of Boston. This area will be termed the \"suburban ring\" and is mapped on Figure 4. Within New Hampshire, 50 miles is approximately the 10th percentile of distance from Boston and the closest New Hampshire community to Boston is located 33 miles from the city., 71724=The robustness check may be invalid, or contaminated, if the New Hampshire reform induced changes in investment activity in the control groups. Although the impact of the reform outside of New Hampshire is theoretically ambiguous because of the increase in statewide taxes used to fund the grants, it is possible that the reform influenced investment decisions across state borders for certain communities. For instance, investment in property wealthy communities located near the Maine-New Hampshire border may have reallocated toward Maine because the New Hampshire comminutes received no benefit from the reform (or even received a negative shock), but were required to pay higher statewide taxes. To address this concern, column (6) uses a control group comprised of `Southeastern Maine'. The municipalities in this control group are a minimum of 40 miles from the border with New Hampshire, have similar observables to New Hampshire and a similar trend in building activity, although the sample size is equal to only a bit less than half of the New Hampshire sample size. The results from employing this control group are again quite similar to those on Table 2. Column (8) adds a portion of `Central New England' to increase the size of the control group and produces very similar results. Finally, using all communities in Connecticut, Massachusetts, Maine and Rhode Island as a control group - column (10) - also produces similar results. Vermont is not used to provide control communities because, as is clearly visible in Appendix Figure A1, it enacted a school finance reform in 1998.21 The remaining New England states had stable school finances over the period., 48081=Conditional on receiving a positive net grant, both the municipal tax rate and total tax burden declined between 1998 and 2000 (rows # 6 and #8). Conditional on receiving a negative net grant, both the tax rate and total tax burden increased (rows # 7 and #9). Tax burdens increased for both types of towns after 2000, primarily reflecting increased education spending. (Education spending also rose in neighboring New England states over this period.) Despite the increased tax burden, tax rates fell substantially over this same period as the result of rapidly increasing property values., 125685=Yinger, John, Axel Borsch-Supan, Howard Bloom and Helen Ladd, Property Taxes and House Values: The Theory and Estimation of Intrajurisdictional Property Tax Capitalization, Academic Press, 1988., 112056=Barrow, Lisa and Cecilia Rouse, \"Using Market Valuation to Assess Public School Spending\", Journal of Public Economics, Vol. 88, No. 9-10, 2004., 36722=The New Hampshire analysis focuses on property taxes. A 1999 reform provides unusually credible exogenous variation in property tax burdens., 125011=Wassmer, Robert, \"Property Taxation, Property Base, and Property Value: An Empirical Test of the `New View'\" National Tax Journal, vol. 46, No. 2, 1993., 115102=Duncombe, William and John Yinger, \"Alternative Paths to Property Tax Relief\", In Property Taxation and Local Government Finance, ed. Wallace Oates, Lincoln Institute of Land Policy, Cambridge, MA, 2000., 121257=Mills, Edwin S., \"An Aggregative Model of Resource Allocation in a Metropolitan Area,\" American Economic Review,Vol. 57, No. 2, 1967., 44585=The data used in the New Hampshire analysis come from multiple sources. Building permit data for new single family homes, collected by the U.S. Census Bureau, measures investment in residential capital.15 Sales price data, collected by New Hampshire Housing Finance Authority, measures property values. Property tax data come from the New Hampshire Department of Revenue Administration and the reform grant data come from the New Hampshire Departments of Education and Revenue Administration. Data on land use regulation come from the New Hampshire Office of Energy and Planning and a dataset compiled by Richard England. The Office of Energy and Planning data are supplemented by a survey of municipalities conducted by the author. Data on land use are from Hilber and Mayer (2009). Finally, demographic data are from the 2000 Census. See the Data Appendix for additional information., 117677=Hamilton, Bruce, \"Property Taxes and the Tiebout Hypothesis: Some Empirical Evidence\" in Fiscal Zoning and Land Use Controls, eds. Edwin Mills and Wallace Oates, Lexington Books, 1975., 123627=Ross, Stephen and John Yinger, \"Sorting and Voting: A Review of the Literature on Urban Public Finance\", Handbook of Regional and Urban Economics, Volume 3, eds. E.S. Mills and P. Cheshire, 1999., 114200=Capozza, Dennis and Robert Helsley, \"The Stochastic City\", Journal of Urban Economics, Vol. 28, 1990., 69109=A practical problem with estimating equation (17) is the unobservability of the determinants vector for the control states. A measure of per-child residential property wealth, taken from the 2000 Census, is therefore used as a proxy for the determinants vector. The census measure is a strong predictor of the fiscal shock: The two variables have a cross-sectional correlation of -0.76 in the New Hampshire sample., 106219=The Stock of Single Family Homes in 1996, 114349=Capozza, Dennis and Robert Helsley, \"The Fundamentals of Land Prices and Urban Growth\", Journal of Urban Economics, Vol. 26, 1989., 111769=Alonso, William, Location and Land Use, Cambridge: Harvard University Press, 1964., 124192=Saks, Raven, \"Housing Supply\", The New Palgrave Dictionary of Economics, Second Edition, eds. Durlauf, Steven and Lawrence Blume, 2008., 117383=Gyourko, Joseph, \"Housing Supply\", working paper, August 25, 2008., 38238=In response to the Claremont ruling, the state legislature enacted a major reform in November of 1999. Under the reform, eighty percent of communities receive positive lump-sum grants from the state. The remaining communities, referred to as `donor towns', are forced to remit payments to the state (i.e. they recieve negative grants) The primary determinant of a municipality's grant is per-pupil property wealth - the lower a town's per-pupil property wealth, the larger the grant., 125917=Zodrow, George, \"Reflection on the New View and the Benefit View of the Property Tax.' In Property Taxation and Local Government Finance, ed. Wallace Oates, Lincoln Institute of Land Policy, Cambridge, MA, 2000., 115353=England, Richard, \"Current-use Property Assessment and Land Development: A Review of Development Penalties\", State Tax Notes, Dec. 16, 2002., 120446=Lutz, Byron, \"Taxation with Representation: Intergovernmental Grants in a Plebiscite Democracy\", forthcoming in Review of Economics and Statistics, 2009., 96173=The instrument is constructed using state school financing formulas to predict the level of total state education aid in both 1980 and 1990. For both 1980 and 1990, the grant amount is predicted using the 1980 characteristics of the school district to ensure that variation in the instrument solely reflects changes in state aid formulas, not demographic changes at the school district level that may be associated with the level of residential investment. After the levels are constructed, they are differenced to obtain the instrument - the predicted change in state grants for education., 122472=Oates, Wallace, \"Property Taxation and Local Government Finance.\" In Property Taxation and Local Government Finance, ed. Wallace Oates, Lincoln Institute of Land Policy, Cambridge, MA, 2000., 123861=Rudel, Thomas, Situations and Strategies in American Land Use Planning, Cambridge University Press, Cambridge, 1989., 111889=Arnott, Richard and Frank Lewis, \"The Transition to Urban Land Use\", Journal of Political Economy, vol. 87, no. 1, 1979, 110100=Growth management is a stringent form of land use regulation which permits municipalities to limit the number of land use permits, including building permits for residential homes, issued annually (see Table 5 and Figure 5). The zoning measures displayed on Figure 6 are measured as of 2008. The zoning index indicates how many specific forms of zoning a municipality was using in 2008. The forms of zoning are: wetlands protection, wetlands buffering, shoreland, aquifer, historic, use permits and impact fees. Subdivision regulations concern the layout of lots and streets and the provision of city services such as sewers., 116794=Glaeser, Edward and Joseph Gyourko, \"The Impact of Zoning on Housing Affordability\", Harvard Institute of Economic Research, Discussion Paper no. 1948, 2002., 113925=Bui, Linda T. M., and Christopher J. Mayer. 2003. \"Regulation and Capitalization of Environmental Amenities: Evidence from the Toxic Release Inventory In Massachusetts.\" Review of Economics and Statistics, Vol. 85, No. 3, 2003., 123250=Palmon, Oded and Barton Smith, \"New Evidence on Property Tax Capitalization\", Journal of Political Economy, Vol. 106, No. 5, 1998., 122976=Ortalo-Magne, Francois and Andrea Pratt, \"The Political Economy of Housing Supply: Homeowners, Workers, and Voters,\" The Suntory-Toyota International Centers for Economics and Related Disciplines Discussion Paper No. TE/2007/512, 2007., 117165=Greenstone, Michael and Justin Gallagher, \"Does Hazardous Waste Matter? Evidence from the Housing Market and the Superfund Program,\" Quarterly Journal of Economics, 2008., 112444=Bentick, Brian and Thomas Pouge, \"The Impact on Development Timing and Profit Taxation\", Land Economics, Vol. 64, No.4, 1988., 37127=Prior to 1999, New Hampshire education was funded primarily by local property taxes. Eighty-seven percent of total primary and secondary education revenue came from the local level -- the highest in the nation. The state with the next highest percent, Connecticut, attributed 57 percent of total revenues to local sources and the median state, Wisconsin, attributed 41 percent.12 Nine percent of education revenue was provided by the state and the remainder was provided by Federal funding., 87785=Table 9 presents estimates of the impact of the fiscal shock on the probability of utilizing growth management and charging impact fees for development (these are the only regulatory measures avaliable at multiple points in time - see the Data Appendix for more information, including summary statistics). A two-period panel with data from 1999 and 2008 is used, both because of data limitations and because a regulatory response would be expected to manifest itself only gradually, after the increased pace of development becomes apparent.27 The approach is otherwise the same as on the preceding tables. Column (1) shows that the fiscal shock is associated with an increased probability of utilizing growth management. Evaluated at the mean value of the fiscal shock, the estimate suggests that municipalities were 0.06 percentage points more likely to adopt the policy as a result of the reform - an increase of almost 50 percent relative to the probability of having adopted the policy as of 1999 (0.13). Column (2) documents that the results are robust to inclusion of the base characteristic-year interaction terms, an important finding given that the surge in housing demand over this period likely increased demand for regulation. The impetus to increase regulatory stringency is likely be the strongest in the areas which experience the largest increase in development. Column (3) therefore includes the suburban ring and distance from Boston interaction terms. Although the sign of the interaction coefficients are consistent with the area outside the suburban ring having experienced the largest increase in regulation, they are imprecisely estimated (the three fiscal shock coefficients are, though, jointly significant at the 5% level)., 87247=It is possible that the increase in residential construction sparked by the fiscal shock will cause voters to enact land use regulations aimed at reducing the pace of development or altering its form. Homeowners may wish to restrict new construction in order to mitigate costs associated with additional development and density, to prevent newcomers from free-riding on the existing tax base (Hamilton 1975, Hamilton 1976a), to extract rents from newcomers (White 1975) or to increase the value of their homes (Fischel 2001a)., 118127=Hines, James R., Richard H. Thaler, \"Anomalies: The Flypaper Effect\", Journal of Economic Perspectives, Vol. 9, No. 4, pg. 217 - 226, 1995., 121089=Mieszkowski, Peter, \"The Property Tax. An Excise Tax or a Profits Tax?\", Journal of Public Economics, Vol. 1. No.1, 1972, 124775=Vitaliano, Donald and Jennifer Gravelle, \"Farm Property Tax\" in The Encyclopedia of Taxation and Tax Policy, eds. Joseph Cordes, Robert Ebel and Jane Gravelle, Urban Institute Press, 2005., 119267=Hoyt, William, Paul Coomes and Amelia Biehl, \"Tax Limits, Houses, and Schools: Seemingly Unrelated and Offsetting Effects\", working paper, 2009., 115729=Epple, D. and T. Romer, \"On Flexible Municipal Boundaries\", Journal of Urban Economics, Vol. 26, 1989., 125211=Wheaton, William, \"Urban Residential Growth Under Perfect Foresight\", Journal of Urban Economics, vol. 12, 1982., 118314=Hilber, Christian and Christopher Mayer, \"Why Do Households Without Children Support Local Public Schools? Linking House Price Capitalization to School Spending\", Journal of Urban Economics, vol. 65, no. 1, 2009., 112810=Black, Sandra, \"Do Better Schools Matter? Parental Valuation of Elementary School Education\" Quarterly Journal of Economics, Vol. 114, 1999., 116644=Fischel, William, \"An Economic History of Zoning and a Cure for Its Exclusionary Effects\", Urban Studies, 2004., 114527=Capozza, Dennis and Yuming Li, \"The Intensity and Timing of Investment: The Case of Land\", American Economic Review, Vol. 84, No. 4, 1994., 119037=Hoxby, Caroline and Iilyana Kuziemko, \"Robin Hood and His Not-So-Merry Plan: Capitalization and the Self-Destruction of Texas School Finance Reform\", mimeo, Harvard University, February 2004., 121557=Nechyba, Thomas, \"The Benefit View and the New View: Where Do We Stand, Twenty-Five Years into the Debate?\" In Property Taxation and Local Government Finance, ed. Wallace Oates, Lincoln Institute of Land Policy, Cambridge, MA, 2000., 109238=Two measures of land availability are used. The first measure is the number of houses per square meter of land from the 2000 Census. The second measure is the percent of land which has been developed. Land is considered developed if it is in use for residential, commercial, industrial or transportation purposes. Land is considered undevelopable, and therefore not included in the denominator of the measure, if it is classified as: open water, perennial ice or snow, barren, or wetlands. The data was produced by Hilber and Mayer (2009) and is based on the National Land Cover Data 1992. In some cases, the data cannot be mapped uniquely into a single municipality. In these cases, the data is mapped into an area comprised of two or more municipalities and these communities are all assigned the same value., 121438=Muth, Richard F., Cities and Housing, Chicago, University of Chicago Press, 1969., 54560=The models are estimated with data ranging from 1996 to 2003, with 1999 omitted from the sample. 1999 is omitted for two reasons. First, the reform was announced in November of 1999 and it is unlikely that there was a significant investment response in the remainder of the year. Second, when the reform was announced in late 1999, municipal budgeting decisions for the year had already been made. Many municipalities were constrained from reacting to the grants by the late announcement and it may have been unclear how a given municipality would respond in the long-run (i.e. if the grants would be used for tax reduction or increased government spending). In 2000 municipalities were unconstrained. Investment decisions are based on the long-run expected tax burden of a community, not the burden arising in a single year due to short term constraints. The estimates presented in the paper are not substantively changed if 1999 is included. Municipalities are excluded from the sample if they fail to have non-missing data for at least six of the seven years. Finally, very small municipalities, those with less than 1200 residents in year 2000, are dropped from the sample., 117488=Gyourko, Joseph and Albert Saiz, \"Construction Costs and the Supply of Housing Structure\", Journal of Regional Science, Vol. 46, No. 4, 2006., 113413=Brueckner, Jan, \"Property Values, Local Public Expenditure and Economic Efficiency\", Journal of Public Economics, Vol. 11, 1979., 96793=If the amount of residential investment during the 1980s is correlated with the 1980 characteristics of a school district, the IV results may be biased. In order to address this concern, the model is intensely saturated with a large vector of 1980 school district and county characteristics, . See the notes on Table 11 for a complete list of variables (the precise set of variables included in the vector has little impact on the results).30, 120240=Linden, Leigh and Jonah Rockoff, \"Estimates of the Impact of Crime Risk on Property Values from Megan's Law\", American Economic Review, Vol. 98., No. 3, 2008., 123428=Reschovsky, Andrew, \"Residential Choice and the Local Public Sector: An Alternative Test of the `Tiebout Hypothesis'\", Journal of Urban Economics, Vol. 6, 1979., 124375=Saiz, Albert, \"On Local Housing Supply Elasticity\", working paper, 2008., 118574=Hilber, Christian and Frederic Robert-Nicoud, \"Owners of Developed Land Versus Owners of Undeveloped Land: Why Land Use is More Constrained in the Bay Area than in Pittsburgh\", Center for Economic Performance Discussion Paper # 760, 2006., 110737=Only two forms of land use regulation are available at multiple points in time - growth management and impact fees. These variables are used in the regressions on Table 9. Impact fees are paid at the time of development and are intended to cover the cost of the public infrastructure associated with development. The impact fee data is available as of 2000 in a dataset on New Hampshire zoning collected by Richard England. The 2008 data comes from the New Hampshire Office of Energy and Planning. Impact fees are the only aspect of zoning which can be linked across the two sources / time periods. The growth management data is available for 1999 and 2008. The data comes partially from a survey conducted by the author and the remaining data is from the Office of Energy and Planning., 120907=Mayer, Christopher and Somerville, C. Tsuriel, \"Land Use Regulation and New Construction,\" Regional Science and Urban Economics, Vol. 30, 2000., 113589=Brueckner, Jan, \"A Test for Allocative Efficiency in the Local Public Sector\", Journal of Public Economics, Vol. 19, 1982., 124635=U.S. Bureau of the Census, Public and Elementary-Secondary Education Finances: 1998-1999, Summary Tables, 2000., 122265=Oates, Wallace, \"Federalism and Government Finance\", in Modern Public Finance, eds. J. Quigley and E. Smolensky, Cambridge, MA, Harvard University Press, 1994., 119659=Kotlikoff, Laurence and Laurence Summers, \"Tax Incidence,\" in Handbook of Public Economics, eds. Alan Auerbach and Martin Feldstein. Amsterdam: North-Holland, 1987., 112248=Bentick, Brian, \"The Impact of Taxation and Valuation on the Timing and Efficiency of Land Use\", Journal of Political Economy, Vol. 87, No. 4, 1979., 97619=The data comes from the 1980 and 1990 decennial census school district data files, the 1977 and 1987 Census of Governments, and the 1996 USA Counties CD-Rom. The instrumental variable is constructed using the state school finance formulas in the 1978 and 1990 Public School Finance Programs and data collected from individual states on tax rates and total assessed property valuations. See B&R for more information on the construction of the data.31 Table 10 presents summary statistics. The stock of housing increased by around 12 percent in the average school district over the course of the 1980s and the average school district experienced an increase in state grants of about $1050 per pupil., 120076=Ladd, Helen and Katherine Bradbury, \"City Taxes and Property Tax Bases\", National Tax Journal, Vol. 41, No. 4, 1988., 112608=Banzhaf, H. Spencer and Randall P. Walsh, \"Do People Vote with Their Feet?An Empirical Test of Tiebout's Mechanism,\" American Economic Review, 98:3, 2008., 56296=Table 2, column (1), presents the results of estimating equation (14). The estimate is precise and economically large. Evaluated at the mean value of the fiscal shock measure, the estimate implies a 0.17 increase in the rate of residential investment (note that the dependent variable has been multiplied by 100 for presentation reasons). Using the mean rate of investment in 1998, 1.6, this implies the fiscal shock induced an 11 percent increase in the rate of residential investment. The mean value of the fiscal shock measure is 0.15, interpretable as a 15 percent decrease in the property tax burden. The estimate can therefore be interpreted as implying that the elasticity of residential construction with respect to the property tax burden is very roughly equal to (negative) one. The results can also be understood relative to the municipal capital stock, measured as the number of single family housing units in the first year of the sample. The estimates imply that ten years after the initiation of the reform, the capital stock will have increased by around 2 percent in a town with the mean fiscal shock., 125371=White, Michelle, \"Fiscal Zoning in Fragmented Metropolitan Areas\" in Fiscal Zoning and Land Use Controls, eds. Edwin Mills and Wallace Oates, Lexington Books, 1975., 58269=In columns (1) - (3) the dependent variable is defined as the ratio of building permits in a year to the stock of homes at the start of the sample period. This construction is useful because it allows the estimation of a proportional response - i.e. the marginal effect of the grants on building permits is estimated proportionally to the stock of housing. Although the ratio of permits to the housing stock is easily interpreted and is quite intuitive - indeed, it is the measure that many municipalities use when officially quantifying their rate of growth in land use regulations - it could be argued that the normalization is arbitrary. Column (4) presents estimates from a model using the log of building permits as the dependent variable. The specification must be altered because roughly 2 percent of the building permit observations are equal to zero. The sample is first restricted to towns with a year 2000 population exceeding 1,600 and non-missing building permit data for all years of the sample. The data is then collapsed into a single pre-reform and a single post-reform observation for each municipality by summing over the pre and post periods. The new dataset contains non-zero building permit counts for all observations. Compared to the sample used in columns (1) - (5), the new sample contains approximately 85 percent of the municipalities and 95 percent of the building permits. The estimate in column (6) suggests that the typical community experienced a 15 percent increase in the pace of building activity - similar to the estimate in column (1)., 125583=Wildsain, David, Urban Public Finance, New York, Hardwood, 1986., 108244=The Southern Maine control group is defined as all Maine communities within 175 miles of Boston - over 99 percent of the New Hampshire sample lives within this radius. The Western Massachusetts control group is defined as all Massachusetts communities greater than 33 miles from Boston - the New Hampshire community closest to Boston is located 33 miles from the city - and west of 71.3837 W. The Southeastern Maine control group is defined as communities east of 70.1970 W and within 175 miles of Boston. Central New England is defined as communities in Massachusetts south of 42.1497 N, west of 71.3837 W and located 33 miles or more from Boston and communities in Rhode Island and Connecticut north of 41.8645 N. For the construction of the control groups, distance from Boston is measured as the physical distance. In all other cases in the paper, distance from Boston is measured in terms of driving distance., 39651=Economic theory predicts that a lump-sum grant to a locality will be spent on public goods at the communities marginal propensity to spend on public goods out of private income (Bradford and Oates 1971 a,b). As the marginal propensity to spend on public goods is estimated to be between 5 to 10 cents on the dollar, theory predicts that only 5 to 10 cents per dollar of grant income will be used for increased public goods provision, including education. The rest will be spent on private consumption. In New Hampshire, where virtually all own source revenue is derived from the property tax, this would occur via a reduction in the rate of property taxation. A large empirical literature, though, contradicts this prediction and finds that grants are systematically spent as intended by the sending government. This empirical tendency has been termed the \"flypaper effect\" because it documents that grants tend to stick where they are targeted (Hines and Thaler 1995). The empirical tendency creates the expectation that only a limited portion of the New Hampshire grants will be spent on property tax reduction., 124486=Tiebout, Charles, \"A Pure Theory of Local Expenditures.\" Journal of Political Economy, Vol. 64, 1956., 114912=Davis, Lucas W, \"The Effect of Health Risk on Housing Values: Evidence from a Cancer Cluster.\" American Economic Review, Vol. 94, No. 5, 2004., 122010=Oates, Wallace, \"The Effects of Property Taxes and Local Public Spending on Property Values: An Empirical Study of Tax Capitalization and the Tiebout Hypothesis\", Journal of Political Economy, Vol. 77, 1969., 121837=Novy-Marx, Robert, \"An Equilibrium Model of Investment Under Uncertainty\", Review of Financial Studies, Vol. 20, no. 5, 2007., 113759=Brueckner, Jan, \"Property Value Maximization and Public Sector Efficiency\", Journal of Urban Economics, Vol. 14, 1983., 115879=Fischel, William, \"Fiscal and Environmental Considerations in the Location of Firms in Suburban Communities.\" In Fiscal Zoning and Land Use Controls. Edwin Mills and Wallace Oates, eds. Lexington Books, Lexington, MA, 1975., 115541=Eilperin, Juliet, \"Conservationists Vie to Buy Forest Habitat: Timber Firms' Sell-Off Worries Groups\", Washington Post, A01, Tuesday, March 21, 2006., 118851=Hoxby, Caroline, \"All School Finance Equalizations are Not Created Equal\", Quarterly Journal of Economics, pg. 1189 - 1231, November 2001., 75259=Land use regulation tends to originate in central cities and then spread outward to surrounding areas (Fischel 2004, Rudel 1989). Accordingly, regulation is likely most intense near the urban center. This hypothesis appears to hold in New Hampshire; the prevalence of a fairly stringent land use regulation - a form of growth management which permits municipalities to set a binding limit on the number of new homes built each year - is much higher within the suburban ring., 116990=Glaeser, Edward, Joseph Gyourko and Raven Saks, \"Urban Growth and Housing Supply\", Journal of Economic Geography, Vol. 6, 2006., 124015=Ruedig, Michael and Donald Gartell, \"How to Soften the Blow of the Land Use Change Tax\", New Hampshire Business Review, May 2002.}",
    "lastModified": "Fri, 17 May 2013 18:11:45 GMT",
    "textBeforeTable": "Note. Grant / Tax Revenue refers to the ratio of the net grant in 1999 to property tax revenue in 1998. The unit of observation is municipality-year. All columns use a two-period panel. Columns (1) - (3) use data from years 1999 and 2008. Column (4) - (6) use data from years 2000 and 2008. The dependent variable is an indicator variable for the form of land use regulation given in the column header (and the specifications are therefore linear probability models). Standard errors clustered by municipality are in parentheses. The sample is restricted to the set of municipalities with greater than 1200 residents in 2000. All columns include municipal and year fixed-effects. Columns (3) and (5) include main interactions effects: (distance from Boston) * (year >= 2000) and (<= 50 miles from Boston)*(year >= 2000). Columns (2) and (5) include a set of time-invariant control variables interacted with a full set of year indicator variables. The variables are distance from Boston, distance from Boston squared, municipal population, municipal population squared, the percent of municipal property that is commercial, the percent of municipal residential property that is for seasonal or recreation use, and municipal density, defined as the total number of housing units divided by land area. Tables displaying the complete set of coefficients available from the author upon request. The implied change in the dependent variable is calculated using the mean value of the fiscal shock (1999 grant/1998 tax revenue) in 2000 (the first post-reform year).",
    "textAfterTable": "Note. Cells display means weighted by the number of 1980 pupils. Standard deviations are in parentheses. All variables are from 1990, unless otherwise stated. The data is from the sample of unified school districts constructed in Barrow and Rouse (2004). Table 11 Effect of Change in Fiscal Surplus on Residential Investment: National Sample of School Districts   Column (1): (Δ Housing Units / Housing Units) * 1000 Column (2): (Δ Housing Units / Housing Units) * 1000 Column (3): (Δ Housing Units / Housing Units) * 1000 Panel A: OLS regressions       Net New Grants per Pupil -0.047 -0.078   Net New Grants per Pupil (s.d.) (0.002) (0.003)   Net New Grants per Pupil * (100% Urban)     -0.012 Net New Grants per Pupil * (100% Urban) (s.d.)     (0.004) Net New Grants per Pupil * (< 100% Urban)     -0.052 Net New Grants per Pupil * (< 100% Urban) (s.d.)     (0.003) Net New Grants per Pupil * (Top 20th Percentile of Average Household Income)     -0.032 Net New Grants per Pupil * (Top 20th Percentile of Average Household Income) (s.d.)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}