{
    "relation": [
        [
            "Patent application number",
            "20120082865",
            "20130128378",
            "20140030551",
            "20140099517"
        ],
        [
            "Description",
            "METHOD FOR FORMING A MAGNETIC RECORDING MEDIUM AND A MAGNETIC RECORDING MEDIUM FORMED THEREOF - A method for forming magnetic media is provided. The method of forming the magnetic media includes forming a plurality of regions of resist material on a top surface of a substrate which defines a plurality of regions of exposed substrate on the top surface of the substrate between adjacent ones of the plurality of regions of resist material. The method also includes forming magnetic material on the plurality of regions of resist material and the plurality of regions of exposed substrate and depositing material over the magnetic material, the material encapsulating a portion of the magnetic material formed on the plurality of regions of exposed substrate. A magnetic recording medium formed in accordance with the method is also provided.",
            "MEDIUM, METHOD OF FABRICATING A MEDIUM, RECORDING SYSTEM AND METHOD OF CONTROLLING A RECORDING SYSTEM - A medium may be provided. The medium includes a servo layer, a data recording layer, and a heat sink layer disposed between the servo layer and the recording layer.",
            "Recording Medium and Method of Forming the Same - In various embodiments, a recording medium may be provided. The recording medium may include a servo layer. The recording medium may further include a data recording layer. The recording medium may additionally include a crystal-like soft underlayer (SUL). The data recording layer and the servo layer may be on a same side of the crystal-like soft underlayer.",
            "RECORDING MEDIUM FOR HEAT-ASSISTED-MAGNETIC-RECORDING (HAMR) AND METHOD FOR MANUFACTURING THE SAME - According to embodiments of the present invention, a method for manufacturing a recording medium for heat-assisted-magnetic-recording (HAMR) is provided. The method includes forming an underlayer on a substrate, the underlayer including a precursor material, epitaxially depositing an interlayer on the underlayer, forming a recording layer over the interlayer, and converting the precursor material to a converted material having a thermal conductivity that is higher than a thermal conductivity of the recording layer. According to further embodiments of the present invention, another method for manufacturing a recording medium for heat-assisted-magnetic-recording (HAMR) and a recording medium for heat-assisted-magnetic-recording (HAMR) are also provided."
        ],
        [
            "Published",
            "04-05-2012",
            "05-23-2013",
            "01-30-2014",
            "04-10-2014"
        ]
    ],
    "pageTitle": "Shi - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/shi-6/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00174-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 435254703,
    "recordOffset": 435220630,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jianzhong Shi, Singapore SG 11-08-2012 SPRING LEAF AND OVERRUNNING CLUTCH PROVIDED WITH THE SAME - A spring leaf and an overrunning clutch provided with the same are provided. The spring leaf is made up of a support strip ( 20120279817 Published Description Patent application number Jianwei Shi, Changzhou CN 06-21-2012 PROCESS FOR DETECTING TRANSMITTED SYMBOLS BASED ON A TERNARY ALPHABET AND CORRESPONDING RECEIVER - A detection process of a communication channel based on a ternary alphabet is provided wherein the channel transmitting a signal transports the same transmitted symbol for N sequential slots within one Time Transmission Interval (TTI). The detection process comprises a mechanism that eliminates unwanted signal contributions and isolates noise contributions. The detection process estimates a noise variance and sums consecutive received signals of a same Transmission Time Interval (TTI) in order to isolate a transmitted signal portion. The detection further obtains a chi squared distribution, which is used to determine a threshold that is proportional to the estimated noise variance. The threshold is then used to detect the communication channel. 20120157104 Published Description Patent application number Jianliang Shi, Nuremberg DE 09-06-2012 REMOTE RADIO UNIT - The present invention relates to a communication device, and in particular, to a Remote Radio Unit (RRU). The RRU includes an RRU radiator structural member and a shell, where the shell includes an evaporator, radiating",
    "textAfterTable": "Patent applications by Jianzhong Shi, Singapore SG Jia Xiang Shi, Singapore SG Patent application number Description Published 20120011379 DEVICE FOR TAPPING USB POWER - A device includes a universal serial bus (USB) port comprising a data terminal and a power terminal to receive power from a remote USB port. The device includes a controller coupled to the data terminal of the USB port to provide a USB initialization signal. 01-12-2012 20130188655 ENCAPSULATION OF DATA - An encapsulation apparatus for encapsulating data includes an input to receive the data, a machine to generate information related to the encapsulation of data and a logic coupled to the machine. A processing machine is coupled to the input and the logic. 07-25-2013 Jie Shi, Nanjing City CN Patent application number Description Published 20130070458 HEAT DISSIPATING DEVICE FOR LED BULB AND LED BULB WITH HIGH HEAT DISSIPATION - A heat dissipating device ( 03-21-2013 Jinyang Shi, Shenyang City CN Patent application number Description Published 20120017379 OZONE LAUNDRY SYSTEMS AND RELATED METHODS - Ozone laundry systems and related methods are shown and",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}