{
    "relation": [
        [
            "Object",
            "Template-Attribute, Common Template-Attribute, Private Key Template-Attribute, Public Key Template-Attribute",
            "Name",
            "Attribute"
        ],
        [
            "Encoding",
            "Structure",
            "Structure, see 3.2",
            "Attribute Object, see 2.1.1"
        ],
        [
            "REQUIRED",
            "",
            "No, MAY be repeated.",
            "No, MAY be repeated"
        ]
    ],
    "pageTitle": "Key Management Interoperability Protocol Specification Version 1.1",
    "title": "",
    "url": "http://docs.oasis-open.org/kmip/spec/v1.1/os/kmip-spec-v1.1-os.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 69352411,
    "recordOffset": 69270042,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{51940=·         Key Management Interoperability Protocol Specification Version 1.0. 01 October 2010. OASIS Standard. http://docs.oasis-open.org/kmip/spec/v1.0/os/kmip-spec-1.0-os.html, 48194=Key Management Interoperability Protocol Specification Version 1.1. 24 January 2013. OASIS Standard. http://docs.oasis-open.org/kmip/spec/v1.1/os/kmip-spec-v1.1-os.html., 47674=Copyright © OASIS Open 2013. All Rights Reserved., 55220=24 January 2013}",
    "TableContextTimeStampAfterTable": "{32407=[RFC 3394]              J. Schaad, R. Housley, Advanced Encryption Standard (AES) Key Wrap Algorithm, IETF RFC 3394, Sep 2002, http://www.ietf.org/rfc/rfc3394.txt, 649128=Enumeration, see 9.1.3.2.19, 26959=[PKCS#5]                RSA Laboratories, PKCS #5 v2.1: Password-Based Cryptography Standard, Oct 5, 2006, http://www.rsa.com/rsalabs/node.asp?id=2127, 27783=[PKCS#8]                RSA Laboratories, PKCS#8 v1.2: Private-Key Information Syntax Standard, Nov 1, 1993, http://www.rsa.com/rsalabs/node.asp?id=2130, 455766=The Digest attribute is a structure (see Table 70) that contains the digest value of the key or secret data (i.e., digest of the Key Material), certificate (i.e., digest of the Certificate Value), or opaque object (i.e., digest of the Opaque Data Value). If the Key Material is a Byte String, then the Digest Value SHALL be calculated on this Byte String. If the Key Material is a structure, then the Digest Value SHALL be calculated on the TTLV-encoded (see Section 9.1) Key Material structure. The Key Format Type field in the Digest attribute indicates the format of the Managed Object from which the Digest Value was calculated. Multiple digests MAY be calculated using different algorithms listed in Section 9.1.3.2.16 and/or key format types listed in Section 9.1.3.2.3. If this attribute exists, then it SHALL have a mandatory attribute instance computed with the SHA-256 hashing algorithm. For objects registered by a client, the server SHALL compute the digest of the mandatory attribute instance using the Key Format Type of the registered object. In all other cases, the server MAY use any Key Format Type when computing the digest of the mandatory attribute instance, provided it is able to serve the object to clients in that same format. The digest(s) are static and SHALL be set by the server when the object is created or registered, provided that the server has access to the Key Material or the Digest Value (possibly obtained via out-of-band mechanisms)., 47208=[KMIP-UG]              Key Management Interoperability Protocol Usage Guide Version 1.1. 27 July 2012. OASIS Committee Note 01. http://docs.oasis-open.org/kmip/ug/v1.1/cn01/kmip-ug-v1.1-cn01.html., 39076=[SP800-38C]            M. Dworkin, Recommendation for Block Cipher Modes of Operation: the CCM Mode for Authentication and Confidentiality, NIST Special Publication 800-38C, May 2004, http://csrc.nist.gov/publications/nistpubs/800-38C/SP800-38C_updated-July20_2007.pdf, 43901=[X9.24-1]                 ANSI, X9.24 - Retail Financial Services Symmetric Key Management - Part 1: Using Symmetric Techniques, 2004., 45780=[X9-63]                    ANSI, X9-63: Public Key Cryptography for the Financial Services Industry, Key Agreement and Key Transport Using Elliptic Curve Cryptography, 2001., 306105=Enumeration, see 9.1.3.2.12, 40646=[SP800-56A]            E. Barker, D. Johnson, and M. Smid, Recommendation for Pair-Wise Key Establishment Schemes Using Discrete Logarithm Cryptography (Revised), NIST Special Publication 800-56A, Mar 2007, http://csrc.nist.gov/publications/nistpubs/800-56A/SP800-56A_Revision1_Mar08-2007.pdf, 28468=[RFC1319]               B. Kaliski, The MD2 Message-Digest Algorithm, IETF RFC 1319, Apr 1992, http://www.ietf.org/rfc/rfc1319.txt, 37422=[RFC5649]               R. Housley, Advanced Encryption Standard (AES) Key Wrap with Padding Algorithm, IETF RFC 5649, Aug 2009, http://www.ietf.org/rfc/rfc5649.txt, 687398=Enumeration, see 9.1.3.2.20, 32812=[RFC3447]               J. Jonsson, B. Kaliski, Public-Key Cryptography Standards (PKCS) #1: RSA Cryptography Specifications Version 2.1, IETF RFC 3447, Feb 2003, http://www.ietf.org/rfc/rfc3447.txt, 298166=Enumeration, see 9.1.3.2.11, 356618=Accredited Standards Committee X9, Inc. - Financial Industry Standards (www.x9.org) contributed to Table 49. Key role names and descriptions are derived from material in the Accredited Standards Committee X9, Inc's Technical Report \"TR-31 2005 Interoperable Secure Key Exchange Key Block Specification for Symmetric Algorithms\" and used with the permission of Accredited Standards Committee X9, Inc. in an effort to improve interoperability between X9 standards and OASIS KMIP. The complete ANSI X9 TR-31 is available at www.x9.org., 36327=[RFC4949]               R. Shirey, Internet Security Glossary, Version 2, IETF RFC 4949, Aug 2007, http://www.ietf.org/rfc/rfc4949.txt, 334834=Enumeration, see 9.1.3.2.17, 31054=[RFC2119]               S. Bradner, Key words for use in RFCs to Indicate Requirement Levels, http://www.ietf.org/rfc/rfc2119.txt, IETF RFC 2119, March 1997., 45395=[X9.62]                    ANSI, X9-62: Public Key Cryptography for the Financial Services Industry, The Elliptic Curve Digital Signature Algorithm (ECDSA), 2005., 25550=[ISO9797-1]             ISO/IEC, Information technology -- Security techniques -- Message Authentication Codes (MACs) -- Part 1: Mechanisms using a block cipher, ISO/IEC 9797-1, 1999, 314406=Enumeration, see 9.1.3.2.13, 109986=Enumeration, see 9.1.3.2.32, 38101=[SP800-38A]            M. Dworkin, Recommendation for Block Cipher Modes of Operation – Methods and Techniques, NIST Special Publication 800-38A, Dec 2001, http://csrc.nist.gov/publications/nistpubs/800-38a/sp800-38a.pdf, 46225=[X9-102]                  ANSI, X9-102: Symmetric Key Cryptography for the Financial Services Industry - Wrapping of Keys and Associated Data, 2008., 331853=Enumeration, see 9.1.3.2.14, 47719=[KMIP-TC]               Key Management Interoperability Protocol Test Cases Version 1.1. 27 July 2012. OASIS Committee Note 01. http://docs.oasis-open.org/kmip/testcases/v1.1/cn01/kmip-testcases-v1.1-cn01.html., 30637=[RFC2104]               H. Krawczyk, M. Bellare, R. Canetti, HMAC: Keyed-Hashing for Message Authentication, IETF RFC 2104, Feb 1997, http://www.ietf.org/rfc/rfc2104.txt, 45035=[X9-57]                    ANSI, X9-57: Public Key Cryptography for the Financial Services Industry: Certificate Management, 1997., 30194=[RFC1424]               B. Kaliski, Privacy Enhancement for Internet Electronic Mail: Part IV: Key Certification and Related Services, IETF RFC 1424, Feb 1993, http://www.ietf.org/rfc/rfc1424.txt, 27427=[PKCS#7]                RSA Laboratories, PKCS#7 v1.5: Cryptographic Message Syntax Standard, Nov 1, 1993, http://www.rsa.com/rsalabs/node.asp?id=2129, 35856=[RFC4880]               J. Callas, L. Donnerhacke, H. Finney, D. Shaw, and R. Thayer, OpenPGP Message Format, IETF RFC 4880, Nov 2007, http://www.ietf.org/rfc/rfc4880.txt, 40121=[SP800-38E]            M. Dworkin, Recommendation for Block Cipher Modes of Operation: The XTS-AES Mode for Confidentiality on Block-Oriented Storage Devices, NIST Special Publication 800-38E, Jan 2010, http://csrc.nist.gov/publications/nistpubs/800-38E/nist-sp-800-38E.pdf, 28846=[RFC1320]               R. Rivest, The MD4 Message-Digest Algorithm, IETF RFC 1320, Apr 1992, http://www.ietf.org/rfc/rfc1320.txt, 36640=[RFC5272]               J. Schaad and M. Meyers, Certificate Management over CMS (CMC), IETF RFC 5272, Jun 2008, http://www.ietf.org/rfc/rfc5272.txt, 46586=[X9 TR-31]              ANSI, X9 TR-31: Interoperable Secure Key Exchange Key Block Specification for Symmetric Algorithms, 2005., 24851=[IEEE1003-1]           IEEE Std 1003.1, Standard for information technology - portable operating system interface (POSIX). Shell and utilities, 2004., 36967=[RFC5280]               D. Cooper, S. Santesson, S. Farrell, S. Boeyen, R. Housley, W. Polk, Internet X.509 Public Key Infrastructure Certificate, IETF RFC 5280, May 2008, http://www.ietf.org/rfc/rfc5280.txt, 556392=Enumeration, see 9.1.3.2.31, 44243=[X9.31]                    ANSI, X9.31:Digital Signatures Using Reversible Public Key Cryptography for the Financial Services Industry (rDSA), Sep 1998., 42996=[SP800-108]            L. Chen, Recommendation for Key Derivation Using Pseudorandom Functions (Revised), NIST Special Publication 800-108, Oct 2009, http://csrc.nist.gov/publications/nistpubs/800-108/sp800-108.pdf, 35012=[RFC4211]               J. Schaad, Internet X.509 Public Key Infrastructure Certificate Request Message Format (CRMF), IETF RFC 4211, Sep 2005, http://www.ietf.org/rfc/rfc4211.txt, 80297=·         RSA keys are typically 1024, 2048 or 3072 bits in length, 912360=Object Group Member, see 9.1.3.2.33, 34592=[RFC4210]               C. Adams, S. Farrell, T. Kause and T. Mononen, Internet X.509 Public Key Infrastructure Certificate Management Protocol (CMP), IETF RFC 2510, Sep 2005, http://www.ietf.org/rfc/rfc4210.txt, 35439=[RFC4868]               S. Kelly, S. Frankel, Using HMAC-SHA-256, HMAC-SHA-384, and HMAC-SHA-512 with IPsec, IETF RFC 4868, May 2007, http://www.ietf.org/rfc/rfc4868.txt, 33647=[RFC3647]               S. Chokhani, W. Ford, R. Sabett, C. Merrill, and S. Wu, Internet X.509 Public Key Infrastructure Certificate Policy and Certification Practices Framework, IETF RFC 3647, Nov 2003, http://www.ietf.org/rfc/rfc3647.txt, 37834=[SHAMIR1979]        A. Shamir, How to share a secret, Communications of the ACM, vol. 22, no. 11, pp. 612-613, Nov 1979, 25920=[KMIP-Prof]            Key Management Interoperability Protocol Profiles Version 1.1. 21 September 2012. Candidate OASIS Standard 01. http://docs.oasis-open.org/kmip/profiles/v1.1/cos01/kmip-profiles-v1.1-cos01.html., 43417=[X.509]                    International Telecommunication Union (ITU)–T, X.509:  Information technology – Open systems interconnection – The Directory:  Public-key and attribute certificate frameworks, Aug 2005, http://www.itu.int/rec/T-REC-X.509-200508-I/en, 39626=[SP800-38D]            M. Dworkin, Recommendation for Block Cipher Modes of Operation: Galois/Counter Mode (GCM) and GMAC, NIST Special Publication 800-38D, Nov 2007, http://csrc.nist.gov/publications/nistpubs/800-38D/SP-800-38D.pdf, 24340=[FIPS198-1]             The Keyed-Hash Message Authentication Code (HMAC), FIPS PUB 198-1, Jul 2008, http://csrc.nist.gov/publications/fips/fips198-1/FIPS-198-1_final.pdf, 28127=[PKCS#10]              RSA Laboratories, PKCS #10 v1.7: Certification Request Syntax Standard, May 26, 2000, http://www.rsa.com/rsalabs/node.asp?id=2132, 845715=Derivation Method, see 9.1.3.2.21, 29223=[RFC1321]               R. Rivest, The MD5 Message-Digest Algorithm, IETF RFC 1321, Apr 1992, http://www.ietf.org/rfc/rfc1321.txt, 41276=[SP800-56B]            E. Barker, L. Chen, A. Regenscheid, and M. Smid, Recommendation for Pair-Wise Key Establishment Schemes Using Integer Factorization Cryptography, NIST Special Publication 800-56B, Aug 2009, http://csrc.nist.gov/publications/nistpubs/800-56B/sp800-56B.pdf, 87012=Enumeration, see 9.1.3.2.13, 275460=Enumeration, see 9.1.3.2.10, 42485=[SP800-67]              W. Barker, Recommendation for the Triple Data Encryption Algorithm (TDEA) Block Cipher, NIST Special Publication 800-67, Version 1.1, Revised 19 May 2008, http://csrc.nist.gov/publications/nistpubs/800-67/SP800-67.pdf, 23811=[FIPS197]               Advanced Encryption Standard, FIPS PUB 197, Nov 2001, http://csrc.nist.gov/publications/fips/fips197/fips-197.pdf, 31412= [RFC 2246]             T. Dierks and C. Allen, The TLS Protocol, Version 1.0, IETF RFC 2246, Jan 1999, http://www.ietf.org/rfc/rfc2246.txt, 26565=[PKCS#1]                RSA Laboratories, PKCS #1 v2.1: RSA Cryptography Standard, Jun 14, 2002,  http://www.rsa.com/rsalabs/node.asp?id=2125, 48330=[ISO/IEC 9945-2]     The Open Group, Regular Expressions, The Single UNIX Specification version 2, 1997, ISO/IEC 9945-2:1993, http://www.opengroup.org/onlinepubs/007908799/xbd/re.html, 23274= [FIPS186-3]            Digital Signature Standard (DSS), FIPS PUB 186-3, Jun 2009, http://csrc.nist.gov/publications/fips/fips186-3/fips_186-3.pdf, 574274=Enumeration, see 9.1.3.2.18, 872261=Certificate Request Type, see 9.1.3.2.22, 332864=Enumeration, see 9.1.3.2.15, 38583=[SP800-38B]            M. Dworkin, Recommendation for Block Cipher Modes of Operation: The CMAC Mode for Authentication, NIST Special Publication 800-38B, May 2005, http://csrc.nist.gov/publications/nistpubs/800-38B/SP_800-38B.pdf, 25234=[ISO16609]              ISO, Banking -- Requirements for message authentication using symmetric techniques, ISO 16609, 1991, 31946=[RFC2898]               B. Kaliski, PKCS #5: Password-Based Cryptography Specification Version 2.0, IETF RFC 2898, Sep 2000, http://www.ietf.org/rfc/rfc2898.txt, 44619=[X9.42]                    ANSI, X9-42: Public Key Cryptography for the Financial Services Industry: Agreement of Symmetric Keys Using Discrete Logarithm Cryptography, 2003., 29600=[RFC1421]               J. Linn, Privacy Enhancement for Internet Electronic Mail: Part I: Message Encryption and Authentication Procedures, IETF RFC 1421, Feb 1993, http://www.ietf.org/rfc/rfc1421.txt, 41870=[SP800-57-1]           E. Barker, W. Barker, W. Burr, W. Polk, and M. Smid, Recommendations for Key Management - Part 1: General (Revised), NIST Special Publication 800-57 part 1, Mar 2007, http://csrc.nist.gov/publications/nistpubs/800-57/sp800-57-Part1-revised2_Mar08-2007.pdf, 333851=Enumeration, see 9.1.3.2.16, 33258=[RFC3629]               F. Yergeau, UTF-8, a transformation format of ISO 10646, IETF RFC 3629, Nov 2003, http://www.ietf.org/rfc/rfc3629.txt, 34095=[RFC4055]               J. Schadd, B. Kaliski, and R, Housley, HHAdditional Algorithms and Identifiers for RSA Cryptography for use in the Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile, IETF RFC 4055, June 2055, http://www.ietf.org/rfc/rfc4055.txt}",
    "lastModified": "Thu, 24 Jan 2013 17:00:00 GMT",
    "textBeforeTable": "When an Attribute structure is used to specify or return a particular instance of an Attribute and the Attribute Index is not specified it SHALL be assumed to be 0. An Attribute object is a structure (see Table 2) used for sending and receiving Managed Object attributes. The Attribute Name is a text-string that is used to identify the attribute. The Attribute Index is an index number assigned by the key management server. The Attribute Index is used to identify the particular instance. Attribute Indices SHALL start with 0. The Attribute Index of an attribute SHALL NOT change when other instances are added or deleted. Single-instance Attributes (attributes which an object MAY only have at most one instance thereof)  SHALL have an Attribute Index of 0. The Attribute Value is either a primitive data type or structured object, depending on the attribute. 2.1.1 Attribute These objects are used within the messages of the protocol, but are not objects managed by the key management system. They are components of Managed Objects. 2.1 Base Objects Structures are composed of ordered lists of primitive data types or sub-structures. ·         Interval –  a length of time expressed in seconds ·         Date-Time –  date and time, with a granularity of one second ·         Byte String –  sequence",
    "textAfterTable": "Attribute Value Varies, depending on attribute. See Section 3 Yes, except for the Notify operation (see Section 5.1) Table 2: Attribute Object Structure 2.1.2 Credential A Credential is a structure (see Table 3) used for client identification purposes and is not managed by the key management system (e.g., user id/password pairs, Kerberos tokens, etc). It MAY be used for authentication purposes as indicated in [KMIP-Prof]. Object Encoding REQUIRED Credential Structure  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}