{
    "relation": [
        [
            "Name",
            "Cerdocyon thous",
            "Speothos venaticus"
        ],
        [
            "Museum",
            "ROM",
            "ROM"
        ],
        [
            "CITES",
            "II",
            "I"
        ],
        [
            "IUCN",
            "",
            "VU"
        ],
        [
            "Monitor",
            "",
            ""
        ]
    ],
    "pageTitle": "Checklist of the Mammals of Guyana",
    "title": "",
    "url": "http://botany.si.edu/bdg/guymammals.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00227-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 40241715,
    "recordOffset": 40224707,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{6879=Indications are given in the final column if close monitoring of a species is needed, as presented in: Engstrom, M.D., and B.K. Lim. 2001. Mamíferos de Guyana. In: Ceballos, G., and J.A. Simonetti (eds.). Diversidad y conservación de los mamíferos de Latinoamérica. Fondo de Cultura Económica-UNAM. México, D.F. In press., 7271=Vernacular names follow: Emmons, Louise H. and François Feer. 1997. Neotropical Rainforest Mammals: A Field Guide. Second edition. University of Chicago Press.}",
    "lastModified": "Wed, 08 Jan 2014 14:29:54 GMT",
    "textBeforeTable": "Opossums Family Didelphidae    Subfamily Caluromyinae ORDER DIDELPHIMORPHA   Quelch, J. J. 1901. Animal life in British Guiana. The Argosy Company, Limited, Georgetown, Guyana. Bertram, C. 1963. In Search of Mermaids: The Manatees of Guiana. Peter Davies Ltd., London, 183 pp. USNM - Department of Vertebrate Zoology, National Museum of Natural History, Smithsonian Institution, Washington DC. ROM - Royal Ontario Museum, Toronto. BMNH - British Museum (Natural History), London. AMNH - American Museum of Natural History, New York. Musuems holding voucher specimens and publications cited are abbreviated as follows: Vernacular names follow: Emmons, Louise H. and François Feer. 1997. Neotropical Rainforest Mammals: A Field Guide. Second edition. University of Chicago Press. Indications are given in the final column if close monitoring of a species is needed, as presented in: Engstrom, M.D., and B.K. Lim. 2001. Mamíferos de Guyana. In: Ceballos, G., and J.A. Simonetti (eds.). Diversidad y conservación de los mamíferos de Latinoamérica. Fondo de Cultura Económica-UNAM. México, D.F. In press. Conservation information includes CITES Appendix listings and IUCN Red List of Threatened Animals categories. CITES Appendix I lists species that are threatened with extinction. Trade in specimens of these species is permitted only in exceptional circumstances. CITES Appendix II lists species that are not necessarily threatened with extinction, but in which trade must be controlled in order to avoid utilization incompatible with their survival. IUCN Codes included are CR,",
    "textAfterTable": "  Family Didelphidae    Subfamily Didelphinae Opossums Name Museum CITES IUCN Monitor Chironectes minimus ROM CR Didelphis albiventris ROM Didelphis marsupialis ROM Gracilinanus kalinowskii ROM Lutreolina crassicaudata BMNH Marmosa lepida ROM Marmosa murina ROM Marmosops parvidens ROM CR Marmosops pinheiroi ROM Metachirus nudicaudatus ROM Micoueus demerarae ROM Monodelphis brevicaudata ROM Philander opossum ROM   ORDER XENARTHRA Family Bradypodidae    Subfamily Bradypodinae Three-toed Sloths Name Museum CITES IUCN Monitor Bradypus tridactylus ROM MON   Family Megalonychidae    Subfamily Choleopinae Two-toed Sloths Name Museum CITES IUCN Monitor Choloepus didactylus ROM DD   Family Dasypodidae    Subfamily Dasypodinae Armadillos Name Museum CITES IUCN Monitor Cabassous unicinctus ROM Dasypus kappleri ROM Dasypus novemcinctus ROM Priodontes maximus ROM",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}