{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "One thing that I did not appreciate from Canisius is that I was told in my orientation non stop about how students safety is first priority and I found that not to be true. There is a shuttle that students are supposed to be able to call and they come to you and bring you where you need to go on campus immediately with no problems. However I think that the shuttle actually showed up maybe 2 out of every 10 times I would call. Also, my life was threatened by a student at one point, and since this students family donated money to school, the situation was handled very seriously, and she did not receive any harsh punishment. I continued to get harassed by her and her friends, with no help from the school.",
            "I think that any type of club that you would be looking for, you could find at Canisius.",
            "Students that learn best in a small environment, and have a lot of money, this is the perfect school.",
            "Canisius has a college right in the middle of campus. I know that was very comforting to a lot of students that did not live close by, because they still could go to church when they wanted.",
            "I do believe that I got a top of the line education at Canisius, however I do not believe that any education is worth the amount of money that I now owe. With the way the economy is, it is very hard to find a job immediately after graduating, yet you have loans to start to pay off. I do not know if I would go to Canisius again if I had the choice, just because I am unable to start my life because of how much I am paying in loans.",
            "There are many clubs within Canisius that you could join. Canisius is great with keeping students updated through e-mail of all the different events that are taking place on campus. It is a small college, which makes communication travel fast, and makes you feel as if you are in a family environment. Also, there are subway entrances steps away from campus that bring you to the heart of downtown in minutes. If you are looking to keep busy, you will have no problems doing so at Canisius.",
            "The food is good. There are many options as to what to get at the different cafeteria's, and then there is even a little mini grocery store if you get sick of the food from the school. Subway and Tim Hortons are both also located inside of the school.",
            "The dorms are very nice compared to dorms I have seen at other schools. I personally did not enjoy the dorm life because I was with roommates I did not get along with, and Resident Life was not too helpful in those tough situations either. However, if you get roommates you enjoy, the dorms are nice.",
            "It is definitely a competitive school. You have to work hard, and invest a lot of time, but it is for a good reason. It is tough for a reason, because you are gaining a great education from it.",
            "Search for as many scholarships as possible, and financial aide. If you are not rewarded a lot of money to assist you to pay for school, then look into other schools. I value the education I got at Canisius a tremendous amount, however am finding it near impossible to pay off all of my loans.",
            "Canisius has the elite professionals working for them. The teachers are experts in their subjects. However it is very expensive."
        ]
    ],
    "pageTitle": "Canisius College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Canisius-College/reviews?_escaped_fragment_=/show/70709",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00004-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909619619,
    "recordOffset": 909570166,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{202072=© 2015, Cappex.com, LLC, 161056=Get your application in early! The earlier your application is in and you make your deposit, the more housing options you have. If you qualify for honors or are interested in service, you can live on the honors or Ignatian floors. These two floors are in the freshman hall that was built in 2008. They are modern and very spacious. Another benefit is that they are air-conditioned. Another tip is if you have taken college classes in high school, send them to the college to see if they transfer. The more core requirements you can get out of the way, the faster you can start working on the classes that really count towards your major.}",
    "textBeforeTable": "12/31/2009 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 42 Lauren from NY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Am enjoying being here I don't believe I am a good view on the good points of the school, as I really didn't spend time on campus in my first year more than for my classes during the school year. What time I did spend there was very enjoyable, with many things to do in the evening. There are many places around campus to hang out with friends, a lot of events that happen every week, It's hard to find a day that there is nothing you can do. Am learning a lot Yes and no. Much of the 100 classes are review if you have taken high school level versions of the classes. You can cruise through with ease if you are motivated to learn and complete course work and home work. You won't get much learning, outside of the History and the technology fields, until your second year if you have already started to work on your field of study. Login to rate or flag the reviews Al from Lancaster, NY 07/06/2011 Reviewer is A current student here. 3 out of 3 people found this review useful.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}