{
    "relation": [
        [
            "Resource",
            "AIX",
            "ACF2",
            "ClearTrust",
            "Entrust",
            "GroupWise",
            "HP-UX",
            "LDAP",
            "Oracle",
            "NDS",
            "PeopleSoft",
            "RACF",
            "SAP",
            "SecurID",
            "SP2",
            "Solaris",
            "TopSecret",
            "VMS",
            "Windows Active Directory"
        ],
        [
            "Supported Object Types",
            "account, Group",
            "account",
            "account, Group, group, Administrator_Groups, Applications, Entitlements, User_Properties",
            "Group, Role",
            "account, Distribution Lists, PostOffices",
            "account, Group, shell",
            "account, Group",
            "USERS, ROLE, PROFILE",
            "account, Group",
            "account",
            "account, Group",
            "account, table, profiles, activitygroups",
            "UnassignedTokens",
            "Nodes",
            "account, Group, shell",
            "account",
            "account",
            "account, Group You can specify any Active Directory valid object class name as an object type. (A list of object class names can be found in the Active Directory schema documentation.) The list returned contains the distinguished names of the objects. By default, the method searches in the container that is specified by the Container resource attribute. However, you can specify a container as an option to the listResourceObjects call. Its value should be the distinguished name of a container. Only objects within that container are listed."
        ]
    ],
    "pageTitle": "Editing a Form (Oracle Waveset 8.1.1 Deployment Reference)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19225-01/821-0378/bvahi/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00305-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 68285667,
    "recordOffset": 68251276,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 16 Jun 2011 09:24:18 GMT",
    "textBeforeTable": "Table 2–11 Possible Values for the command Parameter Some page processing systems, notably the one that processes XML forms, expect the command parameter to be used. Further, several command parameter values have been used to indicate particular actions. These values are described in the following table. All pages in the Waveset interfaces have used the post data parameter named command as a mechanism to convey which form submission button was pressed. Page processing systems using components are not required to follow the same convention, but there are some components that contain special support for the command parameter, in particular the Button component. This section is important only if you are building Button objects. If you are building components from XML forms, you can assume that the values in the following table are recognized. Note – Command Values and Buttons </Field> </Display> <Property name=’location’ value=’true’/> <Property name=’command’ value=’Cancel’/> <Property name=’label’ value=’Cancel’/> <Display class=’Button’> <Field> </Field> </Display> <Property name=’command’ value=’Save’/> <Property name=’value’ value=’true’/> <Property name=’name’ value=’submitButton’/> <Property name=’label’ value=’Submit’/> <Display class=’Button’> <Field>     At the bottom of the form, add the following fields for the Save and Cancel buttons, and change the labels as desired:   <Form name=’Anonymous User Menu’ noDefaultButtons=true> to <Form name=’Anonymous User Menu’>    On the line that defines the form",
    "textAfterTable": "Component   Description   <SimpleTable> Arranges components in a grid with an optional row of column titles at the top  <ButtonRow> Arranges button in a horizontal row. This component is essentially a panel that is preconfigured for horizontal layout.  <BorderedPanel> Positions components into five regions: north, south, east, and west  <SortingTable> Displays a blue and beige table with sortable columns.  Creating a Simple Table The <SimpleTable> component is a frequently used container component in Waveset forms. It arranges components in a grid with an optional row of column titles at the top. The only property for this display component is columns, which assigns column titles and defines the width of the table as defined in a list of strings. In the following example, a field that uses SimpleTable to organize several subfields: <Field name=’SelectionTable’> <Display class=’SimpleTable’> <Property name=’columns’> <List> <String>Account</String> <String>Description</String> </List> </Property> </Display> <Field name=’accounts[LDAP].selected’> <Display class=’Checkbox’> <Property name=’label’ value=’LDAP’/> </Display> </Field> <Field> <Display class=’Label’> <Property name=’text’ value=’Primary Corporate LDAP Server’/> </Display> </Field> <Field name=’accounts[W2K].selected’> <Display",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}