{
    "relation": [
        [
            "",
            "Name",
            "David W. Biegler",
            "J. Veronica Biggins",
            "Douglas H. Brooks",
            "William H. Cunningham",
            "John G. Denison",
            "Gary C. Kelly",
            "Nancy B. Loeffler",
            "John T. Montford",
            "Thomas M. Nealon",
            "Daniel D. Villanueva"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Director Since",
            "2006",
            "2011",
            "2010",
            "2000",
            "2008",
            "2004",
            "2003",
            "2002",
            "2010",
            "2008"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Age*",
            "65",
            "65",
            "59",
            "67",
            "66",
            "56",
            "65",
            "68",
            "50",
            "74"
        ]
    ],
    "pageTitle": "<![CDATA[DEFINITIVE NOTICE & PROXY STATEMENT]]>",
    "title": "",
    "url": "http://www.wikinvest.com/stock/Southwest_Airlines_Company_(LUV)/Filing/DEF_14A/2012/F101056486",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00015-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 840300143,
    "recordOffset": 840180143,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{970147=During 2011, the Company provided free travel on Southwest Airlines (and, for a portion of the year, AirTran Airways) on a reserved basis for Board members and their spouses, children, and spouses of their children. In addition, for 2011, Board members were provided up to 20 free roundtrip flight passes, which they could give to anyone on an unrestricted basis (e.g., for charitable purposes). For 2011, Board members also received gross-ups on their taxes related to these flight benefits. Effective with respect to reservations placed on or after February 1, 2012, (i) only Board members and their spouses (and not children and spouses of children) are eligible for free travel on a reserved basis, and (ii) Board members will be provided up to 25 (instead of 20) roundtrip flight passes. In addition, Board members will no longer receive tax gross-ups related to their travel privileges., 305013=Gary C. Kelly has served as the Company\u0092s Chairman of the Board since May 2008, as its President since July 2008, and as its Chief Executive Officer since July 2004. Mr. Kelly also served as the Company\u0092s Executive Vice President and as its Chief Financial Officer from June 2001 to July 2004 and Vice President Finance and Chief Financial Officer from 1989 to 2001. Mr. Kelly joined the Company in 1986 as its Controller. During the past five years, Mr. Kelly has served as a Director of one publicly traded company other than Southwest: Lincoln National Corporation (since November 2009)., 314218=Daniel D. Villanueva has been a partner in RC Fontis, a California-based private equity firm, since 2005. Mr. Villanueva previously was Managing Partner of Bastion Capital Corporation, a private equity investment fund, from 1993 to 2005. Mr. Villanueva also has over 25 years experience as a television executive, having served as Senior Vice President, Partner, and Director at Spanish International Communications Corp. and its successor company Univision Group over the period from 1964 to 1990. Mr. Villanueva has also developed and sold numerous broadcasting properties across the United States. Mr. Villanueva\u0092s civic activities have included board memberships of the American Red Cross, the National Association of Broadcasters, National Junior Achievement, National YMCA, the National Hispanic Education Fund, the California Broadcasters Association, the California Economic Development Corporation, the Greater Los Angeles Chamber of Commerce, KCET Public Television, the United Way, Stanford Graduate School of Business, the Ventura County Community Foundation, and the Museum of Contemporary Art. Mr. Villanueva was also a Commissioner of the 1984 Summer Olympic Games in Los Angeles. During the past five years, he has served as a Director of one publicly traded company other than Southwest: Fleetwood Enterprises, Inc. (2003-2009)., 457512=Southwest Cargo was named Domestic Carrier of the Year for 2011 by the Airforwarders Association for the second consecutive year and was recognized for excellence in Air Cargo World\u0092s annual Air Cargo Excellence (ACE) Survey., 542039=Emeritus, Mr. Herbert D. Kelleher. Mr. Kelly\u0092s deferred compensation arrangement is discussed in more detail below under \u0093Nonqualified Deferred Compensation in Fiscal 2011.\u0094, 973566=Based on the foregoing review and discussions and relying thereon, the Audit Committee recommended to the Company\u0092s Board of Directors that the audited financial statements be included in the Company\u0092s Annual Report on Form 10-K for the fiscal year ended December 31, 2011., 492604=Towers Watson Database. The general industry data included in the 2011 Assessment included information from 67 of the companies participating in Towers Watson\u0092s 2010 Executive Compensation database. The independent consultant identified industries that it considered to be representative of consumer-oriented industries (defined broadly to include hospitality, transportation, media, retail, and similar industries). The resulting group was composed of all companies in the database within these industries. The data was adjusted by the independent consultant to take into account differences in company size., 1058051=Adopted March 20, 2003, 260710=Option Exercises and Stock Vested During Fiscal 2011, 454235=The Company reached a historic agreement with The Boeing Company to become the launch customer for the Boeing 737 MAX aircraft, which is expected to enter service in 2017., 1081108=Use the Internet to transmit your voting instructions until 11:59 P.M. Eastern Time on May 15, 2012 (May 14, 2012 for participants in the Southwest Airlines Co. ProfitSharing Plan). Have your proxy card in hand when you access the web site and follow the instructions to obtain your records and to create an electronic voting instruction form., 1094961=The undersigned hereby appoints Gary C. Kelly, Laura H. Wright, and Ron Ricks, and each of them, as proxies, each with full power of substitution, and hereby authorizes each of them to represent and to vote, as designated on the reverse side of this form, all shares of Common Stock of Southwest Airlines Co. that the undersigned is entitled to vote at the Annual Meeting of Shareholders of Southwest Airlines Co. to be held at the Hyatt Regency Dallas, 300 Reunion Boulevard, Dallas, Texas, on May 16, 2012, at 10:00 a.m., Central Daylight Time, or at any adjournment or postponement thereof., 451219=2011 operating revenues of $15.7 billion represented an increase of 29.4 percent over 2010 operating revenues of $12.1 billion., 494058=Towers Watson Custom Survey. The airline industry data included in the 2011 Assessment included information from Towers Watson\u0092s 2009 custom survey, The Airline Industry Compensation Survey, which included data for the following eight airlines that chose to participate in the survey: American, 501327=retain the Company\u0092s strong leadership team. As a result, the Committee increased each of the named executive officer\u0092s base pay. In addition to addressing retention concerns, the Committee\u0092s decision was intended to recognize the named executive officers\u0092 willingness to lead by example with respect to base pay during difficult economic times despite being asked to take on increasing responsibilities during these years. In particular, the Committee, along with the other independent members of the Board, deemed it advisable and in the best interests of the Company to increase the Chief Executive Officer\u0092s base pay to an amount commensurate with the additional responsibilities taken on by him in 2008 when he became Chairman of the Board and President of the Company., 261389=Nonqualified Deferred Compensation in Fiscal 2011, 461520=Southwest was recognized as the fourth most admired Company in the world by FORTUNE magazine\u0092s 2011 survey of corporate reputations, the only U.S. airline to make this list of the World\u0092s Top 50 Most Admired Companies., 1015022=To permit the Company and its Shareholders to deal with Shareholder proposals in an informed and orderly manner, the Company\u0092s Bylaws establish an advance notice procedure with regard to the nomination (other than by or at the direction of the Board of Directors) of candidates for election to the Board of Directors and with regard to certain other matters to be brought before an Annual Meeting of Shareholders. The Company\u0092s Bylaws provide that, in order for a proposal that is not intended to be included in the Company\u0092s proxy statement to be properly and timely submitted as business to come before the Company\u0092s 2013 Annual Meeting of Shareholders, the proposal must be received by the Secretary of the Company not less than 60 days nor more than 90 days prior to the meeting. If less than 30 days\u0092 notice or prior public disclosure of the date of the meeting is given or made to Shareholders, written notice must be received not later than the close of business on the tenth day following the day on which such notice of the date of the Annual Meeting is mailed or such public disclosure is made. Any Shareholder proposal or nomination must contain the information specified in the Company\u0092s Bylaws concerning the matter to be brought before the meeting or the person to be nominated and the Shareholder submitting the proposal. Any notice relating to a Shareholder nomination of a person or persons for election to the Board must contain (i) as to each nominee, all information required to be disclosed in solicitations of proxies for election of Directors pursuant to Regulation 14A under the Securities Exchange Act of 1934, as amended; (ii) the name and address of the Shareholder giving the notice; and (iii) the number of shares of the Company beneficially owned by the Shareholder giving the notice. Based on a 2013 Annual Meeting date corresponding to this year\u0092s Annual Meeting date (and assuming a 30-day notice or public disclosure of such Annual Meeting date), if the Company does not receive notice of a proposal before March 17, 2013, it will be considered \u0093untimely\u0094 and the proxy committee may properly use its discretionary authority to vote for or against the proposal. A copy of the applicable Bylaw provisions may be obtained, without charge, upon written request to the Secretary of the Company at the address set forth on page 1 of this proxy statement., 495273=Proxy Statement Data. The airline industry data included in the 2011 Assessment also included information from the 2010 proxy statements of the following companies: Alaska Air Group, Inc., AMR Corporation (the parent company of American Airlines, Inc.), Delta Air Lines, Inc., JetBlue Airways Corporation, United Continental Holdings, Inc., and US Airways Group, Inc., 275801=To be Held May 16, 2012, 303144=John G. Denison served as Chairman of the Board for Global Aero Logistics Inc. (\u0093Global\u0094), a diversified passenger airline, from January 2006 until April 2008. Mr. Denison came out of retirement in January 2005 to join Global as its Co-Chief Restructuring Officer. He also served as President and Chief Executive Officer of ATA Airlines Inc. (\u0093ATA\u0094), a subsidiary of Global, from February 2005 until December 2006. In his capacities with Global and ATA, Mr. Denison\u0092s responsibilities included, among others, managing or supervising business plans, collective bargaining negotiations, restructurings, financings, and major contract negotiations. ATA filed a voluntary petition under Chapter 11 of the U.S. Bankruptcy Code in April 2008., 474615=During 2011, the Committee continued to execute a multi-year plan for addressing the adequacy and retention value of the Company\u0092s executive compensation, while at the same time (i) linking executive pay more closely to Company and individual performance than had historically been the case and (ii) providing for a significant percentage of pay at risk. The multi-year plan was implemented in connection with data provided by the Committee\u0092s independent consultant in 2009 and the independent consultant\u0092s related assessments and recommendations (collectively, the \u00932009 Assessment\u0094). Based on the 2009 Assessment, the Committee and its independent consultant concluded that the Company\u0092s executive compensation was inadequate to the point of presenting serious retention risks because it was not within a reasonable range of median compensation, based on available market data both within and outside of the airline industry. For purposes of this Compensation Discussion and Analysis, references to \u0093adequacy,\u0094 \u0093retention value,\u0094 \u0093competitiveness,\u0094 and \u0093appropriateness\u0094 of compensation (and similar references), as well as comparisons to \u0093market,\u0094 should be interpreted in this context. To address the Committee\u0092s concerns regarding executive retention, as well as its desire to increase pay at risk, in 2010, the Committee significantly increased the named executive officers\u0092 opportunities to increase their total compensation through short-term (annual bonus) and long-term (equity), 244211=Southwest\u0092s Proxy Statement for the 2012 Annual Meeting of Shareholders and Annual Report to Shareholders for the fiscal year ended December 31, 2011, are available at, 917977=Consists of (i) a retirement payment of $75,000 pursuant to the Company\u0092s Amended and Restated Severance Plan for Directors discussed below; (ii) a payout of $79,785 under the Company\u0092s Outside Director Incentive Plan; and (iii) a gross-up for taxes on flight benefits. Through May 2009, non-Employee members of the Board received annual grants of performance shares pursuant to the Company\u0092s Outside Director Incentive Plan, which terminated effective March 18, 2010, with respect to future grants. Pursuant to the terms of the Outside Director Incentive Plan, on the 30th calendar day following the date on which Mr. Johnson ceased to serve as a Director of the Company, he became entitled to an amount in cash equal to the average fair market value of the Company\u0092s common stock during the 30 days preceding his last date of service multiplied by the 6,750 performance shares then held by him., 452624=Net cash provided by operations for 2011 was $1.4 billion, and the Company ended 2011 with $3.1 billion of core unrestricted cash and short-term investments., 499329=Approach to, and Justification of, 2011 Base Pay. The Company\u0092s objective with respect to base pay is to provide a reasonable (around the mid-range of market), as opposed to highly competitive, base level of monthly income relative to an Employee\u0092s job responsibilities and the market for the Employee\u0092s skills (both within and outside of the airline industry). Prior to 2011, Messrs. Kelly, Ricks, Van de Ven, and Jordan had not received an increase in base pay since July 2008, and Ms. Wright had not received an increase in base pay since April 2007. In addition, Mr. Kelly voluntarily reduced his base pay for a portion of 2009. Although the Committee strongly believed that all of the named executive officers should have received base pay increases prior to 2011, Mr. Kelly recommended that executive salaries remain the same, in light of the extremely negative impact that economic instability and volatile fuel prices were having on the Company\u0092s results., 489993=The general industry data included in the 2009 Assessment included information from participants in Towers Watson\u0092s Executive Compensation database, screened by similar revenue scope when available. The database consisted of 750 companies, and the data was adjusted by the independent consultant to take into account differences in company size., 981175=The named executive officer compensation structure for 2011 reflects the Compensation Committee\u0092s implementation of a multi-year plan for addressing the adequacy and retention value of the Company\u0092s executive compensation, while at the same time providing for a significant percentage of pay at risk. Short-term incentive pay for 2011 was based in large part on the Compensation Committee\u0092s view that the Company\u0092s financial, operational, and Customer Service accomplishments, as well as its accomplishments as an employer, were strongly tied to the Company\u0092s core objectives for creating long-term Shareholder value. The named executive officers\u0092 equity awards reflect the Compensation Committee\u0092s desire that a significant portion of their future compensation opportunities be directly aligned with the interests of other Shareholders, as the compensation opportunity associated with equity awards fluctuates with the Company\u0092s stock price. Additional detail regarding the Compensation Committee\u0092s rationale for its bonus and equity award determinations are discussed above under \u0093Compensation Discussion and Analysis \u0097 Determination of 2011 Executive Compensation; Analysis of Individual Compensation Elements.\u0094, 978925=During 2011, the Company acquired AirTran Airways, which allowed the Company to immediately and significantly expand and diversify its overall route network and thereby provide a near-term growth opportunity not otherwise available to the Company., 988105=\u0093RESOLVED, that the Shareholders approve, on an advisory basis, the compensation of the named executive officers, as disclosed in the Company\u0092s proxy statement for the 2012 Annual Meeting of Shareholders pursuant to Item 402 of Regulation S-K, including the Compensation Discussion and Analysis, the compensation tables, and any related narrative disclosures.\u0094, 352050=The Compensation Committee has historically exercised a certain amount of discretion in granting bonuses, in part to minimize the risk-taking that can result from strict application of performance-based awards. For 2011, bonus and equity awards were ultimately within the discretion of the Compensation Committee, and Employees were not formally notified of a link between performance standards and potential bonus payouts; therefore they were not incentivized to solely pursue narrowly-defined goals to achieve a particular level of bonus., 236181=The Annual Meeting of the Shareholders of Southwest Airlines Co. will be held at the Hyatt Regency Dallas located at 300 Reunion Boulevard, Dallas, Texas on Wednesday, May 16, 2012, at 10:00 a.m., Central Daylight Time, for the following purposes:, 913952=Prior to May 19, 2010, pursuant to the terms of the Company\u0092s 2007 Equity Incentive Plan, non-Employee members of the Board received automatic grants of stock options upon their appointment or election to the Board. None of the Directors received option awards during 2011. The aggregate number of shares underlying stock options outstanding at fiscal year-end for each of the Directors listed in the table was as, 513672=Throughout 2011, the Committee regularly assessed (i) if and how specific targets and metrics could be applied to the goals within the Scoreboard; (ii) how best to measure performance against the Scoreboard; (iii) to what extent bonus determinations should be based on individual performance versus Company performance; and (iv) the risks and benefits associated with performance evaluations that are based solely on mechanical or formulaic performance measures. Based on the Committee\u0092s discussions and assessments, it concluded that it would not be advisable to apply overly mechanical or formulaic methodologies to short-term incentive decisions for the following reasons., 815362=Nonqualified Deferred Compensation in Fiscal 2011, 293957=David W. Biegler has been Chairman and Chief Executive Officer of Southcross Energy, LLC since July 2009. Southcross is a midstream natural gas company engaged in the purchase and sale, pipeline transportation, gathering, and processing of natural gas. Mr. Biegler has also served as Chairman and Chief Executive Officer of Estrella Energy L.P., an investor in Southcross, since September 2003. Mr. Biegler served as interim President and Chief Executive Officer of Dynegy Inc., a provider of wholesale power, capacity, and ancillary services, from March 12, 2011 to April 11, 2011. He retired as Vice Chairman of TXU Corp. at the end of 2001, having served TXU Corp. as President and Chief Operating Officer from 1997 until 2001. He previously served as Chairman, President, and Chief Executive Officer of ENSERCH Corporation from 1993 to 1997. During the past five years, Mr. Biegler has served as a Director of the following companies that are or were publicly traded: Trinity Industries, Inc. (since 1992); Animal Health International, Inc. (2007-2011); Dynegy Inc. (2003-2011); and Guaranty Financial Group Inc. (2008-2009). Mr. Biegler also serves as a Director for Austin Industries. In November 2011, after Mr. Biegler had resigned from the Dynegy Inc. Board, certain subsidiaries of Dynegy Inc. filed for bankruptcy under Chapter 11 of the U.S. Bankruptcy Code., 1080579=2702 LOVE FIELD DRIVE, 504114=Approach to, and Justification of, 2011 Short-Term Incentive Compensation. The Committee believes the bonus amounts disclosed in the Summary Compensation Table for 2011 were justified based on the Company\u0092s 2011 accomplishments, as well as its long-term accomplishments relative to its competitors, each of which are discussed above under \u0093Executive Summary.\u0094 As part of the Committee\u0092s multi-year plan to move towards a more structured approach towards short-term incentive compensation, the Committee considered the Company\u0092s performance within the framework of the Company\u0092s Management Scoreboard (the \u0093Scoreboard\u0094)., 407986=The following table sets forth, as of February 29, 2012, information regarding the beneficial ownership of the Company\u0092s common stock by each of the members of the Company\u0092s Board of Directors, each of the executive officers of the Company named in the Summary Compensation Table, and all executive officers and Directors as a group., 533212=During 2011, the values of the named executive officers\u0092 equity awards were based in part on the independent consultant\u0092s advice regarding (i) the percentage of overall compensation that should be provided in the form of equity, (ii) the values viewed as necessary for the named executive officer grants to be competitive, and (iii) the values viewed as necessary to provide for competitive total compensation opportunities. In addition, the Committee considered the level and scope of the respective roles and responsibilities of the named executive officers., 378889=Nominating and Corporate Governance Committee. The primary functions of the Nominating and Corporate Governance Committee include (i) developing and annually reviewing and recommending to the Board a set of Corporate Governance Guidelines applicable to the Company; (ii) reviewing potential candidates for Board membership; (iii) recommending a slate of nominees to be selected by the Board for the Annual Meeting of Shareholders; (iv) recommending to the Board the composition of the Board\u0092s Committees; and (v) overseeing the evaluation of the Board and management. The Nominating and Corporate Governance Committee identifies potential candidates for first-time nomination as a Board member using a variety of sources such as recommendations from current Board members, management, and contacts in communities served by the Company. With respect to Ms. Biggins, who was appointed to the Board effective August 17, 2011, (i) Ms. Biggins was identified by Mr. Kelly and other members of the Board as a potential candidate because of her Atlanta ties and community involvement, as well as her service on the AirTran Board and related institutional knowledge; (ii) Dr. Cunningham spoke with Ms. Biggins on several occasions, and many independent members of the Board met with Ms. Biggins in person; and (iii) Dr. Cunningham requested input from other members of the Board regarding Ms. Biggins\u0092 qualifications and recommended that the Nominating and Corporate Governance Committee consider Ms. Biggins as a candidate for Board membership. The Board of Directors has determined that each of the members of the Nominating and Corporate Governance Committee is independent under the NYSE\u0092s rules governing Board membership., 218500=Securities Exchange Act of 1934, 1018371=Section 16(a) of the Securities Exchange Act of 1934, as amended, requires the Company\u0092s executive officers, Directors, and persons who beneficially own more than ten percent of the Company\u0092s common stock to file reports of ownership and changes in ownership of Company common stock with the SEC and the NYSE. These persons are also required by SEC regulation to furnish the Company with copies of all such reports they file. To the Company\u0092s knowledge, based solely on its review of its copies of such reports, or written representations from such persons, the Company believes that all filing requirements applicable to its Directors, executive officers, and beneficial owners of more than ten percent of the Company\u0092s common stock have been satisfied., 548270=Section 162(m) of the Internal Revenue Code generally limits to $1,000,000 the federal tax deductibility of compensation paid to a named executive officer, including compensation received upon exercise of stock options. Section 162(m) provides an exception to such limitation for certain performance-based compensation. The Company\u0092s Amended and Restated 2007 Equity Incentive Plan has been designed to satisfy the conditions of such exception to the extent necessary, feasible, and in the best interests of the Company. Although options granted under such plan constitute performance-based compensation, restricted stock units granted to date do not., 283069=The presence at the meeting, in person or by proxy, of the holders of a majority of the shares of the Company\u0092s common stock entitled to vote at the meeting is necessary to constitute a quorum. Shareholders of record at the close of business on March 20, 2012, are entitled to vote at the meeting. As of that date, the Company had issued and outstanding 767,480,209 shares of common stock. Abstentions and broker non-votes are each included in the determination of the number of shares present and entitled to vote at the meeting for purposes of determining the presence or absence of a quorum for the transaction of business at the meeting; however, neither abstentions nor broker non-votes are counted as voted either for or against a proposal. If you are a beneficial owner and do not provide voting instructions to your broker, your broker will only be entitled to vote your shares in its discretion with respect to Proposal 4 (Ratification of the Selection of Independent Auditors). Your broker will not be able to vote your shares in its discretion with respect to Proposal 1 (Election of Directors), Proposal 2 (Advisory Vote on the Compensation of the Company\u0092s Named Executive Officers), or Proposal 3 (Approval of Amendment and Restatement of the Company\u0092s Articles of Incorporation), and your vote will be counted as a \u0093broker non-vote\u0094 on those proposals., 919242=Directors\u0092 retainer fees are paid on an annual basis in May of each year. Board of Director and Committee fees paid and to be paid to non-Employee Directors for each of the 12-month periods ending May 2011 and May 2012 are set forth in the table below:, 243318=April 5, 2012, 353261=Beginning in 2010, to address regulatory and other \u0093best practice\u0094 guidance, the Company moved to a more performance-oriented compensation structure whereby the Compensation Committee has awarded bonuses taking into account multiple general performance standards established by the Company to support its overall strategies and goals. This has served as a multi-dimensional tool for the Compensation Committee to use in determining bonus funding, so that factors that are deemed significant to the industry and operational performance are considered in addition to financial measures. This multi-dimensional approach reduces the risk that can be created when financial results are the only drivers of incentive payments., 354652=Incentive compensation is used responsibly. Approximately 300 of the Company\u0092s Employees were eligible to receive bonuses for 2011., 512155=generally (i.e., the goals are highly relevant to the Company, its Shareholders, its Customers, and its Employees); (ii) the Scoreboard has been in existence and communicated in varying forms since the end of 2004 and therefore incorporates standards with which Employees are already familiar and to which Employees are likely to respond; (iii) the Scoreboard provides visibility to the Committee regarding what management communicates to its Employees as important and enables the Committee to take into account the Chief Executive Officer\u0092s specific views regarding the areas within the Scoreboard that require the most focus at any given point in time; (iv) the Scoreboard creates a multi-dimensional mechanism to determine overall bonus funding based on Company performance, so that factors that are deemed significant to the industry and operational performance may be considered in addition to financial measures; (v) the use of a multi-dimensional guide for determining bonus funding mitigates the risk that can be created when financial results are the only drivers of incentive payments; and (vi) individualized objectives can be customized based on applicable goals within the Scoreboard. The Committee also views the Scoreboard as a communications tool, which should be subject to adjustment to be in sync with the Company\u0092s priorities at any given time., 652045=Outstanding Equity Awards at Fiscal 2011 Year-End, 1017560=Notwithstanding the above provisions, any Shareholder who wishes to submit a proposal for inclusion in the Company\u0092s proxy statement and proxy relating to the 2013 Annual Meeting of Shareholders must forward such proposal to the Secretary of the Company, at the address indicated on the first page of this proxy statement, so that the Secretary receives it no later than December 6, 2012., 240536=To attend the meeting in person, you will need to bring (i) a valid government-issued photo identification, such as a driver\u0092s license or passport, and (ii) either an Admission Ticket or proof of ownership of Southwest Airlines Co. common stock as of March 20, 2012 (such as an account statement from your broker showing your stock ownership as of March 20, 2012). If you have received a paper copy of your proxy materials, an Admission Ticket is included with your proxy materials. If you have received your proxy materials electronically, you will need proof of ownership to be admitted to the meeting. If you are a proxy holder for a Shareholder of Southwest who owned shares of Southwest\u0092s common stock as of March 20, 2012, you must also bring to the meeting the executed proxy naming you as the proxy holder, signed by the Shareholder who owned shares of Southwest\u0092s common stock as of March 20, 2012., 818833=In connection with the expiration of Mr. Kelly\u0092s employment contract in accordance with its terms in February 2011, the Company entered into a letter agreement with Mr. Kelly to continue his deferred compensation arrangement. Pursuant to this arrangement, the Company makes contributions to Mr. Kelly\u0092s account to the extent such amounts cannot be contributed to the qualified 401(k) and profit sharing plans due to contribution limits and compensation limits established by the Internal Revenue Code. The individual deferred compensation arrangement with Mr. Kelly provides for accrual and crediting to Mr. Kelly\u0092s account, each January, of simple interest at a rate of ten percent, compounded annually, on the accrued and unpaid balance of the deferred compensation credited to his account as of the preceding December 31. Subject to any applicable requirements of Section 409A of the Internal Revenue Code, the deferred compensation credited to Mr. Kelly\u0092s account will be paid to him at the rate of $200,000 per calendar year, commencing with the calendar year following the year in which (i) he attains age 65 or (ii) his employment terminates, whichever occurs later. The following table provides information with respect to nonqualified deferred compensation earned by the named executive officers for 2011., 881969=Fiscal 2011 Director Compensation, 438364=The Company is required to provide detailed compensation information in this proxy statement regarding its Chief Executive Officer, its Chief Financial Officer, and its three other most highly compensated executive officers who were serving as such at the end of fiscal 2011. For 2011, these executive officers, who will be referred to in this proxy statement as the \u0093named executive officers,\u0094 were (i) Gary C. Kelly, Chairman of the Board, President, & Chief Executive Officer; (ii) Laura H. Wright, Senior Vice President Finance, Chief Financial Officer, & Treasurer; (iii) Ron Ricks, Executive Vice President, Chief Legal & Regulatory Officer, & Corporate Secretary; (iv) Michael G. Van de Ven, Executive Vice President & Chief Operating Officer; and (v) Robert E. Jordan, Executive Vice President & Chief Commercial Officer. For purposes of this Compensation Discussion and Analysis, the Compensation Committee will be referred to as the \u0093Committee.\u0094, 388358=At the close of business on March 20, 2012, the record date for determining Shareholders entitled to notice of and to vote at the meeting, there were outstanding 767,480,209 shares of common stock, $1.00 par value, each share of which is entitled to one vote., 477142=Summary of 2011 Executive Compensation, 441752=Despite the numerous challenges facing the Company and the airline industry, 2011 marked the Company\u0092s 39th consecutive year of profitability, an accomplishment unparalleled by any U.S. airline. In addition, in the last decade, the Company has added over 300 aircraft (net), increased available seat mile capacity more than 80 percent, more than doubled annual revenues, and added more than 30 new cities., 999940=The firm of Ernst & Young LLP, independent auditors, has been selected by the Board of Directors to serve as the Company\u0092s independent auditors for the fiscal year ending December 31, 2012. Shareholder ratification of the selection of Ernst & Young LLP as the Company\u0092s independent auditors is not required by the Company\u0092s Bylaws or otherwise. However, the Board of Directors is submitting the selection of Ernst & Young to the Shareholders for ratification as a matter of good corporate practice. If the Shareholders fail to ratify the selection, the Audit Committee and Board of Directors will reconsider whether or not to retain Ernst & Young. Even if the selection is ratified, the Board of Directors and its Audit Committee, in their discretion, may direct the selection of a different independent accounting firm at any time during the year if the Board of Directors believes this change would be in the best interests of the Company and its Shareholders., 311451=Thomas M. Nealon served as Group Executive Vice President of J.C. Penney Company, Inc., a retail company, from August 2010 until December 2011. Mr. Nealon also served as J.C. Penney\u0092s Executive Vice President & Chief Information Officer from September 2006 until August 2010. Prior to joining J.C. Penney, Mr. Nealon was a partner with The Feld Group, a provider of information technology consulting services, where he served in a consultant capacity as Senior Vice President & Chief Information Officer for the Company from 2001 to 2006. Mr. Nealon also served as Chief Information Officer for Frito-Lay, a division of PepsiCo, Inc., from 1996 to 2000, and in various software engineering, systems engineering, and management positions, for, 243867=IMPORTANT NOTICE REGARDING THE AVAILABILITY OF PROXY MATERIALS FOR THE 2012 ANNUAL MEETING OF SHAREHOLDERS TO BE HELD ON MAY 16, 2012, 538888=The Committee did not consider the value of its retirement plans when establishing other compensation elements and amounts for the named executive officers in 2011 because of the broad-based nature of these benefits and the relatively small portion of total executive compensation represented by them., 1024216=A copy of the Company\u0092s Annual Report on Form 10-K for the fiscal year ended December 31, 2011, including the financial statements and the financial statement schedules, if any, but not including exhibits, will be provided at no charge to each person to whom this proxy statement is delivered upon the written request of such person addressed to Southwest Airlines Co., Attn: Investor Relations, HDQ-6FC, P.O. Box 36611, Dallas, Texas 75235., 518056=Based on its conclusions, the Committee did not apply any specific Scoreboard metrics or weightings with respect to its bonus decisions. Rather, the Committee viewed the Scoreboard as a touch-point to which reasoned judgment could be applied taking into account other factors such as (i) the nature and extent of the Company accomplishments, (ii) input from the Committee\u0092s independent consultant, and (iii) other factors the Committee deemed significant. Based on these considerations, the Committee approved a bonus pool for 2011 of approximately $10 million for all eligible Employees, including the named executive officers., 504882=Since 2010, the Committee has leveraged the Scoreboard for the purpose of evaluating Company performance relative to broad categories of performance standards (which standards are prefaced with an overarching principal that \u0093Safety Matters Most\u0094). The Scoreboard standards for 2011 are set forth below along with the Company\u0092s related accomplishments., 376495=compensation decisions during 2011 were motivated in large part by surveys provided by the independent consultant in 2009 and 2011 and the independent consultant\u0092s related assessments and recommendations with respect to form and amount of executive compensation (the \u0093Assessments\u0094). Based on the 2009 Assessment, which confirmed the Compensation Committee\u0092s concern that the Company\u0092s executive compensation was not adequate, the Compensation Committee implemented a multi-year plan to improve the adequacy of the Company\u0092s executive compensation and to add a more performance-oriented structure to the Company\u0092s executive compensation. During 2011, the Compensation Committee used the 2011 Assessment to (i) evaluate the Company\u0092s progress with respect to its multi-year plan and (ii) guide its compensation decisions during 2011., 1001880=The Board of Directors unanimously recommends a vote FOR the ratification of the selection of Ernst & Young LLP as the Company\u0092s independent auditors for the fiscal year ending December 31, 2012. Proxies solicited by the Board of Directors will be so voted unless Shareholders specify a different choice., 1083151=Mark, sign and date your proxy card and return it in the postage-paid envelope we have provided or return it to Vote Processing, c/o Broadridge, 51 Mercedes Way, Edgewood, NY 11717., 639821=The following table provides information with respect to grants of plan-based awards to the named executive officers in 2011., 473793=At its 2011 Annual Meeting of Shareholders, votes in favor of approving the Company\u0092s named executive officer compensation constituted almost 98 percent of the shares voted either for or against the proposal. The Committee interpreted the results of the Company\u0092s 2011 say-on-pay vote as an endorsement of (i) the Committee\u0092s compensation philosophy and structure, (ii) the Company\u0092s executive pay levels generally, and (iii) the Committee\u0092s justifications for its individual executive compensation decisions., 487904=The Committee did not directly target any individual named executive officer\u0092s compensation against the specific data included in the Assessments because the surveys included as part of the Assessments (i) were not necessarily comprehensive and (ii) did not always include exact matches to the Company\u0092s executive positions (which in many cases involve a unique combination of responsibilities that do not correspond directly to the roles that are included in the surveys). Nevertheless, the 2009 and 2011 Assessments provided multiple external reference points for the Committee\u0092s consideration in determining the appropriateness of its executive pay decisions. Because of the limited amount of airline industry data, the Committee believes it is important to acknowledge the broader compensation data provided by general industry surveys, which also serve as indicators of the named executive officers\u0092 potential value to other organizations who might seek to hire them. Survey sources for the 2009 and 2011 Assessments are set forth below., 473589=Compensation Committee\u0092s Consideration of 2011 Say-on-Pay Vote, 260034=Outstanding Equity Awards at Fiscal 2011 Year-End, 442509=Specific 2011 achievements also included the following, among others:, 298701=Douglas H. Brooks has served as Chairman of the Board of Brinker International, Inc., a casual dining restaurant company, since November 2004. Mr. Brooks has also served as Brinker International\u0092s Chief Executive Officer since January 2004, and as its President since January 1999. Mr. Brooks has also served in other capacities for Brinker including as its Chief Operating Officer and as President of Chili\u0092s Grill & Bar. Mr. Brooks serves on the Board of Directors of Limbs for Life and is a member of the Professional Advisory Board for St. Jude Children\u0092s Research Hospital., 1006231=2011, 1093915=M43719-P21042, 377477=In 2011, the independent consultant also provided an assessment of the adequacy and effectiveness of the Company\u0092s compensation program for non-Employee members of the Board. Based on the assessment, the Compensation Committee decided not to recommend any changes in non-Employee Director compensation for 2011., 382970=Executive Committee. The primary function of the Executive Committee is to assist the Board in fulfilling its oversight responsibilities. The Executive Committee has authority to act for the Board on most matters during the intervals between Board meetings. The Executive Committee held one meeting during 2011., 536135=Timing of Grants. The Committee considers regular discretionary equity grants in May of each year around the time of the Company\u0092s annual meeting of Shareholders. The Committee has chosen this timing because, based on its relationship to the timing of quarterly and full-year financial results, it is typically a time at which the Company is not in possession of material non-public information. Should the current timing of grants coincide with a time at which the Company is in possession of material non-public information, the Company will adjust the timing of grants to be in accordance with the Company\u0092s policy not to grant equity at a time at which it is in possession of material non-public information., 489091=Survey Sources for the 2009 Assessment (based on 2007 data), 312801=Frito-Lay from 1983 to 1996. Mr. Nealon received the 2010 MIT Sloan School of Business Award for Innovation Leadership and was recognized by Information Week as a \u0093Premiere 100 CIO\u0094 in 2006 and 2010., 502221=To assist the Committee in gauging the appropriateness of the 2011 pay increases, the Committee considered (i) the 2011 Assessment, the comparability of the position matches in the 2011 Assessment, and related input from the independent consultant and the Chief People Officer; (ii) input from the Company\u0092s Chief Executive Officer with respect to the relative roles, responsibilities, accountability, and individual performance of the Company\u0092s other executive officers; and (iii) the potential value of the named executive officers to other organizations. The Committee, at the request of the Chief Executive Officer, does not currently contemplate an increase in the Chief Executive Officer\u0092s salary during 2012., 526481=Other Named Executive Officers. In assessing the individual performance of the other named executive officers, the Committee relied heavily on the Chief Executive Officer\u0092s and Chief People Officer\u0092s input regarding the relative roles, scope of responsibilities, and performance of these officers with respect to the Company\u0092s 2011 results, as well as their respective contributions to the Company\u0092s ongoing initiatives. Specifically, the following contributions of the other named executive officers were key to the Company\u0092s achievements: (i) the contributions of Mr. Jordan and his departments with respect to the AirTran acquisition, in particular Mr. Jordan\u0092s strategic leadership and his effectiveness in taking on an increased level of responsibility and accountability as President of AirTran; (ii) the contributions of Mr. Ricks and his departments with respect to the AirTran acquisition, in particular Mr. Ricks\u0092 leadership in securing Department of Justice and other regulatory approvals, as well as his successful efforts towards building strong community relationships; (iii) the contributions of Mr. Van de Ven and Mr. Ricks and their respective departments in connection with the Company\u0092s completion of Southwest labor contracts, as well as in connection with what the Committee believes to be historic seniority list integration agreements with representatives of Southwest and AirTran Employees; (iv) the contributions of Ms. Wright and her departments with respect to the AirTran acquisition, in particular Ms. Wright\u0092s financial and strategic leadership related to the transaction and related contractual, financing, benefits and integration matters; (v) the contributions of Mr. Van de Ven and Ms. Wright with respect to the Company\u0092s agreement with Boeing to be the launch customer for the Boeing 737 MAX aircraft and related fleet modernization initiatives; (vi) the contributions of Mr. Van de Ven with respect to the Company\u0092s operational excellence, including, for example, the Company\u0092s improved ontime performance and its industry-leading Customer Service; (vii) the strategic contributions of Mr. Jordan and Mr. Ricks in connection with the, 815538=As discussed above under \u0093Compensation Discussion and Analysis,\u0094 the Company maintains tax-qualified 401(k) and profit sharing plans for its eligible Employees. The 401(k) plans provide for a Company match on Employee contributions, and the profit sharing plan provides for an annual Company contribution equal to a percentage of Company profits that is allocated among participant accounts as a uniform percentage of compensation. In conjunction with these tax-qualified plans, the Company offers a non-qualified excess benefit plan, which is designed to provide benefits with respect to Company contributions (\u0093excess amounts\u0094) that cannot be contributed to the 401(k) and profit sharing plans due to qualified plan contribution limits established by the Internal Revenue Code. Employee deferrals to the excess benefit plan are not allowed. Pursuant to the excess benefit plan, Employees, including the named executive officers, with excess amounts of at least $1,000 who have previously properly elected to participate in the plan, may defer payment of their excess amounts by making a timely deferral election under the excess benefit plan. Employees are immediately 100 percent vested in their benefits under the excess benefit plan; however, the benefits are unsecured obligations of the Company in the event of its bankruptcy or insolvency. Prior to the beginning of each plan year, participants are allowed to select a rate of return to apply to the contributions to be made with respect to the upcoming plan year. The excess benefit plan currently allows participants to select a rate of return equal to either or both of two investment options: (i) the Citibank 90 Day Treasury Bill Index plus two percentage points and (ii) the Vanguard Institutional Standard & Poor\u0092s 500 Index Fund. During fiscal 2011, the Citibank 90 Day Treasury Bill option earned a rate of return equal to 2.08 percent, and the Vanguard Index Fund option earned a rate of return equal to 2.14 percent. Once an excess amount is credited to a participant\u0092s account, the participant may not change that investment election for that amount or transfer amounts between funds. Participants are entitled to a distribution of their accounts upon separation from service with the Company and must elect the time and form of distribution of their accounts prior to their first year of participation in the excess benefit plan. Distribution may be in a lump sum payout or in equal annual installments over a period of up to five years and may be received or commenced (i) in the calendar year of separation from service or (ii) the calendar year following the year in which separation from service occurs., 370701=General. The primary functions of the Compensation Committee include (i) reviewing and approving corporate goals and objectives relevant to the compensation of the Chief Executive Officer; (ii) evaluating the Chief Executive Officer\u0092s performance in light of those goals and objectives; (iii) together with the other independent members of the Board (as directed by the Board and to the extent consistent with any applicable plan documents or law), determining and approving the Chief Executive Officer\u0092s compensation level based on the Compensation Committee\u0092s evaluation; (iv) with the advice of the Chairman of the Board and the Chief Executive Officer, conducting an annual review of the compensation structure of the Company\u0092s officers and approving the salary, bonus, and other incentive and equity-related compensation for each of the Company\u0092s executive officers who are subject to Section 16(b) of the Securities Exchange Act of 1934, as amended (\u0093Reporting Officers\u0094); (v) reviewing and approving all stock-based compensation arrangements for Employees of the Company (including executive officers) and making recommendations to the Board with respect to equity-based plans that are subject to Board approval; and (vi) making recommendations to the Board with respect to non-CEO Reporting Officer compensation and incentive compensation plans that are subject to Board approval. The Compensation Committee is also responsible for reviewing non-Employee Director compensation at least annually and making any related recommendations to the full Board. To the extent permitted by applicable law and regulations, the Compensation Committee has the power to delegate any of the authority above to subcommittees or to individual members of the Compensation Committee, as it deems appropriate. The Board has determined that each of the members of the Compensation Committee is (i) independent under the NYSE\u0092s rules governing Board membership; (ii) a \u0093non-employee director\u0094 under Rule 16b-3 of the Securities Exchange Act of 1934, as amended; and (iii) an \u0093outside director\u0094 under Section 162(m) of the Internal Revenue Code of 1986, as amended. The Compensation Committee held six meetings during 2011., 1013739=A copy of the Audit Committee\u0092s Audit and Non-Audit Services Preapproval Policy is attached to this proxy statement as Appendix B. All of the services rendered by the independent auditors during 2011 were pre-approved by the Audit Committee or by its Chairman pursuant to his delegated authority., 552499=The following table provides information with respect to compensation earned by the named executive officers for the years ended December 31, 2011, 2010, and 2009., 1027302=The Trustee is required to vote the shares held for your account in accordance with your instructions or, if you do not provide instructions, in accordance with the Plan. If you wish to instruct the Trustee on the vote of shares held for your account, you should vote via telephone or the Internet or complete and sign the form enclosed and return it in the addressed, postage-free envelope. Your vote must be received by May 14, 2012., 440345=The Committee\u0092s compensation decisions for 2011 were greatly influenced and supported by the Company\u0092s performance. The airline industry is extremely volatile and is subject to various unique challenges. Among other things, it is cyclical, energy intensive, labor intensive, capital intensive, technology intensive, highly regulated, heavily taxed, and extremely competitive, with generally low barriers to entry. The airline industry is also susceptible to detrimental events such as acts of terrorism, poor weather, and natural disasters. Over the last decade, total financial losses for the U.S. airline industry have exceeded $50 billion. These losses were driven by factors such as 9/11, the worst economic recession in aviation history, and a worldwide credit crisis. In addition, in recent years the industry has been particularly negatively affected by high and volatile fuel prices. These factors have contributed to volatile and unpredictable demand for air travel and related cost and pricing challenges. Fuel costs alone have risen over 300 percent from 2000 levels, and the Company\u0092s average jet fuel cost per gallon for 2011 increased 27.1 percent compared to 2010. As a result, several U.S. airlines have ceased operations or reorganized through bankruptcy., 983881=During 2011, none of the named executive officers was party to an employment contract with the Company except for the Chief Executive Officer, whose employment contract with the Company expired in accordance with its terms on February 1, 2011., 537167=Southwest offers tax-qualified 401(k) and profit sharing plans to all eligible Employees, including the named executive officers. Southwest\u0092s 401(k) and profit sharing plans are intended to be competitive in the market and include five-year vesting provisions that are designed to contribute to Employee loyalty and retention. Southwest\u0092s 401(k) plans provide for a dollar-for-dollar match on Employee contributions, subject to limits specified by the Board, applicable collective bargaining agreements, and the Internal Revenue Code and applicable Treasury Regulations. Southwest\u0092s profit sharing plan provides for an annual Company contribution to Employee accounts equal to a uniform percentage of each Employee\u0092s compensation up to an amount that is cumulatively equal to 15 percent of the Company\u0092s operating profit (as defined in the plan) for the year. The profit sharing plan is intended to serve as an incentive and reward to Employees because the plan is based on overall Company profitability. Therefore, it effectively serves as a bonus component of compensation for the Company\u0092s Employees at all levels. The numbers for 2011 in the \u0093All Other Compensation\u0094 column of the Summary Compensation Table reflect fluctuations in profit sharing contributions based on fluctuations in the Company\u0092s profitability for the three years covered by the table. AirTran Employees continue to participate in the AirTran Airways, Inc. 401(k) Plan, AirTran Airways Pilot Retirement Savings and Investment Plan, and AirTran Airways Technical Operations Retirement Savings Plan, as applicable., 476699=incentive compensation; however, the Committee did not increase any of the named executive officer\u0092s base pay. In 2011, for the reasons discussed below, the Committee continued to provide for a significant percentage of pay at risk, but also increased base pay for each of the named executive officers., 972451=The Audit Committee has reviewed and discussed with management the audited financial statements of the Company for the year ended December 31, 2011. In addition, we have discussed with Ernst & Young LLP, the Company\u0092s independent auditors, the matters required to be discussed by the statement on Auditing Standards No. 61, as amended (AICPA, Professional Standards, Vol. 1, AU section 380), as adopted by the Public Company Accounting Oversight Board in Rule 3200T., 638876=In connection with the expiration of Mr. Kelly\u0092s employment contract in accordance with its terms in February 2011, the Company entered into a letter agreement with Mr. Kelly to continue his deferred compensation arrangement. Mr. Kelly\u0092s deferred compensation arrangement is discussed in more detail above under \u0093Compensation Discussion and Analysis\u0094 and below under \u0093Nonqualified Deferred Compensation in Fiscal 2011.\u0094 The Compensation Committee\u0092s determinations regarding the amount of executive salary and bonus in proportion to total compensation are discussed in detail above under \u0093Compensation Discussion and Analysis.\u0094, 462336=Southwest was named the 2011 Customer Service Champion by J.D. Powers based on customer feedback regarding service excellence., 799852=Option Exercises and Stock Vested During Fiscal 2011, 976593=As discussed in greater detail above under \u0093Compensation Discussion and Analysis,\u0094 the Board and its Compensation Committee believe the compensation of the Company\u0092s named executive officers for 2011 is reasonable and appropriate for the following reasons, among many others:, 471181=The Company was recognized by PR News with the 2011 PR News Corporate Responsibility Awards for Diversity Communications., 301161=William H. Cunningham, Ph.D. has been a professor at The University of Texas at Austin since 2000 and holds the James L. Bayless Chair for Free Enterprise at the University\u0092s Red McCombs School of Business. Dr. Cunningham served as Chancellor and Chief Executive Officer of The University of Texas system from 1992 to 2000 and as President of The University of Texas at Austin from 1985 to 1992. During the past five years, he has served as a Director of the following companies that are or were publicly traded: Lincoln National Corporation (since 2006); Resolute Energy Corporation (formerly Hicks Acquisition Company I, Inc., since 2007); LIN TV Corp. (since 2009 and from 2002-2008); Introgen Therapeutics, Inc. (2000-2009); and Hayes Lemmerz International, Inc. (2003-2009). He is also a disinterested Director of John Hancock Funds, III, a registered investment company., 463053=Southwest was ranked sixth in MSN Money\u0092s 2011 Customer Service Hall of Fame, the only airline to make the top ten., 1082564=Use any touch-tone telephone to transmit your voting instructions up until 11:59 P.M. Eastern Time on May 15, 2012 (May 14, 2012 for participants in the Southwest Airlines Co. ProfitSharing Plan). Have your proxy card in hand when you call and then follow the instructions., 550274=The Compensation Committee has reviewed and discussed the Compensation Discussion and Analysis contained in this proxy statement with the Company\u0092s management. Based on such review and discussion and relying thereon, we have recommended to the Company\u0092s Board of Directors that the Compensation Discussion and Analysis contained in this proxy statement be included in the Company\u0092s Annual Report on Form 10-K for the year ended December 31, 2011, and in this proxy statement., 639652=Grants of Plan-Based Awards in Fiscal 2011, 380835=The Nominating and Corporate Governance Committee will also consider nominees submitted by Shareholders based on the criteria set forth in the Company\u0092s Corporate Governance Guidelines; provided that such nominations are submitted in accordance with the requirements of the Company\u0092s Bylaws. These requirements are discussed below under \u0093Other Matters \u0097 Submission of Shareholder Proposals.\u0094 The Nominating and Corporate Governance Committee held seven meetings during 2011., 449532=On May 2, 2011, the Company acquired AirTran. The Company\u0092s 2011 results included $80 million in realized net pre-tax synergies from the acquisition, and, as of year-end 2011, the Company was, 396805=Baltimore, MD 21202, 259365=Grants of Plan-Based Awards in Fiscal 2011, 239964=March 20, 2012, is the date of record for determining Shareholders entitled to receive notice of and to vote at the Annual Meeting or any adjournment thereof., 368823=Audit Committee. The primary functions of the Audit Committee include assisting the Board in its oversight of (i) the integrity of the Company\u0092s financial statements, (ii) the Company\u0092s compliance with legal and regulatory requirements, (iii) the independent auditor\u0092s qualifications and independence, and (iv) the performance of the Company\u0092s internal audit function and independent auditors. The Audit Committee held seven meetings during 2011. The Audit Committee has been established in accordance with Section 3(a)(58)(A) of the Securities Exchange Act of 1934, as amended, and the Board has determined that each of the members of the Audit Committee is independent under the NYSE\u0092s rules governing Board and Audit Committee membership. The Board has also determined that at least two of the members of the Audit Committee, Dr. Cunningham and Mr. Denison, satisfy the criteria adopted by the Securities and Exchange Commission (the \u0093SEC\u0094) to serve as an \u0093audit committee financial expert\u0094 for the Audit Committee., 455182=Based on the most recent data available from the U.S. Department of Transportation, as of September 30, 2011, Southwest was the largest domestic air carrier, as measured by the number of originating passengers boarded., 525082=Chief Executive Officer. In assessing the Chief Executive Officer\u0092s individual performance, the Committee specifically rewarded Mr. Kelly for his strategic vision and contributions to the Company\u0092s 2011 achievements, including the following, among others: (i) the Company\u0092s record revenue results, which reflect, in part, Mr. Kelly\u0092s vision with respect to the Company\u0092s multi-year revenue and cost-control initiatives; (ii) the Company\u0092s acquisition of AirTran and related integration accomplishments during 2011; (iii) the Company\u0092s implementation of Southwest\u0092s All-New Rapid Rewards® Frequent Flyer program; (iv) the Company\u0092s agreement with Boeing to be the launch customer for the Boeing 737 MAX aircraft and related fleet modernization initiatives; (v) the Company\u0092s operational excellence and industry-leading Customer Service; and (vi) the Company\u0092s achievement of seniority list integration agreements with representatives of Southwest and AirTran Employees, which the Committee believes to be a historic accomplishment in the airline industry., 1003041=The following table sets forth the various fees for services provided to the Company by Ernst & Young in 2011 and 2010:, 846592=In 1987, the Board of Directors of the Company established Executive Service Recognition Plan Executive Employment Agreements (the \u0093executive change-in-control agreements\u0094). Mr. Kelly, Ms. Wright, Mr. Ricks, Mr. Van de Ven, and Mr. Jordan are, and were during 2011, parties to executive change-in-control agreements with the Company. Although these agreements are titled \u0093Employment Agreements,\u0094 their terms can only be invoked in the event of a change-in-control of the Company, and they do not provide for any incremental compensation to be paid to the named executive officers unless, subsequent to a change-in-control, an executive\u0092s employment is terminated other than for cause or disability, or the executive resigns for good reason., 486878=As discussed throughout this Compensation Discussion and Analysis, the Committee has received ongoing input from its independent consultant regarding, among other matters, market data and competitive compensation practices. The independent consultant\u0092s 2009 Assessment and 2011 Assessment included reviews of the named executive officers\u0092 base salary, total cash compensation (base salary plus short-term incentives/annual incentive bonus), and total direct compensation (total cash compensation plus long-term incentives) relative to similar positions reported in multiple survey sources including (i) Towers Watson\u0092s Executive Compensation database, which provided general industry data; (ii) Towers Watson\u0092s custom survey, The Airline Industry Compensation Survey, which provided airline industry data; and (iii) proxy statements that included airline industry data., 273520=Southwest Airlines Co. Audit and Non-Audit Services Preapproval Policy Adopted March 20, 2003, 521576=adjust individual goals and payouts in response to unexpected events or changes in the industry and related changes in business strategies (as was necessary for the Company in 2008-2009 when the Company was required to react to an economic recession and extremely volatile fuel prices), thereby minimizing the risk that individuals will continue to focus on areas that become less relevant just to achieve a bonus payout;, 530591=Because the Company is subject to limitations on the number of shares it may issue pursuant to awards under equity plans, during 2011 equity was granted at the senior management level and to members of the Board of Directors. The Committee, with the input of its independent consultant, has concluded that senior management positions are currently the positions with respect to which equity can most effectively serve as an attraction and retention mechanism. In addition, equity serves as a mechanism that can serve to further align senior management\u0092s compensation with the Company\u0092s overall business results. With respect to other Employees, the Company has decided to place more emphasis on cash compensation., 975791=In accordance with the Dodd-Frank Wall Street Reform and Consumer Protection Act (the \u0093Dodd-Frank Act\u0094), as well as Section 14A of the Securities Exchange Act of 1934 and the rules promulgated thereunder, the Company is providing its Shareholders with the opportunity to cast a non-binding advisory vote on a resolution to approve the compensation of the Company\u0092s named executive officers as disclosed in this proxy statement (the \u0093Say-on-Pay Resolution\u0094). This vote is not intended to address any specific element of compensation, but instead is intended to address the overall compensation of the named executive officers as disclosed in this proxy statement., 1091215=10:00 a.m. Central Daylight Time, 1058432=Under the Sarbanes-Oxley Act of 2002 (the \u0093Act\u0094) and the rules of the Securities and Exchange Commission (the \u0093SEC\u0094), the Audit Committee of the Board of Directors is responsible for the appointment, compensation, and oversight of the work of the independent auditor. The Audit Committee is required to pre-approve the audit and non-audit services performed by the independent auditor in order to assure that they do not impair the auditor\u0092s independence from the Company. Accordingly, the Audit Committee has adopted, and the Board of Directors of Southwest Airlines Co. (the \u0093Company\u0094 or \u0093Southwest\u0094) has ratified, this Audit and Non-Audit Services Preapproval Policy (the \u0093Policy\u0094), which sets forth the procedures and the conditions pursuant to which services proposed to be performed by the independent auditor may be preapproved., 1083693=M43718-P21042, 276449=This proxy statement is being furnished in connection with the solicitation of proxies by and on behalf of the Board of Directors of Southwest Airlines Co. (the \u0093Company\u0094 or \u0093Southwest\u0094) for use at the Annual Meeting of Shareholders of the Company to be held on May 16, 2012, at 10:00 a.m., Central Daylight Time, at the Hyatt Regency Dallas located at 300 Reunion Boulevard, Dallas, Texas, or at such other time and place to which the meeting may be adjourned. The approximate date on which this proxy statement and accompanying proxy are first being sent or given to Shareholders is April 5, 2012., 540598=The excess benefit plan is discussed in more detail below under \u0093Nonqualified Deferred Compensation in Fiscal 2011.\u0094 Southwest also maintains two nonqualified deferred compensation plans that are available to pilots only, pursuant to the terms of their collective bargaining agreement. In addition, Mr. Kelly has an individual deferred compensation arrangement pursuant to which the Company credits to Mr. Kelly\u0092s account an amount equal to any Company contributions that would otherwise have been made on his behalf to the Company\u0092s qualified plans, but that exceed the limits under Section 415(c) and 401(a)(17) of the Internal Revenue Code for qualified plans. Mr. Kelly\u0092s deferred compensation bears interest at 10 percent, the interest rate established in 1982 when the first arrangement of this type was put into place with respect to the Company\u0092s Chairman, 491722=Survey Sources for the 2011 Assessment, 912141=Through May 2009, non-Employee members of the Board received annual grants of performance shares pursuant to the Company\u0092s Outside Director Incentive Plan, which terminated effective March 18, 2010 with respect to future grants. The aggregate number of performance shares outstanding at December 31, 2011 for each of the Directors listed in the table was as follows: Mr. Biegler \u0097 5,000; Ms. Biggins \u0096 0; Mr. Brooks \u0097 0; Dr. Cunningham \u0097 6,750; Mr. Denison \u0097 0; Mr. Johnson \u0097 0; Ms. Loeffler \u0097 5,250; Mr. Montford \u0097 6,000; Mr. Nealon \u0097 0; Mr. Villanueva \u0097 0. Pursuant to the terms of the Outside Director Incentive Plan, on the 30th calendar day following the date on which a non-Employee Director ceases to serve as a Director of the Company for any reason, the non-Employee Director is entitled to an amount in cash equal to the average fair market value of the Company\u0092s common stock during the 30 days preceding the Director\u0092s last date of service multiplied by the number of performance shares then held by such Director., 979843=During 2009 and 2010, the named executive officers \u0093led from the top,\u0094 by taking on increased responsibilities without receiving corresponding increases in guaranteed pay (salary), and the Chief Executive Officer voluntarily took a salary reduction for a portion of 2009. The Compensation Committee deemed it necessary and advisable to increase named executive officer base pay in 2011 to address retention concerns and to acknowledge the named executive officers\u0092 increased responsibilities, in particular the increased responsibilities assumed by the Chief Executive Officer since 2008 when he became Chairman of the Board and President of the Company., 882128=The following table provides information with respect to compensation earned by the non-Employee members of the Board of Directors for the year ended December 31, 2011., 308875=John T. Montford has been President and Chief Executive Officer of JTM Consulting, LLC since January 2010. Mr. Montford was retained by General Motors in January 2010 as a consultant and served in the capacity of Senior Advisor of Government Relations and Global Public Policy until January 2012. In his consulting role, Mr. Montford also served on the Executive Committee of General Motors. From 2001 through 2009, Mr. Montford served in a number of positions in the telecommunications industry. These included: President of Southwestern Bell and Southern New England Company, External Affairs (2001-2005); Senior Vice President for Legislative and Regulatory Affairs for SBC and AT&T (2005-2007); and President, Western Region, AT&T Services (2008-2009). Mr. Montford was Chancellor of the Texas Tech University System from 1996 to 2001 and also served in the Texas Senate from 1983 to 1996, where he served as both Chairman of the Senate Finance Committee and Chairman of the Senate State Affairs Committee. In 2002, Mr. Montford was named Chancellor Emeritus of the Texas Tech University System. He is a former active duty U.S. Marine Officer and an elected District Attorney. During the past five years, Mr. Montford has served as a Director of one publicly traded company other than Southwest: Fleetwood Enterprises, Inc. (1999-2009)., 1025562=April 5, 2012, 459178=According to the Department of Transportation\u0092s Air Travel Consumer Report, Southwest received the lowest ratio of complaints per passengers boarded of all major U.S. carriers for the fourth consecutive year in 2011., 991833=At the 2011 Annual Meeting of Shareholders of the Company, a Shareholder proposal requesting that the Board take the steps necessary so that each Shareholder voting requirement affecting the Company that calls for a greater than simple majority vote be changed to a majority of the votes cast for and against the proposal was not submitted to a vote because the proponent failed to properly present the proposal personally or through a qualified representative at the meeting. Nevertheless, in its Current Report on Form 8-K filed on May 24, 2011, the Company disclosed the vote the proposal would have received had it been properly presented, which reflected that the proposal would have received a majority of the votes cast thereon as well as a majority of the outstanding shares entitled to vote thereon., 466809=Southwest received the 2011 Quest for Quality Award for Excellence in Air Cargo from Logistics Management Magazine and ranked first in ontime performance, value, and Customer Service., 296680=J. Veronica Biggins is a Managing Director in the Atlanta office of Diversified Search LLC, an executive and board search firm. Ms. Biggins was Managing Partner of the Atlanta office of Hodge Partners from 2007 until 2011 when Hodge Partners, also an executive and board search firm, became a part of Diversified Search. Ms. Biggins served as Assistant to the President of the United States and Director of Presidential Personnel under President William Jefferson Clinton and has also served as Chair of the Czech Slovak American Enterprise Fund. Ms. Biggins\u0092 background includes 20 years\u0092 experience with NationsBank (now Bank of America) and its predecessor. Prior to joining the White House, Ms. Biggins was one of the highest ranking women in the banking industry. Ms. Biggins also serves on the Avnet, Inc. board (since 1997). Previously she served as a Director of Zep Inc. (2007-2012) and AirTran Holdings, Inc. (2001-2011). Ms. Biggins has served on a number of non-profit Boards., 394746=Pasadena, CA 91101, 1008587=2010, 478714=2011 Short-Term Incentive Compensation. In considering bonus awards for 2011, the Committee continued to implement its multi-year plan to apply a more structured and multi-dimensional approach for evaluating the Company\u0092s performance by referencing the Company\u0092s \u0093Management Scoreboard.\u0094 The Committee also considered individual contributions and performance. Based on the Company\u0092s numerous accomplishments, each of the named executive officers received a bonus for 2011; however bonuses for 2011 were lower than 2010, reflecting, in part, the Company\u0092s decrease in earnings compared to 2010. The Management Scoreboard, which identified four broad categories of performance indicators, is discussed in more detail below under \u0093Determination of 2011 Executive Compensation; Analysis of Individual Compensation Elements \u0096 Bonus.\u0094, 491176=The airline industry data included in the 2009 Assessment included information from the following six airlines that chose to participate in Towers Watson\u0092s custom survey, The Airline Industry Compensation Survey: American Airlines, Continental Airlines, Delta Air Lines, Northwest Airlines, United Airlines, and Southwest Airlines (data for this group was collected prior to the Delta-Northwest merger)., 480874=2011 Long-Term Incentive Compensation. During 2011, as it did for the first time in 2010, the Committee granted restricted stock units to the named executive officers in order to diversify their plan-based equity portfolios. Two of the named executive officers, including the Chief Executive Officer, received a decrease in equity compensation. The other three named executive officers received an approximately four percent increase in equity compensation. The value of the equity grants reflects the Committee\u0092s determination, based on the 2011 Assessment and related input from the Committee\u0092s independent consultant, that the grants would provide appropriate total compensation opportunities for each of the named executive officers. Additional detail regarding the 2011 equity grants is included below under \u0093Determination of 2011 Executive Compensation; Analysis of Individual Compensation Elements \u0096 Equity.\u0094, 284841=At the Annual Meeting of Shareholders, ten Directors are to be elected for one-year terms expiring in 2013. Gary C. Kelly, Laura H. Wright, and Ron Ricks have been selected as a proxy committee by the Board of Directors, and it is the intention of the proxy committee that, unless otherwise directed therein, proxies will be voted for the election of all of the nominees listed below. Although it is not contemplated that any of the nominees will be unable to serve, if such a situation arises prior to the meeting, the proxy committee will act in accordance with its best judgment. Each of the nominees has indicated his or her willingness to serve as a member of the Board of Directors, if elected., 547196=Through January 2011, pursuant to an employment contract that expired on February 1, 2011, Mr. Kelly and members of his immediate family were entitled to reimbursement of medical and dental expenses. Mr. Kelly no longer receives this benefit., 389031=The following table sets forth, as of February 29, 2012, information with respect to persons who, to the Company\u0092s knowledge, beneficially own more than five percent of the Company\u0092s common stock., 534137=Chief Executive Officer. The amount of the Chief Executive Officer\u0092s 2011 equity grant was primarily driven by the Committee\u0092s desire to create a total compensation opportunity that would be competitive and that would therefore serve as a significant retention tool. The Committee took into account the advice of its independent consultant and the Chief People Officer regarding the amount that would reasonably serve these purposes., 277343=To attend the meeting in person, you will need to bring (i) a valid government-issued photo identification, such as a driver\u0092s license or passport, and (ii) either an Admission Ticket or proof of ownership of Southwest Airlines Co. common stock as of March 20, 2012 (such as an account statement from your broker showing your stock ownership as of March 20, 2012). If you have received a paper copy of your proxy materials, an Admission Ticket is included with your proxy materials. If you have received your proxy materials electronically, you will need proof of ownership to be admitted to the meeting. If you are a proxy holder for a Shareholder of the Company who owned shares of the Company\u0092s common stock as of March 20, 2012, you must also bring to the meeting the executed proxy naming you as the proxy holder, signed by the Shareholder who owned shares of the Company\u0092s common stock as of March 20, 2012., 439682=Set forth below is a summary of (i) the Company\u0092s key accomplishments during 2011; (ii) the Company\u0092s overall compensation objectives; (iii) the Committee\u0092s consideration of the Company\u0092s 2011 say-on-pay vote; (iv) the Committee\u0092s overall approach to executive compensation; and (v) the Committee\u0092s executive compensation decisions for 2011., 987139=Based on the voting results at the Company\u0092s 2011 Annual Meeting of Shareholders with respect to the frequency (the \u0093Frequency Vote\u0094) of Shareholder advisory votes on the compensation of the Company\u0092s named executive officers, the Company has decided to include an advisory vote on the compensation of its named executive officers in its proxy materials on an annual basis. Therefore, the next Shareholder advisory vote on the compensation of the Company\u0092s named executive officers is scheduled to occur at the Company\u0092s 2013 Annual Meeting of Shareholders. The next required Frequency Vote is currently scheduled for the Company\u0092s 2017 Annual Meeting of Shareholders., 477322=2011 Increases in Base Pay. Prior to 2011, (i) none of the named executive officers, including the Chief Executive Officer, had received increases in base pay since at least July 2008; and (ii) four of the named executive officers, including the Chief Executive Officer, had not received base pay increases despite having received promotions and, as a result, having assumed significantly increased responsibilities. In early 2011, given the Company\u0092s financial health and other factors, the Committee decided it was the appropriate time to move named executive officer salaries closer to market. In making its decision, the Committee took into account (i) updated market data provided by the Committee\u0092s independent consultant and the independent consultant\u0092s related assessments and recommendations (collectively, the \u00932011 Assessment\u0094); (ii) the Committee\u0092s current evaluation of the named executive officers\u0092 performance; and (iii) the current nature and scope of the named executive officers\u0092 roles and responsibilities within the Company. Additional information regarding 2011 base pay is provided below under \u0093Determination of 2011 Executive Compensation; Analysis of Individual Compensation Elements \u0096 Salary.\u0094, 459985=According to the Department of Transportation\u0092s Air Travel Consumer Report, Southwest improved its ontime performance to 81.3% in 2011 from 79.5% in 2010 and improved its placement among all major U.S. carriers from tenth place to sixth place., 1054391=IN WITNESS THEREOF, the Corporation has caused this Restated Certificate of Formation to be executed this     day of                     , 2012., 977521=Despite the numerous challenges facing the Company and the airline industry over the last decade and the significant negative impact in 2011 of surging fuel prices, 2011 marked the Company\u0092s 39th consecutive year of profitability, an accomplishment unparalleled by any U.S. airline. The named executive officers deserve to be rewarded for this accomplishment, as well as the Company\u0092s other 2011 financial accomplishments (including the record revenue results) discussed above under \u0093Compensation Discussion and Analysis \u0097 Executive Summary.\u0094, 329187=Attendance at Meetings. The Board of Directors held eleven meetings during 2011 (some of which spanned two days) and otherwise acted by unanimous written consent. During 2011, each of the Company\u0092s current Directors attended at least 75 percent of the total number of Board meetings and applicable Committee meetings held during the period for which he or she served as a Director. It is the Board\u0092s policy that every Director and nominee for Director should make every effort to attend the Company\u0092s Annual Meeting of Shareholders. All of the Company\u0092s Directors at the time attended the 2011 Annual Meeting of Shareholders., 1088108=4. Ratification of the selection of Ernst & Young LLP as the Company\u0092s independent auditors for the fiscal year ending December 31, 2012., 994290=Although the proposal at the 2011 Annual Meeting of Shareholders, even if properly presented, would not have been binding, given the size of the vote in support of the proposal, the Board and its Nominating and Corporate Governance Committee have reexamined the arguments for and against the current voting provisions and concluded that it is in the best interests of the Shareholders to allow the Shareholders the opportunity to vote on an amendment to the Articles to lower the required Shareholder vote with respect to Fundamental Actions from two-thirds of the outstanding shares entitled to vote thereon to a simple majority of the outstanding shares entitled to vote thereon. Texas law does not permit the vote threshold with respect to these Fundamental Actions to be below a majority of the outstanding shares entitled to vote thereon., 971196=Southwest Airlines Co. Severance Plan for Directors. The Board of Directors adopted the Southwest Airlines Co. Severance Plan for Directors in 2000. Pursuant to this plan, upon retirement from the Board of Directors, a non-Employee Director who has served at least five years as of the date of retirement is entitled to a cash payment of $35,000, and a non-Employee Director who has served at least ten years is entitled to a cash payment of $75,000., 375121=Use of Consultants. The Compensation Committee has sole authority to retain any compensation consultant to be used to assist it in the evaluation of officer and Board compensation. During 2011, the Compensation Committee continued to engage Pay Governance LLC, an independent executive compensation advisory firm, as the Compensation Committee\u0092s independent consultant. References to the work of the independent consultant are inclusive of work performed by individual Pay Governance consultants at their predecessor firm. The Compensation Committee\u0092s executive, 384468=The Company requires that all of its Directors and executive officers complete an annual questionnaire that requires them to identify and describe any transactions that they or their respective related parties may have with the Company, whether or not material. Separately, the Company\u0092s Internal Audit Department analyzes accounts payable records to search for payments involving (i) the Company\u0092s Directors and executive officers, (ii) known relatives of the Company\u0092s Directors and executive officers, (iii) companies and organizations with which the Directors and executive officers are associated, and (iv) security holders known to the Company to be the beneficial owner of more than five percent of the Company\u0092s common stock. The questionnaire for non-Employee Directors is also designed to elicit information that should be considered to determine that the Company satisfies the NYSE\u0092s requirement that a majority of its Board members be independent within the meaning of the NYSE\u0092s rules. Relevant information regarding Directors is then provided to the Nominating and Corporate Governance Committee, which is responsible for evaluating the qualifications of Board nominees, including independence, and for making recommendations to the Board regarding (i) nominations for Board membership; and (ii) individual qualifications for committee membership, taking into account various additional regulatory requirements, including independence requirements, that specifically apply to the different Board committees. In making its recommendations to the Board, the Nominating and Corporate Governance Committee considers the following regulatory guidance: (i) Item 404(a) of Regulation S-K of the Securities Act of 1933, as amended (Transactions with Related Persons); (ii) Accounting Standards Codification Topic 850 (Related Party Disclosures); and (iii) the NYSE\u0092s governance standards related to independence determinations. Based on the foregoing, the Board has determined that the following Directors are independent under applicable NYSE standards: David W. Biegler, J. Veronica Biggins, Douglas H. Brooks, William H. Cunningham, John G. Denison, Nancy B. Loeffler, John T. Montford, Thomas M. Nealon, and Daniel D. Villanueva. In addition, the Board determined that Travis C. Johnson, who retired from the Board in May 2011, was independent., 800031=The following table provides information with respect to stock options exercised by, and stock awards vested for, the named executive officers during 2011., 983060=During 2011, the Company provided minimal perquisites to the named executive officers and did not provide for tax gross-ups of executive compensation., 263400=Fiscal 2011 Director Compensation, 455996=Southwest was recognized as one of the world\u0092s top ten safest airlines in the Holistic Safety Rating 2011 by the Air Transport Rating Agency., 1091041=Wednesday, May 16, 2012, 531439=Approach to, and Justification of, 2011 Equity Compensation. The Committee believes that the value of equity grants should be considered primarily in the context of future year compensation opportunities, with some consideration of prior year performance, and that equity should be granted in amounts that provide market compensation opportunities and related retention benefits. The Company has historically granted stock options to accomplish these purposes; however, beginning in 2010, the Committee decided to grant restricted stock units to diversify the portfolio of equity held by the named executive officers and to address systemic retention concerns by providing a form of equity that, unlike stock options, is intended to retain some value over time regardless of the Company\u0092s stock price. As shown in the \u0093Outstanding Equity Awards at Fiscal 2011 Year-End\u0094 table, the named executive officers all hold a significant number of stock options. Therefore, based on input from its independent consultant, the Committee has concluded that restricted stock units continue to serve as a more effective vehicle for addressing retention concerns because, unlike stock options, the value of restricted stock units are not totally dependent on stock price (i.e., they allow for retention of some value to the executive even if the Company\u0092s stock price subsequently drops below the grant date stock price). At the same time, restricted stock units serve to align executive pay with Shareholder value because the compensation opportunity correlates with the Company\u0092s stock price over an extended period of time., 453372=The Company launched Southwest\u0092s All-New Rapid Rewards® program in March 2011, which already produced strong results during 2011., 382560=the Company\u0092s safety and operational compliance practices generally; and (v) periodically reporting to the Board on the adequacy and effectiveness of the Company\u0092s safety and operational compliance programs. The Safety and Compliance Oversight Committee held five meetings during 2011., 497964=Determination of 2011 Executive Compensation; Analysis of Individual Compensation Elements, 880387=In addition to the amounts discussed above, in the event of termination of their employment for any reason other than for cause, each of the named executive officers would be eligible to participate in any non-contract retiree medical benefit plan or program that the Company may then make available to its retirees generally on the same terms as other retirees. In addition, these individuals would be entitled to the amounts credited to their accounts pursuant to the Company\u0092s qualified retirement plans, as well as nonqualified deferred compensation amounts credited to their accounts pursuant to the Company\u0092s excess benefit plan and, with respect to Mr. Kelly, his individual deferred compensation arrangement, each as disclosed in more detail above under the heading \u0093Nonqualified Deferred Compensation in Fiscal 2011.\u0094, 652220=The following table provides information with respect to stock options and restricted stock units held by the named executive officers as of December 31, 2011. Stock options and restricted stock units are the only types of equity awards that have been granted to the named executive officers., 500456=In early 2011, given the Company\u0092s financial health, the moderate recovery in the U.S. economy, and the Committee\u0092s view of the performance of the named executive officers, the Committee concluded it was necessary and in the best interests of the Company to protect the Company\u0092s future health by taking action to, 235873=WEDNESDAY, MAY 16, 2012}",
    "textBeforeTable": "  The following sets forth certain information for each nominee for Director of the Company. At the Annual Meeting of Shareholders, ten Directors are to be elected for one-year terms expiring in 2013. Gary C. Kelly, Laura H. Wright, and Ron Ricks have been selected as a proxy committee by the Board of Directors, and it is the intention of the proxy committee that, unless otherwise directed therein, proxies will be voted for the election of all of the nominees listed below. Although it is not contemplated that any of the nominees will be unable to serve, if such a situation arises prior to the meeting, the proxy committee will act in accordance with its best judgment. Each of the nominees has indicated his or her willingness to serve as a member of the Board of Directors, if elected. PROPOSAL 1 \u0097 ELECTION OF DIRECTORS The presence at the meeting, in person or by proxy, of the holders of a majority of the shares of the Company\u0092s common stock entitled to vote at the meeting is necessary to constitute a quorum. Shareholders of record at the close of business on March 20, 2012, are entitled to vote at the meeting. As of that date, the Company had issued and outstanding 767,480,209 shares of common stock. Abstentions and broker non-votes are",
    "textAfterTable": "  * As of January 1, 2012.   2 Table of Contents David W. Biegler has been Chairman and Chief Executive Officer of Southcross Energy, LLC since July 2009. Southcross is a midstream natural gas company engaged in the purchase and sale, pipeline transportation, gathering, and processing of natural gas. Mr. Biegler has also served as Chairman and Chief Executive Officer of Estrella Energy L.P., an investor in Southcross, since September 2003. Mr. Biegler served as interim President and Chief Executive Officer of Dynegy Inc., a provider of wholesale power, capacity, and ancillary services, from March 12, 2011 to April 11, 2011. He retired as Vice Chairman of TXU Corp. at the end of 2001, having served TXU Corp. as President and Chief Operating Officer from 1997 until 2001. He previously served as Chairman, President, and Chief Executive Officer of ENSERCH Corporation from 1993 to 1997. During the past five years, Mr. Biegler has served as a Director of the following companies that are or were publicly traded: Trinity Industries, Inc. (since 1992); Animal Health International, Inc. (2007-2011); Dynegy Inc. (2003-2011); and Guaranty Financial Group Inc. (2008-2009). Mr. Biegler also serves as a Director for Austin Industries. In November 2011, after Mr. Biegler",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}