{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "the main residence hall at uwm has a small theatre. thats where i spend alot of my time with friends",
            "the hardest part is getting a good roomate. i would definetly suggest requesting a roomate you already know.",
            "the first year of college can be very difficult. hang in there. once you get use to being on your own and learning orginazation skills, it becomes very enjoyable.",
            "i really enjoy going to uwm. the professors are very caring and truly interested in seeing you succeed. living on campus is a excellent experience."
        ]
    ],
    "pageTitle": "University of Wisconsin-Milwaukee (UW-Milwaukee) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Wisconsin-Milwaukee/reviews?_escaped_fragment_=/show/23893",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00149-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 885935727,
    "recordOffset": 885805748,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{610164=Oakland Gyros is great food. Oriental Theater, Miramar Theater for good music and movies., 229674=Looking for fun things to do in Milwaukee is hardly ever an issue. The Miramar on Oakland ave is a great venue for bands and electronic music Wednesday - Saturday of most every week (the only downside about the venue being a small cover charge). For those who are 21 or older, there are many bars and clubs surrounding the area to have fun, dance, and meet new and interesting people. During the warmer months bike riding, rollerblading, running, or playing volleyball is quite popular around the beaches on Lincoln Memorial Drive., 20213=Apply for as many scholarships as possible for school. Whether it is $100, or $1000, every little bit helps. Also, be sure to get your information and everything sent in by the deadlines so that you are not feeling like you are behind everyone else., 40126=I would suggest that anyone looking to pursue a dance degree should take dance classes from a local studio for a few years before attending the required audition. It was very obvious that the professors conducting the audition were looking for prospective students with previous dance training. Scholarships were awarded at the first three auditions held in October, February, and April. The last audition was held in June and students were still admitted to the program but scholarship money had already been used up., 761151=© 2015, Cappex.com, LLC, 348388=Every October there is a Zombie Apocalypse where there are students dressed up as zombies, and you must cross the campus without being bitten., 163393=We have so many clubs and activities that I wouldn't even be able to count! If you can think of something we most likely have it! I, on the other hand, found an organization that we did not have, Autism Speaks. Once I found out we did not have an organization here, I started looking into starting it. I am now currently getting the chapter started for the Fall 2012 semester!}",
    "textBeforeTable": "08/20/2009 Reviewer is A current student here. 20 out of 20 people found this review useful. 1 of 178 Chelsea from Bristol, WI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Am learning a lot I have learned so much so far at UWM. My art classes are fantastic! The instructors are very knowledgeable in their fields, and push creativity and new thoughts into my head effortlessly. I can't wait to go back! Login to rate or flag the reviews Gabrielle from Franksville, WI 09/10/2011 Reviewer is A current student here. 13 out of 13 people found this review useful. 2 of 178 Categories Comments Great for these types of students This college is great if you are unsure of what you want to major in. They offer an Ed Psych course that runs once a week and it's purpose is to help you select a major. It's great for someone who likes the city and isn't freaked out by crowds of people. It's also decent for commuters. Tips for prospective students -Do not put off orientation until the last minute. It's when you schedule your classes and you do not want to get stuck with",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}