{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Black Protestant",
            "Catholic",
            "Other",
            "None"
        ],
        [
            "Adherents",
            "13,136",
            "1,900",
            "360",
            "240",
            "3",
            "20,023"
        ],
        [
            "Congregations",
            "72",
            "18",
            "2",
            "1",
            "1",
            "-"
        ]
    ],
    "pageTitle": "Newport, Tennessee (TN 37821) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Newport-Tennessee.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00313-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 368334799,
    "recordOffset": 368199781,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6978=According to our research of Tennessee and other state lists there were 53 registered sex offenders living in Newport, Tennessee as of August 01, 2015. The ratio of number of residents in Newport to the number of sex offenders is 131 to 1., 129698=Newport: Newport Grammar School, 25662=Elevation: 1055 feet, 25762=Incorporated in 1799}",
    "TableContextTimeStampAfterTable": "{52009=School Enrollment by Level of School (%) in 2013, 105611=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 73529=5.33% of this county's 2010 resident taxpayers moved to other counties in 2011 ($23,623 average adjusted gross income), 56258=Graphs represent county-level data. Detailed 2008 Election Results, 80319=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population), 37270=Nitrogen Dioxide (NO2) [ppb] level in 2006 was 4.41. This is significantly better than average. Closest monitor was 18.7 miles away from the city center., 36608=Air Quality Index (AQI) level in 2012 was 107. This is significantly worse than average., 104294=Total of 9 patent applications in 2008-2015., 38018=Sulfur Dioxide (SO2) [ppb] level in 2006 was 4.50. This is significantly worse than average. Closest monitor was 18.7 miles away from the city center., 32066=Hotels: Comfort Inn Newport (1149 Smokey Mountain Lane), Best Western Newport Inn (1015 Cosby Highway), Comfort Inn (1149 Smokey Mountain Ln), Bryant Town Motel (766 Cosby Highway), Family Inns of America (1025 Cosby Highway), Four Seasons Cottages (2488 Highway 32)., 17510=On 3/11/1963, a category F2 tornado 5.0 miles away from the city center killed one person and injured one person and caused between $50,000 and $500,000 in damages., 54830=1996 Presidential Elections Results, 55688=2008 Presidential Elections Results, 55402=2004 Presidential Elections Results, 55974=2012 Presidential Elections Results, 71703=5.02% of this county's 2011 resident taxpayers lived in other counties in 2010 ($27,450 average adjusted gross income), 39462=Particulate Matter (PM10) [µg/m3] level in 2000 was 30.4. This is significantly worse than average. Closest monitor was 19.1 miles away from the city center., 55116=2000 Presidential Elections Results, 17229=On 2/18/1976, a category F2 (max. wind speeds 113-157 mph) tornado 1.6 miles away from the Newport city center injured 10 people and caused between $500,000 and $5,000,000 in damages., 38762=Ozone [ppb] level in 2012 was 36.7. This is about average. Closest monitor was 24.1 miles away from the city center., 51611=Educational Attainment (%) in 2013}",
    "textBeforeTable": "Religion statistics for Newport city (based on Cocke County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Bottled, tank, or LP gas (2%) Utility gas (20%) Electricity (78%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 7 Cocke County: 1.98 / 10,000 pop. Tennessee: 1.99 / 10,000 pop. Number of supercenters and club stores: 1 This county: 0.28 / 10,000 pop. State: 0.17 / 10,000 pop. Number of convenience stores (no gas): 6 Cocke County: 1.70 / 10,000 pop. Tennessee: 0.65 / 10,000 pop. Number of convenience stores (with gas): 27 Cocke County: 7.65 / 10,000 pop. State: 5.16 / 10,000 pop. Number of full-service restaurants: 24 Here: 6.80 / 10,000 pop. State: 6.56 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}