{
    "relation": [
        [
            "",
            "T20Is",
            "First-class",
            "List A",
            "Twenty20"
        ],
        [
            "Mat",
            "1",
            "163",
            "166",
            "225"
        ],
        [
            "Inns",
            "1",
            "",
            "",
            "214"
        ],
        [
            "Balls",
            "24",
            "29598",
            "7081",
            "4558"
        ],
        [
            "Runs",
            "25",
            "14328",
            "6157",
            "5737"
        ],
        [
            "Wkts",
            "3",
            "545",
            "217",
            "263"
        ],
        [
            "BBI",
            "3/25",
            "7/54",
            "4/18",
            "5/24"
        ],
        [
            "BBM",
            "3/25",
            "",
            "4/18",
            "5/24"
        ],
        [
            "Ave",
            "8.33",
            "26.28",
            "28.37",
            "21.81"
        ],
        [
            "Econ",
            "6.25",
            "2.90",
            "5.21",
            "7.55"
        ],
        [
            "SR",
            "8.0",
            "54.3",
            "32.6",
            "17.3"
        ],
        [
            "4w",
            "0",
            "",
            "7",
            "4"
        ],
        [
            "5w",
            "0",
            "25",
            "0",
            "1"
        ],
        [
            "10",
            "0",
            "2",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Alfonso Thomas | South Africa Cricket | Cricket Players and Officials | ESPN Cricinfo",
    "title": "",
    "url": "http://www.espncricinfo.com/county-cricket-2013/content/player/47569.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00257-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 450848367,
    "recordOffset": 450812244,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{64213=May 4, 2015, 56456=He claimed three five-wicket hauls in the first five games of 2001-02 and, on the way to finishing the season as his side's highest wicket-taker (he claimed 35 at 22.14 apiece), he was selected for the South Africa side in the Hong Kong Sixes in November 2001 and the South Africa A side to play against the touring India A side., 58523=He claimed a five-wicket haul for Somerset in just his second match and, up until the end of the 2014 season, had claimed 279 first-class wickets at an average of 26.37 for the club. Highlights include leading the club (he captained in the absence of Marcus Trescothick) to the semi-final of the Champions League in 2011 and taking the club to within the brink of their first Championship title in 2010 - Thomas claimed 49 wickets at 24.53 - with the club also finishing second in both limited-overs competitions. In 2014, in a match against Sussex at Taunton, also became the first man in the club's history to take four wickets in four balls in a first-class game., 56828=A successful move to Northerns for the 2003-04 season nudged the selectors and, after an impressive stint with South Africa A, he replaced the injured Andre Nel in the Test squad to India late in 2004., 59232=The increased exposure led to more opportunities for Thomas. He represented Pune Warriors in the IPL in 2011 and 2012, Dhaka Gladiators in the 2013 BPL and Adelaide Strikers (for the 2011-12season) and Perth Scorchers (for 2012-13 and 2013-14 seasons) in the Big Bash. With an excellent yorker and an apparently unflappable temperament, he delivered many match-defining spells of death bowling and remained in high demand in the shortest format. Dhaka won the BPL the year he played for them, as did Perth in 2012-14. He is, by some distance, Somerset's highest wicket-taker in the T20 format., 57420=Instead, in the English summer of 2007, he found himself playing club cricket for Audley in the North Staffs South Cheshire League. Responding to an emergency call-up from Warwickshire - who found themselves hurtling to relegation in the first-class and List A league and had already utilised three overseas players - he played four games and performed relatively well in a struggling side. While it was not enough to avoid relegation or win a longer-term deal, it was enough to attract the attention of Somerset's director of cricket, Brian Rose, who offered a contract as a Kolpak registration for the 2008 season., 35593=Born February 9, 1977, Cape Town, Cape Province, 65186=Sep 16, 2014, 63327=Jun 22, 2015, 60040=\"The turning point of my career came when a man called Brian Rose showed belief in me,\" Thomas told ESPNcricinfo in 2014. \"I love Somerset.\" George Dobell, 59868=He broke his ankle playing golf in October 2014 but is expected to return to Taunton for his eighth season with the club in 2015., 79583=4391 runs after 35, and 2354 outside top five, 57073=It was not until 2007 that he was called into the international side, though. In a T20I against Pakistan, Thomas claimed 3-25 and was arguably the pick of the bowlers in helping his side to a 10-wicket victory. But in a strong era of South African seamers, it was to be his only international appearance.}",
    "textBeforeTable": "Batting and fielding averages }); } } window.setTimeout(fixIframe,1300); if($('.FB_ElementReady iframe').height()>38 || $('.FB_ElementReady iframe').height()==0 || $('.FB_ElementReady iframe').height()== null){ $('.FB_ElementReady iframe').css({'height':'30px','width':'300px'}); function fixIframe(){ fixIframe(); jQuery(document).ready(function($){",
    "textAfterTable": "7 67 0 Bowling averages Mat Inns Balls Runs Wkts BBI BBM Ave Econ SR 4w 5w 10 T20Is 1 1 24 25 3 3/25 3/25 8.33 6.25 8.0 0 0 0 First-class 163 29598 14328 545 7/54 26.28 2.90 54.3 25 2 List A 166 7081 6157 217 4/18 4/18 28.37 5.21 32.6 7 0 0 Twenty20 225 214 4558 5737 263 5/24 5/24 21.81 7.55 17.3 4 1 0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}