{
    "relation": [
        [
            "Citing Patent",
            "US7707465 *",
            "US7737826 *",
            "US7774638 *",
            "US8055934",
            "US8156384 *",
            "US8181077 *",
            "US8286027 *",
            "US8745292",
            "US20110231743 *",
            "US20110296256 *",
            "WO2014158161A1 *"
        ],
        [
            "Filing date",
            "Jan 26, 2006",
            "Sep 10, 2007",
            "Sep 27, 2007",
            "Jun 22, 2010",
            "Aug 6, 2009",
            "Nov 15, 2007",
            "May 25, 2010",
            "Jun 23, 2010",
            "",
            "",
            "Mar 28, 2013"
        ],
        [
            "Publication date",
            "Apr 27, 2010",
            "Jun 15, 2010",
            "Aug 10, 2010",
            "Nov 8, 2011",
            "Apr 10, 2012",
            "May 15, 2012",
            "Oct 9, 2012",
            "Jun 3, 2014",
            "Sep 22, 2011",
            "Dec 1, 2011",
            "Oct 2, 2014"
        ],
        [
            "Applicant",
            "International Business Machines Corporation",
            "Ricoh Company Ltd.",
            "Unisys Corporation",
            "International Business Machines Corporation",
            "Siemens Aktiengesellschaft",
            "Canon Kabushiki Kaisha",
            "Oracle International Corporation",
            "International Business Machines Corporation",
            "Fujitsu Limited",
            "Watkins John E",
            "Hewlett-Packard Development Company, L.P."
        ],
        [
            "Title",
            "Routing of shared I/O fabric error messages in a multi-host environment to a master control root node",
            "Event notification device, event notification method, and computer program product",
            "Uncorrectable data error containment systems and methods",
            "Error routing in a multi-root communication fabric",
            "Communications administration method and system for an electronic apparatus",
            "Methods and devices for the dynamic management of transmission errors by network points of interconnections",
            "Input/output device including a mechanism for accelerated error handling in multiple processor and multi-function systems",
            "System and method for routing I/O expansion requests and responses in a PCIE architecture",
            "Control circuit, information processing apparatus, and method for controlling information processing apparatus",
            "Input/output device including a mechanism for accelerated error handling in multiple processor and multi-function systems",
            "Error coordination message for a blade device having a logical processor in another system firmware domain"
        ]
    ],
    "pageTitle": "Patent US7474623 - Method of routing I/O adapter error messages in a multi-host environment - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7474623?dq=5,838,906",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00066-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471991259,
    "recordOffset": 471966651,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The description of the present invention has been presented for purposes of illustration and description, and is not intended to be exhaustive or limited to the invention in the form disclosed. Many modifications and variations will be apparent to those of ordinary skill in the art. The embodiment was chosen and described in order to best explain the principles of the invention, the practical application, and to enable others of ordinary skill in the art to understand the invention for various embodiments with various modifications as are suited to the particular use contemplated. Network adapters may also be coupled to the system to enable the data processing system to become coupled to other data processing systems or remote printers or storage devices through intervening private or public networks. Modems, cable modem and Ethernet cards are just a few of the currently available types of network adapters. Input/output or I/O devices (including but not limited to keyboards, displays, pointing devices, etc.) can be coupled to the system either directly or through intervening I/O controllers. A data processing system suitable for storing and/or executing program code will include at least one processor coupled directly or indirectly to memory elements through a system bus. The memory elements can include local memory employed during actual execution of the program code, bulk storage, and cache memories which provide temporary storage of at least some program code in",
    "textAfterTable": "US6907510 Apr 1, 2002 Jun 14, 2005 Intel Corporation Mapping of interconnect configuration space US7036122 Apr 1, 2002 Apr 25, 2006 Intel Corporation Device virtualization and assignment of interconnect devices US7096305 Oct 14, 2003 Aug 22, 2006 Broadcom Corporation Peripheral bus switch having virtual peripheral bus and configurable host bridge US7134052 May 15, 2003 Nov 7, 2006 International Business Machines Corporation Autonomic recovery from hardware errors in an input/output fabric US7174413 Apr 1, 2006 Feb 6, 2007 Nextio Inc. Switching apparatus and method for providing shared I/O within a load-store fabric US7188209 Apr 19, 2004 Mar 6, 2007 Nextio, Inc. Apparatus and method for sharing I/O endpoints within a load store fabric by encapsulation of domain information in transaction layer packets US7194538 Jun 17, 2002 Mar 20, 2007 Veritas Operating Corporation Storage area network (SAN) management system for discovering SAN components using a SAN management server US20020188701 Jun 12, 2001 Dec 12,",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}