{
    "relation": [
        [
            "Date",
            "Oct 17, 1995",
            "Feb 27, 2001",
            "Mar 30, 2001",
            "Mar 30, 2001",
            "Feb 7, 2005",
            "Jan 6, 2009"
        ],
        [
            "Code",
            "AS",
            "REMI",
            "SULP",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Surcharge for late payment",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: STA-RITE INDUSTRIES, INC., WISCONSIN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SPENCER, TERREL F.;REEL/FRAME:007724/0556 Effective date: 19951012",
            "",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US5653831 - Method and apparatus for making a filter module - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5653831?dq=%235,519,867",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00020-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 467204047,
    "recordOffset": 467181906,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations For example, after analyzing this specification, persons of ordinary skill in the art will recognize that the assembly 44 may be supported upon a mandrel-like structure or the like and rotated. Such persons will also recognize the possibility--perhaps less practical than the preferred method--of rotating the dispensing implement 62 and maintaining the assembly 44 stationary or rotating both the implement 62 and the assembly 44. The foregoing variants are contemplated by the invention. While the principles of the invention have been shown and described in connection with but a few embodiments, it is to be understood clearly that such embodiments are by way of example and are not limiting. Because it may be desirable to diminish the time at which the completed module can be handled for, e.g., packaging for sale, when a thermosetting adhesive such as hot melt is used, fans 70 are positioned adjacent to the assembly 44, as shown in FIG. 10, so that cool air is blown across the filter module 12 to more quickly harden the adhesive 68. Once the adhesive 68 is hardened, the new filter module 12 is complete. Although many different adhesives 68 may be used in this method, the preferred embodiment involves an adhesive which is applied in a hot molten state and subsequently hardened by cooling to provide the desired seal. One specific hot melt adhesive is Uniplast MP900. The notch 48 (between the flange 22",
    "textAfterTable": "Bendix Corp Depth-type filter for operation with high differential pressures across the filter US3865919 * Apr 19, 1974 Feb 11, 1975 David B Pall Cylindrical filter elements with improved side seam seal US3867294 * May 9, 1973 Feb 18, 1975 Pall Corp Cylindrical filter elements with improved side seam seal US3988244 * Jun 30, 1975 Oct 26, 1976 Sta-Rite Industries, Inc. Cartridge filter US4056876 * Sep 10, 1976 Nov 8, 1977 Robert Bosch Gmbh Method of making a filter US4120711 * Sep 30, 1977 Oct 17, 1978 Universal Water Systems, Inc. Process for sealing end caps to filter cartridges US4184966 * Sep 29, 1977 Jan 22, 1980 Pall David B Tubular filter elements with improved side seam seal US4186099 * Jun 19, 1978 Jan 29, 1980 All Services Enterprises,",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}