{
    "relation": [
        [
            "Cited Patent",
            "US3274584 *",
            "US3376452 *",
            "US3414676 *",
            "US3548403 *",
            "US3553376 *",
            "US3647971 *"
        ],
        [
            "Filing date",
            "Aug 29, 1963",
            "Nov 9, 1964",
            "Jul 19, 1965",
            "Jun 12, 1967",
            "Aug 28, 1968",
            "Mar 20, 1970"
        ],
        [
            "Publication date",
            "Sep 20, 1966",
            "Apr 2, 1968",
            "Dec 3, 1968",
            "Dec 15, 1970",
            "Jan 5, 1971",
            "Mar 7, 1972"
        ],
        [
            "Applicant",
            "Dalrymple Donald D",
            "Mid Continent Mfg Co",
            "Veron E. Long",
            "Ripley Co Inc",
            "Powe Kenneth D",
            "Watch Tel 24 Inc"
        ],
        [
            "Title",
            "Apparatus for remote reading of utility meters",
            "Circular electroluminescent display device",
            "Automatic interrogation system for utility meters and the like",
            "Monitoring system",
            "Remote meter reading method and apparatus",
            "Automatic reporting monitoring and control system"
        ]
    ],
    "pageTitle": "Patent US3778771 - Remote meter reading apparatus - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US3778771?ie=ISO-8859-1&dq=U.S.+Patent+No.+4,528,643",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474314351,
    "recordOffset": 474288015,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{10273=United States Patent 1191 Whitaker Dec. 11, 1973 REMOTE METER READING APPARATUS 76 Inventor: William T. Whitaker, 2115 Chestnut St., Wilmington, N.C. 28401 221 Filed: Nov. 22, 1971 21 Appl. No.: 200,792}",
    "textBeforeTable": "Patent Citations 4. The apparatus according to claim 1, and further including a transfer circuit comprising a transfer relay connected into the conductor path between said second tone generating means and said utility meter, said transfer relay being responsive to a third signal from said first tone generating means whereupon said relay, in a first position, connects said second tone generating means with said meter, and in a second position connects said tone generating means with a second meter, whereupon said apparatus may be used to read more than one type of meter. 3. The apparatus according to claim 2, wherein said step switch means comprises a rotary step switch including a plurality of contacts arranged in an arcuate path around a central shaft, a rotary wiper having one end connected to said shaft and the other end adapted to engage one of said contacts, a gear means mounted on said shaft and secured to said wiper for moving said wiper sequentially from one contact to another in response to a signal from said pulsing circuit, said gear means being spring-biased to a normal position out of engagement with any of said contacts, locking means in engagement with the teeth of said gear for preventing inadvertent return of said gear to said normal position during operation of said switch, and a release means for releasing said locking means from engagement with said gear upon completion",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US3899639 * May 11, 1973 Aug 12, 1975 Edmonton City System and method for reading remotely located meters US4672602 * Nov 2, 1984 Jun 9, 1987 Itt Corporation Control and routing system US4799059 * Mar 14, 1986 Jan 17, 1989 Enscan, Inc. Automatic/remote RF instrument monitoring system US4833618 * Feb 20, 1986 May 23, 1989 Net Laboratories, Inc. System for automatically reading utility meters from a remote location US6014089 * Aug 26, 1997 Jan 11, 2000 Tracy Corporation Ii Method for transmitting data using a digital control channel of a wireless network US6150955 * Oct 28, 1996 Nov 21, 2000 Tracy Corporation Ii Apparatus and method for",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}