{
    "relation": [
        [
            "Citing Patent",
            "US6158198 *",
            "US6565501",
            "US6712748",
            "US7802705 *",
            "WO2006103487A1",
            "WO2006114800A1 *"
        ],
        [
            "Filing date",
            "May 17, 1999",
            "Nov 1, 2000",
            "Dec 3, 2002",
            "Oct 12, 2004",
            "Mar 29, 2005",
            "Apr 27, 2005"
        ],
        [
            "Publication date",
            "Dec 12, 2000",
            "May 20, 2003",
            "Mar 30, 2004",
            "Sep 28, 2010",
            "Oct 5, 2006",
            "Nov 2, 2006"
        ],
        [
            "Applicant",
            "Sara Lee Corporation",
            "The Procter & Gamble Company",
            "The Procter & Gamble Company",
            "Magie Pression Co., Ltd.",
            "Concepts For Succes",
            "Santoni & C Spa"
        ],
        [
            "Title",
            "Method of forming a composite folded hosiery product and package",
            "Method and apparatus for folding a web",
            "Method and apparatus for folding a web",
            "Method for forming pleat on fabric composed of polylactic acid yarn, and pleated fabric",
            "Web handling process and equipment",
            "Machine and method for folding textile articles"
        ]
    ],
    "pageTitle": "Patent US5996861 - Method and device for folding hosiery items - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5996861?dq=U.S.+Patent+",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00263-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482301047,
    "recordOffset": 482276704,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations According to FIG. 3c, thereafter, a belt 79 arranged almost in parallel above belt 78 is driven forwardly as shown by arrow 84, while a belt 77 arranged below inclined belt 76 and in parallel to the end of long belt 78 is driven backwardly as shown by arrow 85 in FIG. 3c. Thereby, the hosiery item is folded a second time and may then be advanced to the lower belt 42 according to FIG. 2a. The device according to FIGS. 3a-3c is well-known in the art and is, consequently, only be described in brief. The hosiery item 52 may be put manually onto belt 74 when in a horizontal position or may be forwarded automatically onto belt 74 from a preceding belt. The hosiery item 52 is forwarded partly onto belt 75 arranged horizontally upstream before belt 74, to reach the position as shown in FIG. 3a. Thereafter, according to FIG. 3b belt 74 is tilted downwardly to become aligned with inclined belt 76 arranged upstream before belt 74. Belt 75 is now driven backwardly as shown by arrow 82, while belts 74 and 76 are driven forwardly as shown by arrow 83. A folding card 56 is put onto the hosiery item 52 by a suction means 80 as shown in FIG. 3b. The hosiery item 52 is folded at this position for the first time and is then advanced over belt 76 to",
    "textAfterTable": "US5540647 * Feb 8, 1994 Jul 30, 1996 Jensen Ag Burgdorf Folding apparatus for automatic folding of flatwork US5788130 * Jan 21, 1997 Aug 4, 1998 Todd Motion Controls, Inc. Sock processing apparatus and method * Cited by examiner Non-Patent Citations Reference 1 Leaflet \"Wepamat BLM 751 Hosiery Folder\", pp. 1-2. 2 * Leaflet Wepamat BLM 751 Hosiery Folder , pp. 1 2. * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6158198 * May 17, 1999 Dec 12, 2000 Sara Lee Corporation Method of forming a composite folded hosiery product and package US6565501 Nov 1, 2000 May 20, 2003 The Procter & Gamble Company",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}