{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,154 topics 2,126,173 replies",
            "85,562 topics 1,154,124 replies",
            "1,071 topics 11,072 replies",
            "4,218 topics 64,768 replies",
            "5,996 topics 75,824 replies",
            "50,550 topics 466,306 replies",
            "22,767 topics 196,335 replies",
            "4,274 topics 60,517 replies",
            "1,127 topics 8,222 replies",
            "3,609 topics 115,764 replies"
        ],
        [
            "Last Post Info",
            "Story Mode DLC discussion t... By A.O.D.88 A minute ago",
            "IV & EFLC Vehicles Thread By thehambone 11 minutes ago",
            "6 Star Wanted Level Survival? By Militia A day ago",
            "Is Lance mentally ill? By hot-temper27 24 minutes ago",
            "Unique Vehicles By Militia 13 hours ago",
            "GTA SA Home Invasion \"R... By lil weasel 8 minutes ago",
            "Reasons why Vice City is be... By hot-temper27 19 minutes ago",
            "Was Claude part of Colombia... By SilentSeasons 2 hours ago",
            "The incredible Arachnid By Cerium 7 hours ago",
            "Mapmaking By UrbanAdventuring 33 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=104&t=125758&p=2205810",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00159-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 108880275,
    "recordOffset": 108852571,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9441=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 47602=A.O.D.88, Google, Shaundi., RM76, GamesBoy316, xXMizmerXx, Phoenix_Poop, Yahoo, ClareXoBearrx3, Bing, .JokeR, DemonicMoustache, Pyingyongyang, NubcakeVII, garza337, Dan00001, EagleStrike, Frito-Man, Xing of Virtue, WasHanin, CaptianBackwoods, gizz01, Lion, Vikitorii, Icantthinkofonew, Starscream_910, miclin, Crypain, lol232, CrysisAverted, x_FRoe__, monkb4skunk, TheUnbalanced, Brazil301, Google Mobile, EvilFuture, Berm1322, LittleFamily580, Mithridates158, the_sniper_29, LahTigre, CarimboHanky, Richardbrown30, J-B, FMMZ, OG Viking, moBEttablUesz, AztecaEh, Midnight Hitman, ezstjr, wowsux133, Weazel__03, OrionSR, Avenged Sevenfold, htrgefdsa, Captain Sensib1e, Mrgrandis_HKG, xTrendSs, yakprince, teejay777, Jason Frost, Lobitoxdmm, __TheGovernor__, Daikaiju, WestsideResider, Benny164, DumbForum, timason, CarnageRacing00, RDT33, Stoney0503, missanthropy, KingVee, Shenmue18, TJGM, ClaudX, Twin Turbo, Valtiel150, ChOcOsKiZo, Robaldinio, jakematos2, temi4328, NikkoCharger, EnterTheRedDawn, Roadrage158, ZODIAC 4 v2, Mach1bud, louth91, Chris CJ Jakobsson, Lowi, SilkRiver2648, Daemian, FMHn, lord tammerlain, _Douglas_, Mr_Meanfinger, Choppers, dTrutha, AshManGTA, Thousand Accent, Demetri_FTO_1., SeekingAsylum, JackIrish, Doofy.Ass, MRSJEIKS, Estraikerful, ShagMeMonkeh, SYNTHES1SE, GrandMaster Smith, Hyde Original, Miss Malevolent, No_Flex_zone, Locce, SSKYZX, alfscooby98, Zello, JoeFury1997, Gutslab, Xion136, handcuff_charlie, Spray much bro, Joekill95, TCMike, r.lorenzo13, CaptainMarvel, Majestic81, Bugglass, Run Down That Guy, Quinn_flower, HeavyDuke, hornedturtle, FunkyFreak, !M4G3_N4T10N, toxluv, Marpmarp, Platinum Card, StangOne50, Cico555, Victor Strawn, driver7, mrPrimetime, Footballgrl70, An4ucker, Ashy_ash, LehPhatGer-bear, Heisenberg_GR, killer17456, MrSaucyZ, Stidge uk, slayso, B-Turb0, s2n vaniish, Cracka.Brew, GTA_King345, Malikstuntin, lydianduck, Neopolitan, This Guy Is Here, JuanG12, back2back005, Ezuu, ynreb184, nls_whs_2010, Eggobites90, The Lone Wanderer, TheFoxRiverFugitive, Fetti Debartolo, TheSniperCat13, Bob_Dole, Pat, TexasRocks, Icebergg Slimm, SNL, quadro09, minifat, SonofUgly, KlIIUMlNATl, Fozzie_420, Retrocoyote, big MILLS 304WV, Lochie, Stig, Darrel, Hylskriksen, Lubas, RussianCommie, Jerome, dannyboy013, Rippir1600, ApexReclaimer, Niobium, statistic, erkwang, Ermacs, thehambone, Vinewood Villain, unopieceo, 555FRESH, fenzy09, RedDagger, GTA4LIFE9000, -jr-, RafaeShe, Shiest Bubble, FreshPrinceOfLosSantos, saintsrow, pigeons99, LazyGator, DrMonsterGore, Zonnex, theNGclan, Grand Theft Amanda, Rozaay, a7xbmth, jdude1969, Smooth Longsack, Non Biased GTA 4 fan, JeepXJFreak98, Artful., pg1313, NikoB08, transambill, dan bull, 14241=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 18772=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 16551=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 105598=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 12623=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 21019=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By xXMizmerXx [Xbox 360] Elite Task Force... 614,083 replies 15,212 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By LahTigre Screenshots Topic: Custom R... 2,288,053 replies 113,584 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,485 topics 416,738 replies Disabling Controls? By Doofy.Ass 16 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures, Characters,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}