{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,138 topics 2,125,485 replies",
            "85,560 topics 1,153,989 replies",
            "1,071 topics 11,072 replies",
            "4,218 topics 64,766 replies",
            "5,996 topics 75,818 replies",
            "50,552 topics 466,260 replies",
            "22,767 topics 196,320 replies",
            "4,274 topics 60,497 replies",
            "1,127 topics 8,220 replies",
            "3,606 topics 115,595 replies"
        ],
        [
            "Last Post Info",
            "Story Mode DLC discussion t... By Xing of Virtue A minute ago",
            "Where is Roman's Cab De... By VikDarkbomb A minute ago",
            "6 Star Wanted Level Survival? By Militia 3 hours ago",
            "The Ultimate 100% Save File... By Militia An hour ago",
            "Things that can be done at... By Militia 2 hours ago",
            "Care and Feeding of a San A... By 7 day survivor 2 minutes ago",
            "Reasons why Vice City is be... By Twin Turbo An hour ago",
            "Grand Theft Auto III Chain... By TubewayArmy 27 minutes ago",
            "What are the cops actually... By Jeansowaty 7 hours ago",
            "F*ck ,Marry,Kill By Xing of Virtue 3 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=109&t=481411&p=1060636692",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00019-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 108455599,
    "recordOffset": 108427909,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9514=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 21265=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 16824=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 14412=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 48111=Bing, oldjock, Facebook, Bane X01, p1ckl32, Google, cjarvis15, DaWiesel, Xpert.K, Yahoo, VikDarkbomb, CCPD, rad19dym, Total Failure, Xing of Virtue, Fonshway, GTAKid667, SkynetOnlineID, CaptainMarvel, Elite_Task_Force, svanderman, DaveGrimes96, dice, Misunderstood, Grizzly322, Marpmarp, _CP_, smokingndriving, Yus, Spectacus, Fetti Debartolo, DeucesR, viperdk, r.lorenzo13, H4rdPwn3r1337, That1oneguy, TheHellcat, Crubbiestimp42, GTA4LIFE9000, Andreas, jrl51592, Pavle, custdogg, CrazyHandz, xTrendSs, The Lone Wanderer, H0WITZER, Ronzilla187, Cognoscenti, Google Mobile, ZenderAlpha, Eram, Midnight Hitman, Musi, NBAKingzFan10, Between3and20chars, em1b16a2, GTA_Matt24, 7 day survivor, TOOMtheRaccoon, icecoldkilla1467, Fearx--, iBUCKEYE, Roadkill01, Pikas_PK, zCows, A.O.D.88, EagleStrike, TiberiusMcQueen, jimmy8309, rubenscpu, Thousand Accent, Hjaere, Foreverpast, nguyentienbac6, Sea Bear, Halal Cyborg, Saintdestroyer, WinkingSkeever6, XenoxX, GrandTheftNine, BlackMilk, Rippir1600, RandomCholo, PSMP666, El-Gaddafii, RideEmOut2, rabid_white_dog, Smesi, ten-a-penny, Nesano, Ganton, lpgunit, Gutslab, JSnipe135i, Ryan_Codebreaker, BeckermannDewitt, Taylor, CrysisAverted, GipsyDanger MK2, hornedturtle, EF2000, GunTotinHippie, Rekia87, kaasje, am30, Eternal-Enemies, SilentSeasons, Daequil, In Bed With Jed, DragonSpade, miclin, Smooth Longsack, psymin, xInfamousRYANx, Invalid BigRoN, top dog, Tossin Salad, Retired Mafia, ermaccer, wh1t31v3y, Dave_TE, Lil Kenzo, HeavyDuke, GoodTimesAhead, Lester-The-Molester, 65536, UltraGizmo64, Imnotthefiveo, goldadderXD, Speccy, Jesse.yancey320, CrazyLemon, Skeve613, TheBaronOfHell, L0SS4NT0SK1LL3RV, SKARFACE, FunkyFreak, Red Lynx 23, Jaanus949, jennyjesus, topkek, ap4321, RockstarsPlayer, GeneralSteve93, //XP//, Ledorus, Nameless Foot Soldier, Nuclearsniper, Nachoman, Hyde Original, Sigurd, Omoplataha, R4Yn1zzl3, SeekingAsylum, jp9865, Craigsters, longhurstgb, nokuto, ErMerGerd, marhex, VercettiGuy, pedinhuh, Deceitful-Fox, CptAngel, gfen, TheUnholy, GrandReaping, Scuba 21, PSgtaplayer1, TheMcSame, RedlineDrifts, TDWP_Adam, Warliss, HorrA1985, Non Fiction, saintsrow, m3tal z_DKI, Marticus, DonSpeedy, AztecaEh, MilezDawg, xban, AUScowboy, MrKush, *MURDOC*, fefenc, arewenotmen, Tycek, smiffy84, Sonsalt, iKarimster, jollythecat, Fozzie_420, MrRyanMcCall, marshallbslayer, KlIIUMlNATl, Beng, Edmachine, TubewayArmy, MeatSafeMurderer, Jon3s, OG Viking, faaty, TexasRocks, Shiest Bubble, Epic., Johnny Playert, CH14R1, TBONE1138, Tomasak, Daniol, TheGame1083, MikeyDLuffy, GTAmazing, Daemian, Flandre, FiS!!HeR, GTBunny, RafaelSousaSam, BUTTER MAN 13, EnZiRaphz, Yup I'm that guy, TwisterVictor1, laskaland, Leonazix, Timcatgt5, Voit Turyv, s2n vaniish, Luk38644, Eneveon, Loudy, adrilp, Arachne, DJ_Jiggles, 03011300, Captain Sensib1e, Mennosson, Claptrap NL, keegan44582, Tuff Luv Capo, 109899=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 12694=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 19125=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By p1ckl32 [PC] Konvict Gaming Multi-g... 613,739 replies 15,208 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By rabid_white_dog [PS4] New car meet crew 2,285,943 replies 113,506 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,474 topics 416,677 replies GTA5 withSIX is coming! By AztecaEh 10 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}