{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,089 topics 2,123,627 replies",
            "85,549 topics 1,153,579 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,757 replies",
            "5,996 topics 75,808 replies",
            "50,536 topics 466,146 replies",
            "22,766 topics 196,283 replies",
            "4,270 topics 60,434 replies",
            "1,128 topics 8,214 replies",
            "3,598 topics 115,153 replies"
        ],
        [
            "Last Post Info",
            "Your Epic/Violent/Best GTA... By Nibble A minute ago",
            "Your IV OCDs By The Mysterious One 18 minutes ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Ultimate 100% Save File... By Militia 3 hours ago",
            "Is Rosco Stow a real band? By PhillBellic 5 hours ago",
            "Gta3.IMG error By TheGtaDestroyer42 3 minutes ago",
            "Which Vehicle Do You Prefer? By GTAGuy1995 An hour ago",
            "Which Vehicle Do You Prefer? By GTAGuy1995 An hour ago",
            "Anybody has a 100 % savegame? By Cerium 18 hours ago",
            "The No-hope DLC By ClaudeSpeed1911 2 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=263&t=561357&p=1062659263",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986444.39/warc/CC-MAIN-20150728002306-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 103128399,
    "recordOffset": 103102202,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47662=Yahoo, Google, Mach1bud, allinclusive, Bing, frodzet, ClaudeSpeed1911, thafablifee46, ClaudX, Cancerslug, MaqLite, cj2000, Ajvallejo12, uncaged, psymin, Deceptix, Slate Mc 2, Pavle, joe grizzly, Scuba 21, BeansOnGTA, ODD_ZoeWowiee, SadBoy2015, Imnotthefiveo, jabloki, SSJEavan747, robi29, feckyerlife, Tilley, shadowkill98, Nibble, starblind94, Rented, GTA_fear, U.N.K.N.O.W.N, Systasis, BK90s, Falenone, s2n vaniish, x_FRoe__, Awayfromkeyboard, hotline.n.w.refn, Fixingpeach024, CMCSAVAGE, SchoolOfHardKnocks, VikDarkbomb, deadx23, iNero, MaxPayne47, Claude Liberty, GTA_Matt24, BlackMilk, Smooth Longsack, Nitty Don, Wesser, Aquilus, WorldWideFM, GTAKid667, wh1t31v3y, julionib, Google Mobile, Weazel__03, TJGM, CrysisAverted, Jacob_Rivera_11232, Edmachine, Startug, mario_rz, Captain Sensib1e, paulmgrath, hesselgren, trevorjc2511, ChaosIKI, Daemian, Kyle17, nokuto, gutsi007, hezus123, SteelerMonkey746, four0nefive, Dirty.Hairy, Terroryaki, Dominator_GT, TalkingPear, whiteskin, Brayla316, Jon3s, K-ROSE, Pary daPlatapus, ashbashbluesfan, TheUnholy, oleggrishechkin, TheMcSame, WHAT!?, MexUK, Jinx., Rekia87, Fuzzknuckles, Jerome, Lester-The-Molester, TheGtaDestroyer42, prestonchan, ViciousSpirit, Furry_Monkey, TheDoombringer, missanthropy, Zetta Slow, HaythamKenway, Gigs84, Jebfive, paperbagdude, frontrunner91, -RONIN-, slendifiedman, Beardsunite, mikezilla2, lolznc, wonderboyjohnny, Icantthinkofonew, Parikshit Singh, Stormingz, TwisterVictor1, Memory Lanes, toxluv, R.Rezzrax, gizz01, Mottershead, Warlord., Atlantic Tuna, StepNaza, A-Wax8, Ak47clower, Lennie., Mr. Jago, Kai650, SSKYZX, Th3MaN1, Miro, PSNSammy1, Wybo76, Gridl0k, Bms842, Gtaultimatefanboy, TreFacTor, XCarlSagan865X, DEADLY9999, TacoSmuggler, 018361, Synstr, Locce, Non Biased GTA 4 fan, Arms Dealer, =Sammy=, SwaGGer_1337, The Mysterious One, RJSanModder, Nick930930, NadoVargas, GTA717, Itzreality, dkluin, JRC99, Trash99, SID44SID, SuperHolySheep, Fox2Quick, Prywatne, 85 Diplomat, bryanlee211, Malikstuntin, Mr. Specter, Eqaulo, Svip, SolidUSP, 11john11, oscardo, LackDiscipline, Therocksterisawesome, Fakeplastictrees, Failure, SuperGTFan, Tekno_Gecko, bite, o0eVe0o, krle2003, Geralt of Rivia, NikoBellicGTAIV, Faultierspy79, Tossin Salad, Mister Pink, swanny708, Artful., rafaelfiorindo, MrBossFTW, Vadim M., meta187, Matttheking2015, jBhIpS, StangOne50, PANiC ATTACK3R, bread, HunterGatherer, ItsThatGuy!, nehctik, MarBev, Officer Vic, Marius.Petran, Jeansowaty, arewenotmen, PcCI2iminal, Dondara, KatyPerry, Dellers, Alexa, Lost Legend, CarnageRacing00, tails_prower_2040, Nutduster, KornbreadMaf1a, ufl103, ARC8_1982, fabio3, komalr, REXX93, lord tammerlain, 458Speciale, Miss Malevolent, tjess, DANIEL3GS, Th3Butch3r, mentalgen, DennisStanistan, SchroedingerKatz, Sky_Light12, JesusFR33K, thegough, Lorajet, FlAwLeSS_666, MatthewH, UKPortista, Epic., Halal Cyborg, mxrcg, pizzapuff1990, XJpostman, Compeast, killer_bigpoint, Josivers, ZEST, i0ffender, ClippedWings, 22Laxer22, TG_Stig, m3tal z_DKI, EVILpotato, MKKJ, ChrisV, DumbForum, machine4578, the consigliere, clevertrev, CMGreger, scania970, Xie Deathangelz, Nugsy, .Whoopdidoo., Citron_XY, malcolmfunktion, jsmooveboy, Shabazz916, gtaforums2, Player360, Non Fiction, p-s-3x, Chekoloco, ImBurkalicious, Phangled5, Andreas, Klicksend, DragonSpade, DavidTheThird, Potatoman99, jdwarfer, ChrissyBoi87, Andy900, Anotic, Slasherr, DMK7, Jesse.yancey320, kaasje, 18681=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 125025=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 20885=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 14232=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 16510=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 12514=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9330=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By BeansOnGTA [Xbox One] Undead Outlaws M... 613,480 replies 15,189 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By psymin Motorcycles 50% off 2,278,843 replies 113,193 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,441 topics 416,557 replies C# setting the world to beh... By DennisStanistan 16 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}