{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,139 topics 2,125,518 replies",
            "85,560 topics 1,153,993 replies",
            "1,071 topics 11,072 replies",
            "4,218 topics 64,766 replies",
            "5,996 topics 75,818 replies",
            "50,552 topics 466,260 replies",
            "22,767 topics 196,320 replies",
            "4,274 topics 60,498 replies",
            "1,127 topics 8,220 replies",
            "3,607 topics 115,598 replies"
        ],
        [
            "Last Post Info",
            "Windows10 - wow, performance! By stretchx9 A minute ago",
            "It`s 2015 and GTA IV+ DLC i... By Midnight Hitman 17 minutes ago",
            "6 Star Wanted Level Survival? By Militia 4 hours ago",
            "The Ultimate 100% Save File... By Militia 2 hours ago",
            "Things that can be done at... By Militia 3 hours ago",
            "Care and Feeding of a San A... By 7 day survivor An hour ago",
            "Reasons why Vice City is be... By Twin Turbo 2 hours ago",
            "What car suits Claude the m... By Ray 44 minutes ago",
            "What are the cops actually... By Jeansowaty 8 hours ago",
            "GTA VI: Satire vs. Realism,... By Midnight Hitman 3 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=226&t=494791&p=1062118741",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00187-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 116958879,
    "recordOffset": 116934210,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{19115=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 14404=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 21255=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12686=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 108935=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 48339=CriminaL277, Google, Bing, Nameless Foot Soldier, JackIrish, Yahoo, jrl51592, BlackHeartedGovernor, the_wabz, Midnight Hitman, oddballs, LeopardGecko, LMB10, No_Future, LukeyDukey1988, //XP//, lauralexis, Ganton, Choco Taco, BLOOD-MOND, KornbreadMaf1a, JimmyFantastic, waters, DuPz0r, IParadise CityI, Johnson047, supanaut, FourFingersOfFun, StarFyer, Apodiense, uncaged, TiberiusMcQueen, Daemian, 7nvd, Gtaultimatefanboy, Mo_, Mach1bud, Hylskriksen, LDHalcrow1215, Bane X01, customkingpimp, BlackMilk, Lion, Alan Eastwood, TheHellcat, Laura91, deadx23, SlavaRak, Tadzik, Slasherr, slowburn29, fizzyfaze, bobo_lave, Hollis2Hollywood, Ak47clower, tonilcs, Mister Pink, ninjaontour, Oddtester, THR-MC_DIESEL, deejayb1874, Target13, WWEMichaelB, KifflomBroBro, Nem Wan, WhosYu, evinaz, Ocelot., GipsyDanger MK2, Lowi, swirler, The Lone Wanderer, NightSpectre, Paulsson94, Jon Snow, Reywas1, DSER_DemonICs, uNi, Dbzk1999, ClaudX, theminted, SalvatoreCJ1903, Daniel MCH, stickyrice11, Colbydogs, GTAOnlineAddict123, Sveittjpong, Pavle, SureOrange4486, Malibu454, HipsterHillbilly, conedotexe, progamer1258, Jon3s, GamesBoy316, SomeDBKid, cav79, xman40100, eli.g1026, SuperHolySheep, Icantthinkofonew, Gummy14, r.lorenzo13, markiii10, Doublepulse, bruvs-mcfc, hoopz71, nokuto, bread, BeckermannDewitt, McH2Oz2, Staypuft, smokingndriving, U.N.K.N.O.W.N, Blind and Mute, Alec Skorpio, Soy Bean, WazLah, freedom, Lebowski_RS, Google Mobile, Schleemil, Reconectou, H4rdPwn3r1337, AztecaEh, Zook, TheGTR1957, JASONBRODYSONOFRAMBO, hornedturtle, Andreaz1, Pyro_Indigo, Gabriela_L, Assasin_Zack, Nightmyyth, keegan44582, Killerman29, Potatoman99, iKarimster, womb raider, AkosSpekker, m2roadwarrior, Cripto136, ZombieRambo, GunTotinHippie, AK47IZI, miclin, StepNaza, Epic., Prywatne, KiTTYReCkless, Nick1020, Juicyfer, Pressure Drop, Nicinator16, RussianCommie, Frauenarzt, st3fanhd, lazy., Rafli, Corndog93, Tacts_21, UshaB, Shadowfennekin, Ray, TexasRocks, Scuba 21, PS3KillsThe360, Stormingz, Remmer, missanthropy, Startug, Tomasak, GeneralSteve93, SeaWallTx, Joint SpecOps Team, GTA_Matt24, brownbmxar, paperbagdude, ShenLong Kazama, JaegerPilot1, djbel, Black Terminator, RageFaceMax, Special Members, Maresz55, SeekingAsylum, xHaviiHx, ReaperOfficial, Zonnex, DumbForum, TDWP_Adam, TheRealCMPUNKFan, Kiyone_Alien_Cop, iBUCKEYE, Alfred Packer, Jawaty, Falonium, Twin Turbo, GTA_The_Series, Didjos, Z i X, UltraGizmo64, Captain Sensib1e, RafaelSousaSam, jackmap, jerryinohio78, SKARFACE, A.O.D.88, Yus, TacoSmuggler, XenoxX, Honch777, Mockingbae, Mona Sax, tdavies457, Daz, CH14R1, Sonsalt, Rookie1996, Total Failure, Rusty Balls, Smesi, dyons, jollythecat, 9419=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 16816=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By fawk_faber Goon Squad x Victorious Thugs 613,761 replies 15,208 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By LeopardGecko Would You Rather : GTA Onli... 2,286,059 replies 113,512 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,476 topics 416,681 replies Having trouble with .DDS ex... By ShenLong Kazama 8 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}