{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,138 topics 2,125,498 replies",
            "85,560 topics 1,153,992 replies",
            "1,071 topics 11,072 replies",
            "4,218 topics 64,766 replies",
            "5,996 topics 75,818 replies",
            "50,552 topics 466,260 replies",
            "22,767 topics 196,320 replies",
            "4,274 topics 60,498 replies",
            "1,127 topics 8,220 replies",
            "3,607 topics 115,596 replies"
        ],
        [
            "Last Post Info",
            "All weapons will kill in on... By XenoxX A minute ago",
            "Reasons why GTA IV is bette... By Midnight Hitman 3 minutes ago",
            "6 Star Wanted Level Survival? By Militia 3 hours ago",
            "The Ultimate 100% Save File... By Militia 2 hours ago",
            "Things that can be done at... By Militia 2 hours ago",
            "Care and Feeding of a San A... By 7 day survivor 29 minutes ago",
            "Reasons why Vice City is be... By Twin Turbo 2 hours ago",
            "What car suits Claude the m... By Ray 6 minutes ago",
            "What are the cops actually... By Jeansowaty 7 hours ago",
            "F*ck ,Marry,Kill By Mona Sax 7 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=265&t=500908&p=1061086794",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00036-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 109843067,
    "recordOffset": 109818650,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{108652=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 9395=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 21204=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 48121=Bing, lazlow555, RmpTebow15, Google, gfen, Yahoo, BigBrother67, Nuclearsniper, Ridd, A.O.D.88, m2roadwarrior, AztecaEh, GTA3Rockstar, Joint SpecOps Team, Blackhailer, RideEmOut2, Fox2Quick, A Maned Wolf, Frito-Man, FowardElement, BeckermannDewitt, Yus, Dirtbag101, colt9mm, jrl51592, Ganton, -Z31N-, Sh3lby Mustang, SalvatoreCJ1903, fabio3, Special Members, Jaanus949, ShockwaveKSP, NikoBellicGTAIV, JeepXJFreak98, missanthropy, lydianduck, Nez Man, Gammoudicj, spaceeinstein, zeffer604, CaptainMarvel, fullxthrottle94, Marwin, djbel, Walter175, ninjaontour, LH-PLAYS, MGgames100, Shadowfennekin, uncaged, Honch777, GamingDott, Midnight Hitman, saintsrow, Zondar, HBSanta, Hjaere, penguinhero, kaasje, U.N.K.N.O.W.N, Quarthon, eman675, TheRealCMPUNKFan, deadx23, GTA@ddict13, Falonium, XenoxX, Rusty Balls, kuusko, ZelenaSalata, Jesse.yancey320, xInfamousRYANx, !M4G3_N4T10N, Ray, Mona Sax, joe1606, KornbreadMaf1a, r.lorenzo13, Geralt of Rivia, 313izzle, SeekingAsylum, lolznc, Slasherr, pedinhuh, terminalnapkin, Jon3s, Chief Ryze, Google Mobile, H4rdPwn3r1337, TheGTR1957, evinaz, Remmer, Misunderstood, ZANTHERA, DaWiesel, DeucesR, Johnny Playert, TwisterVictor1, Daniel MCH, nguyentienbac6, Svip, Fetti Debartolo, TheHellcat, Victor Strawn, KoF StyL, 7nvd, Claptrap NL, GipsyDanger MK2, dice, ela089, iKarimster, GTAKid667, daboy042188, Smooth Longsack, TexasRocks, PTdumptruck, jerryinohio78, killstreakmx, Sonsalt, MitchMaljers, Verstappen, Andreaz1, iiConTr0v3rSYx, epoxi, freaklore1, Epic., psymin, Smale45, Street Mix, Lewisb36, Rafli, The Lone Wanderer, Corndog93, VideoGameJames, owlboogie, NBAKingzFan10, hpham228, Total Failure, WinkingSkeever6, That1oneguy, iamcornholio, Gridl0k, s2n vaniish, Richardbrown30, mrtommygunwhite, LFC484, Bondergomme, Andreas, Jvaz615, BengeyBoy, Choco Taco, Tomasak, Non Fiction, AUScowboy, Nesano, Quintenr95, dingodile_r89, silentkiller44, _OGX_, //XP//, rabid_white_dog, Bane X01, Flesh-n-Bone, TiberiusMcQueen, jollythecat, ashbashbluesfan, TimmyM56, Shenmue18, BoJack Cognac, RafaelSousaSam, Sentinel Driver, Mach1bud, koztop, VikDarkbomb, uNi, swirler, jackrobot, El-Gaddafii, Daniol, ChrissyBoi87, Scuba 21, H0WITZER, Ermacs, Cop_21, Fozzie_420, RoyalSyndLuke, busshead, Biggie Deaf, xTrendSs, Irviding, Finn 7 five 11, CCPD, Crackhead_Ben, UshaB, kudisanga, CREW_CUTZ, Rookie1996, MyName'sJeff, Toke, polloxdabollox, Nick930930, Stidge uk, HipsterHillbilly, laskaland, Pikas_PK, gtuned, maxbrookes, Edmachine, GTA_The_Series, Saso70, Lester-The-Molester, Kampioen, OG Viking, Xing of Virtue, smokingndriving, Player360, feloniousrick, Johnny Alpha, Rippir1600, EF2000, Eneveon, oldjock, Alexa, muffintopers, TheUnholy, Winning001, Nikobellic23, Daequil, Foxy Stevenson, 16762=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 12632=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 14350=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 19064=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 4 minutes ago By Fallcreek Andolini Mafia Family 613,746 replies 15,208 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By U.N.K.N.O.W.N Would You Rather : GTA Onli... 2,285,993 replies 113,509 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,474 topics 416,679 replies Adding contacts to iFruit (... By TuckerW2001 24 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}