{
    "relation": [
        [
            "Date",
            "May 19, 1986",
            "Aug 14, 1992",
            "Mar 15, 1993",
            "Aug 27, 1996",
            "May 19, 1997",
            "Aug 25, 2000"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS",
            "FPAY",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: ENDOTHERAPEUTICS BUILDING 3, SUITE 209, 654 BAIR I Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:WARRING, JESSICA A.;REEL/FRAME:004556/0749 Effective date: 19860514 Owner name: ENDOTHERAPEUTICS,CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:WARRING, JESSICA A.;REEL/FRAME:004556/0749 Effective date: 19860514",
            "Year of fee payment: 4",
            "Owner name: ENDOTHERAPEUTICS CORPORATION, CONNECTICUT Free format text: CHANGE OF ADDRESS;ASSIGNOR:ENDOTHERAPEUTICS CORPORATION BUILDING 3, SUITE 209 654 BAIR ISLAND ROAD REDWOOD CITY, CA 94063;REEL/FRAME:006485/0541 Effective date: 19930310",
            "Year of fee payment: 8",
            "Owner name: UNITED STATES SURGICAL CORPORATION, CONNECTICUT Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ENDOTHERAPEUTICS CORPORATION;REEL/FRAME:008512/0662 Effective date: 19970514",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US4808168 - Pneumoneedle - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4808168?dq=5463388",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00238-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477587055,
    "recordOffset": 477567502,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17955=This application is a continuation-in-part of copending U.S. patent application Ser. No. 859,228 now abandoned, filed May 5, 1986, which in turn is a file wrapper continuation of U.S. patent application Ser. No. 764,338, filed Aug. 9, 1985, now abandoned.}",
    "textBeforeTable": "Patent Citations Modifications of the above-described embodiments that are obvious to those of skill in the fields of medical instruments, mechanical design, or related fields in view of the foregoing disclosure are intended to be within the scope of the invention. In addition to being used to inflate body cavities with gas, the pneumoneedle may be used to withdraw fluid from body cavities. In such use, the needle is inserted into the desired location and suction is applied to the valve inlet. When the pneumoneedle is being inserted through the abdominal wall, the stopcock is in the closed position to prevent the internal abdominal pressure from equilibrating with ambient pressure after penetration. The pneumoneedle is inserted into the cavity in the conventional manner except that it may be held like a syringe if desired. During penetration, resistance from the abdominal wall causes the stylet to retract and expose the sharp tip of the needle. Once the wall has been penetrated, there is no resistance and the stylet automatically advances under the influence of the coil spring to blunt the end of the device. Insufflating apparatus (not shown) is then connected to the stopcock inlet. The inlet is conveniently adapted to receive a luer lock connector for this purpose. The needle and stylet body may be made of rigid, biocompatible materials such as stainless steel. The handle and stopcock may be made of molded plastic for economy. The section",
    "textAfterTable": "United States Surgical Corporation Endoscopic instrumentation kit and package therefor US5152754 * Feb 15, 1991 Oct 6, 1992 Minnesota Mining And Manufacturing Company Trocar US5256147 * Jun 17, 1992 Oct 26, 1993 Minnesota Mining And Manufacturing Company Reusable trocar with easily replaceable obturator US5256148 * Apr 13, 1992 Oct 26, 1993 Ethicon, Inc. Verress needle with enhanced acoustical means US5284474 * Sep 30, 1992 Feb 8, 1994 Adair Edwin Lloyd Trochar system for laparoscopy US5300046 * Sep 23, 1992 Apr 5, 1994 Symbiosis Corporation Thoracentesis sheath catheter assembly US5300084 * Nov 23, 1992 Apr 5, 1994 United States Surgical Corporation Pneumoperitoneum needle US5315985 * Jul 20, 1992 May 31, 1994 United States Surgical Corporation Endoscopic instrumentation kit and package therefor US5318580",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}