{
    "relation": [
        [
            "Date",
            "Oct 24, 1997",
            "Jul 14, 1998",
            "Nov 21, 2001",
            "Dec 14, 2005",
            "May 26, 2006",
            "Jul 25, 2006"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: DELAWARE, UNIVERSITY OF, DELAWARE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:CHUI, SIU-TAT;REEL/FRAME:008787/0309 Effective date: 19971017",
            "Owner name: NAVY, SECRETARY OF THE, UNITED STATES OF AMERICA, Free format text: CONFIRMATORY LICENSE;ASSIGNOR:DELAWARE, UNIVERSITY OF;REEL/FRAME:009284/0828 Effective date: 19970806",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20060526"
        ]
    ],
    "pageTitle": "Patent US5757056 - Multiple magnetic tunnel structures - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5757056?dq=7395252",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00172-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481482883,
    "recordOffset": 481455967,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13200=The U.S. Government has a paid-up license in this invention and the right in limited circumstances to require the patent owner to license others on reasonable terms as provided for by the terms of N00014-94-1-0213 awarded by Office of Naval Research., 15130=Another magnetoresistive device disclosed in the art is that described by Moodera et al in an article entitled \"Large Magnetoresistance at Room Temperature in Ferromagnetic Thin Film Tunnel Junctions\" which appeared in Volume 74, No. 16 of Physical Review Letters, pp. 3273-3276 (17 April 1995). In this article the author reports maximum change of about 25% in resistance (ΔR/R) upon application of a magnetic field utilizing the Moodera et al structure. That structure is a sandwich of a thin layer insulation between ferromagnetic materials. As reported in the Moodera article this change in resistance sharply declines as applied voltage increases.}",
    "textBeforeTable": "Patent Citations For application as rams, the magnetization states of the three ferromagnets store the information. In principle, the structure can store more than a single bit because there are 8 possible combinations for the direction of the magnetization of the three materials 16, 18, 20 in the double barrier junction. For the simplest example, we assume that two of the three materials are pinned so that only one (for example, the third) can be reversed. In a typical application, we expect an array of these junctions to be created by, for example, lithographic techniques. The direction of the magnetization can be switched (\"written\") by an external field along the planes of the junction generated by a current in an external wire. This information can be read by applying a current to the first tunnel junction 16, 12, 18 and then checking the sign of the voltage across the second junction 18, 14, 20. Depending on the application there are different design possibilities. One can \"pin\" the magnetization of some of the three ferromagnetic components so that one or two, for example, the first and second materials, do not rotate under a field of reasonable strength that is encountered in an application. This \"pinning\" can be achieved by using a material of high coercivity such as cobalt or iron or by placing a material of high coercivity in contact with the ferromagnetic layers. For applications as the read",
    "textAfterTable": "Magnetic memory array using magnetic tunnel junction devices in the memory cells US5650958 * Mar 18, 1996 Jul 22, 1997 International Business Machines Corporation Magnetic tunnel junctions with controlled magnetic response * Cited by examiner Non-Patent Citations Reference 1 \"Large Magnetoresistance at Room Temperature in Ferromagnetic Thin Film Tunnel Junctions\", Physical Review Letters, vol. 74, No. 16, pp. 3273-3276 (Apr. 17, 1995). 2 * L. Kladanoff and G. Bayin, Quantum Statistical Mechanics , Chapter 7, Benjamin, N.Y. (1962). 3 L. Kladanoff and G. Bayin, Quantum Statistical Mechanics, Chapter 7, Benjamin, N.Y. (1962). 4 * Large Magnetoresistance at Room Temperature in Ferromagnetic Thin Film Tunnel Junctions , Physical Review Letters , vol. 74, No. 16, pp. 3273 3276 (Apr. 17, 1995). * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}