{
    "relation": [
        [
            "Date",
            "Apr 8, 1998",
            "Jun 28, 2002",
            "Oct 31, 2003",
            "Jun 14, 2004",
            "Jun 12, 2008",
            "Jul 13, 2012"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: XEROX CORPORATION, CONNECTICUT Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ESCHBACH, REINER;HAINS, CHARLES M.;REEL/FRAME:009118/0649;SIGNING DATES FROM 19980402 TO 19980406",
            "Owner name: BANK ONE, NA, AS ADMINISTRATIVE AGENT, ILLINOIS Free format text: SECURITY INTEREST;ASSIGNOR:XEROX CORPORATION;REEL/FRAME:013153/0001 Effective date: 20020621",
            "Owner name: JPMORGAN CHASE BANK, AS COLLATERAL AGENT,TEXAS Free format text: SECURITY AGREEMENT;ASSIGNOR:XEROX CORPORATION;REEL/FRAME:015134/0476 Effective date: 20030625",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6192149 - Method and apparatus for automatic detection of image target gamma - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6192149?dq=7222078",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00321-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 460225227,
    "recordOffset": 460198255,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While this invention has been described in conjunction with the specific embodiments outlined above, it is evident that many alternatives, modifications and variations will be apparent to those skilled in the art. Accordingly, the preferred embodiments of the invention as set forth above are intended to be illustrative, not limiting. Various changes may be made without departing from the spirit and scope of the invention as defined in the following claims. It should also be appreciated that the processor 200 may be a standalone device, integrated into a network such as the Internet, or integrated into a personal computer. As shown in FIGS. 7 and 8, the processor 200 may be implemented on a programmable general purpose computer. However, the processor 200 may also be implemented on a special purpose computer, a programmable microprocessor or controller and peripheral integrated circuit elements, an ASIC or other integrated circuit, a digital signal processor, a hard wired electronic or logic circuit such as a discrete element circuit, a programmable logic device such as a PLD, PLA, FPGA or PAL, or the like. In general, any device, capable of implementing a finite state machine capable of implementing the flowchart shown in FIG. 9 can be used to implement the processor 200. FIG. 9 is a flow diagram illustrating the operation of the processor 200. In step S100, the processor 200 receives an electronic document, the process then moves to step",
    "textAfterTable": "Citing Patent Filing date Publication date Applicant Title US6608926 * Jun 22, 1999 Aug 19, 2003 Canon Kabushiki Kaisha Image processing method, image processing apparatus and recording medium US7266761 * Jun 15, 1999 Sep 4, 2007 Microsoft Corporation Special API interface for interfacing an application with a TWAIN module, negotiating and presenting a user interface for inserting an image into a document US7269292 Jun 26, 2003 Sep 11, 2007 Fotonation Vision Limited Digital image adjustable compression and resolution using face detection information US7308137 * Jun 8, 2004 Dec 11, 2007 Benq Corporation Method of determining color composition of an image US7315630 Jun 26, 2003 Jan 1, 2008 Fotonation Vision Limited Perfecting of digital image rendering parameters within rendering devices using face detection US7317815 Jun 26, 2003 Jan 8, 2008 Fotonation Vision Limited Digital image processing composition using face detection information US7362368",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}