{
    "relation": [
        [
            "Date",
            "May 12, 1989",
            "Sep 25, 1990",
            "Oct 15, 1991",
            "Feb 8, 1993",
            "Dec 14, 1993",
            "Feb 10, 1997",
            "Jan 29, 2001"
        ],
        [
            "Code",
            "AS",
            "RR",
            "B1",
            "FPAY",
            "CCB",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Request for reexamination filed",
            "Reexamination certificate first reexamination",
            "Fee payment",
            "Certificate of correction for reexamination",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: ALFATECHNIC AG, SWITZERLAND, A JOINT STOCK COMPANY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:DUBACH, WERNER F.;REEL/FRAME:005073/0323 Effective date: 19880422",
            "Effective date: 19900817",
            "",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US4854473 - Single-piece snap hinge closure - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4854473?dq=7,172,682",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00104-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 469627660,
    "recordOffset": 469611701,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations However, in addition to the purely rectangular form, as shown in FIG. 6, a form which is convex on all sides, for example, an ellipse as in FIG. 8-b, would also be possible. If the bands are formed in a U-shape as shown in FIG. 8-c, then there is obtained a reinforced snap effect of the hinge. The subdivision of the tension bands into several partial bands, as FIG. 8-d shows, permits a still better adjustment of the snap hinge in accordance with the invention to the relatively complexly formed shapes of both parts which are connected with one another by means of the hinge. If the snap hinge in accordance with the invention is realized in a box or case with four or more sides, then several film hinges, all of which lie in a straight line, can be provided on the straight side. Then the hinge in accordance with the invention can appear repeatedly. The cross-sectional form of the tension bands (6) can be formed very differently. The examples of FIGS. 8-a to 8-d demonstrate this. Thus, the external surface can be precisely adjusted to the contour of the casing wall, but the internal surface can be straight (FIG. 8-a). One essential difference between the tension bands, as they are used in this invention, and the intermediate elements in accordance with the state of the art, is that the tension bands (6), from the",
    "textAfterTable": "US5127537 * Jun 5, 1991 Jul 7, 1992 Graham Donald R Tissue cassette with a living hinge US5148912 * Feb 27, 1991 Sep 22, 1992 Yoshino Kogyosho Co., Ltd. Cap closing member for container opening US5221017 * Oct 13, 1992 Jun 22, 1993 Wheaton Holding, Inc. Controlled dropper tip closure US5257708 * Mar 18, 1993 Nov 2, 1993 Createchnic Ag Plastic snap hinge closure US5356017 * Oct 28, 1992 Oct 18, 1994 Aptargroup, Inc. Child resistant closure with recessed latch US5361920 * Aug 17, 1993 Nov 8, 1994 Yoshino Kogyosho Co., Ltd. Cap structure with elastic turnover cover US5423442 * Aug 2, 1994 Jun 13, 1995 Yoshino Kogyosho Co., Ltd. Cap structure with elastic turnover cover US5435456 * Nov 2,",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}