{
    "relation": [
        [
            "Keywords and Parameters",
            "FOR :array_size",
            "FOR integer",
            "statement_id",
            "USING DESCRIPTOR SQLDA_descriptor",
            "USING",
            "host_variable",
            "indicator_variable"
        ],
        [
            "Description",
            "Host variable containing the number of rows to be processed. Number of rows to be processed.",
            "Limits the number of times the statement is executed when the USING clause contains array host variables If you omit this clause, Oracle executes the statement once for each component of the smallest array.",
            "A precompiler identifier associated with the SQL statement or PL/SQL block to be executed. Use the embedded SQL PREPARE statement to associate the precompiler identifier with the statement or PL/SQL block.",
            "Uses an Oracle descriptor. CANNOT be used together with an ANSI descriptor (INTO clause).",
            "Specifies a list of host variables with optional indicator variables that Oracle substitutes as input variables into the statement to be executed. The host and indicator variables must be either all scalars or all arrays.",
            "Host variables.",
            "Indicator variables."
        ]
    ],
    "pageTitle": "Embedded SQL Statements and Directives",
    "title": "",
    "url": "http://docs.oracle.com/cd/B19306_01/appdev.102/b14407/pc_afemb.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00247-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 71794363,
    "recordOffset": 71746770,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 13 May 2015 05:07:13 GMT",
    "textBeforeTable": "Keywords and Parameters Description of the illustration execo.gif Syntax You must first prepare the SQL statement or PL/SQL block with an embedded SQL PREPARE statement. Prerequisites In Oracle dynamic SQL, to execute a DELETE, INSERT, or UPDATE statement or a PL/SQL block that has been previously prepared with an embedded SQL PREPARE statement. For ANSI Dynamic SQL Method 4 see \"EXECUTE DESCRIPTOR (Executable Embedded SQL)\". Purpose EXECUTE (Executable Embedded SQL) EXECUTE IMMEDIATE (Executable Embedded SQL). Related Topics END-EXEC; END; END IF; THEN RAISE name_missing; IF :emp_name:ind_name IS NULL WHERE empno = :emp_number; FROM emp INTO :emp_name:ind_name, :job_title, :salary SELECT ename, job, sal BEGIN EXEC SQL EXECUTE  Placing this EXECUTE statement in a Pro*C/C++ program embeds a PL/SQL block in the program: Example Since the Pro*C/C++ treats an embedded PL/SQL block like a single embedded SQL statement, you can embed a PL/SQL block anywhere in a program that you can embed a SQL statement. For more information on embedding PL/SQL blocks in Oracle Precompiler programs, see Chapter 7, \" Embedded PL/SQL\". Usage Notes  This keyword must appear after the embedded PL/SQL block, regardless of which programming language your Oracle Precompiler",
    "textAfterTable": "Usage Notes For more information on this statement, see Chapter 13, \"Oracle Dynamic SQL\" for the Oracle version. Example This example illustrates the use of the EXECUTE statement in a Pro*C/C++ program:  EXEC SQL PREPARE my_statement FROM :my_string; EXEC SQL EXECUTE my_statement USING :my_var; Related Topics DECLARE DATABASE (Oracle Embedded SQL Directive). PREPARE (Executable Embedded SQL). EXECUTE DESCRIPTOR (Executable Embedded SQL) Purpose In ANSI SQL Method 4, to execute a DELETE, INSERT, or UPDATE statement or a PL/SQL block that has been previously prepared with an embedded SQL PREPARE statement. Prerequisites You must first prepare the SQL statement or PL/SQL block with an embedded SQL PREPARE statement. Syntax Description of the illustration execa.gif Keywords and Parameters Keywords and Parameters Description FOR :array_size Host variable containing the number of rows to be processed. Number of rows to be processed. FOR integer Limits the number of times the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}