{
    "relation": [
        [
            "Exhibit",
            "2.1*",
            "3.1*",
            "3.2*",
            "4.1*",
            "4.2(a)*",
            "4.2(b)*",
            "4.2(c)*",
            "4.3*",
            "4.4*",
            "4.5*",
            "4.6*",
            "4.7*"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Description",
            "Amended and Restated Agreement and Plan of Merger dated as of May 31, 2001 by and among CB Richard Ellis Services, Inc., CBRE Holding, Inc. (the \"Company\" and formerly Blum CB Holding Corp.), and Blum CB Corp. (incorporated by reference to Exhibit 2.1 to Amendment No. 1 to the Company's Registration Statement on Form S-1, Registration No. 333-59440, filed on June 12, 2001 and declared effective by the Commission on July 13, 2001 (the \"Company's Registration Statement on Form S-1\")).",
            "Restated Certificate of Incorporation of the Company (incorporated by reference to Exhibit 3.2 to Amendment No. 2 to the Company's Registration Statement on Form S-1).",
            "Restated Bylaws of the Company (incorporated by reference to Exhibit 3.4 to Amendment No. 2 to the Company's Registration Statement on Form S-1).",
            "Specimen Class A Common Stock Certificate (incorporated by reference to Exhibit 4.1 to Amendment No. 2 to the Company's Registration Statement on Form S-1).",
            "Amended and Restated Contribution and Voting Agreement dated as of May 31, 2001 by and among the Company, Blum CB Corp., RCBA Strategic Partners, L.P., FS Equity Partners III, L.P., FS Equity Partners International, L.P., The Koll Holding Company, Donald Koll, Frederic V. Malek, Raymond E. Wirta and Brett White (incorporated by reference to Exhibit 4.2(a) to Amendment No. 1 to the Company's Registration Statement on Form S-1).",
            "Form of Securityholders' Agreement (Exhibit A to the Contribution and Voting Agreement set forth in Exhibit 4.2(a) hereto) (incorporated by reference to Exhibit 4.2(b) to Amendment No. 1 to the Company's Registration Statement on Form S-1).",
            "Form of Warrant Agreement (Exhibit B to the Contribution and Voting Agreement set forth in Exhibit 4.2(a) hereto) (incorporated by reference to Exhibit 4.2(c) to Amendment No. 1 to the Company's Registration Statement on Form S-1).",
            "Purchase Agreement between the Company and Credit Suisse First Boston Corporation dated as of June 29, 2001 (incorporated by reference to Exhibit 4.5 to Amendment No. 2 to the Company's Registration Statement on Form S-1).",
            "Purchase Agreement, dated as of May 31, 2001, among the Company, Blum CB Corp. and Credit Suisse First Boston Corporation (incorporated by reference to Exhibit 4.9 to Amendment No. 2 to the Company's Registration Statement on Form S-1).",
            "Indenture, dated as of June 7, 2001, among the Company, Blum CB Corp. and State Street Bank and Trust Company of California, N.A., as Trustee, for 111/4% Senior Subordinated Notes due 2011 (incorporated by reference to Exhibit 4.10 to Amendment No. 2 to the Company's Registration Statement on Form S-1).",
            "Registration Rights Agreement, dated as of May 31, 2001, among the Company, Blum CB Corp. and Credit Suisse First Boston Corporation (incorporated by reference to Exhibit 4.11 to Amendment No. 2 to the Company's Registration Statement on Form S-1).",
            "Indenture, dated as of July 20, 2001, among the Company and State Street Bank and Trust Company, N.A., as Trustee, for its 16% Senior Notes due 2011 (incorporated by reference to an exhibit filed in CBRE's Amended General Statement of Beneficial Ownership, filed July 30, 2001)."
        ]
    ],
    "pageTitle": "Edgar Filing: CBRE HOLDING INC - Form 10-Q",
    "title": "",
    "url": "http://thenumbers.marketplace.org/publicradio/action/getedgarwindow?accesscode=91205701539725",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00114-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 236236599,
    "recordOffset": 236172691,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{149190=awaits the finalization of certain preliminary estimates. The fair value of net liabilities assumed was $252.6 million at July 20, 2001., 602477=    Revenue decreased by $2.1 million or 5.0% for the three months ended September 30, 2001, compared to the three months ended September 30, 2000. This was mainly driven by lower sales and lease revenues due to the overall weaker economy within Europe. This was slightly offset by higher appraisal fees. Commissions, fees and other incentives for the three months ended September 30, 2001, increased by $1.8 million or 12.3% compared to the three months ended September 30, 2000 due to an increased number of producers, primarily within the U.K. In addition, producer compensation is typically fixed in nature and does not decrease as a result of a decline in revenues. Operating, administrative, and other decreased by $1.7 million or 8.2% due to various cost containment measures put in place during the quarter., 170795=    A subsidiary of the Company has a credit agreement with Residential Funding Corporation (RFC). The credit agreement provides for a revolving line of credit of up to $175.0 million, and bears interest at 1.00% per annum over LIBOR. The agreement expires on August 31, 2002. During the quarter ended September 30, 2001, the Company had a maximum of $157.2 million revolving line of credit principal outstanding. The Company had a participation agreement with RFC whereby RFC agreed to purchase a 99% participation interest in any eligible multifamily mortgage loans owned by the Company and outstanding at quarter-end (Participation Agreement). The Participation Agreement expired August 31, 2001. At September 30, 2001, the Company had $72.2 million warehouse line of credit outstanding, which is included in short-term borrowings in the accompanying Consolidated Balance Sheets. The Company also had a $72.2 million warehouse receivable. Subsequent to September 30, 2001, the warehouse line of credit was repaid with the proceeds from the warehouse receivable., 181020=    As part of the merger, the Company issued 255,477 warrants to purchase shares of Class B Common Stock with an exercise price of $30.00 per share. These warrants expire August 27, 2007. The Company also issued 1,520,207 options to acquire Class A Common Stock at an exercise price of $16.00 per share. These options will vest and become exercisable in 20% increments over a five-year period ending July 20, 2006. All options will become fully vested and exercisable upon a change in control of the Company., 379500=CBRE HOLDING, INC. CONDENSED CONSOLIDATING STATEMENT OF INCOME FOR THE THREE MONTHS ENDED SEPTEMBER 30, 2000 (Dollars in Thousands) (Predecessor), 633300=    In August 2001, the FASB issued SFAS No. 144, \"Accounting for the Impairment or Disposal of Long-Lived Assets.\" This statement supersedes SFAS No. 121, \"Accounting for the Impairment of Long -Lived Assets and for Long-Lived Assets to be Disposed of.\" This statement establishes a single accounting model, based on the framework established in SFAS No. 121, for long-lived assets to be disposed of by sale. This statement is effective for financial statements issued for fiscal years beginning after December 15, 2001, and interim periods within those fiscal years, with early application encouraged. The Company is currently evaluating the impact of the adoption of this statement on its results of operations and financial position., 459743=CBRE HOLDING, INC. CONDENSED CONSOLIDATING STATEMENT OF CASH FLOWS FOR THE PERIOD FROM JANUARY 1 THROUGH JULY 20, 2001 (Dollars in Thousands) (Predecessor), 556955=    Operating, administrative and other on a consolidated basis was $380.4 million, a decrease of $10.8 million or 2.8%, compared to the nine months ended September 30, 2000. This decline is due to lower bonus incentives and profit share attributable to the Company's lower results, cost cutting measures and operational efficiencies put into place in May 2001 and an organizational restructure implemented after the merger transaction was completed, that included the reduction of administrative staff in corporate and divisional headquarters and the scaling back of unprofitable operations., 149446=    The accompanying unaudited consolidated statement of financial position as of September 30, 2001, the consolidated statement of operations for the three months ended September 30, 2001, and consolidated statement of operations and cash flows for the period from February 20, 2001 (inception) through September 30, 2001, reflect the consolidated financial position, results of operations, and cash flows of the Company from inception and also include the consolidated financial position, statement of operations and cash flows of CBRE from the the date of the merger and include all material adjustments required under the purchase method of accounting. In accordance with Regulation S-X, CBRE is considered the predecessor to the Company. As such, the historical financial statements of CBRE prior to the merger are included in the accompanying unaudited consolidated financial statements, including the consolidated financial position of CBRE as of December 31, 2000, the consolidated statements of operations for the periods from July 1, 2001 to July 20, 2001 and from January 1, 2001 to July 20, 2001 and for the three and nine months ended September 30, 2000, and the consolidated statements of cash flows for the period from January 1, 2001 to July 20, 2001 and for the nine months ended September 30, 2000 (collectively \"Predecessor financial statements\"). The Predecessor financial statements have not been adjusted to reflect the acquisition of CBRE by the Company. As such, the consolidated financial statements of the Company after the merger are not directly comparable to the Predecessor financial statements prior to the merger., 5242=    The number of shares of Class A and Class B common stock outstanding at October 31, 2001 was 1,742,468 and 12,649,813, respectively., 624508=    Between November 12 and December 6, 2000, five putative class actions were filed in the Court of Chancery of the State of Delaware in and for New Castle County by various of CBRE's stockholders against the Company, CBRE, its directors and the buying group which has taken CBRE private. A similar action was also filed on November 17, 2000 in the Superior Court of the State of California in and for the County of Los Angeles. These actions all alleged that the offering price for shares of CBRE's common stock was unfair and inadequate and sought injunctive relief or rescission of the transaction and, in the alternative, money damages., 140708=    At the effective time of the merger, CBRE became a wholly owned subsidiary of the Company. Pursuant to the terms of the merger agreement, each issued and outstanding share of common stock of CBRE was converted into the right to receive $16.00 in cash, except for (i) shares of common stock of CBRE owned by the Company and Blum CB immediately prior to the merger, which totaled 7,967,774 shares, which were cancelled, (ii) treasury shares and shares of common stock of CBRE owned by any of its subsidiaries, which were cancelled, and (iii) shares of CBRE held by stockholders who perfect appraisal rights for such shares in accordance with Delaware law. All shares of common stock of CBRE outstanding prior to the merger were acquired by Holding, and these shares were subsequently cancelled. Immediately prior to the merger, the following, collectively referred to as the buying group, contributed to the Company all the shares of CBRE's common stock that he or it directly owned in exchange for an equal number of shares of Class B common stock of the Company: RCBA Strategic FS Equity Partners III, L.P. (FSEP) a Delaware limited partnership, Blum Strategic Partners II, L.P., a Delaware limited partnership, FS Equity Partners International, L.P. (FSEP International) a Delaware limited partnership, The Koll Holding Company, a California corporation, Frederic V. Malek, a director of the Company and CBRE, Raymond E. Wirta, the Chief Executive Officer and a director of the Company and CBRE, and W. Brett White, the President and a director of the Company and CBRE. Such shares of common stock of CBRE, which totaled 7,967,774 shares of common stock, were then cancelled. In addition, the Company offered to purchase for cash options outstanding to acquire common stock of CBRE at a purchase price per option equal to the greater of the amount by which $16.00 exceeded the exercise price of the option, if at all, or $1.00. In connection with the merger, CBRE purchased its outstanding options on behalf of the Company, which were recorded as merger related and other non recurring charges by CBRE in the period from January 1, 2001 to July 20, 2001, and are not reflected in the accompanying Consolidated Statements of Operations of the Company., 557616=    Merger-related and other nonrecurring charges were $25.4 million for the nine months ended September 30, 2001, with no charges incurred in the prior year. This included merger-related costs of $16.5 million, the write-off of e-business investments of $6.1 million, as well as severance costs of $2.8 million related to the Company's cost reduction program instituted in May 2001., 618160=    The Tranche A facility will fully amortize by July 20, 2007 through quarterly principal payments over 6 years, which total $7.5 million each year through June 30, 2003 and $8.75 million each year thereafter through July 20, 2007. The Tranche B facility requires quarterly principal payments of $0.5 million, with the remaining outstanding principal due on July 18, 2008. The revolving line of credit requires the repayment of any outstanding balance for a period of 45 consecutive days commencing on any day as determined by the Company in the month of December of each year. The total amount outstanding under the credit facility included in senior secured term loans, current maturities of long-term debt and short-term borrowings in the accompanying Consolidated Balance Sheets was $255.2 million at September 30, 2001. The weighted average interest rate was 7.4% at September 30, 2001., 5853=CBRE HOLDING, INC. FORM 10-Q September 30, 2001 TABLE OF CONTENTS, 605843=activities due to the low interest rate environment in the US. Commissions, fees and other incentives decreased by $32.9 million or 9.2% for the nine months ended September 30, 2001, compared to the nine months ended September 30, 2000, primarily due to the lower lease and sales revenues within North America. The decline in revenues also resulted in lower variable commission expense within this division as compared to prior year. These declines were offset by higher insurance and benefit costs for producers in the US, which is included as a component of commissions expense. Commissions as a percentage of revenues remained comparable between years at 48.8% for the current year and 49.1% for the prior year. Operating, administrative, and other decreased by $6.6 million or 2.3% as a result of cost reduction and efficiency measures undertaken in the current year., 190103=    In connection with the merger with Blum CB, and as part of the financing of the merger, CBRE assumed an aggregate of $229.0 million in Senior Subordinated Notes due 2011. These Notes are unsecured and rank equally in right of payment with any of the Company's future senior subordinated unsecured indebtedness. The Notes are effectively subordinated to indebtedness and other liabilities of the Company's subsidiaries that are not guarantors of the Notes. The Notes are guaranteed on a full, unconditional, joint and several basis by the Company, CBRE and CBRE's wholly-owned domestic subsidiaries., 621574=    The Company has short-term borrowings of $104.8 million and $9.2 million with related weighted average interest rates of 5.0% and 7.3% as of September 30, 2001 and December 31, 2000, respectively., 549924=    Revenues on a consolidated basis decreased by $50.4 million or 15.4% for the three months ended September 30, 2001, compared to the three months ended September 30, 2000. This was mainly driven by a $28.2 million decrease in lease revenue, as well as a $17.6 million decline in sales revenue. These decreases were primarily attributable to the Company's North American operation in response to a softening economy as well as the tragic events that began on September 11, 2001. This resulted in clients delaying or canceling transactions. The revenue declines were slightly offset by a 15.1% rise in appraisal fees driven by increased refinancing activities due to a decline in interest rates in the US, and by increased fees in our European operation., 680283=    CBRE filed a Current Report on Form 8-K on July 5, 2001 dated July 5, 2001, announcing that as a part of the financing of the proposed merger of CBRE with Blum CB Corporation, the Company has offered in a private placement $65,000,000 of its 16% Senior Notes due July 20, 2011 and 339,820 shares of its Class A common stock. The related Offering Circular includes a \"Recent Developments\" update with respect to CBRE., 549570=    The Company reported a consolidated net loss of $27.7 million for the three months ended September 30, 2001 on revenues of $276.2 million compared to consolidated net income of $7.0 million on revenues of $326.5 million for the three months ended September 30, 2000., 163597=    The Company has $229.0 million in aggregate principal amount of 111/4% Senior Subordinated Notes due June 15, 2011 (the Notes), which were issued and sold by Blum CB Corp. for approximately $225.6 million, net of discount, on June 7, 2001 and assumed by CBRE in connection with the merger. The Notes require semi-annual payments of interest in arrears on June 15 and December 15, commencing on December 15, 2001, and are redeemable in whole or in part on or after June 15, 2006 at 105.625% of par on that date and at declining prices thereafter. In addition, before June 15, 2004, the Company may redeem up to 35.0% of the originally issued amount of the Notes at 1111/4% of par, plus accrued and unpaid interest, solely with the net cash proceeds from public equity offerings. In the event of a change of control, the Company is obligated to make an offer to purchase the Notes at a redemption price of 101.0% of the principal amount, plus accrued and unpaid interest. The Notes are fully and unconditionally guaranteed on a senior subordinated basis by the Company and CBRE's domestic subsidiaries. The effective yield on the Notes is 11.5%. The amount included in the accompanying Consolidated Balance Sheets less unamortized discount was $225.7 million at September 30, 2001., 632228=    In June 2001, the FASB issued SFAS No. 143, \"Accounting for Asset Retirement Obligations.\" This statement applies to legal obligations associated with the retirement of long-lived assets that result from the acquisition, construction, development and (or) the normal operation of a long-lived asset, except for certain obligations of leases. The statement requires that the fair value of a liability for an asset retirement obligation be recognized in the period in which it is incurred if a reasonable estimate of its fair value can be made. The associated asset retirement costs are capitalized as part of the carrying amount of the long-lived asset. This statement is effective for financial statements issued for fiscal years beginning after June 15, 2002, although earlier application is encouraged. The Company is currently evaluating the impact of the adoption of this statement on its results of operations and financial position., 170521=    The Company has short-term borrowings of $104.8 million and $9.2 million with related weighted average interest rates of 5.0% and 7.3% as of September 30, 2001 and December 31, 2000, respectively., 173186=    Deferred Compensation Plan (the DCP).  In 1994, CBRE implemented the DCP. Under the DCP, a select group of management and highly compensated employees can defer the payment of all or a portion of their compensation (including any bonuses) and have it invested in stock fund units, a series of mutual funds within an insurance policy or an interest bearing account. As part of the merger, the DCP was amended so that each stock fund unit represented the right to receive one share of Class A common stock of the Company. Each participant in the DCP who was a US employee or an independent contractor in the specified states and had pre-merger vested stock fund units prior to the merger was permitted to make one of the following elections: (1) convert the value of his or her pre-merger vested stock fund units, based upon a value of $16.00 per stock unit, into any of the insurance mutual fund or interest index fund alternatives provided under the DCP, or (2) continue to hold the vested stock fund units in his or her account under the DCP. In accordance with a change in control provision included in the terms of the DCP, shares of stock fund units associated with the 1999 Company matching contribution, which were unvested prior to the merger, became vested upon completion of the merger, but remained as stock fund units. Vested stock fund units, including those that vested due to the change in control, are included in goodwill in the accompanying consolidated balance sheet as of September 30, 2001. The above accounting treatment is in accordance with Financial Interpretation Number (FIN) 44 \"Accounting for Certain Transactions Involving Stock Compensation.\", 178775=    An important part of the strategy for the Company's investment management business involves investing its own capital in certain real estate investments with its clients. As of September 30, 2001, the Company invested $51.0 million and had committed $32.6 million to fund future co-investments., 661188=    On July 18, 2001, the shareholders of CBRE approved in accordance with Delaware law, the merger of CBRE and Blum CB Corp., 4769=    Indicate by check mark whether the Registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days. Yes /x/  No / /, 360555=CONDENSED CONSOLIDATING STATEMENT OF INCOME FOR THE PERIOD FROM JANUARY 1 TO JULY 20, 2001 (Dollars in Thousands) (Predecessor), 167388=    The Tranche A facility will fully amortize by July 20, 2007 through quarterly principal payments over 6 years, which total $7.5 million each year through June 30, 2003 and $8.75 million each year thereafter through July 20, 2007. The Tranche B facility requires quarterly principal payments of $0.5 million, with the remaining outstanding principal due on July 18, 2008. The revolving line of credit requires the repayment of any outstanding balance for a period of 45 consecutive days commencing on any day as determined by the Company in the month of December of each year. The total amount outstanding under the credit facility included in senior secured term loans, current maturities of long-term debt and short-term borrowings in the accompanying Consolidated Balance Sheets was $255.2 million at September 30, 2001. The weighted average interest rate was 7.4% at September 30, 2001., 679495=    CB Richard Ellis Services (CBRE) filed a Current Report on Form 8-K on October 22, 2001 dated October 22, 2001, announcing that CBRE and the Company had issued a press release dated October 22, 2001 announcing CBRE's preliminary, unaudited results of operations for the eight month period ended August 31, 2001., 413074=CBRE HOLDING, INC. CONDENSED CONSOLIDATING STATEMENT OF CASH FLOWS FOR THE PERIOD FROM FEBRUARY 20, 2001 (INCEPTION) THROUGH SEPTEMBER 30, 2001 (Dollars in Thousands) (Company), 192442=    Investments in consolidated subsidiaries are presented using the equity method of accounting. The principal elimination entries eliminate investments in consolidated subsidiaries and inter-company balances and transactions. In accordance with SFAS 142, \"Goodwill and Other Intangibles\", all goodwill acquired in an acquisition shall be assigned to reporting units as of the date of acquisition. The Company is currently evaluating the fair value of these reporting units and the applicable goodwill to be assigned. As a result, the Condensed Consolidated Balance Sheet as of September 30, 2001 does not reflect this allocation of goodwill based upon the fair value of the Company's reporting units., 628328=    In September 2000, the Financial Accounting Standards Board (FASB) issued Statement of Financial Accounting Standards (SFAS) 140, Accounting for Transfers and Servicing of Financial Assets and Extinguishments of Liabilities. SFAS 140 revises the standards for accounting for securitizations and other transfers of financial assets and collateral established by SFAS 125. In addition, this statement is effective for recognition and reclassification of collateral and for disclosures relating to securitization transactions and collateral for fiscal years ending after December 15, 2000. This statement is also effective for all transfers and servicing of financial assets and extinguishments of liabilities occurring after March 31, 2001. The adoption of SFAS 140 did not have a material impact on the Company's results of operations and financial position., 1384=For the quarterly period ended September 30, 2001, 608082=    Revenue decreased by $2.6 million or 4.5% for the nine months ended September 30, 2001, compared to the nine months ended September 30, 2000. This was primarily driven by lower incentive fees from sold properties. This was slightly offset by higher sales revenue in Australia. Operating, administrative, and other decreased by $1.6 million or 4.8% for the nine months ended September 30, 2001, compared to the nine months ended September 30, 2000. The decrease is primarily due to lower personnel requirements and other cost containment measures taken during the current year., 638762=    The Company's fixed and variable long-term debt as of September 30, 2001, are as follows (in thousands):, 159120=the results of operations to be expected for the period from February 20, 2001 (inception) to December 31, 2001., 552849=    Merger-related and other nonrecurring charges were $19.8 million for the three months ended September 30, 2001, compared to no charges for the three months ended September 30, 2000. This included merger-related costs of $15.1 million, the write-off of e-business investments of $3.3 million, as well as severance costs of $1.4 million related to the Company's cost reduction program instituted in May 2001., 144672=    Following the merger, the common stock of CBRE was delisted from the New York Stock Exchange. CBRE also successfully completed a tender offer and consent solicitation for all of the outstanding principal amount of its 87/8% Senior Subordinated Notes due 2006 (the Subordinated Notes). The Subordinated Notes were purchased at $1,079.14 for each $1,000 principal amount of Notes, which included the consent payment of $30.00 per $1,000 principal amount of Subordinated Notes. The Company also repaid the outstanding balance of CBRE's existing revolving credit facility. The Company entered into the merger in order to enhance the flexibility to operate CBRE's existing businesses and to develop new ones., 251107=CBRE HOLDING, INC. CONDENSED CONSOLIDATING BALANCE SHEET AS OF DECEMBER 31, 2000 (Dollars in Thousands) (Predecessor), 2214=Commission File Number 000 - 32983, 342042=CBRE HOLDING, INC. CONDENSED CONSOLIDATING STATEMENT OF INCOME FOR THE PERIOD FROM JULY 1 TO JULY 20, 2001 (Dollars in Thousands) (Predecessor), 558812=    The income tax provision on a consolidated basis was $2.2 million for the nine months ended September 30, 2001, as compared to a provision for income tax of $14.1 million for the nine months ended September 30, 2000. The income tax provision and effective tax rate are not comparable between periods due to the effect of the merger. In addition, the Company adopted SFAS No. 142, \"Goodwill and Other Intangible Assets,\" which includes the elimination of the amortization of goodwill created under such acquisitions., 176725=    Between November 12 and December 6, 2000, five putative class actions were filed in the Court of Chancery of the State of Delaware in and for New Castle County by various of CBRE's stockholders against the Company, CBRE, its directors and the buying group which has taken CBRE private. A, 679889=    CBRE filed a Current Report on Form 8-K on August 3, 2001 dated July 20, 2001, announcing a change in control of CBRE resulting from the merger of CBRE with Blum CB Corporation, a wholly-owned subsidiary of the Company. CBRE was the surviving corporation in the merger and became a wholly-owned subsidiary of the Company., 486619=CBRE HOLDING, INC. CONDENSED CONSOLIDATING STATEMENT OF CASH FLOWS FOR THE NINE MONTHS ENDED SEPTEMBER 30, 2000 (Dollars in Thousands) (Predecessor), 552460=    Depreciation and amortization totaled $8.3 million on a consolidated basis, a decrease of $2.5 million or 23.4% from the third quarter 2000. This is primarily attributable to the discontinuation of goodwill amortization after the merger, in accordance with SFAS 142, \"Goodwill and other Intangible Assets.\", 554354=    The Company reported a consolidated net loss of $32.8 million for the nine months ended September 30, 2001 on revenues of $833.5 million compared to consolidated net income of $12.5 million on revenues of $905.3 million for the nine months ended September 30, 2000., 600742=    Revenue decreased by $47.1 million or 17.7% for the three months ended September 30, 2001, compared to the three months ended September 30, 2000. This decrease was primarily due to lower lease revenue of $25.4 million and decreased sales revenue of $15.5 million. These declines are primarily a result of a lower number of transactions completed, caused by a softening economy as well as the tragic events that began on September 11th. Other revenues also declined due to the sale of loan servicing rights in the prior year quarter. These decreases were slightly offset by higher appraisal fees driven by increased refinancing activities due to the low interest rate environment in the US. Commissions, fees and other incentives decreased by $24.6 million or 18.2% for the three months ended September 30, 2001, compared to the three months ended September 30, 2000, primarily due to the decline in lease and sales revenues. The decline in revenues also resulted in lower variable commission expense within this division as compared to prior year quarter. Commissions as a percentage of revenues remained comparable at 50.6% for the current quarter compared to 50.9% for the prior year quarter. Operating, administrative, and other decreased by $13.5 million or 13.4% for the three months ended September 30, 2001, compared to the three months ended September 30, 2000 reflecting the Company's cost reduction efforts., 554218=Nine Months Ended September 30, 2001 Compared to Nine Months Ended September 30, 2000, 140052=    On July 20, 2001, the Company acquired (the merger) CBRE pursuant to an Amended and Restated Agreement and Plan of Merger dated May 31, 2001 (the merger agreement) among the Company, CBRE and Blum CB. Blum CB was merged with and into CBRE, with CBRE being the surviving corporation. The operations of the Company after the merger are substantially the same as the operations of CBRE prior to the merger. In addition, the Company has no substantive operations, other than its investment in CBRE. As such, CBRE is considered the predecessor to the Company in accordance with Regulation S-X., 148037=    The preliminary purchase accounting adjustments of the Company have been recorded in the accompanying unaudited consolidated financial statements as of and for any periods subsequent to July 20, 2001. The excess of the purchase price paid by the Company over its preliminary estimates of the fair value of the assets and liabilities of CBRE at the date of merger, was approximately $629.1 million and is reflected as goodwill in the accompanying unaudited consolidated balance sheet as of September 30, 2001. In accordance with SFAS 142, \"Goodwill and Other Intangible Assets,\" the new goodwill balance established as a result of the merger is not being amortized. The process of determining the fair value of assets and liabilities at the merger date is continuing, and the final result, 558083=    Depreciation and amortization totaled $31.4 million on a consolidated basis, a 2.1% decrease from September 2000. This is primarily attributable to the discontinuation of goodwill amortization after the merger, in accordance with SFAS 142, \"Goodwill and other Intangible Assets.\", 660066=    The cash proceeds received by the Company from these issuances of shares of Class A and Class B common stock, together with the cash proceeds received from the sale by the Company of the Units, were contributed by the Company to CBRE, which issued 11,540,747 shares of CBRE common stock and 6,250,000 shares of CBRE preferred stock to the Company pursuant to a transaction exempt from registration under Section 4(2) of the Securities Act. The cash proceeds received by CBRE, together with borrowings under a new credit agreement and the cash proceeds received from the issuance of 111/4% Senior Subordinated Notes due June 15, 2011, were used to consummate the merger of CBRE with Blum CB Corp. and the related transactions., 629325=    In June 2001, the FASB issued SFAS No. 141, \"Business Combinations\", which supersedes APB Opinion No. 16, \"Business Combinations\" and SFAS No. 38, \"Accounting for Pre-acquisition Contingencies of Purchased Enterprises.\" SFAS No. 141 eliminates the pooling-of-interests method of accounting for business combinations and requires all business combinations to be accounted for by a single method\u0097the purchase method. This statement is effective for all business combinations initiated after June 30, 2001. Accordingly, the Company accounted for the merger using the purchase method., 638184=    The Company manages its interest expense by using a combination of fixed and variable rate debt. The Company utilizes sensitivity analyses to assess the potential effect of its variable rate debt. If interest rates were to increase by 70 basis points, approximately 10.0% of its weighted-average variable rate at September 30, 2001, the net impact would be a decrease of $0.5 million in pre-tax income and cash provided by operating activities for the period from July 20, 2001 to September 30, 2001., 137853=    The Company issued common stock in exchange for non-cash considerations, including the common stock issued in connection with the acquistion of CBRE. The non-cash component of equity issued during the period from February 20, 2001 to September 30, 2001 was approximately $149.4 million., 553613=    The income tax provision on a consolidated basis was $9.5 million for the three months ended September 30, 2001 compared to a provision for income tax of $7.9 million for the three months ended September 30, 2000. The income tax provision and effective tax rate are not comparable between periods due to the effect of the merger. In addition, the Company adopted SFAS No. 142, \"Goodwill and Other Intangible Assets,\" which includes the elimination of the amortization of goodwill created under such acquisitions., 165504=    The Company also entered into a $325.0 million senior credit facility (the Credit Facility) with Credit Suisse First Boston (CSFB) and other lenders. The Credit Facility is jointly and severally guaranteed by the Company and its domestic subsidiaries and is secured by substantially all their assets. The credit facility includes the Tranche A term facility of $50.0 million, maturing in 2007; the Tranche B term facility of $185.0 million, maturing in 2008; and the revolving line of credit of $90.0 million, including revolving credit loans, letters of credit and a swingline loan facility, maturing in 2007. Borrowings under the senior secured credit facilities will bear interest at varying rates based on the Company's option, at either LIBOR plus 3.25% or the alternate base rate plus 2.25%, in the case of Tranche A and the revolving facility, and LIBOR plus 3.75% or the alternate base rate plus 2.75%, in the case of Tranche B facility. The alternate base rate is the higher of (1) CSFB's prime rate or (2) the Federal Funds Effective Rate plus one-half of one percent. After delivery of the Company's consolidated financial statements for the year ending December 31, 2001, the amount added to the LIBOR rate or the alternate base rate under the Tranche A and revolving facility will vary, from 2.50% to 3.25% for LIBOR and from 1.50% to 2.25% for the alternate base rate, as determined by reference to the Company's ratios of total debt less available cash to EBITDA, as defined in the debt agreement., 549432=Three Months Ended September 30, 2001 Compared to Three Months Ended September 30, 2000, 190900=    (1) Condensed consolidating balance sheets as of September 30, 2001 and December 31, 2000; condensed consolidating statements of operations for the three months ended September 30, 2001, the period from February 20, 2001 (inception) through September 30, 2001, the period from, 544891=    On October 4, 2001, CBRE filed a Form S-4 registration statement with the Securities and Exchange Commission to register an offer to exchange all of the outstanding $229.0 million aggregate principal amount of 111/4% Senior Subordinated Notes due June 15, 2011 with new notes registered under the Securities Act of 1933. On October 4, 2001, the Company filed a Form S-4 registration statement with the Securities Exchange Commission to register an offer to exchange all of the outstanding $65.0 million aggregate principal amount of 16% Senior Notes due July 20, 2011 with new notes registered under the Securities Act of 1933. The terms of the exchange notes to be issued in the exchange offers are substantially identical to the outstanding notes for which they are being exchanged, except the exchange notes will be freely tradable, except in limited circumstances., 630177=    In June 2001, the FASB issued SFAS No. 142, \"Goodwill and Other Intangible Assets\", which supersedes APB Opinion No. 17, \"Intangible Assets.\" Under SFAS 142, goodwill is no longer subject to amortization over its estimated useful life. Rather, goodwill will be subject to at least an annual assessment for impairment applying a fair-value based test. Additionally, an acquired intangible asset should be separately recognized if the benefit of the intangible asset is obtained through contractual or other legal rights, or if the intangible asset can be sold, transferred, licensed, rented, or exchanged, regardless of the acquirer's intent to do so. This statement is effective for fiscal years beginning after December 15, 2001, although early application is permitted for entities with fiscal years beginning after March 15, 2001. For acquisitions occurring after June 30, 2001, partial application of SFAS 142 is required, which includes the elimination of the amortization of goodwill created under such acquisitions and the requirement that intangible assets acquired be amortized in accordance with the provisions of SFAS 142. All other aspects of SFAS 142 must be applied under the timeframe discussed above. The Company has adopted the portion of this statement related to the elimination of the amortization of, 139313=    CBRE Holding, Inc., a Delaware corporation, was incorporated on February 20, 2001 as BLUM CB Holding Corp. On March 26, 2001, BLUM CB Holding Corp. changed its name to CBRE Holding, Inc. (the Company). The Company and its former wholly owned subsidiary, BLUM CB Corporation (Blum CB), a Delaware corporation, were created to acquire all of the outstanding shares of CB Richard Ellis Services, Inc. (CBRE), an international real estate services firm. Prior to July 20, 2001, the Company was a wholly owned subsidiary of RCBA Strategic Partners, L.P. (RCBA Strategic), and is an affiliate of Richard C. Blum a director of the company and CBRE., 168391=    The Company issued an aggregate principal amount of $65 million of 16.0% Senior Notes due in 2011 (the Senior Notes). The Senior Notes are unsecured obligations, senior to all current and future unsecured indebtedness, but subordinated to all current and future secured indebtedness of the Company. Interest accrues at a rate of 16% per year and is payable quarterly in cash in arrears. However, until July 2006, interest in excess of 12% may be paid in kind, and at any time, interest may be paid in kind to the extent CBRE's ability to pay cash dividends is restricted by the terms of the Credit Facility. The Senior Notes are redeemable at the Company's option, in whole or in part, at 116.0% of par commencing on July 20, 2001 and at declining prices thereafter. In the event of a change in control, the Company is obligated to make an offer to purchase all of the outstanding Senior Notes. The total amount included in the accompanying Consolidated Balance Sheet was $59.6 million, net of discount, at Septemer 30, 2001., 321211=CONDENSED CONSOLIDATING STATEMENT OF INCOME FOR THE PERIOD FROM FEBRUARY 20, 2001 (INCEPTION) THROUGH SEPTEMBER 30, 2001 (Dollars in Thousands) (Company), 657154=    (c) On July 20, 2001, the Company issued and sold the following equity securities pursuant to the Section 4(2) exemption from the registration requirements of the Securities Act of 1933, as amended (the Securities Act), except for the issuance and sale in the second to last bullet which was made pursuant to Rule 144A:, 612247=    The funding to complete the merger, as well as the refinancing of substantially all of the outstanding indebtedness of CBRE, was obtained through (i) the cash contribution of $74.8 million from the sale of Class B common stock of the Company for $16.00 per share, (ii) the sale of shares of its Class A common stock of the Company for $16.00 per share to employees and independent contractors of CBRE, (iii) the sale of 625,000 shares of Class A common stock of the Company to CalPERS for $16.00 per share, (iv) the issuance and sale by the Company of 65,000 units for $65.0 million to DLJ Investment Funding, Inc. and other purchasers, which units consist of $65.0 million in aggregate principal amount of 16% Senior Notes due 2011 and 339,820 shares of Class A common stock of the Company, (v) the issuance and sale by Blum CB of $229.0 million in aggregate principal amount of 111/4% Senior Subordinated Notes due 2011 for $225.6 million (which were assumed by CBRE in connection with the merger) and (vi) borrowings by CBRE under a new $325.0 million senior credit agreement with Credit Suisse First Boston and other lenders., 550763=    Commissions, fees and other incentives totaled $135.5 million on a consolidated basis, a 14.0% decrease from the third quarter of 2000. This decrease is primarily due to the lower lease and sales revenues within North America. The decline in revenues also resulted in lower variable commission, 611017=Equity Partners III, L.P. (FSEP) a Delaware limited partnership, Blum Strategic Partners II, L.P., a Delaware limited partnership, FS Equity Partners International, L.P. (FSEP International) a Delaware limited partnership, The Koll Holding Company, a California corporation, Frederic V. Malek, a director of the Company and CBRE, Raymond E. Wirta, the Chief Executive Officer and a director of the Company and CBRE, and W. Brett White, the President and a director of the Company and CBRE. Such shares of common stock of CBRE, which totaled 7,967,774 shares of common stock, were then cancelled. In addition, the Company offered to purchase for cash options outstanding to acquire common stock of CBRE at a purchase price per option equal to the greater of the amount by which $16.00 exceeded the exercise price of the option, if at all, or $1.00. In connection with the merger, CBRE purchased its outstanding options on behalf of the Company, which were recorded as merger related and other non recurring charges by CBRE in the period from January 1, 2001 to July 20, 2001, and are not reflected in the accompanying Consolidated Statements of Operations of the Company., 554707=    Revenues on a consolidated basis decreased by $71.8 million or 7.9% for the current year, mainly due to decreased lease revenue of $52.3 million. Sales revenue also declined by $31.0 million during the current year. The lower revenues are primarily attributable to the Company's North American operation in response to a softening economy as well as the tragic events that began on September 11, 2001. This resulted in clients delaying or canceling transactions. However, the European operation also experienced lower sale and lease revenues compared to prior year. These decreases were slightly offset by a $7.4 million increase in loan origination and servicing fees, as well as a $6.4 million increase in property and facilities management fees. Appraisal fees also increased by 11.1% driven by increased refinancing activities due to a decline in the interest rates in the US, and increased fees in the European operation., 175815=    Capital Accumulation Plan (The Cap Plan).  The Cap Plan is a defined contribution profit sharing plan under section 401(k) of the Internal Revenue Code and is CBRE's only such plan. In connection with the merger, each share of CBRE's common stock held by the plan was exchanged for $16.00 in cash. In addition, the Cap Plan was amended to eliminate CBRE's common stock as an investment option after July 20, 2001. The cash received for the shares of CBRE's common stock was available for reinvestment in one or more of the investment alternatives contained within the Cap Plan, including a new Company Stock Fund in which employees could invest on a one time basis in Class A shares of common stock of the Company., 157267=    The accompanying unaudited consolidated financial statements have been prepared in accordance with the rules applicable to Form 10-Q and include all information and footnotes required for interim financial statement presentation. In the opinion of management, all adjustments (consisting of normal recurring adjustments) considered necessary for a fair presentation have been included. The preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting periods. Actual results could differ materially from those estimated. All significant inter-company transactions and balances have been eliminated, and certain reclassifications have been made to prior periods' consolidated statements to conform to current period presentation. The consolidated financial statements and notes to the consolidated financial statements, along with management's discussion and analysis of financial condition, results of operations, liquidity and capital resources should be read in conjunction with the Company's Form S-4 Registration Statements filed on October 22, 2001. The results of operations for the period from February 20, 2001 (inception) to September 30, 2001 are not necessarily indicative of, 627399=    The Company had US Federal income tax net operating losses (NOLs) of approximately $15.8 million at September 30, 2001 and December 31, 2000. The Company's ability to use NOLs has been limited for the period from July 21, 2001 to December 31, 2001 and will be in subsequent years because CBRE experienced a change in ownership greater than 50% on July 20, 2001. As a result of the ownership change, the limitation will be approximately $5.2 million of its NOLs for the period from July 21, 2001 to December 31, 2001 and $11.2 million in year 2002 and in each subsequent year until fully utilized. The amount of NOLs is, in any event, subject to some uncertainty until the statute of limitations lapses after their utilization to offset taxable income., 177362=similar action was also filed on November 17, 2000 in the Superior Court of the State of California in and for the County of Los Angeles. These actions all alleged that the offering price for shares of CBRE's common stock was unfair and inadequate and sought injunctive relief or rescission of the transaction and, in the alternative, money damages., 175013=    Each stock fund unit that was unvested prior to the merger continued to be held in participants' accounts but after the merger represented the right to receive one share of Class A common stock of the Company. These unvested stock fund units have been accounted for as a deferred compensation asset, of which $2.0 million and $4.0 million are included in other current assets and other assets, respectively, in the accompanying Consolidated Balance Sheets as of September 30, 2001. The deferred compensation asset will be amortized as compensation expense over the remaining vesting period for such stock fund units in accordance with FIN 44. After completion of the merger, no new deferrals are allowed in stock fund units., 188160=    Basic earnings per share was computed by dividing the net earnings by the weighted average number of common shares outstanding of 11,865,459 and 20,806,651 for the three months ended September 30, 2001 and 2000, respectively, and 4,921,204 and 20,834,943 for the period from February 20, 2001 (Inception) to September 30, 2001 and the nine months ended September 2000, respectively, and 21,194,674 and 21,306,584 for the period from July 1, 2001 to July 20, 2001 and the period from January 1, 2001 to July 20, 2001, respectively. The Company's outstanding common stock equivalents were antidilutive during the current year. For the three and nine month periods ended September 30, 2000, the computation of diluted earnings per share further assumes the dilutive effect of 74,441 and 82,601 common stock equivalents, respectively, which consists principally of stock options. Due to the change in equity structure as a result of the merger, the current year per share information is not comparable to that of the prior year., 193632=CBRE HOLDING, INC. CONDENSED CONSOLIDATING BALANCE SHEET AS OF SEPTEMBER 30, 2001 (Dollars in Thousands) (Company), 604833=    Revenue decreased by $63.2 million or 8.6% for the nine months ended September 30, 2001, compared to the nine months ended September 30, 2000. The decrease was primarily due to a $44.2 million decrease in lease revenues and a $24.3 million decline in sales revenues due to a lower number of transactions completed during the current year due to the softening economy and the tragic events which began on September 11, 2001. This was slightly offset by an increase in loan origination and servicing fees of $7.4 million, as well as higher appraisal fees driven by increased refinancing, 137464=    The Company purchased all of the outstanding common stock of CBRE in exchange for cash and common stock of the Company. The non-cash componenet of the merger consideration included approximately $157.1 million in common stock and payables. The payables will be paid subsequent to September 30, 2001., 551816=    Operating, administrative and other on a consolidated basis was $116.8 million, a decrease of $16.5 million or 12.4% as compared to the third quarter of 2000. This decline is due to lower bonus incentives and profit share attributable to the Company's lower results, cost cutting measures and operational efficiencies put into place in May 2001 and an organizational restructure implemented after the merger transaction was completed, that included the reduction of administrative staff in corporate and divisional headquarters and the scaling back of unprofitable operations., 626591=    A majority of the European Union member countries converted to a common currency, the \"Euro,\" on January 1, 1999. The existing legacy currencies of the participating countries will continue to be accepted until January 1, 2002. The Company does not expect the introduction of the Euro to have a significant impact on its market or the manner in which it conducts business, and believes the related impact on its financial results will not be material. Approximately 4.3% of the Company's 2001 business was transacted in the participating member countries. The Company is currently using both the Euro and legacy currencies to conduct business in these member countries., 151225=    Unaudited pro forma results of the Company assuming the merger had occurred as of January 1, 2000 are presented below. These pro forma results have been prepared for comparative purposes only and do not purport to be indicative of what operating results would have been, and may not be indicative of future operating results (in thousands, except per share amounts):, 547136=    The results of operations of the Company for the quarter ended September 30, 2001 have been derived by combining the results of operations of the Company for the quarter ended September 30, 2001 with the results of operations of CBRE, prior to the merger, from July 1, 2001 to July 20, 2001, the date of the merger. The results of operations for the nine months ended September 30, 2001 reflect the combination of the results of operations of the Company for the period from February 20, 2001 to September 30, 2001 with the results of operations for CBRE prior to the merger, from January 1, 2001 to July 20, 2001. The results of operations and cash flows of CBRE prior to the merger incorporated in this discussion are the historical results and cash flows of CBRE, the predecessor to the Company. These CBRE results do not reflect any purchase accounting adjustments included in the results of the Company after the merger, and are thus not directly comparable. Because of the effects of purchase accounting applied as a result of the merger and the additional interest expense associated with the debt incurred to finance the merger, the results of operations of the Company are not comparable in all respects to the results of operations prior to the merger. However, the Company's management believes a discussion of the operations by combining the results of the Company and CBRE is more meaningful as the Company's operating revenues and expenses have not been affected by the MBO and splitting up the results between pre- and post-merger periods would make comparisons of the operating trends to the prior year very different., 144006=$65.0 million to DLJ Investment Funding, Inc. and other purchasers, which units consist of $65.0 million in aggregate principal amount of 16% Senior Notes due 2011 and 339,820 shares of Class A common stock of the Company, (v) the issuance and sale by Blum CB of $229.0 million in aggregate principal amount of 111/4% Senior Subordinated Notes due 2011 for $225.6 million (which were assumed by CBRE in connection with the merger) and (vi) borrowings by CBRE under a new $325.0 million senior credit agreement with Credit Suisse First Boston and other lenders., 603587=    Revenue decreased by $1.2 million or 6.1% for the three months ended September 30, 2001, compared to the three months ended September 30, 2000 due primarily to lower incentive fees from sold properties. This was slightly offset by stronger sales revenue in Australia. Commissions, fees and other incentives increased by $0.7 million or 8.8% compared to the three months ended September 30, 2000. Excluding Australia, producer compensation is typically fixed in nature and does not decrease as a result of a decline in revenues. Operating, administrative, and other decreased by $1.2 million or 10.8% for the three months ended September 30, 2001, compared to the three months ended September 30, 2000 due mainly to lower personnel requirements and other cost containment measures taken during the quarter., 300662=CBRE HOLDING, INC. CONDENSED CONSOLIDATING STATEMENT OF INCOME FOR THE THREE MONTHS ENDED SEPTEMBER 30, 2001 (Dollars in Thousands) (Company), 606917=    Revenue decreased by $6.0 million or 5.2% for the nine months ended September 30, 2001, compared to the nine months ended September 30, 2000. This was mainly driven by lower sales and lease revenues due to the overall weakness in the European economy. Commissions, fees and other incentives increased by $1.9 million or 4.5% for the nine months ended September 30, 2001, compared to the nine months ended September 30, 2000 due primarily to a higher number of producers, mainly in the U.K. In addition, producer compensation is typically fixed in nature and does not decrease with a decline in revenues. Operating, administrative, and other decreased by $2.5 million or 4.0% for the nine months ended September 30, 2001, compared to the nine months ended September 30, 2000 attributable mainly to the cost reduction measures taken during the current year., 396082=CONDENSED CONSOLIDATING STATEMENT OF INCOME FOR THE NINE MONTHS ENDED SEPTEMBER 30, 2000 (Dollars in Thousands) (Predecessor), 553348=    Consolidated interest expense was $15.3 million, an increase of $4.3 million or 39.6% over the third quarter of 2000. This is attributable to the change in debt structure as a result of the merger., 559479=    Subsequent to the merger transaction, the Company reorganized its business segments as part of its efforts to reduce costs and streamline its operations. The Company now reports its operations through three geographically organized segments: (1) The Americas, (2) Europe, Middle East, and Africa (EMEA), and (3) Asia Pacific. The Americas consist of the United States, Canada, Mexico, and operations located in Central and South America. EMEA mainly consists of Europe, while Asia Pacific includes the operations in Asia, Australia and New Zealand. Previously, the Company reported its segments based on the applicable type of revenue transaction. This included the Transaction Management, Financial Services and Management Services segments. Americas current year results include a nonrecurring pre-tax gain of $5.6 million from the sale of mortgage fund contracts, as well as merger-related and other nonrecurring charges of $24.5 million. Prior year results include a $4.7 million nonrecurring pre-tax gain on the sale of certain non-strategic assets. Current year results for Asia Pacific include merger-related and non-recurring charges of $0.8 million. The results of operations of the Company for the quarter ended September 30, 2001 have been derived by combining the Company's results with the results of operations of CBRE prior to the merger, from July 1, 2001 to July 20, 2001, the date of the merger. The results of operations for the nine months ended September 30, 2001 reflect the combination of the results of operations of the Company with the results of operations of CBRE prior to the merger, from January 1, 2001 to July 20, 2001. The following unaudited table summarizes the Company's revenue, cost and expenses, and operating (loss) income by operating segment for the periods ended September 30, 2001 and 2000. Because of the effects of purchase accounting applied in the merger and the additional interest expense associated with, 681422=    Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized., 177751=    The five Delaware actions were subsequently consolidated and a lead counsel appointed. As of October 2, 2001, the parties to the Delaware litigation entered into a settlement agreement that was filed with the appropriate court in Delaware. However, the Delaware court has not yet approved the settlement. Furthermore, the parties involved in the California lawsuit have not agreed to a settlement., 634349=    Portions of this Form 10-Q, including Management's Discussion and Analysis of Financial Condition and Results of Operations, contain forward-looking statements within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause the Company's actual results and performance in future periods to be materially different from any future results or performance suggested in forward-looking statements in this Form 10-Q. Any forward-looking statements speak only as of the date of this report and the Company expressly disclaims any obligation to update or revise any forward-looking statements found herein to reflect any changes in its expectations or results or any change in events. Factors that could cause results to differ materially include, but are not limited to: commercial real estate vacancy levels; employment conditions and their effect on vacancy rates; property values; rental rates; any general economic recession domestically or internationally; and general conditions of financial liquidity for real estate transactions., 546603=    On July 20, 2001, the Company acquired (the Merger) CB Richard Ellis Services, Inc. (CBRE) pursuant to an Amended and Restated Agreement and Plan of Merger dated May 31, 2001 (the merger agreement) among the Company, CBRE and Blum CB Corp. (Blum CB), a wholly owned subsidiary of the Company. Blum CB was merged with and into CBRE, with CBRE being the surviving corporation. At the effective time of the merger, CBRE became a wholly owned subsidiary of the Company., 189357=    During the three months ended September 30, 2001, the Company recorded other nonrecurring pre-tax charges totaling $3.3 million which primarily included the write-off of CBRE's e-business investments. During the period from January 1, 2001 to July 20, 2001, CBRE recorded merger-related and other non recurring charges of $22.1 million which includes merger-related costs of $16.4 million, severance costs of $2.8 million related to CBRE's cost reduction program instituted in May 2001, as well as the write-off of an e-investment of $2.9 million, 191564=July 1, 2001 through July 20, 2001, the period from January 1, 2001 through July 20, 2001, and the three and nine months ended September 30, 2000; and condensed consolidating statements of cash flows for the period from February 20, 2001 (inception) to September 30, 2001, the period from January 1, 2001 to July 20, 2001 and the nine months ended September 30, 2000 of (a) Holding, the Parent, (b) CBRE, which is the subsidiary issuer (c) the guarantor subsidiaries, (d) the nonguarantor subsidiaries, and (e) the Company on a consolidated basis; and}",
    "lastModified": "Thu, 30 Jul 2015 16:41:21 GMT",
    "textBeforeTable": "FORM 10-Q SECURITIES AND EXCHANGE COMMISSION Washington, D.C. 20549 -- Click here to rapidly navigate through this document QuickLinks  Prepared by MERRILL CORPORATION November 14, 2001 Download PDF Form 10-Q CBRE HOLDING INC",
    "textAfterTable": "CBRE HOLDING, INC. FORM 10-Q September 30, 2001 TABLE OF CONTENTS         PAGE PART I\u0097FINANCIAL INFORMATION     Item 1.   Financial Statements         Consolidated Balance Sheets at September 30, 2001 (Unaudited) and December 31, 2000   3     Consolidated Statements of Operations for the three months ended September 30, 2001, the period from February 20, 2001 (inception) through September 30, 2001, the period from July 1, 2001 through July 20, 2001, the period January 1, 2001 through July 20, 2001, and the three and nine months ended September 30, 2000 (Unaudited).   4     Consolidated Statements of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}