{
    "relation": [
        [
            "Patent application number",
            "20080306087",
            "20090012127"
        ],
        [
            "Description",
            "Therapeutic Agents - The present invention relates to compounds of formula (I) and processes for preparing such compounds, their use in the treatment of obesity, psychiatric and neurological disorders, to methods for their therapeutic use and to pharmaceutical compositions containing them.",
            "Thiophene-2-Carboxamide Derivatives as Alpha 7 Nicotinic Receptor Modulators - Compounds of Formula (I) wherein E, A and R1 are as described in the specification, pharmaceutically-acceptable salts, methods of making, pharmaceutical compositions containing and methods for using the same."
        ],
        [
            "Published",
            "12-11-2008",
            "01-08-2009"
        ]
    ],
    "pageTitle": "Woods, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/woods-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00317-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 432997327,
    "recordOffset": 432963088,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "James M. Woods, Wilmington, DE US //]]> BarDraw('3143763',['Patent applications by James H. Woods, Ann Arbor, MI US'],[[1,2,1,2,2]],['2010','2011','2012','2013','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3143763\" align=\"center\"></div> </div> <canvas id=\"bg3143763\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by James H. Woods, Ann Arbor, MI US</p> <div class=\"bar3143763\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>12-04-2014</td> <td><a href=\"/patents/app/20140357674\">NICOTINIC RECEPTOR COMPOUNDS</a> - Compounds and compositions for promoting smoking cessation or decreasing tobacco use or nicotine addiction are provided. The compounds are 2′-fluoro-3′-(substituted phenyl) deschloroepibatidine analogs. The compounds have been found to modulate neuronal nicotine acetylcholine receptors and are useful in methods for the treatment of conditions or disorders influenced by the modulation of neuronal nicotinic acetylcholine receptors.</td> <td>20140357674</td> <tr> </tr> <td>11-27-2014</td> <td><a href=\"/patents/app/20140348813\">THERMOSTABILIZATION OF PROTEINS</a> - Provided are compositions comprising a cocaine esterase (CocE) and a compound that thermostabilizes the CocE. Also provided are methods of thermostabilizing a cocaine esterase. Additionally provided are methods of treating a mammal undergoing a cocaine-induced condition. Methods of determining whether a compound is a thermostabilizing agent for a protein are also provided. Uses of the above-described compositions for the treatment of a cocaine-induced condition is additionally provided. Additionally provided is an isolated nucleic acid encoding a CocE polypeptide having the substitutions L169K and G173Q, and the CocE polypeptide encoded by that nucleic acid, and pharmaceutical compositions thereof. Further provided is the use of that composition for the manufacture of a medicament for the treatment of a cocaine-induced condition",
    "textAfterTable": "Patent applications by James M. Woods, Wilmington, DE US Jason Woods, Carson City, NV US Patent application number Description Published 20090128986 HYBRID DISCOIDAL/TUBULAR CAPACITOR - A hybrid capacitor includes a body of dielectric material having spaced-apart first and second surfaces. A first electrode is associated with the first surface. A second electrode is associated with the second surface. One or more third electrodes are transversely disposed within the dielectric body between the first and second electrodes. Either the first or second electrode is not conductively coupled to any electrode transversely extending into the body. The resulting arrangement provides a hybrid capacitor having characteristics of both a tubular capacitor and a discoidal capacitor. 05-21-2009 20090288280 PROCESS FOR MANUFACTURING EMI FILTERS UTILIZING COUNTER-BORED CAPACITORS TO FACILITATE SOLDER RE-FLOW - An EMI filtered terminal assembly includes at least one conductive terminal pin, a feedthrough capacitor, and a counter-bore associated with a passageway through the capacitor and the lead wire. Preferably, the feedthrough capacitor having counter-drilled holes on its top side is first bonded to a hermetic insulator. The counter-bore in the capacitor provides greater volume for the electro-mechanical attachment between the capacitor and the lead wire, permitting robotic dispensing",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}