{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Mainline Protestant",
            "Other",
            "Evangelical Protestant",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "50,256",
            "15,311",
            "4,262",
            "4,104",
            "1,064",
            "150",
            "107,346"
        ],
        [
            "Congregations",
            "27",
            "78",
            "30",
            "42",
            "7",
            "1",
            "-"
        ]
    ],
    "pageTitle": "Rosendale, New York (NY 12472) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Rosendale-New-York.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00028-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 361611395,
    "recordOffset": 361501285,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4976=Educational Attainment (%) in 2000, 30163=On 7/10/1989, a category F4 (max. wind speeds 207-260 mph) tornado 36.9 miles away from the Rosendale town center injured 20 people and caused between $5,000,000 and $50,000,000 in damages., 608=Graphs represent county-level data. Detailed 2008 Election Results, 14138=Air Quality Index (AQI) level in 2012 was 71.5. This is about average., 2036=1996 Presidential Elections Results, 78179=Zip codes: 12472., 12760=Ozone [ppb] level in 2012 was 23.6. This is better than average. Closest monitor was 6.7 miles away from the city center., 1464=2004 Presidential Elections Results, 892=2012 Presidential Elections Results, 29876=On 5/29/1995, a category F4 tornado 41.2 miles away from the town center killed 3 people and injured 24 people and caused between $5,000,000 and $50,000,000 in damages., 13491=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.42. This is better than average. Closest monitor was 6.7 miles away from the city center., 46477=According to our research of New York and other state lists there were 2 registered sex offenders living in Rosendale, New York as of July 30, 2015. The ratio of number of residents in Rosendale to the number of sex offenders is 3,110 to 1. The number of registered sex offenders compared to the number of residents in this city is a lot smaller than the state average., 1750=2000 Presidential Elections Results, 1178=2008 Presidential Elections Results, 12055=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 7.99. This is about average. Closest monitor was 13.4 miles away from the city center., 4578=School Enrollment by Level of School (%) in 2000}",
    "TableContextTimeStampAfterTable": "{7465=4.91% of this county's 2010 resident taxpayers moved to other counties in 2011 ($42,720 average adjusted gross income), 34462=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 5257=4.78% of this county's 2011 resident taxpayers lived in other counties in 2010 ($42,351 average adjusted gross income), 13648=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population), 33139=Total of 5 patent applications in 2008-2015.}",
    "textBeforeTable": "Religion statistics for Rosendale town (based on Ulster County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results No fuel used (1%) Other fuel (1%) Utility gas (2%) Wood (5%) Electricity (10%) Bottled, tank, or LP gas (10%) Fuel oil, kerosene, etc. (71%) Most",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 45 Ulster County: 2.48 / 10,000 pop. New York: 4.13 / 10,000 pop. Number of supercenters and club stores: 2 This county: 0.11 / 10,000 pop. State: 0.06 / 10,000 pop. Number of convenience stores (no gas): 23 Ulster County: 1.27 / 10,000 pop. New York: 0.92 / 10,000 pop. Number of convenience stores (with gas): 71 Ulster County: 3.91 / 10,000 pop. State: 1.68 / 10,000 pop. Number of full-service restaurants: 229 Here: 12.61 / 10,000 pop. State: 8.82 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}