{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Eggheads",
            "Japanese News",
            "Seven Early News",
            "Today",
            "CBS This Morning"
        ],
        [
            "Time",
            "5:30 am - 6 am",
            "5:40 am - 6:15 am",
            "5:30 am - 6 am",
            "5:30 am - 9 am",
            "5:30 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2013/01/25/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00333-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 709093911,
    "recordOffset": 709017934,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{127216=January 26 One lucky person will get the chance to set off fireworks at the Ashfield Reserve., 78658=Little Wise tell us what they get up to on the road., ahead of their show at The Front Gallery in February., 244973=1565 views, 239534=Total votes: 11548., 249448=Scroptional, Jan 24, 2013, 11:07PM, 263268=January 24 2013, 14303=JOHN COLLETT If the fearless forecasts of economists and analysts for 2013 prove correct, our sharemarket will hit 5000 points, interest rates will slide, and the Australian dollar will finally lose some heat., 103762=Start your training for Run Melbourne 2013, to be held on Sunday, July 21., 244106=1776 views, 81992=Unlikely heartthrob Ed Sheeran has been honing his musical skills in pubsof Nowheresville since 2005., 10050=Rocco Fazzari's take on a classic - Australia Day 2013., 126197=January 26 Australia Day in Perth goes beyond the Skyworks..., 250432=nick, Jan 24, 2013, 4:13PM}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: This documentary follows musician Dan Sultan and his fellow musicians in the Black Arm Band. Murundak: Songs of Freedom What's on TV Tonight One of Disney.Pixar’s most beloved films ever returns to the big screen. Win 'Monsters, Inc' prize packs Competition We've done the legwork to help you decide which shows to see. Line up your laughs Brisbane Comedy Festival Grand acts of spectacle and daring at the Concert Hall.",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD NTFL 2:31 am - 5:30 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane Sunrise Extra 5 am - 5:30 am Channel Nine Brisbane Nine's Early Morning News 5 am - 5:30 am Network TEN Brisbane Life Today with James Robison 5 am - 5:30 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:30 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane Seven Early News 5:30 am - 6 am Channel Nine Brisbane Today 5:30",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}