{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There is only one way to get into the dorm, and one way to get onto the school campus, both are monitered by guards at all times. NYC itself may be another matter, but I have never felt unsafe.",
            "None.",
            "Artistic. Open minded. Diverse.",
            "MMC is expensive in comparison to state schools, but if you compare it to the private schools around NYC it is actually a great bargain. The attention that you get from your professors and the opportunities that you get for internships and traveling make the price an even better value.",
            "There are lots of clubs and performances at the school, but, come on - it's New York City! There is so much to do here. We walk to Central Park, Times Square, and Rockefeller Center! We go to Saturday Night Live tapings, take the subway to Battery Park, shopping, Little Italy and Chinatown! It's never a dull moment here!",
            "There is a C store in the building which has frozen items, some pre made sandwiches, snacks and canned stuff. A lot of the cooking and meals we make ourselves in our room. Our dining dollars can be used for several restaurants in the area, which also deliver! At the school, there are several dining options, and a lot of choices for those with special dietary needs. Personally, I love the sushi - it is some of the best I have ever had, but only available 2 times a week. As one would expect, food is expensive.",
            "Our dorm is a mini-apartment, complete with a kitchen, 20 blocks from the school. We are living real life in NYC while attending college. I was matched with 3 amazing roommates and strangely we all get along and work together perfectly. The dorms are in a high rise apartment building, with its own security, so it is very safe. I love walking to school as I am a part of the city not just a campus.",
            "Classes are engaging, and many are taught by professionals in their field. Professors focus on real world knowledge and making connections to what they teach. They are always adding new classes to keep up with the demand from both their students, and the world.",
            "I think a visit is the best way to really get a feel for the college and its surroundings. There is an energy here that can't be relayed through the website.",
            "A small college in the big (and best) city! Small class sizes, great programs, and engaging teachers make this school a bargain. The city is our campus and there are so many opportunities, no matter what interests you have."
        ]
    ],
    "pageTitle": "Marymount Manhattan College (MMC) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Marymount-Manhattan-College/reviews?_escaped_fragment_=/show/62080",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00297-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907876199,
    "recordOffset": 907841304,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16829=The food plan is excellent and if used correctly, can last a student all year without having to add money! Although, if students do run out of dining dollars on his or her account, you CAN add money to it via the school's website, which is helpful toward the end of the year. The off-campus dining is fresh, healthy, and extensive in range of items to order. There is a location near the 55th Street dorms as well as within walking distance of the school itself and the 1760 dorm location. Both locations are clean and offer the option to dine in or order out, which is always beneficial if the weather is nasty., 137916=© 2015, Cappex.com, LLC, 17726=Living with strangers can be tricky. Most students are respectful and will understand living with up to six other people at 55th Street dorms or one or two others at the 1760 location has its challenges. There are also many rewards to living with others, including making new friends and having a support system away from home. Personally, I think the 55th Street dorms are worth every penny students pay to live in them. Having two bedrooms, a kitchenette, and a bathroom to share with a maximum of six other people as opposed to an entire floor of students is a perk that not many other colleges offer., 132547=I think the food is really good. There is a salad bar. There is vegan options and gluten free options. They have chefs cook the food for you so the food isn't sitting out all the time it's made fresh. You can get pizza, different wraps and sandwiches, different burgers, pasta. The food is pretty expensive though. There isn't a meal plan like other schools. You can get dining dollars up to like $2000 dollars to spend. If you don't have dining dollars you have to pay tax on the items. You can also use the dining dollars at the convenience store at the dorms. There is also a Starbucks in the school which is nice and you can use your dining dollars there too. There is also two different restaurants in the city that you can use your dining dollars too.}",
    "textBeforeTable": "01/09/2010 Reviewer is A current student here. 24 out of 27 people found this review useful. 1 of 30 Victoria from Paso Robles, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. Marymount Manhattan College Reviews Marymount Manhattan College › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck The only thing I don't like about Marymount is the fact that it is sooo expensive! And then they charge you for every little thing! It's not bad to the point that you want to leave, it's just annoying, especially for a financially struggling student as myself. Am enjoying being here The freshman dorms are a ten minute walk from times square, this school is fantastic. It helps that a lot of your first year classes are geared towards the city and gives you an opportunity to explore. It's not hard to navigate your way around, and there are always tours that different clubs host of certain areas of the city. I am involved with the MMC blog team, getting to tell prospective students the inside scoop on MMC from a students perspective! It's just an all-around great school for just about anyone. Am learning a lot I absolutely love the small class sizes because it allows for more one-on-one time between student and professor. Even though I am an acting major, I am being exposed to subjects outside of acting like stagecraft and economics, they really make sure you are equipped as a functioning member of society, that's the point of a liberal arts college,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}