{
    "relation": [
        [
            "First Name",
            "Brittany",
            "Jeremy",
            "Chandler",
            "Michael",
            "Jan"
        ],
        [
            "Last Name",
            "Jablonsky",
            "Peters",
            "Goule",
            "Stranz",
            "Ahlen"
        ],
        [
            "Suffix",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "staff:Rep.Pomeroy",
            "staff:H.Ag.Comte.,Reps.Peterson,Tanner,Stenholm",
            "",
            "staff: Rep. Price"
        ],
        [
            "New",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=BB49DE21-1EC0-4077-AB8A-24DD7F945325&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00034-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 217277039,
    "recordOffset": 217260972,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{24642=Agriculture/food-related provisions of: H.R.1, 2011 Full-Year Continuing Appropriations Act. H.J.RES.43, to make further continuing appropriations for FY 2011. H.J.RES.44, further continuing appropriations amendments, 2011. H.J.RES. 48, additional continuing appropriations amendments, 2011. H.R.2219, Agriculture, Rural Development, Food & Drug Administration and Related Agencies Approp. Act H.R.1363, further additional continuing appropriations amendments, 2011. Issues other than legislation: Emergency economic assistance for farmers and ranchers Funding for USDA programs Appropriations and budget requests for USDA/other agencies with an ag-related mission or responsibility., 76537=Agriculture/food-related provisions of: H.R.4, Comprehensive 1099 Taxpayer Protection and Repayment of Exchange Subsidy Overpayments Act. H.R.60, repeals info reporting requirement expansion for $600 and larger payments to corporations. H.R.144, Small Business Paperwork Mandate Elimination Act of 2011. H.R.584, repeals information reporting requirements added by Patient Protection and Affordable Care Act. H.R.705, Comprehensive 1099 Taxpayer Protection and Repayment of Exchange Subsidy Overpayments Act. H.R.1075, Volumetric Ethanol Excise Tax Credit Repeal Act. H.R.1188, Repeal Ethanol Subsidies Act of 2011. S.18, Small Business Paperwork Mandate Elimination Act. S.359, Comprehensive 1099 Taxpayer Protection and Repayment of Exchange Subsidy Overpayments Act. S.844, Domestic Energy Promotion Act of 2011. S.871, Ethanol Subsidy and Tariff Repeal Act. S.1185, Ethanol Reform and Deficit Reduction Act. S.1291, to amend the 1986 Internal Revenue Code to give a renewable electricity integration credit. Issues other than legislation: Targeted tax reductions. Tax exemption for farmland sold with residence. Tax credits for state and local property taxes. Federal estate tax reform. Tax deductibility of insurance premiums. Tax credits for renewable energy. Tax credits for small businesses., 19318=Agriculture/food-related provisions of: H.R.874, introduce 2011 Agricultural Credit Expansion Act. H.R.1233, to amend Consolidated Farm and Rural Development Act to suspend an eligibility limitation period. S.368, to amend Consolidated Farm and Rural Development Act to suspend an eligibility limitation period. H.R.1422, to amend 2002 Farm Security and Rural investment Act. S.805, Rural Access to Credit Act of 2011. Issues other than legislation: Bankruptcy, Agriculture credit, small business credit., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 82546=Agriculture/food-related provisions of: S.49, railroad Antitrust Enforcement Act of 2011. Issues other than legislation: Impact of rail mergers and concentration in the industry. Discriminatory rail rates for captive shippers. Construction, maintenance and improvement to the inland waterway and port system. Farm-to-market transportation., 87756=Agriculture/food-related provisions of: H.R.639, Currency Reform for fair Trade Act. H.R.833, Agricultural Export Enhancement Act of 2011. S.328, Currency Reform for fair Trade Act. H.R.1887, Free Trade with Cuba Act. H.R. 1888, Promoting American Agricultural and Medical Exports to Cuba Act of 2011. H.R.2073, Country-of-Origin-Labeling for Fuels Act. Issues other than legislation: Trade (domestic/foreign) Agricultural trade issues for the World Trade Organization. Revisions to U.S. sanctions policy. Export licensing requirements for agricultural sales. Implementation of Trade Adjustment Assistance to agricultural producers. Impact of domestic agricultural policy on trade agreements. Inclusion of labor and environmental standards in agricultural trade negotiations. International food assistance. Mechanisms to address impact of exchange rate fluctuations on trade. Implementation of Byrd Amendment. Agricultural imports. Harmonization of environmental regulations. Bilateral and regional trade negotiations and agreements. Currency misalignment Country-of-origin labeling of fuels, 35016=Agriculture/food-related provisions of: H.R.1083, Rural Broadband Initiative Act. S.518, Veterinary Medicine Loan Repayment Program Enhancement Act. S.946, Office of Rural Education Policy Act. S.1053, Veterinary Services Investment Act. Issues other than legislation: Rural education grant funding. Education technology. Rural schools. Telecommunications. Public-funded research. Loan repayment for veterinarians, 40163=Agriculture/food-related provisions of: H.R.271, to establish loans for conversion to use of biomass for energy generation. H.R.404, Renewable Fuels for America's Future Act of 2011. H.R.851, Clean Energy Jobs Act of 2011. H.R.910, Energy Tax Prevention Act of 2011. S.4, Make America the Worlds Leader in Clean Energy Act. S.187, Biofuels Market Expansion Act of 2011. S.520, Volumetric Ethanol Excise Tax Credit Repeal Act. S.530, to modify certain subsidies for ethanol production, and for other purposes. S.559, Securing Americas Future with Energy and Sustainable Technologies Act. H.R.2354, appropriate for energy, water development and related agencies for FY 2012. S.718, to amend the Federal Insecticide, Fungicide and Rodenticide Act to improve use of certain pesticides. S.1085, to amend the Clean Air Act regarding biofuel and corn ethanol portions of the renewable fuel standard. Issues other than legislation: Environmental/Superfund Implications of global warming treaty. Biotechnology and genetically modified organisms. Conservation Incentives. National energy policy. Renewable energy. Regulation of Concentrated Animal Feeding Operations and Animal Feeding Operations. Water resource issues. Agricultural chemicals. Fuel storage. Endangered species. Fisheries management, 46305=Agriculture/food-related provisions of: H.R. White House Conference on Food and Nutrition Act. S.831,Dairy COOL Act of 2011. Issues other than legislation: Implementation of country-of-origin labeling program. Establishment of national organic food and food production standards. Food Safety. Implementation of the Food Quality Protection Act. Domestic Food Assistance and hunger. Food stamps and domestic Nutrition Programs., 12285=Agriculture/food-related provisions of: H.R.87, to repeal Dodd-Frank Wall Street Reform and Consumer Act. H.R.307, introduce Seed Availability and Competition Act of 2011. S.712, to repeal Dodd-Frank Wall Street Reform and Consumer Act. S.RES.87, to designate 2012 as the International Year of Cooperatives. H.R.1573, to implement title VII of Dodd-Frnak Wall Street Reform and Consumer Protection Act S.1026, Livestock Marketing Fairness Act S.1157, Foodborne Illness Reduction Act of 2011 Issues other than legislation: Farm Service Agency personnel levels. USDA agricultural credit availability. Reform of the Federal Milk Marketing Order. Establishment of a farmer-owned grain reserve. Distribution of farm program benefits. Expansion and improvement of Federal Crop Insurance programs. Review of Packers and Stockyards Act effectiveness in enhancing competitive practices in the livestock industry. Mandatory livestock price reporting. Contract production of agricultural commodities. Long-term domestic agricultural policy. Commodity loan rate adjustments. Facility loan programs for commodity storage. Natural disaster assistance for farmers and ranchers. Regulations of the agriculture futures industry. Farm bill implementation. Indemnity payments to dairy producers. Agricultural conservation programs. Funding and implementation of rural development programs. Funding for farmer-owned cooperatives. Balancing supply and demand. Natural resources. Real estate, land use, public lands, conservation. Small business. Agroterrorism. Grain standards, reauthorization. Veterinary sciences.}",
    "textBeforeTable": "",
    "textAfterTable": "State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  LINDA D. KENDALL  2023143105  lkendall@nfudc.org 5. Senate ID#  14187-12 7. Client Name Self Check if client is a state or local government or instrumentality  FARMERS EDUCATIONAL COOPERATIVE UNION OF AMERICA 6. House ID#  333050000 TYPE OF REPORT 8. Year  2011 Q1 (1/1 - 3/31)",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}