{
    "relation": [
        [
            "Currency Code",
            "USD",
            "INR"
        ],
        [
            "Format Mask",
            "9G999D99",
            "9G99G99G999D99"
        ]
    ],
    "pageTitle": "Creating RTF Templates",
    "title": "",
    "url": "https://docs.oracle.com/cd/E28280_01/bi.1111/e22254/create_rtf_tmpl.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 872474851,
    "recordOffset": 872387743,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{24684=Section 4.23, \"Guidelines for Designing RTF Templates for Microsoft Excel 2007 Output\"}",
    "TableContextTimeStampAfterTable": "{361490=You could also access all the CD tittles released in 1988 using the following:, 315301=Friday, December 31, 1999, 319366=Enter the format-currency command in the RTF template to apply the format to the field at runtime, as described in Section 4.15.15, \"Applying a Currency Format to a Field.\", 315059=Dec 31, 1999, 168200=The \"if\" statement is testing if the debit value is greater than 1000. If it is, then the next lines are invoked. Notice that the example embeds native XSL code inside the \"if\" statement., 316602=Dec 31, 1999 6:15 PM GMT, 379340=This section describes report features specific to designing RTF templates for Excel 2007 output (.xlsx). It includes the following topics:, 69792=Microsoft Word 2000 Users: After you add the background map and overlay the shape group, use the Grouping dialog to make the entire composition one group., 270372=To use the Oracle format mask or the Microsoft format mask, the numbers in the data source must be in a raw format, with no formatting applied (for example: 1000.00). If the number has been formatted for European countries (for example: 1.000,00) then the format does not work., 107098=http://myserver.domain:8888/CustomerReport/cstid=1234, 382648=For Excel 2007 output format, BI Publisher does not apply any formatting for number and date. BI Publisher saves the formatting mask and the actual value (date or number) into the XLSX output file. The formatting is handled by Microsoft Excel. For example:, 303141=Century. For example, 2002 returns 21; 2000 returns 20., 1127=1-Jan-2004, 208556=2000, 88895=Section 4.9.10, \"Repeat Row Headers After Page Break\", 359519=The pipe (|) is equal to the logical OR operator. In addition, XPath recognizes the logical OR and AND, as well as the equality operators: <=, <, >, >=, ==, and !=. For example, you can find all CDs released in 1985 or later using the following expression:, 281153=Digit. Each explicitly set 0 appears, if no other number occupies the position. Example: Format mask: 00.0000 Data: 1.234 Display: 01.2340, 273910=Display: 01.2340, 283080=Determines the placement of the grouping (thousands) separator. The grouping separator symbol used is determined at runtime based on template locale. For example: Format mask: 9G999D99 Data: 1234.56 Display for English locale: 1,234.56 Display for German locale: 1.234,56, 188511=format - The Oracle number format to apply to the value at runtime. This property is optional, but if you want to supply a format mask, you must use the Oracle format mask. For more information, see Section 4.15.12, \"Oracle Abstract Format Masks.\", 135827=For example, the following statement tests the AMOUNT element value. If the value is greater than 1000, show the word \"Higher\"; if it is less than 1000, show the word \"Lower\"; if it is equal to 1000, show \"Equal\":, 374770=The following chart types can be rendered as native PowerPoint charts in PowerPoint2007 output:, 166987=This field holds the code to highlight the cell red if the credit amount is greater than 1000., 67492=The shape-size command is used to stretch or shrink the cylinder based on the values of the elements SOFTWARE, HARDWARE, and SERVICES. The value is divided by 1000 to set the stretch or shrink factor. For example, if the value is 2000, divide that by 1000 to get a factor of 2. The shape generates as twice its current height., 363585=For more information on XSL-FO see the W3C Website at http://www.w3.org/2002/08/XSLFOsummary.html, 315562=12/31/99 6:15 PM, 184523=1-Jan-2005, 383151=If the Microsoft Windows Region and Language of the client computer is set to French (France), then the numbers and dates in the same Excel 2007 output file are formatted in fr-FR locale., 165994=This field holds the code to highlight the cell red if the debit amount is greater than 1000., 70003=Microsoft Word 2002/3 Users: These versions of Word have an option under Tools > Options, General tab to \"Automatically generate drawing canvas when inserting autoshapes\". Using this option removes the need to do the final grouping of the map and shapes. You can now generate a visually appealing output for the report as seen in Figure 4-27., 315815=Dec 31, 1999 6:15 PM, 287053=2005-01-01T09:30:10-07:00, 382935=If the Microsoft Windows Region and Language of the client computer is set to English (United States), then the numbers and dates are formatted in en-US locale in the Excel 2007 output file., 316070=Friday, December 31, 1999 6:15 PM, 2166=1000.00, 287092=The data after the \"T\" is optional, therefore the following date: 2005-01-01 can be formatted using either date formatting option., 316342=12/31/99 6:15 PM GMT, 300912=Excel2007 output (.xlsx) does not support the following format masks: E, EE, W, WW, X, XX. If you use these in an RTF template and generate Excel2007 output, the date with any of these formats will not be viewable. Some combinations of these format masks may result in an error when the Excel2007 (.xlsx) output is opened., 374462=BI Publisher supports native PowerPoint charts for certain chart types rendered in PowerPoint2007 output. When the chart is inserted as a native chart, you can modify it in PowerPoint. If the chart is not inserted as a native chart, then BI Publisher inserts a PNG image that cannot be updated., 129306=For information about using the Template Builder to insert conditional regions and conditional formatting, see Section 5.4.9, \"Inserting and Editing Conditional Regions\" and Section 5.4.10, \"Inserting Conditional Formatting.\", 282327=Determines the placement of the decimal separator. The decimal separator symbol used is determined at runtime based on template locale. For example: Format mask: 9G999D99 Data: 1234.56 Display for English locale: 1,234.56 Display for German locale: 1.234,56, 172304=Oracle-number-format is the format you want to use to for the display, using the Oracle format mask (for example: 'C9G999D00'). For the list of Oracle format mask symbols, see Section 4.15.12, \"Oracle Abstract Format Masks.\", 268981=Section 4.15.14, \"Formatting Currencies\", 274888=Data: 1234.56, 287314=If the time component and time zone offset are not included in the XML source date, then BI Publisher assumes it represents 12:00 AM UTC (that is, yyyy-mm-ddT00:00:00-00:00)., 382016=To generate a sheet name that shows the YEAR and STATE from the data (for example, \"2005 ID\") enter the following in a BI Publisher field in your template:, 312194=If you do not want to specify a format mask with either the MS method or the Oracle method, you can omit the mask definition and use the default format mask. The default format mask is the MEDIUM abstract format mask from Oracle. (See Section 4.15.12, \"Oracle Abstract Format Masks\" for the definition.), 375657=Note that when Enable PPTX native chart support is set to false, all charts are rendered as images in PowerPoint2007 output. Therefore, set this option to false only when a report includes the non-native chart types., 383370=Note also that Microsoft Excel 2007 output does not support some Oracle format masks. See Section 4.15.6, \"Using the Oracle Format Mask\" for more information., 316866=Friday, December 31, 1999 6:15 PM GMT, 362787=<?namespace:fsg=http://www.example.com/fsg/2002-30-20/?>, 288172=If you do not specify the mask in the Date format field, then the abstract format mask \"MEDIUM\" is used as default. See Section 4.15.12, \"Oracle Abstract Format Masks\" for the description., 163326=The template lists the accounts and their credit and debit values. The final report will highlight in red any cell whose value is greater than 1000. The template for this is shown in figure Figure 4-52:}",
    "lastModified": "Wed, 14 Jan 2015 14:06:12 GMT",
    "textBeforeTable": "Table 4-26 display multiple currency formats Table 4-26 provides an example that assumes you have set up the various currency formats in the report properties. 4.15.16 Example: Displaying Multiple Currency Formats in a Report displaySymbolOrNot takes one of the following values as shown in single quotes: 'true' or 'false'. When set to 'true', the currency symbol is displayed in the report based on the value for CurrencyCode. If you do not want the currency symbol to be displayed, then you can either enter 'false' or simply do not specify the parameter. At runtime, the Amount_Field is formatted according to the format you set up for the currency code in the report properties. To set the value dynamically, enter the tag name of the XML element that holds the ISO currency code. Note that an element that contains the currency code must be present in the data. CurrencyCode can either be set to a static value or it can be set dynamically. If the value is static for the report, then enter the ISO three-letter currency code in single-quotes, for example, 'USD'. Amount_Field takes the tag name of the XML element that holds the amount value in the data. where <?format-currency:Amount_Field;CurrencyCode;displaySymbolOrNot?>  The parameters for the format-currency function are as follows: 4.15.15 Applying a Currency Format to a Field",
    "textAfterTable": "In this example, you need not set the currency code dynamically. You have the following elements in the XML data:  <TOTAL_SALES> <US_SALES>8596526459.56</US_SALES> <INDIA_SALES>60000000</INDIA_SALES> </TOTAL_SALES> You want to display these two total fields in the template. For US_SALES, the syntax in the BI Publisher properties field is as follows:  <?format-currency:US_SALES;'USD'?> Figure 4-73 shows the two fields in a template with the BI Publisher Properties dialog displaying the entry for INDIA_SALES; Figure 4-73 Properties to Display Sales Description of \"Figure 4-73 Properties to Display Sales\" At runtime, the fields are displayed as shown in Figure 4-74. Figure 4-74 Displaying Sales Fields Description of \"Figure 4-74 Displaying Sales Fields\" 4.15.17 Example: Displaying Multiple Currency Codes in a Single Report The following simple XML code includes an element that contains the Amount (Trans_amount) and an element that contains the ISO currency code (Cur_Code):  <ROW> <Trans_Amount>123</Trans_Amount> <Cur_Code>USD</Cur_Code> </ROW> <ROW> <Trans_Amount>-456</Trans_Amount> <Cur_Code>GBP</Cur_Code> </ROW> <ROW> <Trans_Amount>748</Trans_Amount> <Cur_Code>EUR</Cur_Code> </ROW> <ROW> <Trans_Amount>-987</Trans_Amount> <Cur_Code>JPY</Cur_Code> </ROW> To display each of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}