{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6"
        ],
        [
            "RxCUI",
            "198191",
            "198191",
            "198191",
            "198193",
            "198193",
            "198193"
        ],
        [
            "RxNorm NAME",
            "ranitidine 150 MG Oral Tablet",
            "Ranitidine 150 MG Oral Tablet",
            "ranitidine 150 MG (as ranitidine hydrochloride 168 MG) Oral Tablet",
            "ranitidine 300 MG Oral Tablet",
            "Ranitidine 300 MG Oral Tablet",
            "ranitidine 300 MG (as ranitidine hydrochloride 336 MG) Oral Tablet"
        ],
        [
            "RxTTY",
            "PSN",
            "SCD",
            "SY",
            "PSN",
            "SCD",
            "SY"
        ]
    ],
    "pageTitle": "DailyMed - RANITIDINE - ranitidine hydrochloride tablet",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=d5962f4c-1cbc-4034-b171-9a35fc75b546",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00108-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 56461935,
    "recordOffset": 56431760,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1549=Glasgow, KY 42141, 1693=Hauppauge, NY 11788, 1512=Rev. 11-2009}",
    "textBeforeTable": "Number of versions: 2 RANITIDINE - ranitidine hydrochloride tablet View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close relabel(16590-200, 16590-381) , repack(16590-200, 16590-381) 786036330 STAT Rx USA LLC Business Operations ID/FEI Address Name Establishment Registrant - PSS World Medical Inc. (101822682) Labeler - STAT Rx USA LLC (786036330) 12/16/2009 ANDA077824 ANDA",
    "textAfterTable": "2 198191 Ranitidine 150 MG Oral Tablet SCD 3 198191 ranitidine 150 MG (as ranitidine hydrochloride 168 MG) Oral Tablet SY 4 198193 ranitidine 300 MG Oral Tablet PSN 5 198193 Ranitidine 300 MG Oral Tablet SCD 6 198193 ranitidine 300 MG (as ranitidine hydrochloride 336 MG) Oral Tablet SY Get Label RSS Feed for this Drug RANITIDINE - ranitidine hydrochloride tablet To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=d5962f4c-1cbc-4034-b171-9a35fc75b546 To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To view updated drug label links, paste the RSS feed address (URL) shown below into a RSS reader, or use a browser which supports RSS feeds, such as Safari for Mac OS X. How to discontinue the RSS feed If you no longer wish to have this DailyMed RSS",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}