{
    "relation": [
        [
            "File name",
            "Msmdredir.dll",
            "Msmdsrv.rll",
            "Sqlbrowser.exe"
        ],
        [
            "File version",
            "10.0.2850.0",
            "10.0.2850.0",
            "2007.100.2850.0"
        ],
        [
            "File size",
            "6,210,912",
            "668,000",
            "254,816"
        ],
        [
            "Date",
            "03-Sep-2011",
            "03-Sep-2011",
            "03-Sep-2011"
        ],
        [
            "Time",
            "14:52",
            "14:15",
            "14:55"
        ],
        [
            "Platform",
            "x86",
            "x86",
            "x86"
        ]
    ],
    "pageTitle": "Cumulative update package 16 for SQL Server 2008 Service Pack 1",
    "title": "",
    "url": "https://support.microsoft.com/en-us/kb/2582282",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 888650931,
    "recordOffset": 888599988,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Expand this table Collapse this table For more information about the SQL Server issues, click the following article numbers to view the articles in the Microsoft Knowledge Base. Microsoft Knowledge Base articles that discuss these hotfixes will be released as they become available. Give Feedback | Back to the top loadTOCNode(2, 'moreinformation'); A supported cumulative update package is now available from Microsoft. However, it is intended to correct",
    "textAfterTable": "(https://support.microsoft.com/kb/2583994/ ) FIX: SSIS Checkpoint restores incorrect variable value for an Execute SQL Task item of a For Loop Container item in SSIS 2008 if the SSIS package fails or stops and then execute again 764985 2591461 (https://support.microsoft.com/kb/2591461/ ) FIX: \"Unexpected error from SE OLEDB interface\" error when you run a full-text search query in SQL Server 2008 788347 2598903 (https://support.microsoft.com/kb/2598903/ ) FIX: SQL Server Agent job randomly stops when you schedule the job to run past midnight on specific days in SQL Server 2005 or in SQL Server 2008 790847 2606301 (https://support.microsoft.com/kb/2606301/ ) FIX: High memory usage when you run Replication Snapshot Agent in Microsoft SQL Server 2008 Cumulative update package information Restart information You might have to restart the computer after you apply this cumulative update package. Registry information To use one of the hotfixes in this package, you do not have to make any changes to the registry. Back to the top | Give Feedback",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}