{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Sequence No.",
            "GSAR Case",
            "Docket No.",
            "GSAR Change"
        ],
        [
            "regulations.gov",
            "2014-25158",
            "3090-AJ47",
            "1",
            "2014-G501",
            "2014-0007",
            "59"
        ]
    ],
    "pageTitle": "48 CFR Part 552, Subpart 552.2 - Text of Provisions and Clauses | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/48/part-552/subpart-552.2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00254-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910977095,
    "recordOffset": 910960081,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1098=Title 48 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{21196=Title 48 published on 2014-10-01, 63910=The General Services Administration (GSA) issued a proposed rule on September 10, 2014, amending the General Services Administration Acquisition Regulation (GSAR) to clarify and update the contracting by negotiation GSAR section and incorporate existing Federal Supply Schedule Contracting policies and procedures, and corresponding provisions and clauses. The comment period is being extended to provide additional time for interested parties to provide comments for GSAR Case 2013-G502, Federal Supply Schedule Contracting (Administrative Changes), to November 21, 2014., 41221=The General Services Administration (GSA) issued a proposed rule on March 4, 2015, amending the General Services Administration Acquisition Regulation (GSAR) to include clauses that would require vendors to report transactional data from orders and prices paid by ordering activities. This includes orders placed against both Federal Supply Schedule (FSS) contract vehicles and GSA's non-FSS contract vehicles—Government-wide Acquisition Contracts (GWACs) and Government-wide Indefinite-Delivery, Indefinite-Quality (IDIQ) contracts. For FSS vehicles, the clause would be introduced in phases, beginning with a pilot for select products and commoditized services. The new clause will be paired with changes to the basis of award monitoring requirement of the existing price reductions clause, resulting in a burden reduction for participating FSS contractors. This rulemaking does not apply to the Department of Veterans Affairs (VA) FSS contract holders. The comment period is being extended to provide additional time for interested parties to provide comments for GSAR Case 2013-G504, Transactional Data Reporting, to May 11, 2015.}",
    "lastModified": "Tue, 07 Jul 2015 19:02:20 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 36248 - General Services Administration Acquisition Regulation; GSAR Case 2006-G506; Environmental, Conservation, Occupational Safety and Drug-Free Workplace 2015-06-24; vol. 80 # 121 - Wednesday, June 24, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 48. Title 48 published on 2014-10-01. § 552.270-32 — Covenant Against Contingent Fees. § 552.270-31 — Prompt Payment. § 552.270-30 — Price Adjustment for Illegal or Improper Activity. § 552.270-29 — Acceptance of Space. § 552.270-28 — Mutuality of Obligation. § 552.270-27 — Integrated Agreement. § 552.270-26 — No Waiver. §",
    "textAfterTable": "GENERAL SERVICES ADMINISTRATION, Office of Acquisition Policy Final rule. Effective: June 24, 2015. 48 CFR Parts 523 and 552 Summary The General Services Administration (GSA) is issuing a final rule to amend the General Services Administration Acquisition Regulation (GSAR) to update the text and clauses regarding Hazardous Materials Identification and Material Safety Data. 2015-05-20; vol. 80 # 97 - Wednesday, May 20, 2015 80 FR 28849 - General Services Administration Acquisition Regulation (GSAR); Unique Item Identification (UID) GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-12208 RIN 3090-AJ53 Sequence No. 1 GSAR Case 2014-G504 Docket No. 2015-0003 GSAR Change 63",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}