{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are secruity guards posted 24/7 on campus and off campus (University Center). Very quiet campus so far.",
            "There is Greek life on campus. If you go to the schools website you will find a lost of Greek organizations available",
            "So far since the semester just started there hasn't been much to do, but there are a ton of organizations and clubs to join. On the schools website there are a list of clubs available for students.",
            "So far I haven't been to any activities that the school has planned. The student center each month has a calendar of daily or weekly activities posted that you can take with you to see what's new and happening on campus.",
            "Food and dining is pretty much the basics. You do have an ID card that allows you to purchase food from select fast food restaurants nearby the school, only if you register the card, and make sure that you have the available funds. The Deacons Den which is located on campus is a pretty decent. The ID card should also work here.",
            "Depending on what grade level you are in you would be either in an apartment which did seem cool at first but you still would still have a roommate living with you. The University Center is one example of the off campus apartments but still considered part of housing. There is a fridge, microwave, stove, oven, and did washer. A little living room area and two rooms. In each room there is two people living inside the rooms. And each room has there own bathroom. It's still a very nice apartment but if you're looking for a single you will have to pay more.",
            "I have just began this semester as a transfer student. I am a nursing major abs hopefully will get into the program by next Fall. The courses seems fairly easy somewhat. I haven't been here long enough to explain the handful of teachers that I've had. The ones I do have seem friendly correspondent to your needs and are willing to help anytime.",
            "Make sure you exhausted all opportunities for scholarships and grants. The scholarships and grants that the school provides will never be enough for the tuition. Also be sure to fill out fasfa early, once your financial aid is covered you can begin your semester stress free. A car is needed around this area, some places are walking distance but it's best to have a car especially because of the many highways.",
            "It's a very small and intimate school. Classroom sizes and reasonable and so are the dormitories. It's a private college so it is expensive."
        ]
    ],
    "pageTitle": "Bloomfield College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Bloomfield-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00315-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901412127,
    "recordOffset": 901384562,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{83256=Bloomfield college is courteous, kind, and helpful. I enjoy being in the class of 2017 here, I know I will enjoy my stay here, in due time this place will forever hold a memory., 110980=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/07/2009 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 30 Ashley from Camden, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. Bloomfield College Reviews Bloomfield College › New Jersey › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Tips for prospective students If you want a party school there are many out there, but if you want to get your education and focus on your career and have fun while doing so then there is Bloomfield College. There is no harsh transition from high school to college and you dont have to worry about the people around campus they are all friendly and helpful. Take advantage of everything the school has to offer and enjoy. Bang for the buck Bloomfield College is expensive because it private but i believe that all tuition that's paid is being focused and distributed to get the best qualified teachers that not only teach but inspire Am enjoying being here I enjoy the facility itself because it has a commuters lounge and its location is at downtown Bloomfield and you have stores surrounding the school and the dorms are around the school buildings, therefore you can easily hang-out with your friends that dorm or you can walk to library or Gym; everything is a walking distance. Am learning a lot I am definitely learning a lot and this school has a good student to teacher ratio which is like 20 students to a teacher. Tutoring",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}