{
    "relation": [
        [
            "Box",
            "23",
            "23",
            "23",
            "23",
            "23",
            "23",
            "23",
            "23",
            "23",
            "23",
            "23",
            "23",
            "23",
            "23",
            "23",
            "23",
            "23",
            "23",
            "23"
        ],
        [
            "Folder",
            "1",
            "2",
            "3-5",
            "6",
            "7",
            "8-9",
            "10-11",
            "12",
            "13",
            "14-15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24-27"
        ],
        [
            "",
            "Hayes, David, circa 1968, 1989-1994",
            "Hayes, John, 1994",
            "Hayman, Chris, 1970-1978, 1986 Oversized material housed in OV 58",
            "Heany, David, 1973-1974",
            "Hefferton, Philip, 1969-1990",
            "Heikoop, Govert, 1994-1996",
            "Heilmann, Mary, 1972-1976, 1989-1992",
            "Helander Gallery, 1990-1991",
            "Henderson, Gil, circa 1974",
            "Henderson, Jim, 1986-1991",
            "Henderson, Mary, 1977",
            "Hendricks, Ed, 1978-1981",
            "Hendricks, James, 1970",
            "Henri, 1951, 1953, circa 1980s",
            "Henry, Charles, 1969-1976",
            "Henry, Mary, circa 1970",
            "Henschel, David, 1977-1978",
            "Hepworth, Barbara, 1968, 1975",
            "Herbert, Mimi, 1969-1982, 1991"
        ]
    ],
    "pageTitle": "Detailed description of the Henri Gallery records, circa early 1900s, 1940-1996, bulk 1957-1995 | Archives of American Art, Smithsonian Institution",
    "title": "",
    "url": "http://www.aaa.si.edu/collections/henri-gallery-records-7730/more",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00312-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 263440231,
    "recordOffset": 263398739,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3182=Henri donated the Henri Gallery records in three accessions between 1980 - 1981. Henri's daughter, Helen Schnoebelen donated additional records in 1996., 5872=The bulk of Printed Materials are newspaper clippings regarding artists, exhibitions, and Henri Gallery. There are also 114 posters dating from 1959-1979 from Henri Gallery exhibitions and other galleries' exhibitions of artists in which the Henri Gallery represented., 7704=The records of Henri Gallery, a Washington, D.C. gallery which showed painters from the Washington Color School and emerging artists, measure 54.6 linear feet and date from circa early 1900s, 1940 to 1996, with the bulk of the materials dating from 1957 to 1995. The gallery's relationship with artists and clients, exhibitions, sales, and other business is documented in alphabetical files containing a wide variety of materials, including correspondence, sales records, printed materials, photographs and slides. Additional correspondence, newspaper clippings, 114 exhibition posters, scattered drawings, illustrated cards, and photographic materials are also found in the collection., 8622=In the 1960s, Henri showed painters Gene Davis, Thomas Downing, and Howard Mehring of the Washington Color School. In the summer of 1967, Henri Gallery moved to 1500 21st Street NW, closer to the Dupont Circle art galleries in Washington, D.C. Henri showed many young and emerging artists, including Cynthia Bickley-Green, William Christenberry, Mary Beth Edelson, Ed McGowin, and Robert Stackhouse. In 1970, Henri opened a second location, Henri 2, at 1875 Connecticut Ave. NW to exhibit large scale works. In 1972, Henri 2 held Martin Puryear's first solo exhibition in the United States. Henri passed away in 1996 and both gallery locations closed shortly thereafter., 8962=In 1957, Henrietta Ehrsam, known as \"Henri,\" opened her eponymous gallery on South Royal Street in Alexandria, Virginia. Earlier, Henri and her partner Florie King had sold clothing, antiques, accessories and decorative arts alongside works of art at their consignment shop \"Not New\" in the same location., 2966=The collection was processed to a minimal level and a finding aid prepared by Sarah Haug in 2012, with funding provided by the Smithsonian Institution Collections Care Preservation Fund., 1278=Henri Gallery records, circa early 1900s, 1940-1996, bulk 1957-1995. Archives of American Art, Smithsonian Institution., 287=The folders are arranged chronologically by year; correspondence prior to 1981 is also arranged chronologically by month and day. Unsorted and undated materials, handmade and illustrated correspondence, and other miscellaneous materials are filed at the end of the series., 6735=The bulk of the records consist of Alphabetical Files contains materials regarding artists, clients, exhibitions, galleries, museums, and various subjects of interest, originally arranged alphabetically by folder title. Folders range in quantity and variety of materials, including correspondence, printed materials, photographs, sales and consignment records, resumes, price lists, and exhibition records. There are especially rich or extensive files for Darryl Abraham, Harry Anderson, Cynthia Bickley-Green, Robert Clements, Mary Beth Edelson, Leslie Exton, Colin Greenly, Mimi Herbert, Traute Ishida, Kiki Kogelnik, Ida Kohlmeyer, Ed McGowin, Tom Nakashima, Graeme Outerbridge, Martin Puryear, Italo Scanga, Robert Stackhouse, Philip Van Brunt, and May Wilson. Of interest is the complete series of Eleanor Antin's 100 Boots postcards.}",
    "TableContextTimeStampAfterTable": "{5081=The quantity and variety of the materials in each folder varies widely. There are especially rich or extensive files for Darryl Abraham, Harry Anderson, Cynthia Bickley-Green, Robert Clements, Mary Beth Edelson, Leslie Exton, Colin Greenly, Mimi Herbert, Traute Ishida, Kiki Kogelnik, Ida Kohlmeyer, Ed McGowin, Tom Nakashima, Graeme Outerbridge, Martin Puryear, Italo Scanga, Robert Stackhouse, Philip Van Brunt, and May Wilson. Of interest is the complete series of Eleanor Antin's 100 Boots postcards., 311357=Copyright (c) 2015 Archives of American Art   |   Smithsonian Institution   |   Privacy   |   Terms of Use   |   Contact Us       }",
    "textBeforeTable": "The folders are arranged chronologically by year; correspondence prior to 1981 is also arranged chronologically by month and day. Unsorted and undated materials, handmade and illustrated correspondence, and other miscellaneous materials are filed at the end of the series. General Correspondence includes incoming business and personal correspondence with artists, clients, galleries, and museums, regarding artwork, exhibitions, and other business issues. Also found here are holiday cards, handmade cards, illustrated correspondence, miscellaneous financial correspondence and sales records, scattered photographic materials, and various interfiled exhibition printed materials. 2.5 Linear feet; Boxes 1-3, 55-56 General Correspondence, 1949-1996 Series 1: Detailed Description and Container Inventory Return to top Henri Gallery records, circa early 1900s, 1940-1996, bulk 1957-1995. Archives of American Art, Smithsonian Institution. How to Cite this Collection The Henri Gallery records are owned by the Archives of American Art, Smithsonian Institution. Literary rights as possessed by the donor have been dedicated to public use for research, study, and scholarship. The collection is subject to all copyright laws. Ownership & Literary Rights Use of original papers requires an appointment. Restrictions on Use How to Use the Collection Materials with Social Security numbers were redacted with copies left in the collection. The original documents are maintained separately. The Archives of American Art has implemented minimal processing tactics when possible in order to increase access to more of our",
    "textAfterTable": "Series 2: Alphabetical Files, 1947-1996 50.1 Linear feet; Boxes 3-52, 55-57, OV 58 Alphabetical Files contains materials regarding artists, clients, exhibitions, galleries, museums, and various subjects of interest, originally arranged alphabetically by folder title. This series is arranged as 2 subseries. 2.1: Name Files, 1947-1996 2.2: Subject Files, circa 1948-1996 2.1: Name Files, 1947-1996 Name Files contains correspondence with artists, clients, galleries, and museums; business and financial records; exhibition printed materials; newspaper clippings; photographic materials; price lists; research files for artists; resumes; sales and consignments receipts; and scattered artwork. The quantity and variety of the materials in each folder varies widely. There are especially rich or extensive files for Darryl Abraham, Harry Anderson, Cynthia Bickley-Green, Robert Clements, Mary Beth Edelson, Leslie Exton, Colin Greenly, Mimi Herbert, Traute Ishida, Kiki Kogelnik, Ida Kohlmeyer, Ed McGowin, Tom Nakashima, Graeme Outerbridge, Martin Puryear, Italo Scanga, Robert Stackhouse, Philip Van Brunt, and May Wilson. Of interest is the complete series of Eleanor Antin's 100 Boots postcards. Folders are arranged alphabetically by name. Unsorted materials are filed at the end of the subseries. Box Folder 3 12 A Clean Well Lighted Place, 1970 3 13 Abe, N., circa 1957-1981 3 14-19",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}