{
    "relation": [
        [
            "Patent application number",
            "20090102709",
            "20090109088",
            "20090128403",
            "20120249367"
        ],
        [
            "Description",
            "SATELLITE-BASED POSITIONING SYSTEM IMPROVEMENT - A method, device and system for determining a receiver location using weak signal satellite transmissions. The invention involves a sequence of exchanges between an aiding source and a receiver that serve to provide aiding information to the receiver so that the receiver's location may be determined in the presence of weak satellite transmissions. With the aiding information, the novel receiver detects, acquires and tracks weak satellite signals and computes position solutions from calculated pseudo ranges despite the inability to extract time synchronization date f, 'n the weak satellite signals. The invention includes as features, methods and apparatus for the calibration of a local oscillator, the cancellation of cross correlations, a Doppler location scheme, an ensemble averaging scheme, the calculation of almanac aiding from a table of orbit coefficients, absolute time determination, and a modified search engine.",
            "SATELLITE-BASED POSITIONING SYSTEM IMPROVEMENT - A method, device and system for determining a receiver location using weak signal satellite transmissions. The invention involves a sequence of exchanges between an aiding source and a receiver that serve to provide aiding information to the receiver so that the receiver's location may be determined in the presence of weak satellite transmissions. With the aiding information, the novel receiver detects, acquires and tracks weak satellite signals and computes position solutions from calculated pseudo ranges despite the inability to extract time synchronization date f, 'n the weak satellite signals. The invention includes as features, methods and apparatus for the calibration of a local oscillator, the cancellation of cross correlations, a Doppler location scheme, an ensemble averaging scheme, the calculation of almanac aiding from a table of orbit coefficients, absolute time determination, and a modified search engine.",
            "SATELLITE-BASED POSITIONING SYSTEM IMPROVEMENT - A method, device and system for determining a receiver location using weak signal satellite transmissions. The invention involves a sequence of exchanges between an aiding source and a receiver that serve to provide aiding information to the receiver so that the receiver's location may be determined in the presence of weak satellite transmissions. With the aiding information, the novel receiver detects, acquires and tracks weak satellite signals and computes position solutions from calculated pseudo ranges despite the inability to extract time synchronization date f, 'n the weak satellite signals. The invention includes as features, methods and apparatus for the calibration of a local oscillator, the cancellation of cross correlations, a Doppler location scheme, an ensemble averaging scheme, the calculation of almanac aiding from a table of orbit coefficients, absolute time determination, and a modified search engine.",
            "SATELLITE-BASED POSITIONING SYSTEM IMPROVEMENT - A method, device and system for determining a receiver location using weak signal satellite transmissions. The invention involves a sequence of exchanges between an aiding source and a receiver that serve to provide aiding information to the receiver so that the receiver's location may be determined in the presence of weak satellite transmissions. With the aiding information, the novel receiver detects, acquires and tracks weak satellite signals and computes position solutions from calculated pseudo ranges despite the inability to extract time synchronization date from the weak satellite signals. The invention includes as features, methods and apparatus for the calibration of a local oscillator, the cancellation of cross correlations, a Doppler location scheme, an ensemble averaging scheme, the calculation of almanac aiding from a table of orbit coefficients, absolute time determination, and a modified search engine."
        ],
        [
            "Published",
            "04-23-2009",
            "04-30-2009",
            "05-21-2009",
            "10-04-2012"
        ]
    ],
    "pageTitle": "Hobbs - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hobbs-6/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00183-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 436984722,
    "recordOffset": 436969065,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Trevor Hobbs, Hughes AU 04-02-2015 METHODS OF REDUCING MICROBIAL CONTAMINATION - Methods of delaying the onset of an infection or preventing an infection caused by a microbial organism in an internal cavity of a subject are provided. Methods of killing or inactivating microorganisms in at least a portion of the urethra of a subject are provided. 20150094368 Published Description Patent application number Terry R. Hobbs, West Lakeland, MN US 05-07-2009 MULTIPLE REFERENCE PHASE LOCKED LOOP - A multi reference phase locked loop (MPLL) generates a high speed clock frequency and phase locks it to a lowest common reference frequency derived from a selected one of at least two reference clocks. One of the reference clocks is a system reference clock in a FBDIMM system, another may be a forwarded clock in an AMB 20090115472 Published Description Patent application number Stephen Robert Hobbs, Ottawa CA 11-24-2011 PROTECTION APPARATUS FOR A SOLAR RECEIVER - Protection apparatus for protecting a photovoltaic solar energy receiver from overheating due to concentrated solar radiation reflected from mirrors towards the receiver, the protection apparatus comprising: a shield arranged to move between a stowed position out of a path of solar radiation onto the receiver and a shielding position in the path of solar radiation, unless restrained in the stowed position; and a restraint mechanism for restraining the shield in the stowed",
    "textAfterTable": "Patent applications by Trevor Hobbs, Hughes AU Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}