{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are plenty on campus police officers to keep everyone on campus very safe.",
            "There are many different fraternities, and sororities on campus and most people I know involved in the Greek life really enjoy it.",
            "You don't get much bang for your buck, so to speak, the dorms are very expensive and the meal plan for on campus students is very expensive as well, which is required.",
            "Skateboarding around campus is always something fun to do or your could go to the gym with some friends and play a game of basketball or get in a nice workout.",
            "They have any amazing buffet style cafeteria that has a great number of options for breakfast lunch and dinner. Breakfast is my favorite, from the fresh Belgian waffles to the fresh omelets made to order, you can't go wrong.",
            "If you have a good roommate or good friends dorm life can be some of the best times of your life, but if not it could be very miserable.",
            "The workload is a big step up from high school, much more concepts are covered and in very little time, all the work is still manageable at the same time.",
            "I would say living on campus for at least your first year is a must. It helps you to get involved and allows you to really start to living the college life. Also make sure to find a good roommate, if you like to keep things clean find someone who likes to keep things clean s well, and apply for housing early to get the room you want.",
            "They have a lot of great programs for various types of majors. They have an excellent Ocean Engineering program, and Marine Biology program as well as many others. They keep classes small which is really important and its easy to get to know everyone."
        ]
    ],
    "pageTitle": "Florida Atlantic University (FAU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Florida-Atlantic-University/reviews?_escaped_fragment_=/show/93589",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00026-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 880382575,
    "recordOffset": 880187743,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{240565=If the church bells ring, it's 12:08., 389727=On campus, there's a great variety of dining places to choose from. There's the cafeteria, which includes a buffet, Coyote Jacks, Papa Johns, Chick-n-Grill, Dunkin Doughnuts, Einsteins's Bagels, Starbucks, Wendy's, and so much more. During the 2012 fall year FAU is adding Subway to the list., 183476=The dorm and meal plan requirement caused a major financial strain for me. The monthly cost ended up at around $1300 per month, which could theoretically pay for a luxury apartment or even a mortgage on a house. The school does offer scholarships to everyone who qualifies for and attends the Honors program so that helps. You can sign up for a payment plan if you can't pay a lump sum for tuition and fees., 20644=FAU itself is very reasonable. If you live off campus (which I recommend after freshmore year), do so. FAU does not charge a million different fees. The parking permits are free, but don't dare park illegally. They're too quick. Boca Raton is an expensive city - gas is expensive here (comparably), clothes and jewelry and all of that glitz is expensive. The best bang for the buck are these hole in the wall food places that immigrants own - they're the best. I don't know anyone that goes to a chain restaurant. There's a local sushi place that gets FLOODED with FAU students on Friday and Saturday nights. Car insurance is cheap in this city for some reason. Rent is a little ridiculous. I come from tampa, and I could get a beautiful remodeled apartment for $750. $750 in Boca Raton is the hood. I mean not a nice area at all. Your average 1 bedroom in a nice area can run from $850 to over $1000. Get a roommate., 1082145=A myriad of food choices (including starbucks and einstein bagels!) on campus but make sure you eat at a decent hour. If you have night classes (from 4:30 and on) the food stores will be closed. If they do close, there's a lot to eat within a 1-2 mile radius including, but not limited to, jamba juice, moe's, cheesecake factory, and another starbucks!, 338030=There has never been a time where I feel unsafe on campus, even when I am walking across campus at 11:30 PM after work. For those who do not want to walk because they feel unsafe, we have NightOwls, a free golfcart service that runs all over campus on weeknights until 11:30 PM. There are also the yellow poles placed everywhere on campus that have emergency buttons that contact the police. They will send a unit out to your exact location., 746914=The campus is extremely safe, we have a police station both on campus, and literally across the street. There are lights, and emergency phones peppered throughout the campus to prevent and reassure people who may be going that extra mile with the class going past 9:00, or coming back from the library, gym, etc. The students are incredibly considerate of one another's belongings and I can personally say I have never witnessed a theft, despite dropping my wallet on the ground, leaving my car unlocked, leaving my room unlocked and all the risky behaviours advised against., 970974=Good dorms. They just built new dorms opening in fall 2013, 281595=i find the classes i am taking and have taken at fau to be challenging, depending on the subject of course. i am presently taking a spanish intermediate class and i have been learning quite a bit about latin american countries as well as very useful grammar., 1015412=If you are planning to apply or attend FAU, I suggest that you prepare ahead of time and don't miss any deadlines! For example there are scholarships that the school offers. The award of some of these scholarships is determined at the time your application is review. However, there are other scholarships that the school offers that you must apply for individually. Most of the deadlines for these scholarships is in the beginning of January , therefore apply early! In addition make sure you make yourself familiar with people and numbers that are the most helpful to you. For example, freshman advisers and financial aid office employees are the most important to familiarize yourself with. It will come in handy., 445538=I am here on scholarship, and there are still many facilities at the college that I do not use. If you do explore and take part in what the college has to offer, you may find it a good bang for your buck. Tuition goes up a lot every semester, and the addition of the new stadium for our loosing football team does not make it any better, let alone all these funding cuts of 2012. Classes are being taken off and availability is less. Teachers in certain programs are being let go, and only the difficult(personality, not by material) ones seem to be left. I think there should be improvement in the library... it looks old. There are many places to study, one must simply find there nook which they deem comfortable., 6974=FAU is the perfect mix of learning and fun. We all have to be responsible for getting ourselves to class and absorb and retain the days lessons. When the classes are done, however, the fun begins. Dorm life is awesome and there’s plenty to do around here. The students are friendly and fun-loving. We all take care of each other and are a close-knit community. The professors seem to enjoy their work and are very helpful. The gym is free and open until late so even those of us who work can get our workouts in. The cafeteria services are great; the food is fresh and it’s open until about 10:30 pm for dinner, which means we can still get real food instead of cold, pre-packaged sandwiches or snacks from our dorms. We have our own little town on campus with many conveniences--yes, even a fast-food court for those who miss being back home. When we went to get out, though, the big city is just a street light away with hordes of activities and amenities, including some of the most beautiful beaches., 938140=Plenty of scholarships, they gave me 1000 dollars for summer classes just because I answered some questions early. Not too expensive, and good quality., 1014528=At FAU, first time students are required to attend an orientation session that covers the length of two days. All sessions are require you to sleep overnight at the institution, except for the Early Owls orientation. When I went, we slept in Heritage Park Towers it is nice and quaint although it does not have an open common area like Indian River Towers and the new Parliament Hall opening up in Fall 2013. I myself will be staying in HPT (acronym that you will hear very often) and I find it to be reasonable for my needs. Everyone is different and can choose whatever type of housing style they may want, just make sure to choose a living style that will make you the most comfortable.}",
    "textBeforeTable": "08/07/2009 Reviewer is A current student here. 36 out of 36 people found this review useful. 1 of 315 Samantha from Coral Springs, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. Florida Atlantic University Reviews Florida Atlantic University › Florida › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Tips for prospective students Bring late-night snacks and plenty to share--there are always friends around to keep you company. Bring a bike or other means of getting around campus, because it is large. In sunny Boca, you’ll get a work-out just getting to your classes. Bang for the buck A university education does not comes cheap, but FAU is well worth the money. It is a renown leader in many fields and students leave here well-prepared for their careers. Due to their top-quality education, FAU graduates are more likely to start earning top pay in their fields just out of college. Am enjoying being here FAU is the perfect mix of learning and fun. We all have to be responsible for getting ourselves to class and absorb and retain the days lessons. When the classes are done, however, the fun begins. Dorm life is awesome and there’s plenty to do around here. The students are friendly and fun-loving. We all take care of each other and are a close-knit community. The professors seem to enjoy their work and are very helpful. The gym is free and open until late so even those of us who work can get our workouts in. The cafeteria services are great; the food is fresh and it’s open until about 10:30",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}