{
    "relation": [
        [
            "First Name",
            "Megan",
            "Thomas"
        ],
        [
            "Last Name",
            "Carr",
            "Geier"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=0CAEC5C1-FFA1-4D29-BD87-39AB9F6100C6&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00153-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 221091629,
    "recordOffset": 221083427,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{37568=Implementation of the Patient Protection and Affordable Care Act (PL - 111-148) and the Health Care and Education Reconciliation Act (PL 111-152) Medicare and Medicaid reimbursement policies related to healthcare associated conditions, healthcare associated infections, readmissions, and payment bundling Comparative effectiveness research and policies Accountable care organizations Competitive bidding Medical Device Tax - H.R. 436, the Healthcare Cost Reduction Act, and S. 17, the Medical Device Access and Innovation Protection Act Regulations related to the adoption of International Classification of Diseases, version 10 (ICD-10) Implementation of the Physician Payments Sunshine Act (PL 111-152, Section 6002) Reauthorization of the Food and Drug Administrations medical device user fee program S. 3187, the Food and Drug Administration Safety and Innovation Act (PL 112-144); H.R. 5651, a bill to extend FDA User Fee Programs; H.R. 3205, FDA Renewing Efficiency from Outside Reviewer Management Act; S. 1700, the Medical Device Regulatory Improvement Act; and S. 1865, the Patient Access to Medical Innovation Act, 26582=Energy Policy - Transmission Alternative Energy Technology Renewable Energy Standards TV Energy Efficiency Test Method Energy Efficient Technologies Energy Appropriations Renewable Energy Policy (solar, wind, biofuels) Window Film Tax Credits Federal Transmission Siting Standards S. 1000 - Energy Savings and Industrial Competetiveness Act, Building Code Energy Efficiency Standards Energy Tax Policy, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 24393=Supporting Science, Technology, Engineering and Math Educational (STEM) S. 758 and HR 2598, the STEM Master Teacher Corps Act, 12207=Federal R&D Appropriations Federal Appropriations: FY 13 Energy Appropriations - S. 2465 / H.R. 5325 FY 13 Defense Appropriations Requests - H.R. 5856 Military Hearing Protection Funding / Tactical Communication and Protective System (TCAPS), 50308=S. 2646, A bill to suspend temporarily the duty on ascorbic acid encapsulated in cellulose acetate butyrate. S. 2645, A bill to extend the temporary suspension of duty on certain catalytic converter mounting mats. S. 2644, A bill to suspend temporarily the duty on certain catalytic converter mats of glass fibers. S. 2643, A bill to extend the temporary suspension of duty on perfluorobutanesulfonyl fluoride. S 2642, A bill to suspend temporarily the duty on certain polycrystalline fibers. S. 2641, A bill to extend the temporary suspension of duty on fluoropolymers containing 95 percent or more by weight of the monomer units tetrafluoroethylene, hexafluoropropylene, and vinylidene fluoride. S. 2640, A bill to suspend temporarily the duty on potassium persulfate encapsulated in cellulose acetate butyrate. S. 2639, A bill to suspend temporarily the duty on bisphenol A Bis(3-methacryloyloxypropyl) ether substituted dimethacylate. S. 2638, A bill to suspend temporarily the duty on copoly(acrylic acid/itaconic acid). S. 2637, A bill to extend the temporary suspension of duty on C1-3 perfluoroalkyl perfluoromorpholine. S. 2636, A bill to extend the temporary suspension of duty on mixtures of C5-18 perfluorocarbon alkanes, perfluorocarbon amines, and/or perfluorocarbon ethers. S. 2635, A bill to extend the temporary suspension of duty on C5-8 perfluorocarbonalkanes. S. 2634, A bill to extend the temporary suspension of duty on perfluorocarbon amines.}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  JEFFREY K. RAGETH  2024143001   jkrageth@mmm.com 5. Senate ID#  25465-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}