{
    "relation": [
        [
            "Patent application number",
            "20100049688",
            "20100057724",
            "20100057725",
            "20100079464",
            "20110004578"
        ],
        [
            "Description",
            "LINK INFORMATION EXTRACTING APPARATUS, LINK INFORMATION EXTRACTING METHOD, AND RECORDING MEDIUM - A storage unit stores first link information classified into a particular type. A take-in unit takes in a plurality of pieces of electronic information. A classifier unit classifies each piece of the electronic information taken in by the take-in unit into first electronic information which describes the first link information and second electronic information which does not describe the first link information. A generator unit generates third link information based on second link information when the first electronic information describes the second link information that is different from the first link information. An output unit generates possibility information indicative of a possibility that the third link information is classified into a particular type, based on the third link information and at least the first or second electronic information, and outputs the possibility information and the third link information in association with each other.",
            "SERVER DEVICE FOR CREATING LIST OF GENERAL WORDS TO BE EXCLUDED FROM SEARCH RESULT - A server device of the present invention includes a control unit collecting texts stored in a storage unit in response to an instruction from the outside or when a predetermined time is reached, extracting words from the collected texts, determining, as a general word, a word which appears at a frequency higher than a first predefined value for a first predetermined period, and which appears at a frequency that varies within a second predefined value range for every second predetermined period that is shorter than the first predetermined period, and creating a general word list which enumerates the general words.",
            "INFORMATION RETRIEVAL DEVICE, INFORMATION RETRIEVAL METHOD, AND PROGRAM - In an exemplary aspect, the present invention includes a control unit that when a keyword for search is entered, collects texts containing that keyword from texts stored in a storage unit, extracts a noun of collected first texts, determines a noun partially matching with the keyword as a first word, extracts a second text containing that first word among the first texts, extracts a word from the second text, the word being one of a noun, a verb, and an adjective, counts the number of times an extracted word is used, determines a word whose number of times of use is placed in predefined highest ranks as a second word, the second word being a related word to the first word, and outputs the first word and the second word.",
            "Information processing apparatus capable of easily generating graph for comparing of a plurality of commercial products - An information processing apparatus includes a controller acquiring texts including each of a plurality of commercial product names to be analyzed, with respect to the respective commercial product names, from a storage device when the commercial product names are entered into the controller, extracting first phrases and second phrases from the acquired texts with respect to the commercial product names, the first phrases and the second phrases being classified as belonging to a first kind and a second kind, respectively, as expressions of evaluation of commercial products indicated by the commercial product names, and generating a graph representing evaluation points as values corresponding to the differences between counts of the first phrases and the second phrases.",
            "ACTIVE METRIC LEARNING DEVICE, ACTIVE METRIC LEARNING METHOD, AND PROGRAM - A metric application unit receives data under analysis having a plurality of attributes and a metric indicative of the distance between the data under analysis, calculates the distance between the data under analysis, and output and stores a data analysis result which is generated from an analysis on the data under analysis with a predetermined function, using the calculated distance between the data under analysis. A metric optimization unit generates side-information based on an indication of feedback information entered from the outside and including either similarities between the data under analysis, or the attributes, or a combination thereof, generates a metric which complies with a predetermined condition, based on the generated side information, and stores the generated metric in a metric learning result storage unit."
        ],
        [
            "Published",
            "02-25-2010",
            "03-04-2010",
            "03-04-2010",
            "04-01-2010",
            "01-06-2011"
        ]
    ],
    "pageTitle": "Matsumura, Tokyo - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/matsumura-tokyo-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00081-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 424125771,
    "recordOffset": 424095188,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Norikazu Matsumura, Tokyo JP //]]> BarDraw('2502112',['Patent applications by Nobuji Matsumura, Tokyo JP'],[[1,3,2,2,4,2]],['2006','2009','2010','2011','2012','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2502112\" align=\"center\"></div> </div> <canvas id=\"bg2502112\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Nobuji Matsumura, Tokyo JP</p> <div class=\"bar2502112\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>06-27-2013</td> <td><a href=\"/patents/app/20130164695\">METHOD FOR FORMING PATTERN</a> - A method for forming a pattern includes providing a first positive-working radiation-sensitive resin composition on a substrate to form a first resist layer. The first positive-working radiation-sensitive resin composition includes a crosslinking agent, a polymer containing an acid-unstable group and not containing a crosslinking group, a radiation-sensitive acid generator, and a solvent. The first resist layer is exposed selectively to radiation, and developed to form a first resist pattern. The first resist pattern is made inactive to radiation, or insolubilized in an alkaline developer or in a second positive-working radiation-sensitive resin composition. The second positive-working radiation-sensitive resin composition is provided on the substrate to form a second resist layer. The second resist layer is exposed selectively to radiation, and developed to form a second resist pattern in the space area of the first resist pattern.</td> <td>20130164695</td> <tr> </tr> <td>05-02-2013</td> <td><a href=\"/patents/app/20130108962\">RADIATION-SENSITIVE COMPOSITION</a></td> <td>20130108962</td> <tr> </tr> <td>05-17-2012</td> <td><a href=\"/patents/app/20120122036\">PATTERN FORMING METHOD</a> - A pattern forming method includes providing and curing a under-layer film containing a radiation-sensitive acid generator which generates an acid upon exposure to radiation on a substrate. The under-layer film is irradiated with radiation through a mask to",
    "textAfterTable": "Patent applications by Norikazu Matsumura, Tokyo JP Norio Matsumura, Tokyo JP Patent application number Description Published 20140256430 INFORMATION PROCESSING APPARATUS, INFORMATION PROCESSING SYSTEM, INFORMATION PROCESSING METHOD AND RECORDING MEDIUM - An example system includes: a contactless communication unit for performing contactless communication with a data storage medium having a contactless communication function; a data acquiring unit for acquiring data stored in the data storage medium by the contactless communication unit; a display processing unit for displaying at least one content stored in a content storage unit and a content according to data acquired by the data acquiring unit on a display unit as selection objects; a selection accepting unit for accepting selection by a user for a content displayed by the display processing unit; and an information processing unit for performing information processing pertaining to a content, which is an object of selection accepted by the selection accepting unit. 09-11-2014 Ryotaro Matsumura, Tokyo JP Patent application number Description Published 20100244629 Piezoelectric Generator - The piezoelectric generator is characterized by providing a spacer member in the vicinity of a fixed end of an elastic plate mounted on a base plate by",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}