{
    "relation": [
        [
            "Patent application number",
            "20120103217",
            "20120103221"
        ],
        [
            "Description",
            "Cleaning Subsystem for a Variable Data Lithography System - An cleaning subsystem for a variable data lithography system includes a first cleaning member having a conformable adhesive surface disposed for physical contact with an imaging member such that residual ink remaining on the imaging member, such as following transfer of an inked latent image from the imaging member to a substrate, adheres to the conformable adhesive surface and is thereby removed from the imaging member. The cleaning subsystem may further include a second cleaning member, in physical contact with the first cleaning member, having a relatively hard, smooth surface such that residual ink removed from the imaging member and adhering to the adhesive surface of the first cleaning member may split onto the second cleaning member.",
            "Cleaning Method for a Variable Data Lithography System - An cleaning method for a variable data lithography system employs a first cleaning member having a conformable adhesive surface disposed for physical contact with an imaging member such that residual ink remaining on the imaging member, such as following transfer of an inked latent image from the imaging member to a substrate, adheres to the conformable adhesive surface and is thereby removed from the imaging member. The cleaning method may further employ a second cleaning member, in physical contact with the first cleaning member, having a relatively hard, smooth surface such that residual ink removed from the imaging member and adhering to the adhesive surface of the first cleaning member may split onto the second cleaning member."
        ],
        [
            "Published",
            "05-03-2012",
            "05-03-2012"
        ]
    ],
    "pageTitle": "Anderson, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/anderson-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00173-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438637167,
    "recordOffset": 438593262,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Gregory Anderson, Emerald Hills, CA US 08-23-2012 MICROPOROUS COMPOSITE SHEET MATERIAL - Disclosed herein are methods of preparing a composite sheet material having strength and barrier properties suitable for use as a housewrap, the methods comprising extrusion coating a polyolefin film layer onto a surface of an area-bonded, spunbond nonwoven substrate to form a composite sheet material, the composite sheet material having a grab tensile strength of at least 178 Newtons in at least one of the machine direction (MD) or the cross-machine direction (CD), and stretching the composite sheet material to impart to the composite sheet material a hydrostatic head of at least 100 cm, and a moisture vapor transmission rate (MVTR) of at least 35 g/m 20120211915 09-08-2011 Microporous Composite Sheet Material - A moisture vapor permeable, water impermeable composite sheet material is provided which is suitable for use as a housewrap material, and is also useful for other applications such as tarpaulins, or as covers for automobile, boats, patio furniture or the like. The composite sheet material includes a nonwoven substrate and an extrusion-coated polyolefin film layer overlying one surface of the substrate. The nonwoven substrate is comprised of polymeric fibers randomly disposed and bonded to one another to form a high tenacity nonwoven web. The nonwoven substrate has a grab tensile strength of at least 178 Newtons (40 pounds) in at least one of the machine direction (MD) or the cross-machine direction (CD). The extrusion coated polyolefin film layer",
    "textAfterTable": "Gregory Anderson, Spartanburg, SC US Patent application number Description Published 20110285541 SYSTEM, METHOD, AND APPARATUS FOR DETECTING WEAR IN A SCREENING ARRANGEMENT - A system, method, and apparatus for detecting wear in a screening arrangement is disclosed. The system, method, and apparatus can include a sensor that is configured to provide a notification signal when a surface of a screen panel has worn to a threshold level. The threshold level can be based at least in part on the amount of wear that requires replacement of a screen panel to prevent breakthrough or contamination. The notification signal provided by the sensor can be used to identify which screen panel or region of screen panels has been worn to the threshold level so that the screen panels can be replaced in a timely manner. The sensor may be coupled to a conductor embedded in one of the screen panels that is altered when a screen panel has worn to a threshold level, triggering the sensor to provide the notification signal. 11-24-2011 Gregory J. Anderson, North Kingstown, RI US Patent application number Description Published 20110143112 Thermoplastic elastomer with desirable grip especially during wet conditions - Thermoplastic elastomer compositions having a desirable soft touch feel to skin, and in particular grip, especially during wet, soapy and humid conditions. In one embodiment, the composition is part of a composite system, wherein the composition is",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}