{
    "relation": [
        [
            "Patent application number",
            "20120175669",
            "20140061664"
        ],
        [
            "Description",
            "LIGHT EMITTING DEVICE USING GaN LED CHIP - A light emitting device is constituted by flip-chip mounting a GaN-based LED chip. The GaN-based LED chip includes a light-transmissive substrate and a GaN-based semiconductor layer formed on the light-transmissive substrate, wherein the GaN-based semiconductor layer has a laminate structure containing an n-type layer, a light emitting layer and a p-type layer in this order from the light-transmissive substrate side, wherein a positive electrode is formed on the p-type layer, the electrode containing a light-transmissive electrode of an oxide semiconductor and a positive contact electrode electrically connected to the light-transmissive electrode, and the area of the positive contact electrode is half or less of the area of the upper surface of the p-type layer.",
            "LIGHT EMITTING DEVICE USING GAN LED CHIP - A light emitting device is constituted by flip-chip mounting a GaN-based LED chip. The GaN-based LED chip includes a light-transmissive substrate and a GaN-based semiconductor layer formed on the light-transmissive substrate, wherein the GaN-based semiconductor layer has a laminate structure containing an n-type layer, a light emitting layer and a p-type layer in this order from the light-transmissive substrate side, wherein a positive electrode is formed on the p-type layer, the electrode containing a light-transmissive electrode of an oxide semiconductor and a positive contact electrode electrically connected to the light-transmissive electrode, and the area of the positive contact electrode is half or less of the area of the upper surface of the p-type layer."
        ],
        [
            "Published",
            "07-12-2012",
            "03-06-2014"
        ]
    ],
    "pageTitle": "Hiraoka - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hiraoka-6/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00052-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441605287,
    "recordOffset": 441579705,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Shin Hiraoka, Amagasaki-Shi JP 12-20-2012 WHITE SEMICONDUCTOR LIGHT EMITTING DEVICE - The invention aims at providing controllable parameters that are correlated with special color rendering index R9, and at providing a white light-emitting semiconductor device having a high R9 value obtained through optimization of such parameters. 20120319565 Published Description Patent application number Shin Hiraoka, Yokohama-Shi JP 05-07-2015 Process For Producing Shaped Catalyst And Process For Producing Diene Or Unsaturated Aldehyde And/or Unsaturated Carboxylic Acid Using The Shaped Catalyst - There is provided a process for producing a shaped catalyst for a fixed bed oxidation reaction or a fixed bed oxidative dehydrogenation reaction, the catalyst having both of sufficient mechanical strength and catalyst performance, and the catalyst is produced by supporting a catalyst powder containing a complex metal oxide having molybdenum as an essential ingredient on an inert support by a tumbling granulation method at a relative centrifugal force of 1 to 35G. 20150126774 07-31-2014 IMPROVED PROCESS OF DEHYDRATION REACTIONS - The present invention relates to the production of acrolein, acrylic acid or methacrylic acid by dehydration reaction of renewable raw material such as glycerin or hydroxycarboxylic acids, in the presence of a novel catalyst system supported on a carrier having a bimodal structure and a high pore volume and distribution. The dehydration reactions can be carried out for longer operation duration, so that acrolein, acrylic acid or methacrylic acid can be produced",
    "textAfterTable": "Shinichi Hiraoka, Chiryu-City JP Patent application number Description Published 20130133634 CONTROLLER FOR INTERNAL COMBUSTION ENGINE - While an engine is at idling state with an EGR valve fully closed, an EGRLQ is detected or estimated. When the EGRLQ exceeds a specified threshold, a target intake manifold pressure is established so that the EGRLQ becomes less than the specified value and an IAFRI-control is executed so that the intake manifold pressure becomes the target pressure. An intake air flow rate QIN can be increased and a differential pressure DP between upstream and downstream of the EGR valve 05-30-2013 Shinya Hiraoka, Ibaraki-Shi JP Patent application number Description Published 20140345917 DOUBLE-SIDED TRANSPARENT CONDUCTIVE FILM AND TOUCH PANEL - Provided are a double-sided transparent conductive film which is good in appearance even when its transparent conductive layers are patterned, and has anti-blocking property, thereby being producible at low costs; a wound body thereof; and a touch panel. The double-sided transparent conductive film includes a base material film, and a base material film, and an optical adjusting layer and a transparent conductive layer which are formed in this order on each of both sides of the base material film, wherein an anti-blocking layer containing particles is formed at least one of: a location between the base material film and one optical adjusting layer; and a location between the base material film and the other",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}