{
    "relation": [
        [
            "Misfit Rock",
            "The T.W. Editorial Memorial",
            "The Turning Away",
            "Earthbound Misfit"
        ],
        [
            "Height",
            "10",
            "9",
            "10"
        ],
        [
            "Grade",
            "13",
            "18",
            "17"
        ],
        [
            "Stars",
            "",
            "",
            "1"
        ]
    ],
    "pageTitle": "Rock Climbing at Mt Beckworth, Clunes, Victoria, Australia",
    "title": "",
    "url": "http://www.chockstone.org/MtBeckworth/MtBeckworth.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00312-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 363505136,
    "recordOffset": 363488742,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Mon, 06 Oct 2008 23:45:31 GMT",
    "textBeforeTable": "Mt Beckworth is about 25 minutes drive from Ballarat, or approximately an hour and 20 minutes from Bendigo, or Melbourne. It rises behind the little township of Clunes (voting population 7, and one of them is a boarder-collie), like a patient observer, unfazed by the shrieks of granite loving climbers. I think the Clunes Shire Council must know they have a good thing, and wish to keep it to themselves, because you won't find any road signs indicating \"Mt Beckworth this way\", until you've almost navigated the array of tracks leading in. Essentially, you'll want \"Mountain Creek Road\" about 3kms down \"Fentons\" road. (See approach map for details). Once there, however, you'll be rewarded with a picturesque little mountain, suitable for a family picnic or bush walking destination, as much as it is home to Ballarat's climbing population.  Notes On Bolting Power drills are banned and things like excessive cleaning and fixed hangers are unwelcome. All new bolting has to adhere to an established policy. (See VCC guide for details). There's a general climber's code of conduct at Park's Victoria's web site, though I'd imagine the VCC would also answer any questions in regards to establishing",
    "textAfterTable": "Prawn of Death 9 10   Baby Elephant Walk 11 13   Tusker 12 19 1 Ivory Coast 10 24   Balance Of Power 12 17 2 Trunk Line 10 17   Slave 9 23   Laydown Mrs Marsh 10 12   Stranger Stone Height Grade Stars Give Me Danger Little Stranger 7 21   Three Moves to Nowhere 6 8   Easter Rocks Height Grade Stars Rhythm and Blues",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}