{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "serious minded",
            "Winter Carnival!",
            "skiing, biking, trails, geocaching, lots of activities.",
            "Mean business.",
            "Not for the faint of heart, not a good school to attend if you're in it for the party. However, you want a great school? this is it."
        ]
    ],
    "pageTitle": "Michigan Technological University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Michigan-Technological-University/reviews?_escaped_fragment_=/show/46964",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00177-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898478259,
    "recordOffset": 898405316,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{179967=As a first year I already (pretty much) had jobs lined up. I was a computer science major with an aerospace minor. I got to work on the satellite we are putting in space in 2013. So yes, it is a great school., 48558=Winter Carnival is the big tradition at Michigan Tech. During late January or early February every year thousands of people trek up to Houghton for a festival that celebrates snow, ice, and hockey. Students build enormous statues of snow and ice (either one-night or month-long projects), the hockey team hosts a weekend series, and the campus is filled with music, free stuff, and hundreds of people for a week. Class gets out on Wed. of that week, and so there are five days off for students. Another great tradition is broomball. Originating in Scandinavia, it is essentially hockey with brooms, just without skates and in a smaller rink. Also, instead of a puck there is a hard rubber ball. Broomball is a hardy sport that is physically intense and a ton of fun. Sliding all over the place and trying to smack a ball into a goal with a duck-taped broom is great fun., 200332=During the Spring Semester, all through January, student groups on campus build huge snow sculptures. It ends the first week of February with 3 days off from school and a big party on campus essentially., 331708=© 2015, Cappex.com, LLC, 47082=Michigan Tech was, in 2011, rated the 2nd safest campus in the country. Enough said. The only thing that can be dangerous about Michigan Tech is the weather, if you're not a cautious driver., 260187=I love Tech, but I hate the dorm food. The fresh vegetables and fruits don't tend to be very fresh, especially come January and February. I haven't found many entrees I'm particularly fond of either. I spent most of the year eating cereal and toast. The upside is that if you live in the dorms you get the unlimited meal plan, so you can just stop in for hot chocolate at 8 or 9pm in McNair if you feel like it and not be wasting meals., 49721=Michigan Tech is very expensive for a state university (estimated 27k per year in-state in 2012/2013), and I do not feel that it is quite worth that much. While employers value a Michigan Tech education and will hire many high achieving students that graduate, leaving school with a ton of debt is not something that is easily remedied, even with a nice job. Tech is a great school, and you will be great at whatever you study when you graduate, but the cost may be prohibitive for some., 17248=I do like it here quite a bit. I've lived in the dorms my first two years and moved to on campus apartments my third/current year. In the dorms, you will make a lot of friends that would have otherwise seemed impossible to have done, especially if you live in a learning-community hall (there are a select few halls in the dormitories that give you a closer-knit bond with your hallmates through several planned activities). One of these activities is the winter carnival snow statues that are resurrected each year into beautiful masterpieces. It makes the campus scene very enjoyable in february after all the snow. Another aspect of being here that I like is the opportunity to play as many intramural sports, attend Division I games for free, enjoy the snowboarding/ski hill, portage lake golf course, and free admission to the indoor Gates Tennis Center all for $64 per semester. If you are an active student, this is definitely a bargain. Another cool thing is broomball-a sport played like hockey without skates, with modified brooms and a 6 sized ball. It is the best equivalent for many students to being in a varsity sport since broomball has such a high tradition and support level throughout the community. Some of the downsides of living here can be the tremendous amounts of lake effect snow we receive. The BIGGEST downside however is the distance away from home you will have to be. Since this college is located in the far western upper peninsula of Michigan, you will likely be quite isolated from family. You may come from MN or WI which makes you a bit closer, but you will pay out of state tuition=$30000. If you are in-state, which basically means you are from the Metro-Detroit area, Saginaw, Grand Rapids, you have a long drive my friend. If from any other state, you are probably looking at either a LONG drive or an expensive plane trip home. Another good thing about the university, something that just came to mind, is that there are GREAT! opportunities to take a leadership role. I've taken one in my enterprise (Green Campus Enterprise), tennis club, and another organization., 2115=Tech is located smack dab in the middle of Houghton, residing in the Keweenaw of upper Michigan. Briefly, we get a lot of snow. To say we take advantage of this is an understatement. Tech hosts the Winter Carnival ever February, sporting snow sculptures, live music, free food, and a lot of fun. We have a ski mountain five minutes from campus that's great for both skiers and snowboarders of every skill level. If you were into music in high school and still want to continue I saved the best part for last . Michigan Tech is the proud home of none other than the Michigan Tech Huskies Pep Band. A completely student run organization that plays at every school sporting event and a whole lot more.(Sorry if this seems a bit biased, I'm in the band after all) Donning our signature black and yellow striped overalls and more than a couple silly hats we've been a staple of Tech sports and have even been the host band for the WCHA Final Five for the past three years. No other band has ever been invited more than once. But no matter what you're into, there's a group for it and you'll quickly find people to hang out and have fun with., 28063=Greek life is very active on campus, hosting events for students on campus, parties off campus, and charity events. There are more fraternities than sororities due to the ratio of students at MTU (3:1 male to female), but everyone interested can pledge. Greek Life at MTU is very friendly and open., 325420=For being a (relatively) less expensive college, Tech gives an amazing education that more than prepares you for a job after college. Its career fair in 2014 had over 350 companies - a crazy high amount, and a school record., 118572=Let me put it this way: In the entire 2011-2012 school year, the worst crime we had commuted on campus was the unwelcome groping of one of our female students. Crime here is little to nonexistent. I have never felt safer., 305728=Winter Carnival in February is a great time. It's when different organizations and halls on campus and off build snow statues and compete in different winter sports. Also, students get a few days off of classes to celebrate. It's basically a big party all over campus., 139833=We've got the whole blue light system, but really no one is worried about it. You'd think where women are outnumbered 3:1 we'd have a reason to be nervous, but it's really not the case. 98% of the time I'm perfectly comfortable walking around alone at night. There was one incident of groping last year, but our crime stats are very low., 141295=One of my favorite places to explore is the partially sunken dredger. It's a big kid's playground. Winter Carnival is a huge campus tradition. The campus gets half of a week off in February to celebrate the frigid cold. Huge snow sculptures are built along with tons of other activities. Also, the campus goes wild for broomball.}",
    "textBeforeTable": "12/09/2009 Reviewer is A current student here. 13 out of 13 people found this review useful. 1 of 65 Charles from Midland, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Michigan Tech has a reputation of being a tough school and it's reputation is well earned. Every class I've taken has been a challenge but nothing too extreme. The university takes academic dishonestly very seriously and strives to ensure that every grade is well earned and up to snuff with what's demanded in the real world. Despite all of this, it was an easy transition from high school. Michigan Tech has dedicated learning centers for each field of study, staffed with students who know the material backwards and forwards. There's always someone to help you with something. The biggest mistake I've seen people make is to simply not go to class and not do homework. It's a challenging school for sure, but nothing you can't handle if you just keep at it. Login to rate or flag the reviews Skyler from Houghton, MI 07/21/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 2 of 65 Categories Comments Tips for prospective students Even though it doesn't seem like there's much up here, the Keweenaw area",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}