{
    "relation": [
        [
            "Action",
            "Notice of Intent To Prepare an Environmental Impact Statement",
            "Notice Comment Period End",
            "NPRM",
            "NPRM Comment Period End"
        ],
        [
            "Date",
            "10/20/09",
            "11/19/09",
            "05/00/12",
            "07/00/12"
        ],
        [
            "FR Cite",
            "74 FR 53673",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Federal Register | Introduction to the Unified Agenda of Federal Regulatory and Deregulatory Actions",
    "title": "",
    "url": "https://www.federalregister.gov/articles/2012/02/13/2012-1620/introduction-to-the-unified-agenda-of-federal-regulatory-and-deregulatory-actions",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00038-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911435819,
    "recordOffset": 911217777,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{27358=A Proposed Rule by the Agricultural Marketing Service on 07/30/2015, 12845=The enactment of the 2014 Farm Bill made changes the Agency must adopt prior to accepting applications for future loans. The Agency is publishing this regulation as an interim rule, which will allow the Agency to begin accepting applications once again.}",
    "TableContextTimeStampAfterTable": "{550433=Legal Authority: 16 U.S.C. 1361 et seq., 886693=Implementation of the Guam-CNMI Visa Waiver Program. CBP published an interim final rule in November 2008 amending the DHS regulations to replace the current Guam Visa Waiver Program with a new Guam-CNMI Visa Waiver program. This rule implements portions of the Consolidated National Resources Act of 2008 (CNRA), which extends the immigration laws of the United States to the Commonwealth of the Northern Mariana Islands (CNMI) and, among others things, provides for a visa waiver program for travel to Guam and the CNMI. The amended regulations set forth the requirements for nonimmigrant visitors who seek admission for business or pleasure and solely for entry into and stay on Guam or the CNMI without a visa. The rule also establishes six ports of entry in the CNMI for purposes of administering and enforcing the Guam-CNMI Visa Waiver program. CBP intends to issue a final rule during the next fiscal year., 887673=Global Entry Program. In the fall of 2009, pursuant to section 7208(k) of the Intelligence Reform and Terrorism Prevention Act of 2004, as amended, CBP issued a Notice of Proposed Rulemaking (NPRM), proposing to establish an international trusted traveler program, called Global Entry. This voluntary program would allow CBP to expedite clearance of pre-approved, low-risk air travelers into the United States. CBP has been operating the Global Entry program as a pilot at several airports since June 6, 2008. Based on the successful operation of the pilot, CBP proposed to establish Global Entry as a permanent voluntary regulatory program. CBP has evaluated the public comments received in response to the NPRM and intends to issue a final rule during the next fiscal year., 653540=Legal Deadline: Final, Statutory, December 19, 2011., 885728=On November 25, 2008, CBP published an interim final rule “Importer Security Filing and Additional Carrier Requirements,” amending CBP Regulations to require carriers and importers to provide to CBP via a CBP-approved electronic data interchange system, information necessary to enable CBP to identify high-risk shipments to prevent smuggling, and ensure cargo safety and security. This rule, which became effective on January 26, 2009, improves CBP risk assessment and targeting capabilities, facilitates the prompt release of legitimate cargo following its arrival in the United States, and assists CBP in increasing the security of the global trading system. The comment period for the interim final rule concluded on June 1, 2009. CBP is analyzing comments and conducting a structured review of certain flexibility provided in the interim final rule. CBP intends to publish a final rule during the next fiscal year., 788555=Summary of Legal Basis: The statutory basis for our authority includes sections 510(a) through (j), 510(p), 701, 801, and 1003 of the Act., 401941=Agency Contact: James F. Herbert, Regulatory Review Specialist, Department of Agriculture, Food and Nutrition Service, 10th Floor, 3101 Park Center Drive, Alexandria, VA 22302, Phone: 703 305-2572, Email: james.herbert@fns.usda.gov., 172879=The Regulatory Flexibility Act requires agencies to identify those rules that may have a significant economic impact on a substantial number of small entities (5 U.S.C. 602). Agencies meet that requirement by including the information in their submissions for the Unified Agenda. Agencies may also indicate those regulations that they are reviewing as part of their periodic review of existing rules under the Regulatory Flexibility Act (5 U.S.C. 610). Executive Order 13272 entitled “Proper Consideration of Small Entities in Agency Rulemaking,” signed August 13, 2002 (67 FR 53461), provides additional guidance on compliance with the Act., 214720=Since President Reagan's Executive Order 12291, issued in 1981, a principal focus of the Office of Information and Regulatory Affairs, and of regulatory policy in general, has been on maximizing net benefits. In this Administration, agencies and OMB have worked together to issue a number of rules for which the benefits exceed the costs, and by a large margin. Consider the following figure:, 923984=On December 7, 2000, DOJ published a proposed rule in the Federal Register providing guidance on the definitions of “persecution” and “membership in a particular social group.” Prior to publishing a new proposed rule, the Department will be considering how the nexus between persecution and a protected ground might be further conceptualized; how membership in a particular social group might be defined and evaluated; and what constitutes a State's inability or unwillingness to protect the applicant where the persecution arises from a non-State actor. This rule will provide guidance to the following adjudicators: USCIS asylum officers, Department of Justice Executive Office for Immigration Review (EOIR) immigration judges, and members of the EOIR Board of Immigration Appeals. The alternative to publishing this rule would be to allow the standards governing this area of law to continue to develop piecemeal through administrative and judicial precedent. This approach has resulted in inconsistent and confusing standards, and the Department has therefore determined that promulgation of the new proposed rule is necessary., 334844=With the passage of S. 3656, the Mandatory Price Reporting Act of 2010, the Secretary of Agriculture is required to amend chapter 3 of subtitle B of the Agricultural Marketing Act of 1946 by adding a new section for mandatory reporting of wholesale pork cuts. To make these amendments, the Secretary was directed to promulgate a final rule no later than 11/2years after the date of the enactment of the Act. Accordingly, a final rule will be promulgated by March 28, 2012., 557496=Legal Authority: 16 U.S.C. 1361 et seq.; 16 U.S.C. 1531 to 1543, 415152=Agency Contact: James F. Herbert, Regulatory Review Specialist, Department of Agriculture, Food and Nutrition Service, 10th Floor,3101 Park Center Drive, Alexandria, VA 22302, Phone: 703 305-2572, Email: james.herbert@fns.usda.gov., 713584=Statement of Need: Regulatory oversight of the animal food industry has traditionally been limited and focused on a few known safety issues, so there could be potential human and animal health problems that remain unaddressed. The massive pet food recall due to adulteration of pet food with melamine and cyanuric acid in 2007 is a prime example. The actions taken by two protein suppliers in China affected a large number of pet food suppliers in the United States and created a nationwide problem. By the time the cause of the problem was identified, melamine and cyanuric acid contaminated ingredients resulted in the adulteration of millions of individual servings of pet food. Congress passed FSMA which the President signed into law on January 4, 2011 (Pub. L. 111-353). Section 103 of FSMA amended the Federal Food, Drug, and Cosmetic Act (FD Act) by adding section 418 (21 U.S.C. 350g) Hazard Analysis and Risk Based Preventive Controls. In enacting FSMA, Congress sought to improve the safety of food in the United States by taking a risk-based approach to food safety, emphasizing prevention. Section 418 of the FD Act requires owners, operators, or agents in charge of food facilities to develop and implement a written plan that describes and documents how their facility will implement the hazard analysis and preventive controls required by this section., 841945=Agency Contact: Sarah DeLone, Health Insurance Specialist, Department of Health and Human Services, Centers for Medicare & Medicaid Services, Mail Stop S2-01-16, 7500 Security Boulevard, Baltimore, MD 21244, Phone: 410 786-0615, Email: sarah.delone@cms.hhs.gov., 185570=Editions of the Unified Agenda prior to fall 2007 contained several indexes, which identified entries with various characteristics. These included regulatory actions for which agencies believe that the Regulatory Flexibility Act may require a Regulatory Flexibility Analysis, actions selected for periodic review under section 610(c) of the Regulatory Flexibility Act, and actions that may have federalism implications as defined in Executive Order 13132 or other effects on levels of government. These indexes are no longer compiled, because users of the online Unified Agenda have the flexibility to search for entries with any combination of desired characteristics. The online edition retains the Unified Agenda's subject index based on the Federal Register Thesaurus of Indexing Terms. In addition, online users have the option of searching Agenda text fields for words or phrases., 729304=Legal Authority: 21 U.S.C. 342; 21 U.S.C. 350h; 21 U.S.C. 371; 42 U.S.C. 264; Pub. L. 111-353 (signed on Jan. 4, 2011), 633186=The Energy Policy and Conservation Act (EPCA) requires DOE to set appliance efficiency standards at levels that achieve the maximum improvement in energy efficiency that is technologically feasible and economically justified. The standards already published in 2011 have an estimated net benefit to the Nation of up to $16.6 billion over 30 years. By 2045, these standards are expected to save enough energy to operate all U.S. homes for more than 7 months., 552578=Summary of Legal Basis: All marine mammals are protected under the Marine Mammal Protection Act (MMPA). NMFS is proposing these regulations pursuant to its rulemaking authority under MMPA 16 U.S.C. 1361 et seq.; 16 U.S.C. 1372 et seq., which generally prohibits the take of any marine mammals; and 16 U.S.C. 1382 et seq., 224273=In August 2011, over two dozen agencies released final plans to remove what the President has called unjustified rules and “absurd and unnecessary paperwork requirements that waste time and money.” Over the next five years, billions of dollars in savings are anticipated from just a few initiatives from the Department of Transportation, the Department of Labor, the Department of Health and Human Services, and the Environmental Protection Agency. And all in all, the plans' initiatives will save tens of millions of hours in annual paperwork burdens on individuals, businesses, and state and local governments., 425772=Statement of Need: The Nutrition Education and Obesity Prevention Grant Program rule amends the Food and Nutrition Act of 2008 to replace the current nutrition education program under the Act with a program providing grants to States for the implementation of a nutrition education and obesity prevention program that promotes healthy food choices consistent with the most recent Dietary Guidelines for Americans. This rule will implement all requirements of the law. It makes eligible for program participation: (1) Supplemental Nutrition Assistance Program (SNAP) participants, (2) participants in the school lunch or breakfast programs, and (3) individuals who reside in low-income communities or are low-income individuals. The rule continues commitment to serving low-income populations while focusing on the issue of obesity, a priority of this Administration. It ensures that interventions implemented as part of State nutrition education plans recognize the constrained resources of the eligible population., 388370=Agency Contact: James F. Herbert, Regulatory Review Specialist, Department of Agriculture, Food and Nutrition Service, 10th Floor, 3101 Park Center Drive, Alexandria, VA 22302, Phone: 703 305-2572, Email: james.herbert@fns.usda.gov., 858908=DHS is also committed to the principles described in Executive Orders 13563 and 12866 (as amended). Both Executive orders direct agencies to assess the costs and benefits of available regulatory alternatives and, if regulation is necessary, to select regulatory approaches that maximize net benefits (including potential economic, environmental, public health and safety effects, distributive impacts, and equity). Executive Order 13563 emphasizes the importance of quantifying both costs and benefits, of reducing costs, of harmonizing rules, and of promoting flexibility. Many of the regulations in DHS' regulatory plan support the Department's efforts pursuant to the DHS Final Plan for the Retrospective Review of Existing Regulations. DHS issued its final plan on August 22, 2011., 851601=Risks: If this regulation is not published, the Exchanges will not become operational by January 1, 2014, thereby violating the statute., 197211=Energy Effects—an indication of whether the agency has prepared or plans to prepare a Statement of Energy Effects for the action, as required by Executive Order 13211 “Actions Concerning Regulations That Significantly Affect Energy Supply, Distribution, or Use,” signed May 18, 2001 (66 FR 28355)., 453441=Statement of Need: FSIS is proposing these regulations to provide for the electronic import system, which will be available through the Agency's Public Health Information System (PHIS), a computerized, Web-based inspection information system. The import system will enable applicants to electronically submit and track import inspection applications that are required for all commercial entries of FSIS-regulated products imported into the U.S. FSIS inspection program personnel will be able to access the PHIS system to assign appropriate imported product inspection activities. The electronic import system will also facilitate the imported product foreign inspection and annual foreign establishment certifications by providing immediate and direct electronic government-to-government exchange of information. The Agency is proposing to delete the Canadian streamlined import inspection procedures because they have not been in use since 1990 and are obsolete. Sanitation SOPs are written procedures establishments develop, implement, and maintain to prevent direct contamination or adulteration of meat or poultry products. To ensure that imported meat and poultry products do not become contaminated while undergoing reinspection prior to entering the U.S., FSIS is proposing to clarify that official import inspection establishments must develop written Sanitation SOPs., 991486=Additional Information: CIS No. 2132-01; AG Order No. 2554-2002. There is a related rulemaking, CIS No. 2170-01, the new U nonimmigrant status (RIN 1615-AA67). Transferred from RIN 1115-AG19., 918777=Legal Authority: 8 U.S.C. 1103; 8 U.S.C. 1158; 8 U.S.C. 1226; 8 U.S.C. 1252; 8 U.S.C. 1282, 678352=What follows is an overview of the Department's regulatory priorities for FY 2012 and some of the regulations on the agenda that best exemplify these priorities., 687026=The Food Safety Modernization Act of 2010, signed into law by the President in January 2011, directs the Food and Drug Administration (FDA), working with a wide range of public and private partners, to build a new system of food safety oversight—one focused on applying the best available science and good common sense to prevent the problems that can make people sick. In implementing that Act, the Department's goal is to shift emphasis from removing unsafe products from the market place to keeping unsafe food from entering commerce in the first place., 334729=Legal Deadline: Final, Statutory, March 28, 2012., 676171=To implement this vast program portfolio, the Department develops an active regulatory agenda each year, driven largely by statutory mandates and interactions with stakeholders. The President also called upon Federal agencies to reform the regulatory process in his January 18, 2011, Executive Order 13563 “Improving Regulation and Regulatory Review.” A key directive in that Executive order was to require agencies to conduct an inventory of existing regulations to determine whether such regulations should be modified, streamlined, expanded, or repealed to make an agency's regulatory scheme more effective or less burdensome in achieving its programmatic objectives., 829351=Statement of Need: The statute requires that we establish each year, by regulation, payment amounts for all physicians' services furnished in all fee schedule areas. This major proposed rule would implement changes affecting Medicare Part B payment to physicians and other Part B suppliers. The final rule has a statutory publication date of November 1, 2012, and an implementation date of January 1, 2013., 657509=RIN: 1904-AC11, 634182=The overall plan for implementing the schedule is contained in the Report to Congress under section 141 of EPACT 2005 that was released on January 31, 2006. This plan was last updated in the August 2011 report to Congress and now includes the requirements of the Energy Independence and Security Act of 2007 (EISA 2007). The reports to Congress are posted at: http://www.eere.energy.gov/buildings/appliance_standards/schedule_setting.html. The August 2011 report identifies all products for which DOE has missed the deadlines established in EPCA (42 U.S.C. section 6291 et seq.). It also describes the reasons for such delays and the Department's plan for expeditiously prescribing new or amended standards. Information and timetables concerning these actions can also be found in the Department's regulatory agenda, which is posted online at: www.reginfo.gov., 992419=RIN: 1615-AA59, 534261=Summary of Legal Basis: The Export Administration Act of 1979, as amended, authorizes the President to prohibit or curtail exports for national security or foreign policy reasons. Section 3(1) of that Act provides that “It is the policy of the United States to minimize uncertainties in export control policy and to encourage trade with all countries with which the United States has diplomatic or trading relations, except those countries with which such trade has been determined by the President to be against the national interest.” Although the Export Administration Act of 1979 (EAA), as amended, expired on August 20, 2001, Executive Order 13222 of August 17, 2001 (3 CFR, 2001 Comp., p. 783 (2002)) as extended by Notice of August 12, 2010, 75 FR 50681 (Aug. 16, 2010) continues the EAR in effect under the International Emergency Economic Powers Act (IEEPA). The EAA and the IEEPA provide the President with the discretion to tailor controls, such as through the use of license exceptions and the creation of country groups in the implementing regulations, over different types of items based on their significance or other factors relevant to the national interest., 175000=Executive Order 13132 entitled “Federalism,” signed August 4, 1999 (64 FR 43255), directs agencies to have an accountable process to ensure meaningful and timely input by State and local officials in the development of regulatory policies that have “federalism implications” as defined in the Order. Under the Order, an agency that is proposing a regulation with federalism implications, which either preempt State law or impose nonstatutory unfunded substantial direct compliance costs on State and local governments, must consult with State and local officials early in the process of developing the regulation. In addition, the agency must provide to the Director of the Office of Management and Budget a federalism summary impact statement for such a regulation, which consists of a description of the extent of the agency's prior consultation with State and local officials, a summary of their concerns and the agency's position supporting the need to issue the regulation, and a statement of the extent to which those concerns have been met. As part of this effort, agencies include in their submissions for the Unified Agenda information on whether their regulatory actions may have an effect on the various levels of government and whether those actions have federalism implications., 847752=Agency Contact: Alissa DeBoy, Department of Health and Human Services, Centers for Medicare & Medicaid Services, 7500 Security Boulevard, Baltimore, MD 21244, Phone: 301 492-4428, Email: alissa.deboy@cms.hhs.gov., 665342=Agency Contact: Lucy Debutts, Office of Building Technologies Program, EE-2J, Department of Energy, Energy Efficiency and Renewable Energy, 1000 Independence Avenue SW., Washington, DC 20585, Phone: 202 287-1604, Email: lucy.debutts@ee.doe.gov., 316635=Sunset Review (2012)—Nutrient Vitamins and Minerals. On March 26, 2010, the National Organic Program (NOP) issued an Advanced Notice of Proposed Rulemaking (ANPRM) announcing the National Organic Standards Board's (NOSB) sunset review of exempted and prohibited substances codified at the National List of Allowed and Prohibited Substances of the NOP regulations. This review included a listing for “Nutrient vitamins and minerals” scheduled to sunset on October 21, 2012. AMS intends to publish a proposed rule to address a recommendation submitted by the NOSB for this listing. This proposed rule would continue the exemption (use) for nutrient vitamins and minerals for 5 years after the October 21, 2012, sunset date. This proposed rule would amend the annotation for nutrient vitamins and minerals to correct an inaccurate cross reference to U.S. Food and Drug Administration (FDA) regulations as AMS determined that the current exemption for the use of nutrient vitamins and minerals in organic products in the NOP regulations is inaccurate. In effect, the proposed amendment would clarify what synthetic substances are allowed as nutrient vitamins and minerals in organic products. Further, the NOP regulations do not correctly provide for the fortification of infant formula that would meet FDA requirements. This proposed rule would incorporate the correct FDA citation with respect to the addition of required vitamins and minerals to organic infant formula., 802612=Summary of Legal Basis: On March 23, 2010, the Affordable Care Act (Pub. L. 111-148) was signed into law. Section 4205 of the Affordable Care Act amended 403(q)(5) of the Federal Food, Drug, and Cosmetic Act (FD Act) by, among other things, creating new clause (H) to require that certain chain restaurants and similar retail food establishments with 20 or more locations disclose certain nutrient information for standard menu items. FDA has the authority to issue this rule under sections 403(a)(1), 403(q)(5)(H), and 701(a) of the FD Act (21 U.S.C. 343(a)(1), 343(q)(5)(H), and 371(a)). Section 701(a) of the FD Act vests the Secretary of Health and Human Services, and, by delegation, the Food and Drug Administration (FDA) with the authority to issue regulations for the efficient enforcement of the FD Act., 428445=The action allows for 100 percent Federal funding which gives States more flexibility to target services where they can be most effective without the constraints of a State match. For 3 years after enactment, States will receive grant funds based on their level of funds expended for the 2009 base year with funds indexed for inflation thereafter. The new funding structure is phased in over a 7-year period. From fiscal year 2014 forward, funds will be allocated based on a formula that considers participation., 830301=Anticipated Cost and Benefits: Total expenditures will be adjusted for CY 2013., 906848=Legal Deadline: NPRM, Statutory, May 26, 2008, Publication of Notice of Proposed Rulemaking., 957543=Legal Authority: 5 U.S.C. 301; 5 U.S.C. 552; 5 U.S.C. 552a; 8 U.S.C. 1101; 8 U.S.C. 1103, 386382=Summary of Legal Basis: Section 4132, Food, Conservation, and Energy Act of 2008 (Pub. L. 110-246)., 801676=Abstract: The Food and Drug Administration (FDA) published a proposed rule in the Federal Register of April 6, 2011 (72 FR 19192), to establish requirements for nutrition labeling of standard menu items in chain restaurants and similar retail food establishments. FDA also proposed the terms and conditions for restaurants and similar retail food establishments registering to voluntarily be subject to the Federal requirements. FDA took this action to carry out section 4205 of the Patient Protection and Affordable Care Act (“Affordable Care Act” or “ACA”), which was signed into law on March 23, 2010., 616536=We are proposing these amendments to reduce unnecessary burden on a public agency's ability to access public benefits or insurance in appropriate circumstances but still maintain critical parent protections, and we do this for several reasons. Specifically, we are mindful of the importance of ensuring that parents have sufficient information to make decisions about a public agency's use of their public benefits or insurance and the disclosure of their child's educational records for that purpose. At the same time, these proposed amendments are designed to address the concern expressed to the Department by many State personnel and other interested parties that, since the publication of the part B regulations in 2006, the inability to obtain parental consent has contributed to public agencies' failure to claim all of the Federal financial assistance available for part B services covered under Medicaid. In addition, public agencies have expressed concern over using limited resources and the significant administrative burden of obtaining parental consent for the use of Medicaid and other public benefits or insurance each time that access to public benefits or insurance is sought. Consequently, many of these parties have requested that the Department remove the parental consent requirement., 773961=Alternatives: The 1986 amendments require the Secretary (and, by delegation, FDA) to establish, by regulation, requirements for quality factors and CGMPs, including quality control procedures. Therefore, there are no alternatives to rulemaking., 572110=Because of its diversified nature, DoD is affected by the regulations issued by regulatory agencies such as the Departments of Energy, Health and Human Services, Housing and Urban Development, Labor, Transportation, and the Environmental Protection Agency. In order to develop the best possible regulations that embody the principles and objectives embedded in E.O. 12866, there must be coordination of proposed regulations among the regulatory agencies and the affected DoD components. Coordinating the proposed regulations in advance throughout an organization as large as DoD is straightforward, yet a formidable undertaking., 759393=Legal Deadline: Final, Statutory, July 2012, Promulgate implementing regulations. Per Public Law 111-353, section 307(c)(5)(C), promulgate, within 18 months of enactment, implementing regulations for accreditation of third-party auditors to conduct food safety audits., 53298=Posted by Ben Jordi on June 4, 2015, 899249=General Aviation Security and Other Aircraft Operator Security. TSA plans to issue a Supplemental Notice of Proposed Rulemaking (SNPRM) to propose amendments to current aviation transportation security regulations to enhance the security of general aviation (GA) by expanding the scope of current requirements and by adding new requirements for certain GA aircraft operators. To date, the Government's focus with regard to aviation security generally has been on air carriers and commercial operators. As vulnerabilities and risks associated with air carriers and commercial operators have been reduced or mitigated, terrorists may perceive that GA aircraft are more vulnerable and may view them as attractive targets. This rule would enhance aviation security by requiring operators of certain GA aircraft to adopt a security program and to undertake other security measures. TSA published a Notice of Proposed Rulemaking on October 30, 2008, and received over 7,000 public comments, generally urging significant changes to the proposal. The SNPRM will respond to the comments and contain proposals on addressing security in the GA sector., 980673=Agency Contact: William K Renwick, Supervisory Citizenship and Immigration Appeals Officer, Department of Homeland Security, U.S. Citizenship and Immigration Services, Administrative Appeals Office, Washington, DC 20529-2090, Phone: 703 224-4501, Email: william.k.renwick@dhs.gov., 904984=A more detailed description of the priority regulations that comprise DHS's fall 2011 regulatory plan follows., 850469=Summary of Legal Basis: This rule implements the new Affordable Insurance Exchanges consistent with title I of the Affordable Care Act of 2010., 466701=Agency Contact: Dr. Ron Jones, Assistant Administrator, Office of International Affairs, Department of Agriculture, Food Safety and Inspection Service, 1400 Independence Avenue SW., Washington, DC 20250, Phone: 202 720-3473., 952787=This rule is also proposed in compliance with Executive Order 13571 “Streamlining Service Delivery and Improving Customer Service.” See Executive Order No. 13571, 76 FR 24339 (Apr. 27, 2011). Executive Order 13571 tasks each Federal department and agency with establishing an initiative that uses technology to improve the experience of individuals and entities receiving services from that Federal department or agency. See Executive Order No. 13571, section 2(a)., 352301=Statement of Need: The Farm Security and Rural Investment Act of 2002 amended the definition of animal in the Animal Welfare Act (AWA) by specifically excluding birds, rats of the genus Rattus, and mice of the genus Mus, bred for use in research. While the definition of animal in the regulations contained in 9 CFR part 1 has excluded rats of the genus Rattus and mice of the genus Mus bred for use in research, that definition has also excluded all birds (i.e., not just those birds bred for use in research). In line with this change to the definition of animal in the AWA, APHIS intends to establish standards in 9 CFR part 3 for the humane handling, care, treatment, and transportation of birds other than those birds bred for use in research and to revise the regulations in 9 CFR parts 1 and 2 to make them applicable to birds., 568239=Anticipated Cost and Benefits: This action is not expected to have adverse economic impacts, and any such impacts would be well below the economic threshold of impact pursuant to E.O. 12866. Potential benefits, if any, would be indirect and accrue to internationally managed fisheries by strengthening Regional Fishery Management Organizations and by restricting U.S. market access through prohibiting illegally harvested fishery products., 830447=Risks: If this regulation is not published timely, physician services will not be paid appropriately, beginning January 1, 2013., 53358=On June 2, 2015, the Office of the Federal Register (OFR) hosted its 3rd Annual Federal Register Liaison Conference in the National Archives’ McGowan Theater. What exactly is a Federal... Continue reading →, 674876=The Department of Health and Human Services is the Federal Government's principal agency charged with protecting the health of all Americans and providing essential human services, especially for those least able to help themselves. The Department operates more than 300 programs covering a wide spectrum of activities, manages almost a quarter of all Federal outlays, and administers more grant dollars than all other Federal agencies combined. The Department's major program responsibilities include: Medicare and Medicaid; control and prevention of communicable and chronic disease; support for public health preparedness and emergency response; biomedical research; substance abuse and mental health treatment and prevention; assuring safe and effective drugs, devices, and other medical products; protecting the food supply; assistance to low-income families; the Head Start program; and improving access to health care services to the uninsured, isolated, or medically vulnerable. Currently, the Department is the principal agency charged with implementing one of the President's signature achievements—transformative health care reform through the Affordable Care Act of 2010., 626623=Legal Authority: 20 U.S.C. 1070a; 20 U.S.C. 1071 to 1087-4; 20 U.S.C. 1087a to 1087j; 20 U.S.C. 1098e; Pub. L. 111-152, 381457=Agency Contact: Neil Hammerschmidt, Program Manager, Animal Disease Traceability, VS, Department of Agriculture, Animal and Plant Health Inspection Service, 4700 River Road, Unit 46, Riverdale, MD 20737-1231, Phone: 301 734-5571., 903992=As part of this proposed rule, TSA will propose revisions to the Alien Flight Student Program (AFSP) regulations. TSA published an interim final rule for ASFP on September 20, 2004. TSA regulations require aliens seeking to train at Federal Aviation Administration-regulated flight schools to complete an application and undergo an STA prior to beginning flight training. There are four categories under which students currently fall; the nature of the STA depends on the student's category. TSA is considering changes to the AFSP that would improve equity among fee payers and enable the implementation of new technologies to support vetting., 992291=Related RIN: Related to 1615-AA67., 849552=Legal Deadline: Final, Statutory, January 1, 2014., 558337=Abstract: In June 1970, the northern right whale was listed as endangered under the Endangered Species Conservation Act, the precursor to the Endangered Species Act (ESA) (35 FR 8495; codified at 50 CFR 17.11). Subsequently, right whales were listed as endangered under the ESA in 1973, and as depleted under the Marine Mammal Protection Act (MMPA) the same year. In 1994, NMFS designated critical habitat for the northern right whale, a single species thought at the time to include right whales in both the north Atlantic and the North Pacific., 823355=Legal Deadline: Final, Statutory, November 1, 2012., 794103=Summary of Legal Basis: On March 23, 2010, the Affordable Care Act (Pub. L. 111-148) was signed into law. Section 4205 amended 403(q)(5) of the Federal Food, Drug, and Cosmetic Act (FD Act) by, among other things, creating new clause (H) to require that vending machine operators, who own or operate 20 or more machines, disclose calories for certain food items. FDA has the authority to issue this rule under sections 403(q)(5)(H) and 701(a) of the FD Act (21 U.S.C. 343(q)(5)(H), and 371(a)). Section 701(a) of the FD Act vests the Secretary of Health and Human Services, and, by delegation, the Food and Drug Administration (FDA) with the authority to issue regulations for the efficient enforcement of the FD Act., 342355=Abstract: This proposed rule would address a recommendation submitted to the Secretary of Agriculture (Secretary) by the National Organic Standards Board (NOSB) on April 29, 2011. The recommendation pertains to the 2012 Sunset Review of the listing for nutrient vitamins and minerals on the U.S. Department of Agriculture's (USDA) National List of Allowed and Prohibited Substances (National List). As recommended by the NOSB, the proposed rule would continue the exemption (use) for nutrient vitamins and minerals for 5 years after the October 21, 2012, sunset date. In addition, the proposed rule would amend the annotation to correct an inaccurate cross reference to U.S. Food and Drug Administration regulations. The proposed amendment to the annotation would clarify what synthetic substances are allowed as nutrient vitamins and minerals in organic products labeled as “organic” or “made with organic (specified ingredients or food group(s)).”, 174078=Executive Order 12866 entitled “Regulatory Planning and Review,” signed September 30, 1993 (58 FR 51735), requires covered agencies to prepare an agenda of all regulations under development or review. The Order also requires that certain agencies prepare annually a regulatory plan of their “most important significant regulatory actions,” which appears as part of the fall Unified Agenda. Executive Order 13497, signed January 30, 2009 (74 FR 6113), revoked the amendments to Executive Order 12866 that were contained in Executive Order 13258 and Executive Order 13422., 500164=While most of the rulemakings undertaken by NOAA do not rise to the level necessary to be included in the Department's regulatory plan, NMFS is undertaking four actions that rise to the level of “most important” of the Department's significant regulatory actions and thus are included in this year's regulatory plan. The four actions implement provisions of the Magnuson-Stevens Fishery Conservation and Management Act, as reauthorized in 2006. The third action may be of particular interest to international trading partners as it concerns the Certification of Nations Whose Fishing Vessels are Engaged in Illegal, Unreported, and Unregulated Fishing or Bycatch of Protected Living Marine Resources. A description of the four regulatory plan actions is provided below., 171066=The activities included in the Agenda are, in general, those that will have a regulatory action within the next 12 months. Agencies may choose to include activities that will have a longer timeframe than 12 months. Agency agendas also show actions or reviews completed or withdrawn since the last Unified Agenda. Executive Order 12866 does not require agencies to include regulations concerning military or foreign affairs functions or regulations related to agency organization, management, or personnel matters., 647589=Summary of Legal Basis: Section 312 of the Energy Independence and Security Act of 2007 (EISA) establishes definitions and standards for walk-in coolers and walk-in freezers. EISA directs DOE to establish performance-based standards not later than January 1, 2012 (42 U.S.C. 6313 (f)(4))., 907007=Abstract: This rulemaking will implement the December 2007 amendment to the Homeland Security Act entitled “Secure Handling of Ammonium Nitrate.” The amendment requires the Department of Homeland Security to “regulate the sale and transfer of ammonium nitrate by an ammonium nitrate facility * * * to prevent the misappropriation or use of ammonium nitrate in an act of terrorism.”, 630462=Agency Contact: David Bergeron, Department of Education, Office of Postsecondary Education, Room 8022, 1990 K Street NW., Washington, DC 20006, Phone: 202 502-7815, Email: david.bergeron@ed.gov., 839829=Summary of Legal Basis: The provisions that are included in this rule are necessary to implement the requirements of sections 1413, 1414, 2001, 2002, 2101, and 2201 of the Affordable Care Act., 605634=Race to the Top—Early Learning Challenge (RTT-ELC). On May 25, 2011, Secretary Duncan and the Secretary of Health and Human Services, Kathleen Sebelius, announced the RTT-ELC, a new $500 million State-level grant competition to be held in 2011 and authorized under ARRA and the FY 2011 Appropriations Act. The Departments of Education and Health and Human Services are administering this competition jointly. At its core is a strong commitment by the Administration to stimulate a national effort to make sure all children enter kindergarten ready to succeed. Through the RTT-ELC, the Administration seeks to help close the achievement gap between children with high needs and their peers by supporting State efforts to build strong systems of early learning and development that provide increased access to high-quality programs for the children who need it most. This competition represents an unprecedented opportunity for States to focus deeply on their early learning and development systems for children from birth through age five. It is an opportunity to build a more unified approach to supporting young children and their families—an approach that increases access to high-quality early learning and development programs and services, and helps ensure that children enter kindergarten with the skills, knowledge, and dispositions toward learning that they need to be successful., 52659=Posted by Ben Jordi on June 22, 2015, 462737=Summary of Legal Basis: 21 U.S.C. 601 to 695; 21 U.S.C. 451 to 470; 21 U.S.C. 1031 to 1056; 7 U.S.C. 1622(h)., 369750=Summary of Legal Basis: The Food, Conservation, and Energy Act of 2008 (Pub. L. 110-246, signed into law on Jun. 18, 2008) added a new section to the Animal Welfare Act (7 U.S.C. 2147) to restrict the importation of live dogs for resale. As amended, the AWA now prohibits the importation of dogs into the United States for resale unless the Secretary of Agriculture determines that the dogs are in good health, have received all necessary vaccinations, and are at least 6 months of age. Exceptions are provided for dogs imported for research purposes or veterinary treatment. An exception to the 6-month age requirement is also provided for dogs that are lawfully imported into Hawaii for resale purposes from the British Isles, Australia, Guam, or New Zealand in compliance with the applicable regulations of Hawaii, provided the dogs are vaccinated, are in good health, and are not transported out of Hawaii for resale purposes at less than 6 months of age., 325584=Land Management Planning Rule. FS is required to issue rulemaking for National Forest System land management planning under 16 U.S.C. 1604. The first planning rule was adopted in 1979, and amended in 1982. FS published a new planning rule on April 21, 2008 (73 FR 21468). On June 30, 2009, the United States District Court for the Northern District of California invalidated FS' 2008 Planning Rule published at 36 CFR 219 based on violations of NEPA and the Endangered Species Act in the rulemaking process. The District Court vacated the 2008 rule, enjoined USDA from further implementing it, and remanded it to USDA for further proceedings. USDA has determined that the 2000 planning rule is now in effect, including its transition provisions as amended in 2002 and 2003, and as clarified by interpretative rules issued in 2001 and 2004, which allows the use of the provisions of the 1982 planning rule to amend or revise plans. FS is now in the 2000 planning rule transition period. FS published a proposed planning rule on February 14, 2011 (76 FR 8480). The final rule is expected to be published December 2011. In so doing, FS plans to correct deficiencies that have been identified over two decades of forest planning and update planning procedures to reflect contemporary collaborative planning practices., 835657=Risks: If this regulation is not published timely, inpatient hospital and LTCH services will not be paid appropriately beginning October 1, 2012., 741929=FDA last updated its food CGMP regulations for the manufacturing, packing, or holding of human food in 1986. Modernizing these food CGMP regulations to address risk-based preventive controls and more explicitly address issues such as environmental pathogens, food allergens, mandatory employee training, and sanitation of food contact surfaces, would be a critical step in raising the standards for food production and distribution. By amending 21 CFR 110 to modernize good manufacturing practices, the agency could focus the attention of food processors on measures that have been proven to significantly reduce the risk of food-borne illness. An amended regulation also would allow the agency to better focus its regulatory efforts on ensuring industry compliance with controls that have a significant food safety impact., 900456=Security Training for Surface Mode Employees. TSA will propose regulations to enhance the security of several non-aviation modes of transportation. In particular, TSA will propose regulations requiring freight railroad carriers, public transportation agencies (including rail mass transit and bus systems), passenger railroad carriers, and over-the-road bus operators to conduct security training for front line employees. This regulation would implement sections 1408 (Public Transportation), 1517 (Freight Railroads), and 1534(a) (Over the Road Buses) of the Implementing Recommendations of the 9/11 Commission Act of 2008 (9/11 Act), Public Law 110-53 (Aug. 3, 2007). In compliance with the definitions of frontline employees in the pertinent provisions of the 9/11 Act, the Notice of Proposed Rulemaking (NPRM) would define which employees are required to undergo training. The NPRM would also propose definitions for transportation security-sensitive materials, as required by section 1501 of the 9/11 Act., 917990=RIN: 1601-AA52, 198493=Alternatives—a description of the alternatives the agency has considered or will consider as required by section 4(c)(1)(B) of Executive Order 12866., 191051=Unfunded Mandates—whether the rule is covered by section 202 of the Unfunded Mandates Reform Act of 1995 (Pub. L. 104-4). The Act requires that, before issuing an NPRM likely to result in a mandate that may result in expenditures by State, local, and tribal governments, in the aggregate, or by the private sector of more than $100 million in 1 year, agencies, other than independent regulatory agencies, shall prepare a written statement containing an assessment of the anticipated costs and benefits of the Federal mandate., 1005097=Abstract: This final rule amends the Department of Homeland Security (DHS) and the Department of Justice (DOJ) regulations to comply with the Consolidated Natural Resources Act of 2008 (CNRA). The CNRA extends the immigration laws of the United States to the Commonwealth of the Northern Mariana Islands (CNMI). This rule finalizes the interim rule and implements conforming amendments to their respective regulations., 668415=Summary of Legal Basis: The Energy Policy and Conservation Act (EPCA) of 1975 (42 U.S.C. 6291 to 6309) established an energy conservation program for major household appliances. Amendments to EPCA in the National Appliance Energy Conservation Amendments of 1988 (NAECA 1988) established energy conservation standards for fluorescent lamp ballasts. These amendments also required that DOE (1) conduct two rulemaking cycles to determine whether these standards should be amended, and (2) for each rulemaking cycle, determine whether the standards in effect for fluorescent lamp ballasts should be amended to apply to additional fluorescent lamp ballasts. (42 U.S.C. 6295(g)(7)(A) and (B)). On September 19, 2000, DOE published a final rule in the Federal Register, which completed the first rulemaking cycle to amend energy conservation standards for fluorescent lamp ballasts. 65 FR 56740. This rulemaking encompasses DOE's second cycle of review to determine whether the standards in effect for fluorescent lamp ballasts should be amended and whether the standards should be applicable to additional fluorescent lamp ballasts., 644944=Agency Contact: Victor Petrolati, Office of Building Technologies Program, EE-2J, Department of Energy, Energy Efficiency and Renewable Energy, 1000 Independence Avenue SW., Washington, DC 20585, Phone: 202 586-4549, Email: victor.petrolati@ee.doe.gov., 498664=The Endangered Species Act of 1973 (ESA) provides for the conservation of species that are determined to be “endangered” or “threatened,” and the conservation of the ecosystems on which these species depend. The ESA authorizes both NMFS and the Fish and Wildlife Service (FWS) to jointly administer the provisions of the MMPA. NMFS manages marine and “anadromous” species, and FWS manages land and freshwater species. Together, NMFS and FWS work to protect critically imperiled species from extinction. Of the 1,310 listed species found in part or entirely in the United States and its waters, NMFS has jurisdiction over approximately 60 species. NMFS' rulemaking actions are focused on determining whether any species under its responsibility is an endangered or threatened species and whether those species must be added to the list of protected species. NMFS is also responsible for designating, reviewing, and revising critical habitat for any listed species. In addition, under the ESA's procedural framework, Federal agencies consult with NMFS on any proposed action authorized, funded, or carried out by that agency that may affect one of the listed species or designated critical habitat, or is likely to jeopardize proposed species or adversely modify proposed critical habitat that is under NMFS' jurisdiction., 206090=All editions of The Regulatory Plan and the Unified Agenda of Federal Regulatory and Deregulatory Actions since fall 1995 are available in electronic form at http://reginfo.gov, along with flexible search tools., 459620=Legal Authority: Federal Meat Inspection Act (FMIA) (21 U.S.C. 601 to 695); Poultry Products Inspection Act (PPIA) (21 U.S.C. 451 to 470); Egg Products Inspection Act (EPIA) (21 U.S.C. 1031 to 1056), 195402=Included in the Regulatory Plan—whether the rulemaking was included in the agency's current regulatory plan published in fall 2010., 889828=The mission of the Federal Emergency Management Agency (FEMA) is to support our citizens and first responders to ensure that, as a Nation, we work together to build, sustain, and improve our capability to prepare for, protect against, respond to, recover from, and mitigate all hazards. In fiscal year 2012, FEMA will continue to serve that mission and promote the Department of Homeland Security's goals. In furtherance of the Department and Agency's goals, in the upcoming fiscal year, FEMA will work on regulations to implement provisions of the Post-Katrina Emergency Management Reform Act of 2006 (PKEMRA) (Pub. L. 109-295, Oct. 4, 2006) and to implement lessons learned from past events., 651594=Agency Contact: Charles Llenza, Office of Building Technologies Program, EE-2J, Department of Energy, Energy Efficiency and Renewable Energy, 1000 Independence Avenue SW., Washington, DC 20585, Phone: 202 586-2192, Email: charles.llenza@ee.doe.gov., 965388=Agency Contact: Dan Konnerth, Policy and Coordination Chief, Office of Transformation Coordination, Department of Homeland Security, U.S. Citizenship and Immigration Services, 6th Floor, 633 Third Street NW., Washington, DC 20529, Phone: 202 233-2381, Email: dan.konnerth@dhs.gov., 451241=Legal Authority: Federal Meat Inspection Act (FMIA) (21 U.S.C. 601 to 695), the Poultry Products Inspection Act (PPIA) (21 U.S.C. 451 to 470); Egg Products Inspection Act (EPIA) (21 U.S.C. 1031 to 1056), 901697=Railroad Carrier Vulnerability Assessment and Security Plans. TSA will also propose regulations requiring high-risk freight and passenger railroads to conduct vulnerability self-assessments, as well as develop and implement comprehensive security plans. TSA would need to approve both the vulnerability assessment and security plan. This regulation, implementing section 1512 of the 9/11 Act, would include proposed provisions to identify which railroads would be considered high-risk and include proposed provisions about the associated vulnerability assessment and security planning requirements., 748939=Legal Deadline: Final, Statutory, January 4, 2012., 618573=Congress may reauthorize the Adult Education and Family Literacy Act (AEFLA) (title II of the Workforce Investment Act of 1998) and the Rehabilitation Act of 1973 (title IV of the Workforce Investment Act of 1998). The Administration is working with Congress to ensure that any changes to these laws (1) improve the State grant and other programs providing assistance for adult education under the AEFLA and for vocational rehabilitation and independent living services for persons with disabilities under the Rehabilitation Act of 1973; and (2) provide greater accountability in the administration of programs under both statutes. Changes to our regulations may be necessary as a result of the reauthorization of these two statutes., 628726=Summary of Legal Basis: Health Care and Education Reconciliation Act of 2010, Public Law 111-152., 928575=RIN: 1615-AA41, 320156=The Agricultural Marketing Service (AMS) convened the Wholesale Pork Reporting Negotiated Rulemaking Committee (Committee) through notice in the Federal Register on January 26, 2011. The Committee met three times over the period February through May of 2011 to develop the regulatory framework necessary to implement a mandatory program of wholesale pork reporting., 397434=Statement of Need: This proposed rule would revise and expand regulations regarding WIC EBT at 7 CFR 246 and implement statutory provisions related to EBT as defined in the Healthy, Hunger-Free Kids Act of 2010, 11. The EBT requirements addressed in the proposed rule would promote improved access to program benefits, standardize EBT operations, and establish implementation guidelines and timeframes., 771683=In 1986, Congress, as part of the Anti-Drug Abuse Act of 1986 (99) (the 1986 amendments), amended section 412 of the act to address concerns that had been expressed by Congress and consumers about the 1980 Act and its implementation related to the sufficiency of quality control testing, CGMP, recordkeeping, and recall requirements. The 1986 amendments: (1) State that an infant formula is deemed to be adulterated if it fails to provide certain required nutrients, fails to meet quality factor requirements established by the Secretary (and, by delegation, FDA), or if it is not processed in compliance with the CGMP and quality control procedures established by the Secretary; (2) require that the Secretary issue regulations establishing requirements for quality factors and CGMP, including quality control procedures; (3) require that infant formula manufacturers regularly audit their operations to ensure that those operations comply with CGMP and quality control procedure regulations; (4) expand the circumstances in which firms must make a submission to the Agency to include when there is a major change in an infant formula or a change that may affect whether the formula is adulterated; (5) specify the nutrient quality control testing that must be done on each batch of infant formula; (6) modify the infant formula recall requirements; and (7) give the Secretary authority to establish requirements for retention of records, including records necessary to demonstrate compliance with CGMP and quality control procedures. In 1989, the Agency implemented the provisions on recalls (secs. 412(f) and (g) of the Act) by establishing subpart E in 21 CFR part 107 (54 FR 4006, Jan. 27, 1989). In 1991, the Agency implemented the provisions on record and record retention requirements by revising 21 CFR 106.100 (56 FR 66566, Dec. 24, 1991)., 817872=Statement of Need: In January 2011, the President issued an Executive order that requires agencies to identify rules that may be “outmoded, ineffective, insufficient, or excessively burdensome, and to modify, streamline, expand, or repeal them in accordance with what has been learned.” In accordance with the Executive order, we identified obsolete and unnecessarily burdensome rules that could be eliminated or reformed to achieve similar objectives, with a particular focus on freeing up resources that health care providers, health plans, and States could use to improve or enhance patient health and safety. We examined policies and practices not codified in rules that could be changed or streamlined to achieve better outcomes for patients while reducing burden on providers of care. We also sought to increase transparency and become a better business partner., 404424=The current regulations require that reimbursable meals offered by schools meet the applicable recommendations of the Dietary Guidelines for Americans. This rule would revise the regulations on meal patterns and nutrition standards to ensure that school meals reflect the 2005 Dietary Guidelines for Americans (04-017)., 201338=FY—The Federal fiscal year runs from October 1 to September 30., 746863=Agency Contact: John F. Sheehan, Director, Office of Food Safety, Division of Plant and Dairy Food Safety, Department of Health and Human Services, Food and Drug Administration, Center for Food Safety and Applied Nutrition (HFS-315), 5100 Paint Branch Parkway, College Park, MD 20740, Phone: 240 402-1488, Fax: 301 436-2632, Email: john.sheehan@fda.hhs.gov., 484787=Agency Contact: Victoria Levine, Program Analyst, Policy Issuances Division, Department of Agriculture, Food Safety and Inspection Service, 1400 Independence Avenue SW., Washington, DC 20250, Phone: 202 720-5627, Fax: 202 690-0486, Email: victoria.levine@fsis.usda.gov., 565950=This action is not expected to have adverse economic impacts, and any such impacts would be well below the economic threshold of impact pursuant to E.O. 12866. In addition, there are no novel legal or policy issues associated with this action since identification and certification procedures have already been established in regulations (50 CFR part 300). However, this action is significant under the meaning of E.O. 12866 because it could lead to trade restrictive measures applied against foreign nations., 603368=The Race to the Top Fund program, the largest competitive education grant program in U.S. history, is designed to provide incentives to States to implement system-changing reforms that result in improved student achievement, narrowed achievement gaps, and increased high school graduation and college enrollment rates. Congress authorized and provided $4.35 billion for ARRA in 2010, and the Department awarded approximately $4 billion in Race to the Top State grant funds in two phases. The Department awarded $600 million to Delaware and Tennessee under the Race to the Top Phase 1 competition and approximately $3.4 billion to the winners of the Phase 2 competition: The District of Columbia, Florida, Georgia, Hawaii, Maryland, Massachusetts, New York, North Carolina, Ohio, and Rhode Island., 727678=Agency Contact: John J. Crowley, Senior Advisor for Patient Safety, Department of Health and Human Services, Food and Drug Administration, Center for Devices and Radiological Health, WO 66, Room 2315, 10903 New Hampshire Avenue, Silver Spring, MD 20993, Phone: 301 980-1936, Email: jay.crowley@fda.hhs.gov., 356587=Agency Contact: Johanna Briscoe, Veterinary Medical Officer and Avian Specialist, Animal Care, Department of Agriculture, Animal and Plant Health Inspection Service, 4700 River Road, Unit 84, Riverdale, MD 20737-1234, Phone: 301 734-0658., 157647=To provide comment on or to obtain further information about this publication, contact: John C. Thomas, Executive Director, Regulatory Information Service Center (MI), General Services Administration, One Constitution Square, 1275 First Street NE., 642, Washington, DC 20417, 202 482-7340. You may also send comments to us by email at: RISC@gsa.gov., 604209=In announcing the winners of the Race to the Top Phase 2 competition, the Secretary noted that “[we] had many more competitive applications than money to fund them in this round” and expressed the hope that any Race to the Top funding included in the Department's FY 2011 appropriations would be available for Race to the Top Phase 3 awards. In particular, there were nine finalists in the Phase 2 competition that did not receive funding despite submitting bold and ambitious plans for comprehensive reforms and innovations in their systems of elementary and secondary education. These nine finalists were: Arizona, California, Colorado, Illinois, Kentucky, Louisiana, New Jersey, Pennsylvania, and South Carolina., 836694=Agency Contact: Ankit Patel, Health Insurance Specialist, Division of Acute Care, Department of Health and Human Services, Centers for Medicare & Medicaid Services, Hospital and Ambulatory Policy Group, Mail Stop, C4-25-11, 7500 Security Boulevard, Baltimore, MD 21244, Phone: 410 786-4537, Email: ankit.patel@cms.hhs.gov., 336220=Statement of Need: Implementation of mandatory pork reporting is required by Congress. Congress delegated responsibility to the Secretary for determining what information is necessary and appropriate. The Food, Conservation, and Energy Act of 2008 (Pub. L. 110-234) directed the Secretary to conduct a study to determine advantages, drawbacks, and potential implementation issues associated with adopting mandatory wholesale pork reporting. The report from this study generally concluded that voluntary wholesale pork price reporting is thin and becoming thinner, and some degree of support for moving to mandatory price reporting exists at every segment of the industry interviewed. The report was delivered to Congress on March 25, 2010., 571378=The Department of Defense (DoD) is the largest Federal department, consisting of 3 Military departments (Army, Navy, and Air Force), 10 Unified Combatant Commands, 14 Defense Agencies, and 10 DoD Field Activities. It has 1,434,450 military personnel and 782,386 civilians assigned as of March 31, 2011, and over 200 large and medium installations in the continental United States, U. S. territories, and foreign countries. The overall size, composition, and dispersion of DoD, coupled with an innovative regulatory program, presents a challenge to the management of the Defense regulatory efforts under Executive Order (E.O.) 12866 “Regulatory Planning and Review” of September 30, 1993., 949919=Summary of Legal Basis: Authority for this rule falls within the broad authority of the Secretary of Homeland Security to administer DHS, the administration of immigration and nationality laws, and other delegated authority. See Homeland Security Act of 2002, Public Law 107-296 section 102 (Nov. 25, 2002), 6 U.S.C. 112, and the Immigration and Nationality Act of 1952, as amended, section 103, 8 U.S.C. 1103., 337189=Summary of Legal Basis: Livestock Mandatory Reporting is authorized under the Agricultural Marketing Act (7 U.S.C. 1635 to 1636). The Livestock and Seed Program of USDA's Agricultural Marketing Service has day-to-day responsibility for collecting and disseminating LMR data., 458517=Agency Contact: Mary Stanley, Director, International Policy Division Office of Policy and Program, Department of Agriculture, Food Safety and Inspection Service, Room 2125, 1400 Independence Avenue SW., Washington, DC 20250, Phone: 202 720-0287., 607067=The Departments of Education and Health and Human Services have published requirements for the FY 2011 competition and will complete the competition and make awards by the end of 2011., 497490=The Marine Mammal Protection Act of 1972 (MMPA) provides the authority for the conservation and management of marine mammals under U.S. jurisdiction. It expressly prohibits, with certain exceptions, the take of marine mammals. Exceptions allow for permitting the collection of wild animals for scientific research or public display or to enhance the survival of a species or stock. NMFS initiates rulemakings under the MMPA to establish a management regime to reduce marine mammal mortalities and injuries as a result of interactions with fisheries. The MMPA also established the Marine Mammal Commission, which makes recommendations to the Secretaries of the Departments of Commerce and the Interior and other Federal officials on protecting and conserving marine mammals. The Act underwent significant changes in 1994 to allow for takings incidental to commercial fishing operations, to provide certain exemptions for subsistence and scientific uses, and to require the preparation of stock assessments for all marine mammal stocks in waters under U.S. jurisdiction., 691212=Two additional rules will also improve dietary information available to consumers. One is a revision to the nutrition and supplement facts labels. Much of the information found on the Nutrition Facts label has not been updated since 1993 when mandatory nutrition labeling of food was first required. The aim of the proposed revision is to provide updated and easier to read nutrition information on the label to help consumers maintain healthy dietary practices. The other proposed rule will focus on the serving sizes of foods that can reasonably consumed in one serving. This rule would amend the labeling regulations to provide updated reference amounts for certain food categories with new consumption data derived from the current National Health and Nutrition Survey., 894127=Continued Detention of Aliens Subject to Final Orders of Removal. ICE will improve the post order custody review process in a Final Rule related to the continued detention of aliens subject to final orders of removal in light of the U.S. Supreme Court's decisions in Zadvydas v. Davis, 533 U.S. 678 (2001) and Clark v. Martinez, 543 U.S. 371 (2005), as well as changes pursuant to the enactment of the Homeland Security Act of 2002. During fiscal year 2012, ICE will also issue a companion Notice of Proposed Rulemaking (NPRM) that will allow the public an opportunity to comment on new sections of the custody determination process not previously published for comment., 715425=Summary of Legal Basis: FDA's authority for issuing this rule is provided in FSMA (Pub. L. 111-353), which amended the FD Act by establishing section 418, which directed FDA to publish implementing regulations. FSMA also amended section 301 of the FD Act to add 301(uu) that states the operation of a facility that manufactures, processes, packs, or holds food for sale in the United States if the owner, operator, or agent in charge of such facility is not in compliance with section 418 of the FD Act is a prohibited act. Further authority comes from section 1002(a) of title X of the FDAAA of 2007 (21 U.S.C. 2102) requiring the Secretary to update standards for the processing of pet food., 170490=The Regulatory Information Service Center (the Center) compiles the Unified Agenda for the Office of Information and Regulatory Affairs (OIRA), part of the Office of Management and Budget. OIRA is responsible for overseeing the Federal Government's regulatory, paperwork, and information resource management activities, including implementation of Executive Order 12866. The Center also provides information about Federal regulatory activity to the President and his Executive Office, the Congress, agency managers, and the public., 1003287=RIN: 1615-AA60, 560343=In April 2008, a final critical habitat determination was published for the North Pacific right whale (73 FR 19000; Apr. 8, 2008). At this time, NMFS is preparing a proposal to designate critical habitat for the North Atlantic right whale., 904748=The United States Secret Service does not have any significant regulatory actions planned for fiscal year 2012., 835532=Anticipated Cost and Benefits: Total expenditures will be adjusted for FY 2013., 335361=Abstract: On September 15, 2010, Congress passed the Mandatory Price Reporting Act of 2010 reauthorizing Livestock Mandatory Reporting for 5 years and adding a provision for mandatory reporting of wholesale pork cuts. The Act was signed by the President on September 28, 2010. Congress directed the Secretary to engage in negotiated rulemaking to make required regulatory changes for mandatory wholesale pork reporting. Further, Congress required that the negotiated rulemaking committee include representatives from (i) organizations representing swine producers; (ii) organizations representing packers of pork, processors of pork, retailers of pork, and buyers of wholesale pork; (iii) the Department of Agriculture; and (iv) interested parties that participate in swine or pork production., 500978=1. Fishery Management Plan for Regulating Offshore Marine Aquaculture in the Gulf of Mexico (0648-AS65): In January 2009, the Gulf of Mexico Fishery Management Council approved the Aquaculture Fishery Management Plan, which authorizes NMFS to issue permits to culture species managed by the Council (except shrimp and corals). This was the first time a regional Fishery Management Council approved a comprehensive regulatory program for offshore aquaculture in U.S. Federal waters. On September 3, 2009, the Aquaculture Fishery Management Plan entered into effect by operation of law and Dr. Lubchenco announced that NOAA would develop a new National Aquaculture Policy, which would provide context for the Aquaculture Fishery Management Plan. On June 9, 2011, NOAA released the final National Aquaculture Policy and announced that the Agency will move forward with the rulemaking to implement the Aquaculture Fishery Management Plan. The Aquaculture Plan has received regional and national media attention and was challenged in two lawsuits. Although the lawsuits were dismissed, additional legal challenges are anticipated when the final rule is issued. A vocal coalition of environmental, non-governmental organizations and fishermen's groups opposed to marine aquaculture has been actively following the process. Others, including some fishing and seafood groups, support the Aquaculture Fishery Management Plan., 946861=RIN: 1615-AB89, 860416=Pursuant to section 6 of Executive Order 13563 “Improving Regulation and Regulatory Review” (Jan. 18, 2011), DHS identified the following regulatory actions in the Department's Final Plan for the Retrospective Review of Existing Regulations (“DHS Final Plan”). DHS has identified these regulatory actions as associated with retrospective review and analysis. You can view the DHS Final Plan on www.regulations.gov by searching for docket number DHS-2011-0015. Some of the regulatory actions on the below list may be completed actions, which do not appear in The Regulatory Plan. You can find more information about these completed rulemakings in past publications of the Unified Agenda (search the Completed Actions sections) on www.reginfo.gov. Some of the entries on this list, however, are active rulemakings. You can find entries for these rulemakings on www.regulations.gov., 778474=Agency Contact: Benson Silverman, Department of Health and Human Services, Food and Drug Administration, Center for Food Safety and Applied Nutrition (HFS-850), 5100 Paint Branch Parkway, College Park, MD 20740, Phone: 240 402-1459, Email: benson.silverman@fda.hhs.gov., 189022=A rulemaking that is not Economically Significant but is considered Significant by the agency. This category includes rules that the agency anticipates will be reviewed under Executive Order 12866 or rules that are a priority of the agency head. These rules may or may not be included in the agency's regulatory plan., 829050=Abstract: This annual proposed rule would revise payment polices under the physician fee schedule, as well as other policy changes to payment under Part B. These changes would be applicable to services furnished on or after January 1., 294641=In January 2011, President Obama issued Executive Order (E.O.) 13563 on Improving Regulation and Regulatory Review. As part of this E.O., agencies were asked to review existing rules that may be outmoded, ineffective, insufficient, or excessively burdensome, and to modify, streamline, expand, or repeal them accordingly. Reducing the regulatory burden on the American people and our trading partners is a priority for USDA, and we will continually work to improve the effectiveness of our existing regulations. As a result of our regulatory review efforts in 2011, USDA will make regulatory changes in 2012, including the following:, 485790=Established in 1903, the Department of Commerce is one of the oldest Cabinet-level agencies in the Federal Government. The Department's mission is to create the conditions for economic growth and opportunity by promoting innovation, entrepreneurship, competitiveness, and environmental stewardship. Commerce has 12 operating units, which are responsible for managing a diverse portfolio of programs and services, ranging from trade promotion and economic development assistance to broadband and the National Weather Service., 318860=Subsequently, the Mandatory Price Reporting Act of 2010 (2010 Reauthorization Act) (Pub. L. 111-239), was signed into law on September 28, 2010, and reauthorized Livestock Mandatory Reporting for 5 years and added a provision for mandatory reporting of wholesale pork cuts. The 2010 Reauthorization Act directed the Secretary to engage in negotiated rulemaking to make required regulatory changes for mandatory wholesale pork reporting., 647035=Abstract: The Energy Independence and Security Act of 2007 amendments to the Energy Policy and Conservation Act require that DOE establish maximum energy consumption levels for walk-in coolers and walk-in freezers., 984875=Abstract: T classification was created by 107(e) of the Victims of Trafficking and Violence Protection Act of 2000 (VTVPA), Public Law 106-386. The T nonimmigrant classification was designed for eligible victims of severe forms of trafficking in persons who aid law enforcement with their investigation or prosecution of the traffickers, and who can establish that they would suffer extreme hardship involving unusual and severe harm if they were removed from the United States. The rule establishes application procedures and responsibilities for the Department of Homeland Security and provides guidance to the public on how to meet certain requirements to obtain T nonimmigrant status. The Trafficking Victims Protection Reauthorization Act of 2008, Public Law 110-457, made amendments to the T nonimmigrant status provisions of the Immigration and Naturalization Act. The Department will issue another interim final rule to make the changes required by recent legislation and to provide the opportunity for notice and comment., 773730=The Agency has already promulgated regulations that respond to a number of the provisions of the 1986 amendments. The final rule would address additional provisions of these amendments., 449956=Agency Contact: Dr. Daniel L. Engeljohn, Assistant Administrator, Office of Policy and Program Development, Department of Agriculture, Food Safety and Inspection Service, 1400 Independence Avenue SW., Washington, DC 20250, Phone: 202 205-0495, Fax: 202 401-1760, Email: daniel.engeljohn@fsis.usda.gov., 871245=Application of the William Wilberforce Trafficking Victims Protection Act of 2008. In a joint rulemaking, DHS and DOJ will propose amendments to implement the William Wilberforce Trafficking Victims Protection Act of 2008 (TVPRA). Among other things, this statute specified that USCIS has initial jurisdiction over an asylum application filed by an unaccompanied alien child in removal proceedings before an immigration judge in DOJ. The agencies implemented this legislation with interim procedures that the TVPRA mandated within 90 days after enactment. The proposed rule would amend both agencies' regulations to finalize the procedures to determine when an alien child is unaccompanied and how jurisdiction is transferred to USCIS for initial adjudication of the child's asylum application. In addition, this rule would address adjustment of status for special immigrant juveniles and voluntary departure for unaccompanied alien children in removal proceedings., 472303=Anticipated Cost and Benefits: Benefits are expected to result from fewer contaminated products entering commercial food distribution channels as a result of improved sanitation and process controls and in-plant verification. FSIS believes that the benefits of the rule would exceed the total costs of implementing its provisions. FSIS currently estimates net benefits from the 2003 interim final rule at $470 to $575 million, with annual recurring costs at $150.4 million, if FSIS discounts the capital cost at 7 percent. FSIS is continuing to analyze the potential impact of the other provisions of the proposal., 419685=Summary of Legal Basis: Food, Conservation, and Energy Act of 2008 (Pub. L. 110-246)., 573378=The Department needs to function at a reasonable cost, while ensuring that it does not impose ineffective and unnecessarily burdensome regulations on the public. The rulemaking process should be responsive, efficient, cost-effective, and both fair and perceived as fair. This is being done in DoD while reacting to the contradictory pressures of providing more services with fewer resources. The Department of Defense, as a matter of overall priority for its regulatory program, fully incorporates the provisions of the President's priorities and objectives under Executive Order (E.O.) 12866., 939211=RIN: 1615-AA67, 674158=Related RIN: Related to 1904-AB77, Related to 1904-AA99., 418645=Statement of Need: This proposed rule would amend the regulations governing SNAP to implement provisions from the FCEA concerning the eligibility and certification of SNAP applicants and participants and SNAP employment and training. In addition, this proposed rule would revise the SNAP regulations throughout 7 CFR part 273 to change the program name from the Food Stamp Program to SNAP and to make other nomenclature changes as mandated by the FCEA. The statutory effective date of these provisions was October 1, 2008. FNS is also proposing two discretionary revisions to SNAP regulations to provide State agencies options that are currently available only through waivers. These provisions would allow State agencies to average student work hours and to provide telephone interviews in lieu of face-to-face interviews. FNS anticipates that this rule would impact the associated paperwork burdens., 71315=The fall 2011 Unified Agenda publication appearing in the Federal Register consists of agency regulatory flexibility agendas, in accordance with the publication requirements of the Regulatory Flexibility Act. Agency regulatory flexibility agendas contain only those Agenda entries for rules that are likely to have a significant economic impact on a substantial number of small entities and entries that have been selected for periodic review under section 610 of the Regulatory Flexibility Act., 838733=Legal Deadline: Final, Statutory, January 1, 2014., 207141=Dated: December 19, 2011., 667613=Legal Deadline: Final, Judicial, October 28, 2011., 311064=Catfish Inspection. FSIS is developing final regulations to implement provisions of the 2008 Farm Bill provisions that make catfish an amenable species under the Federal Meat Inspection Act (FMIA)., 608177=In 2010, the Administration released the Blueprint for Reform: The Reauthorization of the Elementary and Secondary Education Act, the President's plan for revising the Elementary and Secondary Education Act of 1965 (ESEA) and replacing the No Child Left Behind Act of 2001 (NCLB). The blueprint can be found at the following Web site: http://www2.ed. gov/policy/elsec/leg/blueprint/index.html., 424675=Legal Deadline: Final, Statutory, January 1, 2012, Pub. L. 111-296, 821383=Agency Contact: Michelle Shortt, Director, Regulations Development Group, OSORA, Department of Health and Human Services, Centers for Medicare & Medicaid Services, Mailstop C4-26-05, 7500 Security Boulevard, Baltimore, MD 21244, Phone: 410 786-4675, Email: michelle.shortt@cms.hhs.gov., 646919=Legal Deadline: Final, Statutory, January 1, 2012., 941131=CFR Citation: 8 CFR 1; 8 CFR 208; 8 CFR 244; 8 CFR 1244., 396662=Legal Deadline: NPRM, Statutory, October 1, 2020, Require all WIC State agencies to implement EBT Statewide., 956842=RIN: 1615-AB94, 890731=Public Assistance Program Regulations. FEMA will work to revise the Public Assistance Program regulations in 44 CFR part 206 to reflect changes made to the Robert T. Stafford Disaster Relief and Emergency Assistance Act by PKEMRA, the Pets Evacuation and Transportation Standards Act of 2006 (PETS Act) (Pub. L. 109-308, Oct. 6, 2006), the Local Community Recovery Act of 2006 (Pub. L. 109-218, Apr. 20, 2006), and the Security and Accountability for Every Port Act of 2006 (SAFE Port Act) (Pub. L. 109-347, Oct. 13, 2006), and to make other substantive and nonsubstantive clarifications and corrections to the Public Assistance regulations. The proposed changes would expand eligibility to include performing arts facilities and community arts centers pursuant to section 688 of PKEMRA; include education in the list of critical services pursuant to section 689(h) of PKEMRA, thus allowing private nonprofit educational facilities to be eligible for restoration funding; add accelerated Federal assistance to available assistance pursuant to section 681 of PKEMRA; include household pets and service animals in essential assistance pursuant to section 689 of PKEMRA and section 4 of the PETS Act; provide for expedited payments of grant assistance for the removal of debris pursuant to section 610 of the SAFE Port Act; and allow for a contract to be set aside for award based on a specific geographic area pursuant to section 2 of the Local Community Recovery Act of 2006. Other changes would include adding or changing requirements to improve and streamline the Public Assistance grant application process., 888515=In the above paragraphs, DHS discusses the CBP regulations that foster DHS's mission. CBP also issues regulations related to the mission of the Department of the Treasury. Under section 403(1) of the Homeland Security Act of 2002, the former U.S. Customs Service, including functions of the Secretary of the Treasury relating thereto, transferred to the Secretary of Homeland Security. As part of the initial organization of DHS, the Customs Service inspection and trade functions were combined with the immigration and agricultural inspection functions and the Border Patrol and transferred into CBP. It is noted that certain regulatory authority of the United States Customs Service relating to customs revenue function was retained by the Department of the Treasury (see the Department of the Treasury regulatory plan). In addition to its plans to continue issuing regulations to enhance border security, CBP, during fiscal year 2012, expects to continue to issue regulatory documents that will facilitate legitimate trade and implement the trade benefit program. CBP regulations regarding the customs revenue function are discussed in the regulatory plan of the Department of the Treasury., 972272=RIN: 1615-AB96, 562451=Agency Contact: Marta Nammack, Office of Protected Resources, Department of Commerce, National Oceanic and Atmospheric Administration, 1315 East-West Highway, Silver Spring, MD 20910, Phone: 301 713-1401, Fax: 301 427-2523, Email: marta.nammack@noaa.gov., 833329=Legal Deadline: NPRM, Statutory, April 1, 2012. Final, Statutory, August 1, 2012., 893051=The Federal Law Enforcement Training Center (FLETC) does not have any significant regulatory actions planned for fiscal year 2012., 883720=By shifting from a paper to an electronic form and requiring the data in advance of travel, CBP will be able to determine before the alien departs for the U.S. the eligibility of nationals from VWP countries to travel to the United States and to determine whether such travel poses a law enforcement or security risk. By modernizing the VWP, the ESTA is intended to increase national security and provide for greater efficiencies in the screening of international travelers by allowing for vetting of subjects of potential interest well before boarding, thereby reducing traveler delays based on lengthy processes at ports of entry. On August 9, 2010, CBP published an interim final rule amending the ESTA regulations to require ESTA applicants to pay a congressionally mandated fee, which is the sum of two amounts, a $10 travel promotion fee for an approved ESTA and a $4.00 operational fee for the use of ESTA set by the Secretary of Homeland Security to at least ensure the recovery of the full costs of providing and administering the ESTA system. During the next fiscal year, CBP intends to issue a final rule on ESTA and the ESTA fee., 850798=Anticipated Cost and Benefits: Payments through reinsurance, risk adjustment, and risk corridors reduce the increased risk of financial loss that health insurance issuers might otherwise expect to incur in 2014 due to market reforms such as guaranteed issue and the elimination of medical underwriting. These payments reduce the risk to the issuer and the issuer can pass on a reduced risk premium to enrollees. Administrative costs will vary across States and health insurance issuers depending on the sophistication of technical infrastructure and prior experience with data collection and risk adjustment. States and issuers that already have systems in place for data collection and reporting will have reduced administrative costs., 828932=Legal Deadline: Final, Statutory, November 1, 2012., 210995=It is also important to note that under Executive Order 12866, whether a regulation counts as “economically significant” is not an adequate measure of whether it imposes high costs on the private sector. Economically significant actions may impose small costs or even no costs. For example, regulations may count as economically significant not because they impose significant costs, but because they confer large benefits. Moreover, many regulations count as economically significant not because they impose significant regulatory costs on the private sector, but because they involve transfer payments as required or authorized by law., 208201=The requirements of Executive Order 12866 were reaffirmed in Executive Order 13563, issued in 2011. Consistent with Executive Orders 13563 and 12866, we are now providing the Unified Regulatory Agenda and the Regulatory Plan for public scrutiny and review. Such scrutiny and review are closely connected with the general goal, central to Executive Order 13563, of promoting public participation in the rulemaking process., 436836=Agency Contact: Jeff Canavan, Labeling and Program Delivery Division, Department of Agriculture, Food Safety and Inspection Service, Patriots Plaza 3, 8th Floor, 8-146, Stop 5273, 1400 Independence Avenue SW., Washington, DC 20250-5273, Phone: 301 504-0878, Fax: 301 504-0872, Email: jeff.canavan@fsis.usda.gov., 630828=RIN: 1840-AD05, 730457=Legal Deadline: NPRM, Statutory, January 4, 2012, Proposed rule not later than 12 months after the date of enactment of the Food Safety Modernization Act., 856544=The regulations we have identified in this year's fall regulatory plan continue to address legislative initiatives including, but not limited to, the following acts: The Implementing Recommendations of the 9/11 Commission Act of 2008 (9/11 Act), Public Law 110-53 (Aug. 3, 2007); the Post-Katrina Emergency Management Reform Act of 2006 (PKEMRA), Public Law 109-295 (Oct. 4, 2006); the Consolidated Natural Resources Act of 2008 (CNRA), Public Law 110-220 (May 7, 2008); the Security and Accountability for Every Port Act of 2006 (SAFE Port Act), Public Law 109-347 (Oct. 13, 2006); and the Consolidated Security, Disaster Assistance, and Continuing Appropriations Act, 2009, Public Law 110-329 (Sep. 30, 2008)., 351545=Legal Authority: 7 U.S.C. 2131 to 2159, 799166=Agency Contact: Daniel Reese, Department of Health and Human Services, Food and Drug Administration, Center for Food Safety and Applied Nutrition (HFS-820), 5100 Paint Branch Parkway, College Park, MD 20740, Phone: 240 402-2126, Email: daniel.reese@fda.hhs.gov., 372726=Agency Contact: Gerald Rushin, Veterinary Medical Officer, Animal Care, Department of Agriculture, Animal and Plant Health Inspection Service, 4700 River Road, Unit 84, Riverdale, MD 20737-1234, Phone: 301 734-0954., 737332=Agency Contact: Samir Assar, Supervisory Consumer Safety Officer, Department of Health and Human Services, Food and Drug Administration, Center for Food Safety and Applied Nutrition, Office of Food Safety, 5100 Paint Branch Parkway, College Park, MD 20740, Phone: 240 402-1636, Email: samir.assar@fda.hhs.gov., 305550=Access to Nutritious Food. This objective represents FNS's efforts to improve nutrition by providing access to program benefits (food consumed at home, school meals, commodities) and distributing State administrative funds to support program operations. To advance this objective, FNS plans to publish a final rule of the 2008 Farm Bill that ensures access to SNAP benefits and addresses other eligibility, certification, employment, and training issues. An interim rule, implementing provisions of the Child Nutrition and WIC Reauthorization Act of 2004 to establish automatic eligibility for homeless children for school meals, further supports this objective., 207556=Executive Order 12866, issued in 1993, requires the annual production of a Unified Regulatory Agenda and Regulatory Plan. It does so to promote transparency—or in the words of the Executive Order itself, “to have an effective regulatory program, to provide for coordination of regulations, to maximize consultation and the resolution of potential conflicts at an early stage, to involve the public and its State, local, and tribal officials in regulatory planning, and to ensure that new or revised regulations promote the President's priorities and the principles set forth in this Executive order.”, 920146=Abstract: This rule proposes to amend Department of Homeland Security regulations that govern asylum eligibility. The amendments focus on portions of the regulations that deal with the definitions of membership in a particular social group, the requirements for failure of State protection, and determinations about whether persecution is inflicted on account of a protected ground. This rule codifies long-standing concepts of the definitions. It clarifies that gender can be a basis for membership in a particular social group. It also clarifies that a person who has suffered or fears domestic violence may under certain circumstances be eligible for asylum on that basis. After the Board of Immigration Appeals published a decision on this issue in 1999, Matter of R-A-, Int. Dec. 3403 (BIA 1999), it became clear that the governing regulatory standards required clarification. The Department of Justice began this regulatory initiative by publishing a proposed rule addressing these issues in 2000., 321798=Priorities: GIPSA intends to issue a final rule that will define practices or conduct that are unfair, unjustly discriminatory, or deceptive, and/or that represent the making or giving of an undue or unreasonable preference or advantage, and ensure that producers and growers can fully participate in any arbitration process that may arise relating to livestock or poultry contracts. This regulation is being finalized in accordance with the authority granted to the Secretary by the Packers and Stockyards Act of 1921 and with the requirements of sections 11005 and 11006 of the 2008 Farm Bill., 607296=Race to the Top Phase 3. On May 25, 2011, the Department also announced that approximately $200 million of the FY 2011 Race to the Top funds would be made available to some or all of the nine unfunded finalists from the 2010 Race to the Top Phase 2 competition. The Department recognizes that $200 million is not sufficient to support full implementation of the plans submitted during the Phase 2 competition, and therefore believes that making these funds available to the remaining nine finalists is the best way to create incentives for these States to carry out the bold reforms proposed in their applications. We have issued final eligibility requirements for the nine unfunded finalists to apply for Race to the Top Phase 3 funds., 879287=Offshore Supply Vessels of 6,000 or more GT ITC. The Coast Guard Authorization Act of 2010 (the Act) removed the size limit on offshore supply vessels (OSVs) and directed the Coast Guard to issue, as soon as practicable, regulations to implement section 617 of the Act. As required by the Act, this regulation would provide for the safe carriage of oil, hazardous substances, and individuals in addition to crew on OSVs of at least 6,000 gross tonnage as measured under the International Convention on Tonnage Measurement of Ships (6,000 GT ITC). In developing the regulations, the Coast Guard is taking into account the characteristics of offshore supply vessels, their methods of operation, and their service in support of exploration, exploitation, or production of offshore mineral or energy resources., 981130=Related RIN: Duplicate of 1615-AB29., 816483=Legal Authority: 42 U.S.C. 1302 and 1395hh and 44 U.S.C. 35, 902430=Aircraft Repair Station Security. TSA will finalize a rule requiring repair stations that are certificated by the Federal Aviation Administration under 14 CFR part 145 to adopt and implement standard security programs and to comply with security directives issued by TSA. TSA issued an Notice of Proposed Rulemaking (NPRM) on November 18, 2009. The final rule will also codify the scope of TSA's existing inspection program and could require regulated parties to allow DHS officials to enter, inspect, and test property, facilities, and records relevant to repair stations. This rulemaking action will implement section 1616 of the 9/11 Act., 968455=Statement of Need: The TVPRA mandated promulgation of regulations taking into account the specialized needs of unaccompanied alien children and addressing both procedural and substantive aspects of handling unaccompanied alien children's cases. This rule will codify existing agency guidance on the specialized needs of unaccompanied alien children. The rule will also codify agency guidance implementing the TVPRA. Such guidance has been in effect since March 2009 and, based on experience gained in following the guidance, will be revised in the rule., 931264=This rule establishes the procedures to be followed in order to petition for the U nonimmigrant classifications. Specifically, the rule addresses the essential elements that must be demonstrated to receive the nonimmigrant classification, procedures that must be followed to make an application, and evidentiary guidance to assist in the petitioning process. Eligible victims will be allowed to remain in the United States. The Trafficking Victims Protection Reauthorization Act of 2008, Public Law 110-457, made amendments to the T nonimmigrant status provisions of the Immigration and Nationality Act. The Department will issue a proposed rule to make the changes required by recent legislation and to provide the opportunity for notice and comment., 165709=The fall 2011 Unified Agenda publication appearing in the Federal Register consists of agency regulatory flexibility agendas, in accordance with the publication requirements of the Regulatory Flexibility Act. Agency regulatory flexibility agendas contain only those Agenda entries for rules that are likely to have a significant economic impact on a substantial number of small entities and entries that have been selected for periodic review under section 610 of the Regulatory Flexibility Act. Printed entries display only the fields required by the Regulatory Flexibility Act. Complete agenda information for those entries appears, in a uniform format, in the online Unified Agenda at http://reginfo.gov., 633688=The Department continues to follow its schedule for setting new appliance efficiency standards. These rulemakings are expected to save American consumers billions of dollars in energy costs. The schedule outlines how DOE will address the various appliance standards rulemakings necessary to meet statutory requirements established in EPCA, the Energy Policy Act of 2005 (EPACT 2005), and the Energy Independence and Security Act of 2007 (EISA 2007)., 334288=Legal Authority: 7 U.S.C. 1635 to 1636, 543388=Legal Authority: 16 U.S.C. 1801 et seq., 1002628=Additional Information: CIS No. 2134-01. Transferred from RIN 1115-AG21., 286526=USDA's focus in 2012 will be on programs that create/save jobs, particularly in rural America, while identifying and taking action on those programs that could be modified, streamlined, and simplified, or reporting burdens reduced, particularly with the public's access to USDA programs. In addition, USDA's regulatory efforts in the coming year will be focused on achieving the Department's goals identified in the Department's Strategic Plan for 2010 to 2015., 304487=This document represents summary information on prospective significant regulations as called for in E.O.s 12866 and 13563. The following USDA agencies are represented in this regulatory plan, along with a summary of their mission and key regulatory priorities in 2012:, 960799=Summary of Legal Basis: The Homeland Security Act of 2002, Public Law 107-296, section 102, 116 Stat. 2135 (Nov. 25, 2002), 6 U.S.C. 112, and the Immigration and Nationality Act of 1952 (INA), charge the Secretary of Homeland Security (Secretary) with administration and enforcement of the immigration and nationality laws. See INA section 103, 8 U.S.C. 1103., 178412=Executive Order 13211 entitled “Actions Concerning Regulations That Significantly Affect Energy Supply, Distribution, or Use,” signed May 18, 2001 (66 FR 28355), directs agencies to provide, to the extent possible, information regarding the adverse effects that agency actions may have on the supply, distribution, and use of energy. Under the Order, the agency must prepare and submit a Statement of Energy Effects to the Administrator of the Office of Information and Regulatory Affairs, Office of Management and Budget, for “those matters identified as significant energy actions.” As part of this effort, agencies may optionally include in their submissions for the Unified Agenda information on whether they have prepared or plan to prepare a Statement of Energy Effects for their regulatory actions., 426853=The rule requires activities be science-based and outcome-driven and provides for accountability and transparency through State plans. It will require coordination and collaboration among Federal agencies and stakeholders, including the Centers for Disease Control and Prevention, the public health community, the academic and research communities, nutrition education practitioners, representatives of State and local governments, and community organizations that serve the low-income populations. The rule allows for 100 percent Federal funding, and States will not have to provide matching funds. The grant funding will be based on 2009 expenditures. For 3 years after enactment, States will receive grant funds based on their level of funds expended for the 2009 base year with funds indexed for inflation thereafter. The new funding structure is phased in over a 7-year period. From fiscal year 2014 forward, funds will be allocated based on a formula that considers participation., 289890=Important regulatory activities supporting the accomplishment of these goals in 2012 will include the following:, 545575=Summary of Legal Basis: Magnuson-Stevens Fishery Conservation and Management Act, 16 U.S.C. 1801 et seq., 559025=In 2006, NMFS published a comprehensive right whale status review that concluded that recent genetic data provided unequivocal support to distinguish three right whale lineages (including the southern right whale) as separate phylogenetic species (Rosenbaum et al. 2000). Rosenbaum et al. (2000), concluded that the right whale should be regarded as the following three separate species: (1) The North Atlantic right whale (Eubalaena glacialis) ranging in the North Atlantic Ocean; (2) the North Pacific right whale (Eubalaena japonica), ranging in the North Pacific Ocean; and (3) the southern right whale (Eubalaena australis), historically ranging throughout the southern hemisphere's oceans., 53966=Posted by Ben Jordi on June 1, 2015, 853193=Agency Contact: Alissa DeBoy, Health Insurance Specialist, Center for Consumer Information & Insurance Oversight, Department of Health and Human Services, Centers for Medicare & Medicaid Services, 7500 Security Boulevard, Baltimore, MD 21244, Phone: 301 492-4428, Email: alissa.deboy@cms.hhs.gov., 907455=Statement of Need: Pursuant to section 563 of the 2008 Consolidated Appropriations Act, subtitle J—Secure Handling of Ammonium Nitrate, Public Law 110-161, the Department of Homeland Security is required to promulgate a rulemaking to create a registration regime for certain buyers and sellers of ammonium nitrate. The rule, as proposed by this NPRM, would create that regime, and would aid the Federal Government in its efforts to prevent the misappropriation of ammonium nitrate for use in acts of terrorism. By preventing such misappropriation, this rule could limit terrorists' abilities to threaten the public and to threaten the Nation's critical infrastructure and key resources. By securing the Nation's supply of ammonium nitrate, it should be much more difficult for terrorists to obtain ammonium nitrate materials for use in improvised explosive devices. As a result, there is a direct value in the deterrence of a catastrophic terrorist attack using ammonium nitrate, such as the Oklahoma City attack that killed over 160 and injured 853 people., 645374=Related RIN: Related to 1904-AB75., 732761=Statement of Need: FDA is taking this action to meet the requirements of the FSMA and to address the food safety challenges associated with fresh produce and thereby protect the public health. Data indicate that between 1973 and 1997, outbreaks of foodborne illness in the U.S. associated with fresh produce increased in absolute numbers and as a proportion of all reported foodborne illness outbreaks. The Agency issued general good agricultural practice guidelines for fresh fruits and vegetables over a decade ago. Incorporating prevention-oriented public heath principles and incorporating what we have learned in the past decade into a regulation is a critical step in establishing standards for the growing, harvesting, packing, and storing of produce and reducing the foodborne illness attributed to fresh produce., 943160=Summary of Legal Basis: In Negusie v. Holder, 129 S. Ct. 1159 (2009), the Supreme Court addressed whether the persecutor bar should apply where an alien's actions were taken under duress. DHS believes that this is an appropriate subject for rulemaking and proposes to amend the applicable regulations to set out its interpretation of the statute. In developing this regulatory initiative, DHS has carefully considered the purpose and history behind enactment of the persecutor bar, including its international law origins and the criminal law concepts upon which they are based., 299542=These process changes will allow for program data that is common across agencies to be collected once and utilized or redistributed to Agency programs in which the producer chooses to participate. FFAS plans to implement the Acreage and Crop Reporting Streamlining Initiative (ACRSI) in an incremental approach starting in late 2012 with a pilot in Kansas for growers of winter wheat when OMB approves the information collection. Full implementation is planned for 2013. When specific changes are identified, FSA and RMA will make any required conforming changes in their respective regulations., 613791=We have issued final regulations that revise the regulations implementing the Early Intervention Program for Infants and Toddlers with Disabilities authorized under part C of the Individuals with Disabilities Education Act (IDEA) to make changes needed for the appropriate implementation of the early intervention program. The final part C regulations incorporate provisions from the 2004 amendments to part C of the IDEA. Additionally, the final regulations provide States with flexibility in some areas, while ensuring State accountability to improve results, and needed services for infants and toddlers with disabilities and their families., 906328=Legal Authority: 2008 Consolidated Appropriations Act, sec 563, subtitle J—Secure Handling of Ammonium Nitrate, Pub. L. 110-161, 454883=Summary of Legal Basis: 21 U.S.C. 601 to 695; 21 U.S.C. 451 to 470; 21 U.S.C. 1031 to 1056., 657067=Agency Contact: Ronald B. Majette, Program Manager, Office of Building Technologies Program, EE-2J, Department of Energy, Energy Efficiency and Renewable Energy, 1000 Independence Avenue SW., Washington, DC 20585, Phone: 202 586-7935, Email: ajett.majette@hq.doe.gov., 638561=Legal Deadline: Final, Statutory, July 1, 2011., 627864=Abstract: The Secretary proposes to amend the title IV, HEA student assistance regulations to (1) reflect that, as of July 1, 2010, under title II of the Health Care and Education Reconciliation Act of 2010 (the SAFRA Act), no new Federal Family Education Loan Program loans will be made and (2) to reflect other changes to improve the effectiveness and efficiency of the student loan programs, particularly with regard to the discharge of loans for persons with total and permanent disabilities., 312221=Other Planned Initiatives. FSIS plans to finalize a February 2001 proposed rule to establish food safety performance standards for all processed ready-to-eat (RTE) meat and poultry products and for partially heat-treated meat and poultry products that are not ready-to-eat. Some provisions of the proposal addressed post-lethality contamination of RTE products with Listeria monocytogenes. In June 2003, FSIS published an interim final rule requiring establishments to prevent L. monocytogenes contamination of RTE products. FSIS has carefully reviewed its economic analysis of the interim final rule and is planning to affirm the interim rule as a final rule with changes., 430596=Agency Contact: James F. Herbert, Regulatory Review Specialist, Department of Agriculture, Food and Nutrition Service, 10th Floor,3101 Park Center Drive, Alexandria, VA 22302, Phone: 703 305-2572, Email: james.herbert@fns.usda.gov., 604969=On April 15, 2011, President Obama signed into law Public Law 112-10, the Department of Defense and Full-Year Continuing Appropriations Act, 2011 (FY 2011 Appropriations Act), which made $698.6 million available for the Race to the Top Fund, authorized the Secretary to make awards on “the basis of previously submitted applications,” and amended ARRA to permit the Secretary to make grants for improving early childhood care and learning under the program., 1004927=Legal Deadline: Final, Statutory, November 28, 2009, Consolidated Natural Resources Act (CNRA) of 2008., 823984=Statement of Need: Medicare pays over 4,000 hospitals for outpatient department services under the hospital outpatient prospective payment system (OPPS). The OPPS is based on groups of clinically similar services called ambulatory payment classification groups (APCs). CMS annually revises the APC payment amounts based on the most recent claims data, proposes new payment policies, and updates the payments for inflation using the hospital operating market basket. The proposed rule solicits comments on the proposed OPPS payment rates and new policies. Medicare pays roughly 5,000 Ambulatory Surgical Centers (ASCs) under the ASC payment system. CMS annually revises the payment under the ASC payment system, proposes new policies, and updates payments for inflation using the Consumer Price Index for All Urban Consumers (CPI-U). CMS will issue a final rule containing the payment rates for the 2013 OPPS and ASC payment system at least 60 days before January 1, 2013., 427884=Summary of Legal Basis: Section 241, Healthy, Hunger-Free Kids Act of 2010 (Pub. L. 111-296)., 409023=Agency Contact: James F. Herbert, Regulatory Review Specialist, Department of Agriculture, Food and Nutrition Service, 10th Floor, 3101 Park Center Drive, Alexandria, VA 22302, Phone: 703 305-2572, Email: james.herbert@fns.usda.gov., 769620=Statement of Need: The Agency published a proposed rule on July 9, 1996, that would establish current good manufacturing practice regulations, quality control procedures, quality factors, notification requirements, records, and reports for the production of infant formula. This proposal was issued in response to the 1986 Amendments to the Infant Formula Act of 1980. On April 28, 2003, FDA reopened the comment period to update comments on the proposal. The comment was extended on June 27, 2003, and ended on August 26, 2003. The comment period was reopened on August 1, 2006, and ended on September 15, 2006., 310402=Notification, Documentation, and Recordkeeping Requirements for Inspected Establishments. As authorized by the 2008 Farm Bill, FSIS will issue final regulations that will require establishments that are subject to inspection to promptly notify FSIS when an adulterated or misbranded product received by or originating from the establishment has entered into commerce. The regulations also will require the establishments to prepare and maintain current procedures for the recall of all products produced and shipped by the establishments and to document each reassessment of the establishments' process control plans., 854209=The Department of Homeland Security (DHS or Department) was created in 2003 pursuant to the Homeland Security Act of 2002, Public Law 107-296. DHS has a vital mission: To secure the Nation from the many threats we face. This requires the dedication of more than 225,000 employees in jobs that range from aviation and border security to emergency response, from cybersecurity analyst to chemical facility inspector. Our duties are wide-ranging, but our goal is clear—keeping America safe., 674335=RIN: 1904-AB50, 723114=Abstract: The Food and Drug Administration Amendments Act of 2007 (FDAAA), amended the Federal Food, Drug, and Cosmetic Act by adding section 519(f) (21 U.S.C. 360i(f)). This section requires FDA to promulgate regulations establishing a unique identification system for medical devices requiring the label of medical devices to bear a unique identifier, unless FDA specifies an alternative placement or provides for exceptions. The unique identifier must adequately identify the device through distribution and use, and may include information on the lot or serial number., 865026=The fall 2011 regulatory plan for DHS includes regulations from DHS components—including U.S. Citizenship and Immigration Services (USCIS), the U.S. Coast Guard (Coast Guard), U.S. Customs and Border Protection (CBP), the Federal Emergency Management Agency (FEMA), the U.S. Immigration and Customs Enforcement (ICE), and the Transportation Security Administration (TSA), which have active regulatory programs. In addition, it includes regulations from the Department's major offices and directorates such as the National Protection and Programs Directorate (NPPD). Below is a discussion of the fall 2011 regulatory plan for DHS regulatory components, as well as for DHS offices and directorates., 829824=Summary of Legal Basis: Section 1848 of the Social Security Act (the Act) establishes the payment for physician services provided under Medicare. Section 1848 of the Act imposes a deadline of no later than November 1 for publication of the final rule or final physician fee schedule., 927908=Additional Information: CIS No. 2092-00, Transferred from RIN 1115-AF92., 318148=Livestock Mandatory Reporting; Establishing Regulations for Wholesale Pork. As directed by the 2008 Farm Bill, the Secretary conducted a study to determine advantages, drawbacks, and potential implementation issues associated with adopting mandatory wholesale pork reporting. The report from this study concluded that negotiated wholesale pork price reporting is thin and becoming thinner and found some degree of support for moving to mandatory price reporting exists at every segment of the industry interviewed. That study also concluded that the benefits likely would exceed the cost of moving from a voluntary to a mandatory reporting program for wholesale pork., 618036=Given the President's emphasis on improving the collection and use of data as a key element of educational reform, we intend to issue final regulations in the coming year to amend our current regulations for the Family Educational Rights and Privacy Act of 1974 (FERPA) to ensure that States are able to effectively establish and expand robust statewide longitudinal data systems while protecting student privacy., 843268=Legal Authority: Affordable Care Act, secs 1301 to 1343, secs 1401 to 1413, 921216=Statement of Need: This rule provides guidance on a number of key interpretive issues of the refugee definition used by adjudicators deciding asylum and withholding of removal (withholding) claims. The interpretive issues include whether persecution is inflicted on account of a protected ground, the requirements for establishing the failure of State protection, and the parameters for defining membership in a particular social group. This rule will aid in the adjudication of claims made by applicants whose claims fall outside of the rubric of the protected grounds of race, religion, nationality, or political opinion. One example of such claims which often fall within the particular social group ground concerns people who have suffered or fear domestic violence. This rule is expected to consolidate issues raised in a proposed rule in 2000 and to address issues that have developed since the publication of the proposed rule. This rule should provide greater stability and clarity in this important area of the law., 678711=As a result of the Affordable Care Act, the Department is making affordable health care coverage more stable and secure through insurance market reforms designed to protect consumers against unreasonable insurance premium increases, provide them with more comprehensive and understandable information with which to make decisions, and enable eligible consumers to receive financial support for health insurance easily and seamlessly. In 2014, all people who suffer from chronic conditions will no longer be excluded from insurance coverage or charged higher premiums because of a pre-existing condition or medical history., 831544=Agency Contact: Christina Ritter, Director, Division of Practitioner Services, Department of Health and Human Services, Centers for Medicare & Medicaid Services, Mail Stop C4-03-06, 7500 Security Blvd., Baltimore, MD 21244, Phone: 410 786-4636, Email: christina.ritter@cms.hhs.gov., 965839=RIN: 1615-AB95, 730678=Abstract: The Food Safety Modernization Act requires the Secretary to establish and publish science-based minimum standards for the safe production and harvesting of those types of fruits and vegetables, including specific mixes or categories of fruits and vegetables, that are raw agricultural commodities for which the Secretary has determined that such standards minimize the risk of serious adverse health consequences or death. FDA is proposing to promulgate regulations setting enforceable standards for fresh produce safety at the farm and packing house. The purpose of the proposed rule is to reduce the risk of illness associated with contaminated fresh produce. The proposed rule will be based on prevention-oriented public health principles and incorporate what we have learned in the past decade since the Agency issued general good agricultural practice guidelines entitled “Guide to Minimize Microbial Food Safety Hazards for Fresh Fruits and Vegetables” (GAPs Guide). The proposed rule also will reflect comments received on the Agency's 1998 update of its GAPs guide and its July 2009 draft commodity specific guidances for tomatoes, leafy greens, and melons. Although the proposed rule will be based on recommendations that are included in the GAPs guide, FDA does not intend to make the entire guidance mandatory. FDA's proposed rule would, however, set out clear standards for implementation of modern preventive controls. The proposed rule also would emphasize the importance of environmental assessments to identify hazards and possible pathways of contamination and provide examples of risk reduction practices recognizing that operators must tailor their preventive controls to particular hazards and conditions affecting their operations. The requirements of the proposed rule would be scale appropriate and commensurate with the relative risks and complexity of individual operations. FDA intends to issue guidance to assist industry in complying with the requirements of the new regulation., 384139=Statement of Need: This proposed rule would implement provisions under section 4132 of the Food, Conservation, and Energy Act of 2008, also referred to as the Farm Bill of 2008. Under section 4132, the Department of Agriculture's Food and Nutrition Service (FNS) is provided with greater authority and flexibility when sanctioning retail or wholesale food stores that violate Supplemental Nutrition Assistance Program (SNAP) rules. Specifically, the Department is authorized to assess a civil penalty and to disqualify a retail or wholesale food store authorized to participate in SNAP. Previously, the Department could assess a civil penalty or disqualification, but not both. Section 4132 also eliminates the minimum disqualification period, which was previously set at 6 months. In addition to implementing statutory provisions, this rule proposes to provide a clear administrative penalty when an authorized retailer or wholesale food store redeems a SNAP participant's program benefits without the knowledge of the participant. All program benefits are issued through the Electronic Benefits Transfer (EBT) system. The EBT system establishes data that may be used to identify fraud committed by retail food stores. While stealing program benefits could be prosecuted under current statute, program regulations do not provide a clear penalty for these thefts. The proposed rule would establish an administrative penalty for such thefts equivalent to the penalty for trafficking in program benefits, which is the permanent disqualification of a retailer or wholesale food store from SNAP participation. Finally, the Department proposes to identify additional administrative retail violations and the associated sanction that would be imposed against the retail food store for committing the violation. For instance, to maintain integrity, FNS requires retail and wholesale food stores to key enter EBT card data in the presence of the actual EBT card. The proposed rule would codify this requirement and identify the specific sanction that would be imposed if retail food stores are found to be in violation., 895898=Ammonium Nitrate Security Program. The Secure Handling of Ammonium Nitrate Act, section 563 of the Fiscal Year 2008 Department of Homeland Security Appropriations Act, Public Law 110-161, amended the Homeland Security Act of 2002 to provide DHS with the authority to “regulate the sale and transfer of ammonium nitrate by an ammonium nitrate facility * * * to prevent the misappropriation or use of ammonium nitrate in an act of terrorism.”, 873864=The statutory responsibilities of the Coast Guard include ensuring marine safety and security, preserving maritime mobility, protecting the marine environment, enforcing U.S. laws and international treaties, and performing search and rescue. The Coast Guard supports the Department's overarching goals of mobilizing and organizing our Nation to secure the homeland from terrorist attacks, natural disasters, and other emergencies. The rulemaking projects identified for the Coast Guard in the Unified Agenda, and the rules appearing in the fall 2011 regulatory plan below, contribute to the fulfillment of those responsibilities and reflect our regulatory policies., 845297=Summary of Legal Basis: This rule implements the new Affordable Insurance Exchanges consistent with title I of the Affordable Care Act of 2010., 421085=Anticipated Cost and Benefits: The estimated total SNAP costs to the Government of the FCEA provisions implemented in the rule are estimated to be $831 million in FY 2010 and $5.619 billion over the 5 years FY 2010 through FY 2014. These impacts are already incorporated into the President's budget baseline., 568744=Risks: There are no novel legal or policy issues associated with this action since identification and certification procedures have already been established in regulations (50 CFR part 300). However, this action is significant under the meaning of E.O. 12866 because it could lead to trade restrictive measures applied against foreign nations., 652017=Related RIN: Related to 1904-AB85., 991798=Agency Contact: Laura M. Dawkins, Chief, Family Immigration and Victim Protection Division, Department of Homeland Security, U.S. Citizenship and Immigration Services, Suite 1200, 20 Massachusetts Avenue NW., Washington, DC 20529, Phone: 202 272-1470, Fax: 202 272-1480, Email: laura.dawkins@dhs.gov., 570372=Agency Contact: Christopher Rogers, Division Chief, Department of Commerce, National Oceanic and Atmospheric Administration, 1315 East-West Highway, Silver Spring, MD 20910, Phone: 301 713-9090, Fax: 301 713-9106, Email: christopher.rogers@noaa.gov., 846131=Risks: If this regulation is not published, the Exchanges will not become operational by January 1, 2014, thereby violating the statute., 396836=Abstract: This proposed rule would revise and expand regulations regarding WIC EBT at 7 CFR 246 and implement statutory provisions related to EBT as defined in the Healthy, Hunger-Free Kids Act of 2010, 11. The EBT requirements addressed in the proposed rule would promote improved access to Program benefits, standardize EBT operations, and establish implementation guidelines and timeframes., 513107=Pursuant to section 6 of Executive Order 13563 “Improving Regulation and Regulatory Review” (Jan. 18, 2011), the following Regulatory Identifier Numbers (RINs) have been identified as associated with retrospective review and analysis in the Department's final retrospective review of regulations plan. Accordingly, the Agency is reviewing these rules to determine whether action under E.O. 13563 is appropriate. Some of these entries on this list may be completed actions, which do not appear in The Regulatory Plan. However, more information can be found about these completed rulemakings in past publications of the Unified Agenda on Reginfo.gov in the Completed Actions section for the Agency. These rulemakings can also be found on Regulations.gov. The final Agency retrospective analysis plan can be found at: http://open.commerce.gov/sites/default/files/Commerce%20Plan%20for%20Retrospective%20Analysis%20of%20Existing%20Rules%20-%202011-08-22%20Final.pdf., 503572=3. Critical Habitat for North Atlantic Right Whale (0648-AY54): In 1994, NMFS designated critical habitat for the northern right whale in the North Atlantic Ocean. This critical habitat designation includes portions of Cape Cod Bay and Stellwagen Bank, the Great South Channel, and waters adjacent to the coasts of Georgia and Florida. In 2008, NMFS published final determinations listing right whales in the North Atlantic and North Pacific as separate endangered species under the ESA and initiated work on new critical habitat designations triggered by these 2008 listings. On October 1, 2009, NMFS received a petition from the Center for Biological Diversity, Defenders of Wildlife, Humane Society of the United States, Ocean Conservancy, and the Whale and Dolphin Conservation Society to revise the designated critical habitat of the North Atlantic right whale. The petition seeks an expansion of the areas designated as critical feeding and calving habitats and also seeks to include a migratory corridor as part of the critical habitat designation. On October 6, 2010, NMFS published a 90-day finding and 12-month determination stating the intent to proceed with publishing a proposed rule to revise critical habitat., 947612=Legal Authority: 8 U.S.C. 1101; 8 U.S.C. 1103; 8 U.S.C. 1151; 8 U.S.C. 1153, 188072=As defined in Executive Order 12866, a rulemaking action that will have an annual effect on the economy of $100 million or more or will adversely affect in a material way the economy, a sector of the economy, productivity, competition, jobs, the environment, public health or safety, or State, local, or tribal governments or communities. The definition of an “economically significant” rule is similar but not identical to the definition of a “major” rule under 5 U.S.C. 801 (Pub. L. 104-121). (See below.), 638674=Abstract: In addition to the existing general definition of “external power supply,” the Energy Independence and Security Act of 2007 (EISA) defines a “Class A external power supply” and sets efficiency standards for those products. EISA directs DOE to publish a final rule to determine whether the standards set for Class A external power supplies should be amended. EISA also requires DOE to issue a final rule prescribing energy conservation standards for battery chargers, if technologically feasible and economically justified., 665760=Related RIN: Related to 1904-AA92., 825990=Anticipated Cost and Benefits: Total expenditures will be adjusted for CY 2013., 696594=Abstract: The final rule that established the initial set of standards, implementation specifications, and certification criteria was published in the Federal Register on July 28, 2010. The initial set represented the first round of an incremental approach to adopting future sets of standards, implementation specifications, and certification criteria to enhance electronic health record (EHR) interoperability, functionality, and utility. Under the authority provided by section 3004 of the Public Health Service Act (PHSA), this notice of proposed rulemaking would propose that the Secretary adopt revisions to the initial set as well as new standards, implementation specifications and certification criteria. The proposed new and revised standards, implementation specifications, and certification criteria would establish the technical capabilities that certified EHR technology would need to include to support meaningful use under the CMS Medicare and Medicaid EHR Incentive Programs., 164851=The Unified Agenda provides information about regulations that the Government is considering or reviewing. The Unified Agenda has appeared in the Federal Register twice each year since 1983 and has been available online since 1995. To further the objective of using modern technology to deliver better service to the American people for lower cost, beginning with the fall 2007 edition, the Internet is the basic means for conveying regulatory agenda information to the maximum extent legally permissible. The complete Unified Agenda is available to the public at http://reginfo.gov. The online Unified Agenda offers flexible search tools and will soon offer access to the entire historic Unified Agenda database., 834711=Summary of Legal Basis: The Social Security Act (the Act) sets forth a system of payment for the operating costs of acute care hospital inpatient stays under Medicare Part A (Hospital Insurance) based on prospectively set rates. The Act requires the Secretary to pay for the capital-related costs of hospital inpatient and Long Term Care stays under a PPS. Under these systems, Medicare payment for hospital inpatient and Long Term Care operating and capital-related costs is made at predetermined, specific rates for each hospital discharge. These changes would be applicable to services furnished on or after October 1, 2012., 914171=Risks: Explosives containing ammonium nitrate are commonly used in terrorist attacks. Such attacks have been carried out both domestically and internationally. The 1995 Murrah Federal Building attack in Oklahoma City claimed the lives of 167 individuals and demonstrated firsthand to America how ammonium nitrate could be misused by terrorists. In addition to the Murrah Building attack, the Provisional Irish Republican Army used ammonium nitrate as part of its London, England bombing campaign in the early 1980s. More recently, ammonium nitrate was used in the 1998 East African Embassy bombings and in November 2003 bombings in Istanbul, Turkey. Additionally, since the events of 9/11, stores of ammonium nitrate have been confiscated during raids on terrorist sites around the world, including sites in Canada, England, India, and the Philippines., 849030=Legal Authority: Pub. L. 111-148, secs 1341 and 1342, 982077=Legal Authority: 5 U.S.C. 552; 5 U.S.C. 552a; 8 U.S.C. 1101 to 1104; 8 U.S.C. 1182; 8 U.S.C. 1184; 8 U.S.C. 1187; 8 U.S.C. 1201; 8 U.S.C. 1224 to 1227; 8 U.S.C. 1252 to 1252a; 22 U.S.C. 7101; 22 U.S.C. 7105, 619439=Pursuant to section 6 of Executive Order 13563 “Improving Regulation and Regulatory Review” (Jan. 18, 2011), the following Regulatory Identifier Numbers (RINs) have been identified as associated with retrospective review and analysis in the Department's final retrospective review of regulations plan. Some of the entries on this list may be completed actions, which do not appear in The Regulatory Plan. However, more information can be found about these completed rulemakings in past publications of the Unified Agenda on Reginfo.gov in the Completed Actions section for that agency. These rulemakings can also be found on Regulations.gov. The final agency plans can be found at: http://www2.ed.gov/about/open.html., 697679=Statement of Need: The final rule that established the initial set of standards, implementation specifications, and certification criteria was published in the Federal Register on July 28, 2010. The initial set represented the first round of an incremental approach to adopting future sets of standards, implementation specifications, and certification criteria for electronic health record (EHR) technology. In a notice of proposed rulemaking, the Secretary would propose new and revised standards, implementation specifications, and certification criteria that would establish the technical capabilities that certified EHR technology would need to include in order to support meaningful use under the CMS Medicare and Medicaid EHR Incentive Programs., 893777=During fiscal year 2012, ICE will pursue rulemaking actions that improve two critical subject areas: The detention of aliens who are subject to final orders of removal and the processes for the Student and Exchange Visitor Program (SEVP)., 328934=Priorities: In support USDA's goal to increase the prosperity of rural communities, RBS regulatory priorities will facilitate sustainable renewable energy development and enhance the opportunities necessary for rural families to thrive economically. RBS' priority will be to publish regulations to fully implement the 2008 Farm Bill. This includes promulgating regulations for the Biorefinery Assistance Program (sec. 9003), the Repowering Assistance Program (sec. 9004), the Bioenergy Program for Advanced Biofuels (sec. 9005), and the Rural Microentrepreneur Assistance Program (RMAP). RBS has been administering sections 9003, 9004, and 9005 through the use of Notices of Funds Availability and Notices of Contract Proposals. Revisions to the Rural Energy for America Program (sec. 9007) will be made to incorporate Energy Audits and Renewable Energy Development Assistance and Feasibility Studies for Rural Energy Systems as eligible grant purposes, as well as other Farm Bill initiatives and various technical changes throughout the rule. In addition, revisions to the Business and Industry Guaranteed Loan Program will be made to implement 2008 Farm Bill provisions and other program initiatives. These rules will minimize program complexity and burden on the public while enhancing program delivery and RBS oversight., 556375=Agency Contact: Melissa Andersen. Fishery Biologist, Management, Department of Commerce, National Oceanic and Atmospheric Administration, 1315 East-West Highway, Silver Spring, MD 20910, Phone: 301 713-2322, Fax: 301 713-2521, Email: melissa.andersen@noaa.gov., 205478=Copies of the Federal Register issue containing the printed edition of the Unified Agenda (agency regulatory flexibility agendas) are available from the Superintendent of Documents, U.S. Government Printing Office, P.O. Box 371954, Pittsburgh, PA 15250-7954. Telephone: 202 512-1800 or 1 866 512-1800 (toll-free)., 828706=Legal Authority: Social Security Act, secs 1102, 1871, 1848, 69683=The Regulatory Flexibility Act requires that agencies publish semiannual regulatory agendas in the Federal Register describing regulatory actions they are developing that may have a significant economic impact on a substantial number of small entities (5 U.S.C. 602). Executive Order 12866 “Regulatory Planning and Review,” signed September 30, 1993 (58 FR 51735), and Office of Management and Budget memoranda implementing section 4 of that Order establish minimum standards for agencies' agendas, including specific types of information for each entry., 833829=Statement of Need: CMS annually revises the Medicare hospital inpatient prospective payment systems (IPPS) for operating and capital-related costs to implement changes arising from our continuing experience with these systems. In addition, we describe the proposed changes to the amounts and factors used to determine the rates for Medicare hospital inpatient services for operating costs and capital-related costs. Also, CMS annually updates the payment rates for the Medicare prospective payment system (PPS) for inpatient hospital services provided by long-term care hospitals (LTCHs). The proposed rule solicits comments on the proposed IPPS and LTCH payment rates and new policies. CMS will issue a final rule containing the payment rates for the FY 2013 IPPS and LTCHs at least 60 days before October 1, 2012., 70776=Editions of the Unified Agenda prior to fall 2007 were printed in their entirety in the Federal Register. Beginning with the fall 2007 edition, the Internet is the basic means for conveying regulatory agenda information to the maximum extent legally permissible. The complete Unified Agenda for fall 2011, which contains the regulatory agendas for 59 Federal agencies, is available to the public at http://reginfo.gov., 183901=Long-Term Actions are rulemakings reported during the publication cycle that are outside of the required 12-month reporting period for which the Agenda was intended. Completed Actions in the publication cycle are rulemakings that are ending their lifecycle either by Withdrawal or completion of the rulemaking process. Therefore, the Long-Term and Completed RINs do not represent the ongoing, forward-looking nature intended for reporting developing rulemakings in the Agenda pursuant to Executive Order 12866, section 4(b) and 4(c). To further differentiate these two stages of rulemaking in the Unified Agenda from active rulemakings, Long-Term and Completed Actions are reported separately from active rulemakings, which can be any of the first three stages of rulemaking listed above. A separate search function is provided on reginfo.gov to search for Completed and Long-Term Actions apart from each other and active RINs., 511022=In FY 2011, BIS took several steps to implement the President's Export Control Reform Initiative. BIS published a final rule (76 FR 35276, June 16, 2011) implementing a license exception that authorizes exports, reexports, and transfers to destinations that do not pose a national security concern, provided certain safeguards against diversion to other destinations are taken. BIS also proposed a rule that provides a framework for controlling militarily less significant defense articles, largely generic parts and components, on the Commerce Control List (CCL) rather than the United States Munitions List. In the immediate future, BIS will work with other agencies to implement transfers of such items to the CCL and to make the CCL a more positive list. Looking further ahead BIS will work with other agencies to place items on the CCL into one of three tiers, corresponding to different levels of sensitivity., 368051=Legal Authority: 7 U.S.C. 2148, 738673=Legal Authority: 21 U.S.C. 342; 21 U.S.C. 371; 42 U.S.C. 264; Pub. L. 111-353 (signed on Jan. 4, 2011), 755764=Risks: As stated above, about 15 percent of the U.S. food supply is imported, and many of these imported foods are high-risk commodities. According to recent data from the Centers for Disease Control and Prevention, each year, about 48 million Americans get sick, 128,000 are hospitalized, and 3,000 die from foodborne diseases. From July 1, 2007, through June 30, 2008, FDA oversaw 40 recalls of imported foods that were so contaminated that the Agency deemed them to be an imminent threat. We expect that the adoption of FSVPs by food importers will lead to a significant reduction to the threat to public health posed by unsafe imported food, though we are still in the process of trying to quantify the reduction in risk that will occur through importer compliance with the FSVP regulations., 480394=Statement of Need: The Food, Conservation, and Energy Act of 2008 (Pub. L. 110-246, sec. 11017), known as the 2008 Farm Bill, amended the Federal Meat Inspection Act (FMIA) and the Poultry Products Inspection Act (PPIA) to require establishments subject to inspection under these Acts to promptly notify the Secretary that an adulterated or misbranded product received by or originating from the establishment has entered into commerce, if the establishment believes or has reason to believe that this has happened. Section 11017 also requires establishments subject to inspection under the FMIA and PPIA to: (1) Prepare and maintain current procedures for the recall of all products produced and shipped by the establishment and (2) document each reassessment of the process control plans of the establishment., 808476=Agency Contact: Geraldine A. June, Supervisor, Product Evaluation and Labeling Team, Department of Health and Human Services, Food and Drug Administration, Center for Food Safety and Applied Nutrition, (HFS-820), 5100 Paint Branch Parkway, College Park, MD 20740, Phone: 240 402-1802, Fax: 301 436-2636, Email: geraldine.june@fda.hhs.gov., 609733=Changes to the FFEL and Direct Loan Programs. On March 30, 2010, the President signed into law the Health Care and Education Reconciliation Act of 2010, Public Law 111-152, title II of which is the SAFRA Act. SAFRA made a number of changes to the Federal student financial aid programs under title IV of the Higher Education Act of 1965, as amended (HEA). One of the most significant changes made by SAFRA is that it ended new loans under the Federal Family Education Loan (FFEL) Program authorized by title IV, part B, of the HEA as of July 1, 2010., 938569=Additional Information: Transferred from RIN 1115-AG39., 922307=Summary of Legal Basis: The purpose of this rule is to provide guidance on certain issues that have arisen in the context of asylum and withholding adjudications. The 1951 Geneva Convention relating to the Status of Refugees contains the internationally accepted definition of a refugee. United States immigration law incorporates an almost identical definition of a refugee as a person outside his or her country of origin “who is unable or unwilling to return to, and is unable or unwilling to avail himself or herself of the protection of, that country because of persecution or a well-founded fear of persecution on account of race, religion, nationality, membership in a particular social group, or political opinion.” Section 101(a)(42) of the Immigration and Nationality Act., 712775=The legal deadline for FDA under the Food Safety and Modernization Act to promulgate regulations is July 2012., 177463=The Unfunded Mandates Reform Act of 1995 (Pub. L. 104-4, title II) requires agencies to prepare written assessments of the costs and benefits of significant regulatory actions “that may result in the expenditure by State, local, and tribal governments, in the aggregate, or by the private sector, of $100,000,000 or more * * * in any 1 year * * *.” The requirement does not apply to independent regulatory agencies, nor does it apply to certain subject areas excluded by section 4 of the Act. Affected agencies identify in the Unified Agenda those regulatory actions they believe are subject to title II of the Act., 417301=Abstract: This proposed rule would amend the regulations governing the Supplemental Nutrition Assistance Program (SNAP) to implement provisions from the Food, Conservation, and Energy Act of 2008 (Pub. L. 110-246) (FCEA) concerning the eligibility and certification of SNAP applicants and participants and SNAP employment and training. In addition, this proposed rule would revise the SNAP regulations throughout 7 CFR part 273 to change the program name from the Food Stamp Program to SNAP and to make other nomenclature changes as mandated by the FCEA. The statutory effective date of these provisions was October 1, 2008. Food and Nutrition Service (FNS) is also proposing two discretionary revisions to SNAP regulations to provide State agencies options that are currently available only through waivers. These provisions would allow State agencies to average student work hours and to provide telephone interviews in lieu of face-to-face interviews. FNS anticipates that this rule would impact the associated paperwork burdens (08-006)., 815105=Agency Contact: CDR Scott Cooper, Health Insurance Specialist, Department of Health and Human Services, Centers for Medicare & Medicaid Services, Clinical Standards Group, Mail Stop S3-05-15, 7500 Security Boulevard, Baltimore, MD 21244, Phone: 410 786-9465, Email: scott.cooper@cms.hhs.gov., 423147=Agency Contact: Kevin Kwon, Chief, Planning and Regulatory Affairs Branch, Department of Agriculture, Food and Nutrition Service, 10th Floor, 3101 Park Center Drive, Alexandria, VA 22302, Phone: 703 605-0800, Email: kevin.kwon@fns.usda.gov., 997913=Summary of Legal Basis: This rule implements the Victims of Trafficking and Violence Protection Act of 2000 (VTVPA), Public Law 106-386, 114 Stat. 1464 (Oct. 28, 2000), as amended, to permit aliens in lawful T or U nonimmigrant status to apply for adjustment of status to that of lawful permanent residents., 157060=Regulatory Information Service Center (MI), General Services Administration, One Constitution Square, 1275 First Street NE., 651A, Washington, DC 20417., 611394=Approval of New Gainful Employment Programs. Over the last 2 years, the Department has conducted two significant rulemakings to enhance its program integrity regulations related to the title IV, student aid programs. As part of this effort, on October 29, 2010, the Department issued regulations that included requirements for an institution to notify the Department before offering a new educational program that provides training leading to gainful employment in a recognized occupation (Gainful Employment—New Programs). The Department established the notification requirement out of concern that some institutions might attempt to circumvent proposed regulations regarding gainful employment standards by adding new programs before those standards could take effect. The Department explained that the notification process requirements were intended to remain in effect until the final regulations that established eligibility measures for gainful employment programs would take effect., 211677=It should be observed that the number of economically significant actions listed as under active consideration here—138—is lower than the corresponding figure for Spring 2011 (149) and for Fall 2010 (140). It is notable that the number of such rules has not grown even taking account of rules implementing the Affordable Care Act and the Wall Street Reform and Consumer Protection Act. We also note that the net benefits of regulation were unusually high in Fiscal Year 2011 (well over $50 billion for the year alone). In addition, the aggregate costs for that year (under $8 billion) were lower than in Fiscal Year 2010 and were not out of line with those in recent years, including during the Bush Administration., 652144=RIN: 1904-AB86, 843699=Abstract: This rule implements the new Affordable Insurance Exchanges (“Exchanges”), consistent with title I of the Affordable Care Act of 2010, referred to collectively as the Affordable Care Act. The Exchanges will provide competitive marketplaces for individuals and small employers to directly compare available private health insurance options on the basis of price, quality, and other factors. The Exchanges, which will become operational by January 1, 2014, will help enhance competition in the health insurance market, improve choice of affordable health insurance, and give small businesses the same purchasing clout as large businesses., 383302=Abstract: This proposed rule would implement provisions under section 4132 of the Food, Conservation, and Energy Act of 2008, also referred to as the Farm Bill of 2008. Under section 4132, the Department of Agriculture's Food and Nutrition Service (FNS) is provided with greater authority and flexibility when sanctioning retail or wholesale food stores that violate Supplemental Nutrition Assistance Program (SNAP) rules. Specifically, the Department is authorized to assess a civil penalty and to disqualify a retail or wholesale food store authorized to participate in SNAP. Previously, the Department could assess a civil penalty or disqualification but not both. Section 4132 also eliminates the minimum disqualification period, which was previously set at 6 months., 331177=Priorities: RUS' regulatory priorities will be to achieve the President's goal to bring affordable broadband to all rural Americans. To accomplish this, RUS will continue to improve the Broadband Program established by the 2002 Farm Bill. The 2002 Farm Bill authorized RUS to approve loans and loan guarantees for the costs of construction, improvement, and acquisition of facilities and equipment for broadband service in eligible rural communities. The 2008 Farm Bill significantly changed the statutory requirements of the Broadband Loan Program. As such, RUS issued an interim rule to implement the statutory changes and requested comments on the section of the rule that was not part of the proposed rule published in May 2007. Comments were received and the agency will analyze the comments and finalize the rule., 572783=DoD is not a regulatory agency, but occasionally it issues regulations that have an effect on the public. These regulations, while small in number compared to the regulating agencies, can be significant as defined in E.O. 12866. In addition, some of DoD's regulations may affect the regulatory agencies. DoD, as an integral part of its program, not only receives coordinating actions from the regulating agencies, but coordinates with the agencies that are affected by its regulations as well., 337705=Alternatives: There are no alternatives, as this rulemaking is a matter of law based on the Mandatory Price Reporting Act of 2010., 332927=USDA will ensure that its regulations provide benefits that exceed costs but is unable to provide an estimate of the aggregated impacts of its regulations. Problems with aggregation arise due to differing baselines, data gaps, and inconsistencies in methodology and the type of regulatory costs and benefits considered. Some benefits and costs associated with rules listed in the regulatory plan cannot currently be quantified as the rules are still being formulated. For 2012, USDA's focus will be to implement the changes to programs in such a way as to provide benefits while minimizing program complexity and regulatory burden for program participants., 665888=RIN: 1904-AC15, 878381=Revision to Transportation Worker Identification Credential (TWIC) Requirements for Mariners. The Coast Guard is developing revisions to its merchant mariner credentialing regulations, to implement changes made by section 809 of the Coast Guard Authorization Act of 2010. Section 809 eliminated the requirement for certain mariner populations to obtain TWIC. The Coast Guard is also considering revising its regulations to provide an exemption for certain fees associated with merchant mariner credentialing for those mariners not required to hold a TWIC who may still be required to visit a TWIC enrollment center to provide the information necessary to obtain a Merchant Mariner Credential. DHS highlighted this rulemaking in the DHS Final Plan for the Retrospective Review of Existing Regulations, which DHS released on August 22, 2011., 856251=The regulations we have summarized below in the Department's fall 2011 regulatory plan and in the agenda support the Department's responsibility areas listed above. These regulations will improve the Department's ability to accomplish its mission., 822898=Legal Authority: Sec 1833 of the Social Security Act, 203917=RIN—The Regulation Identifier Number is assigned by the Regulatory Information Service Center to identify each regulatory action listed in the Unified Agenda, as directed by Executive Order 12866 (section 4(b)). Additionally, OMB has asked agencies to include RINs in the headings of their Rule and Proposed Rule documents when publishing them in the Federal Register, to make it easier for the public and agency officials to track the publication history of regulatory actions throughout their development., 956391=Agency Contact: Dan Konnerth, Policy and Coordination Chief, Office of Transformation Coordination, Department of Homeland Security, U.S. Citizenship and Immigration Services, 6th Floor, 633 Third Street NW., Washington, DC 20529, Phone: 202 233-2381, Email: dan.konnerth@dhs.gov., 424971=Abstract:[Pub. L. 111-296, The Healthy, Hunger-Free Kids Act of 2001, title II; Reducing Childhood Obesity and Improving the Diets of Children, subtitle D; Miscellaneous, sec. 241.] The Nutrition Education and Obesity Prevention Grant Program amends the Food and Nutrition Act of 2008 to replace the current nutrition education program under the Act with a program providing grants to States for the implementation of a nutrition education and obesity prevention program that promotes healthy food choices consistent with the most recent Dietary Guidelines for Americans., 395079=Agency Contact: James F. Herbert, Regulatory Review Specialist, Department of Agriculture, Food and Nutrition Service, 10th Floor, 3101 Park Center Drive, Alexandria, VA 22302, Phone: 703 305-2572, Email: james.herbert@fns.usda.gov., 531983=Abstract: In August 2009, President Obama directed a fundamental review of the U.S. Export control system be conducted. This review included a fundamental review of the two primary control lists of the U.S. Export control system; i.e., the Commerce Control List (CCL) and the United States Munitions List (USML). In December 2010, the Departments of Commerce and State each published an Advanced Notice of Proposed Rulemaking (ANPRM) requesting public comments on creating more “positive” and clear control lists and recommendations for how items listed on the two control lists could be tiered based on criteria developed during the Export Control Reform (ECR) initiative., 826136=Risks: If this regulation is not published timely, outpatient hospital and ASC services will not be paid appropriately beginning January 1, 2013., 661168=Summary of Legal Basis: Section 322 of the Energy Independence and Security Act of 2007 (EISA) establishes definitions and standards for ER, BR, and BPAR incandescent reflector lamps. (42 U.S.C. 6291(54) to 6291(56), 42 U.S.C. 6295 (i)) Furthermore, section 305 of EISA directs DOE to, not later than 6 years after issuance of any final rule establishing or amending a standard, publish either a notice of determination that standards do not need to be amended or a notice of proposed rulemaking including new proposed standards. (42 U.S.C. 6295 (m)), 526242=Legal Authority: 10 U.S.C. 7420; 10 U.S.C. 7430(e); 15 U.S.C. 1824a; 22 U.S.C. 287c; 22 U.S.C. 6004; 22 U.S.C. 7201 et seq.; 22 U.S.C. 7210; 30 U.S.C. 185(s); 42 U.S.C. 2139a; 42 U.S.C. 2139a; 42 U.S.C. 6212; 43 U.S.C. 1354; 50 U.S.C. 1701 et seq.; 50 U.S.C. 2401 et seq.; 50 U.S.C. 5; EO 12058; EO 12851; EO 12938; EO 12947; EO 13026; EO 13099; EO 13222; EO 13224; 22 U.S.C. 2151 note; 22 U.S.C. 3201 et seq.; EO 11912; EO 12002; EO 12214; EO 12854; EO 12918; EO 12918; EO 12981; EO 13020; EO 13338; 30 U.S.C. 185(u), 827245=Agency Contact: Paula Smith, Health Insurance Specialist, Department of Health and Human Services, Centers for Medicare & Medicaid Services, Mail Stop C4-05-13, 7500 Security Blvd., Baltimore, MD 21244, Phone: 410 786-4709, Email: paula.smith@cms.hhs.gov., 928074=Agency Contact: Ted Kim, Deputy Chief, Asylum Division, Department of Homeland Security, U.S. Citizenship and Immigration Services, Office of Refugee, Asylum, and International Operations, Suite 3200, 20 Massachusetts Avenue NW., Washington, DC 20259, Phone: 202 272-1614, Fax: 202 272-1994, Email: ted.kim@dhs.gov., 367002=Agency Contact: Shirley Wager—Page Chief, Pest Permitting Branch, Plant Health Programs, PPQ, Department of Agriculture, Animal and Plant Health Inspection Service, 4700 River Road, Unit 131, Riverdale, MD 20737-1236, Phone: 301 734-8453., 659241=Abstract: Amendments to Energy Policy and Conservation Act (EPCA) in the Energy Independence and Security Act of 2007 (EISA) amended the energy conservation standards to extend coverage to certain classes of IRL that had previously been outside the statutory definition of “incandescent reflector lamp” although these lamps were excluded from the statutory standard levels. However, EISA 2007 authorized DOE to amend these standards if such amendments were warranted. Specifically, as amended, EPCA exempted certain small diameter, ellipsoidal reflector (ER) and bulged reflector (BR) lamps from standards. In June 2009, DOE published a final rule amending existing standards for IRL. In earlier stages of the June 2009 rulemaking, DOE had interpreted its authority with regard to IRL as limited to amending congressionally established standard levels only, and not to the exemptions set by Congress for certain explicitly identified small diameter ER and BR lamps, commonly used in track lighting and recessed cans. On further review, DOE has concluded that DOE has authority to establish efficiency standards for these currently exempt small diameter ER and BR lamps. However, as a practical matter, DOE could not consider these lamps as part of the previous rulemaking because it had not conducted the requisite analyses to set appropriate standard levels. Pursuant to EPCA, DOE is now conducting a rulemaking as to energy conservation standards for certain incandescent reflector lamps (IRL) that have ER or BR bulb shapes, and for certain IRL with diameters less than 2.25 inches., 684065=In 2011, the Department published a key regulation to advance this priority—the final rule for Accountable Care Organizations. This rule establishes a system of shared savings for qualified organizations that deliver primary care services to a given patient population. The objective is to promote accountability and shared responsibility for the delivery of care, especially to those with co-morbidities of chronic health problems in order to prevent unnecessary and costly in-patient hospital care, reduce health care acquired conditions, and improve the quality of life for those individuals. This rule serves as a companion to additional demonstration programs designed to explore alternative services delivery and payment systems that are being sponsored by the new Center for Medicare and Medicaid Innovation. Several more key regulations are on the agenda to move forward in meeting these quality and patient safety goals:, 564081=Legal Deadline: Final, Statutory, January 4, 2012, The rule needs to be published by December 4, 2011, due to the 30-day delay in effectiveness., 908743=Summary of Legal Basis: Section 563 of the 2008 Consolidated Appropriations Act, subtitle J—Secure Handling of Ammonium Nitrate, Public Law 110-161, authorizes and requires this rulemaking., 197916=Some agencies that participated in the fall 2010 edition of The Regulatory Plan have chosen to include the following information for those entries that appeared in the Plan:, 884907=Importer Security Filing and Additional Carrier Requirements. The Security and Accountability for Every Port Act of 2006 (SAFE Port Act) calls for CBP to promulgate regulations to require the electronic transmission of additional data elements for improved high-risk targeting. See Public Law 109- 347, section 203 (October 13, 2006). This includes appropriate security elements of entry data for cargo destined for the United States by vessel prior to loading of such cargo on vessels at foreign seaports. The SAFE Port Act requires that the information collected reasonably improve CBP's ability to identify high-risk shipments to prevent smuggling and ensure cargo safety and security., 166628=These publication formats meet the publication mandates of the Regulatory Flexibility Act and Executive Order 12866, as well as move the Agenda process toward the goal of e-Government, at a substantially reduced printing cost compared with prior editions. The current format does not reduce the amount of information available to the public, but it does limit most of the content of the Agenda to online access. The complete online edition of the Unified Agenda includes regulatory agendas from 59 Federal agencies. Agencies of the United States Congress are not included., 932910=Summary of Legal Basis: Congress created the U nonimmigrant classification in the Battered Immigrant Women Protection Act of 2000 (BIWPA). Congress intended to strengthen the ability of law enforcement agencies to investigate and prosecute cases of domestic violence, sexual assault, trafficking of aliens, and other crimes, while offering protection to victims of such crimes. Congress also sought to encourage law enforcement officials to better serve immigrant crime victims., 219261=Executive Order 13563 reaffirms the principles, structures, and definitions in Executive Order 12866, which has long governed regulatory review. In addition, it endorses, and quotes, a number of provisions of that Executive Order that specifically emphasize the importance of considering costs—including the requirement that to the extent permitted by law, agencies should not proceed in the absence of a reasoned determination that the benefits justify the costs. Importantly, Executive Order 13563 directs agencies “to use the best available techniques to quantify anticipated present and future benefits and costs as accurately as possible.” This direction reflects a strong emphasis on quantitative analysis as a means of improving regulatory choices and increasing transparency., 369217=Statement of Need: The Food, Conservation, and Energy Act of 2008 mandates that the Secretary of Agriculture promulgate regulations to implement and enforce new provisions of the Animal Welfare Act (AWA) regarding the importation of dogs for resale. In line with the changes to the AWA, APHIS intends to amend the regulations in 9 CFR parts 1 and 2 to regulate the importation of dogs for resale., 971771=Agency Contact: Ted Kim, Deputy Chief, Asylum Division, Department of Homeland Security, U.S. Citizenship and Immigration Services, Office of Refugee, Asylum, and International Operations, Suite 3200, 20 Massachusetts Avenue NW., Washington, DC 20259, Phone: 202 272-1614, Fax: 202 272-1994, Email: ted.kim@dhs.gov., 559805=Based on these findings, NMFS published a proposed and final determination listing right whales in the North Atlantic and North Pacific as separate endangered species under the ESA (71 FR 77704, Dec. 27, 2006; 73 FR 12024, Mar. 6, 2008). Based on the new listing determination, NMFS is required by the ESA to designate critical habitat separately for both the North Atlantic right whale and the North Pacific right whale., 898891=In fiscal year 2012, TSA will promote the DHS mission by emphasizing regulatory efforts that allow TSA to better identify, detect, and protect against threats against various modes of the transportation system, while facilitating the efficient movement of the traveling public, transportation workers, and cargo., 712931=Abstract: The Food and Drug Administration (FDA) is proposing regulations for preventive controls for animal feed ingredients and mixed animal feed to provide greater assurance that marketed animal feed ingredients and mixed feeds intended for all animals, including pets, are safe. This action is being taken as part of the FDA's Animal Feed Safety System initiative. This action is also being taken to carry out the requirements of the Food and Drug Administration Amendments Act of 2007, under section 1002(a), and the Food Safety Modernization Act of 2010 (FSMA), under section 103., 602704=On February 17, 2009, President Obama signed into law the American Recovery and Reinvestment Act of 2009 (ARRA), historic legislation designed, in part, to invest in critical sectors, including education. ARRA laid the foundation for education reform by supporting investments in innovative strategies that are most likely to lead to improved results for students, long-term gains in school and school system capacity, and increased productivity and effectiveness. ARRA provided funding for several key discretionary grant programs, including the Race to the Top Fund and the Investing in Innovation Fund (i3) programs., 967361=Abstract: This rule implements the provisions of the William Wilberforce Trafficking Victims Protection Reauthorization Act of 2008 (TVPRA), Public Law 110-457, 122 Stat. 5074 (Dec. 23, 2008) relating to unaccompanied alien children seeking asylum. Specifically, the rule proposes to amend Department of Homeland Security and Department of Justice regulations relating to asylum applications filed by unaccompanied alien children. The rule will amend both Departments' regulations to reflect that U.S. Citizenship and Immigration Services (USCIS) has initial jurisdiction over any asylum application filed by an unaccompanied alien child. The rule will also add new special procedures for all children in interviews before USCIS officers and for unaccompanied alien children in proceedings before immigration judges in the Executive Office for Immigration Review., 610492=On May 5, 2011, ED announced through a notice in the Federal Register that it was beginning a negotiated rulemaking process to streamline the loan program regulations by repealing unnecessary FFEL Program regulations and incorporating and modifying necessary requirements within the Direct Loan Program regulations, as appropriate. ED held four public hearings in May 2011 to obtain public feedback on proposed amendments, as well as on possible amendments to other ED regulations, including those governing income-based and income-contingent loan repayment plans and loan discharges based on the total and permanent disability of the borrower. Based on the feedback received from these hearings, ED will soon form a negotiated rulemaking committee to consider proposed amendments and intends to conduct these negotiations in 2012., 712547=Legal Deadline: Final, Statutory, September 27, 2009, FDA is directed to issue proposed and final regulations under FDA Amendments Act by the statutory deadline., 599851=Overall, the laws, regulations, and programs we administer will affect nearly every American during his or her life. Indeed, in the 2011 to 2012 school year, about 55 million students will attend an estimated 99,000 elementary and secondary schools in approximately 13,800 public school districts, and about 21 million students will enroll in degree-granting postsecondary schools. All of these students may benefit from some degree of financial assistance or support from the Department., 981260=RIN: 1615-AB98, 390997=Section 208 requires the Secretary to promulgate proposed regulations to establish science-based nutrition standards for all foods sold in schools not later than December 13, 2011. The nutrition standards would apply to all food sold outside the school meal programs, on the school campus, and at any time during the school day. (11-004), 868058=Regulations Related to the Commonwealth of Northern Mariana Islands. During 2009, USCIS issued three regulations to implement the extension of U.S. immigration law to the Commonwealth of Northern Mariana Islands (CNMI), as required under title VII of the Consolidated Natural Resources Act of 2008. During fiscal year 2011, USCIS issued two final rules related to the extension of the U.S. immigration law to the CNMI. In fiscal year 2012, USCIS will issue the following CNMI final rule: The joint USCIS/Department of Justice (DOJ) regulation “Application of Immigration Regulations to the CNMI.”, 213297=As discussed below, a large number of significant recent steps have been taken, consistent with Executive Order 13563, to reduce regulatory costs and ensure that our regulatory system is consistent with promoting growth and job creation. At the same time, a number of steps have been taken to promote public health, welfare, safety, and our environment. It is important to emphasize that the net benefits of recent rules, including the monetized benefits, are high—over the first two fiscal years of this Administration, in excess of $35 billion. Rules have been issued and initiatives have been undertaken that are saving lives on the highways and in workplaces; reducing air and water pollution, preventing thousands of deaths in the process; increasing fuel economy, thus saving money while reducing pollution; making both trains and planes safer; increasing energy efficiency, saving billions of dollars while increasing energy security; combating childhood obesity; and creating a “race to the top” in education. Consider, as merely one example, the fact that in 2010, the rates of roadway fatalities and injuries fell to their lowest recorded levels and to their lowest numbers since 1949. The decrease is attributable, in part, to a range of regulatory actions and to private-public partnerships that have increased safety., 1002794=Agency Contact: Laura M. Dawkins, Chief, Family Immigration and Victim Protection Division, Department of Homeland Security, U.S. Citizenship and Immigration Services, Suite 1200, 20 Massachusetts Avenue NW., Washington, DC 20529, Phone: 202 272-1470, Fax: 202 272-1480, Email: laura.dawkins@dhs.gov., 673733=Agency Contact: Tina Kaarsberg, Office of Building Technologies Program, EE-2J, Department of Energy, Energy Efficiency and Renewable Energy, 1000 Independence Avenue SW., Washington, DC 20585, Phone: 202 287-1393, Email: tina.kaarsberg@ee.doe.gov., 825088=Summary of Legal Basis: Section 1833 of the Social Security Act establishes Medicare payment for hospital outpatient services and ASC services. The final rule revises the Medicare hospital OPPS and ASC payment system to implement applicable statutory requirements. In addition, the proposed and final rules describe changes to the outpatient APC system, relative payment weights, outlier adjustments, and other amounts and factors used to determine the payment rates for Medicare hospital outpatient services paid under the prospective payment system, as well as changes to the rates and services paid under the ASC payment system. These changes would be applicable to services furnished on or after January 1, 2013., 319505=Further, the 2010 Reauthorization Act directed the Secretary to establish a Committee that represented the spectrum of interests within the pork industry, as well as related stakeholders, to ensure all parties had input into the regulatory framework. Specifically, the statute required that the Committee include representatives from (i) organizations representing swine producers; (ii) organizations representing packers of pork, processors of pork, retailers of pork, and buyers of wholesale pork; (iii) Department of Agriculture; and (iv) interested parties that participate in swine or pork production., 929271=Legal Authority: 5 U.S.C. 552; 5 U.S.C. 552a; 8 U.S.C. 1101; 8 U.S.C. 1101 note; 8 U.S.C. 1102, 838253=Legal Authority: Pub. L. 111-148, secs 1413, 1414, 2001, 2002, 2101, 2201, 993112=Legal Authority: 5 U.S.C. 552; 5 U.S.C. 552a; 8 U.S.C. 1101 to 1104; 8 U.S.C. 1182; 8 U.S.C. 1184; 8 U.S.C. 1187; 8 U.S.C. 1201; 8 U.S.C. 1224 to 1227; 8 U.S.C. 1252 to 1252a; 8 U.S.C. 1255; 22 U.S.C. 7101; 22 U.S.C. 7105, 874575=Implementation of the 1995 Amendments to the International Convention on Standards of Training, Certification, and Watchkeeping (STCW) for Seafarers, 1978. The Coast Guard proposed to amend its regulations to implement changes to an interim rule published on June 26, 1997. These proposed amendments go beyond changes found in the interim rule and seek to more fully incorporate the requirements of the STCW in the requirements for the credentialing of U.S. merchant mariners. The proposed changes are primarily substantive and: (1) Are necessary to continue to give full and complete effect to the STCW Convention; (2) incorporate lessons learned from implementation of the STCW through the interim rule and through policy letters and Navigation and Vessel Inspection Circulars (NVICs); and (3) attempt to clarify regulations that have generated confusion. The Coast Guard published this proposal as a Supplemental Notice of Proposed Rulemaking (SNPRM) on August 1, 2011. The Coast Guard intends to review and analyze comments received on that SNPRM, and publish a subsequent rule complying with the requirements of the newly amended STCW Convention. DHS included this rulemaking in the DHS Final Plan for the Retrospective Review of Existing Regulations, which DHS released on August 22, 2011., 843582=Legal Deadline: Final, Statutory, January 1, 2014., 305192=Priorities: In addition to responding to provisions of legislation authorizing and modifying Federal nutrition assistance programs, FNS' 2012 regulatory plan supports USDA's Strategic Goal “Ensure that all of America's children have access to safe, nutritious, and balanced meals,” and its two related objectives:, 494622=Magnuson-Stevens Fishery Conservation and Management Act (Magnuson-Stevens Act) rulemakings concern the conservation and management of fishery resources in the U.S. Exclusive Economic Zone (generally 3-200 nautical miles). Among the several hundred rulemakings that NOAA plans to issue in FY 2012, a number of the preregulatory and regulatory actions will be significant. The exact number of such rulemakings is unknown, since they are usually initiated by the actions of eight regional Fishery Management Councils (FMCs) that are responsible for preparing fishery management plans (FMPs) and FMP amendments, and for drafting implementing regulations for each managed fishery. NOAA issues regulations to implement FMPs and FMP amendments. Once a rulemaking is triggered by an FMC, the Magnuson-Stevens Act places stringent deadlines upon NOAA by which it must exercise its rulemaking responsibilities. FMPs and FMP amendments for Atlantic highly migratory species, such as bluefin tuna, swordfish, and sharks, are developed directly by NOAA, not by FMCs., 574099=Pursuant to section 6 of Executive Order 13563 “Improving Regulation and Regulatory Review (January 18, 2011), the following Regulatory Identifier Numbers (RINs) have been identified as associated with retrospective review and analysis in the Department's final retrospective review of regulations plan. All are of particular interest to small businesses. Some of these entries on this list may be completed actions, which do not appear in The Regulatory Plan. However, more information can be found about these completed rulemakings in past publications of the Unified Agenda on Reginfo.gov in the Completed Actions section for that agency. These rulemakings can also be found on Regulations.gov. The final agency plans can be found at: http://www.regulations.gov/exchange/topic/eo-13563, 950911=The Government Paperwork Elimination Act provides that, when possible, Federal agencies are directed to make available electronic forms and provide for electronic filing and submissions when conducting agency business with the public. See Public Law 105-277, section 1703 (Oct. 21, 1998), 44 U.S.C. 3504. GPEA also establishes the means for the use and acceptance of electronic signatures., 938718=Agency Contact: Laura M. Dawkins, Chief, Family Immigration and Victim Protection Division, Department of Homeland Security, U.S. Citizenship and Immigration Services, Suite 1200, 20 Massachusetts Avenue NW., Washington, DC 20529, Phone: 202 272-1470, Fax: 202 272-1480, Email: laura.dawkins@dhs.gov., 961740=This rule will significantly enhance the ability of USCIS to fully implement the Government Paperwork Elimination Act (GPEA). See Public Law 105-277, tit. XVII, section 1701 to 1710, 112 Stat. 2681 at 2681-749, (Oct. 21, 1998) (codified at 44 U.S.C. 3504 note). GPEA provides that, when possible, Federal agencies use electronic forms, electronic filing, and electronic submissions to conduct agency business with the public. Id. The USCIS modernization and transformation effort will move its operations away from a paper-based system to an electronic environment wherever possible in an effort to implement the requirements of GPEA., 770299=Summary of Legal Basis: The Infant Formula Act of 1980 (the 1980 Act) (96) amended the Federal Food, Drug, and Cosmetic Act (the Act) to include section 412 (21 U.S.C. 350a). This law is intended to improve protection of infants consuming infant formula products by establishing greater regulatory control over the formulation and production of infant formula. In 1982, FDA adopted infant formula recall procedures in subpart D of 21 CFR part 107 of its regulations (47 FR 18832, Apr. 30, 1982), and infant formula quality control procedures in subpart B of 21 CFR part 106 (47 FR 17016, Apr. 20, 1982). In 1985, FDA further implemented the 1980 Act by establishing subparts B, C, and D in 21 CFR part 107 regarding the labeling of infant formula, exempt infant formulas, and nutrient requirements for infant formula, respectively (50 FR 1833, Jan. 14, 1985; 50 FR 48183, Nov. 22, 1985; and 50 FR 45106, Oct. 30, 1985)., 897862=On October 29, 2008, DHS published an Advance Notice of Proposed Rulemaking (ANPRM) for the Secure Handling of Ammonium Nitrate Program, and received a number of public comments on that ANPRM. DHS reviewed those comments and published a Notice of Proposed Rulemaking (NPRM) on August 3, 2011. NPPD will accept public comment on until December 1, 2011, after which NPPD will review the public comments and develop a Final Rule related to the Security Handling of Ammonium Nitrate Program., 477629=Agency Contact: Dr. Daniel L. Engeljohn, Assistant Administrator, Office of Policy and Program Development,Department of Agriculture, Food Safety and Inspection Service, 1400 Independence Avenue SW., Washington, DC 20250, Phone: 202 205-0495, Fax: 202 401-1760, Email: daniel.engeljohn@fsis.usda.gov., 650859=Additional Information: Comments pertaining to this rule may be submitted electronically to WICF-2008-STD-0015@ee.doe.gov., 965059=Additional Information: CIS# 2505-11. This rule (RIN 1615-AB95) is adopting the following three rules as final rules: 1615-AA35, 1615-AA56, and 1615-AA53., 392155=Section 208 requires the Secretary to promulgate proposed regulations to establish science-based nutrition standards for all foods sold in schools not later than December 13, 2011. The nutrition standards would apply to all food sold outside the school meal programs, on the school campus, and at any time during the school day., 645501=RIN: 1904-AB57, 976045=Summary of Legal Basis: 5 U.S.C. 301; 5 U.S.C. 552; 5 U.S.C. 552a; 8 U.S.C. 1101 and note 1102, 1103, 1151, 1153, 1154, 1182, 1184, 1185 note (sec. 7209 of Pub. L. 108-458; title VII of Pub. L. 110-229), 1186a, 1187, 1221,1223, 1225 to 1227, 1255a, and 1255a note, 1281, 1282, 1301 to 1305, 1324a, 1356, 1372, 1379, 1409(c), 1443 to 1444, 1448, 1452, 1455, 1641, 1731 to 1732; 31 U.S.C. 9701; 48 U.S.C. 1901, 1931 note; section 643, Public Law 104-208, 110 Stat. 3009-708; section 141 of the Compacts of Free Association with the Federated States of Micronesia and the Republic of the Marshall Islands, and with the Government of Palau,; title VII of Public Law 110-229; Public Law 107-296, 116 Stat. 2135 (6 U.S.C. 1 et seq.); 82, 66 Stat. 173, 238, 254, 264; title VII of Public Law 110-229; E.O. 12356., 739700=Legal Deadline: Final, Statutory, July 4, 2012, Final rule must be published no later than 18 months after the date of enactment of the FDA Food Safety Modernizaton Act., 980355=Additional Information: Previously 1615-AB29 (CIS 2311-04), which was withdrawn in 2007. DHS has included this rule in its Final Plan for the Retrospective Review of Existing Regulations, which DHS issued on August 22, 2011., 481435=Summary of Legal Basis: 21 U.S.C. 612 and 613; 21 U.S.C. 459, and Public Law 110-246, section 11017., 654084=Summary of Legal Basis: Section 413 of the Energy Independence and Security Act of 2007 (EISA), 42 U.S.C. 17071, directs DOE to develop and publish energy standards for manufactured housing., 473727=Risks: Before FSIS published the proposed rule, FDA and FSIS had estimated that each year L. monocytogenes caused 2,540 cases of foodborne illness, including 500 fatalities. The Agencies estimated that about 65.3 percent of these cases, or 1660 cases and 322 deaths per year, were attributable to RTE meat and poultry products. The analysis of the interim final rule on control of L. monocytogenes conservatively estimated that implementation of the rule would lead to an annual reduction of 27.3 deaths and 136.7 illnesses at the median. FSIS is continuing to analyze data on production volume and Listeria controls in the RTE meat and poultry products industry and is using the FSIS risk assessment model for L. monocytogenes to determine the likely risk reduction effects of the rule. Preliminary results indicate that the risk reductions being achieved are substantially greater than those estimated in the analysis of the interim rule., 404788=Statement of Need: This final rule will implement the requirement in section 201 of the Healthy, Hunger-Free Kids Act of 2010 (Pub. L. 111-296) (the Act) that USDA promulgate regulations to update the meal patterns and nutrition standards for school lunches and breakfasts based on recommendations made by the Institute of Medicine (IOM). USDA issued a proposed rule on January 13, 2011. The Act requires USDA to issue interim or final regulations not later than 18 months after promulgation of the proposed regulation., 793229=Abstract: The Food and Drug Administration (FDA) published a proposed rule in the Federal Register of April 6, 2011 (72 FR 19238) to establish requirements for nutrition labeling of certain food items sold in certain vending machines. FDA also proposed the terms and conditions for vending machine operators registering to voluntarily be subject to the requirements. FDA took this action to carry out section 4205 of the Patient Protection and Affordable Care Act (“Affordable Care Act” or “ACA”), which was signed into law on March 23, 2010., 995932=Abstract: This rule sets forth measures by which certain victims of severe forms of trafficking who have been granted T nonimmigrant status and victims of certain criminal activity who have been granted U nonimmigrant status may apply for adjustment to permanent resident status in accordance with Public Law 106-386, Victims of Trafficking and Violence Protection Act of 2000; and Public Law 109-162, Violence Against Women and Department of Justice Reauthorization Act of 2005. The Trafficking Victims Protection Reauthorization Act of 2008, Public Law 110-457, made amendments to the T nonimmigrant status provisions of the Immigration and Naturalization Act. The Department will issue another interim final rule to make the changes required by recent legislation and to provide the opportunity for notice and comment., 488990=The vast majority of the Department's programs and activities do not involve regulation. Of the Department's 12 primary operating units, only the National Oceanic and Atmospheric Administration (NOAA) will be planning actions that are considered the “most important” significant preregulatory or regulatory actions for FY 2012. During the next year, NOAA plans to publish four rulemaking actions that are designated as regulatory plan actions. The Bureau of Industry and Security (BIS) will also publish rulemaking actions designated as regulatory plan actions. Further information on these actions is provided below., 506716=In August 2009, the President directed a broad-based interagency review of the U.S. export control system with the goal of strengthening national security and the competitiveness of key U.S. manufacturing and technology sectors by focusing on the current threats and adapting to the changing economic and technological landscape. In August 2010, the President outlined an approach under which agencies that administer export controls will apply new criteria for determining what items need to be controlled and a common set of policies for determining when an export license is required. The control list criteria are to be based on transparent rules, which will reduce the uncertainty faced by our Allies, U.S. industry and its foreign customers, and will allow the Government to erect higher walls around the most sensitive export items in order to enhance national security., 215517=These figures reflect the numbers for 2009 and 2010. As noted, the net benefits for 2011 are expected to be unusually high (in excess of $50 billion); they will be discussed in detail in the 2012 Report to Congress on the Benefits and Costs of Federal Regulations., 344356=Summary of Legal Basis: This proposed rule would address a recommendation submitted to the Secretary of Agriculture by the National Organic Standards Board (NOSB) on April 29, 2011, to continue the exemption for nutrient vitamins and minerals in organic products as provided by the NOP National List of Allowed and Prohibited Substances (National List). The Organic Foods Production Act of 1990 (OFPA) authorizes the Secretary to amend the National List based on proposed amendments developed by the NOSB. The Sunset Provision, in section 6517(e) of the OFPA, provides that no exemption or prohibition on the National List will remain valid after 5 years unless the exemption or prohibition has been reviewed and the Secretary renews the listing. The exemption for nutrient vitamins and minerals is scheduled to sunset on October 21, 2012., 612428=We published the final regulations establishing the gainful employment eligibility measures on June 13, 2011 (Gainful Employment—Debt Measures). In those regulations, the Department established measures for gainful employment programs that are intended to identify the worst performing programs. We believe that when these new regulations go into effect on July 1, 2013, the notification process for all new gainful employment programs established in the Gainful Employment—New Programs final regulations will no longer be needed. Accordingly, the Department has issued a new NPRM, which among other changes, proposes to reduce burden for institutions by amending the Gainful Employment—New Programs final regulations to establish a smaller group of gainful employment programs for which an institution must obtain approval from the Department., 717242=Alternatives: The 2011 FSMA limited the Agency's flexibility to exclude many requirements. It described in detail its requirements for subpart C, concerning the hazard analysis and risk-based preventive controls part of the proposed rule. Alternatives include certain requirements listed in subpart B concerning operations and practices., 882356=Electronic System for Travel Authorization (ESTA). On June 9, 2008, CBP published an interim final rule amending DHS regulations to implement the Electronic System for Travel Authorization (ESTA) for aliens who wish to enter the United States under the Visa Waiver Program (VWP) at air or sea ports of entry. This rule is intended to fulfill the requirements of section 711 of the Implementing Recommendations of the 9/11 Commission Act of 2007 (9/11 Act). The rule establishes ESTA and delineates the data field DHS has determined will be collected by the system. The rule requires that each alien traveling to the United States under the VWP must obtain electronic travel authorization via the ESTA in advance of such travel. VWP travelers may obtain the required ESTA authorization by electronically submitting to CBP biographic and other information as currently required by the I-94W Nonimmigrant Alien Arrival/Departure Form (I-94W). By Federal Register notice dated November 13, 2008, the Secretary of Homeland Security informed the public that ESTA would become mandatory beginning January 12, 2009. This means that all VWP travelers must either obtain travel authorization in advance of travel under ESTA or obtain a visa prior to traveling to the United States., 376637=Alternatives: As part of its ongoing efforts to safeguard animal health, APHIS initiated implementation of the National Animal Identification System (NAIS) in 2004. More recently, the Agency launched an effort to assess the level of acceptance of NAIS through meetings with the Secretary, listening sessions in 14 cities, and public comments. Although there was some support for NAIS, the vast majority of participants were highly critical of the program and of USDA's implementation efforts. The feedback revealed that NAIS has become a barrier to achieving meaningful animal disease traceability in the United States in partnership with America's producers., 946420=Agency Contact: Molly Groom, Office of the Chief Counsel Department of Homeland Security, U.S. Citizenship and Immigration Services, 20 Massachusetts Avenue NW., Washington, DC 20259, Phone: 202 272-1400, Fax: 202 272-1408, Email: molly.groom@dhs.gov., 176548=Executive Order 13563 entitled “Improving Regulation and Regulatory Review,” signed January 18, 2011, supplements and reaffirms the principles, structures, and definitions governing contemporary regulatory review that were established in Executive Order 12866, which includes the general principles of regulation and public participation, and orders integration and innovation in coordination across agencies; flexible approaches where relevant, feasible, and consistent with regulatory approaches; scientific integrity in any scientific or technological information and processes used to support the agencies' regulatory actions; and retrospective analysis of existing regulations., 442935=Agency Contact: Rosalyn Murphy-Jenkins, Director, Labeling and Program Delivery Division, Department of Agriculture, Food Safety and Inspection Service, Patriots Plaza 3, 8th Floor, Room 8-148, Stop 5273, 1400 Independence Avenue SW, Washington, DC 20250-5273, Phone: 301 504-0878, Fax: 301 504-0872, Email: rosalyn.murphy-jenkins@fsis.usda.gov., 399886=Summary of Legal Basis: Healthy, Hunger-Free Kids Act of 2010 (Pub. L. 111-296).}",
    "textBeforeTable": "In addition to looking back at existing regulations, we are looking forward to ensure that future regulations are well-justified. Executive Order 13563 provides critical guidance with its emphasis on careful consideration of costs and benefits, public participation, integration and innovation, flexible approaches, and science. These requirements are meant to produce a regulatory system that draws on recent learning, that is driven by evidence, and that is suited to the distinctive circumstances of the twenty-first century. The regulatory lookback is not merely a one-time exercise. Regular reporting, about recent progress and coming initiatives, is required. The goal is to change the regulatory culture to ensure that rules on the books are reevaluated and are effective, cost-justified, and based on the best available science. By creating regulatory review teams at agencies, we will continue to examine what is working and what is not and to eliminate unjustified and outdated regulations. To promote flexibility, the Department of Health and Human Services has proposed two rules, and finalized another, to reduce burdensome regulatory requirements now placed on hospitals and doctors. These reforms are expected to save more than $1 billion annually. The Departments of Commerce and State are undertaking a series of steps to eliminate unnecessary barriers to exports, including duplicative and unnecessary regulatory requirements, thus reducing the cumulative burden and uncertainty faced by American companies and their trading partners. These steps will make it a",
    "textAfterTable": "Proposed Rule Stage. 4 Plant Pest Regulations; Update of General Provisions 0579-AC98 Proposed Rule Stage. 5 Importation of Live Dogs 0579-AD23 Final Rule Stage. 6 Animal Disease Traceability 0579-AD24 Final Rule Stage. 7 Supplemental Nutrition Assistance Program: Farm Bill of 2008 Retailer Sanctions 0584-AD88 Proposed Rule Stage. 8 National School Lunch and School Breakfast Programs: Nutrition Standards for All Foods Sold in School, as Required by the Healthy, Hunger-Free Kids Act of 2010 0584-AE09 Proposed Rule Stage. 9 WIC: Electronic Benefit Transfer (EBT) Implementation 0584-AE21 Proposed Rule Stage. 10 Nutrition Standards in the National School Lunch and School Breakfast Programs 0584-AD59 Final Rule Stage. 11 Direct Certification of Children in Food Stamp Households and Certification of Homeless, Migrant, and Runaway Children for Free Meals 0584-AD60 Final Rule Stage. 12 Eligibility, Certification, and Employment and Training Provisions of the Food, Conservation, and Energy Act of 2008 0584-AD87 Final Rule Stage. 13 Supplemental Nutrition Assistance Program: Nutrition Education and Obesity Prevention Grant 0584-AE07 Final Rule Stage. 14 Prior Labeling Approval System: Generic Label Approval 0583-AC59 Proposed Rule Stage. 15 Product Labeling: Use of the Voluntary Claim “Natural” on the Labeling of Meat and Poultry Products 0583-AD30 Proposed Rule Stage. 16 New",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}