{
    "relation": [
        [
            "Option",
            "OK",
            "Cancel",
            "Apply"
        ],
        [
            "Description",
            "Accepts the choice of names you have entered and exits the page.",
            "Cancels the choice of names and does not exit the page.",
            "Accepts the choice of names you have entered but does not exit the page."
        ]
    ],
    "pageTitle": "OpenVMS documentation",
    "title": "",
    "url": "http://h71000.www7.hp.com/doc/84final/6552/6552pro_003.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00340-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 109943471,
    "recordOffset": 109904918,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{53141=You must determine an appropriate value for your configuration by experimentation. An initial value of 2000 (2ms) to 5000 (5ms) is suggested.\"}",
    "textBeforeTable": "You can access fixes, by category, from the pages listed in Table 6-1. Cluster interconnect fixes Disk fixes Process fixes Node fixes 6.1 Understanding Fixes When you suspect or detect a resource availability problem, in many cases you can use the Availability Manager Data Analyzer to analyze the problem and to perform a fix to improve the situation. Data Analyzer fixes fall into the following categories: Performing certain fixes can have serious repercussions, including possible system failure. Therefore, only experienced system managers should perform fixes. Caution Performing fixes Understanding fixes Chapter 6 Performing Fixes on OpenVMS Nodes Fixes allow you to resolve resource availability problems and improve system availability. This chapter discusses the following topics: Index Contents Previous HP OpenVMS Availability Manager User's Guide HP OpenVMS Availability Manager User's Guide A:active {color: red; background-color: white} A:hover {color: green}",
    "textAfterTable": "General process fixes: Delete Process Exit Image Suspend Process Resume Process Process Priority Process memory fixes: Purge Working Set (WS) Adjust Working Set (WS) Process limits fixes: Direct I/O Buffered I/O AST Open file Lock Timer Subprocess I/O Byte Pagefile Quota All of the process fixes are available from the following pages: Memory Summary I/O Process CPU Process Single Process Disk fixes: Cancel disk MV Cancel SSM MV All of the disk fixes are available from the following pages: Disk Status Summary Disk Volume Summary Cluster interconnect fixes: These fixes are available from the following lines of data on the Cluster Summary page (Figure 4-1): - SCA Port:/ Adjust Priority Right-click a data item on the Local Port Data display line to display a menu. Then select Port Fix.... - SCA Circuit:/ Adjust Priority Right-click a data item on the Circuits Data display line to display a menu. Then select Circuit Fix.... LAN Virtual Circuit Summary: Maximum Transmit Window Size",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}