{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Cochise College has security on campus at all times. They will help escort you to your vehicle as well as there are cameras in the parking lots. The security guards are very friendly and helpful.",
            "The classes are very helpful to the disabled.",
            "Cochise College is convenient in location. If you live in Sierra Vista travel time is not long at all. Cochise College has career week and they usually have cook outs and so forth.",
            "The best bang for your buck is the nursing program. It is convenient and affordable compared to other universities.",
            "I enjoy working out at the gym. I also like spending time with my family. My favorite past time is watching a good movie.",
            "Cochise College has a great dining area. The food is always good and they offer snacks as well. The location is very convenient.",
            "I am not sure if Cochise College offers dorms in Douglas, AZ but I know they don't have them on Sierra Vista campus.",
            "They offer a wide array of classes that allow you to succeed.",
            "Go see the friendly councilors. Take advantage of the online courses that Cochise has to offer. If your interested in becoming a nurse they have a great nursing program.",
            "Cochise college is a friendly environment. It's a great place because it provides affordable and flexible education in an economically challenged area. The class are well structured and professional."
        ]
    ],
    "pageTitle": "Cochise College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Cochise-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00181-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 887550071,
    "recordOffset": 887514168,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{166446=There are multiple clubs to take part of when you are a student at the college. The All Clubs meeting which is held every Friday during the semester is a great way to get out and see what is available. The college also hold events around the year, including the Writing Festival in Spring and the Haunted Union during October., 166027=Tuition is around $79/semester hour. I have never had to pay more that $2000 a semester for full time classes. It is one of the lowest tuition rates in the country and offers discounts if you are a Senior, Native American or a Veteran., 13466=I am starting at Cochise college in the fall of 2011 and majoring in engineering. I am looking forward to learning a lot and taking great classes., 171938=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/01/2009 Reviewer is A current student here. 1 out of 1 people found this review useful. 1 of 42 Aaron from Sierra Vista, AZ Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Bang for the buck The prices are very good for a college at just $54.00 a credit, but you get what you pay for. Am enjoying being here Like I said in my last comment, the instructors vary in quality and the increase in online classes while dropping face to face classes in favor of online classes has really made Cochise not the college it could be. I am passing most of my classes so far with the exception of two online classes that were not offered in face to face such as juvenile justice and psychology which are low level classes that most degrees require taking. Am learning a lot Some of my classes were interesting and I learned a lot. The placement test isn't the greatest of tests though, I tested into English 102 and maxed out the reading test, but because of the test score difference between the two tests, I had to come in and write an assigned essay, the essay assigned was not a good test of English and writing skills and so they then said the essay put me into English 100 which is two grades lower than what I tested into the first time. So then I had to take two more classes",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}