{
    "relation": [
        [
            "Patent application number",
            "20110284689",
            "20120068014",
            "20120119029"
        ],
        [
            "Description",
            "AIRCRAFT CABIN PANEL FOR SOUND REDUCTION - The present invention relates to an aircraft cabin panel for sound reduction in an interior space. The invention in particular also relates to an aircraft comprising an interior lining with sound-absorbing and sound-reducing panels. In order to provide a panel that is optimized in terms of the design space required by it and in terms of its weight, for use in aircraft, which panel provides improved sound reduction and sound absorption characteristics, an aircraft cabin panel for sound reduction in an interior space is provided, which aircraft cabin panel in at least one region comprises a sandwich construction with a core layer, a first covering layer and a second covering layer. The core layer comprises sound absorbing open-pore core material. The first and the second covering layer are connected to the core layer in a planar fashion. The first covering layer is arranged towards the sound waves to be absorbed and the second covering layer is arranged opposite the first covering layer. The first covering layer is designed so as to be acoustically transparent.",
            "SEGMENT OF A FUSELAGE OF AN AIRCRAFT - According to an exemplary embodiment of the invention a fuselage segment of an aircraft fuselage is provided, which aircraft fuselage comprises four different radii of curvature, wherein two radii of curvature comprise centre points that are not situated on a vertical symmetry axis of the fuselage segment.",
            "MONUMENT FOR A CABIN OF A VEHICLE - An area-expandable monument is provided for a cabin of a vehicle that includes, but is not limited to two housing parts that are displaceable relative to each other and can be fastened. A gap between the housing parts in an expanded state can be covered by a covering element. In the monument, a first sanitary fixture could be arranged whose position adapts to the spatial state of the monument. Optionally, there is also a pivotable second sanitary fixture that can be activated with the monument in its pushed-out state."
        ],
        [
            "Published",
            "11-24-2011",
            "03-22-2012",
            "05-17-2012"
        ]
    ],
    "pageTitle": "Sturm, DE - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/sturm-de-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00090-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428923867,
    "recordOffset": 428903340,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Ralph Sturm, Schenefeld DE 02-02-2012 THIN FILM SOLAR CELL AND METHOD FOR PRODUCING IT - A thin-film solar cell includes a front-side glass substrate, a front contact arranged above the glass substrate, an absorber arranged above the front contact, and a rear contact arranged above the absorber. A TCO layer system composed of an intrinsic TCO layer deposited above the substrate and a doped TCO layer arranged thereabove is provided, as well as a method for producing such a thin-film solar cell. Improved transmission, reflection and absorption properties of the TCO layer is achieved by composing the TCO layer of a first doped TCO sublayer deposited directly on the intrinsic TCO layer, and a second doped TCO sublayer deposited directly on the first doped TCO sublayer. 20120024363 05-12-2011 METHOD FOR DEPOSITING A TRANSPARENT CONDUCTIVE OXIDE (TCO) FILM ON A SUBSTRATE AND THIN-FILM SOLAR CELL - A method is provided for depositing a transparent conductive oxide (TCO) layer on a substrate, in which contaminations of the layers of the layer system is reduced through the diffusion of material from the substrate, and whose layer properties in respect to coupling and transmission of light are optimized. For that purpose, a barrier layer, a seed layer and a transparent conductive oxide layer are directly successively deposited on the substrate. Also, a thin-film solar cell is described which comprises such a transparent conductive oxide layer. 20110108105 Published Description Patent application number",
    "textAfterTable": "Ralph Sturm, Hamburg DE Patent application number Description Published 20100288879 STORAGE LOCKER ARRANGEMENT - A storage compartment configuration and an aircraft having a storage compartment configuration according to the invention are proposed. The storage compartment configuration has a storage compartment having a storage space and a suspension. The storage space is designed to receive pieces of luggage. The suspension is used for the attaching the storage compartment to a load-bearing structure of the aircraft. The suspension is designed in such a manner that the storage compartment can be pivoted essentially around a geometrical center point of the storage space. 11-18-2010 Simon Sturm, Munchen DE Patent application number Description Published 20120140472 Calibration Light Source - The invention relates to a calibration radiation source comprising the following: a housing ( 06-07-2012 Stefan Sturm, Sulzdorf DE Patent application number Description Published 20110052366 Device And Method For Secure Control Of A Manipulator - A method according to the invention for controlling a manipulator, in particular a robot ( 03-03-2011 Thomas Sturm, Wiedenzhausen DE Patent application number Description Published 20080274865 Processing Plant - A machining or processing plant ( 11-06-2008 20130226341 ROBOT ARRANGEMENT - A robot arrangement has a movable, programmable robot ( 08-29-2013",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}