{
    "relation": [
        [
            "Product Code",
            "C1",
            "OP5",
            "INCF-6",
            "CTA-15",
            "TLC-25",
            "TLC-50"
        ],
        [
            "Description",
            "Carbon Post Filter",
            "5 Micron Pre Filter",
            "Inline Carbon Block Filter",
            "15 GPD CTA Membrane",
            "25 GPD TFC Membrane",
            "50 GPD TFC Membrane"
        ],
        [
            "Fits",
            "All Models",
            "All Models",
            "All Models",
            "Aqua Classic Systems",
            "All Models Except Flowmatic",
            "Flowmatic Systems"
        ],
        [
            "Price",
            "$12.00",
            "$8.00",
            "$13.00",
            "$49.00",
            "$52.00",
            "$73.00"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Buy Now",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Reverse Osmosis Systems, PuroTech, Proline, Millennium, Merlin, Replacement Filters and Membranes",
    "title": "",
    "url": "http://www.qualitywatertreatment.com/reverse_osmosis.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00140-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 660482231,
    "recordOffset": 660464246,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{73268=Copyright© 2006 - 2009 Quality Water Treatment, Inc. Qualitywatertreatment.com Domain and Logo are Service Marked SM, All Rights Reserved}",
    "textBeforeTable": "  Replacement Filters and Membranes for Nelsen, PuroTech, Proline, Proline Plus 5, Proline Gold and Millennium Reverse Osmosis Systems *   Back to Top Replacement Filters and Membranes       Product Details> $2110.00 Shipping Is Free Price: Introducing the world's first and best pH calibration system. Now with the most advanced calibration system ever offered, this system assures you that the pH level you select is precise and completely accurate. This is the only calibration system that filters all types of water to guarantee you are getting the best water quality available. Developed in the 1950s, the Japanese invented water ionizers. By adding a strong electrical current to ordinary tap water, ionized, alkaline and acidic water",
    "textAfterTable": "Back to Top Replacement Filters and Membranes for the Merlin Reverse Osmosis Systems   Product Name Description Fits Price   Buy Now Merlin Reverse Osmosis Replacement Membrane Membrane element for the 720 gallon-per-day Merlin™ reverse osmosis system. This membrane should be changed every 3 years Merlin $105.00   Merlin Reverse Osmosis Carbon/Sediment Pre-Filter Carbon/Sediment pre-filter provides protection and pre-filteration for the membrane element. This filter should be changed every 6 months Merlin $38.00   Merlin™ Reverse Osmosis System Carbon Post-Filter This granular activated carbon post filter provides the final \"polish\" to your purified drinking water. This filter should be changed every 8 to 12 months Merlin $33.00    ",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}