{
    "relation": [
        [
            "If you file Form. . .",
            "1040",
            "1040NR",
            "1040-SS",
            "1041"
        ],
        [
            "Then enter the amount from Schedule H, line 8, on. . .",
            "line 60a",
            "line 59a",
            "Part I, line 4",
            "Schedule G, line 6"
        ]
    ],
    "pageTitle": "Instructions for Schedule H (Form 1040), Household Employment Taxes - How To Fill In Schedule H, Form W-2, and Form W-3",
    "title": "",
    "url": "http://taxmap.ntis.gov/taxmap/instr/i1040sh-002.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00014-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 238021095,
    "recordOffset": 238001069,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 28 Jul 2015 14:11:16 GMT",
    "textBeforeTable": "No. Follow the instructions in the chart below. Yes. Complete Schedule H, Part II. Review the cash wages you paid to all your household employees for each calendar quarter of 2013 and 2014. Is the total for any quarter in 2013 or 2014 $1,000 or more? Line 9.(p5) taxmap/instr/i1040sh-002.htm#en_us_publink21451xd0e922 Add lines 2, 4, 6, and 7 and enter the result on line 8. Line 8. (p5) taxmap/instr/i1040sh-002.htm#en_us_publink21451xd0e91415926 (Circular E), Employer's Tax Guide, for information on withholding federal income taxes. and Pub. Enter on line 7 any federal income tax you withheld from the wages you paid to your household employees in 2014. See Pub. Line 7. (p5) taxmap/instr/i1040sh-002.htm#en_us_publink21451xd0e906 Multiply the amount on line 5 by 0.9% (.009) and enter the result on line 6.",
    "textAfterTable": "If you do not file any of the above forms, complete Schedule H, Part IV and follow the instructions under When and Where To File. taxmap/instr/i1040sh-002.htm#en_us_publink21451xd0e1009 Part II. Federal Unemployment (FUTA) Tax(p5) FUTA tax, with state unemployment systems, provides for payments of unemployment compensation to workers who have lost their jobs. Most employers pay both a federal and state unemployment tax. The FUTA tax rate is 6.0% (.060). But see Credit for contributions paid to state below. Do not deduct the FUTA tax from your employee's wages. You must pay it from your own funds. taxmap/instr/i1040sh-002.htm#en_us_publink21451xd0e1024 Credit for contributions paid to state.(p5) You may be able to take a credit of up to 5.4% against the FUTA tax, resulting in a net FUTA tax rate of 0.6% (.006). But to do so, you must pay all the required contributions for 2014 to your state unemployment fund by April 15, 2015. Fiscal year filers must pay all required contributions for 2014 by the due date of their federal income tax returns (not including extensions).",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}