{
    "relation": [
        [
            "Year",
            "2010",
            "2011",
            "2012"
        ],
        [
            "Pass",
            "505",
            "510",
            "483"
        ],
        [
            "Rank",
            "21",
            "25",
            "28"
        ],
        [
            "Comp",
            "305",
            "286",
            "300"
        ],
        [
            "Rank",
            "20",
            "26",
            "24"
        ],
        [
            "Passing Yards",
            "3,327",
            "3,255",
            "2,935"
        ],
        [
            "Rank",
            "26",
            "28",
            "32"
        ],
        [
            "TDs",
            "14",
            "20",
            "18"
        ],
        [
            "Rank",
            "29",
            "21",
            "26"
        ],
        [
            "Int",
            "26",
            "17",
            "12"
        ],
        [
            "Rank",
            "32",
            "23",
            "8"
        ]
    ],
    "pageTitle": "Fantasy Football Pre-Season Preview: Quarterbacks - Fantasy Football Articles",
    "title": "",
    "url": "http://www.thehuddle.com/2013/articles/j2v-fantasy-football-preseason-preview-quarterbacks.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00207-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 748405439,
    "recordOffset": 748375475,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38621=The Cowboys have $108 million reasons to put their faith in Tony Romo, and while some find fault in his late-game foibles or lack of postseason success fantasy owners look at the numbers and have to agree with Jerry Jones. That investment also should lessen any fears that new play-caller Bill Callahan will turn Dallas into a running team one year after watching Romo's attempts jump by 15 percent in 2012. With Dez Bryant poised to join the elite receivers and Jason Witten the most reliable tight end this side of Tony Gonzalez, the Cowboys will once again rely on Romo's arm to put points on the board; again, fantasy owners--aside from those invested in DeMarco Murray--couldn't be happier., 52029=Andrew Luck didn't necessarily make people forget Peyton Manning, but he did erase memories of the Kerry Collins/Curtis Painter/Dan Orlovsky nightmare in 2011. Luck topped 300 yards in three of his first four games and exceeded that mark a half-dozen times running Bruce Arians' big-strike offense, but with Arians now in Arizona those numbers might be reined in a bit under Pep Hamilton. Not that Luck's former Stanford OC doesn't trust his QB, but Hamilton's version of the West Coast offense isn't as likely to go deep; at Stanford about 40 percent of his completions were to tight ends, and even with Luck under center the Cardinal displayed a strong tendency to run the football. Luck's bottom line numbers shouldn't change dramatically, but that's likely because while he may not be over 300 as frequently he also won't be sub-250 yards seven times like he was last year. There's no reason to expect a regression of numbers, but given the change in system it's also tough to see Luck make a big jump towards elite fantasy numbers., 72003=Eli Manning's gaudy 2011 performance looks to be a bit of an aberration; though he's comfortably stepped up from the mid-3K yardage range to right around 4K, that 4,933 is an outlier. It'll be especially tough for Eli to get there if he can't even post a 300-yard game; his last came in Week 7, so he's working on a nine-game streak sub-300. Manning loses Martellus Bennett as well, but Victor Cruz is locked up and now the Giants can focus on tying down Hakeem Nicks as well. There's depth in the receiving corps, and the backfield is unproven so perhaps more of the offensive workload will revert back to the passing game. You've seen Manning's ceiling, but while he's elevated the floor he seems destined to hit halfway up the wall more consistently than return to something near the light fixtures., 46585=After a monster 2011--kind of a theme amongst quarterbacks--Green Bay's passing game fell back to Earth a little bit; despite similar attempts and completions yardage was off by more than 16 percent and touchdowns were down by almost one-fourth. Now they'll have to deal with the loss of Greg Jennings, though they held up just fine without him last season as missed half the year with injuries. The Packers also spent two early picks on running backs in hopes of making their offense a little more multi-dimensional, but there's little question this is still Aaron Rodgers' team. The 2011 numbers show what Rodgers and the Packers are capable of, but the reality of what they'll actually accomplish lies much closer to the 2010 and 2012 seasons that bracket it. Not that there's anything wrong with 4,300 yards and 30-plus touchdowns., 58023=(Improving) Here's another major shift in philosophy: Andy Reid's teams have thrown the ball at least 542 times each of the past nine seasons; the Chiefs haven't chucked it like that since 2007, when Damon Huard and Brodie Croyle were playing catch-up for the bulk of a 4-12 season. Alex Smith will run Reid's offense; he's never thrown more than 445 passes in a season, but like Winger and Ziskey in Stripes he is willing to learn. The better news is that Smith's completion percentage--a must-have trait in a West Coast offense--has been trending up each of his last two seasons in San Francisco and he was connecting on better than 70 percent of his throws prior to last year's injury and subsequent benching in favor of Colin Kaepernick. Dwayne Bowe heads up a good-not-great collection of pass-catchers, another Andy Reid trademark; given that Reid QBs have produced an average of 20 fantasy points per game for nine straight seasons, all that familiarity bodes well for Smith's numbers this season., 3731=Rookie quarterbacks and running quarterbacks were all the rage in 2012, but across the board the position was full of productivity. With so many quarterbacks putting up gaudy numbers, the temptation heading into 2013 is to wait on the position; after all, if you can still find above-average productivity in the middle rounds there's less of a need to reach for elite quarterbacks early on. Here's a breakdown of not only the position's productivity over the past few years but also each team's performance over that span--as well as what's in store for the upcoming campaign., 49368=Less T.J. Yates in 2012 meant a return to the 4K plateau for the Houston passing game. And when you consider how much of a run-first team the Texans truly are, that Matt Schaub has directed them to 4,000 yards two of three seasons and 20 or more passing scores each of the last three years it's plain to see he's doing a heckuva job. Of course, platitudes like that don't count for much in most fantasy leagues, so once again the Texans look poised to offer a consistent, reliable, yet ultimately middle-of-the-road fantasy solution at quarterback--with perhaps a smattering of upside due to the rave reviews first-round pick and projected WR2 DeAndre Hopkins has garnered thus far during offseason activities., 94416=(Improving) After a sophomore slump in 2011, Sam Bradford got back in the groove in 2012 with numbers that were an improvement even over his ROY stats. With Steven Jackson gone and the Rams looking at an untested backfield committee approach, it will be on the passing game to carry the offense. To that end Bradford has new weapons in rookie Tavon Austin and free agent tight end Jared Cook, as well as hoped-for development from youngsters Chris Givens, Brian Quick, and Austin Pettis. That's a bunch of young talent meeting a healthy dose of opportunity; makes sense that Bradford is a popular fantasy sleeper heading into the 2013 season., 102911=(Camp Watch) The Redskins went big with the trade for Robert Griffin III, and it paid off equally as big. While passing volume was down, efficiency was way up; moreover, the dual threat of RG3 as a runner made Alfred Morris and the ground game that much more effective. Of course, all eyes will be on RG3's recovery from the knee injury that dampened the finish of his fine rookie season--not just if and when he'll be healthy but also whether or not the injury tweaks how much Griffin runs. And seeing as he led all quarterbacks in rushing yardage and ranked only behind Cam Newton in QB rushing TDs, that's a hugh component of his fantasy value. The health of key receivers like Pierre Garçon and Fred Davis also comes into play, but there's insurance to the Washington Team QB due to fellow 2012 draftee Kirk Cousins, who threw for 466 yards and four touchdowns in one successful start and two spot appearances last year. He doesn't have RG3's fantasy upside, but he'll at least keep the rest of the supporting cast fantasy-relevant., 110825=Use of this website constitutes acceptance of it's Privacy Notice and Terms of Use. © 2015 THEHUDDLE.COM. Part of USA TODAY Sports Digital Properties.}",
    "textBeforeTable": "Rushing quarterbacks are taking over the fantasy top 10. Among the top scoring QBs rushing attempts were up by 20 percent, rushing yargage lept by a whopping 60 percent, and even after last year's spike of rushing scores that total crept upwards as well. Meanwhile, passes and completions continued to climb but yardage and touchdowns took a step backwards--as noted above, due to more West Coast-type passing games and fewer deep shots. Overall QB fantasy scoring fell off of last year's astounding pace--but it's still a healthy amount beyond what productivity has been prior to 2011's blow-up. Someone has to lose.  Don't let it be you.  Click here and join The Huddle today! Arizona Cardinals 3,741 295 44,990 3,753 5,937 33 2,427 522 2012 3,972 334 45,839 3,669 5,750 32 1,519 430 2011 3,431 290 40,917 3,547 5,487 14 1,399 392 2010 3,219 294 43,778 3,554 5,356 12 746 303 2009 3,305 263 40,904 3,505 5,490 13 1,289 417 2008 3,416 315 40,090 3,434 5,319 14 674 287 2007 2,474 222 36,985 3,118 5,161 18 2,123 451 2006 2,721 233 36,432 3,098 4,999 13 1,223 370 2005 3,192 302 41,259 3,261 5,169 14 1,388 401 2004 2,851 257 36,991 3,191 5,062 18 1,223 358 2003",
    "textAfterTable": "(Improving) It's not difficult to slap an \"improving\" tag here, as quarterback play in Arizona has been bottom-feeding since Kurt Warner retired. This offseason the Cardinals bought low on Carson Palmer and have teamed him with new coach Bruce Arians in hopes of kick-starting the passing game. Arians loves the home run ball, and Palmer's numbers in Oakland suggest he can still go deep; with Larry Fitzgerald itching to be put to work and Michael Floyd set to move into the lineup, there's an opportunity for Arizona to once again produce a fantasy helper at quarterback. Atlanta Falcons Year Pass Rank Comp Rank Passing Yards Rank TDs Rank Int Rank 2010 577 8 361 7 3,725 16 28 9 9 4 2011 593 4 365 7 4,365 8 29 7 13 9 2012 615 8 422 4 4,719 5 32 5 14 13 Matt Ryan's numbers continue to improve, and with Roddy White, Julio Jones, and Tony Gonzalez at his disposal once again there's no reason to expect a step backwards. The only potential stumbling block is the arrival of Steven Jackson, who should prove to be more effective in the ground game than Michael Turner was last year; however, Jackson's skill as a receiver provides a benefit for Ryan that should offset anything his rushing might take away. Ryan may not be viewed in the same",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}