{
    "relation": [
        [
            "Date",
            "Aug 21, 2003",
            "Jul 20, 2010",
            "Oct 1, 2013"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: COMPUTER SCIENCES CORPORATION,TEXAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:WAHLBIN, STEFAN;ROURKE, KATHLEEN E.;WIESMAN, KIMBERLY;REEL/FRAME:014413/0571 Effective date: 20030717",
            "",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US20040111301 - Computerized method and system for estimating liability for an accident ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20040111301?dq=5,778,372",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00026-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470180463,
    "recordOffset": 470058414,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{391815=[0296]FIG. 29 is a flow chart for estimating the effect of a factor that accounts for the contribution of road character to a motor vehicle accident according to one embodiment. The road character factor may be applied to the tortfeasor and/or other party for any accident type. As shown in FIG. 29, the road character at decision point 2901 may be either level or some other character. If the road character is level, then step 2903 indicates that the factor may not be applicable. Other road characters may include, but are not limited to, a roadway that has a hill, a hillcrest, or a sag-bottom of a hill. If other road characters apply to the roadway, then step 2905 may indicate that the factor may be a talking point., 373873=[0274] In FIG. 22, decision point 2201 and step 2205 indicate the factor may only be applicable for accident type 16, not including roadway configuration F. If the answer to decision point 2201 is yes, then decision point 2203 may ask whether high beams were on at the time of the accident. If not, then the factor may not be applicable, as shown by step 2209. If the high beams were on, the lighting may be determined at step 2207. If the lighting was dark, with or without streetlights, then liability may depend upon which party is being considered, as shown by decision point 2211. If the lighting was other than dark, with or without streetlights (e.g., daylight, dawn, or dusk) then the factor may not be applicable, as shown by step 2213. If the party is the tortfeasor, then decision point 2215 may ask whether the other party was blinded. If the other party was blinded, then the factor may be a talking point, as shown by step 2219. If the other party was not blinded, then the factor may not be applicable, as shown by step 2217. In other embodiments, a “medium” penalty value may be assessed to the tortfeasor if the other party was blinded, and a “low” penalty value may be assessed if the other party was not blinded., 367984=[0266]FIG. 20c depicts a table for determining a recommended safe following distance. If the driver of the rear vehicle was traveling at less than or equal to 45 mile per hour (mph), then row 2050 may be used to determine the recommended safe following distance. If the driver of the rear vehicle was traveling at greater than 45 mph, then row 2052 may be used to determine the recommended safe following distance. Column 2054 may determine a surface of the road., 345781=[0236] If at decision point 1001 in FIG. 10a, it is determined that alcohol was not consumed prior to the accident, then the alcohol factor may not be applicable as shown by step 1002. If alcohol was consumed prior to the accident, the next step, shown by decision point 1003, may be to determine if the alcohol usage contributed to the accident. If not, then the alcohol factor may not be applicable as shown by step 1004. If it is determined that alcohol usage did contribute to the accident, information of basic facts may be gathered as shown by step 1005. Basic information may include blood alcohol content, whether or not a sobriety test was given, and whether or not the accident involved a fatality. Optional information may also be gathered, as shown by step 1007, such as the type and amount of alcohol consumed, where the alcohol was served and by whom, and the weight of the user., 349908=[0240] If a motor vehicle accident occurred in a construction zone where a third party, other than the driver(s) or vehicle(s) involved in the accident may be involved, as determined at decision point 1101 in FIG. 11, then a talking point may be reached at step 1103. If the accident did not occur in a construction zone, then the factor may not be applicable in estimating liability, as shown by step 1105., 835400=[0878]FIG. 110 is graphical output of the CDR corresponding to the data depicted in FIG. 109. The abscissa labeled “Approximate Time Before Algorithm Enable (seconds)” corresponds to column 10901 in FIG. 109. Curve 11001 represents the pre-impact vehicle speed in miles per hour and corresponds to column 10903 in FIG. 109. Curve 11003 represents the engine speed in RPM/100 and corresponds to column 10905 in FIG. 109. Curve 11005 represents the throttle position and corresponds to column 10907 in FIG. 109. Curve 11007 represents the brake switch circuit status and corresponds to column 10909 in FIG. 109., 379908=[0280] The determination of the effective vehicle lengths 2405 is shown in FIG. 24b. Decision point 2433 may ask if the other party's lane change was a sudden lane change. If it was, then decision point 2435 may ask if the other party signaled the lane change. If the other party signaled, then the effective vehicle lengths may be the actual vehicle lengths minus one, as shown in step 2439. If the other party did not signal, then the effective vehicle lengths may be the actual vehicle lengths minus two, as shown by step 2440. If the answer to decision point 2433 is no, the decision point 2437 may ask if the other party signaled the lane change. If the other party did signal the lane change, then the effective vehicle lengths may be the actual vehicle lengths, as shown in step 2441. If the other party did not signal, then the effective vehicle lengths may be the actual vehicle lengths minus one, as shown by step 2442., 386747=[0289] If the other party did not have knowledge of the defect at decision point 2529, then decision point 2539 may ask how long the vehicle had been parked at the location of the accident. If the vehicle was there for less than or equal to one hour, then decision point 2553 asks if the vehicle had its flashers on. A penalty value may be determined by experienced claims adjusters in steps 2557 or 2559 for either a yes or no answer. If the vehicle was sitting in the travel lane for more than one hour, then decision point 2555 may ask if the vehicle had its flashers on. A penalty value may be determined by experienced claims adjusters in steps 2561 or 2563 for either a yes or no answer, respectively., 390982=[0295]FIG. 28 is a flow chart for estimating the effect of a factor that accounts for the contribution of road condition to a motor vehicle accident according to one embodiment. The road condition factor may be applied to the tortfeasor and/or other party for any accident type. As shown in FIG. 28, the road condition at decision point 2801 may be either dry or in some other condition. If the road condition is dry, then step 2803 may indicate that the factor may not be applicable. Other conditions may include, but are not limited to, a roadway that is wet, has snow and/or ice, is muddy, has plowed snow, has been salted, or has snow and/or ice patches. If other conditions apply to the roadway, then step 2805 may indicate that the factor may be a talking point., 366062=[0264] The next decision point 2009 may ask for the speed of the tortfeasor. The speed of the tortfeasor may be used to determine a recommended safe following distance the tortfeasor should have been traveling behind the other party in steps 2011 or 2013. For example, if the tortfeasor was traveling less than 45 mph, then the recommended safe following distance in vehicle lengths may be determined by: speed/10, as shown by step 2011. If the tortfeasor was traveling 45 mph or greater, the recommended safe following distance may be: 1.5*(speed/10), as shown by step 2013. From this determination, the decision point 2015 may ask whether the actual number of vehicle lengths was less than the recommended safe following distance. If the actual vehicle lengths were less than the recommended safe following distance, then the factor may be a talking point as shown by step 2017. If the actual vehicle lengths between the tortfeasor and other party were not less than the recommended safe following distance, then the following too closely factor may not be applicable, as shown by step 2019., 383147=[0284] If the effective vehicle lengths are greater than about 4, then no penalty value may be assessed to either party, as shown by steps 2407., 385179=[0288] If the vehicle was parked in a travel lane, then decision point 2515 may ask why it was there. If the vehicle ran out of gas, then decision point 2523 asks if the vehicle had its flashers on. A penalty value may be determined by experienced claims adjusters in steps 2525 and 2527 for either a yes or no answer. If the vehicle was abandoned or there was no apparent reason why the vehicle was in the travel lane, then decision point 2531 may ask if the vehicle had its flashers on. A penalty value may be determined by an experienced claims adjuster in steps 2533 and 2535 for either a yes or no answer. If the vehicle was in the travel lane due to a breakdown or accident, then decision point 2529 may ask if the other party had knowledge of the defect, which may have caused the breakdown or accident. If yes, then decision point 2537 asks how long the vehicle had been parked at the location of the accident. If the vehicle was there for less than or equal to one hour, then decision point 2541 asks if the vehicle had its flashers on. A penalty value may be determined by experienced claims adjusters in steps 2545 or 2547 for either a yes or no answer. If the vehicle was sitting in the travel lane for more than one hour, then decision point 2541 asks if the vehicle had its flashers on. A penalty value may be determined by experienced claims adjusters in steps 2549 or 2551 for either a yes or no answer., 376396=[0277] If the party is determined to be the other party at decision point 2301 in FIG. 23, then the factor may not be applicable, as shown by step 2303. For the tortfeasor, the next step is decision point 2305, which may ask whether the illness contributed to the accident. If not, then the factor may not be applicable as shown by step 2307. If illness of the tortfeasor contributed to the accident, then decision point 2309 may ask if the tortfeasor had a history of the illness. If not, then an ALV of 0% liability may be assessed to the tortfeasor. If the tortfeasor had a history of illness, then decision point 2311 may ask if the tortfeasor was medically cleared to drive. If the tortfeasor was not cleared to drive, then the illness factor may not be applicable as shown by step 2317. If the tortfeasor was cleared to drive without medication, then an ALV of 0% liability may be assessed to the tortfeasor, as shown by step 2315. If the tortfeasor was medically cleared to drive with medication, then decision point 2319 may be reached, which may ask if the required medication had been taken. If the required medication had been taken, then an ALV of 0% liability may be assessed to the tortfeasor, as shown by step 2321. If the required medication had not been taken, then 2323 indicates that a talking point may be reached., 384161=[0287] In FIG. 25, decision point 2501 and step 2503 indicate that the factor may not be applicable to accident types other than type 14. If the accident type is 14, then decision point 2505 may ask whether the vehicle was legally parked. If the vehicle was legally parked, then the factor may not be applicable, as shown by step 2507. If the vehicle was not legally parked, then decision point 2509 may ask if the vehicle was disabled. If the vehicle was not disabled and was not legally parked, then a penalty value may be estimated by an experienced claims adjuster, as shown by step 2513. If the vehicle was disabled and was not legally parked, then decision point 2511 may ask where the vehicle was parked. If the vehicle was outside a travel lane, then regardless of whether the vehicle had its flashers on, the factor may not be applicable, as shown by decision point 2517 and steps 2519 and 2521., 372331=[0272] In some embodiments, the method of determining the effect on liability of driving with headlights off may determine if both headlights were off or if only one headlight was off. If only one headlight was on, the method may determine if the one headlight would have provided adequate lighting for the driver of the vehicle to drive safely. If it is determined that the one headlight may not have provided adequate lighting, the method may proceed to step 2121 to determine a penalty value to assess. The method may also consider whether the one headlight would have made the vehicle visible to the driver of the other vehicle (e.g., was the one working headlight visible to the driver of the other vehicle). If it is determined that the one headlight may not have made the vehicle visible to the driver of the other vehicle, the method may proceed to step 2121 to determine a penalty value to assess., 375225=[0275] If the party is the other party, then decision point 2221 may ask if the tortfeasor was blinded. If not, then the factor may not be applicable, as shown by step 2223. If the tortfeasor was blinded, the factor may apply a “medium” penalty value, as shown in step 2227. In alternate embodiments, if the tortfeasor was blinded, then another decision point may be reached that may depend on the roadway configuration. If the roadway configuration was E, then a “medium” penalty value may be assessed. If the roadway configuration was A, B, or H, then a “low” penalty value may be assessed. If the roadway configuration was other than A, B, E, or H, than the factor may not be applicable., 351953=[0244] If at decision point 1301 shown in FIG. 13, the accident type was determined to be 1, 9, 10, 11, 12, 13, 14, or 15, then the traffic control factor may not be applicable to estimating liability, as shown by step 1303. For accident types 2, 3, 4, 5, 6, 7, 8, 16, and 17, a decision point shown by step 1305 may be reached to determine if an obscured, defective, or missing traffic control contributed to the accident. If an obscured, defective, or missing traffic control did not contribute to the accident, then the factor may not applicable for estimating liability, as shown in step 1309., 353683=[0247] As shown by decision point 1401 in FIG. 14, if the driver failed to maintain a proper lookout (e.g., not looking at the road ahead), then a “low” penalty value may be assessed against the driver, as shown in step 1405. If the driver maintained a proper lookout, the step 1403 may be reached. Step 1403 may determine if the driver was distracted prior to the accident (e.g., by a conversation, a cell phone, shaving, etc.). If the driver was distracted, then a “low” penalty value may be assessed to the driver at step 1406. If the driver was not distracted then, as step 1404 indicates, the factor may be not applicable for the driver., 350699=[0242] If it is determined at decision point 1201 in FIG. 12 that a driver involved in a motor vehicle accident did not require corrective lenses, then the factor may not be applicable as shown by step 1203. If corrective lenses were required, the next decision point 1205 may be to determine whether they were worn at the time of the accident. If the corrective lenses were worn at the time of the accident, the factor may not be applicable in estimating liability, as shown by step 1207. If required corrective lenses were not worn by the driver at the time of the accident, a talking point may be reached as shown by step 1209., 825719=[0864]FIG. 106 is a schematic illustration of a portion of a claim report generated on a daily basis. Report 10601 with the title “Claims Settled on Jan. 28, 2002” is a periodic report generated on a daily basis. The report includes claim information on claims settled on Jan. 28, 2002. Row 10603 identifies claim information included in the claim report. Rows 10605 include the claim information for the claims that were settled., 367255=[0265]FIG. 20b is a flow chart for estimating the effect of a factor that accounts for the contribution of following too closely to a motor vehicle accident according to a second embodiment. As shown by decision point 2025 in FIG. 20b, if the accident type was not type 1 or the tortfeasor was not behind or following the other party, then the factor may not be applicable as shown by step 2027. If the accident type was type 1 and the tortfeasor was following the other party, then the next step 2029 may be to determine if the actual following distance was less than a recommended safe following distance according to the table in FIG. 20c., 840462=[0886]FIG. 112 is an illustration of one embodiment of assessing a claim. Diagram 11200 represents a software application such as WrExpert, as described above. The steps enclosed by diagram 11200 may be performed by WrExpert. At step 11201 the pre-impact speeds of vehicles in the accident may be estimated. The impact forces may then be estimated at step 11203. At step 11205, the injuries to one or more vehicle occupants may be estimated from the impact forces. The method continues to step 11209 where damages due to injuries of the one or more vehicle occupants may be estimated. Step 11209 may be performed by a software program such as COLOSSUS. The liability of the parties in the accident may be estimated at step 11211. Finally, the adjusted damages due to injuries may be determined from the estimated damages due to injuries and the liability of the parties at step 11213., 382596=[0283] If the effective vehicle lengths are about 3 or about 4, then decision point 2413 may ask if the other party was slowing down. If the other party was either not slowing down or slightly slowing, then no penalty value may be assessed to either party, as shown by steps 2427 and 2429. If the other party was slowing down in an extreme manner at the time of the lane change, then a penalty value of 50% of liability may be assigned to the other party, as shown by steps 2431., 348005=[0238] An alternate method of determining an effect on liability of alcohol is depicted in FIG. 10b. At step 1051, the method may include determining if alcohol was consumed by a driver of a vehicle involved in the accident prior to the accident. If it is determined that no alcohol was consumed prior to the accident, the factor may not apply, as shown by step 1052. If alcohol was consumed by a driver of a vehicle involved in the accident, step 1053 may determine whether the driver was cited for impairment. In certain embodiments, prior to step 1053, the method may also include a step to determine if the alcohol consumption contributed to the accident. If it is determined that the driver was cited for impairment, step 1054 may be reached and an ALV may assign 100% of the liability to the driver cited for impairment. If the driver was not cited for impairment, decision point 1055 may determine if other indications of impairment were present. If no indications of impairment were present, a “high” penalty value may be assessed to the driver that had consumed alcohol, as depicted in step 1056. If indications of impairment were present, the method may determine the nature of the indications of impairment at step 1057. Indications of impairment based on blood alcohol content (step 1058), or statements or other evidence (step 1059) may result in a penalty value of 70% of the liability to the impaired driver., 369049=[0268] For non-gravel road surfaces, a condition of the road surface may be considered in column 2056. The condition of the road surface may include, but is not limited to, dry, wet, or muddy. In addition, the condition of the road surface may consider whether the road is covered with snow or ice, has patches of snow or ice, or has plowed snow or ice. In various embodiments, other road conditions may also be considered. For example, a road condition that may be prevalent in a particular region may be considered, such as having ruts. Once the road condition has been determined, a recommended safe following distance may be determined based on a percentage of the speed as specified in column 2058. It is envisioned that the specific percentage of speed specified by various combinations of speed, road surface, and road condition may be varied according to the preference of the insurance carrier, or regional or jurisdictional preferences., 830534=[0873]FIG. 108 illustrates a system for obtaining vehicle data for estimating the liability of a party in an accident. Arrows represent transfer of data between components of the system. Diagram 10801 illustrates a vehicle that has an airbag module installed that is configured to record vehicle data. An “airbag module” refers to a computer that controls airbag deployment. Since 1990, airbag modules configured to record vehicle data were installed in selected General Motors vehicles. An airbag module configured to record vehicle data may be referred to as a “Sensing and Diagnostic Module” (SDM). The SDM corresponds to the first computer system referred to in step 10701 in FIG. 107. The following data may be recorded by the SDM: brake status (5 seconds before impact), change in velocity vs. time for frontal airbag deployment event, engine speed (5 seconds before impact), maximum change in velocity for near-deployment event, throttle position (5 seconds before impact), time between near-deploy and deploy event (if within 5 seconds), time from vehicle impact to airbag deployment, time from vehicle impact to time of maximum change in velocity, and vehicle speed (5 seconds before impact)., 354754=[0249] As shown by decision point 1501 in FIG. 15, the duration of time the driver has been legally driving may be a determining factor. If the driver has been driving for two years or less, then the factor may be a talking point as shown by step 1503. If the driver has been driving for more than two years, then the driver inexperience factor may not be applicable as shown by step 1505. In some embodiments, decision point 1501 may be directed to how long a driver has been legally driving a particular class of vehicle that was involved in the accident. For example, if the driver was driving a motorcycle at the time of the accident, decision point 1501 may determine how long the driver has been legally driving motorcycles., 365259=[0263] As shown by decision point 2001 in FIG. 20a, if the accident type was not type 1 or the tortfeasor was not behind or following the other party, then the factor may not be applicable as shown by step 2003. If the accident type was type 1 and the tortfeasor was following the other party, then the next step 2005 may be to gather information regarding the accident. The information may include the number of vehicle lengths between the other party and the tortfeasor before the accident, and the speed that the tortfeasor was traveling. Additionally, as shown by step 2007, information may be gathered from any witnesses who may verify the number of vehicle lengths that were between the other party and the tortfeasor., 362446=[0261] In some embodiments, if the vehicle was new, then step 1913 may be a talking point. Alternately, in some embodiments, step 1913 may indicate that the faulty equipment may be attributed to a third party. The third party may include the person or entity from which the vehicle was purchased or serviced. If the vehicle was not considered new by steps 1909 or 1911, the next step may be decision point 1915 that may ask whether the defective part was serviced within the last month. If service was performed on the defective part within the last month, a talking point may be reached, as shown by step 1917. In some embodiments, step 1917 may be an ALV of 0% for the driver of the vehicle with the defective part. In some embodiments, at least a portion of the liability for the accident may be attributed to a third party at step 1917. For example, the third party may be an individual or entity that last serviced the defective part. The third party may also include the manufacturer of the defective part. If the defective part was not serviced within the last month, decision point 1919 may ask if there was any indication or history of the problem. Whether or not there was an indication or history of the problem, the faulty equipment factor may reach a talking point as shown by steps 1921 and 1923. Steps 1921 and 1923 may be indicated differently in an assessment report as discussed with reference to FIG. 55. In alternate embodiments, if there was no indication or history of the problem at step 1919, another decision point may be reached. The decision point may be to determine whether or not unwanted acceleration occurred. If not, then a talking point may be reached and noted in the assessment report. However, if an unwanted acceleration did occur, the driver of the affected vehicle may be assessed an ALV of 0% liability. Additionally, a portion of the liability may be assessed to a third party. For example, the third party may include a manufacturer or seller of the vehicle or the defective part., 381800=[0282] If the effective vehicle lengths are about 1 or about 2, then decision point 2411 again may ask if the tortfeasor was slowing down. If the tortfeasor was not slowing down, then a penalty value of 75% of liability may be assessed to the other party, as shown by step 2422. Alternately, in an embodiment, if the tortfeasor was not slowing down, then the liability may be determined by an experienced claims adjuster. If the tortfeasor was slowing down in either a slight or an extreme manner, then a penalty value of 100% of liability may be assessed to the other party at step 2423 or 2425. In some embodiments, an ALV of 100% liability may be assessed at steps 2423 and 2425 rather than a penalty value., 356184=[0251] Decision point 1601 in FIG. 16 may determine if an illicit drug was consumed prior to the accident. If no illicit drug was taken before the accident, the illicit drug factor may be not applicable, as shown in step 1603. If an illicit drug was taken prior to the accident, a “low” penalty value may be assessed to the party that took the illicit drug, as shown in step 1605., 378989=[0279] In FIG. 24a, decision point 2401 may ask whether the accident type was type 1, and whether the other party and right of way have been determined. If any of these conditions is not true, the factor may not be applicable, as shown in step 2403. If the accident type is 1, and the other party and right of way have been determined, then the next step 2404 may ask if the other party changed lanes prior to the accident. If the other party did not change lanes, then step 2406 indicates that the factor may not be applicable. If the other party changed lanes before the accident, the next step 2405 may be to determine effective vehicle lengths between the other party and the tortfeasor. The term “effective vehicle lengths,” as used herein, generally refers to the actual vehicle lengths between the parties minus an adjustment., 346767=[0237] If the accident involved a fatality, as determined at decision point 1009 shown in FIG. 10a, “warrants further discussion” may be added to the accident report, as shown in step 1011. However, whether or not there was a fatality involved in the accident, the next decision point 1013 may be to determine if the user was cited for impairment. If the user was cited for impairment, a talking point may be reached, as shown by step 1015. If the user was not cited for impairment, the next decision point 1017 may be to determine if there was any indication of impairment. If there was no indication of impairment, the alcohol factor may not be applicable as shown by step 1019. If there was any indication of impairment, the next step may be to determine what the indication was based on at decision point 1021. A blood alcohol content may indicate a level of impairment. Statements or other evidence may also provide some indication of impairment, which would be described as shown by step 1023. After it is determined what the indication of impairment was based on, a talking point may be reached as shown by step 1025., 370439=[0270] In FIG. 21, decision point 2101 asks for the accident type. For accident types 1, and 14, the factor may not be applicable as shown by step 2105. Additionally, in some embodiments, the factor may not apply for accident types 15 and 17. For the remaining accident types, the next step may be decision point 2103 in which visibility at the time of the accident may be determined. The visibility factor is illustrated in FIG. 35. If visibility was good, then the driving with headlights off factor may not be applicable as shown by step 2109. Otherwise, if visibility was poor, decision point 2111 may determine if the party was driving with the vehicle's headlights on. If it is determined that the party had the headlights on, then the factor may not be applicable, as shown by step 2119. If the vehicle's headlights were off at the time of the accident, then decision point 2121 may be reached. Decision point 2121 asks whether the location of the accident was relatively dark, for example, without streetlights at the time. If it was dark without streetlights, the party may have a “high” penalty value assessed, as shown by step 2123. If it was not dark and/or streetlights were on, then the other party may have a “medium” penalty value assessed, as shown by step 2125., 352622=[0245] If it is determined that an obscured, defective, or missing traffic control contributed to the accident, then decision point 1307 may be reached to determine if a driver was familiar with the accident location. If the answer is yes, then a talking point may be reached as shown by step 1311. If the answer is no, the next decision point 1313 may be whether or not the intersection appeared to be an uncontrolled intersection. If not, a “medium” penalty value may be assessed to the party in question, as shown in step 1317. If the intersection appeared to be a controlled intersection, an ALV of 10% may be assessed to the party in question., 361955=[0260] If the vehicle was one year old or greater, then the vehicle may not be considered new. If the vehicle was less than one year old, then the next decision point 1911 may ask the mileage on the vehicle. If the vehicle mileage was less than 10,000 miles at the time of the accident, the vehicle may be considered new. If the vehicle mileage was 10,000 miles or greater at the time of the accident, the vehicle may not be considered new., 359560=[0257] At decision point 1801 in FIG. 18, the number of hours the party had been driving may be determined. If the driver had been driving for more then 6 hours, then the factor may be a talking point as shown by step 1803. If the driver had been driving for 6 hours or less, then decision point 1805 asks how long the driver had been awake, but not driving. If the driver was awake but not driving for more than 12 hours, then the factor may be a talking point as shown by step 1807. If the driver was awake for 12 hours or less prior to driving, then the number of hours the driver last slept may be determined at decision point 1809. If the driver slept less than 6 hours, the factor may be a talking point, as shown by step 1811. If the driver slept 6 hours or more, then the fatigue factor may not be applicable, as shown by step 1813., 361222=[0259] Decision point 1901 may ask whether defective equipment contributed to the accident, as depicted in FIG. 19. If defective equipment did not contribute to the accident, then the faulty equipment factor may not be applicable, as shown in step 1903. If defective equipment contributed to the accident, the next step may be decision point 1905, which may determine the party that faulty equipment affected. If the faulty equipment affected the other party, as shown in step 1907, then a talking point may be reached. If the faulty equipment affected the tortfeasor, the next step may be decision point 1909, which may determine the age of the vehicle., 388475=[0292] As shown in FIG. 26, if it is determined at decision point 2601 that the accident type is 1, 14, or 15, then the factor may not be applicable, as shown in step 2603. For all other accident types, decision point 2605 may ask if a party signaled improperly. If the answer to decision point 2605 is no, then the factor may not be applicable, as shown by step 2609. If the answer is yes, then a “low” penalty value may be assessed against the party that signaled improperly, as shown in step 2607. In some embodiments, an additional decision point may follow decision point 2605 if a party did signal improperly. The additional decision point may determine which party signaled improperly. In such embodiments, if it is the other party that improperly signaled then a low penalty value may be assessed against the other party. If the tortfeasor improperly signaled, then a talking point may be reached., 841453=[0887] In a variation of the method illustrated in FIG. 112, the pre-impact speed of one or more of the vehicles in the accident may be determined from recorded crash data from an SDM on one or more of the vehicles. The impact forces may then be estimated at step 11203 from the recorded pre-impact speeds of one or more of the vehicles. The method may continue as described above. The results of the variation may be compared to the results from the method described above that used pre-impact speed estimated from crush damage., 380951=[0281] Turning again to FIG. 24a, if the effective vehicle lengths are less than 1, then decision point 2409 may ask if the tortfeasor was slowing down when the lane change took place. If the tortfeasor was not slowing down, then a penalty value of 75% of liability may be assessed to the other party, as shown by step 2418. Alternately, in an embodiment, if the tortfeasor was not slowing down, then the liability may be determined by an experienced claims adjuster. If the tortfeasor was slowing down in either a slight or an extreme manner, then a penalty value of 100% of liability may be assessed to the other party at step 2417 or 2419. In some embodiments, an ALV of 100% liability may be assessed at steps 2417 and 2419 rather than a penalty value., 709407=[0747] In accident type 4 or 5, as shown in FIG. 4, the collision lane for the turning car, vehicle B, is the same as the lane that it is targeting. Consequently, neither vehicle A nor vehicle B may clear the collision area. The time to clear may then be set to a relatively high value, for example, 1000 seconds., 836116=[0879]FIG. 111 is graphical output from the CDR for the post-accident decrease in velocity versus time. Curve 11100 shows that the velocity of the vehicle decreases by almost 30 miles per hour in the first 150 milliseconds after the crash., 358204=[0255] If the medication affected the ability to drive, it may then be determined if the party was aware of this effect, as shown by decision point 1709. If the party was aware of the effect of the medication on the ability to drive, then a “low” penalty value may be assessed for the medication factor, as shown by step 1711. If the party was not aware of the effect of the medication on the ability to drive, then decision point 1713 may ask if the medication had appropriate warnings and labels. If there were not proper warnings or labels on the medication, then the factor may be a talking point as shown by step 1715. In some embodiments, if there were not proper warnings or labels on the medication, step 1715 may indicate that a portion of the liability may be attributed to a third-party (e.g., the medication vendor, or manufacturer). If the medication was properly labeled, then a “low” penalty value may be assessed to the party as shown by step 1717., 389945=[0294] In FIG. 27, decision point 2701 may ask if a driver's view of another vehicle or a traffic control was obscured. Step 2703 indicates that if the answer is no, then the factor may not be applicable. In some embodiments, if the answer to decision point 2701 is yes, then another decision point may ask if the obstructed view or glare contributed to the accident. If not, then the factor may not be applicable. If it is determined that the obstructed view or glare contributed to the accident, the decision point may lead to decision point 2707. Decision point 2707 may ask whether it was a glare obscured the driver's view. If it was a glare, then the factor may be a talking point, as shown by step 2711. In some embodiment, if the answer to decision point 2707 is no, then there may be a request to provide a description of the obstruction for use in an assessment report. In step 2715, the obstructed view may be a talking point., 357715=[0254] At decision point 1701 in FIG. 17, it is determined whether a medication was taken prior to the accident. If not, as shown by step 1703, then the medication factor may not be applicable. If a medication was taken prior to the accident, then the next decision point 1705 may determine if the medication had an affect on the ability to drive. If not, then the factor may not be applicable, as shown by step 1707.}",
    "textBeforeTable": "Patent Citations [0888] Further modifications and alternative embodiments of various aspects of the invention may be apparent to those skilled in the art in view of this description. Accordingly, this description is to be construed as illustrative only and is for the purpose of teaching those skilled in the art the general manner of carrying out the invention. It is to be understood that the forms of the invention shown and described herein are to be taken as the presently preferred embodiments. Elements and materials may be substituted for those illustrated and described herein, parts and processes may be reversed, and certain features of the invention may be utilized independently, all as would be apparent to one skilled in the art after having the benefit of this description of the invention. Changes may be made in the elements described herein without departing from the spirit and scope of the invention as described in the following claims. [0887] In a variation of the method illustrated in FIG. 112, the pre-impact speed of one or more of the vehicles in the accident may be determined from recorded crash data from an SDM on one or more of the vehicles. The impact forces may then be estimated at step 11203 from the recorded pre-impact speeds of one or more of the vehicles. The method may continue as described above. The results of the variation may be",
    "textAfterTable": "US4931793 * Jul 1, 1988 Jun 5, 1990 Solitron Devices, Inc. System for providing a warning when vehicles approach a common collision point US5099422 * Mar 17, 1989 Mar 24, 1992 Datavision Technologies Corporation (Formerly Excnet Corporation) Compiling system and method of producing individually customized recording media US5172281 * Dec 17, 1990 Dec 15, 1992 Ardis Patrick M Video transcript retriever US5180309 * Dec 4, 1990 Jan 19, 1993 United States Of America As Represented By The Secretary Of The Navy Automated answer evaluation and scoring system and method US5191522 * Jan 18, 1990 Mar 2, 1993 Itt Corporation Integrated group insurance information processing and reporting system based upon an enterprise-wide data structure US5201044 * Apr 16, 1990 Apr 6, 1993 International Business Machines Corporation Data processing method for file status recovery includes providing a log file of atomic transactions that may span both volatile and non volatile",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}