{
    "relation": [
        [
            "Click on Image to Enlarge",
            "Mini Scarecrow Globe",
            "$11.95",
            "Mini Glitter Globe of the Scarecrow. Size is approximately 2 1/2\" High Non-Musical \u0099 & © Turner Entertainment Co.",
            "Item # 17223W",
            ""
        ],
        [
            "Click on Image to Enlarge",
            "Mini Wicked Witch Globe",
            "$11.95",
            "Mini Glitter Globe of the Wicked Witch. Size is approximately 2 1/2\" High Non-Musical \u0099 & © Turner Entertainment Co.",
            "Item #17225W",
            "Retired"
        ]
    ],
    "pageTitle": "Wizard Of Oz Music Boxes and Figurines, Wicked Witch Musicals and Figurines, Dorothy, Ruby Slipper Music Box, Oz Jewelry Box",
    "title": "",
    "url": "http://www.themusicboxcompany.com/wizard_of_oz.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00057-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 739329695,
    "recordOffset": 739306563,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17678=Limited to 2014 year of production in honor of the films 75th Anniversary, Glinda makes a very special appearance in Couture de Force; a fashion fantasy incorporating Glinda's iconic imagery into a highly detailed and beautiful sculpture. Exquisitely beautiful figurine!, 16899=Introduction: January 2014 Material: Stone Resin Size is: 7.75in H x 4in W x 4.5in L Non-Musical, 17121=The Wicked Witch of the West from The Wizard of Oz joins the Couture de Force collection, a fashion show fantasy incorporating the films famous icons like the magical poppies, winged monkeys and crystal balls in her gown & broom. This is one of the most beautiful wicked Witch of the West figurines you will ever see. Introduction: January 2014 Material: Stone Resin Size is: 8.5in H x 3in W x 5.75in L Non-Musical, 17956=Introduction: January 2014 Material: Stone Resin Size is: 9.25in H x 5.5in W x 7.25in L Non-Musical}",
    "lastModified": "Tue, 30 Jun 2015 06:21:45 GMT",
    "textBeforeTable": "Item # 17107W Item #17108W R \u0099 & © Turner Entertainment Co. Non-Musical Size is approximately 2 1/2\" High Mini Glitter Globe of the Tin Man. Mini Glitter Globe of the Lion. Size is approximately 2 1/2\" High Non-Musical \u0099 & © Turner Entertainment Co. R $11.95 $11.95 Mini Tin Man Globe Mini Lion Globe Click on Image to Enlarge Click on Image to Enlarge",
    "textAfterTable": "Lenox Classics Wizard of Oz These beautiful Lenox Figurines are hand crafted porcelain. Each one is hand painted and adorned in 24 Karat Gold. Click on Image to Enlarge Click on Image to Enlarge Dorothy Scarecrow $138.00 $138.00 Done in Lenox ivory fine china, beautiful Dorothy walks along the yellow brick road with the basket over her arm and Toto by her side. Dorothy's face is soft and sweet looking, Crafted of hand-painted Lenox ivory fine china Accented with 24 karat gold Bears the Lenox hallmark Certificate of Authenticity Height: 8 1/4\" Introduced 2002 \u0099",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}