{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "It's easy to get into clubs here the school is big on sports and getting students involved in activities. Also the school is big on politics and advertising so they have plenty of activities to get you involved in these including the presidential debates which will be held here during the 2012 year.",
            "Athletic students and student who really want to customize what they do. Like I mentioned earlier you can really make your education and social life here into anything you want it to be. Also political students will like it here this school has a lot of activities in politics.",
            "This is probably the biggest down part of the school. Its pricey but they help out if you have the grades. But its small class sizes and good teachers so it about equals out.",
            "The school is big into sports so it's a easy to be active there. Also it is close to a beach and New York City. Also the school makes using the subway a big part of going there so you can find something to do if you have a car or willing to use public transportation.",
            "The food options are very diverse on campus and there is a very nice coffee shop that the school runs. Also the school is about thirty minutes from New York City and twenty minutes from the beach so you can find any food you want around the area.",
            "The dorms are huge. What is one room at most colleges is your room, a lounge, a bathroom, and like two other rooms. Also in each building is a large lounge area with couches TVs and multiple games to play.",
            "This school is very customizable. You can just take basic classes that will be as challenging as normal college classes. You can join customized seminars and clusters that specialize in whatever field you plan on going into. Also there are honors colleges which are specialized classes that you must be invited to and are very challenging. Like I said you can really customize your education here.",
            "When you come to visit don't be afraid to ask the other students what they think I only met one person with some complaints and the rest were all happy to be there and enjoyed the school.",
            "The campus is absolutely beautiful to say the least. I visited for three days and in those three days the campus looked amazing no matter what the weather, the people were friendly, and the tours were very helpful. I can only imagine how amazing it is going to be to attend this college."
        ]
    ],
    "pageTitle": "Hofstra University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Hofstra-University/reviews?_escaped_fragment_=/show/63372",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00232-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893166791,
    "recordOffset": 893080777,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{273931=Campus is very safe because Public Safety is always around patrolling and there are emergency phones connecting directly to Public Safety everywhere you look. It has to be a safe campus for the President of the United States to come and debate the Governor of Massachusetts in October 2012., 283445=Join a club sport great way to meet people. Stay on budget with your meal plan, you don't want to be part of team hunger games in November. DO NOT CHOOSE A RANDOM ROOMMATE., 146194=Food is amazing. Meal plans are well planned out. They give you the best options and variety for food. CPK which is short for California Pizza Kitchen is usually open until 2:30 am. If you have midnight munchies, its the best place to go., 232662=Hofstra University is a wonderful school for many reasons including the academics, campus life and it's proximity to New York City. The thing that caught my interest is the school's student to professor ratio which is about 14:1. Expect to have a healthy relationship with your professor which will help you be more successful., 171476=New York City is a short train ride away, so many students take advantage of that. Roosevelt Field Mall is minutes away, and is the second-largest shopping mall in the state of NY. For those who like bars and clubs, there are a few bars across the turnpike that offer dancing and trivia nights for the 19+ crowd. Hofstra organizations are always holding events on campus, like the Vibe Live Music Fest in fall or Music Fest in May., 109156=It's easy to get into clubs here the school is big on sports and getting students involved in activities. Also the school is big on politics and advertising so they have plenty of activities to get you involved in these including the presidential debates which will be held here during the 2012 year., 74119=public saftey is on campus at all times. there are call boxes all around the campus. i have gone running at 9:00 p.m., and felt very safe in doing so., 418464=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/17/2009 Reviewer is A current student here. 33 out of 43 people found this review useful. 3 people found this inaccurate. 1 of 95 Christopher from Duxbury, MA Check out reviews left by other students or leave your own review. You could win a free scholarship. Hofstra University Reviews Hofstra University › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck As a private university, Hofstra's tuition is a bit on the steep side. Scholarships and other financial aid are definitely necessary for those students who do not come from wealthy families, but you can always appeal for more money if they haven't given you a sufficient amount. Overall, considering that many of the professors have the top degrees in their field, and could very well be teaching at Harvard or some other Ivy League, Hofstra students are getting similar educations for a little bit cheaper. Am enjoying being here The past semester has been rough on the University as a whole, but for the most part, Hofstra is a good place. While the school isn't located in the best area, its proximity to New York City (about an hour on the Long Island Rail Road), as well as the nearby malls and movie theaters gives students something to do if they don't want to be stuck on campus. There is almost always a party or some event going on at Hofstra USA for students who prefer to stay on campus, as well as the weekly (free) movies for the first 10 weeks of any semester. Am learning a lot Some of the professors have a tendency",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}