{
    "relation": [
        [
            "Count",
            "2",
            "2",
            "1",
            "1"
        ],
        [
            "Fee",
            "$ 100",
            "$ 150",
            "$ 250.00",
            "$ unsure"
        ]
    ],
    "pageTitle": "Pittsburgh Perl Workshop 2013 Survey Results - YAPC Conference Surveys",
    "title": "",
    "url": "http://yapc-surveys.org/html/ppw2013-survey.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00238-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 843543801,
    "recordOffset": 843535599,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{23295=Regarding Pittsburgh Perl Workshop 2013 specifically, please answer the following as best you can., 39276=Site hosted by Birmingham Perl Mongers. Data copyright 2006-2012 The Perl Foundation}",
    "lastModified": "Sun, 12 Jul 2015 16:38:55 GMT",
    "textBeforeTable": "Attendees: These questions will help us understand who our attendees are. Demographics (required) Click on pie charts to view larger image version. The following survey results are a simple presentation of the raw data. No attempt has been made to analyse the data and compare with previous years. See forthcoming PDFs for more in depth analysis. Pittsburgh Perl Workshop 2013 - Survey Results Return to Surveys Listings Conference Attendance Pittsburgh Perl Workshop 2013 The Perl Community, YAPCs & Workshops Demographics (required) Contents: Pittsburgh Perl Workshop 2013 Survey Results YAPC Conference Surveys",
    "textAfterTable": "Age Band: Count Description 0 under 20 5 20 - 29 9 30 - 39 3 40 - 49 2 50 - 59 0 60 and over Job Type: If your position covers many roles, please base this on your most senior responsibility. Also base this on the role you perform, rather than your job title. For example, a 'QA Developer' would be a 'Developer' role, and 'Information Manager' would a Manager role (Technical or Non-Technical depending upon your responsibilites) Count Description 1 CEO/Company Director/Senior Manager 0 Non-Technical Manager 1 Technical Manager 4 Technical Architect/Analyst 7 Developer 1 Engineer 2 SysAdmin 1 Student 0 Lecturer/Teacher/Trainer 0 Human Resources 1 Researcher 0 Unemployed 1 Other",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}