{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "Appalachian is great for people who love snow and cold weather. Boone gets a lot of snow every winter and being cold becomes the norm. Appalachian is also for people who love the mountains and love football, however if you don't like football, who doesn't like tailgating.",
            "Go in open minded. Don't start drinking unless you can handle the consequences that come with it. Stay on top of your studies and get involved in class. Get involved in something that is outside of your comfort zone because you become an even more rounded student than you thought you were.",
            "You pay half as much at Appalachian than you do at any other university in the state and you get the exact same quality education with a better view.",
            "I love Appalachian State. It is in the mountains and no matter what dorm you are in, what apartment complex you are at, there is always a beautiful scene of the mountains. There are so many things to do around campus from getting involved with Greek or going to a football game to joining the amazing Gospel Choir, the experience is life changing and absolutely wonderful. You meet very a variety of people who become like your family.",
            "I love Appalachian and the learning environment that it gives me. While there are some big classes in the general education department, they are still very informative and challenging for me as a person. In my major classes they are smaller but that are also very informative and a great learning experience. For me the learning experience is very open, you can take part in it or opt out. Its not forced but if you take part in it, it will make you stronger as an individual. Outside of class you meet a variety of people that teach you about different lifestyles that are different from yours. The learning environment is all around and it is a great opportunity to be apart of it."
        ]
    ],
    "pageTitle": "Appalachian State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Appalachian-State-University/reviews?_escaped_fragment_=/show/24947",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00272-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891878259,
    "recordOffset": 891757808,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{286062=The gazebo by the pond by a dining hall on the west side of campus is great for laying in a hammock or hanging out with friends. Students body paint at games in November. Tailgating is a big thing that happens before home football games. Homecoming events-Lip Sync(dancing and lip syncing to songs), Float Building party and parade, Kazoo band, banner contest, and blood drive., 154468=Tips: -Bring lots of warm clothing -Apply for financial aid as soon as you can -If you decide to stay off campus find a place no later than the end of July because it will be very hard to find a place to live -If you have any questions do not be afraid to ask, 141652=Blue lights. They also have safe ride between 6 pm to 2:30 am. free campus taxi. If you are hurt or sick or in danger campus police will escort you., 67384=Boone is a great college town. Whether it's a beautiful day in the spring or a cold day in December, there is always something to do. Head out to Sanford Mall and play ultimate frisbee when it's warm. Travel to the nearby ski resorts and go skiing and snowboarding when it's snowy! There are plenty of places to have fun with friends., 438082=Appalachian State is a fantastic school but it is at a higher elevation and because of this there is a decent amount of winter weather. Make sure that you are comfortable with the cold, as the winter really starts around middle of November and persists through March. Come up to App with an open mind, and willingness to explore new subjects of study! Appalachian has a rather complicated general education program that really forces your to explore a lot of different topics of study. Be willing to try out new or previously uninteresting subjects! Some of the best classes here are the ones that sound really strange on paper., 85696=There's something about Appalachian and Boone that makes you feel right at home, no matter where you're from. It is a gorgeous place to go to school; you have great leaves to take pictures of during fall, snow in winter, and moderate/comfortable temperatures from April to September for the most part. Football games are great ways to enjoy being a part of an active student body, for everyone is donned in black and gold, screaming at the top of your lungs for the Mountaineers. There are many clubs and organizations you can be involved with; and if it's not here, you can form a club catering to your interests following the set club-forming guidelines. There's always something to do on campus and most of it's free, which is nice; if you have a big test coming up, there are plenty of peaceful places to study on campus., 641276=© 2015, Cappex.com, LLC, 313718=Polar Plunge is held toward the end of January every year, people jump into Duck Pond with costumes on. Every summer, The Appalachian Summer Festival is held. This year, Bill Cosby is going to be here!, 31664=Prospective students should apply to Appalachian with the greatest of their credentials. It is no easy school to be accepted into, nor is it as competitive as Chapel Hill. Any activities and extracurriculars one might have been committed to are great advantages to your application. And remember, bring your snow gear because we see flakes from October to April. With a diverse community, diverse climate, and wonderful classrooms, I guarantee you'll enjoy what Boone, NC has to offer you from Appalachian State University., 207041=At Appalachian State University students are welcome to Fraternity and Sorority Life. There are over 1400 members of the 26 Fraternities and Sororities present on campus. Not only do they serve as a resource for the current Fraternity and Sorority community, but offers a clearinghouse of information for perspective students, parents and alumni., 584688=I would rate Appalachian State University a 8 out of 10. I toured the campus and I received a better understanding of the school that I will be attending. The tour mentors, the staff, and the students who attend the school were very helpful in teaching me about furthering my educational career path in the Fall of 2014.}",
    "textBeforeTable": "07/19/2009 Reviewer is A current student here. 46 out of 48 people found this review useful. 1 of 139 Lauren from Myrtle Beach , SC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Login to rate or flag the reviews Kristen from NC 07/15/2009 Reviewer is A current student here. 20 out of 24 people found this review useful. 2 of 139 Categories Comments Great for these types of students Anyone! Especially those that love the mountains or just want a great college experience! Tips for prospective students Apply for early registration and you have a better chance of getting in! With the amount of people applying growing every year, it's important to get your application in early, as well as any scholarships or financial aid through the university. Am enjoying being here I absolutely love being at App State! The campus is so beautiful, and there are so many things to do. You can go to the Student Union and hang out in the coffee shop, or if it is an exceptionally pretty day, it's great just sitting outside enjoying the amazing Boone weather. At night, you can usually catch a movie for just a dollar or even",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}