{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "rage",
            "Japanese News",
            "NBC Today",
            "Good Morning America",
            "Home Shopping"
        ],
        [
            "Time",
            "5 am - 6 am",
            "5:40 am - 6:15 am",
            "4 am - 6 am",
            "4:30 am - 6 am",
            "5:30 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2012/10/27/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00305-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 701952487,
    "recordOffset": 701881824,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{30873=PHILLIP COOREY The opposition frontbencher Bronwyn Bishop has revealed that Tony Abbott would have called another election had he succeeded in negotiating with the independents in 2010 to form minority government.}",
    "TableContextTimeStampAfterTable": "{121101=October 26 - 28 Searching for something to do this weekend? r., 100737=Entries now open! Event on Sunday, November 11., 122026=Until November 3: Some of the most memorable moments in opera can be seen in this classic tragedy., 250170=alpha, Oct 27, 2012, 12:23AM, 240318=Total votes: 12616., 249118=alpha, Oct 27, 2012, 1:04AM, 124886=November 17 Angus Stone is taking his new tunes to a live arena, set to hit Perth this November., 123993=November 14: Ben Folds Five will be stopping off in Perth in one of just two sideshows in November., 243157=1197 views, 123066=November 1 - 7: It's seven shows in seven days for these rock stalwarts., 262268=October 26 2012, 229474=Reclaim the night to bring 1000 out in force}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: A lot of time is spent in bed during the course of tonight's double episode. Boardwalk Empire What's on TV Tonight 4 Frank Gibson reveals his favourite flicks over half a century Projectionist leaves reel life A life in film 2 Ten of Brisbane's best swimming pools for all ages. Cool pools for hot days Summer solutions 1 Aquitaine Brasserie interprets old standards well. Faultless French fare Dining Stars of TV,",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD rage 5 am - 6 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane NBC Today 4 am - 6 am Channel Nine Brisbane Good Morning America 4:30 am - 6 am Network TEN Brisbane Home Shopping 5 am - 5:30 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD rage 5 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane NBC Today 4 am - 6 am Channel Nine Brisbane Good Morning America 4:30 am - 6 am",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}