{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Go to the Beach",
            "The food is horrible",
            "The dorms aren't bad at all",
            "The professors work with you",
            "Don't come if you love football games, No team!",
            "It's a good school, Not a big campus. But great if you love a close knit community"
        ]
    ],
    "pageTitle": "The University of West Florida (UWF) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-University-of-West-Florida/reviews?_escaped_fragment_=/show/15562",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00049-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899650743,
    "recordOffset": 899552998,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{289619=The University sends alerts called Argo Alerts to your email, or in a text if you sign up, when there is any kind of danger or important news about the weather, parking, or threats. All buildings are locked after 10:00 pm., 319869=The Edward Ball nature trail is said to be haunted and recently some supposed human bones were found on it. How recent? Try October 4th, 2012...., 108637=There are so many clubs and student groups. Off campus, just five minutes away is the beautiful Escambia Bay. May different malls, shopping opportunities, and food choices. just a few minutes away are historical sites open for the public!, 552861=© 2015, Cappex.com, LLC, 180537=The University of West Florida is a wonderful, beautiful campus! Just under 15,000 students, including the new 2012 freshman class and the classes are still relatively small., 143814=The classes I'm taking are pretty engaging if I do say so myself! One particular class I'd like to point out is music experience: film music which we learn how to listen to music in famous movies! I have never fallen asleep in that class and that's saying something when the class is at 8:30 in the morning., 234082=The Nautilus Market (University of West Florida Cafeteria), is a buffet and you pay just one time to enter and then you can eat as much as you want. The food is not too good. The veggie burgers and fries are the best thing about the Nautilus Market, fries sometime have Cajun seasoning, which is to die for., 477450=I say four stars because the actual classes are cheap! The books are decent, but if you live on campus you are required to have a meal plan which is a waste of about $2000., 189190=We have the most beautiful beach in the world!! Only about 20 minutes away, there is kayaking, paddle boarding, jet skiing, and lots of great food! We also have the Blue Angels show at the beach every July which is a BLAST! We also have a historic and quaint downtown with shopping and night life. We have a decent mall and also the Navy museum is very interesting., 61511=The Pensacola fair comes around every October and is a great experience for people of all ages. There is also a haunted tour every October. During a majority of the year, the beach is always a great place to go, full of exciting places to eat and go out. Sam's Fun City is located close to the campus, where students can go to play laser tag or race go-carts. There are theaters, museums, skating rinks, and plenty of shopping areas nearby., 382072=It's college, what can I say? I've spent about 1200 on a semester of full-time hours. I don't know how that compares to other schools. Students do get into EVERY sporting/performance for free with their Nautilus Card.}",
    "textBeforeTable": "07/08/2009 Reviewer is A current student here. 42 out of 45 people found this review useful. 1 of 140 Lauren from Pensacola, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Tips for prospective students -Go to class, a lot of people I know like to skip and ask me why they failed at the end of the semester. -Pay attention, just sitting in class won't make you learn, you have to LISTEN to what the professor says -Get involved on campus, whether it be by going Greek, working with CAB, or helping some other way. Bang for the buck UWF is the CHEAPEST university in Florida. Am enjoying being here I love it at UWF!! I love the small population, and knowing most everybody who I walk by. And the fact that we're on a nature preserve is amazing itself. Am learning a lot Everyday I go into a classroom I learn something that I can use almost everyday. Login to rate or flag the reviews Rachel from Babson Park, FL 12/20/2009 Reviewer is A current student here. 17 out of 19 people found this review useful. 3 of 140",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}