{
    "relation": [
        [
            "Value",
            "1",
            "2",
            "."
        ],
        [
            "Label",
            "*D17 EQUALS 1 AND *D18 EQUALS 4 AND *D19 EQUAL 4",
            "ALL OTHERS",
            "Missing"
        ],
        [
            "Frequency",
            "12",
            "969",
            "3668"
        ],
        [
            "Valid Percent",
            "01.22%",
            "98.78%",
            "-"
        ],
        [
            "Total Percent",
            "00.26%",
            "20.84%",
            "78.90%"
        ]
    ],
    "pageTitle": "all",
    "title": "",
    "url": "http://www.icpsr.umich.edu/icpsrweb/CPES/files/nlaas/sections/BLDEPRESS/variables/all",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00172-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 499315175,
    "recordOffset": 499263009,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "View Universe 4 If SC22a.1 = 'Yes' life no meaning (see V00795) 3 IF *SC23 = 'YES' LOSS OF INTEREST (see V00794) 2 IF *SC22 OR *SC22a = 'YES' DISCOURAGED (see V00777) 1 IF *SC21 OR *SC21a = 'YES' SAD, EMPTY, OR DEPRESSED D0. INTERVIEWER CHECKPOINT (SEE *SC21, *SC21a, *SC22, *SC22a, *SC23) Chinese Tagalog Vietnamese Spanish English Total Variable Label: INTERVIEWER CHECKPOINT NLAAS D0 CPES V00827 This variable has been removed from the dataset. This variable may be available in the restricted file. For information on obtaining restricted data, please contact help@icpsr.umich.edu. If you'd like more information about the variable, you can view the summary statistics and/or frequencies. View Universe 2 EXPR IS TRUE 1 EXPR IS FALSE ProgFlow = 1",
    "textAfterTable": "4 IF SC22A.1 = YES LIFE NO MEANING 18 00.78% 00.39% . Missing 2330 - 50.12% Disclaimer: Frequencies displayed above are not weighted. Missing Data Codes: . (Missing) Total Cases: 4649 You can also view this variable in SDA . CPES V00829 NCSR D1 NLAAS D1 NSAL DP1 Variable Label: Sad/depr episode - discouraged about life Total English Spanish Vietnamese Tagalog Chinese D1. Earlier in the interview, you mentioned having periods of time that lasted several days or longer when you felt sad, empty, or depressed most of the day. During episodes of this sort, did you ever feel discouraged about how things were going in your life? 1 YES 5 NO (see V00766) View Universe Value",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}