{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are plenty of clubs, sports teams and other activities to do on campus. Bingo, movie night and trivia are always popping up during the semester thanks to SAC. Off campus there is a bus you can take to get to the mall, it is free for students, and there are a few restaurants in the area to eat at. A convenience store can be found down the road and parties are held off campus.",
            "At first the food is really good during the beginning of the year, but as the semester goes on it goes downhill. The food is repetitive after a while and it is easy to get tired of it. Dining is expensive and constantly increasing, but most of the food is made right there in the kitchens and cafes. There is one dining hall for buffet meals and there are little cafes around campus to grab and go. Depending on what you are in the mood for or where you are on campus will determine what you eat.",
            "The dorm life is not terrible, but neither is it the greatest thing ever. There are options to joining a themed community after freshmen year; this is for people who have the same interest to live together in the same hallway. Other then this housing is pretty expensive, but the dorms are not in bad shape. The only dorm really worth avoiding is Regina; this dorm to me is the worse one to live in. You can pick your own roommate freshmen year if you meet someone during orientation, but if not you are stuck with the person for at least three weeks till you can switch.",
            "The academic workload is large and there is more reading to do then actual homework and worksheets. Keep up with the readings and projects otherwise you will get overwhelmed especially applies to art programs. This is not a party school, and most professors care about what they teach and do. They know your name and will know if you don't show up to class; you can loose a letter grade so always attend class. Depending on your major will determine the amount of projects or tests you have to do; art does projects and science and math do tests more. Manage your time wisely and there won't be a problem with keeping up with the work load; always check your syllabus for due dates. Professors are not always going to tell you when something is due, it is your job to check.",
            "Marywood is a dry campus and campus safety is always around. Partying is fine, but the amount of school work involved will catch up fast. Art programs and music programs are well known. The campus is one large circle so it is hard to get lost. Freshmen get their own separate dorm. There are plenty of sports to choose from, and intramural sports not as much. You can get lost in the shuffle, so join a club or sport team to make it easier. Try and avoid getting Regina as a dorm; Madonna is the best dorm and Loughran is for Freshmen. Parking is one of the hardest things to find on campus. The security officers love to ticket so be careful where you park. There are no currently made books in the library, it is not updated at all.",
            "Marywood is a small liberal arts based university with a variety of majors for different fields of study. The University has a small campus and community of closely knit students. Classroom sizes are small and have plenty of student and professor interactions; professors know the name of students not the number."
        ]
    ],
    "pageTitle": "Marywood University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Marywood-University/reviews?_escaped_fragment_=/show/66510",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00251-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902264795,
    "recordOffset": 902222710,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{136898=There are a fun places around Marywood University. There is downtown Scranton, Nay Aug park, and the top of the world, a hike with the best hidden secret that Scranton has to offer. A must do!, 148274=© 2015, Cappex.com, LLC, 70882=The amount of squirrels on campus kind of makes you think there is a squirrel to student ratio of 20:1., 40564=As an art major, I was highly impressed by how amazing the art program was. My classes are jam packed with three hour art classes, and though that might seem a bit long, I enjoy every single minute I spend doing what I love. I enjoyed that I was instantly able to jump into my major while still having other core classes such as Modern Belief and History Since 1865 to keep me sane when the concentration on art was so heavy., 4626=Applying Advice: Apply early as possible. There are certain scholarships that have a deadline. Scholarships Advice: Keep up GPA, work hard on SATs (they do matter), volunteer alot, and take APs/honors if possible. ------As of this year Marywood has a scholarship called Marywood Scholars its $20,000 a year ($80,000 overall). To get this you need a GPA of 3.5 in high school and 1200 or higher in SATs. SATs/ACTs: Sudy for SATs- instead of cramming just do one or two problems a day. Take advantage of any prep classes/tutors. ACTs- Take the ACTs if you can. They cannot hurt you. Many people do better on them than the SATs. Plus, it will look good if you have both. Though, it is not necessary., 128916=There is one sorority on campus, Zeta Phi Delta. They are a sorority devoted to service. There is also a fraternity, Mu Sigma Pi. This fraternity is new, started only in 2012. They are a brotherhood dedicated to helping those in the community., 77496=My college is Marywood University in Scranton, Pennsylvania. I love that it is close to home so I can stay close with my family. My father passed away july 20th, 2012 so I need to stay close for my mother.}",
    "textBeforeTable": "01/11/2010 Reviewer is A current student here. 10 out of 11 people found this review useful. 1 of 31 Suzanne from Meshoppen, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. Marywood University Reviews Marywood University › Pennsylvania › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Student 01/25/2011 Reviewer is A current student here. 7 out of 8 people found this review useful. 2 of 31 Categories Comments Great for these types of students Marywood University is perfect for student who love to community service and like to learn about different subjects. Students who come here like small schools where people know who you are. Being active in the school community is a good way to meet people. Tips for prospective students Applying Advice: Apply early as possible. There are certain scholarships that have a deadline. Scholarships Advice: Keep up GPA, work hard on SATs (they do matter), volunteer alot, and take APs/honors if possible. ------As of this year Marywood has a scholarship called Marywood Scholars its $20,000 a year ($80,000 overall). To get this you need a GPA of 3.5 in high school and 1200 or higher in SATs. SATs/ACTs: Sudy for SATs- instead of cramming just do one or two problems a day. Take advantage of any prep classes/tutors. ACTs- Take the ACTs if you can. They cannot hurt you. Many people do better on them than the SATs. Plus, it will",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}