{
    "relation": [
        [
            "Title",
            "Systems, Methods And Devices For Providing Situational Awareness, Risk Analysis Of Elements, Mitigation, Applications And Infrastructure In The Healthcare Ecosystem.",
            "New technologies for monitoring home care and other service delivery points",
            "Systems, Methods and Devices for Providing Situational Awareness, Mitigation, Risk Analysis of Assets, Applications and Infrastructure in the Internet and Cloud.",
            "Systems, Methods and Devices for Providing Device Authentication, Mitigation and Risk Analysis in the Internet and Cloud.",
            "Systems, Methods And Devices To Provide Command And Control, Security, Transaction Management And Unified Data To Multiple Applications And Databases Simultaneously And Sequentially In The Internet And Cloud.",
            "Systems, Methods, and Devices for an Architecture to Securely Support Massively Scalable Applications Hosted in The Cloud And Supporting New Business Models And User Interfaces",
            "Method to ensure performance by ongoing analysis of command and control performance metrics.",
            "Method to federate and broker multiple data types and metadata",
            "Systems, Methods and Devices for Lazy Asset Discovery through analysis of the Food Chain, Gaps, and Creation of Roadmap",
            "Systems and Methods for Providing a Framework and Process for Analyzing Existing Organizations’ Present Business Enhancements and Future Business Opportunities."
        ],
        [
            "Category",
            "Medical",
            "Medical",
            "Technology",
            "Technology",
            "Technology",
            "Technology",
            "Technology",
            "Technology",
            "Technology",
            "Business Process"
        ],
        [
            "Status",
            "Provisional application #61413069",
            "Under development",
            "Full application #12834378 Provision application #61413183",
            "Provisional application #61413190",
            "Provisional application #61413211",
            "Provisional application #61436161",
            "Under development",
            "Under development",
            "Under development",
            "Provisional patent application #61413131"
        ]
    ],
    "pageTitle": "John Donovan Resume",
    "title": "",
    "url": "http://professordonovan.com/resume",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00336-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 189841575,
    "recordOffset": 189804322,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{96353=1971-1973, 22580=1977-1980, 47829=2010-2014, 72127=1996, 118380=1991-1994, 43225=1974, 61679=1969-1970, 76946=1946, 117547=Preserved 1000 acres of open land for agricultural and recreation use in Hamilton, Essex, Ipswich picture of land from top of hill in Hamilton  also in Manchester by the Sea, Massachusetts, Promfret, Vermont., Donated stables for chariaible use, notes of appreciation, 118087=1974-2010, 95395=25. Mitrol, Chairman, Co-founder, with Harold Adler (picture with Adler, Son James in 1973), online inventory management system, merged with GE 1973, GE spun it out as MITROL, 112129=1975, 111656=1980-1981, 74754=1964, 76231=1958, 51473=1989-2002, 42554=1973-1990, 101270=1960, 1993, 1999, 12905=1992, 81304=1987-current, 110672=1987-1989, 94963=1978-1983, 31758=1969, 80092=2. Cambridge Technology Partners (CTP), Founder, Chairman, IPO 1993, S-1 (document), formed from the system integration division of CTG, #1 Growth, merge with Novel 2001 (picture with Mary Jo, Pete Musser, 1991 Co-Chairman) (picture Bob GE CTO) (Bob Crandell CEO, American Airlines, early adopter), Picture of Pete Musser, Professor Donovan and Mary Jo Donovan., 91097=18. OneWave (Formerly Business@Web, Object Power), Co-founder, Chairman, IPO 1995, S-1 (document), merged with Primex (picture Sundar Co-founder) tools for web applications., 86973=1994-2000, 22256=1968-1997, 14810=1970-1972, 111897=1980, 88089=1999-current, 109751=1975-1976, 17815=1979-1988, 85006=1992-1996, 10936=1996-2014, 16588=1978, 12327=2009-2014, 92981=2000-2003, 53033=1944-1992, 73624=1967, 92148=19. Cambridge Technology Reports, Co-founder and Executive Editor. Newsletter and CTG successful cases to fortune 2000 executives merged with CTG, 41531=Assistant Clinical Professor of Pediatrics, Technology in Medicine, Tufts School of Medicine1975, 1979, 1982, 1983, Picture of Pediatrics Department Head Dr. Sydney Gellis, MD and Mary Jo Bunker, 100572=1963, 1995, 20274=1975-1982, 61308=1974-1988, 75633=1960-1963, 21203=1968-1971, 42315=1973-1983, 86244=10. Cambridge Samsung Partners (CSP), Co-founder exploration of advance technologies for products, President, merged with Samsung 1996 (picture, Signing, Team), 92468=1989-1992, 113313=1969-1975, 23166=1970-1980, 52285=1995-2002, 93284=1990-1992, 83859=5. Catlabs, Chairman, Co founder with Sundar Subramaniam, joint venture with SAP to service SAP applications and extend them to internet, in 2002 absorbed into CEE/CTG (picture with Sundar, Jay Lee at Harvard), 74034=1965, 99366=2010, 18812=1977-1989, 15281=1966-1970, 23825=1970-2000, 46523=1974, 1979, 49706=1980-2011, 87400=1996-1999, 34809=1968-2011, 19128=1968-1977, 11838=1977, 119080=1987-1995, 116576=2008, 21603=1990-2011, 96025=1971-current, 17489=1967-1972, 32667=Fellow, Silliman College1990, 2002, 2009(picture with Master Judith Krauss) (Fellows Letter of Duties), 84356=7. Open Environment Corporation (OEC), Co-founder, Chairman, IPO 1993, S-1 (document), Products, DCE tools, merged Borland 1996 (picture at the beginning Sundar CEO, John Chairman, Russel Clark Myopia), 85489=9. Integration International Inc. (I-Cube) Lecturer, CTG marketing, IPO 1999, S-1, migration of applications from mainframes to client server architecture, Merge with Razorfish 1998, Microsoft 2007 (picture Chairman Sundar, President Peel), 109405=2000-2006, 22923=1977-1978, 49948=1992-2011, 35348=1964-1966, 19711=1970, 63023=1970, 1971, 1979, 95244=1972-1980, 115809=2008-2010, 6423=Research MIT Department of Economics - business/technology model \"A Recipe for Saving America\" 2010 (picture Senator LeMieux, Florida, Carrie Hanna), 46237=1982, 1985, 37567=1986-1994, 19961=1970-1973, 15637=1966-1968, 15961=1974-1983, 14017=1973-1989, 11040= Permanent Tenure Awarded (MIT ID # 900005071) (picture 1977 Sloan faculty, center), 94192=1983-1985, 63918=1971, 2001, 2010, 115558=2004-2010, 62573=1980-1987, 13546=1989-1997, 33220=1990-2012, 23516=1970-1987, 108812=2001-2002, 117189=2002, 24606=1970-2011, 67243=1971-1987, 88550=1999-2001, 18202=1973-1976, 100234=1964-2010, 108495=2001-2010, 89229=15. C-Bridge Internet Solutions, Co-founder, IPO 1999, S-1 (document), building business applications on the web, merged with Excelon, Progress Software (picture with President, Bellini), 19394=1972-1974, 112374=1972, 66500=Cambridge University, Lecturer, (1995 Punting), doctorate thesis canonical systems, children alumni daughter Rebecca Donovan '86, son John Donovan '87, Rebecca's essay, 91997=1993-1998, 116227=2009, 79856=1980-current, 33728=2010-2011, 48741=1984, 1993, 75251=1963, 69386=1970-1971, 112898=1971, 86093=1996-2000}",
    "lastModified": "Thu, 30 Jul 2015 14:07:51 GMT",
    "textBeforeTable": "﻿Recent Patent Work  January 2011 Donovan, John J. et al.,\"APPARATUS, SYSTEM, AND METHOD FOR INCUBATION, AUTOMATIC ANALYSIS, AND EXPERIMENTAL ALERTING OF BIOLOGICAL CULTURES.\" U.S. Patent Application Serial Number 61/145,631 (filed January 19, 2009) Donovan, John J. et al., \"AUTOMATIC HORSE HEALTH AND BEHAVIOR MONITORING AND ALERTING SYSTEM, METHOD, AND APPARATUS\" U.S. Patent Application Serial Number 61/145,622 (filed January 19, 2009) Donovan, John J. et al., \"SYSTEMS AND METHODS FOR PASSIVELY DETECTING DNS COMPROMISE\" U.S. Patent Application Serial Number 61/115,422 (filed November 17, 2008) Donovan, John J. et al., \"A SAFETY METHOD, SYSTEM, AND APPARATUS FOR ALERTING WHEN A CONSTRUCTION WORKER SAFETY HARNESS IS NOT ANCHORED\" U.S. Patent Application Serial Number 61/076,681 (filed June 30, 2008) Donovan, John J. et al., \"A METHOD, SYSTEM, AND APPARATUS FOR SAFE CRANE OPERATION\" U.S. Patent Application Serial Number 61/077,148 (filed June 30, 2008) Donovan, John J. et al., \"A SYSTEM, METHOD AND APPARATUS FOR INSPECTIONS AND COMPLIANCE VERIFICATION OF INDUSTRIAL EQUIPMENT USING A HANDHELD DEVICE\" U.S. Patent Application Serial Number 61/122,632 (filed December 15, 2008 ) Provisional Patents European (EPO) Patent: Donovan, John J. et al., \"AN ALERTING SYSTEM AND METHOD FOR SAFETY, SECURITY, AND BUSINESS PRODUCTIVITY.\" European Patent Number PJC/P41147EP (granted on April 8, 2009 and filed September 25, 2008). Canadian Patent: Donovan, John J. et al., \"A VIDEO SURVEILLANCE, STORAGE, AND ALERTING SYSTEM HAVING NETWORK MANAGEMENT, HIERARCHICAL DATA STORAGE, VIDEO TIP PROCESSING, AND VEHICLE PLATE ANALYSIS.\" WIPO Patent Application WO/2009/045218 (granted on April 9 2009 and",
    "textAfterTable": "Issued Service Mark Cambridge Technology Group - Issued to Cambridge Technology Group (2,071,291) updated 9/9/2009 Issued Trademark Surround - Issued to Cambridge Technology Group (1,607,715) Cambridge Technology Group , CTG  U.S. Trademark no. 77822899, issued renewed  4/29/2010 top   Funded Research at MIT, Yale and Tufts Medical School Sponsor Research Topic American Red Cross Birth defects (joint with Tufts School of Medicine) National Institute of Health Clinical laboratories (joint with Yale School of Medicine) New England Regional Commission (NERCOM) Support of New England Energy Management Information System (NEEMIS) IBM Corporation Security basic research IBM/MIT Joint Study Database basic research National Bureau of Economic Research Development",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}