{
    "relation": [
        [
            "Published Date",
            "May 29, 2015",
            "Mar 31, 2015",
            "Mar 19, 2015",
            "Jan 16, 2015",
            "Oct 31, 2014",
            "Feb 11, 2014",
            "Jan 15, 2014",
            "Jun 28, 2013",
            "May 8, 2013",
            "May 6, 2013",
            "Oct 9, 2012",
            "Aug 30, 2012",
            "Aug 15, 2012",
            "Feb 7, 2012",
            "Nov 15, 2011",
            "Sep 30, 2011",
            "Oct 4, 2010",
            "Aug 24, 2010",
            "Feb 25, 2010"
        ],
        [
            "Version",
            "25 (current)",
            "24",
            "23",
            "22",
            "20",
            "19",
            "18",
            "17",
            "16",
            "15",
            "14",
            "13",
            "12",
            "9",
            "8",
            "6",
            "5",
            "4",
            "3"
        ],
        [
            "Files",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download"
        ]
    ],
    "pageTitle": "DailyMed - PRAVASTATIN SODIUM- pravastatin sodium tablet",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=e0c167a4-d8fe-4797-ac83-4364c4c5f9bb",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00246-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 56851315,
    "recordOffset": 56797795,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{149394=The risk of myopathy during treatment with statins is increased with concurrent therapy with either erythromycin, cyclosporine, niacin, or fibrates. However, neither myopathy nor significant increases in CPK levels have been observed in 3 reports involving a total of 100 post-transplant patients (24 renal and 76 cardiac) treated for up to 2 years concurrently with pravastatin 10 to 40 mg and cyclosporine. Some of these patients also received other concomitant immunosuppressive therapies. Further, in clinical trials involving small numbers of patients who were treated concurrently with pravastatin and niacin, there were no reports of myopathy. Also, myopathy was not reported in a trial of combination pravastatin (40 mg/day) and gemfibrozil (1200 mg/day), although 4 of 75 patients on the combination showed marked CPK elevations versus 1 of 73 patients receiving placebo. There was a trend toward more frequent CPK elevations and patient withdrawals due to musculoskeletal symptoms in the group receiving combined treatment as compared with the groups receiving placebo, gemfibrozil, or pravastatin monotherapy. The use of fibrates alone may occasionally be associated with myopathy. The benefit of further alterations in lipid levels by the combined use of pravastatin sodium with fibrates should be carefully weighed against the potential risks of this combination., 90594=In pregnant rats given oral gavage doses of 10, 100, and 1000 mg/kg/day from gestation day 17 through lactation day 21 (weaning) increased mortality of offspring and developmental delays were observed at 100 mg/kg/day systemic exposure, 12 times the human exposure at 80 mg/day MRHD based on body surface area (mg/m2)., 21872=443.0 (275.0, 1299.0), 90956=In pregnant rats given oral gavage doses of 4, 20, 100, 500, and 1000 mg/kg/day from gestation days 7 through 17 (organogenesis) increased mortality of offspring and skeletal anomalies were observed at 100 mg/kg/day systemic exposure, 10 times the human exposure at 80 mg/day MRHD based on body surface area (mg/m2)., 6510=9. Salonen R, Nyyssonen K, Porkkala E, et al. Kuopio Atherosclerosis Prevention Study (KAPS). A population-based primary preventive trial of the effect of LDL lowering on atherosclerotic progression in carotid and femoral arteries. Circ. 1995;92:1758-1764., 174433=Revised: 5/2015, 7796=5.Sacks FM, Pfeffer MA, Moye LA, et al, for the Cholesterol and Recurrent Events Trial Investigators (CARE). The effect of pravastatin on coronary events after myocardial infarction in patients with average cholesterol levels. N Engl J Med. 1996;335:1001-1009., 7176=7. Jukema JW, Bruschke AVG, van Boven AJ, et al, for the Regression Growth Evaluation Statin Study Group (REGRESS). Effects of lipid lowering by pravastatin on progression and regression of coronary artery disease in symptomatic man with normal to moderately elevated serum cholesterol levels. Circ. 1995;91:2528-2540., 8116=4.The Long-term Intervention with Pravastatin in Ischemic Disease Group (LIPID). Prevention of cardiovascular events and death with pravastatin in patients with coronary heart disease and a broad range of initial cholesterol levels. N Engl J Med. 1998;339:1349-1357., 140414=In the pravastatin sodium placebo-controlled clinical trials database of 1313 patients (age range 20 to 76 years, 32.4% women, 93.5% Caucasians, 5% Blacks, 0.9% Hispanics, 0.4% Asians, 0.2% Others) with a median treatment duration of 14 weeks, 3.3% of patients on pravastatin sodium and 1.2% patients on placebo discontinued due to adverse events regardless of causality. The most common adverse reactions that led to treatment discontinuation and occurred at an incidence greater than placebo were: liver function test increased, nausea, anxiety/depression, and dizziness., 7482=6. Pitt B, Mancini GBJ, Ellis SG, et al, for the PLAC I Investigators. Pravastatin limitation of atherosclerosis in the coronary arteries (PLAC I): Reduction in atherosclerosis progression and clinical events. J Am Coll Cardiol. 1995;26:1133-1139., 177123=To report SUSPECTED ADVERSE REACTIONS, contact TEVA USA, PHARMACOVIGILANCE at 1-866-832-8537 or drug.safety@tevapharm.com; or FDA at 1-800-FDA-1088 or www.fda.gov/medwatch., 49680=In the LIPID4 study, the effect of pravastatin, 40 mg daily, was assessed in 9014 patients (7498 men; 1516 women; 3514 elderly patients [age ≥ 65 years]; 782 diabetic patients) who had experienced either an MI (5754 patients) or had been hospitalized for unstable angina pectoris (3260 patients) in the preceding 3 to 36 months. Patients in this multicenter, double-blind, placebo-controlled study participated for an average of 5.6 years (median of 5.9 years) and at randomization had Total-C between 114 and 563 mg/dL (mean 219 mg/dL), LDL-C between 46 and 274 mg/dL (mean 150 mg/dL), TG between 35 and 2710 mg/dL (mean 160 mg/dL), and HDL-C between 1 and 103 mg/dL (mean 37 mg/dL). At baseline, 82% of patients were receiving aspirin and 76% were receiving antihypertensive medication. Treatment with pravastatin significantly reduced the risk for total mortality by reducing coronary death (see Table 5). The risk reduction due to treatment with pravastatin on CHD mortality was consistent regardless of age. Pravastatin significantly reduced the risk for total mortality (by reducing CHD death) and CHD events (CHD mortality or nonfatal MI) in patients who qualified with a history of either MI or hospitalization for unstable angina pectoris., 2667=Bentonville, AR 72716, 91304=Pravastatin was neither embryolethal nor teratogenic in rats at doses up to 1000 mg/kg daily or in rabbits at doses of up to 50 mg/kg daily. These doses resulted in 10 times (rabbit) or 120 times (rat) the human exposure at 80 mg/day maximum recommended human dose (MRHD) based on surface area (mg/m2)., 8400=3. Shepherd J, Cobbe SM, Ford I, et al, for the West of Scotland Coronary Prevention Study Group (WOS). Prevention of coronary heart disease with pravastatin in men with hypercholesterolemia. N Engl J Med. 1995;333:1301-1307.}",
    "textBeforeTable": "Number of versions: 19 PRAVASTATIN SODIUM- pravastatin sodium tablet View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close Labeler - International Labs, Inc. (023569924) 03/27/2008 ANDA076056 ANDA Marketing End Date Marketing Start Date Application Number or Monograph Citation Marketing Category Marketing Information 30 in 1 BLISTER PACK; Type 0: Not a Combination Product NDC:54458-925-10 1",
    "textAfterTable": "RxNorm PRAVASTATIN SODIUM- pravastatin sodium tablet RxCUI RxNorm NAME RxTTY 1 904467 pravastatin sodium 20 MG Oral Tablet PSN 2 904467 Pravastatin Sodium 20 MG Oral Tablet SCD 3 904475 pravastatin sodium 40 MG Oral Tablet PSN 4 904475 Pravastatin Sodium 40 MG Oral Tablet SCD Get Label RSS Feed for this Drug PRAVASTATIN SODIUM- pravastatin sodium tablet To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=e0c167a4-d8fe-4797-ac83-4364c4c5f9bb To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To view updated drug label links, paste the RSS feed address (URL) shown below into a RSS reader, or use a browser which supports RSS feeds,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}