{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Eggheads",
            "Japanese News",
            "Seven Early News",
            "Today",
            "CBS This Morning"
        ],
        [
            "Time",
            "5:29 am - 6 am",
            "5:40 am - 6:15 am",
            "5:30 am - 6 am",
            "5:30 am - 9 am",
            "5:30 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2012/12/28/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00274-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 705986755,
    "recordOffset": 705914120,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{90896=Garry Maddox: After weighing up many great movies, here is my pick for most outstanding films of 2012., 89658=Looking for some sure-fire holiday reading? Fairfax's literary editor rounds up the best of 2012., 41985=VINCE CHADWICK Saturday will be the first day since 1885 that Melburnians have been unable to buy a ticket on a tram., 62356=Flicks that rocked and bombed in 2012., 53842=Conservationists are predicting the state government will be punished by voters at the 2015 election if it does not back down on plans to allow hunting in national parks., 100495=Turns out Mayans weren't alone in getting carried away about 2012. }",
    "TableContextTimeStampAfterTable": "{184941=Huon Hooke declares pinot gris a highlight of 2012., 124301=December 30 - 31: Now in its sixth year, Origin NYE is returning., 262149=December 27 2012, 249919=GregDingo, Dec 27, 2012, 8:37PM, 39035=DAVID MCCOWEN SUVs of all sizes were hugely popular in 2012. Here is a look at the new metal you’ll see in 2013., 125240=December 19 - 31 This month the Eve stage at Crown Perth will be packed with stellar with performers., 7151=GERARD HENDERSON With Mayan followers foretelling the end of the world before Christmas, it was to be expected 2012 would be replete with hyperbole, prophecy and odd behaviour., 127225=January 1 Cucumber sandwiches and Pimms cocktails await you., 247174=The big-screen turkeys of 2012, 101370=Start your training for Run Melbourne 2013, to be held on Sunday, July 21., 128272=January 1 Club Paradiso is returning to North Fremantle's shore., 248747=Martin, Dec 27, 2012, 9:00PM, 242038=1068 views, 126249=January 1 Attendees from last year will be elated to hear that Marquee is back for New Years Day in 2013.}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: The food looks good, simple and hearty. It's not gripping TV but it warms the gut. River Cottage Christmas Special What's on TV Tonight We reveal who is most likely to make headlines next year. Who'll make news in 2013 Making news Some of the city's best minds share their expertise. Brisbane's best advice Good advice Christmas came early for local drinkers with the opening of Craft. Keepin’ it real Wine Punter Organiser gearing up for another packed Woodford Folk Festival.",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane Sunrise Extra 5 am - 5:30 am Channel Nine Brisbane Nine's Early Morning News 5 am - 5:30 am Network TEN Brisbane Life Today with James Robison 5 am - 5:30 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane Seven Early News 5:30 am - 6 am Channel Nine Brisbane Today 5:30",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}