{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Catholic",
            "Mainline Protestant",
            "Other",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "18,757",
            "13,437",
            "12,363",
            "265",
            "-",
            "43,937"
        ],
        [
            "Congregations",
            "62",
            "13",
            "32",
            "2",
            "-",
            "-"
        ]
    ],
    "pageTitle": "Theresa, Wisconsin (WI 53091) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Theresa-Wisconsin.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 364435635,
    "recordOffset": 364306694,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6070=According to our research of Wisconsin and other state lists there was 1 registered sex offender living in Theresa, Wisconsin as of July 30, 2015. The ratio of number of residents in Theresa to the number of sex offenders is 1,148 to 1. The number of registered sex offenders compared to the number of residents in this city is smaller than the state average., 24907=Incorporated in 1898}",
    "TableContextTimeStampAfterTable": "{42698=Graphs represent county-level data. Detailed 2008 Election Results, 15995=On 7/18/1996, a category F5 (max. wind speeds 261-318 mph) tornado 14.5 miles away from the Theresa village center injured 12 people and caused $40 million in damages., 59324=5.64% of this county's 2010 resident taxpayers moved to other counties in 2011 ($36,404 average adjusted gross income), 30705=Ozone [ppb] level in 2012 was 32.5. This is about average. Closest monitor was 6.8 miles away from the city center., 29222=Carbon Monoxide (CO) [ppm] level in 2012 was 0.140. This is significantly better than average. Closest monitor was 6.8 miles away from the city center., 41842=2004 Presidential Elections Results, 32909=Lead (Pb) [µg/m3] level in 2005 was 0.0106. This is better than average. Closest monitor was 6.8 miles away from the city center., 57482=5.32% of this county's 2011 resident taxpayers lived in other counties in 2010 ($35,930 average adjusted gross income), 41270=1996 Presidential Elections Results, 84645=Total of 3 patent applications in 2008-2015., 31404=Particulate Matter (PM10) [µg/m3] level in 2012 was 16.6. This is better than average. Closest monitor was 6.8 miles away from the city center., 42414=2012 Presidential Elections Results, 38378=School Enrollment by Level of School (%) in 2013, 37980=Educational Attainment (%) in 2013, 42128=2008 Presidential Elections Results, 32159=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 8.89. This is about average. Closest monitor was 6.8 miles away from the city center., 29958=Sulfur Dioxide (SO2) [ppb] level in 2012 was 0.480. This is significantly better than average. Closest monitor was 4.6 miles away from the city center., 85962=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 16246=On 4/4/1981, a category F4 (max. wind speeds 207-260 mph) tornado 14.0 miles away from the village center killed 3 people and injured 53 people and caused between $5,000,000 and $50,000,000 in damages., 41556=2000 Presidential Elections Results, 28575=Air Quality Index (AQI) level in 2012 was 88.4. This is about average.}",
    "textBeforeTable": "Religion statistics for Theresa village (based on Dodge County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Fuel oil, kerosene, etc. (1%) Other fuel (1%) Wood (1%) Electricity (9%) Utility gas (87%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 13 Dodge County: 1.48 / 10,000 pop. Wisconsin: 1.86 / 10,000 pop. Number of convenience stores (with gas): 33 Dodge County: 3.76 / 10,000 pop. State: 4.12 / 10,000 pop. Number of full-service restaurants: 60 Here: 6.84 / 10,000 pop. State: 8.64 / 10,000 pop. Adult diabetes rate: This county: 7.3% Wisconsin: 7.6% Adult obesity rate: Dodge County: 28.8% Wisconsin: 27.5% Low-income preschool obesity rate: This county: 8.1% State: 13.0%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}