{
    "relation": [
        [
            "Box",
            "25",
            "25"
        ],
        [
            "Folder",
            "6",
            "7-8"
        ],
        [
            "",
            "Photograph of Leon Chalette, undated Oversized material from Box 14, Folder 2.",
            "Photographs of Arthur Lejwa, undated Oversized material from Box 14, Folder 5."
        ]
    ],
    "pageTitle": "Detailed description of the Galerie Chalette records, 1916-1999, bulk,1939-1994 | Archives of American Art, Smithsonian Institution",
    "title": "",
    "url": "http://www.aaa.si.edu/collections/galerie-chalette-records-6103/more",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 257219871,
    "recordOffset": 257188652,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{9460=The gallery was very active in the 1950s and 1960s, as evidenced by the numerous exhibitions. Many of the exhibitions in the 1950s were thematic. Exhibitions in the 1960s were mostly organized around the work of a particular artist, such as Wojciech Fangor and Leon Polk Smith. In 1972, the Metropolitan Museum of Art showcased Jean Arp's work from the Lejwa's collection and a few works lent by Arp's widow, Marguerite Arp. The exhibition was expanded and traveled as \"Arp 1877-1966,\" first exhibited at the Solomon R. Guggenheim Museum and then shown in seven museums in the United States and six in Australia., 10107=Madeleine Chalette was born in 1915 in Paris and grew up in Poland. In 1940, after Madeleine's efforts to secure the release of her father, Leon Chalette, from Sachsenhausen concentration camp near Berlin were successful, father and daughter traveled by boat to Shanghai. They stayed in Shanghai throughout World War II, arriving in the United States in 1946. Arthur Lejwa, a Polish-born biochemist, immigrated to the United States in 1939 and taught at Long Island University. In 1947, Madeleine and Arthur Lejwa were married in Cincinnati, Ohio where Arthur was the Director of the Robert Gould Institute for Nutritional Research., 7549=The records of the New York Galerie Chalette measure 23.4 linear feet and date from 1916-1999, with the bulk of the material dating from 1939-1994. The collection documents this contemporary art gallery's operations from its founding in 1954 through Madeleine Lejwa's later years as an independent dealer. Included are correspondence, artists' files, financial and legal records, printed materials, clippings, exhibition catalogs, audio and video recordings, and motion picture film; about half of the collection consists of photographs. Arthur Lejwa's profession as a biochemist prior to becoming a gallery owner is also documented in this collection. The collection also contains personal records of the Lejwas, including correspondence, legal papers, photographs, photo albums, and printed material., 2034=The bulk of the first accession was fully processed by Jordan Patty in 2005. In 2009, the remainder of the first accession and the second accession received a minimal level of processing, and the entire collection was arranged and described by Sarah Haug., 5878=Among the personal records are biographical information, correspondence, legal records mostly related to the settlement of Arthur Lejwa's estate, a significant quantity of snapshots, negatives and slides, and newspaper clippings chronicling Arthur Lejwa's work as a biochemist and the Robert Gould Research Foundation. Arthur Lejwa's scientific career is also represented in biographical information, publications, research notebooks, and photographs. Much of the personal correspondence is from 1939-1951 and is written in Polish, Yiddish and German. The Lejwa's philanthropic donations, especially in Israel, are documented in correspondence, papers, and photographs. Many of the photographs and photo albums record Madeleine Lejwa's travels in the 1970s-1990s., 10621=Art dealers and collectors Madeleine Chalette (1915-1996) and Arthur Lejwa (1895-1972) opened the Galerie Chalette in New York on 45 West 57th Street in February, 1954. The gallery originally specialized in contemporary French graphics and later shifted its focus to contemporary twentieth century European and American art, particularly the work of Jean Arp. Over the years, Galerie Chalette relocated twice. In 1957, the gallery moved to 1100 Madison Avenue and then to 9 East 88th Street in 1964., 1057=Galerie Chalette records, 1916-1996, bulk 1939-1994. Archives of American Art, Smithsonian Institution., 2378=Papers related to Leon Chalette's imprisonment in Sachsenhausen concentration camp were transferred to the Leo Baeck Institute, New York, N.Y. in 2010., 2568=The records were donated by Robert Warshaw, executor of the Madeleine Chalette Lejwa estate in two accessions in 1997 and 2005., 8357=Following Arthur's death on October 27, 1972, Madeleine continued as an independent dealer and consultant and renamed the business Chalette International. In the 1980s, Madeleine Lejwa continued her philanthropic endeavors in Jerusalem, donating to a scholarship fund for Arab students. She was also a strong supporter of New York University's archeological site Aphrodisias, in southwestern Turkey. In the 1970s and 1980s, Lejwa traveled widely including Israel, Jordan, Egypt, Italy, Turkey, Japan, and China. Madeleine passed away at age 81 on June 9, 1996.}",
    "TableContextTimeStampAfterTable": "{97938=This subseries contains snapshots, negatives, and slides of artwork, family, friends, and Madeleine Lejwa's travels in the 1980s and 1990s. Eight photo albums include six albums of photos from Madeleine Lejwa's travels in the late 1970s-early 1990s, one album of photos of china and silverware, and an album of photos of the townhouse at 9 East 88th Street. This subseries is arranged alphabetically by subject, then by last name or subject. Photographs and negatives are filed together; however, slides and photo albums are separated and located at the end of the subseries. This subseries is from the 2005 collection addition and is minimally processed., 124044=This series includes biographical information, personal correspondence, business and legal records, and printed materials. This series is created from the 2005 collection addition and is minimally processed., 64296=The photographs, transparencies, and slides in this subseries generally consist of professional artwork images, although there are some that include images of artists such as Barbara Hepworth and Jerzy Tchorzewski, and exhibit openings such as Jean Arp and Jan Lebenstein. Also included are 61 black and white prints of Dada artists, taken from 1911-1957, and include artists such as Jean Arp, Hugo Ball, Max Ernst, Emmy Hennings, Kurt Schwitters, and Tristan Tzara. Photographs of the Lejwa's personal collection include professional images as well as personal snapshots. This subseries is arranged alphabetically by last name; photographs of the Lejwa's personal collection, slides and transparencies are filed at the end of this subseries., 118630=This series contains records pertaining to litigation against Galerie Chalette. The Lebenstein v. Lejwa (31325.002) folder titles were taken from the original folders; the numerical notation refers to the law firm's client number. Personal legal records can be found in Series 7: Personal Papers., 151811=This series contains 58 film reels, 7 video recordings, and 61 audio recordings of broadcasts, lectures, interviews, exhibitions and personal travels. The bulk of this series is from the 2005 collection addition and is minimally processed., 166011=This subseries contains 54 film reels (Super 8 mm), 4 film reels (16 mm), and 7 videocassettes (VHS). Recordings are related to artists, exhibits, and installations, as well as Madeleine Lejwa's personal interests. The subseries also includes a French film made for television, \"Jean Arp or the Enigmatic Swimmer,\" circa 1966, as well as the printed synopsis and translation of the film. The folder titles are based on the labeling of the recorded media. Other than the previously described Arp film, there are no transcripts of the film recordings. The folders are arranged alphabetically by subject or last name. Film reels are Super 8 mm unless otherwise indicated., 179834=Copyright (c) 2015 Archives of American Art   |   Smithsonian Institution   |   Privacy   |   Terms of Use   |   Contact Us       , 135365=The bulk of the legal records in this subseries are related to settling Arthur Lejwa's estate after his death in 1972 and Madeleine Lejwa's will. Additional legal records may be found in Series 6: Legal Records. This subseries is arranged alphabetically by type of material, then chronologically.}",
    "textBeforeTable": "This series is arranged alphabetically by subject, then chronologically. General chronological correspondence is filed at the end of the series. This series contains Galerie Chalette correspondence with artists, business contacts, customers, and friends. Some of the correspondence includes business records such as loan agreements, invoices, and exhibition arrangements. More correspondence may be found in Series 2: Artists' Files, Series 3: General Business Files, and Series 7: Personal Papers. 1.4 Linear feet; Boxes 1-2 Correspondence, 1920-1995 Series 1: Detailed Description and Container Inventory Return to top Galerie Chalette records, 1916-1996, bulk 1939-1994. Archives of American Art, Smithsonian Institution. How to Cite this Collection The Galerie Chalette records are owned by the Archives of American Art, Smithsonian Institution. Literary rights as possessed by the donor have been dedicated to public use for research, study, and scholarship. The collection is subject to all copyright laws. Ownership & Literary Rights Use of original papers requires an appointment. Use of archival audiovisual recordings with no duplicate access copy requires advance notice. Restrictions on Use How to Use the Collection The bulk of the first accession was fully processed by Jordan Patty in 2005. In 2009, the remainder of the first accession and the second accession received a minimal level of processing, and the entire collection was arranged and described by Sarah Haug. How the Collection was Processed Addition papers",
    "textAfterTable": "4 Galerie Denise Rene, 1920, 1958-1962 1 5 Galleria Pogliani, 1960-1964 1 6 William Lieberman, Museum of Modern Art, 1977-1978 1 7 General Chronological Correspondence, 1946-1954 1 8 General Chronological Correspondence, 1955-1956 1 9 General Chronological Correspondence, 1957 1 10 General Chronological Correspondence, 1958 1 11 General Chronological Correspondence, 1959 1 12-13 General Chronological Correspondence, 1960 1 14-15 General Chronological Correspondence, 1961 1 16-17 General Chronological Correspondence, 1962 1 18-19 General Chronological Correspondence, 1963 1 20-21 General Chronological Correspondence, 1964 1 22 General Chronological Correspondence, 1965 1 23 General Chronological Correspondence, 1966 1 24 General Chronological Correspondence, 1967 1 25 General Chronological Correspondence, 1968 1 26 General Chronological Correspondence, 1969",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}