{
    "relation": [
        [
            "Patent application number",
            "20110201381",
            "20120001960"
        ],
        [
            "Description",
            "USING AMBIENT LIGHT SENSOR TO AUGMENT PROXIMITY SENSOR OUTPUT - Apparatuses and methods to sense proximity of an object and operate a proximity sensor of a portable device. In some embodiments, a method includes receiving an ambient light sensor (ALS) output, and altering, based on the ALS output, an effect of a proximity sensor output on control of a proximity determination. The ALS sensor and the proximity sensor may be located adjacent to an earpiece of a portable device. In some cases, the proximity determination may be a proximity of an object to the proximity sensor, and altering the effect may include changing the proximity of the object from a proximity greater than a first threshold to a proximity less than the first threshold. Other apparatuses and methods and data processing systems and machine readable media are also described.",
            "BACKLIGHT AND AMBIENT LIGHT SENSOR SYSTEM - Apparatuses and methods to operate a display device of an electronic device. In some embodiments, a method includes receiving a user setting of a display control parameter, and altering, based on the user setting, an effect of an ambient light sensor value (ALS) on control of the display control parameter. Also, according to embodiments of the inventions, a method of operating a display of an electronic device includes receiving a change to one of a display brightness output level and an ambient light sensor output level, and altering, according to the change, a display contrast output level. In some embodiments, a method of operating a proximity sensor of an electronic device includes receiving a light sensor output, and altering, according to the output, an on/off setting of a proximity sensor. Other apparatuses and methods and data processing systems and machine readable media are also described."
        ],
        [
            "Published",
            "08-18-2011",
            "01-05-2012"
        ]
    ],
    "pageTitle": "Herz, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/herz-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00298-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 446220315,
    "recordOffset": 446191510,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Scott M. Herz, Santa Clara, CA US 04-02-2015 ONLINE PAYMENTS USING A SECURE ELEMENT OF AN ELECTRONIC DEVICE - Systems, methods, and computer-readable media for securely conducting online payments with a secure element of an electronic device are provided. In one example embodiment, a method includes, inter alia, at an electronic device, generating first data that includes payment card data, generating second data by encrypting the first data and merchant information with a first key, transmitting to a commercial entity subsystem the generated second data, receiving third data that includes the first data encrypted with a second key that is associated with the merchant information, and transmitting the received third data to a merchant subsystem that is associated with the merchant information, where the first key is not accessible to the merchant subsystem, and where the second key is not accessible to the electronic device. Additional embodiments are also provided. 20150095238 Published Description Patent application number Scott M. Herz, Cupertino, CA US 11-28-2013 INTERACTIVE PRINTED ARTICLE WITH TOUCH-ACTIVATED PRESENTATION - An interactive printed article includes a cover and a plurality of printed leaves on which a plurality of touchpoints are distributed. A particular printed leaf among the plurality of printed leaves includes first and second viewed surfaces and first and second inner surfaces and has a touch sensor incorporated therein proximate to a touchpoint among the plurality of touchpoints. At least one of the first",
    "textAfterTable": "Scott M. Herz, San Jose, CA US Patent application number Description Published 20120242849 Assisted Image Capture - Techniques for assisting the user of a digital image capture device take a well composed image are described. In general, a first image may be displayed and then stabilized (or frozen) on the display if it is determined to be well composed. A subsequent image may replace the stabilized image on the display if it is not substantially the same as the stabilized image. A stabilized image may also be tagged with one or more visual cues so as to notify the user the image is well composed. 09-27-2012 20140019367 METHOD TO SEND PAYMENT DATA THROUGH VARIOUS AIR INTERFACES WITHOUT COMPROMISING USER DATA - A commercial transaction method is disclosed. The method first establishes a secure link over a first air interface by a purchasing device. This secure link is between the purchasing device and a point of sale device. The method further identifies a second air interface, which is different from the first air interface, and the second air interface is used to conduct a secure commercial transaction. 01-16-2014 20140192002 BACKLIGHT AND AMBIENT LIGHT SENSOR SYSTEM - Apparatuses and methods to operate a display device of an electronic device. In some embodiments, a method includes receiving a user setting or input of a display control parameter, and causing or altering, based on the user setting or input,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}