{
    "relation": [
        [
            "",
            "Is the rise in global average temperature during the past 150 years statistically significant?",
            "Is the rise in global average sea surface temperature during the past 150 years statistically significant?",
            "Is the rise in global average land surface temperature during the past 150 years statistically significant?"
        ],
        [
            "BenestadI",
            "Yes",
            "Yes",
            "Yes"
        ],
        [
            "BundeII",
            "YesIV",
            "No",
            "Yes"
        ],
        [
            "KoutsoyiannisIII",
            "NoV",
            "No",
            "No"
        ]
    ],
    "pageTitle": "Long-term persistence and trend significance « Climate Dialogue",
    "title": "",
    "url": "http://www.climatedialogue.org/long-term-persistence-and-trend-significance/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00320-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 363129467,
    "recordOffset": 362949707,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{607=Eli, you give me a reference. What a way to distort the data!!! They show graphs for the Arctic and Antarctic BOTH at Aug 2012. In other words, the height of summer in the Arctic and the height of winter in the Antarctic. The rest of the article is similar scientific garbage.}",
    "TableContextTimeStampAfterTable": "{296215=You state that I dislike unit root processes. That would be non-sensical, as LTP and unit roots are just statistical features of a timeseries. What I aluded to in my april first post is that certain interpretations of stastical features may be unphysical., 12663=[1] Cohn,. T. A., and H. F. Lins (2005), Nature's style: Naturally trendy,. Geophys. Res. Lett., 32, L23402, doi:10.1029/2005GL024476 [2] Koutsoyiannis, D., Montanari, A., Statistical analysis of hydroclimatic time series: Uncertainty and insights, Water Resour. Res., Vol. 43, W05429, doi:10.1029/2006WR005592, 2007 [3] Rybski, D., A. Bunde, S. Havlin, and H. von Storch (2006), Long-term persistence in climate and the detection problem, Geophys. Res. Lett., 33, L06718, doi:10.1029/2005GL025591 [4] Zorita, E., T. F. Stocker, and H. von Storch (2008), How unusual is the recent series of warm years?, Geophys. Res. Lett., 35, L24706, doi:10.1029/2008GL036228 [5] Lennartz, S., and A. Bunde. \"Trend evaluation in records with long‐term memory: Application to global warming.\" Geophysical Research Letters 36.16 (2009) [6] Lennartz, Sabine, and Armin Bunde. \"Distribution of natural trends in long-term correlated records: A scaling approach.\" Physical Review E 84.2 (2011): 021129, 136542=However, Benestad is in favour of separating forced and unforced climate change (as the definition of detection implies), and part of the 1850-1949 temperature changes are due to (natural) forcing. This implies that it is difficult to draw conclusions like Koutsoyiannis did. There was no further discussion on this issue., 271438=Koutsoyiannis, D., The Hurst phenomenon and fractional Gaussian noise made easy, Hydrological Sciences Journal, 47 (4), 573–595, 2002., 33858=9. Balmaseda, M. A., Trenberth, K. E. & Källén, E. Distinctive climate signals in reanalysis of global ocean heat content. Geophys. Res. Lett. n/a–n/a (2013). doi:10.1002/grl.50382, 60982=Our (pseudo)test relies on climatic differences for different time lags (not just that of the latest and earliest values). For example, assuming a lag of 30 years (equal to the period for which we defined a climatic value), the climate difference between 2012 and 1982 is 0.31°C – (–0.05°C) = 0.36°C, where the value - 0.05°C is the average of years 1953-82. The value 0.36°C is plotted as a green triangle in Figure 5 at year 2012. Likewise, we find climatic differences for years 2011, 2010, …, 1909, all for lag 30. Plotting all these we get the series of green triangles shown in Figure 5. We repeat the same procedure for time lags that are multiples of 30 years, namely 60 years (red points), 90 years (blue points) and 120 years (purple points)., 28896=Furthermore, taking paleoclimatic information into account, there is no evidence that there have been similar temperature excursion in the past ~1000 years [12-14]. If the present warming was a result of natural fluctuations, it would imply a high climate sensitivity, and similar variations in the past. Moreover, it would suggest that any known forcing, such as GHGs, would be amplified accordingly. The climate sensitivity may be a common denominator for natural fluctuations and forced trends (Figure 3)., 390627=Arthur, thank you for your Comment. I think I answered it in my quite lengthy reply to Rasmus. Please have a look at it. DFA and all the other methods can only eliminate monotonous trends. We now prefer DFA2 because it eliminates linear trends in the original data, together with WT2. If you are more interested, have a look at our 2001 Physica A paper or the SI in our 2013 Nature Climate Change., 203684=Koutsoyiannis, D. (2011), Hurst-Kolmogorov dynamics as a result of extremal entropy production, Physica A: Statistical Mechanics and its Applications, 390 (8), 1424–1432., 175264=I think that Bunde provides a nice overview of the statistics behind long-term persistence (LTP) and the mathematical theory. He also provides some examples which also suggests that there are a number of areas where processes exhibit LTP. However, I’m not convinced that the climate system necessarily fulfils all the assumptions made in the LTP analysis. It is especially the proposition that any observed number xi in a LTP records depends on all previous points which as not established for geophysical processes. Lorenz1 published in 1962 the concept of non-deterministic flow, also known as ‘chaos’2., 610338=See above discussion – I don’t think any meaningful inference can be made about LTP regarding internal variability for Earth as a whole because the external influences largely drive changes in the variables and are simply not being controlled or accounted for in the statistical analysis. For any time series that is properly controlled, for a Hurst exponent of 0.65 or so to be distinguished from a random walk 0.5 value, you would likely need a range of at least 3 orders of magnitude in time scales – that is, 1000 years for annual data (though that depends on how uncertain/variable the data is too). I’m doubtful of any claims regarding shorter time series than that unless the observed exponent is a lot higher., 15319=More recently, another paper [2] followed somewhat similar ideas, although for the Arctic temperature rather than the global mean. A discussion ensued after my posting of ‘What is signal and what is noise?’ on RealClimate.org. A meeting is planned in Tromsø, Norway in the beginning of May to discuss our differences - much in the spirit of Climate Dialogue., 251948=3) If energy considerations are taken into account, i.e. on the basis of estimated external forcings, significance levels of measured temperature trends will be met sooner than on the basis of the pure statistical method of MK (2012), because the latter is prone to misinterpreting forced changes as internal variability. In other words, the MK2012 method is not suitable for determining the significance of an observed trend., 546677=I don’t think you’re understanding Rasmus’ point. As far as I can tell he’s not at all arguing that the real world exhibits only “STP internal variability”. He’s saying that the statistical behaviour being labelled “LTP” is an emergent property of forced GCM realisations, and that the effect is much weaker when looking at unforced GCM realisations. That is, LTP is an expected consequence of forcing. As you’ve mentioned them, this was the primary finding of Rybski, Bunde and Von Storch (2008) when looking at forced simulations (though apparently not including orbital forcing) of the past 1000 years versus unforced control runs., 89439=Armin Bunde is professor of theoretical physics in Giessen. After receiving his PhD in theoretical solid state physics at Giessen University, he spent several years as a Post Doc in Antwerp, Saarbrücken, and Konstanz. He received a prestigious Heisenberg Fellowship in 1984 and spent three years at Boston University and Bar Ilan University in Israel, where he worked with H.Eugene Stanley (Boston) and Shlomo Havlin (Israel). In 1985 he received the Carl-Wagner Award. Between 1987 and 1993 he was professor of theoretical physics at Hamburg University, since 1993 he is back in Giessen., 464641=May I add that detection of a change through statistical significance is not the only thing that matters. The magnitude of the change is even more relevant. The observed climate warning is 0.6°C in 134 years. Assuming that this is statistically significant and a 0.5°C warming is not, does significance make a big difference? Thus, it is important to compare the observed change to what would be a normally expected change., 59989=The method has the advantages that it uses the entire series (not a few values), it considers the actual climatic values (not their ranks) and it avoids specifying a mathematical form of trend (e.g. linear). Furthermore, it is simple: First we calculate the climatic value of each year as the average of the present and the previous 29 years. This is plotted as a pink continuous line in Figure 5, where we can see, among other things, that the latest climatic value is 0.31°C (at 2012, being the average of HadCrut4 data values for 1983-2012), while the earliest one was –0.30°C (at 1879, being the average of 1850-79). Thus, during the last 134 years the climate has warmed by 0.61°C. Note that no subjective smoothing is made here (in contrast to the graphs by CRU), and thus the climatic series has length 134 years (but with only 5 non-overlapping values), while the annual series has length 163., 382645=Having read these papers, you can pass to our 2005 PRL, where we could show that LTP implies a clustering of extreme events, and could show that the clustering of extremes that we PREDICTED on the basis of LTP indeed can be seen in climate records. Again, this paper involves mathematics, but is again VERY PRACTICAL, isnt`t it? After that, you will be in the right mood to look at our 2009 PRE on the ACF. This paper is more demanding in mathematics, but you do not need go through it in detail, just look at the formulas for the ACF and how it depends on the system size. After reading this article, I am sure, you will not continue to analyse data dy the ACF, because the finite size ffects are drastic and hide the proper behavior. So you see, this is also a VERY PRACTICAL paper, which will help you tremendously., 59771=Figure 5 Updated Fig. 2 in Koutsoyiannis and Montanari [21] testing lagged climatic differences based on the HadCrut4 data set (1850-2012; see explanation in text)., 251384=1) The method of MK2012 doesn’t distinguish between trends and fluctuations. In other words, trends in global mean temperatures are considered to be fluctuations in the climacogram. Conclusions about the behavior of the climate system using this climacogram lack energy balance considerations., 479944=By showing the poor skill of climate models in reproducing past climate evolution, we think that we are constructive rather than destructive. In particular, we hope to have contributed in showing that current modelling approaches can be dangerous, because, as they are unable to reproduce climatic variability, naturally they hide or underestimate future uncertainty (cf. Koutsoyiannis et al. 2007, Koutsoyiannis 2010). This may also contribute to the search for better alternatives, perhaps less algorithmic-intensive, needing less powerful supercomputers (which, despite being also money intensive, ultimately may not make any difference), and more thought- and knowledge-intensive., 354599=Finally, when reading our 2009 GRL and the more extensive 2011 PRE he would highly appreciate that it is easy to determine the significance of a trend in a long-term correlated record, because we have specified analytic formulas for the significance as well as for the confidence intervals. This way, he would recognize that natural LTP is not kind of a strange idea of theoreticians, but is of real use., 317515=I agree with this statement. Although I find it a little bit surprising that you say in your comments of 1 May 2013 8:07 pm that “Models vs. reality is a true dichotomy”. It contradicts in my view., 570348=Before 2000, most climate models required flux adjustment (holding the modeled climate near present day climate) during spin up or the system (driven by physics) would settle into a quasi-equilibrium state far from today’s. Doesn’t the whole spin-up process (with and without flux adjustment) suggest that variation on decade to century time scales can be driven by physics. For that matter, “committed warming” taking place over decades is another example of physics., 14805=In 2005, there was a scientific paper [1] suggesting that statistical models describing random long-term persistence (LTP) could produce similar trends as seen in the global mean temperature. I wrote a comment then on this paper on RealClimate.org with the title Naturally trendy?., 387607=Now, the big mistake made by our colleagues is that they used IMPERFECT methods like you do, namely the ACF or the power spectrum, to conclude that the natural fluctuations defined in the way above, can be described by an AR1 process. Then they used known mathematical techniques to estimate the signifance of a trend. This crucial mistake appeared also in the IPCC report since the authors were, unlike you after reading our papers, not aware of the LTP of the climate. They assumed STP and thus got the trend estimations wrong by overestimating the significance. Our 2009 GRL and 2011 PRE show how to do these estimation for LTP records right., 614373=I hope she’ll reply. I did find the first page of her paper on the net, where she talks a bit about her methods: http://www.readcube.com/articles/10.1038/nclimate1863, 245636=But let me come to the question of the origin of LTP. One of the origins is certainly the coupling of the atmosphere to the oceans. But the natural forcings also play a role. We have shown in our 2002 PRL that models that only use GHG forcing cannot reproduce the proper LTP. We have discussed extensively the role of the different ,forcings in our 2004 GRL where we found that the natural forcings are important to reproduce the proper LTP. In contrast, GHG forcing did not contribute to the LTP when using the proper methods (NOT the ACF!). So we need the natural forcings for obtaining the correct LTP. We have shown this also in our 2008 JGR-D where we compared millenium runs with natural forcings and without. So we have answered your two questions already long time ago: Natural Forcing plays an important role for the LTP and is omnipresent in climate., 513190=Demetris seems to argue that these different processes can not be distinguished, or at least that internal (unforced) variability and natural forcings can not be distinguished. Anthropogenic forcings can only be distinguished by virtue of them not having been acting on the system prior to ~1850. Armin seems to take a somewhat similar view, in combining natural unforced and forced changes in what he terms natural fluctuations. Rasmus seems to take the view as I outlined above (the distinction in three main types of processes)., 412420=Regarding deterministic trends: In the global temperature, for example, the trend is highly significant on both 50y and 100y scales . The Hurst exponent here is close to1. You can find these values in our 2011 PRE and in our 2012 review., 483195=In those retrospective predictions initialized every November from 1960 to 2011, the ensemble-mean SST averaged over the first 3 forecast years (Fig. 1a) is very close to the observed 3-year running mean SST in all of the predictions from 2000 onward…, 601155=Maybe you’ve seen Guemas et al 2013? They claim to make a “retrospective prediction” of the ‘hiatus’: http://www.nature.com/nclimate/journal/vaop/ncurrent/full/nclimate1863.html, 444950=Michael C. Mackey, Time’s Arrow: The Origins of Thermodynamic Behavior, Dover, 1992 (a small one: 158 pages)., 571689=@Jim Cripwell 2013-05-02 13:44:16 From the website you link to: http://arctic.atmos.uiuc.edu/cryosphere/IMAGES/global.daily.ice.area.withtrend.jpg The slope of the red line, the daily global sea ice anomaly, is -40000 sq km/year. The global sea ice extent is dropping., 230210=You also misunderstand the way climate models work. Of course they simulate time evolutions which are chaotic – because they simulate weather fluctuations. When you regard the climate as a boundary problem, as Gavin does, then you do indeed see that climate becomes predictable and in that sense nonchaotic. Take this example: I do not know the weather for an exact day in December because of fundamental limitations due to chaos. However, I know that the weather statistics for the December month will show lower temperatures than now., 207760=It is very easy to generate LTP records numerically, one only needs to know how to generate Gaussian random numbers and how to make a Fourier transform. This way, one can very efficiently study theoretically the properties of LTP records. By doing this properly one will find that the autocorrelation function (ACF) as used by Rasmus unfortunately is not an appropriate tool to detect LTP in records with a length below 50 000. As we have shown in 2009 in Physical Review E, there are strong finite size effects which are even worse than anticipated by Rasmus. But this is NOT a problem of LTP, but only of the employed method. The second problem of the ACF can be seen also in Rasmus Fig. 1: It depends on the external trend. Therefore, if one only knows the ACF as tool for detecting LTP one may led to think as Rasmus does in his summary, that we do not really know what the LTP in the real world would be like without GHG forcing., 434531=This cannot be true if the weather evolution is chaotic, where the weather system loses the memory of the initial state after some bifurcation point. You also need to examine the Lyapunov exponents to compare with alternative theories., 188842=On the other hand, while I agree with your notion of the “finite size effect” I would not agree with treating it in terms of inequalities, as you do, because inequalities give the false impression that in some areas (for large sample size N or for small lag s, to use your own notation) your statistical estimations are perfectly safe. They never are, particularly because LTP magnifies the uncertainty and also introduces (negative) bias, sometimes substantial bias, in estimators which according to classical statistics are unbiased (e.g. that of the variance; see Koutsoyiannis, 2003, and Koutsoyiannis and Montanari, 2007). Instead of using inequalities to identify seemingly safe areas, I think it is better to explicitly take the bias into account in all cases. I will come again later to this., 592930=For example, this 2005 PRL – http://prl.aps.org/abstract/PRL/v94/i4/e048701 – uses the MBH’99 Northern Hemisphere temperature reconstruction as one of the examples of long-term persistence, among several other long-term climate-related records (including the Nile river level one Demetris Koutsoyiannis cited). The LTP power-law exponent, gamma, in the case of MBH’99 was very low – just 0.1, indicating very slow decay of the correlations. This was with their “DFA2″ approach, which detrends by removing a quadratic polynomial fit from the data. However, removing a quadratic polynomial (or any other polynomial trend) is quite different from a removal of external forcings from the picture. We know that the long-term temperature record has been subject to a series of changes in forcings associated with Earth’s orbit and the sun (sunspot records provide at least some long-term record of that change), as well as greenhouse gas changes. Those have not followed any simple polynomial pattern – in fact they have fluctuations on a wide range of timescales in themselves., 227638=Scientific dialogue on climate: is it giving black eyes or opening closed eyes?, 2011 (it contains further discussion of the above quotation by Schmidt, 2007). A random walk on water, 2010. A toy model of climatic variability with scaling behaviour, 2006., 193158=Iliopoulou, T., S.M. Papalexiou, and D. Koutsoyiannis (2013), Assessment of the dependence structure of the annual rainfall using a large data set, European Geosciences Union General Assembly 2013, Geophysical Research Abstracts, Vol. 15, Vienna, EGU2013-5276, European Geosciences Union., 618763=LTP….long-term persistence…a highly important topic! We can agree on the following: (1) The longer the time frame for the model being persistant, the better the model quality. What means “long”? A millenium is insufficient, because centennial cycles may be excluded, which require at least 2, or better 3 millenia in order to be identified. Models, based on a 150 year time span (1750-2000) are pure hogwash claiming LTP for millenia…. (2) The idea of applying statistics in order to filter out a trend WITHOUT knowing the underlying driving forces of the trend is a dream of statisticians…for example the recent Marcott et al paper, trying to filter out a hockey stick out of spaghetti graphs: http://i49.tinypic.com/lbogh.jpg or http://47.tiny pic.com/2uylgh3.png This is not even pseudoscience, but the low of the lowest end…. The real climate drives are the five macrodrivers, as given in paper in (3). (3)The notion of a linear trend line….another hogwash. There cannot be a linear trend in climate, see 27-37 ka BP or the Holocene temp evolution in http://www.knowledgeminer.eu/eoo_paper.html The temp evolution is non-lineary….but curvelineary. (4)A non-lineary and CURVILINEARY trend is THE real temp trend. For this reason, the present temp plateau since 15 years is in force. Not in force is the lineary trend of 20 years,1980-2000, which does NOT continue with a 0.2 C increase per decade, as the claimed in IPCC in ar4, wg1, chapter2. The IPCC claim of 0.2 C increase per decade is an outright LIE by climate villains. (5)The real trend is sinoidal, as shown in above quoted paper. (6)The long term persistence analysis over the ENTIRE Holocene shows the detailed natural 60-year Nicola Scafetta cycle for over 10,000 years. Fabrication of hockey sticks trends exclude this most important 60-year cycle (described today as quasi-cycle of PDO and AMO-cycles). Therefore, lineary temp trend lines are climate confusion pure. Best regards, JSei., 270079=A final point is that, if a “trend” like this would be a realistic representation of the climate, we would not be here to discuss. Loosely speaking (as in my previous comment) local trends appeared throughout all Earth history, but these were parts of fluctuations. A consistent trend would lead to a runaway behaviour. That is why it is better to use stationary descriptions within stochastic models of nature (see additional justification in Koutsoyiannis 2006, 2011)., 353710=It is very unfortunate that Rasmus does not seem to be able to read this and our other articles on LTP. I am sure he would appreciate them and see that LTP is not a beautiful and needless kind of theory made by strange theoreticians to make real climate scientists the life harder (forgive me, when I am joking a bit). If he would read them, he would certainly understand (1) from our 2009 PRE that the ACF is a poor tool for analysing LTP in a short record (we have specified the ACF analytically as a function of the record length and the correlation exponent, he only needs to read the formula), (2) from our 1998 PRL, 2001 Physica A, and several other papers including our 2013 Nature Climate Change he would appreciate that there are much better tools (DFA and WT) than the ACF and he would see also the consequences of LTP, e.g., the clustering of extremes. (3), 246520=For describing quantitatively the resultung LTP we do NOT need, in contrast to the claim of Rasmus, understand in detail the role of the many different natural forcings. We just need to understand the mathematical structure of the LTP and how we can model it. Then we can use the methods that we developed in our 2011 PRE to quantify if a trend is natural or not. Of course, it is nice to talk about the effect of the different forcings. But since everything is interwoven in a linear and even non linear way it is nearly impossible to separate the effects from the different forcings on the LTP in a satisfying manner. The pragmatic way is to learn what LTP is, to learn and even improve the detection methods that can separate the natural fluctuations from external deterministic trends and then use the method we developped to estimate the effect of the trend. This way is doable and is actually common in climatology. The difference is only that in previous attempts the natural fluctuations have been considered incorrectly as Short Term Persistent, which significantly overestimates the trend significance., 353468=Of course, if you use the improper ACF as Rasmus did, you cannot!! When testing to what extent GHG is responsible for LTP, we found it is not, please have a look at our 2004 GRL, where we also specified the methods., 226557=Did they really teach us about chaos? What is your take of the following statement: Schmidt (2007, The physics of climate modeling, Physics Today, 60 (1), 72–73; emphasis added):, 190721=Indeed, the behaviour I see for SST is not different from that of my Figure 5, except that the climatic difference for the entire 134-year period (1879-2012) is 0.5°C (but if you limit it to the last 100 years it indeed becomes 0.6°C as you report)., 271658=Koutsoyiannis, D., Nonstationarity versus scaling in hydrology, Journal of Hydrology, 324, 239–254, 2006., 427095=I agree there is a degree of stochastic element in our climate, but there is also a substantial degree of deteminism, depending on your scientific question and the scales you look at. For instance, I can confidently say that the mean December-February temperature in Oslo will be substantially lower than the June-August mean in 2015. But I cannot yet say what weather we will get on July 14 this year. These two statements represent two different scientific questions, and both are quite trrivial. Nevertheless, they can illustrate the fact that our climate is not just stochastic, and that this observations is supported be real measurements., 200620=Furthermore, if you trust only instrumental series you may look at the Nile example in my post, which I trust you can assume to be free of “man-made climate change” as it does not go beyond the 15th century. With respect to instrumental temperature records, you are right that most thermometer records do not go back in time longer than a century. However, there are some that they do—some exceptions as you say. As handy examples, I can offer those of Vienna (see Fig. 3 in Koutsoyiannis, 2011) and Berlin/Tempelhof (see Fig. 13 in Koutsoyiannis et al., 2007). Again the LTP is evident, even without considering the last period (for example, as I recall from the latter publication, the first one-third of the record, years 1756-1839, gives H = 0.83 while for the total period H = 0.77)., 327720=For setting up the hydrologic model, the detailed dataset described in section 2b was split into two subsets (or subperiods), consisting of the calibration subperiod of six years (October 1984–September 1990) and the validation subperiod of four years (October 1990–September 1994). In a second step the model was run for the period 1908–2003 with the long-term historical dataset in order to assess its behavior in comparison with the historical runoff time series., 90983=[4] S. Lennartz and A. Bunde, Phys. Rev. E 84, 021129 (2011), 647930=http://blog.chron.com/sciguy/2012/09/does-the-expanding-antarctic-sea-ice-disprove-global-warming/, 340393=We just need to understand the mathematical structure of the LTP and how we can model it. Then we can use the methods that we developed in our 2011 PRE to quantify if a trend is natural or not., 268405=We will see that the “trend” case gives a constant climacogram (nb., here, as in Markonis and Koutsoyiannis 2013, I speak about the temporally averaged process, not the cumulative one), not changing with time scale k. For small time scales, the “fluctuation” case will also yield a fairly constant climacogram. However, for large time scale, not only will it give a decreasing climacogram, but the rate of decrease will be very steep, much steeper than in the case of white noise. I have not made the exact calculations for this case, but I guess the behaviour will be virtually the same with what you see in Figure 8 of Markonis and Koutsoyiannis, the series labelled “harmonic”. That is, I guess we will have an envelope curve with a slope equal to -1 (vs. -0.5 for the white noise)., 383485=Finally then, I suggest you to look at our 2009 GRL or better our 2011 PRE which is at the heart of this ClimateDialogue. The paper is also mathematically demanding, but not too much, but since we are scientists, this does not create problems for us, since mathematics is the language of science. I hope you agree. (Otherwise, we were philosophers). Reading all these papers will take you some time, but this will be a very good investment!!! Just do it!!! If you have specific questions, not philosophical ones, I will be more than happy to help you. Also, if you cant get all papers from the Internet, just tell me and I will email them to you. Getting familiar with LTP and the significance of anthropogenic trends is enormously important and at the heart of this CD and the PREREQUISITE for a meaningful discussion. So take the chance!!, 203032=Anagnostopoulos, G. G., D. Koutsoyiannis, A. Christofides, A. Efstratiadis and N. Mamassis (2010), A comparison of local and aggregated climate model outputs with observed data, Hydrological Sciences Journal, 55 (7), 1094–1110., 241432=As to the physical interpretation: internal variability would in all likelihood mean a redistribution of energy within the earth system. That ought to result in some components of this system cooling down while the surface is warming up. This is however not what is being observed: Recently, also the deep oceans (at least down to 2000 m depth) have been observed to be warming (Balmaseda et al., 2013). The energy balance provided a powerful constraint to the global average temperature; that has been the case for past changes in earth’s climate and it’s currently still the case. Ignoring this aspect can lead to very strange interpretations (as I tried to show in my april 1st blogpost a couple of years ago, by applying statistical reasoning void of any physical underpinning to imaginary data of my body weight)., 424892=The figure above provides an example, where the black line is HadCRUT4. The red lines are the model simulations for which the temperature increases over 2002-2012, whereas the blue ones show those which decrease., 206258=I actually can agree with most of what Demetris writes on LTP in his interesting and pedagogic blog. I only think that the tools he used (similar as ours in the 2006 paper by Rybski et al) are not the optimum tools. Among climate scientists, the best accepted tool is the exceedance probability (as I wrote in my blog) from which the significance of a trend can be derived. Unfortunately, since the exceedance probability for LTP records was not known before we published our main results in 2009 and 2011, climate scientists used the wrong assumption of an AR1 process to estimate the significance of a trend and considerably overestimated it this way. I am sure, when Demetris will use the exceedance probability and the analytical result we published in 2011, he will arrive at our conclusions, too., 254811=On the other hand, in scientific conferences I have often seen graphs mixing up observational data of the past with model projections of the future and speakers presenting model projections as if they were reality. I have seen IPCC texts, scientific publications and policy documents speaking about the conditions in 2100 using “will” without adverbs like “likely”, “probably”, etc., e.g. “extreme events will become more frequent”., 34799=14. Marcott, S. A., Shakun, J. D., Clark, P. U. & Mix, A. C. A Reconstruction of Regional and Global Temperature for the Past 11,300 Years. Science 339, 1198–1201 (2013)., 175897=The so-called ‘butterfly effect’, an aspect of ‘chaos’ theory, is well-established with meteorology, which means there is a fundamental limit to the predictability of future weather due to the fact that the system looses the memory of the initial state after a certain time period. The reason for this is that the future outcome is sensitive to infinitesimally small differences in the description of the state of the atmosphere. This sensitivity can be estimated through a set of lyapunov exponents., 64908=Biosketch Demetris Koutsoyiannis received his diploma in Civil Engineering from the National Technical University of Athens (NTUA) in 1978 and his doctorate from NTUA in 1988. He is professor of Hydrology and Analysis of Hydrosystems at the Department of Water Resources and Environmental Engineering of NTUA (and former Head of the Department). He is also Co-Editor of Hydrological Sciences Journal and member of the editorial board of Hydrology and Earth System Sciences (and formerly of Journal of Hydrology and Water Resources Research). He teaches undergraduate and postgraduate courses in hydrometeorology, hydrology, hydraulics, hydraulic works, water resource systems, water resource management, and stochastic modelling. He is an experienced researcher in the areas of hydrological modelling, hydrological and climatic stochastics, analysis of hydrosystems, water resources engineering and management, hydro-informatics, and ancient hydraulic technologies. His record includes about 650 scientific and technological contributions, spanning from research articles to engineering studies, among which 96 publications in peer reviewed journals. He received the Henry Darcy Medal 2009 by the European Geosciences Union for his outstanding contributions to the study of hydro-meteorological variability and to water resources management., 272071=Markonis, Y., and D. Koutsoyiannis, Climatic variability over time scales spanning nine orders of magnitude: Connecting Milankovitch cycles with Hurst–Kolmogorov dynamics, Surveys in Geophysics, 34 (2), 181–207, 2013., 158698=Koutsoyiannis’ Figure 5: testing lagged climatic differences based on the HadCrut4 data set (1850-2012). Differences are not statistically significant according to Koutsoyiannis, except maybe for the 90 year lag., 599099=I think there is some physical basis for this state of affairs. Stouffer et al. 2004 showed that halving CO2 induced a longer response timescale than doubling CO2 in a GCM, so there could be some timescale assymetry for cooling versus warming. The characteristics of volcanic-induced forcing could also play a significant role – there is an abrupt large negative forcing followed by an abrupt positive forcing. The transient effect at the surface appears to be done within a decade but that doesn’t change the fact that a cold pulse has effectively been injected into the oceans, which we can reasonably expect to exert an influence over a longer timescale., 393408=We are discontinuing our early December quantitative hurricane forecast for the next year and giving a more qualitative discussion of the factors which will determine next year’s Atlantic basin hurricane activity. Our early December Atlantic basin seasonal hurricane forecasts of the last 20 years have not shown real-time forecast skill even though the hindcast studies on which they were based had considerable skill. Reasons for this unexpected lack of skill are discussed., 297795=You state that I dislike unit root processes. That would be non-sensical, as LTP and unit roots are just statistical features of a timeseries. What I aluded to in my april first post is that certain interpretations of stastical features may be unphysical., 357163=Dear Rasmus, thank you. I apologize that I only can answer today. I have written a quite lengthy answer to the post of Bart from May 3, where I comment quite a lot on your ideas. After reading this, I am convinced that reading and trying to understand our papers really would help you much in this issue. Please do this!, 199744=b. Look at Koutsoyiannis and Montanari (2007), Table 1. It examines several proxies for temperature for the last 500-2000 years and provides two sets of H estimates: One for the entire period covered by each of the proxies and one for the period 1400-1855, common for all proxies. Do you see any noteworthy difference (say, greater than 0.03) in the estimates of H between the two periods? Don’t these high values of H (0.86-0.93 for the period 1400-1855) indicate LTP? Can they be the result of anthropogenic origin? Does your “circular logic” argument apply to them?, 445155=Andrzej Lasota and Michael C. Mackey, Chaos, Fractals and Noise: Stochastic Aspects of Dynamics, Springer-Verlag, 1994 (a big one: 459 pages)., 601992=Also Meehl et al 2011 may be relevant, who claim to find “Model-based evidence of deep-ocean heat uptake during surface-temperature hiatus periods”: http://www.nature.com/nclimate/journal/v1/n7/full/nclimate1229.html, 35135=16. Foster, G. & Rahmstorf, S. Global temperature evolution 1979–2010. Environ. Res. Lett. 6, 044022 (2011)., 33664=8. Durack, P. J., Wijffels, S. E. & Matear, R. J. Ocean Salinities REveal Strong Global Water Cycle Intensification During 1950 to 2000. Science 336, 455–458 (2012)., 203280=Cohn, T. A., and H. F. Lins (2005), Nature’s style: Naturally trendy, Geophys. Res. Lett., 32, L23402, doi: 10.1029/2005GL024476., 199471=a. The HadCrut4 data set is 163 year long. So, let us exclude the last 63 years and try to estimate H based on the 100-year long period 1850-1949. The Hurst coefficient estimate becomes 0.93 instead of 0.94 of the entire period. Is LTP artificial then?, 271848=Koutsoyiannis, D., Hurst-Kolmogorov dynamics and uncertainty, Journal of the American Water Resources Association, 47 (3), 481–495, 2011., 651733=Eli, you give me a reference. What a way to distort the data!!! They show graphs for the Arctic and Antarctic BOTH at Aug 2012. In other words, the height of summer in the Arctic and the height of winter in the Antarctic. The rest of the article is similar scientific garbage., 193835=Rybski, D., A. Bunde, S. Havlin and H. von Storch (2006), Long-term persistence in climate and the detection problem, Geophys. Res. Lett., 33, L06718, doi: 10.1029/2005GL025591., 538449=[1]. Koutsoyiannis, D., Hurst-Kolmogorov dynamics as a result of extremal entropy production, Physica A: Statistical Mechanics and its Applications, 390 (8), 1424–1432, 2011., 31146=Biosketch Rasmus Benestad is a physicist by training. Benestad has a D.Phil in physics from Atmospheric, Oceanic & Planetary Physics at Oxford University in the United Kingdom. He has affiliations with the Norwegian Meteorological Institute. Recent work involves a good deal of statistics (empirical-statistical downscaling, trend analysis, model validation, extremes and record values), but he has also had some experience with electronics, cloud micro-physics, ocean dynamics/air-sea processes and seasonal forecasting. In addition, Benestad wrote the book ‘Solar Activity and Earth’s Climate’ (2002), published by Praxis-Springer, and together with two colleagues the text book ‘Empirical-Statistical Downscaling’ (2008; World Scientific Publishers). He has also written a number of R-packages for climate analysis posted on http://cran.r-project.org. Benestad was a member of the council of the European Meteorological Society for the period (2004-2006), representing the Nordic countries and the Norwegian Meteorology Society, and he has served as a member of the CORDEX Task Force on Regional Climate Downscaling. He is a regular contributor to the well-known climate blog RealClimate.org., 458665=b. Look at Koutsoyiannis and Montanari (2007), Table 1. It examines several proxies for temperature for the last 500-2000 years and provides two sets of H estimates: One for the entire period covered by each of the proxies and one for the period 1400-1855, common for all proxies. Do you see any noteworthy difference (say, greater than 0.03) in the estimates of H between the two periods? Don’t these high values of H (0.86-0.93 for the period 1400-1855) indicate LTP? Can they be the result of anthropogenic origin? Does your “circular logic” argument apply to them?, 424392=The paper by Easterling and Wehner (2009; GRL; DOI:10.1029/2009GL037810) provides a good discussion on this topic. We can also examine the 10-year interval from 92 CMIP5 simulations (RCP4.5) and we see that there are indeed some models which indicate decades over which the global mean temperature do not increase. This is explained more on Realclimate.org., 395566=The circular reasoning here is that I formulate a hypothesis after I have seen the data. Deterministic modelling can also be affected by circular reasoning. The hydrological community has given importance to avoiding circular logic. Thus, it has thus been a standard practice in modelling to follow the split-sample technique (Klemes, 1986). We split the available observations into two (sometimes three) segments. We use one segment for building and calibrating a model and the other one for validating it. Has such model validation technique been used in climate models? From my experience (Koutsoyiannis et al., 2008, 2011; Anagnostopoulos et al., 2010) I can only imagine a negative answer., 115319=Figure 2.14 from the IPCC AR5 WGI report. Global annual average land-surface air temperature (LSAT) anomalies relative to a 1961–1990 climatology from the latest versions of four different data sets (Berkeley, CRUTEM, GHCN and GISS)., 398812=Apart from your really off-topic comment of May 8, 2013 at 7:29 pm, which gives, however, some nice insight in your motivation, I would like to respond to your on-topic comment of May 8, 2013 at 7:57 pm. (which I consider as a reply on my comment of May 5, 2013 at 12:59 pm.), 243706=Dear Bart, sorry that I could not answer earlier. There are several questions you raised, which also Rasmus raised, but most of them have found already an answer in the literauture. For example, The fact that the ACF is affected strongly by trends is not new at all, we have discussed it in our 1998 PRL extensively where we used detrending methods to determine the True LTP of temperature data. What we called FA at that time is a method equivalent to the ACF and strongly affected by trends. For a more extensive discussion, see our 2001 Physica A paper ( Kantelhardt et al). Scientists who do not have experience with LTP and are not aware of the better detection methods usually think that the deficit of the ACF is a deficit of LTP, but this is just wrong. I like Rasmus to read our early papers on LTP that were published in the last 15y in Phys. Rev. Lett, Phys. Rev. E, Journal of Geophys. Res. D, GRL as well as Nature Climate Change to become more familiar with LTP, its definition, the methods to detect it, its consequences on the occurrence of extremes. It is easy to find my refs, just go to Google Scholar and type in my name., 532107=Is it a mere coincidence that after the rising of greenhouse gas concentrations in the atmosphere temperatures seem to rise also, when physics tells us they should rise? Or, is it a mere coincidence that e.g. the amount of sea ice in the world is dropping, that sea level is rising when physics tells us this should happen? From the recent Pages2K paper and Marcott et al 2013 I conclude that during the second part of the Holocene global temperatures were gradually dropping until some 150 years ago when this decreasing trend changed into an increasing trend. Can this happen by chance when this seems very plausible from the change in radiative forcings?, 416427=Coming to what Armin has said about appropriate methods for identifying LTP and estimating parameters, I fully agree with him that the empirical autocorrelation function distorts the LTP properties and should be totally avoided. The reason is that empirical autocorrelation is highly biased as shown in my 2003 paper and graphically illustrated in slide 15 of a 2010 presentation., 421304=On 10/05/2013 19:08, Demetris Koutsoyiannis wrote:, 621931=Armin Bunde said May 10, 2013 at 5:24 pm, 193625=Koutsoyiannis, D., and A. Montanari (2007), Statistical analysis of hydroclimatic time series: Uncertainty and insights, Water Resources Research, 43 (5), W05429, doi: 10.1029/2006WR005592., 458134=If the “signal” refers to “manmade climate change”, this suggests that time series before let’s say 1900 only have noise. Is that how you see it?, 615621=The full paper of Meehl et al 2011 is here: http://www.cgd.ucar.edu/cas/Staff/Fasullo/my_pubs/Meehl2011etalNCC.pdf, 250217=In order to construct the climacogram MK2012 compute the standard deviations σ(k) by cutting the time series in N samples of length k (in years). As a test for their method let’s consider two time series: 1) an upward trend in temperatures (white line) and 2) a fluctuation with a two times stronger slope in the first half of the time interval and the same, but negative slope in the second half of the time interval (blue line, see figure)., 44635=The clustering of similar events, more formally described as Long-Term Persistence (LTP) is obvious. For example, around AD 780 we have a group of low values producing a low climatic value, and around 1110 and 1440 we have groups of large values. Such grouping would not appear in a climate that would be the synthesis of independent random events. The latter would be more flat as illustrated by the synthetic example of Figure 3., 392592=In brief, based on the information you give about these studies, my answer to your question “Is this the kind of prediction you’re asking for …?” is negative. I believe that retrospect studies are useful to explore possible explanations of observed phenomena. But it may be dangerous to believe that a skill in retrospect explanation (I would not call it “prediction”) should imply a prediction skill. I will give a very relevant example from a report by Philip J. Klotzbach and William M. Gray, entitled “Extended Range Forecast of Atlantic Seasonal Hurricane Activity and Landfall Strike Probability for 2012” (7 December 2011). The abstract reads (emphasis added):, 380881=One paper to read is certainly not enough here, this is like ” a drop on a hot stone”. May be, you start with our introductory review from 2012 in Acta Geophysica and with the SI in our recent Nature Climate Change, coauthored by Hans von Storch. The references are in my blog. Then you should, for a deeper insight into the methods which are essential in this field (it is here the same as in physics, the appropriate techniques and methods are essential!!) read the 2001 Physica A article on Dentrended Fluctuation Analysis. If you want to go further, you even can read our 2002 article in Physica A, again by Kantelhardt et al, on Multifractality. This article will soon exceed the limit of 1000 citations and may be you like it, but it contains a large mathematics part. But you know, mathematics is the heart of science, so you should not worry., 4564=Update 28 April 2014: Climate Dialogue summaries now online The summary of the second Climate Dialogue discussion on long-term persistence is now online (see below). We have made two versions: a short and an extended version. We apologize for the delay in publishing the summary., 201429=In any case, not only is the risk for circular reasoning a real one, but it also concerns much wider areas than LTP. As another example, consider the “Mexican Hat Fallacy” that I referred to in my post. The circular reasoning here is that I formulate a hypothesis after I have seen the data. Deterministic modelling can also be affected by circular reasoning. The hydrological community has given importance to avoiding circular logic. Thus, it has thus been a standard practice in modelling to follow the split-sample technique (Klemes, 1986). We split the available observations into two (sometimes three) segments. We use one segment for building and calibrating a model and the other one for validating it. Has such model validation technique been used in climate models? From my experience (Koutsoyiannis et al., 2008, 2011; Anagnostopoulos et al., 2010) I can only imagine a negative answer., 91724=This summary is based on the contributions of Rasmus Benestad, Armin Bunde and Demetris Koutsoyiannis who participated in this Climate Dialogue that took place in May 2013., 381753=After that, I suggest you to read four of our articles with HJ Schellnhuber, i.e. our joint PRLs (PRL is the most prestigious physics journal as you certainly know) from 1998, 2002, and 2004 (Comment) as well as the paper by Eichner et al. in PRE. In addition, and this article is very important for you and I mentioned it already several times, you should look at our 2004 GRL, where we discuss, for the 2nd time after our 2002 PRL, to which extent the different forcings contribute to the (quasi-universal) persistence law for continental temperatures. We show that with GHG forcing alone, as in our 2002 PRL, the persistence law cannot be reproduced by the AOGCM, but the natural forcings are essential to get it right, in particular volcanic forcings seemed to play an important point. You see, these are quite PRACTICAL PAPERS, but involve some kind of mathematics., 651673=Jim Cripwell 2013-05-05 13:39:28, 524894=ref 1. Markonis, Y., and D. Koutsoyiannis, Climatic variability over time scales spanning nine orders of magnitude: Connecting Milankovitch cycles with Hurst–Kolmogorov dynamics, Surveys in Geophysics, 34 (2), 181–207, 2013., 318936=In my view physics should be an essential part of any (climate)model. Statistics can be tool for analyzing observations or model data, it’s not the same as physical laws (as you stated in your comments of 1 May 2013 8:07 pm: “In other words, statistics is physics.”)., 204312=Koutsoyiannis, D., A. Christofides, A. Efstratiadis, G. G. Anagnostopoulos, and N. Mamassis (2011), Scientific dialogue on climate: is it giving black eyes or opening closed eyes? Reply to “A black eye for the Hydrological Sciences Journal” by D. Huard, Hydrological Sciences Journal, 56 (7), 1334–1339., 304790=I have tried to investigate the question whether a system could exhibit LTP if its inputs are constant. You may read two papers about this question ( 2006 and 2010). As you can see, even nonsensically constant input can give rise to LTP., 529252=The introduction mentions warming over the past 150 years in the same paragraph as referencing an IPCC conclusion ‘it is extremely unlikely (<5%) that recent global warming is due to internal variability alone'. However, it should be made clear that this attribution statement was specifically addressing 'global climate change of the past 50 years', which would be ~1955-2005, not the past 150 years. This is important because it ties in with Bart's comments regarding warming of the oceans – the reason a strong attribution statement was made specifically only for the last 50 years was the availability of observations relating to ocean warming below the surface., 384998=Now, Bart and Rasmus, what do we understand as natural fluctuations of the climate? For sure not climate without natural forcings. Natural forcings belong to the climate and make the persistence law right (see our 2004 GRL). I wrote already before that climate is highly complex, linear and nonlinear, and everything is interwoven. The natural forcings are not responsible for external deterministic trends, just for the persistence, and one does not need to ask what are the single contributions of the various forcings to temperature changes, since everything is interwoven and probably impossible to separate. It is very naiv to think that mathematical techniques could or should be able to distinguish between the various forcings. So, the natural forcings together with the unforced climate system (which is certainly not white noise) make the ups and downs of temperatures which you can see easily when you look at the data with a sliding average, and we do not need actually to specify where they come from. These ups and down that look like mountains and valleys on all time scales are synonymous for LTP. I find it intriguing that we can classify these fluctuations, in a very satisfying manner, by a singlenumber, the Hurst exponent or correlation exponent. Some climatologists, due to a lack of mathematical understanding, think that these fluctuations can be desribed by an AR1 process, but this is simply nonsense and in disagreement with all facts.}",
    "textBeforeTable": "Table 1 Benestad said that ice ages and the El Niño Southern Oscillation (ENSO) are examples of LTP processes. Bunde and Koutsoyiannis disagreed (Table 3). The three participants agree that LTP exists in the climate (Table 1), but they disagree about the exact definition and the physical processes that lie behind it. Benestad and Bunde describe LTP in terms of “long memory”. Koutsoyiannis holds the opinion that LTP is mainly the result of the irregular and unpredictable changes that take place in the climate (Table 2). Both Bunde and Koutsoyiannis are in favour of a formal (mathematical) definition of LTP, which states that on longer time scales climate variability decreases—but not as much as implied by classical statistics. If the temperature of this year is not related to that of last year or next year we can use statistics to determine whether the increase in global temperature is significant or not. In such an “uncorrelated climate”, i.e. if the temperature of this year is fully independent of other years, the average value becomes zero (or a fixed value) quickly and deviations from the mean last only shortly. However, if there is (strong) temporal dependence the moving average can have large deviations from the mean. This is called long-term dependence or long-term persistence (LTP). Long term persistence and trend significance “Is global average temperature increase statistically significant?” To answer this question one needs to make assumptions on the statistical nature of the temperature time series and to choose what statistical",
    "textAfterTable": "Bunde LTP is a process with long memory; the value of a parameter (e.g. temperature) today depends on all previous points. Koutsoyiannis It is unfortunate that LTP has been interpreted as memory; it is the change, mostly irregular and unpredictable in deterministic terms, that produces the LTP, while the autocorrelation results from change. Table 3 Benestad Bunde Koutsoyiannis Quasi-oscillatory phenomena like ENSO can be described as LTP. Yes No No Is LTP relevant for the detection of climate change? There was confusion about the exact meaning of the IPCC definition about detection. The definition reads: “Detection of change is defined as the process of demonstrating that climate or a system affected by climate has changed in some defined statistical sense without providing a reason for that change. An identified change is detected in observations if its likelihood of occurrence by chance due to internal variability alone is determined to be small.” Bunde and Koutsoyiannis both think detection is mainly a matter of statistics while Benestad thinks it also involves a physical interpretation of distinguishing unforced internal variability from forced changes. Table 4 Benestad Bunde Koutsoyiannis Is detection purely a matter of statistics? No, laws of physics sets fundamental constraints Yes",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}