{
    "relation": [
        [
            "Name",
            "Brown, Edgar",
            "Brown, Edgar H",
            "Brown, Erman R",
            "Brown, Floyd B",
            "Brown, George M",
            "Brown, Harry",
            "Brown, John",
            "Brown, Lex C",
            "Brown, Rockwell V",
            "Brown, Zeb",
            "Brownstein, Sam",
            "Broyles, Samuel K",
            "Brunett, Oscar",
            "Brune, Sarafine",
            "Bruno, Dominick",
            "Bruns, Herman T",
            "Brush, Wesley",
            "Bryant, Alvin E",
            "Bryson, Henry L",
            "Bryson, Thomas N",
            "Bryson, Walter E",
            "Brady, Carlton",
            "Brady, Richard D",
            "Brady, Robert L",
            "Brafford, Lawrence W",
            "Brandenburg, Henry",
            "Brannon, Vergil T",
            "Brantley, Elijah D",
            "Bravard, Charles H",
            "Brazeel, Helmer H",
            "Breekenridge, Chester A",
            "Breeze, John A",
            "Breihan, Carl C",
            "Brendle, Lester",
            "Brendle, William",
            "Brewer, Archie R",
            "Brewer, Robert B",
            "Brewer, William E",
            "Brezenski, William A",
            "Bridges, Boyd",
            "Bridges, William L",
            "Bridgewater, Harvey",
            "Brinkley, Boney J",
            "Brinkley, Herbert C",
            "Brinkley, John R",
            "Bristow, Bernie N",
            "Brite, Freddie",
            "Britt, David E",
            "Britt, James H",
            "Britt, John W",
            "Britt, Robert E",
            "Britt, Samuel M",
            "Brittain, Harry A",
            "Brittain, Stanley"
        ],
        [
            "Rank",
            "Pvt",
            "Pvt--1st Cl",
            "Pvt",
            "Pvt--1st Cl",
            "Pvt--1st Cl",
            "Pvt",
            "Pvt",
            "Pvt",
            "Ck",
            "Mech",
            "Pvt",
            "Pvt",
            "Cpl",
            "Pvt",
            "Pvt--1st Cl",
            "Pvt",
            "Pvt",
            "Cpl",
            "Pvt--1st Cl",
            "Pvt--1st Cl",
            "Pvt",
            "Pvt--1st Cl",
            "Sgt",
            "Pvt",
            "Pvt--1st Cl",
            "Cpl",
            "Pvt",
            "Pvt",
            "Pvt",
            "Pvt",
            "Sgt",
            "Cpl",
            "Pvt",
            "Cpl",
            "Pvt",
            "Pvt",
            "Mech",
            "BCpl",
            "Pvt",
            "Pvt",
            "Pvt",
            "Pvt",
            "Pvt",
            "Pvt",
            "Mech",
            "Sgt",
            "Pvt",
            "Pvt",
            "Sgt",
            "Pvt--1st Cl",
            "Pvt",
            "RSM",
            "Pvt",
            "Pvt--1st Cl"
        ],
        [
            "Company",
            "G",
            "D",
            "A",
            "C",
            "F",
            "A",
            "E",
            "K",
            "Sup",
            "D",
            "I",
            "Inf",
            "G",
            "F",
            "M",
            "M",
            "D",
            "K",
            "K",
            "G",
            "K",
            "D",
            "D",
            "B",
            "D",
            "F",
            "E",
            "Hq",
            "C",
            "E",
            "K",
            "H",
            "F",
            "A",
            "G",
            "F",
            "F",
            "Hq",
            "F",
            "M",
            "F",
            "H",
            "F",
            "K",
            "K",
            "G",
            "I",
            "G",
            "I",
            "Ordn",
            "A",
            "Hq",
            "F",
            "D"
        ],
        [
            "Date Joined",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "Dec. 6-18",
            "",
            "",
            "Dec. 6-18",
            "",
            "",
            "Dec. 6-18",
            "",
            "",
            "Dec. 6-18",
            "",
            "",
            "Dec. 6-18",
            "",
            "",
            "",
            "Dec. 6-18",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "Dec. 6-18",
            ""
        ],
        [
            "Wounded or Sick",
            "S--Aug. 1-18",
            "S--May 1-18",
            "W--Sept. 29-18",
            "W--Oct. 10-18",
            "W--Sept. 29-18",
            "W--Sept. 29-18",
            "W--Aug. 23-18 W--Sept. 23-18 T--Jan. 22-19",
            "W--Died Oct. 11-18",
            "T--Jan. 20-19",
            "S--Sept. 19-18",
            "Deserted Oct. 1-18",
            "T--Oct. 28-18",
            "S--Sept. 15-18",
            "S--May 1-18",
            "S--Oct. 20-18",
            "W--Aug. 5-18",
            "K--Sept. 29-18",
            "W--Sept. 29-18",
            "K--Oct. 16-18",
            "W--Sept. 29-18",
            "S--Aug. 12-18",
            "W--Aug. 20-18",
            "S--Oct. 28-18",
            "",
            "W--Sept. 29-18",
            "W--Aug. 25-18 W--Sept. 29-18",
            "S--Jan. 7-19",
            "",
            "",
            "S--Jan. 6-19",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "W--Aug. 18-18 W--Sept. 29-18",
            "W--Oct. 10-18",
            "",
            "",
            "W--Sept. 29-18",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "S--Nov. 11-18"
        ],
        [
            "Date Ret'd",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "Dec. 2-18.",
            "Dec. 11-18.",
            "",
            "Nov. 26-18.",
            "Oct. 29-18.",
            "Jan. 16-19.",
            "",
            "",
            "Jan. 15-19.",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "Nov. 6-18.",
            "Dec. 2-18.",
            "",
            "",
            "Nov. 26-18.",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "Nov. 26-18."
        ]
    ],
    "pageTitle": "Coleman Berkley Conway, b. 1893. History 119th Infantry, 60th Brigade, 30th Division, U.S.A. Operations in Belgium and France, 1917-1919",
    "title": "",
    "url": "http://docsouth.unc.edu/wwi/conway/conway.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00112-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 70875759,
    "recordOffset": 70764052,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=        On the night of August 26-27, 1918, the 2nd Battalion, 119th Infantry Regiment was relieved by the 1st Battalion, 119th Infantry Regiment, in the left Regimental front. Upon the completion of the relief, the 2nd Battalion withdrew to reserve position vacated by the 1st Battalion. Dispostion of the 1st Battalion was as follows:}",
    "TableContextTimeStampAfterTable": "{110952=        5. Regimental Headquarters will close at Maisnil St. Pol at 5:30 a. m., Sept. 17th, 1918 Opening will be announced later., 133778=        Troops will assemble by 4:30 a. m., on the Tape line which is to be held by Engineers. Battalion Commander will insure that sufficient tape is laid running to the trenches to facilitate the forming of troops. The forming up of troops will be completed as quietly and quickly as possible and all troops will be massed on the tape as closely as possible in order to avoid the enemy barrage., 120769=        (c) The 1st Battalion will take over the right sub-sector. The 2nd Battalion will take over the left sub-sector. The 3rd Battalion will take up supporting position, to be selected by Battalion Commander. The Headquarters Company will relieve portions of the corresponding unit of the 118th Infantry. The M. G. Co., relieved the M. G. Co., 118th Infantry on the night of 26-27th of September under arrangements made by Division M. G. Officer., 168214=        On February 11, 1919, pursuant to orders, the Regiment proceeded by marching to the Forwarding Camps, five kilometers from LeMans, where it completed preparation before sailing, and on the twelfth and thirteenth days of March, proceeded to the Embarkation Camp at St. Nazaire, arriving March 13th and 14th. The Regiment remained at this camp for a period of three days, making its final preparations for embarkation to the United States of America., 63383=        11. Command of the right sub-sector of the Canal sector will pass to Colonel commanding 119th Infantry Regiment on completion of the relief on night of August 16-17., 63607=        12. Headquarters 119th Infantry Regiment will close at Elizabeth Chateau and re-open at Assan Farm, H. 22. a. 2. 6. at 9:00 p. m., August 16th., 23312=        Beginning at 11:00 a. m., on the same date, the Regiment moved by small detachments from Dover, England, across the English Channel to Calais, France, and by the afternoon of May 29th the entire Regiment was once more assembled in camp, located about one and one-half kilometers from Calais., 162401=front, and to continue the advance as far as possible, no objective being given. The Regiment in practically the same formation as the previous day formed up and advanced in the general direction of Catillon, maintaining connection on its flanks. At 8:30 the town of Mazingheim was captured by 119th which continued to advance, until it had reached the high ground east of Mazingheim overlooking the Sombre Canal. Here very stout Machine Gun opposition was met, and the line held up for awhile. Supporting Machine Guns, Stokes Mortars, and One Pounders were sent up to protect the front from any counter-attack and did good work in putting out several enemy Machine Gun posts. Practically no advance was made beyond this high ground that afternoon, due to the very open country and the deadly fire from the German Machine Guns., 93039=        At 7:30 a. m., on the morning of August 31st, the troops composing the attack of the 119th Infantry Regiment had reached the line Voormezeele-Switch in I. 31. 6. and I. 32. A., 157340=        On the afternoon of the 16th of October, in accordance with instructions the Regiment moved to the woods immediately southwest of Busigny, where it bivouacked for the, 25028=        In this area the Regiment underwent a most intensive training schedule. Since it was to be affiliated with the British, their methods, the development of four years of painstaking study, was adopted. The 39th British Division, which was associated with the 30th (American) Division arranged to give assistance in training in an advisory capacity, by the attachment of British officers and N. C. O.'s to American units, and by the maintenance of close personal touch, also by the interchange of Staff Officers between the Staffs of the British formation and the corresponding Staffs of the 30th Division. The 119th Infantry was very fortunate in receiving a cadre of instructors from the 9th Black Watch and the 9th and 10th Gordon Highlanders, under the command of Brig. Gen. N. S. Hubbard, 118th Infantry Brigade (British) and under the direct supervision of Col. Cruickshenk, Lt.-Col. Sworder, Lt.-Col. Lord Gordon and Lt.-Col. Anderson. The training was divided into two phases, i. e.: A and B. While in this area, phase A was mastered. This training consisted of 36 hours of instruction for the first week, 25 hours for the second week, 26 hours for the third week, and 20 hours for the fourth week. Realizing that every minute must be taken advantage of, the men worked most industriously, with a spirit at which our Allies marvelled. The training of specialists received the most careful attention, as did the training of the Infantry platoons. It was due, in a great way, to this thorough training that the later phenomenal success of the Regiment in actual battle is attributed. Time was also given to March Discipline and Trench Warfare., 171200=        While at Camp Jackson, upon request of the city of Columbia, the Regiment on April 5th, moved to that city by way of electric railway and paraded through the principal streets, receiving a joyous welcome \"HOME\"., 159959=harassing Machine Gun fire was distributed over the Regimental front. About 11:30 a. m., the British by aid of Artillery Barrage succeeded in advancing until connection had been established with the 119th Infantry. At the time connection was made with the British, the 119th Infantry attempted to advance on the town of Ribeauville, but this advance was met by such heavy Machine Gun fire that the right Battalion had to fall back to its original position. Practically no advance had been made by this Regiment up to 5:00 o'clock that afternoon, nor by the units on either flank., 4095=Source Description: (title page) History 119th Infantry, 60th Brigade, 30th Division, U. S. A. Operations in Belgium and France, 1917-1919 Conway, Coleman Berkley 140 p., ill. [Wilmington, NC] Wilmington Chamber of Commerce [1920] Call number C970.9 C76 c2 (North Carolina Collection, University of North Carolina at Chapel Hill), 30641=        The Regiment formed on the Zaufques-Louches-Yeuse Road with the head of the column at the road intersection 3A, 39, British Map Hazebrouk, at 9:45 a. m., in the following order: Headquarters Company, Detachment Supply Company, 1st Battalion, 3rd Battalion, and 2nd Battalion. The Sanitary Detachments accompanied their respective Battalions. The First and Second Line Transports followed their respective Battalions in the following order: Rolling Kitchens, G. S. Wagons (Ration), G. S. Wagons (Baggage), Water Carts, Limbers. The following disposition of equipment was made: 120 rounds of service S. A. A., one cooked, 22784=        About 9:30 a. m., May 27th, 1918, the convoy filed through the Irish Sea and in a few minutes docked at Liverpool, England. All troops remained on board until 5:00 o'clock that afternoon when the Regiment debarked, and marched a short distance to the train which left at 10:00 p. m., for Dover, England's chief Channel Port for the exportation of troops. The train passed through London about midnight and arrived at Dover about 8:00 o'clock on the morning of the 28th., 99693=        4. The Right Front Battalion and Left Front Battalion will send each the following detail to Dirty Bucket Camp, Sheet 28-A. 30., to arrive not later than 5:00 p. m., to arrange for distribution troops of this command therein., 169343=        Following these units on March 21st, the 2nd and 3rd Battalion Headquarters, and Companies E, F, G, H, I, K, L, and M, embarked from St. Nazaire on the U. S. S. \"Huron.\", 49800=        While the 3rd Battalion was occupying the front line position, the 1st Battalion held the reserve trench or Blue Line going in on the night of August 1-2, and remaining until it was withdrawn Sunday morning, August 10th, 1918., 55557=        11. Units of the 19th British Brigade are sending advance parties to take over camps being evacuated by American units. These parties will arrive at Bn. Hqrs. of the American units concerned at 5:00 p. m., 125783=        After taking over the line on the night of the 27-28 of September until the morning of the attack, great pains were taken to instruct each individual soldier in his particular duty., 168721=        On the 16th day of March, 1919, orders were received from Headquarters Embarkation Camp, Base Sector No. 1, St. Nazaire, France, to the effect that following units of the 119th Infantry would embark at 2:00 p. m., March 17th, on the U. S. S. \"Madawaska\"., 117875=        This movement was carried out according to instructions and the Regiment arrived in the Tincourt Area about 6:00 a. m., September 24th, and after a four mile hike was camped in the southern edge of a wood immediately N. W. of Tincourt., 157603=night of the 16-17th. Regimental Headquarters was established in the village. Before daybreak the morning of the 17th, in accordance with battle instructions, Headquarters 30th Division, the troops of the Regiment marched to its forming up area along a general line, eastern outskirts of La Haie Mennerese and bore on Vaux Andigny, arriving there at 5:00 a. m., zero hour. From this point, the Regiment was to follow the advance of the 59th Brigade under an Artillery Barrage, passing through it at zero plus six hours. The following disposition of troops was made: The 1st Battalion commanded by Capt. Robert J. Lamb on the left of the Regimental sector with \"A\" and \"B\" Companies assaulting, \"C\" Company in close support and \"D\" Company in support. 2nd Battalion commanded by Major Graham K. Hobbs on the right Regimental sector with \"E\" and \"H\" Companies assaulting, \"H\" Company in close support and \"G\" Company in support. The 3rd Battalion commanded by Major John Hall Manning, was in support. The Regiment was joined on the left flank by the 120th Infantry and on the right by the 1st British Division of the 9th British Corps. While following up the 59th Brigade, the Regiment passed through an extremely heavy counter barrage of the enemy., 37975=        2. (a) The 1st Bn., less Co. B, will march on Zwynland Brewery at 7:45 p. m., July 15, 1918., 119187=        September 26th, the following Regimental Order was issued:, 905835=Paris, 37 Rue Bassano, February 12, 1919., 21962=        Friday, May 24th, the convoy reached the \"danger zone\", and at this time numerous \"abandon ship drills\", 61208=        7. All other details of the relief will be arranged between Commanding Officers concerned. O. C. of 1st and 2nd Battalions, 119th Infantry Regiment will be expected at the Headquarters of 2nd Argyle and Southern Highlanders, and the 4th Kings, respectively, at 10:00 a. m., August 16th, and should both visit Headquarters of 1st Middlesex afterwards., 19827=transferring the troops to a large steamer, and in a few minutes landed on one of the large piers at New York used by Troop Transports. The detachment embarked the same afternoon about 4:30, on the British Steamship \"Ascania\", owned and operated by the Cunard Line., 13329=and their tactical use. A large target range was also constructed and on this the men were trained in the art of shooting accurately and rapidly, in order that they might protect their own lines in time to come. In the late fall of 1917, several British and French Instructors were attached to the 30th Division, and a few of these were sent to the 119th Infantry, who gave valuable instructions resulting from their own personal experience in France., 907082=October 2, 1919., 169779=        The entire Regiment landed at Charleston, S. C., on April 2nd, moving immediately by rail to Camp Jackson, S. C., 54926=        9. The relief on the 16-17 August will be carried out as follows:, 24333=        May 31st the organization moved by rail to Audrique,, 125205=        (2) All forward movement will be made in small parties and at full distance. Troops will not march in column of squads., 12026=        On or about September 5th, 1917, several Reserve Officers were transferred from Camp Lee, Va., to the 30th Division which was then under organization, and a number of these attached to the 2nd North Carolina Infantry. Some of these officers were later transferred to other Divisions, but those remaining in the Regiment were permanently assigned., 904112=JEFFERSON HOTEL, Columbia, S. C., March 5, 1919., 903843=        2. May all good things await you as individuals in just recompense for the great service done by you as an organization., 97381=        1. On the night 3-4 September, 1918, the 119th Infantry Regiment, will be relieved by the 106th British Brigade, in the Right Sector of the 30th Division (Canal) Sector, in accordance with attached table., 148433=        On October 5th, the Regiment marched back to the Tincourt Area and camped that night in Tincourt Wood. The following day orders were received to move up to the Bellicourt-Hargecourt Area and the night of the 6th and 7th of October, was spent camped in the trenches of the Hindenburg Line, which eight days previous were occupied by the Germans., 19305=        Early on the morning of May 11th, Regimental Headquarters, Headquarters Company, Machine Gun Company, Supply Company, and Companies A, B, and C, under general command of Col. J. Van B. Metts. Companies A, B, and C, of the 1st Battalion and Battalion Headquarters, under command of Captain Otho Robinson, left Camp Merritt and proceeded by rail to the docks at Hoboken, N. J., arriving there about 9:30 a. m. No time was lost in, 154883=        That afternoon about 2:30 o'clock Regimental Headquarters moved from Premont to Busigny., 3474=Text transcribed by Apex Data Services, Inc. Images scanned by Harris Henderson Text encoded by Apex Data Services, Inc., Harris Henderson, and Jill Kuhn Sexton First edition, 2002 ca. 780K Academic Affairs Library, UNC-CH University of North Carolina at Chapel Hill, 2002., 61617=        8. The 120th Infantry Regiment is moving two Battalions to the Yellow Line on the night, August 16-17, which will take over as follows:, 20973=        The three British Transports, \"Ascania\", \"Haverford\" and \"Laomadon\" on departure from their respective ports made a direct sail for the coast of Canada, and on Wednesday, May 15th, saw each other in the Harbor at Halifax, Nova Scotia., 161763=        The line continued to advance to the village of Ecaillon, which was reached about 1:30 a. m., October 19th. Orders were received to halt and secure connection with units on right and left, which was done. That night the town of Ribeauville was captured liberating one French civilian, and at Ecaillon five horses were captured in a stable with saddle equipment and harness., 102310=        2. (a) This Regiment with attached troops, will entrain on the night of 6-7 September in accordance with entraining table attached hereto, 123289=        (d) Regimental Headquarters will close at its present location at 8:00 p. m., and open at L. 5. d. 5. 9., 56145=        The Canal sector was the general line extending from immediately southeast of Ypres, about two miles southwest to Elzenwalla, inclusive, on both sides of the Ypres-Commines Canal and the country on this immediate front was very low and wet, thus causing many hardships upon the troops occupying it. To the right of the Canal sector stood Mount Kemmel, from the top of which the Germans had a dominating view of the entire sector, thus causing camouflaged screens to be erected on all main roads leading towards the front, and making it very difficult to move about during the day. On the left of this sector was the remains of Ypres, after the great battle the British fought in July, 1916, when the Germans used gas for the first time., 62949=        119th Regiment M. G. Co., will move into the right sub-sector of the line on the night of August 17-18. Orders for this move are being issued by the O. C. 33rd British Battalion M. G. Co., 165686=        On or about November 17th, the 30th Division was relieved of further duty with the British Expeditionary Forces and transferred to the American Expeditionary Forces. With this transfer the Division was moved from its area near Amiens and sent further south with the Americans. On November 21st, 1918, this Regiment entrained at Corbie and moved by rail to the LaMans Area, detraining the following morning at Beaumont sur Sarthe. Regimental Headquarters, Headquarters Company, Machine Gun Company, Supply Company, 1st and 3rd Battalions, were billeted in the town, and the 2nd Battalion was billeted in the village of Vivian. This order was later changed, since the billeting space in Beaumont was entirely too crowded, and some of the organizations were moved into neighboring villages., 18545=        Upon leaving the Training Camp at Sevier, S. C., the Regiment proceeded by special trains to Camp Merritt, N. J. Some of these trains moving over the P. & N. Railroad to Greenwood, S. C., and Seaboard from there to Richmond, Va., then to Washington, Baltimore, Philadelphia and Jersey City, N. J. Other trains moving over Southern to Charlotte, Danville, Richmond, etc. The entire Regiment was assembled at Camp Merritt, N. J., on the 8th of May, 1918, and remained there for a period of three days, being equipped for Over-Seas Service. While there, the organization was split up into three different detachments; one remaining there, one ordered to Philadelphia, and the other ordered to Boston., 147656=        On the night of October 1st and 2nd, the Regiment withdrew to the location previously occupied by it in the Tincourt Area, and in compliance with orders on the morning of October 2nd, marched to the Herbecourt Area by the route of Tincourt-Monrouge-Peronne-Biaches, and went into, 118997=        The Regiment remained at Roisel three days, making their final plans for the attack on September 29th, against the Hindenburg Line., 16116=        This Advance School Detachment, under the command of Major George K. Freeman, joined the general detachment of the 30th Division, which left Camp Sevier, April 30th, 1918, at 2:00 p. m., on a special train of the Southern Railroad. This detachment went direct to Camp Merritt, N. J., via Charlotte, Washington, Philadelphia, and Jersey City, arriving at Camp Merritt about mid-night of May 1st, 1918. While at this camp the N. C. O.'s were equipped for foreign service. On the morning of May 7th, 1918, the detachment boarded a train which carried the party to Hoboken, N. J., where it filed on board the transport George Washington, a converted German liner. Shortly after noon on May 8th, 1918, this liner slipped out of New York Harbor and started on its long journey to France. The convoy consisted of three (3) converted German vessels, the George Washington, the America and the DeKalb, formerly the Cruiser Crown Prince Eitel Frederich. The voyage was uneventful with the exception of one day spent in target practice. About 7:30 a. m., May 17th, 1918, seven (7) American Submarine Destroyers joined the convoy to see it safely into port. On the last day out at sea just at sunrise a submarine was sighted off the starboard side of the DeKalb. It at once submerged without firing. At 11:30 a. m., May 18th, 1918, the George Washington dropped anchor in the harbor of Brest, France. The Advance School Detachment debarked the following day, and marched to, 151790=        At about 4:30 the same afternoon the Regiment gained all of its objectives and immediately consolidated its position. Regimental Headquarters moved from Van le Prettre to Premont. This advancement was of 6 kilometers., 106796=        Upon the transfer from the 2nd British Army, the Regiment proceeded by rail to the St. Pol Area, arriving there the morning of September 7th, 1918. Regimental Headquarters and Headquarters Company were located at Maisnel St. Pol. 1st Battalion and Companies \"C\" and \"D\" at Neuville au Cornet, Companies \"A\" and \"B\" at Monts En Tornois. 2nd Battalion at Buneville. 3rd Battalion at Moncheaux. Machine Gun Company at Tachincourt. Supply Company at Herlin Le Sac., 902742=March 11, 1919, France., 45624=        In compliance with the above order the 1st Battalion under command of Capt. Otho Robinson, moved to the Blue Line (reserve position east of Poperinghe) on the night of July 15th, 1918. Company \"A\" occupied the right front and right support with two (2) platoons in the front line position and two in support. Company \"C\" occupied exactly the same relative position on the left. Company \"D\" was held in reserve. On the night of July 16-17 the Battalion moved to the front line position in the right subsector of the Canal sector in the Ypres salient. The disposition of troops in the sector were as follows: \"A\" Company occupied the front line in conjunction with \"C\" and \"B\" Companies of the Argyle and Southern Highlanders with their right resting on Kruisstraathock-Voormezeel Road. To the right of \"A\" Company and occupying the front line \"D\" Company was stationed with two platoons in the front line and two in close support with the Queens Royal Rifles. \"C\" Company occupied support positions, \"B\" Company received orders to return to Louches, France, by rail to complete its course on the target range., 91840=        A general retirement of the Germans was now anticipated on this front due to their heavy losses and the rapid advance of the Allies further south. That morning about 9:00 a. m., the Division Commander instructed the Commanding Officer 119th Infantry to push out strong combat patrols over his entire front and gain contact with the enemy. Patrols were sent out about 10:30 a. m., and advanced about 100 yards when stout opposition was met as the enemy machine guns came into operation making it impossible for these patrols to advance much further, until additional aid was received from supporting platoons, establishing a general firing line. After the line had been strengthened the advance began again that afternoon about 6:00 p. m., and continued at intervals throughout the night and the following morning., 115190=        2. This Regiment will move by bus on the night of 23-24 September, in accordance with attached movement table. All horse transport is moving by road on the night of 21-22 September, staging night of 22-23 September., 93311=Lock 8, inclusive, and thence along existing front line, capturing the town of Voormezeele. Upon reaching this point orders were received to consolidate and hold the position gained. Both flanks of the Regiment were exposed and Liaison could not be obtained with the units on the right and left. The 108th Infantry Regiment of the 27th American Division being on the right and the 120th Infantry Regiment on the left. Upon the consolidation of this position one platoon of Company \"I\" was sent up to protect the right flank of the 3rd Battalion, Companies \"K\" and \"M\" moved up to G. H. Q. 1 line. On the night of September 1-2, Companies \"E\" and \"G\" of the 2nd Battalion relieved Companies \"L\" and \"I\" of the 3rd Battalion in the advance position. Companies \"F\" and \"H\" remaining back in reserve., 117572=        Remarks.--Head of column at trail intersector 300 yds. N. of Headauville. Clear Headauville at 9:30 p. m. Loading completed by 9:00 p. m. Two Motor Ambulances will accompany the column. Debussing point to be designated by the Brigade Commander., 50357=        From the 10th of August, 1918, until the 15th day of August, 1918, the Regiment trained around Watou in a great way correcting errors which had been noted during the tour in line. On the 15th day of August, the Commanding Officer of the Regiment received orders that the Regiment, 28037=        While in this area authority was received from G. H. Q., for the enlargement of the Regimental Staff by the allowance of an Operation and Intelligence Officer. To fill this very important office, Captain, now Major John Hall Manning, then the Regimental Adjutant, was appointed. Lieut. Jere Cooper was promoted to the rank of Captain and transferred to Regimental Headquarters as Adjutant. Captain Benjamin West on June 4th was also transferred to Regimental Headquarters as Personnel Adjutant. Upon the completion of the above changes, the Regimental Staff consisted of:, 163510=        That night the Regiment was relieved by the _____ British and the Regiment retired to the town of St. Souplet where it was billeted the night of October 19th-20th. The following morning the Regiment moved by marching to Busigny, and October 21st marched to Joncourt. The march continued October 22nd, and that afternoon the Regiment was camped in small huts immediately west of Tincourt. October 23rd, the entire Regiment moved by rail from Tincourt to Heilly and marched from there to Contay Area near Amiens, where the units were billeted in the following towns: 1st Battalion at Contay; 2nd Battalion and 3rd Battalion at Behincourt; Headquarters Company at Baolincourt; Machine Gun Company at Contay; Supply Company at Hahoussoy; Regimental Headquarters at Esbart Chateau., 145501=the afternoon of September the 29th, and occupied the front line trenches along with the men of this Regiment, and it was not until the morning of the 30th, that they were able to make an advance. About the same time the Australians began their advance, orders were received to assemble the Regiment preparatory to withdrawal from the line for rest. It may be noticed that many of our men advanced with the Australians and had to be ordered to assemble in order that they might be relieved with the Regiment. The entire day of September 30th was consumed with a re-organization of the Regiment and the consolidation of the occupied position. Scouting parties were detailed to search every trench and dugout for the dead and wounded, numbers were found. Captured material was collected and placed along the road leading to Bellicourt. During the engagement, the Regiment suffered losses as follows:, 110126=        (d) Route of march will be the shortest route from present location to entraining point., 149681=        Leaving Estrees at approximately 3:30 a. m., the Regiment proceeded by marching to Premont and to its position, arriving there just as the barrage opened. Immediately it formed up in the following order: 2nd Battalion under command of Capt. Graham K. Hobbs, with \"C\" and \"E\" assaulting Companies and \"G\" and \"H\" the two supporting Companies occupied the left Regimental sector. The 3rd Battalion under command of Major William S. Privott and in the same formation with \"K\" and \"M\" Companies as the assaulting Companies and \"I\" and \"L\" Companies supporting, occupied the right Regimental sector. The, 905940=        I understand that you are about to return to the United States soon with your Division. As you of course know, I have not had the pleasure of serving with you when you were in actual command of your Regiment, beyond spending a couple of days in your camp just as you were leaving in December, 1917. I did, however, have the privilege of commanding the 119th Infantry for several months during your temporary absence, and I can but believe that the excellent spirit and morale which existed in that Regiment was largely the result of your work. I have seen personally no regiment formed during the war where officers and men gave a better or more loyal response under rather difficult conditions of training: Of the Regiment's work on this side I know only through hearsay, but comment that I have heard from outside the Regiment and Division has been most favorable., 99538=        All guides will assemble at Road Junction H. 22. a. 35. 85., at 8:30 p. m., September 3rd, 1918., 62047=        1st and 2nd Battalions, 120th Infantry Regiment are each sending advance parties of 1 officer per Battalion Headquarters, 1 officer per Company and 1 N. C. O. per Platoon, to report to the 1st and 2nd Battalion Hqrs., 119th Infantry Regiment, respectively, at 3:00 p. m., August 16th. These parties will take over all dumps of ammunition, and all trench and area stores in the Yellow Line., 53309=        7. On the night of 16-17 August, 1918, the 119th Inf. will relieve the 98th British Brigade in the right sub-sector of the 33rd British Divisional Front., 54628=        These men will make themselves thoroughly acquainted with the area to be taken over on the night of 16-17 August, and will take over from the British units, defense schemes, maps, dumps of ammunition, grenades, etc., and all trench stores., 39229=        (b) Column will march with 100 yd. intervals between Companies; 100 yd. interval between unit and its transport; and 25 yd. intervals between each section of six vehicles., 37763=        1. This Regiment, in conjunction with the remainder of the 60th Infantry Brigade, will commence training under Phase \"B\" scheme, July 16, 1918., 114435=        September 22nd, the following Regimental Order was issued:, 119914=        1. The 60th Infantry Brigade (less 115th M. G. Bn. and Regimental M. G. Co.), will relieve the 118th Infantry in the present sector on the night of 27th-28th of September., 152658=        The Regiment in the same formation as the previous day resumed the attack at 5:30 a. m., October 9th, with, 49173=        The 3rd Battalion occupied the Blue Line during the period that the 2nd Battalion was in the forward position then relieved the 2nd Battalion in the Canal sector on the night of August 1-2, 1918. A detachment from the Signal Platoon from Headquarters Company under command of 1st Lieut. Nathaniel Hannau, accompanied the Battalion into line., 38133=        (b) The 2nd Bn., will march on Zwynland Brewery at time to be designated on July 16, 1918., 58397=        1. The 119th Infantry Regiment (less 3rd Bn.) will relieve the 98th British Brigade in the right sub-sector of the Canal sector on the night of August 16th and 17th., 64679=        The following morning, August 16th, orders were issued for moving the 3rd Battalion, 119th Infantry Regiment from the Green Line to the right sub-sector of the Yellow Line., 20541=        The third detachment, consisting of the 3rd Battalion Headquarters, Companies D, I, K, L, and M, under command of Major William S. Privott, left Camp Merritt, May 10th, and proceeded by rail to Boston, Mass., arriving there about 10:00 a. m., the 11th, and embarked that afternoon on the British Steamship \"Laomadon\"., 148836=        On October 7th, the march was continued to the town of Estrees where the Regiment halted for the night., 42375=        (b-1) The 3rd Bn., during the absence from this area of the 1st and 3rd Bns. 120th Inf. will march from the present camp by the most convenient route to the Blue Line and will cover the left subsector forward line with 3 Cos., extending from G. 9. c. 5. 2. and G. 15. a. 7. 0. (right) to G. 4. c. 3. 1. and G. 4. c. 8. 1. (left) with Bn. P. C. at G. 2. d. 4. 1., 51338=        1. The 119th Infantry Regiment will relieve the 19th British Brigade in the Reserve Brigade Area of the 33rd British Division the night of 15-16 August, 1918, in accordance with attached table. All moves will be by platoon at 100 yds. intervals. Battalions will send advance parties of one officer, per Bn. Hqrs. and one officer per Company to report to Hqrs. of the British Bns., to be relieved at 5 p. m., today. The Hqrs. Company will send one officer and one N. C. O. per platoon to the 19th British Brigade Hqrs., at 5 p. m., today., 21296=        While in this harbor the convoy was formed, consisting of these three Transports and nine others. On the afternoon of May 16th, the convoy sailed for England. The \"Ascania\" was the flag-ship, and carried the Commodore of the convoy--Lieut. Commander Underwood, of the British Navy. The convoy was escorted by the British Cruiser \"Cornwall\"., 152066=        The attack order for the advance on the morning of October 9th, was received at Regimental Headquarters about 3:30 a. m., and transmitted to the Battalion Commanders and front line troops by 4:30 a. m. A runner was the only means of communication at this time. In the attack order the barrage was timed to open at 5:00 o'clock, but later was changed to begin at 5:30, and, had it not been for the fact that the attack orders were late in arriving at the front line, this difference of 30 minutes might have caused disastrous results., 64910=        Upon moving into the front line on night of August 16-17, the 119th Infantry Regiment took over from the 98th British Brigade in the following order:, 115464=        3. Billeting parties under command of Division Billeting Officer proceeded to new area at 9:00 a. m., 21st of September., 143597=        Owing to the magnitude of the offensive, it was deemed necessary as a precautionary measure to further protect the left flank which had suffered so heavily during the engagement, against a possible counter-attack by the enemy. For this purpose one Battalion of the 118th Infantry was sent to the Regimental Commander to be used as he deemed necessary. He in turn sent the Battalion forward to occupy a trench which ran from the Canal in a westerly direction. This Battalion completed the occupation at about 12:30 a. m., the morning of September 30th, 1918. The counterattack never materialized., 169950=        Here all the men in the Regiment from North Carolina, were mustered out of the service between the 6th and 10th, and those from Tennessee were sent to Fort Oglethorpe, Ga., April 9th, to be mustered out there. The remaining men in the Regiment from other States were transferred as Camp Detachments and ordered to the nearest Demobilization Camp to their homes and discharged. The following Camp Detachments were sent from the Regiment:, 115837=        5. Units leaving nights 23-24 of September will carry Iron Rations only., 53521=        8. Advance parties as usual will report at Regimental Hqrs., at 6:00 p. m., today and proceed to the light railway from Remy Siding to Brisbane where they will be met by guides from the 98th British Brigade and taken into the line., 126382=        On the night of September 28-29th, the tape was laid by the 105th Engineers. Due to casualties, however, this task was completed by officers of this Regiment. The Tanks which were to assist in the attack were led into position; and the Infantry took their place upon the tape in the following order: 1st Battalion, commanded by Capt. Otho Robinson, with \"A\" and \"D\" assaulting Companies and Companies \"B\" and \"C\" in close support. 2nd Battalion, commanded by Capt. Graham K. Hobbs, with \"F\" and \"G\" assaulting Companies with \"E\" and \"H\" in close support. 3rd Battalion, commanded by Major William S. Privott, with the exception of \"M\" Company, which was broken up into carrying parties, was assigned as \"moppers up\", to follow the two front line Battalions and clean up all the trenches, dug-outs, and machine gun posts, taken by them. \"I\" and \"L\" Companies were to mop up the Tunnel alone. Company \"K\" assisted in the \"mopping up\", but was later called upon to protect the left flank of the 2nd Battalion., 28993=        The 119th Infantry Regiment was inspected almost immediately upon its arrival in this area by Major Gen. Herbert Plummer, Commander of the 2nd British Army. A week later Field Marshall Sir Douglas Haig, Commander of the British Armies in France, honored this Regiment by giving it a most rigid inspection. Both of these officers expressed great delight in the progress of the training and the wonderful physique of the men. On or about the 30th day of June, Gen. John J. Pershing, Commander in Chief of the American Armies in France, inspected the Regiment. He was pleased with the fitness of the troops and especially the high standard of the personnel, expressing himself that he had not seen a better body of men in the American Expeditionary Forces., 95785=119th Infantry Regiment and the advance party of the 118th Infantry Regiment rejoined their organization September 1st, 1918., 120144=        2 (a) The 119th Infantry will relieve the troops of the 118th Infantry holding the area bounded on the North by a certain line running through A. 26, C. 9,9 and on the South by a line running through L. 16. B. 0. 9. G. 8. 6. 6. 6., to the road along Sentinel Ridge towards Bellicourt, in accordance with attached table \"A\"--Relief to be completed by 2:00 a. m., 155600=        On the morning of October 10th, since the 120th Infantry had not come up on the line, the plan of the attack was not enforced but instead the Regiment merely exploited a short distance immediately forward of this position. After the hard fighting of the 8th and 9th, the men were completely worn out and ready for a rest. However, their high standard of morale had never waned. On the afternoon of the 10th, orders were received for the relief of the Regiment by the 108th Infantry Regiment of the 27th American Division. This relief, due to the fact that some of the units of the 108th Infantry became separated from the rest of the organization, was not completed until after daylight on the morning of the 11th of October. The troops moving from the front line positions could plainly be seen by the enemy who immediately fired on them with Artillery. The Regiment moved by marching back to Premont, where it remained until the same afternoon when it marched to the area around Van le Prettre Farm. Here it was billeted for the night of October 11th-12th. Due to a mistake, the allotment of billeting area by Corps Headquarters, the Regiment was compelled to move to the area surrounding Montbrohain, while Regimental Headquarters was established in the village., 62495=        9. 119th Regiment Machine Gun Company will march from its present camp at 3:00 p. m., August 16th, to Chinese camp, G. 3. d. 6. 4, and will come under the orders O. C. 33rd British Battalion, M. G. C., on arrival., 22374=        About 11:30 p. m., May 26th, a German submarine was sighted within very close range, but it immediately submerged and was not seen again. The crafty Destroyers were on their job and dropped several \"depth bombs\" at the spot where the submarine had been seen. No disorder or confusion among the troops was caused during these crucial moments., 108162=        On the 17th day of September, 1918, the Regiment moved by rail pursuant to the following order to the Puchevillere Area:, 95235=        On August 29th, 1918, orders were issued to the effect that the 118th Infantry Regiment (American) would relieve the 119th Infantry Regiment (American) on night of 31st, August and 1st September. Advance parties were sent to join the 119th Infantry in order that they might become acquainted and familiar with the front which their regiment was ordered to take over in a couple of days. This relief never took place on account of the advance made by the, 5025=        Original grammar, punctuation, and spelling have been preserved. Encountered typographical errors have been preserved, and appear in red type., 67645=        On the night of August 21-22, 1918, the 3rd Battalion, commanded by Major William S. Privott, which was then in the Yellow Line relieved the 1st Battalion, 119th Infantry Regiment, then in right Regimental front. The 1st Battalion upon being relieved withdrew to the same position vacated by the 3rd Battalion. The disposition of the 3rd Battalion was as follows:, 147067=        The field over which this fight took place, on the 30th day of September, presented a miserable appearance, as dead soldiers were scattered broadcast over its area. Shell holes were so numerous that one could not walk three steps without falling into one. Huge masses of barbed wire had been partly cut by the bombardment and the Tanks. Not a telephone pole nor a tree had been left standing by the sweeping Artillery fire. The town of Bellicourt was a complete wreck., 36406=        To better understand the subsequent work of the Regiment it is here necessary to explain somewhat in detail the former training which was conducted under the heading of Phase B training. This consisted of one Battalion at a time going into the line and being associated with the British units then occupying the position and also to strengthen the line as it was very lightly held. The command and the responsibility for this sector was retained by the British while the Americans were given every opportunity to accustom themselves with trench life and conditions. This method of training was to continue until the entire outfit had been able to take advantage of the opportunity. Phase B training was commenced in the Regiment by the following order, July 16, 1918:, 94737=        Two platoons of Machine Gun Company, 119th Infantry Regiment came back in the line August 31st for the attack; one platoon was with the 1st Battalion and one with the 3rd Battalion. The other platoons remained in reserve. (It is well to note here that the 119th Infantry was the first American unit to take over a front line sector in Belgium, the first to make an advance, the first to capture a prisoner and the first to capture a town.), 34905=        After resting up from the four-day march, the Regiment resumed the training schedule with renewed energy. The front line at its closest point was about 12 kilometers distance, consequently the firing of artillery could be heard at all times, and even the bursting of shells, for on several occasions the town of Watou, where Division Headquarters was located was shelled. The shells passing directly over the Camp. Here also the men of the Regiment became thoroughly accustomed to enemy air raids. Practically every clear night there were numbers of German planes overhead bombing important cross-roads and camps. The transports carrying rations forward to the men in the line also presented a favorite target., 29805=        About the 15th of June, information was received that an attack by the Germans was anticipated in the sector immediately east of Cassel. In anticipation of this plan of attack arrangements were perfected whereby the 30th Division was to take up a position in reserve, west of Cassel. The 119th Infantry was designated to be the Divisional Reserve which, as expressed to the Commanding Officer by Gen. Faison, was a very important position in the scheme of defense. The Regiment was preparing for this move with great enthusiasm. This position, however, was never occupied. The orders were unexpectedly changed and this Regiment with the other units of the Division, on the 2nd day of July, 1918, proceeded by marching to the Roozendaal and Road Camp Areas, near Watou, Belgium., 38809=        3. (a) The 1st Bn., less Co. B, and the 2nd Bn., will march via Cross Roads, L. 1, c. 9. 1.--Cross Roads L. 14. c. 4. 3.--L. 14. b. 1. O,--Road Intersection L. 21. c. 95. 95.--thence along Main Abeele-Poperinghe Road to Zwynland Brewery, where guides from 33rd British Division will be met to conduct the Bn., into bivouac along the East Poperinghe Line., 115968=        6. Regimental Headquarters will close at Lealvillers at 5:30 p. m., 23rd of September, and open at time and place to be announced later., 153134=        The advance continued without meeting very strong resistance until the town of St. Souplet on the west bank of the LaSalle River was reached; about 3:00 o'clock that afternoon., 148998=        The night or the portion of night spent here was marked by a most terrific bombardment from the air. No casualties in the Regiment, however, resulted from this attack. Shortly after midnight verbal orders were received from the Commanding General, 60th Brigade, by the Commanding Officer of the Regiment to proceed to the vicinity of Premont and follow the attack of the 117th Infantry which would begin at 6:00 a. m., October 8th, passing through or \"leap-frogging\" the 117th at the railroad fill immediately west of Busigny., 125613=        (5) Troops will march off roads as much as possible., 14368=        Between January 1st, 1918, and April 1st, 1918, the Regimental Commander was in attendance at a Brigade and Field Officers' School at Fort Sam Houston, Texas. During his absence the Regiment was commanded by Col. F. LeJ. Parker, of the Regular Army, and his work for these three months greatly assisted in the building of the backbone of the Regiment. Many competitive drills and exercises were held during this time which assisted in establishing a keen spirit of competition, which the Regiment lived up to in later months., 155030=        The night of the 9th-10th of October was spent in consolidating the captured position and to gain contact with the unit on the right which had been held up by Machine, 17672=the Pantinzer Barracks, about 4 kilometers from Brest. On May 23rd, 1918, the party left Brest for Langres and arrived there May 25th, 1918. The entire detachment was here separated into different groups and commenced special training for which they were sent over. Some officers attended the School of the Line, the remainder the Specialist School. Upon the completion of the course the officers taking the Specialist and Line courses left Langres June 24th, 1918, and rejoined the Regiment which was stationed in the Racques Area, at Louches, on June 27th, 1918. Major George K. Freeman and Major Roane Waring were transferred from the School of the Line to the Staff College before the completion of the course. These two officers were not reassigned to the Regiment., 13792=        These instructors were specialists in their work, and this Regiment was fortunate in getting one for each branch of its training, namely: musketry and bayonet, gas defense, grenades, sniping and observation, stokes mortar, one pounder, and signal work. Beginning at about the 1st of January, 1918, detachments of officers from the 30th Division were sent each month to the School of Arms, at Fort Sill, Oklahoma, and the training for the officers continued until the Regiment was ready to depart for Overseas service., 160550=        About 7:30 o'clock information was received that the British on the right had moved up to the prolongation of our front line, and were continuing the advance. Information was also received that the 27th Division (American) had succeeded in pushing its line forward., 52899=        5. Completion of relief will be reported to Regimental Headquarters. Regimental Headquarters will close at Bayly Camp and reopen at Elizabeth Chateau (G. 8. a. 2. 2.) at 9:00 p. m., tonight, August 15., 162195=        About 3:30 that morning orders were received that the attack would resume at 7:00 o'clock on the entire Corps, 96674=        On September 2nd, 1918, the following orders were issued relieving the 119th Infantry Regiment from the line:, 20114=        The 2nd Battalion, consisting of Battalion Headquarters, Companies E, F, G, and H, under command of Captain Edgar H. Bain, left Camp Merritt, May 10th, and proceeded by rail to Philadelphia, Pa., arriving on the morning of the 11th. From the train the troops marched immediately to the docks, and at 2:00 p. m., embarked on the British Steamship \"Haverford\"., 47102=        For the first six days that this Battalion was in the line it held the position with the British, first by having one English soldier stationed with one American. After confidence was thus gained the separate units were grouped together and a British platoon was placed on either side of an American platoon. On the 23rd day of July, after the Battalion had been in line for a period of six days the British withdrew to the Yellow Line or the Regimental Reserve Line and the 1st Battalion held the front line position alone until relieved by the 2nd Battalion on the night of July 24-25, 1918., 125102=        (1) The relief to be completed by 2:00 a. m., 908355=Combined Operations Map 30th Div. A. E. F. St. Quentin -- Cambrai Front Sep 27 to Oct. 20 1918, 158942=        At approximately 11:00 o'clock in the morning, the 119th Infantry Regiment took over the line from the 117th Infantry as it was held up by Machine Gun fire, and advanced to a railroad cut 2,000 yards west of the village of Ribeauville. Here the position was consolidated and the men dug in for the night. This position was very heavily shelled and quite a number of casualties resulted. The command of the sector officially passed from the Commanding General, 59th Brigade, to the Commanding General, 60th Brigade, at sundown the same evening. With the passing of the command the 59th Brigade supported the 60th Brigade in its advance., 57860=        On August 15th, 1918, the following order was issued from Headquarters 119th Infantry:, 11028=        The 2nd North Carolina Infantry which went into Federal service June 16th, 1916, and spent six months on the Mexican Border was never mustered out upon its return, but proceeded to Camp Sevier, Greenville, South Carolina, August 1st, 1917. When the 30th Division was organized about Sept. 19th, 1917, the 2nd North Carolina Infantry was designated the 119th Infantry and assigned to the 60th Brigade., 104382=        5. Regimental Headquarters will close at Road Camp at 5:00 p. m., September 6th. Opening will be announced later., 91512=        Early on the morning of August 31st the Commanding Officer, 119th Infantry received telephonic communication from the Division Commander that the Germans had evacuated, or partly evacuated Mount Kemmel, and that the British had advanced to occupy the evacuated section., 141585=        The Regiment completed its formation on the tape by 4:30 a. m., Sunday, September 29th, 1918, and waited quietly the zero hour. At exactly 5:50 a. m., the most terrific barrage ever laid down on the Western Front opened and the Infantry following it as closely as possible, assisted by such a density of fog and smoke that a person could not be seen at a distance greater than five yards, succeeded in making its way through the strong fortifications assisting the 120th Infantry in the capture of the town of Bellicourt and the St. Quentin Canal, pushing forward towards its objective. The fog and smoke caused quite a bit of confusion. No one, except with the aid of a compass, could keep the proper direction, consequently the Companies became very much mixed and scattered, a situation which might have been more serious but for the work of the officers, the training of the men and the utter rout of the enemy., 68423=        On the night of the 22-23 of August, the Machine Gun Company was relieved by Company \"B\", 115th Machine, 67203=        When the 33rd British Division was relieved on August 16-17, the 98th British Artillery Brigade, commanded by Colonel Butler, remained in the line supporting the right sub-sector until about August 25th, when it was relieved by the -- British Artillery Brigade, commanded by Colonel Ladd, with headquarters at Assan Farm and was still in the line when the 30th Division was relieved., 101675=        September 5th, 1918, the following orders were received:, 90906=        About the night of 27-28 of August, Company \"M\" was relieved by Companies \"I\" and \"L\", and \"M\" Company withdrew to Ottawa Farm. Company \"I\" was occupying the right front of 3rd Battalion with two platoons in G. H. Q. 1 line and the remainder of Company on Anzac Ridge. Company \"L\" occupied the left front of 3rd Battalion with two platoons in G. H. Q. 1 line, one platoon in Domino Trench and the other platoon in the Ravine. Company \"K\" was in the Brown Line near Smythe Farm.}",
    "textBeforeTable": "         Page 18         8. Advance parties as usual will report at Regimental Hqrs., at 6:00 p. m., today and proceed to the light railway from Remy Siding to Brisbane where they will be met by guides from the 98th British Brigade and taken into the line.         7. On the night of 16-17 August, 1918, the 119th Inf. will relieve the 98th British Brigade in the right sub-sector of the 33rd British Divisional Front.         6. Orders for the movement of the Regimental Machine Gun Company will be issued separately.         5. Completion of relief will be reported to Regimental Headquarters. Regimental Headquarters will close at Bayly Camp and reopen at Elizabeth Chateau (G. 8. a. 2. 2.) at 9:00 p. m., tonight, August 15.         4. The transports will remain in their present camps. Guards will be provided for property at the rate of 1 N. C. O. and 6 Pvts. per Bn., to be retained by the transport.         Instructions regarding the provision of the sector commandants of the Green and Yellow Lines are being handed over by Bn. Hqrs. of the Bn. in the Green Line and the left Battalion in the Yellow Line.         3. Battalions of the 19th British Infantry Brigade are handing over to relieving American Battalions, all defense schemes, dumps of ammunition, grenades, all area stores, and all 1-10.000 maps. 1 per platoon. 1 per Co. Hqrs. 1 per Bn. Hqrs.         2. The 19th British Brigade is",
    "textAfterTable": "  Killed Wounded Died of Wounds Missing Officers 3 8     Men 64 208 12 2         On September 2nd, 1918, the following orders were issued relieving the 119th Infantry Regiment from the line: HEADQUARTERS, 119TH INFANTRY American Expeditionary Forces SEPTEMBER 2, 1918         SECRET         FIELD ORDER No. 22         COPY No. 00         Reference Map: --Sheet 28, N. W. 4 --Sheet 28, S. W. 2         1. On the night 3-4 September, 1918, the 119th Infantry Regiment, will be relieved by the 106th British Brigade, in the Right Sector of the 30th Division (Canal) Sector, in accordance with attached table.         2. The Right Front Battalion will be relieved by the 19th H. L. I. The Left Front Battalion will be relieved by the 12th H. L. I. Companies L and I, by the other units occupying the positions occupied by the Support Battalion of the British unit relieved by this Regiment will be relieved by the 17th Royal Scots.         The Companies of the Battalion in Reserve to be announced later.         The Headquarters Company will be relieved by corresponding units of the 106th British Brigade.         The Machine Gun Company under arrangements to be made by Divisional Machine Gun Officer.         All details of relief will be made by the Battalion and Separate Company Commanders concerned.         Command will pass to C. O.'s of relieving units upon completion of Relief.         3. Guides will",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}