{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I have attended other colleges and they didn't care how I was doing in the classes. At Greenville Tech, they actually show that they care.",
            "They offer good food when you need it.",
            "Great education at a great price!",
            "Make sure you apply on time!",
            "Greenville Tech is one of the best colleges I have been to. The professors actually care about your education and want to make sure that you succeed. I definitely would not want to go to any other college."
        ]
    ],
    "pageTitle": "Greenville Technical College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Greenville-Technical-College/reviews?_escaped_fragment_=/show/77984",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 880423107,
    "recordOffset": 880383989,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{168875=© 2015, Cappex.com, LLC, 111022=I started in 2001, a lot of things have changed for the better. Campus has been expanded.}",
    "textBeforeTable": "02/01/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 44 Arin from Laurens, SC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "while i appreciate the education i am getting, i wish that i had been able to go to a school that challenged me more. What to do for fun there are not really any extracurricular activities at the moment, but there are some in the works, such as intramural sports. there is a shopping mall that is only minutes away on haywood rd. and there are movie theaters and a bowling alley within a mile from campus. Food and Dining the campus does not have many restaurants right around it, but everything you could ask for is about a 5 minute drive away on woodruff rd. Dorm Life while i do not live on campus, i have heard many bad things about dorm life from friends who do. they say that there may be as many as 5 roommates in a tiny apartment and that the campus police are obnoxious when it comes to curfews. Academic Rigor the classes are very easy. the most challenging courses i have taken are the biology courses, but even they do not require intense studying. i have been able to obtain a very",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}