{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "We have five dining halls and a great variety of desserts every meal!",
            "Like I've said, academic life here is rigorous. However, we have amazing professors here who would be more than willing to set up an appointment with you and help you if you're struggling. We also have a student-to-faculty ratio of 8:1.",
            "Be ready to work hard! Wellesley's academic life is rigorous, but professors here are also very caring and thoughtful. They care about student's learning experiences and they are more than willing to help students that are struggling."
        ]
    ],
    "pageTitle": "Wellesley College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Wellesley-College/reviews?_escaped_fragment_=/show/86032",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00083-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 920155363,
    "recordOffset": 920112493,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{133638=Like I've said, academic life here is rigorous. However, we have amazing professors here who would be more than willing to set up an appointment with you and help you if you're struggling. We also have a student-to-faculty ratio of 8:1., 83607=Academically committed women who want to go on to big things. May like to party and have fun but academics come first., 151312=© 2015, Cappex.com, LLC, 128419=Everyone who lives on campus is obligated to be on the unlimited meal plan, which makes for a great community atmosphere because the dining halls become universal gathering spaces. The food is pretty good and there are a lot of options, especially for vegetarians. Wellesley could do a bit better in the gluten-free department. There are no classes from 12:30-1:30 pm, so virtually everyone has a lunch hour together., 105758=Focus on ECs and write a good supplemental essay. Make sure to show who you are in every aspect. Get an interview in September of your senior year!}",
    "textBeforeTable": "07/19/2009 Reviewer is A current student here. 24 out of 24 people found this review useful. 1 of 29 Christine from Salt Lake City, UT Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "The campus is one of the most beautiful in the nation, is consistently in the top 5 liberal arts schools nationally, and of course, as an all-female school, is a haven for women! Because Wellesley is all-female, the perks of really being able to focus on school are immense. While at co-ed schools you may have to take the higher road and not talk as much in class because there are rowdy boys in the class, or have to deal with the sexism that I have encountered in many boys in my grade, at Wellesley you can be completely free to do what you want and need to do in order to perform at your peak. The small class sizes are a blessing, and being surrounded by girls makes competition and performance that much more intense yet friendly. Even if I theoretically had to leave Wellesley and go to a state university because of tuition costs, I would forever be thankful for my time at Wellesley and remember what a tremendous blessing it was to meet other women who have the same goals and aspirations as me, and who don't get distracted from their goals. Am learning a lot Wellesley is an excellent liberal arts school because, in a nutshell, they teach you how to figure the world out for yourself. They have excellence in",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}