{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "If something unsafe has been spotted on campus, a silent alarm text message will be sent to you to stay in your dorms instead of a campus-wide alarm that could be harmful. There is always security watching who comes and goes from campus as well.",
            "So many things to choose from and get involved in!",
            "Any type of student will love this place!",
            "Definitely. It's a little on the expensive side, but totally worth it as far as dorms, food, laundry, education and quality of people and campus.",
            "There is ALWAYS something to do on campus. This college makes their second highest point to help students be involved. They have great clubs and activities to participate in. There is a pool, volleyball court, gym, sporting equipment that you can check out, and different things that the school does for the students. For example, there is an activity they hold called Mystery Bus Ride. The student pays a flat small fee before and gets on a bus without knowing where they're going! They arrive at a destination that consists of fun places like lazer tag and other field trip destinations. This helps the students interact with each other.",
            "The food is outstanding! They have so much to choose from in the cafeteria from a salad bar and soups, to burgers and pizza! They have different stations with different genres of food and you will never find something you don't like. The desserts are to die for too!",
            "The dorms are GORGEOUS! I've never seen a dorm room on a college campus that look quite like the housing at this campus. They're lovely, clean, spacious, and comfy!",
            "The teachers are very dedicated and love what they do. They take extra time to help you understand and won't let you leave the class if you're lost. They want you to succeed and look at you as a student with a name and a goal, not a number in a classroom.",
            "Ask questions! Don't be afraid to visit more than once and get as much information as you possibly can. Speak with the current students. You will never go up a student that isn't completely willing to help you around campus, give you tips, or help you be where you need to be as far as being a prospective student and getting around.",
            "The cleanest and most beautiful campus I've ever visited. Dedicated to the comfort of visitors and the success of its students. Has the nicest and most willing staff to answer any questions you have; little or big."
        ]
    ],
    "pageTitle": "Southeastern University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Southeastern-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00066-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899966347,
    "recordOffset": 899907258,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{301789=© 2015, Cappex.com, LLC, 21948=Southeastern has awesome events such as concerts and parties. This May we are even being visited by Tim Tebow of the Denver Broncos! Always be on the lookout for exciting events!, 207118=Security watch is 24/7. There is a campus curfew all students under 21 must be back on campus by 1:00 am., 249510=SEU Conference is another amazing part of this great college. Every year Southeastern University holds a conference for all the students, and they invite public speakers as well as the SEU worship band along with many other artists. It is normally at the beginning of the year in the month of February, and is a time for the students to learn more, be in community more, and just have a fun time., 30137=I went on a tour of the school in March and the campus was beautiful. It looked like we were on a resort or a fancy mall in Italy. Everything was gorgeous. Bethany hall is where most freshman reside but after I saw how small the dorms where I knew that I would not be staying there. Don't get me wrong, it was a beautiful building but the dorms where very tiny. You have to share a small closet with your roommate so you won't be able to bring as much stuff as you would like. I felt claustrophobic. Esperanza hall was like a Italian hotel. It was beautiful. It also had more than enough space for me. You get your own closet and the room is big. The closets aren't tiny either., 31107=I have no idea personally since I have just been accepted. I will be attending and moving into dorms August 16. But I do hear that the premed program is topnotch which I am happy about seeing as that will be my major and focus point., 251768=Southeastern University has many different dining options for their on-campus students. They have many different options for different students. One specific on-campus dining area is the Portico Coffeehouse. It was recently opened in 2013, and all of the money goes to support mission trips around the world.}",
    "textBeforeTable": "06/06/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 23 out of 23 people found this review useful. 1 of 67 Victoria from Ocala, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp =",
    "textAfterTable": "Will enjoy being here Southeastern has a Beautiful campus, a cafeteria that looks like a restaurant, and dorms that are new and gorgeous! All rooms have room cleaning service for free. Laundry is also free. Everyone I met was friendly and eager to help. The students were cheerful and nice. It was one of the most welcoming schools I have visited. It had a pleasant Christian Atmosphere and felt safe and home-like. The campus is a beautiful area surrounded by lakes and huge oak trees and fountains. Southeastern is planning to build a new Preforming arts center and Library to math the Mediterranean style of their new buildings. Will learn a lot All the professors seemed very knowledgeable and are dedicated to their work. They have a passions for helping students grow. Login to rate or flag the reviews Savannah from LaBelle, FL 10/25/2009 Reviewer is Researching this school. Reviewer has been to campus. 16 out of 16 people found this review useful. 3 of 67",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}