{
    "relation": [
        [
            "Patent application number",
            "20110273325",
            "20140112103"
        ],
        [
            "Description",
            "RADAR SYSTEM AND ANTENNA WITH DELAY LINES AND METHOD THEREOF - A radar system, apparatus, and method includes at least one radar transmitter for transmitting an electromagnetic waveform; a receiving antenna comprising a plurality of receiving antenna elements and delay lines, each of the plurality of receiving antenna elements receiving the return signal operatively associated with a predetermined delay line; each delay line having a delay length which produces a different phase delay in the return signal; the different phase delays producing substantially different antenna patterns for the received signal at a given frequency; at least one processor operatively connected to receive data from the plurality of delay lines; the at least one processor operating to analyze the substantially different beam patterns for a given frequency; whereby the processing of the data produces results indicating the presence and location of a target.",
            "METHOD AND SYSTEM FOR MOTION COMPENSATED TARGET DETECTION USING ACOUSTICAL FOCUSING - An improved method and system for removing time-varying Doppler shifts and the effects of turbulence from data comprising at least one processor operating to estimate the average instantaneous frequency; reduce or remove noise from the state space variables estimates describing the frequency of the target; compensate for the motion of the target to obtain motion compensated data and increase the coherency of the data, and reduce or remove the noise from the state space variables describing the frequency of the target using a filter or smoother. Alternately, the method and system may comprise at least one processor operating to estimate the average instantaneous frequency of the first harmonic of a moving target; the average instantaneous frequency being inputted into an error reduction subroutine; using state space estimates of the frequency, calculating a time warping to remove the effect of the Doppler shift; and focusing the data using a modified PGA."
        ],
        [
            "Published",
            "11-10-2011",
            "04-24-2014"
        ]
    ],
    "pageTitle": "Goldman, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/goldman-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00126-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 435843587,
    "recordOffset": 435808858,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Geoffrey Howard Goldman, Ellicott City, MD US //]]> BarDraw('2692249',['Patent applications by Geoffrey Goldman, Ellicott City, MD US'],[[1,1,1]],['2010','2011','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2692249\" align=\"center\"></div> </div> <canvas id=\"bg2692249\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Geoffrey Goldman, Ellicott City, MD US</p> <div class=\"bar2692249\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>08-21-2014</td> <td><a href=\"/patents/app/20140232598\">RF SYSTEM WITH INTEGRATED PHASE SHIFTERS USING DUAL MULTI-PHASE PHASE-LOCKED LOOPS</a> - An RF system comprising of outputs to an electronically scanning antenna for radiating electromagnetic energy; at least one waveform generator; two multiphase phase-locked loops integrated with the waveform generator, the phase locked loops operating to provide multiple shifted phases to a waveform. Optionally, the two multiphase phase-locked loops may each be divided down by a bank of frequency dividers to further increase the number of phase shifts. The phases generated from each multiphase phase-locked loops are selected with multiplexers then mixed together. These upper or lower sidebands are then mixed with the up converted waveform which results in a phase shift for the waveform associated with each antenna element.</td> <td>20140232598</td> <tr> </tr> <td>01-13-2011</td> <td><a href=\"/patents/app/20110006944\">COMPUTATIONALLY EFFICENT RADAR PROCESSING METHOD AND SYTEM FOR SAR AND GMTI ON A SLOW MOVING PLATFORM</a> - A method and system for processing radar data obtained from a platform which is subjected to non-uniform movement, the distance the platform travels during the formation of an image comprising an aperture; the system comprising software programming for performing a subroutine for building up",
    "textAfterTable": "Gordon K. Goldman, Metairie, LA US Patent application number Description Published 20090152163 SYSTEM FOR TREATING PETROLEUM AND PETROCHEMICAL SLOP OIL AND SLUDGE WASTES - An initial chemical composition comprising selected surfactants, dispersants, and degreasers that liquefy, disperse, demulsify, degrease, inhibit corrosion and scale formation, and lower the pour point of a petroleum, coal, Fischer-Tropsch synthesized, or naturally occurring paraffin-based wax and asphaltene. Such a product is capable of converting crystalline wax (paraffin) in, for example, slop oil into an amorphous form of wax at room temperature, allowing the wax to be dissolved in, for example, crude oil without the need for heating, and maintaining it in solution at room temperature, substantially reducing, indeed in some applications, preventing, for example, wax build-up in pipelines, processing and transportation equipment, etc., and the recovery of the hydrocarbons in the slop oil. In a second aspect of the invention, the pre-blend addition of a hydrotrope-demulsifier, a chelating agent and a wax plasticizer can result in a BS&W of zero for the recovered hydrocarbon blend. 06-18-2009 20110174695 PROCESSES FOR RECYCLING SAG-D PROCESS WATER AND CLEANING DRILL CUTTINGS - A method of treating slop oil and slops from the SAG-D (steam assisted gravity-drainage) very heavy oil-bitumen crude oil production in such locations as Alberta and Saskatchewan provinces in Canada, Russia, Venezuela, Saudi Arabia, and Kern County, Calif., involves mixing the slop oil and slops with chemicals to help separate out water from the slop",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}