{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Find an affordable college with the name of your state in it.",
            "Great class schedules, lack of great instructors."
        ]
    ],
    "pageTitle": "Keiser University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Keiser-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00198-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891088495,
    "recordOffset": 891004147,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{526722=© 2015, Cappex.com, LLC, 352072=May be pricey but they help you find funding and assist in finding work. out of pocket expenses are different for each person., 336028=I will see when I start in June., 400192=OK SO THIS ISN'T LIKE YOUR RUN OF THE MILL COMMUNITY COLLEGE. THIS IS A PRIVATE INSTITUTION. THE COST FOR TUITION IS SUPER EXPENSIVE EVEN IF YOU QUALIFY TO RECEIVE FINANCIAL AID AND STUDENT LOANS. IT COST NEARLY $2000 PER CLASS. SO THIS IS A MOTIVATING FORCE TO TRY YOUR HARDEST TO PASS EACH CLASS. WHO CAN AFFORD TO JUST THROW AROUND A COUPLE OF GRAND?, 466883=I walked into Keiser University recently in December of 2013, having a wishful dream to attend their IT program; the best IT program in the U.S. With their support and encouragement they had me believing this dream Ã?Â¢Ã?Â?Ã?Â?as mineÃ?Â¢Ã?Â?Ã?Â?, Ã?Â¢Ã?Â?Ã?Â?belonging to meÃ?Â¢Ã?Â?Ã?Â? and Ã?Â¢Ã?Â?Ã?Â?already in my possessionÃ?Â¢Ã?Â?Ã?Â?. I have just completed my first monthly PC course and thank them for a dream come true., 296696=Classes start February 4!, 138014=Excellent. They helped me through the TEAS test process and I am scheduled to meet with financial aid in July. Everybody there has been very supportive and helpful., 207859=I have been a student here since 1990. I am working on my 4th degree. I love this school.}",
    "textBeforeTable": "02/10/2011 Reviewer is A past student here. 7 out of 7 people found this review useful. 1 of 144 lucy from opalocka, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code",
    "textAfterTable": "Bang for the buck We did things hands on, therefore we needed a variety of tools like fingerprint powder, evidence bags, cameras etc. The cameras alone cost a fortune! We were the only school that had the opportunity to use the cameras and learn about properly taking images for crime scenes. Definitely a bang for my buck! Did enjoy being here We did TONS of hands on work and we visited places like the county morgue, county jail, county crime lab, etc. This further enhanced my knowledge of the field. Did learn a lot I learned everything from fingerprinting to using the right tools for analyzing, collecting and preserving evidence. I also learned about police protocol, and the dangers that can occur on the job and how to avoid being in a hazardous situation. Login to rate or flag the reviews Victoria from Daytona Beach, FL 05/12/2011 Reviewer is A current student here. 6 out of 6 people found this review useful. 2 of 144",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}