{
    "relation": [
        [
            "Patent application number",
            "20130268271",
            "20130282374"
        ],
        [
            "Description",
            "SPEECH RECOGNITION SYSTEM, SPEECH RECOGNITION METHOD, AND SPEECH RECOGNITION PROGRAM - A speech recognition system has: hypothesis search means which searches for an optimal solution of inputted speech data by generating a hypothesis which is a bundle of words which are searched for as recognition result candidates; self-repair decision means which calculates a self-repair likelihood of a word or a word sequence included in the hypothesis which is being searched for by the hypothesis search means, and decides whether or not self-repair of the word or the word sequence is performed; and transparent word hypothesis generation means which, when it is decided that the self-repair is performed, generates a transparent word hypothesis which is a hypothesis which regards as a transparent word a word or a word sequence included in a disfluency interval or a repair interval of a self-repair interval including the word or the word sequence.",
            "SPEECH RECOGNITION DEVICE, SPEECH RECOGNITION METHOD, AND SPEECH RECOGNITION PROGRAM - A speech recognition device has: hypothesis search means which searches for an optimal solution of inputted speech data by generating a hypothesis which is a bundle of words which are searched for as recognition result candidates; self-repair decision means which calculates a self-repair likelihood of a word or a word sequence included in the hypothesis which is being searched for by the hypothesis search means, and decides whether or not self-repair of the word or the word sequence is performed; and transparent word hypothesis generation means which, when the self-repair decision means decides that the self-repair is performed, generates a transparent word hypothesis which is a hypothesis which regards as a transparent word a word or a word sequence included in an un-repaired interval related to the word or the word sequence, and the hypothesis search means searches hypotheses for an optimal solution, the hypotheses including as search target hypotheses the transparent word hypothesis generated by the transparent word hypothesis generation means."
        ],
        [
            "Published",
            "10-10-2013",
            "10-24-2013"
        ]
    ],
    "pageTitle": "Okabe - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/okabe-6/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00096-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 425564003,
    "recordOffset": 425524297,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Koji Okabe, Minato-Ku JP 04-25-2013 CASING OF CAPSULE ENDOSCOPE, CAPSULE ENDOSCOPE KIT, ASSEMBLY METHOD OF CAPSULE ENDOSCOPE KIT AND ASSEMBLY DEVICE OF CAPSULE ENDOSCOPE KIT - An inner casing according to the present invention includes a hole which is a holding portion that is provided at the center of a base portion having a planar shape so as to protrude in a direction orthogonal to a principal surface of the base portion and hold a capsule endoscope and a plurality of step portions each protruding from a side surface of the hole and abutting on an area of an outer surface of a hemispheric dome portion, which is located inside an optical viewing angle of the capsule endoscope and which does not contribute to generation of an image captured by the capsule endoscope to realize alignment in a longitudinal direction of the capsule endoscope. 20130102844 Published Description Patent application number Kentaro Okabe, Tokyo JP Kensuke Okabe, Sakai-City JP 06-21-2012 OPTICAL MEASURING DEVICE - In an optical measuring device, the visual observation section includes: a white light source which emits white light; a first objective lens arranged between the white light source and measurement object, through which the white light emitted from the white light source and return light from the measurement object transmit; a plurality of tube lenses which change a magnification of the return light passing through the first objective lens to a predetermined",
    "textAfterTable": "Kojiro Okabe, Wako JP Patent application number Description Published 20120086225 FRONT VEHICLE BODY STRUCTURE - A front vehicle body structure includes, on each of left and right sides, a front side frame, an upper member, a frame connecting member, an impact absorbing mechanism. The impact absorbing mechanism has a closed cross-sectional shape in frontal view of a vehicle. The impact absorbing mechanism includes an external wall and an internal wall. The external wall is substantially straight with respect to an upper internal wall of the upper member such that the frame connecting member is disposed therebetween. The internal wall has a shape in which at least a front portion of the internal wall between a central portion of the internal wall in its longitudinal direction and the bumper beam is obliquely bent outward. 04-12-2012 Makoto Okabe, Chofu-Shi JP Patent application number Description Published 20140012853 SEARCH DEVICE, SEARCH METHOD, SEARCH PROGRAM, AND COMPUTER-READABLE MEMORY MEDIUM FOR RECORDING SEARCH PROGRAM - A search server includes an extracting unit that extracts a search target matching a search condition based on profile data, and a transmitting unit that transmits the search target to a user terminal. The search condition includes a first frequency of appearance for each of one or more specified topics specified by a user in a first specified period and a second frequency of appearance for each of the specified topics",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}