{
    "relation": [
        [
            "Inspection Date",
            "September 1981",
            "1986 [Inspected in 1986; the month is not known]",
            "[Inspection date is not known]"
        ],
        [
            "Enter",
            "‡r 198109",
            "‡r 1986--",
            "‡r ------"
        ]
    ],
    "pageTitle": "007 Motion Picture",
    "title": "",
    "url": "http://www.oclc.org/bibformats/en/0xx/007motio.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00043-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 616821083,
    "recordOffset": 616796050,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{63487=1986, 65263=This page last revised: December 2, 2013, 55355=Imbibition dye transfer prints. Film color prints created by the transfer of two or more differently colored dye images to a single strip of blank film. The dye transfer process was used only to produce prints. Imbibition dye transfer prints can be produced from film originally shot on either multi-strip or multi-layer film. The process was used only by the Technicolor Company from ca. 1928 to ca. 1975. The patents were sold to the People's Republic of China, and since ca. 1980, the process has been available only in China., 56391=Three layer stock, low fade. Color film stock with three layers of emulsion: cyan, magenta, and yellow. Each layer is sensitive to its own primary color and stabilized to reduce color fading as much as possible. It has been available since ca. 1983., 48326=2 strip color. A color system in which two strips of film, one to record red light and one to record blue, were run through the camera simultaneously and exposed through the base of the front piece of film. These two strips of negatives were then used to produce prints of duplitized film stock (film stock with emulsion on both sides of the base), with a red-dyed image on one side, and a blue-dyed or -toned image on the other. Although extensively used in early color film processes, the inherent inability of two components to reproduce the visible color spectrum rendered all such systems obsolete when three-color processes became readily available. The process used from about 1929 to about 1950 by, among others, the following companies: Cinecolor, Magnacolor, and Multicolor., 65733=© 2015 OCLC Domestic and international trademarks and/or service marks of OCLC Online Computer Library Center, Inc. and its affiliates, 42371=Nitrate base. A cellulose nitrate film base. Cellulose nitrate support or base was used in the manufacture of 35 mm film (and some 17.5 mm film) until 1951. Nitrate base film is no longer manufactured. Nitrate film is highly flammable. It does not meet the requirements for safety base film., 45876=2 color, single strip. A color system in which a single strip of film was exposed with pairs of images by means of a beam-splitter prism. One of the pairs of images was exposed through a red filter and one through a green filter. The resulting negative was used to produce both prints consisting of two strips cemented together, and, later in the history of the process, two color dye transfer prints. Also known as red and green Technicolor, the process was used exclusively by Technicolor and had its heyday between 1922 and 1933, although it was used until 1936 for animated cartoons., 43913=Safety base, triacetate. A cellulose triacetate film base. Cellulose triacetate is a high acetal compound with very low flammability and slow burning characteristics. From 1951, triacetate has been used for professional as well as amateur produced moving image film., 19713=Anamorphic (wide-screen). Films that achieve the wide-screen effect through the use of an image that is optically compressed or squeezed horizontally. It is then expanded to the correct proportions by projection on a wide screen with the use of special lenses that give greater magnification laterally than vertically. Introduced and adopted for commercial use in 1953 under the name of CinemaScope, followed by Techniscope (1963), Naturama, Panavision, Grandscope, Megascope, etc. Also used for 16 mm film that employs this process., 21006=Standard silent aperture (full frame). Use for 35 mm film on which the exposed picture is approximately the width of the space between the perforation holes of the frame. Standard format for silent film from about 1899 until the late 1920s when sound film was introduced and the frame size decreased to make room for the sound track.}",
    "lastModified": "Mon, 27 Jul 2015 16:30:40 GMT",
    "textBeforeTable": "Primarily for archival use. Six characters that indicate the most recent film inspection date; the date is recorded in the pattern yyyymm (year/month). The film inspection date may be the date the item was cataloged or the date it was viewed. A hyphen is used for any unknown portion of the date. If the date is completely unknown, six hyphens are recorded. ‡r Film inspection date Unknown. The completeness of the motion picture is not known. u Not applicable. Use when completeness is not applicable to the type of motion picture, e.g., home movies, unedited footage, outtakes, and in some cases, unidentified material, etc. n Incomplete. The motion picture being cataloged is judged to be incomplete. i Complete. The motion picture being cataloged is judged to be complete. c Primarily for archival use. Use to indicate whether the motion picture being cataloged is judged to be complete. ‡q Completeness Non-nitrate: disaster. Used to record deterioration of non-nitrate materials (safety film, etc.) in its final stages. m Non-nitrate: advanced deterioration. Used to record deterioration of non-nitrate materials (safety film, etc.) in its advanced stages. l Non-nitrate: detectable deterioration. Used to record deterioration of non-nitrate materials (safety film, etc.) in its early",
    "textAfterTable": "Indexing For indexing and searching information, see Searching WorldCat Indexes, field 007. For information on the relation of material types to RDA terms and codes, see Searching WorldCat Indexes, RDA Terms and Codes. For information on material type indexing in various OCLC services, see Searching WorldCat Indexes, Material Type (includes links in Notes row to RDA terms and codes and Format or Document codes and values). For information on material type names and codes (based mainly on the Leader, 006, 007, 008), see Searching WorldCat Indexes, Material Type Names and Codes. Printing Field 007 does not print. This page last revised: December 2, 2013 © 2015 OCLC Domestic and international trademarks and/or service marks of OCLC Online Computer Library Center, Inc. and its affiliates",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}