{
    "relation": [
        [
            "Date",
            "Feb 18, 2004",
            "Mar 8, 2005",
            "Dec 30, 2005",
            "Feb 29, 2012",
            "Mar 13, 2012",
            "Jan 28, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: PROPAGATE NETWORKS INC., MASSACHUSETTS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:BACKES, FLOYD;VACON, GARY;CALLAHAN, PAUL;AND OTHERS;REEL/FRAME:014995/0426 Effective date: 20040217",
            "Owner name: AUTOCELL LABORATIES, INC.,MASSACHUSETTS Free format text: CHANGE OF NAME;ASSIGNOR:PROPAGATE NETWORKS, INC.;REEL/FRAME:015743/0534 Effective date: 20050217",
            "Owner name: AUTOCELL LABORATORIES, INC.,MASSACHUSETTS Free format text: SECURITY AGREEMENT;ASSIGNOR:HOLMAN, III, ALBERT A., AS AGENT FOR THE LENDERS;REEL/FRAME:017382/0502 Effective date: 20051028",
            "Owner name: AUTOCELL LABORATORIES, INC., MASSACHUSETTS Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:HOLMAN, ALBERT A., III;REEL/FRAME:027781/0447 Effective date: 20120228",
            "Owner name: AUTOCELL LABORATORIES, INC., MASSACHUSETTS Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:HOLMAN, ALBERT A., III;REEL/FRAME:027851/0628 Effective date: 20120228 Owner name: PICCATA FUND LIMITED LIABILITY COMPANY, DELAWARE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:AUTOCELL LABORATORIES, INC.;REEL/FRAME:027852/0201 Effective date: 20120224",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7774013 - Program for adjusting channel interference between access points in a ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7774013?dq=5842224",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00141-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 460066091,
    "recordOffset": 459994350,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6445=In FIG. 58 there is shown one mechanism that can be used by the processor in the implementations of either FIG. 56 or FIG. 57 to maintain the short and long term averages needed to perform the process of FIG. 55 to ascertain movement. Two ring buffers 652 and 654 are maintained—one for the short term average and one for the long term average. Ring buffers are used so that power sample averaging can be accomplished over a sliding window in time. In a ring buffer, as a new sampled is added to the buffer, the oldest sample is removed. In the wireless networking example previously described, the short term average ring buffer stores the most recent 16 samples, and the long term average ring buffer stores on the order of 1024 or 2048 samples. Of course these sample sizes will vary depending on the application. It may also be reasonable to use an accumulator-based average for the long term average, but such an approach could be subject to buffer overflow.}",
    "TableContextTimeStampAfterTable": "{57405=Priority is claimed to the following U.S. Provisional patent applications which are incorporated by reference: 60/449,602 filed Feb. 24, 2003; 60/466,448 filed Apr. 29, 2003; 60/472,320 filed May 21, 2003; and 60/472,239 filed May 21, 2003., 269868=The preferred implementation for the current wireless network example thus utilizes: (a) a short term average over N1=16 samples, (b) a long term average over 2048 samples, and (c) “N2” which is the number of samples taken so far in computing the long term average. The process is as follows:}",
    "textBeforeTable": "Patent Citations While the invention is described through the above exemplary embodiments, it will be understood by those of ordinary skill in the art that modification to and variation of the illustrated embodiments may be made without departing from the inventive concepts herein disclosed. Moreover, while the preferred embodiments are described in connection with various illustrative program command structures, one skilled in the art will recognize that the system may be embodied using a variety of specific command structures. Accordingly, the invention should not be viewed as limited except by the scope and spirit of the appended claims. Those skilled in the art should readily appreciate that programs defining the functions of the present invention can be delivered to a computer in many forms; including, but not limited to: (a) information permanently stored on non-writable storage media (e.g. read only memory devices within a computer such as ROM or CD-ROM disks readable by a computer I/O attachment); or (b) information alterably stored on writable storage media (e.g. floppy disks and hard drives). It will be understood that each block of the flowchart illustrations, and combinations of blocks in the flowchart illustrations, can be implemented by computer program instructions. These computer program instructions may be loaded onto a computer, embedded device microprocessor (such as that found in an AP or STA), or other programmable data processing apparatus to produce a machine, such that the instructions which",
    "textAfterTable": "US5963848 Apr 24, 1996 Oct 5, 1999 Motorola, Inc. Method and apparatus for assigning a channel to a mobile unit in a wireless communication system US5987062 Dec 15, 1995 Nov 16, 1999 Netwave Technologies, Inc. Seamless roaming for wireless local area networks US6029074 May 2, 1997 Feb 22, 2000 Ericsson, Inc. Hand-held cellular telephone with power management features US6111867 Dec 12, 1997 Aug 29, 2000 Nortel Networks Limited Method and apparatus for load shedding in a TDMA packet data system US6131015 * Apr 1, 1996 Oct 10, 2000 Motorola, Inc. Two-way communication system for performing dynamic channel control US6144855 Jul 7, 1997 Nov 7, 2000 Marconi Communications Israel Ltd. Methods and apparatus pertaining to roaming of stations between access points in wireless and other networks US6157626 Jun 6, 1997 Dec 5, 2000 Ntt Mobile Communications Network Inc. Cell selection scheme for CDMA mobile communication system using perch channel transmission attenuation US6198924",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}