{
    "relation": [
        [
            "Start Date",
            "[ 1918 Apr ]",
            "1905 Jan 16",
            "1902 Mar 31 ± 30 days",
            "1886 May 19 (?)",
            "[ 1885 Oct ]",
            "1882 Sep 9",
            "1878 Oct 14 (?)",
            "1870",
            "1858",
            "1854 Feb",
            "1852",
            "1849",
            "1764",
            "1736",
            "[ 1609 ]",
            "1605",
            "1578 Feb",
            "1524",
            "1100 ± 50 years",
            "0800 BCE ± 50 years",
            "2550 BCE ± 300 years"
        ],
        [
            "Stop Date",
            "[ Unknown ]",
            "1905 Jan 21",
            "Unknown",
            "1887 (?)",
            "[ Unknown ]",
            "Unknown",
            "Unknown",
            "Unknown",
            "1866",
            "1854 Mar",
            "Unknown",
            "Unknown",
            "Unknown",
            "Unknown",
            "[ Unknown ]",
            "1606",
            "Unknown",
            "Unknown",
            "Unknown",
            "Unknown",
            "Unknown"
        ],
        [
            "Eruption Certainty",
            "Uncertain",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Uncertain",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Uncertain",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed"
        ],
        [
            "VEI",
            "1",
            "2",
            "2",
            "2",
            "1",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "",
            "4",
            "2",
            "3",
            "",
            "4",
            ""
        ],
        [
            "Evidence",
            "",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Radiocarbon (uncorrected)",
            "Radiocarbon (uncorrected)",
            "Radiocarbon (uncorrected)"
        ],
        [
            "Activity Area or Unit",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Global Volcanism Program | Momotombo",
    "title": "",
    "url": "http://volcano.si.edu/volcano.cfm?vn=344090",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00064-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 256588111,
    "recordOffset": 256543966,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{89194=01/1982 (SEAN 07:01) Constant small plume, 31318=Instituto Nicaraguense de Estudios Territoriales (INETER) reports from March 2002 through September 2003 indicate that seismicity has generally been low. Occasional visits to the summit of Momotombo (figure 10) are made to sample gases and take temperature measurements., 52011=Fumarole chemistry and temperature data for 1983 and 1995, 108322=Epicenters from the November 2004 swarm clustered along the W edge and S side of the Monte Galán caldera, less than 7 km NW of Momotombo’s summit. Focal mechanisms were calculated from these events and suggested inverse, E-W faulting. The highest-quality events of the swarm were aligned with a shallow, SE-trending fault that is known to run between Monte Galán caldera and Momotombo. Seismicity occurred at or above 7 km depth, and the fault plane was defined as steeply dipping W., 88853=08/1982 (SEAN 07:08) Small vapor plume and incandescence in summit crater, 86674=09/1993 (BGVN 18:09) Strong fumarolic activity but temperatures decline, 82309=The summit crater fumaroles remained very hot in late 1980 with temperatures measured up to 735°C and reported to > 900°C. A small vapor plume continued and remote sensing revealed very low rates of SO2 emission. Portions of the crater were seen to glow red and orange when observed at night, with the highest temperatures on the steep S wall of the crater. No seismic activity has occurred recently at Momotombo., 107791=Tornillo earthquakes and rare VT events recorded in 2005. According to INETER, activity at Momotombo was limited to variable seismicity; no visible changes were observed and thermal measurements (from satellite remote sensing) did not indicate change at the summit fumaroles. Tremor was recorded from the volcano throughout the year and consistently measured at 5 RSAM. Volcano-tectonic events (VT) were rarely recorded, and appeared only in records from February, March, and May., 67448=On 30 May Momotombo was monitored with three sensitive portable seismographs. Three microearthquakes were recorded, one of which was detected by all three instruments, and was located at 12.455°N, 86.547°W at 1.27 km depth. Fumarole temperatures remained high (table 2), but were slightly lower than the 895°C measured in August 1984., 66638=Further Reference. Menyailov, I.A., Nikitina, L.P., Shapar, V.N., and Pilipenko, V.P., 1986, Temperature increase and chemical change of fumarolic gases at Momotombo volcano, Nicaragua, in 1982-1985: Are these indicators of a possible eruption?: JGR, v. 91, no. B12, p. 12199-12214., 76232=\"Temperatures of the crater fumaroles, measured on 13 March, were as high as 800°C. Heating has occurred since December 1981, but it was not apparent whether this was a result of dry-season effects or was a true increase in heat. A small gas plume was continuously emitted.\", 106205=The above-mentioned June seismic swarm preceded a gas explosion at Momotombo’s summit. At ~0815 on 12 June a small, low plume was captured via a web camera (figure 13). This camera had been installed that year on the roof of the Universidad Nacional Autónoma de Nicaragua (UNAN), León, 40 km W of the volcano. Gas emissions persisted for 40 minutes. The explosion did not appear as a thermal anomaly in satellite data. In their 2006 annual report (available online), INETER released composite plots of RSAM (Momotombo’s daily average seismicity) and thermal anomaly temperatures as recorded by NOAA’s Advanced Very High Resolution Radiometer (AVHRR) satellite., 84239=09/2003 (BGVN 28:09) Some seismic swarms and tornillos; stable fumarole temperatures, 87544=02/1989 (SEAN 14:02) Numerous incandescent fumaroles seen at night; large areas of hot ground, 96618=Table 6. Temperatures measured from Momotombo’s summit fumaroles from 2000 to 2011. Ten of the fumarole sites labeled in figure 12 appear here with coordinates. Courtesy of INETER., 91559=References. NASA Landsat Program (2003) Landsat ETM+ scene 7dk20060915, SLC-Off, USGS, Sioux Falls, Sept. 15, 2006., 46903=During summit area visits on 30 October and 29 November, measured fumarole temperatures ranged from 215 to 643°C and from 130 to 677°C, respectively (figure 5). Fumarole temperatures on 29 November were generally higher than those on 30 October but lower than those in April 1996 (BGVN 21:04). These fumarole temperature variations were mainly believed to be due to seasonal changes. An intense rainy season, especially in October, caused strong erosion of the crater, and might account for the lower fumarole temperatures measured on 30 October., 74810=A small vapor plume was still being emitted in August and incandescence could be seen in the summit crater. The maximum fumarole temperature was 825°C . . . . Tremor and small-magnitude discrete earthquakes continued., 68238=Summit fumarole temperatures have remained high, with small fluctuations probably related to seasonal rainfall variations. The maximum temperature in 1984 was 895°C in August; the same fumarole had a temperature of 875°C when measured in 1985., 58052=Fumarolic activity in the crater remained strong and a large steam plume was observed continuously during the first week of September. Temperatures measured during a crater visit on 6 September ranged from 200-604°C. Fumarole temperatures are 100-300°C cooler that those reported in the 1980's. Native sulfur deposits were associated with low-to-moderate temperature fumaroles, while cavities of high-temperature vents were lined with a black mineral tentatively identified as magnetite. A strong SO2 odor permeated the air., 40397=Elevated temperatures were also reported in March 1998 (BGVN 23:03). Measurements during a 28 February visit revealed higher-than-normal fumarolic temperatures in the summit area. The high temperatures were again associated with a recent period of aridity, during which time fumarolic activity increased. Temperatures ranged from 318 to 748°C., 101266=Field investigations were conducted by INETER on 20 August 2008. The team did not reach the summit of Momotombo but visited the local seismic station (on the S flank) and a cluster of fumaroles nearby. Three sites were measured with a digital thermometer yielding ~100°C values., 70446=\"During the initial period of observations (27 March-5 April) a gradual temperature rise from 851° to 858°C was noted, as well as a negligible increase in H2O and a more appreciable increase in reduced gases (H2S, H2, and CO). The seismic station registered volcanic tremor that appeared 17 March and stopped 4 April. When the tremor disappeared the temperature of fumarole N 9 immediately fell sharply, dropping 15°C in 4 days and continuing downward to 815°C by 22 April (figure 2). Simultaneous with the falling temperature, an increase in H2O content from 94.1 to 96.7 mole % and decreasing proportions of CO2, H2, CO, and other gases were registered. After 15 April the H2O content gradually decreased, reaching previous values at the end of April. The concentrations of other gases also reached previous values by that time., 104060=A second swarm in 2006 occurred in late December. During 27-30 December, 52 earthquakes were recorded, 17 of which were located with ML 1.4-3.5., 88086=05/1985 (SEAN 10:05) Continued high fumarole temperatures, 108790=INETER reviewed Momotombo’s significant seismic swarms in a special report accompanying the November 2004 swarm notice. They noted that previous swarms had occurred in 1996, 1998, 1999, and 2000. Seismic swarms were generally short-lived, lasting several days at most. Based on INETER’s plots of earthquake counts versus time, data binned by month suggested that one to two months of increased seismicity preceded these swarms., 30391=The first visit during this time period was on 13 April 2002. Temperature measurements in the crater fumaroles showed little variation from previous measurements, except for fumarole 14, which showed an increase from 434 to 583°C. There were no visits in May; seismic monitoring recorded only one earthquake., 37675=Seismicity remained stable between November 1999 and April 2000. In May 2000 a seismic swarm began near the volcano, and in June there was heightened seismicity., 116209=INETER reported one seismic swarm in May 2003 (BGVN 28:09) with several events strong enough to shake the geothermal facility located on the shore of Lake Managua (star near lake on figure 11). Low seismicity and low-amplitude tremor prevailed in September 2003 (BGVN 28:09). These conditions continued through year’s end with significant, located earthquakes that were consistently shallow, 1-12 km below sea level (table 5)., 49343=The 10 April earthquake was strongly felt at the geothermal power plant (30 MW), 5 km SW of the crater and <4 km from the epicenter. All but 12 people were evacuated from the power plant, which produces a considerable percentage of Nicaraguan electricity. Afterwards, until 0900 on 11 April, there were ~500 small events registered. On 11 April at 1600, some stronger events with magnitudes of about 3 were again recorded. All seismic events were impulsive, with frequencies of ~10 Hz, and very shallow. Small-amplitude tremor events lasted between some minutes and several hours. An overflight on 11 April to take photos and a video revealed no significant changes in the crater., 85346=07/1997 (BGVN 22:07) June fumarole temperatures, 33539=The seismic swarm that began in May 2000 reached its peak during 9-11 June when the INETER seismic network registered over 500 earthquakes (BGVN 25:06). Many of the earthquake magnitudes were between 3.4 and 4.1, and the small epicentral area was directly under a geothermal plant on the S slope of the volcano. INETER reported that prior to the seismic activity, in March 2000, seismicity was low, with only two seismic events during the month. They did not visit the volcano during March., 89712=03/1981 (SEAN 06:03) Small continuous plume, 117082=Summit explosion on 12 June 2006; ~10 seismic swarms detected during 2003-2011, 89882=01/1981 (SEAN 06:01) Small continuous vapor plume, 84034=02/2012 (BGVN 37:02) Summit explosion on 12 June 2006; ~10 seismic swarms detected during 2003-2011, 75917=Further Reference. Menyailov, I.A., Nikitina, L.P., Shapar, V.N., Grinenko, V.A., Buachidze, G.I., Stoiber, R., and Williams, S., 1986, The chemistry, metal content, and isotope composition of fumarolic gases from Momotombo volcano, Nicaragua, in 1982: Volcanology and Seismology, no. 2, p. 60-70., 84996=06/1999 (BGVN 24:06) Fumarole temperatures remain high in April 1999, 90254=07/1980 (SEAN 05:07) Fumarole temperatures measured, 77012=\"A very small plume was continuously emitted in late December and early January.\", 55676=Fumarole temperatures increased between 1976 and 1986, reaching >900°C in August 1986. Temperatures were in the 870-885°C range from January 1985 through April 1986 (SEAN 10:11 and 11:05). Similar temperatures were measured in March and April 1989 (SEAN 14:02 and 14:04), but had decreased 50-150°C by April 1990 (BGVN 15:04). Temperatures have now returned to the level observed in 1977., 45117=June fumarole temperatures, 87000=02/1991 (BGVN 16:02) Fumarolic activity declines, 88659=11/1982 (SEAN 07:11) Continued heating of the fumarole field, 48633=Crater fumarole temperatures reported by Alain Creusot have remained unchanged for the past year. During the last three inspections (25 February, 11 April, and 16 April) the maximum temperature was ~770°C. The six areas of fumarolic activity measured in April had temperatures ranging from 375 to 768°C (figure 4)., 41530=Fumarole temperatures have been rising on Momotombo since 1996. An April 1996 summit visit reported that temperatures were unchanged over the past year (BGVN 21:04), but by November of that year the temperatures had begun to fluctuate (BGVN 21:11). Fumarole temperatures in November 1996 registered between 130 and 677°C, higher than those recorded in October but lower than those in April. The flux was attributed to seasonal change; an intense rainy season and associated erosion accounted for the October lows. Temperatures had increased again by July 1997 to 232-773°C (BGVN 22:07)., 63525=During a 4-5 March visit, incandescence from numerous fumaroles was visible at night. A maximum gas temperature of 873°C was measured by thermocouple. Surface temperatures measured by both infrared thermometers - Minolta Cyclops 33 (bandpass 8-14 µm, 1° field of view) and Cyclops 52 (bandpass 0.8-1.1 µm, 0.33° field of view) - dropped considerably beyond vent edges, but large areas of ground were hotter than 100°C. Temperatures are not corrected for emissivity and atmospheric absorption effects., 32325=Information Contacts: Wilfried Strauch and Virginia Tenorio, Dirección General de Geofísica, Instituto Nicaragüense de Estudios Territoriales (INETER), Apartado 1761, Managua, Nicaragua (URL: http://www.ineter.gob.ni/, Email: wil.gf@ineter.gob.ni); Pierre Delmelle, Département de Géologie, Université de Montréal, Montréal, Québec H3C 3J7, Canada (Email: delmellp@ere.umontreal.ca)., 33823=This report discusses previously unreported information about the activity during March and April 2000. This interval of low activity occurred prior to one with heightened seismicity during May and June 2000 (BGVN 25:06)., 45044=Open University researchers provided the following report. \"On 3 June we took gas samples from fumarole numbers 14, 9, and 7 (figure 6). There were many areas with fresh bright yellow sulfur flows, suggesting that temperatures had risen over the last few months thus causing the sulfur to melt. Near fumarole number 6 there were small (centimeter-wide) accumulations of clear, golden molten sulfur. After putting a gas condenser over fumarole number 9 the adjacent fumarolic area began to fracture and molten sulfur began to emerge from fissures there.\", 112771=Remote sensing highlights volcano morphology. Figure 11 (top) contains a natural-color image of Momotombo found on Google Earth in a view that incorporates two images, the one at right containing cloud cover over a portion of the lake. Despite the mosaic issue, the image depicts land-use, vegetation, the location of Puerto Momotombo, and Holocene lava flows. The narrow, NE-trending lineation represents channelized lava flows from Momotombo’s breached summit. Downslope, the lava flows separate into several lobes. This unvegetated rock dates from the 1905 effusive events that also deposited tephra on the flanks (close-up photos and captions are available in the GVP Photo Archive)., 38439=Information Contacts: Wilfried Strauch and Virginia Tenorio, Dirección General de Geofísica, Instituto Nicaragüense de Estudios Territoriales (INETER), Apartado 1761, Managua, Nicaragua (URL: http://www.ineter.gob.ni/, Email: wil.gf@ineter.gob.ni)., 28493=Seismicity increased again in December 2002 and January 2003. A seismic cluster of 88 events was recorded during 24-25 December. Locations determined for 18 of the events put them all very close to the volcano. In January 55 tectonic earthquakes were registered. After January, seismicity dropped considerably. No earthquakes were registered in February, and only one was recorded in March., 37756=Increased seismic activity in June, 27396=A visit was made to the volcano on 12 July 2003; temperatures were similar to the previous months, ranging from 243°C at fumarole 13 to 737°C at fumarole 9. Two earthquakes registered in August; seismicity stayed low through September., 37487=During 9-11 June the INETER seismic network registered over 500 earthquakes near Momotombo, 100 of which were located. Many of the earthquakes were between M 3.4 and 4.1 (figure 8), and occurred at depths less than 5 km. The small epicentral area was directly under a geothermal plant on the S slope of the volcano, between Momotombo's crater and the coast of Lake Managua. A similar area was the site of seismic swarms in past years, with the most recent occurrence in May 2000. Some of the earthquakes on 9 June were felt by the personnel of the geothermal plant 5 km SW of the crater and one was felt by several people in the town of Nagarote. INETER stated that an eruption could affect the geothermal plant's 96 employees, as well as residents of towns bordering the volcano. Continuous seismic tremor was also observed at the volcano, which was attributed to volcanic processes rather than movements at tectonic faults. The number of seismic events began to decrease on 11 June. From 12 to 13 June, 60 earthquakes occurred with seven epicenters located. In comparison, 150 earthquakes occurred from 9 to 10 June with 38 epicenters located. After 13 June the number of earthquakes gradually decreased to normal levels., 87733=05/1986 (SEAN 11:05) Fumarole temperatures decline after heavy rains, 91382=Information Contacts: Instituto NicaragÃ¼ense de Estudios Territoriales (INETER), Apartado Postal 2110, Managua, Nicaragua (URL: http://www.ineter.gob.ni/geofisica/); Global Land Cover Facility (URL: http://http://www.glcf.umiacs.umd.edu/); Washington Volcanic Ash Advisory Center (VAAC), Satellite Analysis Branch (SAB), NOAA/NESDIS E/SP23, NOAA Science Center Room 401, 5200 Auth Rd, Camp Springs, MD 20746, USA (URL: http://www.ssd.noaa.gov/VAAC/)., 89364=12/1981 (SEAN 06:12) Small continuous vapor plume, 84807=03/2000 (BGVN 25:03) Very low seismicity during April-November 1999, 85528=11/1996 (BGVN 21:11) Seasonally varying fumarole temperatures, 86482=10/1993 (BGVN 18:10) Fumarolic activity continues to decrease, 99849=2011 elevated seismicity and two field investigations. INETER reported elevated tremor during most of 2011. From January through April 2011, tremor was reported as high as 50 RSAM. From September to November, tremor ranged from 40 to 45 RSAM. Two significant earthquakes generated interest from local residents near Momotombo and were the subject of ~70 emails sent to the INETER office on 3 June 2011. Only 1 km deep, the two events were ML 0.8 and 1.4 and occurred within ~20 minutes of each other., 39113=Very low seismicity during April-November 1999, 67075=Table 2. Fumarole temperatures at Momotombo, January-October 1985. Courtesy of INETER., 107249=Tornillo-type events dominated the 2005 record, which chiefly consisted of microseismicity. Earthquakes had dominant frequencies of 5-15 Hz and were most frequently recorded during February-April, when an average of ~2,700 events were recorded each month. In May, the station located S of Momotombo’s summit was intermittent, thwarting normal monitoring capabilities. Microseismicity remained low through the rest of the year but reached ~1,000 events in December., 87160=04/1990 (BGVN 15:04) Fumarolic activity, 682=Information Contacts: Instituto NicaragÃ¼ense de Estudios Territoriales (INETER), Apartado Postal 2110, Managua, Nicaragua (URL: http://www.ineter.gob.ni/geofisica/); Global Land Cover Facility (URL: http://http://www.glcf.umiacs.umd.edu/); Washington Volcanic Ash Advisory Center (VAAC), Satellite Analysis Branch (SAB), NOAA/NESDIS E/SP23, NOAA Science Center Room 401, 5200 Auth Rd, Camp Springs, MD 20746, USA (URL: http://www.ssd.noaa.gov/VAAC/)., 102586=Three seismic swarms and a field visit in 2008. INETER reported three small seismic swarms in 2008. They recorded low amplitude tremor and an absence of earthquakes in January. The first seismic swarm occurred less than 3 km below Momotombo’s summit, beginning on 5 February. The small swarm was characterized by events of ML 1.2-1.9., 101455=One other earthquake was reported by local residents in the area of Momotombo. That was when a shallow, ML 2.9 event shook the area on 26 October 2008., 97725=A field investigation with European Union participants was conducted on 26 November 2011. Significant emissions were visible escaping from the crater. In their November report, INETER suggested that meteorological conditions may have contributed to the conspicuous steam; the winds were light at the summit; humidity was relatively low that day. The team also noted that significant cracks were visible in the SE, S, and E sides of the crater rim., 58930=A small gas plume was present on 6-7 January, with no apparent change from previous years., 109421=Seismicity began increasing slowly in September 2004, and in November, a small seismic swarm occurred. That month, more than 80 earthquakes were recorded and were classified as tornillos with dominant frequencies of 6.0-16 Hz. A total of 50 earthquakes were located, and one event was large enough to be felt. On 15 November 2004 an ML 3.4 earthquake shook the area; this was a shallow event (1.5 km below sea level). Approximately 56 earthquakes occurred in December, which were assessed as mostly volcano-tectonic (VT). No significant earthquakes were located in January or February of 2005., 104736=No additional web camera images were available following the 12 June 2006 event, and the camera was officially offline from 2008 through 2011., 53237=Beginning on 11 June, scientists from FIU and INETER deployed a datalogger in the crater to continuously monitor fumarole temperatures and barometric pressure. The team entered the summit crater three times along a trail that crosses an active avalanche chute and leads around to the NE crater rim. Condensate and Giggenbach-type samples were collected from fumaroles along the SW crater wall. These fumaroles were very corrosive, as indicated by the destruction of the datalogger thermocouples, and had temperatures ranging from 238 to 655°C. A voluminous plume was rising from the crater on 13 March., 56217=A crater inspection on the night of 27 October revealed a decrease in the fumarolic activity observed since August. Temperatures had declined at all measured locations in the three main fumarolic areas. The maximum temperature recorded was 562°C, a decrease of 33° since late September. Some small fissures with very weak incandescence were observed in the most active zone in the W crater wall. The maximum temperature was estimated at 580°C, based on the level of incandescence at measured locations., 35638=Julio Alvarez, Jorge Cross, Arming Saballos (all INETER/Vulcanología), and Eduardo Mayorga visited the volcano on 15 June to measure the temperature of fumaroles in the crater zone. Temperature measurements conducted at fumaroles in the volcano's dome yielded values between 255 and 933 °C (figure 9). The highest temperature was found near the N edge of the crater., 29513=Only 16 earthquakes were recorded in July, four of them on 12 July; none were located. Tornillos continued with a frequency of 7.5 Hz in both July and August. Seismicity increased in August with a small seismic cluster and 176 registered earthquakes, mainly volcano-tectonic. The majority of the activity took place on 1 and 2 August, including one event felt by staff at the geothermal plant. Seismicity dropped dramatically in September, October, and November, with 7 and 12 volcano-tectonic events in September and October, respectively, and none in November. Visits were made on 19, 20, 21, and 22 November for gas sampling and temperature measurements. Temperatures were measured in 12 fumaroles and around the seismic stations at the base of the volcano. The highest temperatures were found at fumaroles 3, 4, 5, 8, and 9, with the maximum temperature of 768°C at fumarole 9. Temperatures at the three fumaroles around the seismic station were 89.9°C, 99.1°C, and 90.2°C., 88478=04/1983 (SEAN 08:04) Fumarole temperatures continue to increase, 40801=In October 1997 higher than normal fumarole temperatures were attributed to arid conditions. During a 1 September visit to the summit area, fumarole temperatures were measured at their usual points and found escalated. The maximum temperature was 740°C. Because the temperature increase coincided with a dry spell, the heightened fumarolic activity was not deemed alarming., 84619=06/2000 (BGVN 25:06) Increased seismic activity in June, 73052=Fumarolic activity increased over that of 1981, especially in the S part of the crater. Temperatures continued to increase, reaching 855°C in March . . . . Seismographs recorded magmatic movement but no discrete earthquakes., 73977=Continued heating of the entire fumarole field has been observed in late 1982. No significant volume change has occurred in the small plume of volcanic gas released continuously. Seismic activity remained at low levels., 87908=11/1985 (SEAN 10:11) Fumarole temperatures during 1985, 103878=One earthquake swarm and new summit features observed in 2007. Activity at Momotombo in 2007 was characterized by minor seismicity. Few events were located and low-level tremor was recorded throughout the year. A small seismic swarm occurred in late January when 90 events were recorded. On 31 January the largest events of the swarm registered ML 2.2-3.1 and depths of five earthquakes were calculated., 106751=Two seismic swarms and an explosion in 2006. Throughout 2006, INETER reported that tremor again remained constant at 5 RSAM. Registered earthquakes were variable; 447 registered in January; 62 events in June, but during most of the year, less than 10 earthquakes per month were recorded. Two small earthquake swarms occurred during the year. One swarm, lasting from 1 to 2 June, comprised 62 events. Hypocenters were calculated for nine of these events and clustered SE of the summit., 67528=Fumarole temperatures during 1985, 114741=Table 5. Located earthquakes recorded near Momotombo from 2003 through 2011. For each year, the table lists the number of located earthquakes, the range of their local magnitudes (ML), the range of their focal depths, and their most frequently occurring depths. Courtesy of INETER., 28076=Site visits in February included walking around the crater; no morphological changes were observed. The visit also included gas sampling and temperature measurements. Fumaroles 8 and 9 measured 759°C and 762°C, respectively; more monitoring on 8 and 27 March showed that temperatures were staying relatively constant. No visits were made in April, May, or June, but seismic monitoring continued. Although only one volcano-tectonic earthquake registered in April, tornillos continued, with frequencies above 12 Hz. There were 35 volcano-tectonic events in May, including a three-hour-long cluster on 30 May. Six seismic events registered in June., 101965=The swarm recorded on 5 September was larger compared to the previous 2008 swarms. Approximately 30 events were recorded with a larger range of magnitudes, ML 1.6-2.6. Two of the earthquakes were large enough to be felt, ML 1.4 on 5 September and ML 2.5 the following day. Workers at the geothermal plant on Momotombo’s S flank (yellow asterisk in figure 11) reported shaking, as did workers at a cement company located 10 km S of the volcano., 79004=Table 1. Analytical mean of four mid-1981 gas samples (dry, HCl excluded) from Momotombo., 86831=03/1993 (BGVN 18:03) Small gas plume, 79249=Between 14 June and 11 July, personnel from PIRPSEV, CNRS, and the volcano observation section of IPG sampled medium-to-high temperature gases from Momotombo (table 1). Maximum gas temperatures measured were 640°C., 90082=12/1980 (SEAN 05:12) Summit crater fumaroles remain hot; night glow from crater, 85726=04/1996 (BGVN 21:04) High seismicity and a black plume, but no crater changes, 86300=03/1994 (BGVN 19:03) Voluminous plume from summit crater, 51372=Table 4. Chemical analyses on Momotombo fumaroles, 1983 and 1995. Courtesy of Marino Martini, University of Florence., 27126=Information Contacts: Martha Navarro, Emilio Talavera, and Virginia Tenorio, Instituto Nicaraguense de Estudios Territoriales (INETER), Dirección General de Geofísica, Apartado Postal 2110, Managua, Nicaragua (Email: ineter@ibw.com.ni, URL: http://www.ineter. gob.ni/geofisica)., 97251=Temperatures from the summit fumaroles were slightly higher than previously measured. A summary of fumarole temperatures measured during the last six site visits was provided in INETER’s November 2011 report (table 6). INETER reported values in the range of 317-890°C and they explained that, in general, a gradually increasing trend was present in the data. Since October 2000, rockfalls have covered some of the previously reliable fumaroles. Some additional measurements, requiring a close approach with a thermocouple probe, were hampered by dangerously high temperatures or unstable ground., 89548=07/1981 (SEAN 06:07) Medium-to-high temperature gases collected, 84443=12/2000 (BGVN 25:12) Previously unreported low activity during March and April 2000, 39987=On 24 April 1999 the summit area was visited and temperatures again found inflated in the five areas of fumarolic activity. The maximum temperatures were, in the south area of the crater, 725°C and, in the north, 550°C. Significant changes in the crater morphology were noted and attributed to the strong erosion induced by Hurricane Mitch in October 1998., 81005=\"A small, continuous vapor plume was visible in early 1981. No shallow seismicity was observed around Momotombo.\", 72257=\"In mid-March 1983 a joint Soviet-Nicaraguan team began a 3-month program of continuous observations of fumarolic activity in Momotombo's summit crater. The observations included temperature measurements and gas sampling from the highest temperature fumarole (N 9; figure 1). Immediately after sampling, the gas samples were analyzed in a field chemical laboratory near the volcano. CH2, O2, and N2 contents were determined and the S/Cl, F/Cl, and H2S/SO2 ratios were calculated, as well as the analyses shown in figure 2., 61486=When visited 21 and 27 April 1990, locations of fumarolic vents had changed little since a year earlier but gas temperatures had generally declined by 50-150°C. The highest recorded at vent F9 was 772°C (down from 880° on 15 April 1989) and temperatures at neighboring vents were 634° (779° in April 1989), 662° (716° in 1989), and 742° (844° in 1989). Other temperatures measured on 27 April 1990 were 575°C (F7), 702° (F8), and 439° (F12). Small dribbles, drops, or pools of amber-colored liquid sulfur were common at most fumaroles. Some very small multiple flows had smooth crusts of solid orange-brown sulfur, which turned bright yellow within minutes of removal from the hot surface. At F8, a tiny pool of liquid sulfur, a few mm deep, had a temperature of 137°C. Evidence for older, larger, sulfur flows included eroded remnants as much as 15 cm thick near F12, where up to 5 m of a pahoehoe type flow was preserved, including its front. The upper portion had apparently been eroded by water., 33932=Previously unreported low activity during March and April 2000, 88294=05/1983 (SEAN 08:05) Fumarole chemistry changes and temperature drops after tremor ends, 43030=Measurements during a 28 February visit revealed higher-than-normal fumarolic temperatures in the summit area. The high temperatures were associated with a recent period of aridity, during which time fumarolic activity increased. Temperatures ranged from 318-748°C (figure 7)., 87330=04/1989 (SEAN 14:04) Burning gases from fumaroles, 111024=Seismic swarm in 2004. According to INETER, through most of 2004, no major changes were observed or recorded at Momotombo. Tremor was recorded throughout the year with frequencies in the 5.0-15 Hz range. Field investigations in April 2004 determined that conditions at the summit crater had not changed since the last visit by INETER in July 2003. INETER measured temperature at three fumaroles located near the S flank seismic station, obtaining values of 95-97°C. Measurements from the summit fumaroles yielded temperatures within the range of previous data. A total of 18 sites have been measured reliably for many years (BGVN 22:07) with steady temperatures between ~200°C and ~700°C. During the April 2004 field visit, 10 of the 18 sites were measured. The highest values were recorded from fumaroles 7, 8, and 9, reaching over 550°C (figure 12)., 39020=Seismic activity registered at Momotombo stayed at consistently low levels during the seven months of April-November 1999, with a total of 81 small earthquakes, 30 of them in May and 26 in August. Only a few of these events were able to be located. RSAM (real-time seismic amplitude measurement) values never rose above two units. Starting in December, and continuing through March 2000, the seismic station only worked intermittently. Very few events were detected during this period, including two earthquakes when the station worked during 1-15 March., 85925=04/1995 (BGVN 20:04) Fumarole chemistry and temperature data for 1983 and 1995, 100280=The seismic swarm that started on 16 July 2010 was more significant and sustained; the largest event was ML 3.4, large enough to instigate reports from the local population but smaller than the event from 2009. While only 7 events were located in 2009, 13 locations were calculated from the swarm in 2010. INETER reported that this later episode entailed VT seismicity that lasted for 10 days., 89032=03/1982 (SEAN 07:03) High temperatures at crater fumaroles, 104567=INETER staff visited the volcano on 12 November 2006. They found significant rockfalls had taken place at the crater, including meter-sized boulders that had fallen into the crater, especially close to fumarole 9 (figure 12). At the 10 fumaroles where INETER measured temperature they found a minimum temperature of 75°C and a maximum of 681°C (the latter was recorded at fumarole 5). These values were similar but slightly lower than those measured during previous years., 54573=The joint INETER and FIU team visited Momotombo on 13 March 1994, but did not gain access to the crater. At that time the plume rising from the summit crater was voluminous and visible for many kilometers. Temperatures of fumaroles located near the seismic station (just above the S base of the volcano) were similar to last year (though values were unreported in BGVN 18:03, 18:09, & 18:10)., 86123=07/1994 (BGVN 19:07) Summit fumarole temperatures range from 238 to 655°C, 116957=In our last report on Momotombo volcano, we reviewed recent seismic activity and fumarole characteristics in September 2003 (BGVN 28:09). Here we extract and review material chiefly from recently available reports from the Instituto Nicaragüense de Estudios Territoriales (INETER). Events included a 2004 seismic swarm and details of a small 2006 summit explosion. We present a review of seismicity from 2003 to 2011, fumarole data from October 2000 to November 2011, and a cloud-free false-color satellite image from 2006. Aviation reports of plumes from Momotombo were absent during 2003-2011. The summit explosion on 12 June 2006 was too small to register in satellite imagery., 32986=On 9 April, Pierre Delmelle of the Université de Montréal along with local guides visited the volcano's crater. According to Delmelle, the crater was horseshoe-shaped and recent landslides had occurred down the crater's walls. He also noted that the majority of the fumarolic activity took place in the bottom of the crater. Gas was released from the fumaroles with very weak pressure, and temperatures ranged from 100 to 460°C. INETER personnel made a previous trip to the crater interior in September 1998 and found a lack of fresh landslides down the crater walls; fumarolic gas temperatures were 79 to 235°C., 30052=Seismicity increased during the early part of June, with a seismic cluster from 1 to 11 June SW of Momotombo consisting of more than 120 earthquakes. Thirty of these earthquakes occurred on 9 June. An event on 8 June was felt at the geothermal plant W of the volcano. The majority of these events were volcano-tectonic earthquakes with frequencies between 15 and 20 Hz. The unusual tornillos (screw-type events) have continued to occur at Momotombo, usually lasting 2-5 seconds with a dominant frequency of 5 Hz., 80147=A small continuous plume continued to be released in early 1981. No new measurements were made. No significant seismicity has occurred recently., 102172=The second seismic swarm of 2008 occurred just weeks after the first. On 24 March 2008, a swarm with slightly larger events, ML 2.2-2.9, was located less than 4 km deep., 103402=INETER staff visited the summit on 29 June 2007. Fumarole temperatures were recorded within the crater at four sites. The central site was the hottest location, 160°C, consistent with previous measurements, although significantly lower than recorded in past years. The lowest temperature was recorded from the westernmost point in the crater, 89°C., 83233=Temperatures of 465-780°C were measured in summit crater fumaroles in June. However, there was little gas emission., 99276=INETER visited the summit twice in 2011 along with international collaborators. On 25 March two students from Heidelberg University, Germany, joined INETER scientists. The team recorded observations of the crater morphology (figure 14) and measured fumarole temperatures from 10 of the established 18 sites (figure 12). Temperatures ranged between 283-761°C; four of the fumaroles had values over 550°C. These measurements were consistent with previous summit temperatures, which also revealed higher values in the central sites. In their March 2011 report, INETER stated that fumarole characteristics distinguish Momotombo from other volcanoes in Nicaragua; no other volcano exhibits such high temperatures without displaying incandescence., 62261=A maximum gas temperature of 880°C was measured (by a thermocouple) at fumarole ##9, inside the crater, on 15 April. Flames that extended up to 40 cm from vents were visible at night. Most were pale orange but some gases burned with a blue flame., 49998=In the first days of April, strong seismic activity began beneath Momotombo. The seismic observations were made by the station located ~3 km from the crater and other stations of the national seismic network. A slight increase in activity had been observed during March. On 4 April the number of daily events reached ~100; seismicity remained high until 9 April with maximum magnitudes of about 3. On 9 and 10 April volcanic seismicity declined, but at 1510 on 10 on April a M 3.5 event occurred. Residents of La Paz Centro, ~15 km SW, saw a black cloud above the crater after the earthquake. The normal plume has a white color., 77963=\"A very small continuous vapor plume was observed in late November. Summit fumarole temperatures seemed lower than in March 1981.\", 59831=\"Fumarolic activity showed a marked decrease in April. A group of French geologists has placed temperature and gas chemistry recording equipment, with a satellite link, in the crater. No data have yet been made available.\", 65773=Heavy rains fell along the entire Pacific coast of Nicaragua from 30 October to 3 November 1985. Of the three highest-temperature fumaroles, the temperature of one (## 9) dropped 33°C around the time of the heavy rains (figure 3), while temperatures of the other two continued to increase slightly. The temperature of fumarole ##9 had recovered by late December and continued to increase gradually through early April (table 3)., 100957=Relative quiescence during 2009-2010. INETER reported that tremor occasionally reached 40-50 RSAM during 2009-2010; these high values were primarily recorded in December 2010. Few earthquakes were located and during those two years they recorded ~40 relatively shallow events (no deeper than 17 km; table 5). Small seismic swarms were recorded on 28 February 2009 as well as one that started on 16 July 2010. The swarm in 2009 included one earthquake that was felt by people near the volcano associated with an ML 3.7 event. This was both the largest and one of the shallowest earthquakes from the swarm., 51907=On 25 February 1995 Lucano Giannini and Orlando Vaselli (University of Florence) visited the crater of Momotombo to collect fumarolic gas samples. The chemical composition of the gases at the highest observed temperature is shown on table 4. Also shown for comparison are values obtained in 1983, when seismic activity, ground deformation, and subsurface basaltic magma emplacement took place. The temperature decrease and gas compositional changes were thought to mainly reflect the twelve years of cooling., 47652=Information Contacts: Wilfried Strauch and Martha Navarro, INETER, Apartado Postal 2110, Managua, Nicaragua (Email: wil@ibw.com.nic); Alain Creusot, Instituto Nicaraguense de Energía, Managua, Nicaragua., 85178=03/1998 (BGVN 23:03) Higher-than-normal fumarole temperatures, 64711=Table 3. Temperatures (°C) at Momotombo's fumarole ##9, October 1985-April 1986. Courtesy of INETER., 41624=Fumarole temperatures remain high in April 1999}",
    "TableContextTimeStampAfterTable": "{34401=Incer J, 1987. . (pers. comm.)., 34446=Kirianov V Y, Melekestsev I V, Ovsyannikov A A, Andreev V N, 1988. Reconstruction of the eruptive activity of Momotombo volcano (Nicaragua) to assess volcanic hazards. Proc Kagoshima Internatl Conf Volc, p 495-498., 34251=IAVCEI, 1973-80. Post-Miocene Volcanoes of the World. IAVCEI Data Sheets, Rome: Internatl Assoc Volc Chemistry Earth's Interior.., 34681=Mooser F, Meyer-Abich H, McBirney A R, 1958. Central America. Catalog of Active Volcanoes of the World and Solfatara Fields, Rome: IAVCEI, 6: 1-146., 34850=Sapper K, 1925. The Volcanoes of Central America. Halle: Verlag Max Niemeyer, 144 p., 35172=Zuniga A, 2003. Geothermal Nicaragua. Geotherm Res Council Bull, 32: 163-165., 34955=Viramonte J G, Navarro Collado M, Malavasi Rojas E, 1997. Nicaragua-Costa Rica Quaternary volcanic chain. IAVCEI General Assembly, Puerto Vallarta, Mexico, January 19-24, 1997, Fieldtrip Guidebook, 17 p., 1382=Momotombo is a young, 1297-m-high stratovolcano that rises prominently above the NW shore of Lake Managua, forming one of Nicaragua's most familiar landmarks. Momotombo began growing about 4500 years ago at the SE end of the Marrabios Range and consists of a somma from an older edifice that is surmounted by a symmetrical younger cone with a 150 x 250 m wide summit crater. Young lava flows from Momotombo have flowed down the NW flank into the 4-km-wide Monte GalÃ¡n caldera. The youthful cone of Momotombito forms a 391-m-high island offshore in Lake Managua. Momotombo has a long record of strombolian eruptions, punctuated by occasional larger explosive activity. The latest eruption, in 1905, produced a lava flow that traveled from the summit to the lower NE base. A small black plume was seen above the crater after an April 10, 1996 earthquake, but later observations noted no significant changes in the crater. A major geothermal field is located on the southern flank of the volcano., 34060=Carr M J, 1984. Symmetrical and segmented variation of physical and geochemical characterisitics of the Central American volcanic front. J Volc Geotherm Res, 20: 231-252.}",
    "textBeforeTable": "Summary of Holocene eruption dates and Volcanic Explosivity Indices (VEI). Eruptive History Momotombo is a young, 1297-m-high stratovolcano that rises prominently above the NW shore of Lake Managua, forming one of Nicaragua's most familiar landmarks. Momotombo began growing about 4500 years ago at the SE end of the Marrabios Range and consists of a somma from an older edifice that is surmounted by a symmetrical younger cone with a 150 x 250 m wide summit crater. Young lava flows from Momotombo have flowed down the NW flank into the 4-km-wide Monte GalÃ¡n caldera. The youthful cone of Momotombito forms a 391-m-high island offshore in Lake Managua. Momotombo has a long record of strombolian eruptions, punctuated by occasional larger explosive activity. The latest eruption, in 1905, produced a lava flow that traveled from the summit to the lower NE base. A small black plume was seen above the crater after an April 10, 1996 earthquake, but later observations noted no significant changes in the crater. A major geothermal field is located on the southern flank of the volcano. Geological Summary 100 1,851 98,583 3,569,021 Within 5 km Within 10 km Within 30 km Within 100 km Population Major",
    "textAfterTable": "This compilation of synonyms and subsidiary features may not be comprehensive. Features are organized into four major categories: Cones, Craters, Domes, and Thermal Features. Synonyms of features appear indented below the primary name. In some cases additional feature type, elevation, or location details are provided. Cones Feature Name Feature Type Elevation Latitude Longitude Colorado, Cerro Stratovolcano 320 m 12° 28' 19\" N 86° 36' 11\" W Momotombito, VolcÃ¡n Lava cone 391 m 12° 21' 4\" N 86° 28' 26\" W Montoso, Cerro Stratovolcano 531 m 12° 27' 25\" N 86° 35' 10\" W Palomos, Cerro las Cone 333 m 12° 27' 58\" N 86° 35' 53\" W Craters Feature Name Feature Type Elevation Latitude Longitude GalÃ¡n, Monte Caldera 280 m 12° 27' 0\" N 86° 34' 1\" W Domes Feature Name Feature Type Elevation Latitude Longitude Guatusa, Loma la Dome 476 m 12° 23' 53\" N 86° 31' 5\" W Photo Gallery Oxidized, reddish-colored rocks form much of the summit cone of Momotombo volcano, seen here from the NW",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}