{
    "relation": [
        [
            "Play Type",
            "Out",
            "Out",
            "Triple",
            "Walk",
            "Single",
            "Double",
            "Out"
        ],
        [
            "Play",
            "Jhonny Peralta grounded out third to first. None on with one out and Casper Wells due up.",
            "Casper Wells fouled out to first. None on with two outs and Brandon Inge due up.",
            "Brandon Inge advances to first on a dropped 3rd strike and advances to third on A.J. Pierzynski's throwing error. Runner on third with two outs and Brennan Boesch due up.",
            "Brennan Boesch intentionally walked. Runners on first and third with two outs and Gerald Laird due up.",
            "Gerald Laird single to left scored Brandon Inge. Runners on first and second with two outs and Austin Jackson due up.",
            "Austin Jackson doubled to left scored Brennan Boesch. Runners on second and third with two outs and Will Rhymes due up.",
            "Will Rhymes grounded out to first to end the inning."
        ]
    ],
    "pageTitle": "Sunday, September 19, 2010 Detroit Tigers - Chicago White Sox Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/tigers_whitesox/2010/09/19",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00295-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 54046247,
    "recordOffset": 54029923,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2352=View all MLB box scores for 9/19/2010}",
    "textBeforeTable": "Top of the 1st Larry Vanover  3B Jeff Kellogg  2B Mark Carlson  1B Jeff Nelson  H Umpires 3.12 17 29 1 1 2 2 2 2 Sergio Santos (L, 2-2) 8.56 22 30 4 0 0 0 0 2 Carlos Torres  2.98 6 14 1 0 0 0 1 0.2 J.J. Putz  3.80 63 102 4 3 7 7 6 6.1 John Danks  ERA Strikes Pitches SO BB ER R H IP Name 4.26 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />White Sox pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/whitesox_22t.png 7 13 1 1 0 0 0 0.2 Daniel Schlereth (S, 1) 4.43 10 19 1 1 0 0 1 0.1 Eddie Bonine (H, 2) 7.01 24 36 1 1 0 0 1 1.2 Robbie Weinhardt (W, 2-2) 3.47 14 26 0 2 4 4 3 0.1 Phil Coke  4.02 12 19 2 0 0 0 0 2 Ryan Perry  4.28 5 8 0 0 0 0 2 0.1 Brad Thomas  4.92 65 121 0 5 1 3 7 5.2 Jeremy Bonderman  ERA Strikes Pitches SO BB ER R H IP Name \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Tigers pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/tigers_22t.png",
    "textAfterTable": "Single Alex Rios single to left scored Juan Pierre. Runners on first and second with none out and Paul Konerko due up. Out Paul Konerko reached first on a fielder's choice, short to second, deflected at third. Runners on first and third with one out and A.J. Pierzynski due up. Out A.J. Pierzynski sacrifice foul out to third scored Alexei Ramirez. Runner on second with two outs and Carlos Quentin due up. Hit-by-pitch Carlos Quentin was hit-by-pitch. Runners on first and second with two outs and Mark Teahen due up. Out Mark Teahen grounded out to first to end the inning. Top of the 2nd Play Type Play Out Miguel Cabrera struck out swinging. None on with one out and Jhonny Peralta due up. Out Jhonny Peralta flied out to center. None on with two outs and Casper Wells due up. Out Casper Wells struck out looking to end the inning. Bottom of the 2nd Play Type Play Out Brent Morel grounded out to first. None on with one out and Brent Lillibridge due up. Walk Brent Lillibridge walked. Runner on first with one out and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}