{
    "relation": [
        [
            "Element",
            "Content information area",
            "Revision history",
            "Content Information...",
            "OK",
            "Cancel",
            "Help"
        ],
        [
            "Description",
            "This area provides metadata information about the current content item revision, such as the title, content ID, author, folder location, and so on.",
            "This list shows all existing revisions of the current content item, along with their title, author, release date, and comments. You can select any revision from the list.",
            "Click this button to open the content information page of the selected content item revision.",
            "Click this button to close the dialog and open the selected content item revision in the Office application or compare it with the document revision currently open in Microsoft Word.",
            "Click this button to close the dialog without doing anything.",
            "Click this button to display context-sensitive help information for this dialog."
        ]
    ],
    "pageTitle": "A User Interface",
    "title": "",
    "url": "http://docs.oracle.com/cd/E23943_01/doc.1111/e10624/user_interface.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 72593971,
    "recordOffset": 72556150,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 13 May 2015 05:21:14 GMT",
    "textBeforeTable": "Figure A-26 Select Revision Dialog The Select Revision dialog enables you to select a revision of a Microsoft Office document on the content server that you want to open in the application or compare with the revision of that document that is currently open in Microsoft Word. A.19 Select Revision Dialog Click this button to close the dialog without doing anything. Cancel Click this button to close the dialog and insert the selected image file into the current Microsoft Office document. OK Click this button to display context-sensitive help information for this dialog. Help Other renditions: The list shows all custom renditions that may also be available on an Oracle WebCenter Content Server instance. The default is the alternate file, but server administrators may configure the content server to include other custom renditions of content items in this list.",
    "textAfterTable": "A.20 Check-in Comment Dialog The Check-in Comment dialog enables you to add a comment to a file that is about to be checked in. You can enter a new comment or reuse or edit one that was recently added to a managed content item. Figure A-27 Check-in Comment Dialog Element Description Comment entry box Enter a comment that will be added to the checked-in content item (in the xComment metadata field). There may be a default comment if one has been defined. The maximum number of characters is set by the content server administration (on the DesktopIntegrationSuite component configuration page). Recent Comments... Click this button to open the Recent Check-in Comments dialog, where you can see a list of comments that",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}