{
    "relation": [
        [
            "Project:",
            "Posting Date:",
            "Scope of Work:",
            "Services Required:",
            "Short List:",
            "Approved Fee:",
            "G&C Approval Date:"
        ],
        [
            "Statewide On-Call Traffic Design Services (2 Contracts) QUALIFICATIONS-BASED SELECTION CONTRACT",
            "December 3, 2012",
            "Two (2) Statewide On-Call Traffic Design Services Agreements, each anticipated to have a maximum value of $300,000 over a three-year term, are needed to provide on-call engineering and technical services to design highway signs, pavement markings, traffic signals; traffic signal optimization; provide traffic data collection, analysis, field adjustments and management of traffic signal timings and coordinated signal systems; traffic safety engineering; systems engineering; provide technical services including technical writing and other highway engineering tasks; provide support for field collection, database and/or GIS mapping of traffic assets and other highway engineering tasks for various transportation projects located throughout the State. This work will require Professional Engineer licensure in the State of New Hampshire. Consultants submitting a Letter of Interest will be assessed on their capability to perform the above-mentioned services as well as their availability to respond rapidly to on-call assignments. Task Orders assigned under this Agreement will be negotiated as either a lump-sum or a modified cost-plus-fixed-fee method of compensation. For additional information contact: Sally Gunn, Bureau of Traffic, at (603) 271-2291",
            "TRAF, RDWY, ITS",
            "AECOM CLD Consulting Engineers, Inc. Greenman-Pedersen, Inc. Resource Systems Group, Inc. Sebago Technics",
            "$300,000.00 (each)",
            "July 16, 2014"
        ]
    ],
    "pageTitle": "Short List Projects | Consultant Selection | Highway Design | NH Department of Transportation",
    "title": "",
    "url": "http://www.nh.gov/dot/org/projectdevelopment/highwaydesign/consultants/shortlist.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00016-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 615307167,
    "recordOffset": 615284044,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{80661=For additional information contact: Sally Gunn, Bureau of Traffic, at (603) 271-2291, 43789=For additional information, contact Project Manager Craig Green, at (603) 271-1486., 68772=Consultants submitting a Letter of Interest will be assessed on their capability to perform the above-mentioned services as well as their availability to respond rapidly to on-call assignments. Task Orders assigned under these Agreements will be negotiated as either a lump-sum or a modified cost-plus-fixed-fee method of compensation. For additional information contact Bill Oldenburg, Bureau of Highway Design, at (603) 271-2171., 47218=Preliminary design, public involvement process, final design, and associated environmental & cultural services for replacement or rehabilitation of the existing bridge carrying Waukewan Road over Lake Waukewan Outlet in the Town of Center Harbor. Constructed in 1936, this is a simple span concrete slab bridge with a total length of 13 feet. This bridge is on the Department’s Red List of deficient structures., 46092=For additional information contact Melodie Esterberg, Chief of Design Services, at (603) 271-2297, 32970=For additional information contact: Jerry Zoller, Bridge Design, at 271-2731., 58153=Consultants submitting a Letter of Interest will be assessed on their capability to perform the above-mentioned work, past experience with similar type work, and the ability to meet an aggressive design schedule. For additional information contact Project Manager Victoria Chase, at (603) 271-2171., 26257=For information contact: Dean Wilson, NHDOT Construction Bureau, at (603) 271-2571., 43353=Transportation engineering knowledge and services are required. The completion deadline for the TAMP is September 30, 2015., 75460=The format for this agreement will be cost-plus-fixed-fee for compensation. For information contact Bill Janelle, (Director of Operations), at (603) 271-1696., 52908=For additional information contact Robert Landry, Bridge Design, at 271-3921 or Michael Dugas, Highway Design (Preliminary), at 271-2604., 77729=Laconia 24181 - Preliminary design, public involvement process, final design, and associated environmental & cultural services for the anticipated removal of the existing bridge carrying Centenary Avenue over the NH RR in the City of Laconia. This is a 1940 seven span bridge with timber stringers and timber deck on timber bents and mortared cut stone abutments. (State Red List), 57397=The purpose of this contract will be to complete the necessary work to bring the project from a stage after the public hearing in 2014 to construction (advertising in 2016). The process of identifying and creatively resolving property impacts will be critical in order to meet the desired schedule. The preliminary design is currently being performed in-house by Department personnel. The design will consider the “Bedford Route 101 Corridor Study” completed in 2002, and the Study is a currently-available resource., 38821=Preliminary design, public involvement process, final design, and associated environmental & cultural services for replacement or rehabilitation of the existing bridge carrying NH Route 16 over the Ellis River in the Town of Jackson. Constructed in 1938, this two span concrete rigid frame bridge has a total length of 139 feet and a total width of 36.2 feet. This bridge is on the Department’s Red List of deficient structures. The scope of work may include:, 33938=March 28, 2014, 50539=Preliminary design, public involvement process, final design, and associated environmental & cultural services for replacement or rehabilitation of the existing bridge carrying US Route 1 over the Boston & Maine Railroad in the town of North Hampton, and improvements to the two adjacent intersections of North Road and US Route 1. Constructed in 1935, this is a simple span concrete tee-beam bridge with a total length of 42 feet. This bridge is on the Department’s Red List of deficient structures., 15457=For additional information contact Keith Cota, Bureau of Highway Design, at (603) 271-2171., 55669=Consultants submitting a Letter of Interest will be assessed on their capability to perform the above-mentioned work and past experience with similar type work. For additional information contact Director Patrick Herlihy, at (603) 271-2449., 30561=For additional information contact Keith A. Cota, Highway Design, at (603) 271-1615., 20507=This work will require professional planning experience and Professional Engineer licensure in the State of New Hampshire. Consultants submitting a Letter of Interest will be assessed on their capability to perform the above-mentioned work and on past experience with similar type work as demonstrated by reference interviews. Task Orders assigned under this Agreement will be negotiated as either a lump-sum format or a modified cost-plus-fixed-fee method of compensation. For additional information contact Shelley Winters at (603) 271-2468.}",
    "lastModified": "Mon, 29 Jun 2015 14:07:45 GMT",
    "textBeforeTable": "    landscape design LAND wetlands delineation and functional analyses for NEPA documentation WET design and implementation of intelligent transportation systems ITS utility engineering UTIL pre-construction inspection of structural integrity INSP traffic research/engineering TRAF hydraulics HYD materials/equipment testing TEST historic and architectural evaluations HIST ground surveying SURV hazardous materials investigation HAZ structural engineering STRC geotechnical investigations/exploration services GEOT software engineering SOFT fire protection engineering FIRE development/implementation of security systems SEC ecological studies and NEPA documentation ENV right-of-way ROW electrical engineering ELEC roadway design engineering RDWY construction management/construction services CMGT rail & transit engineering R&T building and site engineering CIVL public involvement PINV bridge design engineering BRDG transportation planning PLAN archaeological investigations ARCY noise analyses for NEPA documentation NOIS aerial mapping AMAP full-service engineering firm MULT",
    "textAfterTable": "  Project: Statewide On-Call Toll System Services (2 Contracts) QUALIFICATIONS-BASED SELECTION CONTRACTS Posting Date: November 24, 2014 Scope of Work: Two (2) Statewide On-Call Agreements, anticipated to have a maximum value of $600,000 each over a three-year term, are needed to provide on-call toll system services, project development, maintenance task support and special task efforts for the Central and Eastern Turnpikes. Typical assignments that are anticipated include all types of traffic and revenue studies, preparation and representation for bond issuances, E-ZPass Customer Service Center oversight, toll violation enforcement oversight, preparation and/or assistance in draft legislation in regard to the toll system, toll system data and traffic analysis, toll plaza engineering and design for conventional, Open Road Tolling (ORT) and All Electronic Tolling (AET) facilities, development of RFQ/RFP for Special Projects (i.e. Rest Area Redevelopment, air/noise/soundwall studies, equity studies) overall turnpike program assessment, renewal and replacement program assessment, and other special toll system related assignments. Past experience, knowledge and expertise with typical assignments noted above, ability to respond and complete assignments in a timely fashion and within budget are of the utmost importance. Consultants submitting a Letter of Interest will be assessed on their capability to perform the above-mentioned services. This work will require Professional Engineer licensure in the State of New Hampshire. Task Orders assigned under these Agreements will be negotiated as either a lump-sum or a modified cost-plus-fixed-fee method of compensation. For additional information contact",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}