{
    "relation": [
        [
            "Response Field",
            "asking_name",
            "asking_url",
            "question",
            "answer"
        ],
        [
            "Type",
            "String",
            "String",
            "String",
            "String"
        ],
        [
            "Description",
            "The blog name of the user asking the question",
            "The blog URL of the user asking the question",
            "The question being asked",
            "The answer given"
        ]
    ],
    "pageTitle": "API | Tumblr",
    "title": "",
    "url": "https://www.tumblr.com/docs/en/api/v2?language=de_DE",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00055-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 926291979,
    "recordOffset": 926261530,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "The API returns JSON-encoded objects (content-type: application/json). Responses vary according to the method used, but every response envelope includes these common parts: Response Format You'll need the blog hostname anytime you work with a blog. When you see the placeholder {base-hostname} in the API docs, substitute the standard or custom hostname. Custom hostname: Anything at all, as determined by a DNS CNAME entry. Example: www.davidslog.com Standard hostname: the blog short name + .tumblr.com. Example: greentype.tumblr.com Each blog has a unique hostname. The hostname can be standard or custom. Blog Hostname See Methods below for complete details. User: get user data or perform user actions api.tumblr.com/v2/user/... Blog: get blog data or write to a blog api.tumblr.com/v2/blog/{base-hostname}/... All Tumblr API requests start with api.tumblr.com. The next segment of the URI path depends on the type of request: URI Structure Before you dive in, review these essentials. Overview Check out or developer console to test calls, and see live examples of using our official clients: API Console Console For more details, see Authentication below. You'll need this to get your API key, even if you don't ever need to use a fully signed OAuth request. Get an OAuth key: register an application What You Need",
    "textAfterTable": "URI Conventions Notation Meaning Example Curly brackets { } Required item api.tumblr.com/v2/blog/ {base-hostname}/posts The blog hostname is required. Square brackets [ ] Optional item api.tumblr.com/v2/blog/ {base-hostname}/posts[/type] Specifying a post type is optional. Authentication The API uses three different levels of authentication, depending on the method. None: No authentication. Anybody can query the method. API key: Requires an API key. Use your OAuth Consumer Key as your api_key. Example: api_key=PyezS3Q4Smivb24d9SzZGYSuh--IaMfAkE Get an OAuth key: register an application OAuth: Requires a signed request that meets the OAuth 1.0a Protocol. Each method description includes a note about the authentication level. OAuth The API supports the OAuth 1.0a Protocol, accepting parameters via the Authorization header, with the HMAC-SHA1 signature method only. There's probably already an OAuth client library for your platform. Endpoints Request-token URL http://www.tumblr.com/oauth/request_token Authorize URL http://www.tumblr.com/oauth/authorize Access-token URL http://www.tumblr.com/oauth/access_token API Clients Here is a list of official API client which will help you get up and running with your favorite language in no time. If you find that we've missed your favorite language, tell us! Javascript Ruby PHP Java Python Objective-C Blog Methods",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}