{
    "relation": [
        [
            "VOTE:",
            "",
            "",
            "",
            ""
        ],
        [
            "Ida L. Castro, Chairwoman",
            "Alan Dexter Bowman",
            "Josephine DiRienzo",
            "Margaret E.L. Howard",
            "Robert J. Long"
        ],
        [
            "(Yes)",
            "(Abstained)",
            "(Yes)",
            "(Yes)",
            "(Yes)"
        ]
    ],
    "pageTitle": "Civil Service Commission | Meeting Minutes of October 9, 2002",
    "title": "",
    "url": "http://www.nj.gov/csc/about/meetings/minutes/021009m.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00058-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 612451327,
    "recordOffset": 612431900,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22884=B-18 JOSEPH BOPP Joseph Bopp, represented by John D. Feeley, Esq., appeals the decision of Human Resources Information Services, which upheld the bypass of his name for appointment from the August 15, 2001 certification of the Fire Captain (PM3591A), East Orange Fire Department, eligible list., 13685=A-13 ROBERT L. SHIELDS Robert L. Shields, Senior Correction Officer, New Jersey State Prison, Department of Corrections, 30-day suspension on charges of insubordination and violation of rules regarding, inter alia, personal conduct, and removal effective March 28, 2001, on charges of incompetency, inefficiency, or failure to perform duties, neglect of duty, and violation of rules regarding performance. This matter was previously presented to the Merit System Board at its regular meeting of September 25, 2002, but was held over., 804=Notice of this meeting was filed with the Secretary of State and sent to the Trentonian, Trenton Times, Courier-Post and Star Ledger on March 7, 2002, and posted at the Department of Personnel, 3 Station Plaza, Trenton, New Jersey., 49909=B-48 THOMAS WILLS The appeal of Thomas Wills, Automotive Mechanic with the Department of Transportation, of his removal effective March 9, 2001 on charges, was heard by Administrative Law Judge Joseph Lavery (ALJ), who rendered his initial decision on July 8, 2002 reversing the removal. At its meeting on September 10, 2002, the Merit System Board (Board) adopted the ALJ's recommendation. The proposed final decision is now submitted for the Board's review., 37830=B-42 NORMAN PETERS The appeal of Norman Peters, a Senior Correction Officer with Southern State Correctional Facility, Department of Corrections, of his removal effective January 30, 2002, on charges, was before Administrative Law Judge W. Todd Miller (ALJ), who rendered his initial decision on August 2, 2002. At its meeting on September 10, 2002, the Merit System Board (Board) adopted the ALJ's recommendation to dismiss the appeal as moot. The proposed final decision is now submitted for the Board's review., 66753=B-87 ROBERT FOCHT The Division of Human Resource Management requests that Robert Focht, a Fire Lieutenant with North Hudson Regional Fire and Rescue Service, be given retroactive seniority to July 16, 1994, for record purposes only., 10307=A-8 MICHAEL S. EBERHARDT Michael S. Eberhardt, Sheriff's Officer, County of Monmouth, Sheriff's Department, removal and resignation not in good standing effective November 16, 2000, on charges of unauthorized absence, abandonment of position, failure to report loss of license, failure to meet the requirements of the job, violation of firearm policy, care of firearms, handling of firearms, standard of conduct, obedience to laws and regulations, and conduct unbecoming a public employee., 68996=ACTION: The Merit System Board adopted the minutes of its meeting of September 25, 2002., 11537=A-10 CHRISTOPHER ASH - SETTLEMENT Christopher Ash, Truck Driver, Division of Human Resources, Department of Transportation, removal effective July 29, 2001, on charges of use of alcoholic beverages while on the job, drug use and/or possession of illegal drugs, assault and battery/workplace violence and conduct unbecoming a public employee. Settled to reinstatement to the title of Truck Driver., 14447=A-14 SHARON BRESCIA - SETTLEMENT Sharon Brescia, Youth Worker, Division of Youth and Family Services, Department of Human Services, removal effective December 20, 2000, on the charge of conduct unbecoming a public employee. Settled to a resignation in good standing effective December 20, 2000., 12145=A-11 JILL MCGRANE Jill McGrane, Intermittent Technical Assistant 3, Department of the Treasury, release at the end of the working test period effective February 21, 2001. This matter was previously presented to the Merit System Board at its regular meeting of September 25, 2002, but was held over., 39836=B-43 JOYCE SHOFF The appeal of Joyce Shoff, an Investigator, Vicinage XV (Probation Department, Gloucester County), Judiciary, concerning her six-day suspension beginning September 7, 2001, on charges, was heard by Administrative Law Judge Edgar R. Holmes (ALJ), who rendered his initial decision on August 7, 2002 upholding the suspension. At its meeting on September 10, 2002, the Board adopted the ALJ's recommendation. The proposed final decision is now submitted for the Board's review., 71101=B-94 MICHAEL RAVENDA Michael Ravenda, a Construction Official with the Borough of Lodi (Lodi), appeals the good faith of his layoff effective August 3, 2001, for reasons of economy and efficiency. This matter was heard by Administrative Law Judge Carol I. Cohen (ALJ), who rendered her initial decision on August 2, 2002 upholding the layoff. At its meeting on September 25, 2002, the Merit System Board adopted the ALJ's recommendation. The proposed final decision is now submitted for the Board's review., 11134=A-9 KELVIN WAGNER Kelvin Wagner, County Correction Officer, County of Gloucester, Sheriff's Department, removal effective December 17, 1999, on the charge of conduct unbecoming a public employee., 41828=B-44 JOHN SODEN The appeal of John Soden, Senior Probation Officer, Mercer Vicinage, Judiciary, of his removal effective December 21, 2000 on charges, was heard by Administrative Law Judge Joseph Lavery (ALJ), who rendered his initial decision on August 2, 2002 upholding the removal. At its meeting on September 10, 2002, the Merit System Board (Board) adopted the ALJ's recommendation. The proposed final decision is now submitted for the Board's review., 68032=B-91 JAMES R. ALLEN AND JAN RABAJDA James R. Allen and Jan Rabajda, represented by Jesse J. Averhart, Executive Vice President, Communication Workers of America, Local 1033, request that they be permitted to amend their promotional applications retroactively to the closing date of the announcement for the promotional examination for Auditor 1, Taxation (PS3295U) to reflect all the counties containing Department of the Treasury (Treasury) audit field offices, and also be given retroactive appointments, where applicable, as if they had been given the opportunity to be certified to the locations with open positions. This matter was held over from the Merit System Board meeting of September 25, 2002., 688=In accordance with L.1975, c.231, Chairwoman Ida L. Castro opened the meeting with the following statement:, 73111=There being no further business before the Merit System Board, the meeting was adjourned to convene on Wednesday, October 23, 2002 at 10:00 a.m., at 3 Station Plaza, Trenton, New Jersey. ______________________________ MARGARET E. L. HOWARD PRESIDING BOARD MEMBER MERIT SYSTEM BOARD, 45801=B-46 JOHNNY WALCOTT The appeal of Johnny Walcott, an Assistant Supervisor, Public Works, with the City of Plainfield, of his 15-day suspension and removal, effective October 6, 2000, on charges, was before Administrative Law Judge Arnold Samuels (ALJ), who rendered his initial decision on July 2, 2002 dismissing the appeal for lack of prosecution. At its meeting on September 10, 2002, the Merit System Board did not dismiss the appeal. Rather, the Board acknowledged the settlement. The proposed final decision is now submitted for the Board's review., 12688=A-12 DAVID L. WEISS David L. Weiss, Police Lieutenant, City of Perth Amboy, Police Department, 180-day suspension and demotion to the position of Police Sergeant effective November 23, 2000, on charges of insubordination, neglect of duty, knowingly and willfully making a false entry in any department report or record, failure to conduct proper, thorough, and complete investigations, insubordination, failure to submit properly written required reports within a reasonable or prescribed period of time as per regulations, and conduct subversive to the good order and discipline of the department. This matter was previously presented to the Merit System Board at its regular meeting of September 25, 2002, but was held over., 68844=B-92 MERIT SYSTEM BOARD MINUTES The Merit System Board Minutes for the meeting of September 25, 2002 are submitted for adoption., 31715=ACTION: The Merit system Board ordered the appointing authority to remove the provisional appointee, make an appointment from the certification and pay compliance costs. B-35 JACQUELINE WOOTEN-ROSE Jacqueline Wooten-Rose, a Family Service Specialist 3 with the Division of Youth and Family Services, Department of Human Services, represented by Rosemarie Cipparulo, Esq., seeks counsel fees pursuant to the Merit System Board decision rendered on August 8, 2000, which reversed a resignation not in good standing and awarded her back pay, benefits, seniority and counsel fees., 43778=B-45 JOSEPH VISCUSO The appeal of Joseph Viscuso, a Fire Captain with the Township of Kearny, of his 15-day suspension, on charges, was before Acting Director and Chief Administrative Law Judge Jeff S. Masin (ALJ), who rendered his initial decision on May 8, 2002 approving the settlement reached between the parties reducing the appellant's 15-day suspension to seven calendar days. At its meeting on September 10, 2002, the Board acknowledged the settlement. The proposed final decision is now submitted for the Board's review., 33419=B-39 SUNG YI Sung Yi, represented by Benjamin Spivack, a Senior Staff Representative with CWA Local 1040, appeals the Department of Corrections' failure to notify him of an open competitive examination for Head Cook 1., 15264=ACTION: The Merit System Board affirmed the recommendation of the Administrative Law Judge. A-16 SYBIL THREATS Sybil Threats, Senior Correction Officer, Mid-State Correctional Facility, Department of Corrections, removal effective September 29, 2000, on charges of insubordination and violation of a rule, regulation, policy, procedure, order, or administrative decision., 35720=B-41 ALFRED H. JONES, JR. The appeal of Alfred H. Jones, Jr., a Therapy Program Assistant at Woodbridge Developmental Center, Department of Human Services, of his 10-day suspension, beginning November 1, 2001, on charges, was heard by Administrative Law Judge Anthony T. Bruno (ALJ), who rendered his initial decision on July 25 2002. At its meeting on September 10, 2002, the Merit System Board (Board) did not adopt the ALJ's recommendation to increase the 10-day suspension to a 20-day suspension. Rather, the Board upheld the 10-day suspension. The proposed final decision is now submitted for the Board's review., 288=A regular meeting of the Merit System Board was held on Wednesday, October 9, 2002, in Trenton, New Jersey., 69100=B-93 DONALD HICKERSON The appeal of Donald Hickerson, a Correction Sergeant with Central Reception and Assignment Facility, Department of Corrections, of his removal, effective April 3, 2000 on charges, was before Administrative Law Judge Steven C. Reback (ALJ), who rendered his initial decision on July 2, 2002. At its meeting on September 10, 2002, the Merit System Board (Board) adopted the ALJ's recommendation to uphold the removal. The proposed final decision is now submitted for the Board's review., 47849=B-47 ELAINE WATSON The appeal of Elaine Watson, a Secretarial Assistant 3 - Non-Stenographic at Rowan University, concerning her return to her permanent title at the end of her working test period, effective October 15, 2001, was heard by Administrative Law Judge (ALJ) W. Todd Miller, who rendered his initial decision on July 8, 2002. At its meeting on September 10, 2002, the Board adopted the ALJ's recommendation to uphold the appellant's return to her permanent title of Senior Clerk Typist. The proposed final decision is now submitted for the Board's review., 71704=B-95 KATHLEEN RHOADS The appeal of Kathleen Rhoads, an Omnibus Operator with the Atlantic County Department of Human Services, of her removal, effective November 22, 2000 on charges, was heard by Administrative Law Judge Anthony T. Bruno (ALJ), who rendered his initial decision on July 26, 2002 modifying the removal to a 30-day suspension. At its meeting on September 10, 2002, the Merit System Board modified the removal to a 15-day suspension. The proposed final decision is now submitted for the Board's review., 8438=A-7 CHARLES AURIEMMA Charles Auriemma, Police Officer, City of Newark, Police Department, removal effective January 11, 2000, on charges of violation of Police Department rules regarding the drug screening policy, making false statements and disobedience to orders., 33743=B-40 CHARLES FUNCHES The appeal of Charles Funches, Custodial Worker, Jersey City School District, of his 30-day suspension beginning November 21, 2000, on charges, was heard by Administrative Law Judge Stephen G. Weiss (ALJ), who rendered his initial decision on June 28, 2002, upholding the 30-day suspension. At its meeting on September 10, 2002, the Merit System Board (Board) adopted the ALJ's recommendation. The proposed final decision is now submitted for the Board's review., 14957=A-15 KEVIN LADD Kevin Ladd, Senior Youth Worker, Division of Youth and Family Services, Department of Human Services, removal effective June 24, 2000, on the charge of conduct unbecoming a public employee., 4544=A-3 JANE HOLLAND Jane Holland, Family Service Specialist 2, Division of Youth and Family Services, Department of Human Services, demotion to Family Service Specialist 3 effective November 4, 2000, on charges of incompetence, neglect of duty, falsification and violation of policy., 32431=B-36 PATRICK RUSSO Patrick Russo, represented by Sanford R. Oxfeld, Esq., petitions the Merit System Board for reconsideration and a stay of the final administrative decision, rendered July 31, 2002, forever barring him from public employment pursuant to N.J.A.C. 2C:51-2(d).}",
    "lastModified": "Wed, 07 May 2014 18:26:16 GMT",
    "textBeforeTable": "Ida L. Castro, Chairwoman Alan Dexter Bowman Josephine DiRienzo Margaret E.L. Howard Robert J. Long A regular meeting of the Merit System Board was held on Wednesday, October 9, 2002, in Trenton, New Jersey. PRESENT: Chairwoman Ida L. Castro, Merit System Board Members, Alan Dexter Bowman, Josephine DiRienzo, Margaret E. L. Howard and Robert J. Long; Barbara Stoop, Deputy Attorney General; and Henry Maurer, Director, Division of Merit System Practices and Labor Relations. In accordance with L.1975, c.231, Chairwoman Ida L. Castro opened the meeting with the following statement: Notice of this meeting was filed with the Secretary of State and sent to the Trentonian, Trenton Times, Courier-Post and Star Ledger on March 7, 2002, and posted at the Department of Personnel, 3 Station Plaza, Trenton, New Jersey. All actions were by unanimous vote unless otherwise specified. A motion was made and seconded that the open session be recessed and that, pursuant to Section 12(b) of the Open Public Meetings Act, the Merit System Board entered into Executive Session for the purpose of legal advice on the matter of A-12 David Weiss. The Board subsequently reconvened the public meeting. SECTION A - HEARING MATTERS A-1 SETTLEMENTS In the Matter of Robert Garrison County of Ocean Department of Solid Waste Management Release at the end of the working test period In the Matter of Nathaniel Holman",
    "textAfterTable": "A-3 JANE HOLLAND Jane Holland, Family Service Specialist 2, Division of Youth and Family Services, Department of Human Services, demotion to Family Service Specialist 3 effective November 4, 2000, on charges of incompetence, neglect of duty, falsification and violation of policy. Recommendation of the Administrative Law Judge - Modify the demotion to an official reprimand. ACTION: The Merit System Board affirmed the recommendation of the Administrative Law Judge. A-4 MICHAEL SCARLATA Michael Scarlata, County Correction Officer, County of Union, Department of Public Safety, 15-day suspension on the charge of conduct unbecoming a public employee. Recommendation of the Administrative Law Judge - Uphold the 15-day suspension. ACTION: The Merit System Board modified the recommendation of the Administrative Law Judge to a three-day suspension. A-5 JOHN SHIVELY, WILLIAM J. PAIGE, ANDREW M. SALMON, AND MANUEL A. GONZALEZ (REMAND) John Shively, William J. Paige and Andrew M. Salmon, Senior Correction Officers, New Jersey State Prison, Department of Corrections, 30-days suspensions, on charges of neglect of duty and other sufficient cause: violation of rules governing safety and security precautions, resulting in injury to person or damage to property; and neglect of duty, loafing, idleness or willful failure to devote attention to a task which could result in danger to persons or property. Additionally, Manuel A. Gonzalez, a Senior Correction Officer, also with the New Jersey State Prison, Department of Corrections, was suspended",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}