{
    "relation": [
        [
            "First Name",
            "Brian",
            "Catherine",
            "Jennifer",
            "Jennifer",
            "Jennifer",
            "Jennifer"
        ],
        [
            "Last Name",
            "Henneberry",
            "Haggett",
            "Gray",
            "Gray",
            "Gray",
            "Gray"
        ],
        [
            "Suffix",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            "Senator Peter Fitzgerald, Legislative Counsel",
            "Senator Jim Bunning, Tax & Budget Counsel",
            "Senator Jim Bunning, Intern",
            "Senator Mitch McConnell, Intern"
        ],
        [
            "New",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=98DCF98E-A4CA-4BA8-9B4A-56D759130243&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 225589211,
    "recordOffset": 225574249,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29593=H.R. 2454, American Clean Energy and Security Act, entire bill H.R. 5629, Oil Spill Accountability and Environmental Protection Act of 2010, entire bill H.R. 5626, Blowout Prevention Act of 2010, entire bill H.R. 1787, Low Carbon Fuels Standard Act of 2009, entire bill S. 661, Restoring America's Manufacturing Leadership through Energy Efficiency Act of 2009, entire bill S. 3072, Stationary Source Regulations Delay Act, entire bill H.R. 5644, End Big Oil Tax Subsidies Act of 2010, entire bill S. 1733, Clean Energy Jobs & American Power Act, entire bill S. 787, Clean Water Restoration Act, entire bill S. 1095, America's Low-Carbon Fuel Standard Act of 2009, entire bill S. 1622, Clean Air Protection Act, entire bill S. 3268, Stop Excessive Energy Speculation Act, entire bill American Power Act, Discussion Draft S.J. RES.26, joint resolution disapproving a rule submitted by the Environmental Protection Agency relating to the endangerment finding and the cause or contribute findings for greenhouse gases under section 202(a) of the Clean Air Act, entire bill S. 3072, bill to suspend, during the 2-year period beginning on the date of enactment of this Act, any Environmental Protection Agency action under the Clean Air Act with respect to carbon dioxide or methane pursuant to certain proceedings, other than with respect to motor vehicle emissions, and for other purposes, entire bill H.J. RES.77, Disapproving a rule submitted by the Environmental Protection Agency relating to the endangerment finding and the cause or contribute findings for greenhouse gases under section 202(a) of the Clean Air Act, entire bill H.R. 4572, To amend the Clean Air Act relating to greenhouse gases, and for other purposes, entire bill H.R. 391, To amend the Clean Air Act to provide that greenhouse gases are not subject to the Act, and for other purposes, entire bill H.R 4396, To amend the Clean Air Act to provide that greenhouse gases are not subject to the Act, and for other purposes, entire bill H.R. 4753, To suspend, during the 2-year period beginning on the date of enactment of this Act, any Environmental Protection Agency action under the Clean Air Act with respect to carbon dioxide or methane pursuant to certain proceedings, other than with respect to motor vehicle emissions, and for other purposes, entire bill S. 2877, Carbon Limits and Energy for America's Renewal (CLEAR) Act, entire bill, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 64752=H.R. 2868, The Chemical Facility Anti-Terrorism Act of 2009, entire bill S. 2996, Continuing Chemical Facilities Antiterrorism Security Act of 2010, IST, MSTA, CFATS reauthorization S. 3209, Safe Chemicals Act of 2010, entire bill H.R. 2892, Department of Homeland Security Appropriations Act, 2010, entire bill S.1660, Formaldehyde Standards for Composite Wood Products Act, entire bill S. 787, Clean Water Restoration Act, entire bill, 44755=S. 569, Incorporation Transparency and Law Enforcement Assistance Act, entire bill S. 3217, Restoring American Financial Stability Act of 2010, entire bill H.R. 4173, Restoring American Financial Stability Act of 2010, entire bill H.R. 977, Derivatives Markets Transparency and Accountability Act of 2009, entire bill H.R. 1754, Financial System Stabilization and Reform Act of 2009, entire bill H.R. 3996, Financial Stability Improvement Act of 2009, provisions related to Systemic Risk Regulator H.R.1731, Credit Risk Retention Act of 2009, entire bill H.R. 3818, Private Fund Investment Advisers Registration Act, entire bill H.R. 3795, the Over-the-Counter Derivatives Markets Act of 2009, entire bill S. 3268, Stop Excessive Energy Speculation Act, entire bill S. 447, Prevent Excessive Speculation Act, entire bill S. 664, Financial System Stabilization and Reform Act of 2009, entire bill General issues related to the collapse of the Auction-Rate Securities Market, 37848=H.R. 2129, Federal Price Gouging Prevention Act, entire bill S. 3547, Price Gouging Act of 2010, entire bill S. 1660, Formaldehyde Standards for Composite Wood Products Act, provisions relating to formaldehyde Issues: legislative proposals related to price controls on energy products, 58160=General tax matters including the manufacturers' deduction and the alternative fuel and alternative fuels mixture credit H.R. 4213, American Workers, State and Business Relief Act of 2010, entire bill H.R.5644, End Big Oil Tax Subsidies Act of 2010, entire bill H.R. 4213, Tax Extenders Act of 2009, entire bill Issues related to Section 199 Manufacturing Deduction S. 870, A bill to amend the Internal Revenue Code of 1986 to expand the credit for renewable electricity production to include electricity produced from biomass for on-site use and to modify the credit period for certain facilities producing electricity from open-loop biomass, entire bill H.R. 622, A bill to amend the Internal Revenue Code of 1986 to expand the credit for renewable electricity production to include electricity produced from biomass for on-site use and to modify the credit period for certain facilities producing electricity from open-loop biomass, entire bill Future Energy bill, proposed oil and gas industry tax increases H.R. 3617, Surface Transportation Extension Act of 2009, entire bill S. 3268, Stop Excessive Energy Speculation Act, entire bill H.R.3460, To amend the Clean Air Act to include algae-based biofuel in the renewable fuel program and amend the Internal Revenue Code of 1986 to include algae-based biofuel in the cellulosic biofuel producer credit, LIFO, entire bill President's Budget, Section 199, Oil and Gas Taxes, entire bill, 26078=H.R. 2868, Chemical Facility Anti-Terrorism Act of 2009, entire bill S. 569, Incorporation on Transparency and Law Enforcement Assistance Act, entire bill S. 2996, the Continuing Chemical Facilities Anti-Terrorism Security Act of 2010, entire bill, 49594=S.J. RES. 26, Joint resolution disapproving a rule submitted by the Environmental Protection Agency relating to the endangerment finding and the cause or contribute findings for greenhouse gases under section 202(a) of the Clean Air Act, entire bill S. 3072, Bill to suspend, during the 2-year period beginning on the date of enactment of this Act, any Environmental Protection Agency action under the Clean Air Act with respect to carbon dioxide or methane pursuant to certain proceedings, other than with respect to motor vehicle emissions, and for other purposes, entire bill H.J. RES.77, Disapproving a rule submitted by the Environmental Protection Agency relating to the endangerment finding and the cause or contribute findings for greenhouse gases under section 202(a) of the Clean Air Act, entire bill H.R. 4572, To amend the Clean Air Act relating to greenhouse gases, and for other purposes, entire bill H.R. 391, To amend the Clean Air Act to provide that greenhouse gases are not subject to the Act, and for other purposes, entire bill H.R 4396, To amend the Clean Air Act to provide that greenhouse gases are not subject to the Act, and for other purposes, entire bill H.R. 4753, To suspend, during the 2-year period beginning on the date of enactment of this Act, any Environmental Protection Agency action under the Clean Air Act with respect to carbon dioxide or methane pursuant to certain proceedings, other than with respect to motor vehicle emissions, and for other purposes, entire bill S. 2877, Carbon Limits and Energy for America's Renewal (CLEAR) Act, entire bill, 76266=S.1462, American Clean Energy Leadership Act of 2009, entire bill H.R.2454, American Clean Energy and Security Act of 2009, entire bill S. 835, Open Fuel Standard Act of 2009, provisions relating to liability protections, 54427=H.R. 5629, Oil Spill Accountability and Environmental Protection Act of 2010, liability and pipeline provisions S. 146, Railroad Antitrust Enforcement Act of 2009, entire bill H.R. 233, Railroad Antitrust Enforcement Act of 2009, entire bill H.R. 3617, Surface Transportation Extension Act of 2009, entire bill H.R. 1799, Safe and Efficient Transportation Act of 2009, entire bill H.R. 3288, Transportation, Housing and Urban Development, and Related Agencies Appropriations Act of 2010, entire bill, 18249=H.R. 2454, American Clean Energy and Security Act, Title III General energy issues including refined product reserves and commodity trading S. 967 Strategic Petroleum Reserve Modernization Act, entire bill S. 539 Clean Renewable Energy and Economic Development, entire bill S. 1462, American Clean Energy Leadership Act of 2009, Sec. 131, RFS Blend Wall, RES S. 3072, Stationary Source Regulations Delay Act, entire bill H.R. 4572, To amend the Clean Air Act relating to greenhouse gases, and for other purposes, entire bill H.R. 391, To amend the Clean Air Act to provide that greenhouse gases are not subject to the Act, and for other purposes, entire bill American Power Act Discussion Draft H.R. 5626, Blowout Provention Act, definitions H.R. 1787, Low Carbon Fuel Standard Act of 2009 S. 3516, Outer Continental Shelf Reform Act of 2010, entire bill H.R. 1660, Formaldehyde, entire bill S. 2996, Chemical Plant Security, entire bill H.R. 2129, Federal Price Gouging Prevention Act of 2009, entire bill H.R. 1787, To amend the Clean Air Act regarding transportation fuels and establishment of a low carbon fuel standard, entire bill H.R. 977, Derivatives Markets Transparency and Accountability Act of 2009, entire bill H.R. 2448, Prevent Unfair Manipulation of Prices Act, entire bill H.R. 2868, The Chemical Facility Anti-Terrorism Act of 2009, entire bill H.R. 2129, Federal Price Gouging Prevention Act, entire bill H.R. 2998, National Climate Service Act of 2009, entire bill S. 807, SMART Energy Act, entire bill S. 1095, America's Low-Carbon Fuel Standard Act of 2009, entire bill S. 3268, Stop Excessive Energy Speculation Act, entire bill S. 661, Restoring America's Manufacturing Leadership through Energy Efficiency Act of 2009, entire bill S. 787, Clean Water Restoration Act, entire bill S. 447, Prevent Excessive Speculation Act, entire bill S. 272, Derivatives Trading Integrity Act, entire bill S. 221, To amend the Commodity Exchange Act to require energy commodities to be traded only on regulated markets, entire bill S. 1225, To require the CFTC to take certain actions to prevent manipulation of energy markets, entire bill S. 888, Oil Industry Tax Break Act of 2009, entire bill S. 337, Prevent Excessive Speculation Act, entire bill S. 1733, Clean Energy Jobs & American Power Act, entire bill S. 949, 21st Century Energy Technology Deployment Act, entire bill S. 2996, Continuing Chemical Facilities Antiterrorism Security Act of 2010, entire bill S. 1622, Clean Air Protection Act, entire bill S. 2877, Carbon Limits and Energy for America's Renewal (CLEAR) Act, entire bill H.R. 4753, Stationary Source Regulations Delay Act, entire bill S. 835, Open Fuel Standard Act of 2009, entire bill S. 3072, Stationary Source Regulation and Permitting Delay Act, provisions related to motor vehicle fuel, climate change, renewable fuels standards S.J. RES.26, joint resolution disapproving a rule submitted by the Environmental Protection Agency relating to the endangerment finding and the cause or contribute findings for greenhouse gases under section 202(a) of the Clean Air Act, entire bill H.J. RES.77, Disapproving a rule submitted by the Environmental Protection Agency relating to the endangerment finding and the cause or contribute findings for greenhouse gases under section 202(a) of the Clean Air Act, entire bill H.R. 4572, To amend the Clean Air Act relating to greenhouse gases, and for other purposes, entire bill H.R. 391, To amend the Clean Air Act to provide that greenhouse gases are not subject to the Act, and for other purposes, entire bill H.R.3460, To amend the Clean Air Act to include algae-based biofuel in the renewable fuel program and amend the Internal Revenue Code of 1986 to include algae-based biofuel in the cellulosic biofuel producer credit, LIFO, entire bill H.R 4396, To amend the Clean Air Act to provide that greenhouse gases are not subject to the Act, and for other purposes, entire bill H.R. 4753, To suspend, during the 2-year period beginning on the date of enactment of this Act, any Environmental Protection Agency action under the Clean Air Act with respect to carbon dioxide or methane pursuant to certain proceedings, other than with respect to motor vehicle emissions, and for other purposes, entire bill S. 2877, Carbon Limits and Energy for America's Renewal (CLEAR) Act, entire bill, 12248=H.R. 5088, America's Commitment to Clean Water Act, entire bill H.R. 2454, The American Clean Energy and Security Act of 2009, entire bill H.R. 2868, Chemical Facility Anti-Terrorism Act of 2009, entire bill H.R. 5088, Clean Water Reauthorization, entire bill S.J. RES. 26, Disapproving a rule submitted by the Environmental Protection Agency relating to the endangerment finding and the cause or contribute findings for greenhouse gases under section 202(a) of the Clean Air Act, entire bill S. 3464, Practical Energy and Climate Plan Act of 2010, entire bill H.R. 1787, To amend the Clean Air Act regarding transportation fuels and establishment of a low carbon fuel standard, entire bill H.R. 2477, Chemical Facility Security Authorization Act of 2009, entire bill S. 787, Clean Water Restoration Act, entire bill S. 3072, Stationary Source Regulations Delay Act, entire bill H.J. RES. 77, Disapproving a rule submitted by the Enviornmental Agency relating to the endangerment finding and the cause or contribute findings for greenhouse gases under section 202(a) of the Clean Air Act, entire bill H.R. 4572, To amend the Clean Air Act relating to greenhouse gases, and for other purposes, entire bill H.R. 391, To amend the Clean Air Act to provide that greenhouse gases are not subject to the Act, and for other purposes, entire bill H.R. 4396, To amend the Clean Air Act to provide that greenhouse gases are not subject to the Act, and for other purposes, entire bill S. 1733, Clean Energy Jobs and American Power Act, entire bill, 41357=S. 3466, Mens Rea Requirements, entire bill Issues related to overcriminalization/legal reform S. 569, Incorporation Transparency and Law Enforcement Assistance Act, entire bill H.R. 4326, Attorney-Client Privilege Protection Act of 2009, entire bill S. 1504, Notice Pleading Restoration Act of 2009, entire bill H.R. 4115, Open Access to Courts Act of 2009, entire bill S. 3257, Labor-Health and Human Services-Education Appropriation Act, provisions related to funding for OSHA Voluntary Protection Program, entire bill Proposed amendments to the U.S. Sentencing Guidelines related to commodities fraud and unauthorized disclosures of personal health insurance information}",
    "textBeforeTable": "",
    "textAfterTable": "4a. Contact Name b. Telephone Number c. E-mail  Ms.  Jenny Kim  2028798569  jenny.kim@kochps.com 5. Senate ID#  400390816-12 7. Client Name Self Check if client is a state or local government or instrumentality  Koch Companies Public Sector, LLC 6. House ID#  405090000 TYPE OF REPORT 8. Year  2010 Q1 (1/1 - 3/31) Q2 (4/1 - 6/30) Q3 (7/1 - 9/30) Q4 (10/1 - 12/31) 9. Check",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}