{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The area around this school is not that safe. However, as long as you are on campus and not out late or not alone you should be safe. There are emergency booths around campus and there are guards on bikes that ride around at night.",
            "Many people are involved in the Greek Life and there a period of time when many activities are going on for this. When people are accepted into their groups its very energetic and exciting for those that join.",
            "There's a day for students to get involved in clubs and many other activities. There is wide range of clubs to join including different kinds of genres.",
            "Students that have study habits and are determined with a goal. This school is very studious and for students that are willing to study it is a good environment because everyone else is pretty much studying as well.",
            "I am not sure that there are unusual traditions. However, I really enjoyed student appreciation day which is near the end of the school year and we were treated by the school with food, fun activities, and free T-shirts.",
            "The school is pretty expensive because it is a private school. I'm not sure if the tuition should be that high because it does not seem like we use that much money. However, since it is a private school.",
            "There are many activities on campus but it depends on the individuals personality. I liked eating out and going shopping off campus with friends when we had free time. Also I worked out for fun as well.",
            "The food is decent as well. It made me gain weight a little but that all depends on the individual and how they maintain their health. However, I know the majority of the students dislike the dorm food.",
            "The dorms are decent, there is one dorm for incoming freshman called Goodman. Then people move out to other dorms or apartments. There are four floors with no elevator and there is no kitchen. Overall it was a decent experience for me.",
            "Personally, I studied a lot because there is a lot to study. I'm not sure how it compares to other schools but most of the students attending this school study study study. It is hard to get use to if there are no study habits.",
            "Students need to work hard in order to maintain a good GPA. One of the best parts of this University is the caring staff members. Most large public schools, the staff cannot give that attention to individual students. So ask many questions and get close to professors. Also get resources from upperclassmen.",
            "The University is like high school but bigger. The campus is small, nice, and homey. It is a great place to build a family with the people because everyone usually knows everyone else."
        ]
    ],
    "pageTitle": "University of the Sciences (USP) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-the-Sciences/reviews?_escaped_fragment_=/show/28643",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897859751,
    "recordOffset": 897815130,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{195556=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/04/2009 Reviewer is A current student here. 26 out of 27 people found this review useful. 1 of 42 Davina from Plainfield, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. University of the Sciences Reviews University of the Sciences › Pennsylvania › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot The first semester here is rough, just as in any other college, I'm sure. Getting used to the workload and what's expected of you hits you quickly. I had much difficulty adjusting, but with the friends I made and the support system from my professors, advisor, and friends, I was able to do so much better in the second semester - my GPA improved by 1.037. Learning study skills and learning that it's ok to ask questions made my spring and summer semesters so much better. Login to rate or flag the reviews Mary from Philadelphia, PA 01/06/2013 Reviewer is A current student here. 7 out of 7 people found this review useful. 3 of 42 Categories Comments Campus Safety Tons of campus security are always cruising around on their priuses, and they walk all over the place. You can't walk a block and not spot their bright yellow uniform, haha. Plus the cops drive around the campus at night.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}