{
    "relation": [
        [
            "1 Handed",
            "R1 — R1 —",
            "R2",
            "Roll — R1",
            "Backstep or Run — R1",
            "Forward + R1",
            "L1 (left hand)",
            "L2 (left hand)"
        ],
        [
            "",
            "piercing thrusts",
            "heavy piercing Thrust",
            "low piercing Thrust",
            "jumping piercing Thrust",
            "backstep Attack",
            "piercing Thrust",
            "Parry"
        ],
        [
            "",
            "can be used behind Shield",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Move Set - Demon's Souls English Wiki",
    "title": "",
    "url": "http://demonssouls.wikidot.com/move-set",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00115-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 60359659,
    "recordOffset": 60347680,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Axes and Hammers share the same move set, their biggest difference is damage type (normal vs blunt or piercing). Axe and Hammer Axe available moves by Weapon type Swords - Piercing Extra Large Sword Large Sword Straight Sword Dagger Swords - Straight Katana Curved Sword Swords - Asian Pole Spear Spears / Poles Shield - Bash Shield - Parry Shields Fist Large Axe and Large Hammer Axe and Hammer Axe Table of Contents Unfold Fold //--> google_ad_height = 90; google_ad_width = 728; google_ad_slot = \"2433845190\"; /* Demon's Souls Wiki - Above Content */ google_ad_client = \"ca-pub-9739276392974443\";",
    "textAfterTable": "2 Handed R1 — R1 alternating vertical Swipe Stunlock. Great for breaking guards. R2 — R2 heavy horizontal Chop Roll — R1 Uppercut Backstep or Run — R1 heavy running overhead vertical Chop Forward + R1 heavy Push L1 or L2 Guard Large Axe and Large Hammer 1 Handed R1 — R1 horizontal Swipe R2 — R2 heavy vertical Chop Roll — R1 horizontal ground Swipe Backstep or Run — R1 vertical Chop Forward + R1 Push L1 (left hand) Guard L2 (left hand) vertical Chop 2 Handed R1 — R1 alternating vertical Swipe More powerful than the 1-handed Attack. Great for breaking guards. R2 — R2 heavy vertical Chop Hyper Armor Roll — R1 heavy ground Slam Backstep or Run — R1 heavy vertical Chop Forward + R1 heavy Push L1 or L2 Guard Fist R1 — R1 fast punches R2 charged uppercut Roll — R1 backhand punch",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}