{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is very safe! I have never heard of anything alarming from students or the university. They have 24-hour patrollers and a direct number you can call for campus safety.",
            "I am giving this 3 stars because I am not in Greek Life. I have heard it is great to be a part of, however, and many of my friends enjoy it. This is a small university so there are not many to choose from, but if you get involved I'm sure it would be great.",
            "There are quite a bit of student organizations that you can join. You can find anything that suits your interest and join! Even if you don't, you can get a couple friends and start one yourself. They are great on campus and I highly encourage joining at least 1!",
            "Aviation enthusiasts! Even if you don't want to be a pilot, there are many programs that either tie in aviation or are directly concentrated in the aviation field.",
            "We have a spirit rock near our student center that gets painted all the time for school games and many events. Anyone is allowed to go paint it (usually secretly at night) so that it can be shown off the next day for whatever reason.",
            "The tuition is probably the worst aspect of this university. However, it has a good reputation and I feel like I am getting a quality education that will be recognized. Although it is very high, it will definitely pay off in the end.",
            "If you get involved on campus, many student organizations have activities that are fun when you join! Additionally, the beach is nearby which is always a fun place to go to. Orlando is about an hour away where you can find Universal and Disney World parks.",
            "If you live in the dorms, there is a cafeteria with many kinds of foods that are usually pretty good. On campus there is also an Einsteins, Chickfila, Starbucks, Freshens and other vendors that are great!",
            "I'm giving it 3 stars because I did not live in the dorms. From what I have heard, it is not bad at all. Many people meet their first college friends in dorms and stick with them for life.",
            "Courses are very good here. They are taught by knowledgeable professors and are usually quite small, which gives you an advantage. They can be tough, but there are plenty of tutoring and other services available to students for help.",
            "Make sure to take it easy on your first semester and don't take more than 14 hours. College was a shock to me my first semester after high school, as I was not prepared for the difficulty level. Also make sure to get involved on campus and with student organizations!",
            "After spending my first college years at a major public 50,000+ student university, I have come to love Embry-Riddle for many reasons. It is much smaller, offering chances to get to know your professor and peers which increases your learning experience. It is also located in a very nice area, the beach is nearby, Orlando and theme parks are not far away which all makes it an ideal place to attend college."
        ]
    ],
    "pageTitle": "Embry-Riddle Aeronautical University-Daytona Beach (ERAU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Embry-Riddle-Aeronautical-University-Daytona-Beach/reviews?_escaped_fragment_=/show/67419",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 884177519,
    "recordOffset": 884066157,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{194787=i study business administration in air transportation beginning in august 2012, my goal is to obtain the degree in the above., 527458=The campus has been under construction in some way ever since I started attending in 2010. However, the campus is in an ideal location (4 miles from the beach), and the weather is almost always sunny. Another plus is that the faculty and staff typically do everything they can to help you; the university does everything it can to make your college experience amazing., 609387=I just got accepted and i am super excited to attend. To me i thought it was pretty easy to get into to but also i do have high test scores. I cant wait to attend in Fall of 2015, 509876=Don't burn a hole in your pocket to go here. If you're on an ROTC scholarship, great. If you have the money, great. This school will not give you that big of an advantage, but it really is great for aerospace engineering. If you aren't passionate about aviation, don't go here. I came here to get connected to the space program, but I had no advantage. I'm going somewhere else where I can focus more on meteorology. Also, they are knocking down so many buildings. The campus is kind of a mess, and it will be for the next few years. They are rebuilding a new Arts & Sciences building, so some of your classes will be in trailers. They said it was going to be up for the Spring 2014 semester, but I hear from students that it isn't done. They are also going to knock down and rebuild the library, the student center, and the McKay dorms. You can definitely see where your tuition dollars are going. It was rather frustrating!, 623438=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/11/2009 Reviewer is A current student here. 50 out of 50 people found this review useful. 1 of 132 Meagan from Hagerstown, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. Embry-Riddle Aeronautical University-Daytona Beach Reviews Embry-Riddle Aeronautical University-Daytona Beach › Florida › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot This is a challenging school, and you can start taking classes relevant to your major, whatever it may be, in your second semester or year, depending on what classes you earn credit for in high school or community college. There are no real general education classes like in other schools, so a degree from Embry-Riddle is more specialized than a degree from other schools. Login to rate or flag the reviews Josh from Boynton Beach, FL 10/13/2010 Reviewer is A current student here. 18 out of 20 people found this review useful. 3 of 132 Categories Comments Great for these types of students This university is perfect for anyone considering an aerospace career. Even if you're considering a degree in business, homeland security, or a different discipline of engineering, having a university such as this on your resume will no doubt get you any job you could possible want. Tips for prospective students Anyone considering coming here should definitely do so,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}