{
    "relation": [
        [
            "Property",
            "minLat",
            "minLon",
            "maxLat",
            "maxLon"
        ],
        [
            "Description",
            "A floating-point number that represents the measure of latitude on the map for the rectangle’s starting point, or upper left-hand corner.",
            "A floating-point number that represents the measure of longitude on the map for the rectangle’s starting point, or upper left-hand corner.",
            "A floating-point number that represents the measure of latitude on the map for the rectangle’s ending point, or lower right-hand corner.",
            "A floating-point number that represents the measure of longitude on the map for the rectangle’s ending point, or lower right-hand corner."
        ]
    ],
    "pageTitle": "Yahoo! Maps Web Services - Flash® APIs Reference Manual",
    "title": "",
    "url": "https://developer.yahoo.com/maps/flash/V3.04/flashReference.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00315-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 864540959,
    "recordOffset": 864518860,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{99734=Copyright © 2015 Yahoo! Inc. All rights reserved.}",
    "textBeforeTable": "Properties A floating-point number that represents the measure of longitude on the map for the rectangle's ending point, or lower right-hand corner. maxLon A floating-point number that represents the measure of latitude on the map for the rectangle's ending point, or lower right-hand corner. maxLat A floating-point number that represents the measure of longitude on the map for the rectangle's starting point, or upper left-hand corner. minLon A floating-point number that represents the measure of latitude on the map for the rectangle's starting point, or upper left-hand corner minLat Description Parameter Constructor ActionScript package name: com.yahoo.maps.LatLonRect Inheritance: LatLongRect A distinct rectangle of space on a map defined by two sets of latitude and longitude coordinates. LatLonRect (minLat, minLon, maxLat, maxLon)    Usage Example: var latlon = new LatLon(47,-122); import com.yahoo.maps.LatLon; A floating-point number that represents a measure of longitude, or location east or west of the prime meridian. lon A floating-point number that represents a measure of latitude, or location north or south of the equator. lat Description Parameter Properties The longitude (float) that represents a measure of",
    "textAfterTable": "LocalSearchFilter() Each time a successful search is performed when using the LocalSearchOverlay class, 0 to n filters are returned. Each filter represents a possible refinement of the search results. By using the key attribute of the filter, the same search terms will return refined results as described by the name attribute. Inheritance: LocalSearchFilter ActionScript package name: com.yahoo.maps.overlays.data.LocalSearchFilter Properties Property Description count The number of results, out of the total search results returned, that comply with this filter. key A string that specifies the key that needs to be passed back to LocalSearchOverlay.search() method to retrieve the refined results. name A string that provides a readable description of the filter. type A string that specifies the filter type, of which there are two, represented by LocalSearchFilter.TYPE_RATING and LocalSearchFilter.TYPE_CATEGORY. Rating filters allow the user to refine the search by the rating of the search results usually from one to five stars. Category filters filter by a specific category of results. For example, a search for food might return category filters with names such as \"grocery\", \"fast food\", \"cafes\", etc. TYPE_CATEGORY Possible value for the LocalSearchFilter.type property. If the type property is equal to the LocalSearchFilter.TYPE_CATEGORY constant, the search() method of the LocalSearchOverlay class can use the key attribute as its categoryFilter parameter. TYPE_RATING Possible value for",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}