{
    "relation": [
        [
            "",
            "NucleomaxX",
            "Placebo"
        ],
        [
            "Description",
            "Participants received NucleomaxX for uridine through week 48",
            "Participants received NucleomaxX placebo through week 48"
        ]
    ],
    "pageTitle": "Effects of a Uridine Supplement on HIV Infected Adults With Lipoatrophy - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00307164?sect=X3015&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00049-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 861268169,
    "recordOffset": 861251775,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups A total of 167 subjects were randomized, and results are reported for 165 eligible participants; two subjects never started study medication and were excluded from all analyses. The subjects were stratified by antiretroviral therapy use, stavudine (d4T) or zidovudine (AZT/ZDV). Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details Recruited at AIDS Clinical Trials Units in the United States and Puerto Rico. Recruitment occurred between October 5, 2006 (date first subject was randomized) and January 7, 2008 (date last subject was randomized). Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: NucleomaxX Drug: NucleomaxX placebo Interventions: HIV Infections Lipoatrophy",
    "textAfterTable": "Participant Flow:   Overall Study     NucleomaxX     Placebo   STARTED     83     82   COMPLETED     68     68   NOT COMPLETED     15     14   Death                 1                 0   Severe debilitation, unable to continue                 1                 0   Subject/parent not able to get to clinic                 2  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}