{
    "relation": [
        [
            "",
            "Charlotte",
            "Helen",
            "Caroline Mary",
            "John Henry",
            "Robert",
            "Constance",
            "Sidney",
            "Winifred Emily M",
            "Frederick Stanley Montague",
            "Mildred",
            "Arthur R",
            "Waldo John",
            "Dorothy Marjorie"
        ],
        [
            "",
            "1871",
            "1872",
            "1875",
            "1877",
            "1878",
            "1879",
            "1881",
            "1883",
            "1885",
            "1887",
            "1888",
            "1890",
            "1892"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "The Clements family of Dullingham, Cambridgeshire",
    "title": "",
    "url": "http://freepages.genealogy.rootsweb.ancestry.com/~mugridge/clements.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00132-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 103968031,
    "recordOffset": 103888985,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{512752=ELIZA CLEMENTS 1849-1912, 338063=Married William Rowland Cook (b 1866 in) on 14/12/1891 in St Peter, Fulham., 233434=JAMES H CLEMENTS abt. 1866-????, 52550=HAROLD NUNN 26/06/1914-1914, 589462=In 1901 Catherine was still employed as a cook in the same house by the same employer. He must have treated her well for her to stay that long. Class: RG13; Piece: 630; Folio: 102; Page: 40., 528821=In 1871 Charles was possibly employed as a servant at Hill Farm, Kirtling, Cambridgeshire. This was the home of widow Emma Collin and her children. I am convinced this is the right Charles, as his brother William was employed at the same place 10 years earlier. Class: RG10; Piece: 1594; Folio: 84; Page: 23; GSU roll: 829811., 615441=In 1881 Robert could well have been a boarder at Railway Row, Shotton, Durham. This was the home of Edward Peachey (coal miner) and his family. Robert was also employed as a coal miner. Edward Peachey, his wife and eldest children were all born in Wood Ditton so I believe I have the right Robert here. Class: RG11; Piece: 4966; Folio: 75; Page: 44; GSU roll: 1342194., 769039=In 1871 Charles and Martha were living in the Estate Cottage,Dullingham with their daughters Georgina and Elizabeth. Charles was still employed as a carpenter. Class: RG10; Piece: 1594; Folio: 56; Page: 11; GSU roll: 829811., 281617=Christened there on 29/08/1880., 118654=ALFRED ARTHUR ALEY 1889-????, 39096=Audrey suffered a brain haemorrhage on 24/02/2008 and died several hours later in her local hospital. Audrey had been out the evening before with her friends for a few drinks and some socialising. She and her friends would always call one another each day to check on them. When Audrey's friend phoned her and got no reply, she became worried and Audrey was discovered collapsed., 455341=In 1901 Harry, (as he was named in this census), was living in the bank House, Claughton Street, St Helens, Lancashire with his parents and siblings Charlotte, Ellen, Robert, Constance, Sidney, Winifred, Frederick, Mildred, Arthur, Waldo and Dorothy. Harry was employed as a commercial clerk. Class: RG13; Piece: 3521; Folio: 65; Page: 11., 710805=In 1881 Martha and George were living in Ayot Bury, Ayott St Peters, Hertfordshire with their children George, Charles, William and Clement. Also living in the house were servants by the name of Edith Seer (domestic) and Bertha Seer (nursemaid). George was employed as a farm bailiff. Class: RG11; Piece: 1428; Folio: 66; Page: 2; GSU roll: 1341347., 442877=EMILY GERTRUDE CLEMENTS 1880-????, 176004=Possibly married in Q4 1910 in the Ely reg district. Unfortunately Oliver is the only person currently transcribed on that page on Free BMD., 105104=Horace died in Hammersmith, London in 1982., 182586=Christened there on 07/06/1874., 109005=FRANCES MARY STUBBINGS 1905-????+++, 312706=In 1901 Bertie was living in Little Ditton, Wood Ditton with his parents and siblings John, Henry, Thomas, Gertrude, Grace and Mabel. Class: RG13; Piece: 1537; Folio: 113; Page: 13., 482131=In 1871 Frederick was living at ? Cottage, Dullingham with his widowed father and siblings Mary Ann, James, Albert and Emma. Class: RG10; Piece: 1594; Folio: 59; Page: 17; GSU roll: 829811., 439873=ALFRED HADFIELD CLEMENTS 1885-1885, 390362=In 1891 Alice was employed as a domestic servant at 9 Heathfield Gardens, Chiswick, London. This was the home of Frederick Walter Walden (commercial traveller) and his family. Class: RG12; Piece: 1033; Folio 206; Page 10; GSU roll: 6096143., 355434=In 1891 Alice was living at 8 Sylvan Villas, Chitts Hill, Tottenham, London with her parents and siblings Hubert, Edmond, Ethel, Allida, Daisy and Ernest. Also living there was Susan Perry (general domestsic servant). Class: RG12; Piece: 1079; Folio 117; Page 42; GSU roll: 6096189., 436093=In 1901 Bertha was employed as a ? assistant in an outfitters shop in 13-18 Castle Square, Brighton. Amongst the many employees was her sister Flora. Class: RG13; Piece: 934; Folio: 78; Page: 5., 359767=In 1871 Henry was living in Denmark Terrace, Hammersmith, London with his parents and brother William. Class: RG10; Piece: 59; Folio: 35; Page: 9; GSU roll: 824573., 590494=In 1861 Catherine was living in Ditton Green, Wood Ditton with her parents and siblings Charles, Noah, Elizabeth, Emily, Gabriel and Elijah. Class: RG9; Piece: 1031; Folio: 157; Page: 7; GSU roll: 542740., 56412=ELSIE MAY DEWEY 30/05/1897-???, 167389=In 1901 Albert was living in the High Street, Ashley cum Silverly, Cambridgeshire with his parents. There was also a lodger named Walter King (butcher's assistant) living there. Class: RG13; Piece: 1537; Folio: 14; Page: 19., 420389=Mary died in Ayot St Peter in Q3 1877., 629299=In 1861 Caroline was employed as a servant at Grey ? Lane, Holburn, Middlesex. This was the home of Charles Ruth Crick (butcher) and his family. Class: RG9; Piece: 186; Folio: 64; Page: 2; GSU roll: 542588., 140856=In 1901 Charles was living at 4 Albert Street, Chesterfield with his mother, step father, brother William and half sister Hannah. Charles was employed as a pony driver in a coal mine. Class: RG13; Piece: 3248; Folio: 61; Page: 24., 477819=Married Marian Heath (b 08/06/1862 in Chesterfield, Derbyshire) on Christmas Day 1879 in Chesterfield., 182547=In 1881 James was living in Wentworth with his parents and siblings John, Clara, Eliza, Jonas and Robert. Class: RG11; Piece: 1683; Folio: 74; Page: 1; GSU roll: 1341402., 26341=After the accident Eddie was given a desk job which he did not like and on 31/12/1974 Chief Technician L E Smithson was discharged form the RAF, at his own request. His conduct was stated as exemplary., 405136=In 1901 Matilda and Alfred were living at 76 St Philips Road, Exning, Suffolk with their children Rose, Alfred, Bertie, Frank and Cecil. Alfred was employed as a groom. Class: RG13; Piece: 1541; Folio: 65; Page: 54., 707051=In 1841 Mary Ann was living in Little Ditton, Wood Ditton with her parents and siblings John, Matilda, Agnes and Betsey. Class: HO107; Piece 65; Book: 6; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 9; Folio: 7; Page: 10; Line: 5; GSU roll: 241222., 876504=In 1841 Eleanor was possibly living in Stetchworth, Cambridgeshire with her son Charles. Eleanor was living by independeant means Class: HO107; Piece 71; Book: 8; Civil Parish: Stetchworth; County: Cambridgeshire; Enumeration District: 6; Folio: 4; Page: 3; Line: 13; GSU roll: 241224., 330412=JANE LONG 02/05/1882- 23/08/1949, 268714=In 1901 baby Frederick was living in the School House, Stetchworth with his parents and siblings Thomas, Harry, Ellen, Ada, Alfred and Robert. Class: RG13; Piece: 1537; Folio: 91; Page: 5., 312793=BERTIE FRANK PRICE 1891-????, 136470=FRANK WILLIAM JACOBS 1893-????, 442784=In 1881 Emily was living at 202 Ormskirk Road, Pemberton, Lancashire with her parents and siblings Frederick and baby Edith. Class: RG11; Piece: 3779; Folio: 17; Page: 28; GSU roll: 1341904., 788491=In 1841 Matilda and Abraham were living in Little Ditton, Wood Ditton, Cambridgeshire with their children Mary, John, Matilda, Agnes and Betsey. Abraham was employed as an agricultural labourer. Class: HO107; Piece 65; Book: 6; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 9; Folio: 7; Page: 10; Line: 5; GSU roll: 241222., 132158=Married Kathleen Nina Plummer (b 19/02/1902 at 21 Norfolk Road, Littlehampton, west Sussex) in Amersham, Buckinghamshire on 18/05/1921., 118569=In 1891 Alfred was living in 3 Rosa Cottages, Lisburn Road, Newmarket All Saints with his parents and siblings (half siblings?) Lily and Fanny. Class: RG12; Piece: 1294; Folio 77; Page 39; GSU roll: 6096404., 470206=In 1881 Emma was employed as a domestic servant in The Victoria Hotel, High Street, Claylane, Derbyshire. The hotel was run by William Sears and his family. Class: RG11; Piece: 3427; Folio: 136; Page: 20; GSU roll: 1341819., 105184=Did Horace marry Gladys M Bannier in Q2 1940 in the Fulham reg district?, 294692=Sarah died in 1948, possibly in Stillington but certainly in County Durham. She was 78 years old., 451582=In 1901 Winifred was living in the bank House, Claughton Street, St Helens, Lancashire with her parents and siblings Charlotte, Ellen, Harry, Robert, Constance, Sidney, Frederick, Mildred, Arthur, Waldo and Dorothy. Class: RG13; Piece: 3521; Folio: 65; Page: 11., 872134=Ann died in Dullingham on 14/04/1867., 281708=JAMES THOMAS STUBBINGS 1880-????, 590533=Christened there on 10/09/1854., 56320=In 1901 Elsie was living in Honey Hill, Wimblington, Cambridgeshire with her parents, half siblings Annie and James and sisters Agnes and Maggie. Class: RG13; Piece: 1550; Folio: 24; Page: 2., 715700=Married George Knowles (b 19/11/1843 in The Willows, Cookham Bray, Berkshire) in the Parish Church of All Saints, Newmarket on 02/08/1873., 512648=Christened there on 06/05/1849., 416206=In 1891 Alice was living in the Red Lion Publice House, waters End, Hemel Hempstead, Hertfordshire with her parents and siblings Charles, William and Clement. Class: RG12; Piece: 1124; Folio 88; Page 12; GSU roll: 6096234., 295384=In 1901 Sarah and Thomas were living in Hind Hill Bransdale on the Yorkshire moors with their children Robert, John, George, Minnie and Thomas. Thomas was a tailor and Cow keeper. Class: RG13; Piece: 4552; Folio: 65; Page: 5., 372927=In 1901 John and Margaret were living in Yellow Hall, Aukland St Andrew, County Durham with their son John. John was employed as a general carter. Class: RG13; Piece: 4646; Folio: 22; Page: 36., 21876=Brenda married Royston Stanway Arnold (b abt 1937 in Darlington, Yorkshire) in Q4 1961 in the same district., 700298=Married George Simpson Brightwell (b abt. 1849 in Brandon, Norfolk) in Q4 1868 in the Newmarket reg district., 286125=In 1891 George was living in Ditton Green, Wood Ditton with his parents and brother James. George was employed as an agricultural labourer. Class: RG12; Piece: 1292; Folio 101; Page 3; GSU roll: 6096402., 726893=In 1861 Francis was possibly working (listed as boy) in Sloane Street, Chelse, London. This was the home of James Wale (grocer) and his family. Francis was employed as an apprentice on ? Class: RG9; Piece: 36; Folio: 2; Page: 1; GSU roll: 542561., 132341=In 1901 Charles was living at 6 Caroline Place Mews, Paddington with his parents and siblings George and Nellie (Ellen?). Class: RG13; Piece: 16; Folio: 63; Page: 24., 466729=In 1881 Ellen was living in Dullingham with her parents. Class: RG11; Piece: 1674; Folio: 52; Page: 12; GSU roll: 1341400., 704164=In 1841 Agnes was living in Little Ditton, Wood Ditton with her parents and siblings Mary, John, Matilda and Betsey. Class: HO107; Piece 65; Book: 6; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 9; Folio: 7; Page: 10; Line: 5; GSU roll: 241222., 849622=Married Robert Stubbings (b 1825 in Dullingham) on 16/07/1847 in Dullingham. Robert was Ann's cousin and the son of her father's sister Frances., 512609=In 1851 Eliza was living in the High Street, Dullingham with her parents. Class: HO107; Piece: 1762; Folio: 62; Page: 26; GSU roll: 193654., 420487=MARY CATHERINE KNOWLES 27/08/1877-1877, 440012=MAGGIE MAY CLEMENTS 1884-1884, 105007=GEORGE C LONG 1920-1965, 272913=In 1881 Annie was living at 6 Engleheart Road, Lewisham with her parents and siblings George, Emma, John and Henry. There was also a lodger named James Jeffers (carman). Class: RG11; Piece: 734; Folio: 152; Page: 45; GSU roll: 1341171., 171127=ELIZABETH CLEMENTS 1887-????, 505086=In 1881 Elizabeth was living in Dullingham with her parents and siblings Eliza and Mary Ann. Also in the house was Charles Clements, either a son or nephew. Class: RG11; Piece: 1674; Folio: 52; Page: 12; GSU roll: 1341400., 352178=In 1891 Allida was living at 8 Sylvan Villas, Chitts Hill, Tottenham, London with her parents and siblings Alice, Hubert, Edmond, Ethel, Daisy and Ernest. Also living there was Susan Perry (general domestsic servant). Class: RG12; Piece: 1079; Folio 117; Page 42; GSU roll: 6096189., 832038=In 1871 John was still living in the same place and was employed as an agricultural labourer. Class: RG10; Piece: 1595; Folio: 78; Page: 13; GSU roll: 829811., 493474=Married Sarah Marshall (b 28/04/1857 in Chesterfield, Derbyshire) on 29/09/1874 in Chesterfield., 761551=Charles then married Sophia Cocksedge (b 1834 in Hessett, Suffolk) on 20/07/1875 in Chesterfield, Derbyshire. Sophia was a widow with 6 children., 411857=Married Alfred Aley (b 17/02/1862 in Harlow, Essex) on 08/09/1887 in the Parish Church, Newmarket. Alfred was a groom. The witnesses at their wedding were Harry Brightwell and Anne Brightwell (possibly Matilda's half siblings)., 625550=In 1861 James was still living in Saxon Street with his parents and siblings Sarah, Jane and Robert. Class: RG9; Piece: 1031; Folio: 171; Page: 35; GSU roll: 542740., 612351=In 1841 Charles was living in Little Ditton, Wood Ditton, Cambridgeshire with his parents. Class: HO107; Piece 65; Book: 6; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 9; Folio: 7; Page: 10; Line: 23; GSU roll: 241222., 337980=I cannot find the family in 1901, but that is not surprising as I don't know where William was born to narrow down the search!, 65185=Cyril died in 1977., 516371=In 1881 Edward (as he was named in this census) and Rebecca were either living with or at the home of Rebecca's parents in Saxon Street, Wood Ditton. Edward was employed as a non domestic gardener. Class: RG11; Piece: 1675; Folio: 89; Page: 31; GSU roll: 1341401., 691679=In 1851 Robert was living in Little Ditton with his parents and siblings Mary Ann, John, Matilda, Agnes, Betsey, William, Abraham and Charles. Class: HO107; Piece: 1762; Folio: 105; Page: 19; GSU roll: 193654., 182686=JAMES WHETSTONE 1874-????, 330329=In 1891 Jane was living at 10 Moylens Road, Fulham, London with her parents and siblings Amelia, William, Mary, Rose, Ruby and baby John. Class: RG12; Piece: 47; Folio 109; Page 47; GSU roll: 6095157., 52725=Married Joyce Pursglove in Q3 1940 in the Halifax reg district, West Yorkshire., 26132=After leaving the Air Force, Eddie and Betty bought their first house at 9 Applewood Close, St Leonards on Sea, Sussex. They bought this on 01/04/1976 for £13,850-00, 580669=In 1891 Thomas and Eliza were living in the High Street, Stetchworth, Cambridgeshire with their childrenThomas, Agnes, Harry and Ellen. Thomas was employed as a carpenter. Class: RG12; Piece: 1292; Folio 86; Page 5; GSU roll: 6096402., 171034=In 1891 Elizabeth was living in Bridlington Road, Beeston with her parents and siblings Ellen, Emma, Arthur, Aaron, Alice and baby Clara. Class: RG12; Piece: 3953; Folio 19; Page 8; GSU roll: 6099063., 160570=In 1901 Biddy was employed as a housemaid at 5 Park Side, St Andrew the Less, cambridge. This was the home of Edward Wilmott and his large family. Number 5 was the home of his mother in law, who Biddy worked for, it appears. Class: RG13; Piece: 1528; Folio: 139; Page: 10., 112675=MARGARET ELLEN HOWE 1893-????+++, 52638=Frederick died in Halifax in 1999., 359841=HENRY SMITH 1880-????, 797415=In 1871 Robert and Alice were living in Park Paddock,Chevely All Saints, Cambridgeshire with Robert's son John. Robert was employed as a groom and Alice was a laundress. Class: RG10; Piece: 1595; Folio: 46; Page: 39; GSU roll: 829811., 182769=Alice did not live very long, being both born and dying in Q4 1871., 316530=In 1901 Henry was living in Little Ditton, Wood Ditton with his parents and siblings John, Thomas, Gertrude, Grace, Bertie and Mabel. Henry was still employed as an agricultural labourer. Class: RG13; Piece: 1537; Folio: 113; Page: 13., 737999=Robert died in the Presccott reg district, Lancashire in 1923., 233229=In 1871 James was lodging in Jarvis's Yard, Newmarket with his father. This was the home of Willian Swan (agricultural labourer) and his wife. Class: RG10; Piece: 1596; Folio: 85; Page: 12; GSU roll: 829811., 198281=In 1871 Clara and her mother were visitors in Saxon Street, Wood Ditton, Cambridgeshire. This was the home of Thomas (carpenter) and Harriet Clements. Class: RG10; Piece: 1595; Folio: 88; Page: 34; GSU roll: 829811., 272983=ANNIE THOMAS 1877-????, 225572=JAMES BIRD 1874-????, 198320=Christened there on 21/06/1868., 541861=In 1861 William was employed as a groom at Hill Farm, Kirtling, Cambridgeshire. This was the home of William George Collin (farmer of 250 acres, employing 11 men, 6 boys and 4 girls) and his family. Class: RG9; Piece: 1031; Folio: 83; Page: 25; GSU roll: 542740., 420598=Married Gertrude Smith (b abt 1880) in 1913 in Amersham., 325175=John enlisted in the Army to serve his country. I believe his service number was 21433 and he joined the Royal Fusiliers (City of London Regiment), 20th Battalion., 719363=EMMA SUSAN CLEMENTS 1854-????, 832114=Ann died in Wood Ditton in 1870 and was burioed there on 30/01/1870., 361369=In 1881 William was living at 41 Marsborough Road, Hammersmith with his parents and siblings Ellen, Arthur and Henry. Visiting that day was their aunt, Eliza Stubbings (servant). Class: RG11; Piece: 59; Folio: 6; Page: 8; GSU roll: 1341013., 704203=Christened there on 04/03/1838., 281836=Alice died in Wood Ditton in 1923 and was buried there on the 10th March., 108836=ADA ALICE STUBBINGS 1907-????+++, 4130=Yvonne died in 2010., 351752=In 1881 Norman was living at 5 Chatteris Road, Islington with his parents and siblings Arthur, Amy, Alice, Edmond, Ethel and Daisy. Class: RG11; Piece: 276; Folio: 118; Page: 36; GSU roll: 1341060., 312460=MABEL MAY PRICE 1895-????, 684646=In 1871 Mary Ann and Samuel were living in Ashley, Cambridgeshire with Mary Ann's children John and Kate (although they are named as Samuel's children) and their daughter Alice. Samuel was employed as a castrator. Class: RG10; Piece: 1599; Folio: 88; Page: 3; GSU roll: 829813., 647134=In 1861 Susannah was living in Saxon Street with with her parents and siblings Mary Ann, John, Alice, James, Adeliza and Harry. Class: RG9; Piece: 1031; Folio: 168; Page: 30; GSU roll: 542740., 105347=David died in Surrey in 1978., 478024=In 1871 Albert was living at ? Cottage, Dullingham with his widowed father and siblings Mary Ann, Jane, Frederick and Emma. Class: RG10; Piece: 1594; Folio: 59; Page: 17; GSU roll: 829811., 132453=CHARLES WILLIAM KNOWLES 14/07/1897-1959, 832389=In 1861 John and Ann were living in the same place. Ann's niece, Elizabeth was also there which leads me to believe she lived with the couple. John was still employed as an agricultural labourer. Class: RG9; Piece: 1031; Folio: 160; Page: 14; GSU roll: 542740., 65308=Married Bessie M Wright (b 1901 in Ipswich) in Ipswich in 1926., 355648=In 1881 Alice was living at 5 Chatteris Road, Islington with her parents and siblings Arthur, Amy, Edmond, Ethel, Norman and Daisy. Class: RG11; Piece: 276; Folio: 118; Page: 36; GSU roll: 1341060., 769285=In 1861 Charles and Martha were living in Stoney Street, Dullingham with their children Eliza, Maryann, Georgina and Eleanor. Charels was still employed as a carpenter. Class: RG9; Piece: 1031; Folio: 48; Page: 4; GSU roll: 542740., 225478=Christened there on 01/03/1874., 141119=In 1891 Charles was at the home of his maternal grandfather, John Bennet, with his widowed mother, brother William and his aunt Mary Bennett. The address was 3 Swan Yard, Chesterfield. Class: RG12; Piece: 2760; Folio 45; Page 48; GSU roll: 6097870., 876204=Eleanor possibly died in the Newmarket reg district in 1861., 273281=In 1881 Henry was living at 6 Engleheart Road, Lewisham with his parents and siblings George, Emma, John and Annie. There was also a lodger named James Jeffers (carman). Class: RG11; Piece: 734; Folio: 152; Page: 45; GSU roll: 1341171., 872343=Richard died in 1852 in Dullingham., 118345=In 1901 Alfred was living at 76 St Philips Road, Exning, Suffolk with his parents and siblings Rose, Bertie, Frank and Cecil. Class: RG13; Piece: 1541; Folio: 65; Page: 54., 440155=ALFRED GEORGE CLEMENTS 1883-1883, 704287=AGNES STUBBINGS 1839-1855, 316809=In 1891 Henry was living in Little Ditton, Wood Ditton with his parents and siblings George, John, Mary, Sarah, Charles, Thomas, Gertie and baby Grace. Henry was employed as an agricultural labourer. Class: RG12; Piece: 1292; Folio 105; Page 12; GSU roll: 6096402., 442577=In 1891 Emily was living at 186 Manchester Road, Ince in Makerfield, Lancashire with her parents and siblings Frederick, Edith, Nellie, Margaret, Alfred and Charles. Also there was a 15 year old domestic servant named Kate Haskin, who was said to be a daughter, but I think that is wrong. Class: RG12; Piece: 3061; Folio 89; Page 15; GSU roll: 6098171., 466590=In 1891 Ellen was still living in Dullingham with her parents. Ellen was employed as a domestic servant.S Class: RG12; Piece: 1292; Folio 58; Page 18; GSU roll: 6096402., 691266=Christened there on 08/07/1849, 451256=FREDERICK STANLEY MONTAGUE CLEMENTS 1885-????, 481885=Married Hannah Charlesworth (b 03/02/1866 in Chesterfield, Derbyshire) on 03/03/1884 in Chesterfield., 589756=In 1891 Catherine was employed as a cook (seems most of the sisters chose this trade and in Surrey too) at Tilburstow Lodge, Godstone, Surrey. This was the home of Stock Broker's Agent Edward B Forbes and his family. Class: RG12; Piece: 583; Folio 27; Page 30; GSU roll: 6095693., 105424=DAVID JOHN LONG 04/06/1913-1978, 225439=In 1871 James was living at Broomstick Hall, Cheveley with her widowed mother and siblings Mary, Ann and William. Lodging there was John Clements (carpenter), brother of his mother. Class: RG11; Piece: 1674; Folio: 40; Page: 22; GSU roll: 1341400., 608039=Christened there on 17/07/1845., 629595=In 1851 Caroline was living in Saxon Street, Wood Ditton with her parents and siblings Richard, Susan, Sarah, James and Jane. there was also a visitor that day by the name of William Coe who was only 2 months old. Class: HO107; Piece: 1762; Folio: 117; Page: 43; GSU roll: 193654., 351832=WILLIAM NORMAN WALLER 1878-????, 198420=CLARA WHETSTONE 1868-????, 108703=LAVINIA STUBBINGS 1909-????+++, 704373=Matilda died in Wood Ditton in 1852 and was buried there on 16/03/1852., 858645=In 1851 Thomas quite possibly a servant in Chesham, Buckinghamshire. He was living their with his wife and son Francis. This was the home of Henry Garret Key (gentleman). Class: HO107; Piece: 1717; Folio: 305; Page: 31; GSU roll: 193625., 294401=In 1881 Walter was living with his parents and siblings William, Sarah, John and Richard in Hind House, Hartlepool, County Durham. Class: RG11; Piece: 4912; Folio: 4; Page: 6; Line: ; GSU roll: 1342182., 749570=In 1891 Susanna and William were living in Dullingham with their daughter Ellen. William was employed as an agricultural labourer. Class: RG12; Piece: 1292; Folio 58; Page 18; GSU roll: 6096402., 608000=In 1851 Noah was living in Little Ditton, Wood Ditton with his parents and siblings Charles, Phoebe, George and Elizabeth. Also living there was a lodger named Martin Allard (agricultural labourer) who was possibly a relative of his mother. Class: HO107; Piece: 1762; Folio: 107; Page: 22; GSU roll: 193654., 625218=Married Rachel Finch (b abt 1849 in Wood Ditton) in Q1 1874 in the West Ham reg district, London., 405410=In 1891 Matilda and Alfred were living in 3 Rosa Cottages, Lisburn Road, Newmarket All saints with their children Lily, Fanny and Alfred. Alfred senior was employed as a groom in a racing stable. Class: RG12; Piece: 1294; Folio 77; Page 39; GSU roll: 6096404., 691228=In 1851 Charles was living in Little Ditton with his parents and siblings Mary Ann, John, Matilda, Agnes, Betsey, William, Abraham and Robert. Class: HO107; Piece: 1762; Folio: 105; Page: 19; GSU roll: 193654., 273351=HENRY THOMAS 1875-????, 65389=CYRIL LEWIS GREEN 19/09/1901-1977, 182359=In 1891 James was living in Main Street, Wentworth with his parents and siblings James, Eliza and Oliver and his niece Florence. James was employed as a farm labourer. Class: RG12; Piece: 1297; Folio 63; Page 2; GSU roll: 6096407., 435760=FLORA ANNIE CLEMENTS 1881-????, 470412=In 1871 Emma was living at ? Cottage, Dullingham with her widowed father and siblings Mary Ann, James, Frederick and Albert. Class: RG10; Piece: 1594; Folio: 59; Page: 17; GSU roll: 829811., 61004=RUTH KIDMAN 1891-???, 206162=Married Frederick Kidman (b abt. 1864 in Hilton, Huntingdonshire) in the Ely reg district in Q4 1890., 706759=In 1851 Mary Ann was living in Little Ditton with her parents and siblings John, Matilda, Agnes, Betsey, William, Abraham, Robert and Charles. Class: HO107; Piece: 1762; Folio: 105; Page: 19; GSU roll: 193654., 171444=Private Aaron Clements was wounded in action and died of his wounds on 11/07/1916 in France and Flanders. Aaron was buried in St Sever Cemetery, Rouen, France. Here is his CWGC page., 415967=In 1901 Alice was either living or in the house of 28 & 29 Lit(?) Marylebone Street, Marylebone, London. This was the home of her brother William and his wife. Alice was employed as a dressmaker. Class: RG13; Piece: 103; Folio: 19; Page: 30., 136384=In 1901 Frank was visiting his maternal grandparents on census day. He was in Station Road, Dullingham and his sister Elsie was also with him. Class: RG13; Piece: 1537; Folio: 49; Page: 18., 749785=In 1881 Susan and William were living in Dullingham still with their daughter Ellen. William was employed as an agricultural labourer. Class: RG11; Piece: 1674; Folio: 52; Page: 12; GSU roll: 1341400., 608228=Christened there on 19/05/1844., 691452=Robert died in the Newmarket reg district (so quite possibly in Wood Ditton) in 1855., 505306=Christened there on 08/09/1861., 390516=In 1881 Alice was living in Saxon Street, Wood Ditton with her parents. Class: RG11; Piece: 1675; Folio: 83; Page: 20; GSU roll: 1341401., 761830=Harriet died in Dullingham on 21/03/1869., 726632=I cannot find Francis is 1871., 141197=CHARLES NUNN 1886-????, 615824=1871 is another of those wrong preview images. Very, very frustrating. I think the person sorting the Stubbings must have had too much to drink the night before and wasn't thinking clearly. Having said that, I have found a suitable candidate for Robert but he appears in the household as son in law yet his status is unmarried! Robert was working as an agricultural labourer., 849869=In 1841 Ann was living in Dullingham with her parents and brother Francis Class: HO107; Piece 71; Book: 7; Civil Parish: Dullingham; County: Cambridgeshire; Enumeration District: 2; Folio: 10; Page: 14; Line: 15; GSU roll: 241224., 112984=SARAH MAY HOWE 1891-????+++, 849908=Christened there on 21/05/1826., 612087=In 1851 Charles was living in Little Ditton, Wood Ditton with his parents and siblings Phoebe, George, Noah and Elizabeth. Also living there was a lodger named Martin Allard (agricultural labourer) who was possibly a relative of his mother. Class: HO107; Piece: 1762; Folio: 107; Page: 22; GSU roll: 193654., 282026=George then married widow Alice Mary Wise (Woollard) (b abt. 1867 in) on 17/07/1911 in Wood Ditton. The witnesses at their wedding were Harry Braybrooke and Alice Rebecca Braybrooke., 295144=In 1911 Sarah and Thomas were still living at Wind Hill with their children Percy, Blanche, Phoebe, Ethel, Walter and baby Albert. Thomas was working as a tailor still, as his own boss., 105264=HORACE GEORGE LONG 12/05/1916-1982, 726594=Married Sarah Ann Fuller (b 1852 in Kennington, Surrey) in Q3 1879 in the Lambeth reg district, London., 719701=In 1881 Emily was living at 4 Meath Street, Battersea with her mother. Also living there was a lodger by the name of Thomas Hargreaves (Mechanical draughtsman E & M Mkr). Emily was employed as a hairdresser. Class: RG11; Piece: 647; Folio: 66; Page: 45; GSU roll: 1341149., 590621=CATHERINE STUBBINGS 1854-1922, 330575=Mary Ann died in London on 01/06/1949., 312376=In 1901 Mabel was living in Little Ditton, Wood Ditton with her parents and siblings John, Henry, Thomas, Gertrude, Grace and Bertie. Class: RG13; Piece: 1537; Folio: 113; Page: 13., 440261=I strongly believe that Nellie died in the the Prescot reg district, Lancashire in Q4 1911., 359587=In 1881 Henry was living at 41 Marsborough Road, Hammersmith with his parents and siblings Ellen, William and Arthur. Visiting that day was their aunt, Eliza Stubbings (servant). Class: RG11; Piece: 59; Folio: 6; Page: 8; GSU roll: 1341013., 761781=In 1871 Charles was living at ? Cottage, Dullingham with his children Mary Ann, James, Frederick, Albert and Emma. Charles was employed as a labourer. Class: RG10; Piece: 1594; Folio: 59; Page: 17; GSU roll: 829811., 528480=Married Mary Ellen Gowland (b Aike, Yorkshire) in Q 1876 in the Driffield reg district., 823610=In 1871 James and Mary were still living in Saxon Street with their children Alice and Harry. Also in the house that day were the grandchildren Ellen Smith, James B Stubbings and Agnes Ada Goddard (Maria's daughter and I strongly suspect the others are Alice's children). Both James and Harry were employed as agricultural labourers. Class: RG10; Piece: 1595; Folio: 85; Page: 28; GSU roll: 829811., 56767=In 1901 Agnes was living in Honey Hill, Wimblington, Cambridgeshire with her parents, half siblings Annie and James and sisters Elsie and Maggie. Class: RG13; Piece: 1550; Folio: 24; Page: 2., 108572=WILLIAM STUBBINGS 1909-????+++, 646925=Married George Price (b 1847 in Wood Ditton) in Wood Ditton on 06/11/1869. The witnesses at their wedding were Charles Gibbons and Fanny Bonnet. George was a farmer when they married., 156424=Married either Sarah Smith (b abt 1875 in Hucknall under Huthwaite, Nottinghamshire) in Q4 1899 in the Mansfield reg district, Nottinghamshire., 872300=In 1861 Ann was living with her son Charles and his family in Stoney Street, Dullingham. Class: RG9; Piece: 1031; Folio: 47; Page: 2; GSU roll: 542740., 451159=In 1891 Frederick was living at 6 Kings Road, Eccleston with his parents and siblings Charlotte, Ellen, Caroline, Henry, Robert, Constance, Sidney, Winifred, Mildred, Arthur and Waldo. Boarding with them was a widow named Agnes Richardson (living on her own means). Class: RG12; Piece: 3017; Folio 30; Page 10; GSU roll: 6098127., 431558=Married Ellen Ann Carter (b 04/02/1871 at 2 Hyde Park Square Mews, Paddington, London) on 14/03/1896 in the Registry Office in St George Hanover Square, London. At the time of his marriage, George had been living at 27 Ennismore Mews, Ennismore Gardens and Ellen at the same address as she was born., 542081=In 1851 William was living in Cheveley Green, Cheveley with his parents and siblings Thomas, Susanna, John, Betsy, Mary and baby Charles. Class: HO107; Piece: 1762; Folio: 169; Page: 19; GSU roll: 193654., 294580=WALTER GEORGE ASHMAN 1873-????, 338288=In 1891 Amelia was living at 10 Moylens Road, Fulham, London with her parents and siblings Amelia, William, Mary, Jane, Rose, Ruby and baby John. Class: RG12; Piece: 47; Folio 109; Page 47; GSU roll: 6095157., 876128=ANN CLEMENTS abt 1788-14/04/1867, 608142=NOAH STUBBINGS 1845-1915, 325427=In 1901 John was living at 72 Protheroe Road, North West Fulham with his parents and siblings William, Mary and Ruby. His half sister, Agnes lived elsewhere in the same house with her family. Class: RG13; Piece: 55; Folio: 12; Page: 16., 348117=Married Archibald Craig (b abt. 1873 in Fulham, London) on 14/04/1895 at St Barnabas, Kensington, London ., 285906=Married Jessie Gertrude Talbot (b abt. 1878 in Barrow, Suffolk) in Q4 1900 in the Twingoe reg district, Suffolk., 233005=In 1881 James was was boarding at 7 Grosvenor Yard, Newmarket St Mary, with his father. This was the home of widow Susan Turner. James was employed as a butcher's boy. Class: RG11; Piece: 1677; Folio: 11; Page: 15; GSU roll: 1341401., 361112=In 1891 William was living at 88 Blythe Road, Hammersmith with his parents and siblings Arthur, Harry, Eliza and James. There was also a boarder named Albert Penfold living in the house. William was employed as a labourer. Class: RG12; Piece: 39; Folio 55; Page 10; GSU roll: 6095149., 481925=I cannot find Frederick in 1881., 691352=CHARLES STUBBINGS 1849-1855, 431594=I cannot find George in 1891, 625369=In 1871 James was an acting sergeant at New Windsor Clewer, Berkshire. Class: RG10; Piece: 1302; Folio: 73; Page: 12; GSU roll: 838775., 769510=In 1851 Charles and Martha were living in the High Street, Dullingham with their daughter Eliza. Charles was employed as a carpenter journeyman. Class: HO107; Piece: 1762; Folio: 62; Page: 26; GSU roll: 193654., 282098=Jessie died in Wood Ditton in 1905 and was buried on 22nd April., 420848=In 1901 Charles was still living with his parents this time in The Hare and Hounds, Union Street, Amersham, Buckinghamshire. Charles was an assistant publican, his father being the publican. Class: RG13; Piece: 1335; Folio: 6; Page: 4., 112898=In 1901 Sarah was living in Saxon Street with her parents and siblings Percy, Arthur, Margaret, Albert and Ruby. Class: RG13; Piece: 1537; Folio: 116; Page: 20., 160283=Biddy married in Cambridge in Q1 1910. Her husband may have been Charles King OR another ( only one gtoom on the page)., 505267=In 1871 Elizabeth was living in the Estate Cottage,Dullingham with her parents and sister Georgina. Class: RG10; Piece: 1594; Folio: 56; Page: 11; GSU roll: 829811., 132683=In 1901 George was living at 6 Caroline Place Mews, Paddington with his parents and siblings Charles and Nellie (Ellen?). Class: RG13; Piece: 16; Folio: 63; Page: 24., 529297=Christened there on 29/09/1850., 470735=In 1911 Albert was keeping the Wheatsheaf Hotel in Newbold, Chesterfield, Derbyshire., 831649=Married Mary Nunn (b abt. 1816 in Wood Ditton, Cambridgeshire) in Wood Ditton on 21/11/1833. The witnesses at their wedding were John Stubbings and Elizabeth Stubbings., 404734=Alfred died in 1929. He had been a turf correspondent., 443357=In 1901 Frederick was living at 10 Freckleson Street, Wigan with his parents and siblings Emily, Edith, Nellie, Margaret, Alfred, Charles and Robert. Frederick was employed as a mecahnical engineer. Class: RG13; Piece: 3558; Folio: 55; Page: 8., 53099=Charles died in 1933 in Sutton in ashfield, Nottinghamshire., 64549=ANNIE DOROTHY BIRD 1896-????, 684354=In 1881 Mary Ann and Samuel were living in Saxon Street, Wood Ditton with their daughter Alice. Samuel was still employed as a castrator. Class: RG11; Piece: 1675; Folio: 83; Page: 20; GSU roll: 1341401., 505454=Eleanor possibly died in Dullingham in Q2 1861., 355919=In 1871 Alice was living at 5 Moray(?) Road, Islington, with her parents and siblings Arthur and Amy. Also living there was a servant by the name of Sarah Barber (personal domestic servant). Class: RG10; Piece: 299; Folio: 28; Page: 50; GSU roll: 824927., 703549=BETSEY STUBBINGS 1840-1876, 144688=Sarah died in Q2 1938 in Bentley, Doncaster, South Yorkshire., 109508=In 1901 John was living in Yellow Hall, Aukland St Andrew, County Durham with his parents. Class: RG13; Piece: 4646; Folio: 22; Page: 36., 512224=In 1881 Eliza was living in Dullingham with her parents and sisters Mary Ann and Elizabeth. Also in the house was Charles Clements, either a son or nephew. Mary Ann was working as a laundress. Class: RG11; Piece: 1674; Folio: 52; Page: 12; GSU roll: 1341400., 171725=Possibly married Florence Marson in Q3 1911 in the Skirlaugh reg district, East Riding of Yorkshire., 351491=DAISY ELIZABETH WALLER 1880-????, 113403=In 1891 Arthur was living in saxon Street, Wood Ditton with his parents, half sister Alice and brother Percy. Class: RG12; Piece: 1292; Folio 111; Page 24; GSU roll: 6096402., 317108=HENRY WALTER PRICE 1877-????, 248070=MATILDA STUBBINGS 07/05/1865-????, 401381=In 1901 John (going by the surname Starling) was at the home of his sister Kate and her family in Saxon Street. John was employed as a general farm labourer. Class: RG13; Piece: 1537; Folio: 116; Page: 20., 505392=ELIZABETH CLEMENTS 1861-1889, 56854=AGNES MARY DEWEY 1895-???, 282227=In 1901 George and Jessie were living in Ditton Green, Wood Ditton. Class: RG13; Piece: 1537; Folio: 108; Page: 3., 454861=In 1881 Robert was living in Knowsley Road, Eccleston in Prescott, Lancashire with his parents and siblings Charlotte, Ellen (Helen), Caroline, Henry and Constance. Class: RG11; Piece: 3730; Folio: 94; Page: 51; GSU roll: 1341893., 871617=JOHN CLEMENTS 1809-1829, 294183=I cannot find him anywhere in the 1891 census., 876019=Christened there on 29/06/1788., 419941=In 1891 William was living in the Red Lion Publice House, waters End, Hemel Hempstead, Hertfordshire with his parents and siblings Charles, Clement and Alice. Class: RG12; Piece: 1124; Folio 88; Page 12; GSU roll: 6096234., 313325=In 1891 baby Grace was living in Little Ditton, Wood Ditton with her parents and siblings George, John, Henry, Mary, Sarah, Charles, Thomas and Gertie . Class: RG12; Piece: 1292; Folio 105; Page 12; GSU roll: 6096402., 118031=Alfred very likely died in the Newmarket reg district in Q1 1933., 616043=Christened there on 17/09/1851., 589038=In 1861 Elijah was living in Ditton Green, Wood Ditton with his parents and siblings Charles, Noah, Elizabeth, Emily, Gabriel and Catherine. Class: RG9; Piece: 1031; Folio: 157; Page: 7; GSU roll: 542740., 590026=In 1881 Catherine was employed as a cook at 1 South Terrace, Kingston on Thames, Surrey. This was the home of Edgar H Howell (Managing Director of Wholesale Drapery Warehouse) and his family. Class: RG10; Piece: 796; Folio: 61; Page: 44; GSU roll: 827744., 831688=Christened there on 20/10/1811., 144762=Fred died in Hucknall under Huthwaite, Nottinghamshire in Q2 1925., 529398=CHARLES CLEMENTS 1850-????, 858393=In 1861 Thomas and Ann were living in Blackwell Little Cottage, Chesham.Thomas was employed as a gardener. Class: RG9; Piece: 846; Folio: 55 B; Page: 2; GSU roll: 542710., 360741=CHARLES ARTHUR E SMITH 1876-????, 888978=Reuben died in 1842 in Dullingham., 390828=ALICE FRANCES STARLING 1868-????, 616004=In 1861 Robert was still living in Saxon Street with his parents and siblings Sarah, James and Jane. Class: RG9; Piece: 1031; Folio: 171; Page: 35; GSU roll: 542740., 875980=Married Richard Nunn (b abt 1789 in Great Wilbraham, Cambridgeshire) on 06/07/1820 in Dullingham., 466405=Married Frank Jacobs (b abt. 1868 in Dullingham, Cambridgeshire) in the Newmarket reg district in Q2 1892., 272622=This family were very difficult to trace after 1881, so much so that I found nothing else on them. Most frustrating!, 329909=ROSE LYDIA LONG 13/06/1884-07/07/1970, 338643=ALICE AMELIA LONG 1874-1951, 390736=Christened there on 07/06/1868., 628908=In 1841 Susan was living in Wood Ditton with her parents and siblings Richard and Caroline. Class: HO107; Piece 65; Book: 7; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 10; Folio: 10; Page: 15; Line: 18; GSU roll: 241222. P>In 1851 Susan was living in Saxon Street, Wood Ditton with her parents and siblings Richard, Caroline, Sarah, James and Jane. there was also a visitor that day by the name of William Coe who was only 2 months old. Class: HO107; Piece: 1762; Folio: 117; Page: 43; GSU roll: 193654., 183175=In 1871 William was living in Wentworth with his father and siblings John and Mary. Also there that day was his aunt, Emily Clemence. Class: RG10; Piece: 1603; Folio: 80; Page: 1; GSU roll: 829814., 470592=Albert died on 08/02/1936 in Chesterfield., 823894=In 1861 James and Mary were still living in Saxon Street with their children Mary Ann, John, Alice, James, Susannah, Adeliza and Harry. James was employed as an agricultural labourer, as was his son John. Class: RG9; Piece: 1031; Folio: 168; Page: 30; GSU roll: 542740., 197863=Married Thomas William Kidman in Q1 1889 in the Ely reg district., 888936=In 1851 Ellen was living in the High Street in Dullingham. Ellen was working as a laundress. Class: HO107; Piece: 1762; Folio: 59; Page: 20; GSU roll: 193654., 435682=In 1891 Flora was still living at 67 East Street, Brighton with her parents and siblings Bertha, Albert, Violet, Sylvia and Minnie. I believe the accommodation was either behind or above a shop, which their father managed. Class: RG12; Piece: 813; Folio 10; Page 14; GSU roll: 6095923., 269146=ROBERT STUBBINGS 1896-????, 692189=In 1881 Abraham and Hannah were living at 2 Ruse's Cottages, Newmarket All Saints with Abraham's father. Abraham was listed as a former bricklayer. Class: RG11; Piece: 1675; Folio: 46; Page: 40; GSU roll: 1341401., 360398=In 1891 Arthur was living at 88 Blythe Road, Hammersmith with his parents and siblings William, Harry, Eliza and James. There was also a boarder named Albert Penfold living in the house. Class: RG12; Piece: 39; Folio 55; Page 10; GSU roll: 6095149., 329826=In 1891 Rose was living at 10 Moylens Road, Fulham, London with her parents and siblings Amelia, William, Mary, Jane, Ruby and baby John. Class: RG12; Piece: 47; Folio 109; Page 47; GSU roll: 6095157., 542405=Christened there on 21/03/1841., 183214=Christened there on 07/11/1869., 588817=In 1871 Elijah was still living in Ditton Green with his parents and siblings Gabriel and Thomas. Lodging there again was Martin Allard (agricultural labourer). Elijah was employed as an agricultural labourer. Class: RG10; Piece: 1595; Folio: 75; Page: 8; GSU roll: 829811., 313092=In 1901 Grace was living in Little Ditton, Wood Ditton with her parents and siblings John, Henry, Thomas, Gertrude, Bertie and Mabel. Henry was still employed as an agricultural labourer. Class: RG13; Piece: 1537; Folio: 113; Page: 13., 703648=Agnes died in the Newmarket reg district (so quite possibly in Wood Ditton) in 1855., 22379=BRENDA SMITHSON 20/10/1937-abt 2005, 122064=ELLEN KNOWLES 1899-????, 470642=Hannah died in Chesterfield on 29/05/1926., 160109=BARNARD ASHER BARRETT 1884-????, 737418=In 1861 Alfred was living in Wattlesborough Heath, Albesbury, Shropshire with his mother and brothers Robert and Frederick. His father was away working as a butler on census day. Also living there was a servant named Ann Griffiths. Class: RG9; Piece: 1865; Folio: 12; Page: 17; GSU roll: 542879., 8435=In 1996 he changed his job to taxi driving which he did for 4 years. Ill health forced him to quit that job and he is now severley disabled with a bad heart, arthritus and a degenaration of the spine., 53161=Married Gladys Edna Holt (b 25/05/1909 in Nottingham)., 269061=In 1901 Robert was living in the School House, Stetchworth with his parents and siblings Thomas, Harry, Ellen, Ada, Alfred and baby Frederick. Class: RG13; Piece: 1537; Folio: 91; Page: 5., 625113=In 1881 James and Rachel were living at 15 Quilter Street, Bethnal Green, London. There were also 2 boarders living there, George Machin (labourer) and William Eaton (labourer). James was a Police Constable. Class: RG11; Piece: 413; Folio: 12; Page: 17; GSU roll: 1341089., 160017=In 1891 Barnard was living in Boro End, Borough Green with with his parents and siblings Dan, Maggie, Abner, Biddie, Effie and Horace. Class: RG12; Piece: 1292; Folio 20; Page 11; GSU roll: 6096402., 152446=In 1901 Fred was a boarder in George Street, Sutton in Ashfield, Nottinghamshire. This was the home of William Cutts (coal miner hewer) and his family. Fred was also employed as a coal miner, hewer. Class: RG13; Piece: 3138; Folio: 106; Page: 35., 140526=In 1891 William was at the home of his maternal grandfather, John Bennet, with his widowed mother, brother Charles and his aunt Mary Bennett. The address was 3 Swan Yard, Chesterfield. Class: RG12; Piece: 2760; Folio 45; Page 48; GSU roll: 6097870., 871497=Possibly died in 1829 in Dullingham. There is a John of the correct age buried there in 1829., 470534=EMMA NUNN 27/03/1863-????, 167700=ALBERT EDWARD G P CLEMENTS 1899-????, 118156=In 1911 Alfred was living at Lordship Farm, Dullingham, Cambridgeshire with his parents and siblings Frank and Cecil., 226104=In 1881 William was living at Broomstick Hall, Cheveley with her widowed mother and siblings Mary, Ann and James. Lodging there was John Clements (carpenter), brother of his mother. Class: RG11; Piece: 1674; Folio: 40; Page: 22; GSU roll: 1341400., 338552=In 1881 Amelia (as she was named in this census) was living at 5 Swan Passages,St George Hanover Square, London with her parents, half sister Agnes and siblings William and baby Mary. Class: RG11; Piece: 94; Folio: 78; Page: 14; GSU roll: 1341021., 317021=In 1881 Henry was living in Little Ditton, Wood Ditton with his parents and siblings Eliza, William, Ellen, George, John and Mary. Class: RG11; Piece: 1675; Folio: 79; Page: 11; GSU roll: 1341401., 132763=GEORGE KNOWLES 1895-12/02/1933, 611763=In 1861 Charles was living in Ditton Green, Wood Ditton with his parents and siblings Noah, Elizabeth, Emily, Gabriel, Catherine and Elijah. Charles was employed as an agricultural labourer. Class: RG9; Piece: 1031; Folio: 157; Page: 7; GSU roll: 542740., 286691=Possibly married in the Newmarket reg district (quite possibly Wood Ditton) in Q4 1907 to either Francis James Frost OR Thomas Bailey. Must check the 1911 census to see if I can determine the groom., 175429=CHARLES WILLIAM CLEMENTS 1877-????, 121991=In 1901 Nellie (Ellen?)was living at 6 Caroline Place Mews, Paddington with her parents and siblings George and Charles. Class: RG13; Piece: 16; Folio: 63; Page: 24., 607409=Married Elizabeth Murkin (b abt. 1848 in Dullingham, Cambridgeshire) in Q1 1870 in the Newmarket reg district., 113213=In 1901 Arthur was still living in Saxon Street with his parents and siblings Percy, Sarah, Margaret, Albert and Ruby. Class: RG13; Piece: 1537; Folio: 116; Page: 20., 529258=In 1851 baby Charles was living in Cheveley Green, Cheveley with his parents and siblings Thomas, Susanna, William, John, Betsy and Mary. Class: HO107; Piece: 1762; Folio: 169; Page: 19; GSU roll: 193654., 616136=ROBERT CHARLES STUBBINGS 1851-????, 871536=Christened there on 29/01/1809., 542366=In 1841 baby William was living in Cheveley Green, Cheveley with her parents and siblings Eleanor, Thomas and Susan. Class: HO107; Piece 65; Book: 2; Civil Parish: Cheveley; County: Cambridgeshire; Enumeration District: 7; Folio: 9; Page: 12; Line: 3; GSU roll: 241222., 355995=ALICE MARY WALLER 1869-????, 137096=DOROTHY NUNN 1905-????, 60918=In 1901 Ruth was living in West Fen Drove, Isle of Ely with her parents, half sister Florence and sisters Ethel, Edith and Ada. Also living there was her paternal grandfather, William Kidman. Her mother's brother Oliver was also in the house on census day. Class: RG13; Piece: 1544; Folio: 37; Page: 8., 390697=In 1871 Alice was living in Ashley, Cambridgeshire with her parents and half siblings John and Kate. Class: RG10; Piece: 1599; Folio: 88; Page: 3; GSU roll: 829813., 628947=Christened there on 15/03/1840., 512453=In 1861 Eliza was living in Stoney Street, Dullingham with her parents and siblings Maryann, Georgina and Eleanor. Class: RG9; Piece: 1031; Folio: 48; Page: 4; GSU roll: 542740., 470998=In 1901 Albert and Marian were living in Littlemoor, Newbold and Dunston, Derbyshire with their children Harriet, Frederick, Oliver, James and Ellen. Albert was employed as a coal shaver (below ground). Class: RG13; Piece: 3250; Folio: 96; Page: 4., 691803=ROBERT STUBBINGS 1847-1855, 684107=In 1891 Mary Ann was living in Saxon Street with her mother and her son John. Also living there was her nephew James (the son of her sister Alice? The age fits.) Mary Ann was working as a charwoman. Class: RG12; Piece: 1292; Folio 112; Page 26; GSU roll: 6096402., 182808=Christened there on 09/11/1871., 439636=In 1891 Margaret was living at 186 Manchester Road, Ince in Makerfield, Lancashire with her parents and siblings Frederick, Emily, Edith, Nellie, Alfred and Charles. Also there was a 15 year old domestic servant named Kate Haskin, who was said to be a daughter, but I think that is wrong. Class: RG12; Piece: 3061; Folio 89; Page 15; GSU roll: 6098171., 858208=In 1871 Thomas and Ann were living in the Gardeners Lodge, Blackwell Hall, Chesham. Thomas was still employed as a gardener (domestic). Class: RG10; Piece: 1394; Folio: 84; Page: 28; GSU roll: 828502., 529038=In 1861 Charles was living in Cheveley Green, Cheveley with his parents and siblings Thomas, Susan, John, Mary, Oliver, Joseph and Emma. Class: RG9; Piece: 1031; Folio: 40; Page: 19; GSU roll: 542740., 629031=SUSAN STUBBINGS 1840-????, 750185=In 1871 Susan was living in Own Cottage, Dullingham with her children Emma, Ellen and baby Frank. I believe this was probably the same house as 10 years ago and her parents and grandmother still lived next door. Class: RG10; Piece: 1594; Folio: 56; Page: 11; GSU roll: 829811. William was away working at the Vicarage when the census was taken. He was employed as a gardener and groom., 443097=Possibly married in the Wigan reg district in Q1 1903 to either Margaret Mawdesley OR Mary Naylor., 616255=Jane died in Q3 1881 in Hartlepool., 140563=WILLIAM NUNN 1890-????, 431896=In 1881 George was living in Ayot Bury, Ayott St Peters with his parents and siblings Charles, William and Clement. Also living in the house were servants by the name of Edith Seer (domestic) and Bertha Seer (nursemaid). Class: RG11; Piece: 1428; Folio: 66; Page: 2; GSU roll: 1341347., 684135=Samuel died in 1884., 52826=FREDERICK RICHARD NUNN 1912-1999, 571732=JOHN S STUBBINGS 1856-???, 505686=Christened there on 14/08/1859., 109265=WILLIAM STUBBINGS 1901-????+++, 117873=In 1901 Bertie was living at 76 St Philips Road, Exning, Suffolk with his parents and siblings Rose, Alfred, Frank and Cecil. Class: RG13; Piece: 1541; Folio: 65; Page: 54., 616212=John possibly died in Q3 1890 in the Darlington reg district., 60461=ETHEL KIDMAN 1892-???, 611404=In 1871 Charles and Mary were living in Ditton Green. They had a lodger named James Ginn, quite possibly Mary's brother (a woodman). Charles was employed as an agricultural labourer. Class: RG10; Piece: 1595; Folio: 74; Page: 6; GSU roll: 829811., 144439=EMMA NUNN 1882-1882, 317405=In 1901 John was living in Little Ditton, Wood Ditton with his parents and siblings Henry, Thomas, Gertrude, Grace, Bertie and Mabel. John was still employed as an agricultural labourer. Class: RG13; Piece: 1537; Folio: 113; Page: 13., 590273=In 1871 Catherine was employed as a kitchen maid at Cheam House, Cheam, Surrey. This was the home of Spencer C Wilde (attourney, solicitor and land owner) and his wife. Class: RG10; Piece: 796; Folio: 61; Page: 44; GSU roll: 827744., 171942=In 1901 Aaron was employed as a horseman on a farm in Low ?, Kirby Grindalythe, Yorkshire. This was the home of David Kitchen (farm manager) and his family. Class: RG13; Piece: 4537; Folio: 85; Page: 2., 122174=Charles died in Paddington, London in 1959., 404906=In 1911 Matilda and Alfred were living in Lordship Farm, Dullingham, Cambridgeshire with their children Alfred, Frank and Cecil. Alfred was employed as a stableman., 505647=In 1861 Eleanor was living in Stoney Street, Dullingham with her parents and siblings Eliza, Maryann and Georgina. Class: RG9; Piece: 1031; Folio: 48; Page: 4; GSU roll: 542740., 902222=Married Sarah Balls (b abt. 1735 in Cambridgeshire (?) in Dullingham on 28/10/1751., 450814=In 1901 Frederick was living in the bank House, Claughton Street, St Helens, Lancashire with his parents and siblings Charlotte, Ellen, Harry, Robert, Constance, Sidney, Winifred, Mildred, Arthur, Waldo and Dorothy. Frederick was employed as a commercial clerk. Class: RG13; Piece: 3521; Folio: 65; Page: 11., 691718=Christened there on 14/02/1847., 889264=In 1841 Reuben and Ellen were living in Dullingham with their children Francis and Ann. Reuben was a parish clerk. Class: HO107; Piece 71; Book: 7; Civil Parish: Dullingham; County: Cambridgeshire; Enumeration District: 2; Folio: 10; Page: 14; Line: 15; GSU roll: 241224., 416296=ALICE ZILPAH KNOWLES 1884-????, 330112=I cannot find Jane in 1901., 104938=George died in London in 1965, 175328=In 1881 Charles was living in a cottage in Beeford, Driffield with his parents and siblings Ellen and Emma. Class: RG11; Piece: 4792; Folio: 74; Page: 3; GSU roll: 1342156. . This house was the one next door to his parents and siblings. Class: RG12; Piece: 3953; Folio 20; Page 9; GSU roll: 6099063., 431959=Born in Ayot St Peter, Hertfordshire, about 12th March., 542486=WILIAM CLEMENTS 1841-????, 719269=In 1861 Susan was living with her mother (can't find her father in this census) at 1 Chapel Place North, St George Hanover Square, Mayfair, London and siblings Emily, Louisa and Ellen. Also there were lodgers by the names of Elizabeth Meek (governess), Stephen walker (formerly a butler), Marian Darcus (fund holder) and Nannette Leithead (can't decipher her occupation). Class: RG9; Piece: 45; Folio: 73; Page: 24; GSU roll: 542562., 589257=Catherine very likely died in 1922 in the Chertsey reg district, Surrey., 167607=In 1891 Albert was living in Coach Lane, Little Green, Cheveley with his parents. Also living there was lodger Charles Hurst (bricklayer). Class: RG12; Piece: 1292; Folio 40; Page 8; GSU roll: 6096402., 401113=KATE STUBBINGS 1865-????, 325004=John died in France in 1917. I believe he died on 16/04/1917 in France and Flanders. He was a Lance Corporal. His record on the CWGC is here, 182890=ALICE WHETSTONE 1871-1871, 844848=In 1851 Ann and Robert were living in Wood Ditton, Cambridgeshire with their daughter Martha. Robert was employed as an agricultural labourer. Class: HO107; Piece: 1762; Folio: 124; Page: 56; GSU roll: 193654., 286306=In 1881 George was living in Mill Road, Wood Ditton with his parents and siblings Eliza and James. Class: RG11; Piece: 1675; Folio: 81; Page: 16; GSU roll: 1341401., 122123=Kathleen died in Amersham Hospital in 1984., 703875=In 1851 Agnes was living in Little Ditton with her parents and siblings Mary Ann, John, Matilda, Betsey, William, Abraham, Robert and Charles. Class: HO107; Piece: 1762; Folio: 105; Page: 19; GSU roll: 193654., 707090=Christened there on 26/06/1831., 454939=ROBERT CLEMENTS 1878-????, 871703=Christened there on 08/03/1807., 294129=In Q2 1897 he married Harriet Johnson in the Hartlepool reg district., 360134=In 1901 Charles was living at 88 Blythe Road with with his parents and siblings Henry, Eliza and James. Charles was employed as a bricklayer, like his father. Class: RG13; Piece: 49; Folio: 40; Page: 5., 52985=PERCY NUNN 14/10/1904-1904, 113493=ARTHUR SAMUEL HOWE 1889-????+++, 330077=Jane died in Clapham, London on 23/08/1949., 351410=In 1881 Daisy was living at 5 Chatteris Road, Islington with her parents and siblings Arthur, Amy, Alice, Edmond, Ethel and Norman. Class: RG11; Piece: 276; Folio: 118; Page: 36; GSU roll: 1341060., 831790=JAMES STUBBINGS 1811-1889, 286345=Christened there on 20/09/1874., 360655=In 1881 Arthur was living at 41 Marsborough Road, Hammersmith with his parents and siblings Ellen, William and Henry. Visiting that day was their aunt, Eliza Stubbings (servant). Class: RG11; Piece: 59; Folio: 6; Page: 8; GSU roll: 1341013., 290267=PHOEBE ANN ASHMAN 1875-????, 432024=GEORGE ROBERT KNOWLES 1875-1959, 182963=I believe William died in the Ely reg district in Q2 1878., 60600=Did Ruth marry Charles Brown in Q4 1913 in the St Ives reg district, Huntingdonshire?, 109134=JAMES STUBBINGS 1903-????+++, 442991=I believe Thomas died in Q3 1926 in the Wigan reg district., 737677=In 1851 Alfred and his brother Robert were visitors at the house of John Roberts (gardender for H Lyter Esq) and his family. Robert's parents were working nearby for Henry Lyter. Class: HO107; Piece: 1991; Folio: 135; Page: 26; GSU roll: 87392., 691960=Abraham died in the Newmarket reg district in 1881,as did his father., 624826=In 1891 James and Rachel were living in Bishops Road, Bethnal Green, London. James was a messenger in the Guardians office. Rachel was employed as a caretaker (possibly of the offices). It looks like they were living above the Guardians office. Class: RG12; Piece: 271; Folio 61; Page 1; GSU roll: 6095381., 824163=In 1851 James and Mary were living in Saxon Street, Wood Ditton with their children William, Mary Ann, John, Maria, Sarah, Alice and James. James was employed as an agricultural labourer. Class: HO107; Piece: 1762; Folio: 111; Page: 31; GSU roll: 193654., 902315=REUBEN CLEMENTS abt. 1735-????, 589077=Christened there on 26/10/1856., 420243=In 1881 William was living in Ayot Bury, Ayott St Peters with his parents and siblings George, Charles and Clement. Also living in the house were servants by the name of Edith Seer (domestic) and Bertha Seer (nursemaid). Class: RG11; Piece: 1428; Folio: 66; Page: 2; GSU roll: 1341347., 198050=In 1881 Clara was living in Wentworth with her parents and siblings John, James, Eliza, Jonas and Robert. Class: RG11; Piece: 1683; Folio: 74; Page: 1; GSU roll: 1341402., 22024=Brenda married Thomas A Davidson in Q4 1955 in the Durham South Eastern reg district. I don't know if there was a divorce or Thomas died but, 225841=In 1891 William was at the home of his uncle, Robert Bir (garden labourer) in Cheveley Street, Cheveley. William was employed as a wheelwright. Class: RG12; Piece: 1292; Folio 37; Page 2; GSU roll: 6096402., 290179=In 1881 Phoebe may well have been living with her aunt and uncle, Susan and James Ellard in Park Street, Chatteris, Cambridgeshire. I have checked the BMDs and there is a marriage for a Susan Stubbings to a James Ellard so could this be the correct Phoebe, given that her mother was a sister to Susan Stubbings? RG11; Piece: 1688; Folio: 101; Page: 10; GSU roll: 1341403., 505770=ELEANOR CLEMENTS 1859-1861, 831865=John died in Wood Ditton and was buried there on 05/12/1875., 737769=ALFRED CLEMENTS 1850-????, 863226=Married Ann ? (b abt 1818 in Waterbeach, Cambridgeshire), 512260=I cannot find Eliza in 1871., 401010=Christened there on 14/05/1865., 286430=GEORGE STUBBINGS 1874-????, 356256=In 1881 Amy was living at 5 Chatteris Road, Islington with her parents and siblings Arthur, Alice, Edmond, Ethel, Norman and Daisy. Class: RG11; Piece: 276; Folio: 118; Page: 36; GSU roll: 1341060., 589169=THOMAS ELIJAH STUBBINGS 1856-????, 611493=Married Mary Ginn (b 1835 in Kirtling, Cambridgeshire) in Kirtling on 14/11/1868., 435381=In 1901 Flora was employed as a ? assistant in an outfitters shop in 13-18 Castle Square, Brighton. Amongst the many employees was her sister Bertha. Class: RG13; Piece: 934; Folio: 78; Page: 5., 268810=FREDERICK WILLIAM STUBBINGS 1900-????, 420336=WILLIAM FRANCIS KNOWLES 1878-????, 152185=Married Sarah Ellen waterfall (b 30/12/1876 in Belper, Derbyshire) on 25/04/1903 in Belper., 707186=MARY ANN BRADFORD STUBBINGS 1832-????, 542608=Susan quite possibly died in Q1 1887 in the Newmarket reg district., 607676=In 1861 Noah was living in Ditton Green, Wood Ditton with his parents and siblings Charles, Elizabeth, Emily, Gabriel, Catherine and Elijah. Noah was employed as an agricultural labourer. Class: RG9; Piece: 1031; Folio: 157; Page: 7; GSU roll: 542740., 117951=BERTIE ALEY 1892-????, 439727=MARGARET ANN CLEMENTS 1887-1907, 400971=In 1871 Kate was living in Ashley, Cambridgeshire with her mother, step father, brother John and half sister Alice. Class: RG10; Piece: 1599; Folio: 88; Page: 3; GSU roll: 829813., 871789=ELIZABETH CLEMENTS 1807-????, 159803=In 1901 Barnard was living in the same place with his parents and siblings Dan, Maggie, Abner, Horace, Dolcie and Nina. Barnard was employed as a milkman on a farm. Class: RG13; Piece: 1537; Folio: 23; Page: 10., 802630=William died in Wood Ditton in 1826 of smallpox. He was buried there on 20/08/1826., 358705=In 1891 Eliza was living at 88 Blythe Road, Hammersmith with her parents and siblings William, Arthur, Harry and James. There was also a boarder named Albert Penfold living in the house. Class: RG12; Piece: 39; Folio 55; Page 10; GSU roll: 6095149., 161715=In 1881 Abner was living in Boro End, Borough Green with his parents and siblings Dan, Fanny, Maggie and Arthur. Class: RG11; Piece: 1674; Folio: 6; Page: 6; GSU roll: 1341400., 226690=I cannot find Annie in 1901., 232336=CLARA BIRD 1864-????, 362278=In 1881 Ellen was living at 41 Marsborough Road, Hammersmith with her parents and siblings William, Arthur and Henry. Visiting that day was their aunt, Eliza Stubbings (servant). Class: RG11; Piece: 59; Folio: 6; Page: 8; GSU roll: 1341013., 311774=EDITH STUBBINGS 1880-1881, 153048=Arthur died in the Nottingahm reg district in 1937., 721562=In 1891 Francis and Sarah were living at the same place with their children Bertha, Flora, Albert, Violet, Sylvia and Minnie. I am now more certain than ever that this was also a shop as on the premsises were 3 servants and 4 assistants. Francis was employed as a grocery and provisions manager. Class: RG12; Piece: 813; Folio 10; Page 14; GSU roll: 6095923., 269749=In 1901 Ada was living in the School House, Stetchworth with her parents and siblings Thomas, Harry, Ellen, Alfred, Robert and baby Frederick. Class: RG13; Piece: 1537; Folio: 91; Page: 5., 64077=In 1940 James was a member of the R.A.F., 421450=In 1881 Charles was living in Ayot Bury, Ayott St Peters with his parents and siblings George, William and Clement. Also living in the house were servants by the name of Edith Seer (domestic) and Bertha Seer (nursemaid). Class: RG11; Piece: 1428; Folio: 66; Page: 2; GSU roll: 1341347., 844578=In 1861 Robert was living in Garden House, ? Park, Newmarket All saints, Cambridgeshire with his children Martha, Mary and John. Also there was Robert's niece, Mary Stubbings. Robert was emoployed as a horsekeeper. Class: RG9; Piece: 1031; Folio: 123; Page: 21; GSU roll: 542740., 324253=MARY ELIZA PRICE 1871-????, 630354=In 1871 Richard was a lodger at King George, New Conduit Street, Kings Lynn, Norfolk. He is described as a sergeant in the Grenadier Guards. Unfortunately I cannot give the census details as Ancestry has the wrong image on the record detail and I don't know how to find the information on the actual image., 117538=In 1901 Frank was living at 76 St Philips Road, Exning, Suffolk with his parents and siblings Rose, Alfred, Bertie and Cecil. Class: RG13; Piece: 1541; Folio: 65; Page: 54., 438839=In 1901 Alfred was living at 186 Manchester Road, Ince in Makerfield, Lancashire with his parents and siblings Frederick, Emily, Edith, Nellie, Margaret and Charles. Also there was a 15 year old domestic servant named Kate Haskin, who was said to be a daughter, but I think that is wrong. Class: RG12; Piece: 3061; Folio 89; Page 15; GSU roll: 6098171., 404102=In 1871 Harry was living at the home of his maternal grandfather in Black Barn Lane, Newmarket St Marys with his parents, half sister Matilda and his uncle Abraham Stubbings. Class: RG10; Piece: 1596; Folio: 46; Page: 19; GSU roll: 829811., 777978=In 1861 John and Emily were living in the same place with their children Thomas, Susan, John, Mary, Charles, Oliver, Joseph and Emma. John was employed as a carpenter, as was his son Thomas. Class: RG9; Piece: 1031; Folio: 40; Page: 19; GSU roll: 542740., 513691=CHARLES WILLIAM LAKE 1846-????, 219072=In 1891 John was a roomer in West Fen, Isle of Ely, Cambridgeshire. This was the home of William Kidman(agricultural labourer) and his family. (Turns out this was his sister Mary and her husband). John was employed as an agricultural labourer Class: RG12; Piece: 1297; Folio 36; Page 13; GSU roll: 6096407., 486474=James then married Elizabeth Whitworth (b 22/01/1863 in Grassmoor, Derbyshire) on 21/09/1899 in Mansfield registry Office., 209251=In 1881 Mary was employed as a general servant in Cambridge Road, Milton, Cambridgeshire. This was the home of widowed Eliza Cockle and her daughter. Class: RG11; Piece: 1661; Folio: 67; Page: 2; GSU roll: 1341396., 802668=Christened there on 10/06/1821, 478753=Hannah then married Charles Henry Arnold in December 1894., 339181=Agnes died in Fulham, London in 1937., 634165=Married Emma Walpole (b abt 1856 in Hounslow, Middlesex) in Q 2 1879 in the Fulham reg district, London., 178911=STEPHEN WHETSTONE 1875-1875, 871118=Christened there on 10/10/1813., 588527=Did Elijah marry an Anne (b abt. 1863 in Cardiganshire, South Wales) sometime between the census. I haven't found a marriage yet but the the 1891 census seems to suggest this., 106238=FRANK CRAIG 1909-????, 170155=In 1901 Alice was living in Ling Moor, Beeford with her parents and siblings Clara, John, Elsie, Ernest and Mary. Class: RG13; Piece: 4517; Folio: 5; Page: 2., 311699=In 1881 Edith was living at 33 Brewers Street, St George Hanover Square, London with her parents. Class: RG11; Piece: 101; Folio: 126; Page: 26; GSU roll: 1341023., 152982=FREDERICK RICHARD NUNN 1879-1925, 308736=In 1871 Sarah was living in Saxon Street with her parents and siblings Margaret and William. Class: RG10; Piece: 1595; Folio: 86; Page: 30; GSU roll: 829811., 456363=In 1901 Caroline was a visitor at 95 Wickham Road, deptford, London. This was the home oof widow Jane Jeffery and her family. Caroline was working as a hospital nurse. Class: RG13; Piece: 535; Folio: 102; Page: 21., 404185=HARRY BRIGHTWELL 1869-????, 64029=James died in Cambridge in 2003., 611143=In 1881 Charles and Mary were still living in Litton Ditton. James (agricultural labourer) was now a boarder, rather than a lodger. Charles was employed as an agricultural labourer. Class: RG11; Piece: 1675; Folio: 78; Page: 10; GSU roll: 1341401., 883199=In 1841 Frances and John were living in Wood Ditton with their children Elizabeth, Robert and grandson James. Class: HO107; Piece 65; Book: 6; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 9; Folio: 9; Page: 13; Line: 23; GSU roll: 241222., 358780=ELIZA SMITH 1882-????, 649616=In 1881 Alice and William were living at 5 Swan Passages,St George Hanover Square, London with Alice's daughter Agnes and their children Amelia, William and baby Mary. William was employed as a bricklayer's labourer and Alice was a laundress. Class: RG11; Piece: 94; Folio: 78; Page: 14; GSU roll: 1341021., 579816=MARTHA STUBBINGS 1848-???, 529834=In 1861 Mary was living in Cheveley Green, Cheveley with her parents and siblings Thomas, Susan, John, Charles, Oliver, Joseph and Emma. Class: RG9; Piece: 1031; Folio: 40; Page: 19; GSU roll: 542740., 113912=In 1891 Percy was living in saxon Street, Wood Ditton with his parents, half sister Alice and brother Arthur. Class: RG12; Piece: 1292; Folio 111; Page 24; GSU roll: 6096402., 135489=Did Lawrence marry Grace A Clark in Q3 1923 in Cambridge?, 315575=In 1891 Sarah was living in Little Ditton, Wood Ditton with her parents and siblings George, John, Henry, Mary, Charles, Thomas, Gertie and baby Grace. Class: RG12; Piece: 1292; Folio 105; Page 12; GSU roll: 6096402., 362352=ELLEN SMITH 1868-????, 503872=Married George Barrett (B) in Dullingham on 04/07/1873., 175006=In 1901 Charles was a boarder at 7 Kimberley Gardens, Hull, Yorkshire. This was the home of John Barnes (? carman) and his wife. Charles was employed as a railway carman. I have just discovered that this was the home of his sister Ellen and her husband. Class: RG13; Piece: 4503; Folio: 73; Page: 9., 833176=Married Mary Ann Brown (b 11/09/1809 in Cowlinge, Suffolk) on 05/06/1834 in Wood Ditton. The witnesses at their wedding were John Stubbings, Elizabeth Stubbings and Sally Stubbings., 183613=In 1901 Clara and Charles were living inHoney Hill, Wimblington, Cambridgeshire with their daughters Agnes, Elsie and Maggie and Clara's children Annie and James. Charles was employed as a yardman on a farm. Class: RG13; Piece: 1550; Folio: 24; Page: 2., 540759=In 1881 John was possibly lodging with his sister Susan and her family in in Broomstick Hall, Cheveley. John was employed as a carpenter. Class: RG11; Piece: 1674; Folio: 40; Page: 22; GSU roll: 1341400., 102303=Married Robert Henry Smithson (b 1899 in Middlesborough) in the Sedgefield reg district in Q2 1921., 844624=Ann died on 06/01/1859 in Wood Ditton., 144150=AMY NUNN 1883-1883, 483165=Elizabeth died on 06/10/1928 in Huthwaite, Sutton in Ashfield, Mansfield. Her daughter Annie was the informant of her death., 863265=Christened there on 19/04/1818., 308775=Christened there on 03/04/1870., 798209=In 1851 Robert and Ann were living in Wood Ditton, Cambridgeshire with their daughter Martha. Robert was employed as an agricultural labourer. Class: HO107; Piece: 1762; Folio: 124; Page: 56; GSU roll: 193654., 729220=In 1881 Albert and Maggie were living at 202 Ormskirk Road, Pemberton, Lancashire with their children Frederick, Emily and baby Edith. Alfred was employed as a cashier and travellor at an iron foundry. Class: RG11; Piece: 3779; Folio: 17; Page: 28; GSU roll: 1341904., 513742=Georgina died in Dullingham in 1854., 435046=In 1891 Albert was still living at 67 East Street, Brighton with his parents and siblings Flora, Violet, Sylvia and Minnie. I believe the accommodation was either behind or above a shop, which their father managed. Class: RG12; Piece: 813; Folio 10; Page 14; GSU roll: 6095923., 289352=In 1901 Phoebe was possibly visiting her aunt Susan in her home at Chatteris. Walter was not with her although Phoebe was listed as married. Phoebe was working as a lady's help. Class: RG13; Piece: 1548; Folio: 50; Page: 5., 833215=Christened there on 20/05/1810., 178827=Christened there on 02/08/1875., 351196=In 1891 Daisy was living at 8 Sylvan Villas, Chitts Hill, Tottenham, London with her parents and siblings Alice, Hubert, Edmond, Ethel, Allida and Ernest. Also living there was Susan Perry (general domestsic servant). Class: RG12; Piece: 1079; Folio 117; Page 42; GSU roll: 6096189., 421592=George died in Amersham in 1959., 802753=WILLIAM STUBBINGS 1821-1826, 274024=In 1881 Emmae was living at 6 Engleheart Road, Lewisham with her parents and siblings George, John, Henry and Annie. There was also a lodger named James Jeffers (carman). Class: RG11; Piece: 734; Folio: 152; Page: 45; GSU roll: 1341171., 871039=Married Emily Webb (b abt 1811 in Great Wilbraham, Cambridgeshire) on 11/10/1835 in Dullingham. (Record submitted by a member of the LDS Church)., 232203=In 1871 Clara was living in Hills Road, Trumpington, Cambridgeshire with her parents and siblings Mary, Annie and baby William. Class: RG10; Piece: 1584; Folio: 91; Page: 28; GSU roll: 829806., 739013=In 1881 Robert and Ellen were living in Knowsley Road, Eccleston in Prescott, Lancashire with their children Charlotte, Ellen (Helen), Caroline, Henry, Robert and Constance. Robert was employed as a bank clerk. Class: RG11; Piece: 3730; Folio: 94; Page: 51; GSU roll: 1341893., 144354=Christened there on 14/02/1882., 113722=In 1901 Percy was still living in Saxon Street with his parents and siblings Arthur, Sarah, Margaret, Albert and Ruby. Class: RG13; Piece: 1537; Folio: 116; Page: 20., 121500=SIDNEY HERBERT KNOWLES 09/08/1905-????, 694405=In 1881 George and Sarah were living in a cottage in Mill Road, Stetchworth, Cambridgeshire with George's children Harry and Annie and Susan's son, Herbert. George was employed as a general labourer., 178788=Stephen is another child who did not live very long, dieing in Q4 1875., 483222=James died on 29/04/1923 in Huthwaite, Mansfield., 867802=Emily died in Dullingham in 1875., 331274=In 1881 baby Mary was living at 5 Swan Passages,St George Hanover Square, London with his parents, half sister Agnes and siblings Amelia and William. Class: RG11; Piece: 94; Folio: 78; Page: 14; GSU roll: 1341021., 435125=ALBERT FRANK CLEMENTS 1882-????, 720400=In 1861 Emily was living with her mother (can't find her father in this census) at 1 Chapel Place North, St George Hanover Square, Mayfair, London and siblings Emily, Susan, Louisa and Ellen. Also there were lodgers by the names of Elizabeth Meek (governess), Stephen walker (formerly a butler), Marian Darcus (fund holder) and Nannette Leithead (can't decipher her occupation). Class: RG9; Piece: 45; Folio: 73; Page: 24; GSU roll: 542562., 549581=In 1871 Thomas was lodging in Jarvis's Yard, Newmarket with his son. This was the home of Willian Swan (agricultural labourer) and his wife. Thomas was employed as a carpenter. Class: RG10; Piece: 1596; Folio: 85; Page: 12; GSU roll: 829811., 232242=Christened there on 18/12/1864., 60373=In 1901 Ethel was living in West Fen Drove, Isle of Ely with her parents, half sister Florence and sisters Ruth, Edith and Ada. Also living there was her paternal grandfather, William Kidman. Her mother's brother Oliver was also in the house on census day. Class: RG13; Piece: 1544; Folio: 37; Page: 8., 438931=ALFRED GEORGE CLEMENTS 1888-????, 117638=FRANK ALEY 1896-03/07/1916, 486562=Sarah died in Hucknall under Huthwaite Mansfield, Nottinghamshire on 02/04/1896., 331373=MARY ANN LONG 21/07/1880-01/06/1949, 694492=George then married Sarah Ellen Claydon (b 1858 in Stetchworth, Cambridgeshire), 324168=In 1871 Mary was living in Little Ditton, Wood Ditton with her parents and paternal grandmother. Class: RG10; Piece: 1595; Folio: 79; Page: 15; GSU roll: 829811., 863369=THOMAS CLEMENTS 1818-????, 144315=Emma died in Brampton in Q1 1882, so she didn't live long. I believe she was probably ill at birth, hence the christening and she died soon after it., 452380=In 1901 Sidney was living in the bank House, Claughton Street, St Helens, Lancashire with his parents and siblings Charlotte, Ellen, Harry, Robert, Constance, Winifred, Frederick, Mildred, Arthur, Waldo and Dorothy. Sidney was employed as a banker's clerk. Class: RG13; Piece: 3521; Folio: 65; Page: 11., 226654=Did Annie marry in Q3 1904 in the Peterborough reg district, Cambridgeshire to either Charles Lett OR John Harry Barber?, 483301=In 1911 James was living in Blackwell Road, Huthwaite, Nottinghamshire., 720489=EMILY CLEMENTS 1850-????, 478943=In 1891 Hannah was living at 3 Swan Yard, Chesterfield with her sons Charles and William. This was the home of her widowed father, John Bennet. Her sister Mary was also living there., 308885=SARAH LOUISA ASHMAN 04/03/1870-1948, 626578=In 1871 Sarah and Walter were living in Saxon Street, next door to Walter's parents. Walter was working as an agricultural labourer and in the house with them that night was Sarah\u0092s nephew George Stubbings (parent not yet established). RG10; Piece: 1595; Folio: 83; Page: 24; GSU roll: 829811., 588344=In 1891 Elijah and Anne were living at 30 Linton Street, Christchurch, St Marylebone, London with their son Thomas Grenville. Elijah was employed as a house porter. Class: RG12; Piece: 98; Folio 56; Page 23; GSU roll: 6095208., 135668=In 1901 Lawrence was living in Brinkley, Cambridgeshire with his parents and siblings Albert, Olive and baby Stella. Class: RG13; Piece: 1537; Folio: 34; Page: 4., 29502=In 1953 Eddie was posted to Singapore and had to wait until Betty arrived the next year, having had to travel there by boat as she was pregnant with their first child. Betty left Liverpool on the SS Lancashire on 26/02/1954, travelling 3rd class, 289483=Married Walter Charles Softley in Q2 1895 in the North Witchford reg district, Cambridgeshire, quite possibly in Chatteris., 513603=In 1851 Charles was living in the High Street, Dullingham with his parents and sister Georgina. Also living there was her maternal grandmother, Eleanor Clements. Class: HO107; Piece: 1762; Folio: 61; Page: 25; GSU roll: 193654., 703118=In 1851 Betsey was living in Little Ditton with her parents and siblings Mary Ann, John, Matilda, Agnes, William, Abraham, Robert and Charles. Class: HO107; Piece: 1762; Folio: 105; Page: 19; GSU roll: 193654., 178702=ELIZA WHETSTONE 1877-????, 64166=JAMES BEALES BIRD 12/09/1915-2003, 443726=In 1891 Frederick was living at 186 Manchester Road, Ince in Makerfield, Lancashire with his parents and siblings Emily, Edith, Nellie, Margaret, Alfred and Charles. Also there was a 15 year old domestic servant named Kate Haskin, who was said to be a daughter, but I think that is wrong. Class: RG12; Piece: 3061; Folio 89; Page 15; GSU roll: 6098171., 768176=Christened there on 30/11/1823., 867714=ROBERT CLEMENTS 1813-1876, 152865=In 1881 Frederick was living in Stoers Lane, Brampton with his parents and brother Arthur. Class: RG11; Piece: 3437; Folio: 4; Page: 3; GSU roll: 1341822., 421545=CHARLES FREDERICK KNOWLES 1876-????, 504078=In 1871 Mary Ann was living at ? Cottage, Dullingham with her widowed father and siblings James, Frederick, Albert and Emma. Class: RG10; Piece: 1594; Folio: 59; Page: 17; GSU roll: 829811., 802391=In 1841 Robert was living with his parents and sister Elizabeth in Wood Ditton. Also there was a 5 year old named James a nephew or son? < Class: HO107; Piece 65; Book: 6; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 9; Folio: 9; Page: 13; Line: 23; GSU roll: 241222., 863568=In 1861 James was possibly an Able Seaman onboard a vessel in Medway, Kent. Class: RG9; Piece: 4479; Folio: 3; Page: 3; GSU roll: 543292., 707824=I cannot find John in 1901., 64334=Did Annie marry Frederick J Nunn in Q2 1919 in the Newmarket reg district and if so was there a family connection?, 170372=In 1891 Alice was living in Bridlington Road, Beeston with her parents and siblings Ellen, Emma, Arthur, Aaron, Elizabeth and baby Clara. Class: RG12; Piece: 3953; Folio 19; Page 8; GSU roll: 6099063., 478996=Frederick died in Chesterfield on 09/01/1887., 358441=In 1901 Eliza was living at 88 Blythe Road with with her parents and siblings Charles, Henry and James. Class: RG13; Piece: 49; Folio: 40; Page: 5., 768346=Christened there on 22/04/1821., 269498=ALFRED STUBBINGS 1893-????, 179181=In 1901 James and Alice were living in Cannon Street, Downham St Leonards, Cambridgeshire with their baby son James. James was employed as a stockman on a farm. Class: RG13; Piece: 1547; Folio: 124; Page: 10., 60009=FRED KIDMAN 1895-1895, 614751=HANNAH STUBBINGS 1855-????, 778223=In 1851 Thomas and Emily were living in Cheveley with their children Thomas, Susanna, William, John, Betsy, Mary and baby Charles. John was a carpenter journeyman. Class: HO107; Piece: 1762; Folio: 169; Page: 19; GSU roll: 193654., 694552=Betsy died in Q2 1876 in the Newmarket reg district., 106433=CHARLES CRAIG 1907-????, 311519=Edith died in Q3 1881 in the St George, Hanover Square reg district., 668413=In 1871 Maria and Charles were living in Denmark Terrace, Hammersmith, London with their children William and Henry. Charles was employed as a bricklayer. Class: RG10; Piece: 59; Folio: 35; Page: 9; GSU roll: 824573., 121605=FLORENCE KNOWLES 1903-????, 863607=Christened there on 10/12/1815., 55563=GEORGE FREDERICK DEWEY 18/06/1904-???, 439056=I strongly believe Margaret died in Q3 1907 in the Wigan reg district., 540982=In 1871 John was possibly employed as a groom in Saxon Street, Wood Ditton, Cambridgeshire. This was the home of widow Mary Collin (annuitant). Class: RG10; Piece: 1595; Folio: 84; Page: 26; GSU roll: 829811., 802430=Christened there on 31/07/1825., 871389=REUBEN CLEMENTS 1811-????, 469386=SELINA NUNN 1876-????, 421757=Ellen died on 04/11/1939 at 'Pella' 107 High Street, Amersham, Buckinghamshire. The cause of death was given as Coronary Thrombosis, myocarditis, bronchitis., 626270=I cannot find the couple in 1881., 226479=JAMES WILLIAM BIRD 1870-????, 882847=In 1851 John was living in Little Ditton, Cutting Green, Wood Ditton with his daughter Elizabeth and grandson James. Also living there was a lodger named William Misson. John was working as a woodman. Class: HO107; Piece: 1762; Folio: 107; Page: 23; GSU roll: 193654., 389534=John did not live very long at all and he was buried in Wood Ditton on 20/09/1863., 707789=I believe John died in the Newmarket reg district in 1925., 720871=I also believe that Sarah died in the same area in 1915., 882918=Frances died in Wood Ditton and was buried there on 13/06/1850., 614666=Christened there on 06/01/1855., 529571=CHARLES CLEMENTS 1848-1850, 135246=In 1901 Olive was living in Brinkley, Cambridgeshire with her parents and siblings Albert, Lawrence and baby Stella. Class: RG13; Piece: 1537; Folio: 34; Page: 4., 389613=Christened there on 06/09/1863. This was the day his mother was buried., 117349=In 1911 Frank was living at Lordship Farm, Dullingham, Cambridgeshire with his parents and siblings Alfred and Cecil. Frank was employed as a farm labourer., 434753=In 1901 Albert was an Ordinary Seaman aboard the Royal navy ship Majestic. Class: RG13; Piece: 5327; Folio: 95; Page: 13., 630545=In 1861 there is a Richard Stubbings in the census but no additional info on him, i.e, age, place of birth etc. Class: RG9; Piece: 1024; Folio: 112; Page: 28; GSU roll: 542739., 833408=Abraham died in 1885 in the Newmarket reg district and was buried in Wood Ditton on 29/01/1885., 55674=Maggie died in the N Witchford reg district (this covered Wimblington) in Q4 1903, aged 4 years., 161522=In 1891 Abner was living in the same place with with his parents and siblings Dan, Maggie, Biddie, Barnard, Effie and Horace. Class: RG12; Piece: 1292; Folio 20; Page 11; GSU roll: 6096402., 768260=WILLIAM CLEMENTS 1823-????, 170461=ALICE CLEMENTS 1889-????, 626229=Sarah may possibly have died in the Risbridge reg district, Cambridgeshire in 1891., 599510=Did Elizabeth marry John Thomas (b abt. 1846 in Lewisham, Kent) in Q4 1867 in the Greenwich reg district?, 610881=In 1891 Charles and Mary were still living in Litton Ditton. James was still living with them and is now listed as a brother in law (hurdle maker). Charles was employed as an railway labourer. Class: RG12; Piece: 1292; Folio 105; Page 11; GSU roll: 6096402., 354634=In 1901 I believe Herbert was boarding at 2 Merton Place, Greenwich, London. This was the home of Wiliam Long (bill poster) and his family. Herbert was employed as a solicitor's clerk It is this piece of information that leads me to believe this is the correct Herbert given his previous employment and also his brothers. Also, his mother's sister married a Long, so were these related to her? Herbert was described as a widow but I have yet to find a marriage. Class: RG13; Piece: 537; Folio: 138; Page: 34., 274315=EMMA ELIZABETH THOMAS 1871-????, 716541=MARTHA STUBBINGS 1848-abt 1924, 59921=Fred did not live very long, being born and dieing in the same quarter in 1895., 513986=In 1851 Georgina was living in the High Street, Dullingham with her parents and brother Charles. Also living there was her maternal grandmother, Eleanor Clements. Class: HO107; Piece: 1762; Folio: 61; Page: 25; GSU roll: 193654., 707716=ELLEN ANN STUBBINGS 1859-1859, 350772=In 1891 Ernest was living at 8 Sylvan Villas, Chitts Hill, Tottenham, London with his parents and siblings Alice, Hubert, Edmond, Ethel, Allida and Daisy. Also living there was Susan Perry (general domestsic servant). Class: RG12; Piece: 1079; Folio 117; Page 42; GSU roll: 6096189., 549642=Keziah died in the Newmarket reg district in Q4 1869., 183298=WILLIAM WHETSTONE 1869-1878, 721911=In 1881 Francis and Sarah were living at 67 East Street, Brighton with their baby daughter Bertha. Francis was employed as a Provisions Manager, meats. I believe this might also have been the Provisions shop as on the premises that day were 1 servant and 4 assistants. Class: RG11; Piece: 1091; Folio: 13; Page: 19; GSU roll: 1341257., 121706=EDWARD KNOWLES 1900-????, 166091=JOHN EDWARD G PALMER 1885-????, 871306=Christened there on 30/06/1811., 331578=William died in 1940 in London., 281034=Married Millicent Annie Freestone on 31/08/1911 in Wood Ditton. James was a labourer at the time of his wedding. The witnesses at the wedding were George Stubbings, Lily Margaret Freestone and Amelia Freestone., 218744=Married Sarah Sansom (b. about 1873 in Sutton, Cambridgeshire.) in Q4 1896 in Ely., 469309=In 1881 Selina was living at 25 King Street, Chesterfield with her parents and step siblings Herbert and Julia. Class: RG11; Piece: 3437; Folio: 106; Page: 77; GSU roll: 1341822., 649294=In 1891 Alice and William were living at 10 Moylens Road, Fulham, London with their children Amelia, William, Mary, Jane, Rose, Ruby and baby John. William was employed as a Law Courts Orderly. Class: RG12; Piece: 47; Folio 109; Page 47; GSU roll: 6095157., 161317=In 1901 Abner was living in the same place with his parents and siblings Dan, Maggie, Barnard, Horace, Dolcie and Nina. Abner was employed as a bricklayer. Class: RG13; Piece: 1537; Folio: 23; Page: 10., 863689=JAMES CLEMENTS 1815-????, 109590=JOHN THOMAS STUBBINGS 1899-????+++, 226312=In 1871 baby William was living in Hills Road, Trumpington, Cambridgeshire with her parents and siblings Clara, Mary and Annie. Class: RG10; Piece: 1584; Folio: 91; Page: 28; GSU roll: 829806., 64465=In 1901 Annie was living in Little Green, Cheveley with her parents. Class: RG13; Piece: 1537; Folio: 58; Page: 1., 135324=OLIVE JACOBS 1897-????, 486865=In 1891 James and Sarah were living at 66 East Street, Grassmoor, Hasland, Derbyshire with their children Arthur, Fred, James and Frank. Also there that day was James's sister, Emma. James was still working as a coal miner. Class: RG12; Piece: 2763; Folio 154; Page 66; GSU roll: 6097873., 867533=Married Sarah Maria Wareham (b 1816 in Paddington, Middlesex) in Q1 1848 in the St George Hanover Square reg district, London., 331539=Frances died on 14/01/1968 in Fulham., 144066=Christened there on 01/11/1883., 768494=Both Charles and Martha died in Dullingham in 1889., 529489=Christened there on 22/10/1848., 231995=In 1881 Clara was at 1 Westhall Street, Bury St Edmunds, Suffolk. This was the home of her uncle Joshua Bird (Manager Bury & W Suffolk Coffee House) and his wife. Clara was employed as a general servant. Class: RG11; Piece: 1843; Folio: 81; Page: 4; GSU roll: 1341446., 309222=In 1901 William may have been living as a lodger at 13 Northumberland Street Hartlepool. His job looks something like knightsoil labourer, what ever that may be. There is also a Dora Ashman boarding with him, aged 6. Could this be his daughter? His status is married. Class: RG13; Piece: 4641; Folio: 107; Page: 46., 289681=In 1891 Phoebe was living in West Park Street, Chatteris, Cambridgeshire with her uncle James Ellard and his wife Susan. Class: RG12; Piece: 1300; Folio 90; Page 8; GSU roll: 6096410., 140263=In 1901 William was living at 4 Albert Street, Chesterfield with his mother, step father, brother Charles and half sister Hannah. Class: RG13; Piece: 3248; Folio: 61; Page: 24., 802531=ROBERT STUBBINGS 1825-???, 655622=In 1871 Alice was still living in Saxon Street with her parents and brother Harry. Also in the house that day were her niece Ellen Smith (daughter of her sister Maria), Agnes Goddard (parent yet to be discovered, but I strongly suspect she was Alice's daughter) and James (who I believe was her son). Class: RG10; Piece: 1595; Folio: 85; Page: 28; GSU roll: 829811., 152695=In 1891 Fred was living at 66 East Street, Grassmoor, Hasland, Derbyshire with his parents and siblings James and Frank. Also there that day was Fred's aunt, Emma Nunn. Class: RG12; Piece: 2763; Folio 154; Page 66; GSU roll: 6097873., 703445=Christened there on 02/02/1840., 226392=Christened at St Paul, Cambridge on 27/11/1870., 703406=In 1841 Betsey was living in Little Ditton, Wood Ditton with her parents and siblings Mary, John, Matilda and Agnes. Class: HO107; Piece 65; Book: 6; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 9; Folio: 7; Page: 10; Line: 5; GSU roll: 241222., 591655=In 1871 Gabriel was still living in Ditton Green with his parents and siblings Gabriel, Elijah and Thomas. Lodging there again was Martin Allard (agricultural labourer). Gabriel was employed as an agricultural labourer. Class: RG10; Piece: 1595; Folio: 75; Page: 8; GSU roll: 829811., 121809=Married Albert Dyche (b abt. 1898) on 01/01/1925, 833297=JOHN STUBBINGS 1810-1875, 529450=Possibly died in Cheveley in Q1 1850., 871220=REUBEN CLEMENTS 1813-1872, 166004=In 1891 John was living in Bedlam Square, Burwell, Cambridgeshire with his parents and siblings William, Robert and Lily. Class: RG12; Piece: 1293; Folio 42; Page 16; GSU roll: 6096403., 350850=ERNEST WALLER 1886-????, 707628=Christened there on 30/01/1859., 274236=In 1871 Emma was living in Drift Way, Lewisham with her parents and brother George. was also a lodger named George Thomas (carman). Class: RG10; Piece: 767; Folio: 71; Page: 45; GSU roll: 824731., 439267=In 1901 Margaret was living at 10 Freckleson Street, Wigan with her parents and siblings Frederick, Emily, Edith, Nellie, Alfred, Charles and Robert. Class: RG13; Piece: 3558; Folio: 55; Page: 8., 114002=PERCY WILLIAM HOWE 1887-????+++, 174645=ELLEN GOWLAND CLEMENTS 1878-????, 269397=In 1901 Alfred was living in the School House, Stetchworth with his parents and siblings Thomas, Harry, Ellen, Ada, Robert and baby Frederick. Class: RG13; Piece: 1537; Folio: 91; Page: 5., 716397=In 1851 Martha was living with her parents in Wood Ditton, Cambridgeshire. Class: HO107; Piece: 1762; Folio: 124; Page: 56; GSU roll: 193654., 253834=In 1881 William was living in Ayot Bury, Ayott St Peters with his parents and siblings George, Charles and Clement. Also living in the house were servants by the name of Edith Seer (domestic) and Bertha Seer (nursemaid). Class: RG11; Piece: 1428; Folio: 66; Page: 2; GSU roll: 1341347., 768428=LYDIA CLEMENTS 1821-????, 315662=SARAH FISHER PRICE 1881-????, 144027=Amy is another daughter that didn't live long. She died in Q4 1883. I believe she was also probably ill at birth, hence the christening and she died soon after it., 739251=In 1871 Robert and Ellen were living at 13 Poolslock Lane, Wigan, Lancashire with Robert's Alfred. Both Robert and Alfred were employed as railway accountants. Class: RG10; Piece: 3888; Folio: 4; Page: 2; GSU roll: 842038., 707589=Ellen died in Wood Ditton the same year and was buried on 23/10/1859., 668182=In 1881 Maria and Charles were living at 41 Marsborough Road, Hammersmith with their children Ellen, William, Arthur and Henry. Visiting that day was Eliza Stubbings (servant). I believe this Eliza was actually Maria's sister, Adeliza. Charles was still employed as a bricklayer. Class: RG11; Piece: 59; Folio: 6; Page: 8; GSU roll: 1341013., 385120=In 1901 Ada and Henry were living on The Green, Gainford, County Durham with their daughters Ethel and Frances. Henry was employed as a gas stoker and Ada was a washer woman with her own account. Class: RG13; Piece: 4655; Folio: 60; Page: 10., 434492=In 1891 Violet was still living at 67 East Street, Brighton with her parents and siblings Bertha, Flora, Albert, Sylvia and Minnie. I believe the accommodation was either behind or above a shop, which their father managed. Class: RG12; Piece: 813; Folio 10; Page 14; GSU roll: 6095923., 759818=In 1881 Charles and Sophia were living at 25 King Street, Chesterfield, Derbyshire with their daughter Selina and Sophia's children Herbert and Julia. Charles was employed as a blast furnace labourer. Class: RG11; Piece: 3437; Folio: 106; Page: 77; GSU roll: 1341822., 629861=In 1841 Caroline was living in Wood Ditton with her parents and siblings Richard and Susan. Class: HO107; Piece 65; Book: 7; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 10; Folio: 10; Page: 15; Line: 18; GSU roll: 241222., 504374=Christened there on 16/11/1851., 530388=James possibly died in Q1 1923 in the Ely reg district, Cambridgeshire, quite likely Wentworth., 178394=In 1891 Eliza was living in Main Street, Wentworth with her parents and siblings James and Oliver and her niece Florence. Class: RG12; Piece: 1297; Folio 63; Page 2; GSU roll: 6096407., 599731=In 1861 Elizabeth was living in Ditton Green, Wood Ditton with her parents and siblings Charles, Noah, Emily, Gabriel, Catherine and Elijah. Class: RG9; Piece: 1031; Folio: 157; Page: 7; GSU roll: 542740., 59739=In 1901 Edith was living in West Fen Drove, Isle of Ely with her parents, half sister Florence and sisters Ruth, Ethel and Ada. Also living there was her paternal grandfather, William Kidman. Her mother's brother Oliver was also in the house on census day. Class: RG13; Piece: 1544; Folio: 37; Page: 8., 135982=In 1901 Albert was living in Brinkley, Cambridgeshire with his parents and siblings Lawrence, Olive and baby Stella. Class: RG13; Piece: 1537; Folio: 34; Page: 4., 120886=ARTHUR KNOWLES 08/11/1911-????, 308345=In 1891 Sarah was working as a domestic servant in Claxton, Durham. This was the home of widow Eleanor Robinson (farmer) and her family. Class: RG12; Piece: 4058; Folio 5; Page 3; GSU roll: 6099168., 572450=MARY ELIZABETH STUBBINGS 1854-???, 610608=In 1901 Charles and Mary were still living in Litton Ditton. Living with them this time was Charles widowed mother. Charles was still employed as a railway labourer. Class: RG13; Piece: 1537; Folio: 112; Page: 12., 273649=In 1881 John was living at 6 Engleheart Road, Lewisham with his parents and siblings George, Emma, Henry and Annie. There was also a lodger named James Jeffers (carman). Class: RG11; Piece: 734; Folio: 152; Page: 45; GSU roll: 1341171., 403610=In 1891 Harry was living in 2 Farringdon Cottages, Exning, Suffolk with his father, stepmother, sister and step brother. Harry was employed as a groom in a racing stable. Class: RG12; Piece: 1294; Folio 47; Page 34; GSU roll: 6096404., 541199=In 1861 John was living in Cheveley Green, Cheveley with his parents and siblings Thomas, Susan, Mary, Charles, Oliver, Joseph and Emma. Class: RG9; Piece: 1031; Folio: 40; Page: 19; GSU roll: 542740., 227204=In 1881 Ann was living at Broomstick Hall, Cheveley with her widowed mother and siblings Mary, William and James. Lodging there was John Clements (carpenter), brother of her mother. Class: RG11; Piece: 1674; Folio: 40; Page: 22; GSU roll: 1341400., 844088=In 1871 Robert was living in Park Paddock,Chevely All Saints, Cambridgeshire with his son John. Robert was employed as a groom and Alice was a laundress. Class: RG10; Piece: 1595; Folio: 46; Page: 39; GSU roll: 829811., 174548=In 1881 Ellen was living in a cottage in Beeford, Driffield with her parents and siblings Charles and Emma. Class: RG11; Piece: 4792; Folio: 74; Page: 3; GSU roll: 1342156., 504335=In 1861 Mary Ann was living in Stoney Street, Dullingham with her parents and siblings Elizabeth, James, Frederick and Albert. Also living with them was her paternal grandmother. Class: RG9; Piece: 1031; Folio: 47; Page: 2; GSU roll: 542740., 316153=In 1881 Mary was living in Little Ditton, Wood Ditton with her parents and siblings Eliza, William, Ellen, George, John and Henry. Class: RG11; Piece: 1675; Folio: 79; Page: 11; GSU roll: 1341401., 691001=Charles died in the Newmarket reg district (so quite possibly in Wood Ditton) in 1855., 156898=In 1881 Arthur was living in Stoers Lane, Brampton with his parents and brother Frederick. Class: RG11; Piece: 3437; Folio: 4; Page: 3; GSU roll: 1341822., 634748=In 1861 Harry was living in Saxon Street with with his parents and siblings Mary Ann, John, Alice, James, Susannah and Adeliza. Class: RG9; Piece: 1031; Folio: 168; Page: 30; GSU roll: 542740., 548867=In 1841 Susan was living in Cheveley Green, Cheveley with her parents and siblings Eleanor, Thomas and baby William. Class: HO107; Piece 65; Book: 2; Civil Parish: Cheveley; County: Cambridgeshire; Enumeration District: 7; Folio: 9; Page: 12; Line: 3; GSU roll: 241222., 29106=On 12/01/1954 Eddie was awarded the General Service Medal with clasp Malaya., 288856=In 1881 John was living with his parents and siblings William, Sarah, Walter and Richard in Hind House, Hartlepool, County Durham. Class: RG11; Piece: 4912; Folio: 4; Page: 6; Line: ; GSU roll: 1342182., 270292=In 1891 Elle was living in the High Street, Stetchworth with hers parents and siblings Thomas, Agnes and Harryn. Class: RG12; Piece: 1292; Folio 86; Page 5; GSU roll: 6096402., 55882=In 1901 Maggie was living in Honey Hill, Wimblington, Cambridgeshire with her parents, half siblings Annie and James and sisters Agnes and Elsie. Class: RG13; Piece: 1550; Folio: 24; Page: 2., 452014=WINIFRED EMILY M CLEMENTS 1883-????, 478320=Christened there on 25/03/1860., 738326=In 1901 Robert and Ellen were living in the bank House, Claughton Street, St Helens, Lancashire with their children Charlotte, Ellen, Harry, Robert, Constance, Sidney, Winifred, Frederick, Mildred, Arthur, Waldo and Dorothy. Robert was employed as a banker's clerk. Class: RG13; Piece: 3521; Folio: 65; Page: 11., 478281=In 1861 Albert was living in Stoney Street, Dullingham with his parents and siblings Mary Ann, Elizabeth, James and Frederick. Also living with them was her paternal grandmother. Class: RG9; Piece: 1031; Folio: 47; Page: 2; GSU roll: 542740., 548906=Christened there on 02/06/1839., 625968=JAMES STUBBINGS 1845-????, 587927=AGNES STUBBINGS 1858-1870, 105602=WILLIAM SAMUEL LONG 03/08/1910-11/07/1979, 716239=In 1861 Martha was living in Garden House, ? Park, Newmarket All saints, Cambridgeshire with her father and siblings Martha, Mary and John. Also there was her cousin, Mary Stubbings. Class: RG9; Piece: 1031; Folio: 123; Page: 21; GSU roll: 542740., 694853=In 1871 Betsey and George were at the home of Betsey's father with their son Harry. Also there that day was Betsey's brother Abraham, her daughter Matilda and a nephew (or son?) Arthur. George was employed as a labourer. Class: RG10; Piece: 1596; Folio: 46; Page: 19; GSU roll: 829811., 802078=Married Ann Clements (b 1826 in Dullingham) on 16/07/1847 in Dullingham. Ann was Robert's cousin and the daughter of his mother's brother Reuben Clements., 708542=In 1871 John was living in Park Paddock, Chevely All Saints, Cambridgeshire with his father and stepmother. Class: RG10; Piece: 1595; Folio: 46; Page: 39; GSU roll: 829811., 832664=In 1851 John and Ann were living in Little Ditton, Wood Ditton. With them on that day was Ann's niece, Betsey Brown. John was employed as an agricultural labourer and Ann was a School Mrs Dame. Class: HO107; Piece: 1762; Folio: 106; Page: 20; GSU roll: 193654., 868317=In 1861 Reuben and Emily were living in Stoney Street, Dullingham. Reuben's mother was there that day and was quite probably living with the couple. Reuben was employed as a thatcher. Class: RG9; Piece: 1031; Folio: 48; Page: 4; GSU roll: 542740., 720947=I believe Francis died in 1902 in the Steyning reg district, Sussex., 504480=MARY ANN NUNN 30/08/1851-1908, 634787=Christened there on 20/09/1857., 156728=In 1891 Arthur was living at 66 East Street, Grassmoor, Hasland, Derbyshire with his parents and siblings Arthur, Fred, James and Frank. Also there that day was Arthur's aunt, Emma Nunn. Arthur was employed as a coal miner. Class: RG12; Piece: 2763; Folio 154; Page 66; GSU roll: 6097873., 121020=Annie died in 1990 in Luton, Bedfordshire., 549086=Thomas possibly died in the Newmarket reg district in 1883., 270101=In 1901 Ellen was living in the School House, Stetchworth with her parents and siblings Thomas, Harry, Ada, Alfred, Robert and baby Frederick. Class: RG13; Piece: 1537; Folio: 91; Page: 5., 451927=In 1891 Winifred was living at 6 Kings Road, Eccleston with her parents and siblings Charlotte, Ellen, Caroline, Henry, Robert, Constance, Sidney, Frederick, Mildred, Arthur and Waldo. Boarding with them was a widow named Agnes Richardson (living on her own means). Class: RG12; Piece: 3017; Folio 30; Page 10; GSU roll: 6098127., 231708=In 1891 Clara was employed as a cook at Stoke Lodge, St Mary Stoke, Ipswich, Suffolk. This was the home of Benjamin Grimsey (solicitor and couny court registrar) and his daughter. Class: RG12; Piece: 1469; Folio 5; Page 4; GSU roll: 6096579., 209858=In 1901 John and Sarah were living in West Fen Drove, Isle of Ely with their daughters Mabel and Hilda. John was emplyed as a horsekeeper on a farm. Class: RG13; Piece: 1544; Folio: 37; Page: 8., 288947=JOHN CHARLES ASHMAN 1877-????, 29022=In 1957 Eddie and Betty were living at 34 Walpole Street, Norwich, Norfolk with their daughters Lelsey and Jacqui. Eddie had been posted to RAF Watton., 120970=Victor died in Luton in 1994., 166719=WILLIAM ALEXANDER C PALMER 1883-????, 587843=Christened there on 12/09/1858., 55968=MAGGIE ELIZA DEWEY 1899-1903, 323609=In 1881 William was living in Little Ditton, Wood Ditton with his parents and siblings Eliza, Ellen, George, John, Henry and Mary. Class: RG11; Piece: 1675; Folio: 79; Page: 11; GSU roll: 1341401., 813100=In 1861 Elizabeth was still living in Wood Ditton with her father. Her son and his wife also lived in the house. Class: RG9; Piece: 1031; Folio: 160; Page: 13; GSU roll: 542740., 143849=JAMES HENRY NUNN 1887-????, 249293=In 1891 Alice was living in the Red Lion Publice House, waters End, Hemel Hempstead, Hertfordshire with her parents and siblings Charles, William and Clement. Class: RG12; Piece: 1124; Folio 88; Page 12; GSU roll: 6096234, 136070=ALBERT CLEMENTS JACOBS 1893-????, 434570=VIOLET KATE CLEMENTS 1885-????, 359330=In 1891 Harry was living at 88 Blythe Road, Hammersmith with his parents and siblings William, Arthur, Eliza and James. There was also a boarder named Albert Penfold living in the house. Class: RG12; Piece: 39; Folio 55; Page 10; GSU roll: 6095149., 530285=Betsy possibly died in 1928 in the Ely reg district, Cambridgeshire, quite likely Wentworth., 590955=In 1901 Gabriel and Elizabeth were living in the Station House, Knitsley, County Durham. Also there at the time of the census was Elizabeth's niece Frances and her baby daughter. gabriel was employed as a railway plate layer. Class: RG13; Piece: 4667; Folio: 130; Page: 9., 478437=ALBERT EDWARD NUNN 20/01/1860-08/02/1936, 330827=In 1901 Mary was living at 72 Protheroe Road, North West Fulham with her parents and siblings William, Ruby and John. Her half sister, Agnes lived elsewhere in the same house with her family. Class: RG13; Piece: 55; Folio: 12; Page: 16., 339501=In 1901 Agnes and Archibald were at 72 Protheroe Road, North West Fulham with their children Florence, Alice and baby Amelia. Archibald was employed as a general labourer. Also living in a section of the house were Agnes's mother, stepfather and half siblings. Class: RG13; Piece: 55; Folio: 12; Page: 15., 438470=In 1901 Alfred was living at 10 Freckleson Street, Wigan with his parents and siblings Frederick, Emily, Edith, Nellie, Margaret, Charles and Robert. Class: RG13; Piece: 3558; Folio: 55; Page: 8., 708353=In 1881 John was living in Garden Cottage, Newmarket All Saints with his father and stepmother John was employed as a non domestic groom., 105515=William died in Fulham on 11/07/1979., 178194=In 1901 Eliza was employed as a general domestic servant in Roscholme (?) Lane, Leasinghasam, Lincolnshire. This was the home of Anna W Morley (living on her own means). Class: RG13; Piece: 3047; Folio: 171; Page: 11., 448109=Married Mabel Killey (b 02/02/1893 in St Helens, Lancashire) in Q4 1916 in the Prescot reg district, Lancashire., 541419=In 1851 John was living in Cheveley Green, Cheveley with his parents and siblings Thomas, Susanna, William, Betsy, Mary and baby Charles. Class: HO107; Piece: 1762; Folio: 169; Page: 19; GSU roll: 193654., 161099=Abner married in the Newmarket reg district in Q2 1904 to either Betsy Challis OR Anne Elizabeth Galley., 719944=In 1871 Emily was possibly working as a domestic servant at 48 Albert Street, St Mary Newington, London. This was the home of Daniel Howie (Police ?) and his family. Class: RG10; Piece: 621; Folio: 74; Page: 9; GSU roll: 818921., 117185=Frank joined the Army in 1914. He enlisted in the 8th Battalion of the Suffolk Regiment., 549012=SUSAN AMELIA CLEMENTS 1839-1887, 863935=Robert died in Atcham, Shropshire in 1876., 143757=In 1891 James was living at 66 East Street, Grassmoor, Hasland, Derbyshire with his parents and siblings Arthur, Fred and Frank. Also there that day was James's aunt, Emma Nunn. Class: RG12; Piece: 2763; Folio 154; Page 66; GSU roll: 6097873., 389696=JOHN STUBBINGS 1863-1863, 323697=WILLIAM JAMES PRICE 1872-????, 615058=In 1891 Robert was possibly a boarder in Concrete village,Brampton Bierlow, Yorkshire. This was the home of Robert Lovell (horse keeper)and his family. Robert was an engine tester. Class: RG12; Piece: 3854; Folio 135; Page 22; GSU roll: 6098964., 844284=Robert then married Alice Fitzgerald ( b abt. 1881 in Ireland)in Wood Ditton on 25/07/1861. Alice was a widow. The witnesses at their wedding were Mary Ann Stubbings and Abraham Stubbings., 863885=Sarah died in Wigan, Lancashire in 1891., 380945=JOHN WILLIAM STUBBINGS 1877-1925, 355010=In 1891 Hubert (as he was named in this census) was living at 8 Sylvan Villas, Chitts Hill, Tottenham, London with his parents and siblings Alice, Edmond, Ethel, Allida, Daisy and Ernest. Also living there was Susan Perry (general domestsic servant). Herbert was employed as a merchant's clerk. Class: RG12; Piece: 1079; Folio 117; Page 42; GSU roll: 6096189., 315941=In 1891 Mary was living in Little Ditton, Wood Ditton with her parents and siblings George, John, Henry, Sarah, Charles, Thomas, Gertie and baby Grace. Class: RG12; Piece: 1292; Folio 105; Page 12; GSU roll: 6096402., 361955=In 1891 Ellen was a lodger at 123 Crawford Street, Rectory, St Marylebone, London. This was the home of George Cowley (master Baker) and his wife. Ellen was employed as a dressmaker. Class: RG12; Piece: 95; Folio 110; Page 6; GSU roll: 6095205., 587804=Agnes died in Wood Ditton and was buried there on 10/04/1870., 629900=Christened there on 27/05/1838., 139399=In 1891 Harriet was living at 32 East Street, Grassmore, Hasland, Derbyshire with her parents and brother Frederick. Class: RG12; Piece: 2763; Folio 153; Page 63; GSU roll: 6097873., 487094=In 1881 James and Sarah were living in Stoers Lane, Brampton, Derbyshire with their children Arthur and Frederick. James was employed as a coal miner. Class: RG11; Piece: 3437; Folio: 4; Page: 3; GSU roll: 1341822., 455734=In 1891 Henry was living at 6 Kings Road, Eccleston with his parents and siblings Charlotte, Ellen, Caroline, Robert, Constance, Sidney, Winifred, Frederick, Mildred, Arthur and Waldo. Boarding with them was a widow named Agnes Richardson (living on her own means). Henry was employed as a clerk in a copperworks. Class: RG12; Piece: 3017; Folio 30; Page 10; GSU roll: 6098127., 59827=EDITH KIDMAN 1895-???, 281226=In 1901 James was living in Ditton Green, Wood Ditton with his widowed father and sister Alice. James was emplyed as a farm hand. Class: RG13; Piece: 1537; Folio: 108; Page: 3., 626091=JANE STUBBINGS 1844-????, 174359=In 1891 Ellen was living in Bridlington Road, Beeston with her parents and siblings Emma, Arthur, Aaron, Elizabeth, Alice and baby Clara. Class: RG12; Piece: 3953; Folio 19; Page 8; GSU roll: 6099063., 139643=HARRIET NUNN 1880-????, 610339=Charles died in Wood Ditton in 1918 and was buried there on 10/08/1918., 79363=Married Kathleen Nina Plummer (b 19/02/1902 at 21 Norfolk Road, Littlehampton, West Sussex) in Amersham, Buckinghamshire on 18/05/1921., 434191=In 1901 Violet was living at 27 Hampstead Road, Preston, Sussex with her parents and sisters Sylvia and Hilda. Class: RG13; Piece: 939; Folio: 144; Page: 6., 308563=In 1881 Sarah was living with her parents and siblings William, Walter, John and Richard in Hind House, Hartlepool, County Durham. Class: RG11; Piece: 4912; Folio: 4; Page: 6; Line: ; GSU roll: 1342182., 355088=HERBERT JOHN WALLER 1871-????, 323991=In 1881 Eliza (as Mary was named in this census) was living in Little Ditton, Wood Ditton with her parents and siblings William, Ellen, George, John, Henry and Mary. Class: RG11; Piece: 1675; Folio: 79; Page: 11; GSU roll: 1341401., 403846=In 1881 Harry was living living in a cottage in Mill Road, Stetchworth, Cambridgeshire with his father, stepmother, sister Annie and step brother Herbert. Class: RG11; Piece: 1675; Folio: 66; Page: 19; GSU roll: 1341401., 832987=In 1841 John and Ann (as named on this census) were living in Little Ditton, Wood Ditton, Cambridgeshire. John was employed as an agricultural labourer. Class: HO107; Piece 65; Book: 6; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 9; Folio: 7; Page: 10; Line: 5; GSU roll: 241222., 541457=Christened there on 02/04/1843, 36567=Eddie and Elizabeth (known as Betty) were married on 29/03/1952 in St Andrews Church, Hastings, Sussex (now Morrisons petrol station!). Betty was married from her parents home at 14 Brook Street, Hastings. The bridesmaid was Gwen E S Smith, a long time friend of Betty and the best man was Al Woodhall. Al's name was either Algenon or Alouisious, I'm not sure which and he was an RAF friend of Eddie's. These 2 were also the witnesses., 209502=Christened there on 03/02/1868., 591355=Married Elizabeth Ann Welford (b abt 1857 in Southwark, County Durham) in Q4 1876 in the Lanchester reg district, CVounty Durham., 448388=In 1901 Waldo was living in the bank House, Claughton Street, St Helens, Lancashire with his parents and siblings Charlotte, Ellen, Harry, Robert, Constance, Sidney, Winifred, Frederick, Mildred, Arthur and Dorothy. Class: RG13; Piece: 3521; Folio: 65; Page: 11., 786318=Christened there on 24/04/1814., 553047=Christened in Dullingham on 15/05/1836., 209463=In 1871 Mary was living in Wentworth with her father and siblings John and William. Also there that day was her aunt, Emily Clemence. Class: RG10; Piece: 1603; Folio: 80; Page: 1; GSU roll: 829814., 553000=In 1841 Eleanor was living in Cheveley Green, Cheveley with her parents and siblings Thomas, Susan and baby William. Class: HO107; Piece 65; Book: 2; Civil Parish: Cheveley; County: Cambridgeshire; Enumeration District: 7; Folio: 9; Page: 12; Line: 3; GSU roll: 241222., 690775=Frances did not live very long, dying that same month in Wood Ditton and was buried on 24/12/1852., 867844=Reuben died in Dullinhgam in 1872., 786418=JOHN CLEMENTS 1814-????, 843854=In 1881 Robert and Alice were living in Garden Cottage, Newmarket All saints with Robert's son John. Robert was employed as a groom ND (non domestic?) as was his son. Alice was still working as a laundress. (I wonder if this homuse is the same one that Robert lived in since 1861 as the addresses are very similar). Class: RG11; Piece: 1675; Folio: 53; Page: 53; GSU roll: 1341401., 530054=In 1851 Mary was living in Cheveley Green, Cheveley with her parents and siblings Thomas, Susanna, William, John, Betsy and baby Charles. Class: HO107; Piece: 1762; Folio: 169; Page: 19; GSU roll: 193654., 456087=JOHN HENRY CLEMENTS 1877-????, 469968=In 1891 Emma was at the home of her brother James and his family at 66 East Street, Grassmoor, Hasland, Derbyshire. Emma was employed as a domestic cook. Class: RG12; Piece: 2763; Folio 154; Page 66; GSU roll: 6097873., 281397=In 1891 James was living in Ditton Green, Wood Ditton with his parents and brother George. Class: RG12; Piece: 1292; Folio 101; Page 3; GSU roll: 6096402., 178581=In 1881 Eliza was living in Wentworth with her parents and siblings John, Clara, James, Jonas and Robert. Class: RG11; Piece: 1683; Folio: 74; Page: 1; GSU roll: 1341402., 160987=Abner died in the Lexden reg district, essex in Q4 1922., 482388=In 1861 Frederick was living in Stoney Street, Dullingham with his parents and siblings Mary Ann, Elizabeth, James and Albert. Also living with them was his paternal grandmother. Class: RG9; Piece: 1031; Folio: 47; Page: 2; GSU roll: 542740., 361549=In 1871 William was living in Denmark Terrace, Hammersmith, London with his parents and brother Henry. Class: RG10; Piece: 59; Folio: 35; Page: 9; GSU roll: 824573., 541537=JOHN CLEMENTS 1843-????, 139565=In 1881 Harriet was living in Chatsworth Road, Brampton, Derbyshire with her parents. Class: RG11; Piece: 3437; Folio: 3A; Page: 1; GSU roll: 1341822., 600055=In 1851 Elizabeth was living in Little Ditton, Wood Ditton with her parents and siblings Charles, Phoebe, George and Noah. Also living there was a lodger named Martin Allard (agricultural labourer) who was possibly a relative of hwe mother. Class: HO107; Piece: 1762; Folio: 107; Page: 22; GSU roll: 193654., 153279=In 1901 Arthur and Sarah were living in Blackwell Road, Hucknall under Huthwaite, Nottinghamshire with their daughter Sarah. Arthur was employed as a coal miner loader. Class: RG13; Piece: 3138; Folio: 150; Page: 34., 289114=Phoebe married again in the same reg district in Q2 1908 to either John Willaim Selby OR Paul Gotobed (Gotosud)., 681298=John then married Frances (Fanny) Bonnett (b 1849 in Ashley cum Silverly, Cambridgeshire) on 03/12/1870 in Wood Ditton. The witnesses at their wedding were John Bonnett and Ellen Tweed., 121178=ANNE EVELYN KNOWLES 22/02/1909-1990, 797985=Ann died on 06/01/1859 in Wood Ditton and was buried there 4 days later., 667819=In 1891 Maria and Charles were living at 88 Blythe Road, Hammersmith with their children William, Arthur, Harry, Eliza and James. there was also a boarder named Albert Penfold living in the house. Charles was employed as a labourer. Class: RG12; Piece: 39; Folio 55; Page 10; GSU roll: 6095149., 777662=ELIZABETH CLEMENTS 1816-1853, 768799=In 1881 Charles and Martha were living in Dullingham with their daughters Eliza, Mary Ann and Elizabeth. Also living there was a grandson, Charles (not yet looked at his parentage!) Charles was still working as a carpenter. Class: RG11; Piece: 1674; Folio: 52; Page: 12; GSU roll: 1341400., 114678=In 1891 Alice was living in Saxon Street, Wood Ditton with her mother, step father and half brothers Percy and Arthur. Class: RG12; Piece: 1292; Folio 111; Page 24; GSU roll: 6096402., 110276=ELSIE CLARK 1912-????+++, 690814=Christened there on 20/12/1852., 135756=LAWRENCE GEORGE JACOBS 1894-1958, 166626=In 1891 William was living in Bedlam Square, Burwell, Cambridgeshire with his parents and siblings John, Robert and Lily. Class: RG12; Piece: 1293; Folio 42; Page 16; GSU roll: 6096403., 51784=AUDREY SMITHSON 03/09/1928-24/02/2008, 610380=Mary died in Wood Ditton in 1904., 482427=Christened there on 09/05/1858., 715975=In 1871 Martha was employed as a cook at 13 Hyde Park gate South, London. This was the home of Charles Rivaz (underwriter at Lloyds) and his wife. Also working there in service was her sister Mary. Class: RG10; Piece: 29; Folio: 70; Page: 61; GSU roll: 838757., 421148=In 1891 Charles was living in the Red Lion Publice House, waters End, Hemel Hempstead, Hertfordshire with his parents and siblings Charles, William, Clement and Alice. Charles was assisting his father in running the pub. Class: RG12; Piece: 1124; Folio 88; Page 12; GSU roll: 6096234., 178620=Christened there on 24/06/1877., 269850=ADA STUBBINGS 1893-????, 281578=In 1881 James was living in Mill Road, Wood Ditton with his parents and siblings Eliza and George. Class: RG11; Piece: 1675; Folio: 81; Page: 16; GSU roll: 1341401., 361625=WILLIAM SMITH 1869-????, 166424=In 1901 William was living in the Duddery, Newmarket St Mary with his parents and siblings John and Lily. John was employed as an errand boy. Class: RG13; Piece: 1541; Folio: 121; Page: 31., 777557=Christened there on 18/01/1816., 634539=In 1871 Harry was still living in Saxon Street with his parents and sister Alice. Also in the house that day were Harry's neices Ellen Smith (daughter of Maria) and Agnes Ada Goddard (I think she was Alice's child) and nephew James (Alice's son). Harry was employed as anagricultural labourer. Class: RG10; Piece: 1595; Folio: 85; Page: 28; GSU roll: 829811., 721189=In 1901 Francis and Sarah were living at 27 Hampstead Road, Preston, Sussex with their daughters Violet, Sylvia and Hilda. Francis was employed as a provisions merchants traveller. Class: RG13; Piece: 939; Folio: 144; Page: 6., 591177=In 1891 Gabriel and Elizabeth were living at 21 Consett Iron ? Cottages, Leagate, Iveston, County Durham. Gabriel was employed as a plate layer. Class: RG12; Piece: 4092; Folio 32; Page 4; GSU roll: 6099202., 316232=MARY PRICE 1879-????, 359066=In 1901 Henry was living at 88 Blythe Road with with his parents and siblings Charles, Eliza and James. Henry was employed as a bricklayer, like his father. Class: RG13; Piece: 49; Folio: 40; Page: 5., 868056=In 1871 Reuben and Emily were living in their Own Cottage, Dullingham with Reuben's mother. Reuben was still working as a thatcher. Class: RG10; Piece: 1594; Folio: 56; Page: 11; GSU roll: 829811., 443933=In 1881 Frederick was living at 202 Ormskirk Road, Pemberton, Lancashire with his parents and siblings Emily and baby Edith. Class: RG11; Piece: 3779; Folio: 17; Page: 28; GSU roll: 1341904., 160784=In 1891 Biddie was living in Boro End, Borough Green with with her parents and siblings Dan, Maggie, Abner, Barnard, Effie and Horace. Class: RG12; Piece: 1292; Folio 20; Page 11; GSU roll: 6096402., 549324=In 1881 Thomas was boarding at 7 Grosvenor Yard, Newmarket St Mary, with his son. This was the home of widow Susan Turner. Thomas was a carpenter journeyman. Class: RG11; Piece: 1677; Folio: 11; Page: 15; GSU roll: 1341401., 588101=I can find nothing else on this family, apart from the death of their son Thomasin 1896 in the Marylebone reg district., 864218=In 1871 Robert was still working in Rowton Castle, Alderbury and Sarah was visiting him that day. Robert was employed as a steward. This time the head of the house was Josiah Mitchel (vicar of Alderbury). Class: RG10; Piece: 2765; Folio: 24; Page: 2; GSU roll: 838842., 708208=In 1891 John was living in Garden Cottage, The Parks, Newmarket All Saints. (Presumably this was the same house he had previously lived in with his parents but was now head of the house.) Living with him was a boarder named Thomas Lancaster. Both John and his boarder were employed as stud grooms. Class: RG12; Piece: 1294; Folio 67; Page 19; GSU roll: 6096404., 350426=I have had a terrible job trying to trace this family in 1901 and am wondering if the surname was wrongly transcribed. I am now at a lose as to work out what surname to try. I will have to come back to this family at a later date., 231452=Married Lewis Charles Green (b abt. 1866 in Ipswich, Suffolk) in Q2 1891 in the Ipswich reg district, Suffolk., 209601=MARY WHETSTONE 1867-????, 331044=In 1891 Mary was living at 10 Moylens Road, Fulham, London with her parents and siblings Amelia, William, Jane, Rose, Ruby and baby John. Class: RG12; Piece: 47; Folio 109; Page 47; GSU roll: 6095157., 226941=In 1891 Annie was employed as a cook in West End, March, cambridgeshire. This was the home of William Pearce (mamager of the National and Provincial Bank) and his family. Class: RG12; Piece: 1301; Folio 116; Page 17; GSU roll: 6096411., 580420=In 1901 Thomas and Elizabeth were living in the School House, Stetchworth with their children Thomas, Harry, Ellen, Ada, Alfred, Robert and baby Frederick. Thomas was employed as a carpenter. Class: RG13; Piece: 1537; Folio: 91; Page: 5., 143499=In 1901 James was living in Blackwell Road, Hucknall under Huthwaite, Notinghamshire with his father, stepmother and brother Frank. There were also 2 boarders named J and C Edwards (coal miners) living there. James was employed as a coal miner. Class: RG13; Piece: 3138; Folio: 113; Page: 1., 681469=Sarah died in Wood Ditton in 1863 and was buried there on 06/09/1863. Incidentally, this was also the day her son was christened. Did she die in childbirth?, 174142=Married John Robert Barnes (b abt. 1876 in Huggate (?), Yorkshire) in Q4 1898 in the Driffield reg district, east Yorkshire., 116940=Frank died on 03/07/1916 on the third day of the Great Attack at the Somme. Frank was just 21 and he is commemorated on the Thiepval Memorial in Somme, France., 738722=In 1891 Robert and Ellen were living at 6 Kings Road, Eccleston with their children Charlotte, Ellen, Caroline, Henry, Robert, Constance, Sidney, Winifred, Frederick, Mildred, Arthur and Waldo. Boarding with them was a widow named Agnes Richardson (living on her own means). Robert was still employed as a bank clerk. Class: RG12; Piece: 3017; Folio 30; Page 10; GSU roll: 6098127., 121343=MAGGIE IVY KNOWLES 15/08/1907-????, 690900=FRANCES STUBBINGS 1852-1852, 553136=ELEANOR AMELIA CLEMENTS 1836-????, 513360=In 1861 Charles was living in Stoney Street, Dullingham with his father and half brothers Henry, Thomas and James. Charles was employed as an agricultural labourer. Class: RG9; Piece: 1031; Folio: 50; Page: 8; GSU roll: 542740., 786279=Married Emily Amelia Mould (b in Cheveley, Cambridgeshire) in Cheveley on 23/07/1835., 813399=In 1851 Elizabeth was living with her son and father in Little Ditton, Cutting Green, Wood Ditton. Also living there was a lodger named William Misson. Elizabeth was employed as a house keeper, possibly by her father. Class: HO107; Piece: 1762; Folio: 107; Page: 23; GSU roll: 193654., 702891=In 1861 Betsey was living in Saxon Street, Wood Ditton with her parents and siblings John, William and Abraham. Class: RG9; Piece: 1031; Folio: 172; Page: 37; GSU roll: 542740. s., 160876=BIDDIE ROSHER BARRETT 1882-????, 170817=In 1901 Elizabeth was employed as a general domestic servant in the Farm House, Ulrome, Yorkshire. This was the home of Benjamin Crozer (farmer) and his family. Class: RG13; Piece: 4522; Folio: 13; Page: 15., 157010=ARTHUR ERNEST NUNN 1875-1937, 110153=JOHN J CLARK 1914-????+++, 478687=In 1901 Hannah and Charles were living at 4 Albert Street, Chesterfield with Hannah's children Charles and William and their daughter Hannah. Class: RG13; Piece: 3248; Folio: 61; Page: 24., 482548=FREDERICK RICHARD NUNN 05/04/1858-09/01/1887, 777518=Married Thomas Lake (b 1815 in Dullingham), 273725=JOHN ROBERT THOMAS 1873-????, 625845=In 1851 James was living in Saxon Street, Wood Ditton with his parents and siblings Richard, Caroline, Susan, Sarah and Jane. there was also a visitor that day by the name of William Coe who was only 2 months old. Class: HO107; Piece: 1762; Folio: 117; Page: 43; GSU roll: 193654., 444028=FREDERICK THOMAS CLEMENTS 1878-1926, 455982=In 1881 Henry was living in Knowsley Road, Eccleston in Prescott, Lancashire with his parents and siblings Charlotte, Ellen (Helen), Caroline, Robert and Constance. Class: RG11; Piece: 3730; Folio: 94; Page: 51; GSU roll: 1341893., 759536=In 1891 Charles and sophia were living in King Street, Whittington, Derbyshire. They had a lodger named John Lwatt (navvy) living with them. Charles was working as a labourer. Class: RG12; Piece: 2765; Folio 126; Page 6; GSU roll: 6097875., 102943=In 1901 Thomas was living at Wind Hill, Bransdale, Yorkshire with his parents, step brothers Robert, John and George and half sister Minnie. Class: RG13; Piece: 4552; Folio: 65; Page: 5., 162662=MAGGIE MABEL BARRETT 1878-????, 357868=In 1901 James was living at 88 Blythe Road with with his parents and siblings Charles, Henry and Eliza. Class: RG13; Piece: 49; Folio: 40; Page: 5., 106817=EDWARD JOHN CRAIG 1903-????, 514661=In 1871 Emma, going by the name Emily, was at the home of her siter and brother in law Betsy and James Whetstone. Class: RG10; Piece: 1603; Folio: 80; Page: 1; GSU roll: 829814.S, 648450=JAMES STUBBINGS 1850-????, 59317=In 1901 baby Ada was living in West Fen Drove, Isle of Ely with her parents, half sister Florence and sisters Ruth, Ethel and Editha. Also living there was her paternal grandfather, William Kidman. Her mother's brother Oliver was also in the house on census day. Class: RG13; Piece: 1544; Folio: 37; Page: 8., 93210=In 1911 Ethel was living in Wind Hill with her parents and siblings Percy, Blanche, Phoebe, Walter and baby Albert., 812662=Married Elizabeth Allard (b 1819 in Kirtling, Cambridgeshire) on 08/11/1839 in Wood Ditton. Thomas was 26 and Elizabeth was 21 years old. The witnesses at their wedding were James Stubbings and Thomas Jarvis., 635114=In 1881 Eliza was visiting her sister Maria and her family at at 41 Marsborough Road, Hammersmith. Eliza was employed as a servant., 507102=Christened there on 30/11/1851., 767111=Christened there 28/06/1829., 627332=In 1851 Sarah was living in Saxon Street, Wood Ditton with her parents and siblings Richard, Caroline, Susan, James and Jane. there was also a visitor that day by the name of William Coe who was only 2 months old. Class: HO107; Piece: 1762; Folio: 117; Page: 43; GSU roll: 193654., 433287=In 1891 Bertha was still living at 67 East Street, Brighton with her parents and siblings Bertha, Flora, Albert, Violet and Sylvia. I believe the accommodation was either behind or above a shop, which their father managed. Class: RG12; Piece: 813; Folio 10; Page 14; GSU roll: 6095923., 728938=In 1891 Alfred and Margaret were living at 186 Manchester Road, Ince in Makerfield, Lancashire with their children Frederick, Emily, Edith, Nellie, Margaret, Alfred and Charles. Also there was a 15 year old domestic servant named Kate Haskin, who was said to be a daughter, but I think that is wrong. I cannot see what Alfred's employment was as it is very, very faint. Class: RG12; Piece: 3061; Folio 89; Page 15; GSU roll: 6098171., 621988=Married John Ashman (b 1849 in Cowlinge, Suffolk) on 15/06/1867 in Wood Ditton. John was aged 21 and Jane was only 18 when they married. The witnesses at their wedding were John Heath and Elizabeth Starling., 138712=In 1891 Frederick was living at 32 East Street, Grassmore, Hasland, Derbyshire with his parents and sister Harriet. Class: RG12; Piece: 2763; Folio 153; Page 63; GSU roll: 6097873., 717434=ELLEN CLEMENTS 1858-????, 314665=THOMAS PRICE 1885-????, 689624=SARAH STUBBINGS 1836-????, 388473=Married Henry Hobson (b abt. 1861 in Stockton on Tees, County Durham)in Q4 1893 in the Teesdale reg district, County Durham., 834110=In 1871 Abraham was living in Black Barn Lane, Newmarket St Marys with his son Abraham, grandchildren (yet to be identified with the correct parent) Arthur and Matilda Stubbings. Also there that day was his daughter Betsey with her husband and son. Abraham was employed as a labourer, as was Abraham jnr. Class: RG10; Piece: 1596; Folio: 46; Page: 19; GSU roll: 829811., 270867=In 1891 Harry was living in the High Street, Stetchworth with his parents and siblings Thomas, Agnes and Ellen. Class: RG12; Piece: 1292; Folio 86; Page 5; GSU roll: 6096402., 667171=SARAH ELIZABETH STUBBINGS 1844-????, 778583=In 1841 John and Amelia (as she was known in this census) were living in Cheveley Green, Cheveley with their children Eleanor, Thomas, Susan and baby William. John was employed as a carpenter. Class: HO107; Piece 65; Book: 2; Civil Parish: Cheveley; County: Cambridgeshire; Enumeration District: 7; Folio: 9; Page: 12; Line: 3; GSU roll: 241222., 627371=Christened there on 13/08/1843., 28163=In October 1964, Eddie, Betty and the 3 girls arrived at 7 Valetta Road, RAF Dishforth, North Yorkshire. They were there for a couple of years., 631287=RICHARD FORMAN STUBBINGS 1835-????, 371115=Married John Hesp in Q2 1911 in the Darlington reg district., 673928=Married Charles Smith (b 1838 in Malvern, Worcestershire)., 438259=Did Alfred marry Jane Willis in Q2 1914 in the Wigan reg district, Lancashire?, 433371=HILDA MINNIE CLEMENTS28/10/1889-1970, 587342=In 1881 Thomas was still living in Ditton Green with his parents. Thomas was employed as a carpenter. Class: RG11; Piece: 1675; Folio: 77; Page: 7; GSU roll: 1341401., 116649=CECIL CHARLES ALEY 04/11/1899-by 1952, 774775=In 1841 Charles was living with his mother in Stetchworth. Charles was employed as an agricultural labourer. Class: HO107; Piece 71; Book: 8; Civil Parish: Stetchworth; County: Cambridgeshire; Enumeration District: 6; Folio: 4; Page: 3; Line: 14; GSU roll: 241224., 270951=HARRY STUBBINGS 1886-????, 717345=In 1861 Ellen was living with her mother (can't find her father in this census) at 1 Chapel Place North, St George Hanover Square, Mayfair, London and siblings Emily, Susan and Louisa. Also there were lodgers by the names of Elizabeth Meek (governess), Stephen walker (formerly a butler), Marian Darcus (fund holder) and Nannette Leithead (can't decipher her occupation). Class: RG9; Piece: 45; Folio: 73; Page: 24; GSU roll: 542562., 881963=JOHN CLEMENTS abt 1784-1837, 704889=In 1841 Matilda was living in Little Ditton, Wood Ditton with her parents and siblings Mary, John, Agnes and Betsey. Class: HO107; Piece 65; Book: 6; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 9; Folio: 7; Page: 10; Line: 5; GSU roll: 241222., 614294=JAMES STUBBINGS 1834-????, 165181=LILY MARY R PALMER 1889-????, 72651=EDWARD JOHN KNOWLES 1901-????, 59375=ADA VICTORIA KIDMAN 1901-???, 444730=In 1901 Dorothy was living in the bank House, Claughton Street, St Helens, Lancashire with her parents and siblings Charlotte, Ellen, Harry, Robert, Constance, Sidney, Winifred, Frederick, Mildred, Arthur and Waldo. Class: RG13; Piece: 3521; Folio: 65; Page: 11., 631194=Christened there on 28/12/1835., 600094=Christened there on 01/10/1848., 143051=In 1891 Frank was living at 66 East Street, Grassmoor, Hasland, Derbyshire with his parents and siblings Arthur, Fred and James. Also there that day was Frank's aunt, Emma Nunn. Class: RG12; Piece: 2763; Folio 154; Page 66; GSU roll: 6097873., 856984=FRANCIS CLEMENTS 1823-????, 767221=CHARLES NUNN 18/03/1829-18/08/1905, 402985=In 1891 Elizabeth (as she named in this census) was living in 2 Farringdon Cottages, Exning, Suffolk with her father, stepmother, brother Harry and step brother. Class: RG12; Piece: 1294; Folio 47; Page 34; GSU roll: 6096404., 627455=SARAH STUBBINGS 1843-1891, 288385=RICHARD JAMES ASHMAN 1880-????, 162571=In 1881 Maggie was living in Boro End, Borough Green with her parents and siblings Dan, Fanny and Arthur. Class: RG11; Piece: 1674; Folio: 6; Page: 6; GSU roll: 1341400., 786605=Christened there on 06/12/1812 (according to a memebr of the LDS Church.), 518479=Married either Rebecca Price (b 1851 in saxon Street, Wood Ditton, Cambridgeshire) in Q4 1878 in the Newmarket reg district, possibly Wood Ditton., 803959=In 1861 Thomas and Betsy were living in Ditton Green, Wood Ditton with their children Charles, Noah, Elizabeth, Emily, Gabriel, Catherine and Elijah. Thomas was employed as an agricultural labourer as were his sons Charles and Noah. Class: RG9; Piece: 1031; Folio: 157; Page: 7; GSU roll: 542740., 323350=ELLEN MARIA PRICE 1873-????, 689540=Christened there on 01/05/1836., 169012=ELSIE KATE CLEMENTS 1895-????, 658437=In 1891 Sarah and William were living at 8 Sylvan Villas, Chitts Hill, Tottenham, London with their children Alice, Hubert, Edmond, Ethel, Allida, Daisy and Ernest. Also living there was Susan Perry (general domestsic servant). William was still employed as a banker's clerk. Class: RG12; Piece: 1079; Folio 117; Page 42; GSU roll: 6096189., 158251=In 1901 Dolcie was living in Boro End, Borough Green with her parents and siblings Dan, Maggie, Abner, Barnard, Horace and Nina. Class: RG13; Piece: 1537; Folio: 23; Page: 10., 507063=In 1861 Maryann was living in Stoney Street, Dullingham with her parents and siblings Eliza, Georgina and Eleanor. Class: RG9; Piece: 1031; Folio: 48; Page: 4; GSU roll: 542740., 15169=Married Margaret on 12/11/1966., 842809=MARY CLEMENTS 1831-????, 755530=In 1861 Susan and Leonard were living in Stoney Street, Dullingham with their baby daughter Emma. Susan's parents and grandmother lived next door. Mark was employed as a blacksmith. Class: RG9; Piece: 1031; Folio: 48; Page: 4; GSU roll: 542740., 363391=In 1901 Thomas was living in GB Cottages, Gainford with his parents and siblings Elizabeth and Harry. Thomas was employed as a general farm hand. Class: RG13; Piece: 4655; Folio: 51; Page: 15., 177833=Christened there on 28/09/1879., 448733=In 1891 Waldo was living at 6 Kings Road, Eccleston with his parents and siblings Charlotte, Ellen, Caroline, Henry, Robert, Constance, Sidney, Winifred, Frederick, Mildred and Arthur. Boarding with them was a widow named Agnes Richardson (living on her own means). Class: RG12; Piece: 3017; Folio 30; Page 10; GSU roll: 6098127., 693312=I cannot find William in 1871., 592565=In 1871 Emily was employed as a kitchenmaid in The Cedars, Ewell, Surrey. This was the home of Hariet Lempriere (Officer's widow). Her sister, Phoebe was also working there as a cook. Class: RG10; Piece: 799; Folio: 97; Page: 17; GSU roll: 827746., 786524=Did William died in Dullingham in 1823. There is a William of the correct age buried there., 614210=Christened there on Christmas Day 1834., 380841=In 1881 John was living in West Side, Langton, County Durham with his parents and siblings Elizabeth and James. Class: RG11; Piece: 4931; Folio: 76; Page: 1; GSU roll: 1342185., 453521=In 1891 Constance was living at 6 Kings Road, Eccleston with her parents and siblings Charlotte, Ellen, Caroline, Henry, Robert, Sidney, Winifred, Frederick, Mildred, Arthur and Waldo. Boarding with them was a widow named Agnes Richardson (living on her own means). Class: RG12; Piece: 3017; Folio 30; Page 10; GSU roll: 6098127., 103054=THOMAS PERCY KENNEDY 1900-????, 384663=In 1881 Elizabeth was living in West Side, Langton, County Durham with her parents and siblings Ada, John and James. Class: RG11; Piece: 4931; Folio: 76; Page: 1; GSU roll: 1342185., 704928=Christened there on 23/08/1852., 93336=ETHEL KENNEDY 1905-09/05/1973, 309764=Christened there on 03/05/1868., 864521=In 1861 Sarah was living in Wattlesborough Heath, Albesbury, Shropshire with her sons Robert, Alfred and Frederick. Robert snr was away working as a butler on census day. Also living there was a servant named Ann Griffiths. Class: RG9; Piece: 1865; Folio: 12; Page: 17; GSU roll: 542879., 774814=Christened there on 02/05/1819., 457363=In 1901 Ellen was living in the bank House, Claughton Street, St Helens, Lancashire with her parents and siblings Charlotte, Harry, Robert, Constance, Sidney, Winifred, Frederick, Mildred, Arthur, Waldo and Dorothy. Class: RG13; Piece: 3521; Folio: 65; Page: 11., 174010=In 1901 Ellen and John were living at 7 Kimberley Gardens, Hull, Yorkshire. Boarding with them was Ellen's brother, Charles. John was employed as a ? carman. Class: RG13; Piece: 4503; Folio: 73; Page: 9., 634975=Adeliza possibly died in Q1 1927 in the Poplar reg district of London., 438126=CHARLES HENRY CLEMENTS 1890-????, 460474=In 1901 Ellen and Frank were living in Brinkley, Cambridgeshire with their children Albert, Lawrence, Olive and baby Stella. Their children Frank and Elsie were at the home of their maternal grandparents that day. Frank was employed as a carpenter and wheelwright. Class: RG13; Piece: 1537; Folio: 34; Page: 4., 177794=In 1881 Jonas was living in Wentworth with his parents and siblings John, Clara, James, Eliza and Robert. Class: RG11; Piece: 1683; Folio: 74; Page: 1; GSU roll: 1341402., 384702=Christened there on 27/07/1873., 708798=In 1861 John was living in Garden House, ? Park, Newmarket All saints, Cambridgeshire with his father and siblings Martha and Mary. Also there was his cousin, Mary Stubbings. Class: RG9; Piece: 1031; Folio: 123; Page: 21; GSU roll: 542740., 495392=In 1881 Mary Ann and George were living in Boro End, Borough Green, Cambridgehsire with their children Dan, Fanny, Maggie and Arthur. George was employed as a bricklayer. Class: RG11; Piece: 1674; Folio: 6; Page: 6; GSU roll: 1341400., 631155=In 1841 Richard was living in Wood Ditton with his parents and siblings Caroline and Susan. Class: HO107; Piece 65; Book: 7; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 10; Folio: 10; Page: 15; Line: 18; GSU roll: 241222., 600306=Frances only lived about a year, dying in Wood Ditton and was buried there on 02/11/1847., 530837=In 1891 Betsy and James were living in Main Street, Wentworth with their children James, Eliza, Oliver and grand daughter Florence (daughter of Mary). James (and James jnr) was employed as a farm labourer., 353382=ETHEL VIOLET V WALLER 1874-????, 834212=Matilda died in 1865 in Saxon Street, Wood Ditton and was buried in Wood Ditton on 19/03/1865., 614163=In 1851 James was living in Little Ditton, Cutting Green, Wood Ditton with his mother and maternal grandfather. Also living there was a lodger named William Misson. Class: HO107; Piece: 1762; Folio: 107; Page: 23; GSU roll: 193654., 856842=In 1841 Francis was living at home in Dullingham with his parents and sister Mary. Francis was employed as an agricultural labourer. Class: HO107; Piece 71; Book: 7; Civil Parish: Dullingham; County: Cambridgeshire; Enumeration District: 2; Folio: 10; Page: 14; Line: 15; GSU roll: 241224., 162729=Fanny died in the Newmarket reg district in Q3 1899., 288293=In 1881 Richard was living with his parents and siblings William, Sarah, Walter and John in Hind House, Hartlepool, County Durham. Class: RG11; Piece: 4912; Folio: 4; Page: 6; Line: ; GSU roll: 1342182., 600202=ELIZABETH STUBBINGS 1848-????, 353302=In 1881 Ethel was living at 5 Chatteris Road, Islington with her parents and siblings Arthur, Amy, Alice, Edmond, Norman and Daisy. Class: RG11; Piece: 276; Folio: 118; Page: 36; GSU roll: 1341060., 23977=Wonderlust must have still been in Eddie and Betty's bones as they moved from Ramsey back to Betty's home town of Hastings where they first stayed with their daughter Kim and her family at 409A Battle Road, St Leonards on Sea. This enabled them to find a home of their own and they stayed at 28 Pine Avenue, Hastings, 8 Berlin Road, Hastings and finally in July 2004 they moved into their last flat at 40A Queens Road., 705014=MATILDA STUBBINGS 1835-1852, 177915=JONAS WHETSTONE 1879-????, 693274=William died in 1881., 438032=In 1891 Charles was living at 186 Manchester Road, Ince in Makerfield, Lancashire with his parents and siblings Frederick, Emily, Edith, Nellie, Margaret and Alfred. Also there was a 15 year old domestic servant named Kate Haskin, who was said to be a daughter, but I think that is wrong. Class: RG12; Piece: 3061; Folio 89; Page 15; GSU roll: 6098171., 548145=Married James Bird (b 1841 in Cheveley) in the Newmarket reg district in Q2 1864., 689454=MARY ANN STUBBINGS 1837-1895, 116535=In 1901 Cecil was living at 76 St Philips Road, Exning, Suffolk with his parents and siblings Rose, Alfred, Bertie and Frank. Class: RG13; Piece: 1541; Folio: 65; Page: 54., 552559=THOMAS CLEMENTS 1838-????, 138515=In 1901 Frederick was living in Littlemoor, Newbold and Dunston, Derbyshire with his parents and siblings Harriet, Oliver, Jane and Ellen. Class: RG13; Piece: 3250; Folio: 96; Page: 4., 441903=EDITH MARY CLEMENTS 1881-????, 63067=HILDA WHETSTONE 1900-????, 158343=DOLICE PORTIA BARRETT 1893-????, 609804=I cannot find Phoebe in 1861., 708837=Christened there on 02/07/1856., 72572=There was an Edward J, right age died in Q3 1919 in St George Hanover Square reg district, London. Is this our man?, 648690=Alice died in Fulham, London in 1912., 444818=DOROTHY MARJORIE CLEMENTS 1890-????, 812701=Christened there on 09/05/1819., 106933=ARCHIBALD CRAIG 1902-???, 165249=Robert died in the Newmarket reg district in Q2 1892., 856881=Christened there on 23/11/1823., 634890=HENRY STUBBINGS 1857-????, 767075=In 1841 Charles was living with his parents in Stoney Street, Dullingham. Class: HO107; Piece 71; Book: 7; Civil Parish: Dullingham; County: Cambridgeshire; Enumeration District: 2; Folio: 9; Page: 12; Line: 17; GSU roll: 241224., 309859=WILLIAM ASHMAN 1868-????, 882070=John died in 1871 in the Newmarket reg district and was buried in Wood Ditton on 16/09/1871., 448846=WALDO JOHN CLEMENTS 11/06/1890-04/02/1977, 120777=DOROTHY M KNOWLES 02/09/1917 -????, 134633=STELLA GRACE JACOBS 1901-????, 635361=In 1871 Eliza was possibly working as a domestic servant at 37 Godolphin Road, Hammersmith, London. This was the home of Arnie G Godwin (ladies school) and his children. Class: RG10; Piece: 64; Folio: 57; Page: 37; GSU roll: 824575., 227412=In 1871 Annie was living in Hills Road, Trumpington, Cambridgeshire with her parents and siblings Clara, Mary and baby William. Class: RG10; Piece: 1584; Folio: 91; Page: 28; GSU roll: 829806., 63361=MABEL WHETSTONE 1899-????, 812908=Elizabeth died in Wood Ditton in 1865 and was buried there on 28/02/1865., 767393=MARY NUNN abt 1827-abt 1837, 110927=In 1901 Frances was living on The Green, Gainford, County Durham with her parents and sister Ethel. Class: RG13; Piece: 4655; Folio: 60; Page: 10., 384816=ELIZABETH AMELIA STUBBINGS 1873-????, 689347=Christened there on 24/09/1837., 774916=CHARLES CLEMENTS 1819-1889, 162385=In 1891 Maggie was living in the same place with her parents and siblings Dan, Abner, Biddie, Barnard, Effie and Horace. Class: RG12; Piece: 1292; Folio 20; Page 11; GSU roll: 6096402., 587582=In 1871 Thomas was still living in Ditton Green with his parents and siblings Gabriel and Elijah. Lodging there again was Martin Allard (agricultural labourer). Class: RG10; Piece: 1595; Folio: 75; Page: 8; GSU roll: 829811., 453176=In 1901 Constance was living in the bank House, Claughton Street, St Helens, Lancashire with her parents and siblings Charlotte, Ellen, Harry, Robert, Sidney, Winifred, Frederick, Mildred, Arthur, Waldo and Dorothy. Constance was a student at a school of cookery. Class: RG13; Piece: 3521; Folio: 65; Page: 11., 106619=GLADYS IVY CRAIG 1905-1938, 380428=Married Margaret Elizabeth Burnsides (b 1874 in Aycliffe, County Durham) in the Darlington reg district in Q2 1898., 173615=In 1881 Emma was living in a cottage in Beeford, Driffield with her parents and siblings Charles and Ellen. Class: RG11; Piece: 4792; Folio: 74; Page: 3; GSU roll: 1342156., 158575=In 1901 Horace was living in the same place with his parents and siblings Dan, Maggie, Abner, Barnard, , Dolcie and Nina. Class: RG13; Piece: 1537; Folio: 23; Page: 10., 353770=In 1891 Edmond was living at 8 Sylvan Villas, Chitts Hill, Tottenham, London with his parents and siblings Alice, Hubert, Ethel, Allida, Daisy and Ernest. Also living there was Susan Perry (general domestsic servant). Edmond was employed as a merchant's clerk. Class: RG12; Piece: 1079; Folio 117; Page 42; GSU roll: 6096189., 403313=ANN ELIZABETH BRIGHTWELL 1872-????, 600434=FRANCES ANN STUBBINGS 1846-1847, 708920=JOHN STUBBINGS 1856-1925, 674197=In 1861 Maria was employed as a nursemaid at Meatmore House, High Street, Newmarket St Mary, Cambridgeshire. This was the home of George B Mead (M.D. M.R.&L.A.C. London) and his family. Class: RG9; Piece: 1032; Folio: 130; Page: 21; GSU roll: 542740., 610252=PHOEBE STUBBINGS 1841-?924, 843153=Alice died in 1895 in Newmarket., 433590=In 1901 Sylvia was living at 27 Hampstead Road, Preston, Sussex with her parents and sisters Violet and Hilda. Class: RG13; Piece: 939; Folio: 144; Page: 6., 169322=JOHN CLEMENTS 1892-????, 227452=Christened there on 02/05/1869 ., 514878=In 1861 Emma was living in Cheveley Green, Cheveley with her parents and siblings Thomas, Susan, John, Mary, Charles, Oliver and Joseph. Class: RG9; Piece: 1031; Folio: 40; Page: 19; GSU roll: 542740., 600344=Christened there on 15/11/1846, 169234=In 1901 John was living in Ling Moor, Beeford with his parents and siblings Alice, Clara, Elsie, Ernest and Mary. Class: RG13; Piece: 4517; Folio: 5; Page: 2., 164904=In 1901 Lily was living in the Duddery, Newmarket St Mary with her parents and siblings William and John. Class: RG13; Piece: 1541; Folio: 121; Page: 31., 54710=Did James marry Rose Harlock in Q2 1927 in the Newmarket reg district, Cambridgeshire?, 363183=Marrried in Q2 1910 in the Teesdale reg district, County Durham to either Eliza Jane Dixon OR Minnie Sayer., 403222=In 1881 Annie was living living in a cottage in Mill Road, Stetchworth, Cambridgeshire with her father, stepmother, brother Harry and step brother Herbert. Class: RG11; Piece: 1675; Folio: 66; Page: 19; GSU roll: 1341401., 767447=William died in Dullingham around 1828., 468282=In 1871 Emma was living in Own Cottage, Dullingham with her mother and half siblings Ellen and baby Frank. I believe this was probably the same house as 10 years ago and Emma's grand parents and great grandmother still lived next door. Class: RG10; Piece: 1594; Folio: 56; Page: 11; GSU roll: 829811., 72402=FLORENCE ETHEL KNOWLES 1903-????, 106547=I believe Gladys died in the Fulham reg district in Q3 1938., 667501=In 1901 Maria and Charles were still living at 88 Blythe Road with their children Charles (Arthur), Henry, Eliza and James. Charles was employed as a bricklayer (as were his sons Charles and Henry) and Maria was a laundress. Class: RG13; Piece: 49; Folio: 40; Page: 5., 658706=In 1881 Sarah and William were living at 5 Chatteris Road, Islington with their children Arthur, Amy, Alice, Edmond, Ethel, Norman and Daisy. William was still working as a banker's clerk. Class: RG11; Piece: 276; Folio: 118; Page: 36; GSU roll: 1341060., 812806=THOMAS STUBBINGS 1819-1890, 134548=In 1901 baby Stella was living in Brinkley, Cambridgeshire with her parents and siblings Albert, Lawrence and Olive. Class: RG13; Piece: 1537; Folio: 34; Page: 4., 704600=In 1851 Matilda was living in Little Ditton with her parents and siblings Mary Ann, John, Agnes, Betsey, William, Abraham, Robert and Charles. Class: HO107; Piece: 1762; Folio: 105; Page: 19; GSU roll: 193654., 767486=Christened there on 08/08/1824., 587621=Christened there on 29/04/1860., 689308=In 1851 Mary Ann was living in Saxon Street, Wood Ditton with her parents and siblings William, John, Maria, Sarah, Alice and James. Class: HO107; Piece: 1762; Folio: 111; Page: 31; GSU roll: 193654., 610167=Christened there on 28/11/1841., 442208=In 1901 Emily was living at 10 Freckleson Street, Wigan with her parents and siblings Frederick, Edith, Nellie, Margaret, Alfred, Charles and Robert. Emily was employed as a stationer's assistant. Class: RG13; Piece: 3558; Folio: 55; Page: 8., 288638=He, like the other brothers is missing on the 1891 and 1901 census., 173703=EMMA CLEMENTS 1881-????, 116346=In 1911 Cecil was living at Lordship Farm, Dullingham, Cambridgeshire his parents and siblings Alfred and Frank., 592825=Christened there on 25/05/1851., 648327=In 1851 James was living in Saxon Street, Wood Ditton with his parents and siblings William, Mary Ann, John, Maria, Sarah and Alice. Class: HO107; Piece: 1762; Folio: 111; Page: 31; GSU roll: 193654., 600517=Noah died in Wood Ditton in 1915 and was buried there on 16/11/1915., 103316=In 1901 Minnie was living at Wind Hill, Bransdale, Yorkshire with her mother, step father, step brothers Robert, John and George and her brother Thomas. Class: RG13; Piece: 4552; Folio: 65; Page: 5., 227538=ANNIE ELIZABETH BIRD 1868-????, 786758=Abraham died in 1885 in the Newmarket reg district., 755271=Leonard died in Dullingham, Cambridgeshire in 1867., 717792=In 1871 Louisa was living with her parents in Chapel Place North, St George Hanover Square. There were also a couple of lodger living with them, named Daniel Meaman (unemployed domestic servant) and Robert Wilson (master painter). Class: RG10; Piece: 101; Folio: 88; Page: 19; GSU roll: 838762., 165106=In 1891 Lily was living in Bedlam Square, Burwell, Cambridgeshire with her parents and siblings William, John and Robert. Class: RG12; Piece: 1293; Folio 42; Page 16; GSU roll: 6096403., 507249=Eliza very likely died in Newmarket in Q1 1912., 767272=Mary died in Dullingham around 1837., 592786=In 1861 Emily was living in Ditton Green, Wood Ditton with her parents and siblings Charles, Noah, Elizabeth, Gabriel, Catherine and Elijah. Class: RG9; Piece: 1031; Folio: 157; Page: 7; GSU roll: 542740., 143145=FRANK MARSHALL NUNN 1888-???, 495143=In 1891 Mary Ann and George were living in the same place with their children Dan, Maggie, Abner, Biddie, Barnard, Effie and Horace. George was employed as a bricklayer and his son Dan as a bricklayer's labourer (working for his father, perhaps?) Class: RG12; Piece: 1292; Folio 20; Page 11; GSU roll: 6096402., 610128=In 1851 Phoebe was living in Little Ditton, Wood Ditton with her parents and siblings Charles, George, Noah and Elizabeth. Also living there was a lodger named Martin Allard (agricultural labourer) who was possibly a relative of her mother. Class: HO107; Piece: 1762; Folio: 107; Page: 22; GSU roll: 193654., 552715=I cannot find Eleanor anywhere else although I did find 2 deaths on FreeBMD in the Newmarket reg district, one in 1858 and the other in 1861., 515035=I believe Jospeh died in Cheveley in either Q3 1861 or Q2 1865., 271241=In 1901 Agnes was employed as a general servant at walsham (?) Hall, Newmarket St Mary, Cambridgeshire. This was the home of Joseph Proctor (some kind of shopkeeper) and his family. Class: RG13; Piece: 1541; Folio: 106; Page: 1., 63266=In 1901 Mabel was living in West Fen Drove, Isle of Ely with her parents and sister Hilda. Class: RG13; Piece: 1544; Folio: 37; Page: 8., 169452=Did Clara marry Albert James Mann in Q1 1908 in the Driffield reg district?, 310076=In 1871 Margaret was living in Saxon Street with her parents and siblings William and Sarah. Class: RG10; Piece: 1595; Folio: 86; Page: 30; GSU roll: 829811., 834482=In 1861 Abraham and Matilda were living in Saxon Street, Wood Ditton with their children John, Betsy, William and Abraham. Abraham was employed as an agricultural labourer, as were his sons. Class: RG9; Piece: 1031; Folio: 172; Page: 37; GSU roll: 542740., 323264=In 1881 Ellen was living in Little Ditton, Wood Ditton with her parents and siblings Eliza, William, George, John, Henry and Mary. Class: RG11; Piece: 1675; Folio: 79; Page: 11; GSU roll: 1341401., 648366=Christened there on 16/09/1849., 775058=Elizabeth died in the Newmarket reg district, Cambridgeshire in 1853., 93611=Married Thomas C Kay in Q1 1931 in Yorkshire somewhere., 881859=Christened there on 25/12/1784., 686657=Married Samuel Starling (b 1833 in Cheveley) in Wood Ditton on Christmas Day 1867. The witnesses at their wedding were William Stubbings and Eliza Stubbings. Samuel was a gelder when they married (Ouch!)., 483612=In 1901 James and Elizabeth were living in Blackwell Road, Hucknall under Huthwaite, Notinghamshire with James's sons James and Frank. There were also 2 boarders by the names of J and C Edwards (coal miners). James was still working as a coal miner. Class: RG13; Piece: 3138; Folio: 113; Page: 1., 630890=In 1851 Richard was living in Saxon Street, Wood Ditton with his parents and siblings Caroline, Susan, Sarah, James and Jane. there was also a visitor that day by the name of William Coe who was only 2 months old. Richard was employed as an agricultural labourer. Class: HO107; Piece: 1762; Folio: 117; Page: 43; GSU roll: 193654., 28644=In October 1961 Eddie was posted to RAF Bruggen in West Germany. As was the usual, Eddie went on ahead and waited for a married quarter. While waiting, the family lived for a short time in a block of flats in Eindhoven, Holland., 380649=In 1891 John was employed as a farm servant at Bowfield Farm, Bowes, Yorkshire. This was the home of Richard Metcalfe (farmer) and his family. Class: RG12; Piece: 4081; Folio 28; Page 2; GSU roll: 6099191., 767308=Christened there 01/04/1827., 314584=In 1891 Thomas was living in Little Ditton, Wood Ditton with his parents and siblings George, John, Henry, Mary, Sarah, Charles, Gertie and baby Grace. Class: RG12; Piece: 1292; Folio 105; Page 12; GSU roll: 6096402., 843113=In 1901 Robert was living in The Avenue, All Saints, Newmarket. Also living there was widow Eliza Holland. She was listed as housekeeper, so maybe house keeper to Robert. Robert was now retired. Class: RG13; Piece: 1541; Folio: 170; Page: 46., 111014=FRANCES MARY HOBSON 1899-????+++, 138268=OLIVER NUNN 04/11/1891-1974, 457708=In 1891 Ellen was living at 6 Kings Road, Eccleston with her parents and siblings Charlotte, Caroline, Henry, Robert, Constance, Sidney, Winifred, Frederick, Mildred, Arthur and Waldo. Boarding with them was a widow named Agnes Richardson (living on her own means). Class: RG12; Piece: 3017; Folio 30; Page 10; GSU roll: 6098127., 747824=Married Ellen Wallwork (b 1850 in Worley, Lancashire) in Q3 1870 in the Wigan reg district, Lancashire., 288562=Married in Q1 1902 in the Northallerton N. Yorks reg district to either Maud Elizabeth Hayes or Jane Elizabeth Richardson., 349768=Born in Wood Ditton, Cambridgeshire (on 1881 census) and London on the 1871 (Battersea) and 1891 (Chelsea)censi., 755212=Married William Mark Woollard (b 1841 in Kirtling) in Dullingam on 05/06/1869., 173791=Ellen possibly died in Q2 1949 in the Grimbsy reg district, Lincolnshire., 587727=THOMAS STUBBINGS 1860-????, 613915=Married Frances Baldwin (b 1836 in Wood Ditton) in Wood Ditton on 27/11/1857. The witnesses at their wedding were M A Wiseman and Samuel Swann. James was a labourer., 418633=Married Mina Mitchell (b abt. 1880 in London) in Holburn., 786691=WILLIAM CLEMENTS 1812-1823 ?, 349816=JAMES WILLIAM STUBBINGS 1869-????, 363021=HARRY STUBBINGS 1894-????, 507187=MARY ANN CLEMENTS 1851-1883, 881820=Married Elleanor ? (b 1792 in Weston Coleville) in Cambridgeshire in 1810., 103401=MINNIE ASHMAN 1897-????, 693552=In 1861 William was living in Saxon Street, Wood Ditton with his parents and siblings John, Betsy and Abraham. William was employed as an agricultural labourer. Class: RG9; Piece: 1031; Folio: 172; Page: 37; GSU roll: 542740., 116226=Married Gwendolen Beamiss (b 17/02/1904 in Ely, Cambridgeshire) on 01/04/1929 in Holy Trinity, Ely. At the time of his marriage, Cecil was a school master and living at 5 Station Terrace, Ely., 530624=In 1901 Betsy and James were living in Mortons (or Mortow) Cottage, Wentworth with their son Jonas. James was employed as a yardman on a farm (cattle). His son was a shepherd. Class: RG13; Piece: 1544; Folio: 67; Page: 4., 514957=EMMA CLEMENTS 1858-????, 804322=In 1851 Thomas and Betsey were living in Little Ditton with their children Charles, Phoebe, George, Noah and Elizabeth. Also living there was a lodger named Martin Allard (agricultural labourer) who was possibly a relative of Betsey. Thomas was employed as an agricultural labourer Class: HO107; Piece: 1762; Folio: 107; Page: 22; GSU roll: 193654., 188980=In 1891 Clara and Thomas were living in Chatteris Road, Somersham, Huntingdonshire with their daughter Annie. Clara's 11 year old brother Jonas was a lodger with them. Thomas was employed as a farm labourer. Class: RG12; Piece: 1239; Folio 29; Page 24; GSU roll: 6096349., 80858=In 1911 Walter was living in Wind Hill with his parents and siblings Percy, Blanche, Phoebe, Ethel and baby Albert., 635609=Christened there on 04/03/1855., 659034=In 1871 Sarah and William were living at 5 Moray(?) Road, Islington, London with their children Arthur, Amy and Alice. Also living there was a servant by the name of Sarah Barber (personal domestic servant). William was employed as a banker's clerk. Class: RG10; Piece: 299; Folio: 28; Page: 50; GSU roll: 824927., 899595=Married Elizabeth Clayton (b abt. 1760) on 22/10/1781 in Dullingham., 142521=Married Emma Smith on 13/09/1913 in Chesterfield, Derbyshire., 591876=In 1861 Gabriel was living in Ditton Green, Wood Ditton with his parents and siblings Charles, Noah, Elizabeth, Emily, Catherine and Elijah. Class: RG9; Piece: 1031; Folio: 157; Page: 7; GSU roll: 542740., 54979=JAMES LOT HENRY WHETSTONE 1900-????, 93734=In 1911 Phoebe was living in Wind Hill with her parents and siblings Percy, Blanche, Ethel, Walter and baby Albert., 759000=Charles died in Hucknall Huthwaite, Mansfield, Nottinghamshire in 1905., 631803=In 1901 Harry and Emma were living at 14 ?, Marylebone. Harry was still employed as a cabinrt maker. Class: RG13; Piece: 117; Folio: 99; Page: 21., 649023=In 1901 Alice and William were living at 72 Protheroe Road, North West Fulham with their children William, Mary, Ruby and John. William was still employed as an attendant at the Law Courts. Alice's daughter, Agnes and her family lived in another section of the same house.. Class: RG13; Piece: 55; Folio: 12; Page: 16., 626849=Married George Walter Ashman (b 1841 in Cowlinge, Suffolk) in Wood Ditton on 01/10/1864. George was a labourer when they married and the brother of John Ashman who married sarah's sister, Jane. The witnesses at their wedding were James Ashman and Susan Stubbings., 371631=MARY ELLEN STUBBINGS 1882-????, 456708=In 1891 Caroline was living at 6 Kings Road, Eccleston with her parents and siblings Charlotte, Ellen, Henry, Robert, Constance, Sidney, Winifred, Frederick, Mildred, Arthur and Waldo. Boarding with them was a widow named Agnes Richardson (living on her own means). Class: RG12; Piece: 3017; Folio 30; Page 10; GSU roll: 6098127., 705295=Nothing else is currently known, although there are 2 deaths in 1863 for John Stubbings in the Newmarket area., 139201=In 1901 Harriet was living in Littlemoor, Newbold and Dunston, Derbyshire with her parents and siblings Frederick, Oliver, Jane and Ellen. Harriet was working as a dressmaker. Class: RG13; Piece: 3250; Folio: 96; Page: 4., 591915=Christened there on 20/02/1853., 102426=In 1911 Blanche was living in Wind Hill with her parents and siblings Percy, Phoebe, Ethel, Walter and baby Albert., 388950=Christened there on 05/03/1871., 228177=MARY ALICE BIRD 1867-????, 51159=Married John Edwards Cookson on 18/09/1950 in Blackpool regisrty Office, Lancashire., 107328=AMELIA CRAIG 1900-???, 609505=In 1881 Phoebe was employed as a cook in Houghton Hall, Houghton Regis, Bedfordshire. This was the home of Henry C. G. Brandreth (landed proprietor) Class: RG11; Piece: 1647; Folio: 14; Page: 21; GSU roll: 1341393., 270376=ELLEN STUBBINGS 1890-????, 690174=WILLIAM STUBBINGS abt. 1835-1862, 111223=In 1901 Ethel was living on The Green, Gainford, County Durham with her parents and sister Frances. Class: RG13; Piece: 4655; Folio: 60; Page: 10., 326745=Rose then married Albert Edward Roberts (b 04/07/1889 in Drury's Newgate, Cheshire). I have yet to find the marriage on Free BMD., 353984=In 1881 Edmond was living at 5 Chatteris Road, Islington with his parents and siblings Arthur, Amy, Alice, Ethel, Norman and Daisy. Class: RG11; Piece: 276; Folio: 118; Page: 36; GSU roll: 1341060., 899634=Christened there on 04/08/1755., 349584=In 1871 James was living with his mother and half sister in Saxon Street, Wood Ditton. This was the home of his maternal grandparents and he shared the home with his uncle Harry. Also there that day was his cousin Ellen Smith. Class: RG10; Piece: 1595; Folio: 85; Page: 28; GSU roll: 829811., 134886=In 1901 Elsie was visiting her maternal grandparents on census day. She was in Station Road, Dullingham and her brother Frank was also with her. Class: RG13; Piece: 1537; Folio: 49; Page: 18., 856537=I think I have found Francis in 1851. He is employed as a tollsman in a mansion in Wimborne St Giles, Dorset. The head of the house was the Earl of Shaftesbury. His name is very difficult to read). Class: HO107; Piece: 1854; Folio: 243; Page: 19; GSU roll: 221001., 287872=He possibly married Edith M Panaby in the Darlington reg district in Q4 1910., 173426=In 1891 Emma was living in Bridlington Road, Beeston with her parents and siblings Ellen, Arthur, Aaron, Elizabeth, Alice and baby Clara. Class: RG12; Piece: 3953; Folio 19; Page 8; GSU roll: 6099063., 468498=In 1861 Emma was living in Stoney Street, Dullingham with her parents. Her maternal grand parents and great grand mother lived next door. Class: RG9; Piece: 1031; Folio: 48; Page: 4; GSU roll: 542740., 843457=In 1891 Robert and Alice were living in The Lodge, The Park, All Saints. (John was living next door in the old house). Robert was employed as a stud groom. Also living in the house was Louise Amos (general domestic servant). Class: RG12; Piece: 1294; Folio 67; Page 19; GSU roll: 6096404., 514073=AGNES GEORGINA LAKE 1840-????, 552136=In 1851 Thomas was living in Cheveley Green, Cheveley with his parents and siblings Susanna, William, John, Betsy, Mary and baby Charles. Class: HO107; Piece: 1762; Folio: 169; Page: 19; GSU roll: 193654., 388911=In 1881 Ada was living in West Side, Langton, County Durham with her parents and siblings Ada, Elizabeth, John and James. Class: RG11; Piece: 4931; Folio: 76; Page: 1; GSU roll: 1342185., 758921=Sophia died in the Union Workhouse, Chesterfield, Derbyshire on 09/09/1908., 72163=Did Sydney marry Geary in Q1 1932 in the Amersham reg district, Buckinghamshire?, 433891=In 1891 Sylvia was still living at 67 East Street, Brighton with her parents and siblings Bertha, Flora, Albert, Violet and Minnie. I believe the accommodation was either behind or above a shop, which their father managed. Class: RG12; Piece: 813; Folio 10; Page 14; GSU roll: 6095923., 767725=James died in Dullingham on 27/05/1840. The informant on the death certificate was Ellen Clements, his aunt and wife of Reuben Clements., 468537=Christened there on 23/09/1860., 315207=In 1891 Charles was living in Little Ditton, Wood Ditton with his parents and siblings George, John, Henry, Mary, Sarah, Thomas, Gertie and baby Grace. Class: RG12; Piece: 1292; Folio 105; Page 12; GSU roll: 6096402., 737108=In 1871 Alfred was living with his brother Robert and his wife at 13 Poolslock Lane, Wigan, Lancashire.Afred, like his brother was employed as a railway accountant. Class: RG10; Piece: 3888; Folio: 4; Page: 2; GSU roll: 842038., 219508=In 1871 John was living in Wentworth with his father and siblings Mary and William. Also there that day was his aunt, Emily Clemence. Class: RG10; Piece: 1603; Folio: 80; Page: 1; GSU roll: 829814., 693903=WILLIAM STUBBINGS 1841-1881, 362940=In 1901 Harry was living in GB Cottages, Gainford with her parents and siblings Elizabeth and Thoma. Class: RG13; Piece: 4655; Folio: 51; Page: 15., 674556=MARIA STUBBINGS 1842-???, 157721=Married Mark samuel G Drewell (b abt. 1892 in Wangford). I have tried to find a marriage but so far have not., 635570=In 1861 Adeliza was living in Saxon Street with with her parents and siblings Mary Ann, John, Alice, James, Susannah and Harry. Class: RG9; Piece: 1031; Folio: 168; Page: 30; GSU roll: 542740., 437663=In 1901 Charles was living at 10 Freckleson Street, Wigan with his parents and siblings Frederick, Emily, Edith, Nellie, Margaret, Alfred and Robert. Class: RG13; Piece: 3558; Folio: 55; Page: 8., 690083=Christened there on 05/10/1834., 349648=Christened in Wood Ditton, cambridgeshire on 25/07/1869., 592001=GABRIEL STUBBINGS 1853-????, 833726=In 1881 Abraham was living at 2 Ruse's Cottages, Newmarket All Saints with his son Abraham and daughter Hannah. I believe Hannah was actually Abraham junior's wife, rather than Abraham senior's daughter. Abraham was an annuitant. Class: RG11; Piece: 1675; Folio: 46; Page: 40; GSU roll: 1341401., 449268=In 1901 Arthur was living in the bank House, Claughton Street, St Helens, Lancashire with his parents and siblings Charlotte, Ellen, Harry, Robert, Constance, Sidney, Winifred, Frederick, Mildred, Waldo and Dorothy. Class: RG13; Piece: 3521; Folio: 65; Page: 11., 219547=Christened there on 08/10/1865., 666803=In 1861 Sarah was possibly worked as a domestic servant at 29 Green Street, Cambridge. This was the home of Joseph Ryder (Wesleyan Methodist Local ?, tailor and robemaker employing 7 men and 2 boys) and his family. Class: RG9; Piece: 1025; Folio: 114; Page: 14; GSU roll: 542739., 414584=In 1881 Matilda was a visitor at Park Cottage, Newmarket St Marys. This was the home of widow Eliza Simpson (annuitant) and her son. Also there that day was Eliza's grand daughter, Agnes Brightwell which may suggest this was the home of a relative of Matilda's stepfather George Brightwell. Was Agnes, actually another child of George and Betsy and therefore a half sister to Matilda? Class: RG11; Piece: 1675; Folio: 40; Page: 28; GSU roll: 1341401., 315296=CHARLES ARTHUR PRICE 1883-????, 899738=JOHN CLEMENTS abt 1755-1824?, 177311=In 1901 Jonas was living in Mortons (or Mortow) Cottage, Wentworth with his parents. He was employed as a shepherd. Class: RG13; Piece: 1544; Folio: 67; Page: 4., 54876=In 1901 baby James was living in Cannon Street, Downham St Leonards, Cambridgeshire with his parents. Class: RG13; Piece: 1547; Folio: 124; Page: 10., 111309=ETHEL ANNIE HOBSON 1895-????+++, 613742=In 1861 James and Frances were lodging in Wood Ditton with his mother and maternal grandfather. James was employed as an agricultrual labourer. Class: RG9; Piece: 1031; Folio: 160; Page: 13; GSU roll: 542740., 119888=In 1901 Lily was employed as a housemaid in High Street, Newmarket All Saints. This was the home of Herbert Golding (Outfitter and clother). Class: RG13; Piece: 1541; Folio: 126; Page: 1., 157914=In 1901 Nina was living in Boro End, Borough Greene with her parents and siblings Dan, Maggie, Abner, Barnard, Horace and Dolcie. Class: RG13; Piece: 1537; Folio: 23; Page: 10., 323052=In 1891 Ellen was employed as a kitchen maid at the Rutland Arms Hotle, Newmarket All saints. The head of this hotel was widow Betsy Stebbings (not sure if ther's a connection or not) and her daughter. Class: RG12; Piece: 1294; Folio 62; Page 10; GSU roll: 6096404., 690044=In 1851 William was living in Saxon Street, Wood Ditton with his parents and siblings , Mary Ann, John, Maria, Sarah, Alice and James. William was employed as an agricultural labourer. Class: HO107; Piece: 1762; Folio: 111; Page: 31; GSU roll: 193654., 748134=In 1861 Robert was living in Wattlesborough Heath, Albesbury, Shropshire with his mother and brothers Alfred and Frederick. His father was away working as a butler on census day. Also living there was a servant named Ann Griffiths. Class: RG9; Piece: 1865; Folio: 12; Page: 17; GSU roll: 542879., 709250=In 1871 Mary was employed as a kitchen maid at 13 Hyde Park gate South, London. This was the home of Charles Rivaz (underwriter at Lloyds) and his wife. Also working there in service was her sister Martha. Class: RG10; Piece: 29; Folio: 70; Page: 61; GSU roll: 838757., 93839=PHOEBE KENNEDY 1903-????, 600785=Eliza died in Wood Ditton in 1900 and was buried on 21/06/1900., 102532=BLANCHE KENNEDY 1901-????, 274826=In 1871 George was living in Drift Way, Lewisham with his parents and sister Emma. was also a lodger named George Thomas (carman). Class: RG10; Piece: 767; Folio: 71; Page: 45; GSU roll: 824731., 389060=ADA FLORENCE STUBBINGS 1871-????, 71950=Married John Dell (b abt. 1905) in the Amersham reg district, Buckinghamshire in Q2 1934., 507481=In 1901 Eliza and John were living in the Duddery, Newmarket St Mary, Cambridgeshire with their children William, John and Lily. John was employed as a stableman, groom. Class: RG13; Piece: 1541; Folio: 121; Page: 31., 27858=In 1967 the family moved into 126 Pine Square, RAF Wattisham, near Ipswich in Suffolk. They lived there for 3 years., 115972=Cecil had died by 1952 and at the time of his death he had been a headmaster at an Elementary School in Ely., 460020=Christened there on 12/03/1871., 162185=In 1901 Maggie was living in the same place with her parents and siblings Dan, Abner, Barnard, Horace, Dolcie and Nina. Maggie was working as a dressmaker. Class: RG13; Piece: 1537; Folio: 23; Page: 10., 519124=In 1901 Charles and Mary Ellen were living in Ling Moor, Beeford with their children Alice, Clara, John, Elsie, Ernest and Mary. Charles was employed as a cattleman on a farm. Class: RG13; Piece: 4517; Folio: 5; Page: 2., 816562=In 1841 George and Mary were living in Wood Ditton with their children Richard, Caroline and Susan. Class: HO107; Piece 65; Book: 7; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 10; Folio: 10; Page: 15; Line: 18; GSU roll: 241222., 882565=In 1861 John was still living in Wood Ditton with his daughter Elizabeth. Also living there as lodger were James Stubbings and his wife Frances who I believe to be his grandson. Class: RG9; Piece: 1031; Folio: 160; Page: 13; GSU roll: 542740., 531411=In 1871 James was living in Wentworth with his family. At home that day were his children John, Mary and William. James was employed as an agricultural labourer. James's sister in law, Emily Clemence was also there that day. Class: RG10; Piece: 1603; Folio: 80; Page: 1; GSU roll: 829814., 693817=Christened there on 17/04/1842., 468617=EMMA LEONARD 1860-????, 274905=GEORGE HERBERT THOMAS 1869-????, 705532=In 1861 John was living in Saxon Street, Wood Ditton with his parents and siblings Betsy, William and Abraham. John was employed as an agricultural labourer. Class: RG9; Piece: 1031; Folio: 172; Page: 37; GSU roll: 542740., 219646=JOHN WHETSTONE 1865-????, 80688=ALBERT H KENNEDY 1911-????, 456956=In 1881 Caroline was living in Knowsley Road, Eccleston in Prescott, Lancashire with her parents and siblings Charlotte, Ellen (Helen), Henry, Robert and Constance. Class: RG11; Piece: 3730; Folio: 94; Page: 51; GSU roll: 1341893., 188692=The marriage was short lived as Thomas died in the St Ives reg district in Q1 1892., 309334=A William Ashman married in Q1 1890 in Hartlepool to either Mary Ann Murray or Mary Elizabeth Sanderson., 600714=In 1901 Noah was living in Ditton Green, Wood Ditton with his children Alice and James. Noah was employed as an agriucultural labourer. Class: RG13; Piece: 1537; Folio: 108; Page: 3., 767574=WILLIAM NUNN abt 1824-abt 1828, 674413=In 1851 Maria was living in Saxon Street, Wood Ditton with her parents and siblings William, Mary Ann, John, Sarah, Alice and James. Class: HO107; Piece: 1762; Folio: 111; Page: 31; GSU roll: 193654., 358207=JAMES SMITH 1887-????, 728490=In 1901 Alfred and Margaret were living at 10 Freckleson Street, Wigan, Lancashire with their children Frederick, Emily, Edith, Nellie, Margaret, Alfred, Charles and Robert. Alfred was employed as an iron merchant's travellor. Class: RG13; Piece: 3558; Folio: 55; Page: 8., 305531=Married Thomas Kennedy in Bransdale cum Farndale, Yorkshire on 25/11/1899. He was a tailor who was a widower with 3 boys. Maybe this marriage started out as a marriage of convenience., 169627=In 1901 Clara was living in Ling Moor, Beeford with her parents and siblings Alice, John, Elsie, Ernest and Mary. Class: RG13; Piece: 4517; Folio: 5; Page: 2., 165802=In 1901 John was living in the Duddery, Newmarket St Mary with his parents and siblings William and Lily. William was employed as a grrom in a stable.. Class: RG13; Piece: 1541; Folio: 121; Page: 31., 371531=In 1891 Mary was living in Carr House, Staindrop, County Durham with her parents and siblings James and Thomas. Class: RG12; Piece: 4079; Folio 116; Page 23; GSU roll: 6099189., 850944=In 1871 Francis and Susan were living in Chapel Place North, St George Hanover Square with their daughter Louisa.There were also a couple of lodgesr living with them, named Daniel Meaman (unemployed domestic servant) and Robert Wilson (master painter). Francis was employed as a waiter. Class: RG10; Piece: 101; Folio: 88; Page: 19; GSU roll: 838762., 693778=In 1851 William was living in Little Ditton with his parents and siblings Mary Ann, John, Matilda, Agnes, Betsey, Abraham, Robert and Charles. Class: HO107; Piece: 1762; Folio: 105; Page: 19; GSU roll: 193654., 459981=In 1871 Frank was living in Own Cottage, Dullingham with his mother, sister Ellen and half sister Emma. His maternal grand parents and great grand mother lived next door. Class: RG10; Piece: 1594; Folio: 56; Page: 11; GSU roll: 829811., 748502=ROBERT JOHN CLEMENTS 16/06/1848-1923, 388709=In 1891 Ada was employed as a general domestic servant at Barforth Hall, Barforth, Yorkshire. This was the home of Braithwaite Gilson (farmer) and his family. Class: RG12; Piece: 4079; Folio 5; Page 3; GSU roll: 6099189., 169844=In 1891 baby Clara was living in Bridlington Road, Beeston with her parents and siblings Ellen, Emma, Arthur, Aaron, Elizabeth and Alice. Class: RG12; Piece: 3953; Folio 19; Page 8; GSU roll: 6099063., 165451=In 1891 Robert was living in Bedlam Square, Burwell, Cambridgeshire with his parents and siblings William, John and Lily. Class: RG12; Piece: 1293; Folio 42; Page 16; GSU roll: 6096403., 851437=In 1861 I cannot find Francis but Susan is listed as head of house at 1 Chapel Place North, St George Hanover Square, Mayfair, London with her daughters Emily, Susan, Louisa and Ellen. Also there were lodgers by the names of Elizabeth Meek (governess), Stephen walker (formerly a butler), Marian Darcus (fund holder) and Nannette Leithead (can't decipher her occupation). Susan was working as a lodging housde keeper Class: RG9; Piece: 45; Folio: 73; Page: 24; GSU roll: 542562., 80581=In 1911 baby Albert was living in Wind Hill with his parents and siblings Percy, Blanche, Phoebe, Ethel and Walter., 728150=FREDERICK CLEMENTS 1852-????, 384291=Married Joseph Clark (b ?) in Q4 1909 in the Teesdale reg district, County Durham., 899851=Possibly married Thomas Paves on 11/10/1787 in Dullingham., 441814=In 1881 baby Edith was living at 202 Ormskirk Road, Pemberton, Lancashire with her parents and siblings Frederick and Emily. Class: RG11; Piece: 3779; Folio: 17; Page: 28; GSU roll: 1341904., 899890=Christened there on 30/09/1752., 358132=In 1891 James was living at 88 Blythe Road, Hammersmith with his parents and siblings William, Arthur, Harry and Eliza. There was also a boarder named Albert Penfold living in the house. Class: RG12; Piece: 39; Folio 55; Page 10; GSU roll: 6095149., 804625=In 1841 Thomas and Betsey (as she was known) were living in Little Ditton, Wood Ditton, Cambridgeshire with their baby son Charles. Class: HO107; Piece 65; Book: 6; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 9; Folio: 7; Page: 10; Line: 23; GSU roll: 241222., 138964=Did Harriet marry in Q2 1903 in the Chesterfield reg district to either Arthur H hearnshaw OR George Watts?, 518696=In 1861 Oliver was living in Cheveley Green, Cheveley with his parents and siblings Thomas, Susan, John, Mary, Charles, Joseph and Emma. Class: RG9; Piece: 1031; Folio: 40; Page: 19; GSU roll: 542740., 371339=In 1901 Mary Ellen was employed as a domestic servant at Telfil House, Marske, Richmond, Yorkshire. This was the home ofChristopher Brown (farmer) and his family. Class: RG13; Piece: 4610; Folio: 40; Page: 4., 445033=Waldo died in the St Helens reg district, Lancashire on 04/02/ 1977., 856258=Did Francis marry Susan Ellis (b abt. 1829 in Elton, Hampshire) in Q3 1851 in St George Hanover Square reg district? I think it may be possible as his sister Mary worked in that area., 437452=Did Charles marry Annie Baldwin in Q2 1915 in the Wigan reg district?, 759282=In 1901 Charles and sophia were still living in King Street, Whittington. They had 2 boarders named Willaim Greatoux (general labourer) and Fred Fuller (general labourer). Charles was also employed as a general labourer. Class: RG13; Piece: 3252; Folio: 92; Page: 57., 548582=In 1851 Susanna was living in Cheveley Green, Cheveley with her parents and siblings Thomas, William, John, Betsy, Mary and baby Charles. Class: HO107; Piece: 1762; Folio: 169; Page: 19; GSU roll: 193654., 705084=Quite possibly died in the Linton reg district in 1851., 609767=In 1871 Phoebe was employed as a cook in The Cedars, Ewell, Surrey. This was the home of Hariet Lempriere (Officer's widow). Her sister, Emily was also working there as a kitchenmaid. Class: RG10; Piece: 799; Folio: 97; Page: 17; GSU roll: 827746., 694198=In 1891 George and Ellen were living in 2 Farringdon Cottages, Exning, Suffolk with children Harry, Elizabeth (Ann) and Herbert. George was employed as an engine driver. Class: RG12; Piece: 1294; Folio 47; Page 34; GSU roll: 6096404., 457037=CAROLINE MARY CLEMENTS 1875-????, 736865=Married Margaret Wallwork (b 1858 in Worley, Lancashire) in Q3 1878 in the Wigan reg district, Lancashire. A strong possibility that she was related to Robert's (Alfred's brother) wife Ellen Wallwork., 270677=In 1901 Harry was living in the School House, Stetchworth with his parents and siblings Thomas, Ellen, Ada, Alfred, Robert and baby Frederick. Harry was employed as a brick layer's apprentice. Class: RG13; Piece: 1537; Folio: 91; Page: 5., 62975=In 1901 Hilda was living in West Fen Drove, Isle of Ely with her parents and sister Mabel. Class: RG13; Piece: 1544; Folio: 37; Page: 8., 518735=Christened there on 03/07/1853., 728074=In 1861 Frederick was living in Wattlesborough Heath, Albesbury, Shropshire with his mother and brothers Robert and Alfred. His father was away working as a butler on census day. Also living there was a servant named Ann Griffiths. Class: RG9; Piece: 1865; Folio: 12; Page: 17; GSU roll: 542879., 452725=In 1891 Sidney was living at 6 Kings Road, Eccleston with his parents and siblings Charlotte, Ellen, Caroline, Henry, Robert, Constance, Winifred, Frederick, Mildred, Arthur and Waldo. Boarding with them was a widow named Agnes Richardson (living on her own means). Class: RG12; Piece: 3017; Folio 30; Page 10; GSU roll: 6098127., 494818=In 1901 Mary Ann and George were living in the same place with their children Dan, Maggie, Abner, Barnard, Horace, Dolcie and Nina. George was still employed as a bricklayer. Class: RG13; Piece: 1537; Folio: 23; Page: 10., 115856=In 1952 Gwendoline had been working as a school teacher., 158012=NINA NETTIE J BARRETT 11/11/1897-1986, 161806=ABNER ARTHUR BARRETT 1880-1922, 120241=LILY STUBBINGS 1885-????, 188601=Clara then married Charles Dewey (b abt. 1869 in Witchford, cambridgeshire) in the Ely reg district in Q1 1894., 613517=In 1871 James and Frances were living in Dillon Road, Cheveley, Cambridgeshire. Livivng with them was James maternal grandfather, John Stubbings. James was employed as an agricultural labourer and his grandfather was still labouring, at 84 yeasrs of age. Class: RG10; Piece: 1595; Folio: 44; Page: 35; GSU roll: 829811., 774496=Married a Martha Shingfield (b 1821 in Hopton, Suffolk) on 20/06/1848 in Dullingham. On the IGI, record submitted after 1991 by a member of the LDS Church., 28012=On 07/07/1965 Eddie got his Long Service and Good Conduct Medal., 227848=In 1881 Mary was living at Broomstick Hall, Cheveley with her widowed mother and siblings Ann, William and James. Lodging there was John Clements (carpenter), brother of her mother. Class: RG11; Piece: 1674; Folio: 40; Page: 22; GSU roll: 1341400., 314975=In 1901 Charels was a boarder at 29 Tenf (?) Terrace, Newmarket All saints, Cambridgeshire. This was the home of JOhn T Barber (stone mason) and his family. Charles was employed as a general labourer. Class: RG13; Piece: 1541; Folio: 132; Page: 14., 142793=In 1901 Frank was living in Blackwell Road, Hucknall under Huthwaite, Notinghamshire with his father, stepmother and brother James. There were also 2 boarders named J and C Edwards (coal miners) living there. Class: RG13; Piece: 3138; Folio: 113; Page: 1., 460102=FRANK WOOLLARD 1871-1871, 552421=In 1841 Thomas was living in Cheveley Green, Cheveley with his parents and siblings Eleanor, Susan and baby William. Class: HO107; Piece 65; Book: 2; Civil Parish: Cheveley; County: Cambridgeshire; Enumeration District: 7; Folio: 9; Page: 12; Line: 3; GSU roll: 241222., 102741=In 1911 Percy (as he was named in this census) was still living in Wind Hill with his parents and siblings Blanche, Phoebe, Ethel, Walter and baby Albert., 309725=In 1871 William was living in Saxon Street with her parents and siblings Margaret and Sarah. Class: RG10; Piece: 1595; Folio: 86; Page: 30; GSU roll: 829811., 120160=Christened in Wood Ditton on 13/02/1887., 115792=In 1964 and then again in 1982 Gwendoline had been living at 43a Hills Lane, Ely. This information was taken from phone books so Gwendoline was probably living in the house all that time., 322772=In 1901 Ellen was employed as a cook at 141 Highbury New Park, Islington, London. This was the home of William Dow (retired upholstery warehouseman) ands his sister. Class: RG13; Piece: 196; Folio: 40; Page: 19., 336805=Married Frances Elizabeth Wilson (b 1878 in Fulham, London) in the Fulham reg district in Q2 1908., 709546=Christened there on 09/04/1854 ., 228095=Christened there on 31/03/1867., 899977=FRANCES CLEMENTS abt.1752-????, 433972=SYLVIA FRANCES CLEMENTS 1886-????, 288075=In 1901 Richard was living with his brother Walter and his family in Offerton village. Richard worked on a farm as an agricultural horseman. Class: RG13; Piece: 4693; Folio: 128; Page: 2., 705170=ABRAHAM STUBBINGS 1834-????, 274615=In 1881 George was living at 6 Engleheart Road, Lewisham with his parents and siblings , Emma, John, Henry and Annie. There was also a lodger named James Jeffers (carman). Class: RG11; Piece: 734; Folio: 152; Page: 45; GSU roll: 1341171., 667058=Christened there on 01/11/1844., 309552=In 1881 William was living with his parents and siblings Sarah, Walter, John and Richard in Hind House, Hartlepool, County Durham. Class: RG11; Piece: 4912; Folio: 4; Page: 6; Line: ; GSU roll: 1342182., 864824=In 1851 Robert and Sarah were living in Rowton Castle, Rowton, Shropshire. Robert was employed as a butler and Sarah as the house keeper. The head of the house was Henry Lyter (Army HQ?) and his wife (daughter of an Earl). Class: HO107; Piece: 1991; Folio: 134; Page: 24; GSU roll: 87392., 667019=In 1851 Sarah was living in Saxon Street, Wood Ditton with her parents and siblings William, Mary Ann, John, Maria, Alice and James. Class: HO107; Piece: 1762; Folio: 111; Page: 31; GSU roll: 193654., 437328=ROBERT CLEMENTS 1894-????, 135020=ELSIE JOYCE JACOBS 1899-????, 507729=In 1891 Eliza and John were living in Bedlam Square, Burwell, Cambridgeshire with their children William, John, Robert and Lily. John was employed as a stableman, groom. Class: RG12; Piece: 1293; Folio 42; Page 16; GSU roll: 6096403., 587160=Married Eliza Jaggard (b abt. 1862 in Stetchworth, Cambridgeshire) in Q1 1882 in the Newmarket reg district., 219296=In 1881 John was living in Wentworth with his parents and siblings Clara, James, Eliza, Jonas and Robert. John was employed as a farm labourer. Class: RG11; Piece: 1683; Folio: 74; Page: 1; GSU roll: 1341402., 173209=In 1901 Emma was employed as a general domestic servant at Moor Grange, Beeford, Driffield. This was the home of John U Brampton (famer) and his family. Class: RG13; Piece: 4517; Folio: 5; Page: 1., 748397=In 1851 Robert and his brother Alfred were visitors at the house of John Roberts <(gardender for H Lyter Esq) and his family. Robert's parents were working nearby for Henry Lyter. Class: HO107; Piece: 1991; Folio: 135; Page: 26; GSU roll: 87392., 531108=In 1881 Betsy and James were living in Wentworth, Cambridgehsire with their children John, Clara, James, Eliza, Jonas and Robert. James was employed as a farm labourer, as was his oldest son. Class: RG11; Piece: 1683; Folio: 74; Page: 1; GSU roll: 1341402., 228056=In 1871 Mary was living in Hills Road, Trumpington, Cambridgeshire with her parents and siblings Clara, Annie and baby William. Class: RG10; Piece: 1584; Folio: 91; Page: 28; GSU roll: 829806., 169933=CLARA CLEMENTS 1891-????, 601031=In 1891 Noah and Eliza were living in Ditton Green, Wood Ditton with their sons George and James. Noah was employed as an agricultural labourer, as was his son George Class: RG12; Piece: 1292; Folio 101; Page 3; GSU roll: 6096402., 689777=William died in Wood Ditton and was buried there on 28/09/1862. MaryWaite87 has William's death in 1875 in Kitling, Cambridgeshire., 767764=Christened there on 04/02/1821., 709506=In 1861 Mary was living in Garden House, ? Park, Newmarket All saints, Cambridgeshire with her father and siblings Martha and John. Also there was her cousin, Mary Stubbings. Class: RG9; Piece: 1031; Folio: 123; Page: 21; GSU roll: 542740., 674615=Fanny died in 1909 in Teesdale reg district., 518842=OLIVER EDWARD CLEMENTS 1853-1927, 592303=In 1881 Emily was employed as a cook in Avenue House, Kingston Road, Ewell. This was the home of John H Bridges (Leiutenant in the Middlesex Yeamanary Cavalry) and his family. Class: RG11; Piece: 762; Folio: 71; Page: 24; GSU roll: 1341179., 441607=In 1891 Edith was living at 186 Manchester Road, Ince in Makerfield, Lancashire with her parents and siblings Frederick, Emily, Nellie, Margaret, Alfred and Charles. Also there was a 15 year old domestic servant named Kate Haskin, who was said to be a daughter, but I think that is wrong. Class: RG12; Piece: 3061; Folio 89; Page 15; GSU roll: 6098171., 728203=Alfred possibly died in Wigan in 1912., 767848=JAMES NUNN 1821-27/05/1840, 864861=I cannot find Robert in 1841., 58438=ANNIE ELIZABETH KIDMAN 1890-???, 816289=In 1851 George and Mary were living in Saxon Street, Wood Ditton with their children Richard, Caroline, Susan, Sarah, James and Jane. There was also a visitor that day by the name of William Cox who was only 2 months old. George was employed as an agricultural labourer, as was his son Richard. Class: HO107; Piece: 1762; Folio: 117; Page: 43; GSU roll: 193654., 138802=FREDERICK NUNN 1882-????, 120112=In 1891 Lily was living in 3 Rosa Cottages, Lisburn Road, Newmarket All Saints with her parents and siblings (half siblings?) Fanny and Alfred. Class: RG12; Piece: 1294; Folio 77; Page 39; GSU roll: 6096404., 62822=Did Hilda marry George W Stimson in Q1 1927 in the North Witchford reg district, Cambridgeshire?, 177606=In 1891 Jonas was a lodger in Chatteris Road, Somersham, Huntingdonshire. The head of the house was THomas Skidman (Kidman), James's brother in law, and husband of his sister Clara. Jonas was employed in field work. Class: RG12; Piece: 1239; Folio 29; Page 24; GSU roll: 6096349., 421982=In 1901 George and Ellen were living at 6 Caroline Place Mews, Paddington, London with their children George, Charles and Nellie . George was employed as a coachman. Class: RG13; Piece: 16; Folio: 63; Page: 24., 548362=In 1861 Susan was living in Cheveley Green, Cheveley with her parents and siblings Thomas, John, Mary, Charles, Oliver, Joseph and Emma. Class: RG9; Piece: 1031; Folio: 40; Page: 19; GSU roll: 542740., 882307=In 1871 John was now living in Dillon Street, Cheveley, Cambridgeshire. This was the home of his grandson James and his wife. John was working as a labourer. Class: RG10; Piece: 1595; Folio: 44; Page: 35; GSU roll: 829811., 349277=In 1881 James was still living in Saxon Street with his maternal grandparents. Also there that day was his cousin John Starling. Class: RG11; Piece: 1675; Folio: 84; Page: 22; GSU roll: 1341401., 354056=EDMOND WALLER 1873-????, 165540=ROBERT CLEMENTS PALMER 1886-1892, 384466=In 1901 Elizabeth was living in GB Cottages, Gainford with her parents and siblings Elizabeth, Thomas and Harry. Class: RG13; Piece: 4655; Folio: 51; Page: 15., 107160=In 1901 baby Amelia was living at 72 Protheroe Road, North West Fulham with her parents and siblings Florence and Alice. Class: RG13; Piece: 55; Folio: 12; Page: 15., 161967=Maggie married in the Newmarket reg district in Q2 1903 to either Augustus Henry Holland OR John Tilbrook., 437254=In 1901 Robert was living at 10 Freckleson Street, Wigan with his parents and siblings Frederick, Emily, Edith, Nellie, Margaret, Alfred and Charles. Class: RG13; Piece: 3558; Folio: 55; Page: 8., 445089=Mable died in Whiston, Lancashire on 26/12/1975., 635699=ADELIZA STUBBINGS 1855-1927????, 452803=SIDNEY CLEMENTS 1881-????, 627036=In 1861 Sarah was still living in Saxon Street with her parents and siblings Sarah, James, Jane and Robert. Class: RG9; Piece: 1031; Folio: 171; Page: 35; GSU roll: 542740., 674676=John died in 1908 Staindrop, Gainford, County Durham., 758460=SUSANNA CLEMENTS 1839-1903, 709699=Francis possibly died in Wood Ditton in 1856., 822534=GEORGE STUBBINGS 1813-1870, 287396=ELIZA ALICE STUBBINGS 1870-????, 850579=In 1881 Francis was possibly lodging at 16 Queens Street, Brompton, Kensington. This was the home of widow Mary A Wenderbank (charwoman). Francis was employed as a writer (clerk). Class: RG11; Piece: 43; Folio: 46; Page: 7; GSU roll: 1341010., 401934=In 1881 John was at the home of his maternal grandparents, James and Mary Stubbings, in Saxon Street, Wood Ditton on census day. Also there that day was his cousin James Stubbings.John was employed as an agricultural labourer. Class: RG11; Piece: 1675; Folio: 84; Page: 22; GSU roll: 1341401., 372182=In 1891 James was living in Carr House, Staindrop, County Durham with his parents and siblings Mary and Thomas. Class: RG12; Piece: 4079; Folio 116; Page 23; GSU roll: 6099189., 466981=In 1871 Ellen was living in Own Cottage, Dullingham with her mother, brother Frank and half sister Emma. Her maternal grand parents and great grand mother lived next door. Class: RG10; Piece: 1594; Folio: 56; Page: 11; GSU roll: 829811., 683659=In 1851 John was living in Saxon Street, Wood Ditton with his parents and siblings William, Mary Ann, Maria, Sarah, Alice and James. Class: HO107; Piece: 1762; Folio: 111; Page: 31; GSU roll: 193654., 531830=All the christening dates were submitted after 1991 by a member of the LDS Churc, so may well have some wrong information., 58349=In 1891 Annie was living in Chatteris Road, Somersham with her parents. Her uncle, Jonas (mother's brother) was lodging with them. Class: RG12; Piece: 1239; Folio 29; Page 24; GSU roll: 6096349., 551662=Married Keziah Crick in Q4 1861 in the Newmarket reg district., 835139=In 1841 Abraham and Matilda were living in Little Ditton, Wood Ditton, Cambridgeshire with their children Mary, John, Matilda, Agnes and Betsey. Abraham was employed as an agricultural labourer. Class: HO107; Piece 65; Book: 6; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 9; Folio: 7; Page: 10; Line: 5; GSU roll: 241222., 494582=Mary died in 1905 in Newmarket, Cambridgeshire., 647523=GEORGE ANTHONY STUBBINGS 1851-1851, 62177=In 1891 Florence was at the home of her maternal grandparents and their children in Main Street, Wentworth. Class: RG12; Piece: 1297; Folio 63; Page 2; GSU roll: 6096407., 115589=Gwendolen died in Ely in 1988., 718336=LOUISA JANE CLEMENTS 1856-????, 37964=On 10/10/1947, Eddie joined the Royal Air Force and spent the next 27 years of his life in it, working as an aircraft fitter propulsion. His service number was originally 1920589 and later an S was added to the beginning of the number. During his time in the RAF Eddie worked on Canberrars, Comets, Lightnings, VC 10s, Belfast and Britannias. I am sure there were more types of aircraft, but these are the ones I remember. He spent time at numerous RAF camps, both on his own and with his family and the ones that I can remember were (in no particular order) Locking, Valley, St Athans, Abingdon, Seleta, Changi (both in Singapore), Watton, Bruggen, Dishforth, Driffield, Leconfield, Loughenham, Scampton, Little Rissington, Wattisham, Binbrook, Gan, Lyneham, Hullavington and Brize Norton. He also did an exchange posting with the RCAAF and spent time in Goose Bay in Canada, some time in Rekyjavic in Iceland and a 'friendly' exchange with the Russians at one point. He also went to Malta for a short while. I wish I had seen fit to ask him a lot more questions about his career while he was still alive., 104061=GEORGE ANTHONY PRICE 1899-????, 311017=Christened in Wood Ditton on 26/08/1866., 815913=In 1861 George and Mary were still living in Saxon Street with their children Sarah, James, Jane and Robert. George was employed as an agricultural labourer, as was his son James. Class: RG9; Piece: 1031; Folio: 171; Page: 35; GSU roll: 542740., 419576=In 1901 William and Mary were living at 28 & 29 Lit(?) Marylebone Street, Marylebone, London. Also there that day was William's sister, Alice (dressmaker). William was employed as a Police Constable. Class: RG13; Piece: 103; Folio: 19; Page: 30., 608924=Phoebe possibly died in the Epsom reg district, Surrey in Q4 1924., 888581=Ellen died in Dullingham in 1872., 647430=Christened there on 31/05/1851., 164221=In 1881 Dan was living in Boro End, Borough Green with his parents and siblings Fanny, Maggie and Arthur. Class: RG11; Piece: 1674; Folio: 6; Page: 6; GSU roll: 1341400., 349067=In 1891 James was still at the home of his widowed grandmother. His aunt, Mary Ann and cousin John Starling were also there. James was employed as an agricultural labourer. Class: RG12; Piece: 1292; Folio 112; Page 26; GSU roll: 6096402., 709639=MARY ELIZABETH STUBBINGS 1854-????, 415196=JAMES SAMSON COLLINS STUBBINGS 1859-1859, 540493=BETSY CLEMENTS 1845-1928, 632277=In 1881 Harry and Emma were living at 33 Brewers Street, St George Hanover Square, London with their daughter Edith. Harry was employed as a porter in an art gallery. Class: RG11; Piece: 101; Folio: 126; Page: 26; GSU roll: 1341023., 762301=In 1851 Charles and Harriet were living with Charles parents in the High Street, Dullingham. Richard was an agricultural labourer. Class: HO107; Piece: 1762; Folio: 58; Page: 18; GSU roll: 193654., 822611=Mary died in 1898 and was buried in Wood Ditton on 19/03/1898., 449613=In 1891 Arthur was living at 6 Kings Road, Eccleston with his parents and siblings Charlotte, Ellen, Caroline, Henry, Robert, Constance, Sidney, Winifred, Frederick, Mildred and Waldo. Boarding with them was a widow named Agnes Richardson (living on her own means). Class: RG12; Piece: 3017; Folio 30; Page 10; GSU roll: 6098127., 133351=MICHAEL C CLEMENTS 1933-????, 322369=GEORGE ANTHONY PRICE 1874-????, 494520=ELIZABETH NUNN 1853-????, 683762=JOHN STUBBINGS 1840-1908, 172844=ARTHUR EDWIN CLEMENTS 1883-????, 705805=In 1851 Johnn was living in Little Ditton with his parents and siblings Mary Ann, Matilda, Agnes, Betsey, William, Abraham, Robert and Charles. John was employed as an agricultural labourer. Class: HO107; Piece: 1762; Folio: 105; Page: 19; GSU roll: 193654., 802867=Betsey died in the Union Workhouse, Newmarket in 1904. She was buried in Wood Ditton on 07/01/1904., 326243=In 1891 Ruby was living at 10 Moylens Road, Fulham, London with her parents and siblings Amelia, William, Mary, Jane, Rose, and baby John. Class: RG12; Piece: 47; Folio 109; Page 47; GSU roll: 6095157., 542958=In 1881 Susan was living in Broomstick Hall, Cheveley, what a lovley name, especially as I am typing this on Halloween!! with her children Mary, Ann, William and James. Lodging there was her brother, John Clements (carpenter). Susan was working as a dressmaker. Class: RG11; Piece: 1674; Folio: 40; Page: 22; GSU roll: 1341400., 467020=Christened there on 21/11/1869., 103976=In 1901 George was living in Market Street, Fordham with his parents and sister Ellen., 317683=In 1891 John was living in Little Ditton, Wood Ditton with his parents and siblings George, Henry, Mary, Sarah, Charles, Thomas, Gertie and baby Grace. John was employed as an agricultural labourer. Class: RG12; Piece: 1292; Folio 105; Page 12; GSU roll: 6096402., 519673=In 1881 Charles and Mary Ellen were living in a cottage in Beeford, Driffield, East Riding of Yorkshire with their children Charles, Ellen and Emma. Charles was employed as a farm labourer. Class: RG11; Piece: 4792; Folio: 74; Page: 3; GSU roll: 1342156., 449693=ARTHUR R CLEMENTS 1888-????, 272099=THOMAS STUBBINGS 1882-????, 505866=Georgina possibly died in the Whittlesey reg district, Cambridgeshire in Q2 1914., 38121=I know in 1948 Eddie, his parents and possibly his sister Audrey were living at 55 Lawson Street, Stillington., 888763=In 1861 Ellen was at the home of her son Reuben and his wife in in Reuben's own cottage in Dullingham. Class: RG10; Piece: 1594; Folio: 56; Page: 11; GSU roll: 829811., 53284=CHARLES WILLIAM NUNN 22/08/1903-1933, 567088=BETSEY STUBBINGS 1840-1876, 467120=ELLEN WOOLLARD 1869-????, 624505=Both James and Rachel possibly died in Bethnal Green in Q3 1899., 159363=In 1891 Effie was living in Boro End, Borough Green with with her parents and siblings Dan, Maggie, Abner, Biddie, Barnard and Horace. Class: RG12; Piece: 1292; Folio 20; Page 11; GSU roll: 6096402., 414986=MATILDA STUBBINGS 07/05/1865-????, 803024=In 1901 Betsey was still living in Little Ditton, this time with her son Charles and his wife. Class: RG13; Piece: 1537; Folio: 112; Page: 12., 107935=In 1901 Florence was living at 72 Protheroe Road, North West Fulham with her parents and siblings Alice and baby Amelia. Class: RG13; Piece: 55; Folio: 12; Page: 15., 709844=Martha died about 1924 in Pinner, Middlesex., 172997=Possibly married Arthur Exton in Q4 1903 in the Driffield reg district, East Ridibng of Yorkshire., 199198=In 1891 Mary and Frederick were living in West Fen, Ely with their 3 week old, yet un named daughter. This was the home of Frederick's widowed father. Also living there, as a roomer, was Mary's brother John Whetstone. Frederick was employed as an agricultural labourer. Class: RG12; Piece: 1297; Folio 36; Page 13; GSU roll: 6096407., 758318=In 1841 Susan was possibly living in Stoney Street, Dullingham with her parents. Class: HO107; Piece 71; Book: 7; Civil Parish: Dullingham; County: Cambridgeshire; Enumeration District: 2; Folio: 5; Page: 5; Line: 6; GSU roll: 241224., 454613=In 1891 Robert was living at 6 Kings Road, Eccleston with his parents and siblings Charlotte, Ellen, Caroline, Henry, Constance, Sidney, Winifred, Frederick, Mildred, Arthur and Waldo. Boarding with them was a widow named Agnes Richardson (living on her own means). Robert was employed as a clerk in a bottle works. Class: RG12; Piece: 3017; Folio 30; Page 10; GSU roll: 6098127., 601257=In 1881 Noah and Eliza were living in Mill Road, Wood Ditton with their children Eliza, George and James. Noah was employed as a miller's carter. Class: RG11; Piece: 1675; Folio: 81; Page: 16; GSU roll: 1341401., 471470=In 1881 Albert and Marian were living in Chatsworth Road, Brampton, Derbyshire with their daughter Harriet. Albert was employed as a coal miner. Class: RG11; Piece: 3437; Folio: 3A; Page: 1; GSU roll: 1341822., 329362=Married William A Menges (under the name Lydia Rose) in the Fulham reg district in Q4 1910. William was born abt 1884, 326320=RUBY LONG 17/07/1888-25/04/1950, 613183=In 1881 James and Frances were living at 5 Ditton Cottages, Wood Ditton. also there that day was Henry Baldwin, Frances's father. Both James and his father in law were employed as farm labourers. Class: RG11; Piece: 1675; Folio: 34; Page: 16; GSU roll: 1341401., 616559=In 1881 John and Jane and their children William, Sarah, Walter, John and Richard had moved from Suffolk up north to County Durham. They were living in Hind House, Hartlepool and John was working as a hind on a farm. Class: RG11; Piece: 4912; Folio: 4; Page: 6; Line: ; GSU roll: 1342182., 628349=Possibly married James Ellard in Q1 1867 in the Westminster reg district, Middlesex., 137508=ELLEN MAY NUNN 1897-????, 593614=In 1871 Elizabeth and John were living in Drift Way, Lewisham, London with their children George and Emma. There was also a lodger named George Thomas (carman). Was he a relative, I wonder? John was employed as a labourer. Class: RG10; Piece: 767; Folio: 71; Page: 45; GSU roll: 824731., 115456=Gladys died in Cambridge in 1984., 440841=In 1891 Nellie was living at 186 Manchester Road, Ince in Makerfield, Lancashire with her parents and siblings Frederick, Emily, Edith, Margaret, Alfred and Charles. Also there was a 15 year old domestic servant named Kate Haskin, who was said to be a daughter, but I think that is wrong. Class: RG12; Piece: 3061; Folio 89; Page 15; GSU roll: 6098171., 803061=I cannot find Betsey in 1891., 494438=Christened there on 08/05/1853., 287258=In 1871 Alice (as she was named in this censu) was living in Stetchworth with her parents. Class: RG10; Piece: 1595; Folio: 62; Page: 16; GSU roll: 829811., 313731=In 1901 Gertrude was living in Little Ditton, Wood Ditton with her parents and siblings John,Henry Thomas, Grace, Bertie and Mabel. Class: RG13; Piece: 1537; Folio: 113; Page: 13., 16200=Sadly, Brenda developed lung cancer and dementia and was nursed by her husband for 5 years. She died of cancer in either 2005 or 2006., 371990=In 1901 James was employed as a carter in Clear lane, Cleatlam, County Durham. This was the home of John Amos (farmer with his own account) and his wife. Class: RG13; Piece: 4655; Folio: 121; Page: 24., 624425=JANE STUBBINGS 1849-????, 636027=In 1901 Susanna and George were still living in Little Ditton with their children John, Henry, Thomas, Gertrude, Grace, Bertie and Mabel. George was still employed as an agricultural labourer, as were his 3 elder sons. Class: RG13; Piece: 1537; Folio: 113; Page: 13., 515822=In 1901 Edward and Rebecca were living in the High Street, Ashley cum Silverly, Cambridgeshire with their son Albert. There was also a lodger named Walter King (butcher's assistant) living there. Edward was still working as a non domestic gardener. Class: RG13; Piece: 1537; Folio: 14; Page: 19., 692299=Married Hannah Simpson (b 1851 in Newmarket, Cambridgeshire) in Q2 1875 in the Newmarket reg district., 159451=EFIE EMMA BARRETT 1887-????, 322546=Did Ellen marry in Q3 1904 in the Hackney reg district, London to either William Stanley T Butterfield OR Carl Adolf Kast?, 657636=In 1861 Alice was living in Saxon Street with with her parents and siblings Mary Ann, John, Alice, James, Susannah, Adeliza and Harry. Class: RG9; Piece: 1031; Folio: 168; Page: 30; GSU roll: 542740., 27307=Eddie's last posting was to RAF Brize Norton in Oxfordshire. Whilst there he had an accident on the airfield during an electricity blackout Who remebers them in the 70s? and was taken to Wroughton RAF hospital on 14/12/1973. He and 2 other men had been walking across the airfield, carrying pieces of the engine of a Britannia. Somebody had been using the underground fuel tanks and had neglected to put the manhole cover on. Consequently Eddie, (walking in the middle ogf the group), disappeared down it. He suffered several broken ribs, a punctured lung, loads of bruised and the rib that punctured his lung also scratched his heart. When he came out of hospital, on 04/01/1974, he spent a month recouperating at home and had to wear a neck brace. The family cat, Snowball became his companion when everyone else was out. The poor cat was quite lost when Eddie went back to work. During his time at Brize, the family lived at 99 Abbey Road, Witney., 876738=In 1851 Eleanor was living in the High Street, Dullingham at the home of her daughter Elizabeth and her family. Eleanor was working as a school mistress. Class: HO107; Piece: 1762; Folio: 61; Page: 25; GSU roll: 193654., 511950=Possibly married John Palmer (b abt. 1848 in London) in Q4 1882 in the Newmarket reg district., 458407=In 1901 Charlotte was living in the bank House, Claughton Street, St Helens, Lancashire with her parents and siblings Ellen, Harry, Robert, Constance, Sidney, Winifred, Frederick, Mildred, Arthur, Waldo and Dorothy. Charlotte was emplyed as a B.A. teacher at a school. Class: RG13; Piece: 3521; Folio: 65; Page: 11., 440933=NELLIE LOUISE CLEMENTS 1882-1911, 857949=In 1881 Thomas was head of a house in Pains Hill, walton on Thames, Surrey. Living in the house with him was Mary Coates (servant). Thomas was still working as a domestic gardener. Class: RG11; Piece: 766; Folio: 22; Page: 10; GSU roll: 1341180., 402129=In 1871 John was living in Ashley, Cambridgeshire with his mother, step father, sister Kate and half sister Alice. Class: RG10; Piece: 1599; Folio: 88; Page: 3; GSU roll: 829813., 709785=FRANCIS STUBBINGS 1853-1856, 58139=In 1901 Annie was living in Honey Hill, Wimblington, Cambridgeshire with her mother, stepfather, brother James and half sisters Agnes, Elsie and Maggie. Class: RG13; Piece: 1550; Folio: 24; Page: 2., 108013=FLORENCE AGNES M CRAIG 1898-????, 164311=DAN WILLIAM BARRETT 1874-1935, 494399=In 1861 Elizabeth was living in Stoney Street, Dullingham with her parents and siblings Mary Ann, James, Frederick and Albert. Also living with them was her paternal grandmother. Class: RG9; Piece: 1031; Folio: 47; Page: 2; GSU roll: 542740., 608842=GEORGE STUBBINGS 1843-1851, 758357=Christened there on 27/05/1839., 287306=Christened in Stetchworth on 15/05/1870., 787563=Matilda died in 1865 in Saxon Street, Wood Ditton. She was buried in Wood Ditton on 19/03/1865., 415094=Christened there on 17/08/1859., 163786=In 1901 Dan was living in the same place with his parents and siblings Maggie, Abner, Barnard, Horace, Dolcie and Nina. Dan was working as a bricklayer's labourer. Class: RG13; Piece: 1537; Folio: 23; Page: 10., 272014=In 1891 Thomas was living in the High Street, Stetchworth with his parents and siblings Agnes, Harry and Ellen. Class: RG12; Piece: 1292; Folio 86; Page 5; GSU roll: 6096402., 61991=In 1901 Florence was living in West Fen Drove, Isle of Ely with her mother, stepfather and half sisters Ruth, Ethel, Edith and Ada. Also living there was her paternal grandfather, William Kidman. Her mother's brother Oliver was also in the house on census day. Class: RG13; Piece: 1544; Folio: 37; Page: 8., 267741=GEORGE ROBERT KNOWLES 1875-1959, 337082=In 1901 William was living at 72 Protheroe Road, North West Fulham with his parents and siblings Mary, Ruby and John. His half sister, Agnes lived elsewhere in the same house with her family. William was out of work. Class: RG13; Piece: 55; Folio: 12; Page: 16., 137587=I believe Jane died in the Chesterfield reg district in Q4 1904., 402168=Christened there on 15/11/1862., 141870=DORIS NUNN 1901-????, 115543=GLADYS ALEXANDRA ALEY 10/09/1902-1894, 628257=In 1881 Susan and James were living in Park Street, Chatteris, Cambridgeshire. Susan's niece, Phoebe Ashman (daughter of her sister Jane) was also living with them. RG11; Piece: 1688; Folio: 101; Page: 10; GSU roll: 1341403., 459588=Christened there on 28/03/1872., 163387=Esther died in the Cambridge reg district in Q2 1939., 748984=EMMA MARY CLEMENTS 1842-????, 551916=In 1861 Thomas was living in Cheveley Green, Cheveley with his parents and siblings , Susan, John, Mary, Charles, Oliver, Joseph and Emma. Thomas was employed as a carpenter. Class: RG9; Piece: 1031; Folio: 40; Page: 19; GSU roll: 542740., 636338=In 1891 Susanna and George were still living in Little Ditton with their children George, John, Henry, Mary, Sarah, Charles, Thomas, Gertie and baby Grace. George was employed as an agricultural labourer, as were his 3 elder sons. Class: RG12; Piece: 1292; Folio 105; Page 12; GSU roll: 6096402., 177004=In 1881 baby Robert (1 week old) was living in Wentworth with his parents and siblings John, Clara, James, Eliza and Jonas. Class: RG11; Piece: 1683; Folio: 74; Page: 1; GSU roll: 1341402., 762090=In 1861 Charles and Harriet were living in Stoney Street, Dullingham with their children Mary Ann, Elizabeth, James, Frederick and Albert. Also living with them was Charles's mother. Class: RG9; Piece: 1031; Folio: 47; Page: 2; GSU roll: 542740., 356527=In 1871 Amy was living at 5 Moray(?) Road, Islington, with her parents and siblings Arthur and Alice. Also living there was a servant by the name of Sarah Barber (personal domestic servant). Class: RG10; Piece: 299; Folio: 28; Page: 50; GSU roll: 824927., 414874=Christened there on 05/06/1865., 454218=In 1901 Robert was living in the bank House, Claughton Street, St Helens, Lancashire with his parents and siblings Charlotte, Ellen, Harry, Constance, Sidney, Winifred, Frederick, Mildred, Arthur, Waldo and Dorothy. Robert was employed as a commercial clerk. Class: RG13; Piece: 3521; Folio: 65; Page: 11., 896080=Christened there on 13/01/1782., 803139=Thomas died in Wood Ditton in 1890 and was buried there on 13/04/1890., 104288=ELLEN ELIZABETH PRICE 1897-????, 647280=SUSANNAH STUBBINGS 1852-????, 16051=JOHN COLIN SMITHSON 17/10/1945-????, 267274=Married Ellen Ann Carter (b 04/02/1871 at 2 Hyde Park Square Mews, Paddington, London) on 14/03/1896 in the Registry Office in St George Hanover Square, London. At the timer of his marriage, George had been living at 27 Ennismore Mews, Ennismore Gardens and Ellen at the same address as she was born., 815654=Mary died in Saxon Street in 1866 and was buried there on 28/01/1866.., 81042=Oswald died in Stillington, County Durham in approx 1976., 22532=KATHIE D SMITHSON 1934-1934ish, 718603=In 1881 Susan was employed as a cook at 25 Eaton Place, St George, Belgrave, London. This was the home of Baron Edmund Hammond and his family. Class: RG11; Piece: 99; Folio: 8; Page: 10; GSU roll: 1341022., 624323=Christened there on 01/07/1849., 115330=Gladys died in Cambridge in 1984., 692649=In 1871 Abraham was livign with his father in Black Barn Lane, Newmarket St Mary. Also there that day was Abraham's sister Betsey and her family, along with a niece, Matilda (Betsey's illigitimate daughter) and Arthur (parent unkown). Abraham was employed as a labourer Class: RG10; Piece: 1596; Folio: 46; Page: 19; GSU roll: 829811., 441238=In 1901 Edith was living at 10 Freckleson Street, Wigan with her parents and siblings Frederick, Emily, Nellie, Margaret, Alfred, Charles and Robert. Edith was employed as a stationer's assistant. Class: RG13; Piece: 3558; Folio: 55; Page: 8., 709991=George died in the Hare and Hounds Public House of Chronic Nephritis Uraemia on 06/02/1906., 322049=In 1891 George was living in Little Ditton, Wood Ditton with his parents and siblings John, Henry, Mary, Sarah, Charles, Thomas, Gertie and baby Grace. George was employed as an agricultural labourer. Class: RG12; Piece: 1292; Folio 105; Page 12; GSU roll: 6096402., 888426=Christened there on 02/03/1783., 137433=In 1901 Ellen was living in Littlemoor, Newbold and Dunston, Derbyshire with her parents and siblings Harriet, Frederick, Oliver and Jane. Class: RG13; Piece: 3250; Folio: 96; Page: 4., 168283=In 1901 Mary was living in Ling Moor, Beeford with her parents and siblings Alice, Clara, John, Elsie and Ernest. Class: RG13; Piece: 4517; Folio: 5; Page: 2., 609276=In 1891 Phoebe was still working as a cook at Houghton Hall. Class: RG12; Piece: 1270; Folio 17; Page 28; GSU roll: 6096380., 356596=AMY WALLER 1867-????, 632030=In 1891 Harry and Emma were living at 15 Upper Baker Street, St Marylebone, London. Harry was employed as a cabinet maker and dealer in works of art. Class: RG12; Piece: 101; Folio 80; Page 33; GSU roll: 6095211., 749040=William died in Dullingham on 29/11/1915., 896007=Married Ellen Edwards (b abt 1785 in Cambridgeshire) on 07/08/1806 in Dullingham, Cambridgeshire., 81135=Ethel died in Sedgefield General Hospital, Sedgefield, County Durham on 9th May 1973., 163445=Dan died in Q3 1935 in the Cambridge reg district., 104202=In 1901 Ellen was living in Market Street, Fordham with her parents and brother George., 391534=In 1901 Kate and Arthur were still living in Saxon Street with their children Percy, Arthur, Sarah, Margaret, Albert and Ruby. Also there that day was Kate's brother John Edward Starling. Arthur was employed as a general farm labourer. Class: RG13; Piece: 1537; Folio: 116; Page: 20., 647173=Christened there on 25/03/1852., 159576=Married Gertrude A Scutcheon in Q1 1911 in the Newmarket reg district., 459549=Reuben died in Dullingham in Q3 1872. ., 822392=Married Mary Ann Fryar Forman (b 1816 in Chevely, Cambridgeshire) on 06/05/1833 in Chevley, Cambridgeshire., 115415=Possibly married Herbert J H Martin in Q3 1933 in the Newmarket reg district., 506354=In 1861 Georgina was living in Stoney Street, Dullingham with her parents and siblings Eliza, Maryann and Eleanor. Class: RG9; Piece: 1031; Folio: 48; Page: 4; GSU roll: 542740., 313405=GRACE PRICE 1890-????, 107635=In 1901 Alice was living at 72 Protheroe Road, North West Fulham with her parents and siblings Florence and baby Amelia. Class: RG13; Piece: 55; Folio: 12; Page: 15., 624284=In 1851 Jane was living in Saxon Street, Wood Ditton with her parents and siblings Richard, Caroline, Susan, Sarah and James. There was also a visitor that day by the name of William Cox who was only 2 months old. Class: HO107; Piece: 1762; Folio: 117; Page: 43; GSU roll: 193654., 888387=Married John Stubbings (b abt. 1787 in Dullingham) in Dullingham on 14/01/1808., 133594=John died in Whiston on 22/04/1986., 111967=In 1901 Ruby was living in Saxon Street with her parents and siblings Percy, Arthur, Sarah, Margaret and Albert. Class: RG13; Piece: 1537; Folio: 116; Page: 20., 352753=Possibly married in Q2 1907 in the Islington reg district to either Arthur Edward Lewis OR Francis Luck., 571164=In 1881 was living in Garden Cottage, Newmarket All Saints with his father and stepmother John was employed as a non domestic groom., 352515=In 1881 Alida was a visitor at 22 Sigdon Road, Hackney, London. This was the home of Marie Powell and her daughters (one of whom shared the name Alida). I am trying to find a link to thisd family as why else would a 4 year old be visiting on her own? Class: RG11; Piece: 297; Folio: 93; Page: 26; GSU roll: 1341064., 519404=In 1891 Charles and Mary Ellen were living in Bridlington Road, Beeford with their children Ellen, Arthur, Emma, Aaron, Elizabeth, Alice and baby Clara. Charles was employed as an agricultural labourer. Class: RG12; Piece: 3953; Folio 19; Page 8; GSU roll: 6099063., 137233=Did Ellen marry Richard Bunting in Q4 1933 in the Belper reg district, Derbyshire?, 402334=JOHN EDWARD STARLING STUBBINGS 1862-????, 647391=George did not live too long and died the same year. He was buried in Wood Ditton on 07/06/1851., 822431=Christened there on 28/11/1813., 531700=In 1871 Betsy was a visitor in Saxon Street, Wood Ditton, along with her daughter Clara. This was the home of Thomas (carpenter) and Harriet Clements (Trying to tie up the family but not suceeded yet) Class: RG10; Piece: 1595; Folio: 88; Page: 34; GSU roll: 829811., 172748=In 1891 Arthur was living in Bridlington Road, Beeston with his parents and siblings Ellen, Emma, Aaron, Elizabeth, Alice and baby Clara. Class: RG12; Piece: 3953; Folio 19; Page 8; GSU roll: 6099063., 348767=AGNES ADA GODARD 1870-1937, 228502=In 1901 Clara and Lewis were living at 23 Bramford Lane, Ipswich. Lewis was employed as a printer and compositor. Class: RG13; Piece: 1774; Folio: 146; Page: 19., 112055=RUBY VIOLET HOWE 1889-????+++, 459730=Frank died in Dullingham in Q2 1871., 616775=In 1871 John and Jane were living in Saxon Street with their children Margaret, William and Sarah. John was still working in the fields. Class: RG10; Piece: 1595; Folio: 86; Page: 30; GSU roll: 829811., 657852=In 1851 Alice was living in Saxon Street, Wood Ditton with her parents and siblings William, Mary Ann, John, Maria, Sarah and James. Class: HO107; Piece: 1762; Folio: 111; Page: 31; GSU roll: 193654., 326554=Albert died in Pinks Hill, swanley, Kent on 29/02/1980., 612907=James possibly died in Wood Ditton in Q2 1893., 317895=In 1881 John was living in Little Ditton, Wood Ditton with his parents and siblings Eliza, William, Ellen, George, Henry and Mary. Class: RG11; Piece: 1675; Folio: 79; Page: 11; GSU roll: 1341401., 107708=ALICE ELIZA CRAIG 1899-????, 168377=MARY ANNIE CLEMENTS 1901-????, 329609=In 1901 Lydia was employed as a general domestic servant at 61 Fulham Park Gardens, Fulham South, London. This was the home of Harry Facon (artist master in secondary scool) and his family Class: RG13; Piece: 66; Folio: 76; Page: 7., 57925=Did Annie marry John T Mann in Q1 1920 in the Newmarket reg district or was it Tom S Nottage in Q1 1928 in the Chesterton reg district, Cambridgeshire?, 506161=In 1871 Georgina was living in the Estate Cottage,Dullingham with her parents and sister Elizabeth. Class: RG10; Piece: 1594; Folio: 56; Page: 11; GSU roll: 829811., 419702=Married Mary Jane Edwards (b abt 1875 in Witney, Worcestershire) in Q1 1901 in the Marylebone reg district, Middlesex., 683829=Mary Ann quite possibly died in Wood Ditton in 1895., 657891=Christened there on 25/04/1847., 516092=In 1891 Edward and Rebecca were living in Coach Lane, Little Green, Cheveley with their son Albert. Also living there was lodger Charles Hurst (bricklayer). Edward was employed as a gardener. Class: RG12; Piece: 1292; Folio 40; Page 8; GSU roll: 6096402., 326600=Rose died in Herne Hill on 07/07/1970., 177087=ROBERT WHETSTONE 1881-????, 666509=Married William Waller (b 1842 in Hackney, Middlesex) in Q1 1865 in the St George Hanover Square reg district, London., 609137=In 1901 Phoebe was still working as a cook at Houghton Hall. It must have been a good place to work, going on the number of years Phoebe stayed there. Class: RG13; Piece: 1513; Folio: 16; Page: 23.., 857689=In 1891 Thomas was a boarder in Street Chobham, Surrey. This was the home of Albert Gower (carpenter and joiner) and his wife. Thomas was living of his own earnings. Class: RG12; Piece: 549; Folio 43; Page 5; GSU roll: 6095659., 601553=In 1871 Noah and Eliza were living in Stetchworth with their daughter Alice. Noah was employed as an agricultural labourer. A George and Elizabeth Murkin and their son John lived next door. Were they Eliza's family? Class: RG10; Piece: 1595; Folio: 62; Page: 16; GSU roll: 829811., 718820=In 1871 Susan was possibly emplyed as an under housemaid at 34 Onslow Green, This was the home of Joseph Borhins (sculptor) and his family. Class: RG10; Piece: 52; Folio: 18; Page: 28; GSU roll: 824571., 748898=Christened there on 29/05/1842., 471245=In 1891 Albert and Marian were living at 32 East Street, Grassmore, Hasland, Derbyshire with their children Harriet and Frederick. Albert was employed as a coal miner. Class: RG12; Piece: 2763; Folio 153; Page 63; GSU roll: 6097873., 459679=REUBEN WILLIAM WOOLLARD 1872-1872, 877010=In 1841 Eleanor was living in Stetchworth with her son Charles. She was living on independent means. Class: HO107; Piece 71; Book: 8; Civil Parish: Stetchworth; County: Cambridgeshire; Enumeration District: 6; Folio: 4; Page: 3; Line: 14; GSU roll: 241224., 352594=ALIDO FRANCES WALLER 1876-????, 337299=In 1891 William was living at 10 Moylens Road, Fulham, London with his parents and siblings Amelia, Mary, Jane, Rose, Ruby and baby John. Class: RG12; Piece: 47; Folio 109; Page 47; GSU roll: 6095157., 540354=In 1851 Betsy was living in Cheveley Green, Cheveley with her parents and siblings Thomas, Susanna, John, William, Mary and baby Charles. Class: HO107; Piece: 1762; Folio: 169; Page: 19; GSU roll: 193654., 543059=James died in Cheveley on 18/11/1873 Death details from the Ancestry tree of Debras3., 163560=Very possibly married in the Chesterton reg district in Q4 1909 to Esther Lavinia S Stretten (b abt. 1879)., 62267=FLORENCE MARY WHETSTONE 1888-????, 80970=WALTER ASHMAN KENNEDY 1908-????, 164035=In 1891 Dan was living in the same place with with his parents and siblings Maggie, Abner, Biddie, Barnard, Effie and Horace. Dan was working as a bricklayer's labourer. Class: RG12; Piece: 1292; Folio 20; Page 11; GSU roll: 6096402., 322261=In 1881 George was living in Little Ditton, Wood Ditton with his parents and siblings Eliza, William, Ellen, John, Henry and Mary. Class: RG11; Piece: 1675; Folio: 79; Page: 11; GSU roll: 1341401., 787834=In 1861 Matilda and Abrahama were living in Saxon Street, Wood Ditton with their children John, Betsy, William and Abraham. Abraham was employed as an agricultural labourer, as were his sons. Class: RG9; Piece: 1031; Folio: 172; Page: 37; GSU roll: 542740., 675086=In 1901 John and Fanny were living in GB Cottages, Gainford, County Durham with their children Elizabeth, Thomas and Harry. There was also a granddaughter there by the name of Hannah Stubbings (parent yet to be discovered but I believe she may have been Elizabeth's daughter). John was employed as a hind and his son Thomas was a general farm hand. Class: RG13; Piece: 4655; Folio: 51; Page: 15., 450019=In 1901 Mildred was living in the bank House, Claughton Street, St Helens, Lancashire with her parents and siblings Charlotte, Ellen, Harry, Robert, Constance, Sidney, Winifred, Frederick, Arthur, Waldo and Dorothy. Class: RG13; Piece: 3521; Folio: 65; Page: 11., 311090=MARY ANN STUBBINGS1866-????, 540393=Christened there on 16/03/1845., 888533=FRANCES CLEMENTS abt 1783-1850, 494142=Possibly died in Cambridge between 1853 and 1855., 727764=In 1871 Frederick was a lodger at 2 Albert Street, St Mary, Shrewsbury, Shropshire. This was the home of Joseph Powell (gardener) and his wife. Frederick was employed as a stationer. Class: RG10; Piece: 2770; Folio: 29; Page: 20; GSU roll: 835402., 371774=Married Margaret Hannah Robinson in Q2 1905 in the Teesdale reg district, County Durham., 896191=REUBEN CLEMENTS abt 1782-abt 1842, 414835=In 1871 Matilda was living in Black Barn Lane, Newmarket St Marys, Cambridgeshire with her maternal grandfather, uncle Abraham, parents and half siblings Betsey and Harry Class: RG10; Piece: 1596; Folio: 46; Page: 19; GSU roll: 829811., 757915=Married William Leonard (b 1833 in Stetchworth, Cambridgeshire) in 1859 in the St George, Hanover Square reg district, London. Were the couple working in that area when they met?, 357260=ARTHUR W V WALLER 1866-????, 61669=There is a marriage for a Florence M Whetstone to Charles R J Hodson in Q4 1933 in the Stoke Newington reg district, London. Could this be right, it would make Florence about 45 years old? Too lod for a first marriage?, 337529=In 1881 William was living at 5 Swan Passages,St George Hanover Square, London with his parents, half sister Agnes and siblings Amelia and baby Mary. Class: RG11; Piece: 94; Folio: 78; Page: 14; GSU roll: 1341021., 176202=In 1901 Oliver was at the home of his sister Mary and her family in West Fen Drove, Ely. Oliver was employed as an agricultural abourer. Class: RG13; Piece: 1544; Folio: 37; Page: 8., 286851=In 1901 Alice was living in Ditton Green, Wood Ditton with her widowed father and brother James. Class: RG13; Piece: 1537; Folio: 108; Page: 3., 133781=Married Muriel Elizabeth Hill (b 10/04/1920 in Peterborough, Cambridgeshire)., 494078=JAMES NUNN 15/07/1855-1923, 271431=In 1891 Agnes was living in the High Street, Stetchworth with her parents and siblings Thomas, Harry and Ellen. Class: RG12; Piece: 1292; Folio 86; Page 5; GSU roll: 6096402., 440472=In 1901 Nellie was living at 10 Freckleson Street, Wigan with her parents and siblings Frederick, Emily, Edith, Margaret, Alfred, Charles and Robert. Class: RG13; Piece: 3558; Folio: 55; Page: 8., 608394=George possibly died in Wood Ditton not long after the 1851 census., 372718=Elizabeth died in Aukland, County Durham in 1911., 310504=Born in Exning Suffolk, according to the 1871 census., 138174=In 1901 Oliver was living in Littlemoor, Newbold and Dunston, Derbyshire with his parents and siblings Harriet, Frederick, Jane and Ellen. Class: RG13; Piece: 3250; Folio: 96; Page: 4., 872831=In 1841 Ann and Richard were living in Stoney Street, Dullingham with their son Charles. Richard was an agricultural labourer. Class: HO107; Piece 71; Book: 7; Civil Parish: Dullingham; County: Cambridgeshire; Enumeration District: 2; Folio: 9; Page: 12; Line: 17; GSU roll: 241224., 348665=In 1871 Agnes was living with her mother and half brother James in Saxon Street, Wood Ditton. This was the home of her maternal grandparents and he shared the home with his uncle Harry. Also there that day was her cousin Ellen Smith. Class: RG10; Piece: 1595; Folio: 85; Page: 28; GSU roll: 829811., 506557=Mary Ann possibly died in the Newmarket reg district in Q4 1883., 636596=In 1881 Susanna and George were living in Little Ditton with their children Eliza, William, Ellen, George, John, Henry and Mary. George was employed as an agricultural labourer. Class: RG11; Piece: 1675; Folio: 79; Page: 11; GSU roll: 1341401., 8163=ERIC REGINALD SMITHSON 1935-????, 436622=BERTHA MARY CLEMENTS 1880-????, 795877=MATILDA CLEMENTS 1810-1865, 877071=John died in Dullingham in 1837 and was buried there., 593011=Elizabeth possibly died in Lewisham in Q2 1881., 788126=In 1851 Matilda and Abraham were still living in Little Ditton with their children Mary Ann, John, Matilda, Agnes, Betsey, William, Abraham, Robert and Charles. Abraham was employed as an agricultural labourer. Class: HO107; Piece: 1762; Folio: 105; Page: 19; GSU roll: 193654., 692886=In 1861 Abraham was living in Saxon Street, Wood Ditton with his parents and siblings John, Betsy, William. Abraham was employed as an agricultural labourer. Class: RG9; Piece: 1031; Folio: 172; Page: 37; GSU roll: 542740., 286898=I cannot find Eliza (or Alice) in 1891., 325638=In 1891 John was living at 10 Moylens Road, Fulham, London with his parents and siblings Amelia, William, Mary, Jane, Rose and Rub. Class: RG12; Piece: 47; Folio 109; Page 47; GSU roll: 6095157., 815367=Christened there on 05/05/1816., 317981=JOHN EDWARD PRICE 1876-????, 842399=ABRAHAM STUBBINGS 1806-1885, 612853=Frances possibly died in Wood Ditton in Q4 1901, 658001=ALICE FRANCES STUBBINGS 1847-1912, 592909=EMILY STUBBINGS 1851-????, 372661=John then married Hannah Tyass (b 1881 in St Andrew's, Aukland, County Durham) in 1912 in Aukland., 8073=Married Yvonne Wilson in Q4 1969 in the Durham South Eastern reg district., 815472=ELIZABETH STUBBINGS 1816-1865, 458797=In 1891 Charlotte was living at 6 Kings Road, Eccleston with her parents and siblings Ellen, Caroline, Henry, Robert, Constance, Sidney, Winifred, Frederick, Mildred, Arthur and Waldo. Boarding with them was a widow named Agnes Richardson (living on her own means). Charlotte was employed as a daily governess. Class: RG12; Piece: 3017; Folio 30; Page 10; GSU roll: 6098127., 391787=In 1891 Kate and Arthur were living in Saxon Street, Wood Ditton with Kate's daughter Agnes and their sons Percy and Arthur. Arthur was employed as an agricultural labourer. Class: RG12; Piece: 1292; Folio 111; Page 24; GSU roll: 6096402., 73109=NELLIE EMILY KNOWLES 1899-????, 415707=Married Harry Mitchell (b abt. 1880 in Buckinghamshire) in Amersham, Buckinghamshire in 1908., 493976=Christened there on 19/09/1855., 133878=JOHN COUGHTREY CLEMENTS 06/03/1923-22/04/1986, 198849=In 1901 Mary and Frederick were living in West Fen Drove, Isle of Ely with their children Florence, Ruth, Ethel, Edith and Ada. Also living there was Frederick's father, William Kidman (agricultural labourer) . Mary's brother Oliver was also in the house on census day. Frederick was employed as a horsekeeper on a farm. Class: RG13; Piece: 1544; Folio: 37; Page: 8., 15828=John then moved to Leeds (around 1985 I think he said) and he set up his own business with a couple of friends, providing scaffolding., 325709=JOHN LONG 1891-16/04/1917, 163185=In 1881 Fanny was living in Boro End, Borough Green with her parents and siblings Dan, Maggie and Arthur. Class: RG11; Piece: 1674; Folio: 6; Page: 6; GSU roll: 1341400., 710160=In 1901 Martha and George were living in The Hare and Hounds, Union Street, Amersham, Buckinghamshire with their son Charles. George was the licencee of the pub., 803344=In 1881 Thomas and Betsey were still living in Ditton Green with their son Thomas. Thomas was still an agricultural labourer. Class: RG11; Piece: 1675; Folio: 77; Page: 7; GSU roll: 1341401., 432783=Hilda died in the Worthing reg district in 1970., 158789=In 1891 Horace was living in Boro End, Borough Green with with his parents and siblings Dan, Maggie, Abner, Biddie, Barnard and Effie. Class: RG12; Piece: 1292; Folio 20; Page 11; GSU roll: 6096402., 172531=In 1901 Arthur was employed as a horseman on a farm at eastburn Farm, Eastburn, Yorkshire. This was the home of Leonard Caley (hind on farm and foreman) and his family. Class: RG13; Piece: 4520; Folio: 55; Page: 10., 112278=In 1901 Albert was living in Saxon Street with his parents and siblings Percy, Arthur, Sarah, Margaret and Ruby. Class: RG13; Piece: 1537; Folio: 116; Page: 20., 493937=In 1861 James was living in Stoney Street, Dullingham with his parents and siblings Mary Ann, Elizabeth, Frederick and Albert. Also living with them was her paternal grandmother. Class: RG9; Piece: 1031; Folio: 47; Page: 2; GSU roll: 542740., 467605=Christened there on 18/09/1864., 314352=In 1901 Thomas was living in Little Ditton, Wood Ditton with his parents and siblings John, Henry, Gertrude, Grace, Bertie and Mabel. Thomas was still employed as an agricultural labourer. Class: RG13; Piece: 1537; Folio: 113; Page: 13., 158883=HORACE REGINALD BARRETT 1889-????, 795735=Married Abraham Stubbings (b 1806 in Dullingham, Cambridgeshire) on 03/02/1831 in Dullingham. Abraham was a cousin and son of her father's sister, Frances. The witnesses at their wedding were John Stubbings and Mary Ann Clements., 775364=In 1851 Elizabeth and Thomas were living in the High Street, Dullingham with their children Georgina and William. Also living with them was Elizabeth's widowed mother. Thomas was employed as a Coachman for A W Pigott Esquire. Class: HO107; Piece: 1762; Folio: 61; Page: 25; GSU roll: 193654., 398310=Married Arthur Howe ( b abt. 1865 in Wood Ditton )in Wood Ditton on 04/06/1887. Both parties in the marriage were aged 22 and the witnesses were Harry Mason and Eliza Howe. Arthur was a labourer., 337646=WILLIAM JAMES LONG 02/03/1877-1940, 857400=MARY CLEMENTS 1821-????, 749084=Susannah died in Dullingham in 1903., 133640=Muriel died in Waterloo on 28/03/1970., 352789=I cannot find Ethel in 1901., 834774=In 1851 Abraham and Matilda were still living in Little Ditton with their children Mary Ann, John, Matilda, Agnes, Betsey, William, Abraham, Robert and Charles. Abraham was employed as an agricultural labourer. Class: HO107; Piece: 1762; Folio: 105; Page: 19; GSU roll: 193654., 627802=In 1901 Susan was still living in the same house. She is listed as married and also as the head of the house. Susan was working as a house keeper. Also living there were 3 boarders and her niece, although her niece may just have been visiting that day as she was by then married. Class: RG13; Piece: 1548; Folio: 50; Page: 5., 57719=JAMES WILLIAM KIDMAN 1891-???, 168599=In 1901 Ernest was living in Ling Moor, Beeford with his parents and siblings Alice, Clara, John, Elsie and Mary. Class: RG13; Piece: 4517; Folio: 5; Page: 2., 506393=Christened there on 26/11/1854., 706532=In 1861 I have a strong suspicion that Mary Ann was at the home of her uncle Robert Stubbings and his family at Garden House, ? Park, Newmarket All Saints. Mary was emplyed as a house keeper. Class: RG9; Piece: 1031; Folio: 123; Page: 21; GSU roll: 542740., 182114=Married Alice Maud Sawyer in Q1 1899 in the Ely reg district., 658082=Sarah possibly died in the Islington reg district, London in 1896., 608312=JAMES STUBBINGS 1844-????, 623988=In 1861 Jane was still living in Saxon Street with her parents and siblings Sarah, James and Robert. Class: RG9; Piece: 1031; Folio: 171; Page: 35; GSU roll: 542740., 457956=In 1881 Ellen (Helen) was living in Knowsley Road, Eccleston in Prescott, Lancashire with her parents and siblings Charlotte, Caroline, Henry, Robert and Constance. Class: RG11; Piece: 3730; Folio: 94; Page: 51; GSU roll: 1341893., 73029=In 1901 Nellie was living at 6 Caroline Place Mews, Paddington with her parents and siblings George and Charles. Class: RG13; Piece: 16; Folio: 63; Page: 24., 515252=In 1861 Joseph was living in Cheveley Green, Cheveley with his parents and siblings Thomas, Susan, John, Mary, Charles, Oliver and Emma. Class: RG9; Piece: 1031; Folio: 40; Page: 19; GSU roll: 542740., 372555=John died in the Seedgefield reg district, County Durham in 1925.., 795774=Christened there on 05/08/1810., 823196=In 1881 James and Mary were still living in Saxon Street. Also there that day were their grandsons James (was he living with them?) and John E Starling. James was listed as an ex agricultural labourer. Class: RG11; Piece: 1675; Folio: 84; Page: 22; GSU roll: 1341401., 325773=Ruby died in South Lambert, London on 25/04/1950., 357184=In 1871 Arthur was living at 5 Moray(?) Road, Islington, with his parents and siblings Amy and Alice. Also living there was a servant by the name of Sarah Barber (personal domestic servant). Class: RG10; Piece: 299; Folio: 28; Page: 50; GSU roll: 824927., 506478=GEORGINA CLEMENTS 1854-1914, 648111=In 1861 James was living in Saxon Street with with his parents and siblings Mary Ann, John, Alice, Susannah, Adeliza and Harry. Class: RG9; Piece: 1031; Folio: 168; Page: 30; GSU roll: 542740., 842256=Married Matilda Clements (b 1810 in Dullingham, Cambridgeshire) om 03/02/1831 in Dullingham. Matilda was a cousin and daughter of his mother's brother John. The witnesses at their wedding were John Stubbings and Mary Ann Clements., 540134=Married James Whetstone (b abt 1846 in Wentworth, cambridgehsire)in Q3 1865 in the Ely reg district, cambridgeshire, quite likely in Wentworth., 163279=FANNY ELIZABETH BARRETT 1876-1899, 418872=In 1891 Clement was living in the Red Lion Publice House, waters End, Hemel Hempstead, Hertfordshire with his parents and siblings Charles, William and Alice. Class: RG12; Piece: 1124; Folio 88; Page 12; GSU roll: 6096234., 118895=In 1901 Rose was living at 76 St Philips Road, Exning, Suffolk with her parents and siblings Rose, Alfred, Bertie, Frank and Cecil. Class: RG13; Piece: 1541; Folio: 65; Page: 54., 515291=Christened there on 21/12/1856., 675338=In 1891 John and Fanny were living in Carr House, Staindrop, County Durham with their children James, Mary and Thomas. John was employed as an agricultrual labourer (hind). Class: RG12; Piece: 4079; Folio 116; Page 23; GSU roll: 6099189., 168696=ERNEST EDWARD CLEMENTS 1897-????, 271515=AGNES STUBBINGS 1884-????, 842295=Christened there on 12/06/1808., 850013=ANN CLEMENTS 1826-06/01/1859, 436544=In 1881 Bertha was living at 67 East Street, Brighton with her parents. I believe the accommodation was either behind or above a shop, which her father managed. Class: RG11; Piece: 1091; Folio: 13; Page: 19; GSU roll: 1341257., 543319=In 1871 Susan and James were living in Hills Road, Trumpington, Cambridgeshire with their children Clara, Mary, Annie and baby WilliamS. James was employed as a domestic gardener. Class: RG10; Piece: 1584; Folio: 91; Page: 28; GSU roll: 829806., 815576=George possibly died in Saxon Street in 1870. He was buried in Wood Ditton on 18/07/1870., 112361=ALBERT HOWE 1896-????+++, 23551=Eddied suffered a heart attack on New Years Day 2007 and died in the Conquest Hospital, Hastings at 08-30. While he was waiting for the ambulance to arrive he told Betty he was just going outside for one last puff (he smoked small cigars), not knowing how true this statement would become., 401626=In 1891 John was living in his maternal grandmother's house in Saxon Street, along with his mother and cousin James. John was employed as an agricultural labourer. Class: RG12; Piece: 1292; Folio 112; Page 26; GSU roll: 6096402., 868522=In 1851 Reuben and Emily were living in Market Lane, Dullingham with their daughter Susan. Reuben was working as a thatcher. Class: HO107; Piece: 1762; Folio: 65; Page: 33; GSU roll: 193654., 467687=GEORGE LEONARD 1864-1865, 57632=In 1901 James was living in Honey Hill, Wimblington, Cambridgeshire with his mother, stepfather, sister Annie and half sisters Agnes, Elsie and Maggie. Class: RG13; Piece: 1550; Folio: 24; Page: 2., 727048=In 1851 Francis was living with his parents in Chesham, Buckinghamshire. Class: HO107; Piece: 1717; Folio: 305; Page: 31; GSU roll: 193625., 119200=FANNY ROSE ALEY 1888-????, 459122=CHARLOTTE CLEMENTS 1871-????, 172159=In 1891 Aaron was living in Bridlington Road, Beeston with his parents and siblings Ellen, Emma, Arthur, Elizabeth, Alice and baby Clara. Class: RG12; Piece: 3953; Folio 19; Page 8; GSU roll: 6099063., 313963=In 1891 Gertie was living in Little Ditton, Wood Ditton with her parents and siblings George, John, Henry, Mary, Sarah, Charles, Thomas and baby Grace. Class: RG12; Piece: 1292; Folio 105; Page 12; GSU roll: 6096402., 54147=SARAH NUNN 1900-????, 220248=In 1901 James and Eva were living in Little Green, Cheveley with their daughter Annie. James was employed as an Ostler. Class: RG13; Piece: 1537; Folio: 58; Page: 1., 822829=In 1891 Mary was still living in the same house. There that day with her were her daughter Mary Ann and grandsons James and John Starling. Class: RG12; Piece: 1292; Folio 112; Page 26; GSU roll: 6096402., 372474=JAMES STUBBINGS 1879-????, 450364=In 1891 Mildred was living at 6 Kings Road, Eccleston with her parents and siblings Charlotte, Ellen, Caroline, Henry, Robert, Constance, Sidney, Winifred, Frederick, Arthur and Waldo. Boarding with them was a widow named Agnes Richardson (living on her own means). Class: RG12; Piece: 3017; Folio 30; Page 10; GSU roll: 6098127., 706131=Christened there on 04/08/1833., 566429=In 1861 Betsey was living in Saxon Street, Wood Ditton with her parents and siblings John, William and Abraham. Class: RG9; Piece: 1031; Folio: 172; Page: 37; GSU roll: 542740. s., 693152=Christened there on 02/03/1845., 683442=Christened there on 12/07/1840., 176448=Christened there on 08/05/1881., 842728=Christened there on 03/06/1831., 363692=THOMAS STUBBINGS 1885-????, 683403=Married Sarah Ann Ashman (b abt 1843) on 08/02/1862 in Wood Ditton. The witnesses at their wedding were Henry Turner and Maria Stubbings., 872534=In 1851 Ann and Richard were living in the High Street, Dullingham along with their son Charles and his wife. Class: HO107; Piece: 1762; Folio: 58; Page: 18; GSU roll: 193654.., 93019=Married Oswald Smithson on 10/10/1927 in St Nicholas church, Bransdale, North Yorkshire. He was the brother of Blanche's husband, Robert. The witnesses at their wedding were Ethel's uncle John Ernest Kennedy and aunt Phoebe Kennedy. This was the same church as Ethel's parents had been married in. At the time of the wedding Ethel had been living at home in Wind Hill and Oswald was living at 2 Northlast Street, Stillington., 419265=CLEMENT OSWIN KNOWLES 1880-????, 850322=In 1881 Susan was living at 4 Meath Street, Battersea with her daughter Emily. Also living there was a lodger by the name of Thomas Hargreaves (Mechanical draughtsman e & M Mkr). Class: RG11; Piece: 647; Folio: 66; Page: 45; GSU roll: 1341149., 803648=In 1871 Thomas and Betsey were still living in Ditton Green with their children Gabriel, Elijah and Thomas. Lodging there again was Martin Allard (agricultural labourer). Thomas was still employed as an agricultural labourer. Class: RG10; Piece: 1595; Folio: 75; Page: 8; GSU roll: 829811., 515372=JOSEPH CLEMENTS 1856-????, 137857=JANE NUNN 1894-1904, 459045=In 1881 Charlotte was living in Knowsley Road, Eccleston in Prescott, Lancashire with her parents and siblings Ellen (Helen), Caroline, Henry, Robert and Constance. Class: RG11; Piece: 3730; Folio: 94; Page: 51; GSU roll: 1341893., 506870=I cannot find Mary Ann in 1871, 176409=In 1891 James was living in Main Street, Wentworth with his parents and siblings James, Eliza and Oliver and his niece Florence. Class: RG12; Piece: 1297; Folio 63; Page 2; GSU roll: 6096407., 822906=James died in Wood Ditton in 1889 and was buried there on 21/01/1889., 348351=In 1881 Agnes was living at 5 Swan Passages,St George Hanover Square, London with her mother, stepfather and half siblings Amelia, William and baby Mary. Class: RG11; Piece: 94; Folio: 78; Page: 14; GSU roll: 1341021., 141728=ALBERT EDWARD NUNN 1904-????, 693238=ABRAHAM STUBBINGS 1845-1881, 137974=I believe Oliver did in the Chesterfield reg district in 1974., 318238=In 1901 George and Emma were living in Market Street, Fordham with their children Ellen and George. George was employed as a bricklayer's labourer. Class: RG13; Piece: 1542; Folio: 149; Page: 17., 710441=In 1891 Martha and George were living in the Red Lion Publice House, waters End, Hemel Hempstead, Hertfordshire with their children Charles, William, Clement and Alice. George was a licenced victualler. Class: RG12; Piece: 1124; Folio 88; Page 12; GSU roll: 6096234., 608718=In 1851 George was living in Little Ditton, Wood Ditton with his parents and siblings Charles, Phoebe, Noah and Elizabeth. Also living there was a lodger named Martin Allard (agricultural labourer) who was possibly a relative of his mother. Class: HO107; Piece: 1762; Folio: 107; Page: 22; GSU roll: 193654., 857319=Christened there on 03/06/1821., 896522=Did John died in Dullingham in 1824. There was a John of the correct age buried there., 515444=Oliver Edward died in the Newmarket reg district in 1927., 608757=Christened there on 02/04/1843., 706092=In 1841 John was living in Little Ditton, Wood Ditton with his parents and sisters Mary, Matilda, Agnes and Betsey. Class: HO107; Piece 65; Book: 6; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 9; Folio: 7; Page: 10; Line: 5; GSU roll: 241222., 506832=In 1881 Mary Ann was living in Dullingham with her parents and siblings Eliza and Elizabeth. Also in the house was Charles Clements, either a son or nephew. Mary Ann was working as a laundress. Class: RG11; Piece: 1674; Folio: 52; Page: 12; GSU roll: 1341400., 727143=FRANCIS CLEMENTS 1847-1902, 458029=HELEN CLEMENTS 1872-????, 372379=In 1881 James was living in West Side, Langton, County Durham with his parents and siblings Ada, Elizabeth and John. Class: RG11; Piece: 4931; Folio: 76; Page: 1; GSU roll: 1342185., 636915=In 1871 Susanna and George were living in Little Ditton, Wood Ditton with their children Mary and James (William). Also living with them was George's mother (named as James on this census!). George was employed as an agricultural labourer. Class: RG10; Piece: 1595; Folio: 79; Page: 15; GSU roll: 829811., 72855=Married Albert F Dyche (b abt. 1898) on 01/01/1925 in the Amersham reg district, Buckinghamshire. The Free BMD has the groom's name as Hubert., 857280=In 1851 Mary was possibly a cook at 10 St Georges Place, Hanover Square, Belgrade, Middlesex. This was the home of George Robinson (clerk in a Banking House) and his wife. Class: HO107; Piece: 1477; Folio: 7; Page: 7; GSU roll: 87800., 15564=THOMAS SMITHSON 1947-????, 38702=LAWRENCE EDWIN SMITHSON 11/09/1931-01/01/2007, 271824=In 1901 Thomas was living in the School House, Stetchworth with his parents and siblings Harry, Ellen, Ada, Alfred, Robert and baby Frederick. Thomas was employed as a carpenter, just like his father. Class: RG13; Piece: 1537; Folio: 91; Page: 5., 159149=In 1901 Effe was employed as a housemaid at 72 Palatine Road, Stoke Newington, London. This was the home of Thes. E Read (amusement contractor) and his family. Class: RG13; Piece: 207; Folio: 39; Page: 6., 612390=Christened there on 06/09/1840., 225176=Married Eva Mary Beales (b abt. 1875 in Newmarket) in Q3 1896 in the Newmarket reg district., 137787=In 1901 Jane was living in Littlemoor, Newbold and Dunston, Derbyshire with her parents and siblings Harriet, Frederick, Oliver and Ellen. Class: RG13; Piece: 3250; Folio: 96; Page: 4., 766830=Married Harriet Halls (b abt. 1829 in Isleham, Cambridge) in Dullingham on 09/11/1850., 493680=In 1871 James was living at ? Cottage, Dullingham with his widowed father and siblings Mary Ann, Frederick, Albert and Emma. Class: RG10; Piece: 1594; Folio: 59; Page: 17; GSU roll: 829811., 419174=In 1881 Clement was living in Ayot Bury, Ayott St Peters with his parents and siblings George, Charles and William. Also living in the house were servants by the name of Edith Seer (domestic) and Bertha Seer (nursemaid). Class: RG11; Piece: 1428; Folio: 66; Page: 2; GSU roll: 1341347., 647902=I cannot find James in 1871., 162999=In 1891 Fanny was possibly employed as a housemaid in The Rectory, The Street, Westley waterless, Cambridgeshire. This was the home of Lawrence R Tuttistt (Rector of Westley) and his family. Class: RG12; Piece: 1292; Folio 23; Page 17; GSU roll: 6096402., 749361=In 1901 Susanna and William were living in Station Road, Dullingham. With them on the day of the census were their grandchildren Frank and Elsie Jacobs (children of Ellen). William was a farmer with his own account. Class: RG13; Piece: 1537; Folio: 49; Page: 18., 515512=Rebecca possibly died in the Newmarket reg district in 1921., 356913=In 1881 Arthur was living at 5 Chatteris Road, Islington with his parents and siblings Amy, Alice, Edmond, Ethel, Norman and Daisy. Arthur was employed as a clerk to a commission merchant. Class: RG11; Piece: 276; Folio: 118; Page: 36; GSU roll: 1341060., 453850=CONSTANCE CLEMENTS 1879-????, 450443=MILDRED CLEMENTS 1887-????, 326025=In 1901 Ruby was living at 72 Protheroe Road, North West Fulham with her parents and siblings William, Mary and John. His half sister, Agnes lived elsewhere in the same house with her family. Class: RG13; Piece: 55; Folio: 12; Page: 16., 868840=In 1841 Reuben and Emily were possibly living in Stoney Street, Dullingham with their daughter Susan. Reuben was employed as an agricultural labourer.Class: HO107; Piece 71; Book: 7; Civil Parish: Dullingham; County: Cambridgeshire; Enumeration District: 2; Folio: 5; Page: 5; Line: 6; GSU roll: 241224., 758067=In 1851 Susan was living in Market Lane, Dullingham with her parents. Class: HO107; Piece: 1762; Folio: 65; Page: 33; GSU roll: 193654., 314053=GERTRUDE AMELIA PRICE 1889-????, 718241=In 1861 Louisa was living with her mother (can't find her father in this census) at 1 Chapel Place North, St George Hanover Square, Mayfair, London and siblings Emily, Susan and Ellen. Also there were lodgers by the names of Elizabeth Meek (governess), Stephen walker (formerly a butler), Marian Darcus (fund holder) and Nannette Leithead (can't decipher her occupation). Class: RG9; Piece: 45; Folio: 73; Page: 24; GSU roll: 542562., 432986=In 1901 Minnie (as she named in this census) was living at 27 Hampstead Road, Preston, Sussex with her parents and sisters Violet and Sylvia. Class: RG13; Piece: 939; Folio: 144; Page: 6., 363583=In 1891 Thomas was living in Carr House, Staindrop, County Durham with his parents and siblings James and Mary. Class: RG12; Piece: 4079; Folio 116; Page 23; GSU roll: 6099189., 172254=AARON CLEMENTS 1885-11/07/1916, 54054=In 1901 Sarah was living with her parents in in Blackwell Road, Hucknall under Huthwaite. Class: RG13; Piece: 3138; Folio: 150; Page: 34., 112584=In 1901 Margaret was living in Saxon Street with her parents and siblings Percy, Arthur, Sarah, Albert and Ruby. Class: RG13; Piece: 1537; Folio: 116; Page: 20., 647866=In 1881 James was employed as servant a at 36 Holland Park, Kensington, London. This was the home of Philip Lucas (land and house proprietor) and his family. James was listed as married but I don't know where his wife was. RG11; Piece: 25; Folio: 122; Page: 24; GSU roll: 1341006.-, 675589=In 1881 John and Fanny were living in West Side, Langton, County Durham with their children Ada, Elizabeth, John and James. John was employed as an agricultural labourer. Class: RG11; Piece: 4931; Folio: 76; Page: 1; GSU roll: 1342185., 815328=In 1841 Elizabeth was living with her parents and brother Robert in Wood Ditton. Also there was a 5 year old named James a nephew or possible son < Class: HO107; Piece 65; Book: 6; Civil Parish: Wood Ditton; County: Cambridgeshire; Enumeration District: 9; Folio: 9; Page: 13; Line: 23; GSU roll: 241222., 176538=OLIVER EDWARD WHETSTONE 1881-????, 114770=AGNES ALICE STARLING 1885-????+++, 693113=In 1851 Abraham was living in Little Ditton with his parents and siblings Mary Ann, John, Matilda, Agnes, Betsey, William, Robert and Charles. Class: HO107; Piece: 1762; Folio: 105; Page: 19; GSU roll: 193654., 23254=Eddie was cremated at Hastings creatorium on January 11th, 2007. When asked by the vicar, prior to the service, what sort of things could you remember about Eddie, Betty said pork chops. When questioned, she said that nearly everytime she prepared pork chops for supper Eddie would end up having an accident at work and end up in hospital. She vividly remembered the day she was preparing the chops when she looked out of the kitchen window and saw an ambulance pulling up outside. She immediately thought of her husband and was very shocked when the driver proceeded to remove a bicycle from the back of the ambulance. Yes, Eddie was indeed in the hospital and they had kindly bought his bike home for him!, 337846=Alice died in South Lambeth, London in 1951., 612476=CHARLES STUBBINGS 1840-1918, 628017=In 1891 Susan and James were was living in West Park Street, Chatteris, Cambridgeshire. Susan's niece, Phoebe was still living with them. Class: RG12; Piece: 1300; Folio 90; Page 8; GSU roll: 6096410., 353088=In 1891 Ethel was living at 8 Sylvan Villas, Chitts Hill, Tottenham, London with her parents and siblings Alice, Hubert, Edmond, Allida, Daisy and Ernest. Also living there was Susan Perry (general domestsic servant). Class: RG12; Piece: 1079; Folio 117; Page 42; GSU roll: 6096189., 119118=In 1891 Lily was living in 3 Rosa Cottages, Lisburn Road, Newmarket All Saints with her parents and siblings (half siblings?) Lily and Alfred. Class: RG12; Piece: 1294; Folio 77; Page 39; GSU roll: 6096404., 706214=JOHN STUBBINGS 1833-????, 168918=In 1901 Elsie was living in Ling Moor, Beeford with her parents and siblings Alice, Clara, John, Ernest and Mary. Class: RG13; Piece: 4517; Folio: 5; Page: 2., 453769=In 1881 Constance was living in Knowsley Road, Eccleston in Prescott, Lancashire with her parents and siblings Charlotte, Ellen (Helen), Caroline, Henry and Robert. Class: RG11; Piece: 3730; Folio: 94; Page: 51; GSU roll: 1341893., 15437=OSWALD KENNETH SMITHSON 11/01/1948-????, 467966=In 1881 Emma was employed as a kitchen maid at 24 Bruton Street, St George Hanover Square, London. This was the home of the Earl and Countess of Longford. Class: RG11; Piece: 93; Folio: 70; Page: 4; GSU roll: 1341021., 310544=MARGARET ASHMAN 1864-????, 436302=In 1891 Bertha was still living in the same place with her parents and siblings Bertha, Flora, Albert, Violet, Sylvia and Minnie. Class: RG12; Piece: 813; Folio 10; Page 14; GSU roll: 6095923., 287086=In 1881 Eliza was living in Mill Road, Wood Ditton with her parents and siblings Eliza, George and James. Class: RG11; Piece: 1675; Folio: 81; Page: 16; GSU roll: 1341401., 593313=In 1881 Elizabeth and John were living at 6 Engleheart Road, Lewisham with their children George, Emma, John, Henry and Annie. There was also a lodger named James Jeffers (carman). John was employed as a general labourer. Class: RG11; Piece: 734; Folio: 152; Page: 45; GSU roll: 1341171., 321769=Possibly married Emma Louisa Turner (b abt. 1874 in Fordham, Cambridgeshire) in Q2 1896 in the Newmarket.}",
    "textBeforeTable": "THE CLEMENTS FAMILY OF DULLINGHAM, CAMBRIDGESHIRE I would like to thank Heatha Kitchen for her work on the Stubbings side of this document. Various other people have contributed through their research and I have mentioned them individually where this occurs. Thank you everyone. Home page REUBEN CLEMENTS abt. 1735-???? Possibly born in Cambridgeshire. Married Sarah Balls (b abt. 1735 in Cambridgeshire (?) in Dullingham on 28/10/1751. Their children:",
    "textAfterTable": "(c) 10/10/1813 Robert 1813 (c) 10/10/1813 James 1815 (c) 10/12/1815 Thomas 1818 (c) 19/04/1818 Mary 1821 (c) 03/06/1821 Francis 1823 (c) 23/11/1823 Ann 1826 (c) 21/05/1826 Mary 1831 (c) 03/06/1831 In 1841 Reuben and Ellen were living in Dullingham with their children Francis and Ann. Reuben was a parish clerk. Class: HO107; Piece 71; Book: 7; Civil Parish: Dullingham; County: Cambridgeshire; Enumeration District: 2; Folio: 10; Page: 14; Line: 15; GSU roll: 241224. Reuben died in 1842 in Dullingham. In 1851 Ellen was living in the High Street in Dullingham. Ellen was working as a laundress. Class: HO107; Piece: 1762; Folio: 59; Page: 20; GSU roll: 193654. In 1861 Ellen was at the home of her son Reuben and his wife in in Reuben's own cottage in Dullingham. Class: RG10; Piece: 1594; Folio: 56; Page: 11; GSU roll: 829811. Ellen died in Dullingham in 1872. FRANCES CLEMENTS abt 1783-1850 Born in Dullingham, Cambridgeshire. Christened there on 02/03/1783. Married John Stubbings (b abt. 1787 in Dullingham) in Dullingham on 14/01/1808. Their children: Abraham 1808 (c) 12/06/1808 John 1810 (c) 20/05/1810 James 1811 (c) 20/10/1811 George 1813 (c) 28/11/1813 Elizabeth",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}