{
    "relation": [
        [
            "Outsourcer name",
            "Nomen",
            "Logos Group",
            "A2MS Traductions"
        ],
        [
            "Country",
            "Croatia",
            "Italy",
            "France"
        ],
        [
            "LWA",
            "5",
            "5",
            "5"
        ],
        [
            "Comment",
            "Hidden",
            "Hidden",
            "Hidden"
        ],
        [
            "Outsourcer feedback",
            "...",
            "...",
            "..."
        ]
    ],
    "pageTitle": "14 years of experience in language services. We know how!",
    "title": "",
    "url": "http://www.proz.com/profile/110674",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00101-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 657716971,
    "recordOffset": 657697891,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Access to Blue Board comments is restricted for non-members. Click the outsourcer name to view the Blue Board record and see options for gaining access to this information. 3 entries Blue Board entries made by this user  alexandrub, Carien Steel, SAJIN KASIM, Esraa-S Employees Blue Board: Nabnet / Bright Bridge Translations L.C. Affiliations BRIGHT BRIDGE TRANSLATIONS, Ltd Company name Translation company, Verified site user Account type Quality at deadline! User message   Display standardized information  ",
    "textAfterTable": "More Less Payment methods accepted Wire transfer, Check, Money order, Visa, MasterCard Company size 10-25 employees Year established 1998 Currencies accepted Euro (eur), U. S. dollars (usd) Glossaries Administration, Agricultural Engineering, art, Biology, Cooking, Economy, Education, games, Geology, International Organisations, Juridical, La Poste, mechanics, Medical, Meetings, People designation, petroleum Eng, Petrolium Engineering, Photography, Politics, Regions names, Religion studies, Social relations, Social science, sport, Technology More Less Standards / Certification(s) Notary Approved This company Hosts interns Offers job opportunities for employees Offers job opportunities for freelancers Experience Registered at ProZ.com: Jun 2005. ProZ.com Certified PRO certificate(s) N/A Professional practices BRIGHT BRIDGE TRANSLATIONS, Ltd",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}