{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "none",
            "I like to sing and act, so I really love the acapella group, and getting involved with JDAs.",
            "Liberal arts",
            "Fun bonfire during orientation. Great feeling of cameraderie.",
            "traying in the winter... great hill.",
            "Fried macaroni and cheese... need I say more?",
            "Fun.",
            "Great for liberal arts.",
            "Make sure you ask about the rigors of the program you are interested in.",
            "DeSales is a great school for a liberal arts education. The campus is beautiful, and there are a lot of great people here I am proud to call my friends. If you are looking for an intensive program, however, this may not be the right place for you."
        ]
    ],
    "pageTitle": "DeSales University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/DeSales-University/reviews?_escaped_fragment_=/show/62317",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00038-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903254059,
    "recordOffset": 903220858,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{32250=I have never felt unsafe on campus. I can walk around it at 1:00 am and still feel perfectly safe., 98797=I have been attending DeSales Univesity off and on while raising my family since 2005. The staff and professors are knowledgable and work well with the students. I would recommend anyone that is looking for a college to look at DeSales University., 116938=© 2015, Cappex.com, LLC, 60395=used to be the safest college in america until a deer umped through a window during a class session in 2010. still very safe, i once left my backpack at dinner and it stayed in the same spot until i found it 48 hours later. nothing was stolen and it had not been moved by any student., 13132=Fall Fest â?? September, Homecoming, Battle of the Bands â?? November, Super Weekendâ?? February, Siblings Weekend â?? February/ March, Spring Fling â?? April/May, Winter Formal, Relay for Life, Senior Week, plus HUGEEEE Thanksgiving and Christmas DELICIOUS dinner for campus... for free :), 448=One of the things that really stood out at DSU over other colleges is that they have tons of leadership opportunities available for freshman. Anyone who wants to take an active role in their education really should be here, because the campus (all 450+ acres) gives the feel of a much larger school, but the population (1500 undergrad who live on-campus) allows you to get to know almost everyone, and creates a great, personal environment. One of the coolest things about DSU is that, it is the students campus, and students play a role in shaping the school as much, or more, than the administration does. If DeSales is lacking something in your interest, you are not only welcome to start it, but actually encouraged, and the support for your projects and endeavors are beyond helpful. If you want to make sure you're getting the most out of your 4-year college experience, nothing tops DeSales University.}",
    "textBeforeTable": "07/22/2009 Reviewer is A current student here. 12 out of 12 people found this review useful. 1 of 29 Lawrence from Sellersville, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Bang for the buck DeSales, initially is very expensive but, like myself, many students get scholarships and grants to make it more affordable. The classes are great, the facilities are clean, and the activities on campus are very diverse, there is something for everyone! I definitely think you get the most for your money at DeSales! Am enjoying being here Although DeSales is in a very rural neighborhood there is still a lot to do on and off of campus. The Student Night Life committee (SNL) makes sure that all students have plenty of options when it comes to taking a breaking or relieving stress. I also enjoy being at DeSales because I only live about 45 minutes from campus so I have to option to go home whenever i want. Am learning a lot DeSales has a lot to offer with their academics. The teachers are all very informative and willing to help. I really do think I am learning a lot since I have been at DeSales! Most of the professors are willing to make class as fun as possible while still providing you with the most information possible. Login to rate or flag the reviews",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}