{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I don't know the official report or anything but campus feels pretty safe. The dorms have extremely sensitive smoke detectors in every room so it won't be long until you see the fire marshal. There are signs with the police number to call if you do feel scared to have them walk or drive you home. The roads around campus are always crawling with pedestrians so appropriate markers are everywhere and the people of Logan know to avoid driving that street if they want to get anywhere fast in their car.",
            "I don't even know how many clubs we have but there are a lot and they put together a day where they are nearly all available for everyone to learn more about and sign up for. There are many activities that go on throughout the year, it is very hard to find a weekend where something isn't going on.",
            "Engineering students of all types are most prevalent here because of the engineering college's legacy of producing great engineers and research projects. Those interested in agriculture also do really well here because it is a small town feeling of a school and there are a ton of farms and ranches nearby.",
            "You get a lot for a considerably low tuition, which is awesome! It also includes all major sporting events so you don't have to pay extra to get into football or basketball, just bring your id.",
            "The basketball games are legendary, especially the student section. We are loud, we are proud, and we get way into the game! Football is picking up to be a good team in the past few years and those are also fun. There is also movie theaters around the town, movies shown by the school (admission is generally a can of food to go to the student food pantry-where students low on money can get food). There are many games and club games and hundreds of clubs for service and fun. There is even some evenings set aside in some computer labs for giant video game competitions. The mountains are close and allow for weekend ski/snowboard trips that students and professors love.",
            "What can I say? It is all you can eat and it is quite popular to find a quiet seat in the side room of the main cafeteria during dead week or finals week and eat and study all day for multiple meals while only paying once. The options are great and they try to encourage students to eat healthy by offering lots of veggies and fruits and smoothies and hints/tips about healthy eating.",
            "I really enjoyed my time in the dorms (we called them residence halls though). The meal plan is actually pretty good and has a ton of different options and is even accepted at the cafes around the giant grass field behind the library (and the cafe in the library). There is generally always something going on on campus whether through the school or the dorm areas or even just through the planning of your resident advisor.",
            "It really depends on what major you choose. The two most popular majors are education and engineering at USU because we are most well known for those. Some classes are harder than others and go beyond what the formula for amount of out of class work you do per hour in class but the professors and the departments try to help with various tutors and help sessions and open offices.",
            "Winters are super, super cold! Invest in really warm clothes and coats and extra blankets! Get to know your professors, they are actually really helpful with class and other classes. Get involved!! My best year was my first year when I joined many clubs (we have a ton of clubs at USU for everybody) because it gets you out of studying for fun breaks with people like you.",
            "The campus is great for fun and learning, both in class and fun new things. The people are super nice and the school knows the best times to provide games in the lounge of the student center. The professors I have had so far have been fantastic, some weird but devoted to what they know and want you to be just as excited as they are."
        ]
    ],
    "pageTitle": "Utah State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Utah-State-University/reviews?_escaped_fragment_=/show/86984",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00291-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 885866095,
    "recordOffset": 885671082,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1041451=Honestly you are able to save so much money here through tuition, housing and all the expenses added up in general. The average student spends about 8-12 grand a year for both semester on living here and that's if money is no option. That is about an average of 2000 on tuition each semester, 1600 on housing, 1000 on food, and about 500 for books and what not. The travel here by the way is completely free. All bus systems for city and campus are free for all to ride. Believe me this is really worth your money, 181862=Apply now! If you apply before the December 1st deadline, you automatically receive academic scholarships if you're eligible. I currently have half tuition because I applied early. Also, live on campus for at least your first year. There's a lot that you can get involved in with Housing and Residence Life, AND you're close to your classes. I could wake up five minutes before class any day of the week and still get to class on time - it's reassuring. Get involved and go to events, because they happen alllll the time and they're an absolute blast! Also, pay attention when anybody or anything says the words free Aggie Ice Cream, because they are said often, and they are beautiful. Aggie Ice Cream is like food for your soul. 26 flavors of goodness., 1118057=You can go hiking, ice skating indoors or outdoors in the winter, skiing (there is a fantastic ski resort in Logan Canyon about 45 minutes from campus), showshoeing, sledding, go to a show at the Ellen Eccles Theater, thrift shop, volunteer at numerous charitable organizations, attend free events and activities at the Logan Tabernacle (a community church/fine arts events center), shop at local businesses including antique book stores, organic markets, global trade gift shops, fashion boutiques, etc., you can take community classes, visit the local gardener's market from April to October, go yard-saleing, attend local religious services and events, get involved with the Deaf community, volunteer with our chapter of Special Olympics, spend time with the elderly, party at the White Owl (the only bar here that I know of), etc., 38363=Utah State University touts a friendly atmosphere, intimate campus, world-class research faculty and ready opportunities to work with them, and accessible professors. While the professors are readily available and glad to explain difficult courses during office hours, my professors explain concepts very poorly in class. Instruction seems to emphasize superficial examples and applications, and the deeper theory is rarely taught. My electrical engineering and statics lectures are 100% example, 0% theory, and the required textbooks only superficially explain things. The science professors are much better at explaining theory, but still emphasize sample problems instead of symbolic exploration. However, learning opportunities outside of class are much better. Though only a freshman, I’ve been able to work with the university’s Microgravity Research Team from day one, so I’ve picked up a little heat transfer theory and have written ten pages of the team’s proposal for a 2011 experiment. Almost any faculty member will set you up in a research project if you ask them, or at least tell you what to study so that you can contribute as soon as possible. They are happy to accept volunteer lab workers. The USU library is an excellent learning environment. It has quiet zones, group study rooms, several large open computer labs and conversational study areas, and an excellent collection. Besides, it boasts a flood of natural light in the daytime, so you don’t feel locked up and confined inside. Overall, I’d say USU is a pretty average learning environment. The facilities are good and the opportunities to learn outside of class are great, but these strengths are balanced by its remarkably poor lecturers., 917991=To become an Ultimate Aggie, one must run across the entire campus from the time first snow falls in November to February. The participant has to do so naked, evade campus police, and ride the huge metal bull statue. Oh yeah, and you have to be photographed for proof., 874751=They have movies held at the main building for student all through out the year which is nice because it gets cold in Logan. Sledding is an option through out the whole year. Utah State has The Howl every October and is way fun. Also the End of the Year Bash where they have bands and artist come perform. Can't forget about the football and basketball games that are a blast., 235153=the greek community has been steadily growing for the passed couple of years. fall of 2012 will welcome another fraternity and hopefully another sorority.}",
    "textBeforeTable": "07/13/2009 Reviewer is A current student here. 30 out of 30 people found this review useful. 1 of 256 Alexis from Heber City, UT Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Bang for the buck I am getting every dollars worth that I have spent in going to Utah State. Am enjoying being here I can't even explain how much I love Utah State. It is so much fun and I am receiving such a great education. There are many activities to get the students involved. The USU basketball and football games are the best. It is amazing to see how much school spirit our school has when you go to these games and it is so much fun to be a part of it. The campus is beautiful. I love it because it is not too big, but also not to small either. Am learning a lot Every Professor I have had so far has just been unbelievable. They all are so passionate about the subject they are teaching and therefore it makes it much more interesting for the students. Login to rate or flag the reviews emily from West Bountiful, UT 08/27/2009 Reviewer is A current student here. 12 out of 12 people found this review",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}