{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "High",
            "Very active..",
            "There is an array of activities and clubs to join if you want.",
            "Undecided. Good place to explore what is out there for relatively cheap.",
            "Don't step ont he gorilla face in the oval.",
            "It is very cheap, but what you get is not bad.",
            "Party.",
            "Dining options are good if you have dining dollars and go to Gorilla crossing. Dining hall options are quite limited and get very repetitive.",
            "Dorm life is nice and friendly. Evyone is loving and incredibly sweet.",
            "Depending on what program you are in. Pre-med and engineering programs are quite rigorous, however some of the more artistic programs are slightly less formed and rigorous.",
            "Communicate and get to know your teachers. They will motivate you to do your best.at field you go into.",
            "Pittsburg State University is a friendly quaint town. There are plenty of opportunities to get involved and have a great time. You can learn quite a bit if you are motivated, but it is quite simple to get distracted."
        ]
    ],
    "pageTitle": "Pittsburg State University (Pitt State) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pittsburg-State-University/reviews?_escaped_fragment_=/show/44568",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00038-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896995875,
    "recordOffset": 896939031,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{133653=The food does get old after the first month, and they stop cooking hot breakfast at 9:30 am., 239498=Pittsburgh State University was recently ranked in 2014 as number 77 for the best colleges in the regional universities (Midwest). Everyone on campus is motivated to succeed. The advisors are there to help you if you are not comfortable in a class. Also, there is tutoring available to each student free of charge. Also, if you need an essay looked over, or don't know how to start a paper you can visit the writing center and they are there to help you on your paper., 208662=Apply for scholarships within your major by Feb 1st!, 73584=Join greek life, or play intramural sports, even join a club. Last year 2011 the football team was the Division 2 National Champions, so tailgating is always fun!, 220481=Pittsburg, Kansas is the ideal college town. It has discounts galore for students, and many churches sponsor activities for those attending the school. PSU is also very safe, with a large police force which will be expanding in October., 238144=Dorm life is great. Most of the dorms have been renovated which makes the dorm life a better atmosphere. The beds are comfortable and the furniture that is in the room is nice. When choosing your dorm you really don't know what the difference is. Bowen, Tanner, and Trout are the dorms that have just been recently renovated. These dorms are known to be the quiet dorms. Also, they are closer to the football field and a father from the dining hall. Which doesn't sound bad, but when it is winter time it feels too cold to walk across campus to go and eat. Dellinger and Nation hall are the dorms that are closer to everything they are more of the louder dorms. Most of the basketball and football players live in these dorms. Dellinger is the nicer dorms they also have been recently renovated. Nation has not been renovated but will in the summer of 2014. The pros of living in nation is there are a lot of people, you are closer to classes and the dinning hall. The cons are they are louder dorms especially on the weekends. But overall the dorm life is great., 90920=Yell like Hell is held every year sometime in sept./oct. which involves a bunch of student organizations getting together and having a dance contest in front of the entire student body., 245858=The student-faculty ratio at Pittsburg State University is 19:1, and the school has 51.4 percent of its classes with fewer than 20 students. The most popular majors at Pittsburg State University include: Elementary Education and Teaching; Registered Nursing/Registered Nurse; Business/Commerce, General; Construction Management; and Psychology, General. The average freshman retention rate, an indicator of student satisfaction, is 72.3 percent., 258421=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/22/2009 Reviewer is A current student here. 12 out of 14 people found this review useful. 1 person found this inaccurate. 1 of 57 Kylie from Pittsburg, KS Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Am learning a lot The general education classes are not particularly difficult, but they are filled with a lot of interesting information. My major is Biology/Pre-Physical Therapy emphasis. My core classes that go towards my major are pretty challenging and filled with new topics. As challenging as they may be, the instructors are very willing to help with any problems one is experiencing. Login to rate or flag the reviews Melissa from Pittsburg State University 04/12/2011 Reviewer is A current student here. 5 out of 5 people found this review useful. 3 of 57 Categories Comments Great for these types of students Pittsburg is a great school for students who like the small town atmosphere, likes small class sizes, and seeing familiar faces around campus. From what I have noticed over the time I've been here is that most students are either accounting, education, construction management, automotive, or technology majors and they all seem to love their program. Tips for prospective students When looking",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}