{
    "relation": [
        [
            "Release",
            "12.2(33)SXI",
            "15.2(2)T"
        ],
        [
            "Modification",
            "This command was introduced.",
            "This command was integrated into Cisco IOS Release 15.2(2)T."
        ]
    ],
    "pageTitle": "Cisco IOS Security Command Reference: Commands A to C, Cisco IOS XE Release 3SE (Catalyst 3850 Switches) - authentication command bounce-port ignore through auth-type [Cisco Catalyst 3850 Series Switches] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/security/a1/sec-a1-xe-3se-3850-cr-book/sec-a1-xe-3se-3850-cr-book_chapter_010.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00103-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 358850155,
    "recordOffset": 358818952,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39514=The following example shows how to set the reauthentication interval on a port to 1800 seconds:, 5636=The following example shows how to enable reauthentication and sets the interval to 1800 seconds for an interface template:, 40063=The following example shows how to set the reauthentication interval on a port to 1500 seconds for an interface template:, 5061=The following example shows how to enable reauthentication and sets the interval to 1800 seconds:}",
    "textBeforeTable": "Command History Global configuration Command Modes The router accepts a RADIUS CoA bounce port command. Command Default This command has no arguments or keywords. Syntax Description ignore bounce-port command authentication no ignore bounce-port command authentication To configure the router to ignore a RADIUS Change of Authorization (CoA) bounce port command, use the authentication command bounce-port ignore command in global configuration mode. To return to the default status, use the no form of this command. authentication command bounce-port ignore auth-type authentication violation authentication timer restart authentication timer reauthenticate authentication timer inactivity authentication priority authentication port-control authentication periodic authentication order authentication open authentication host-mode authentication fallback authentication event server dead action authorize authentication event server alive action reinitialize authentication event fail authentication control-direction authentication command disable-port ignore",
    "textAfterTable": "15.2(2)T This command was integrated into Cisco IOS Release 15.2(2)T. Usage Guidelines A RADIUS CoA bounce port command sent from a RADIUS server can cause a link flap on an authentication port, which triggers Dynamic Host Configuration Protocol (DHCP) renegotiation from one or more hosts connected to this port. This incident can occur when there is a VLAN change and the endpoint is a device (such as a printer) that does not have a mechanism to detect a change on this authentication port. The authentication command bounce-port ignore command configures the router to ignore the RADIUS CoA bounce port command to prevent a link flap from occuring on any hosts that are connected to an authentication port. Examples This example shows how to configure the router to ignore a RADIUS CoA bounce port command:  Router(config)# aaa new-model Router(config)# authentication command bounce-port ignore Related Commands Command Description",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}