{
    "relation": [
        [
            "Name",
            "USS Al-Batani",
            "USS Berlin",
            "USS Cairo",
            "USS Charleston",
            "USS Crazy Horse",
            "USS Crockett",
            "USS Enterprise",
            "USS Excelsior",
            "USS Farragut",
            "USS Fearless",
            "USS Fredrickson",
            "USS Gorkon",
            "USS Grissom",
            "USS Hood",
            "USS Intrepid",
            "USS Lakota",
            "USS Malinche",
            "USS Melbourne",
            "USS Okinawa",
            "USS Paris (Simulation ship)",
            "USS Repulse",
            "USS Roosevelt",
            "USS Valley Forge"
        ],
        [
            "Registry",
            "NCC-42995",
            "NCC-14232",
            "NCC-42136",
            "NCC-42285",
            "NCC-50446",
            "NCC-38955",
            "NCC-1701-B",
            "NCC-2000, previously NX-2000",
            "NCC-2021",
            "NCC-14598",
            "NCC-42111",
            "NCC-40512",
            "NCC-42857",
            "NCC-42296",
            "NCC-38907",
            "NCC-42768",
            "NCC-38997",
            "NCC-62043",
            "NCC-13958",
            "NCC-2008",
            "NCC-2544",
            "NCC-2573",
            "NCC-43305"
        ],
        [
            "Depiction",
            "Although it never appeared on screen, the Al-Batani is mentioned in dialogue as the first ship aboard which Kathryn Janeway served, which at the time was captained by Tom Paris' father Owen Paris.[65][66] Never defined on screen, the class and registry number come from the non-canon Star Trek Encyclopedia.[1]",
            "Patrolled the Romulan Neutral Zone.[67]",
            "Transfers Captain Edward Jellico to the Enterprise-D.[68] Disappeared while patrolling the Romulan Neutral Zone.[37]",
            "Transported three previously cryogenically frozen people to Earth.[69] Part of the tachyon blockade during the Klingon Civil War.[6]",
            "Part of Task Force 3 sent to face an anticipated Borg invasion.[17] Set to rendezvous with the Enterprise-D to transfer Rear Admiral Erik Pressman.[70]",
            "Transported Admiral Mitsuya to Deep Space Nine.[64]",
            "Ship aboard which James T. Kirk is lost and presumed dead. Commanded by Captain John Harriman and later by Captain Demora Sulu.[71]",
            "Pathfinder and transwarp drive testbed.[42] In The Search for Spock, the ship dubbed the great experiment and was days away from its first test run. It was unexpectedly called into service to stop Admiral Kirk and his crew from stealing the soon to be decommissioned Enterprise. Attempting to use the transwarp drive to bring the ship back to spacedock, the Excelsior was sabotaged by Montgomery Scott and was left dead. Following the embarrassing failure, the Excelsior underwent repairs in spacedock before its recommission into active duty. Fails in attempt to rescue Captain James T. Kirk and Dr. Leonard McCoy from Qo'noS.[72] Helps defeat General Chang over Khitomer.[49] Ship aboard which Tuvok serves as science officer.[72] Commanded by Captain Styles in Star Trek III: The Search for Spock and Captain Hikaru Sulu in Star Trek VI: The Undiscovered Country.",
            "Transported several genetically enhanced humans to Deep Space Nine.[73][74]",
            "Assigned to planetary mapping in the Beta Mahoga system.[23] Received new warp technology[19]",
            "Briefly at Utopia Planitia Fleet Yards.[75] Serves in the Dominion War.[25]",
            "Sent to face a possible Borg invasion.[17]",
            "Assists the Enterprise-D during a contamination problem on Beta Agni II. Name pays tribute to astronaut Gus Grissom, commander of Apollo 1.[76] Destroyed at the Battle of Ricktor Prime.[77]",
            "William Riker's assignment before his transfer to the USS Enterprise-D.[78] Part of the tachyon blockade during the Klingon Civil War.[6] Participates in the Battle for Deep Space 9[79] and First Battle of Chin'toka.[80] Part of Battle Group Omega sent to intercept Reman warship Scimitar.[81]",
            "Responded to a Klingon distress call from the Khitomer outpost following a Romulan attack.[82]",
            "Attempts to stop USS Defiant from reaching Earth.[83]",
            "Patrolled the Cardassian Border before the Dominion War. Severely damaged by the Maquis led by Michael Eddington.[84] Destroyed in 2381 during the Borg Invasion.",
            "Offered to William Riker to command.[21] Starfleet flagship at the Battle of Wolf 359, where it is destroyed.[21]",
            "Ship commanded by Admiral Leyton and ship on which Benjamin Sisko served as first officer[1][85]",
            "Simulated Excelsior class vessel used by Academy trainees in Star Trek: Starfleet Academy.",
            "Katherine Pulaski's assignment before the USS Enterprise-D.[86] Served in the Dominion War.[37]",
            "Destroyed at the Battle of Wolf 359.[21][87]",
            "Destroyed by an orbital defense platform at the Battle of Chin'toka.[80]"
        ]
    ],
    "pageTitle": "List of Star Trek Starfleet starships ordered by class - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/U.S.S._Stargazer",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 852161503,
    "recordOffset": 852096503,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 28 Jul 2015 09:17:29 GMT",
    "textBeforeTable": "Akira class[edit] Starships[edit] 3 References 2.4 Auxiliary ships 2.3 Yellowstone class 2.2 Peregrine class 2.1 Danube class 2 Non-starships and support vessels 1.62 Class unknown 1.61 Zodiac class 1.60 Yorkshire class 1.59 Wells class 1.58 Wambundu class 1.57 Vesta class 1.56 Theophrastus class 1.55 Sydney class 1.54 Surak class 1.53 Steamrunner class 1.52 Springfield class 1.51 Soyuz class 1.50 Sovereign class 1.49 Sequoia class 1.48 Saber class 1.47 Rigel class 1.46 Renaissance class 1.45 Prometheus class 1.44 Olympic class 1.43 Odyssey class 1.42 Oberth class",
    "textAfterTable": "USS Zhukov NCC-62136 Made cultural observation of Alpha Laputa IV.[13] Previous assignment of Lt. Barclay before transfer to the Enterprise-D[14] Supporting ship in Star Trek: Bridge Commander, commanded by an Andorian Captain Verata, the ship escorts the USS Sovereign to Starbase 12 and participates in several battles. Andromeda class[edit] Named for Greek mythological figure and nearby Andromeda galaxy. Name Registry Depiction USS Andromeda NCC-68800 Presumable namesake ship for the class. USS Drake NCC-70956 Ambushed by a Klingon battle group.[15] USS Prokofiev NCC-68814 Dispatched to the border of the Federation-Cardassian Demilitarized Zone.[3] Antares class[edit] Named for star Antares. Name Registry Depiction USS Antares aka SS Antares NCC-501 Rescues and is later destroyed by Charlie Evans.[16] USS Hermes NCC-10376 Part of the tachyon blockade during the Klingon Civil War.[6]",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}