{
    "relation": [
        [
            "Patent application number",
            "20110176784",
            "20140314384"
        ],
        [
            "Description",
            "System For An Internal Rotating Storage Spool Combined With Top And Bottom Cable Access In A Fiber Distribution Terminal - A fiber distribution terminal for use in an environmentally sealed enclosure can include a rotatable spool for housing input fiber cable. The spool is configured to be mounted in the environmentally sealed enclosure. The fiber distribution terminal can also include an adapter pack that secures the connections between fibers of the input fiber cable and fibers of the output fiber cable. The fiber distribution terminal can include an adapter plate that guides the routing of both the input and output fiber cables internal to the enclosure. The fiber distribution terminal can also include a spool lock that can direct the cable routing to a first side or a second side of the fiber distribution terminal.",
            "Fiber Distribution Hubs - A fiber distribution hub (FDH) can include an enclosure defining an interior region and a frame body having a longitudinal axis. The frame body is rotatably mounted within the interior region of the enclosure such that the frame body can rotate about the longitudinal axis relative to the enclosure. The FDH further includes a plurality of splitters coupled to the frame body. Each splitter module has at least one splitter input and at least two splitter outputs. The FDH also includes a first plurality of adapters coupled to the frame body. The first plurality of adapters is configured to optically couple to splitter output cables. Additionally, the FDH can also include a storage retaining structure coupled to the frame body, the storage retaining structure being configured to selectively secure connectorized ends of splitter output cables."
        ],
        [
            "Published",
            "07-21-2011",
            "10-23-2014"
        ]
    ],
    "pageTitle": "Nair, IN - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/nair-in-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00104-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 444535775,
    "recordOffset": 444504054,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "K.r. Suresh Nair, Cochin IN //]]> BarDraw('2968252',['Patent applications by K.r. Suresh Nair, Edappally IN'],[[2,1,1]],['2010','2011','2012'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2968252\" align=\"center\"></div> </div> <canvas id=\"bg2968252\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by K.r. Suresh Nair, Edappally IN</p> <div class=\"bar2968252\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>04-12-2012</td> <td><a href=\"/patents/app/20120087627\">Compact High Density Central Office Fiber Distribution System</a> - A fiber distribution system having a rack mounted chassis and a fiber distribution rack to mount in the chassis. The system includes one or more splitter modules which are designed to be mounted in the fiber distribution rack. The splitter modules have a compact design and contain a plurality of fiber splitters. The fiber distribution system also contains a cable guide tray for supporting the fiber cables and the system includes a plurality of radius limiters to minimize cable bends.</td> <td>20120087627</td> <tr> </tr> <td>06-16-2011</td> <td><a href=\"/patents/app/20110142406\">Compact High Density Central Office Fiber Distribution System</a> - A fiber distribution system having a rack mounted chassis and a fiber distribution rack to mount in the chassis. The system includes one or more splitter modules which are designed to be mounted in the fiber distribution rack. The splitter modules have a compact design and contain a plurality of fiber splitters. The fiber distribution system also contains a cable guide tray for supporting the fiber cables and the system includes a plurality of radius limiters to minimize cable bends.</td> <td>20110142406</td> <tr> </tr> <td>07-01-2010</td> <td><a href=\"/patents/app/20100166377\">COMPACT HIGH DENSITY",
    "textAfterTable": "K.r. Suresh Nair, Kochi IN Patent application number Description Published 20120063735 Fiber Distribution Terminals - A fiber distribution terminal (FDT) includes a base plate, a spool, and an adapter for securing a connection between a fiber of an input fiber cable and a fiber of an output fiber cable, and an adapter plate. The spool is rotatably mounted to the base plate. The spool houses the input fiber cable. The adapter plate has a cable guide defining a channel for routing the output fiber cable from the adapter. The FDT can be mounted within a pre-installed enclosure or directly to a wall. 03-15-2012 20130058615 Cable Carrier Device - A carrier device for advancing a fiber optic cable having a connector on one end of the fiber optic cable through a conduit includes a first carrier member and a second carrier member configured to be selectively coupled to the first carrier member. The first carrier member defines a first hollow portion with a first width and a second hollow portion with a second width. The first hollow portion is configured to receive a first portion of a connector on one end of a fiber optic cable. A connector seated in the first hollow portion is securely coupled to the carrier device. 03-07-2013 20130129295 Fiber Optic Collector and Terminal Assemblies - A fiber optic collector and terminal assembly (CTA) can include a multi-fiber optic cable having a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}