{
    "relation": [
        [
            "Code or Value",
            "1",
            "2",
            "7",
            "9",
            "."
        ],
        [
            "Value Description",
            "Yes",
            "No",
            "Refused",
            "Don't know",
            "Missing"
        ],
        [
            "Count",
            "1658",
            "9512",
            "0",
            "12",
            "6413"
        ],
        [
            "Cumulative",
            "1658",
            "11170",
            "11170",
            "11182",
            "17595"
        ],
        [
            "Skip to Item",
            "",
            "YDQE12",
            "YDQE12",
            "YDQE12",
            ""
        ]
    ],
    "pageTitle": "NHANES 2000 - 2004: Eating Disorders Data Documentation, Codebook, and Frequencies",
    "title": "",
    "url": "http://www.cdc.gov/nchs/nhanes/limited_access/YDQE.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00041-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 362590159,
    "recordOffset": 362548604,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{1727=Title: Eating Disorders (YDQE ) Contact Number: 1-866-441-NCHS Years of Content: 2000 - 2004 First Published: October, 2006 Revised: NA Access Constraints: RDC Only Use Constraints: RDC Only Geographic Coverage: National Subject:Youth Mental Health Record Source: NHANES 2000 - 2004 Survey Methodology: NHANES 2000 - 2004 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files}",
    "lastModified": "Tue, 25 Jun 2013 12:27:50 GMT",
    "textBeforeTable": "Both males and females 8 YEARS - 19 YEARS Target: Record Type English Text: Record Type SAS Label: YDARTYPE Variable Name: YDARTYPE - Record Type Both males and females 8 YEARS - 19 YEARS Target: Respondent sequence number. English Text: Respondent sequence number SAS Label: SEQN Variable Name: SEQN - Respondent sequence number Codebook and Frequencies Title: Eating Disorders (YDQE ) Contact Number: 1-866-441-NCHS Years of Content: 2000 - 2004 First Published: October, 2006 Revised: NA Access Constraints: RDC Only Use Constraints: RDC Only Geographic Coverage: National Subject:Youth Mental Health Record Source: NHANES 2000 - 2004 Survey Methodology: NHANES 2000 - 2004 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files Locator Record Note: General documentation for National Institute of Mental Health Diagnostic Interview Schedule for Children (DISC) special access data sets may be found on the Limited Access page of the NHANES website. Last Revised: NA First Published: October, 2006 Data File: YDQE.xpt Eating Disorders (YDQE) 2000 - 2004 Data Documentation, Codebook, and",
    "textAfterTable": "YDQE01Z SAS Label: Height - centimeters English Text: Now I'm going to change the subject a bit and ask you some questions about eating and weight.<p> How tall are you?<p> (centimeters) English Instructions: Height may be in feet and inches or in centimeters.<p> (Collection Names: Youth=YEA001Z; Parent=PEA001Z) Target: Both males and females 8 YEARS - 19 YEARS Code or Value Value Description Count Cumulative Skip to Item 104 to 204 Range of Values 11172 11172 . Missing 6423 17595 YDAEN01 - Was height measured for study? Variable Name: YDAEN01 SAS Label: Was height measured for study? English Text: Was height measured for study? English Instructions: Collection Names: Youth=YEAN01; Parent=PEAN01) Target: Both males and females 8 YEARS - 19 YEARS Code or Value Value Description Count Cumulative Skip to Item 1 Yes 11142 11142 2",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}