{
    "relation": [
        [
            "Original Syntax",
            "h = pcolorm(Z) constructs a surface using the regular data grid Z and a graticule mesh (using meshgrat) with size equal to size(Z) and with geographic limits that match the map latitude and longitude limits in the current map axes.",
            "h = pcolorm(Z,gratsize) uses a graticule mesh with size equal to gratsize.",
            "h = surfacem(Z) constructs a surface using the regular data grid Z and a graticule mesh (using meshgrat) of size 50-by-100. The geographic limits match the map latitude and longitude limits in the current map axes.",
            "h = surfacem(Z,gratsize) uses a graticule mesh with size equal to gratsize.",
            "h = surflm(Z) constructs a surface using the regular data grid Z and a graticule mesh (using meshgrat) with size equal to size(Z) and with geographic limits that match the map latitude and longitude limits in the current map axes. It is displayed with a default light source.",
            "h = surflm(Z,s) specifies the direction of the light source. s is a two- or three-element vector that specifies the direction from the surface map to the light source as defined in the documentation for surfl.",
            "h = surfm(Z) constructs a surface using the regular data grid Z and a graticule mesh (using meshgrat) with size equal to size(Z) and with geographic limits that match the map latitude and longitude limits in the current map axes.",
            "h = surfm(Z,gratsize) uses a graticule mesh with size equal to gratsize."
        ],
        [
            "Replacement Syntax",
            "[lat,lon] = meshgrat(latlim,lonlim,size(Z)); h = pcolorm(lat,lon,Z)",
            "[lat,lon] = meshgrat(latlim,lonlim,gratsize); h = pcolorm(lat,lon,Z)",
            "h = surfacem(latlim,lonlim,Z)",
            "[lat,lon] = meshgrat(latlim,lonlim,gratsize); h = surfacem(lat,lon,Z)",
            "h = surflm(latlim,lonlim,Z)",
            "h = surflm(latlim,lonlim,Z,s)",
            "h = surfm(latlim,lonlim,Z)",
            "[lat,lon] = meshgrat(latlim,lonlim,gratsize); h = surfm(lat,lon,Z)"
        ]
    ],
    "pageTitle": "Release Notes for Mapping Toolbox - MATLAB & Simulink",
    "title": "",
    "url": "https://www.mathworks.com/help/map/release-notes.html?nocookie=true",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00250-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 918059999,
    "recordOffset": 917976466,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{382174=The Zone field contained 32767 if the UTM zone was not applicable or was missing from the metadata., 307635=The original boston.tif GeoTIFF satellite image has been replaced by a higher resolution image, created by and provided courtesy of GeoEye™. The new image has the same name as the old one, boston.tif. The new boston.tif file, and an overview image in JPEG format, boston_ovr.jpg, include material copyright © by GeoEye, all rights reserved. The new image is 2881-by-4481 pixels, with a ground pixel size of 3.2808333333 U.S. survey feet (one meter). The original image was 720-by-1120 pixels and had a ground pixel size of four meters. Both images cover the downtown section of Boston, Massachusetts, the Charles River, and parts of Cambridge. The new image is a \"pan-sharpened\" multispectral image with visible red, green, and blue bands, and is stored in RGB form. The original image was also multispectral, but was a simple composite of red, green, and blue bands, and it was written to the GeoTIFF file as an indexed-color image. One additional change is that rather using meters, the new image is spatially referenced to the Massachusetts State Plane Mainland coordinate system with units of U.S. survey feet. The overview image, boston_ovr.jpg, is referenced to latitude-longitude, with a ground pixel size of approximately 16 meters. For further information, refer to the text files boston.txt, boston_ovr.txt, and boston_metadata.txt in toolbox/map/mapdata., 115531=Many users today work exclusively in the World Geodetic System of 1984 (WGS 84). Along with many other roles, it serves as the native coordinate system the NAVSTAR Global Positioning System (GPS). All that may be needed in this case is the new wgs84Ellipsoid function, which returns a referenceEllipsoid object with property settings appropriate to the WGS ˋ84 ellipsoid., 55751=The Unidata Program Center's THREDDS Data Server (TDS) using the domain name motherlode.ucar.edu has been upgraded to use the domain name thredds.ucar.edu. The domain name motherlode.ucar.edu will not work after August 1, 2013. These layers have been updated in the database to use the new thredds.ucar.edu domain name., 174959=Due to a recent bug fix, the contouring functions now exhibit many improvements. The bug fix in question, Bug 192285, addressed problems with contours displayed by contourm, contour3m, and contourfm. The following figure illustrates filled contours produced by the contourfm function in R2010b, as compared to R2010a and earlier releases., 393889=Function gshhs, which reads the Global Self-consistent Hierarchical High-resolution Shoreline data set, has been upgraded. It now returns a Version 2 geographic data structure (geostruct2) array instead of a Version 1 geostruct. Polygons returned from gshhs now follow the shapefile vertex-ordering convention (supported by functions polybool, shaperead, and shapewrite, for example). Under this convention the coordinates of outer rings (e.g., continent outlines) are given in clockwise order, while counterclockwise ordering is used for inner rings (e.g., lakes and inland seas within a continent). Note that function gshhs does not yet support Version 1.3 of the data set, released on Sept. 27, 2004., 443916=© 1994-2015 The MathWorks, Inc., 270081=The data includes tidal wave events for which the maximum water height was at least one meter, ranging for the years 1950 to 2006, inclusive. The Global Tsunami Database, U.S. National Geospatial Data Center (NGDC), National Oceanic and Atmospheric Administration (NOAA), available at http://www.ngdc.noaa.gov/seg/hazard/tsu.shtml, is the source of the data. All the files consist of U.S. Government information that is in the public domain and is not subject to copyright protection., 392298=Function tgrline now supports the most recent (2003/2004) TIGER/Line data sets from the U.S. Bureau of the Census., 94505=The information on finding geospatial data on the Internet, previously located in \"Tech Note 2101\" at URL http://www.mathworks.com/support/tech-notes/2100/2101.html has been moved into the Mapping Toolbox documentation. The same content and links to external data sources, with some updates and improvements, can be found at the URL:http://www.mathworks.com/help/map/finding-geospatial-data.html, 26767=2609 new WMS servers from the Norwegian Meteorological Institute THREDDS server. These servers provide scientific data layers in meteorology, atmosphere, climate, ocean, and Earth science. Search for the layers and servers using the urlSearchString 'thredds.met.no'., 396151=http://www.mathworks.com/support/tech-notes/2100/2101.html, 142923=Note:   When 'airy' is used, almanac returns an ellipsoid vector for the Airy 1830 reference ellipsoid. This has always been the case and has not changed in R2011b, but through R2011a the documentation incorrectly indicated that 'airy' was the designation for the Airy 1849 reference ellipsoid. In R2011b this documentation error has been corrected. There is no Airy 1849 option in almanac, but if you need to you can construct an ellipsoid vector for the 1849 ellipsoid as follows:, 79888=The USGS retired the Seamless Server on July 31, 2012. Services have been moved to the National Map at 'nationalmap.gov'. Search for equivalent layers using the urlSearchString 'nationalmap.gov'., 173104=The usastatelo shapefile now contains average population density data by state for the year 2000 from the U.S. Census Bureau Web site., 204203=Before R2010a, the etopo function supported ETOPO2–2001 (2-minute) and ETOPO5 (5-minute) data. Support has been added for ETOPO2v2c (2-minute) and ETOPO1c (1-minute) data. The ETOPO1 model, released in March 2009, is the most recent and contains the highest resolution data. For information on downloading the ETOPO data sets, see Technical Note 2101: Accessing Geospatial Data on the Internet for the Mapping Toolbox on the Mathworks Web site., 187153=Many aspects of the fix to Bug 192285 apply to geoshow contouring options as well as to contourm. When applied to a data grid with the DisplayType parameter set to 'contour', geoshow now contours the grid in the same way that contourm would, constructs a handle to the same sort of hggroup, and accepts the same set of optional parameters (as documented on the contourm reference page)., 171682=Two new servers from the USGS dedicated to emergency operations. These servers provide imagery of the 2010 oil spill in the Gulf of Mexico:}",
    "textBeforeTable": "The geographic raster reference and map raster reference classes include new properties that describe the dimensions of cells or spacing between postings. The following table lists the properties in relation to the class types, coordinate system type, and key properties. Additional object properties for referencing images or data grids to geographic or planar coordinates You can navigate around a web map, using a mouse, or by using the wmlimits, wmcenter, and wmzoom functions. Interactive navigation and commands to control web map limits, center, and zoom level You can add geographic point markers and line overlays on a web map display using the wmmarker and wmline functions, and remove them using the wmremove function. Functions to add or remove geographic point marker and line overlays on a web map display The new webmap function displays map base layers obtained from Web servers located on the Internet in a browser window. Map base layers are either named layers, such as Open Street Map, World Terrain Base, or Ocean Basemap, or Web Map Service layers (WMSLayer). You can dynamically switch base",
    "textAfterTable": "These new properties are unsigned because the existing ColumnStartFrom and RowStartFrom properties already provide directional information. These new properties make the DeltaLat, DeltaLon, DeltaX, and DeltaY properties redundant. These older properties still exist but are hidden. The four new classes replace the two existing classes spatialref.GeoRasterReference and spatialref.MapRasterReference. georasterref, maprasterref, and worldfileread functions return new types The georasterref and maprasterref functions return new types of objects, depending on the value of the RasterInterpretation parameter. By default, if you do not specify this parameter, the functions return an object with the raster interpretation cells. The worldfileread function returns new types of objects, depending on the value of the coordinateSystemType parameter. The following table lists these classes. Function Type Returned When RasterInterpretation Is 'cells' Type Returned When RasterInterpretation Is 'postings' georasterref map.rasterref.GeographicCellsReference map.rasterref.GeographicPostingsReference maprasterref map.rasterref.MapCellsReference map.rasterref.MapPostingsReference worldfileread(___,'geographic',___) map.rasterref.GeographicCellsReference n/a worldfileread(___,'planar',___) map.rasterref.MapCellsReference n/a Compatibility Considerations It is no longer possible to set the RasterInterpretation",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}