{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus security is super awesome, and I definately feel safe on campus.",
            "Any club that you could hope for, and if there isnt one, start one!",
            "stuious, atheletes, anyone :)",
            "Since Drake is a private school, it is rather on the pricey side, but they offer very generous scholarships and it is DEFINATELY worth it.",
            "There are so many fun clubs and great people! There is a brand new workout facility, and since drake is in the middle of the Des Moines, just about anything that you would want is just a bus ride away! (free bus fare for students)",
            "Food is amazing!",
            "From what i have experienced at orientation, dorm life is so much fun! Everyone is eager to make friends and it is so easy to get a game of ultimate frisbe or soccer. :)",
            "Since i have not taken classes yet, im not sure of the rigor of the academics.",
            "Take a tour of the campus and talk to the faculty and I promise that you will fall in love with Drake university. GO BULLDOGS!",
            "The faculty is so helpful. They just renevated the entire campus and it is beautiful and inviting. I give it a 10/10."
        ]
    ],
    "pageTitle": "Drake University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Drake-University/reviews?_escaped_fragment_=/show/80708",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00288-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 877494651,
    "recordOffset": 877436887,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{70282=This is a great college for motivated students to attend. The people that I have met have been very kind and jun people. It is a very welcoming college and I would recommend it for anyone I know., 89816=Drake offers a bunch of different clubs and activities. There is an activities fair during the beginning of September where all of the clubs have a table set up and you can get any info on the club. The one thing about signing up for the clubs is that they never take you off their emailing list, so even if you do not join the club you will constantly get emails from the club, for all four years that you are here! Also there is a business fraternity and two pharmacy fraternities and many pre-prefessional clubs for those who want to make their resume look extra nice!, 225457=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/10/2009 Reviewer is A current student here. 30 out of 30 people found this review useful. 1 of 48 Kristin from Lockport, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. Drake University Reviews Drake University › Iowa › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck Drake is expensive. Then again, so is every other college. The main reason I picked Drake was because of the financial aid they gave me. It was substantially more than any other college I applied to. We also get more for our money. Drake really prepares you for the real world. Professors and advisers let you in on little hints that make life and job hunting so much easier! Drake is expensive, but they have excellent financial aid and it will be worth the loans upon graduation! Am enjoying being here I love Drake; coming here was one of the best decisions of my life. On the other hand, I know some of my friends don't like it as much as I do. My advice is check out the college a few times. The first time I visited campus I hated it. If I had written it off and not come back, I would be stuck at a college back home. The campus is great for studying and playing outside, and the city is just a short bus trip away. All around campus are tons of fun things to do and great places to explore. Am learning a lot You get out of Drake what you put",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}