{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is a very safe place. Our security officers are awesome, but they can get a little crazy when asking for your ID.",
            "There is no greek life at Moody.",
            "There aren't tons of clubs around, but there are quite a few. There are clubs that are for minority groups, for events, for ministries, for music, etc.",
            "Moody is a great place for students wanting to learn more about the bible. It also is a fantastic place for music students. Moody has a high standing with many churches, companies, and other various employers.",
            "Every spring, there is a flag pole-ing. If a guy gets engaged, he gets duck taped to the pole and then gets a trial. He then gets shaving cream dumped all over him and his fiance has to come kiss him to get him released.",
            "Moody is tuition paid. Basically, you only have to pay for room and board and the random fees they slap you with. But its honestly a blessing.",
            "Moody is located in downtown Chicago. There is always something to do in Chicago! Free concerts, the bean, coffee, walmart runs, etc.",
            "The SDR is not a great place to eat. Health wise, you have to be extremely aware of what you eat. The atmosphere is loud and it is hard to find someone to sit with other than your bro-sis table.",
            "Dorm life is pretty active. We have tons of events like football, parties, get together's, and we always spend time with each other in the lounge.",
            "Moody has great profs. Some are easier than others. You just have to test the waters or hear what other students have to say.",
            "I highly recommend a day one experience. We have them a few times a semester!",
            "Moody is a fantastic place for learning, stretching, growing, and finding life long friends. It does have a few down falls like no drinking or dancing. But the perks of the school like being tuition paid is so worth it!"
        ]
    ],
    "pageTitle": "Moody Bible Institute Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Moody-Bible-Institute/reviews?_escaped_fragment_=/show/88378",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00271-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896025279,
    "recordOffset": 895988116,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{23374=Tuition-PAID SCHOOL!!! Enough said! :) Look it up, I SWEAR it's true, Tuition is FREE-you only pay Room and Board. (Maximum of $2900 a semester), 138731=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "11/16/2011 Reviewer is A past student here. 5 out of 5 people found this review useful. 1 of 28 Ryan from Gilberts, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Share any unusual traditions or locations on campus buck buck... Bang for the buck $10,000-$12,000 per year What to do for fun chicago is a great city! so much to do! Food and Dining it's alright, not the best, but you can get by with it. Dorm Life culby 4! Academic Rigor academics are intense and demanding. Tips for prospective students work hard, study abroad. In three sentences great professors. great content. great opportunities. Login to rate or flag the reviews Arielle from Walworth, WI 05/14/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 28 Categories Comments",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}