{
    "relation": [
        [
            "Part #",
            "LCD-S401C52TR",
            "LCD-S401C71TR",
            "LCD-S301C31TR",
            "LCD-S401C39TR",
            "LCD-S401C39TR"
        ],
        [
            "Distributor",
            "Newark / element14",
            "Newark / element14",
            "Digi-Key",
            "Newark / element14",
            "Digi-Key"
        ],
        [
            "Manufacturer",
            "LUMEX",
            "LUMEX",
            "Lumex Opto/Components Inc",
            "LUMEX",
            "Lumex Opto/Components Inc"
        ],
        [
            "Product Category",
            "Not Provided",
            "Not Provided",
            "Optoelectronics",
            "Not Provided",
            "Optoelectronics"
        ],
        [
            "Description",
            "LUMEX - LCD-S401C52TR - NUMERIC LCD DISPLAY",
            "LUMEX - LCD-S401C71TR - NUMERIC LCD DISPLAY",
            "LCD 3 DIGIT .31\" REFLECTIVE TN",
            "LUMEX - LCD-S401C39TR - NUMERIC LCD DISPLAY",
            "LCD 4 DIGIT .39\" REFLECTIVE TN"
        ]
    ],
    "pageTitle": "Numeric Display Lcds | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/numeric_display_lcds",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00290-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 464834543,
    "recordOffset": 464806023,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{93841=Description: analyzer for alignment and diagnostics.. The 6103E has a bright LCD display with graphic and numeric displays. Easy to use, fully integrated Test Set optimized for maintenance and servicing of GSM 850, 900, 1800 and 1900 GPRS single slot receiver BLER Dual-Band Handover Modulation Analyzer, 87055=Description: The HB2800 series panel mount display utilizes state-of-the-art technology to provide exceptional flexibility at an affordable price. The HB2800 is capable of accepting a non-amplified low-level frequency input from Flo-tech’s Ultima and Classic turbine flow sensors to calculate both rate}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> More Information Top Indicates content that may require registration and/or purchase. Robot Builder's Bonanza, Fourth Edition > Interfacing Hardware with Your Microcontroller or Computer Using light-emitting diodes (LEDs), numeric displays , or liquid-crystal displays ( LCDs ), visual indicators help the robot communicate with you in direct ways. Digital visual acuity test using calculator-type numerals with geometric gradation. The authors have developed a visual acuity test using numeric optotypes with dimensions similar to numerals used in liquid crystal displays ( LCDs ) or light-emitting diodes (LEDs). Handbook of Visual Display Technology Thus, the first displays in mobile terminals were single-line numeric segment displays , based on simple twisted-nematic (TN) liquid-crystal displays ( LCDs ). The bases of the TV technology The line number usually allows to recognize the initial application target the computer screen by the LCDs . Integrated Roadmapping",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}