{
    "relation": [
        [
            "Patent application number",
            "20120223387",
            "20120223390",
            "20120267609",
            "20120292711",
            "20130105764",
            "20130181185",
            "20130200444",
            "20130207167",
            "20130207173",
            "20130277677",
            "20140054546",
            "20140145312",
            "20140145314",
            "20140291727",
            "20140291752"
        ],
        [
            "Description",
            "TUNNELING DEVICE AND METHOD FOR FORMING THE SAME - The present disclosure provides a tunneling device, which comprises: a substrate; a channel region formed in the substrate, and a source region and a drain region formed on two sides of the channel region; and a gate stack formed on the channel region and a first side wall and a second side wall formed on two sides of the gate stack, wherein the gate stack comprises: a first gate dielectric layer; at least a first gate electrode and a second gate electrode formed on the first gate dielectric layer; a second gate dielectric layer formed between the first gate electrode and the first side wall; and a third gate dielectric layer formed between the second gate electrode and the second side wall.",
            "TUNNELING FIELD EFFECT TRANSISTOR AND METHOD FOR FORMING THE SAME - The present disclosure provides a TFET, which comprises: a substrate; a channel region formed in the substrate, and a source region and a drain region formed on two sides of the channel region; a gate stack formed on the channel region, wherein the gate stack comprises: a gate dielectric layer, and at least a first gate electrode and a second gate electrode distributed in a direction from the source region to the drain region and formed on the gate dielectric layer, and the first gate electrode and the second gate electrode have different work functions; and a first side wall and a second side wall formed on a side of the first gate electrode and on a side of the second gate electrode respectively.",
            "COMPLEMENTARY TUNNELING FIELD EFFECT TRANSISTOR AND METHOD FOR FORMING THE SAME - A complementary tunneling field effect transistor and a method for forming the same are provided. The complementary tunneling field effect transistor comprises: a substrate; an insulating layer, formed on the substrate; a first semiconductor layer, formed on the insulating layer and comprising first and second doped regions; a first type TFET vertical structure formed on a first part of the first doped region and a second type TFET vertical structure formed on a first part of the second doped region, in which a second part of the first doped region is connected with a second part of the second doped region and a connecting portion between the second part of the first doped region and the second part of the second doped region is used as a drain output; and a U-shaped gate structure, formed between the first type TFET vertical structure and the second type TFET vertical structure.",
            "SEMICONDUCTOR STRUCTURE AND METHOD FOR FORMING THE SAME - A semiconductor structure is provided. The semiconductor structure comprises: a substrate; a gate dielectric layer formed on the substrate; a metal gate electrode layer formed on the gate dielectric layer; and at least one metal-containing adjusting layer for adjusting a work function of the semiconductor structure, in which an interfacial layer is formed between the substrate and the gate dielectric layer, and an energy of bond between a metal atom in the metal-containing adjusting layer and an oxygen atom is larger than that between an atom of materials forming the gate dielectric layer or the interfacial layer and an oxygen atom. Further, a method for forming the semiconductor structure is also provided.",
            "TUNNELING FIELD EFFECT TRANSISTOR STRUCTURE AND METHOD FOR FORMING THE SAME",
            "TUNNELING FIELD EFFECT TRANSISTOR AND METHOD FOR FABRICATING THE SAME - A tunneling field effect transistor and a method for fabricating the same are provided. The tunneling field effect transistor comprises: a semiconductor substrate and a drain layer formed in the semiconductor substrate, in which the drain layer is first type heavily doped; an epitaxial layer formed on the drain layer, with an isolation region formed in the epitaxial layer; a buried layer formed in the epitaxial layer, in which the buried layer is second type lightly doped; a source formed in the buried layer, in which the source is second type heavily doped; a gate dielectric layer formed on the epitaxial layer, and a gate formed on the gate dielectric layer; and a source metal contact layer formed on the source, and a drain metal contact layer formed under the drain layer.",
            "SCHOTTKY BARRIER FIELD EFFECT TRANSISTOR WITH CARBON-CONTAINING INSULATION LAYER AND METHOD FOR FABRICATING THE SAME - A Schottky barrier field effect transistor with a carbon-containing insulation layer and a method for fabricating the same are provided. The Schottky barrier field effect transistor comprises: a substrate; a gate stack formed on the substrate; a metal source and a metal drain formed in the substrate on both sides of the gate stack respectively; and the carbon-containing insulation layer formed between the substrate and the metal source and between the substrate and the metal drain respectively, in which a material of the carbon-containing insulation layer is organic molecular chains containing an alkyl group.",
            "TUNNELING FIELD EFFECT TRANSISTOR AND METHOD FOR FABRICATING THE SAME - A tunneling field effect transistor and a method for fabricating the same are provided. The tunneling field effect transistor comprises: a semiconductor substrate; a channel region formed in the semiconductor substrate, with one or more isolation structures formed in the channel region; a first buried layer and a second buried layer formed in the semiconductor substrate and located at both sides of the channel region respectively, the first buried layer being first type non-heavily-doped, and the second buried layer being second type non-heavily-doped; a source region and a drain region formed in the semiconductor substrate and located on the first buried layer and the second buried layer respectively; and a gate dielectric layer formed on the one or more isolation structures, and a gate formed on the gate dielectric layer.",
            "FLASH MEMORY AND METHOD FOR FABRICATING THE SAME - A flash memory and a method for fabricating the same are provided. The flash memory comprises: a semiconductor substrate; a storage medium layer formed on the semiconductor substrate and comprising from bottom to top: a tunneling oxide layer, a silicon nitride layer and a blocking oxide layer; a semiconductor layer formed on the storage medium layer and comprising a channel region and a source region and a drain region located on both sides of the channel region respectively; and a gate stack formed on the channel region and comprising a gate dielectric and a gateformed on the gate dielectric.",
            "METHOD FOR FORMING POLYCRYSTALLINE FILM, POLYCRYSTALLINE FILM AND THIN FILM TRANSISTOR FABRICATED FROM THE POLYCRYSTALLINE FILM - A method for forming a polycrystalline film, a polycrystalline film formed by the method and a thin film transistor fabricated from the polycrystalline film are provided. The method comprises the steps of: providing a substrate; forming a thermal conductor layer on the substrate; etching the thermal conductor layer until the substrate is exposed to form a thermal conductor pattern; forming a seed layer on the thermal conductor layer and the substrate; etching the seed layer to form seed crystals on both sidewalls of the thermal conductor; forming an amorphous layer on the substrate, the thermal conductor layer and the seed crystals; etching the amorphous layer; and recrystallizing the amorphous layer to form a polycrystalline layer.",
            "Dynamic Random Access Memory Unit And Method For Fabricating The Same - A dynamic random access memory unit and a method for fabricating the same are provided. The dynamic random access memory unit comprises: a substrate; an insulating buried layer formed on the substrate; a body region formed on the insulating buried layer and used as a charge storing region; two isolation regions formed on the body region, in which a semiconductor contact region is formed between the isolation regions and is a charge channel; a source, a drain and a channel region formed on the isolation regions and the semiconductor contact region respectively and constituting a transistor operating region which is partially separated from the charge storing region by the isolation regions and connected with the charge storing region via the charge channel; a gate dielectric layer formed on the transistor operating region, a gate formed on the gate dielectric layer; a source metal contact layer, a drain metal contact layer.",
            "SEMICONDUCTOR STRUCTURE WITH RARE EARTH OXIDE - A semiconductor structure with a rare earth oxide is provided. The semiconductor structure comprises: a semiconductor substrate (",
            "SEMICONDUCTOR STRUCTURE WITH BERYLLIUM OXIDE - A semiconductor structure with beryllium oxide is provided. The semiconductor structure comprises: a semiconductor substrate (",
            "METHOD FOR FORMING SEMICONDUCTOR GATE STRUCTURE AND SEMICONDUCTOR GATE STRUCTURE - A method for forming a semiconductor gate structure and a semiconductor gate structure are provided. The method includes: providing a substrate with a Ge layer as a surface thereof; forming a Sn layer on the Ge layer, in which an interface between the Ge layer and the Sn layer is a GeSn layer; removing the Sn layer to expose the GeSn layer; forming a GeSnO",
            "MEMORY STRUCTURE AND METHOD FOR FORMING SAME - A memory structure and a method for forming the same are provided. The memory structure comprises: a substrate; a plurality of channel structures formed on the substrate, in which the plurality of channel structures are parallel with each other, each channel structure comprises a plurality of single crystal semiconductor layers and a plurality of oxide layers alternately stacked in a direction perpendicular to the substrate, and at least one of the plurality of oxide layers is a single crystal oxide layer; and a plurality of gate structures matched with the plurality of channel structures, in which each gate structure comprises a gate dielectric layer immediately adjacent to the plurality of channel structures and a gate electrode layer immediately adjacent to the gate dielectric layer."
        ],
        [
            "Published",
            "09-06-2012",
            "09-06-2012",
            "10-25-2012",
            "11-22-2012",
            "05-02-2013",
            "07-18-2013",
            "08-08-2013",
            "08-15-2013",
            "08-15-2013",
            "10-24-2013",
            "02-27-2014",
            "05-29-2014",
            "05-29-2014",
            "10-02-2014",
            "10-02-2014"
        ]
    ],
    "pageTitle": "Liang, Beijing - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/liang-beijing-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00042-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 435136507,
    "recordOffset": 435078501,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{195849=Patent applications by Yuanjun Liang, Beijing CN}",
    "textBeforeTable": "Renrong Liang, Beijing CN //]]> BarDraw('3751229',['Patent applications by Qingqing Liang, Beijing CN'],[[8,26,3]],['2011','2012','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3751229\" align=\"center\"></div> </div> <canvas id=\"bg3751229\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Qingqing Liang, Beijing CN</p> <div class=\"bar3751229\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>09-19-2013</td> <td><a href=\"/patents/app/20130244393\">METHOD FOR MANUFACTURING SEMICONDUCTOR DEVICE</a> - A method of manufacturing a semiconductor device is provided, in which after forming a gate stack and a first spacer thereof, a second spacer and a third spacer are formed; and then an opening is formed between the first spacer and the third spacer by removing the second spacer. The range of the formation for the raised active area </td> <td>20130244393</td> <tr> </tr> <td>09-05-2013</td> <td><a href=\"/patents/app/20130228893\">TRENCH ISOLATION STRUCTURE AND METHOD FOR FORMING THE SAME</a> - A trench isolation structure and a method of forming the same are provided. The trench isolation structure includes: a semiconductor substrate, and trenches formed on the surface of the semiconductor substrate and filled with a dielectric layer, wherein the material of the dielectric layer is a crystalline material. By using the present invention, the size of the divot can be reduced, and device performances can be improved.</td> <td>20130228893</td> <tr> </tr> <td>05-09-2013</td> <td><a href=\"/patents/app/20130113025\">SEMICONDUCTOR DEVICE STRUCTURE AND METHOD FOR MANUFACTURING THE SAME</a> - The present invention provides a semiconductor device structure and a method for manufacturing the same. The method comprises: providing a semiconductor substrate, forming a first insulating layer on the surface of",
    "textAfterTable": "Patent applications by Renrong Liang, Beijing CN Shangrong Liang, Beijing CN Patent application number Description Published 20120105768 BACKLIGHT MODULE AND LIQUID CRYSTAL DISPLAY - A backlight module comprises a light source, a reflective plate, a light guiding plate and a back plate. The light source is provided on the light entering side of the light guiding plate, the reflective plate is arranged around the periphery of the light source, and the back plate is provided under the reflective plate and the light guiding plate. A first mating section is provided on the reflective plate, and a second mating section is provided on the back plate. The first mating section is mated with the second mating section to connect and fix the reflective plate to the back plate. A liquid crystal display comprising the backlight module is not deformed when it is subject to an instantaneous external force, thus insuring the interior space of the reflective plate. 05-03-2012 Shengbao Liang, Beijing CN Patent application number Description Published 20110235751 DATA TRANSMISSION DEVICE AND METHOD THEREOF, AND DATA RECEPTION DEVICE AND METHOD THEREOF - The present invention discloses a data transmission device and",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}