{
    "relation": [
        [
            "Amount",
            "1 whole",
            "2 tsp",
            "175 ml",
            "3-6 whole",
            "6 cloves"
        ],
        [
            "Ingredient",
            "egg",
            "lemon juice or vinegar",
            "olive oil",
            "canned Chipotles en adobo",
            "garlic"
        ],
        [
            "Preparation Method",
            "",
            "",
            "light preferred",
            "minced",
            "minced"
        ]
    ],
    "pageTitle": "Ugly Brothers BBQ: Sauce & Marinate Recipes",
    "title": "",
    "url": "http://www.uglybrothers.net/RECIPES/sauce.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00338-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 807183038,
    "recordOffset": 807167077,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{41061=Recipe By : Bud Ugly Preparation Time :0:10}",
    "lastModified": "Sat, 28 Jul 2012 07:39:46 GMT",
    "textBeforeTable": "  Recipe By : Bud Ugly Preparation Time :0:10 This is great as a veg dip or slathered on sausage sandwiches. Use it in place of mayonnaise on anything you would to add a kick to. Chipotle Aoili An original recipe by Bud Ugly   Combine all ingredients in a suacepan. Bring to a boil. Cool. Marinate pork or beef roast overnight. Reserve marinate for basting.   cayenne pepper 1 tsp   Hungarian paprika  1 tsp smashed garlic 2 cloves   cooking oil 1 cup apple cider vinegar 1 cup  classic   Coca-Cola  2 cups  Preparation Method  Ingredient  Amount In the South-East Coca-Cola has been a popular (somewhat) way to sweeten & tenderize meat. It may sound strange, and it is, but the results taste better than they sound. In Baja California Coca-Cola is also used often in the making of carnitas owing to the fact that sugar can be hard to find in some remote villages. The ubiquitous Coca-Cola however can be found in places you wouldn't imagine!",
    "textAfterTable": "Crack whole egg into bowl, add salt and lemon juice or vinegar and mix. Meanwhile mince chipotles, add to egg mixture. Using a blender, slowly stream in olive oil into mixture until it thickens. Refrigerate a few hours before using. Use within a week. Pablano Cream Sauce Source: Donna Deane, L.A. Times Excellent with grilled pork chops!  Amount  Ingredient  Preparation Method  4   pablano chiles   1 TBS butter   1 clove garlic minced 1/3 cup onion   chopped  1/2 cup chicken broth   1 cup whipping cream   salt     black pepper freshly ground Roast chiles over flame until blistered on all sides. Place in paper bag to sweat for about 10 minutes, this will make peeling easier. Peel, cut in half, removing seeds and stem. Dice two peppers and cut two in strips, set aside. Melt butter in skillet over medium flame. Add garlic and onion and saute until just brown, about 5 minutes. Stir in broth and cream. Bring",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}