{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "VERY! Hiram is accredited and looks awesome on your resume",
            "Go to the sport games! Whether or not if they win, its always a fun atmosphere with your peers around",
            "The salad bar is always a good place but it has different food everyday!",
            "The dorms are little. But if your not in it all the time it doesn't matter!",
            "Classes are hard if you don't try and work for it. All professors are willing to help!",
            "Its a fun campus so come prepared!",
            "Hiram is a small family-like campus. You walk to class and you know every face you pass. It's always nice to get a hey from everyone you see."
        ]
    ],
    "pageTitle": "Hiram College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Hiram-College/reviews?_escaped_fragment_=/show/104666",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00186-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 885491891,
    "recordOffset": 885455210,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{98983=Hiram College is a charming liberal arts college in Hiram Ohio. Hiram's highlights include a small yet diverse ethnic student body, a large study abroad program, and dedicated teachers who are fun and able to work with students on a 1:1 basis, due to the small classroom sizes., 126606=© 2015, Cappex.com, LLC, 448=A majority of Hiram students are first generation college students and that is something the college prides itself on. This is because when students graduates, which they will because the school has a ninety-five percent graduation rate, the whole family is moved by the experience. Also, this is a liberal arts college so it is along the lines of the movie, Accepted because Hiram is run by the students. Rather than the city making the college, the college makes the city in Hiram, OH. Also, this is a great time for any type of students because so many programs are offered and the college is expanding. In the last two-three years a new dorm has been created, an entrepreneurship, ethics, public leadership, and nursing program started, a new dinning hall, townhouses, an institution for public leadership, and additional parking so that all students can have cars. Before that a brand new athletic facility and art institute. All of these with out touching upon the buildings which have been remodeled and furnished. In 2009 when most schools were worried about cutting professors and cutting funds Hiram College listed all time high donations in the millions.}",
    "textBeforeTable": "01/05/2010 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 27 Corey from Ravenna, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Categories Comments Great for these types of students It is great for all sorts of learners. Whether you learn better listening, visually or through doing, there are many classes in which you can learn through. Hiram, wants to help develop a student. So if you are not the best student but you did well on your ACT and did community service, they work with you to help give you the best education you can have. Tips for prospective students If you are more of a country/rural kind of person this is great. It is a small community of people in Hiram and Hiram, while expanding, has an average of 1,100 students. If you are afraid of gaining the freshman 15, no worries, Hiram is on a hill and you have to walk up and down a hill. It really is not that bad, but it is great form of exercise. If you are worried about the fact you ate 2 hamburgers , a piece of cake and a ton of soft serve ice cream at our all you can dining hall , you will have other opportunities to walk it off and enjoy the beautiful campus. Bang for the buck My tuition is 36, 000 dollars. However, my financial aid package was 28, 000 dollars. That leaves room",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}