{
    "relation": [
        [
            "Feature Name",
            "LISP-ALT functionality",
            "Locator/ID Separation Protocol (LISP)"
        ],
        [
            "Releases",
            "5.2(3)",
            "5.2(1)"
        ],
        [
            "Feature Information",
            "This functionality is no longer required to configure other LISP features.",
            "This feature is introduced."
        ]
    ],
    "pageTitle": "Cisco Nexus 7000 Series NX-OS LISP Configuration Guide - Configuring Locator/ID Separation Protocol [Cisco Nexus 7000 Series Switches] - Cisco",
    "title": "Table 2 Feature History for LISP",
    "url": "http://www.cisco.com/c/en/us/td/docs/switches/datacenter/sw/nx-os/lisp/configuration/guide/b_NX-OS_LISP_Configuration_Guide/b_NX-OS_LISP_Configuration_Guide_chapter_01.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00321-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 367112419,
    "recordOffset": 367091757,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30809=Configures the maximum number of LISP map-cache entries allowed to be stored. By default, the LISP map-cache limit is 1000 entries.}",
    "textBeforeTable": "The following table shows the LISP licensing requirements: Licensing Requirements for LISP Proxy ETR (PETR)—This device is a LISP infrastructure device that allows IPv6 LISP sites without native IPv6 RLOC connectivity to reach LISP sites that only have IPv6 RLOC connectivity. In addition, the PETR can also be used to allow LISP sites with Unicast Reverse Path Forwarding (URPF) restrictions to reach non-LISP sites. Proxy ITR (PITR)—This device is a LISP infrastructure device that provides connectivity between non-LISP sites and LISP sites. A PITR advertises coarse-aggregate prefixes for the LISP EID namespace into the Internet, which attracts non-LISP traffic destined to LISP sites. The PITR then encapsulates and forwards this traffic to LISP sites. This process not only facilitates LISP/non-LISP internetworking but also allows LISP sites to see LISP ingress traffic engineering benefits from non-LISP traffic. The LISP internetworking devices are as follows: LISP Internetworking Devices Alternative Topology (ALT)—This is a logical topology and is deployed as part of the LISP Infrastructure to provide scalable EID prefix aggregation. Because the ALT is deployed as a dual-stack (IPv4 and IPv6) Border Gateway Protocol (BGP) over Generic Routing Encapsulation (GRE) tunnels, you can use ALT-only devices with basic router hardware or other off-the-shelf devices that can support BGP and GRE. Map Resolver (MR)—This device is deployed as a",
    "textAfterTable": "LISP has the following configuration guidelines and limitations: LISP requires the Cisco Nexus 7000 Series 32-Port, 10 Gigabit Ethernet (M1) module (N7K-M132XP-12 or N7K-M132XP-12L), with Electronic Programmable Logic Device (EPLD) version 186.008 or later. Use an Overlay Transport Virtualization (OTV) or another LAN extension mechanism to filter the HSRP hello messages across the data centers to create an active-active HSRP setup and provide egress path optimization for the data center hosts. Make sure that the HSRP group and the HSRP Virtual IP address in all data centers in the extended LAN are the same. Keeping the HSRP group number consistent across locations guarantees that the same MAC address is always used for the virtual first-hop gateway. LISP VM mobility across subnets requires that the same MAC address is configured across all HSRP groups that allow dynamic EIDs to roam. You must enable the Proxy Address Resolution Protocol (ARP) for the interfaces that have VM mobility enabled across subnets. LISP is not supported for F2 Series modules. Default Settings for LISP This table lists the default settings",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}