{
    "relation": [
        [
            "Part #",
            "PU-20EQUAD",
            "PU-40E",
            "PU-4E",
            "MCP3911",
            "MTD6505"
        ],
        [
            "Distributor",
            "Global Industrial",
            "Global Industrial",
            "Global Industrial",
            "Microchip Technology, Inc.",
            "Microchip Technology, Inc."
        ],
        [
            "Manufacturer",
            "Dart Control",
            "Dart Control",
            "Dart Control",
            "Microchip Technology, Inc.",
            "Microchip Technology, Inc."
        ],
        [
            "Product Category",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Not Provided"
        ],
        [
            "Description",
            "Hall-Effect Encoder / Speed Sensor 10 Ppr And Direction",
            "Hall-Effect Encoder / Speed Sensor 20 Ppr",
            "Hall-Effect Encoder / Speed Sensor 2 Ppr",
            ". The MCP3911 is capable of interfacing a large variety of voltage and current sensors including shunts, current transformers, Rogowski coils and Hall effect sensors. Two Synchronous Sampling 16/24-bit Resolution Delta-Sigma A/D Converters. 94.5 dB SINAD, -106.5 dBc Total Harmonic Distortion (THD...",
            "Drive, for high efficiency and low acoustic noise. Position Sensorless BLDC Drivers (No Hall-effect sensor required). Integrated Power Transistors. Supports 2V to 5.5V Power Supplies. Programming Resistor (RPROG) setting to fit motor constant (Km) range from 3.25 mV/Hz to 52 mV/Hz. Direction Control..."
        ]
    ],
    "pageTitle": "Hall Speed Sensors | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/hall_speed_sensors",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00217-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 463617647,
    "recordOffset": 463582517,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> Conduct Research Top Magnetic Field Sensors as Speed Monitors Magnetic field sensors are generally based on the magneto-resistive or Hall-principle. Compared to optical speed sensors, resolvers and precision potentiometers, magnetic field sensors do not contain movable parts, such as shafts, bearings, code disks or slip rings. An aspect allowing them Monitor Coal Feeder Conveyor Speeds for Precise Discharge The Electro- Sensors SA420 Signal Conditioner, 907XP Hall Effect Sensor and Split. Collar Pulser Wrap. can be used to modulate gravimetric conveyor shaft speed for precise coal discharge. No problem with noncontacting sensors Invensys Sensor Systems, El Paso, Tex., (Clarostat Div.) has developed a rotary Hall-effect position sensor, the HRS100, that cuts cost by integrating all compensation circuitry into a single factory-programmed sensor ASIC. Resistive potentiometers or \"pots \" have long been used for rotary position Position Sensors and Position-Sensing Instruments Position sensors include wide range of sensors, switches and technologies that are used to determine the placement, speed or movement, direction, and location of a given target. Linear position devices include cable extension, capacitive, eddy current, fiber optic, Hall effect, inductive, magneto Industrial encoder integrates bearing and",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}