{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "If you need help all you have to do is call the campus police and they will be there. The campus is lit up good at night, especially for those evening classes that get out after dark.",
            "There is almost always something that is happening on campus. You will most likely find a club that is something you enjoy. I am a member of the Spanish Club and it is a good time.",
            "You get an great education with fantastic professors for a low price.",
            "There are many things to do for fun. I just spend most of my time between my classes hanging out with friends.",
            "I am a vegan and there are not many options for food, at least not in the Lions Den. I have not been to the dining hall though. There are drinks that are reasonably priced.",
            "I do not live in the dorms.",
            "Most of your professors will help you outside of class if you ask for it. Some courses are challenging but as long as you show up for class everyday and pay attention you should be fine.",
            "The campus is small and therefore easy to get around. However, you do not want to take classes back to back at opposite ends of campus; you will always end up late.",
            "Most of the professors are amazing and willing to help you outside of class. It is not overly expensive. It has amazing programs."
        ]
    ],
    "pageTitle": "Missouri Southern State University (MSSU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Missouri-Southern-State-University/reviews?_escaped_fragment_=/show/84241",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00163-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898399855,
    "recordOffset": 898359694,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{182466=© 2015, Cappex.com, LLC, 39599=Joplin's really not a great place for attractions and entertainment, especially with the tornadoes that just went through. It's got the Boomtown Days festival in June, and nearby Carthage has it's Maple Leaf Festival in October, both of which are awesome to attend. Tulsa, Springfield, Branson, and Kansas City are only a few hours away, though., 10366=the food court just upgraded in 2012 by putting in a pizza hut express. overall the food is a little pricey.}",
    "textBeforeTable": "12/27/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 41 MSSU student Check out reviews left by other students or leave your own review. You could win a free scholarship. Missouri Southern State University Reviews Missouri Southern State University › Missouri › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Tips for prospective students MSSU isn't exactly tough, but it's best not to slack off either. Go to class, study however much you need to and you'll be fine. Bang for the buck MSSU is definitely a bargain compared to others in the state. Some classes are not amazing, but for the real academics one can be pretty confident in landing a competent teacher. Am enjoying being here I can't say MSSU was my first choice and I am planning on transferring. However, it has been nice staying home for an extra year. So far, my teachers have been pleasant and willing to help and the overall atmosphere is comfortable. Am learning a lot Being a freshman, some of my classes so far have been common sense type classes (e.g. Oral Communication and the freshman orientation class), but classes that had some real substance (e.g. Sociology, Newswriting, American Literature) were great classes and I did feel like I was learning. Login to rate or flag the reviews Austin from Seneca, MO 01/24/2012 Reviewer is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}