{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "Food and Dining",
            "In three sentences"
        ],
        [
            "Comments",
            "The sports teams usually win! The basketball team is good!",
            "Sometimes bands and local artists play music on the steps outside.",
            "Great subway!",
            "Great professors who work well with their students. Wonderful environment for students of all ages. Big and small classrooms for comfort"
        ]
    ],
    "pageTitle": "Eastfield College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Eastfield-College/reviews?_escaped_fragment_=/show/8261",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00037-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 887571623,
    "recordOffset": 887533710,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{164800=© 2015, Cappex.com, LLC, 28084=eastfield college is an amazing college because of the friendly staff and superior teaching skills from all of the professors. it was intense to see obama show up during 2011. for a community college i would rate eastfield college a five out of five., 15538=Although I only took 2 courses, I learned a lot in my British Lit. class and my English 1301 class, 96014=The teacher to student ratio is about 1:18. Teachers care for the students and do whatever poosible to see students succeed.}",
    "textBeforeTable": "02/08/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 43 Patrice from Lubbock, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Bang for the buck you get your money worth at eastfield. What to do for fun i spend time with my kids in my spare time because i don't have alot of free time. Food and Dining the food is ok but it can get very expensive. Dorm Life no dorms? Academic Rigor if you work hard and pay attention it is no reason why your gpa should go below a 3.0. Tips for prospective students if you are wanting to go to a 4 yr college and are not sure of your major or where you want to go. eastfield is the best place to start of and get you feet wet. In three sentences eastfield is a great school to start off. some prof. are very hands on and teach you things that you can use in everyday life. financial aide needs to do better with helping student pay for college. Login to rate or flag the reviews",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}