{
    "relation": [
        [
            "Version",
            "7.x-1.x-dev",
            "6.x-3.x-dev"
        ],
        [
            "Download",
            "tar.gz (16.48 KB) | zip (19.24 KB)",
            "tar.gz (12.78 KB) | zip (14.39 KB)"
        ],
        [
            "Date",
            "2013-Sep-30",
            "2013-Sep-30"
        ],
        [
            "Links",
            "Notes",
            "Notes"
        ]
    ],
    "pageTitle": "Module project | Drupal.org",
    "title": "",
    "url": "https://www.drupal.org/project/project_module?f[2]=im_vid_3%3A124",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00170-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892416011,
    "recordOffset": 892383253,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{75045=Allows administrators to set up parametrized breadcrumb trails for any node type. This allows CCK-style node types to have \"Home > User Blog > 2005 > January\" style breadcrumbs on the node view page itself, synchronizing cleanly with custom views or pathauto aliases. Breadcrumb visibility can be customized via a php snippet.}",
    "lastModified": "Thu, 30 Jul 2015 14:29:15 GMT",
    "textBeforeTable": "Recommended releases Downloads Administrative links are displayed in a CSS/JS-based menu at the top on all pages of your site. It not only contains regular menu items — tasks and actions are also included, enabling fast access to any administrative resource your Drupal site provides. Provides a theme-independent administration interface (aka. navigation, back-end). It's a helper for novice users coming from other CMS, a time-saver for site administrators, and useful for developers and site builders. January 12, 2007 at 2:40am sun on Posted by Administration menu Extend and customize Drupal functionality with contributed modules. If a module doesn't quite do what you want it to do, if you find a bug or have a suggestion, then join forces and help the module maintainer. Or, share your own by starting a new module. RelevancyTitleAuthorCreated dateLast releaseLast buildMost installed Sort by",
    "textAfterTable": "Other releases Version Download Date Links 6.x-3.0-alpha4 tar.gz (68.23 KB) | zip (103.97 KB) 2010-Mar-11 Notes Development releases Version Download Date Links 8.x-3.x-dev tar.gz (53.31 KB) | zip (67.64 KB) 2015-Mar-20 Notes 7.x-3.x-dev tar.gz (52.24 KB) | zip (62.72 KB) 2015-Mar-20 Notes 6.x-3.x-dev tar.gz (42.54 KB) | zip (51.46 KB) 2013-Sep-30",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}