{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "the campus is very safe. they have campus safety vehicles everywhere at the school.",
            "students looking to raise their gpa, dual enrolled students, and students getting their aa.",
            "there is no food at this college",
            "there are no dorms at this college",
            "the classes are small. the professors are friendly and willing to help.",
            "daytona state is a good college for students getting their aa. the professors are friendly and very willing to help. the campus is clean and safe."
        ]
    ],
    "pageTitle": "Daytona State College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Daytona-State-College/reviews?_escaped_fragment_=/show/67803",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903885503,
    "recordOffset": 903805905,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{309713=Daytona State definitely offers more bang for your buck. The tuition rates are slightly cheaper than your major colleges and universities (University of Florida, FSU, Stetson, etc...). With my Bright Futures Scholarship, my tuition and books average about $1000 per semester., 149618=I am so blessed to have received the education I did from DSC for the tuition I paid. Averaging around 1500/semester for a full 12 hour course credit load, it's worth it!, 102699=The security on campus is great. There are security guards on campus 24/7. This is especially great in the winter when it gets dark at 6:00 and you are still in class. The guards can be called at their station and they will escort you to your car. It makes the idea of night classes bearable., 82859=i love the english department at daytona state. i took enc1101 last semester with jessica kester and although her assignments were very challenging, i learned a lot from that class and would definitely recommend her. i'm also taking holy hollins for speech right now and i'm learning a lot in her class about public speaking as well. the math department is okay but i don't like their strict rules about certain calculators not being allowed. the algebra work is very challenging and i feel like those rules are setting people who aren't very good at math for failure., 42904=Well, this is one point where I have to say it was definitely worth it. I had a large chunk($500-$1000 a semester) of my tuition paid for. It was still kind of expensive, but nowhere near my college now., 451915=© 2015, Cappex.com, LLC, 316522=High rate of theft, high rate of vehicles being broken into and a few years ago a student was shot in killed in the parking lot - that made the news. In Fall 2012 there was an attempted rape of a student during the day in the womens bathroom., 27125=Writing about Daytona State College is more difficult than I had first anticipated when I sat down to write this short essay. There are so many great things about this school that cramming every single detail into a certain length just seems too difficult! From the variety of campuses to choose from, to the small class sizes and variety of understanding professors available, Daytona State definitely helped me to put myself on the right track in life. Even while I took online courses, I felt as though I had a one-on-one experience with my professor(s). There was truly never a dull moment in my life while enrolled in this college. When I had first enrolled in Daytona State in 2009, I felt a bit confused as to what major I should go into and what field of study I should focus on. The academic advisors as well as even my disability advisor and counselor helped me a lot with this. Eventually I settled into education and began volunteering and interning at Daytona Lakes Elementary. This was a very memorable experience and also one that helped me in my future as a teacher. To conclude my essay, Daytona State offers a variety of benefits and programs for those who seek it out. The staff and employees that work there are only interested in getting you to where you have to be in order to better yourself and your future. They try their hardest to help you if you need it, and if they see that you are struggling, they will gladly give a helping hand. Though I have written my best about this college and all it has to offer, this is certain – one must get a inside look of the campus for him or herself in order to full experience and believe anything I have said!}",
    "textBeforeTable": "06/26/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 9 out of 11 people found this review useful. 1 person found it offensive. 1 of 124 Janell from Deltona, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', });",
    "textAfterTable": "Am enjoying being here I love being here its a calm and quite campus. you can get your work done, with having any interruptions. Am learning a lot I learn a lot at this school, the teachers are very patient with the student, they explain the work step by step. Login to rate or flag the reviews Donna from Deltona, FL 03/12/2010 Reviewer is A current student here. 7 out of 7 people found this review useful. 3 of 124 Categories Comments Great for these types of students This school is great for anybody, and everybody. It has a special class, Fresh Start, for displaced home makers, that I encourage as a great place to start. They will help you figure out what you want to be when you grow up, and support you every step of the way. Tips for prospective students Just make the decision to go to school, and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}