{
    "relation": [
        [
            "Size:",
            "Brand:",
            ""
        ],
        [
            "S",
            "Majestic",
            ""
        ],
        [
            "Design:",
            "Main Colour:",
            ""
        ],
        [
            "Basic",
            "Blue",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ie/itm/MLB-Majestic-Dodges-T-Shirt-Men-Top-Size-S-/191156912305?pt=UK_Men_s_T_Shirts&hash=item2c81d700b1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00075-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 413435011,
    "recordOffset": 413394652,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "“Welcome. All these items are unique and almost impossible to find similar in the whole world. That's why you will be the one and only. Unique. I will do my best to help you in any problem. Your item are in warm conditions. In my special room. Also I am packing items with love. During packing process in my house playing lovely chill music I am drinking tea and giving my best energy to your item through my hands. It's like dream. Be sure, that your item will be packed to excellent parcel with bubbles, so I am making it as much safe as I can. I am not a robot. You can always contact me and ask how I am or what kind of shoes I prefer wearing. Together we will make world better place to live. With Love, Rymka1” Seller notes: See all condition definitions- opens in a new window or tab An item that has been previously worn. See the seller’s listing for full details and description of any imperfections. Used : Condition: Item specifics Seller assumes all responsibility for this listing.",
    "textAfterTable": "Measurements: From armpit to armpit 46 cm 18 inches Centre back length 65 cm 25.5 inches Just a few notes before buying: 1. Check item pictures. You will get what you see. 2. You can ASK for measurements if you don't know if it fit you well. I will do my best to help you. 3. Shipping discount: Each additional item MINUS 1.5 GBP from final shipping price. (for example, 3 items = 6 GBP + 4.5 GBP + 4.5 GBP = 15 GBP FOR SHIPPING) If you",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}