{
    "relation": [
        [
            "Patent application number",
            "20120225098",
            "20120263644"
        ],
        [
            "Description",
            "BIOFILM INHIBITING COMPOSITION - Polysaccharide-containing extracts isolated from a host cell containing nucleotide sequences encoding genes pamA, pamB and pamC, wherein the extract is capable of inhibiting biofilm formation produced by gram-negative bacteria, gram-positive bacteria and fungi, and methods to inhibit biofilm formation or remove biofilms that have already formed.",
            "TREATMENT AND DIAGNOSIS OF INFLAMMATORY DISORDERS AND HIV - This invention concerns compositions and methods of treating or diagnosing inflammatory disorders and other disorders, as well as compositions and methods of treating HIV."
        ],
        [
            "Published",
            "09-06-2012",
            "10-18-2012"
        ]
    ],
    "pageTitle": "Scott C. - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/scott-c-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00082-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 436921967,
    "recordOffset": 436894110,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Scott C. Kachlany, Bridgewater, NJ US 01-30-2014 POULTRY INJECTION APPARATUS AND METHODS - Injection apparatus and methods of positioning an injection needle in an injection apparatus are described herein. The injection apparatus may include one or more axes of rotation. The injection apparatus may include an injection unit attached to a support assembly that moves between a rearward position and a forward position, with the injection unit attached to the support such that it rotates relative to the support assembly about an injection unit axis. 20140031790 Published Description Patent application number Scott C. Johnson, Blomkest, MN US 10-28-2010 POWER OK DISTRIBUTION FOR MULTI-VOLTAGE CHIPS - A method and apparatus for powering up an integrated circuit (IC). An IC includes a plurality of power domains each coupled to receive power from one of a plurality of power sources. Each power domain includes a power-sensing unit. A power-sensing unit in a first one of the plurality of power domains is coupled to receive a first power ok signal from an upstream power domain, and is configured to assert a second power ok signal to be provided to a second power domain. A power-sensing unit in the second power domain is coupled to detect the presence of voltage in the first power domain, and to receive the first power ok signal. When the power-sensing unit in the second power domain has both sensed the presence of power in",
    "textAfterTable": "Scott C. Labrozzi, Cary, NC US Patent application number Description Published 20110235703 Stream Synchronization for Live Video Encoding - Methods of encoding a live video signal in a video encoding system including a plurality of video capture and encoding subsystems include providing the live video signal and an associated time code signal to the plurality of video capture and encoding subsystems, starting video capture and encoding in a first one of the subsystems at a first frame of the live video signal, starting video capture and encoding in a second one of the subsystems at a second frame of the live video signal that is later than the first frame, generating encode frame timestamps for the second frame in both the first and second video capture and encoding subsystems that are synchronized across the first and second subsystems, and associating the encode frame timestamp with the second frame in both the first and second subsystems. Related systems are also disclosed. 09-29-2011 20120128061 DYNAMIC TIME SYNCHRONIZATION - A method is provided in certain example embodiments and may include evaluating a first video stream being encoded by a first encoding element, where the first video stream is provided at a first bit rate. The method may also include evaluating a second video stream being encoded by a second encoding element, where the second video stream is provided at a second bit rate. The method may further include providing an output",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}