{
    "relation": [
        [
            "1-yr",
            "0.453",
            "(0.050)"
        ],
        [
            "2-yr",
            "0.669",
            "(0.108)"
        ],
        [
            "3-yr",
            "0.791",
            "(0.028)"
        ],
        [
            "4-yr",
            "0.894",
            "(0.253)"
        ],
        [
            "5-yr",
            "0.959",
            "(0.056)"
        ],
        [
            "7-yr",
            "1.037",
            "(0.039)"
        ],
        [
            "10-yr",
            "1.093",
            "(0.177)"
        ]
    ],
    "pageTitle": "FRB: Finance and Economics Discussion Series: Screen Reader Version - Evolving Macroeconomic Perceptions and the Term Structure of Interest Rates*",
    "title": "Table 3: Parameter Estimates: Model FC, Part 3: Standard Deviation of Measurement Errors of Yields",
    "url": "http://www.federalreserve.gov/pubs/feds/2010/201001/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00340-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 431234735,
    "recordOffset": 431193515,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{22749=The parameter estimates of the resulting model, Model TVC-L, are reported in Table 11. The yield fitting errors are much smaller compared to the corresponding model without a latent factor, Model TVC, with the RMSE 40% lower at the 10-year maturity. This improvement can also be seen from the top two panels of Figure 10, which shows much smaller discrepancies between model-implied and realized yields at both the 2-year and the 10-year maturities. This better fit has to come through the term premium channel, as the perceived short rate process in this model is identical to that in Model TVC at each point in time. The bottom panel of Figure 10 plots the 2-year and 10-year term premiums. A comparison of these and the corresponding series implied by Model TVC, shown in the top right panel of Figure 8, shows that term premiums exhibit more high-frequency variations in this model, while their rise in the early 1980's and the subsequent decline assume a smaller magnitude. The 10-year term premium appears to be lower after 1985, when it fluctuates around 50 basis points, than before 1980, when it fluctuates around 150 basis points. The price of risk parameters, , loads positively and significantly on the latent factor for inflation and nominal short rate shocks, as shown in Table 11, implying that a more positive latent factor leads to a more negative price on inflation and nominal short rate risks and reduce the term premium. On the other hand, the loading of the price of real GDP growth risks on the latent factor is not significantly different from zero.}",
    "TableContextTimeStampAfterTable": "{92197=Cogley, T. and Sargent, T. J. (2002). Evolving post-world war II u.s. inflation dynamics. In Bernanke, B. S. and Rogoff, K., editors, NBER Macroecononic Annual 2001, volume 16, pages 331-373. MIT Press, Boston., 48918=Similarly, in the late 1980's, this model generates implied yields that are too high compared to the realized data, and overstates the subsequent decline in 10-year yield forecasts 5- to 10-year ahead when compared to the Blue Chip survey forecasts (Figure 5). During this period, the 3-month short rate is expected to revert to its unconditional mean of about 8.5% from a level of around 5%, which pushes up the EH component of 10-year yield, while the model-implied term premium is largely unchanged around that time. In comparison, Model TVC-S implies that the short rate is expected to mean-revert at a slower pace in early 1987 than in the previous period, leading to a slightly lower EH component. More importantly, both Model TVC and Model TVC-S imply that volatilities of real GDP growth shocks are revised down during this period, leading to a large reduction in the model-implied term premium in late 1980's., 41759=Due to the persistent nature of interest rates, a stationary term structure model most likely will generate a long-term interest rate forecast in the near future that is close to its current value. Therefore, the top left panel of Figure 7 exhibits roughly the same pattern as seen in the top left panel of Figure 4: the ten-year yield as implied by Model FC lies below (above) its realized level in late 1980's (1990's) and is predicted to rise quickly since 2004 rather than fluctuating around the same level as seen in the data. The model-implied 10-year yield also bears too much similarity to the short rate. Comparing the red solid line and the red dashed line shows that the lower level of model-implied yields in the late 1980's largely reflects the expectation that the short rate will trend down and revert back to its lower long-term mean during the next ten years. On the other hand, Models TVC (top right panel) and TVC-S (bottom left panel) imply that the long-term mean of the short rate has shifted higher during this period, which pushes up the EH component and the total level of the long-term yield., 37765=Figure 4 looks at model predictions for long-term interest rates in more details. The top left panel shows that Model FC consistently under-predicts the 10-year yield one year hence for much of the 1980's and almost completely misses the second spike in long yields around 1984. More recently, the model generates forecasts that lies consistently above future realized value throughout the late 1990's and predicts that the 10-year yield will rise quickly above 7% since the last monetary tightening cycle started in 2004, a trend that is absent both in the realized data and in SPF forecasts. In contrast, the top right and the bottom left panels show that Models TVC and TVC-S generate forecasts that correspond generally better with future realized values in all three cases and also with SPF forecasts in the last episode., 32246=Figure 2 plots the unconditional mean, shock volatility and persistence of the VAR variables as implied by the three models. Results based on Model FC are plotted in the blue lines and are constant over time. Results based on Models TVC and TVC-S (the red and green lines) are identical prior to 1986 and close to each other thereafter, and can exhibit sizable time variations. The top panels plots the unconditional means of the macro variables. As can be seen from the red lines, variations in the unconditional mean are more notable for inflation and the short rate, whose implied means rose from around 4% in early 1970's to about 7 % and 10%, respectively, in 1983, before declining to their current respective levels of about 1.5% and 4%. The middle panels plot the volatilities of shocks to these variables. The red and the green lines show that real GDP growth and short rate shocks exhibit more variations in their conditional volatilities, which have been on a downward path since mid 1980's, roughly coinciding with what is usually referred as the \"Great Moderation.\" In comparison, inflation shock volatilities fluctuate within a relatively narrow band during the entire sample period. The bottom panels plot the first-order autocorrelation coefficient of each variable.7 Generally speaking, real GDP growth and inflation are less persistent today than in the 70's and 80's, while the persistence of the short rate is relatively unchanged., 47709=The main implications of this model are shown in the bottom left panels of Figures 3 to 8. Here both inflation and the short rate slowly reverts to a time-varying mean that rises over time until around mid 1980s and then declines since then. As can be seen from Figures 3 and 4, the presence of these persistent yet time-varying asymptotes enables this model to capture most of the variations in long-horizon inflation expectations and long yield expectations since the corresponding SPF forecasts became available around 1980 and 1985, respectively. This model also fits two-year yield relatively well while attributing almost all the variations to the EH component, as can be seen from Figure 6. In addition, Figure 7 shows that it is able to capture the downward trend in the 10-year yields since early 1990s. Nevertheless, there are several episodes when this model provides a poor fit with the data. For example, it fails to match the magnitude of the two spikes in long yields during early and mid 1980s, as it by construction rules out the channel through which the rising volatilities of shocks to the real GDP growth and the nominal short rate lead the investors to demand a term premium., 58762=Median SPF forecasts of 3-month T-Bill rate, nominal and real GDP level, GDP deflator and 10-year T-Bond yields are also obtained from Federal Reserve Bank of Philadelphia. SPF forecasts are available starting from 1968Q4 for nominal GDP and GDP deflator, from 1981Q3 for real GDP and 3-month T-Bill rates, and from 1992Q1 for 10-year T-Bond yields. We fill in real GDP forecasts for the period of 1968Q4 to 1981Q2 using forecasts of nominal GDP and GDP deflator. Survey participants forecast the level of each variable for the preceding, the current and the next four quarters, which allow us to construct quarterly growth rate forecasts for real GDP and GDP deflator for the current and the following four quarters. We also use five- to ten-year ahead forecasts of real GDP growth, GDP deflator inflation, and yields of maturities 3 months, 2 and 10 years from Blue Chip Economic Indicators, available twice a year in February and September between 1986Q1 and 2006Q2.14, 92849=Gurkaynak, R. S., Sack, B., and Wright, J. H. (2006). The u.s. treasury yield curve: 1961 to the present. Finance and Economics Discussion Series 2006-28, Board of Governors of the Federal Reserve System., 43679=Figure 9 plots the impulse responses of 1-quarter, 1-year and 10-year yields to one standard deviation shocks to real GDP growth, inflation and the nominal short rate on three dates--1978Q1 and 1983Q1, two dates representing the periods immediately before and after the Volcker disinflation, and 2006Q2, the last data point in our sample--all based on Model TVC-S.9 Except for the negative yet imprecisely estimated contemporaneous response of the short rate, yields of all maturities respond to inflation shocks more strongly at the end of 1983 than in early 1978 or early 2006, consistent with the empirical evidence that the Fed combats inflation more vigorously post 1982.10 Shocks to the short rate also have the biggest effect on yields in late 1983, mainly reflecting a larger volatility of short rate shocks and a resulting larger term premium associated with short rate shocks during that period. In comparison, monetary policy during the most recent period is characterized by a response to real GDP growth shocks more aggressive than in previous periods., 94898=Piazzesi, M. and Schneider, M. (2006). Equilibrium yield curves. In NBER Macroeconomics Annual 2006. MIT Press, Boston., 94203=Orphanides, A. and Williams, J. C. (2005a). The decline of activist stabilization policy: Natural rate misperceptions, learning, and expectations. Journal of Economic Dynamics and Control, 29(11):1927-1950., 40475=Turning to forecasting longer-term yields out of sample, Panel B shows that Model TVC outperforms model FC for maturities of five years and beyond and for horizons above one year, with the RMSE 65% lower when predicting 10-year yield two years hence. Introducing survey information on macro variables post 1986 in Model TVC-S mostly improves on the model's ability to predict the shorter end of the yield curve at the expense of a slightly worse performance when forecasting the long end of the yield curve, although it continues to outperform Model FC for the 10-year bond maturity and at the two-year forecasting horizon.}",
    "lastModified": "Thu, 16 May 2013 13:05:38 GMT",
    "textBeforeTable": "Svensson, L. E. O. (1995). Estimating forward interest rates with the extended nelson & siegel method. Quarterly Review, Sveriges Riksbank, 3:13-26. Stock, J. H. and Watson, M. W. (2007). Why has inflation become harder to forecast? Journal of Money, Creditand Banking, 39(s1):3-33. Sargent, T. J. (1999). The Conquest of American Inflation. Princeton University Press, Princeton, N.J. Rudebusch, G. and Wu, T. (2004). A macro-finance model of the term structure, monetary policy, and the economy. Working Paper. Piazzesi, M. and Schneider, M. (2006). Equilibrium yield curves. In NBER Macroeconomics Annual 2006. MIT Press, Boston. Pennacchi, G. G. (1991). Identifying the dynamics of real interest rates and inflation: Evidence using survey data. The Review of Financial Studies, 4(1):53-86. Orphanides, A. and Williams, J. C. (2005b). Inflation scares and forecast-based monetary policy. Review of Economic Dynamics, 8(2):498-527. Orphanides, A. and Williams, J. C. (2005a). The decline of activist stabilization policy: Natural rate misperceptions, learning, and expectations. Journal of Economic Dynamics and Control, 29(11):1927-1950. Laubach, T., Tetlow, R. J., and Williams, J. C. (2007). Learning and the role of macroeconomic factors in the term structure of interest rates. Working Paper. Kozicki, S. and Tinsley, P. A. (2001b). Term structure views of monetary policy under alternative models of agent expectations. Journal of Economic Dynamics and Control, 25(1-2):149-184. Kozicki, S. and Tinsley, P. A. (2001a). Shifting endpoints in the term structure of interest rates. Journal of",
    "textAfterTable": "(5.885) (-1.321) (4.385) (-0.513)       (2) 0.008 -1.322     1.075 0.105 0.07 (2), t-statistic (3.011) (-1.988)     (1.323) (0.317)   (1) 0.001 0.108 0.013 0.766     0.73 (1), t-statistic (1.060) (2.728) (0.562) (15.672)       (2) 0.007 0.644     0.220 -0.526 0.39 (2), t-statistic (3.777) (1.533)     (0.428) (-2.513)   (1) 0.009 -0.318 0.228 -0.026     0.30 (1), t-statistic (8.406)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}