{
    "relation": [
        [
            "First Name",
            "Sara",
            "Camden"
        ],
        [
            "Last Name",
            "Glenn",
            "Toohey"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=13113C6C-DB6A-421F-A561-4CE069CA82C7&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00319-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 227051119,
    "recordOffset": 227041214,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12242=FY 2013 appropriations for the Dept of the Interior., 18268=General issues related to Toxic Substances Control Act (no bill number assigned); S. 1009 - Chemical Safety Improvement Act, all provisions; S 696 - Safe Chemicals Act of 2013, all provisions., 21079=Application for a presidential permit to build the KXL pipeline, no bill number; Discussion of Potential No Action Letter on Swap Dealer Registration; Issues related to DOI's Alaska specific OCS regulations; Issues related to the EU FQD Section 7a language assigning a higher default value to oil sands fuel; Issues related to Gas Electric Coordination; General issues related to oil and gas development on leases in the Gulf of Mexico, including regulatory and permit issues related to Gulf leases; General Arctic regulation and standards issues; General issues related to blow out preventers; General issues related to natural gas, including BLM regulation of natural gas production on Federal lands and the regulation of natural gas facilities under the Clean Air Act; General issues related to the Coast Guard; General offshore energy and safety issues; General offshore issues with field trip to Olympus TLP; H.R. 2217, Homeland Security Appropriations Act of 2014, specifically amendment to prevent funds from being made available to enforce section 526 of EISA 2007; H.R. 2265 - More Energy More Jobs Act, all provisions; Issues related to the implementation of finding from DOI's 60-day review of Shell's 2012 season; Issues related hydraulic fracturing, including TSCA Section 8(a) and 8(d) rulemakings on Hydraulic Fracturing industry ; Issues related to Crude Exports; Issues related to exploration and development of Alaska offshore oil and gas leases; Issues related to LNG exports; Issues related to the Usage of Natural Gas as a Transport Fuel; S. 1100 North American Alternative Fuels Act, all provisions to repeal Section 526 of EISA 2007; Pending EPA GHG NSPS guidance to states on regulating existing utilities under Section 111d of the Clean Air Act; Issues related to position limits and Bona Fide Hedge Exemptions; S. 630 - FAIR Act of 2013, all provisions; Issues related to interest in offshore access (not specific to a permit or regulation)., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 41718=H.R. 1461 - Renewable Fuels Standard Elimination Act, all provisions; H.R. 1462 - RFS Reform Act of 2013, all provisions; H.R. 875 - To provide for a comprehensive assessment of the scientific and technical research on the implications of the use of mid-levelethanolblends and for other purposes; Issues related to LNG-in-transport and LNG exports; Issues related to sulfur content in Fuels and Tier 3 Rule; Issues related to the EPA approval of E15 fuel; Issues related to the Renewable Fuels Standard (no bill number assigned); S. 1195 - Renewable Fuels Standard Repeal Act, all provisions; S. 251 / H.R. 550 - Phantom Fuel Reform Act, all provisions; S. 344 - A bill to prohibit the Administrator of the Environmental Protection Agency from approving the introduction into commerce of gasoline that contains greater than 10-volume-percent ethanol, and for other purposes, all provisions; H.R. 1482 - Renewable Fuel Standards Amends Act, all provisions; Issues related to gas to liquids Corps of Engineers planning; Issues related to natural gas., 35384=CEA Reauthorization with specific reference to H.R. 634 - Business Risk Mitigation and Price Stabilization Act of 2013, H.R. 677, Inter-Affiliate Swap Clarification Act, H.R. 1003 - To improve consideration by the Commodity Futures Trading Commission of the costs and benefits of its regulations and orders, and H.R. 1256 - Swap Jurisdiction Certainty Act., 51814=Issues related to Alaska OCS air permitting and revenue sharing; Issues related to decommissioning, turning decommissioned platforms into artificial reefs; Issues related to Environmental Impact Studies related to oil and gas exploration in the US OCS; General issues related to National Ocean Policy, spatial planning, and ecosystems based management systems; General seismic, offshore access and resource potential issues; H.R. 2231 - Offshore Energy and Jobs Act, all provisions; Issues related to Marine Sound/Marine Mammals; Issues related to National Ocean Policy Final Implementation Plan; Issues related to OCS Access/5-Yr Plan; Issues related to OCS lease terms; Issues related to offshore safety; S. 1079 - Artificial Reef Promotion Act of 2013, all provisions., 46141=H.R. 888 - General Duty Clarification Act of 2013, all provisions; S. 68 - Secure Chemical Facilities Act, all provisions; Issues related to the Chemical Facilities Anti-Terrorism Standards.}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20001 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  BRIAN P. MALNAK  2024661410  brian.malnak@shell.com 5. Senate ID#  35092-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}