{
    "relation": [
        [
            "Cân Actol (Y.C.) Bl 6 ac iau (Ysg. dros 100) (356)",
            "Position: 1 Ysgol Pencae / Rh. Caerdydd a'r Fro",
            "Position: 2 Ysgol Gynradd Dolbadarn / Rh. Eryri",
            "Position: 3 Ysgol Cynwyd Sant / Rh. Morgannwg Ganol"
        ],
        [
            "18:30",
            "Video",
            "Video",
            "Video"
        ]
    ],
    "pageTitle": "Eisteddfod yr Urdd 2015",
    "title": "",
    "url": "http://www.s4c.cymru/urdd/c_index.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00065-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 685587048,
    "recordOffset": 685532883,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{695493=Mae Glain wedi hen arfer perfformio a chystadlu, yng Nghymru ac yn rhyngwladol. Mae eisoes wedi ennill Tlws y Telynor, Ysgoloriaeth Simms yr Urdd a'r Rhuban Glas Offerynnol yn Eisteddfod Genedlaethol Blaenau'r Cymoedd 2010. Yn yr un flwyddyn bu'n agos i'r brig yng nghystadleuaeth BBC Young Musician a'r Royal Overseas League. Mae hi bellach yn astudio ym Mhrifysgol Normale de Musique de Paris o dan hyfforddiant Isabelle Perrin. Yn ddiweddar ymddangosodd Glain fel aelod o Gerddorfa Ieuenctid Prydain yn y Proms yn Neuadd Albert., 694780=Ar nos Sul, Medi 25 2011 fe gipiodd Glain Dafydd Ysgoloriaeth Urdd Gobaith Cymru Bryn Terfel 2011 mewn cyngerdd gwefreiddiol a gynhaliwyd yn Stiwdio'r Ddraig, Pencoed ger Pen-y-bont ar Ogwr., 698401=Yn enedigol o Landudno, mae Elgan bellach yn fyfyriwr yng Ngholeg Cerdd Brenhinol y Gogledd ym Manceinion. Yno mae wedi profi llwyddiant gyda'i lais wrth iddo gipio gwobr 'Elsie Thurston' syin agored i fyfyrwyr y flwyddyn gyntaf ac o ganlyniad buin cynrychioli'r coleg yng nghystadleuaeth 'Kathleen Ferrier Bursary Award' ym mis Hydref 2009. Dyma'r tro cyntaf i Elgan gystadlu am Ysgoloriaeth Urdd Gobaith Cymru Bryn Terfel ac wedi iddo raddio, mae a'i fryd ar ddilyn cwrs ôl-radd yn y Guild Hall yn Llundain er mwyn llwyddo fel Tenor proffesiynol., 685277=Nos Sul, Hydref 12, 2014 fe gipiodd y ddawnswraig Enlli Parri o Gaerdydd Ysgoloriaeth Urdd Gobaith Cymru Bryn Terfel 2014 mewn noson wefreiddiol a gynhaliwyd yn Neuadd Fawr, Canolfan Celfyddydau Aberystwyth. Cyflwynwyd yr Ysgoloriaeth, gwerth £4,000 i Enlli yn y noson oedd yn fyw ar S4C ac yn benllanw ar weithgareddau'r Eisteddfod eleni., 688325=Nos Sul, Hydref 6, 2013 fe gipiodd y ffliwtydd Chloe Angharad Bradshaw Ysgoloriaeth Urdd Gobaith Cymru Bryn Terfel 2013 mewn noson wefreiddiol a gynhaliwyd yn Neuadd Fawr, Canolfan Celfyddydau Aberystwyth. Cyflwynwyd yr Ysgoloriaeth, gwerth £4,000 i Chloe yn y noson oedd yn fyw ar S4C ac yn benllanw ar weithgareddau'r Eisteddfod eleni., 691598=Ar nos Sul, Hydref 14, fe gipiodd y canwr Huw Ynyr Evans Ysgoloriaeth Urdd Gobaith Cymru Bryn Terfel 2012 mewn cyngerdd gwefreiddiol a gynhaliwyd yn Theatr y Stiwt, Rhosllannerchrugog. Cyflwynwyd yr Ysgoloriaeth, gwerth £4,000 i Huw gan Bryn Terfel yn y cyngerdd oedd yn fyw ar S4C ac yn benllanw ar weithgareddau'r Eisteddfod eleni., 706162=© 2012 S4C}",
    "textBeforeTable": "Video Ysgol Gymraeg Morswyn / Rh. Môn Position: 3 Video Ysgol Gynradd Chwilog / Rh. Eryri Position: 2 Video Ysgol Gynradd Llanfair D.C. / Rh. Dinbych Position: 1 16:45 Côr (Y.C.) Bl 6 ac iau (Ysg.hyd 150) (176) Video Ysgol Gynradd Gymraeg Garth Olwg / Rh. Morgannwg Ganol Elen Griffiths Position: 3 Video Ysgol Gynradd Llanddoged / Rh. Conwy Christopher Sabisky Position: 2 Video Ysgol Gynradd Llanrug / Rh. Eryri Nanw Haf Llwyd Position: 1",
    "textAfterTable": "Dydd Mawrth Dydd Mawrth Cerddorfa/Band Bl.6 ac iau (213) 08:00 Position: 1 Ysgol Gynradd Bontnewydd / Rh. Eryri Video Position: 2 Ysgol Gymraeg Aberystwyth / Rh. Ceredigion Video Position: 3 Ysgol Gynradd Llanfairpwll / Rh. Môn Video Llefaru Unigol Bl 5 a 6 (288) 11:00 Position: 1 Jac O. G. Williams Ysgol Gynradd Twm o'r Nant / Rh. Dinbych Video Position: 2 Deio Gwilym Williams Ysgol Gynradd Bro Gwydir / Rh. Conwy Video",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}