{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "For fun I like to go to the Lady Cobra's Basketball games. They are ok, but it's not about how many games you won, it's about having a good time at the end.",
            "Parkland has a wonderful Cafe'. I go there a lot when I get out of class, it's a great pick me up. I especially like the little sub sandwiches they have!",
            "The teachers are very friendly. On another hand they are also strict when it comes down to doing work. They want the work to be proficient and on time, but they will help you if you ask for it.",
            "For future students, I recommend that you do not slack your Freshman year. It is the hardest year and has the highest drop out rate. Stay focused on school and maybe work, and leave the partying for another time.",
            "Parkland College is a great college. It is one of the top Community Colleges in state of Illinois. I am proud to be a Parkland Cobra!"
        ]
    ],
    "pageTitle": "Parkland College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Parkland-College/reviews?_escaped_fragment_=/show/38140",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00193-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895953500,
    "recordOffset": 895913927,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{161186=© 2015, Cappex.com, LLC, 60140=Tuition for one semester is about $1600 for a full time student. Most students get financial aid and also scholarship. Students get a great education for a very chap price., 14299=There isn't any dorms since it is a community college, however, in the Fall of 2012, there will be Parkland apartments provided for Parkland students that have applied from different states or faraway cities/towns. It's cheap, efficient and a safe place to live at, and have great transportation (bus stops) to travel to Campus Town or to other parts of Champaign-Urbana., 76816=There are no dorms at Parkland College. It is a commuter campus, with several choices of apartments and town homes in the immediate area. A brand-new apartment complex will be completed for the Fall 2012 school year., 121153=This is a dysfunctional school. I have been planning to attend since April, it's now August. I had to drive 200 miles to take a compass exam, pay for it,and all of the other hoops and they cancelled the program 1 week before it started.}",
    "textBeforeTable": "06/13/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 40 Sheena from Champaign, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Tips for prospective students For any college student it's important to remember to put yourself out there. The college experience is only what you make of it, so enjoy it while you can! Bang for the buck While college is financially frustrating at any institution, Parkland helps in the sense that it's not quite so overwhelming and impossible for families to find a way to manage the payments. The required books and materials for classes can be pretty expensive. However, after the initial shock of the college payments in general, it's easily understood that Parkland is the most financially wise decision for prospective freshman and sophomores to take before upgrading to a much more expensive 4-year university. Am enjoying being here College is a very big step, but Parkland makes it an easy transition from high school. The campus seems very intimidating at first, but there are signs to point any lost freshman in the direction in which they need to go. Not only is the campus laid out in a very common-sense matter, but the first day of each semester you can find a staff member almost anywhere wearing a shirt that says Ask me, I'll tell you where to go. The comfort in the friendly staff and smaller building helps ease any freshman of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}