{
    "relation": [
        [
            "Language",
            "Japanese",
            "Japanese",
            "English",
            "Japanese",
            "Japanese"
        ],
        [
            "Description",
            "Crypton Future Media Inc. official homepage",
            "MEIKO V3 product page",
            "deviantArt , art and media community",
            "Pixiv , art and media community",
            "Piapro , art and media community"
        ],
        [
            "Site",
            "Link",
            "Link",
            "Link",
            "Link",
            "Link"
        ]
    ],
    "pageTitle": "MEIKO - Vocaloid Wiki - Voice synthesizer",
    "title": "",
    "url": "http://vocaloid.wikia.com/wiki/Meiko",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00306-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 249081227,
    "recordOffset": 249040430,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{52078=By 2010, whereas KAITO appeared in the Crypton ranking of their best-selling products, MEIKO had fallen from popularity, receiving the least amount of attention of the Crypton VOCALOIDs. In the same year, MEIKO was ranked as the 7th most popular VOCALOID product they sold and the least popular of Crypton Future Media's own VOCALOIDs.[15] On December 10th, 2011, MEIKO, along with the Kagamines' append, were the only VOCALOID software packages not on the top ten list., 43530=An independent search on Nico Nico Douga revealed that most VOCALOIDs had less then 1,000 videos uploaded to the site in 2011 between July 1st and December 15th. MEIKO, however, did manage to be the 2nd most popular VOCALOID when a mean count was done, with 423 views and 21 mylists.[18], 101746=MEIKO is a Japanese VOCALOID originally developed by Yamaha Corporation and distributed by Crypton Future Media, Inc. She was initially released in November 2004 for the first VOCALOID engine. There has since been a second instalment developed for the VOCALOID3 engine, dubbed MEIKO V3. Her voice is provided by the Japanese female singer, Meiko Haigō (拝郷 メイコ Haigō Meiko)., 43161=In 2015 a survey was made based on the popularity of Vocaloids on the website Nico Video. For the year 2014, Meiko was the 9th most popular Vocaloid.[19], 51526=A month after Meiko V3's release, Meiko took the number one spot on the charts. This was the first time Meiko had ever held a spot in the top 10 since the charts began. However, her no.1 spot was short lived, and by April she had dropped to the no.3 spot. This was a much faster fall from no.1 then KAITO V3, who managed to stay in the position for several months after release. Meiko soon fell behind KAITO V3 in popularity, constantly being one or two places behind his package. By August 2014, MEIKO V3 was in 6th spot, while KAITO V3 held the 3rd place position, loosing out only to Hatsune Miku V3 who claimed the no.1 and no.2 spot in the ranking. She also lost out this particular month to the Kagamine Rin\\Len VOCALOID2 package, which had temporarily returned to the rankings., 56024=Crypton Future Media VOCALOIDs have also appeared in 2013 calendars.[9][10], 55519=An official wig was also shown in 2014.[12]}",
    "lastModified": "Tue, 28 Jul 2015 23:20:40 GMT",
    "textBeforeTable": "External linksEdit ↑ [7] Nico Pedia: 白虎野の娘 (Byakkoya no Musume) ↑ link ↑ link ↑ link ↑ link ↑ link ↑ AR Vocaloid Walk ↑ link ↑ link ↑ link ↑ link ↑ link ↑ link ↑ link ↑ [6] P-Tina.net - KEIさんの描き方について聞いてみた (Interview with KEI about drawing style) ↑ [5] Nico Pedia: ワンカップp ↑ [4] Morio Morito Blog - MEIKOとKAITOのパケ絵描いた人について+α \"Illustrators that illustrated Meiko and Kaito\" ↑ [3] Meiko Haigou's official web site",
    "textAfterTable": "Navigation v  •  d  •  e Crypton Future Media Vocalists MEIKO • KAITO • Hatsune Miku • Kagamine Rin & Len • Megurine Luka VOCALOID1 MEIKO • KAITO VOCALOID2 Hatsune Miku ( Append) • Kagamine Rin \\ Len ( Act2, Append) • Megurine Luka VOCALOID3 KAITO V3 • Hatsune Miku V3 English ( V3, Append) •",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}