{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Share any unusual traditions or locations on campus",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Security is always around and it feels comfortable to walk to your car even after night classes.",
            "They always have something fun happening in the Cougar Grille and celebrate holidays in style with all sorts of fun activities available.",
            "The Cougar Grille is a little tiny and people sit there whether they are eating or not but if you do get the chance to sit down and eat a meal it is comfortable and the food is good. Get the pizza!!!!",
            "There are no on campus dorms at this facility.",
            "Use your resources that are available to you. Use the counseling office and find out who your advisor is and talk to them on a regular basis.",
            "FCC has a great selection of classes to choose from. They help you figure out what you want to do with your life and set you on a complete track to obtain a degree."
        ]
    ],
    "pageTitle": "Frederick Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Frederick-Community-College/reviews?_escaped_fragment_=/show/73174",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894838091,
    "recordOffset": 894801729,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{82291=I don't know yet. I have been accepted to the nursing program, and I start in January. I am pretty certain it will be a 5 in academic rigor though., 150305=© 2015, Cappex.com, LLC, 63495=PRIDE PROM!!! If you aren't alerted not then be prepared for my favorite and most anticipated event of the year. Pride prom every May where you can be FREE to be, dress, act, and dance how you want without judgement and the admission is approximately 1/4 that of other schools proms.}",
    "textBeforeTable": "06/07/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 2 out of 2 people found this review useful. 1 of 35 Courtney from Clinton, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ }",
    "textAfterTable": "In three sentences Affordable Valuable Education Knowledgeable Professors Login to rate or flag the reviews Alyssa from Frederick, MD 10/14/2010 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 35 Categories Comments Great for these types of students FCC is great for students who have not yet decided what they would like to major in. You can complete a general studies program which allows you to take all different classes until you decide what is best for you! Bang for the buck FCC is a great way to start your college career. I am saving thousands of dollars by getting my core classes out of the way here! Am enjoying being here There is so much to do on campus, and so many clubs that allow students to get involved. I am having a lot of fun! Am learning a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}