{
    "relation": [
        [
            "Project Details",
            "Translation Volume: 5020 words Completed: Mar 2008 Languages: English to Chinese",
            "Translation Volume: 7300 words Completed: Mar 2008 Languages: English to Chinese",
            "Translation Volume: 243000 words Completed: Feb 2008 Languages: English to Chinese",
            "Translation Volume: 80000 words Completed: Feb 2008 Languages: English to Chinese",
            "Translation Volume: 16000 words Completed: Sep 2007 Languages: Chinese to English",
            "Translation Volume: 171000 words Completed: Feb 2007 Languages: Chinese to English",
            "Translation Volume: 150000 words Completed: Mar 2006 Languages: Chinese to English"
        ],
        [
            "Project Summary",
            "“Company Profile” for Philips after its reorganization in Jan.2008 Business/Commerce (general), Human Resources, Marketing / Market Research",
            "BEC Brochure Environment & Ecology, Marketing / Market Research",
            "P&H Mining Equipment e-Learning Program Automotive / Cars & Trucks, Electronics / Elect Eng, Mechanics / Mech Engineering",
            "Localization of Industrial Scientific website into Chinese Electronics / Elect Eng, Marketing / Market Research, Mechanics / Mech Engineering",
            "“Full-time Course Version 01” for Hong Kong Hospitality Industry Education / Pedagogy",
            "China Real Estate Report 2006 Real Estate",
            "Product (UPS & motor drive) manuals for Emerson Network Power Electronics / Elect Eng"
        ],
        [
            "Corroboration",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment."
        ]
    ],
    "pageTitle": "Jason Young - Professional Chinese translator - English to Chinese - Marketing, Tourism, IT, Engineering, Management",
    "title": "",
    "url": "http://www.proz.com/profile/814660?show_mode=project_history&filter=disc&fil_value=4&cor=true",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00158-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 658422395,
    "recordOffset": 658371029,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "7 projects entered Project History PRO-level points: 363, Questions answered: 334, Questions asked: 61 KudoZ activity (PRO) USD Preferred currency Chinese to English - Standard rate: 0.10 USD per word / 30 USD per hour English to Chinese - Standard rate: 0.10 USD per word / 30 USD per hour Rates Less More Manufacturing Idioms / Maxims / Sayings Names (personal, company) Slang Telecom(munications) Social Science, Sociology, Ethics, etc. Medical (general)",
    "textAfterTable": "More Less Portfolio Sample translations submitted: 9   English to Chinese: 1st Annual ProZ.com Translation Contest - Entry #7292 Source text - English Heathrow Airport is one of the few places in England you can be sure of seeing a gun. These guns are carried by policemen in short-sleeved shirts and black flak-jackets, alert for terrorists about to blow up Tie-Rack. They are unlikely to confront me directly, but if they do I shall tell them the truth. I shall state my business. I’m planning to stop at Heathrow Airport until I see someone I know. (...) Astonishingly, I wait for thirty-nine minutes and don’t see one person I know. Not one, and no-one knows me. I’m as anonymous as the drivers with their universal name-cards (some surnames I know), except the drivers are better dressed. Since the kids, whatever I wear looks like pyjamas. Coats, shirts, T-shirts, jeans, suits; like slept-in pyjamas. (...) I hear myself thinking about all the people I",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}