{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "clubs and activities. they usually have fun carnival sorda like things to do.",
            "you'll like this school. its not that big so you dont feel overwhelmed and the classes are small so its a good thing to concentrate better.",
            "moraine valley is a really good school. i only wish it was a university because everything about it seems comfortable and not overwhelming."
        ]
    ],
    "pageTitle": "Moraine Valley Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Moraine-Valley-Community-College/reviews?_escaped_fragment_=/show/26513",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00015-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 889865347,
    "recordOffset": 889806815,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1377=You really can't beat the prices. A full load for me is a little over $1000 per semester. Compare that to regular university prices, which go from $5000 to $10000 a semester, all for the exact same general education classes! It's pretty much a no-brainer. I don't regret my decision at all, because while everyone's in debt, I'll be enjoying that money saved., 302105=© 2015, Cappex.com, LLC, 80308=The school has a decent sized cafeteria. They offer many different items ranging from pizza to burgers. They even sell energy drinks and have many coffee stands throughout the campus which is a plus for me since i'm there from 7:30 a.m to 4:00 p.m.}",
    "textBeforeTable": "12/08/2009 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 71 angelika from Orland Park, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Am enjoying being here It's a clean, safe environment, but because everyone commutes it's obviously missing that college experience of dorming and close knit feeling. Regardless, everyone's friendly and in the same situation as you, so you feel completely at ease. The class schedules are so flexible, I take all of my classes on Tuesdays and Thursdays from 8am-3pm. I love those 4 day weekends! Am learning a lot The classes are small, 30 students max. This makes for great communication between you and the professor (no teacher assistants here!). All of my teachers are excited to teach each day, and make the material exciting (even math). I don't believe that a community college offers less quality education. I'm getting a lot out of the classes I've taken. Login to rate or flag the reviews Kayla 10/13/2010 Reviewer is A current student here. 3 out of 3 people found this review useful. 2 of 71 Categories Comments Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}