{
    "relation": [
        [
            "Payment method",
            "",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Asus Xonar DG 5 1 Channels Dolby Headphone Audio PCI Sound Card | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/ASUS-XONAR-DG-5-1-CHANNELS-DOLBY-HEADPHONE-AUDIO-PCI-SOUND-CARD-/331002308160?pt=AU_Components&hash=item4d11466640",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00318-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 408999887,
    "recordOffset": 408950323,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{57438=Intel Pentium 4 1.4GHz or AMD Athlon 1400 CPU with 512MB system memory}",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at If you change your mind, items (except software and console video games) can be returned within 30 days of receipt for refund or exchange if the following terms are met: * The item must be returned to us within 30 days of delivery in original, factory sealed packaging and unused condition. * Restocking fee of 15% will be applied. * We do not accept return if item has been opened and/or used, as the goods are no longer considered as brand new. * Any delivery or insurance costs incurred are not refundable and will be further deducted from the refund amount. * We reserve the right to refuse a refund on a returned item if the item is not in original, resalable condition. If your item is confirmed to be defective when delivered, it will be treated as Dead On Arrival (DOA). THE DOA PERIOD IS 14 DAYS FROM YOUR INVOICE DATE.",
    "textAfterTable": "Seller's payment instructions For direct deposit, banking detail will shown in checkout. Please leave your ebay user ID with deposit (NO ITEM ID PLEASE). All payments must be made within 3 days. Please make sure you postal address is correct on Paypal registration if by by Paypal. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}