{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The rec offers many great sports where you can make your own intramural team. There also a game room full of fun activities to do. There is always usually something going on at the university.",
            "Great food choices! subway, dusty diner, home-made food, pizza, chicken tenders and burgers.",
            "It may seem easy at first, but it can get tough so stay on track and study.",
            "This university is a friendly environment and there is people to help you out with anything you need at any time. It makes you feel really comfortable and has a great atmosphere. I enjoy this university a lot."
        ]
    ],
    "pageTitle": "Texas A & M International University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Texas-A-M-International-University/reviews?_escaped_fragment_=/show/12627",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00124-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900084059,
    "recordOffset": 900030688,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{257803=© 2015, Cappex.com, LLC, 143068=It is so and so. I took Hist. 1301 with Blackwell which is the toughest professor on campus and it was just fine. I also took Jaramillo now he was bad.}",
    "textBeforeTable": "09/07/2010 Reviewer is A current student here. 3 out of 4 people found this review useful. 1 of 64 Eliana from Rio Grande City, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp =",
    "textAfterTable": "Am learning a lot because what I don't get I joined program called TRIO and it's for tutoring and it helps me a lot at least the first days; we were kind of skimming, but i learned . Login to rate or flag the reviews Young-Gun12 07/14/2012 Reviewer is A current student here. 2 out of 3 people found this review useful. 2 of 64 Categories Comments Campus Safety The one thing this university has is safety. Campus police is top of every rule. Keep an eye out for them they can be your best friend or foe. Greek Life Don't think this like the movies, the university is new to the Greek life so it is in its growing stage but they do have a lot of thing for its members. Clubs and Activities There are a few clubs for students they are a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}