{
    "relation": [
        [
            "",
            "AT&T",
            "Sprint/Boost",
            "T-Mobile",
            "Verizon"
        ],
        [
            "Unlimited Voice",
            "$99.99",
            "N/A",
            "$49.99-$59.99",
            "$69.99"
        ],
        [
            "Unlimited Voice/Text",
            "$119.99",
            "N/A",
            "$59.99-$69.99",
            "$89.99"
        ],
        [
            "Unlimited Voice/Text/Data",
            "$129.99",
            "$99.99",
            "$79.99",
            "$119.99"
        ],
        [
            "Unlimited Voice/Text (Prepaid)",
            "$60.00",
            "$50.00",
            "N/A",
            "$94.99"
        ],
        [
            "Notes",
            "Very limited phone selection with prepaid",
            "",
            "Cheaper option if you forego phone subsidies",
            ""
        ]
    ],
    "pageTitle": "Verizon Cuts Price on Unlimited Voice Plans | News & Opinion | PCMag.com",
    "title": "",
    "url": "http://www.pcmag.com/article2/0,2817,2358122,00.asp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00297-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 651831263,
    "recordOffset": 651790412,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{35699=Verizon on Friday debuted new, lower-priced unlimited plans, a long-expected move that makes its unlimited talk and unlimited talk-and-text plans more affordable. It also introduced new pricing on prepaid plans and raised the price of higher-end feature phones by requiring a $10 data plan for them. The new pricing will go into effect Jan. 18.}",
    "textBeforeTable": "Verizon on Friday debuted new, lower-priced unlimited plans, a long-expected move that makes its unlimited talk and unlimited talk-and-text plans more affordable. It also introduced new pricing on prepaid plans and raised the price of higher-end feature phones by requiring a $10 data plan for them. The new pricing will go into effect Jan. 18. The company lowered its nationwide unlimited voice plan to $69.99 a month from $99, and introduced a new nationwide unlimited voice-and-text plan for $89.99. An unlimited plan including 5GB of data usage is $119.98. Verizon's nationwide unlimited family plans will be $119.99, and an unlimited family voice-and-text plan will be $149.99. These family plan prices are for two lines. Verizon also will offer new prepaid unlimited plans that don't require a contract, but will cost $5 more than comparable unlimited plans on contract. (An unlimited voice plan will be $74.99 and an unlimited voice-and-text plan will be $94.99.) The 450- and 900-minute prepaid plans also will be $5 more a month than similar contract plans. The new pricing options won't affect existing customers, but these customers have the option to switch to any new plan without incurring a fee or penalty. One drawback to Verizon's new pricing is that the company is raising the minimum price users pay per month on data-capable feature phones. The company will now require $9.99 data plans on the LG Chocolate Touch, LG enV 3, LG VX8360, Motorola Entice W766, Nokia 7705 Twist, and Samsung",
    "textAfterTable": "Verizon regularly wins awards for its coverage and call quality in independent surveys such as our own Service & Reliability study. Last year, when Verizon lowered their unlimited nationwide talk plan to $99, AT&T responded with comparable pricing the same day. It's not hard to imagine AT&T responding in a similar manner to today's announcement. We'll let you know the latest at PCMag.com. Back to top Previous : Gartner: Mobile Web Will Outstrip Other Platforms T-Mobile, Vonage Waiving Charges to Haiti Next :",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}