{
    "relation": [
        [
            "Ranking",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Skipper",
            "Karol JABLONSKI",
            "Jesper RADICH",
            "Jes GRAM-HANSEN",
            "James SPITHILL",
            "Ed BAIRD",
            "Magnus HOLMBERG",
            "Bjorn HANSEN",
            "Mathieu RICHARD",
            "Paolo CIAN",
            "Staffan LINDBERG"
        ],
        [
            "Nation",
            "POL",
            "DEN",
            "DEN",
            "USA",
            "USA",
            "SWE",
            "SWE",
            "FRA",
            "ITA",
            "FIN"
        ],
        [
            "Previous",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "8",
            "9",
            "12",
            "10"
        ],
        [
            "Events",
            "8",
            "8",
            "8",
            "8",
            "8",
            "8",
            "8",
            "8",
            "8",
            "8"
        ],
        [
            "Points",
            "11171",
            "11081",
            "10287",
            "10191",
            "9645",
            "9266",
            "8963",
            "8958",
            "8937",
            "8902"
        ]
    ],
    "pageTitle": "News & Features | ISAF | World Sailing | Official Site : World Championship Line Up Decided",
    "title": "",
    "url": "http://www.sailing.org/news/8091.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 696482111,
    "recordOffset": 696457513,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Fri, 31 Jul 2015 19:30:59 GMT",
    "textBeforeTable": "The rest of the top ten, including defending World Champion Karol JABLONSKI (POL) are clear to see in the ranking chart, but meteoric rise of the week goes to Chris LAW (GBR), a veteran match race skipper who following his fantastic result in Sweden, has propelled himself up to 19 in the rankings from 31 only two weeks ago. Due to the rolling nature of the rankings over a two year period, Paulo CIAN's points for the 2002 UBS Challenge Cup Finals, drop from year one into year two, being replaced in year one by the 2003 Blurimini Match Race result, which actually give Paulo a points improvement of 300, leapfrogging himself into the top ten as a result, at the expense of Lindqvist and Williams. Four skippers have moved into the top ten over the last two weeks, so four must have dropped out of the top ten and be resigned to watching the Worlds and not competing? Not quite. Two weeks ago, Italian skipper Paulo CIAN saw his ranking position drop from fifth to 12, dangerously short of the points he wanted. With a lot of luck, and the chance to pull it back himself with a second in the ISAF Grade 3 Coppa del Campioni. A win at the Swedish Match Cup would have pushed him back into the top ten. Although Cian's result in Sweden was not as expected, the end result",
    "textAfterTable": "ISAF World Match Race Rankings - Women Just the one event counted towards the Women's rankings this time around and as a result there is little change in the rankings. The top eight remain the same in fact, with Marie BJORLING (SWE) heading up the rankings, and countryman and ISAF Women's Match Race Champion Malin MILLBOURN in second. One interesting move is the jump from 12 to ninth by another Swedish skipper, Malin KALLESTROM, as a direct result of her second place finish in the Swedish Match Cup last weekend. As an opposite to this Klaartje ZUIDERBAAN (NED) drops from ninth to twelfth position in this latest rankings release. Only one entry into the top twenty this time around, as the fourth French skipper to appear in the World's top twenty appears in the form of Claire LEROY, who finished eighth at the Swedish Match Cup and as a result moves back into the fray, previously having hovered just outside the top ten. With only six events counting, another two good results on the board could see some big climbs from her. Ranking Skipper Nation Previous Events Points 1 Marie BJORLING SWE 1 8 10347 2",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}