{
    "relation": [
        [
            "Jan-Mar 2010 Rank",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Airport",
            "Atlanta",
            "Chicago O'Hare",
            "Dallas/Ft. Worth",
            "Denver",
            "Los Angeles",
            "Phoenix",
            "Las Vegas",
            "Orlando",
            "Charlotte",
            "Houston Bush"
        ],
        [
            "Jan-Mar 2010 Enplaned Passengers",
            "8.582",
            "5.959",
            "5.594",
            "5.455",
            "4.678",
            "4.375",
            "4.193",
            "3.816",
            "3.786",
            "3.537"
        ],
        [
            "Jan-Mar 2009 Rank",
            "1",
            "2",
            "3",
            "4",
            "5",
            "7",
            "6",
            "8",
            "9",
            "10"
        ],
        [
            "Jan-Mar 2009 Enplaned Passengers",
            "8.644",
            "5.807",
            "5.559",
            "5.241",
            "4.437",
            "4.280",
            "4.340",
            "3.815",
            "3.734",
            "3.565"
        ],
        [
            "Pct. Change 2009-2010",
            "-0.7",
            "2.6",
            "0.6",
            "4.1",
            "5.4",
            "2.2",
            "-3.4",
            "0.0",
            "1.4",
            "-0.8"
        ]
    ],
    "pageTitle": "March 2010 Airline Traffic Data: System Traffic Up 2.4 Percent from March 2009 | Bureau of Transportation Statistics",
    "title": "",
    "url": "http://www.rita.dot.gov/bts/sites/default/files/rita_archives/bts_press_releases/2010/bts029_10/html/bts029_10.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00204-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 689728023,
    "recordOffset": 689702998,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{96353=* Delta's January-March 2010 number is the report of the merged Delta and Northwest. The January-March 2009 numbers were reported separately by Delta and Northwest. Northwest reported 7.535 million domestic passengers in Jan-Mar 2009., 25946=Data are subject to revision. BTS has scheduled July 15 for the release of April traffic data., 18147=In March, Delta Air Lines carried more total system and international passengers than any other U.S. airline (Tables 4, 16). Southwest Airlines carried the most domestic passengers (Tables 10)., 16324=Thursday, June 10, 2010 - The U.S. Department of Transportation's Bureau of Transportation Statistics (BTS) today reported in a release of preliminary data that U.S. airlines carried 62.4 million scheduled domestic and international passengers in March 2010. This is a 2.4 percent increase from March 2009 (Table 1). The March 2010 passenger total was 7.8 percent below that of two years ago in March 2008 (Table 2)., 20582=Table 2 System scheduled enplanements on U.S. airlines by month since January 2008, 21405=Table 7 (March and January through March): Domestic revenue passenger-miles (RPMs) Domestic available seat-miles (ASMs) Domestic passenger load factor Domestic flight stage length Domestic passenger trip length, 23123=Table 15 January through March: Top 10 U.S. airlines by scheduled international passenger enplanements, 17883=U.S. airlines carried 0.6 percent more domestic passengers and 2.8 percent more international passengers in the first three months of 2010 than during the same period in 2009 (Tables 7, 13). , 18363=During the first three months of 2010, Delta carried more total system passengers than any other U.S. airline (Table 3). Southwest carried the most domestic passengers and Delta carried the most international passengers in the first three months (Tables 9, 15). See notes under tables for more details on Delta's report., 17550=For the first three months of 2010, the number of scheduled domestic and international passengers on U.S. airlines increased 0.9 percent from the same period in 2009 at 164.1 million (Table 2). The number of passengers declined 10.1 percent from the first three months of 2008 to the first three months of 2009., 19427=In March, U.S. airlines operated 811,200 scheduled domestic and international flights, down 0.8 percent from the number of flights operated in March 2009 (Table 1). The number of domestic flights decreased 0.9 percent in March from a year earlier while international flights were up 0.4 percent (Tables 7, 13)., 21867=Table 9 January through March: Top 10 domestic airlines by scheduled passenger enplanements, 20341=Table 1 (March and January through March): Revenue passenger-miles (RPMs) Available seat-miles (ASMs) Passenger load factor Flight stage length Passenger trip length, 19054=During the first three months of 2010, more total system and domestic passengers boarded planes at Atlanta Hartsfield-Jackson International than at any other U.S. airport (Tables 5 and 11); and more international passengers boarded U.S. carriers at Miami International than at any other U.S. airport (Table 17)., 24666=Traffic numbers are available on the BTS website at TranStats, the Intermodal Transportation Database, at http://transtats.bts.gov. Click on \"Aviation.\" For system passengers, RPMs and ASMs by carrier through March, click on \"Air Carrier Summary Data (Form 41 and 298C Summary Data),\" and then click on \"Schedule T-1.\" Use crosstabs to find scheduled service., 21691=Table 8 Domestic scheduled enplanements on U.S. airlines by month since January 2008, 49372=** Delta's March 2010 number is the report of the merged Delta and Northwest. The January-March 2009 numbers were reported separately by Delta and Northwest. Northwest reported 9.771 million system passengers in Jan-Mar 2009., 104337=* Delta's March 2010 number is the report of the merged Delta and Northwest. The March 2009 numbers were reported separately by Delta and Northwest. Northwest reported 2.873 million domestic passengers in March 2009., 16768=BTS, a part of DOT's Research and Innovative Technology Administration, also reported that U.S. airlines carried 2.0 percent more domestic passengers in March 2010 than in March 2009.  The number of international passengers on U.S. carriers increased 5.1 percent over March 2009 (Tables 7, 13). The March 2010 load factors of 82.6 percent systemwide and 83.4 percent domestic were the highest recorded for any March (Tables 1, 7)., 20756=Table 3 January through March: Top 10 airlines by scheduled passenger enplanements, 19759=During the first three months of 2010, U.S. carriers operated 2.3 million domestic and international flights, 2.4 percent fewer than were operated during the same period in 2009 (Table 1). Domestic flights decreased 2.6 percent from the previous year while international flights were down 0.5 percent (Tables 7, 13)., 22544=Table 13 (March and January through March): International revenue passenger-miles on U.S. airlines (RPMs) International available seat-miles on U.S. airlines (ASMs) International passenger load factor on U.S. airlines International flight stage length on U.S. airlines International passenger trip length on U.S. airlines, 152130=* Delta's March 2010 number is the report of the merged Delta and Northwest. The March 2009 numbers were reported separately by Delta and Northwest. Northwest reported 781.8 thousand international passengers in March 2009., 22180=Table 11 January through March: Top 10 domestic airports by scheduled passenger enplanements, 57186=** Delta's March 2010 number is the report of the merged Delta and Northwest. The March 2009 numbers were reported separately by Delta and Northwest. Northwest reported 3.655 million system passengers in March 2009., 23456=Table 17 January through March: Top 10 airports by scheduled international passenger enplanements on U.S. airlines, 23813=Data are compiled from monthly reports filed with BTS by commercial U.S. air carriers detailing operations, passenger traffic and freight traffic. This release includes data received by BTS from 81 carriers as of June 2 for U.S. carrier scheduled civilian operations. Go to http://www.transtats.bts.gov/releaseinfo.asp for the complete list of reporting and non-reporting carriers. U.S. carriers ' foreign point-to-point flights are included in system and international totals. To create a customized table for passengers, flights, RPMs, ASMs and other data, including non-scheduled service, go to http://www.bts.gov/programs/airline_information/air_carrier_traffic_statistics/., 144220=* Delta's January-March 2010 number is the report of the merged Delta and Northwest. The January-March 2009 numbers were reported separately by Delta and Northwest. Northwest reported 2235.9 thousand international passengers in Jan-Mar 2009., 20097=For other comparisons from the first three months of 2009 to the first three months of 2010 and from March 2009 to March 2010, see the following tables:, 22941=Table 14 International scheduled enplanements on U.S. airlines by month since January 2008, 21050=Table 5 January through March: Top 10 airports by scheduled passenger enplanements on U.S. airlines, 18750=In March, more total system and domestic passengers boarded planes at Atlanta Hartsfield-Jackson International than at any other U.S. airport (Tables 6 and 12); and more international passengers boarded U.S. carriers at Miami International than at any other U.S. airport (Table 18)., 25651=TranStats system and international totals do not include U.S. carriers' foreign point-to-point flights. For March, U.S. carriers reported 263,995 foreign point-to-point passengers. For January through March, U.S. carriers reported 724,883 foreign point-to-point passengers., 25116=For domestic numbers through March and international numbers through December by origin as well as by carrier, after clicking on \"Aviation,\" click on \"Air Carrier Statistics (Form 41 Traffic).\" Click on \"T-100 Market\" for system passenger numbers, \"T-100 Domestic Market\" for domestic or \"T-100 International Market\" for international. For flights, stage length and trip length, use the appropriate T-100 Segment database. Use crosstabs to find scheduled service.}",
    "lastModified": "Fri, 31 Jul 2015 19:34:27 GMT",
    "textBeforeTable": "Excel | CSV Table 1. Scheduled System (Domestic and International) Airline Travel on U.S. Airlines Data are subject to revision. BTS has scheduled July 15 for the release of April traffic data. TranStats system and international totals do not include U.S. carriers' foreign point-to-point flights. For March, U.S. carriers reported 263,995 foreign point-to-point passengers. For January through March, U.S. carriers reported 724,883 foreign point-to-point passengers. For domestic numbers through March and international numbers through December by origin as well as by carrier, after clicking on \"Aviation,\" click on \"Air Carrier Statistics (Form 41 Traffic).\" Click on \"T-100 Market\" for system passenger numbers, \"T-100 Domestic Market\" for domestic or \"T-100 International Market\" for international. For flights, stage length and trip length, use the appropriate T-100 Segment database. Use crosstabs to find scheduled service. Traffic numbers are available on the BTS website at TranStats, the Intermodal Transportation Database, at http://transtats.bts.gov. Click on \"Aviation.\" For system passengers, RPMs and ASMs by carrier through March, click on \"Air Carrier Summary Data (Form 41 and 298C Summary Data),\" and then click on \"Schedule T-1.\" Use crosstabs to find scheduled service. Data are compiled from monthly reports filed with BTS by commercial U.S. air carriers detailing operations, passenger traffic and freight traffic. This release includes data received by BTS from 81 carriers as of June 2 for U.S. carrier scheduled civilian operations. Go to http://www.transtats.bts.gov/releaseinfo.asp for the complete list of reporting and non-reporting carriers. U.S. carriers ' foreign point-to-point",
    "textAfterTable": "  2008 2009 2008-2009 Pct. Change 2010 2009-2010 Pct. Change January 57.7 51.8 -10.2 52.8 1.9 February 57.1 49.8 -12.6 48.9 -1.9 March 67.7 61.0 -10.0 62.4 2.4 April 63.2 59.5 -5.8     May 66.0 59.7 -9.5     June 68.0 63.6 -6.5     July 70.5 68.1 -3.4     August",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}