{
    "relation": [
        [
            "",
            "10 HIGHEST RANKED AIRLINES",
            "Qantas Airways (Australia)",
            "Air New Zealand",
            "Emirates (United Arab Emirates)",
            "Etihad Airways (United Arab Emirates)",
            "Cathay Pacific Airways (Hong Kong)",
            "Singapore Airlines",
            "Virgin Atlantic Airways (England)",
            "EVA Air ( Taiwan)",
            "All Nippon Airways (Japan)",
            "Royal Jordanian (Jordan)"
        ],
        [
            "",
            "STARS",
            "7",
            "7",
            "7",
            "7",
            "7",
            "7",
            "7",
            "7",
            "7",
            "7"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "10 LOWEST RANKED AIRLINES",
            "Kam Air (Afghanistan)",
            "Scat Airlines (Kazakhstan)",
            "Blue Wing Airlines (Suriname)",
            "Afghan Airways (Afghanistan)",
            "Daallo Airlines (United Arab Emirates)",
            "Eritrean Airlines (Eritrea)",
            "Lion Air ( Indonesia)",
            "Merpati Airlines (Jakarta)",
            "Susi Air ( Indonesia)",
            "Air Bagan (Myanmar)"
        ],
        [
            "",
            "STARS",
            "1",
            "1",
            "1",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2"
        ]
    ],
    "pageTitle": "Qantas ranks as the world’s safest airline, says AirlineRatings.com (UPDATE AT 3 P.M. WITH CHART) | | Dallas Morning News",
    "title": "",
    "url": "http://aviationblog.dallasnews.com/2014/01/qantas-ranks-as-the-worlds-safest-airline-says-airlineratings-com.html/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00003-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 23349795,
    "recordOffset": 23328013,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{292=The worst accident was the Nov. 17 crash of Tatarstan Airlines’ flight 363 from Moscow to Kazan, Russia, which killed all 44 passengers and six crew members as the Boeing 737-500 plane attempted to land in strong winds. AirlineRatings.com gave Tatarstan four stars for safety., 1562=Australian Qantas Airways is the world’s safest carrier without a fatal crash since 1951., 521=Last year also was the safest for flying worldwide since 1945. The 269 deaths from 29 accidents in 2013 were well below the 10-year average of 719 deaths and 32 accidents, according to the Aviation Safety Network.}",
    "textBeforeTable": "The worst accident was the Nov. 17 crash of Tatarstan Airlines’ flight 363 from Moscow to Kazan, Russia, which killed all 44 passengers and six crew members as the Boeing 737-500 plane attempted to land in strong winds. AirlineRatings.com gave Tatarstan four stars for safety. Last year also was the safest for flying worldwide since 1945. The 269 deaths from 29 accidents in 2013 were well below the 10-year average of 719 deaths and 32 accidents, according to the Aviation Safety Network. The airline safety and product rating site analyzed a number of factors related to audits from aviation’s governing bodies and organizations, government audits and airline fatality records. All of the top 10 airlines received seven stars –  the most an airline can earn — for safety and in-flight products. However, 137 of the 448 airlines tracked by AirlineRatings.com earned seven stars. Nearly 50 had three stars or less. The other nine airlines are (in alphabetical order): Air New Zealand, All Nippon Airways, Cathay Pacific Airways, Emirates, Etihad Airways, Eva Air, Royal Jordanian, Singapore Airlines and Virgin Atlantic. That’s the result of AirlineRatings.com’s list of 2013′s top 10 safest airlines issued this week. None of the top 10 are a U.S.-based carrier. Australian Qantas Airways is the world’s safest carrier without a fatal crash since 1951. A Qantas Airways flight lands at Adelaide airport in Australia. (Saeed Khan/AFP/Getty Images)",
    "textAfterTable": "Editor Picks Comments To post a comment, log into your chosen social network and then add your comment below. Your comments are subject to our Terms of Service and the privacy policy and terms of service of your social network. If you do not want",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}