{
    "relation": [
        [
            "Room Name",
            "Henry’s Restaurant",
            "Ball Room (A + B)",
            "Eureka (A)",
            "Stockman (B)",
            "Swagman"
        ],
        [
            "Height",
            "–",
            "2.4",
            "2.4",
            "2.4",
            "2.3"
        ],
        [
            "Area (m²)",
            "–",
            "22.7 x 9",
            "9.7 x 10.5",
            "13 x 9",
            "14.6 x 7.1"
        ],
        [
            "Board Room",
            "–",
            "40",
            "25",
            "30",
            "40"
        ],
        [
            "Theatre",
            "–",
            "100",
            "40",
            "60",
            "60"
        ],
        [
            "Class Room",
            "–",
            "60",
            "24",
            "36",
            "45"
        ],
        [
            "U-Shape",
            "–",
            "30",
            "18",
            "30",
            "30"
        ],
        [
            "Banquet",
            "180",
            "110",
            "40",
            "70",
            "70"
        ],
        [
            "Cocktail",
            "280",
            "220",
            "100",
            "120",
            "120"
        ]
    ],
    "pageTitle": "Aspire Hotel Sydney | Meetings & Events",
    "title": "",
    "url": "http://www.metrohotels.com.au/hotels/new-south-wales/aspire-hotel-sydney/meetings-events/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00022-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 598042235,
    "recordOffset": 598011171,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{170145=Phone: (02) 9211 1499 Fax: (02) 9281 3764 Email: reservations@aspirehotel.com Website: www.metrohotels.com.au/hotels/new-south-wales/aspire-hotel-sydney, 174754=© Copyright 1998-2015 – Metro Hotels all rights reserved., 85329=383-389 Bulwara Road Ultimo, Sydney NSW 2007 Australia, 85416=P: +61 2 9211 1499 F: +61 2 9281 3764 E: Email Us, 170004=Address: 383 – 389 Bulwara Rd Ultimo Sydney NSW 2007}",
    "textBeforeTable": "Function Room Capacity Venue Floor Plans Aspire Hotel Sydney Conference Factsheet Aspire Hotel Sydney is the ideal conference and  function venue in Sydney’s Ultimo Aspire Hotel Sydney | Meetings & Events Home | Hotels | New South Wales | Aspire Hotel Sydney | Meetings & Events You are here: Social Media Groote Eylandt Lodge Metro Hotel Perth Metro Hotel Ipswich International Metro Inn Ryde Metro Hotel Marlow Sydney Central Aspire Hotel Sydney Meetings & Events Groote Eylandt Lodge Metro Hotel Perth Metro Hotel Tower Mill Metro Hotel Ipswich International Metro Hotel and Apartments Gladstone Metro Hotel Miranda Metro Inn Ryde Metro Hotel on Pitt Metro Hotel Marlow Sydney Central Aspire Hotel Sydney Restaurants & Bars Linger Longer Hot Deal at Groote Eylandt Lodge Winter B&B at",
    "textAfterTable": "Function Room Hire (Fees when not combined with package) Room Name Full Day Half Day & Evening (4 hours or less) Ball Room (A + B) $900 $750 Eureka (A) $650 $500 Stockman (B) $650 $500 Swagman $700 $600 Hotel Facilities Guest Rooms: 96 large, well appointed rooms with ensuite, individual air conditioning control, wireless internet connectivity, safe, iron & board, hairdryer, tea and coffee making facilities and fridge. Restaurant: Henry’s Restaurant opens daily for Breakfast Meeting and Banquet: Three function rooms with capacity for up to 280 people Services Three rooms can cater for functions of up to 130 people. Every room has natural light, direct-dial telephone links and individual air conditioning controls. All conference rooms are located on the ground floor for easy access and can be secured during breaks. Private access to Mary Ann Park next to the hotel provides refreshing space for outdoor breaks, activities and catering. Choose from a selection of packages and catering options to suit all tastes and budgets. Alternatively, conference organisers can plan their individual catering needs with the hotel’s Conference staff to ensure a professionally run event, delivered on time and with quality. Packages Packages include the following but may be customised according to requirements: Room hire from 0830 hrs – 1700 hrs Meeting room set-up Arrival tea and coffee Morning tea, coffee and baked muffins Lunch, please see below Afternoon tea, coffee and",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}