{
    "relation": [
        [
            "Email-ID",
            "81508",
            "90306",
            "1098283",
            "1204569",
            "5300460"
        ],
        [
            "Subject",
            "Re: ] Yemen is negotiating the terms for surrendering Anwar al Awlaki",
            "Re: INSIGHT - YEMEN - why champagne hangovers suck",
            "Insight- Yemen is negotiating the terms for surrendering Anwar al Awlaki",
            "Re: INSIGHT - Yemen - Counterterrorism turf wars in DC",
            "STRATFOR Yemen Attack Database - May 23, 2011"
        ],
        [
            "From",
            "reva.bhalla@stratfor.com",
            "aaron.colvin@stratfor.com",
            "reva.bhalla@stratfor.com",
            "sean.noonan@stratfor.com",
            "Anya.Alfano@stratfor.com"
        ],
        [
            "To",
            "malbasha@gmail.com",
            "analysts@stratfor.com",
            "analysts@stratfor.com",
            "analysts@stratfor.com",
            "DEfurd@huntoil.com"
        ],
        [
            "Date",
            "2010-01",
            "2010-02",
            "2010-01",
            "2010-09",
            "2011-05"
        ]
    ],
    "pageTitle": "The Global Intelligence Files - List of documents - Petraeus: the Plot Thickens",
    "title": "",
    "url": "https://wikileaks.org/gifiles/releasedate/2013-02-05-13-petraeus-the-plot-thickens.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00013-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 887862162,
    "recordOffset": 887853960,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1146=On Monday February 27th, 2012, WikiLeaks began publishing The Global Intelligence Files, over five million e-mails from the Texas headquartered \"global intelligence\" company Stratfor. The e-mails date between July 2004 and late December 2011. They reveal the inner workings of a company that fronts as an intelligence publisher, but provides confidential intelligence services to large corporations, such as Bhopal's Dow Chemical Co., Lockheed Martin, Northrop Grumman, Raytheon and government agencies, including the US Department of Homeland Security, the US Marines and the US Defence Intelligence Agency. The emails show Stratfor's web of informers, pay-off structure, payment laundering techniques and psychological methods., 316=Released on 2013-02-05 13:00 GMT}",
    "lastModified": "Tue, 17 Mar 2015 20:30:24 GMT",
    "textBeforeTable": "http://whowhatwhy.com/2013/02/05/petraeus-the-plot-thickens-1/ Read stories about those documents at the following addresses: Released on 2013-02-05 13:00 GMT List of documents > Release Petraeus: the Plot Thickens On Monday February 27th, 2012, WikiLeaks began publishing The Global Intelligence Files, over five million e-mails from the Texas headquartered \"global intelligence\" company Stratfor. The e-mails date between July 2004 and late December 2011. They reveal the inner workings of a company that fronts as an intelligence publisher, but provides confidential intelligence services to large corporations, such as Bhopal's Dow Chemical Co., Lockheed Martin, Northrop Grumman, Raytheon and government agencies, including the US Department of Homeland Security, the US Marines and the US Defence Intelligence Agency. The emails show Stratfor's web of informers, pay-off structure, payment laundering techniques and psychological methods. The Global Intelligence Files courage is contagious Follow us on Facebook Twitter this Follow us on Twitter Support Wikileaks Supporters Community resources Sunday Star-Times - New Zealand The Yes Men - Bhopal Activists The Hindu - India Taraf - Turkey Ta Nea - Greece Russian Reporter - Russia Rolling Stone - United States Publico.es",
    "textAfterTable": "",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}