{
    "relation": [
        [
            "Ion",
            "Cl −",
            "SO 4 2−",
            "PO 4 3−",
            "NO 3 −",
            "OH −"
        ],
        [
            "K +",
            "KCl",
            "K2SO4",
            "K3PO4",
            "KNO3",
            "KOH"
        ],
        [
            "Fe 3+",
            "FeCl3",
            "Fe2(SO4)3",
            "FePO4",
            "Fe(NO3)3",
            "Fe(OH)3"
        ],
        [
            "NH 4 +",
            "NH4Cl",
            "(NH4)2SO4",
            "(NH4)3PO4",
            "NH4NO3",
            "NH4OH"
        ],
        [
            "Ba 2+",
            "BaCl2",
            "BaSO4",
            "Ba3(PO4)2",
            "Ba(NO3)2",
            "Ba(OH)2"
        ]
    ],
    "pageTitle": "Molecules, Ions, and Chemical Formulas",
    "title": "",
    "url": "http://2012books.lardbucket.org/books/principles-of-general-chemistry-v1.0/s06-molecules-ions-and-chemical-fo.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00236-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 383799,
    "recordOffset": 312775,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1018=This content was accessible as of December 29, 2012, and it was downloaded then by Andy Schmitz in an effort to preserve the availability of this book., 88829=When chemists synthesize a new compound, they may not yet know its molecular or structural formula. In such cases, they usually begin by determining its empirical formulaA formula for a compound that consists of the atomic symbol for each component element accompanied by a subscript indicating the relative number of atoms of that element in the compound, reduced to the smallest whole numbers., the relative numbers of atoms of the elements in a compound, reduced to the smallest whole numbers. Because the empirical formula is based on experimental measurements of the numbers of atoms in a sample of the compound, it shows only the ratios of the numbers of the elements present. The difference between empirical and molecular formulas can be illustrated with butane, a covalent compound used as the fuel in disposable lighters. The molecular formula for butane is C4H10. The ratio of carbon atoms to hydrogen atoms in butane is 4:10, which can be reduced to 2:5. The empirical formula for butane is therefore C2H5. The formula unitThe absolute grouping of atoms or ions represented by the empirical formula. is the absolute grouping of atoms or ions represented by the empirical formula of a compound, either ionic or covalent. Butane, for example, has the empirical formula C2H5, but it contains two C2H5 formula units, giving a molecular formula of C4H10., 97274=B Because Eu3+ has a charge of +3 and O2− has a charge of −2, a 1:1 compound would have a net charge of +1. We must therefore find multiples of the charges that cancel. We cross charges, using the absolute value of the charge on one ion as the subscript for the other ion:, 90857=Because ionic compounds do not contain discrete molecules, empirical formulas are used to indicate their compositions. All compounds, whether ionic or covalent, must be electrically neutral. Consequently, the positive and negative charges in a formula unit must exactly cancel each other. If the cation and the anion have charges of equal magnitude, such as Na+ and Cl−, then the compound must have a 1:1 ratio of cations to anions, and the empirical formula must be NaCl. If the charges are not the same magnitude, then a cation:anion ratio other than 1:1 is needed to produce a neutral compound. In the case of Mg2+ and Cl−, for example, two Cl− ions are needed to balance the two positive charges on each Mg2+ ion, giving an empirical formula of MgCl2. Similarly, the formula for the ionic compound that contains Na+ and O2− ions is Na2O., 317301=Sulfuric acid is one of the oldest chemical compounds known. It was probably first prepared by alchemists who burned sulfate salts such as FeSO4·7H2O, called green vitriol from its color and glassy appearance (from the Latin vitrum, meaning “glass”). Because pure sulfuric acid was found to be useful for dyeing textiles, enterprising individuals looked for ways to improve its production. By the mid-18th century, sulfuric acid was being produced in multiton quantities by the lead-chamber process, which was invented by John Roebuck in 1746. In this process, sulfur was burned in a large room lined with lead, and the resulting fumes were absorbed in water., 306481=The octane scale was established in 1927 using a standard test engine and two pure compounds: n-heptane and isooctane (2,2,4-trimethylpentane). n-Heptane, which causes a great deal of knocking on combustion, was assigned an octane rating of 0, whereas isooctane, a very smooth-burning fuel, was assigned an octane rating of 100. Chemists assign octane ratings to different blends of gasoline by burning a sample of each in a test engine and comparing the observed knocking with the amount of knocking caused by specific mixtures of n-heptane and isooctane. For example, the octane rating of a blend of 89% isooctane and 11% n-heptane is simply the average of the octane ratings of the components weighted by the relative amounts of each in the blend. Converting percentages to decimals, we obtain the octane rating of the mixture:, 96527=Reducing the subscripts to the smallest whole numbers gives the empirical formula GaAs, which is electrically neutral [+3 + (−3) = 0]. Alternatively, we could recognize that Ga3+ and As3− have charges of equal magnitude but opposite signs. One Ga3+ ion balances the charge on one As3− ion, and a 1:1 compound will have no net charge. Because we write subscripts only if the number is greater than 1, the empirical formula is GaAs. GaAs is gallium arsenide, which is widely used in the electronics industry in transistors and other devices., 106550=The method we used to predict the empirical formulas for ionic compounds that contain monatomic ions can also be used for compounds that contain polyatomic ions. The overall charge on the cations must balance the overall charge on the anions in the formula unit. Thus K+ and NO3− ions combine in a 1:1 ratio to form KNO3 (potassium nitrate or saltpeter), a major ingredient in black gunpowder. Similarly, Ca2+ and SO42− form CaSO4 (calcium sulfate), which combines with varying amounts of water to form gypsum and plaster of Paris. The polyatomic ions NH4+ and NO3− form NH4NO3 (ammonium nitrate), which is a widely used fertilizer and, in the wrong hands, an explosive. One example of a compound in which the ions have charges of different magnitudes is calcium phosphate, which is composed of Ca2+ and PO43− ions; it is a major component of bones. The compound is electrically neutral because the ions combine in a ratio of three Ca2+ ions [3(+2) = +6] for every two ions [2(−3) = −6], giving an empirical formula of Ca3(PO4)2; the parentheses around PO4 in the empirical formula indicate that it is a polyatomic ion. Writing the formula for calcium phosphate as Ca3P2O8 gives the correct number of each atom in the formula unit, but it obscures the fact that the compound contains readily identifiable PO43− ions., 307991=As shown in Figure 2.25 \"The Octane Ratings of Some Hydrocarbons and Common Additives\", many compounds that are now available have octane ratings greater than 100, which means they are better fuels than pure isooctane. In addition, antiknock agents, also called octane enhancers, have been developed. One of the most widely used for many years was tetraethyllead [(C2H5)4Pb], which at approximately 3 g/gal gives a 10–15-point increase in octane rating. Since 1975, however, lead compounds have been phased out as gasoline additives because they are highly toxic. Other enhancers, such as methyl t-butyl ether (MTBE), have been developed to take their place. They combine a high octane rating with minimal corrosion to engine and fuel system parts. Unfortunately, when gasoline containing MTBE leaks from underground storage tanks, the result has been contamination of the groundwater in some locations, resulting in limitations or outright bans on the use of MTBE in certain areas. As a result, the use of alternative octane enhancers such as ethanol, which can be obtained from renewable resources such as corn, sugar cane, and, eventually, corn stalks and grasses, is increasing., 294705=It isn’t easy to comprehend the scale on which the chemical industry must operate to supply the huge amounts of chemicals required in modern industrial societies. Figure 2.22 \"Top 25 Chemicals Produced in the United States in 2002*\" lists the names and formulas of the chemical industry’s “top 25” for 2002—the 25 chemicals produced in the largest quantity in the United States that year—along with the amounts produced, in billions of pounds. To put these numbers in perspective, consider that the 88.80 billion pounds of sulfuric acid produced in the United States in 2002 has a volume of 21.90 million cubic meters (2.19 × 107 m3), enough to fill the Pentagon, probably the largest office building in the world, about 22 times.}",
    "lastModified": "Sun, 30 Nov 2014 17:19:22 GMT",
    "textBeforeTable": "Table 2.1 The Number of Bonds That Selected Atoms Commonly Form to Other Atoms Hydrogen (H2) has a single bond between atoms. Oxygen (O2) has a double bond between atoms, indicated by two lines (=). Nitrogen (N2) has a triple bond between atoms, indicated by three lines (≡). Each bond represents an electron pair. Figure 2.2 Molecules That Contain Single, Double, and Triple Bonds The structural formula for H2 can be drawn as H–H and that for I2 as I–I, where the line indicates a single pair of shared electrons, a single bondA chemical bond formed when two atoms share a single pair of electrons.. Two pairs of electrons are shared in a double bondA chemical bond formed when two atoms share two pairs of electrons., which is indicated by two lines— for example, O2 is O=O. Three electron pairs are shared in a triple bondA chemical bond formed when two atoms share three pairs of electrons., which is indicated by three lines—for example, N2 is N≡N (see Figure 2.2 \"Molecules That Contain Single, Double, and Triple Bonds\"). Carbon is unique in the extent to which it forms single, double, and triple bonds to itself and other elements. The number of bonds formed by an atom in",
    "textAfterTable": "Figure 2.4 Different Ways of Representing the Structure of a Molecule (a) The molecular formula for methanol gives only the number of each kind of atom present. (b) The structural formula shows which atoms are connected. (c) The ball-and-stick model shows the atoms as spheres and the bonds as sticks. (d) A perspective drawing (also called a wedge-and-dash representation) attempts to show the three-dimensional structure of the molecule. (e) The space-filling model shows the atoms in the molecule but not the bonds. (f) The condensed structural formula is by far the easiest and most common way to represent a molecule. Although a structural formula, a ball-and-stick model, a perspective drawing, and a space-filling model provide a significant amount of information about the structure of a molecule, each requires time and effort. Consequently, chemists often use a condensed structural formula (part (f) in Figure 2.4 \"Different Ways of Representing the Structure of a Molecule\"), which omits the lines representing bonds between atoms and simply lists the atoms bonded to a given atom next to it. Multiple groups attached to the same atom are shown in parentheses, followed by a subscript that indicates the number of such groups. For example, the condensed structural formula for methanol is CH3OH, which tells us that the molecule contains a CH3 unit that looks like a fragment of methane (CH4). Methanol can therefore be viewed either as a",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}