{
    "relation": [
        [
            "Gen",
            "B2M",
            "GAPDH",
            "HPRT1",
            "PPIA",
            "RPLP0",
            "FUCA1"
        ],
        [
            "Protein name",
            "beta-2-microglobulin",
            "glyceraldehyde-3-phosphate dehydrogenase",
            "hypoxanthine-guanine phosphoribosyltransferase",
            "peptidyl-prolyl cis-trans isomerase A",
            "60S acidic ribosomal protein P0",
            "tissue alpha-L-fucosidase"
        ],
        [
            "GenBank ID",
            "NM_004048",
            "NM_002046",
            "NM_000194",
            "NM_021130",
            "NM_001002",
            "NM_000147"
        ],
        [
            "Amplicon size (bp)",
            "228",
            "238",
            "248",
            "188",
            "140",
            "190"
        ],
        [
            "Primers sequences (5′to 3′)",
            "F:TTTCATCCATCCGACATTGA R:CCTCCATGATGCTGCTTACA",
            "F:GAGTCAACGGATTTGGTCGT R:TTGATTTTGGAGGGATCTCG",
            "F:CCCCACGAAGTGTTGGATA R:AGCAGATGGCCACAGAACT",
            "F:CAAGAAGATCACCATTGCT R:AGGGAACAAGGAAAACAT",
            "F:GCAATGTTGCCAGTGTCTG R:GCCTTGACCTTTTCAGCAA",
            "F:AGTCACCCTGTTGCCTATGG R:TTTGGCGCTTTTAGATTGCT"
        ]
    ],
    "pageTitle": "IJMS | Free Full-Text | Decreased Expression of Alpha-L-Fucosidase Gene FUCA1 in Human Colorectal Tumors | HTML",
    "title": "Table 6. Primer sequences for the candidate reference genes and the target gene FUCA1.",
    "url": "http://www.mdpi.com/1422-0067/14/8/16986/htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 14,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00341-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 581130856,
    "recordOffset": 581101311,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{53534=All statistical analyses were performed with the SPSS software for MS Windows (v.15.0, SPSS Inc., Chicago, IL, USA). Normality of variables was assessed according to Kolmogorov-Smirnov test. For the comparison of non-normal distributed values, the non-parametric two-tailed Wilcoxon matched-pairs signed-ranks test, the Kruskal–Wallis test and Mann-Whitney U-test were used. p values ≤ 0.05 were considered statistically significant., 45957=Total RNA was isolated from tissue samples using Tripure Isolation Reagent (Roche Diagnostics, Indianapolis, IN, USA) according to the manufacturer’s instructions, and treated with DNase I (Fermentas, Hanover, MD, USA) to remove any possible residual genomic DNA. The integrity of RNA samples was checked by agarose gel electrophoresis, visualizing two intact ribosomal 18S and 28S RNA bands. Concentration and purity of RNA samples were checked by measuring the absorbance A260/A280 ratio in a NanoDrop 2000 Spectrophotometer (Thermo Fisher Scientific, Wilmington, DE, USA). This ratio was between 1.90 and 2.0 for all the samples included in this study., 19547=Int. J. Mol. Sci. 2013, 14(8), 16986-16998; doi:10.3390/ijms140816986, 55137=We are grateful to the “Complejo Hospitalario de Vigo”, in particular Concepción Fiaño, for providing samples and Vicent Hernández for examination of the clinical data of patients. This work was supported by ‘Fondo de Investigaciones Sanitarias’ (PI12/00117), “Xunta de Galicia” (10PXIB310215PR), REGICC (CN 2012/217) and FEDER (CN 2011/024) funding. M. Martínez-Fernández is funded by a “Juan de la Cierva” research fellowship (JCI-2010-06167) from MICINN., 113866=© 2013 by the authors; licensee MDPI, Basel, Switzerland This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution license (http://creativecommons.org/licenses/by/3.0/).}",
    "textBeforeTable": "Table 6. Primer sequences for the candidate reference genes and the target gene FUCA1. Click here to display table 5 Rectum 14 Left colon 12 Right colon Tumor location 6 Poor 21 Moderate 4 Well Tumor differentiation 12 C 11 B 8 A Tumor Dukes’ stage 70 ± 9.41 Mean ± SD 56–89 Range Age 10 Female 21 Male Gender Number of patients Clinical-pathological variable Table 5. Clinical-pathological data of the colorectal cancer (CRC) patients.",
    "textAfterTable": "© 2013 by the authors; licensee MDPI, Basel, Switzerland This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution license (http://creativecommons.org/licenses/by/3.0/). Int. J. Mol. Sci. EISSN 1422-0067 Published by MDPI AG, Basel, Switzerland RSS E-Mail Table of Contents Alert Terms & Conditions Privacy Policy Contact MDPI Jobs at MDPI © 1996-2015 MDPI AG (Basel, Switzerland) unless otherwise stated",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}