{
    "relation": [
        [
            "Subject",
            "Calculus BC (advanced)",
            "English language and composition",
            "European history",
            "Government and politics of the U.S.",
            "Macroeconomics",
            "Physics -- electricity and magnetism",
            "Spanish literature",
            "U.S. history"
        ],
        [
            "White",
            "58.6%",
            "61.7%",
            "67.9%",
            "62.4%",
            "55.4%",
            "57.3%",
            "13.1%",
            "64.2%"
        ],
        [
            "Asian",
            "26.8%",
            "10.7%",
            "12.4%",
            "12.2%",
            "18.8%",
            "27.5%",
            "3.7%",
            "11.5%"
        ],
        [
            "Latino",
            "4.6%",
            "11.8%",
            "7.5%",
            "10.7%",
            "11.4%",
            "3.9%",
            "75.1%",
            "9.8%"
        ],
        [
            "Black",
            "2.1%",
            "6.9%",
            "3.5%",
            "5.6%",
            "4.5%",
            "1.7%",
            "0.7%",
            "6.0%"
        ]
    ],
    "pageTitle": "Should AP Add African-American History? | InsideHigherEd",
    "title": "",
    "url": "https://www.insidehighered.com/news/2007/08/07/ap",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00260-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 934096923,
    "recordOffset": 934070394,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{87=Race and Ethnicity of AP Exam Test Takers, 2006}",
    "TableContextTimeStampAfterTable": "{50806=Suite 1100, 52791=1015 18th Street NW, Suite 1100 | PH: 1-202-659-9208, 53226=Copyright © 2015, 54332=Copyright © 2015, 50779=1015 18th Street NW}",
    "lastModified": "Fri, 31 Jul 2015 19:31:53 GMT",
    "textBeforeTable": "Race and Ethnicity of AP Exam Test Takers, 2006 Here are some of the breakdowns of those taking AP exams, by race and ethnicity. The numbers do not add to 100 percent because they exclude \"other\" and those who do not identify their race or ethnicity. College Board data suggest that in some cases, there may be a relationship between students' race and ethnicity and their pursuit of certain AP subjects. Latino students make up a majority, for example, in Spanish language and literature programs. Nationally, 6.9 percent of those who took AP exams last year were black, compared to a student population that is 13.7 percent black. Latino students make up 14 percent of test takers and of the student population. Asian students are overrepresented in the AP population, making up 10.9 percent, compared to 5.5 percent of the total student population. The racial and ethnic gaps are attributed to many factors and while the College Board has expanded efforts to help low-income areas offer AP programs, high schools are far from equal, with some high schools offering a full range of options and some hardly any. Some educators have questioned the fairness of colleges granting preference or extra points to applicants with many AP courses when those offerings aren't available equally. In the Pittsburgh schools, 17 percent of those taking AP courses are black -- a percentage that sounds high only until you know that the district's enrollment is 57 percent black. Lane stressed that she doesn't",
    "textAfterTable": "Trevor Packer, who runs the AP program at the College Board, stressed in an interview Monday that the organization is bothered by the racial disparities in the program and wants to see them disappear. He also noted that the rate of increase for Latino students is highest in physics, not Spanish literature, so progress can be made that does not reflect a direct cultural or historic connection to a language or area of history. Packer stressed that the College Board would \"absolutely support the notion of an AP course in African-American history,\" but that colleges don't want it. Packer said that new AP offerings tend to come from colleges, which ask the College Board to develop tests that will allow students to place out of introductory courses. He said that the College Board has never received such a request for African-American history. Given his interest in the field, Packer said he has gone to college professors and asked if they would be interested in such a course. The College Board has been told that African-American history is typically taught by a tenure-track professor (unlike many a freshman composition class or biology lab section) and that it is frequently the only African-American history course a college student takes, he added. \"So they don't want an exemption test for freshmen to skip those courses. They don't want freshmen skipping those courses,\" Packer said. Asked about the argument that many high school students take AP courses for enrichment and knowledge as",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}