{
    "relation": [
        [
            "Code No.",
            "01",
            "04",
            "07",
            "10",
            "13",
            "16",
            "19",
            "22",
            "25",
            "28",
            "31"
        ],
        [
            "Examination Centre",
            "Agartala",
            "Amritsar",
            "Bhubaneshwar",
            "Dehradun",
            "Hyderabad",
            "Jaipur",
            "Kolkata",
            "Meerut",
            "Patna",
            "Shillong",
            "Varanasi"
        ],
        [
            "Code No.",
            "02",
            "05",
            "08",
            "11",
            "14",
            "17",
            "20",
            "23",
            "26",
            "29",
            "32"
        ],
        [
            "Examination Centre",
            "Ahmedabad",
            "Bangalore",
            "Chandigarh",
            "Delhi",
            "Imphal",
            "Jammu",
            "Leh",
            "Mumbai",
            "Raipur",
            "Shimla",
            "Vijaywada"
        ],
        [
            "Code No.",
            "03",
            "06",
            "09",
            "12",
            "15",
            "18",
            "21",
            "24",
            "27",
            "30",
            ""
        ],
        [
            "Examination Centre",
            "Aizawl",
            "Bhopal",
            "Chennai",
            "Guwahati",
            "Itanagar",
            "Kohima",
            "Lucknow",
            "Nagpur",
            "Ranchi",
            "Trivandrum",
            ""
        ]
    ],
    "pageTitle": "Intelligence Bureau Assistant Central Intelligence Officer Grade II Executive Examination 2009 IB Examination - Exams in India",
    "title": "",
    "url": "http://www.winentrance.com/exams_date/Intelligence-Bureau-Assistant-Central-Intelligence-Officer-Grade-II-Executive-Exam.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00039-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 839734300,
    "recordOffset": 839726098,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{738=Assistant Central Intelligence Officer - Grade II/Executive Examination - 2009, 572=Intelligence Bureau Assistant Central Intelligence Officer Exam 2009}",
    "lastModified": "Tue, 24 Apr 2012 07:37:12 GMT",
    "textBeforeTable": "Examination Center for Intelligence Bureau Exam No cash payment will be made at the time of test or interview. No TA or other expenses will be admissible to the candidates for appearing in the test/ interview except to unemployed SC/ST candidates who will be reimbursed the fares as admissible under the Rules. Those candidates who acquire a specific standard in the written test will be interviewed, subsequently for which place and date of interview will be intimated well in advance. Only those candidates who come upto a specific standard following a preliminary screening of applications based on academic qualification, marks obtained in the examinations and depending upon the number of vacancies will be called for an objective type written test to be held at the 32 centres mentioned in Table 'A' below, the date of which will be intimated through call letters. Intelligence Bureau Selection of the Candidates: Educational Qualification for Intelligence Bureau Exam: Graduation from a recognised University or equivalent. No other proof of date of birth shall be accepted. The date of birth will invariably be taken as recorded in the Matriculation certificate. Upper age limit is relaxable by 5 years for SC / ST and 3 years for OBC and also relaxable for Government Servants upto five years in accordance with the instructions or orders issued by the Central Government. Age: Not exceeding 27 years as on the last date for receipt of application i.e. the closing date.",
    "textAfterTable": "Intelligence Bureau Examination Centre once opted will not be changed. Service Liability: Candidates selected for appointment are liable to serve anywhere in India. How to Apply for Intelligence Bureau Exam: Application on plain white paper in the prescribed format (Appendix-I) may be sent by ordinary post to: Assistant Director/Exam, Post Box No - 10924, Post Office, R K Puram (M), New Delhi - 110066. Indicating the Code No. and Examination Centre from Table 'A' at the place mentioned in the application form so as to reach on or before the closing date. The Code and Name of the Centre of Examination opted by the candidate must be superscribed in bold letters as also. Application for the post of Assistant Central Intelligence Officer Grade II/Executive on the left comer of the envelop containing the application. One copy of the recent passport size photograph duly signed by the candidate on the front side should be pasted in the space provided in the application and another copy should be attached with the admit card. Centre of Examination once opted will not be changed under any circumstances. Applications received for more than one Examination Centre from a candidate would be rejected.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}