{
    "relation": [
        [
            "Field",
            "020",
            "050 090",
            "245",
            "245",
            "260",
            "",
            "",
            "300",
            "",
            "",
            "",
            "336",
            "337",
            "338",
            "490",
            "500",
            "520",
            "521",
            "546",
            "6XX"
        ],
        [
            "Subfield",
            "",
            "",
            "",
            "$h",
            "$a",
            "$b",
            "$c",
            "$a",
            "$b",
            "$c",
            "$e",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Instruction",
            "Record if applicable",
            "See Classification",
            "Supply title if piece lacks title proper. 500 note for source of supplied title is not required.",
            "AACR2 record: [kit] [game] [model]",
            "Record or supply. If unknown: AACR2 record: [S.l.] RDA record: [Place of publication not identified]",
            "Record or supply. If unknown: AACR2 record: [s.n.] RDA record: [publisher not identified]",
            "Record of supply. If unknown: AACR2, record: [19- -?] or [20- -?] RDA, record: [date of publication not identified]",
            "Extent: 1 kit 1 game 1 toy 3 toys 1 jigsaw puzzle Number of subunits, if applicable: AACR2, record: if not in record, do not add RDA record: (various pieces)",
            "do not record",
            "if boxed, use: in box if unboxed, then supply dimenson of object",
            "do not record",
            "RDA record: three-dimensional form (Substitute or apply additional Content type terms from RDA 6.9.1.3, as applicable)",
            "RDA record: unmediated",
            "RDA record: object",
            "Record if applicable",
            "Record general notes as applicable. Use cataloger's judgment.",
            "Record a brief summary",
            "Record audience if readily available on piece",
            "Record language note if applicable. If recorded, record 043.",
            "See Subject Analysis"
        ]
    ],
    "pageTitle": "College of Education Media Center Kits and Games - Acquisitions and Discovery (Public) - NCSU Libraries",
    "title": "",
    "url": "https://staff.lib.ncsu.edu/confluence/display/MNC/College+of+Education+Media+Center+Kits+and+Games",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00037-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890907663,
    "recordOffset": 890887669,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Descriptive Metadata Procedure Create brief RDA records in Sirsi only. Do not contribute records to OCLC. Original cataloging Edit records according to local procedure. Do not remove data if supplied in record. Only add data that is required locally. Accept OCLC records as found. Retain and edit using exisiting cataloging code (e.g. if record is AACR2, edit in AACR2) Prefer fullest level OCLC record when available. Copy cataloging Policy The College of Education Media Center (CoEMC), formerly the Learning Resource Center (LRL), regularly receives kits and game materials. This policy addresses the local cataloging of these resources. CoEMC purchases and receives materials as kits. Additionally, CoEMC takes accompanying or other materials and requests that M&C catalog these materials as a kit. Mathematics manipulatives and readers both fall under the latter category. A separate policy exists for College of Education Media Center Mathematics Manipulatives kits. For other created kits, please consult your supervisor. Help Viewing restrictions apply",
    "textAfterTable": "Classification Kits and games are classified according to their topical subject area. Subject Analysis In addition to any topically relevant headings, include ONE of the following: LCSH (650) Use English language $x Study and teaching $x Foreign speakers Use for: English as a second langauge. Include heading for other language. French language   German language   Language arts   Mathematics   Reading   Social sciences Use for: Social studies Spanish language   If appropriate, include any of the following topical headings: LCSH (650) Educational games Board games Puppets Call Number/Item Record Call library = LRL Type = KIT Item library",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}