{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,177 topics 2,127,025 replies",
            "85,565 topics 1,154,252 replies",
            "1,071 topics 11,084 replies",
            "4,218 topics 64,772 replies",
            "5,997 topics 75,834 replies",
            "50,559 topics 466,368 replies",
            "22,767 topics 196,354 replies",
            "4,275 topics 60,580 replies",
            "1,127 topics 8,223 replies",
            "3,612 topics 116,017 replies"
        ],
        [
            "Last Post Info",
            "How big LS really is next t... By Xing of Virtue A minute ago",
            "Character switch scenarios By cp1dell 15 minutes ago",
            "The Ultimate 100% Save File... By Militia 11 hours ago",
            "Which Vehicle Do You Prefer? By svanderman 11 hours ago",
            "Which vehicle suits Toni? By Nico 5 hours ago",
            "GTA San Andreas Windows 8.1... By Militia 43 minutes ago",
            "Reasons why Vice City is be... By Midnight Hitman 2 hours ago",
            "Grand Theft Auto III Chain... By MrMateczko An hour ago",
            "What do you hate of GTA 2? By Cerium A day ago",
            "What was the best map of al... By rlr149 10 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=55&t=168666&p=4250651",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00227-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 106078759,
    "recordOffset": 106054451,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{116428=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 16309=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 12508=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9279=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 20717=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 47497=Bing, monkb4skunk, Soy Bean, Yahoo, epoxi, Max Payne, Google Mobile, Google, HELLREAVERS MC, Husani, TarHeelJohn, Purplefireball9, ZANTHERA, Fisciletti, Testarossa, Midnight Hitman, FlexPiTo, TheKidKash, RemyLacroix, Smooth Longsack, The Lone Wanderer, svanderman, CMCSAVAGE, Mona Sax, Officer Vic, EL_FAPiTaNo_FCB, VikDarkbomb, s2n vaniish, Peiva's Laahdin, Flame, Mr. Jago, BurnettVice, jeremy81385, TheGuyBehindYou, OG Viking, SkylineGTRFreak, bamsaidcam, hitman774, helresa, fnxrak, Pigwick, SouthLand, Fonshway, _Douglas_, boxr, gorskiegangsta, leftas, Shotty Pop, DJThanos, Speedy1st, Bread_, marhex, Lee1255, AuSsIeThUnDeR36, Johan2599, Xing of Virtue, allinclusive, BenStone, Dr WGA Labriskagni, Arms Dealer, RM76, Lowi, Bob_Dole, Marwin, Hyde Original, SharoFFenstein, ZODIAC 4 v2, meta187, ISOFX, Cognoscenti, Cheatz_N_Trickz, SolidUSP, nLytin, persistence, Cyberzone2, C64fanatic, Fleckz, Hjaere, fuchsiang, Tossin Salad, Sp00n303, Fozzie_420, HipsterHillbilly, SonofUgly, Marathon, pedrohenrique23, That1Psycho, glass pipe, FiS!!HeR, SP_ZER0_, AzTec731, Omnigosh, TheMariusz700_PL, LordRaijin, JWitfield, JoshThePunk, Junko Enoshima, Philly-boy_1er, ChrissyBoi87, Smale45, PureBeast72, Edward Nashton, Judicious 7, Radius95, jukebox, VideoGameJames, Pegassi Autobot, Jebfive, GuerrilleroESP, doubleg213, NikoBellicGTAIV, BaconBits153, Drunkmoons, GVJLIMA, Dan McChill, Juicyfer, MelloHello, MyName'sJeff, Icantthinkofonew, citizenzombie., nemigaz82, Killerman29, Officer Ronson, Corndog93, Daz, lord tammerlain, Zonnex, o_Marvelous, SalvatoreCJ1903, Bane X01, zz latios, gallardo555, deadx23, NBAKingzFan10, Setzaroth, Lewis Jephson, Phil Collin, fkikokikogta, CriminaL277, lowriderlife63, Lord Helton, Jmac, PSI-Breakaway, rlr149, RmpTebow15, Tacts_21, Retired Mafia, Mr. Doge, Jake3 HD, Turbocharger, SirPhilMcKraken, Ritu85, Dr. Sadler, JF8494, Rashkovskys Shiv, ClippedWings, KogerOnControls, acalmocean, psymin, fiebru787, Jax765, MikeyDLuffy, Xl CORKHILLZ lX, Zacgeary8, chasez, AmbientZed, CCPD, Lost Legend, Wlzeigler, Kalitu, 313izzle, Gridl0k, fullxthrottle94, Lord of sandbox, _CP_, Crimson Flam3s, GTAFanClub, Blackhailer, nerdsnacks12, RedDagger, ParsoOnFire, StepNaza, Jitterbug, !M4G3_N4T10N, Donel, robban, ThirteenAG, Tony_Florence, ClaudX, FUBAR1991, Cjs3315, Valanga, TheMcSame, Craank_AG, No_Flex_zone, Lay, nkjellman, Rammjager, A.O.D.88, C06alt, smokingndriving, Krystofer, SpooferJahk, IDredMan, Skip_Chizzlenuts, GTASanAndreasV, James_158202, eralebus, Cudwieser, Electrogypsy, NikoB08, Zeuez, BluePhoenix, wtf is a madrazo, Imb44tu, missanthropy, BearClawHD, Total Failure, gtaguy95, Hayden92, blakeney, arewenotmen, darkmajesty06, KlIIUMlNATl, A Maned Wolf, JuanG12, unikatil, Heists, Epic., dewtech_2008, SQH, statistic, Ezekeil2Ofive17, Marticus, chet87, supanaut, gtafan26, Thousand Accent, Coleco, LZoleee, Verstappen, Awesom-0, RayB_ThrowaStack, r.lorenzo13, Bellic920, Malikstuntin, ash-274, BoomBapPoet, Tegan, xTOMMYTROJANx, lol232, Gnarwolf, Stidge uk, JD_0125, GradientDruid, Macinho, ReRo, Pavle, Ray, theNGclan, catmandoza, Wolfhuman, totallynotalion, ChickenAndBeer, Madgaz182, PoeticWhisper, shivix, eimaj1779, Days Are Gone, ClaudeSpeed1911, 14058=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 18567=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By VikDarkbomb The Groove 614,586 replies 15,219 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Commander S Show us your NG character!... 2,292,044 replies 113,732 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,516 topics 416,572 replies [3ds Max] San Andreas refle... By MrGTAmodsgerman 18 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}