{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,110 topics 2,124,565 replies",
            "85,555 topics 1,153,819 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,760 replies",
            "5,996 topics 75,812 replies",
            "50,546 topics 466,197 replies",
            "22,766 topics 196,296 replies",
            "4,270 topics 60,448 replies",
            "1,127 topics 8,213 replies",
            "3,599 topics 115,385 replies"
        ],
        [
            "Last Post Info",
            "Story Mode DLC discussion t... By mobe 2 minutes ago",
            "GTA IV confessions By Mr. Fahrenheit 9 minutes ago",
            "Why does this game receive... By Sayuri 20 minutes ago",
            "Whats your favourite radio... By LilithAkuma 25 minutes ago",
            "Unique Vehicles By Militia 9 hours ago",
            "Catalina Appreciation Thread By zmudziak32 28 minutes ago",
            "100% checklist tool on GTAS... By GTAGuy1995 An hour ago",
            "Grand Theft Auto III Pre-Re... By A8ul99 58 minutes ago",
            "Anybody has a 100 % savegame? By Cerium 2 days ago",
            "Old Skool Tricks In GTA By Phoenix_Poop 25 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=267&t=553952&p=1062447026",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00204-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 108790383,
    "recordOffset": 108764361,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12613=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 47436=Mika_0013, Google, ThirteenAG, Huraldo, Bing, STEEZYR, Jinx., alex8b, Yahoo, r.lorenzo13, gizmonomono, Jacob_Rivera_11232, GTA Master, svanderman, XenoxX, Chips237, CrysisAverted, VeraVanderpump, Lester-The-Molester, NikoB08, quadro09, OfficialRedNinja, SureOrange4486, gajrajgchouhan, Haashir911, Corndog93, funmw2, Sentinel Driver, NightSpectre, Nameless Foot Soldier, Alec Skorpio, Pigeon420, Stormingz, trevorjc2511, ezento, Saintdestroyer, Axe_Gaijin, v1p3r_eddy, Duxfever, boss06, ermaccer, Marty McFly, CML99, RJSanModder, maddhatter501, sherip008, Johnny Alpha, Mr Walker, CarloSpicyWeiner, thafablifee46, SirBurka_, -Quantum-, michael de santa shit, gengas, Majesticnug420, emiliumium, Carbonox, The Hero, Doktor Gott, pinche_mayos, uncredited, Zoolock, Retired Mafia, Halal Cyborg, SwaGGer_1337, Google Mobile, PANiC ATTACK3R, kzstone, Officer620, CyberGhost101, drzayas, GeneralSteve93, ten-a-penny, raymond_calitri, saikolemon, ManassaxMauler, AK47-Mentalman, stephcurryMVP, Mithridates158, Mr. Fahrenheit, Ezza., hitman774, Loudy, mysterio89, B-Right, ngcLink00, progamer1258, LMB10, Djeli, shadowoperative, gta4_player, jollythecat, TG_Stig, Valtiel150, Quinn_flower, thewhitehammer99, sebcreed, JimmyFantastic, SuperGTFan, A Siente, Remix1994PL, jdwarfer, toxluv, GamesBoy316, Masiku, Andreas, Eternal-Enemies, mihajlo_kingston, Rooster Mods, RobinVerhulstZ, GazLUFC93, Estraikerful, Colbydogs, Lonely_Screwdriver, Facebook, KlIIUMlNATl, Terroryaki, oleg_aka_djmeg, Gabriela_L, Rico UK, shadowkill98, TheHellcat, crashrock2, MWF-709, DM98xKONATA, Mrgrandis_HKG, Miss Blossom, dbthesuperstar, silentkiller44, Parikshit Singh, killa python, unknown57, Jon3s, size_m, Billiam301, Cancerslug, AERS, zSaintX, Demoz, orcdog, LoH Will I Am, MIGta, Jeansowaty, degas93, teagle, xink, ItsOnlyMac, Thompson98, Riqitch8, maxx1013, MeatSafeMurderer, DatGtaGamer, GrandMaster Smith, CarimboHanky, Sky_Light12, Bubbles_Shed, TheMcSame, Zolika1351, ji.Ruichi, EarlyLifeFailure, S5FIFTY, Vanzant, lazlow555, DeaconBlues, level232323, xxJ0n4Th0Nxx, Superfrogger, Reywas1, SpooferJahk, Furry_Monkey, DANIEL3GS, arewenotmen, FiS!!HeR, -Anti-, Owl Man, gamefriik200, DeucesR, MarshallRawR, ghoraaa, JohnnyCallisto, MKKJ, MyNameJeff, scalliano, Carlover325, RaptorDaptor, PcCI2iminal, Locce, TJGM, AcidRunner, Oldsmobile_85, 98429=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 20942=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 18721=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 16491=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 9537=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 14182=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By quadro09 The Paleto Bay Mayors Offic... 613,364 replies 15,198 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By size_m GTA Online Sniper Guide 2,282,892 replies 113,405 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,462 topics 416,617 replies [V] Script/Native Documenta... By GRANDHEIST 41 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}