{
    "relation": [
        [
            "Forum",
            "Woodworking Skill Share Your woodworking skills are displayed for several lifetimes in each project. Have you had to compromise your project...",
            "Woodturning On the lathe, by the lathe: do you have questions? frustrations? tips? This forum is for all the woodturners out there.",
            "Woodcarving Relief, 3D, chip-carving, whittling; carving knives, chisels, pocket-knives, power tools. If you are a carver or want...",
            "Scrollsawing Intarsia, fretwork, intricate design cutting and more! This forum is for scrollsawers: share your tips, ask questions...",
            "Joinery Have a question? a tip/strategy to share? a challenge, perhaps? Share your \"joinery\" discussion here.",
            "Finishing The finish, whether paint, wax, stain, or something else, can make or break a project. What are your tips and questio...",
            "Designing Woodworking Projects Looking for information on designing your projects? Having difficulties reading project plans? Looking for help with ...",
            "Power Tools, Hardware and Accessories Are you unsure of which tools, or hardware, you need, or which brands to buy? Investing in tools and hardware can be ...",
            "CNC Woodworking Questions and answers about CNC machines, tooling, best practices, and projects.",
            "Hand Tools Wood, your hand tools, you and a little know-how. Share your questions, tips and strategies for the use and maintenan...",
            "Jigs & Fixtures Using a jig is like having a couple extra hands helping out. Show us your jigs, share your tips, strategies and, of c...",
            "Wood & Lumber Different wood requires different woodworking strategies - from cutting to finishing. Share your tips and challenges ...",
            "Safety in the Woodworking Shop Before you pick up those woodworking tools, take the time to ensure your safety in the shop! Eyes, ears, fingers, and...",
            "Focus on the Workspace Are you looking for or do you have tips to share regarding the workshop? Storage, equipment placement, efficiency, an...",
            "Sweating for Bucks Through Woodworking If you are selling your work, then you have entered a woodworking dimension with added complexity and stress. If you...",
            "Woodworking Trade & Swap All of us are holding onto treasure in our shops, that we either don't need, don't want, or could part with if presen...",
            "LumberJocks.com Site Feedback Connect with the Website Gurus and tell us what you are thinking, suggestions, problems, functionality issues, and so...",
            "Coffee Lounge Need a break from all the standing and wood dust? Chat with your Forum Friends about their projects, their life, thei..."
        ],
        [
            "Topics",
            "10490",
            "1087",
            "224",
            "204",
            "698",
            "3228",
            "5106",
            "21970",
            "71",
            "3860",
            "1001",
            "4655",
            "1121",
            "1563",
            "1038",
            "3793",
            "1951",
            "7769"
        ]
    ],
    "pageTitle": "Apology from Work Sharp - by WorkSharp @ LumberJocks.com ~ woodworking community",
    "title": "",
    "url": "http://lumberjocks.com/topics/21060",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00052-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 146391675,
    "recordOffset": 146367838,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14762=Thank you for your comment Praki. This is one of many reasons we chose to create a new website. Feedback such as yours was indeed heard and incorporated into our new site. Our new site is not perfect, but we continue to work hard to improve it. Please know that we have an upgrade program where you can trade in your WS2000 for a WS3000 for a modest cost. Call one of our customer service reps to learn more: 800-597-6170, 12388=#5 posted 10-14-2010 11:09 PM, 8258=1984 posts in 1945 days, 16207=#7 posted 10-15-2010 12:00 AM, 21120=#10 posted 10-15-2010 01:33 AM, 1981=10-14-2010 08:05 PM, 24768=#12 posted 10-19-2010 05:37 PM, 6747=#2 posted 10-14-2010 08:29 PM, 29528=2136 posts in 2082 days, 10311=#4 posted 10-14-2010 09:37 PM, 5067=#1 posted 10-14-2010 08:10 PM, 8410=#3 posted 10-14-2010 08:44 PM, 12710=Yes, the 50% off fiasco is pretty disappointing but. I am a wee bit happy to see a post here explaining it. I bought a WS 2000 when it came out and soon discovered that it wasn’t really what I needed. I am very disappointed that its limitations were not explained well enough as they are now in the FAQ on your website. If the differences between 2000 and 3000 were apparent, I would have sprung for the 3000 and we would both be happier., 14440=#6 posted 10-14-2010 11:23 PM, 25091=I just talked with a CSR Spokesperson at Worksharp.Their modest cost to upgrade from a 2000 to a 3000 is 100 dollars, which ain’t to bad but ain’t too modest either as I told the CSR spokesperson on the phone. However, she did say she would through in an extra plate, a 31 dollar value if I decided to upgrade. Does this sound like a deal to you guys? Not bad as far as I’m concerned. mike, 23088=#11 posted 10-15-2010 02:57 AM, 4915=1136 posts in 2432 days, 26579=#13 posted 10-19-2010 10:57 PM, 19569=#9 posted 10-15-2010 01:29 AM, 29680=#15 posted 10-20-2010 04:31 AM, 28087=#14 posted 10-19-2010 11:14 PM, 17890=#8 posted 10-15-2010 12:20 AM, 19417=1537 posts in 2169 days, 50715=©2015 Verticalscope Inc. All Rights Reserved. | Terms of Service | Privacy Policy, 2367=The promotional offer was turned off yesterday, October 13. A new offer was sent to the same subscribers offering a 20% manufacturers rebate good on all Work Sharp purchases at any of our dealer locations. This new offer is valid through the end of October and available to our registered users on worksharptools.com. Our goal is to restore your faith in us and support our business relationship with our retail partners.}",
    "textBeforeTable": "Show all forums View all topics Start new topic signed in to reply. You must be Have your say...show last 8 replies showing 1 through 15 of 23 replies View all replies » -- There is little that is simple when it comes to making a simple box. David I have much respect for the Work Sharp folks and while I am ignorant of the issue, I agree with Neil and Dennis that seeing a company buck up, take responsibility and publicly apologize is admirable. I have had the WS 3000 for about 6 months now and I couldn’t be happier with the product. Good technology has a price tag on it. But I think the price reasonable for the end result of what this product does. #15 posted 10-20-2010 04:31 AM 2136 posts in 2082 days",
    "textAfterTable": "All Posts RSS Projects RSS Blog Entries RSS Reviews RSS Forum Topics RSS Site Blog Entries RSS Go to Pulse page » LumberJocks Pulse   Author Latest activity New comments or replies",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}