{
    "relation": [
        [
            "Date",
            "Apr 20, 1998",
            "Nov 22, 2004",
            "Nov 24, 2008",
            "Dec 31, 2012",
            "May 22, 2013",
            "Jul 9, 2013"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: RAMBUS, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:PERINO, DONALD V.;DILLON, NANCY DAVID, EXECUTOR OF THE ESTATE OF JOHN B. DILLON, DECEASED;REEL/FRAME:009127/0914;SIGNING DATES FROM 19980403 TO 19980414",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20130522"
        ]
    ],
    "pageTitle": "Patent US6234820 - Method and apparatus for joining printed circuit boards - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6234820?ie=ISO-8859-1&dq=7,003,515",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00067-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471811755,
    "recordOffset": 471781411,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations In the foregoing specification, the invention has been described with reference to specific embodiments. It will, however, be evident that various modifications and changes may be made without departing from the broader spirit and scope of the invention. The specification and drawings are to be regarded in an illustrative rather than a restrictive sense. A socket 925 is attached to the mother board 910 using a screw 920. Traces 975 on the mother board 910 are coupled to leads 935, which are wrapped around the front of the socket 925. The leads 935 of the mother board 910 are in contact with the leads 955 of the daughter board 915 when the mother board 910 and daughter board 915 are coupled to each other. The socket 925 has an opening 928 defined by a protrusion shaped like a hook 930. The hook 930 is slightly flexible, such that when the protrusion 950 of the connector 945 is inserted into the socket 925, the hook 930 flexes, permitting insertion. FIG. 9 is an illustration of another alternative embodiment of the printed circuit boards. The arrangement is similar to the arrangement described above. A connector 945 is attached to the daughter board 915 using a screw 940, or other means of attachment. The connector 945 has a protrusion 950 shaped like a knob at its top, while its base is attached to the daughter board 915. The traces",
    "textAfterTable": "US4678252 * May 27, 1986 Jul 7, 1987 Rockwell International Corporation Electrical connector for circuit boards US4714435 * Mar 5, 1987 Dec 22, 1987 Molex Incorporated Connection for flexible apparatus US4795079 Mar 27, 1986 Jan 3, 1989 Canon Kabushiki Kaisha Structure of joining printed circuit boards and process for producing the same US4798541 Sep 2, 1987 Jan 17, 1989 Ncr Corporation Right angle electrical connector US4850892 Feb 3, 1988 Jul 25, 1989 Wang Laboratories, Inc. Connecting apparatus for electrically connecting memory modules to a printed circuit board US4885126 Mar 18, 1988 Dec 5, 1989 Polonio John D Interconnection mechanisms for electronic components US4891023 Aug 22, 1988 Jan 2, 1990 Molex Incorporated Circuit card edge connector and terminal therefor US4939570 Jul 25, 1988 Jul 3, 1990 International Business Machines, Corp. High power, pluggable tape automated bonding package",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}