{
    "relation": [
        [
            "Citing Patent",
            "US7875082 *",
            "US7905919",
            "US8052755 *",
            "US8313531",
            "US8343226",
            "US8449617",
            "US8540779",
            "US8632598",
            "US8663334 *",
            "US8845743",
            "US8858641 *",
            "US8906102 *",
            "US8992627",
            "US8998994",
            "US20130325130 *",
            "US20130325133 *",
            "US20130325134 *"
        ],
        [
            "Filing date",
            "May 9, 2008",
            "Feb 26, 2010",
            "Jan 29, 2009",
            "Apr 28, 2010",
            "Jul 2, 2008",
            "Nov 16, 2011",
            "Feb 10, 2011",
            "Mar 14, 2013",
            "May 31, 2012",
            "Oct 12, 2012",
            "Nov 28, 2012",
            "Feb 14, 2013",
            "Aug 22, 2013",
            "Jan 18, 2013",
            "May 31, 2012",
            "Nov 28, 2012",
            "Feb 14, 2013"
        ],
        [
            "Publication date",
            "Jan 25, 2011",
            "Mar 15, 2011",
            "Nov 8, 2011",
            "Nov 20, 2012",
            "Jan 1, 2013",
            "May 28, 2013",
            "Sep 24, 2013",
            "Jan 21, 2014",
            "Mar 4, 2014",
            "Sep 30, 2014",
            "Oct 14, 2014",
            "Dec 9, 2014",
            "Mar 31, 2015",
            "Apr 7, 2015",
            "Dec 5, 2013",
            "Dec 5, 2013",
            "Dec 5, 2013"
        ],
        [
            "Applicant",
            "Remi Sciences, Inc.",
            "Biomedflex Llc",
            "Remi Sciences, Inc.",
            "Hip Innovation Technology Llc",
            "Lima-Lto Spa",
            "Biomet Manufacturing Corp.",
            "Hip Innovation Technology Llc",
            "Biomet Manufacturing, Llc",
            "Howmedica Osteonics Corp.",
            "Hip Innovation Technology, LLC",
            "Howmedica Osteonics Corp.",
            "Howmedica Osteonics Corp.",
            "Hip Innovation Technology Llc",
            "Biomet Manufacturing, Llc",
            "Howmedica Osteonics Corp.",
            "Howmedica Osteonics Corp.",
            "Howmedica Osteonics Corp."
        ],
        [
            "Title",
            "Ulnar head prosthesis system",
            "Prosthetic joint",
            "Ulnar head prosthesis system",
            "Interlocking reverse hip prosthesis and method",
            "Humeral prosthesis",
            "Convertible glenoid implant",
            "Product and methods for interlocking reverse hip and revision prosthesis",
            "Convertible glenoid implant",
            "Lateral entry insert for cup trial",
            "Interlocking reverse shoulder prosthesis method",
            "Lateral entry insert for cup trial",
            "Lateral entry insert for cup trial",
            "Interlocking reverese hip and revision prosthesis and method",
            "Humeral implant having a floating bearing",
            "Lateral entry insert for cup trial",
            "Lateral entry insert for cup trial",
            "Lateral entry insert for cup trial"
        ]
    ],
    "pageTitle": "Patent US7470287 - Shoulder or hip prosthesis - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7470287?ie=ISO-8859-1&dq=7,446,777",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00188-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 462827671,
    "recordOffset": 462800163,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6432=As is more particularly visible in FIGS. 10 and 12 where the cup 231 has been omitted to render the drawings clearer, the head 217 has a length L217 greater than the width l233 of the opening 233 over the greatest part of its length. In order to allow the introduction of the head 217 in the interior volume V203 of the component 203, the opening 233 is provided with a widened zone 234 made in the vicinity of one of its ends and of which the width l234 is greater than the length L217. In order to guarantee that the head 217 is retained in the volume V203, the ring 232 is provided with two heels 238 and 238′ intended to come into abutment against the exposed face 212 a of the metaphyseal part 212 when the component 201 is in place in the humerus, this blocking the ring 232 in the configuration of FIGS. 11 and 12 and avoiding a displacement of the head 217 in the direction of arrow F1 in FIG. 12, thus preventing an alignment of this head with the opening 204 and, consequently, the withdrawal of the head 217 from the volume V203. In this way, when the head 217 has been introduced in the volume 11203, it participates in the resistance of the assembly of the prosthesis P.}",
    "textBeforeTable": "Patent Citations The characteristics of the different forms of embodiment may be combined together. In particular, the prosthesis of the second embodiment may be adapted to the shoulder, while the prostheses of the first and third embodiments may be adapted to the hip. The invention has been shown when used in total shoulder and hip prostheses. However, it is applicable with a shoulder prosthesis not having a glenoidal component, the anatomical surface of articulation of the glenoid cavity being used instead of the surface S2 represented in the Figures. Similarly, in the case of a hip prosthesis, the natural acetabular cavity may be used. As in the first embodiment, the surface S′1 is defined between the edges parallel to direction Y3 forming a slideway and between which the flange 218 may be introduced. Similarly, the surfaces S1 and S′1 may be portions of a sphere or of a cylinder, and even of other surfaces of adapted shape. The width l233 is slightly greater than the diameter d216 of the stem 216. According to another variant of the invention (not shown), elements in relief with the same function as the heels 238 and 238′ may be provided on the face 212 a, and even on both components 201 and 203. . FIG. 12 According to a variant of the invention (not shown), the function of the heels 238 and 238′ might",
    "textAfterTable": "US4550450 Jul 24, 1984 Nov 5, 1985 Kinnett James G Total shoulder prosthesis system US4693372 Dec 9, 1985 Sep 15, 1987 W. R. Grace & Co., Cryovac Div. Taped bag chain with cassette US4822370 Jun 20, 1988 Apr 18, 1989 Orthoplant Endoprothetik Hip joint femoral prosthesis US4846840 Dec 21, 1987 Jul 11, 1989 Sylvain Leclercq Joint prosthesis US4865605 Feb 2, 1988 Sep 12, 1989 Dines David M Modular shoulder prosthesis US4865609 Mar 2, 1988 Sep 12, 1989 Bioconcepts, Inc. Modular joint prosthesis assembly and method of removing US4892549 Jan 31, 1989 Jan 9, 1990 Osteonics Corp. Dual-radius acetabular cup component US4919670 Feb 3, 1988 Apr 24, 1990 Intermedics Orthopedics, Inc. Modular humeral prosthesis US4957510 Jul 26, 1988 Sep 18, 1990 Patrizio Cremascoli Hip prosthesis structure adapted for easy fitting to the patient coxo-femural articulation",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}