{
    "relation": [
        [
            "Citing Patent",
            "US7768730 *",
            "US7843267 *",
            "US7894151 *",
            "US8027415 *",
            "US8027416 *",
            "US8175562 *",
            "US8645094 *",
            "US20110037457 *",
            "US20150180497 *"
        ],
        [
            "Filing date",
            "Feb 15, 2008",
            "Apr 25, 2007",
            "Feb 15, 2008",
            "Apr 19, 2007",
            "Mar 6, 2008",
            "Oct 27, 2006",
            "Jun 20, 2007",
            "Aug 13, 2009",
            "Dec 20, 2013"
        ],
        [
            "Publication date",
            "Aug 3, 2010",
            "Nov 30, 2010",
            "Feb 22, 2011",
            "Sep 27, 2011",
            "Sep 27, 2011",
            "May 8, 2012",
            "Feb 4, 2014",
            "Feb 17, 2011",
            "Jun 25, 2015"
        ],
        [
            "Applicant",
            "Broadcom Corporation",
            "Broadcom Corporation",
            "Broadcom Corporation",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "Agere Systems Inc.",
            "Altasens, Inc.",
            "Himax Technologies Limited",
            "Motorola Solutions, Inc"
        ],
        [
            "Title",
            "Base line control electronics architecture",
            "Operational-based compensation of a power amplifier",
            "“Flat analog” AFE coupled with an all digital architecture compensation read channel",
            "Data communications systems",
            "Structure for data communications systems",
            "Automatic gain control for enhanced bit error rate performance",
            "Accurate gain implementation in CMOS sensor",
            "Readout apparatus for current type touch panel",
            "Systems and methods for using a digital power amplifier controller (dpac) having forward-loop correction and feedback-loop correction"
        ]
    ],
    "pageTitle": "Patent US7498882 - Signaling system with low-power automatic gain control - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7498882?dq=5631832",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043058631.99/warc/CC-MAIN-20150728002418-00149-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486465135,
    "recordOffset": 486430451,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While the invention has been described with reference to specific embodiments thereof, it will be evident that various modifications and changes may be made thereto without departing from the broader spirit and scope of the invention. For example, features or aspects of any of the embodiments may be applied in combination with any other of the embodiments or in place of counterpart features or aspects thereof. Accordingly, the specification and drawings are to be regarded in an illustrative rather than a restrictive sense. ’) is also used to indicate an active low signal. The term “coupled” is used herein to express a direct connection as well as a connection through one or more intervening circuits or structures. The term “exemplary” is used to express an example, not a preference or requirement. <signal name> In the foregoing description and in the accompanying drawings, specific terminology and drawing symbols have been set forth to provide a thorough understanding of the present invention. In some instances, the terminology and symbols may imply specific details that are not required to practice the invention. For example, the interconnection between circuit elements or circuit blocks may be shown or described as multi-conductor or single conductor signal lines. Each of the multi-conductor signal lines may alternatively be single-conductor signal lines, and each of the single-conductor signal lines may alternatively be multi-conductor signal lines. Signals and signaling paths shown or described",
    "textAfterTable": "1 European Patent Office, PCT, \"Invitation to pay additional fees\", PCT/US2007/066511, Dec. 10, 2007, 5 pgs. Referenced by Citing Patent Filing date Publication date Applicant Title US7768730 * Feb 15, 2008 Aug 3, 2010 Broadcom Corporation Base line control electronics architecture US7843267 * Apr 25, 2007 Nov 30, 2010 Broadcom Corporation Operational-based compensation of a power amplifier US7894151 * Feb 15, 2008 Feb 22, 2011 Broadcom Corporation “Flat analog” AFE coupled with an all digital architecture compensation read channel US8027415 * Apr 19, 2007 Sep 27, 2011 International Business Machines Corporation Data communications systems US8027416 * Mar 6, 2008 Sep 27, 2011 International Business Machines Corporation Structure for data communications systems US8175562 * Oct",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}