{
    "relation": [
        [
            "Date",
            "Sep 10, 1997",
            "Feb 19, 2003",
            "Apr 4, 2007",
            "Sep 14, 2007",
            "Nov 6, 2007"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: SIEMENS AKTIENGESELLSCHAFT, GERMANY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:VAN DER LINDEN, KLAUS;HAACK, OLAF;RUTTEL, MARTIN;REEL/FRAME:009112/0352;SIGNING DATES FROM 19970826 TO 19970828",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20070914"
        ]
    ],
    "pageTitle": "Patent US5950619 - Ultrasonic atomizer device with removable precision dosating unit - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5950619?ie=ISO-8859-1&dq=5726663",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043058631.99/warc/CC-MAIN-20150728002418-00295-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480490627,
    "recordOffset": 480449170,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{84430=To get an extremely precise amount of expelled medicament or to detect a comparatively large increase of friction in the motor 10 and/or in the dosating unit 14, the current motor speed is controlled via a motor sensor 92 and an electrical phase comparator 112 on the electronic circuit 6. The motor sensor 92 is an impulse generator, which is mounted on the motor shaft, so the impulse-frequency is ideally identical with the driving frequency. The impulse-frequency is compared via the phase comparator 112 with the driving frequency of the DC-motor 10. If the actual impulse-frequency of the motor 10 differs from the driving frequency, the controller regulates the driving frequency via the pulse generator 111 in such a way that the impulse-frequency of the motor 10 is exactly 1200 Hz. In case of a too-large deviation of the actual rotational angle from the desired rotational angle, the warning device 114 is energized indicating that the user of the pocket inhalator device should change the dosating unit 14, or possibly have the motor 10 examined., 71675=Referring to FIGS. 7A and 7B, the valve 42 is seen in place relative to the atomization surface 28 from the front (FIG. 7A) and the side (FIG. 7B). The atomization surface 28 is provided in accordance with the teachings of EP 0 689 879 A1, which is parallel to a U.S. application by Klaus van der Linden, Olaf Haack and Randolf Mock, filed Jun. 29, 1995, claiming priority of German application No. P 44 22 822.8 of Jun. 29, 1994, and incorporated herein by reference. The structure shown in that application is particularly suited to atomizing liquid for administering medication and thus it is contemplated that it will be used in the inhalator device 2 herein. However, as that application points out, it is important to proper operation that the liquid to be atomized be delivered to the highest point of the atomization surface 28 in order to properly atomize the liquid for medicament delivery., 81219=During this time, the plunger 66 is moved via the motor 10 in the direction of the arrow 68 (see FIG. 4) to propel the medicament through the pipe 40. For high moving precision, the motor 10 is a DC-motor, which is driven by electrical pulses of a pulse-generator 111 which works regulated by the controller 100 at a frequency of approximately 1200 Hz. Alternatively, the motor 10 is a stepping-motor. The resulting fluid pressure opens the valve 42 and the liquid is supplied directly and continuously onto the atomization surface 28. The construction of the dosating unit 14 as well as the regulation of the motor-speed, which is described in more detail below, is such that an extremely precise amount of medicament can be expelled at a finely controlled rate of flow that matches exactly the characteristics of the atomization surface 28 and the piezoelectric element 26. As a result, the medicament liquid is atomized efficiently and consistently, thus providing optimum delivery of the medicament. Accordingly, medication is delivered without the waste incidental to prior delivery systems that required more than the necessary amount to be made available just to ensure that an efficacious dose reached the patient's lungs.}",
    "textBeforeTable": "Patent Citations In general, it is to be understood that this invention is not limited to the precise embodiments discussed above, and that various changes and modifications in such embodiments, in addition to those already specifically noted, can be effected without departing from the spirit or scope of the invention, which is intended to be defined solely by the following claims. It will be appreciated that even though the present invention has been described in terms of a medication-delivery system, it has wider application as an atomizer for any suitable purpose, particularly in, but not limited to, those cases in which a precise amount of fluid is to be atomized and/or maintaining antiseptic conditions is important. In general, it must be emphasized that the electronic circuit 6, which is drawn schematically in FIG. 10, could alternatively be provided with other electronical components, such as a programmable computer chip on board, including all the above described features. To enable factory tests, parameter settings and the like with usual computer hardware, a serial port 200, symbolized by arrows, is also provided. Via that serial port 200, the controller 100 can be connected to such hardware. Furthermore, the electronic circuit 6 preferably includes a 34 bit PROM-cell 115 for factory settings. Additionally, the controller may be connected to an optional start switch 116, which can be breath actuated. The electronic circuit 6 furthermore is so provided that depending upon the available",
    "textAfterTable": "Lear Siegler Inc Method and apparatus for injecting contrast media into the vascular system US3812854 * Oct 20, 1972 May 28, 1974 R Buckles Ultrasonic nebulizer US4094317 * Jun 11, 1976 Jun 13, 1978 Wasnich Richard D Nebulization system US4109863 * Aug 17, 1977 Aug 29, 1978 The United States Of America As Represented By The United States Department Of Energy Apparatus for ultrasonic nebulization US4113809 * Apr 4, 1977 Sep 12, 1978 Champion Spark Plug Company Hand held ultrasonic nebulizer US4128407 * Nov 3, 1975 Dec 5, 1978 James Frederick Chapel Sterile oxygen system and replaceable filter therefore US4155490 * Jul 5, 1977 May 22, 1979 Beckman Instruments, Inc. Fluid dispenser US4191187 * Mar 8, 1978 Mar 4, 1980 National Research Development Corporation Medical apparatus",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}