{
    "relation": [
        [
            "Date",
            "Mar 23, 1995",
            "Dec 20, 1999",
            "Dec 29, 2003",
            "Jan 2, 2008",
            "Mar 14, 2008",
            "Apr 15, 2008"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: ZENITH ELECTRONICS CORP, ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:BESTLER, CAITLIN B.;RABII, KHOSRO M.;REEL/FRAME:007391/0853 Effective date: 19950206",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: ZENITH ELECTRONICS LLC, ILLINOIS Free format text: CONVERSION;ASSIGNOR:ZENITH ELECTRONICS CORPORATION;REEL/FRAME:020654/0328 Effective date: 20070131",
            "Owner name: LG ELECTRONICS INC., KOREA, REPUBLIC OF Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ZENITH ELECTRONICS LLC;REEL/FRAME:020794/0890 Effective date: 20080415"
        ]
    ],
    "pageTitle": "Patent US5535206 - Upstream data transmission system for cable television - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5535206?ie=ISO-8859-1&dq=7143430",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043058631.99/warc/CC-MAIN-20150728002418-00172-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473540679,
    "recordOffset": 473513405,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27774=This application is a continuation-in-part of application Ser. No. 08/337,796, filed Nov. 14, 1994 now abandoned.}",
    "textBeforeTable": "Patent Citations While particular embodiments of the invention have been shown and described, it will be obvious to those skilled in the art that changes and modifications may be made without departing from the invention in its broader aspects. For example, the disclosed upstream transmission system can also be used in a network where the downstream signals are of an analog nature, or a hybrid network where some of the downstream signals are analog and some are digital. Where a decoder capable of only processing the downstream analog signals is used, the time slots would be synchronized to an appropriate reference parameter of the downstream analog signal and a downstream data channel such as the analog signal VBI (or preferably an out-of-band FM channel) would be used to download the upstream parameter values to microprocessor 40. Therefore, the aim in the appended claims is to cover all such changes and modifications as fall within the true spirit and scope of the invention. It should be noted that the frequency of the carrier signal is controlled by programmable values of tuning voltage as well as frequency divider values M and N. Thus, the carrier frequency of transmission modulator 120 is readily established or changed using the programmable values providing substantial flexibility for the present invention upstream data transmission system. The carrier frequency signal produced by discrete time oscillator 230 is applied to one input of modulator 265. The transmission",
    "textAfterTable": "US6226794 Sep 16, 1997 May 1, 2001 Sarnoff Corporation Set top terminal for an interactive information distribution system US6230203 Mar 14, 1997 May 8, 2001 Scientific-Atlanta, Inc. System and method for providing statistics for flexible billing in a cable environment US6249523 Apr 11, 1997 Jun 19, 2001 Scientific-Atlanta, Inc. Router for which a logical network address which is not unique to the gateway address in default routing table entries US6272150 May 5, 1997 Aug 7, 2001 Scientific-Atlanta, Inc. Cable modem map display for network management of a cable data delivery system US6282208 Dec 17, 1997 Aug 28, 2001 Scientific-Atlanta, Inc. Data traffic control in a data modem system US6285681 * Apr 13, 1998 Sep 4, 2001 General Instrument Corporation Variable length burst transmission over the physical layer of a multilayer transmission format US6286058 Apr 14, 1997 Sep 4, 2001 Scientific-Atlanta, Inc. Apparatus and methods for automatically rerouting packets in the event of a link failure",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}