{
    "relation": [
        [
            "Citing Patent",
            "US7975062",
            "US7987155 *",
            "US8046818 *",
            "US8497788 *",
            "US8514891 *",
            "US8621099",
            "US8799969",
            "US8838810",
            "US9077368",
            "US20130198789 *"
        ],
        [
            "Filing date",
            "Jan 7, 2007",
            "May 2, 2008",
            "Feb 19, 2009",
            "Apr 25, 2012",
            "Sep 15, 2008",
            "Dec 10, 2009",
            "May 13, 2011",
            "Apr 27, 2012",
            "Jul 29, 2013",
            "Dec 15, 2008"
        ],
        [
            "Publication date",
            "Jul 5, 2011",
            "Jul 26, 2011",
            "Oct 25, 2011",
            "Jul 30, 2013",
            "Aug 20, 2013",
            "Dec 31, 2013",
            "Aug 5, 2014",
            "Sep 16, 2014",
            "Jul 7, 2015",
            "Aug 1, 2013"
        ],
        [
            "Applicant",
            "Sling Media, Inc.",
            "Dennis Fernandez",
            "Interval Licensing Llc",
            "Pure Storage Inc.",
            "Microsoft Corporation",
            "Sling Media, Inc.",
            "Sling Media, Inc.",
            "Sling Media, Inc.",
            "Pure Storage, Inc.",
            "Adobe Systems Incorporated"
        ],
        [
            "Title",
            "Capturing and sharing media content",
            "Network extensible reconfigurable media appliance",
            "System and method for the broadcast dissemination of time-ordered data",
            "Efficient techniques for aligned fixed-length compression",
            "Media stream splicer",
            "Systems and methods for formatting media content for distribution",
            "Capturing and sharing media content",
            "Systems and methods for establishing connections between devices communicating over a network",
            "Efficient techniques for aligned fixed-length compression",
            "Transmitting Datastreams to Late Joining Broadcast Subscribers"
        ]
    ],
    "pageTitle": "Patent US7565681 - System and method for the broadcast dissemination of time-ordered data - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7565681?dq=6,373,753",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043058631.99/warc/CC-MAIN-20150728002418-00185-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486830684,
    "recordOffset": 486764857,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45063=A broadcast technique which offers such a possibility is described in U.S. Pat. Nos. 5,751,336 and 5,936,659, as well as related publications “Pyramid Broadcasting for Video On Demand Service,” by S. Viswanathan and T. Imielinski, SPIE Proceedings, Vol. 2417, pp. 66-78, February 1995, and “Metropolitan Area Video-On-Demand Service Using Pyramid Broadcasting” by Viswanathan and Imielinski, Multimedia Systems, Vol. 4, pp. 197-208, 1996. In the technique described in these documents, each movie is divided into segments of increasing size, and each segment is repeatedly transmitted in an associated logical channel of the broadcast medium. In the disclosed implementations, each segment is approximately 2-2.5 times longer than the preceding segment. At the receiving end, once the first segment is received, all of the other segments are received in time, so that continuous viewing of the movie is possible., 38713=This application is a continuation of U.S. patent application Ser. No. 09/414,514, entitled SYSTEM AND METHOD FOR THE BROADCAST DISSEMINATION OF TIME-ORDERED DATA, filed Oct. 8, 1999, now U.S. Pat. No. 7,155,735 which is incorporated herein by reference for all purposes.}",
    "textBeforeTable": "Patent Citations Furthermore, while the foregoing embodiments of the invention have been specifically described with reference to their application to televised movies, it will be appreciated that the principles which underlie the invention can be applied to any type of temporally-ordered data that is distributed via a broadcast or multicast medium. The presently disclosed embodiments are therefore considered in all respects to be illustrative, and not restrictive. The scope of the invention is indicated by the appended claims, rather than the foregoing description, and all changes that come within the meaning and range of equivalence thereof are intended to be embraced therein. Similarly, while the use of equal-size fragments has been described in the foregoing examples, particularly to facilitate the multiplexing of the substreams, other embodiments of the invention might employ fragments of varying sizes, for instance where the substreams are transmitted independently of one another, in parallel. It will be appreciated by those of ordinary skill in the art that the present invention can be embodied in other specific forms without departing from the spirit or essential characteristics thereof. For instance, the foregoing examples of the invention have been described for the cases in which each segment contains the maximum integral number of fragments that fit within the repetition period of the segment. In this case, in order to ensure that each fragment arrives at the subscriber's premises within the required time, the fragments",
    "textAfterTable": "US4446997 Jan 26, 1983 May 8, 1984 Elliot Himberg Convertible camera-supporting belt device US4520404 Aug 23, 1982 May 28, 1985 Kohorn H Von System, apparatus and method for recording and editing broadcast transmissions US4524381 May 10, 1982 Jun 18, 1985 Fuji Photo Film Co., Ltd. Image reproducing apparatus US4526308 Jan 9, 1984 Jul 2, 1985 Dovey Dennis J Camera support US4527201 Mar 29, 1983 Jul 2, 1985 Panavision, Inc. Zoom indicating apparatus for video camera or the like US4536066 Jul 31, 1980 Aug 20, 1985 Fritz Bauer Adjustable mountings for a movie camera US4574354 Nov 19, 1982 Mar 4, 1986 Tektronix, Inc. Method and apparatus for time-aligning data US4602297 Mar 11, 1985 Jul 22, 1986 Morris Reese System for editing commercial messages from recorded television broadcasts US4605964 Dec 15, 1982 Aug 12, 1986 Chard Frederick W",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}