{
    "relation": [
        [
            "",
            "Of Those Who Responded YES to Q35D",
            ""
        ],
        [
            "Question Choices",
            "Checked",
            "Not Checked"
        ],
        [
            "Estimated Percentage",
            ".",
            "."
        ],
        [
            "95 Percent Confidence Interval",
            "Data Not Reported",
            "Data Not Reported"
        ]
    ],
    "pageTitle": "GAO Survey on How Local Areas Guide WIA Participants Toward Training",
    "title": "",
    "url": "http://gao.gov/special.pubs/gao-14-20sp/results.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 325,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00266-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 102836859,
    "recordOffset": 102805379,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{478979=32. In order to guide WIA Adult and Dislocated Worker participants toward training in calendar year 2012, did your WIB have a policy to either require or encourage participants to conduct any of the following activities?}",
    "textBeforeTable": "(View question) 1a. Is this the correct name of your WIB: _____? 1. Please verify the following information for your WIB. Part I: Characteristics of your local workforce area Responses to open-ended questions are not presented in this product. Due to skip patterns, some survey questions had no eligible respondents. This is denoted with NO ELIGIBLE RESPONSES next to the survey question. For some survey questions the number of respondents to a question was too low to provide statistically reliable estimates. When this occurs this is denoted with DATA NOT REPORTED next to the survey question. Notes on Presentation of Survey Estimates The U.S. Government Accountability Office (GAO), an agency of the U.S. Congress, is conducting a study on how local workforce areas guide WIA Adult and Dislocated Worker Program participants toward training for available jobs and potential high-growth occupations. As part of this review, we are conducting a web-based survey of randomly selected Workforce Investment Boards. We will be asking you about how your local area identifies available jobs and potential high-growth occupations so that you can guide participants toward training for such jobs, the resources most useful in doing so, and challenges in guiding participants toward training. Your participation in our study is essential for us to inform the Congress about how",
    "textAfterTable": "1b. What is the correct WIB name? (View question) Responses to open-ended questions are not presented in this product. 1c. Is this the correct city and state of your WIB: _____, _____? (View question)   Question Choices Estimated Percentage 95 Percent Confidence Interval All Respondents Yes 98.6 95.1, 99.8   No 1.4 0.2, 4.9 1d. What is the correct city and state for your WIB? (View question) Responses to open-ended questions are not presented in this product. 2. Please tell us about your local workforce area. 2a. Approximately how many case managers worked with WIA Adult and Dislocated Worker participants in your local workforce area in calendar year 2012? (View question)",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}