{
    "relation": [
        [
            "Religion",
            "Other",
            "Catholic",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Black Protestant",
            "None"
        ],
        [
            "Adherents",
            "459,847",
            "6,792",
            "2,540",
            "423",
            "211",
            "46,751"
        ],
        [
            "Congregations",
            "1,303",
            "4",
            "26",
            "6",
            "1",
            "-"
        ]
    ],
    "pageTitle": "Springville, Utah (UT 84663) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Springville-Utah.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00118-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 364457187,
    "recordOffset": 364323726,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{26477=Incorporated on 02/1853, 7641=According to our research of Utah and other state lists there were 51 registered sex offenders living in Springville, Utah as of July 31, 2015. The ratio of number of residents in Springville to the number of sex offenders is 600 to 1. The number of registered sex offenders compared to the number of residents in this city is smaller than the state average.}",
    "TableContextTimeStampAfterTable": "{49070=Educational Attainment (%) in 2013, 49468=School Enrollment by Level of School (%) in 2013, 52278=1996 Presidential Elections Results, 35690=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 16.4. This is significantly worse than average. Closest monitor was 5.6 miles away from the city center., 36434=Ozone [ppb] level in 2012 was 32.7. This is about average. Closest monitor was 3.5 miles away from the city center., 29191=Hotels: Wagon Wheel Motel & Trailer Park (500 South Main Street) (1), Best Western CottonTree Inn (1455 North 1750 West) (2), Kearns Hotel (94 West 200 North) (3), Springville Days Inn (520 S 2000 W) (4), The Victorian Inn Bed and Breakfast (94 West 200 North) (5), Days Inn (520 South 2000 West) (6). Display/hide their approximate locations on the map, 52850=2004 Presidential Elections Results, 164282=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 34968=Carbon Monoxide (CO) [ppm] level in 2012 was 0.412. This is worse than average. Closest monitor was 0.4 miles away from the city center., 53422=2012 Presidential Elections Results, 37882=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 7.11. This is better than average. Closest monitor was 3.5 miles away from the city center., 75153=7.14% of this county's 2010 resident taxpayers moved to other counties in 2011 ($35,124 average adjusted gross income), 72949=6.54% of this county's 2011 resident taxpayers lived in other counties in 2010 ($37,758 average adjusted gross income), 162981=Total of 340 patent applications in 2008-2015., 34321=Air Quality Index (AQI) level in 2012 was 82.7. This is about average., 37133=Particulate Matter (PM10) [µg/m3] level in 2012 was 20.4. This is about average. Closest monitor was 7.0 miles away from the city center., 52564=2000 Presidential Elections Results, 53706=Graphs represent county-level data. Detailed 2008 Election Results, 53136=2008 Presidential Elections Results}",
    "textBeforeTable": "Religion statistics for Springville city (based on Utah County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results No fuel used (1%) Electricity (6%) Utility gas (93%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 43 Utah County: 0.84 / 10,000 pop. Utah: 1.37 / 10,000 pop. Number of supercenters and club stores: 6 This county: 0.12 / 10,000 pop. State: 0.18 / 10,000 pop. Number of convenience stores (no gas): 3 Utah County: 0.06 / 10,000 pop. Utah: 0.41 / 10,000 pop. Number of convenience stores (with gas): 90 Utah County: 1.75 / 10,000 pop. State: 2.82 / 10,000 pop. Number of full-service restaurants: 146 Here: 2.84 / 10,000 pop. State: 5.09 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}