{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "tobacco free campus =)",
            "getting involved with extracurricular activities. hang out with friends after school hours. enjoying your youth.",
            "the food at the usg campus is really fresh and affordable.",
            "i have never lived on campus-- my rating should not be counted.",
            "school is tough as it is. it really depends on the students habits as far as reading the textbook and participation in class. overall, professors really strive to see students excel.",
            "if you are not too comfortable with living on campus, check out their satellite campus. (depending on your location) the usg campus is located in rockville, maryland.",
            "university of maryland-baltimore county is a well operated institution. their satellite campus at universities of shady grove is convenient for me as far as location. most of my professors are knowledgeable and highly intellectually stimulating."
        ]
    ],
    "pageTitle": "University of Maryland-Baltimore County (UMBC) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Maryland-Baltimore-County/reviews?_escaped_fragment_=/show/85379",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00019-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906640231,
    "recordOffset": 906544445,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{132477=There are campus cafe`'s that are open from 7:30 to 11:30 that provide a variety of meal options. They provide the option for different meal card plans depending on your needs for those students that intend on eating on campus often. There is also a Chick-fil-a (^_^), 277296=- Get your GPA to around a 3.2 - Get around a 1700 on your SAT - Participate in some extracurricular - Knock that essay out of the park, 324408=The Library is great location on campus with views of Baltimore city. Academic row was designed in the 60s and offers some great works of architecture from that time period with an incredible Performing Arts building that's set to be completed in the Fall of 2013., 289824=During the fall semester of 2012, I went to many cultural events on Friday nights (such as Caribbean Night and a Hispanic-Latino night). It's easy to get tickets for these events and then just get a group of your friends and have fun. There are also Open Mic nights on Thursdays and a Breakfast and Bingo event almost every Saturday evening. That just barely scratches the surface of all the countless things that you can do at UMBC during the week. If you want to know more, you're just gonna have to come and see for yourself!, 197345=May not be too distracted from studies due to low campus activities, however I heard that they're trying to promote more on campus activities to students., 534780=© 2015, Cappex.com, LLC, 483436=UMBC's Residential Life department is very determined to make every student feel at home as soon as they get to campus. Residential Assistants are present on every floor or apartment complex and are charged with keeping in contact with their residents and hosting various events for them (such as trivia nights, cookouts, etc). They also recently updated their software for housing applications which is a big bonus, and they have plans to renovate every hall by 2020. The dorm halls which have recently been upgraded are Patapsco, Chesapeake, and the Terrace and Hillside apartments. Most rooms are doubles containing two people who share a bathroom with another set of people, but there are also singles and apartments (with four people each with their own rooms and kitchen). Most halls feature a kitchen on every level, but fridges and microwaves can be rented from facilities., 515712=This is a great school! I love the campus and the atmosphere; I have heard nothing but great things about it! My brother currently attends and I am considering attending myself next year when I graduate high school in June.}",
    "textBeforeTable": "08/11/2009 Reviewer is A current student here. 24 out of 26 people found this review useful. 1 of 123 James from Baltimore, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Bang for the buck The tuition price is good for instate students, however it is mandatory to have a meal plan if in the dorms. The meal plan price is slightly expensive compared to purchasing and making your own food. Nevertheless, it is easy to earn money by applying for the many internships and jobs due to a website dedicated to their search. Am enjoying being here There is always an activity at UMBC. The gym is open to anyone to exercise and there are many clubs to join. The teachers are encouraging as well. Am learning a lot I did not expect to learn much due to entering this college with AP credits, but I have still learned many new things due to the immense variety of classes. In my internship, 90% or more of my daily activities were taught. Login to rate or flag the reviews Emily from Germantown, MD 12/04/2009 Reviewer is A current student here. 14 out of 16 people found this review useful. 3 of 123",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}