{
    "relation": [
        [
            "Element",
            "",
            "tns:CID",
            ""
        ],
        [
            "Type",
            "",
            "s:int",
            ""
        ],
        [
            "Occurs",
            "1..1",
            "1..1",
            ""
        ]
    ],
    "pageTitle": "PUG SOAP Web Service Reference",
    "title": "",
    "url": "http://pubchem.ncbi.nlm.nih.gov/pug_soap/PUG_SOAP.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00109-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 192339919,
    "recordOffset": 192328128,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Mon, 22 Apr 2013 17:57:48 GMT",
    "textBeforeTable": "The input of this method is the argument AssayDownload having the structure defined by the following table. Input (Literal) http://pubchem.ncbi.nlm.nih.gov/AssayDownload Action Given an assay key, prepare for download a file containing an assay data table in the selected format. See the assay query section of the PUG service documentation (http://pubchem.ncbi.nlm.nih.gov/pug/pughelp.html) for more detail on the supported formats. Compression is optional and defaults to gzip (.gz). Returns a download key. Asynchronous. Description Method: AssayDownload Search PubChem Compound for structures contained within the one given by the structure key input, based on a user-selected level of chemical identity: connectivity only, match isotopes and/or stereo, etc. The search may be limited by elapsed time or number of records found, or restricted to search only within a previous result set (given by a list key). Returns a list key. Asynchronous. SuperstructureSearch  Search PubChem Compound for structures containing the one given by the structure key input, based on a user-selected level of chemical identity: connectivity only, match isotopes and/or stereo, etc. The search may be limited by elapsed time or number of records found, or restricted to search only within a previous result set (given by a list key). Returns a list key. Asynchronous. SubstructureSearch  Standardize the structure given by the structure key input, using the same algorithm PubChem uses to construct the Compound database. Returns a structure key. Asynchronous.",
    "textAfterTable": "tns:eCompress  tns:CompressType  0..1  Output (Literal) The output of this method is the argument AssayDownloadResponse having the structure defined by the following table. Element  Type  Occurs      1..1  tns:DownloadKey  s:string  1..1  Method: Download Description Given a list key, prepare for download a file containing those records in the selected format. See the web download service documentation (http://pubchem.ncbi.nlm.nih.gov/pc_fetch/pc_fetch-help.html) for more detail on the supported formats and file types. Returns a download key. Asynchronous. Note that if SynchronousSingleRecord is set to true, and the ListKey contains only a single ID, then a Base64 string of data is returned synchronously in the response, instead of going through the download file. Action http://pubchem.ncbi.nlm.nih.gov/Download Input (Literal) The input of this method is the argument Download having the structure defined by the following table. Element  Type  Occurs      1..1  tns:ListKey  s:string  1..1  tns:eFormat  tns:FormatType  1..1 ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}