{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Catholic",
            "Mainline Protestant",
            "Other",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "95,284",
            "52,310",
            "33,697",
            "22,775",
            "2,686",
            "947",
            "414,564"
        ],
        [
            "Congregations",
            "265",
            "23",
            "61",
            "62",
            "11",
            "4",
            "-"
        ]
    ],
    "pageTitle": "Monument, Colorado (CO 80132, 80133) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Monument-Colorado.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00263-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 376485415,
    "recordOffset": 376352299,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5022=According to our research of Colorado and other state lists there were 2 registered sex offenders living in Monument, Colorado as of July 31, 2015. The ratio of number of residents in Monument to the number of sex offenders is 2,871 to 1. The number of registered sex offenders compared to the number of residents in this city is a lot smaller than the state average., 131722=Monument: Downtown Monument September 2002, 23863=Incorporated on 5/14/1881}",
    "TableContextTimeStampAfterTable": "{64865=8.83% of this county's 2011 resident taxpayers lived in other counties in 2010 ($39,620 average adjusted gross income), 33236=Air Quality Index (AQI) level in 2012 was 39.5. This is significantly better than average., 49351=2008 Presidential Elections Results, 49065=2004 Presidential Elections Results, 37791=Lead (Pb) [µg/m3] level in 2006 was 0.00479. This is significantly better than average. Closest monitor was 17.1 miles away from the city center., 35383=Sulfur Dioxide (SO2) [ppb] level in 2001 was 2.01. This is about average. Closest monitor was 11.4 miles away from the city center., 37034=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 7.03. This is better than average. Closest monitor was 13.9 miles away from the city center., 33902=Carbon Monoxide (CO) [ppm] level in 2006 was 0.503. This is significantly worse than average. Closest monitor was 11.4 miles away from the city center., 45329=Educational Attainment (%) in 2013, 48493=1996 Presidential Elections Results, 29682=Hotel: Falcon Inn (1865 Woodmoor Dr)., 133942=Total of 265 patent applications in 2008-2015., 14208=On 6/13/1977, a category F3 (max. wind speeds 158-206 mph) tornado 11.6 miles away from the Monument town center ., 49637=2012 Presidential Elections Results, 48779=2000 Presidential Elections Results, 67082=8.32% of this county's 2010 resident taxpayers moved to other counties in 2011 ($41,339 average adjusted gross income), 14377=On 6/24/1979, a category F3 tornado 16.3 miles away from the town center injured one person and caused between $50,000 and $500,000 in damages., 45727=School Enrollment by Level of School (%) in 2013, 135263=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 49921=Graphs represent county-level data. Detailed 2008 Election Results, 34638=Nitrogen Dioxide (NO2) [ppb] level in 2001 was 12.0. This is significantly worse than average. Closest monitor was 11.4 miles away from the city center., 36279=Particulate Matter (PM10) [µg/m3] level in 2012 was 24.6. This is worse than average. Closest monitor was 11.4 miles away from the city center.}",
    "textBeforeTable": "Religion statistics for Monument town (based on El Paso County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Electricity (11%) Utility gas (89%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 57 El Paso County: 0.97 / 10,000 pop. Colorado: 1.50 / 10,000 pop. Number of supercenters and club stores: 9 This county: 0.15 / 10,000 pop. State: 0.15 / 10,000 pop. Number of convenience stores (no gas): 20 El Paso County: 0.34 / 10,000 pop. Colorado: 0.45 / 10,000 pop. Number of convenience stores (with gas): 168 El Paso County: 2.87 / 10,000 pop. State: 3.13 / 10,000 pop. Number of full-service restaurants: 389 Here: 6.64 / 10,000 pop. State: 8.99 / 10,000 pop. Adult diabetes rate: This",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}