{
    "relation": [
        [
            "Product Listing",
            "Abortion, abortion-inducing drugs and the “morning after” pill",
            "Dietetic products"
        ],
        [
            "Allowed?",
            "Not allowed",
            "Not allowed"
        ],
        [
            "Details?",
            "Google doesn't allow the promotion of abortion, abortion-inducing drugs and the \"morning after\" pill in Spain.",
            "Google doesn't allow ads or websites that promote weight-loss medical procedures in Spain. Google doesn't allow listings or websites that promote weight-loss-related products if they meet any of the following criteria: Claim medicinal properties Promise specific results Use endorsements by individuals, celebrities, or organizations"
        ]
    ],
    "pageTitle": "Restricted Products - Google Merchant Center Help",
    "title": "",
    "url": "https://support.google.com/merchants/answer/2731539?hl=en",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00034-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893978235,
    "recordOffset": 893953418,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Examples We've created this policy due to the many legal regulations that exist around the sale and use of these products and to ensure a positive user experience. Google Shopping doesn’t allow aids to pass drug tests, including drug test cleansing products, urine drug test solutions or instructions on how to pass drug tests. What's the policy? Aids to Pass Drug Tests Vehicles Traffic Devices Stolen Property and Lock Picking Devices Online Gaming Goods and Currency Live Animals Immovable Property Illegal Hacking Human Remains and Body Parts Healthcare and Medicine Financial or Other Related Products Fake Documents Endangered Species Dangerous Products Casinos and Gambling Equipment Alcoholic Beverages Aids to Pass Drug Tests Find out what you can do if your product listing gets disapproved. This is an overview of all the products that are restricted on Google Shopping. Listing certain products can result in disapproval of items, preemptive item disapproval, or account suspension. Restricted Products }]);})(); Contact us",
    "textAfterTable": "portray excessive drinking in a positive light or feature binge or competition drinking show alcohol being consumed in conjunction with the operation of a vehicle of any kind, the operation of machinery, or the performance of any task requiring alertness or dexterity Examples of restricted alcoholic beverages: beer; wine; sake; spirits or hard alcohol; Champagne; fortified wine; non-alcoholic beer; non-alcoholic wine; and non-alcoholic distilled spirits. Please refer to the Feed Specification for specific requirements on how to submit these products using the ‘google product category’ attribute to ensure products are shown to an appropriate audience. Country-Specific Requirements In addition to the requirements above, there may be further restrictions based on your target country. See additional country-specific requirements you must meet below. Countries Allowed? Details Australia Austria Belgium Brazil Canada Czech Republic Denmark France Germany Italy Japan Netherlands Mexico Spain Sweden Switzerland United Kingdom United States Allowed with limitations In these countries, Google allows the promotion of alcohol (including hard alcohol, liquor, beer, wine, Champagne, and cider) as long as the requirements outlined above are met. India Norway Poland Russia Turkey Not allowed In these countries, Google doesn't allow the promotion of any alcoholic beverages, including hard alcohol, liquor, beer, wine,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}