{
    "relation": [
        [
            "Results",
            "\"Yes\" Votes",
            "\"No\" Votes"
        ],
        [
            "Number of Votes",
            "2,578,831",
            "3,579,241"
        ],
        [
            "% of Votes",
            "41.88%",
            "58.12%"
        ]
    ],
    "pageTitle": "Elections in Kenya",
    "title": "",
    "url": "http://africanelections.tripod.com/ke.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00002-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 4772231,
    "recordOffset": 4755806,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{141210=Last Updated: 21 March 2012}",
    "textBeforeTable": "Sole Legal Party: Kenya African National Union (KANU) Single Party Elections   41 Others 83 Kenya African National Union (KANU) Number of Seats (124) Party Not Available (N/A) Total Votes (Voter Turnout) Not Available Registered Voters 18-26 May 1963 House of Representatives Election *An additional 20 seats were reserved for communal interests (10 for Europeans, 8 for Asians, and 2 for Arabs). Another 12 were filled by special members, bringing the total number of Legislative Council members to 65.   11 Kenya African Democratic Union (KADU) 19 Kenya African National Union (KANU)",
    "textAfterTable": "Note: Jomo Kenyatta was Prime Minister of Kenya from its independence on 12 December 1963 to 12 December 1964 when he became President of the Republic. He was re-elected unopposed on 22 December 1969 and again in 1974. He died in office on 22 August 1978. Vice President Daniel arap Moi succeeded Kenyatta and the National Assembly elected him President on 10 October 1978. He was re-elected unopposed by the National Assembly in 1979, 1983, and 1988.   29 December 1992 Presidential Election Registered Voters 7,900,000 (approx.) Total Votes (Voter Turnout) Not Available (N/A) Invalid/Blank Votes Not Available Total Valid Votes 5,400,324 Candidate (Party) Number of Votes",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}