{
    "relation": [
        [
            "Named Executive Officer",
            "Frank A. Calderoni",
            "Dennis D. Powell",
            "Wim Elfrink",
            "Richard J. Justice",
            "Randy Pond"
        ],
        [
            "Stock Options Actual (#)",
            "240,000",
            "—",
            "570,000",
            "570,000",
            "480,000"
        ],
        [
            "Performance-Based Rights to Receive Future Restricted Stock Units Target (#)",
            "53,333",
            "—",
            "126,666",
            "126,666",
            "106,666"
        ]
    ],
    "pageTitle": "Proxy Statement - Annual Report 2008 - Cisco Systems",
    "title": "",
    "url": "http://www.cisco.com/web/about/ac49/ac20/ac19/ar2008/proxy_statement/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 370615247,
    "recordOffset": 370539951,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{187474=The annual cash incentive awards for named executive officers for fiscal 2008 were determined under Cisco’s EIP and are intended to comply with the exception for performance-based compensation under Internal Revenue Code Section 162(m). Under the EIP, annual cash incentive awards are based on Cisco’s achievement of established financial performance goals and customer satisfaction criteria and the executive’s individual contribution. The Compensation Committee established the financial performance goals so that they are consistent with the goals in Cisco’s fiscal 2008 business plan established by the Board of Directors. For each named executive officer other than the Chief Executive Officer and Mr. Calderoni (who became a named executive officer in the middle of fiscal 2008), the cash incentive awards under the EIP are calculated by multiplying the individual’s annual base salary in effect at the beginning of the fiscal year by the individual’s target award percentage, and multiplying the result by a company performance factor (CPF), a customer satisfaction factor (CSF), and an individual performance factor (IPF), as follows:, 168217=As noted above, a core element of Cisco’s compensation philosophy is to align the interests of executive officers with those of shareholders by providing appropriate long-term incentives. To further align the interests of executive officers and shareholders, the Board of Directors, following a recommendation by the Compensation Committee, adopted a new policy in July 2008 regarding minimum ownership of shares by Cisco’s executive officers. The ownership guidelines call for Cisco’s Chief Executive Officer to own shares of Cisco’s common stock having a value equal to at least five times the Chief Executive Officer’s base salary, and for each other executive officer to own shares of Cisco’s common stock having a value equal to at least three times the executive officer’s base salary. The Chief Executive Officer and each other executive officer have five years from the later of the date of their respective appointment or the date of adoption of these guidelines to attain their ownership level., 13352=The Annual Meeting of Shareholders of Cisco Systems, Inc. will be held at the Santa Clara Convention Center in Elizabeth A. Hangs Theater, located at 5001 Great America Parkway, Santa Clara, California on Thursday, November 13, 2008, at 10:00 a.m. Pacific Time for the following purposes:, 313439=$19.1800, 211418=In addition, in February 2008 Mr. Calderoni was granted 75,000 time-based restricted stock units with five-year vesting in connection with his promotion to Executive Vice President and Chief Financial Officer. This grant, together with his other grants for fiscal 2008 including the actual restricted stock unit grant listed in the table above, was at the 75th percentile of the Peer Group for chief financial officers. The purpose of the grant, and the basis for the choice of this form of award, was to encourage his long-term employment retention and provide him with a meaningful carried-interest ownership position., 41853=Dr. Hennessy, 55, has been a member of the Board of Directors since January 2002. He has been President of Stanford University since September 2000. He served as Provost of Stanford from June 1999 to August 2000, Dean of the Stanford University School of Engineering from June 1996 to June 1999, and Chair of the Stanford University Department of Computer Science from September 1994 to March 1996. Dr. Hennessy also currently is the Chairman of the Board of Atheros Communications, Inc. and serves on the board of directors of Google Inc., 144933=(10) Represents 31,175 shares held by the 1990 Justice Family Trust, options to purchase 1,676,917 shares and 20,000 shares subject to restricted stock units. Mr. Justice holds one share in a Cisco subsidiary to meet local statutory shareholder requirements., 25042=If your shares are registered in the name of a bank or brokerage firm (your record holder), you will receive instructions from your record holder that must be followed in order for your record holder to vote your shares per your instructions. Many banks and brokerage firms have a process for their beneficial holders to provide instructions via the Internet or over the telephone. If Internet or telephone voting is unavailable from your bank or brokerage firm, please complete and return the enclosed voting instruction card in the addressed, postage paid envelope provided. If you hold shares through a bank or brokerage firm and wish to be able to vote in person at the annual meeting, you must obtain a legal proxy from your brokerage firm, bank or other holder of record and present it to the inspector of elections with your ballot. Shareholders who have elected to receive the 2008 Proxy Statement and Annual Report to Shareholders electronically will be receiving an email on or about September 29, 2008 with information on how to access shareholder information and instructions for voting., 473216=In January 2002, Cisco loaned $1,648,750 to Wim Elfrink, currently Executive Vice President, Cisco Services and Chief Globalization Officer and an executive officer, in connection with his relocation to the United States at a time when he was not an executive officer of Cisco. Since the beginning of Cisco’s last fiscal year, the loan had an interest rate of 4.87%. The loan was secured by a deed of trust on real property. Since the beginning of Cisco’s last fiscal year, the original principal amount of the loan was the largest principal amount outstanding and the amount of interest paid was $10,660. The loan, including all accrued interest, was paid in full in connection with his appointment as an executive officer., 181737=For named executive officers other than the Chief Executive Officer, the Compensation Committee decided that for fiscal 2008, for retention purposes it would set individual base salaries and at-target annual cash compensation with reference to the 50th percentile of the Peer Group. The total value of long-term, equity-based incentive awards would continue to be targeted with reference to the 75th percentile of the Peer Group which, when combined with the 50th percentile-based target for cash compensation, results in overall total target compensation at approximately the 65th percentile of the Peer Group for these named executive officers, except in the cases of Mr. Elfrink and Mr. Powell, due to each of their unique circumstances described above. These target percentiles are subject to the Compensation Committee’s discretion to pay below or above the stated percentiles based on recruiting needs, retention requirements, individual or company performance, succession planning, the named executive officer’s realized and unrealized (both vested and unvested) equity values and recommendations from the Chief Executive Officer, among other potential factors. The Compensation Committee believes that this philosophy is appropriate in light of the high-risk, high-reward nature of the annual and long-term incentive structures, the cash compensation targets with reference to the 50th percentile of the Peer Group and Cisco’s historical performance relative to its Peer Group., 477539=SHAREHOLDER PROPOSALS FOR 2009 ANNUAL MEETING OF SHAREHOLDERS, 44444=Mr. Powell, 45, has been a member of the Board of Directors since March 2007. He currently serves as Senior Advisor to Providence Equity Partners, a private equity investment firm, and as Chairman of the MK Powell Group, a consulting firm. Mr. Powell was Chairman of the Federal Communications Commission from January 2001 to March 2005, having served as a Commissioner since November 1997. Mr. Powell previously served as the Chief of Staff of the Antitrust Division of the Department of Justice., 91813=(4) The amounts reflect the dollar amount recognized for financial statement reporting purposes for the fiscal year ended July 26, 2008, in accordance with Financial Accounting Standards Board Statement 123(R), or FAS 123(R), of restricted stock awards issued pursuant to the 2005 Stock Incentive Plan. For restricted stock awards, fair value is calculated using the closing price on the grant date as if these awards were vested and issued on the grant date. The amounts shown disregard estimated forfeitures related to service-based vesting conditions. No stock awards were forfeited by any of the non-employee directors during the fiscal year. The grant date fair value of the restricted stock award granted on November 15, 2007 to each non-employee director re-elected on that date was $146,500. These amounts reflect Cisco’s accounting expense for these awards, and do not correspond to the actual value that may be recognized by the non-employee directors. For information regarding the number of stock awards held by each non-employee director as of July 26, 2008, see the column “Unvested Restricted Shares Outstanding” in the table below., 441808=(5) Mr. Elfrink is the only named executive officer who participates in the Netherlands Capital Plan. He did not participate in the Deferred Compensation Plan in fiscal 2008. The dollar amounts in the table shown for Mr. Elfrink were converted from Euros. The conversion rate from Euros to U.S. dollars is based on the exchange rate of 1.57070 dollars per Euro in effect on the last day of Cisco’s 2008 fiscal year., 216658=During fiscal 2008, Cisco provided certain named executive officers payment for personal expenses, including spousal travel and personal expenses, in connection with a trip they attended to recognize sales personnel achievements. Because the expenses paid by Cisco were deemed to be taxable income to those executive officers, and because those executive officers attended the event with their spouses in furtherance of company business, Cisco provided tax restoration payments to them. Additionally, Mr. Powell received a service recognition award and corresponding tax restoration payment in connection with his retirement., 93014=(5) The amounts reflect the dollar amount recognized for financial statement reporting purposes for the fiscal year ended July 26, 2008, in accordance with FAS 123(R), of stock option awards issued pursuant to the 2005 Stock Incentive Plan and predecessor stock option plans and thus include amounts from outstanding stock option awards granted during and prior to fiscal 2008. For information on the valuation assumptions with respect to stock option grants, refer to the note on Employee Benefit Plans in the notes to consolidated financial statements contained in Cisco’s Annual Report on Form 10-K for the fiscal year in which the stock option was granted. The amounts shown disregard estimated forfeitures related to service-based vesting conditions. No stock options were forfeited by any of the non-employee directors during the fiscal year. The grant date fair value of the option granted on November 15, 2007 to each non-employee director re-elected on that date was $128,850. These amounts reflect Cisco’s accounting expense for these awards, and do not correspond to the actual value that may be recognized by the non-employee directors. For information regarding the number of stock options held by each non-employee director as of July 26, 2008, see the column “Stock Options Outstanding” in the table below., 155229=(3) Includes shares available for future issuance under the Employee Stock Purchase Plan including its sub-plan, the International Employee Stock Purchase Plan. As of July 26, 2008, as reported in Cisco’s 2008 Annual Report on Form 10-K, an aggregate of 62,552,641 shares of common stock were available for future issuance under this purchase plan. Under the 2005 Stock Incentive Plan, each share issued as a stock grant (or pursuant to the vesting of a stock unit) will reduce the shares reserved by 2.5 shares. Under the 2005 Stock Incentive Plan, non-employee directors may also elect to receive fully vested shares of common stock (or restricted stock units that would be settled in shares after the non-employee director left the board) in lieu of all or a specified portion of their regular annual cash retainer based on the fair market value of the shares on the date any regular annual cash retainer would otherwise be paid., 146382=(17) Includes 34,993 shares held in the Jerry Yang 1996 Charitable Remainder Trust, 12,162 shares held in the Jerry Yang 1996 Revocable Trust and options to purchase 150,000 shares., 226008=The Compensation and Management Development Committee has reviewed and discussed the “Compensation Discussion and Analysis” section of this Proxy Statement with Cisco’s management. Based on that review and those discussions, the Compensation and Management Development Committee recommended to the Board of Directors that the “Compensation Discussion and Analysis” section be included in this Proxy Statement and incorporated by reference into Cisco’s Annual Report on Form 10-K for its 2008 fiscal year., 157355=(6) As of July 26, 2008, the aggregate number of shares issuable upon exercise of outstanding options as reported in Cisco’s 2008 Annual Report on Form 10-K were 1,199,274,431 shares, which included the 30,889,674 shares issuable upon exercise of outstanding options under the assumed arrangements described in footnote (5) above., 481864=This year, a number of brokers with account holders who beneficially own our common stock will be “householding” our annual report and proxy materials, including the Notice of Internet Availability of Proxy Materials. A single Notice of Internet Availability of Proxy Materials and, if applicable, a single set of annual report and other proxy materials will be delivered to multiple shareholders sharing an address unless contrary instructions have been received from the affected shareholders. Once you have received notice from your broker that it will be “householding” communications to your address, “householding” will continue until you are notified otherwise or until you revoke your consent. Shareholders may revoke their consent at any time by contacting Broadridge ICS, either by calling toll-free (800) 542-1061, or by writing to Broadridge ICS, Householding Department, 51 Mercedes Way, Edgewood, New York, 11717., 408824=† Represents the actual amount of restricted stock units awarded for the fiscal 2008 performance period pursuant to rights to receive future restricted stock units that were awarded in September 2007, subject to a performance condition. See below for additional information about these rights. Of the total shares subject to the restricted stock unit awards, 20% vested on September 11, 2008 (the grant date of the underlying restricted stock unit upon certification of the fiscal 2008 performance condition) and the remaining 80% will vest in four equal annual installments thereafter., 147097=Section 16(a) of the Securities Exchange Act of 1934 requires Cisco’s executive officers, directors and persons who own more than 10% of Cisco’s common stock to file reports of ownership and changes in ownership with the Securities and Exchange Commission. These persons are required to provide Cisco with copies of all Section 16(a) forms that they file. Based solely on Cisco’s review of these forms and written representations from the executive officers and directors, Cisco believes that all Section 16(a) filing requirements were met during fiscal 2008. A late report was filed on behalf of Wim Elfrink, with respect to one transaction, solely to correct the number of shares withheld for payment of tax liability as a result of the partial settlement of a restricted stock unit award from the 10,400 shares originally timely reported to 9,150 shares., 41330=Mr. Halla, 62, has been a member of the Board of Directors since January 2007. He has served as Chairman of the Board and Chief Executive Officer of National Semiconductor Corporation since May 1996. Additionally, he served as President of National Semiconductor Corporation from May 1996 to May 2005. Prior to May 1996, Mr. Halla served in several capacities at LSI Logic Corporation, where, in his last role, he was the Executive Vice President of LSI Logic Products., 202080=Consistent with Cisco’s goal to pay for performance, the majority of the named executive officers’ on-target total compensation comes from the grant of long-term incentives. In September 2007, the Compensation Committee made its fiscal 2008 annual awards to Cisco’s named executive officers under Cisco’s 2005 Stock Incentive Plan with reference to the value of the 75th percentile of long-term incentives granted to comparable positions in the Peer Group. Grants of stock options, and awards of PRSU rights based on Cisco’s financial performance in fiscal 2008, were made to the following named executive officers as follows:, 123861=In October 1998, Cisco announced it was selected as a key supplier for building China’s nation-wide IP backbone. China’s network has been called “the Great Firewall of China”, and has become synonymous with the censored, closed network which, according to Mr. Chandler, threatens the realization of Cisco’s core mission. In November 2007, Cisco renewed its commitment to China with a multi-year investment program., 473994=In November 2007, Cisco invested approximately $17,500,000 in the initial public offering on The Stock Exchange of Hong Kong Limited of Alibaba.com Limited, the business-to-business e-commerce subsidiary of Alibaba Group Holding Limited (“Alibaba Group”). Jerry Yang, Chief Executive Officer of Yahoo! and a Cisco non-employee director, serves on the board of directors of Alibaba Group, and Yahoo! owns approximately 44% of Alibaba Group., 482845=Upon written or oral request, Cisco will promptly deliver a separate copy of the Notice of Internet Availability of Proxy Materials and, if applicable, a separate set of proxy materials to any beneficial owner at a shared address to which a single copy of any of those documents was delivered. To receive a separate copy of the Notice of Internet Availability of Proxy Materials and, if applicable, a separate set of proxy materials, you may write or call Cisco’s Investor Relations Department at Cisco Systems, Inc., 170 West Tasman Drive, San Jose, California 95134-1706, Attention: Investor Relations, telephone (408) 227-2726., 121400=On February 15, 2006, Cisco Systems, Yahoo, Google and Microsoft testified before the Committee on International Relations of the U.S. House of Representatives about alleged complicity in human rights violations in China;, 423155=The option to purchase 1,500,000 shares that was granted to Mr. Chambers on August 23, 2004 has a maximum term of nine years measured from the grant date and, if vested, will remain exercisable for the full term even after his cessation of service except in limited circumstances. For purposes of Mr. Chambers’ stock option agreement, “service” includes providing services directly to Cisco or employment by educational or governmental institutions if those institutions’ policies preclude continued service to Cisco. The exercise price is equal to the closing price per share of common stock on the grant date., 67149=This committee held twelve meetings during the last fiscal year. Each member of this committee is an independent director under applicable NASDAQ listing standards, an “outside director” as defined in Section 162(m) of the Internal Revenue Code and a “non-employee director” as defined in Rule 16b-3 under the Securities Exchange Act of 1934., 128411=For the past three years, we have issued our annual Corporate Citizenship Report, which addresses our performance in areas including human rights generally, our progress towards the principles of the United Nations Global Compact, employee welfare, diversity, training and development, business conduct, supplier diversity and ethics, the environmental impact of our product design and lifecycle as well as our facilities and operations, our corporate giving programs, and our social investments around the world. With respect to Internet freedom, we have clearly stated our policies: Cisco does not customize, or develop specialized or unique filtering capabilities, in order to enable different regimes to block access to information; Cisco sells the same equipment worldwide; Cisco is not a service or content provider or network manager; and Cisco has no access to information about individual users of the Internet. We plan to publish our fourth annual Corporate Citizenship Report in the fall of 2008, and we intend to continue to issue regular updates which are expected to provide updated comparative data of our objectives, goals, targets and measures. We believe the preparation and issuance of this report, together with future updates, addresses the intent of the proponents’ proposal., 475337=The information contained in this report shall not be deemed to be “soliciting material,” to be “filed” with the SEC or be subject to Regulation 14A or Regulation 14C (other than as provided in Item 407 of Regulation S-K) or to the liabilities of Section 18 of the Securities Exchange Act of 1934, and shall not be deemed to be incorporated by reference in future filings with the SEC except to the extent that Cisco specifically incorporates it by reference into a document filed under the Securities Act of 1933 or the Securities Exchange Act of 1934., 317508=$32.2100, 293692=(1) These awards were granted under the Executive Incentive Plan for fiscal 2008, and more information about them appears above in the “Compensation Discussion and Analysis” section of this Proxy Statement. The actual payments from these awards are included in the “Non-Equity Incentive Plan Compensation” column in the Summary Compensation Table above. For each named executive officer other than Mr. Chambers and Mr. Calderoni, the target and maximum values are calculated by multiplying 125% (target) and 560% (maximum), respectively, by the executive’s annual base salary in effect at the beginning of the 2008 fiscal year. For Mr. Chambers, the target and maximum values are calculated by multiplying 185% and 828.8%, respectively, by the median CEO base salary of the Peer Group which median salary was $1,121,000. For Mr. Calderoni, the target and maximum values are calculated by adding together (i) the product of 75% and 420%, respectively, and Mr. Calderoni’s annual base salary in effect at the end of the 2008 fiscal year, pro-rated to reflect the portion of the fiscal year prior to his appointment as Executive Vice President, Chief Financial Officer (from the beginning of fiscal 2008 through February 14, 2008), and (ii) the product of 125% and 700%, respectively, and Mr. Calderoni’s annual base salary in effect at the end of the 2008 fiscal year, pro-rated to reflect the remaining portion of the fiscal year (from February 15, 2008 through the end of fiscal 2008). The Executive Incentive Plan did not contain any threshold value for fiscal 2008., 220757=CEO Compensation. For fiscal 2008, Mr. Chambers’ base salary was $375,000. This salary was increased from $350,000 effective July 27, 2007, as part of the salary adjustments described under “Base Salary” above. His base salary continues to be significantly below the 50th percentile of the Peer Group. The Compensation Committee has targeted Mr. Chambers’ base salary at less than the 50th percentile of base salaries paid to the chief executive officers of the Peer Group in consideration of Mr. Chambers’ long-standing request that a greater percentage of his total cash compensation be at risk and tied to Cisco performance. Mr. Chambers’ total cash compensation is targeted with reference to the 50th percentile of the Peer Group, which results in him having a greater percentage of his total cash compensation be performance-based and at risk than the other named executive officers., 148147=The following table provides information as of July 26, 2008 with respect to the shares of Cisco common stock that may be issued under existing equity compensation plans. The category “Equity compensation plans approved by security holders” in the table below consists of the 2005 Stock Incentive Plan, the 1996 Stock Incentive Plan, and the Employee Stock Purchase Plan and its sub-plan, the International Employee Stock Purchase Plan. The category “Equity compensation plans not approved by security holders” in the table below consists of the 1997 Supplemental Stock Incentive Plan (the “Supplemental Plan”), the Cisco Systems, Inc. SA Acquisition Long-Term Incentive Plan (the “SA Acquisition Plan”) that was adopted in connection with Cisco’s acquisition of Scientific-Atlanta, Inc. in accordance with applicable NASDAQ listing standards, the Cisco Systems, Inc. WebEx Acquisition Long-Term Incentive Plan (the “WebEx Acquisition Plan”) that was adopted in connection with Cisco’s acquisition of WebEx Communications, Inc. in accordance with applicable NASDAQ listing standards and options to purchase shares of Cisco common stock that were issued to replace cancelled options in connection with Cisco’s acquisition of Latitude Communications, Inc. The category “Equity compensation plans approved by security holders” in the table does not include 5,483,533 shares subject to restricted stock units outstanding as of July 26, 2008 and the category “Equity compensation plans not approved by security holders” in the table does not include 1,723,614 shares subject to restricted stock units outstanding as of July 26, 2008. In addition, the table does not include information with respect to shares subject to outstanding awards granted under other equity compensation arrangements assumed by Cisco in connection with mergers and acquisitions of the companies that originally granted those awards., 321476=$21.2400, 394257=$56.1563, 9509=You are cordially invited to attend the Annual Meeting of Shareholders of Cisco Systems, Inc., which will be held at the Santa Clara Convention Center in Elizabeth A. Hangs Theater, located at 5001 Great America Parkway, Santa Clara, California on Thursday, November 13, 2008, at 10:00 a.m. Pacific Time. You will find a map with directions to the annual meeting on the final page of the Proxy Statement., 299803=The following table shows the number of Cisco common shares covered by exercisable and unexercisable stock options, the number of Cisco unvested restricted stock units, and the number of performance-based rights to receive future grants of restricted stock units held by Cisco’s named executive officers as of July 26, 2008., 144730=(9) Includes 10,022 shares held by the Hennessy 1993 Revocable Trust, 2,559 fully vested deferred stock units and options to purchase 105,000 shares., 158228=The Supplemental Plan expired on December 31, 2007 and Cisco can no longer make equity awards under the Supplemental Plan. Officers and members of Cisco’s Board of Directors were not eligible to participate in the Supplemental Plan. Nine million shares were reserved for issuance under the Supplemental Plan., 192321=In addition, the awards paid reflect the recognition of individual contributions which vary for each named executive officer through the individual performance factor, as shown in the table below. Each named executive officer, other than the Chief Executive Officer, was evaluated and scored by the Chief Executive Officer based on performance categories including contribution to successful achievement of fiscal 2008 Cisco revenue and operating income growth, customer growth, leadership at Cisco and in his area of responsibility, strategic planning, and implementation and innovation. The Chief Executive Officer’s individual performance evaluations of the named executive officers are presented to the Compensation Committee for review and approval. Based on the achievements of each individual in fiscal 2008, the Compensation Committee approved the Chief Executive Officer’s above-target IPF recommendations set forth below., 73754=In particular, for the Nomination and Governance Committee to consider a candidate recommended by a shareholder for nomination at the 2009 Annual Meeting of Shareholders, the recommendation must be delivered or mailed to and received by Cisco’s Secretary between June 27, 2009 and July 27, 2009 (or, if the 2009 annual meeting is not held within 30 calendar days of the anniversary of the date of the 2008 annual meeting, within 10 calendar days after Cisco’s public announcement of the date of the 2009 annual meeting). The recommendation must include the same information as is specified in Cisco’s bylaws for shareholder nominees to be considered at an annual meeting, including the following:, 94389=Each of the below non-employee directors held the following number of stock options and unvested restricted shares as of July 26, 2008., 442277=(6) This amount was included in the “All Other Compensation” column of the Summary Compensation Table. Cisco makes contributions to the Netherlands Capital Plan on the first day of each calendar year equal to a percentage of Mr. Elfrink’s base salary and his bonus paid during the prior calendar year, the sum of which is fixed for this purpose pursuant to a formula that limits increases in eligible earnings from year to year. These contributions for Mr. Elfrink are made without regard to a cap and are for a retirement benefit. Except as provided in the last sentence of this footnote, Cisco’s contribution to the Netherlands Capital Plan is determined as discussed below. These contribution percentages for Mr. Elfrink for fiscal 2008 were approximately 18% of eligible earnings. The amount in this column reflects the sum of Cisco’s contributions for Mr. Elfrink with respect to fiscal 2008 for the relevant portions of the 2007 and 2008 calendar years. The amount in the column does not include contributions under the Netherlands Capital Plan listed in footnote 10 to the Summary Compensation Table relating to a survivor’s death benefit, an orphan’s death benefit and a disability benefit, which benefits are described under the “Potential Payments upon Termination or Change in Control” below., 40106=Mr. Carter, 65, has been a member of the Board of Directors since July 2000. He joined Cisco in January 1995 as Vice President of Finance and Administration, Chief Financial Officer and Secretary. In July 1997, he was promoted to Senior Vice President of Finance and Administration, Chief Financial Officer and Secretary. In May 2003, upon his retirement as Chief Financial Officer and Secretary, he was appointed Senior Vice President, Office of the Chairman and CEO. Before joining Cisco, he was employed by Advanced Micro Devices, Inc. as Vice President and Corporate Controller., 103940=The following is a summary of the fees billed to Cisco by PricewaterhouseCoopers LLP for professional services rendered for the fiscal years ended July 26, 2008 and July 28, 2007:, 205928=Mr. Powell received no equity awards in fiscal 2008 due to his retirement as Executive Vice President and Chief Financial Officer effective February 15, 2008., 227054=The members of the Compensation Committee during the 2008 fiscal year were: Roderick C. McGeary (Chairperson) for all of fiscal 2008; Michael D. Capellas for all of fiscal 2008; Brian L. Halla beginning November 2007; and Jerry Yang until November 2007. No member of this committee was at any time during the 2008 fiscal year or at any other time an officer or employee of Cisco, and no member of this committee had any relationship with Cisco requiring disclosure under Item 404 of Regulation S-K. No executive officer of Cisco has served on the board of directors or compensation committee of any other entity that has or has had one or more executive officers who served as a member of the Board of Directors or the Compensation Committee during the 2008 fiscal year., 166600=In consideration of good corporate governance principles and shareholder interests, Cisco has established an email address through which shareholders may communicate with the Compensation Committee regarding executive compensation-related questions and comments. Shareholder questions and comments on Cisco’s executive compensation received at that address would be responded to in a timely manner and relevant feedback would be incorporated into the Compensation Committee’s executive compensation process. For more information, see “Shareholder Communications with the Board of Directors” on page 15 of this Proxy Statement. Also, during fiscal 2008, the Compensation Committee implemented the Cisco Systems, Inc. Executive Incentive Plan (“EIP”), which Cisco’s shareholders approved at the 2007 Annual Meeting of Shareholders with respect to current and future executive officers and Internal Revenue Code Section 162(m) “covered employees.” And, for the first time, the Compensation Committee awarded rights to receive future grants of restricted stock units based on the achievement of financial performance metrics (“PRSU rights”). Each of these new compensation components is designed to enable compliance with the exception for performance-based compensation under Section 162(m) of the Internal Revenue Code, which limits corporate deductions for certain compensation unless it is performance-based. Additionally, during fiscal 2008, Cisco’s Board of Directors adopted new stock ownership guidelines and a senior executive compensation recoupment policy., 13065=170 West Tasman Drive San Jose, California 95134-1706 NOTICE OF ANNUAL MEETING OF SHAREHOLDERS To Be Held November 13, 2008, 157739=(7) As of July 26, 2008, 361,888,657 shares were available for future issuance under the 2005 Stock Incentive Plan as reported in Cisco’s 2008 Annual Report on Form 10-K. The shares available for future issuance under the Employee Stock Purchase Plan were 62,552,641 shares, as reported in Cisco’s 2008 Annual Report on Form 10-K., 443634=(7) The return listed in this column represents the dollar value by which the amount available under the Netherlands Capital Plan as of the last day of fiscal 2008, as described in footnote 8, exceeds the sum of (i) the amount available at fiscal 2007 year-end and (ii) the aggregate contributions during fiscal 2008 by Mr. Elfrink and Cisco., 426034=Options Exercises and Stock Vested—Fiscal 2008, 480456=In addition, the proxy solicited by the Board of Directors for the 2009 Annual Meeting of Shareholders will confer discretionary authority to vote on (i) any proposal presented by a shareholder at that meeting for which Cisco has not been provided with notice on or prior to July 27, 2009 and (ii) any proposal made in accordance with the bylaw provisions, if the 2009 proxy statement briefly describes the matter and how management’s proxy holders intend to vote on it, if the shareholder does not comply with the requirements of Rule 14a-4(c)(2) under the Securities Exchange Act of 1934., 79180=On July 23, 2008, the Board of Directors approved modifications to the policy regarding initial equity grants for new non-employee directors and annual equity grants for re-elected non-employee directors for prospective purposes. The Compensation Committee, having been advised by FWC, recommended these modifications. As a result, each non-employee director who is initially appointed or elected after that date will receive an initial restricted stock unit covering 16,666 shares, which shares will vest in two equal annual installments upon the completion of each year of board service. Also, beginning with the 2008 annual meeting of shareholders, each non-employee director elected at an annual meeting of shareholders who has served as a non-employee member of the Board of Directors for at least six months prior to the election date will receive an annual restricted stock unit covering 10,000 shares, which shares will fully vest upon the completion of one year of board service. In addition, as recommended by the Compensation Committee to the Board of Directors, if Mr. Carter is re-elected at the 2008 annual meeting of shareholders, he will also receive a restricted stock unit covering 10,000 shares, which shares will fully vest upon the completion of one year of board service. Non-employee directors may elect to defer receipt of the initial and annual restricted stock units such that, to the extent the restricted stock units are vested, the units would be settled in shares after the non-employee director left the board., 432551=The following table shows the contributions and earnings during fiscal 2008, and account balance as of July 26, 2008, for named executive officers under the Cisco Systems, Inc. Deferred Compensation Plan or a defined contribution plan that Cisco maintains for eligible employees in the Netherlands (the “Netherlands Capital Plan”), as the case may be., 217337=Additional benefits are provided to Wim Elfrink for certain living and travel expenses and tax payments in connection with his international assignment in India. These amounts reflect a significant component of his total compensation reported in the Summary Compensation Table. Some of these benefits are specific to Mr. Elfrink, while others are provided under Cisco’s international assignment policy, which applies to all employees serving on international assignment and is designed to minimize any financial detriment to the employee from the assignment. Mr. Elfrink’s international assignment benefits and his other compensation and benefits are generally set forth in his International Assignment Agreement. Mr. Elfrink is also entitled to potential severance benefits under his International Assignment Agreement and pursuant to Netherlands law, as further detailed in the “Potential Payments upon Termination or Change in Control” section below. Mr. Elfrink also participates in the Netherlands Capital Plan. The values of the benefits received under Mr. Elfrink’s International Assignment Agreement and his international assignment, including those provided beyond the standard scope pursuant to the international assignment policy, have been reviewed and approved by the Compensation Committee. The Compensation Committee determined that the compensation provided under Mr. Elfrink’s International Assignment Agreement and his international assignment is appropriate in view of his responsibilities and the location and demands of his international assignment. For more information about these compensation components, including a description of the Netherlands Capital Plan, see the sections below entitled “Summary Compensation Table,” “Nonqualified Deferred Compensation—Fiscal 2008,” and “Potential Payments upon Termination or Change in Control.”, 214166=Each PRSU right described in the preceding paragraphs granted in September 2008 and each outstanding award under Cisco’s 2005 Stock Incentive Plan (and 1996 Stock Incentive Plan) that is subject to vesting provisions will vest in full (at target, for PRSU rights, until the restricted stock units are granted) and, if applicable, become immediately exercisable in the event of the named executive officer’s death, terminal illness or if Cisco is acquired by merger or asset sale, unless the award or related agreement is assumed or replaced by the acquiring entity, or in the event there is a hostile change in control or ownership of Cisco, whether through a tender or exchange offer for more than 35% of Cisco’s outstanding voting securities which the Board of Directors does not recommend the shareholders to accept, or a change in the majority of the members of the Board of Directors as a result of one or more contested elections for board membership. Cisco believes that “single trigger” equity vesting is appropriate under the circumstances described above to ensure that employees are not deprived of their equity when Cisco may not be able to arrange for appropriate vesting continuation terms and conditions. Cisco does not provide for any golden parachute excise tax “gross-up” arrangements for its named executive officers, nor does it provide employment agreements with cash severance provisions, unless under certain circumstances an executive officer is on international assignment. We refer you to the “Potential Payments upon Termination or Change in Control” section of this Proxy Statement for additional information regarding potential accelerated vesting of outstanding awards granted to the named executive officers., 54414=During Cisco’s fiscal year ended July 26, 2008, the Board of Directors held six meetings. During this period, all of the incumbent directors attended at least 75% of the aggregate of the total number of meetings of the Board of Directors and the total number of meetings held by all committees of the Board of Directors on which each such director served, during the period for which each such director served, except for Mr. Yang. Cisco’s directors are strongly encouraged to attend the annual meeting of shareholders. Nine of Cisco’s directors attended last year’s annual meeting., 82411=The following table provides information as to compensation for services of the non-employee directors during fiscal 2008., 37757=Ms. Burns, 50, has been a member of the Board of Directors since November 2003. She is the Chairman and Chief Executive Officer of Mercer LLC. She began her career in 1981 at Arthur Andersen, LLP and became a partner in 1989. In 1999, Ms. Burns joined Delta Air Lines, Inc. assuming the role of Executive Vice President and Chief Financial Officer in 2000 and holding that position through April 2004. Delta filed for protection under Chapter 11 of the United States Bankruptcy Code in September 2005. From May 2004 to January 2006, Ms. Burns served as Executive Vice President, Chief Financial Officer and Chief Restructuring Officer of Mirant Corporation, taking on the company’s bankruptcy restructuring. Upon successful restructuring and emergence of the company from bankruptcy, Ms. Burns joined Marsh & McLennan Companies, Inc. as Chief Financial Officer in March 2006. She assumed the role of Chairman and Chief Executive Officer of Mercer six months later. Ms. Burns also serves on the board of directors of Wal-Mart Stores, Inc., 23392=As an alternative to voting in person at the annual meeting, shareholders whose shares are registered in their own names may vote via the Internet, by telephone or, for those shareholders who receive a paper proxy card in the mail, by mailing a completed proxy card. The Notice of Internet Availability of Proxy Materials provides instructions on how to access your proxy card, which contains instructions on how to vote via the Internet or by telephone. For those shareholders who receive a paper proxy card, instructions for voting via the Internet or by telephone are set forth on the proxy card. Those shareholders who receive a paper proxy card and voting instructions by mail, and who elect to vote by mail, should sign and return the mailed proxy card in the prepaid and addressed envelope that was enclosed with the proxy materials, and your shares will be voted at the annual meeting in the manner you direct. In the event that you return a signed proxy card on which no directions are specified, your shares will be voted FOR each of the nominees of the Board of Directors (Proposal No. 1), FOR the ratification of the appointment of PricewaterhouseCoopers LLP as Cisco’s independent registered public accounting firm for the fiscal year ending July 25, 2009 (Proposal No. 2), AGAINST each of the two proposals submitted by shareholders (Proposal Nos. 3 and 4), and in the discretion of the proxy holders as to any other matters that may properly come before the annual meeting or any postponement or adjournment of the annual meeting., 440084=(3) The following amounts included in this column are also reported in the Summary Compensation Table as fiscal 2007 and fiscal 2008 compensation: Mr. Calderoni, $1,047,349; Mr. Justice, $389,647; Mr. Elfrink, $259,897; and Mr. Pond, $1,543,398., 145245=(11) Includes 26,215 shares held by the Richard & Mary Jo Kovacevich 2001 Trust, 49 shares held by Mr. Kovacevich’s spouse, and options to purchase 100,000 shares., 169275=Another part of Cisco’s compensation philosophy is that executive officers should earn variable cash incentives based on the achievement of financial and non-financial objectives. Following the Compensation Committee’s recommendation in March 2008, the Board of Directors adopted a recoupment policy for cash incentive awards paid to executive officers under Cisco’s annual cash incentive plan, the EIP. In the event that there were a restatement of incorrect financial results, this policy would enable the Compensation Committee, if it determined appropriate and subject to applicable laws, to seek reimbursement of the incremental portion of EIP awards paid to executive officers in excess of the awards that would have been paid based on the restated financial results. Cisco’s variable cash incentive and long-term, equity-based incentive award plans also generally provide for forfeiture if a named executive officer participates in activities detrimental to Cisco or is terminated for misconduct. Additionally, consistent with statutory requirements, including the Sarbanes-Oxley Act of 2002, and the principles of responsible oversight, and depending upon the specific facts and circumstances of each situation, the Compensation Committee would review all performance-based compensation where a restatement of financial results for a prior performance period could affect the factors determining payment of an incentive award., 209676=Actual Performance-Based Restricted Stock Units Granted as of the end of Fiscal 2008 (#), 44995=Mr. West, 53, has been a member of the Board of Directors since April 1996. He is a founder and partner of Emerging Company Partners LLC, which was formed in January 2004 and provides executive management advisory and consulting services for early to mid-stage technology companies. He served as Chief Operating Officer of nCUBE Corporation, a provider of on-demand media systems, from December 2001 to July 2003. Prior to joining nCUBE, he was the President and Chief Executive Officer of Entera, Inc. from September 1999 until it was acquired by Blue Coat Systems, Inc. (formerly CacheFlow Inc.) in January 2001. From June 1996 to September 1999, he was President and Chief Executive Officer of Hitachi Data Systems, a joint venture computer hardware services company owned by Hitachi, Ltd. and Electronic Data Systems Corporation. Prior to that, Mr. West was at Electronic Data Systems Corporation from November 1984 to June 1996. Mr. West also currently serves on the board of directors of Autodesk, Inc., 408517=* The market value of the restricted stock units and the equity incentive plan awards that have not vested is calculated by multiplying the number of units that have not vested by the closing price of our common stock on July 25, 2008, which was $22.43., 240569=(4) The amounts reflect the dollar amount recognized for financial statement reporting purposes in accordance with Financial Accounting Standards Board Statement 123(R), or FAS 123(R), and consist of the dollar amount recognized for financial statement reporting purposes in accordance with FAS 123(R) for restricted stock unit awards and, solely in the case of fiscal 2008, PRSU rights, each awarded under the 2005 Stock Incentive Plan. For each of the restricted stock unit and PRSU rights awards, fair value is calculated using the closing price on the grant date as if these awards were vested and issued on the grant date. No stock awards were forfeited by any of the named executive officers during the fiscal year. These amounts reflect Cisco’s accounting expense for these awards, and do not correspond to the actual value that may be recognized by the named executive officers. See the “Grants of Plan-Based Awards—Fiscal 2008” table below for information on restricted stock unit awards made in fiscal 2008., 75940=During fiscal 2008, cash fees earned by non-employee directors were as follows:, 241640=(5) The amounts reflect the dollar amount recognized for financial statement reporting purposes for the fiscal years ended July 26, 2008 and July 28, 2007, in accordance with FAS 123(R), of stock option awards issued pursuant to the 2005 Stock Incentive Plan and predecessor stock option plans, and thus include amounts from outstanding stock option awards granted during and prior to fiscal 2008 and fiscal 2007. For information on the valuation assumptions with respect to stock option grants, refer to the note on Employee Benefit Plans in the notes to consolidated financial statements contained in Cisco’s Annual Report on Form 10-K for the fiscal year in which the stock option was granted. The amounts shown disregard estimated forfeitures related to service-based vesting conditions. No stock options were forfeited by any of the named executive officers during the fiscal year. These amounts reflect Cisco’s accounting expense for these awards, and do not correspond to the actual value that may be recognized by the named executive officers. See the “Grant of Plan-Based Awards—Fiscal 2008” table below for information on stock option grants made in fiscal 2008., 104902=Fiscal 2007 Fees, 190478=For fiscal 2008, the worldwide revenue target for purposes of the EIP was $39.745 billion, or 13.8% growth, and actual results were $39.540 billion, or 13.2% growth. The operating income target for purposes of the EIP was $11.461 billion, or 11% growth, and actual results were $11.652 billion, or 12.9% growth. This resulted in a company performance factor of 1.01., 124618=Legislation has been introduced in the House prohibiting, “business from cooperating with officials of Internet-restricting countries in effecting the political censorship of on-line content.” The proposed legislation provides for both fines and jail time (The Global Online Freedom Act of 2007 (H.R. 275))., 477744=Requirements for Shareholder Proposals to be Considered for Inclusion in Cisco’s Proxy Materials. Shareholders of Cisco may submit proposals on matters appropriate for shareholder action at meetings of Cisco’s shareholders in accordance with Rule 14a-8 promulgated under the Securities Exchange Act of 1934. For such proposals to be included in Cisco’s proxy materials relating to its 2009 Annual Meeting of Shareholders, all applicable requirements of Rule 14a-8 must be satisfied and such proposals must be received by Cisco no later than May 28, 2009. Such proposals should be delivered to Cisco Systems, Inc., Attn: Secretary, 170 West Tasman Drive, San Jose, California 95134-1706 (and we encourage you to send a copy via email to CorporateSecretary@cisco.com), with a copy to Cisco Systems, Inc., Attn: General Counsel at the same address., 219253=Deferred Compensation Plan. The adoption of the Deferred Compensation Plan by the Board of Directors in 2007 resulted from a review of the prevalence of similar deferred compensation plans operated by Cisco’s Peer Group and a recommendation from the Compensation Committee that the Deferred Compensation Plan should be adopted. The Deferred Compensation Plan is available to all U.S. employees with the title of director or above, including the named executive officers other than Mr. Elfrink. Mr. Elfrink participates in the Netherlands Capital Plan. A primary rationale for adopting the plan was to provide an opportunity for individual retirement savings on a tax- and cost-effective basis on compensation above the Internal Revenue Code limits under the Cisco 401(k) Plan, recognizing that Cisco does not sponsor a supplemental executive retirement plan or a pension plan on behalf of the named executive officers covered by the Deferred Compensation Plan. It was also decided, based on this same rationale and because the Cisco 401(k) Plan has a matching contribution, that Cisco would begin making matching contributions starting with calendar year 2007 at the same percentage as made under the Cisco 401(k) Plan. Those matching contributions are described in the footnote to the “Nonqualified Deferred Compensation—Fiscal 2008” table below. The Deferred Compensation Plan administrator is Cisco’s 401(k) Plan Administration Committee., 306830=5/14/2010 (10), 37193=Ms. Bartz, 60, has been a member of the Board of Directors since November 1996 and has served as Lead Independent Director since November 2005. Since May 2006, she has been Executive Chairman of the Board of Autodesk, Inc. From April 1992 to April 2006, she served as Chairman of the Board and Chief Executive Officer of Autodesk. Prior to that, she was employed by Sun Microsystems, Inc. from 1983 to April 1992. Ms. Bartz also currently serves on the boards of directors of Intel Corporation and NetApp, Inc., 162109=This discussion describes and analyzes Cisco’s compensation program for the named executive officers, namely, Cisco’s Chief Executive Officer, each of the two individuals who served as Cisco’s Chief Financial Officer during fiscal 2008, and the three most highly compensated executive officers (other than the Chief Executive Officer and each Chief Financial Officer) in fiscal 2008., 110592=The Board of Directors recommends that the shareholders vote FOR the ratification of the appointment of PricewaterhouseCoopers LLP to serve as Cisco’s independent registered public accounting firm for the fiscal year ending July 25, 2009., 423820=The option to purchase 60,000 shares that was granted to Mr. Elfrink on November 3, 2000 and the option to purchase 100,000 shares that was granted to Mr. Elfrink on November 13, 2000 each have a maximum term of eight years measured from the applicable grant date, subject to earlier termination in the event of the optionee’s cessation of service with Cisco. The exercise price for each of these options is equal to the closing price per share of common stock on the grant date., 484070=CISCO WILL MAIL WITHOUT CHARGE, UPON WRITTEN REQUEST, A COPY OF CISCO’S ANNUAL REPORT ON FORM 10-K FOR THE FISCAL YEAR ENDED JULY 26, 2008, INCLUDING THE CONSOLIDATED FINANCIAL STATEMENTS, SCHEDULES AND LIST OF EXHIBITS, AND ANY PARTICULAR EXHIBIT SPECIFICALLY REQUESTED. REQUESTS SHOULD BE SENT TO: CISCO SYSTEMS, INC., 170 WEST TASMAN DRIVE, SAN JOSE, CALIFORNIA 95134-1706, ATTN: INVESTOR RELATIONS. THE ANNUAL REPORT ON FORM 10-K IS ALSO AVAILABLE AT WWW.CISCO.COM., 9347=September 19, 2008, 201097=The Compensation Committee exercised its negative discretion under the EIP to reduce Mr. Powell’s cash incentive award otherwise payable under the EIP of $1,219,575 to $673,205 to take into account his reduced role and salary from February 15, 2008 to the end of the fiscal year., 158670=In connection with Cisco’s acquisitions of Scientific-Atlanta, Inc. and WebEx Communications, Inc., the Company adopted the SA Acquisition Plan and the WebEx Acquisition Plan, respectively, each effective upon completion of the applicable acquisition. These plans constitute assumptions, amendments, restatements, and renamings of the 2003 Long-Term Incentive Plan of Scientific-Atlanta and the WebEx Communications, Inc. Amended and Restated 2000 Stock Incentive Plan, respectively. The plans permitted the grant of stock options, stock, stock units, and stock appreciation rights to certain employees of Cisco and its subsidiaries and affiliates who had been employed by Scientific-Atlanta or its subsidiaries or WebEx or its subsidiaries, as applicable. As a result of the shareholder approval of the amendment and extension of the 2005 Stock Incentive Plan, as of November 15, 2007, Cisco will no longer make stock option grants or direct share issuances under either the SA Acquisition Plan or the WebEx Acquisition Plan., 298786=(6) Prior to his appointment as Executive Vice President, Chief Financial Officer, Mr. Calderoni was eligible for a cash incentive plan for certain non-executive officer employees. The threshold and maximum possible payout amounts listed in this table represent the threshold and maximum amount for the two-fiscal-quarter period prior to his appointment as an executive officer, during which Mr. Calderoni participated in that plan. The terms of the plan are materially consistent with the Executive Incentive Plan for fiscal 2008, except individual performance is not a plan factor. Participants in the plan are compensated on the company’s achievement of certain company quarterly fiscal 2008 financial goals. The plan did not contain any target value. The actual payment from this plan, for the two fiscal quarters for which Mr. Calderoni was eligible, is included in the “Non-Equity Incentive Plan Compensation” column in the Summary Compensation Table above., 90743=(2) Includes the value of fully vested shares of Cisco common stock received in lieu of the non-employee director’s regular annual cash retainer based on the fair market value of the shares on November 15, 2007, the date the regular annual cash retainer would otherwise have been paid. Based on the prior election by each director, Ms. Bartz, Mr. Capellas, Mr. Halla and Mr. Yang each received 2,559 shares with a value of $74,979., 244744=(8) The salary paid to Mr. Elfrink was paid in Euros. The conversion rate from Euros to U.S. dollars is based on the exchange rate of 1.57070 dollars per Euro in effect on the last day of Cisco’s 2008 fiscal year., 162546=In this section, we first cover Cisco’s compensation philosophy and objectives, the cornerstone of which is pay for performance. Next we review the process the Compensation Committee follows in deciding how to compensate Cisco’s named executive officers and provide a brief overview of the components of Cisco’s compensation program. Finally, we engage in a detailed discussion and analysis of the Compensation Committee’s specific decisions about the compensation of the named executive officers for fiscal 2008., 455473=In the event of (a) a hostile change in control of Cisco or change in control in which the awards are not assumed or replaced by the acquiror, or (b) the death or terminal illness of the named executive officer (or permanent disability in the case of the August 23, 2004 option grant to Mr. Chambers), that in either case hypothetically occurred on the last business day of fiscal 2008 and further assuming that as a result all then-unvested equity awards became fully vested, the named executive officers would derive the following intrinsic value (the value based upon the fiscal 2008 year-end closing price for a Cisco common share of $22.43, and in the case of stock options minus the exercise price) from such equity awards:, 19917=Only shareholders of record of Cisco common stock on September 15, 2008, the record date, will be entitled to vote at the annual meeting. Each shareholder of record will be entitled to one vote on each matter for each share of common stock held on the record date. On the record date, there were 5,887,662,751 shares of common stock outstanding. A majority of the outstanding shares of common stock must be present or represented by proxy at the annual meeting in order to have a quorum. Abstentions and broker non-votes will be treated as shares present for the purpose of determining the presence of a quorum for the transaction of business at the annual meeting. A broker non-vote occurs when a bank, broker or other shareholder of record holding shares for a beneficial owner submits a proxy for the annual meeting but does not vote on a particular proposal because that holder does not have discretionary voting power with respect to that proposal and has not received instructions from the beneficial owner. In the election of directors, a nominee will be elected if the votes cast “for” the nominee constitute a majority of the shares of common stock present or represented by proxy and voting at the meeting and also constitute at least a majority of the required quorum. Shareholders may not cumulate votes in the election of directors. The other proposals also require the approval of the affirmative vote of a majority of the shares of common stock present or represented by proxy and voting at the annual meeting, together with the affirmative vote of a majority of the required quorum. Abstentions and broker non-votes have no effect on the determination of whether a nominee or any of the proposals has received the vote of a majority of the shares of common stock present or represented by proxy and voting at the meeting. However, with respect to the election of directors and each of the other proposals, abstentions and broker non-votes could prevent the election of a director or the approval of a proposal where the number of affirmative votes, though a majority of the votes represented and cast, does not constitute a majority of the required quorum. If the persons present or represented by proxy at the annual meeting constitute the holders of less than a majority of the outstanding shares of common stock as of the record date, the annual meeting may be adjourned to a subsequent date for the purpose of obtaining a quorum. The inspector of elections appointed for the annual meeting will separately tabulate affirmative and negative votes, abstentions and broker non-votes., 343142=$16.1500, 478652=Requirements for Shareholder Proposals to be Brought Before the Annual Meeting. Cisco’s bylaws provide that, except in the case of proposals made in accordance with Rule 14a-8, for shareholder nominations to the Board of Directors or other proposals to be considered at an annual meeting of shareholders, the shareholder must have given timely notice thereof in writing to the Secretary of Cisco not less than sixty nor more than ninety calendar days prior to the anniversary of the date on which Cisco first mailed its proxy materials for its immediately preceding annual meeting of shareholders (as specified in Cisco’s proxy materials for its immediately preceding annual meeting of shareholders). To be timely for the 2009 Annual Meeting of Shareholders, a shareholder’s notice must be delivered or mailed to and received by Cisco’s Secretary at the principal executive offices of Cisco between June 27, 2009 and July 27, 2009. However, in the event that the annual meeting is called for a date that is not within thirty calendar days of the anniversary of the date on which the immediately preceding annual meeting of shareholders was called, to be timely, notice by the shareholder must be so received not later than the close of business on the tenth calendar day following the date on which public announcement of the date of the annual meeting is first made. In no event will the public announcement of an adjournment of an annual meeting of shareholders commence a new time period for the giving of a shareholder’s notice as provided above. A shareholder’s notice to Cisco’s Secretary must set forth the information required by Cisco’s bylaws with respect to each matter the shareholder proposes to bring before the annual meeting., 112059=Mr. John C. Harrington, 1001 2nd Street, Suite 325, Napa, California 94559, a beneficial owner of 300 shares of Cisco common stock, has notified us that he intends to present the following proposal at the annual meeting:, 188778=For fiscal 2008, a target award was established for each of these named executive officers and such target award was set at 125% of the named executive officer’s annual base salary. This resulted in target awards at approximately the 50th percentile for comparable positions of the Peer Group. The company performance factor ranged from 0.0 to 2.0, the customer satisfaction factor was set at a maximum of 1.12, and the individual performance factor was set at a maximum of 2.0. The Compensation Committee retained negative discretion to reduce the customer satisfaction and individual performance factors for each named executive officer. The target for each of these three factors was 1.0. The maximum that the awards could be was 448% of the target of 125% of base salary, or 560% of base salary, assuming maximum financial performance, customer satisfaction and individual performance factors. This maximum bonus, as a percent of base salary, generally approximated the 80th percentile of the Peer Group., 43353=Mr. McGeary, 58, has been a member of the Board of Directors since July 2003. He has served as Chairman of the Board of BearingPoint, Inc. since November 2004. From November 2004 to March 2005, he also served as interim Chief Executive Officer of BearingPoint, Inc. Mr. McGeary served as Chief Executive Officer of Brience, Inc. from July 2000 to July 2002. From April 2000 to June 2000, he served as a Managing Director of KPMG Consulting LLC, a wholly owned subsidiary of BearingPoint, Inc. (formerly KPMG Consulting, Inc.). From August 1999 to April 2000, he served as Co-President and Co-Chief Executive Officer of BearingPoint, Inc. From January 1997 to August 1999, he was employed by KPMG LLP as its Co-Vice Chairman of Consulting. Prior to 1997 he served in several capacities with KPMG LLP, including audit partner for technology clients. Mr. McGeary is a Certified Public Accountant and holds a B.S. degree in Accounting from Lehigh University. Mr. McGeary also currently serves on the board of directors of Dionex Corporation., 104750=Fiscal 2008 Fees, 222523=During fiscal 2008, as part of the annual company-wide grant in September 2007, the Compensation Committee granted Mr. Chambers an option to purchase up to 900,000 shares of Cisco common stock at an exercise price of $32.21 per share and PRSU rights with a target of 200,000 restricted stock units based on Cisco’s financial performance in fiscal 2008. The exercise price for the stock option represented the closing selling price per share of Cisco’s common stock on the NASDAQ Global Select Market on the grant date. The value of these grants was targeted with reference to approximately the 50th percentile of equity grant values provided to chief executive officers of the Peer Group. The Compensation Committee concluded this equity award appropriate given Mr. Chambers’ equity compensation gain accumulations over time in relation to Cisco’s corresponding growth in value under his leadership, and Cisco’s financial results for fiscal 2007. Based on Cisco’s achievement with respect to its operating income goals for the PRSU rights at a level resulting in awards at 58% of target as discussed above, in September 2008, Mr. Chambers received a grant of 116,000 restricted stock units that vest on the same basis as other named executive officers’ comparable awards. This puts the value of the stock option and PRSU right awards for Mr. Chambers related to fiscal 2008 at between the 50th and 65th percentiles of the level of equity grants to chief executive officers of the Peer Group. The resulting total compensation value was slightly above the 50th percentile of the Peer Group., 103324=PricewaterhouseCoopers LLP has audited Cisco’s consolidated financial statements annually since Cisco’s 1988 fiscal year. Representatives of PricewaterhouseCoopers LLP are expected to be present at the annual meeting and will have the opportunity to make a statement if they desire to do so. It is also expected that those representatives will be available to respond to appropriate questions., 476951=Based on the review and discussions referred to above, the Audit Committee recommended to the Board of Directors that the audited consolidated financial statements be included in Cisco’s Annual Report on Form 10-K for its 2008 fiscal year for filing with the Securities and Exchange Commission., 453860=In addition, pursuant to a Compensation Committee policy (the “Death and Terminal Illness Policy”) which applies to each outstanding award to all employees (other than as described in the last sentence of this paragraph) and to PRSU rights awarded by the Compensation Committee in September 2007 and September 2008, and which can be revoked or changed at any time, if the holder of such an award dies or becomes terminally ill, his or her aggregate awards will generally vest in an amount equal to the greater of 100% of the unvested shares subject to the awards (at target, for PRSU rights, until the restricted stock units are granted) up to a total value of $10 million, net of aggregate exercise or purchase price, or up to one year of vesting from the date of death or determination of terminal illness. For purposes of this policy, shares subject to each award are valued based on the closing price per share of common stock on the date of death or determination of terminal illness. The dollar limit under the Death and Terminal Illness Policy does not apply to an option grant made to Mr. Chambers on August 23, 2004 to purchase up to 1,500,000 shares of Cisco common stock at an exercise price of $19.18 that vests in full upon Mr. Chambers’ death or permanent disability. In addition, for purposes of the stock option agreement relating to the August 23, 2004 grant, “service” includes providing services directly to Cisco or employment by educational or governmental institutions if those institutions’ policies preclude continued service to Cisco., 38852=Mr. Capellas, 54, has been a member of the Board of Directors since January 2006. He has served as the Chairman and Chief Executive Officer of First Data Corporation since September 2007. From October 2006 to July 2007, Mr. Capellas served as a Senior Advisor at Silver Lake Partners. From November 2002 to January 2006, he served as Chief Executive Officer of MCI, Inc., which was known as WorldCom, Inc. prior to its emergence from bankruptcy in April 2004, and from March 2004 to January 2006 he also served as that company’s President. From November 2002 to March 2004, he was also Chairman of the Board of WorldCom. Mr. Capellas left MCI as planned in early January 2006 upon its acquisition by Verizon Communications Inc. Previously, Mr. Capellas was President of Hewlett-Packard Company from May 2002 to November 2002. Before the merger of Hewlett-Packard and Compaq Computer Corporation in May 2002, Mr. Capellas was President and Chief Executive Officer of Compaq, a position he had held since July 1999, and Chairman of the Board of Compaq, a position he had held since September 2000. Mr. Capellas held earlier positions as Chief Information Officer and Chief Operating Officer of Compaq., 232518=2008, 440383=(4) These amounts were included in the “All Other Compensation” column of the Summary Compensation Table. The Deferred Compensation Plan became effective on June 25, 2007, and the first matching contribution under the Deferred Compensation Plan was made to eligible participants following the end of calendar year 2007. The matching contribution was 4% of eligible compensation over the Code Section 401(a)(17) limit of $225,000 for calendar year 2007 that was deferred by participants under the Deferred Compensation Plan. Generally, the 2008 calendar year matching contribution will be 4% of eligible compensation over the Code Section 401(a)(17) limit of $230,000 with a $1,500,000 cap on eligible compensation. Participants must be actively employed by Cisco on the last day of a calendar year to receive a matching contribution under the Deferred Compensation Plan. The amounts in this column reflect the sum of (i) actual calendar year 2007 matching contributions, excluding the portion of those contributions related to deferrals of fiscal 2007 salary (see footnote 3), and (ii) estimated calendar year 2008 matching contributions related to deferrals of fiscal 2008 salary and non-equity incentive plan compensation during calendar year 2008 that are expected to be credited to the accounts of the named executive officers following the end of calendar year 2008., 159841=On January 12, 2004, Cisco acquired Latitude Communications, Inc. (“Latitude”). As part of this transaction, options to purchase Latitude common stock held by employees who continued to be employed by Cisco or Latitude following the transaction were cancelled and replaced with an aggregate of 492,985 options to purchase shares of Cisco common stock. The shares subject to the Latitude replacement options vest on the same vesting schedule as the shares subject to the cancelled options, and have a maximum term of nine (9) years. Each Latitude replacement option has accelerated with respect to 50% of the then-unvested shares if the related employee was terminated under certain circumstances within two years of the effective date of the transaction., 230856=2008 2007, 116304=Cisco has long been active in corporate social responsibility. Cisco strives to treat employees, and the communities in which we operate, with respect and dignity. We are a supporter of the United Nations Global Compact, and have participated in this initiative since 2001. For the past three years, we have issued our annual Corporate Citizenship Report, which addresses our performance in areas including human rights generally, our progress towards the principles of the United Nations Global Compact, employee welfare, diversity, training and development, business conduct, supplier diversity and ethics, the environmental impact of our product design and lifecycle as well as our facilities and operations, our corporate giving programs, and our social investments around the world. With respect to Internet freedom, we have clearly stated our policies: Cisco does not customize, or develop specialized or unique filtering capabilities, in order to enable different regimes to block access to information; Cisco sells the same equipment worldwide; Cisco is not a service or content provider or network manager; and Cisco has no access to information about individual users of the Internet. We plan to publish our fourth annual Corporate Citizenship Report in the fall of 2008, and we intend to continue to issue regular updates which are expected to provide updated comparative data of our objectives, goals, targets and measures., 296379=(3) This restricted stock unit award was granted under the 2005 Stock Incentive Plan, vests in 20% increments on each of the first through fifth anniversaries of the date of grant, and is settled in shares on the vesting date., 242866=(6) The amounts for fiscal 2008 reflect the cash awards paid under the Executive Incentive Plan for fiscal 2008 performance, as further described in the “Compensation Discussion and Analysis” section of this Proxy Statement and the “Grants of Plan-Based Awards—Fiscal 2008” table below. For Mr. Calderoni, in addition to $957,335 paid under the Executive Incentive Plan, the amount for fiscal 2008 includes $95,000 of incentive payments he received prior to his appointment as Executive Vice President, Chief Financial Officer pursuant to a cash incentive plan for certain non-executive officer employees. The amounts for fiscal 2007 reflect the cash awards paid to the named executive officers under the Professional and Leadership Incentive Plan for fiscal 2007 performance., 424353=In September 2007, each named executive officer other than Mr. Powell was awarded the right to receive a future restricted stock unit grant under the 2005 Stock Incentive Plan, subject to the satisfaction of pre-determined operating income performance conditions during fiscal 2008. The potential awards were performance-based and were completely at risk. The share amount shown in the column above entitled “Equity Incentive Plan Awards: Number of Unearned Shares, Units, or Other Rights That Have Not Vested (#)” is the actual number of restricted stock units granted on September 11, 2008 based on actual performance during fiscal 2008, which represents 58% of the target amount. For additional information on these equity incentive plan awards, including the threshold, target, and maximum potential awards of restricted stock units for the fiscal 2008 performance period, see the table entitled “Grants of Plan-Based Awards—Fiscal 2008” above., 208147=Operating income (excluding the same factors as described above for the variable cash incentive awards) was the sole performance factor for the PRSU rights in fiscal 2008, which like the variable cash incentive award factors discussed above, aligns with Cisco’s financial growth strategy. For purposes of the PRSU rights, Cisco’s target for operating income growth for fiscal 2008 was 17.5%. The operating income growth target for PRSU rights was higher than the operating income growth target under the EIP, reflecting the fact that the PRSU rights, together with the stock options granted in fiscal 2008, were targeted with reference to the 75th percentile of the Peer Group. Based on Cisco’s operating income growth in fiscal 2008 of 12.9%, on September 2008, restricted stock units were granted in the following amounts to each of the following named executive officers, representing 58% of the target awards set forth above., 185721=After the end of fiscal 2008, the Compensation Committee made an annual adjustment to the annual base salaries of the named executive officers other than the Chief Executive Officer and Mr. Powell, to more closely align them with the 50th percentile of the Peer Group, as reflected in a study prepared by FWC in May 2008, again taking into account the period of time in their respective positions and their responsibilities and performance. Effective October 27, 2008, the annual base salaries for the affected named executive officers will be as follows: Mr. Calderoni, $600,000; Mr. Elfrink, 583,778 Euros, or $838,299 based on the exchange rate referenced at the time this adjustment was approved; Mr. Justice, $800,000; and Mr. Pond, $800,000., 36681=Effective upon his re-election to the Board of Directors in November 2008, Mr. Carter will retire from his employment and his position with Cisco as Senior Vice President, Office of the Chairman and CEO, and will serve on the Board of Directors as a non-employee director., 474487=In September 2008, the Board of Directors adopted a travel policy whereby the Company’s Chairman and Chief Executive Officer, John T. Chambers, is generally required to utilize a private airplane for business travel because his responsibilities on behalf of Cisco entail substantial national and international travel. Mr. Chambers will be reimbursed for expenses incurred in the operation of his private plane when used solely for Cisco business provided such expenses do not exceed the market rate charged for equivalent commercial charter travel. To date, there have been no reimbursements made to Mr. Chambers under this policy., 452767=Acceleration of Equity Awards. As described above in the Compensation Discussion and Analysis section, each outstanding award to all employees under the 2005 Stock Incentive Plan and the 1996 Stock Incentive Plan that is subject to vesting provisions, and each PRSU right awarded by the Compensation Committee in September 2007 and September 2008, will vest in full (at target, for PRSU rights, until the restricted stock units are granted) and, if applicable, become immediately exercisable in the event that Cisco is acquired by merger or asset sale, unless the award or related agreement is assumed or replaced by the acquiring entity, or in the event there is a hostile change in control or ownership of Cisco, whether through a tender or exchange offer for more than 35% of Cisco’s outstanding voting securities which the Board of Directors does not recommend the shareholders to accept, or a change in the majority of the members of the Board of Directors as a result of one or more contested elections for board membership., 400907=$19.1800, 485770=Dated: September 19, 2008, 77341=The 2005 Stock Incentive Plan does not provide for automatic grants to non-employee directors, but instead provides for discretionary awards to non-employee directors which may not exceed 50,000 shares for any non-employee director in any fiscal year., 47021=Cisco has policies and practices that promote good corporate governance and are compliant with the listing requirements of NASDAQ and the corporate governance requirements of the Sarbanes-Oxley Act of 2002, including:, 16187=San Jose, California September 19, 2008, 472771=A son of Richard J. Justice, an executive officer of Cisco, is employed by Cisco as a regional sales manager based in Arizona. Mr. Justice’s son received total compensation of $249,702 for fiscal 2008, calculated in the same manner as in the Summary Compensation Table. The total compensation includes salary, commissions, option awards, and matching contributions under Cisco’s 401(k) plan., 300180=Outstanding Equity Awards At 2008 Fiscal Year-End, 183762=Base Salary. Historically, annual base salaries for the named executive officers have been set at a lower level relative to the other material elements of Cisco’s executive officer compensation program, compared to the Peer Group, so that the Compensation Committee can achieve its objective of having a high percentage of each named executive officer’s total compensation be performance-based. FWC conducted an initial study for the Compensation Committee in April 2007 which concluded that base salaries had significantly trailed median competitive practice for the Peer Group. Adjustments were made to the annual base salaries of the named executive officers shortly prior to fiscal 2008 to more closely align the base salaries with market medians of the Peer Group, also taking into account the period of time the executive officers had been in their respective positions and their responsibilities and historical performance. Effective July 27, 2007, the annual base salaries for each of the named executive officers other than Frank A. Calderoni (who became an executive officer in mid-fiscal 2008) were increased to the following levels: Wim Elfrink, $750,000, or 547,275 Euros based on the exchange rate in effect at the beginning of fiscal 2008 (paid in Euros); Richard J. Justice, $750,000; and Randy Pond, $575,000. The Compensation Committee set the base salary for Mr. Calderoni at $525,000 effective upon his appointment as Executive Vice President and Chief Financial Officer on February 15, 2008, based on the same considerations that had been used in adjusting the base salaries for the other named executive officers in July 2007. Effective on the same date, in connection with Mr. Powell’s retirement as Executive Vice President, Chief Financial Officer and his continued employment as an Executive Advisor on a reduced schedule, his annual base salary was reduced to $200,000., 133403=Beneficial ownership is determined under the rules of the Securities and Exchange Commission and generally includes voting or investment power with respect to securities. Except as indicated in the footnotes to this table and pursuant to applicable community property laws, to Cisco’s knowledge the persons named in the table below have sole voting and investment power with respect to all shares of common stock beneficially owned. The number of shares beneficially owned by each person or group as of July 26, 2008 includes shares of common stock that such person or group had the right to acquire on or within 60 days after July 26, 2008, including, but not limited to, upon the exercise of options or the vesting of restricted stock units. References to options in the footnotes of the table below include only options to purchase shares outstanding as of July 26, 2008 that were exercisable on or within 60 days after July 26, 2008, and references to restricted stock units in the footnotes of the table below include only restricted stock units outstanding as of July 26, 2008 that would vest and settle on or within 60 days after July 26, 2008. For each individual and group included in the table below, percentage ownership is calculated by dividing the number of shares beneficially owned by such person or group by the sum of the 5,893,396,457 shares of common stock outstanding on July 26, 2008 plus the number of shares of common stock that such person or group had the right to acquire on or within 60 days after July 26, 2008., 90488=(1) Larry R. Carter, a director, is an executive officer of Cisco (other than a named executive officer). Mr. Carter did not receive any compensation for services provided as a director in fiscal 2008., 432983=Nonqualified Deferred Compensation — Fiscal 2008, 46057=Mr. Yang, 39, has been a member of the Board of Directors since July 2000. He is a co-founder of Yahoo! Inc. and has served as a member of the board of directors and an officer of Yahoo! since March 1995. He was appointed as Chief Executive Officer of Yahoo! in June 2007., 247962=Grants of Plan-Based Awards—Fiscal 2008, 225388=The information contained in this report shall not be deemed to be “soliciting material,” to be “filed” with the SEC, or to be subject to Regulation 14A or Regulation 14C (other than as provided in Item 407 of Regulation S-K) or to the liabilities of Section 18 of the Securities Exchange Act of 1934, and shall not be deemed to be incorporated by reference in future filings with the SEC except to the extent that Cisco specifically incorporates it by reference into a document filed under the Securities Act of 1933 or the Securities Exchange Act of 1934., 180240=The three major elements of Cisco’s executive officer compensation continue to be: (i) base salary, (ii) variable cash incentive awards, and (iii) long-term, equity-based incentive awards. However, similar to the practice of many members of the Peer Group, for retention purposes and as its business becomes increasingly global, Cisco has increased base salaries closer to the 50th percentile of the Peer Group and gradually shifted toward restricted stock units as the primary equity component of executive officer compensation. Reflecting the global nature of its business, one of Cisco’s fiscal 2008 named executive officers, Wim Elfrink, is on international assignment in India. As further described below, the Compensation Committee has approved an International Assignment Agreement with Mr. Elfrink that contains several items of compensation and benefits relating to his international assignment and to his “home” country of the Netherlands, in addition to the three major elements of Cisco’s executive compensation program. For fiscal 2008 over 90% of the aggregate value of the three major elements of compensation actually paid or awarded to each named executive officer was performance-based (except in the case of Dennis Powell, who received no long-term equity incentive awards due to his retirement as Executive Vice President and Chief Financial Officer), reflecting Cisco’s core compensation philosophy to pay for performance., 239936=(2) Effective February 15, 2008, in connection with Mr. Calderoni’s appointment as Executive Vice President, Chief Financial Officer, he received an increase in annual base salary to $525,000. Effective on the same date, in connection with Mr. Powell’s retirement as Executive Vice President, Chief Financial Officer and his continued employment as an Executive Advisor, his annual base salary was reduced to $200,000., 465995=(1) Represents the intrinsic value of full acceleration of Mr. Chambers’ stock options (other than his August 23, 2004 option grant) and Mr. Chambers’ PRSU rights of $7,159,450 assuming the options and the PRSU rights were to be accelerated under the Death and Terminal Illness Policy, and the intrinsic value of full acceleration of Mr. Chambers’ August 23, 2004 stock option of $4,875,000, which option is not subject to the Death and Terminal Illness Policy. Mr. Chambers’ August 23, 2004 option also accelerates in full in the event of a permanent disability. These values have not been, and may never be, realized., 206310=The Compensation Committee’s philosophy for these grants was that 60% of the total targeted value of grants be in stock options, which have value only if Cisco’s share price increases over the option term, and the remaining 40% consist of PRSU rights which have incentive value in that they promote achievement of the performance condition associated with the rights and retention value to the extent that the performance condition associated with the rights is achieved. The Compensation Committee selected PRSU rights because these amounts increase the named executive officer’s equity interest in Cisco which is in direct alignment with shareholder interests. For each named executive officer, the total targeted value of his fiscal 2008 annual equity grant was divided by the per share value of a stock option, resulting in a total number of stock option equivalents. As noted above, each named executive officer received 60% of the total number of stock option equivalents in stock options. For the remaining 40%, each named executive officer received 1 PRSU right for each 3 remaining stock option equivalents. This reflects the Compensation Committee’s determination that 1 PRSU right is equivalent to 3 stock options when the grant target is based on the 75th percentile of the Peer Group. This exchange ratio is more conservative than the methodology used under Cisco’s shareholder approved 2005 Stock Incentive Plan for calculating the number of shares remaining available for grant, which values 2.5 stock options as equivalent to 1 restricted stock unit. The restricted stock units underlying these PRSU rights are 20% vested at grant (i.e., following the conclusion of the one-year performance period) and in equal 20% annual installments over the subsequent four years., 228009=The following table sets forth the compensation earned by the Named Executive Officers for services rendered in all capacities to Cisco and its subsidiaries for the last fiscal year. No executive officer who would have otherwise been includable in such table on the basis of total compensation earned for Cisco’s 2008 fiscal year has been excluded by reason of his or her termination of employment or change in executive officer status during the fiscal year., 102645=Cisco is asking the shareholders to ratify the Audit Committee’s appointment of PricewaterhouseCoopers LLP as Cisco’s independent registered public accounting firm for the fiscal year ending July 25, 2009. In the event the shareholders fail to ratify the appointment, the Audit Committee will reconsider this appointment. Even if the appointment is ratified, the Audit Committee, in its discretion, may direct the appointment of a different independent registered public accounting firm at any time during the year if the Audit Committee determines that such a change would be in Cisco’s and its shareholders’ best interests., 132739=The following table sets forth information known to Cisco with respect to beneficial ownership of Cisco common stock as of July 26, 2008 for (i) each director and nominee, (ii) Cisco’s Chief Executive Officer, each individual who served as Cisco’s Chief Financial Officer during the 2008 fiscal year and the three most highly compensated executive officers (other than the Chief Executive Officer and the individuals who served as Chief Financial Officer) named in the table entitled “Summary Compensation Table” below (the “named executive officers”) and (iii) all executive officers and directors as a group., 405023=$32.2100, 158123=The 1997 Supplemental Stock Incentive Plan, 240408=(3) Represents a discretionary cash bonus awarded to Mr. Chambers for services rendered during fiscal 2007., 91228=(3) Includes the value of fully vested deferred stock units received in lieu of all or a specified portion of the non-employee director’s regular annual cash retainer based on the fair market value of the underlying shares on November 15, 2007, the date the regular annual cash retainer would otherwise have been paid. Based on the prior election by each director, Ms. Burns and Dr. Hennessy each received 2,559 deferred stock units with a value of $74,979, and Mr. Powell received 639 deferred stock units with a value of $18,723., 295313=(2) The amounts shown in these rows reflect, in share amounts, the threshold, target, and maximum potential awards of restricted stock units for the fiscal 2008 performance period, as further described in the Compensation Discussion and Analysis section beginning on page 27. In September 2007, each named executive officer other than Mr. Powell was awarded a PRSU right under the 2005 Stock Incentive Plan, subject to the satisfaction of pre-determined operating income performance conditions during fiscal 2008, with a threshold award equal to 50% of the target grant and a maximum award equal to 120% of the target grant. The potential awards were performance-based and were completely at risk. Based on actual performance during fiscal 2008, in September 2008 each named executive officer other than Mr. Powell was granted restricted stock units representing 58% of their target amount, as follows: Mr. Chambers, 116,000; Mr. Calderoni, 30,933; Mr. Elfrink, 73,466; Mr. Justice, 73,466; and Mr. Pond, 61,866., 449441=Mr. Elfrink—Non-Equity Severance Payments. Set forth below is a description of the benefits to which Mr. Elfrink or his family would be entitled, assuming a qualifying termination, illness or death on the last business day of fiscal 2008. These benefits would have been payable in Euros and unless otherwise noted, the conversion rate from Euros to U.S. dollars is based on the exchange rate of 1.57070 dollars per Euro in effect on the last day of fiscal 2008., 425355=The following table shows the number of shares acquired on stock option exercises and vesting of restricted stock units by each of the named executive officers during fiscal 2008. The table also presents the value realized upon such exercises and vesting, as calculated, in the case of stock options, based on the difference between the market price of Cisco’s common stock at exercise and the option exercise price, and as calculated, in the case of restricted stock units, based on the closing selling price per share of Cisco’s common stock on the NASDAQ Global Select Market on the vesting date., 364728=$17.2600, 445921=In addition, Cisco may credit additional matching amounts to a participant’s account for any plan year as determined by the Compensation Committee. For calendar years 2007 and 2008 there are matching contributions on deferrals over the IRS limitation on compensation that may be taken into account under the 401(k) Plan ($225,000 for 2007 and $230,000 for 2008). The matching rate for calendar year 2007, 100% of eligible compensation up to 4%, was the same rate as in the 401(k) Plan. Generally, the 2008 calendar year matching contribution is 4% of eligible compensation over the Code Section 401(a)(17) limit (the same matching rate as in the 401(k) Plan), with a $1,500,000 cap on eligible compensation. Participants must be actively employed by Cisco on the last day of a calendar year to receive a matching contribution under the Deferred Compensation Plan., 42446=Mr. Kovacevich, 64, has been a member of the Board of Directors since January 2005. He currently serves as Chairman of the Board of Wells Fargo & Company, which position he has held since April 2001. He also served as Chief Executive Officer of Wells Fargo & Company from November 1998 to June 2007, and as President from November 1998 to July 2005. From January 1993 to November 1998, he served as Chief Executive Officer of Norwest Corporation, which merged with Wells Fargo & Company in November 1998. He also served as President of Norwest Corporation from January 1993 through January 1997 and as Chairman of the Board of Norwest Corporation from May 1995 to November 1998. He became a member of the board of directors of Norwest Corporation in 1986. Mr. Kovacevich also currently serves on the board of directors of Target Corporation., 191998=Based on customer responses to a survey with questions relating to customer satisfaction in 2008, the Compensation Committee determined that Cisco exceeded its customer satisfaction goal and did not exercise negative discretion to reduce the maximum multiplier of 1.12., 243696=(7) The amounts for fiscal 2008 include actual and estimated matching contributions by Cisco under the Cisco Systems, Inc. Deferred Compensation Plan on behalf of the following named executive officers: Mr. Calderoni, $63,877; Mr. Justice, $101,569; and Mr. Pond, $108,078. These amounts represent matching contributions related to fiscal 2008 salary deferred during calendar year 2007, as well as estimated matching contributions related to fiscal 2008 salary and non-equity incentive plan compensation deferred during calendar year 2008 that are expected to be credited to the accounts of these named executive officers following the end of calendar year 2008. See “Nonqualified Deferred Compensation—Fiscal 2008” for more information. For Mr. Justice and Mr. Pond, the amounts for fiscal 2007 include company matching contributions for calendar year 2007 of $9,231 and $17,308, respectively, related to participant deferrals of fiscal 2007 salary, that were credited to them in January 2008., 154767=(2) Includes 2,158,807 performance-based rights to receive future grants of restricted stock units based on Cisco’s financial performance in fiscal 2008. The amount of rights included is based on the actual number of restricted stock units granted on September 11, 2008 based on actual performance during fiscal 2008. The weighted-average exercise price in column (b) does not take these awards into account., 193865=Cash incentive payments for fiscal 2008 pursuant to the EIP to the named executive officers other than the Chief Executive Officer were as follows (the Chief Executive Officer’s EIP award is addressed separately under “CEO Compensation” below):, 176828=In determining executive compensation, the Compensation Committee also considers, among other factors, the possible tax consequences to Cisco and to its executives. To maintain maximum flexibility in designing compensation programs, the Compensation Committee, while considering tax deductibility as one of its factors in determining compensation, will not limit compensation to those levels or types of compensation that are intended to be deductible. Of course, the Compensation Committee will consider alternative forms of compensation, consistent with its compensation goals, that preserve deductibility. As previously noted, the cash incentive awards paid under Cisco’s EIP and the stock options and PRSU rights awarded under Cisco’s 2005 Stock Incentive Plan to named executive officers for fiscal 2008 are intended to comply with the exception for performance-based compensation under Internal Revenue Code Section 162(m)., 156791=(5) Excludes options, warrants and other equity rights assumed by Cisco in connection with mergers and acquisitions, other than assumed under the SA Acquisition Plan and the WebEx Acquisition Plan. As of July 26, 2008, a total of 30,889,674 shares of common stock were issuable upon exercise of outstanding options under those other assumed arrangements. The weighted average exercise price of those outstanding options is $15.82 per share. No additional awards may be granted under those assumed arrangements., 17666=These proxy materials are provided in connection with the solicitation of proxies by the Board of Directors of Cisco Systems, Inc., a California corporation, for the Annual Meeting of Shareholders to be held at 10:00 a.m. Pacific Time on Thursday, November 13, 2008, at the Santa Clara Convention Center in Elizabeth A. Hangs Theater, located at 5001 Great America Parkway, Santa Clara, California, and at any adjournments or postponements of the annual meeting. These proxy materials were first sent on or about September 25, 2008 to shareholders entitled to vote at the annual meeting., 120606=Boston Common Asset Management, LLC, 84 State Street, Suite 1000, Boston, Massachusetts 02109, a beneficial owner of 85,996 shares of Cisco common stock, joined by other filers (whose names, addresses and shareholdings will be provided by Cisco promptly upon receipt by Cisco Investor Relations of any oral or written request), have notified us that they intend to present the following proposal at the meeting:, 221708=For fiscal 2008, Mr. Chambers’ annual cash incentive payment of $3,002,802 was determined under the EIP. The target for Mr. Chambers’ award was set at 185% of the median CEO base salary of the Peer Group, which median salary was $1,121,000. Mr. Chambers’ financial performance and customer satisfaction factors were the same as the other named executive officers, and his individual performance factor was 1.28, reflecting the Compensation Committee’s belief that Mr. Chambers’ performed well in a challenging environment. The fiscal 2008 cash incentive payment together with the fiscal 2008 base salary puts Mr. Chambers’ total cash compensation well below the 50th percentile of actual total cash compensation paid for a comparable position in the Peer Group., 193306=Mr. Calderoni was appointed Executive Vice President and Chief Financial Officer effective February 15, 2008. In connection with his promotion, Mr. Calderoni’s target award percentage under the EIP increased from 75% to 125% of his base salary in effect at the end of fiscal 2008, for the period between February 15, 2008 and the end of fiscal 2008. Each portion of Mr. Calderoni’s EIP payment was pro-rated to account for the portions of the fiscal year that he served in his current and prior positions., 144012=(5) Includes 2,588 shares held by the Carter Revocable Trust dated October 18, 1994 and options to purchase 2,892,967 shares., 337792=$56.1563, 40742=Mr. Chambers, 59, has served as a member of the Board of Directors since November 1993 and as Chairman of the Board since November 2006. He joined Cisco as Senior Vice President in January 1991, was promoted to Executive Vice President in June 1994 and to Chief Executive Officer as of January 31, 1995. He also served as President from January 31, 1995 until November 2006. Before joining Cisco, he was employed by Wang Laboratories, Inc. for eight years, where, in his last role, he was the Senior Vice President of U.S. Operations., 75715=This section provides information regarding the compensation policies for non-employee directors and amounts paid and securities awarded to these directors in fiscal 2008., 212347=Based on the volatility of Cisco’s stock price and the fact that many of the Peer Group companies now grant restricted stock units and restricted stock awards and not stock options, the Compensation Committee believes that for fiscal 2009, PRSU rights and restricted stock units with purely time-based vesting are the appropriate long-term incentive for named executive officers and stock options will not be granted to the named executive officers. The Compensation Committee determined that a split of 70% PRSU rights and 30% time-based restricted stock units represents the appropriate balance for fiscal 2009 long-term incentives between performance and retention. Accordingly, in September 2008, PRSU rights were awarded in the following target amounts, with a four-year vesting schedule, to each of the following named executive officers: Mr. Calderoni, 140,000; Mr. Elfrink, 210,000; Mr. Justice, 175,000; and Mr. Pond, 175,000. In addition, in September 2008 the Committee granted restricted stock units with four-year, time-based annual vesting to each of those named executive officers, in the following amounts: Mr. Calderoni, 60,000; Mr. Elfrink, 90,000; Mr. Justice, 75,000; and Mr. Pond, 75,000. The Compensation Committee believes that these PRSU rights and restricted stock units, in combination, contain the right mix of performance and retention incentives. For fiscal 2009, the Compensation Committee decided to use four-year vesting instead of five-year vesting based on the grant practices of the Peer Group and the recommendation of FWC. The foregoing awards were targeted with reference to the 75th percentile of the Peer Group. The awards to the Chief Executive Officer, Mr. Chambers, are addressed separately under “CEO Compensation” below., 108245=Tax Fees. Consists of fees billed for professional services for tax compliance, tax advice and tax planning. These services include assistance regarding federal, state and international tax compliance, assistance with tax reporting requirements and audit compliance, assistance with customs and duties compliance, value-added tax compliance, mergers and acquisitions tax compliance, and tax advice on international, federal and state tax matters. None of these services were provided under contingent fee arrangements. Tax compliance fees were $924,000 and $1,367,000 in fiscal 2008 and fiscal 2007, respectively. All other tax fees were $23,000 and $36,000 in fiscal 2008 and fiscal 2007, respectively., 17441=170 West Tasman Drive San Jose, California 95134-1706 PROXY STATEMENT FOR ANNUAL MEETING OF SHAREHOLDERS, 239608=(1) Effective February 15, 2008, Mr. Calderoni succeeded Mr. Powell as Executive Vice President, Chief Financial Officer upon Mr. Powell’s retirement from that position. Mr. Powell currently serves as Executive Advisor, Office of the Chairman and CEO, on a reduced schedule., 14304=The foregoing items of business are more fully described in the Proxy Statement. The record date for determining those shareholders who will be entitled to notice of, and to vote at, the annual meeting and at any adjournments or postponements thereof is September 15, 2008. The stock transfer books will not be closed between the record date and the date of the annual meeting. A list of shareholders entitled to vote at the annual meeting will be available for inspection at Cisco’s principal executive offices at the address listed above., 445095=Amounts deferred by each participant pursuant to the Deferred Compensation Plan are credited to a bookkeeping account maintained on behalf of that participant. Amounts credited to each participant under the Deferred Compensation Plan are periodically adjusted for earnings and/or losses at a rate that is equal to one or more of the measurement funds selected by the 401(k) Plan Committee and elected by a participant. Currently, the measurement funds consist of the following: Fidelity Money Market Fund; iShares Lehman Aggregate Bond Fund; SPDR Trust, Series 1; Mid Cap SPDR Trust, Series 1; iShares Russell 2000 Index Fund; iShares MCSI EAFE Index Fund; Fidelity Freedom 2010 Fund; Fidelity Freedom 2020 Fund; Fidelity Freedom 2030 Fund; and Fidelity Freedom 2040 Fund., 212092=The foregoing equity grants for fiscal 2008, with the actual restricted stock unit grant listed in the foregoing table, represent grants generally in the range of the 75th percentile of the Peer Group., 247333=The following table provides information on awards of stock options, restricted stock units, performance-based rights to receive future grants of restricted stock units, and cash-based performance awards in fiscal 2008 to each of Cisco’s named executive officers. There can be no assurance that the Grant Date Fair Value of the Stock Option and Stock Unit Awards will ever be realized. The amounts of these awards that were expensed during fiscal 2008 are included in the “Stock Awards” and “Option Awards” columns of the Summary Compensation Table., 170846=In its process for deciding how to compensate Cisco’s named executive officers, the Compensation Committee begins by considering the competitive market data provided by its independent compensation consultant and Cisco’s human resources staff. The Compensation Committee engaged an independent compensation consultant, Frederic W. Cook & Co., Inc. (“FWC”), to provide advice and recommendations on competitive market practices and specific compensation decisions. For purposes of evaluating competitive practices, the Compensation Committee, with assistance from FWC, identified criteria to select a list of companies which comprise Cisco’s Peer Group. The Peer Group is generally reviewed annually and was last updated during fiscal 2008, in November 2007. The Peer Group established in January 2007, and a study of Peer Group data prepared by FWC in April 2007, were used for compensation decisions made prior to November 2007 (including most compensation targets for fiscal 2008). The Peer Group as updated in November 2007, and studies of Peer Group data prepared by FWC in May and August 2008, have been used for compensation decisions thereafter and for year-end compensation benchmarking. Cisco’s Peer Group consists of major information technology companies with related Global Industrial Classification System (GICS) codes, market capitalizations greater than $25 billion and revenues greater than $5 billion, and general-industry peer companies with market capitalizations of greater than $100 billion that have similar pay models and practices. Applying the foregoing criteria, the addition of Merck was the only change in November 2007 to the Peer Group established in January 2007. The members of the Peer Group, including Merck, are as follows:, 22734=Cisco’s Board of Directors recommends that you vote FOR each of the nominees of the Board of Directors (Proposal No. 1), FOR the ratification of the appointment of PricewaterhouseCoopers LLP as Cisco’s independent registered public accounting firm for the fiscal year ending July 25, 2009 (Proposal No. 2), and AGAINST each of the two proposals submitted by shareholders (Proposal Nos. 3 and 4)., 475953=The Audit Committee has reviewed and discussed with Cisco’s management and PricewaterhouseCoopers LLP the audited consolidated financial statements of Cisco contained in Cisco’s Annual Report on Form 10-K for the 2008 fiscal year. The Audit Committee has also discussed with PricewaterhouseCoopers LLP the matters required to be discussed by SAS No. 61, as amended (AICPA, Professional Standards, Vol. 1. AU section 380), as adopted by the Public Company Accounting Oversight Board in Rule 3200T., 77646=On November 15, 2007, at the last annual meeting of shareholders, each of the non-employee directors was re-elected to the Board of Directors, and pursuant to a pre-existing policy adopted by the Board of Directors, on that date each of them received a stock option grant to purchase 15,000 shares and a restricted stock grant of 5,000 shares. The per share exercise price of the stock options is equal to the closing price of a Cisco common share on the grant date, which was $29.30. The shares subject to these options vest in two successive equal annual installments upon the completion of each year of board service. The restricted stock awards vest upon the completion of one year of board service. The restricted stock and the shares subject to each option will vest immediately in full upon certain changes in control or ownership of Cisco or upon the optionee’s death or disability while a member of the Board of Directors., 245340=(10) This amount is comprised primarily of certain living expenses, tax restoration payments and travel expenses borne by Cisco in connection with Mr. Elfrink’s International Assignment Agreement and his international assignment. The perquisites and personal benefits received in fiscal 2008 pursuant to these arrangements include: $680,324 for housing expenses in India, including house maintenance, domestic household assistance, and temporary housing; and $297,953 for net tax equalization (based on an estimate of the portion of Mr. Elfrink’s tax payments for calendar years 2007 and 2008 that relate to fiscal 2008). Other such perquisites and personal benefits whose incremental cost is included in the amount shown consist of the following: housing assistance in the United States; provision of security arrangements; allowances for automobiles, child education, home leave travel and relocation; and payments of medical expenses, fees for tax services and expenses relating to household shipment of goods. Cisco also reimbursed Mr. Elfrink for personal expenses, including spousal travel and personal expenses, in connection with a November 2007 trip he attended to recognize sales personnel achievements. Cisco made contributions of $270,852 (comprised of $223,154, $35,553, $2,222 and $9,923 for a defined contribution premium, a survivor’s death benefit, an orphan’s death benefit and a disability benefit, respectively) on behalf of Mr. Elfrink under the Netherlands Capital Plan. See “Nonqualified Deferred Compensation—Fiscal 2008” for more information on the Netherlands Capital Plan. Certain of these items paid to Mr. Elfrink were paid in Euros and others in Indian rupees. The conversion rates from Euros to U.S. dollars and from Indian rupees to U.S. dollars are based on the exchange rates of 1.57070 U.S. dollars per Euro and 0.02373 U.S. dollars per Indian rupee in effect on the last day of Cisco’s 2008 fiscal year., 224165=In September 2008, the Compensation Committee also awarded to Mr. Chambers PRSU rights with a target of 315,000 restricted stock units based on Cisco’s financial performance in fiscal 2009, as well as 135,000 restricted stock units. Each of these awards is subject to the same vesting and other conditions as such awards granted to the other named executive officers. The Compensation Committee awarded Mr. Chambers’ awards with reference to the 50th percentile level of equity grants provided to chief executive officers of the Peer Group., 296659=(4) These stock option awards were granted under the 2005 Stock Incentive Plan. The options incrementally vest as to 20% of the shares subject to the options on the first anniversary of grant and thereafter vest in monthly pro-rata increments over the following forty-eight months. The options have a maximum term of nine years subject to earlier termination upon cessation of service to Cisco. The exercise price of each option may be paid in cash or in shares of common stock valued at the closing price on the exercise date or may be paid with the proceeds from a same-day sale of the purchased shares., 444030=(8) The amount in this column represents the funds available under the Netherlands Capital Plan as of July 26, 2008 that would have been available to Mr. Elfrink to purchase a retirement annuity (covering his life and that of his spouse) had he elected to retire as of that date., 80976=In July 2008, the Board of Directors approved new stock ownership guidelines for non-employee directors. These guidelines call for each non-employee director to own shares of the Company’s common stock having a value equal to at least five times the non-employee director’s regular annual cash retainer, with a five-year period to attain that ownership level. To facilitate share ownership, non-employee directors may elect to receive, in lieu of all or a specified portion of their regular annual cash retainer, fully vested shares of Cisco common stock or deferred stock units that would be settled in shares after the non-employee director left the board, based on the fair market value of the shares on the date any regular annual cash retainer would otherwise be paid. Any shares (or shares subject to deferred stock units) received in lieu of any portion of a regular annual cash retainer do not count against the limit on the total number of shares that may be granted to a non-employee director during any fiscal year. The shares issued are granted under the 2005 Stock Incentive Plan. For information on non-employee director elections to receive fully vested shares (or shares subject to deferred stock units) in lieu of cash with respect to the fiscal 2008 annual cash retainer, please see the table entitled “Director Compensation” and the accompanying footnotes below.}",
    "textBeforeTable": "Consistent with Cisco’s goal to pay for performance, the majority of the named executive officers’ on-target total compensation comes from the grant of long-term incentives. In September 2007, the Compensation Committee made its fiscal 2008 annual awards to Cisco’s named executive officers under Cisco’s 2005 Stock Incentive Plan with reference to the value of the 75th percentile of long-term incentives granted to comparable positions in the Peer Group. Grants of stock options, and awards of PRSU rights based on Cisco’s financial performance in fiscal 2008, were made to the following named executive officers as follows: Long-Term, Equity-Based Incentive Awards. Long-term incentives are the central element of Cisco’s executive compensation program. Cisco continues to grant equity to a large U.S. and international employee population to align the interests of employees with those of shareholders. These EIP payments for active named executive officers are generally slightly above the 50th percentile of amounts paid for comparable positions in the Peer Group and represent a range of approximately 180% to 220% of each recipient’s annual base salary. The Compensation Committee exercised its negative discretion under the EIP to reduce Mr. Powell’s cash incentive award otherwise payable under the EIP of $1,219,575 to $673,205 to take into account his reduced role and salary from February 15, 2008 to the end of the fiscal year. * Pro-rated to this amount to reflect the portion of the year served in the applicable position.",
    "textAfterTable": "Mr. Powell received no equity awards in fiscal 2008 due to his retirement as Executive Vice President and Chief Financial Officer effective February 15, 2008. The awards to the Chief Executive Officer, Mr. Chambers, are addressed separately under “CEO Compensation” below. The Compensation Committee’s philosophy for these grants was that 60% of the total targeted value of grants be in stock options, which have value only if Cisco’s share price increases over the option term, and the remaining 40% consist of PRSU rights which have incentive value in that they promote achievement of the performance condition associated with the rights and retention value to the extent that the performance condition associated with the rights is achieved. The Compensation Committee selected PRSU rights because these amounts increase the named executive officer’s equity interest in Cisco which is in direct alignment with shareholder interests. For each named executive officer, the total targeted value of his fiscal 2008 annual equity grant was divided by the per share value of a stock option, resulting in a total number of stock option equivalents. As noted above, each named executive officer received 60% of the total number of stock option equivalents in stock options. For the remaining 40%, each named executive officer received 1 PRSU right for each 3 remaining stock option equivalents. This reflects the Compensation Committee’s determination that 1 PRSU right is equivalent to 3 stock options when the grant target is based on the 75th percentile of the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}