{
    "relation": [
        [
            "Setting",
            "Network security: Do not store LAN Manager hash value on next password change",
            "Network security: Force logoff when logon hours expire",
            "Network security: LAN Manager authentication level",
            "Network security: LDAP client signing requirements",
            "Network security: Minimum session security for NTLM SSP based (including secure RPC) clients",
            "Network security: Minimum session security for NTLM SSP based (including secure RPC) servers"
        ],
        [
            "Windows Vista default",
            "Enabled",
            "Disabled",
            "Send NTLMv2 response only",
            "Negotiate signing",
            "No minimum",
            "No minimum"
        ],
        [
            "EC VSG Computer GPOs",
            "Enabled",
            "Not Defined",
            "Send NTLMv2 response only. Refuse LM",
            "Negotiate signing",
            "Require NTLMv2 session security, Require 128-bit encryption",
            "Require NTLMv2 session security, Require 128-bit encryption"
        ],
        [
            "SSLF VSG Computer GPOs",
            "Enabled",
            "Not Defined",
            "Send NTLMv2 response only. Refuse LM and NTLM",
            "Negotiate signing",
            "Require NTLMv2 session security, Require 128-bit encryption",
            "Require NTLMv2 session security, Require 128-bit encryption"
        ]
    ],
    "pageTitle": "Appendix A: Security Group Policy Settings",
    "title": "",
    "url": "https://technet.microsoft.com/en-us/bb679962.aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00099-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 887763931,
    "recordOffset": 887670399,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{125875=Note   Microsoft released several security updates in October 2003 that used a version of Update.exe that required the administrator to have theDebug programs user right. Administrators who did not have this user right were unable to install these security updates until they reconfigured their user rights. This is not typical behavior for operating system updates. For more information, see the Knowledge Base article 830846, \" Windows Product Updates may stop responding or may use most or all the CPU resources.\", 280729=If all of the computers on your network can support NTLMv2 and 128-bit encryption (for example, Windows Vista, Windows XP Professional SP2 and Windows Server 2003 SP1), all four setting options can be selected for maximum security., 210374=Microsoft network client: Digitally sign communications (always) This policy setting determines whether packet signing is required by the SMB client component. If you enable this policy setting, the Microsoft network client computer cannot communicate with a Microsoft network server unless that server agrees to sign SMB packets. In mixed environments with legacy client computers, set this option to Disabled because these computers will not be able to authenticate or gain access to domain controllers. However, you can use this policy setting in Windows 2000 or later environments., 277922=Network security: LAN Manager authentication level This policy setting specifies the type of challenge/response authentication for network logons. LAN Manager (LM) authentication is the least secure method; it allows encrypted passwords to be cracked because they can be easily intercepted on the network. NT LAN Manager (NTLM) is somewhat more secure. NTLMv2 is a more robust version of NTLM that is available in Windows Vista, Windows XP Professional, Windows Server 2003, Windows 2000, and Windows NT 4.0 Service Pack 4 (SP4) or later. NTLMv2 is also available for Windows 95 and Windows 98 with the optional Directory Services Client., 330828=The Maximum system log size setting is configured to 32768 KB for all computers in the two environments that are discussed in this guide., 21667=Ensure that the Store passwords using reversible encryption for all users in the domain setting has a Disabled configuration, as it is in the Default Domain Group Policy object (GPO) of Windows Server 2003 and in the local security policy for workstations and servers. This policy setting is also Disabled in the two environments that are defined in this guide., 180729=Devices: Prevent users from installing printer drivers It is feasible for a attacker to disguise a Trojan horse program as a printer driver. The program may appear to users as if they must use it to print, but such a program could unleash malicious code on your computer network. To reduce the possibility of such an event, only administrators should be allowed to install printer drivers. However, because laptops are mobile devices, laptop users may occasionally need to install a printer driver from a remote source to continue their work. Therefore, this policy setting should be disabled for laptop users, but always enabled for desktop users., 191852=Domain member: Require strong (Windows 2000 or later) session key When this policy setting is enabled, a secure channel can only be established with domain controllers that are capable of encrypting secure channel data with a strong (128-bit) session key., 281920=If all of the computers on your network can support NTLMv2 and 128-bit encryption (for example, Windows Vista, Windows XP Professional SP2 and Windows Server 2003 SP1), all four options can be selected for maximum security., 17322=Minimum password length This policy setting determines the least number of characters that make up a password for a user account. There are many different theories about how to determine the best password length for an organization, but perhaps \"pass phrase\" is a better term than \"password.\" In Microsoft® Windows 2000 and later versions, pass phrases can be quite long and can include spaces. Therefore, a phrase such as \"I want to drink a $5 milkshake\" is a valid pass phrase; it is a considerably stronger password than an 8 or 10 character string of random numbers and letters, and yet is easier to remember. Remember that users must be educated about the proper selection and maintenance of passwords, especially with regard to password length., 726007=\" IPSec Default Exemptions Can Be Used to Bypass IPsec Protection in Some Scenarios\" Knowledge Base article 811832., 23442=You can implement this configuration for an entire domain through Group Policy, or edit the registry to implement it for one or more specific users. For more information about this configuration, see Microsoft Knowledge Base article 324744, \" How To: Prevent Users from Changing a Password Except When Required in Windows Server 2003.\" If you have a Windows 2000–based domain, see Knowledge Base article 309799, \" How To: Prevent Users from Changing a Password Except When Required in Windows 2000.\", 172627=The Audit Policy settings available in Windows Server 2003 Active Directory do not yet contain settings for managing the new auditing subcategories. To properly apply the auditing policies prescribed in this guide, theAudit: Force audit policy subcategory settings (Windows Vista or later) to override audit policy category settings setting is configured to Enabled for both of the environments that are discussed in this guide., 397273=To provide flexibility for remote administration, the Windows Firewall: Allow inbound remote administration exception setting is available. If this policy setting is enabled, the computer can receive the unsolicited incoming messages that are associated with remote administration on TCP ports 135 and 445. This policy setting also allows Svchost.exe and Lsass.exe to receive unsolicited incoming messages and allows hosted services to open additional dynamically-assigned ports, typically in the range of 1024 to 1034 but potentially anywhere from 1024 to 65535. If you enable this policy setting, you need to specify the IP addresses or subnets from which these incoming messages are allowed., 325265=32768 KB, 242973=Windows Server 2003 supports 8.3 file name formats for backward compatibility with16-bit applications. The 8.3 file name convention is a naming format that allows file names up to eight characters long. This setting is configured to Not Defined for the EC environment and to Enabled for the SSLF environment., 192557=TheDomain member: Require strong (Windows 2000 or later) session key setting is configured toEnabled for both of the environments that are discussed in this guide., 330101=The Maximum security log size setting is configured to 81920 KB for all computers in the two environments that are discussed in this guide., 53864=Organizations should define only the actions they want enabled when they configure SACLs. For example, you might want to enable the Write and Append Data auditing setting on executable files to track when they are changed or replaced, because computer viruses, worms, and Trojan horses typically target executable files. Similarly, you might want to track when sensitive documents are accessed or changed., 724644=\" HOW TO: Hide a Windows 2000-Based Computer from the Browser List\" Knowledge Base article 321710., 243882=This setting is used to enable or disable the Internet Router Discovery Protocol (IRDP), which allows the system to detect and configure default gateway addresses automatically as described in RFC 1256 on a per-interface basis. This setting is configured to Not Defined for the EC environment and to Disabled for the SSLF environment., 187448=Domain member: Require strong (Windows 2000 or later) session key, 127541=Deny log on as a batch job This policy setting prohibits user logon through a batch-queue facility, a feature in Windows Server 2003 that is used to schedule jobs to run automatically one or more times in the future., 41058=For more information on the solution for configuring the new audit policy settings in Windows Vista in a Windows Server 2003-based domain, see the Knowledge Base article 921469, \" How to use Group Policy to configure detailed security auditing settings for Windows Vista client computers in a Windows Server 2003 domain or in a Windows 2000 domain.\", 325912=81920 KB, 18465=Password must meet complexity requirements This policy setting checks all new passwords to ensure that they meet basic requirements for strong passwords. By default, the value for this policy setting in Windows Vista is configured to Disabled, but it is Enabled in a Microsoft Windows Server® 2003 domain for both environments described in this guide., 192172=To enable this policy setting, all domain controllers in the domain must be able to encrypt secure channel data with a strong key, which means all domain controllers must be running Microsoft Windows 2000 or later. If communication to non-Windows 2000-based domains is required, Microsoft recommends that you disable this policy setting., 240318=For additional information, see the Knowledge Base article 811832, \" IPSec Default Exemptions Can Be Used to Bypass IPsec Protection in Some Scenarios.\", 725501=\" How to use Group Policy to configure detailed security auditing settings for Windows Vista client computers in a Windows Server 2003 domain or in a Windows 2000 domain\" Knowledge Base article 921469., 278651=Microsoft recommends that you configure this policy setting to the strongest possible authentication level for your environment. In environments that run only Windows 2000 Server or Windows Server 2003 with Windows Vista or Windows XP Professional-based workstations, configure this policy setting to the Send NTLMv2 response only. Refuse LM and NTLM option for the highest security., 470718=Require trusted path for credential entry If you enable this policy setting, users will be required to enter Windows credentials on the Secure Desktop by means of the trusted path mechanism. This means that before entering account and password information to authorize an elevation request, a user first need to press CTRL+ALT+DEL. Requiring the use of a trusted path helps prevent a Trojan horse or other types of malicious code from stealing the user's Windows credentials., 401672=Windows Firewall: Allow inbound UPnP framework exceptions This policy setting allows a computer to receive unsolicited Plug and Play messages that are sent by network devices, such as routers with built-in firewalls. To receive these messages, Windows Firewall opens TCP port 2869 and UDP port 1900., 237575=For additional information, see the Knowledge Base article 321710, \" HOW TO: Hide a Windows 2000-Based Computer from the Browser List.\"}",
    "textBeforeTable": "Tables in each of the main sections list the setting names and refer to baseline values that the engineering team developed for both the EC and the SSLF security configurations prescribed in this guide. Possible values vary considerably by setting. Most settings are configured to either Enabled or Disabled or some other value listed in the Group Policy Object Editor. However, many settings also require you to specify numerical values or security groups. User rights policy settings require specific user and group names. When a particular user right is not granted to any user or group, the Group Policy Object Editor displays the setting as enabled, but no users or groups will be listed. The tables in this appendix use the value No one to describe settings configured in this way. Settings configured to Not Defined or Not configured are not affected by the Group Policy objects (GPOs) included with this guide. This is very different than having a setting configured to No one as described previously. Settings not modified by the GPOs included with this guide can easily be modified by local computer administrators if the setting is not already configured by another GPO in your environment. This can lead to configuration inconsistencies across your environment, which could compromise security. For this reason, many prescribed settings merely enforce the default Windows Vista setting. The following table shows a couple of examples that can help you understand the different possible configurations: User policy. The settings in this section are applied to users in the domain.",
    "textAfterTable": "Windows Vista default Domain controller default VSG EC Domain GPO VSG SSLF Domain GPO Enforce password history 0 passwords remembered 24 passwords remembered 24 passwords remembered 24 passwords remembered Maximum password age 42 days 42 days 90 days 90 days Minimum password age 0 days 1 day 1 day 1 day Minimum password length 0 characters 7 characters 8 characters 12 characters Password must meet complexity requirements Disabled Enabled Enabled Enabled Store",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}