{
    "relation": [
        [
            "Argument",
            "-c net_service_name/database_service",
            "-b base_DN",
            "-f ldif_file"
        ],
        [
            "Description",
            "Specify the net service name or database service name that will connect you to the directory server.",
            "Specify the base of the subtree to be written out in LDIF format.",
            "Specify the input file name."
        ]
    ],
    "pageTitle": "16 Troubleshooting Oracle Net Services",
    "title": "",
    "url": "http://docs.oracle.com/cd/B13789_01/network.101/b10775/troublestng.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00145-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 67220079,
    "recordOffset": 67177626,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28441=In some cases, these errors can be caused by the same conditions which cause TNS-12549/ORA-12549, TNS-00519, TNS-12540/ORA-12540, TNS-00510, and TNS-12560/ORA-12560 errors., 15522=TNS-12541/ORA-12541: TNS:no listener, 15831=TNS-12560/ORA-12560: TNS:protocol adapter error occurred, 45783=Directory naming issues associated with connectivity errors such as ORA-12154, ORA-12543, or ORA-12541 for database service or net service name entries in a directory server require analysis of the data. You can analyze the data contained within a directory server with the ldifwrite command line tool., 42004=The first two are examples of hard limits. The third is an example of a limit which can be increased by setting PROCESSES parameter in the database initialization file to a larger value. In this case, a TNS-12500/ORA-12500 error is also returned. In some cases, these errors can be caused by the same conditions which cause TNS-12549/ORA-12549 and TNS-00519 errors., 45189=In some cases, these errors will be caused by the same conditions which cause TNS-00510, TNS-00519, TNS-12540/ORA-12540, TNS-12549/ORA-12549 errors., 14431=TNS-12500/ORA-12500: TNS: listener failed to start a dedicated server process, 169788=Using oerr, you can find out more information about return codes 12537 and 507. (Bold denotes user input.), 15634=TNS-12549/ORA-12549: TNS:operating system resource quota exceeded and TNS-00519: Operating system resource quota exceeded, 59506=On the client side, the sqlnet.log file (Example 16-1) contains an error stack corresponding to the ORA-12543 error., 15335=TNS-12540/ORA-12540: TNS:internal limit restriction exceeded and TNS-00510: Internal limit restriction exceeded, 50660=Timing issues are associated with an ORA-12535 error in the client log files.}",
    "lastModified": "Mon, 22 Mar 2004 19:49:00 GMT",
    "textBeforeTable": "Table 16-1 ldapwrite Arguments ldifwrite -c net_service_name/database_service -b base_DN -f ldif_file The ldifwrite tool syntax is as follows: ldifwrite enables you to convert all or part of the information residing in a directory server to LDAP Data Interchange Format (LDIF). The ldifwrite tool performs a subtree search, including all entries following the specified distinguished name (DN), including the DN itself. Directory naming issues associated with connectivity errors such as ORA-12154, ORA-12543, or ORA-12541 for database service or net service name entries in a directory server require analysis of the data. You can analyze the data contained within a directory server with the ldifwrite command line tool. Troubleshooting Directory Naming Errors    Action: Check the sqlnet.log or listener.log file for detailed error stack information. In some cases, these errors will be caused by the same conditions which cause TNS-00510, TNS-00519, TNS-12540/ORA-12540, TNS-12549/ORA-12549 errors. Cause: There was an error when using a particular protocol. This error may be due to incorrect configuration of an ADDRESS parameter or may occur due to errors returned from the underlying protocol or operating system interface. TNS-12560/ORA-12560: TNS:protocol adapter error occurred Check the sqlnet.log or",
    "textAfterTable": "The following example writes all the directory naming entries under dc=us,dc=acme,dc=com to the output1.ldi file: ldifwrite -c ldap -b \"dc=us,dc=acme,dc=com\" -f output.ldif Troubleshooting Tips from the Field for Oracle Net Services Here are some tips you may find helpful when you are having difficulty diagnosing network problems: Use the node or network address during configuration instead of the name of the server computer This eliminates any internal lookup problems and make the connection slightly faster. If you are using TCP/IP addresses, use the IP address rather than host name For example, change the (HOST=server_name) line in the tnsnames.ora file with the internet address, for example (HOST=198.32.3.5). Perform a loopback test Perform a loopback test on the server as described in \"Testing Configuration on the Database Server\". If the test passes, ftp the tnsnames.ora and sqlnet.ora files to the client. Check what is between you and the server If it is a wide area network (WAN), identify any intermediate systems that may not work correctly. If all computers are fine, the problem may be a timing issue. Verify whether or not there is a timing issue Timing issues are associated with an ORA-12535 error in the client log files. To resolve this, try speeding up the connection by using exact addresses instead of names and increase the CONNECT_TIMEOUT_listener_name parameter in",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}