{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "dahlonega i a very safe town and the lumpkin county police as well as ngcsu police do a very good job of keeping everyone safe.",
            "wonderful greek life system. 5 sororities and 7 fraternities, some honors and community service ones too. no housing but this means everyone is closer than a school with housing. possibility of housing in the near future.",
            "the school offers lots of opportunities to get involved.",
            "love the small close atmosphere. love the outdoors and fresh air and really want to excel in school.",
            "drill field- used by the corps on campus for drill every monday. you can't walk across it to get to class but you can lay on it or use it for gatherings/ intramural/ school functions. cannon- the cannon goes off every afternoon at 5pm sharp.",
            "i think you get the education of a big name school but with smaller size classes in which teachers care about you.",
            "lots of outdoor stuff (being in the north georgia mountains). greek life is big on campus and so is going to athletic events.",
            "brand new dining hall, new restaurants are opening on campus.",
            "res life does a great job of growing a community atmosphere.",
            "classes are challenging but are small enough to have the bond with teachers.",
            "become active on campus (sab, sga, greek life, campus outreach, etc.).",
            "it is a close knit community with lots of tradition. it is a growing campus not just in size but also in its standards. it is a wonderful school that allows you to grow."
        ]
    ],
    "pageTitle": "University of North Georgia Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-North-Georgia/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00214-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893015591,
    "recordOffset": 892900712,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{333879=Terrible. You pay 1800 for food that on most occasions only have pizza available which is not even very good. For the amount of money you pay the dining is terrible., 267713=You would never expect to have noisy neighbors at 3 o'clock in the morning on a Thursday, but, unfortunately, it happens. Noisy neighbors may be my biggest complaint about the dorm life at North Georgia, but that is easily manageable if you have an efficient R.A. that can handle those kinds of issues., 564541=The entire campus is centered around the drill field which is where the core of cadets, and other organization will meet. It is open to the entire campus, however, never ever walk across the drill field as a short cut. You can be on the drill field throwing Frisbee or having a picnic, but never use it as a means to make a shorter walk. We are a Military college so every evening at 5:00 PM the Core of Cadets shoot off a cannon, everyone on campus stops walking, and driving to pay their respect., 138619=Reveille at 0700 Retreat at 1700, 486899=At 5 o'clock p.m. every day, the loud speakers, that cover all of campus with their noise, plays taps and revelee as the American Flag is retired for the night. At this time, all cars, pedestrians, and everyone stop in their tracks and respect the ceremony. It truly sets our university apart from others., 446254=If you want to do well in any college make sure you don't ever let yourself fall behind. You will have plenty of time for social occasions as long as you don't spend too much of your free time watching tv and videos on the internet rather than reading and studying. Get involved right away. If you want to play intramural sports, DO NOT take night classes as late as 5:30 or 7. On the weekends, a lot of kids go home but it is very peaceful if you aren't a huge fan of crowds in the first place., 619838=© 2015, Cappex.com, LLC, 190338=North Georgia is a military so we do have traditions we follow strictly. At 5 O'clock everyday the cannon goes off and all are to stand and remain silent as the flag American Flag is retired for the day. At midnight, Taps is played as a signal for all ROTC to return to the dorms. At the center of the college is the drill field. It is forbidden to cross the drill field in order to try and save time to get to class., 459393=This is a military college, so every morning the ROTC fires a cannon at 7:00am and again at 5:00 in the afternoon. When the army band plays and the cannon is fired, students are expected to stop and turn in direction of the flag., 228067=The canon fires in the mornings to signal the start of the day and everyone has to freeze, stop cars, stop everything at 5 o'clock when the flag is taken down, the bugle sounds and the canon fires everyday., 517756=No one is allowed to take a shortcut across the drill field. You will be tackled by cadets if you do. Everyday at 7:15 am and 5:00 pm, if you are outside, you must stop and face the flag. No matter where you walk, you will be going uphill., 66535=The Corps of Cadets observes reveille and retreat at 0700 and 1700 everyday. You can't cut across the Drill Field to get to class faster. There is a candle light ceremony on the drill field every 9/11 involving both cadets and civilian students.}",
    "textBeforeTable": "07/20/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 130 Anonymous Check out reviews left by other students or leave your own review. You could win a free scholarship. University of North Georgia Reviews University of North Georgia › Georgia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Kaitlyn from Canton, GA 12/25/2009 Reviewer is A current student here. 5 out of 6 people found this review useful. 3 of 130 Categories Comments Tips for prospective students If you decide to go to North Georgia, please first know where you are going. As a military cadet, you will have hardly any freedom and you will be living in barracks - not dorms. Do not expect first class. But do expect good people, good prices, good professors, and a great education. Plus we have new apartments and the school is in the process of building new dorms, barracks, and chow hall (all before I graduate in 2013). I highly recommend NGCSU. Go Saints! Bang for the buck NGCSU is an excellent education for an excellent price. Most students receive sufficient funding. Am enjoying being here I enjoy my civilian life at NGCSU. Honestly, I do not LOVE the Corps of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}