{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor"
        ],
        [
            "Comments",
            "I make my own meals at home.",
            "On campus apartments ARE available. That's where I am staying.",
            "Good grades are strongly enforced. Barry gives you grants on how well you do academically. The better your grades are the more money you will get."
        ]
    ],
    "pageTitle": "Barry University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Barry-University/reviews?_escaped_fragment_=/show/119797",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00047-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 889186435,
    "recordOffset": 889110436,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{44581=1. Stay on top of your financial aid (even if it means to go to the Business and Financial Aid office once a month) 2. Make sure that you know deadlines for payments and the changes made to your account 3. Park in areas that you can park, otherwise your car will be towed and you will get a ticket. 4. Join an organization or more, and be involved. 5. Most resident Halls are not that bad, just remember its an old university but in Fall 2012, there will be a new resident hall & if you can apply to live in the houses around campus. 6. If you are not Catholic, Barry doesn't mind they will accept anyway. 7. Focus on your studies, the better that you do the more that will shine. 8. Moonlight Madness is one of the most sporting events that the school hosts., 146762=It's expensive because it's a private university, but the classes are smaller which is better for 1:1 time. I think it's worth the money., 409028=© 2015, Cappex.com, LLC, 29180=The food here is AMAZING for about the first four months, then you get sick of it. I stopped eating at the WOW by about January and started eating at the BUC stop, which can be pricey. So i stocked up on lots of snacks, noodles, mac n cheese, and it worked out. I didn't even like walking to the student union to eat so the snacks worked out well., 273001=If you are looking for a party school, Barry is not for you. The teacher student ratio is about 1:20. Beautiful and peaceful campus with people who truly cares about your success here at Barry., 259913=The University is catholic based and it was founded in 1940, it was all girls then, it became co ed in 1960, there are a lot of old buildings and structures around. There are foxes on campus, Yes Foxes!}",
    "textBeforeTable": "12/09/2009 Reviewer is A current student here. 17 out of 17 people found this review useful. 1 of 106 C.Symoane Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest();",
    "textAfterTable": "Barry is a school where there are school sponsored events. There are plenty of dances and the student activities Departments take you on trips everywhere and most of them are free. This school is in a very isolated area so you have to make your fun. Am learning a lot This School excels in every program that they provide. Barry makes sure that you learn everything that you need to learn that will help you in future classes and in your career. Teachers are always there to help you and they allow questions at anytime. I am a Photography major and the teachers in this field help and give constructive criticism. As with all majors the faculty is very helpful. Login to rate or flag the reviews Alexandra from Miami, FL 12/29/2009 Reviewer is A current student here. 12 out of 13 people found this review useful. 2 of 106 Categories Comments Great for these types of students For students wanting to be in the medical field,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}