{
    "relation": [
        [
            "",
            "CrystalDiskMark 3.0",
            "Read Seq",
            "Write Seq",
            "Read 512",
            "Write 512",
            "Read 4k",
            "Write 4k",
            "Read 4k QD32",
            "Write 4k QD32"
        ],
        [
            "Lenovo Miix 2 11 HD Graphics 4200, 4012Y, Samsung SSD PM841 MZMTD128HAFV mSATA",
            "",
            "516.6",
            "134.8",
            "451.2",
            "124.2",
            "28.61",
            "79.84",
            "214",
            "130.3"
        ],
        [
            "Asus Transformer Book T100TA-C1-GR HD Graphics (Bay Trail), Z3740, 32 GB eMMC Flash",
            "-83%",
            "109 -79%",
            "43.2 -68%",
            "104.7 -77%",
            "18.93 -85%",
            "10.33 -64%",
            "4.034 -95%",
            "10.44 -95%",
            "4.408 -97%"
        ],
        [
            "Schenker XMG P724 GeForce GTX 880M SLI, 4810MQ, Samsung SSD 840 EVO 500GB mSATA",
            "113%",
            "522.4 1%",
            "500.4 271%",
            "482.4 7%",
            "447.3 260%",
            "41.72 46%",
            "125.9 58%",
            "394.4 84%",
            "355.9 173%"
        ],
        [
            "Schenker XMG P704 GeForce GTX 880M, 4910MQ, Crucial M500 480 GB CT480M500SSD3 mSATA",
            "86%",
            "476.5 -8%",
            "400.1 197%",
            "418.9 -7%",
            "399.1 221%",
            "29.13 2%",
            "136 70%",
            "339.4 59%",
            "331 154%"
        ]
    ],
    "pageTitle": "Lenovo Miix 2 11 Convertible Review - NotebookCheck.net Reviews",
    "title": "",
    "url": "http://www.notebookcheck.net/Lenovo-Miix-2-11-Convertible-Review.121534.0.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00115-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 634766823,
    "recordOffset": 634696160,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4567=The Miix 2 is outfitted with an 11.6-inch display with a native resolution of 1920x1080 pixels. At a display brightness level of 327.4 cd/m², the Miix 2's display is easily visible. Still, the Venue 11 can trump this good number (369.7 cd/m²).}",
    "TableContextTimeStampAfterTable": "{327132=The Miix 2 ends the WLAN test after 4:44 h. Once again, the Venue offers a substantially longer battery runtime (6:42 h). In this test, websites load automatically per script in 40-second intervals. The energy-saving profile is active, and the display brightness is set to about 150 cd/m². We test a device's battery life during video playback by running the short film Big Buck Bunny (H.264 encoding, 1920x1080 pixels) on constant repeat. The energy-saving profile is active, the wireless modules are deactivated, and the display brightness is set to around 150 cd/m². The Miix 2 holds out for 5:15 h. We did not perform this test on the Venue., 15324=The Miix 2 runs on an Intel Core i3-4012Y processor. This Haswell generation CPU is outfitted with two cores and has a clock frequency of 1.5 GHz. There is no turbo, but the CPU supports Hyper-Threading (each core can process two threads). According to Intel, the processor's TDP is 11.5 Watts. To test whether the CPU can utilize its full performance capabilities, we ran the Cinebench benchmarks on the device. The processor's full performance was only available for single-thread applications -- the CPU completed the multi-thread tests at 900 to 1000 MHz. The processor behaved identically in both AC power mode and battery mode., 5665=Out of the factory, the display's average DeltaE 2000 deviation is 7.46. At that number, the panel does better than the majority of displays we have tested. Some colors even land in the target area (DeltaE less than 3). The display does not have a blue cast., 4906=In terms of contrast (860:1) and black value (0.4 cd/m²) too, the Miix 2's panel cannot be criticized. The Venue 11's numbers here are more or less on par with our review device's (909:1, 0.45 cd/m²). We cannot make a statement regarding the Miix 2's color space coverage, as our measuring device refused to be calibrated., 325924=In idle mode, the Miix 2's battery keeps chugging along for 11:22 h. The Venue 11 (12:42 h) offers a little more stamina here. We test a device's battery life in idle mode with Battery Eater's Reader's test: The display is set to the lowest brightness setting, the energy-saving profile is active, and the wireless modules are turned off. Under load, the Miix 2 cuts out after 3:22 h. The Venue 11's battery conks out earlier (2:03). We determine a device's battery life under load with the Battery Eater Classic test: The display runs at maximum brightness, and both the high-performance profile and the wireless modules are activated.}",
    "lastModified": "Fri, 31 Jul 2015 06:47:06 GMT",
    "textBeforeTable": "Contrast: 860:1 Black: 0.4 cd/m² Center on Battery: 278 cd/m² Brightness Distribution: 88 % Average: 327.4 cd/m² Maximum: 344 cd/m² X-Rite i1Pro 2 Information Distribution of brightness 328 cd/m² 344 cd/m² 331 cd/m² 307 cd/m² 344 cd/m² 340 cd/m² 304 cd/m² 324 cd/m² 325 cd/m² The Miix 2 is outfitted with an 11.6-inch display with a native resolution of 1920x1080 pixels. At a display brightness level of 327.4 cd/m², the Miix 2's",
    "textAfterTable": "CalMAN - Grayscale CalMAN - Color saturation Lenovo equipped their Miix 2 with an IPS panel. That means users of this convertible will not have to contend with limited viewing angles and will be able to read the display from practically any perspective. Despite its strong brightness and high contrast, the Miix 2 is almost unusable outdoors -- the display's reflective surface is too hindersome. Viewing angles: Miix 2 11 The Miix 2 in outdoor use",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}