{
    "relation": [
        [
            "",
            "ATV 300 mg QD + RTV 100 mg QD + TDF 300 mg QD + FTC 200 mg QD",
            "LPV 400mg BID + RTV 100mg BID + TDF 300 mg QD + FTC 200 mg QD"
        ],
        [
            "Description",
            "Participants were administered an oral dose of Atazanavir (ATV) 300 mg and ritonavir (RTV) 100 mg once daily along with food. Doses were taken 24 hours apart at the same time as fixed dose combination tenofovir (TDF) 300 mg plus emtricitabine (FTC) 200 mg once daily.",
            "Participants were administered lopinavir (LPV) 400 mg or ritonavir (RTV) 100 mg twice daily along with food. Doses were taken approximately 12 hours apart while tenofovir (TDF) 300 mg once daily and emtricitabine (FTC) 200 mg once daily was administered at the same time as 1 of the 2 daily doses of LPV/RTV."
        ]
    ],
    "pageTitle": "BMS-Reyataz Study in Treatment in Naive Subjects to Compare the Efficacy and Safety Between Boosted Reyataz and Kaletra When in Combination With Fixed Dose Truvada - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00272779?sect=Xi0156&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00048-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 869459015,
    "recordOffset": 869435005,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups Of 1057 HIV-infected participants, 174 participants were not randomized to receive study drug, the main reason being that they did not meet the study criteria (133/174; 76%). 441 randomized to ATV received any drug and 437 randomized to LPV received any drug. 438 and 440 participants randomized to ATV and LPV, respectively, received correct drug. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details No text entered. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: ATV Drug: RTV Drug: Tenofovi-Emtricitabine (TDF/FTC) tablet Drug: LPV Interventions: HIV Infections Condition:",
    "textAfterTable": "Participant Flow for 2 periods Period 1:   Baseline Through Week 48     ATV 300 mg QD + RTV 100 mg QD + TDF 300 mg QD + FTC 200 mg QD     LPV 400mg BID + RTV 100mg BID + TDF 300 mg QD + FTC 200 mg QD   STARTED     440 [1]   443 [2] RECEIVED ANY TREATMENT     441 [3]   437 [4] TREATED AS RANDOMIZED     438     440   Discontinued Before Week 48     39     58   Discontinued on or After Week 48     14     14  ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}