{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "undecided students or students looking to take a few classes or students looking to boost gpa.",
            "Classes are fantastically affordable and financial aid is great but you have to pay up front and get reimbursed later. Worst part of any college is the books, save the important ones and buy used ones whenever possible!!!",
            "School plus fun equals a conundrum!",
            "food in and around the school is good and will get you through your day without starving.",
            "As far as I know they have no dorms but I am sure an apartment near any of the campuses would be fantastic.",
            "Classes can be as challenging as you make them. If you took all advanced classes in highschool then you will have no problem getting A's.",
            "Make sure you have a plan and don't just take random untrasferable classes. It will be easier on your wallet if you have a general long term plan.",
            "Very usefull college for just about anything from saving money to transfer later or getting ahead in a few classes over the summer. Some courses are only offered on certain campuses which does make it a bit stressful on car mileage and gas money. All in all a good resource to take advantage of with great teachers and staff."
        ]
    ],
    "pageTitle": "College of Southern Nevada Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/College-of-Southern-Nevada/reviews?_escaped_fragment_=/show/83969",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00153-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 924568815,
    "recordOffset": 924465862,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{465833=My only other warning to you is about the summer months here in our fair desert. It starts around June and doesn't end until sometimes late October. The lows at night during these months are on average 80 to 85 degrees, so that means in the daytime expect temps to be around 105 and 115. If you survive the first summer, your a champ, the second summer you sweat through, you are acclimated. Meaning, if temps fall below say, 75 degrees, like in the spring or early winter, you will be freezing and wearing your hoodie. After the 3rd summer you are a professional., 225878=The college is affordable my costs are about 1500 a semester., 619372=I will give this school a 5 out of 5. There are 5 locations plus online courses that can be taken at College of Southern Nevada. I have taken weekend classes, online, and as late as 10:30 pm classes. The instructor's and professors are very thorough and hands on. They usually will go far and beyond to make certain that the information is being received clearly., 466581=Hey I live in Las Vegas, what can I say......there is ALWAYS something to do! The strip is about 20 minutes away from the CHY and CHRL campus. But again, that's not the only place to have fun! Las Vegas is like any other city in the US. Beware of the months between June and October ..... the is the desert. Temps range from 90 to 120 degrees. Some weeks are above 105 daily. The evenings are fantastic though!, 26893=I met some of my best friends for life at CSN! Not to mention the opportunities there are in the school. I was able to intern with Barack Obama's 2008 presidential campaign through the school as well as find my first ever job., 236570=Try to arrange your schedule in the best way possible; so many new students decide to enroll in a class at 10:00 am and not have another class until noon, the time in between is wasted (unless you do your homework from your first class). Also, there are more than one CSN campus so pay close attention when signing up for classes (you don't want the stress of driving back and forth, campus to campus.) Also, always make extra copies of documents when going to meet with an advisor (they have a habit of losing papers)., 49880=I began attending CSN in Fall 2008 and so far it has been a great school to attend too. Especially a far as community colleges go. I have learned so much with just the few classes I have taken to this point and I'm truly excited to continue on. Teaching methods to differ between teachers, so if you can, talk to the professor and fellow students about the class., 624881=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "03/26/2012 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 159 Jeanne from Henderson, NV Check out reviews left by other students or leave your own review. You could win a free scholarship. College of Southern Nevada Reviews College of Southern Nevada › Nevada › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Academic Rigor This is only a two year college, so you only have basic general education, plus a few specified degrees like nursing or hospitality management. Tips for prospective students It is easy to choose which instructor you get, so look them up first. Also get to class a little early, parking is horrible here. Try to take on campus classes instead of online, the instructors are more dependable. In three sentences CSN has a good amount of classes, good teachers, and a pretty helpful counseling center. It is very easy to get into classes, no crashing required ever. As far as community colleges go, College of Southern Nevada is a good school. Login to rate or flag the reviews Cheryl from Las Vegas, NV 06/06/2009 Reviewer is A current student here. 5 out of 6 people found this review useful. 1 person found this inaccurate. 2 of 159 Categories Comments Tips for prospective students A superb",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}