{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Don't get locked out of your room.",
            "Greek Life is great. Meet your bridesmaids/groomsmen and join greek life. It's not like a big school or House Bunny type greek life, it's something completely different.",
            "There's a lot of clubs, but not a ton of people in all these clubs. Find a club or two, but don't try to stretch yourself thin.",
            "Students who really like to challenge themselves beyond what is given to them, are self motivated, and more concerned about academics than anything else.",
            "Queens has a lot of great traditions that you have to attend for the full experience. Casino night, Moravian Love Feast, Boar's Head, Midnight on Ice, Exam Breakfasts, Homecoming, and Spring Carnival are all something you have to do at least once.",
            "Try to get as many scholarships as possible, Queens does come with a big price tag.",
            "Explore Charlotte!",
            "Good luck if you have food allergies. They don't understand cross contaminations and there's maybe something decent once a week.",
            "Most people keep to themselves in the dorms.",
            "Varies by professor, and you get what you put into it. Take Perkins for your science credit. Not many professors will take you hiking and teach class at the top of a mountain. Despite what people say, core is an awesome class. Really try to take stuff away from it, because it seems time consuming, but it is extremely valuable.",
            "Be sure you are a person for a small school. When I say Queens is small, it is SMALL.",
            "It's a interesting little school, but definitely for those who are self seeking learners. There's a lot of opportunity for personal growth. The professors are absolutely fantastic."
        ]
    ],
    "pageTitle": "Queens University of Charlotte Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Queens-University-of-Charlotte/reviews?_escaped_fragment_=/show/24876",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00102-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895457675,
    "recordOffset": 895420836,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9481=The first time I visited campus was in the summer of 2010, it is so beautiful and just all around amazing. It is really small, but you are in a great neighborhood just a few minutes away from Downtown Charlotte. The buildings are very clean, even the doors, which is always good., 113551=© 2015, Cappex.com, LLC, 62020=The food is decent. It is much better than the food at a large university, but it can seem repetitive. The only complaint I have is that the dining room closes around 7:30 p.m. and opens around 7 a.m. I think it should have more availability and be open more and longer throughout the day.}",
    "textBeforeTable": "12/18/2009 Reviewer is A current student here. 15 out of 16 people found this review useful. 1 of 27 Brittany from Kings Mountain, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Am learning a lot I just finished my first semester at Queens University of Charlotte and I absolutely love it! The classes are small - there are no classes with more than thirty students. The teachers are skilled and knowledgeable in what they teach. Teachers and students work together and between the professors and the Learning Center for Academic Success, they are determined to help the student learn. Login to rate or flag the reviews Megan from Virginia 12/02/2010 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 4 out of 4 people found this review useful. 3 of 27 Categories Comments Tips for prospective students Definitely visit campus, and get acquainted with your admissions counselor! They are all super nice, and they will answer any and every question you have. Bang for the buck Queens is expensive. But there are tons of financial aid options available for students, and the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}