{
    "relation": [
        [
            "Metal:",
            "Metal Purity:",
            "Main Stone:"
        ],
        [
            "White Gold",
            "14kt",
            "diamond"
        ],
        [
            "Style:",
            "Ring Size:",
            ""
        ],
        [
            "antique cocktail",
            "3 1/2",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/14-Karat-White-Gold-Diamond-Cluster-Antique-Cocktail-Ring-/161406271499?pt=LH_DefaultDomain_0&hash=item259490400b",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00006-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 410747199,
    "recordOffset": 410708821,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Item specifics Seller assumes all responsibility for this listing. 161406271499 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window or tab Guarantee:",
    "textAfterTable": " Up for auction is a gorgeous 14 karat White gold ladies cluster antique diamond ring. This ring is in great condition with all detail work in tact. This ring has 5 single cut diamonds that are SI2-I1, H-I. Diamond weight is .25tdw. This ring is a antique and dates back to the 1940's. This ring is a size 3 1/2 and can be sized up to a size 6 without putting a new shank on the ring. Anything larger will result in a extra fee but it can be done.  We are a full service jewelry store so we are able to do this prior to shipping. Any questions please ask! Questions and answers about this item No questions or answers have been posted about this item. Ask a question - opens in a new window or tab Seller assumes all responsibility for this listing.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}