{
    "relation": [
        [
            "Patent application number",
            "20090004689",
            "20090087851",
            "20090162330",
            "20100015702",
            "20120198577",
            "20120321705"
        ],
        [
            "Description",
            "Lineage Restricted Glial Precursors from the Central Nervous System - A glial precursor cell population from mammalian central nervous system has been isolated. These A2B5",
            "Lineage-Restricted Neuronal Precursors - A self-renewing restricted stem cell population has been identified in developing (embryonic day 13.5) spinal cords that can differentiate into multiple neuronal phenotypes, but cannot differentiate into glial phenotypes. This neuronal-restricted precursor (NRP) expresses highly polysialated or embryonic neural cell adhesion molecule (E-NCAM) and is morphologically distinct from neuroepithelial stem cells (NEP cells) and spinal glial progenitors derived from embryonic day 10.5 spinal cord. NRP cells self renew over multiple passages in the presence of fibroblast growth factor (FGF) and neurotrophin 3 (NT-3) and express a characteristic subset of neuronal epitopes. When cultured in the presence of RA and the absence of FGF, NRP cells differentiate into GABAergic, glutaminergic, and cholinergic immunoreactive neurons. NRP cells can also be generated from multipotent NEP cells cultured from embryonic day 10.5 neural tubes. Clonal analysis shows that E-NCAM immunoreactive NRP cells arise from an NEP progenitor cell that generates other restricted CNS precursors. The NEP-derived E-NCAM immunoreactive cells undergo self renewal in defined medium and differentiate into multiple neuronal phenotypes in mass and clonal culture. Thus, a direct lineal relationship exists between multipotential NEP cells and more restricted neuronal precursor cells present in vivo at embryonic day 13.5 in the spinal cord. Methods for treating neurological diseases are also disclosed.",
            "Method of Isolating Human Neuroepithelial Precursor Cells from Human Fetal Tissue - A method for isolating human neuroepithelial precursor cells from human fetal tissue by culturing the human fetal cells in fibroblast growth factor and chick embryo extract and immunodepleting from the cultured human fetal cells any cells expressing A2B5, NG2 and eNCAM is provided. In addition, methods for transplanting these cells into an animal are provided. Animals models transplanted with these human neuroepithelial precursor cells and methods for monitoring survival, proliferation, differentiation and migration of the cells in the animal model via detection of human specific markers are also provided.",
            "Generation, Characterization and Isolation of Neuroepithelial Stem Cells and Lineage Restricted Intermediate Precursor - Multipotent neuroepithelial stem cells and lineage-restricted oligodendrocyte-astrocyte precursor cells are described. The neuroepithelial stem cells are capable of self-renewal and of differentiation into neurons, astrocytes, and oligodendrocytes. The oligodendrocyte-astrocyte precursor cells are derived from neuroepithelial stem cells, are capable of self-renewal, and can differentiate into oligodendrocytes and astrocytes, but not neurons. Methods of generating, isolating, and culturing such neuroepithelial stem cells and oligodendrocyte-astrocyte precursor cells are also disclosed.",
            "Method of Isolating Human Neuroepithelial Precursor Cells from Human Fetal Tissue - A method for isolating human neuroepithelial precursor cells from human fetal tissue by culturing the human fetal cells in fibroblast growth factor and chick embryo extract and immunodepleting from the cultured human fetal cells any cells expressing A2B5, NG2 and eNCAM is provided. In addition, methods for transplanting these cells into an animal are provided. Animals models transplanted with these human neuroepithelial precursor cells and methods for monitoring survival, proliferation, differentiation and migration of the cells in the animal model via detection of human specific markers are also provided.",
            "Lineage Restricted Glial Precursors from the Central Nervous System - A glial precursor cell population from mammalian central nervous system has been isolated. These A2B5"
        ],
        [
            "Published",
            "01-01-2009",
            "04-02-2009",
            "06-25-2009",
            "01-21-2010",
            "08-02-2012",
            "12-20-2012"
        ]
    ],
    "pageTitle": "Rao, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/rao-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00165-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 452948803,
    "recordOffset": 452913795,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Mahendra S. Rao, Salt Lake City, UT US 06-26-2014 DISPLAY PANEL - A display panel includes a first substrate, a second substrate, a liquid crystal layer interposed between the first substrate and the second substrate, a color filter layer, a first pixel unit, a second pixel unit, and a third pixel unit. The liquid crystal layer includes optically isotropic liquid crystals. The first pixel unit, the second pixel unit and the third pixel unit form a first electric field, a second electric field and a third electric filed in the liquid crystal layer. A first display light, a second display light and a third display light displayed by the first pixel unit, the second pixel unit and the third pixel unit have different wavelengths. The first electric field, the second electric field and the third electric field are different when the first pixel unit, the second pixel unit and the third pixel unit are applied by a same driving voltage set. 20140176837 03-31-2011 Liquid Crystals Composition and Liquid Crystal Display with Patterned Electrodes - A blue phase liquid crystal composition and a LC display using the composition. The liquid crystal composition includes a first class including a highly polar compound and a second class including a highly conjugated liquid crystal compound. The blue phase liquid crystal display device includes first and second substrates each with polarizer on the exterior surface and the blue phase liquid crystal composition sandwiched therebetween with and patterned electrodes",
    "textAfterTable": "Patent applications by Mahendra S. Rao, Salt Lake City, UT US Mahendra S. Rao, Timonium, MD US Patent application number Description Published 20090220567 Pure Populations of Astrocyte Restricted Precursor Cells and Methods for Isolation and Use Thereof - An isolated, pure homogeneous population of mammalian astrocyte restricted precursor cells which is CD44 immunoreactive and which generate astrocytes but not oligodendrocytes is provided. Methods for isolating and using these mammalian astrocyte restricted precursor cells are also provided. 09-03-2009 20110098818 Radiolucent spinal fusion cage - An improved bone graft is provided for human implantation, particularly such as a spinal fusion cage for implantation into the inter-vertebral space between two adjacent vertebrae. The improved spinal fusion cage includes a substrate block of high strength biocompatible material having a selected size and shape to fit the anatomical space, and a controlled porosity analogous to natural bone. The substrate block may be coated with a bio-active surface coating material such as hydroxyapatite or a calcium phosphate to promote bone ingrowth and enhanced bone fusion. Upon implantation, the fusion cage provides a spacer element having a desired combination of mechanical strength together with osteoconductivity and osteoinductivity to promote bone ingrowth",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}