{
    "relation": [
        [
            "File",
            "err.xml",
            "mx.xml"
        ],
        [
            "Role",
            "Data",
            "Data"
        ],
        [
            "Description",
            "loc",
            "Loc"
        ]
    ],
    "pageTitle": "oLoc: Retrieve and edit internationalized texts - PHP Classes",
    "title": "",
    "url": "http://www.phpclasses.org/package/4214-PHP-Retrieve-and-edit-internationalized-texts.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00081-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 647850547,
    "recordOffset": 647823491,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Johan Barbier Localization is the process of adapting software programs to the users local idiom and other details of each world country or region. Localization often consists on translating the texts used in the messages presented to the users of the programs. Depending on the size of the application, the effort to localize it may not be trivial. This package provides an AJAX based Web interface to help translating the texts used in PHP Web applications, thus reducing the localization efforts. Manuel Lemos Number 5 Prize: One book of choice by Packt December 2007     Innovation Award This package can be used to retrieve and edit internationalized application texts. It consists of a run-time class and other classes and scripts for editing translations. The run-time class that retrieves text translations",
    "textAfterTable": "Innovation award Nominee: 6x Details provided by the author     FRENCH Ce package comprend 2 outils distincts mais liés. Ils nécessitent tous deux PHP5, avec 5.1 pour le back-office. - la classe oLocale permettant de gérer l'affichage des traducstions sur un site multilingue. Elle se base sur un flux XML ayant une structure simple, mais bien précise. Elle a besoin d'une langue demandée, et d'une langue par défaut (dans les deux cas, la classe les fixe à l'anglais si ces 2 paramètres ne sont pas passés), et d'un chemin où aller chercher les fichiers de traduction. Par défaut, le chemin est 'locales/'. La structure de ce répertoire doit",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}