{
    "relation": [
        [
            "Play Type",
            "Substitution",
            "Out",
            "Single",
            "Out",
            "Home-run",
            "Out"
        ],
        [
            "Play",
            "Manny Acosta starts the inning for the Braves.",
            "Mike Morse grounded out short to first. None on with one out and Pete Orr due up.",
            "Pete Orr singled to left. Runner on first with one out and Jamie Burke due up.",
            "Jamie Burke sacrifice bunt to pitcher. Runner on second with two outs and Justin Maxwell due up.",
            "Justin Maxwell two-out, two-run Home Run (4) to right scored Pete Orr. Elijah Dukes due up.",
            "Elijah Dukes grounded out second to first to end the inning."
        ]
    ],
    "pageTitle": "Saturday, October 3, 2009 Washington Nationals - Atlanta Braves Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/Nationals_Braves/2009/10/03",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00312-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 54437415,
    "recordOffset": 54425032,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2350=View all MLB box scores for 10/3/2009}",
    "TableContextTimeStampAfterTable": "{42949=With the game tied at two in the ninth, the Braves threatened. McCann had a leadoff single off Jason Bergmann. Pinch-runner Reid Gorecki moved to second on Yunel Escobar's sac bunt. Garret Anderson was then intentionally walked, but Omar Infante grounded into an inning-ending double play.}",
    "textBeforeTable": "Top of the 1st Jerry Meals  3B Dale Scott  2B Mike DiMuro  1B Ron Kulpa  H Umpires 4.46 8 11 0 0 2 2 2 1 Manny Acosta (L, 1-1) 2.88 15 29 1 1 2 2 2 1 Peter Moylan  3.01 13 19 2 1 0 0 0 1 Rafael Soriano  2.60 75 116 9 3 2 2 5 8 Jair Jurrjens  ERA Strikes Pitches SO BB ER R H IP Name 9.45 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Braves pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/braves_22t.png 8 12 1 0 0 0 0 1 Logan Kensing (S, 1) 7.84 10 20 0 1 2 2 3 1 Zack Segovia (W, 1-0) 4.53 12 24 2 1 0 0 1 1.2 Jason Bergmann  4.40 15 20 1 0 0 0 2 1.2 Ron Villone (BS, 3) 6.62 10 16 0 1 2 2 1 0.2 Saul Rivera (H, 2) 5.00 31 62 1 4 0 0 1 5 Ross Detwiler  ERA Strikes Pitches SO BB ER R H IP Name Intentional walks: Chipper Jones \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Nationals pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/nationals_22t.png",
    "textAfterTable": "Out Ian Desmond flied out to right to end the inning. Bottom of the 1st Play Type Play Single Nate McLouth bunt singled to first. Runner on first with none out and Martin Prado due up. Walk Martin Prado walked. Runners on first and second with none out and Chipper Jones due up. Out Chipper Jones grounded into a double play, second to short to first. Runner on third with two outs and Brian McCann due up. Walk Brian McCann walked. Runners on first and third with two outs and Yunel Escobar due up. Out Yunel Escobar grounded into a fielder's choice, short to second to end the inning. Top of the 2nd Play Type Play Single Josh Bard singled to right. Runner on first with none out and Pete Orr due up. Out Pete Orr struck out swinging. Runner on first with one out and Ross Detwiler due up. Out Ross Detwiler struck out looking. Runner on first with two outs and Willie Harris due up. Walk Willie Harris walked. Runners on first and second with two outs and Elijah Dukes due up. Out",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}