{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "OSU is actually an incredibly safe campus. The State police have their headquarters on campus, so they regularly patrol the area. Also, the light systems work well and there's a cab you can call (it's called Safe Ride) if you're out and alone late at night.It's funded by the school and will take you back to wherever you need to go. Overall, the campus is very secure.",
            "I'm not a part of it so I really wouldn't know.",
            "IB and AP students who want to get their BA or BSc as soon as they possibly can.",
            "The students at OSU have recently started to worship a construction crane on campus. At this moment, they're attempting to put a statue of it in the new student center. Never doubt the crane.",
            "If you complete the IB Diploma, you are rewarded handsomely. I completed my IB Diploma last year and started this year as a sophomore. That was pretty awesome. However, classes are pretty mundane so far, there isn't really too much to do, and I really do not enjoy living on campus. So, I'd say overall it's decent in the sense that you get to save money if you're an IB or AP student.",
            "Corvallis is a really sleepy town, so outside of the Greek Life on campus and house parties, there isn't really too much to do.",
            "The dining center I live by, McNary, is probably the worst on campus (although the Rainforest Cafe is pretty decent). I'd recommend eating at the West Side since there's more variety, Bing's Cafe is also another great option that's on the meal plan, and/or purchasing groceries at Cascadia Market (near the International Living and Learning Center) to make food for yourself because the dining center food quality is not that great. However, all of the restaraunts featured on the Orange Rewards system (such as Java II in the library) have much nicer foodstuffs. Unfortunately, you're only given $100 in your student account to spend there before you have to pay out of your own pocket, so spend wisely!",
            "I had a really negative experience off the bat, so I'm biased in that sense. First things first, due to the large student population living on campus, OSU has taken to converting doubles (where normally two people live together) into triples (where three people live together). This means that there are three people in a space meant for two. It's rather crowded and there definitely isn't enough room. In addition, I had a really bad roommate experience, so if you decide to commit to OSU make sure you chose a roommate as soon as possible and try to make sure that UHDS doesn't assign one to you randomly. Trust me, it will save you many a conflict. In terms of community, I'd say that my res hall has a decent one. It's just not the type of environment I enjoy living in.",
            "I can't really speak for many higher level courses because I'm a sophomore, but most of the baccalaureate core classes are equivalent in rigor to that of a mainstream high school course. As an IB diploma recipient, I don't really find many of the courses challenging. However, I'm still only working on lower level requirements and might be pleasantly surprised by the upper level courses.",
            "Some things that I think would've been helpful knowing before deciding on OSU are: ~visit during the academic school year (fall through spring). I visited over the summer and later realized that the school has a completely different vibe during the academic year. ~try to get in touch with the faculty for your intended major. Most faculty members are friendly and more than willing to talk to you about your prospective major and college experience. ~if the honors college rejects you, don't get too worked up. They have really unrealistic standards for students.",
            "Quite mundane and not particularly intellectually stimulating."
        ]
    ],
    "pageTitle": "Oregon State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Oregon-State-University/reviews?_escaped_fragment_=/show/76353",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00139-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 921130331,
    "recordOffset": 920979873,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{516325=Here's a weird thing: No shave November..., 306022=I give it four stars mostly because of food quality. Food options aren't all that great, but food from the dining halls are relatively cheap and taste good. The most expensive options are in the MU (Togo's, Carl's Jr., Panda Express), but you can also find Bueno's Burritos which gives you a massive burrito for really cheap, plus there's hardly ever a long line, even at 12:30 PM on a weekday., 671018=Its winner of the prestigious 2009 Ivy Award. There are multifaceted food service operation that provides meals and services to the campus community. The campus welcomes all students, faculty and staff to dine in our three dining facilities. We offer menu selections that will meet dietary and budgetary needs of any guest. In addition, residential meal plans also accept Visa and Master Card, OSU Card Cash, checks and cash. The catering department provides all types of services from the simple coffee service to the extravagant wedding event., 851809=© 2015, Cappex.com, LLC, 288935=I have only tried the food once during a tour we did during December, and that was very good!, 226404=Apply for as many scholarships as possible. FAFSA is so important to do January of your senior year. And i'd say just to study hard and do your best on tests in high school.}",
    "textBeforeTable": "06/05/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 41 out of 46 people found this review useful. 1 of 194 James from Cedar Knolls, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. Oregon State University Reviews Oregon State University › Oregon › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Am enjoying being here I was very apposed to the idea of moving into the dorms but my parents convinced me anyways and I reluctantly went along with their decision. Living in the dorms my first year actually turned out to be a ton of fun. You have the freedom to go anywhere whenever you'd like as well as be close to classes and new friends. The dorms also have loads of activities for you to participate in. As long as you immerse yourself in all activities you find interesting and balance your studying with your fun you will have a great time. Am learning a lot Some of my teachers simply did not teach in a style that worked for me. Sometimes even the information I learned in classes I found to be completely irrelevant and worthless to my learning needs. It took a long time to adjust and honestly I would have to say high school did not prepare us enough for the change. When sitting in lectures with 200+ students in them you can find yourself easily distracted, especially when you do not always get the chance to ask questions if you are confused or understand what you are doing wrong. Fortunately once you learn how to affectively use your time it will become easier to adapt your learning style",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}