{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2005-07-28T00:00:00",
            "2007-07-24T00:00:00",
            "2007-12-26T00:00:00"
        ],
        [
            "Description",
            "GPS and XYZ-Point Data Processing The National Geodetic Survey's PAGES-NT software was used to compute double differenced, ionospherically corrected, static GPS solutions for each GPS base station with precise ephemeredes from the International GPS Service (IGS). As part of the solution tropospheric zenith delays were estimated and L1 and L2 phase biases were fixed as integers. Aircraft trajectories were estimated with respect to all base stations using National Geodetic Survey's Kinematic and Rapid-Static Software (KARS) software. Trajectories were double-differenced, ionospherically corrected, bias-fixed GPS solutions computed with precise IGS ephemeredes. Coordinates for base stations and trajectories were in the International Terrestrial Reference Frame of 2000 (ITRF00). The aircraft trajectory were transformed from the ITRF00 to North American Datum of 1983 (NAD83) using the Horizontal Time Dependent Positioning (HDTP) software (Snay, 1999) The 1Hz GPS trajectory and 50Hz aircraft inertial measurement unit (IMU) data were combined in Applanix's POSProc version 2.1.4 to compute an aided inertial navigation solution (INS) and a 50Hz, smoothed best estimate of trajectory (SBET) for day 09405. On the second day of data collection (09805), due to an equipment problem, the IMU data was recorded with random data gaps onto the ALTM1225 hard drive. Because of these data gaps, the post-processed INS and SBET for 09805 was judged not acceptable. The 1Hz aircraft trajectory computed with KARS and the real-time, aided INS solution from POS-AV provided better results. The SBET (09405) and KARS trajectory (09805), laser range observations, scanner position information, and GPS/internal clock files were processed in Realm 2.27 software suite to generate lidar data points in the Universal Transverse Mercator (UTM) projection. Lidar point data were compared to GPS ground survey data and 1998 ATM lidar data to estimate lidar instrument calibration parameters: roll and pitch biases, scanner scale factor, and first/last return elevation biases. An iterative, least-squares methodology was used to estimate calibration parameters so as to minimize differences between lidar and ground GPS data. Samples of lidar data were used to create high-resolution digital elevation models (DEM); these DEM were inspected for horizontal or vertical anomalies. After system calibration and initial quality control step, the adjusted lidar x,y,z-point data were generated by REALM software and output in UTM, zone 11 with elevations being heights above the GRS-80 reference ellipsoid (HAE). The output format from REALM 2.27 was a 9-column ASCII file containing: the second in the GPS week, easting, northing and HAE of the first lidar return, the easting, northing and HAE of the last lidar return, and the laser backscatter intensity of the first and last returns. Each record contains 9 columns of data: time tag (seconds in the GPS week), first return Easting, first return Northing, first return NAVD88, last return Easting, last return Northing, last return NAVD88, first return intensity, and last return intensity. In some cases either the first or last return values may be missing (5 columns). Data Classification Processing The classification of the lidar point data was accomplished with algorithms developed at the Center for Space Research and implemented by C++ code running on PC computer using the LINUX operating system. The ASCII lidar files were converted into binary and concatenated into a processing database. Data were separated into ground and non-ground points using a lower envelope follower (LEF). A lower envelope detector is an electronic circuit used to recover information in an Amplitude Modulated (AM) signal and the concept was adapted to the problem of extracting the ground surface from the lidar signal by creating a computer analog: the lower envelope follower (LEF) The LEF was used to detect ground points, or seeds, which include pixels located on open ground or on the ground surface beneath vegetation penetrated by the laser, but excludes buildings and vegetation. The LEF operation does not detect some ground surface areas with low gradients, so detected ground pixels are augmented using an adaptive gradient flood fill procedure. The adaptive threshold value is determined as a function of surface roughness and topographic relief. The adaptive gradient flood fill procedure results in a ground mask which is used to parse individual lidar points into ground or non-ground files. In some instances, hand editing is required to ensure accuracy of the ground mask. This includes the addition of seed points along topographic ridges or removal of buildings not detected during previous steps. The 9-column binary dataset was pushed through the ground mask and each lidar point is classified as either ground or non-ground depending on its elevation with respect to a threshold above or below the estimated ground surface. Buildings are included as non-ground points. The final ground-only data points were parsed converted back into ASCII format. Using the GEOID99 geoid model, heights above the GRS80 ellipsoid were converted to orthometric heights with respect to the North American Vertical Datum of 1988 (NAVD88). The final step was parsing the data into quarter quadrangles.",
            "The NOAA Coastal Services Center (CSC) received files in ASCII format. The files contained LiDAR intensity and elevation measurements. CSC performed the following processing on the data to make it available within the LiDAR Data Retrieval Tool (LDART) 1. Data returned to ellipsoid heights from NAVD88, using GEOID99. 2. Data converted to LAS format. 3. The LAS data were sorted by latitude and the headers were updated.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/200504_SCRIPPS_m52.xml&view=ISO19115Components-HTMLTable&altview=none",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00171-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 620059647,
    "recordOffset": 620043253,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:2005_CA_Apr_m52Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Component Title Date Citation Identifier 1 Air and Ground GPS files from 27204, 27304, and 27404 2004-05-08 1 April 2005 Lidar Point Data of Southern California Coastline: Long Beach to US/Mexican Border 2005-07-28 1 North American Datum 1983 2007-01-19 1 Raw lidar data output from ALTM 1225 2005-04-08 3 none Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 3 Bureau of Economic Geology,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}