{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are always some sort of events going on on campus. Too many to choose from actually. Do what you would enjoy doing.",
            "I go to subway most of the time because it's one of the healthiest choices in my opinion on campus. I love dining on campus better than eating at my own house. The food is great.",
            "Don't procrastinate, that's just asking for trouble. Take on all of your toughest classes as soon as you can for extra time. Work hard and you'll be fine.",
            "I like my college experience so far. It's been a roller coaster ride of work. I've been lost in my work before but I always get back on track. I can't wait for next fall."
        ]
    ],
    "pageTitle": "University of Alaska Anchorage (UAA) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Alaska-Anchorage/reviews?_escaped_fragment_=/show/92239",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911638139,
    "recordOffset": 911568608,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{346300=© 2015, Cappex.com, LLC, 246341=University of Anchorage Alaska is a big campus. There are many careers to choose from and many clubs to join. I can't wait to attend UAA in 2013., 170753=Dorms are being built 2012.}",
    "textBeforeTable": "08/17/2009 Reviewer is A current student here. 15 out of 15 people found this review useful. 1 of 86 Haley from Kodiak, AK Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Login to rate or flag the reviews Phia from Anchorage, AK 01/13/2010 Reviewer is A current student here. 9 out of 9 people found this review useful. 2 of 86 Categories Comments Bang for the buck The books are somewhat expensive, but I'm sure everywhere around the 48 states books are same priced as up here in Alaska or lowered 5 - 10 dollars. And as stated the cost of tuition fees would be lowered being a resident. Also being a student at UAA you would be able to use the gym, swimming pool, shutter, and other great places around the campus for free, well not for free because all of the equipments and activities are already included in the tuition fees. And making a wolf card is free with a 10 dollar already included in the wolf card for printing. Am enjoying being here I as a current enroll student, really love it here at UAA. I meet many new people, meet many new challenges,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}