{
    "relation": [
        [
            "Release",
            "Release 3.7.2",
            "Release 4.1.0"
        ],
        [
            "Modification",
            "This command was introduced.",
            "The vrf vrf_name keyword and argument were added to show OSPFv3 VRF configuration information. The output of the command was enhanced to include the name of the VRF."
        ]
    ],
    "pageTitle": "Cisco ASR 9000 Series Aggregation Services Router Routing Command Reference, Release 4.3.x - OSPFv3 Commands [Cisco ASR 9000 Series Aggregation Services Routers] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/asr9000/software/asr9k_r4-3/routing/command/reference/b_routing_cr43xasr9k/b_routing_cr43xasr9k_chapter_0110.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00193-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 363011743,
    "recordOffset": 362914238,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{376458=The following example shows how to assign the IP address of 10.0.0.10 to the OSPFv3 process 109:, 150558=The following example shows how to prevent OSPFv3 from redistributing routes that have 2001:e624 as the first 32 bits of the address. In addition, routes with a prefix beginning with 2064 are not redistributed from Border Gateway Protocol (BGP) autonomous system 1, and only those routes are redistributed from BGP autonomous system 5., 229673=The range for number of interfaces was changed to 1 to 4294967295 from 1 to 1024. The default number of interfaces was changed to 1024 from 255., 754900=Interval (in seconds) at which LSAs are grouped and refreshed, checksummed, or aged. Range is 10 to 1800 seconds., 259633=(Optional) Specifies an unsigned integer value (in seconds) reflecting the poll interval. RFC 1247 recommends that this value be much larger than the hello interval. The poll-interval keyword does not apply to point-to-multipoint interfaces., 720478=If enabled and metric is not explicitly configured, the default metric for external LSAs when stub-router active is 16711680 (0xFF0000)., 326019=This argument must be in the form documented in RFC 2373, in which the address is specified in hexadecimal using 16-bit values between colons., 247693=This example shows how to set a maximum of 2000 prefixes that can be redistributed into OSPFv3 process 1. If the number of prefixes redistributed reaches 75 percent of 2000 (1500 prefixes), a warning message is logged. Another warning is logged if the limit is reached and no more routes are redistributed., 727592=This argument must be in the form documented in RFC 2373, where the address is specified in hexadecimal using 16-bit values between colons., 803220=This example shows how to set 1024 error trace entries:, 791412=The following example shows how to change the start, hold, and maximum wait interval values to 5, 1000, and 90,000 milliseconds, respectively:, 719776=If enabled and metric is not explicitly configured, the default metric for summary LSAs when stub-router active is 16711680 (0xFF0000)., 780423=This example shows how to customize OSPFv3 LSA throttling so that the start interval is 200 milliseconds, the hold interval is 10,000 milliseconds, and the maximum interval is 45,000 milliseconds. The minimum interval between instances of receiving the same LSA is 2000 milliseconds., 258541=Link- local IP Version 6 (IPv6) address of the neighbor. This argument must be in the form documented in RFC 2373, in which the address is specified in hexadecimal using 16-bit values between colons., 741752=The following example shows how to set the minimum interval for accepting the same LSA at 2000 milliseconds:, 737627=1000 milliseconds, 794545=Specifies allowed size for the selected buffer. Options are: 0, 256, 1024, 2048, 4096, 8192, 16384, 32768, and 65536., 228108=If the command is not specified, the default is 1024., 301605=If not specified, the default packet size is 1500 bytes.}",
    "textBeforeTable": "Syntax Description [unicast] ipv6 address-family no [unicast] ipv6 address-family To enter address family configuration mode for Open Shortest Path First Version 3 (OSPFv3), use the address-family command in the router ospv3 configuration mode. To disable address family configuration mode, use the no form of this command. address-family (OSPFv3) vrf (OSPFv3) virtual-link (OSPFv3) transmit-delay (OSPFv3) trace (OSPFv3) timers throttle spf (OSPFv3) timers throttle lsa all (OSPFv3) timers pacing retransmission timers pacing lsa-group timers pacing flood timers lsa arrival summary-prefix (OSPFv3) stub-router stub (OSPFv3) spf prefix-priority (OSPFv3) snmp trap rate-limit (OSPFv3) snmp trap (OSPFv3) snmp context (OSPFv3) show protocols (OSPFv3) show ospfv3 virtual-links show ospfv3 summary-prefix show ospfv3 statistics rib-thread show ospfv3 routes show ospfv3 retransmission-list show ospfv3 request-list show ospfv3 neighbor show ospfv3 message-queue show ospfv3 interface show ospfv3 flood-list show ospfv3 database show ospfv3 border-routers show ospfv3",
    "textAfterTable": "An address family is not specified. Command Modes Router ospfv3 configuration Command History Release Modification Release 3.7.2 This command was introduced. Usage Guidelines To use this command, you must be in a user group associated with a task group that includes appropriate task IDs. If the user group assignment is preventing you from using a command, contact your AAA administrator for assistance. Task ID Task ID Operations ospf read, write Examples The following example shows how to configure the OSPFv3 router process with IPv6 unicast address prefixes:  RP/0/RSP0/CPU0:router(config)# router ospfv3 1 RP/0/RSP0/CPU0:router(config-ospfv3)# address-family ipv6 unicast area (OSPFv3)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}