{
    "relation": [
        [
            "Play Type",
            "Double",
            "Error-passed-ball",
            "Single",
            "Substitution",
            "Out",
            "Hit-by-pitch",
            "Out",
            "Out"
        ],
        [
            "Play",
            "Dan Uggla singled to third. On the play, Dan Uggla advances to second on Ryan Zimmerman's throwing error. Runner on second with none out and Paul Janish due up.",
            "Dan Uggla advances to third on a passed ball. Runner on third with none out and Paul Janish at the plate.",
            "Paul Janish single to short scored Dan Uggla with none out. Runner on first and Eric O`Flaherty due up.",
            "Tyler Pastornicky is pinch-hitting for Eric O'Flaherty.",
            "Pinch-Hitter Tyler Pastornicky sacrifice bunt to pitcher. On the play, Paul Janish advances to second. Runner on second with one out and Michael Bourn due up.",
            "Michael Bourn was hit-by-pitch. Runners on first and second with one out and Martin Prado due up.",
            "Martin Prado fouled out to right. Runners on first and second with two outs and Jason Heyward due up.",
            "Jason Heyward lined out to short to end the inning."
        ]
    ],
    "pageTitle": "Friday, July 20, 2012 Atlanta Braves - Washington Nationals Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/braves_nationals/2012/07/20",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00177-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 57836711,
    "recordOffset": 57826226,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2354=View all MLB box scores for 7/20/2012}",
    "TableContextTimeStampAfterTable": "{54596=Hanson, who allowed a then-season-high six runs in his last start against the Mets on July 14, was let off the hook after surrendering eight runs in four-plus innings. The Nationals crushed him for eight hits and four walks., 50848=The blown nine-run lead was the largest in Nationals/Expos history, while the nine-run comeback was the Braves' largest since overcoming a nine-run deficit on June 7, 1987 against the San Diego Padres.}",
    "textBeforeTable": "Top of the 1st Alfonso Marquez  3B Chad Fairchild  2B Brian O`Nora  1B Tom Hallion  H Umpires 3.77 15 25 1 0 0 1 2 2 Tom Gorzelanny (L, 2-2) 3.19 12 23 2 1 2 2 1 1 Tyler Clippard (BS, 3) 2.27 15 31 2 2 2 2 2 1 Sean Burnett  18.00 3 8 0 1 2 2 1 0 Drew Storen  2.25 15 30 3 1 0 0 1 1.2 Michael Gonzalez  2.85 57 103 5 3 4 4 8 5.1 Stephen Strasburg  ERA Strikes Pitches SO BB ER R H IP Name 3.68 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Nationals pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/nationals_22t.png 6 8 1 0 0 0 0 1 Chad Durbin (S, 1) 2.80 10 15 0 0 0 0 1 1 Eric O`Flaherty (W, 2-0) 1.42 9 15 1 0 1 1 1 1 Craig Kimbrel (BS, 2) 2.79 10 15 2 0 0 0 0 1 Kris Medlen  3.97 26 37 2 0 0 0 4 2 Cristhian Martinez  3.60 7 18 0 2 1 1 1 1 Luis Avilan  4.50 60 96 5 4 8 8 8 4",
    "textAfterTable": "Walk Ryan Zimmerman walked. Runner on first with two outs and Adam LaRoche due up. Double Adam LaRoche doubled to left center. On the play, Ryan Zimmerman advances to third. Runners on second and third with two outs and Michael Morse due up. Home-run Michael Morse two-out, three-run Home Run (5) to left center scored Ryan Zimmerman and Adam LaRoche. Ian Desmond due up. Walk Ian Desmond walked. Runner on first with two outs and Danny Espinosa due up. Stolen-base Ian Desmond stole second. Runner on second with two outs and Danny Espinosa at the plate. Single Danny Espinosa singled to third. On the play, Ian Desmond advances to third. Runners on first and third with two outs and Jesus Flores due up. Out Jesus Flores struck out swinging to end the inning. Top of the 2nd Play Type Play Double Freddie Freeman doubled to center. Runner on second with none out and Brian McCann due up. Out Brian McCann flied out to right. Runner on second with one out and Dan Uggla due up. Walk Dan Uggla walked. Runners on first and second with one out and Paul Janish due up. Out Paul",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}