{
    "relation": [
        [
            "NAME",
            "Kenneth Jones",
            "Devin Figaro",
            "Robert Walker",
            "Evan Mistich",
            "Chris Wade",
            "Deante Triplett",
            "Avery Riley",
            "Kenry Griffin",
            "Alton Colt Fisher",
            "Courtland Taylor"
        ],
        [
            "YR",
            "09",
            "08",
            "09",
            "08",
            "09",
            "09",
            "08",
            "08",
            "08",
            "09"
        ],
        [
            "HIGH SCHOOL",
            "Grace King",
            "Lafayette",
            "Mamou",
            "Vanderbilt Catholic",
            "Northshore",
            "John Ehret",
            "Belle Chasse",
            "Lafayette",
            "Sulphur",
            "St. Charles"
        ],
        [
            "ST",
            "LA",
            "LA",
            "LA",
            "LA",
            "LA",
            "LA",
            "LA",
            "LA",
            "LA",
            "LA"
        ],
        [
            "POS",
            "DB/RB",
            "WR",
            "RB",
            "ATH",
            "LB",
            "RB",
            "RB",
            "DB",
            "FB",
            "DB"
        ],
        [
            "HT",
            "5-5",
            "6-2",
            "5-6",
            "5-10.5",
            "6-0",
            "5-9",
            "5-6.5",
            "6-0.5",
            "6-0",
            "5-7"
        ],
        [
            "WT",
            "144",
            "176",
            "160",
            "178",
            "194",
            "209",
            "173",
            "194",
            "214",
            "146"
        ],
        [
            "40",
            "4.71",
            "4.69",
            "4.70",
            "4.90",
            "4.68",
            "4.85",
            "4.79",
            "5.08",
            "4.86",
            "4.89"
        ],
        [
            "SH",
            "4.40",
            "4.25",
            "4.56",
            "4.56",
            "4.34",
            "4.57",
            "4.70",
            "4.37",
            "4.10",
            "4.60"
        ],
        [
            "VJ",
            "34.4",
            "38.6",
            "31.6",
            "31.",
            "34.7",
            "33.2",
            "31.3",
            "32.0",
            "31.0",
            "31.8"
        ],
        [
            "BP",
            "29",
            "9",
            "26",
            "28",
            "14",
            "20",
            "23",
            "21",
            "17",
            "21"
        ],
        [
            "SPARQ RATING",
            "89.40",
            "80.81",
            "79.79",
            "79.31",
            "77.25",
            "75.55",
            "74.13",
            "74.02",
            "73.83",
            "73.26"
        ]
    ],
    "pageTitle": "BulldogBlitz.com - New Orleans Nike event brings out talent",
    "title": "New Orleans Nike Football SPARQ Challenge Top SPARQ Ratings",
    "url": "https://mississippistate.rivals.com/content.asp?CID=751806",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00085-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 862768953,
    "recordOffset": 862753335,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1936=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 BulldogBlitz.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{40108=December 16, 2007, 44785=Taking place in early December, the event was also a great opportunity for some under-recruited senior to come out and show what they can do for recruiters one last time and players like Devin Figaro and Evan Mistich took full advantage. Figaro, a lanky but explosive 6-2, 176 pound receiver from Lafayette, had the day's top vertical jump at 38.6 inches and impressed with a 4.69 40 on his way to the day's second-best SPARQ Rating. Mistich, a 5-10 1/2, 178 pound athlete from Vanderbilt Catholic who already holds offers from Air Force and Nicholls State, benched 28 reps and had a 31.6-inch vertical jump on his way to a 79.31 SPARQ Rating, good for fourth on the day., 42267=While Jones took home the day's top rating, he wasn't the only who impressed with his physical abilities. 6-5, 293 pound junior offensive tackle Chris Faulk out of Slidell (La.) Northshore was one such player. Faulk, who can be considered a strong LSU lean at this point, posted several impressive marks, including a 5.24 SPARQ-timed 40, a 27.2-inch vertical, 21 reps on the bench and a 41-foot, six-inch powerball throw, one of the day's five-best. Look for Faulk to be one of Louisiana's top recruits in the Class of 2009.}",
    "textBeforeTable": "StudentSportsFootball.com will have much more including video, player features and official results from Saturday's event so make sure to log on and stay on! Taking place in early December, the event was also a great opportunity for some under-recruited senior to come out and show what they can do for recruiters one last time and players like Devin Figaro and Evan Mistich took full advantage. Figaro, a lanky but explosive 6-2, 176 pound receiver from Lafayette, had the day's top vertical jump at 38.6 inches and impressed with a 4.69 40 on his way to the day's second-best SPARQ Rating. Mistich, a 5-10 1/2, 178 pound athlete from Vanderbilt Catholic who already holds offers from Air Force and Nicholls State, benched 28 reps and had a 31.6-inch vertical jump on his way to a 79.31 SPARQ Rating, good for fourth on the day. Junior cornerback Danzell Lockett of Hahnville posted the day's unofficial top 40 time at 4.52, and the 5-10, 160 pounder also clocked a quick 4.33 shuttle. Lockett is the younger brother of Ole Miss' Kentrell Lockett and lists the Rebels along with Mississippi State as two of his early favorites. Junior linebacker Lamin Barrow out of Marrero John Ehret had a great season this fall and showed on Saturday he has the athletic ability to be a big-time recruit. The 6-0 1/2, 207 pound 'backer posted a 71.94 SPARQ Rating on the strength of a 33-inch vertical jump and",
    "textAfterTable": "Note: The 40-yard dash and 20-yard shuttle at the Nike Football SPARQ Challenge in New Orleans were timed indoors on a Fieldturf. Not all players chose to test and some had their marks scratched in individual events. The top SPARQ Ratings should be considered unofficial until all the data is entered later this week. Talk about it in The Dawg Pound FEATURED PRODUCT Mississippi State Bulldogs Custom Replica Football Jersey - Maroon",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}