{
    "relation": [
        [
            "Payment Method",
            "PayPal System",
            "amazon",
            "Via Bank Transfer"
        ],
        [
            "Refund Method",
            "Refund to PayPal",
            "Follow amazon refund rule",
            "Refund to Bank"
        ],
        [
            "Refund Time (After Return is Received)",
            "7-9 business days for it to display on your credit card statement.",
            "Follow amazon policy",
            "10-15 business days(include bank business day)"
        ]
    ],
    "pageTitle": "www.HWtools.net 致宇科技股份有限公司",
    "title": "",
    "url": "http://www.hwtools.net/Contact%20Us.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00062-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 510851619,
    "recordOffset": 510836996,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{2119=HWtools is a new manufacturer of quality computer connectivity products since 2008, BPLUS brings to market a broad range of upgrade products. These products bridge the connection between Desktop/Notebook systems and external peripherals.}",
    "lastModified": "Thu, 02 Jul 2015 09:08:22 GMT",
    "textBeforeTable": "Most refunds are issued based on the payment method used at the time of purchase. You will still need to return your items within 30 days.     How to Refunds   When you return an item, how your refund is issued may differ based on how long you’ve had the item, and how the item was purchased.     About Refunds   Note: If a package doesn’t arrive and you don’t use a trackable method to return, Bplus may not be able to refund. If you have questions before you place an order about a seller’s return policy, please check with our sales team. Shipping and handling charges for returning items shipped back to seller are borne by the buyer. Items valued at over $80 must be returned to the seller with a trackable shipping service. When you ship please leave a message in box when you return. 1) Name 2) Address 3) Tel 4) Invoice Number 5) Order date 6) Contact Person     Seller Returns Policies   Bplus offer returns within 30 days of receipt of shipment. Returns should be contact to our sales team. All of the items sold on",
    "textAfterTable": "      Requirements for Refund Items must be in new condition Items must be returned with all original packaging and accessories       Refunds & Restocking Fees If You Return You’ll Receive Items in original condition past the return window 80% of the item’s price Items that are damaged, missing parts or not it the original condition 50% of the item’s price Items that are non-normal working condition 0% of the item’s price The return windows are 30 days after delivery. To check the return windows please contact to sales@bplus.com.tw or contact with sales person that you order from.       Bplus Warranty Policy Bplus offer warranty within 1 year. All of the items sold on Bplus web shop follow our general warranty policies. Purchasing within 1 year Customer are responsible for the freight shipping back and forth, free fix Purchasing over 1 year Customer are responsible for the freight shipping back and forth, plus the fixing fee",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}