{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2009-01-01T00:00:00",
            "2009-01-01T00:00:00",
            "2013-08-08T00:00:00",
            "2013-10-17T00:00:00"
        ],
        [
            "Description",
            "The laser data was collected using the HawkEye Mk II airborne system, the Hawkeye MKII system consists of two lasers scanners; one green (wavelength 532um) which is used for capturing the Bathymetric data and one red (wavelength 1.064um) for the Topographic data. The system emitted 64 000 pulses per second (topographic) and 4 000 pulses per second (bathymetric) with up to 4 returns and one reflectance value per pulse. The laser data collected was flown using a fixed wing platform mounted to the Rockwell Aero Commander 690 aircraft registration N690CL. The Aircraft was crewed with one pilot and one operator who was responsible for flight line planning, mission planning and aircraft control during the survey. The operator used the AHAB Airborne Operator Console software to do this Sensor orientation was measured using POS AV 410 with GPS running at 10Hz. The aerial acquisition starting on the 01st October 2008; the flying height for the survey was 400m (approx 1300ft) with a swathe of 220m and a 30m flightline overlap, with the flight speed some 150 knots (approx 290 km/h). A total of 145 flight-lines were required and a total of 17 online hours to cover the 3 survey areas in order to achieve 100% coverage. Area 1 required 88 lines and 11 online hours, Area 5 required 24 lines and 3 online hours and Area 6 required 33 lines and 3 online hours. The raw LiDAR data was checked for matching and coverage following each flight; trajectory files were produced using POSpac v5.2 and the data was then processed using Coastal Survey Studio (CSS) v2.1. A final check at the end of the acquisition period confirmed that all requirements had been met and all the data acquired to specification. On completion of all the QC checks the laser data for each flight line was exported as individual files for import into Terrascan for cleaning and classification. Topographic and hydrographic data was processed to different criteria, however during processing all data sets were kept together so it was possible to edit and visualise both datasets in the same environment simultaneously. Both the topographic and hydrographic laser data was imported into the TerraSolid OY software running in the MicroStation v8 environment. The laser data was passed through a number of automated macros for classification. The topographic laser data was then checked with the imagery by an experienced editor to remove any hits from the sea areas and to ensure that the ground was correctly classified. To ensure the quality of the data it was compared with topographic land survey data and overlapping or crossing flightlines are checked. The hydrographic laser data was \"cleaned\", removing any rogue points, floating structures, deep points or null points with no bottom returns. Overlapping or crossing flightlines were checked and comparison with topographic points took place to ensure quality. To gain reflectance values, the wave form of each individual laser sounding was analyzed in CSS (Coastal Survey Studio); the echo intensity was extracted and the data was corrected for several system biases. These included 'receiver gain', 'flight altitude' and 'scanner angle'. Several clear sand areas with known reflectance were used as a reference sample for the creation of a reflectance calibration model which took both theoretical bias and environmental bias into account. This model was used to further correct the data gained. An internal tool was then used to take those values and match them with the 'cleaned' data set by time and position. The tool was used to change the projection of the points and produce a hydrographic return ASCII file which contains data regarding longitude, latitude, UTM zone, easting, northing, elevation(IGLD85), elevation (ellipsoid), date (YYYY.MM.DD), time (HH:MM:SS:ssssss) and Bottom reflectance data relative to both NAD83 ellipsoid and International Great Lakes Datum 1985 (IGLD85).",
            "The laser data was collected using the HawkEye Mk II airborne system, the Hawkeye MKII system consists of two lasers scanners; one green (wavelength 532um) which is used for capturing the Bathymetric data and one red (wavelength 1.064um) for the Topographic data. The system emitted 64 000 pulses per second (topographic) and 4 000 pulses per second (bathymetric) with up to 4 returns and one reflectance value per pulse. The laser data collected was flown using a fixed wing platform mounted to the Rockwell Aero Commander 690 aircraft registration N690CL. The Aircraft was crewed with one pilot and one operator who was responsible for flight line planning, mission planning and aircraft control during the survey. The operator used the AHAB Airborne Operator Console software to do this. Sensor orientation was measured using POS AV 410 with GPS running at 10Hz. The aerial acquisition starting on the 01st October 2008; the flying height for the survey was 400m (approx 1300ft) with a swathe of 220m and a 30m flightline overlap, with the flight speed some 150 knots (approx 290 km/h). A total of 145 flight-lines were required and a total of 17 online hours to cover the 3 survey areas in order to achieve 100% coverage. Area 1 required 88 lines and 11 online hours, Area 5 required 24 lines and 3 online hours and Area 6 required 33 lines and 3 online hours. The raw LiDAR data was checked for matching and coverage following each flight; trajectory files were produced using POSpac v5.2 and the data was then processed using Coastal Survey Studio (CSS) v2.1. A final check at the end of the acquisition period confirmed that all requirements had been met and all the data acquired to specification. On completion of all the QC checks the laser data for each flight line was exported as individual files for import into Terrascan for cleaning and classification. Topographic and hydrographic data was processed to different criteria, however during processing all data sets were kept together so it was possible to edit and visualise both datasets in the same environment simultaneously. Both the topographic and hydrographic laser data was imported into the TerraSolid OY software running in the MicroStation v8 environment. The laser data was passed through a number of automated macros for classification. The topographic laser data was then checked with the imagery by an experienced editor to remove any hits from the sea areas and to ensure that the ground was correctly classified. To ensure the quality of the data it was compared with topographic land survey data and overlapping or crossing flightlines are checked. The hydrographic laser data was \"cleaned\", removing any rogue points, floating structures, deep points or null points with no bottom returns. Overlapping or crossing flightlines were checked and comparison with topographic points took place to ensure quality. The data was then exported from Terrascan into a conversion tool; this was used to change the projection of the points and produce ASCII files which contain data relative to both NAD83 ellipsoid and International Great Lakes Datum 1985 (IGLD85). Four ASCII tiles were produced for each 5km tile; topographic first return, topographic last return, hydrographic return and a combined topographic last return and hydrographic return. The topographic first return and topographic last return files were then reopened in Terrascan. Using the trajectories produced by POSpac and deducing by time, all points were put into their respective flightline. Each individual flightline was then exported in 5km tiles in LAS1.0 format.",
            "The NOAA Coastal Services Center (CSC) received topo and hydro files in ASCII format. Topography data was provided within GeoClassified LAS files and original LAS strips. The files contained LiDAR elevation and intensity measurements. The points were classed as 'never classified.' The data were provided in Geographic coordinates and ellipsoidal heights and in orthometric heights. CSC performed the following processing to the ellipsoidal height data to make it available within the Digital Coast: 1. ASCII formatted files were converted to LAS files using LAStools. The ASCII files contained topography/bathymetry data. Bathyemtric LAS files, along with provided GeoClassified LAS files and original LAS strips were processed to remove high and and low error (or \"air\") points. 2. All points classified as 21 were reclassified to 17 to fit the defined a scheme for NOAA Data Access Viewer. 3. All LAS files were then shifted vertically using NOAA's Vdatum software algorithms from IGLD85 to NAVD88. 4. All LAS files were then shifted horizontally and shifted from NAD83, UTM zone 16 to Geographic decimal degrees. 5. Metadata were created, along with a KMZ for the project and ancillary information provided in metadata record. 6. Finally, since original provided were differentiated by data type (i.e. GeoClassified LAS files, LAS strips and ASCII txt files, all data were compiled into one dataset. 7. Due to vertical and horizontal datum shifting in order to have ASCII, geoclassified and las strips to match NOAA CSC requirements, the data has been reverted to all unclassified points, although data contains bathymetric and topographic points.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/mi2008_usace_lakesuperior_m2517.xml&view=ISO19115Components-HTMLTable&altview=none",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00264-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 615258995,
    "recordOffset": 615242601,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:mi2008_usace_lakesuperior_m2517Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "1 2008 USACE NCMP Topographic Lidar: Lake Superior 2013-08-09 3 None 1 North American Datum 1983 2007-01-19 Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 NOAA CSC (originator) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov originator http://coast.noaa.gov 1 NOAA CSC (publisher) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov publisher http://coast.noaa.gov 1",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}