{
    "relation": [
        [
            "Job Title",
            "Administrative Assistant",
            "Bookkeeper needed for Cocktails in a Bag®!",
            "Retail / Individual Account Manager for Cocktails in a Bag"
        ],
        [
            "Location",
            "Portland, OR",
            "Portland, OR",
            "Portland, OR"
        ]
    ],
    "pageTitle": "Non-profit - Entry Level Jobs, Internships, and Career Overview",
    "title": "",
    "url": "http://www.onedayonejob.com/jobs-internships/non-profit/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00068-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 630477955,
    "recordOffset": 630372878,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{209374=Conrad N. Hilton Foundation - Conrad N. Hilton Foundation is an Agoura Hills, CA based non-profit “family foundation established in 1944 by the man who started Hilton Hotels.”, 238134=Copyright © 2007-2013 One Day, One Job. All rights reserved.}",
    "textBeforeTable": "Virginia public policy policy non-profit graphic design education development design all employers academia See the complete The Institute for Humane Studies profile The Institute for Humane Studies - The IHS is an Arlington, VA based organization that “advances a freer society by discovering and facilitating the development of people who share an interest in liberty.” Companies with Entry Level Jobs and Internships in Non-profit From a financial perspective, non-profit differs from a commercial business in that a non-profit’s surplus revenues are used to achieve its goals instead of distributed as profits. Despite this distinction, a non-profit can support one of many causes from education to research to affordable housing. With this much variety, chances are there’s a non-profit out there for a cause you support. While many non-profits have paid staff, others are staffed (sometimes entirely) by unpaid volunteers. The pay may not be amazing working at a non-profit, but you get to work for a good cause and you can get the foot in the door easily by volunteering or interning. Photo Credit: Flickr user",
    "textAfterTable": "Animal Care Technicians Cambridge, MA Events Management Intern Arlington, VA See all 20 job postings Juvenile Law Center - Juvenile Law Center is a Philly based org that “plays a leadership role in shaping and using the law on behalf of children in the child welfare and justice systems.\" See the complete Juvenile Law Center profile advocacy all employers communications development law marketing non-profit Pennsylvania policy public policy Job Title Location Policy Analyst, CSC New York, NY Legal Internship Houston, TX Counseling Intern - Part-Time - Juvenile Probation Richmond, TX Volunteer/Intern Program Los Angeles County, CA Program Assistant, After School Kids Program,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}