{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Beach. Campus activities are always fun.",
            "great food most the time. could not ask for more.",
            "Room mates as well as hall mates are very united. A second family is formed.",
            "Class work, homework very demanding but vanguard is very flexible with scheduling the right fit.",
            "be involved with campus activities. Its college so its work, work, work.",
            "great school. staff members are great teachers and people. Love the atmosphere and christian atmosphere."
        ]
    ],
    "pageTitle": "Vanguard University of Southern California Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Vanguard-University-of-Southern-California/reviews?_escaped_fragment_=/show/5077",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902856667,
    "recordOffset": 902811415,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11024=You are started off with welcome week in August. This week is just to help you get to know people and the campus and surrounding areas before school even starts. You feel at home within a week. Everybody here treats you like a friend, you cannot walk to class without talking to at least one person on the way! Your floor is your family, and after being here only one semester we all are like sisters! And who doesn't like being 20 minutes from Disneyland???, 211220=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/20/2009 Reviewer is A current student here. 10 out of 13 people found this review useful. 1 of 52 Noemi from Downey, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Bang for the buck Vanguard University, although it has a great environment for freshman and/or those who are new to a college environment, it is extremely expensive. Vanguard University does offer scholarship money, I know I got 12,000 dollars worth (the highest a student can get through academics is 13,000). But it was still extremely expensive and when you think about it, you can learn the same things at bigger and better schools for MUCH cheaper. The school, while a good environment, is not a good buy. Did enjoy being here As for the social life of the school, I think that the atmosphere here is very welcoming. Many of the people are amiable and accepting. However, do not be fooled by its Christian atmosphere. This school does have alcohol and drug consumption, but it is simply done off campus. But this school has a really great community and there is plenty to do, including the beach and Disneyland! Note: There is a required 30 spiritual formation credits. This means you must go to thirty chapels, which can be a hassle especially the week before finals. If you enjoy going to church, then great. If not, probably not the best place to go. Academic Rigor They have some really awesome teachers",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}