{
    "relation": [
        [
            "To address increased risk of a maximum allowable operating pressure based on higher stress levels in the following areas:",
            "(1) Identifying and evaluating threats",
            "",
            "(2) Notifying the public",
            "",
            "",
            "",
            "(3) Responding to an emergency in an area defined as a high consequence area in §192.903",
            "",
            "",
            "",
            "(4) Protecting the right-of-way",
            "",
            "",
            "",
            "",
            "",
            "(5) Controlling internal corrosion",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "(6) Controlling interference that can impact external corrosion",
            "",
            "",
            "",
            "",
            "(7) Confirming external corrosion control through indirect assessment",
            "",
            "",
            "",
            "",
            "",
            "",
            "(8) Controlling external corrosion through cathodic protection",
            "",
            "",
            "(9) Conducting a baseline assessment of integrity",
            "",
            "",
            "",
            "",
            "(10) Conducting periodic assessments of integrity",
            "",
            "",
            "(11) Making repairs",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Take the following additional step:",
            "Develop a threat matrix consistent with §192.917 to do the following: (i) Identify and compare the increased risk of operating the pipeline at the increased stress level under this section with conventional operation; and",
            "(ii) Describe and implement procedures used to mitigate the risk.",
            "(i) Recalculate the potential impact circle as defined in §192.903 to reflect use of the alternative maximum operating pressure calculated under paragraph (a) of this section and pipeline operating conditions; and",
            "(ii) In implementing the public education program required under §192.616, perform the following:",
            "(A) Include persons occupying property within 220 yards of the centerline and within the potential impact circle within the targeted audience; and",
            "(B) Include information about the integrity management activities performed under this section within the message provided to the audience.",
            "(i) Ensure that the identification of high consequence areas reflects the larger potential impact circle recalculated under paragraph (d)(2)(i) of this section.",
            "(ii) If personnel response time to mainline valves on either side of the high consequence area exceeds one hour (under normal driving conditions and speed limits) from the time the event is identified in the control room, provide remote valve control through a supervisory control and data acquisition (SCADA) system, other leak detection system, or an alternative method of control.",
            "(iii) Remote valve control must include the ability to close and monitor the valve position (open or closed), and monitor pressure upstream and downstream.",
            "(iv) A line break valve control system using differential pressure, rate of pressure drop or other widely-accepted method is an acceptable alternative to remote valve control.",
            "(i) Patrol the right-of-way at intervals not exceeding 45 days, but at least 12 times each calendar year, to inspect for excavation activities, ground movement, wash outs, leakage, or other activities or conditions affecting the safety operation of the pipeline.",
            "(ii) Develop and implement a plan to monitor for and mitigate occurrences of unstable soil and ground movement.",
            "(iii) If observed conditions indicate the possible loss of cover, perform a depth of cover study and replace cover as necessary to restore the depth of cover or apply alternative means to provide protection equivalent to the originally-required depth of cover.",
            "(iv) Use line-of-sight line markers satisfying the requirements of §192.707(d) except in agricultural areas, large water crossings or swamp, steep terrain, or where prohibited by Federal Energy Regulatory Commission orders, permits, or local law.",
            "(v) Review the damage prevention program under §192.614(a) in light of national consensus practices, to ensure the program provides adequate protection of the right-of-way. Identify the standards or practices considered in the review, and meet or exceed those standards or practices by incorporating appropriate changes into the program.",
            "(vi) Develop and implement a right-of-way management plan to protect the pipeline segment from damage due to excavation activities.",
            "(i) Develop and implement a program to monitor for and mitigate the presence of, deleterious gas stream constituents.",
            "(ii) At points where gas with potentially deleterious contaminants enters the pipeline, use filter separators or separators and gas quality monitoring equipment.",
            "(iii) Use gas quality monitoring equipment that includes a moisture analyzer, chromatograph, and periodic hydrogen sulfide sampling.",
            "(iv) Use cleaning pigs and sample accumulated liquids. Use inhibitors when corrosive gas or liquids are present.",
            "(v) Address deleterious gas stream constituents as follows:",
            "(A) Limit carbon dioxide to 3 percent by volume;",
            "(B) Allow no free water and otherwise limit water to seven pounds per million cubic feet of gas; and",
            "(C) Limit hydrogen sulfide to 1.0 grain per hundred cubic feet (16 ppm) of gas, where the hydrogen sulfide is greater than 0.5 grain per hundred cubic feet (8 ppm) of gas, implement a pigging and inhibitor injection program to address deleterious gas stream constituents, including follow-up sampling and quality testing of liquids at receipt points.",
            "(vi) Review the program at least quarterly based on the gas stream experience and implement adjustments to monitor for, and mitigate the presence of, deleterious gas stream constituents.",
            "(i) Prior to operating an existing pipeline segment at an alternate maximum allowable operating pressure calculated under this section, or within six months after placing a new pipeline segment in service at an alternate maximum allowable operating pressure calculated under this section, address any interference currents on the pipeline segment.",
            "(ii) To address interference currents, perform the following:",
            "(A) Conduct an interference survey to detect the presence and level of any electrical current that could impact external corrosion where interference is suspected;",
            "(B) Analyze the results of the survey; and",
            "(C) Take any remedial action needed within 6 months after completing the survey to protect the pipeline segment from deleterious current.",
            "(i) Within six months after placing the cathodic protection of a new pipeline segment in operation, or within six months after certifying a segment under §192.620(c)(1) of an existing pipeline segment under this section, assess the adequacy of the cathodic protection through an indirect method such as close-interval survey, and the integrity of the coating using direct current voltage gradient (DCVG) or alternating current voltage gradient (ACVG).",
            "(ii) Remediate any construction damaged coating with a voltage drop classified as moderate or severe (IR drop greater than 35% for DCVG or 50 dBµv for ACVG) under section 4 of NACE RP–0502–2002 (incorporated by reference, see §192.7).",
            "(iii) Within six months after completing the baseline internal inspection required under paragraph (d)(9) of this section, integrate the results of the indirect assessment required under paragraph (d)(7)(i) of this section with the results of the baseline internal inspection and take any needed remedial actions.",
            "(iv) For all pipeline segments in high consequence areas, perform periodic assessments as follows:",
            "(A) Conduct periodic close interval surveys with current interrupted to confirm voltage drops in association with periodic assessments under subpart O of this part.",
            "(B) Locate pipe-to-soil test stations at half-mile intervals within each high consequence area ensuring at least one station is within each high consequence area, if practicable.",
            "(C) Integrate the results with those of the baseline and periodic assessments for integrity done under paragraphs (d)(9) and (d)(10) of this section.",
            "(i) If an annual test station reading indicates cathodic protection below the level of protection required in subpart I of this part, complete remedial action within six months of the failed reading or notify each PHMSA pipeline safety regional office where the pipeline is in service demonstrating that the integrity of the pipeline is not compromised if the repair takes longer than 6 months. An operator must also notify a State pipeline safety authority when the pipeline is located in a State where PHMSA has an interstate agent agreement, or an intrastate pipeline is regulated by that State; and",
            "(ii) After remedial action to address a failed reading, confirm restoration of adequate corrosion control by a close interval survey on either side of the affected test station to the next test station unless the reason for the failed reading is determined to be a rectifier connection or power input problem that can be remediated and otherwise verified.",
            "(iii) If the pipeline segment has been in operation, the cathodic protection system on the pipeline segment must have been operational within 12 months of the completion of construction.",
            "(i) Except as provided in paragraph (d)(9)(iii) of this section, for a new pipeline segment operating at the new alternative maximum allowable operating pressure, perform a baseline internal inspection of the entire pipeline segment as follows:",
            "(A) Assess using a geometry tool after the initial hydrostatic test and backfill and within six months after placing the new pipeline segment in service; and",
            "(B) Assess using a high resolution magnetic flux tool within three years after placing the new pipeline segment in service at the alternative maximum allowable operating pressure.",
            "(ii) Except as provided in paragraph (d)(9)(iii) of this section, for an existing pipeline segment, perform a baseline internal assessment using a geometry tool and a high resolution magnetic flux tool before, but within two years prior to, raising pressure to the alternative maximum allowable operating pressure as allowed under this section.",
            "(iii) If headers, mainline valve by-passes, compressor station piping, meter station piping, or other short portion of a pipeline segment operating at alternative maximum allowable operating pressure cannot accommodate a geometry tool and a high resolution magnetic flux tool, use direct assessment (per §192.925, §192.927 and/or §192.929) or pressure testing (per subpart J of this part) to assess that portion.",
            "(i) Determine a frequency for subsequent periodic integrity assessments as if all the alternative maximum allowable operating pressure pipeline segments were covered by subpart O of this part and",
            "(ii) Conduct periodic internal inspections using a high resolution magnetic flux tool on the frequency determined under paragraph (d)(10)(i) of this section, or",
            "(iii) Use direct assessment (per §192.925, §192.927 and/or §192.929) or pressure testing (per subpart J of this part) for periodic assessment of a portion of a segment to the extent permitted for a baseline assessment under paragraph (d)(9)(iii) of this section.",
            "(i) Perform the following when evaluating an anomaly:",
            "(A) Use the most conservative calculation for determining remaining strength or an alternative validated calculation based on pipe diameter, wall thickness, grade, operating pressure, operating stress level, and operating temperature: and",
            "(B) Take into account the tolerances of the tools used for the inspection.",
            "(ii) Repair a defect immediately if any of the following apply:",
            "(A) The defect is a dent discovered during the baseline assessment for integrity under paragraph (d)(9) of this section and the defect meets the criteria for immediate repair in §192.309(b).",
            "(B) The defect meets the criteria for immediate repair in §192.933(d).",
            "(C) The alternative maximum allowable operating pressure was based on a design factor of 0.67 under paragraph (a) of this section and the failure pressure is less than 1.25 times the alternative maximum allowable operating pressure.",
            "(D) The alternative maximum allowable operating pressure was based on a design factor of 0.56 under paragraph (a) of this section and the failure pressure is less than or equal to 1.4 times the alternative maximum allowable operating pressure.",
            "(iii) If paragraph (d)(11)(ii) of this section does not require immediate repair, repair a defect within one year if any of the following apply:",
            "(A) The defect meets the criteria for repair within one year in §192.933(d).",
            "(B) The alternative maximum allowable operating pressure was based on a design factor of 0.80 under paragraph (a) of this section and the failure pressure is less than 1.25 times the alternative maximum allowable operating pressure.",
            "(C) The alternative maximum allowable operating pressure was based on a design factor of 0.67 under paragraph (a) of this section and the failure pressure is less than 1.50 times the alternative maximum allowable operating pressure.",
            "(D) The alternative maximum allowable operating pressure was based on a design factor of 0.56 under paragraph (a) of this section and the failure pressure is less than or equal to 1.80 times the alternative maximum allowable operating pressure.",
            "(iv) Evaluate any defect not required to be repaired under paragraph (d)(11)(ii) or (iii) of this section to determine its growth rate, set the maximum interval for repair or re-inspection, and repair or re-inspect within that interval."
        ]
    ],
    "pageTitle": "49 CFR 192 : TRANSPORTATION OF NATURAL AND OTHER GAS BY PIPELINE: MINIMUM FEDERAL SAFETY STANDARDS [ 49 CFR 192 ] : (TRANSPORTATION [ 49 CFR ])",
    "title": "",
    "url": "http://cfr.regstoday.com/49cfr192.aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00305-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 45277351,
    "recordOffset": 45140924,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=(1) May not weld on pipe to be operated at a pressure that produces a hoop stress of 20 percent or more of SMYS unless within the preceding 6 calendar months the welder has had one weld tested and found acceptable under the sections 6 or 9 of API Standard 1104 (incorporated by reference, see §192.7). Alternatively, welders may maintain an ongoing qualification status by performing welds tested and found acceptable under the above acceptance criteria at least twice each calendar year, but at intervals not exceeding 71/2months. A welder qualified under an earlier edition of a standard listed in §192.7 of this part may weld but may not requalify under that earlier edition; and}",
    "TableContextTimeStampAfterTable": "{252993=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–37, 46 FR 10160, Feb. 2, 1981; Amdt. 192–78, 61 FR 28784, June 6, 1996; Amdt. 192–85, 63 FR 37503, July 13, 1998; Amdt. 192–94, 69 FR 32894, June 14, 2004], 226691=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–85, 63 FR 37503, July 13, 1998], 530721=(a) Operators must have a written qualification program by April 27, 2001. The program must be available for review by the Administrator or by a state agency participating under 49 U.S.C. Chapter 601 if the program is under the authority of that state agency., 411775=(2) Pipelines, other than those located offshore, in Class 1 or 2 locations until September 20, 1995., 186930=[Amdt. 192–45, 48 FR 30639, July 5, 1983, as amended by Amdt. 192–94, 69 FR 32894, June 14, 2004], 518932=[Amdt. 192–43, 47 FR 46851, Oct. 21, 1982, as amended by Amdt. 192–93, 68 FR 53901, Sept. 15, 2003], 572468=(b) General requirements. An operator that uses direct assessment to assess the threat of external corrosion must follow the requirements in this section, in ASME/ANSI B31.8S (incorporated by reference, see §192.7), section 6.4, and in NACE SP0502–2008 (incorporated by reference, see §192.7). An operator must develop and implement a direct assessment plan that has procedures addressing preassessment, indirect examination, direct examination, and post-assessment. If the ECDA detects pipeline coating damage, the operator must also integrate the data from the ECDA with other information from the data integration (§192.917(b)) to evaluate the covered segment for the threat of third party damage, and to address the threat as required by §192.917(e)(1)., 259767=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–62, 54 FR 5628, Feb. 6, 1989], 178915=(f) The design pressure for polyamide-11 (PA–11) pipe produced after January 23, 2009 may exceed a gauge pressure of 100 psig (689 kPa) provided that:, 576981=(ii) Criteria for evaluating whether conditions discovered by direct examination of indications in each ECDA region indicate a need for reassessment of the covered segment at an interval less than that specified in §192.939. (See Appendix D of NACE SP0502–2008.), 374970=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–93, 68 FR 53901, Sept. 15, 2003], 542858=(a) General. No later than December 17, 2004, an operator of a covered pipeline segment must develop and follow a written integrity management program that contains all the elements described in §192.911 and that addresses the risks on each covered transmission pipeline segment. The initial integrity management program must consist, at a minimum, of a framework that describes the process for implementing each program element, how relevant decisions will be made and by whom, a time line for completing the work to implement the program element, and how information gained from experience will be continuously incorporated into the program. The framework will evolve into a more detailed and comprehensive program. An operator must make continual improvements to the program., 326144=§ 192.455   External corrosion control: Buried or submerged pipelines installed after July 31, 1971., 122471=[Amdt. 192–30, 42 FR 60148, Nov. 25, 1977], 290398=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–85, 63 FR 37503, July 13, 1998], 371135=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–74, 61 FR 18517, Apr. 26, 1996; Amdt 192–85, 63 FR 37504, July 13, 1998], 609507=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 18234, Apr. 6, 2004], 120562=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–27, 41 FR 34605, Aug. 16, 1976; Amdt. 192–30, 42 FR 60148, Nov. 25, 1977; Amdt. 192–102, 71 FR 13303, Mar. 15, 2006], 611663=(2) External Corrosion Direct Assessment. An operator that uses ECDA that meets the requirements of this subpart must determine the reassessment interval according to the requirements in paragraphs 6.2 and 6.3 of NACE SP0502–2008 (incorporated by reference, see §192.7)., 431631=(i) For facilities installed prior to December 22, 2008, for which §192.111(b), (c), or (d) applies, use the following design factors as alternatives for the factors specified in those paragraphs: §192.111(b)−0.67 or less; 192.111(c) and (d)−0.56 or less., 185574=[Amdt. 48, 49 FR 19824, May 10, 1984 as amended at 72 FR 20059, Apr. 23, 2007], 575311=(3) Direct examination. In addition to the requirements in ASME/ANSI B31.8S section 6.4 and NACE SP0502–2008, section 5, the plan's procedures for direct examination of indications from the indirect examination must include—, 189839=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–62, 54 FR 5628, Feb. 6, 1989; Amdt. 192–85, 63 FR 37502, July 13, 1998; Amdt. 192–94, 69 FR 32894, June 14, 2004; Amdt. 192–114, 75 FR 48603, Aug. 11, 2010], 491342=[Amdt. 192–20, 40 FR 13505, Mar. 27, 1975; Amdt. 192–27, 41 FR 39752, Sept. 16, 1976, as amended by Amdt. 192–20A, 41 FR 56808, Dec. 30, 1976; Amdt. 192–44, 48 FR 25208, June 6, 1983; Amdt. 192–73, 60 FR 14650, Mar. 20, 1995; Amdt. 192–85, 63 FR 37504, July 13, 1998], 524471=Source:   Amdt. 192–86, 64 FR 46865, Aug. 27, 1999, unless otherwise noted., 549462=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 18231, Apr. 6, 2004], 170155=[Amdt. 192–37, 46 FR 10159, Feb. 2, 1981, as amended by Amdt. 192–51, 51 FR 15335, Apr. 23, 1986; Amdt. 192–62, 54 FR 5627, Feb. 6, 1989; 58 FR 14521, Mar. 18, 1993; Amdt. 192–85, 63 FR 37502, July 13, 1998; Amdt. 192–94, 69 FR 32894, June 14, 2004], 128674=(ii) If it was manufactured before November 12, 1970, either section II or III of appendix B to this part; or, 438325=(6) If the performance of a construction task associated with implementing alternative MAOP that occurs after December 22, 2008, can affect the integrity of the pipeline segment, treat that task as a “covered task”, notwithstanding the definition in §192.801(b) and implement the requirements of subpart N as appropriate., 257292=[Amdt. 192–46, 48 FR 48674, Oct. 20, 1983], 638512=[74 FR 63934, Dec. 4, 2009, as amended at 76 FR 5499, Feb. 1, 2011], 358670=[Amdt. 192–101, 70 FR 61575, Oct. 25, 2005], 179420=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–31, 43 FR 13883, Apr. 3, 1978; Amdt. 192–78, 61 FR 28783, June 6, 1996; Amdt. 192–85, 63 FR 37502, July 13, 1998; Amdt. 192–93, 68 FR 53900, Sept. 15, 2003; 69 FR 32894, June 14, 2004; Amdt. 192–94, 69 FR 54592, Sept. 9, 2004; Amdt. 192–103, 71 FR 33407, June 9, 2006; 73 FR 79005, Dec. 24, 2008; Amdt. 192–114, 75 FR 48603, Aug. 11, 2010], 553755=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 18231, Apr. 6, 2004], 320925=(b) Installation required. An excess flow valve (EFV) installation must comply with the performance standards in §192.381. The operator must install an EFV on any new or replaced service line serving a single-family residence after February 12, 2010, unless one or more of the following conditions is present:, 252522=(c) The acceptability of a weld that is nondestructively tested or visually inspected is determined according to the standards in Section 9 of API Standard 1104 (incorporated by reference, see §192.7). However, if a girth weld is unacceptable under those standards for a reason other than a crack, and if Appendix A to API 1104 applies to the weld, the acceptability of the weld may be further determined under that appendix., 84996=E. Manufacturers Standardization Society of the Valve and Fittings Industry, Inc. (MSS), 127 Park Street, NE., Vienna, VA 22180., 317122=[Amdt. 192–8, 37 FR 20694, Oct. 3, 1972], 435519=(7) At least 95 percent of girth welds on a segment that was constructed prior to December 22, 2008, must have been non-destructively examined in accordance with §192.243(b) and (c)., 488847=[Amdt. 192–21, 40 FR 20283, May 9, 1975, as amended by Amdt. 192–43, 47 FR 46851, Oct. 21, 1982; Amdt. 192–71, 59 FR 6585, Feb. 11, 1994], 539393=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 18231, Apr. 6, 2004; Amdt. 192–95, 69 FR 29904, May 26, 2004; Amdt. 192–103, 72 FR 4657, Feb. 1, 2007], 244930=(a) Except as provided in paragraph (b) of this section, each welder must be qualified in accordance with section 6 of API 1104 (incorporated by reference, see §192.7) or section IX of the ASME Boiler and Pressure Vessel Code (incorporated by reference, see §192.7). However, a welder qualified under an earlier edition than listed in §192.7 of this part may weld but may not requalify under that earlier edition., 568118=(e) Prior assessment. An operator may use a prior integrity assessment conducted before December 17, 2002 as a baseline assessment for the covered segment, if the integrity assessment meets the baseline requirements in this subpart and subsequent remedial actions to address the conditions listed in §192.933 have been carried out. In addition, if an operator uses this prior assessment as its baseline assessment, the operator must reassess the line pipe in the covered segment according to the requirements of §192.937 and §192.939., 324794=(1) The requirements of this subpart specifically applicable to pipelines installed before August 1, 1971, apply to the gathering line regardless of the date the pipeline was actually installed; and, 134311=(d) Paragraph (a) of this section does not apply to items manufactured before November 12, 1970, that meet all of the following:, 340351=[Amdt. 192–4, 36 FR 12302, June 30, 1971, as amended by Amdt. 192–33, 43 FR 39390, Sept. 5, 1978], 319947=[Amdt. 192–79, 61 FR 31459, June 20, 1996, as amended by Amdt. 192–80, 62 FR 2619, Jan. 17, 1997; Amdt. 192–85, 63 FR 37504, July 13, 1998], 390845=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–66, 56 FR 31090, July 9, 1991; Amdt. 192–71, 59 FR 6584, Feb. 11, 1994; Amdt. 192–75, 61 FR 18517, Apr. 26, 1996], 305639=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–1, 35 FR 17660, Nov. 17, 1970; Amdt. 192–85, 63 FR 37503, July 13, 1998], 125725=(c) Each operator shall notify each customer not later than August 14, 1996, or 90 days after the customer first receives gas at a particular location, whichever is later. However, operators of master meter systems may continuously post a general notice in a prominent location frequented by customers., 315526=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–78, 61 FR 28785, June 6, 1996], 206460=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–27, 41 FR 34605, Aug. 16, 1976; Amdt. 192–37, 46 FR 10159, Feb. 2, 1981; 58 FR 14521, Mar. 18, 1993; Amdt. 192–85, 63 FR 37502, 37503, July 13, 1998], 103448=[35 FR 13257, Aug. 19, 1970], 302292=[35 FR 13257, Aug. 19, 1970, as amended by Amdt 192–85, 63 FR 37503, July 13, 1998; Amdt. 192–93, 68 FR 53900, Sept. 15, 2003], 590558=(d) Defects requiring near-term remediation. If an assessment carried out under paragraph (b) or (c) of this section reveals any defect requiring remediation prior to the next scheduled assessment, the operator must schedule the next assessment in accordance with NACE SP0502–2008 (incorporated by reference, see §192.7), section 6.2 and 6.3. If the defect requires immediate remediation, then the operator must reduce pressure consistent with §192.933 until the operator has completed reassessment using one of the assessment techniques allowed in §192.937., 518077=[Amdt. 192–43, 47 FR 46851, Oct. 21, 1982, as amended by Amdt. 192–93, 68 FR 53901, Sept. 15, 2003], 420874=[Amdt. 192–100, 70 FR 28842, May 19, 2005; 70 FR 35041, June 16, 2005; 72 FR 70810, Dec. 13, 2007], 509407=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–43, 47 FR 46851, Oct. 21, 1982], 175025== 0.40 for PA–11 pipe produced after January 23, 2009 with a nominal pipe size (IPS or CTS) 4-inch or less, and a SDR of 11 or greater (i.e. thicker pipe wall)., 483531=[Amdt. 192–112, 74 FR 63327, Dec. 3, 2009, as amended at 75 FR 5537, Feb. 3, 2010; 76 FR 35135, June 16, 2011], 492891=[Amdt. 192–78, 61 FR 28786, June 6, 1996], 85524=I. Gas Technology Institute (GTI), 1700 South Mount Prospect Road, Des Plaines, IL 60018., 662847=[Amdt. 192–4, 36 FR 12305, June 30, 1971], 388872=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–37, 46 FR 10160, Feb. 2, 1981; Amdt. 192–62, 54 FR 5628, Feb. 6, 1989; Amdt. 195–85, 63 FR 37504, July 13, 1998], 627855=[68 FR 69817, Dec. 15, 2003, as amended at 70 FR 11139, Mar. 8, 2005; Amdt. 192–103, 72 FR 4657, Feb. 1, 2007; 73 FR 16570, Mar. 28, 2008; 74 FR 2894, Jan. 16, 2009], 172532=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–85, 63 FR 37502, July 13, 1998], 263301=(1) The adhesive must conform to ASTM Designation D 2517., 84648=B. American Petroleum Institute (API), 1220 L Street, NW., Washington, DC 20005., 531329=(d) After October 28, 2002, work performance history may not be used as a sole evaluation method., 199169=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–1, 35 FR 17660, Nov. 17, 1970; 58 FR 14521, Mar. 18, 1993; Amdt. 192–68, 58 FR 45268, Aug. 27, 1993; Amdt. 192–85, 63 FR 37502, July 13, 1998], 322478=Source:   Amdt. 192–4, 36 FR 12302, June 30, 1971, unless otherwise noted., 502547=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–43, 47 FR 46851, Oct. 21, 1982; Amdt. 192–70, 58 FR 54528, 54529, Oct. 22, 1993; Amdt. 192–71, 59 FR 6585, Feb. 11, 1994; Amdt. 192–94, 69 FR 32895, June 14, 2004; Amdt. 192–94, 69 FR 54592, Sept. 9, 2004], 234711=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–1, 35 FR 17660, Nov. 7, 1970; Amdt 192–85, 63 FR 37503, July 13, 1998; Amdt. 192–93, 68 FR 53900, Sept. 15, 2003], 130689=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 191–1, 35 FR 17660, Nov. 17, 1970; Amdt. 192–12, 38 FR 4761, Feb. 22, 1973; Amdt. 192–51, 51 FR 15335, Apr. 23, 1986; 58 FR 14521, Mar. 18, 1993; Amdt. 192–85, 63 FR 37502, July 13, 1998], 329400=[Amdt. 192–4, 36 FR 12302, June 30, 1971, as amended at Amdt. 192–28, 42 FR 35654, July 11, 1977; Amdt. 192–39, 47 FR 9844, Mar. 8, 1982; Amdt. 192–78, 61 FR 28785, June 6, 1996; Amdt. 192–85, 63 FR 37504, July 13, 1998], 265233=(ii) In the case of thermosetting plastic pipe, paragraph 8.5 (Minimum Hydrostatic Burst Pressure) or paragraph 8.9 (Sustained Static Pressure Test) of ASTM D2517 (incorporated by reference, see §192.7); or, 116046=[Amdt. 192–81, 62 FR 61695, Nov. 19, 1997, as amended at 70 FR 11139, Mar. 8, 2005], 498696=[Amdt. 192–88, 64 FR 69665, Dec. 14, 1999], 146692=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–27, 41 FR 34605, Aug. 16, 1976], 134734=[Amdt. 192–1, 35 FR 17660, Nov. 17, 1970, as amended by Amdt. 192–31, 43 FR 883, Apr. 3, 1978; Amdt. 192–61, 53 FR 36793, Sept. 22, 1988; Amdt. 192–62, 54 FR 5627, Feb. 6, 1989; Amdt. 192–61A, 54 FR 32642, Aug. 9, 1989; 58 FR 14521, Mar. 18, 1993; Amdt. 192–76, 61 FR 26122, May 24, 1996; 61 FR 36826, July 15, 1996; Amdt. 192–114, 75 FR 48603, Aug. 11, 2010], 255766=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–27, 41 FR 34606, Aug. 16, 1976; Amdt. 192–50, 50 FR 37192, Sept. 12, 1985; Amdt. 192–78, 61 FR 28784, June 6, 1996], 468673=(2) The line transports gas to any of the following facilities which received gas without an odorant from that line before May 5, 1975;, 520140=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–43, 47 FR 46851, Oct. 21, 1982; Amdt. 192–85, 63 FR 37504, July 13, 1998], 569940=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 18232, Apr. 6, 2004], 332274=[Amdt. 192–87, 64 FR 56981, Oct. 22, 1999], 312166=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–75, 61 FR 18517, Apr. 26, 1996], 529213=[Amdt. 192–86, 64 FR 46865, Aug. 27, 1999, as amended by Amdt. 192–100, 70 FR 10335, Mar. 3, 2005], 237122=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–1, 35 FR 17660, Nov. 17, 1970], 344180=[Amdt. 192–4, 36 FR 12302, June 30, 1971, as amended by Amdt. 192–33, 43 FR 39390, Sept. 5, 1978; Amdt. 192–78, 61 FR 28785, June 6, 1996; Amdt. 192–85, 63 FR 37504, July 13, 1998], 132835=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–19, 40 FR 10472, Mar. 6, 1975; Amdt. 192–58, 53 FR 1635, Jan. 21, 1988], 247652=(2) May not weld on pipe to be operated at a pressure that produces a hoop stress of less than 20 percent of SMYS unless the welder is tested in accordance with paragraph (c)(1) of this section or requalifies under paragraph (d)(1) or (d)(2) of this section., 404016=(a) Each operator shall prepare and follow a procedure to identify its pipelines in the Gulf of Mexico and its inlets in waters less than 15 feet (4.6 meters) deep as measured from mean low water that are at risk of being an exposed underwater pipeline or a hazard to navigation. The procedures must be in effect August 10, 2005., 631141=[74 FR 63934, Dec. 4, 2009, as amended at 76 FR 5499, Feb. 1, 2011], 78829=[Amdt. 192–13, 38 FR 9084, Apr. 10, 1973, as amended by Amdt. 192–27, 41 FR 34605, Aug. 16, 1976; Amdt. 192–58, 53 FR 1635, Jan. 21, 1988; Amdt. 192–67, 56 FR 63771, Dec. 5, 1991; Amdt. 192–72, 59 FR 17281, Apr. 12, 1994; Amdt. 192–78, 61 FR 28783, June 6, 1996; Amdt. 192–81, 62 FR 61695, Nov. 19, 1997; Amdt. 192–85, 63 FR 37501, July 13, 1998; Amdt. 192–89, 65 FR 54443, Sept. 8, 2000; 68 FR 11749, Mar. 12, 2003; Amdt. 192–93, 68 FR 53900, Sept. 15, 2003; Amdt. 192–98, 69 FR 48406, Aug. 10, 2004; Amdt. 192–94, 69 FR 54592, Sept. 9, 2004; 70 FR 3148, Jan. 21, 2005; 70 FR 11139, Mar. 8, 2005; Amdt. 192–112, 74 FR 63326, Dec. 3, 2009; Amdt. 192–114, 75 FR 48601, Aug. 11, 2010], 495419=[Amdt. 192–88, 64 FR 69665, Dec. 14, 1999], 325227=[Amdt. 192–30, 42 FR 60148, Nov. 25, 1977, as amended by Amdt. 192–102, 71 FR 13303, Mar. 15, 2006], 494449=[Amdt. 192–114, 75 FR 48604, Aug. 11, 2010], 248764=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–37, 46 FR 10159, Feb. 2, 1981; Amdt. 192–78, 61 FR 28784, June 6, 1996; Amdt. 192–85, 63 FR 37503, July 13, 1998; Amdt. 192–94, 69 FR 32895, June 14, 2004], 528649=(h) After December 16, 2004, provide training, as appropriate, to ensure that individuals performing covered tasks have the necessary knowledge and skills to perform the tasks in a manner that ensures the safe operation of pipeline facilities; and, 514288=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–43, 47 FR 46851, Oct. 21, 1982; Amdt. 192–93, 68 FR 53901, Sept. 15, 2003; Amdt. 192–96, 69 FR 27863, May 17, 2004], 403458=[Amdt. 192–63A, 54 FR 24174, June 6, 1989 as amended by Amdt. 192–78, 61 FR 28785, June 6, 1996; Amdt. 192–94, 69 FR 32895, June 14, 2004; 73 FR 62177, Oct. 17, 2008], 268635=(d) Pipe or fittings manufactured before July 1, 1980, may be used in accordance with procedures that the manufacturer certifies will produce a joint as strong as the pipe., 178277=(e) The design pressure for thermoplastic pipe produced after July 14, 2004 may exceed a gauge pressure of 100 psig (689 kPa) provided that:, 228293=[Amdt. 192–114, 75 FR 48603, Aug. 11, 2010], 346834=[72 FR 20059, Apr. 23, 2007], 260348=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–62, 54 FR 5628, Feb. 6, 1989], 527091=[Amdt. 192–86, 64 FR 46865, Aug. 27, 1999, as amended by Amdt. 192–90, 66 FR 43523, Aug. 20, 2001], 280171=[Amdt. No. 192–26, 41 FR 26018, June 24, 1976, as amended by Amdt. 192–29, 42 FR 42866, Aug. 25, 1977; Amdt. 192–29, 42 FR 60148, Nov. 25, 1977; Amdt. 192–49, 50 FR 13225, Apr. 3, 1985; Amdt. 192–85, 63 FR 37503, July 13, 1998], 379280=(c) After complying with paragraph (b) of this section, an operator may increase the maximum allowable operating pressure of a segment of pipeline constructed before September 12, 1970, to the highest pressure that is permitted under §192.619, using as test pressure the highest pressure to which the segment of pipeline was previously subjected (either in a strength test or in actual operation)., 605078=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 18233, Apr. 6, 2004; Amdt. 192–95, 69 FR 29904, May 26, 2004; Amdt. 192–114, 75 FR 48604, Aug. 11, 2010], 620488=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 18234, Apr. 6, 2004], 576352=(iv) Criteria that describe how and on what basis an operator will reclassify and reprioritize any of the provisions that are specified in section 5.9 of NACE SP0502–2008., 243727=(a) Welding must be performed by a qualified welder in accordance with welding procedures qualified under section 5 of API 1104 (incorporated by reference, see §192.7) or section IX of the ASME Boiler and Pressure Vessel Code “ Welding and Brazing Qualifications” (incorporated by reference, see §192.7) to produce welds meeting the requirements of this subpart. The quality of the test welds used to qualify welding procedures shall be determined by destructive testing in accordance with the applicable welding standard(s)., 282936=[Amdt. 192–27, 41 FR 34606, Aug. 16, 1976, as amended by Amdt. 192–78, 61 FR 28784, June 6, 1996], 272478=[Amdt. 192–34, 44 FR 42974, July 23, 1979], 651443=III. Steel pipe manufactured before November 12, 1970, to earlier editions of listed specifications. Steel pipe manufactured before November 12, 1970, in accordance with a specification of which a later edition is listed in section I of this appendix, is qualified for use under this part if the following requirements are met:, 570971=(1) ASME/ANSI B31.8S (incorporated by reference, see §192.7), section 6.4; NACE SP0502–2008 (incorporated by reference, see §192.7); and §192.925 if addressing external corrosion (ECDA)., 567704=(d) Time period. An operator must prioritize all the covered segments for assessment in accordance with §192.917 (c) and paragraph (b) of this section. An operator must assess at least 50% of the covered segments beginning with the highest risk segments, by December 17, 2007. An operator must complete the baseline assessment of all covered segments by December 17, 2012., 300281=[72 FR 62176, Oct. 17, 2008], 628989=Source:   74 FR 63934, Dec. 4, 2009, unless otherwise noted., 277821=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–1, 35 FR 17660, Nov. 17, 1970; Amdt. 192–85, 63 FR 37503, July 13, 1998; Amdt. 192–88, 64 FR 69664, Dec. 14, 1999], 363845=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–58, 53 FR 1635, Jan. 21, 1988; Amdt. 192–60, 53 FR 36029, Sept. 16, 1988; Amdt. 192–60A, 54 FR 5485, Feb. 3, 1989], 111851=(2) If a regulated onshore gathering line existing on April 14, 2006 was not previously subject to this part, an operator has until the date stated in the second column to comply with the applicable requirement for the line listed in the first column, unless the Administrator finds a later deadline is justified in a particular case:, 369661=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–58, 53 FR 1635, Jan. 21, 1988; Amdt. 192–85, 63 FR 37504, July 13, 1998], 466787=[35 FR 13257, Aug. 19, 1970, as amended by Amdt 192–85, 63 FR 37504, July 13, 1998], 627276=(a) Sending the notification to the Office of Pipeline Safety, Pipeline and Hazardous Materials Safety Administration, U.S. Department of Transportation, Information Resources Manager, PHP–10, 1200 New Jersey Avenue, SE., Washington, DC 20590-0001;, 464837=[73 FR 62177, Oct. 17, 2008, as amended by Amdt. 192–111, 74 FR 62505, Nov. 30, 2009], 372497=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–77, 61 FR 27793, June 3, 1996; 61 FR 45905, Aug. 30, 1996; Amdt. 192–85, 63 FR 37504, July 13, 1998], 130250=(d) Steel pipe that has not been previously used may be used as replacement pipe in a segment of pipeline if it has been manufactured prior to November 12, 1970, in accordance with the same specification as the pipe used in constructing that segment of pipeline., 85154=F. National Fire Protection Association (NFPA), 1 Batterymarch Park, P.O. Box 9101, Quincy, MA 02269–9101., 326390=(a) Except as provided in paragraphs (b), (c), and (f) of this section, each buried or submerged pipeline installed after July 31, 1971, must be protected against external corrosion, including the following:, 183685=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–62, 54 FR 5628, Feb. 6, 1989; Amdt. 192–85, 63 FR 37502, July 13, 1998], 577282=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 29904, May 26, 2004; Amdt. 192–114, 75 FR 48604, Aug. 11, 2010], 322028=[Amdt. 192–113, 74 FR 63934, Dec. 4, 2009, as amended at 75 FR 5244, Feb. 2, 2010; 76 FR 5499, Feb. 1, 2011], 82041=[Amdt. 192–78, 61 FR 28783, June 6, 1996; 61 FR 35139, July 5, 1996, as amended by Amdt. 192–85, 63 FR 37502, July 13, 1998], 65779=Source:   35 FR 13257, Aug. 19, 1970, unless otherwise noted., 329769=§ 192.457   External corrosion control: Buried or submerged pipelines installed before August 1, 1971., 605644=(a) General. After completing the baseline integrity assessment of a covered segment, an operator must continue to assess the line pipe of that segment at the intervals specified in §192.939 and periodically evaluate the integrity of each covered pipeline segment as provided in paragraph (b) of this section. An operator must reassess a covered segment on which a prior assessment is credited as a baseline under §192.921(e) by no later than December 17, 2009. An operator must reassess a covered segment on which a baseline assessment is conducted during the baseline period specified in §192.921(d) by no later than seven years after the baseline assessment of that covered segment unless the evaluation under paragraph (b) of this section indicates earlier reassessment., 263894=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–34, 44 FR 42973, July 23, 1979; Amdt. 192–58, 53 FR 1635, Jan. 21, 1988; Amdt. 192–61, 53 FR 36793, Sept. 22, 1988; 58 FR 14521, Mar. 18, 1993; Amdt. 192–78, 61 FR 28784, June 6, 1996; Amdt. 192–114, 75 FR 48603, Aug. 11, 2010], 626752=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 18234, Apr. 6, 2004], 631571=General. This subpart prescribes minimum requirements for an IM program for any gas distribution pipeline covered under this part, including liquefied petroleum gas systems. A gas distribution operator, other than a master meter operator or a small LPG operator, must follow the requirements in §§192.1005–192.1013 of this subpart. A master meter operator or small LPG operator of a gas distribution pipeline must follow the requirements in §192.1015 of this subpart., 323665=(a) Converted pipelines. Notwithstanding the date the pipeline was installed or any earlier deadlines for compliance, each pipeline which qualifies for use under this part in accordance with §192.14 must meet the requirements of this subpart specifically applicable to pipelines installed before August 1, 1971, and all other applicable requirements within 1 year after the pipeline is readied for service. However, the requirements of this subpart specifically applicable to pipelines installed after July 31, 1971, apply if the pipeline substantially meets those requirements before it is readied for service or it is a segment which is replaced, relocated, or substantially altered., 143237=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–85, 63 FR 37502, July 13, 1998], 586583=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 18232, Apr. 6, 2004], 571749=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–114, 75 FR 48604, Aug. 11, 2010], 499647=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–54, 51 FR 41635, Nov. 18, 1986], 191061=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–62, 54 FR 5628, Feb. 6, 1989; 58 FR 14521, Mar. 18, 1993], 468320=(b) After December 31, 1976, a combustible gas in a transmission line in a Class 3 or Class 4 location must comply with the requirements of paragraph (a) of this section unless:, 242534=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–78, 61 FR 28784, June 6, 1996; Amdt. 192–85, 63 FR 37503, July 13, 1998], 397201=[Amdt. 192–71, 59 FR 6584, Feb. 11, 1994, as amended by Amdt. 192–71A, 60 FR 14381, Mar. 17, 1995; Amdt. 192–93, 68 FR 53901, Sept. 15, 2003; Amdt. 192–112, 74 FR 63327, Dec. 3, 2009], 368522=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–58, 53 FR 1635, Jan. 21, 1988; Amdt. 192–85, 63 FR 37504, July 13, 1998], 632495=No later than August 2, 2011 a gas distribution operator must develop and implement an integrity management program that includes a written integrity management plan as specified in §192.1007., 331149=[Amdt. 192–4, 36 FR 12302, June 30, 1971, as amended by Amdt. 192–33, 43 FR 39390, Sept. 5, 1978; Amdt. 192–93, 68 FR 53900, Sept. 15, 2003], 140110=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–47, 49 FR 7569, Mar. 1, 1984; Amdt. 192–85, 63 FR 37502, July 13, 1998], 126524=[Amdt. 192–74, 60 FR 41828, Aug. 14, 1995, as amended by Amdt. 192–74A, 60 FR 63451, Dec. 11, 1995; Amdt. 192–83, 63 FR 7723, Feb. 17, 1998], 136823=[Amdt. 192–114, 75 FR 48603, Aug. 11, 2010], 314419=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–85, 63 FR 37503, July 13, 1998], 496938=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–85, 63 FR 37504, July 13, 1998], 195395=[Amdt. 192–72, 59 FR 17281, Apr. 12, 1994, as amended by Amdt. 192–85, 63 FR 37502, July 13, 1998; Amdt. 192–97, 69 FR 36029, June 28, 2004], 114874=Operators of transportation pipelines on the Outer Continental Shelf (as defined in the Outer Continental Shelf Lands Act; 43 U.S.C. 1331) must identify on all their respective pipelines the specific points at which operating responsibility transfers to a producing operator. For those instances in which the transfer points are not identifiable by a durable marking, each operator will have until September 15, 1998 to identify the transfer points. If it is not practicable to durably mark a transfer point and the transfer point is located above water, the operator must depict the transfer point on a schematic located near the transfer point. If a transfer point is located subsea, then the operator must identify the transfer point on a schematic which must be maintained at the nearest upstream facility and provided to PHMSA upon request. For those cases in which adjoining operators have not agreed on a transfer point by September 15, 1998 the Regional Director and the MMS Regional Supervisor will make a joint determination of the transfer point., 500830=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–43, 47 FR 46851, Oct. 21, 1982; Amdt. 192–78, 61 FR 28786, June 6, 1996], 601883=(iv) Monitoring of excavations conducted on covered pipeline segments by pipeline personnel. If an operator finds physical evidence of encroachment involving excavation that the operator did not monitor near a covered segment, an operator must either excavate the area near the encroachment or conduct an above ground survey using methods defined in NACE SP0502–2008 (incorporated by reference, see §192.7). An operator must excavate, and remediate, in accordance with ANSI/ASME B31.8S and §192.933 any indication of coating holidays or discontinuity warranting direct examination., 175241=[Amdt. 192–111, 74 FR 62505, Nov. 30, 2009, as amended by Amdt. 192–114, 75 FR 48603, Aug. 11, 2010], 245893=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–43, 47 FR 46851, Oct. 21, 1982; Amdt. 192–52, 51 FR 20297, June 4, 1986; Amdt. 192–78, 61 FR 28784, June 6, 1996; Amdt. 192–94, 69 FR 32894, June 14, 2004; Amdt. 192–103, 72 FR 4656, Feb. 1, 2007], 360060=[Amdt. 192–78, 61 FR 28785, June 6, 1996], 417290=(b) The operator's program must follow the general program recommendations of API RP 1162 and assess the unique attributes and characteristics of the operator's pipeline and facilities., 342718=[Amdt. 192–4, 36 FR 12302, June 30, 1971, as amended by Amdt. 192–33, 43 FR 39390, Sept. 5, 1978], 218345=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–58, 53 FR 1635, Jan. 21, 1988; Amdt 192–62, 54 FR 5628, Feb. 6, 1989; 58 FR 14521, Mar. 18, 1993; Amdt. 192–85, 63 FR 37503, July 13, 1998], 510577=(a) Not later than September 16, 1996, each compressor building in a compressor station must have a fixed gas detection and alarm system, unless the building is—, 524086=[Amdt. 192–23, 41 FR 13589, Mar. 31, 1976], 588685=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 18233, Apr. 6, 2004], 303721=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–58, 53 FR 1635, Jan. 21, 1988], 508087=[Amdt. 192–8, 37 FR 20695, Oct. 3, 1972, as amended by Amdt. 192–27, 41 FR 34607, Aug. 16, 1976; Amdt. 192–71, 59 FR 6585, Feb. 11, 1994; Amdt. 192–89, 65 FR 54443, Sept. 8, 2000; 65 FR 57861, Sept. 26, 2000; 70 FR 11139, Mar. 8, 2005; Amdt. 192–103, 72 FR 4656, Feb. 1, 2007; 73 FR 16570, Mar. 28, 2008; 74 FR 2894, Jan. 16, 2009], 487637=[Amdt. 192–21, 40 FR 20283, May 9, 1975, as amended by Amdt. 192–43, 47 FR 46851, Oct. 21, 1982; Amdt. 192–78, 61 FR 28786, June 6, 1996], 75076=Petroleum gas means propane, propylene, butane, (normal butane or isobutanes), and butylene (including isomers), or mixtures composed predominantly of these gases, having a vapor pressure not exceeding 208 psi (1434 kPa) gage at 100 °F (38 °C)., 323130=[Amdt. 192–4, 36 FR 12302, June 30, 1971, as amended by Amdt. 192–27, 41 FR 34606, Aug. 16, 1976; Amdt. 192–33, 43 FR 39389, Sept. 5, 1978], 471104=[35 FR 13257, Aug. 19, 1970], 405393=(3) Within 6 months after discovery, or not later than November 1 of the following year if the 6 month period is later than November 1 of the year of discovery, bury the pipeline so that the top of the pipe is 36 inches (914 millimeters) below the underwater natural bottom (as determined by recognized and generally accepted practices) for normal excavation or 18 inches (457 millimeters) for rock excavation., 598975=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 18233, Apr. 6, 2004; Amdt. 192–104, 72 FR 39016, July 17, 2007], 531010=(b) Operators must complete the qualification of individuals performing covered tasks by October 28, 2002., 341031=[Amdt. 192–27, 41 FR 34606, Aug. 16, 1976], 522562=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–25, 41 FR 23680, June 11, 1976; Amdt. 192–85, 63 FR 37504, July 13, 1998; Amdt. 192–93, 68 FR 53901, Sept. 15, 2003], 563082=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 18231, Apr. 6, 2004], 284716=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–27, 41 FR 34606, Aug. 16, 1976; Amdt. 192–78, 61 FR 28784, June 6, 1996; Amdt. 192–85, 63 FR 37503, July 13, 1998], 129313=(ii) If it was manufactured before November 12, 1970, either section II or III of appendix B to this part;, 164456=[73 FR 62175, Oct. 17, 2008, as amended by Amdt. 192–111, 74 FR 62505, Nov. 30, 2009], 69042=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–27, 41 FR 34605, Aug. 16, 1976; Amdt. 192–67, 56 FR 63771, Dec. 5, 1991; Amdt. 192–78, 61 FR 28782, June 6, 1996; Amdt. 192–81, 62 FR 61695, Nov. 19, 1997; Amdt. 192–92, 68 FR 46112, Aug. 5, 2003; 70 FR 11139, Mar. 8, 2005; Amdt. 192–102, 71 FR 13301, Mar. 15, 2006; Amdt. 192–103, 72 FR 4656, Feb. 1, 2007], 416888=(a) Except for an operator of a master meter or petroleum gas system covered under paragraph (j) of this section, each pipeline operator must develop and implement a written continuing public education program that follows the guidance provided in the American Petroleum Institute's (API) Recommended Practice (RP) 1162 (incorporated by reference, see §192.7)., 476075=(1) Implement sections 1, 4, 8, 9, 11.1, and 11.3 of API RP 1165 (incorporated by reference, see §192.7) whenever a SCADA system is added, expanded or replaced, unless the operator demonstrates that certain provisions of sections 1, 4, 8, 9, 11.1, and 11.3 of API RP 1165 are not practical for the SCADA system used;, 271673=[Amdt. 192–34A, 45 FR 9935, Feb. 14, 1980, as amended by Amdt. 192–34B, 46 FR 39, Jan. 2, 1981; Amdt. 192–93, 68 FR 53900, Sept. 15, 2003], 114139=(3) If, after April 14, 2006, a change in class location or increase in dwelling density causes an onshore gathering line to be a regulated onshore gathering line, the operator has 1 year for Type B lines and 2 years for Type A lines after the line becomes a regulated onshore gathering line to comply with this section., 325022=(2) The requirements of this subpart specifically applicable to pipelines installed after July 31, 1971, apply only if the pipeline substantially meets those requirements., 473798=(2) The procedures required by this section must be integrated, as appropriate, with operating and emergency procedures required by §§192.605 and 192.615. An operator must develop the procedures no later than August 1, 2011, and must implement the procedures according to the following schedule. The procedures required by paragraphs (b), (c)(5), (d)(2) and (d)(3), (f) and (g) of this section must be implemented no later than October 1, 2011. The procedures required by paragraphs (c)(1) through (4), (d)(1), (d)(4), and (e) must be implemented no later than August 1, 2012. The training procedures required by paragraph (h) must be implemented no later than August 1, 2012, except that any training required by another paragraph of this section must be implemented no later than the deadline for that paragraph., 123070=May not means “is not permitted to” or “is not authorized to”., 287701=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–78, 61 FR 28784, June 6, 1996; Amdt. 192–85, 63 FR 37503, July 13, 1998; Amdt. 192–93, 68 FR 53900, Sept. 15, 2003; Amdt. 192–94, 69 FR 32895, June 14, 2004], 325954=[Amdt. 192–71, 59 FR 6584, Feb. 11, 1994], 179095=(1) The design pressure does not exceed 200 psig (1379 kPa);, 531456=(e) After December 16, 2004, observation of on-the-job performance may not be used as the sole method of evaluation., 65909=Editorial Note:   Nomenclature changes to part 192 appear at 71 FR 33406, June 9, 2006., 294973=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–27, 41 FR 34606, Aug. 16, 1976; Amdt. 192–78, 61 FR 28785, June 6, 1996; Amdt. 192–85, 63 FR 37503, July 13, 1998; Amdt. 192–98, 69 FR 48406, Aug. 10, 2004], 653705=[35 FR 13257, Aug. 19, 1970], 85290=G. Plastics Pipe Institute, Inc. (PPI), 1825 Connecticut Avenue, NW., Suite 680, Washington, DC 20009., 545400=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 18231, Apr. 6, 2004], 330627=(b) Except for cast iron or ductile iron, each of the following buried or submerged pipelines installed before August 1, 1971, must be cathodically protected in accordance with this subpart in areas in which active corrosion is found:, 573296=(1) Preassessment. In addition to the requirements in ASME/ANSI B31.8S section 6.4 and NACE SP0502–2008, section 3, the plan's procedures for preassessment must include—, 617356=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 18234, Apr. 6, 2004; 192–114, 75 FR 48604, Aug. 11, 2010], 353725=[Amdt. 192–4, 36 FR 12302, June 30, 1971, as amended by Amdt. 192–33, 43 FR 39390, Sept. 5, 1978; Amdt. 192–78, 61 FR 28785, June 6, 1996; Amdt. 192–88, 64 FR 69664, Dec. 14, 1999], 412473=[Amdt. 192–40, 47 FR 13824, Apr. 1, 1982, as amended by Amdt. 192–57, 52 FR 32800, Aug. 31, 1987; Amdt. 192–73, 60 FR 14650, Mar. 20, 1995; Amdt. 192–78, 61 FR 28785, June 6, 1996; Amdt.192–82, 62 FR 61699, Nov. 19, 1997; Amdt. 192–84, 63 FR 38758, July 20, 1998], 141668=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–78, 61 FR 28783, June 6, 1996; Amdt. 192–83, 63 FR 7723, Feb. 17, 1998; Amdt. 192–85, 63 FR 37502, July 13, 1998], 215487=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–85, 63 FR 37503, July 13, 1998], 345903=(2) Pipeline installed or line pipe, valve, fitting or other line component replaced before May 23, 2007., 220903=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–27, 41 FR 34606, Aug. 16, 1976; Amdt. 192–78, 61 FR 28784, June 6, 1996; Amdt. 192–85, 63 FR 37503, July 13, 1998], 135849=(2) In the case of pipe transported before November 12, 1970, the pipe is tested in accordance with Subpart J of this Part to at least 1.25 times the maximum allowable operating pressure if it is to be installed in a class 1 location and to at least 1.5 times the maximum allowable operating pressure if it is to be installed in a class 2, 3, or 4 location. Notwithstanding any shorter time period permitted under Subpart J of this Part, the test pressure must be maintained for at least 8 hours., 517235=[Amdt. 192–93, 68 FR 53901, Sept. 15, 2003, as amended by Amdt. 192–96, 69 FR 27863, May 17, 2004], 639676=[76 FR 5499, Feb. 1, 2011], 265481=(iii) In the case of electrofusion fittings for polyethylene (PE) pipe and tubing, paragraph 9.1 (Minimum Hydraulic Burst Pressure Test), paragraph 9.2 (Sustained Pressure Test), paragraph 9.3 (Tensile Strength Test), or paragraph 9.4 (Joint Integrity Tests) of ASTM Designation F1055 (incorporated by reference, see §192.7)., 173701=S = For thermoplastic pipe, the HDB is determined in accordance with the listed specification at a temperature equal to 73 °F (23 °C), 100 °F (38 °C), 120 °F (49 °C), or 140 °F (60 °C). In the absence of an HDB established at the specified temperature, the HDB of a higher temperature may be used in determining a design pressure rating at the specified temperature by arithmetic interpolation using the procedure in Part D.2 of PPI TR–3/2008, HDB/PDB/SDB/MRS Policies (incorporated by reference, see §192.7). For reinforced thermosetting plastic pipe, 11,000 psig (75,842 kPa). [Note: Arithmetic interpolation is not allowed for PA–11 pipe.], 308721=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–75, 61 FR 18517, Apr. 26, 1996; Amdt. 192–85, 63 FR 37503, July 13, 1998; Amdt. 192–93, 68 FR 53900, Sept. 15, 2003], 591179=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–114, 75 FR 48604, Aug. 11, 2010], 419180=(h) Operators in existence on June 20, 2005, must have completed their written programs no later than June 20, 2006. The operator of a master meter or petroleum gas system covered under paragraph (j) of this section must complete development of its written procedure by June 13, 2008. Upon request, operators must submit their completed programs to PHMSA or, in the case of an intrastate pipeline facility operator, the appropriate State agency., 203870=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–58, 53 FR 1635, Jan. 21, 1988], 528926=(i) After December 16, 2004, notify the Administrator or a state agency participating under 49 U.S.C. Chapter 601 if the operator significantly modifies the program after the Administrator or state agency has verified that it complies with this section., 227550=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–76, 61 FR 26122, May 24, 1996], 377868=[35 FR 13257, Aug. 10, 1970, as amended by Amdt. 192–78, 61 FR 28785, June 6, 1996; Amdt. 192–93, 68 FR 53901, Sept. 15, 2003], 281590=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–85, 63 FR 37503, July 13, 1998], 239729=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–9, 37 FR 20827, Oct. 4, 1972; Amdt 192–85, 63 FR 37503, July 13, 1998], 574088=(2) Indirect examination. In addition to the requirements in ASME/ANSI B31.8S section 6.4 and NACE SP0502–2008, section 4, the plan's procedures for indirect examination of the ECDA regions must include—, 429618=[35 FR 13257, Aug. 19, 1970], 178536=(2) The material is a PE2406 or a PE3408 as specified within ASTM D2513–99 (incorporated by reference, see §192.7);, 624223=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 18234, Apr. 6, 2004; 75 FR 72906, Nov. 26, 2010], 114493=[Amdt. 192–102, 71 FR 13301, Mar. 15, 2006], 109120=[Amdt. 192–102, 71 FR 13302, Mar. 15, 2006], 628583=[Amdt. No. 192—115, 75 FR 72906, Nov. 26, 2010], 433463=1For Class 2 alternative maximum allowable operating pressure segments installed prior to December 22, 2008 the alternative test factor is 1.25., 338209=[Amdt. 192–4, 36 FR 12302, June 30, 1971, as amended by Amdt. 192–33, 43 FR 39390, Sept. 5, 1978; Amdt. 192–35A, 45 FR 23441, Apr. 7, 1980; Amdt. 192–85, 63 FR 37504, July 13, 1998; Amdt. 192–93, 68 FR 53900, Sept. 15, 2003; Amdt. 192–114, 75 FR 48603, Aug. 11, 2010], 324392=(b) Regulated onshore gathering lines. For any regulated onshore gathering line under §192.9 existing on April 14, 2006, that was not previously subject to this part, and for any onshore gathering line that becomes a regulated onshore gathering line under §192.9 after April 14, 2006, because of a change in class location or increase in dwelling density:, 122983=May means “is permitted to” or “is authorized to”., 223684=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–85, 63 FR 37503, July 13, 1998], 355203=[Amdt. 192–4, 36 FR 12302, June 30, 1971, as amended by Amdt. 192–88, 64 FR 69665, Dec. 14, 1999], 211064=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–27, 41 FR 34605, Aug. 16, 1976; Amdt. 192–85, 63 FR 37503, July 13, 1998], 490223=(3) Transmission lines in Class 3 or 4 locations until March 20, 1996., 82795=(b) All incorporated materials are available for inspection in the Office of Pipeline Safety, Pipeline and Hazardous Materials Safety Administration, 1200 New Jersey Avenue, SE., Washington, DC, 20590–0001, 202–366–4595, or at the National Archives and Records Administration (NARA). For information on the availability of this material at NARA, call 202–741–6030 or go to: http://www.archives.gov/federal_register/code_of_federal_regulations/ibr_locations.html. These materials have been approved for incorporation by reference by the Director of the Federal Register in accordance with 5 U.S.C. 552(a) and 1 CFR part 51. In addition, the incorporated materials are available from the respective organizations listed in paragraph (c) (1) of this section., 417505=(c) The operator must follow the general program recommendations, including baseline and supplemental requirements of API RP 1162, unless the operator provides justification in its program or procedural manual as to why compliance with all or certain provisions of the recommended practice is not practicable and not necessary for safety., 656672=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–85, 63 FR 37504, July 13, 1998; Amdt. 192–94, 69 FR 32896, June 14, 2004], 416425=[Amdt. 192–24, 41 FR 13587, Mar. 31, 1976, as amended by Amdt. 192–71, 59 FR 6585, Feb. 11, 1994; Amdt. 192–112, 74 FR 63327, Dec. 3, 2009], 261030=[Amdt. 192–62, 54 FR 5628, Feb. 6, 1989, as amended at 58 FR 14521, Mar. 18, 1993], 532100=Source:   68 FR 69817, Dec. 15, 2003, unless otherwise noted., 573651=(ii) The basis on which an operator selects at least two different, but complementary indirect assessment tools to assess each ECDA Region. If an operator utilizes an indirect inspection method that is not discussed in Appendix A of NACE SP0502–2008, the operator must demonstrate the applicability, validation basis, equipment used, application procedure, and utilization of data for the inspection method., 116954=[Amdt. 192–78, 61 FR 28783, June 6, 1996], 531146=(c) Work performance history review may be used as a sole evaluation method for individuals who were performing a covered task prior to October 26, 1999., 313484=[Amdt. 192–1, 35 FR 17660, Nov. 17, 1970, as amended by Amdt. 192–85, 63 FR 37503, July 13, 1998], 648397=B. Weldability. A girth weld must be made in the pipe by a welder who is qualified under subpart E of this part. The weld must be made under the most severe conditions under which welding will be allowed in the field and by means of the same procedure that will be used in the field. On pipe more than 4 inches (102 millimeters) in diameter, at least one test weld must be made for each 100 lengths of pipe. On pipe 4 inches (102 millimeters) or less in diameter, at least one test weld must be made for each 400 lengths of pipe. The weld must be tested in accordance with API Standard 1104 (incorporated by reference, see §192.7). If the requirements of API Standard 1104 cannot be met, weldability may be established by making chemical tests for carbon and manganese, and proceeding in accordance with section IX of the ASME Boiler and Pressure Vessel Code (ibr, see 192.7). The same number of chemical tests must be made as are required for testing a girth weld., 244515=[Amdt. 192–52, 51 FR 20297, June 4, 1986; Amdt. 192–94, 69 FR 32894, June 14, 2004], 425621=1For offshore segments installed, uprated or converted after July 31, 1977, that are not located on an offshore platform, the factor is 1.25. For segments installed, uprated or converted after July 31, 1977, that are located on an offshore platform or on a platform in inland navigable waters, including a pipe riser, the factor is 1.5., 197068=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–85, 63 FR 37502, July 13, 1998], 227976=(a) Thermosetting fittings for plastic pipe must conform to ASTM D 2517, (incorporated by reference, see §192.7)., 536043=(4) If in identifying a high consequence area under paragraph (1)(iii) of this definition or paragraph (2)(i) of this definition, the radius of the potential impact circle is greater than 660 feet (200 meters), the operator may identify a high consequence area based on a prorated number of buildings intended for human occupancy with a distance of 660 feet (200 meters) from the centerline of the pipeline until December 17, 2006. If an operator chooses this approach, the operator must prorate the number of buildings intended for human occupancy based on the ratio of an area with a radius of 660 feet (200 meters) to the area of the potential impact circle (i.e., the prorated number of buildings intended for human occupancy is equal to 20 × (660 feet) [or 200 meters]/potential impact radius in feet [or meters]2 )., 665466=[Amdt. 192–95, 69 FR 18234, Apr. 6, 2004, as amended by Amdt. 192–95, May 26, 2004], 437816=(ii) For a pipeline segment in existence prior to December 22, 2008, certify, under paragraph (c)(2) of this section, that the strength test performed under §192.505 was conducted at test pressure calculated under paragraph (a) of this section, or conduct a new strength test in accordance with paragraph (c)(4)(i) of this section., 305266=(b) Each newly installed meter manufactured after November 12, 1970, must have been tested to a minimum of 10 p.s.i. (69 kPa) gage., 506229=(1) The preferred method to submit data on pipeline facilities abandoned after October 10, 2000 is to the National Pipeline Mapping System (NPMS) in accordance with the NPMS “Standards for Pipeline and Liquefied Natural Gas Operator Submissions.” To obtain a copy of the NPMS Standards, please refer to the NPMS homepage at http://www.npms.phmsa.dot.gov or contact the NPMS National Repository at 703–317–3073. A digital data format is preferred, but hard copy submissions are acceptable if they comply with the NPMS Standards. In addition to the NPMS-required attributes, operators must submit the date of abandonment, diameter, method of abandonment, and certification that, to the best of the operator's knowledge, all of the reasonably available information requested was provided and, to the best of the operator's knowledge, the abandonment was completed in accordance with applicable laws. Refer to the NPMS Standards for details in preparing your data for submission. The NPMS Standards also include details of how to submit data. Alternatively, operators may submit reports by mail, fax or e-mail to the Office of Pipeline Safety, Pipeline and Hazardous Materials Safety Administration, U.S. Department of Transportation, Information Resources Manager, PHP–10, 1200 New Jersey Avenue, SE., Washington, DC 20590-0001; fax (202) 366–4566; e-mail InformationResourcesManager@phmsa., 366865=[35 FR 13257, Aug. 19, 1970, as amended by Amdt. 192–85, 63 FR 37504, July 13, 1998; Amdt. 192–94, 69 FR 32895, June 14, 2004; Amdt. 195–94, 69 FR 54592, Sept. 9, 2004], 531606=[Amdt. 192–86, 64 FR 46865, Aug. 27, 1999, as amended by Amdt. 192–90, 66 FR 43524, Aug. 20, 2001; Amdt. 192–100, 70 FR 10335, Mar. 3, 2005], 511736=[58 FR 48464, Sept. 16, 1993, as amended by Amdt. 192–85, 63 FR 37504, July 13, 1998], 642108=(a) General. No later than August 2, 2011 the operator of a master meter system or a small LPG operator must develop and implement an IM program that includes a written IM plan as specified in paragraph (b) of this section. The IM program for these pipelines should reflect the relative simplicity of these types of pipelines., 330017=(a) Except for buried piping at compressor, regulator, and measuring stations, each buried or submerged transmission line installed before August 1, 1971, that has an effective external coating must be cathodically protected along the entire area that is effectively coated, in accordance with this subpart. For the purposes of this subpart, a pipeline does not have an effective external coating if its cathodic protection current requirements are substantially the same as if it were bare. The operator shall make tests to determine the cathodic protection current requirements., 576553=(4) Post assessment and continuing evaluation. In addition to the requirements in ASME/ANSI B31.8S section 6.4 and NACE SP0502–2008, section 6, the plan's procedures for post assessment of the effectiveness of the ECDA process must include—, 622703=[68 FR 69817, Dec. 15, 2003, as amended by Amdt. 192–95, 69 FR 18234, Apr. 6, 2004], 85422=H. NACE International (NACE), 1440 South Creek Drive, Houston, TX 77084., 268841=[Amdt. 192–34A, 45 FR 9935, Feb. 14, 1980, as amended by Amdt. 192–34B, 46 FR 39, Jan. 2, 1981; 47 FR 32720, July 29, 1982; 47 FR 49973, Nov. 4, 1982; 58 FR 14521, Mar. 18, 1993; Amdt. 192–78, 61 FR 28784, June 6, 1996; Amdt. 192–85, 63 FR 37503, July 13, 1998; Amdt. 192–94, 69 FR 32895, June 14, 2004; Amdt. 192–94, 69 FR 54592, Sept. 9, 2004; Amdt. 192–114, 75 FR 48603, Aug. 11, 2010], 538765=Note: 0.69 is the factor for natural gas. This number will vary for other gases depending upon their heat of combustion. An operator transporting gas other than natural gas must use section 3.2 of ASME/ANSI B31.8S–2001 (Supplement to ASME B31.8; incorporated by reference, see §192.7) to calculate the impact radius formula., 406226=[Amdt. 192–98, 69 FR 48406, Aug. 10, 2004]}",
    "textBeforeTable": "(a) Any documents or portions thereof incorporated by reference in this part are included in this part as though set out in full. When only a portion of a document is referenced, the remainder is not incorporated in this part. (b) All incorporated materials are available for inspection in the Office of Pipeline Safety, Pipeline and Hazardous Materials Safety Administration, 1200 New Jersey Avenue, SE., Washington, DC, 20590–0001, 202–366–4595, or at the National Archives and Records Administration (NARA). For information on the availability of this material at NARA, call 202–741–6030 or go to: http://www.archives.gov/federal_register/code_of_federal_regulations/ibr_locations.html. These materials have been approved for incorporation by reference by the Director of the Federal Register in accordance with 5 U.S.C. 552(a) and 1 CFR part 51. In addition, the incorporated materials are available from the respective organizations listed in paragraph (c) (1) of this section. (c) The full titles of documents incorporated by reference, in whole or in part, are provided herein. The numbers in parentheses indicate applicable editions. For each incorporated document, citations of all affected sections are provided. Earlier editions of currently listed documents or editions of documents listed in previous editions of 49 CFR part 192 may be used for materials and components designed, manufactured, or installed in accordance with these earlier documents at the time they were listed. The user must refer to the appropriate previous edition of 49 CFR part 192 for a listing of the",
    "textAfterTable": "Requirement Compliance deadline Control corrosion according to Subpart I requirements for transmission lines April 15, 2009. Carry out a damage prevention program under §192.614 October 15, 2007. Establish MAOP under §192.619 October 15, 2007. Install and maintain line markers under §192.707 April 15, 2008. Establish a public education program under §192.616 April 15, 2008. Other provisions of this part as required by paragraph (c) of this section for Type A lines April 15, 2009. (3) If, after April 14, 2006, a change in class location or increase in dwelling density causes an onshore gathering line to be a regulated onshore gathering line, the operator has 1 year for Type B lines and 2 years for Type A lines after the line becomes a regulated onshore gathering line to comply with this section. [Amdt. 192–102, 71 FR 13301, Mar. 15, 2006] § 192.10   Outer continental shelf pipelines. Operators of transportation pipelines on the Outer Continental Shelf (as defined in the Outer Continental Shelf Lands Act; 43 U.S.C. 1331) must identify on all their respective pipelines the specific points at which operating responsibility transfers",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}