{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Item",
            "Sequence No.",
            "Docket No.",
            "FAR Case",
            "FAC"
        ],
        [
            "regulations.gov",
            "2015-01524",
            "9000-AM55",
            "I",
            "1",
            "2013-0001",
            "2013-001",
            "2005-80"
        ]
    ],
    "pageTitle": "48 CFR 2.101 - Definitions. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/48/2.101",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00109-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 918566863,
    "recordOffset": 918505482,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1033=Title 48 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{36843=§ 2323 - Contract goal for small disadvantaged businesses and certain institutions of higher education, 38677=§ 2335 - Prohibition on collection of political information, 15311=DoD, GSA, and NASA are issuing a final rule amending the Federal Acquisition Regulation (FAR) to strengthen protections against trafficking in persons in Federal contracts. These changes are intended to implement Executive Order (E.O.) 13627, entitled “Strengthening Protections Against Trafficking in Persons in Federal Contracts,” and title XVII of the National Defense Authorization Act for Fiscal Year 2013., 35621=§ 2313 - Examination of records of contractor, 35519=§ 2312 - Remission of liquidated damages, 35278=§ 2310 - Determinations and decisions, 38388=§ 2333 - Joint policies on requirements definition, contingency program management, and contingency contracting, 35072=§ 2308 - Buy-to-budget acquisition: end items, 36649=§ 2321 - Validation of proprietary data restrictions, 36168=§ 2316 - Disclosure of identity of contractor, 35377=§ 2311 - Assignment and delegation of procurement functions and responsibilities, 38798=§ 2336, 37229=§ 2324 - Allowable costs under defense contracts, 36451=§ 2319 - Encouragement of new competitors, 32795=§ 2302 - Definitions, 33521=§ 2304 - Contracts: competition requirements, 35981=§ 2315 - Law inapplicable to the procurement of automatic data processing equipment and services for certain defense purposes, 35845=§ 2314 - Laws inapplicable to agencies named in section 2303 of this title, 40032=Title 48 published on 2014-10-01, 34544=§ 2306 - Kinds of contracts, 34300=§ 2305 - Contracts: planning, solicitation, evaluation, and award procedures, 9806=DoD, GSA, and NASA are issuing corrections to FAR Case 2013-001; Ending Trafficking in Persons (Item I), which was published in the Federal Register at 80 FR 4967, January 29, 2015., 35179=§ 2309 - Allocation of appropriations, 33344=§ 2303 - Applicability of chapter, 38291=§ 2332 - Share-in-savings contracts, 55287=DoD, GSA, and NASA are proposing to amend the Federal Acquisition Regulation (FAR) to implement sections of the Small Business Jobs Act of 2010 and regulatory changes made by the Small Business Administration, which provide for a Governmentwide policy on the consolidation and bundling of contract requirements., 37822=§ 2329 - Repealed., 37339=§ 2325 - Restructuring costs, 37547=§ 2327 - Contracts: consideration of national security objectives, 81916=DoD, GSA, and NASA are proposing to amend the Federal Acquisition Regulation (FAR) to further implement the inflation adjustment of acquisition-related dollar thresholds. A statute requires an adjustment every five years of acquisition-related thresholds for inflation using the Consumer Price Index for all urban consumers, except for the Construction Wage Rate Requirements statute (Davis-Bacon Act), Service Contract Labor Standards statute, and trade agreements thresholds. DoD, GSA, and NASA are also proposing to use the same methodology to adjust nonstatutory FAR acquisition-related thresholds in 2015., 37902=§ 2330 - Procurement of contract services: management structure, 38561=§ 2334 - Independent cost estimation and cost analysis, 32639=§ 2301 - Repealed. Pub. L. 103–355 , title I , § 1501(a), Oct. 13, 1994, 108 Stat. 3296 ], 38146=§ 2331 - Procurement of services: contracts for professional and technical services, 38889=§ 2337 - Life-cycle management and product support, 36554=§ 2320 - Rights in technical data, 65256=DoD, GSA, and NASA are proposing to amend the Federal Acquisition Regulation (FAR) to implement Executive branch policy in the President's Climate Action Plan to procure, when feasible, alternatives to high global warming potential (GWP) hydrofluorocarbons (HFCs). This will allow agencies to better meet the greenhouse gas emission reduction goals and reporting requirements of the Executive Order (E.O.) 13693 of March 25, 2015, Planning for Sustainability in the Next Decade. E.O. 13693 subsumes both E.O. 13423 of January 24, 2007, Strengthening Federal Environmental, Energy, and Transportation Management as well as E.O. 13514 of October 5, 2009, Federal Leadership in Environmental, Energy, and Economic Performance., 34983=§ 2307 - Contract financing, 36763=§ 2322 - Repealed., 36355=§ 2318 - Advocates for competition, 37674=§ 2328 - Release of technical data under Freedom of Information Act: recovery of costs, 20631=DoD, GSA, and NASA are issuing a correction to FAR Case 2012-023; Uniform Procurement Identification (Item III), which was published in the Federal Register at 79 FR 61739, October 14, 2014., 36275=§ 2317 - Repealed., 37429=§ 2326 - Undefinitized contractual actions: restrictions}",
    "lastModified": "Thu, 23 Jul 2015 21:09:03 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 38293 - Federal Acquisition Regulation; Inflation Adjustment of Acquisition-Related Thresholds 2015-07-02; vol. 80 # 127 - Thursday, July 2, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 48. Title 48 published on 2014-10-01. www.fdsys.gov. 2.101, see the List of CFR Sections Affected, which appears in the Finding Aids section of the printed volume and at Federal Register citations affecting § For Editorial Note: 66 FR 2118, Jan. 10, 2001] [ written (see “in writing”). Writing or Women-owned small business (WOSB) concern eligible under the WOSB Program means a small business concern that is at least 51",
    "textAfterTable": "DEPARTMENT OF DEFENSE, GENERAL SERVICES ADMINISTRATION, NATIONAL AERONAUTICS AND SPACE ADMINISTRATION; 48 CFR Parts 1, 2, 3, 4, 6, 7, 8, 9, 10, 12, 13, 15, 16, 17, 19, 22, 25, 28, 30, 42, 50, 52, and 53, and National Aeronautics and Space Administration (NASA) Final rule. Effective: October 1, 2015. Summary DoD, GSA, and NASA are issuing this final rule amending the Federal Acquisition Regulation (FAR) to implement the inflation adjustment of acquisition-related dollar thresholds. A statute requires an adjustment every five years of acquisition-related thresholds for inflation using the Consumer Price Index for all urban consumers, except for the Construction Wage Rate Requirements statute (formerly Davis-Bacon Act), Service Contract Labor Standards statute, and trade agreements thresholds. DoD, GSA, and NASA have also used the same methodology to adjust nonstatutory FAR acquisition-related thresholds. 2015-02-09; vol. 80 # 26 - Monday, February 9, 2015 80 FR 6908 - Federal Acquisition Regulation; Ending Trafficking in Persons; Corrections GPO FDSys XML |",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}