{
    "relation": [
        [
            "Get there by",
            "Departing: East Midlands, North East, Scotland, Yorkshire",
            "Departing: North West, Scotland, West Midlands"
        ],
        [
            "Accommodation",
            "4 nights",
            "4 nights"
        ],
        [
            "Price Per Person",
            "from £159",
            "from £159"
        ],
        [
            "",
            "Check tour availability",
            "Check tour availability"
        ]
    ],
    "pageTitle": "Coach Holidays to Scotland | Short Breaks | Shearings Holidays",
    "title": "",
    "url": "http://www.shearings.com/holiday-offers/short-breaks-to-scotland",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00018-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 712164699,
    "recordOffset": 712113776,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1581=Invercauld Arms Hotel , Braemar, 1840=Join us in Braemar for a wonderful getaway. Explore Aberdeen with a superb excursion and enjoy fantastic entertainment with your fellow holiday-makers each evening.}",
    "TableContextTimeStampAfterTable": "{204109=Surrounded by wonderful wooded scenery the delightful village of Braemar is set between the Cairngorm and Grampian mountain ranges, and is perfect for a relaxing treat with the opportunity to explore local places of interest. On this break we visit the granite city of Aberdeen as well as Ballindalloch Castle – the ‘Pearl of the North’., 340496=Join us for the spectacular mix of music, pomp and ceremony of the 2015 Edinburgh Military Tattoo staying in Melrose in the heart of the Scottish Borders., 369698=Join us for the spectacular mix of music, pomp and ceremony of the 2015 Edinburgh Military Tattoo staying in Pitlochry in the heart of Highland Perthshire., 323671=Join us for the spectacular mix of music, pomp and ceremony of the 2015 Edinburgh Military Tattoo staying in Tarbet on the peaceful shores of Loch Lomond., 437990=The 2015 brochures are out NOW! Check out the brochures online. Or, if you prefer, simply enter your details and we’ll pop some in the post., 349155=Enjoy a superb New Year holiday at the Invercauld Arms Hotel in Braemar, with this excellent four-day break. Be treated to Bucks Fizz on arrival, a sumptuous five-course New Year’s Eve gala dinner and fantastic entertainment - there’s no better way to celebrate than with our New Year breaks, 88636=Join us in Braemar for a wonderful getaway. Explore Aberdeen and the Glenlivet Distillery on your included excursions and enjoy fantastic entertainment with your fellow holiday-makers each evening.}",
    "lastModified": "Fri, 31 Jul 2015 21:26:01 GMT",
    "textBeforeTable": "Half Board Board: Board Friday Departs Departures £109 per person. Saving £30 each. 4 days from only £109 per person. 0 out of 5 stars ( Be the first to review this holiday ) Our customers rate this holiday --> View Hotel",
    "textAfterTable": "Weekend Plus - Melrose & Edinburgh Christmas Market 4 days  Join us as we make our way to Melrose, known for the stunning ruins of Melrose Abbey, for a relaxing four-day getaway. We’ll enjoy a festive holiday, exploring picturesque Melrose at leisure, as well as visiting the historical city of Edinburgh. Discover its many sights, and explore the superb Christmas markets, with its huge range of stalls. Waverley Castle Hotel , Melrose Our customers rate this holiday 0 out of 5 stars ( Be the first to review this holiday ) 4 days from only £109 per person. £109 per person. Departures Departs Friday Board Board: Half Board Get there by Accommodation Price Per Person   Departing: North East, Yorkshire 3 nights",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}