{
    "relation": [
        [
            "xmlns:dsig",
            "",
            "critical"
        ],
        [
            "CDATA",
            "type",
            "( true | false )"
        ],
        [
            "#FIXED",
            "NMTOKEN",
            "#IMPLIED"
        ],
        [
            "%xmldsig.dtd;",
            "#REQUIRED",
            "'false'"
        ]
    ],
    "pageTitle": "Digital Signature for XML Proposal",
    "title": "",
    "url": "http://www.w3.org/Signature/Drafts/xmldsig-signature-990618.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00269-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 816699523,
    "recordOffset": 816674981,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{713=Add a Resources element \u0096 CS #99122601, 81970=Message Authentication Code proposed by H. Krawczyk and al. and documented in RFC2104., 87760=Public-key signature algorithm proposed independently by Neil Koblitz and Victor Miller. This algorithm is being proposed as an ANSI standard and is documented in ANSI X9.62 standard proposal [x] and IEEE/P1363 standard draft proposal [x]., 96629=<dsig:Date value='1998-10-29T13:26-0500'/>, 802=Revision to reflect 1998-09-16 XML Namespaces proposal, 49485=The Date element consists of a constrained ISO 8601:1998 date and time value., 50920=For example, '1994-11-05T16:15:02.031-0500' denotes November 5, 1994, 4:15:02 pm and 31 milliseconds, US Eastern Standard Time., 50479=MM: two-digit month (01=January, etc.), 1334=This document is an Internet-Draft and is in full conformance with all provisions of Section 10 of RFC2026.}",
    "lastModified": "Mon, 19 Jul 1999 16:13:46 GMT",
    "textBeforeTable": "<!ELEMENT dsig:Algorithm ( dsig:Parameter* )>   <!ATTLIST dsig:Algorithm The Algorithm element consists of a basic data type that uniquely identifies a given algorithm and indicates the parameter values to be used during computation. The construct is recursive and allows a parameter value to refer to another Algorithm element. 5.1 Algorithm 5. Detailed Signature Syntax This recursive construct is expected to be more versatile and shall provide a solution applicable to the definition of algorithms in general. However, this definition does not preclude the adoption of shortcuts such as the ones proposed by ASN1. It does not preclude either the adoption of default parameter values. The most noticeable difference with ASN1 consists of the assimilation of sub-algorithms as parameters of the primary algorithm. In other words, where ASN1 recognizes an algorithm of the type AlgxWithAlgy (i.e. DsaWithSha1) the current specifications recognize Algx with an Algy parameter. This specification adopts a unique Algorithm data type. Though noticeably different from its ASN1 counterpart, this data type serves a similar purpose and provides for the definition of algorithm-specific parameters. 4.5 Algorithm Definitions To facilitate the adoption of common procedures for the encoding of attribute and parameter values, this specification defines a series of elements not directly mandated by the Signature DTD.",
    "textAfterTable": "Content Description       Parameter: The contents of an Algorithm element consists of an optional collection of Parameter elements, which are specified on a per algorithm basis. Attributes Description       id: Element identifier that could be used for referencing this element (from a dsig:eval global attribute for example).       type: The type of the algorithm expressed as a Uniform Resource Name. 5.2 Attribute The Attribute element consists of a complementary piece of information, which shall be included in the authenticated part of the document. Though this specification defines standard attributes, this element has been defined primarily for enabling some level of customization in the signature element. An Attribute element consists of a value, a type, and a criticality. <!ELEMENT dsig:Attribute ANY>   <!ATTLIST dsig:Attribute xmlns:dsig CDATA #FIXED %xmldsig.dtd; type NMTOKEN #REQUIRED critical ( true | false ) #IMPLIED 'false' > Content Description       ANY: The actual value of an attribute depends solely upon its type. Attributes Description       type: Type of the attribute expressed as a Uniform Resource",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}