{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "there are three different greek life organizations on campus, and a lot of students are involved with them. this is not a big party school, instead the organizations throw events and do a lot of community service. joining the organizations are one of the easiest ways to make friends campus.",
            "snhu is good for all students. when i walk on campus there are students with different ethnicites everywhere, and all of us are friends with each other. also, there are a variety of interests among campus, and there are clubs to suit everybodys needs.",
            "in the new academic building there are small glass rooms for group meetings. there is also a cafe in the building so whenever we have group work we always go to that building and do our work there.",
            "while snhu is a private school and it is a little costly, it is definitely worth it. i feel as though the new buildings add so much value to my education. the dorms are clean, the food is terrific, and the teachers and education is the best.",
            "we are close to the city and we can always go out somewhere on the weekends. furthermore, during the week the school is always hosting fun little activites for the students.",
            "the food is delicious and there are always so many choices. i always feel like there is something for me to eat and enjoy.",
            "i enjoy and hang out with everybody on my floor. depending on how many students live on your floor, it can be very fun.",
            "it is challenging work and i have to stay on top of all of my homework. on the other hand it is not an overbearing amount and i can still have fun outside of my school work.",
            "take a tour first and you will fall in love with the school. in you have time you should sit in on a class and you can realize how great the teachers are, ho comfortable you are with classmates, and realize that you can handle the workload.",
            "snhu has perfect faculty, they are very good teachers and always willing to help you. the campus is beautiful and a perfect size. i am comfortable with the work load, although it is challenging."
        ]
    ],
    "pageTitle": "Southern New Hampshire University (SNHU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Southern-New-Hampshire-University/reviews?_escaped_fragment_=/show/15229",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908595763,
    "recordOffset": 908525871,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{180284=If you have a conflict about Instructor offered lower grade just because they can. Especial when you know you are good stand up for your rights. If they ignored your complaints simply contact a legal counselor or attorney's, in which I had to do to request a refund. No way I was accepting a F in Human Sexuality a easy course because of Instructor opinion for grammar. When in-fact I used a word process format and errors checker. You can forget the Dean and COCE will be on-board for the Instructors not you. SNHU is just out for the money not theirs students., 372294=Don't overlook this school if needing to get your BSN or MSN especially if you want an on-line program that continues your nursing education where you left off. The MSN in Nursing Education should be available by the fall of 2016., 275098=I won't lie, SNHU is expensive. We do have lots of scholarships that you can apply for once you get here every January though. The financial aid office is always willing to work with students if money becomes a problem. The money from the student fees goes to funding the clubs, sports teams, etc. So that way the students always have things to do. We are also expanding fast so we have new buildings popping up everywhere like our new library. Definitely discuss money with your guardian or if you are on your own make sure to meet with the One Stop staff to discuss your options., 356510=I am a transfer student and will start classes Jan 13th. The advisers are absolutely amazing.The campus is also beautiful!, 288122=Starting first class in March however, talking with registration and my adviser they have displayed a passion for success., 380378=© 2015, Cappex.com, LLC, 138311=Southern New Hampshire University is a close-knit school that truly cares and recognizes the talents of each and every student. They are more of a community than a school, but there is still a learning and growing opportunity in every direction one looks. Between the success of graduates, the beautiful campus that is constantly being renovated in order to look even newer than it already does, and the fact that it's the only school that got placed on Fast Company's World's Most Innovative Companies 2012, it is almost impossible to go wrong at SNHU., 286776=I am looking forward to starting on March 3. I will be an online student and so far from what I have gathered from talking to several individuals in registration, adviser and financial aid they all have been fantastic!!!!!!, 334185=I enrolled in SNHU in 2012 and I have love it from the very beginning. The staff is very warm and friendly, plus they are all knowledgeable. The professors are well versed and fair, and I am looking forward to my next course., 181030=My suggestion afterward experience at this particular University. I wouldn't recommended any student to SNHU, they are cruel when it comes to Instructor inapproachable response. They make student feeling horrible in grammar errors or punctually. The worst University I have ever attended hybrid online. If you've been out a longer time and warming up forget it like a conspiracy's.}",
    "textBeforeTable": "10/13/2010 Reviewer is A current student here. 8 out of 9 people found this review useful. 1 of 94 Mike Check out reviews left by other students or leave your own review. You could win a free scholarship. Southern New Hampshire University Reviews Southern New Hampshire University › New Hampshire › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck Even though tuition was raised a little this year, i still feel as if it is my best opportunity, and i really am getting what i pay for! Am enjoying being here I love being at SNHU, the environment is great! The clubs on campus really put on alot of activities and chances to meet other students, and on campus generally everyone is really nice! Am learning a lot I would definately say I am learning alot! The pofessors at SNHU really get to know you in class so if you have a question, or miss understand something they are very easy to reach, and they know who you are! At the begining of each semester you are provided with your professors email address and phone number as well as office hours so you can reach them with in minutes! I am a Sophomore at SNHU and i would say i have already learned more than i feel i did in High School, the courses they set out for students to take are really very important and you feel like your being educated when your in class! Login to rate or flag the reviews",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}