{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Not that I know of, havent been down there. But they told me that it's safe.",
            "They said their greek is good. It's fun and you learn a lot. You have to have a certain GPA to be in the greek life.",
            "They have a lot of clubs and activities that you should be interesting in.",
            "Not that I know of.",
            "They have a museum where Martin Luther king Jr and his father, or Rosa Park. You can learn about them in the African-American museum they have down there.",
            "When your done with your work, you have the gym to go to or parties.",
            "Not a lot of places to go out to eat.",
            "Their dorms are affordable.",
            "Clark has everything you need, their majors are perfect.",
            "Research the school before trying to attend it. Ask as many questions about the college, you can learn more about the college.",
            "Clark is a very interesting school. It has a lot of history that I want to study. I has a his expectations."
        ]
    ],
    "pageTitle": "Clark Atlanta University (CAU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Clark-Atlanta-University/reviews?_escaped_fragment_=/show/16835",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00102-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895422859,
    "recordOffset": 895299119,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{128772=Campus safety can be 100% better. There have been at least 10 students mugged on campus at gun point since I've arrived in 2011., 621160=I am a Biology major and I am doing fairly well. While my classes are not too difficult, the RISE Program here at CAU offers tutoring from 4:00 PM to 8:00 PM for all subjects. RISE is ran by students who tutor for work study. General majors need 122 hours to graduate, making CAU a four year university. There is a five year Master's program, but one must enter with a high GPA to be considered.CAU is definitely a BANG for you BUCK being that tuition is $10,000 per semester alone, this does not include housing or any fees. Therefore, scholarships, grants, and loans will definitely be needed.The campuses level of safety is really low but I believe that the campus is working on it., 692873=The student to teacher ratio is 17:1 so you will know you professors well. Smaller class sizes means you can focus more and be able to get assistance more from your professor more than you would in a class with a lot of people., 620608=My freshman year in 2010, I lived in the Suites. Suite Life was definitely sweet! But one must not forget that CAU is in the downtown area, so be careful at night! The upperclassmen live in Brawley dorm, which has to be awesome living with all of your friends., 340177=Clark Atlanta University, CAU, is a private historically black university. However, before this university was established, there was Clark College, founded in 1869, and Atlanta University, founded in 1865. These were the parent institutions that merged together in 1988 giving this institution the name it has today., 682713=On campus we have different forms of dorms. We have traditional which is the usual two beds in the same room and you have a community bathroom where you share with the girls on that floor. We also have non traditional dorms where you can have your own space but you have an actual wall separating you and your room mate and then you share a bathroom with either one or three other girls. In this dorm you have a little kitchen area and a sink area and a bigger closet space then in a traditional dorm. Then for upperclassmen dorms they have their own room but they share a bathroom and a kitchen with three to four other people. There is visitation which is between the times of 6-11:30 pm. The only time that there is not visitation is when there are midterms or finals., 204948=You don't have many options if you are a boy when it comes to dorms. You either stay in Pfeiffer Hall or the CAU Suites. Both are good places to stay in but you don't get visitation outside of the AUC (Atlanta University Center) and your guests have to be out by 11:30., 344811=Being a Freshmen at CAU living in the different dorms is nothing but fun. I lived in Holmes Hall where I met my best friends who I now see as my sisters. There are 3 all girl freshman dorms 1 all guys freshman dorm the CAU suites, and then upperclassmen dorms. This Fall 2012 semester I will be living in Brawely Hall and upperclassmen dorm which has full kitchens and private bathrooms in your room for you and your roommate., 573157=I have done some research on Clark Atlanta1865 I fells that Clark Atlanta University will further extend is national prominence and international presence for it distinctive capacity and commitment to provide a personally transformative a learning environment, that is characterized by my United Methodist Heritage. Clark Atlanta University is known for its excellence in teaching rigorous and innovation academic programs, dedication to the nurturing and development of its students., 206320=Very good business and mass media departments. Depending on the teachers you may learn and you may not. The residence life is not the greatest because the curfew is for 11:30., 705593=© 2015, Cappex.com, LLC, 227055=i will be going here fall of 2012, 47308=When they said college was hard they lied to us all. You must apply yourself. Especially since your pushing out the bucks more rapidly than there coming in. Clark Atlanta is my home away from home. I guarantee any problem your dealing with they will try to help you. Although they can not solve every problem they definitely do reinforce their motto ill find a way or make one. Here they will mold you into the young man or woman you want to be. Teachers love to help they emphasize their office hours and they certainly acknowledge effort. All of my life I've waited for the day id be really proud of something. In August 2010 I honestly got that wish fulfilled when i stepped on campus and finally became a Clark Atlanta Panther. Culture for service its not just our Motto its our life., 194500=clark atlanta university is a school that is all about unity in the african american community. the people are respectable and just like every college on earth it is a party school. every teacher knows about thirsty thursday's and they still hold class at 8:00 am on friday!, 131974=The dorms at CAU are very dangerous. I've been at CAU since 2011 and I've heard of at least 10 people being mugged in campus., 262560=Campus safety is great. They're available to assist students as early as 7:30 AM, although no class begins before 8. They provide escorts around campus for disabled students and have a main line anyone can call at any time during the school day.}",
    "textBeforeTable": "07/22/2009 Reviewer is A current student here. 66 out of 70 people found this review useful. 1 of 164 Tia from Atlanta, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Clark Atlanta University has provided me with the tools I need in order to matriculate gracefully throughout my college career and my life. Academically, CAU has a staff and faculty team that is concerned and dedicated to my success. I have a respectful relationship with my professors which allows me to get the help I need when struggling or just need someone to talk to which has lead to my academic success. CAU has also broadened me culturally due to its HBCU background. Login to rate or flag the reviews Amanda from St.Louis, MO 08/06/2009 Reviewer is A current student here. 26 out of 32 people found this review useful. 3 of 164 Categories Comments Great for these types of students Those looking for a fast-paced environment and wish to be surrounded by people just like you. Bang for the buck I think the school costs wayyy too much for the education received. The money seems to go towards things that don't help the students much.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}