{
    "relation": [
        [
            "Date",
            "6/25/13",
            "6/25/13",
            "6/20/13",
            "6/18/13",
            "6/6/13",
            "6/4/13"
        ],
        [
            "Title",
            "ENERGY SUBCOMMITEE HEARING: To consider S. 1084, S. 717 and other pending energy efficiency legislation",
            "FULL COMMITEE HEARING: Challenges and opportunities for improving forest management on federal lands",
            "FULL COMMITTEE HEARING: Water Resource Issues in the Klamath River Basin",
            "BUSINESS MEETING: To consider pending calendar business",
            "FULL COMMITEE HEARING: To review programs and activities of the Department of the Interior",
            "FULL COMMITTEE HEARING: To explore ways to improve federal wildland fire management"
        ]
    ],
    "pageTitle": "Hearings - U.S. Senate Committee on Energy and Natural Resources",
    "title": "",
    "url": "http://www.energy.senate.gov/public/index.cfm/hearings?IsLowBandwidth=YES",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00255-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437240143,
    "recordOffset": 437192198,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "2015 August Browse by: -- Month -- January February March April May June July August September October November December -- Year -- 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 Hearings Home / Hearings Contact Us hasChildren\"> Contact Petitions and Memorials Executive Communications Nominations Documents – Democrats Documents – Republicans hasChildren\"> Library Bipartisan Energy Bill Committee Legislation hasChildren\"> Legislation Featured Items",
    "textAfterTable": "7/29/15 Business Meeting on 20 Agenda Items (Continued) 7/28/15 Business Meeting on 20 Agenda Items 7/16/15 Subcommittee on Public Lands, Forests and Mining Legislative Hearing 7/14/15 Hearing to receive testimony on islanded energy systems: energy and infrastructure challenges and opportunities in Alaska, Hawaii and the U.S. Territories. 7/9/15 CANCELED: Hearing to receive testimony on mitigation requirements, interagency coordination, and pilot projects related to economic development on federal lands 7/7/15 Hearing to receive testimony on S. 1694, to amend Public Law 103-434 to authorize Phase III of the Yakima River Basin Water Enhancement Project for the purposes of improving water management in the Yakima River basin, and for other purposes June 2015 Date Title 6/18/15 Subcommittee on Water and Power Legislative Hearing 6/16/15 Hearing to Consider Energy Department Nominations 6/10/15 Subcommittee on",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}