{
    "relation": [
        [
            "Patent application number",
            "20130307008",
            "20130307009",
            "20130307012",
            "20130313598",
            "20130313605",
            "20130328098",
            "20140061695",
            "20140070247",
            "20140151711",
            "20140367726"
        ],
        [
            "Description",
            "CONTINUOUS REFLECTION CURVED MIRROR STRUCTURE OF A VERTICAL LIGHT-EMITTING DIODE - A continuous reflection curved mirror structure is applied to a vertical light-emitting diode (LED) which includes a P-type electrode, a permanent substrate, a binding layer, a buffer layer, a mirror layer, a P-type semiconductor layer, a light-emitting layer, an N-type semiconductor layer and an N-type electrode that are stacked in sequence. Between the P-type semiconductor layer and the mirror layer is a filler. The filler is located right below the N-type electrode to form a protruding continuous curved surface facing the light-emitting layer. The mirror layer forms a mirror structure along the protruding continuous curved surface. With reflection provided by the mirror structure, excited light from the light-emitting layer is reflected towards two sides, so that the excited light can dodge the N-type electrode without being shielded to increase light extraction efficiency.",
            "REFLECTION CURVED MIRROR STRUCTURE OF A VERTICAL LIGHT-EMITTING DIODE - A reflection curved mirror structure is applied to a vertical light-emitting diode (LED) which includes a P-type electrode, a permanent substrate, a binding layer, a buffer layer, a mirror layer, a P-type semiconductor layer, a light-emitting layer, an N-type semiconductor layer and an N-type electrode that are stacked in sequence. Between the P-type semiconductor layer and the mirror layer is a filler. The filler is located right below the N-type electrode to form a protruding curved surface facing the light-emitting layer. The mirror layer forms a mirror structure along the protruding curved surface. With reflection provided by the mirror structure, excited light from the light-emitting layer is reflected towards two sides, so that the excited light can dodge the N-type electrode without being shielded to increase light extraction efficiency.",
            "TENSION RELEASE LAYER STRUCTURE OF LIGHT-EMITTING DIODE - A tension release layer structure is applied to an LED which includes a P-type electrode, a permanent substrate, a binding layer, a tension release layer, a mirror layer, a P-type semiconductor layer, a light-emitting layer, an N-type semiconductor layer and an N-type electrode that are stacked in sequence. The tension release layer is made of a complex material including at least two material elements with boundaries that are blended with each other. As the complex material in the tension release layer does not have apparent interface separation, stress between interface effect and materials can be eliminated to increase light-emitting efficiency and production yield of the LED.",
            "ELECTRODE CONTACT STRUCTURE OF LIGHT-EMITTING DIODE - An LED electrode contact structure for an LED is provided. The LED includes a plurality of N-type electrodes, an N-type semiconductor layer, a light-emitting layer, a P-type semiconductor layer, a mirror layer, a buffer layer, a binding layer, a permanent substrate and a P-type electrode that are stacked in sequence. The N-type semiconductor layer has an irregular surface and a plurality of contact platforms. The contact platforms are formed and distributed on the N-type semiconductor layer in a patterned arrangement, and the irregular surface is formed at areas on the N-type semiconductor layer without the contact platforms. The N-type electrodes are respectively formed on the contact platforms. The contact platforms have roughness between 0.01 μm and 0.1 μm, such that not only voids are not generated but also good adhesion is provided to prevent carrier confinement and disengagement. Therefore, satisfactory electrical contact is ensured to thereby increase light emitting efficiency.",
            "ELECTRODE CONTACT STRUCTURE OF LIGHT-EMITTING DIODE - A light-emitting diode (LED) electrode contact structure for an LED is provided. The LED includes a plurality of N-type electrodes, an N-type semiconductor layer, a light-emitting layer, a P-type semiconductor layer, a mirror layer, a buffer layer, a binding layer, a permanent substrate and a P-type electrode that are stacked in sequence. The N-type semiconductor layer has an irregular surface and a plurality of contact platforms. The contact platforms are formed and distributed on the N-type semiconductor layer in a patterned arrangement, and the irregular surface is formed at areas on the N-type semiconductor layer without the contact platforms. The N-type electrodes are respectively formed on the contact platforms. Through flat interfaces provided by the contact platforms, voids are not generated when the N-type electrodes are formed on the contact platforms. Therefore, satisfactory electrical contact is ensured to thereby increase light emitting efficiency.",
            "BUFFER LAYER STRUCTURE FOR LIGHT-EMITTING DIODE - A buffer layer structure for an LED is provided. The LED includes a P-type electrode, a permanent substrate, a binding layer, a buffer layer, a mirror layer, a P-type semiconductor layer, a light-emitting layer, an N-type semiconductor layer, and an N-type electrode that are stacked in sequence. The buffer layer is a composite material, and includes at least one first material and at least one second material that are alternately stacked. The first material and the second material are mutually diffused to generate gradient variation after the buffer layer is processed by a thermal treatment. Thus, an interface effect and thermal stress between difference interfaces are eliminated, and a channel for ion diffusion is blocked for enhancing light-emitting efficiency of the LED.",
            "LIGHT-EMITTING DIODE WITH A MIRROR PROTECTION LAYER - A light-emitting diode (LED) with a mirror protection layer includes sequentially stacked an N-type electrode, an N-type semiconductor layer, a light-emitting layer, a P-type semiconductor layer, a metal mirror layer, a protection layer, a buffer layer, a binding layer, a permanent substrate, and a P-type electrode. The protection layer is made of metal oxide, and has a hollow frame for covering or supporting edges of the metal mirror layer. Accordingly, the metal mirror layer can be protected by the protection layer to prevent from oxidation in subsequent processes and to prevent metal deterioration during high-current operations. Thus the metal mirror layer can maintain high reflectivity, thereby increasing light extraction efficiency and electrical stability of the LED.",
            "SEMICONDUCTOR LIGHT-EMITTING DEVICE AND FABRICATING METHOD THEREOF - A semiconductor light-emitting device comprises a light-emitting epitaxial structure, a first electrode structure, a light reflective layer and an resistivity-enhancing structure. The light-emitting epitaxial structure has a first surface and a second surface opposite to the first surface. The first electrode structure is electrically connected to the first surface. The light reflective layer is disposed adjacent to the second surface. The resistivity-enhancing structure is disposed adjacent to the light reflective layer and away from the second surface corresponding to a position of the first electrode structure.",
            "SEMICONDUCTOR LIGHT-EMITTING DEVICE - A semiconductor light-emitting device is provided. The semiconductor light-emitting device includes a buffer layer, a light-emitting layer, a first-conductivity semiconductor layer, a first light reflecting layer, a protective structure, and an adhesive layer. The first-conductivity semiconductor layer is disposed between the buffer layer and a first side of the light-emitting layer. The first light reflecting layer is disposed between the first-conductivity semiconductor layer and the buffer layer. The protective structure is disposed between the first reflecting layer and the buffer layer. The adhesive layer is disposed between the first-conductivity semiconductor layer and the protective structure.",
            "SEMICONDUCTOR LIGHT-EMITTING DEVICE AND FABRICATING METHOD THEREOF - A semiconductor light-emitting device including an epitaxial structure, a first electrode structure, a second electrode structure, a light reflective metal layer, a resistivity-enhancing structure and a protection ring is provided. The light-emitting epitaxial structure has a first surface and a second surface. The light-emitting epitaxial structure has a first zone and a second zone. The first electrode structure is disposed within the first zone. The second electrode structure is disposed within the second zone. The light reflective metal layer is disposed adjacent to the second surface. The resistivity-enhancing structure is disposed in contact with a surface of the light reflective metal layer and corresponding to a position of the first electrode structure. The protection ring has a first portion and a second portion. The first portion surrounds a sidewall of the light reflective metal layer. The second portion corresponds to the second electrode structure."
        ],
        [
            "Published",
            "11-21-2013",
            "11-21-2013",
            "11-21-2013",
            "11-28-2013",
            "11-28-2013",
            "12-12-2013",
            "03-06-2014",
            "03-13-2014",
            "06-05-2014",
            "12-18-2014"
        ]
    ],
    "pageTitle": "Chou, Taichung City - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/chou-taichung-city-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00059-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 447410811,
    "recordOffset": 447373654,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Li-Ping Chou, Taichung City TW 01-19-2012 SYNTHESIS AND ANTICANCER ACTIVITY OF ARYL AND HETEROARYL-QUINOLIN DERIVATIVES - A compound of Formula I is disclosed as follows: 20120015908 Published Description Patent application number Li-Chen Chou, Taichung City TW Lai Chou, Taichung City TW 12-31-2009 Cooling Fin - A cooling fin is integrally formed and comprises a board body, a passage penetrating the board body, and plural heat dissipating portions located outside the board body in the direction along the passage. Between each two neighboring portions is defined a heat dissipating space. By such arrangements, the cooling fin has the advantages such as better heat dissipation effect, easy to assemble and simple structure without any assembling operations and procedures. 20090321060 Published Description Patent application number Kuan-Yin Chou, Taichung City TW 01-14-2010 Shorted monopole antenna - The present invention is related to a shorted monopole antenna. The antenna includes a ground plane, a main radiating element, a shorting element, a metal plate, and a coaxial cable. The ground plane includes a signal grounding point. The main radiating element is located above the ground plane and bent at least once, and includes a signal feeding point. One end of the shorting element is connected to one of the short edges of the ground plane, and the other end is connected to one edge portion of the main radiating element.",
    "textAfterTable": "Li-Wei Chou, Taichung City TW Patent application number Description Published 20110172578 PLANTAR FASCIITIS REHABILITATION CONTROLLING DEVICE - The present invention relates to a plantar fasciitis rehabilitation controlling device. It mainly comprises a securing portion, a rotatable portion, a torque pivoting portion, a pulling portion, and a controller. The securing portion and the rotatable portion are provided for securing a user's shank and foot. This torque pivoting portion can create a torque causing the rotatable portion moving back. The pulling portion has a controller so as to pull the rotatable portion to rotate between a first angle and a second angle so that it can reduce possibility of the plantar fasciitis and ease pain of the plantar fasciitis. Hence, this invention can achieve an active rehabilitation exercise. The belt's pulling interval time can be adjusted. It has a safety switch to ensure its product safety. It is convenient that the user can use a wireless device to operate this system. In addition, the user can be informed about current condition via an audio device. 07-14-2011 20110172579 INFLATION TYPE CERVICAL VERTEBRAE REHABILITATION DEVICE AND METHOD FOR USING THE SAME - An inflation type cervical vertebrae rehabilitation device includes at least one cervical vertebrae cell, a head cell connected to the at least one cervical vertebrae cell, an electric inflation portion and a control portion. The method includes a preparing step, a setting inflation processes step, an inflating step, and a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}