{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "call boxes are located all around campus.",
            "a very active greek life.",
            "there are tons and tons of clubs and activities to get involved in. practically a club for everything/interest.",
            "great education that is very reasonably priced.",
            "for fun, a student may attend movies on campus, join clubs, or go to the outlets in grove city.",
            "the dining had a variety of options including many healthy choices.",
            "the new dorms are very nice and comfortable.",
            "academically, slippery rock university is what you make of it. some majors have more rigorous programs than others.",
            "prospective students should keep in mind that although there are many people attending the university it is somewhat difficult to meet other students if one does not get involved. also, the weather is very gray. invest in rain boots.",
            "slippery rock university is a diverse university. it is a medium size, somewhat rural institution located in a small town. it has a large variety of major programs."
        ]
    ],
    "pageTitle": "Slippery Rock University of Pennsylvania (SRU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Slippery-Rock-University-of-Pennsylvania/reviews?_escaped_fragment_=/show/119981",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905620383,
    "recordOffset": 905515895,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{418700=in 2006-2008 I played Women's Rugby for Slippery Rock and I had a blast!, 10165=Upon coming here in the fall of 2009, I never anticipated learning as much as I am now. One nice thing about this school is that all of your courses relate in some way. I found myself learning the same concepts, from different perspectives which will help me when I become a teacher., 52924=if you are able to get some college credit courses while in high school, do some sincere community service. if you want to save money wait til may or july to see about getting a new lap top or computer. if they want to offer you to buy microsoft office tell them no thanks. this is why go to microsoft's website and go to their student specials or student section and you can download the full office suite for the special student price also check with your school to see if they have a deal on the office suite, i got mine for a licensed copy from slippery rock university where i am attending classes. if you happen to have a job find out if they offer a scholarship or a grant so ask your managers and research online for the company. bug the heck out of your advisor at your high school, your teachers and anyone else you can think of, you just might get lucky, so be ready to come to sru and get a life experience and make friends for life. good luck, 12538=I'm not a current student at slippery rock yet, but i will be in the fall of 2010 once i transfer there I can tell you more, from what i hear they have great major programs, clubs and organizations that you can get involved in, a small enjoyable town that there's places you can enjoy and other great adventures., 42856=There are many places to eat around campus including Boozel Dining Hall, Rockey's Grill, and new places are being built for the 2012 spring semester. All food is very good., 356936=A lot of event go on oncampus. Many people come for appearances like comedians, tv stars, etc. I met Ross Matthews, Ralphi May, Nev, and others., 533701=© 2015, Cappex.com, LLC, 41449=Slippery Rock has a green and white friday every friday where students wear green and white. Also, during finals week there is breakfast at 11:00 pm at the dining hall where students can relax, dance, and have fun before the stressful week begins.}",
    "textBeforeTable": "07/31/2009 Reviewer is A current student here. 18 out of 19 people found this review useful. 2 people found this inaccurate. 1 of 112 Brittany from Apollo, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp",
    "textAfterTable": "Bang for the buck The new dorms are absolutely worth every penny. You are able to have your own room or if you wish to share you can! The beauty about them is that you do not have to share a bathroom with more than 1 other person. This makes it a lot more convenient to plan schedules. The meal plans are also very flexible for the needs of the students. The campus offers flex dollars, meal swipes, and Rock Dollars. Rock Dollars are also accepted at our local Giant Eagle (grocery store) and the restaurants on Main Street. Am enjoying being here Our campus offers some of the best events around. If you live on campus be sure to check out the events for ARHS (Association for Residence Hall Students), just recently they offered a free bowling and laser tag trip at no expense to the students! Another organization on campus is UPB (University Programming Board), which hosts many events on campus. They bring in speakers, singers, fun events, and lots of free activities to participate in. Every weekend you can look forward to a movie viewing in Watson Hall and the ATS building. Am learning a lot Upon coming here in the fall of 2009, I never anticipated learning",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}