{
    "relation": [
        [
            "Protein family:",
            "unique to 3",
            "unique to 4",
            "intersection"
        ],
        [
            "Cupredoxins",
            "0",
            "24",
            "82"
        ],
        [
            "CytochromeC",
            "1",
            "1",
            "21"
        ],
        [
            "Flavodoxins",
            "0",
            "11",
            "119"
        ],
        [
            "Globins",
            "0",
            "13",
            "492"
        ],
        [
            "I set IGs",
            "5",
            "1394",
            "8293"
        ]
    ],
    "pageTitle": "Hidden Markov models and their application to genome analysis in the context of protein structure1",
    "title": "",
    "url": "http://bioinformatics.bris.ac.uk/people/julian_gough/thesis/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00318-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 26127983,
    "recordOffset": 26035420,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{28456=The most recent development in the field of profile-based sequence searching which has made a big difference is the use of iterative procedures. In 1997 Altschul and Lipman et al. produced PSI-BLAST[28] which is currently the most commonly used profile-based method. Position Specific Iterated (PSI) BLAST is an improvement, and more importantly, an extension of the original BLAST algorithm. The procedure requires a large database of known protein sequences which it uses to iteratively search for homologues to build a profile from. The initial query sequence is searched against the large database for close homologues, which are then aligned. Position specific score matrices are constructed from the alignment and used to search the database for further homologues not detectable by a pair-wise comparison to the initial query sequence using BLAST. The procedure repeats itself a number of times improving the profile by adding more homologous sequences from the large database to the alignment. The resulting automatically generated profile can be used to search for sequences related to the initial query sequence., 20926=A simplistic yet systematic approach to sequence homology detection was first developed by Fitch in 1966[16]. This method used a substitution matrix based on the number of nucleotide mutations required to translate between amino acids. This matrix was used to calculate similarity scores for all possible ungapped alignments of a pair of sequences, and hence the significance of the homology. The first systematic sequence comparison procedure which allowed for gaps and insertions in the sequences was published by Needleman and Wunsch in 1970[17]. This work was a major breakthrough at the time, offering the capability to automatically detect homology between much more divergent sequences than was previously possible. Through the use of a dynamic programming algorithm the method was also very efficient, and could be used to compare large numbers of sequences. It was however still very slow compared to the methods subsequently developed. In 1978 major improvements were made to the substitution matrix by Dayhoff and Schwartz[18]., 29631=Although the position specific score matrices used by PSI-BLAST are in essence very similar to hidden Markov models, they are somewhat optimised for speed, and lack features such as position specific gap penalties and insertion score matrices. They also fail to make use of the Dirichlet mixtures[29] and null models used by hidden Markov model methods. In 1999 Karplus and Hughey et al. published[14] an iterative hidden Markov model procedure similar to PSI-BLAST, but using hidden Markov models instead of position specific score matrices. There have subsequently been improvements made to PSI-BLAST[30], but a comparison in this thesis, finds the performance of Karplus and Hughey's hidden Markov model procedure SAM-T99 to be superior., 219985=The speed of the programs is important because this may determine the feasibility of large scale experiments. Although all of these methods perform much better than Blast at remote homology detection, Blast is so much faster that it can be used on a scale these methods cannot. The time taken for the model-building , model-calibrating, and model-scoring was recorded for 100 cases, and the average times compared. The cases vary in length, complexity and abundance of homologues. The models were all scored against 1159 sequences (see figure 5.5)., 219045=A short test was made of the ability of both methods in this respect; WU-Blast was also included in the test. 100 models from different SCOP folds were chosen as a test set, and they were scored against three databases of sequences with roughly 2000 sequences in each:, 205807=The SAM package developed by the bioinformatics group at the University of California Santa Cruz is not open source but is free for academic use and the authors retain no rights over the models produced with the software. The SAM package not only contains model-building and model-scoring programs relevant to homology detection, but also several scripts for running the programs. The most relevant script for this work is the `w0.5' script which runs the model-building program and is the one recommended in the documentation. This script was used for all SAM model-building. The most important script in the package is the T99 script [14] which is used to generate or to improve the multiple sequence alignment necessary to build a model. It is however not under direct assessment here, as HMMER has no equivalent and must be provided with alignments generated by some other method. Therefore only the model-building and model-scoring programs were compared. The T99 script (or versions of it) has proved very successful in the CASP[62] blind prediction tests and cannot be ignored as an undeniable advantage of the SAM package in general. Unlike HMMER, SAM is able to make use of additional alignment information by specifying the difference between deletions and insertions, via use of lower case letters and the `.' character for insertions, and the `-' character for deletions. All of this information is removed from the alignments so that SAM is not allowed this advantage. See table 5.1 for an example of the differences. Version 3.1 of SAM was used here which was last updated in the year 2000., 25219=An early attempt at using a profile to identify protein sequence homology was made by Taylor[23] in 1986. He demonstrates that the use of a profile-based procedure using what he calls ``template fingerprints'' can be used to identify conserved features in immunoglobulin sequences, and attempts to define a general algorithm for the recognition of sequence patterns in globular proteins. The approach used large multiple sequence alignments of variable and constant domains to generate templates representing the conserved features. It was observed that the conserved features were different for immunoglobulins and other beta-sheet proteins. Taylor concludes that ``Matching a new sequence against a data bank of fingerprint templates is potentially a better approach to sequence identification than the current practice of comparing an entire sequence against every other sequence in the databanks ...''. Further template generation and matching was subsequently carried out on the globins by Bashford et al. in 1987[24], but the focus of this work was to identify the sequence features which determine a protein fold, rather than developing a general procedure for sequence alignment and searching. As the conserved features were found to be common to all globins, they were able to distinguish globins from any other sequences., 26651=Growing out of this work in 1987, Gribskov and Eisenberg et al. wrote a program called PROFMAKE[25] and used it to build profiles for globins and immunoglobulins, and search them against a sequence database. This method saw the introduction of position specific gap penalties, and uses a dynamic programming algorithm analogous to that introduced by Needleman and Wunsch for pair-wise sequence comparison. Gribskov and Eisenberg then went on to formally develop programs[26], which Bowie and Eisenberg extended and applied to more families[27]., 22587=The dynamic programming algorithm used by Smith and Waterman guarantees an optimal local alignment, and hence the maximum score, for a given pair of sequences and a substitution matrix. It is however possible to increase the efficiency of the algorithm by adding heuristics which consider a window of residues along the sequence. The optimal alignment is no longer guaranteed but something very close is usually achieved. In 1988 Pearson and Lipman introduced a heuristic method called FASTA[20], and in 1992 another by Altschul and Lipman et al. called BLAST[21]; these offered an increase in efficiency with some loss of sensitivity. Further improvements were made available by Henikoff and Henikoff in 1990, introducing the BLOSSUM substitution matrices[22]., 208987=The SUPERFAMILY sequence set filtered to 40% sequence identity was used in the SCOP test (see chapter 2). There are 2892 sequences in this set, with approximately 40000 possible true pair-wise hits at the superfamily level. Models generated from every sequence were scored against all sequences for each method. This all against all comparison allows a very diverse and un-biased (between methods) comparison on a large amount of data., 204861=The HMMER[15] package is open source and freely available, and includes the necessary model-building and model-scoring programs relevant to homology detection. In addition to this the package contains a model-calibrating program which calibrates a model by scoring a set of random sequences and fitting an extremal value distribution to the results. The intention is that the scores given to query sequences by all calibrated models be comparable. The SAM package does not come with a model-calibration program, but both scoring programs return scores as expectation values (E-values). In this comparison version 2.1.1 of the HMMER package was used. This version was last updated in 1999 and is the most recent one bar one. The most recent update has only minor changes none of which should affect the results of this assessment., 282245=To examine the nature of the overlap between the assignments made by SUPERFAMILY and by other state of the art methods, the differences in the assignments between SUPERFAMILY and three other methods were compared. The three methods were Gene3D, GenThreader, and the structural families in PFAM. All data for this comparison were provided by the authors of the methods at the same time (March 2002). These were partly chosen because of the availability of their data, but also because they are representative of the available structural assignments to genomes. Gene3D uses the CATH database, which is the main structural classification other than SCOP, and PSI-BLAST which is the main iterative profile method other than SAM-T99. GenThreader is the most conceptually different procedure, and the only one with a coverage of the genome similar to SUPERFAMILY. PFAM is a HMMER-based database and has been as widely applied to genomes as SUPERFAMILY, so is a good comparison with respect to the improvements in the HMM procedures discussed here., 31369=More recently in 1999 Retief and Pearson et al. developed a visual method[33] for identifying novel homology. This included a multiple sequence search procedure for finding new members of an existing protein family starting from a phylogenetic tree. 20-50 query sequences are selected from different branches of the tree, searched individually with FASTA, and the results collated. The authors liken their procedure to profile-based methods but it is in essence quite different, although there is some analogy between this procedure and the use in this thesis of multiple models to represent a single family., 274784=The model library performs extremely well in validation tests against SCOP but, as it has been heavily trained on these validation tests themselves, the rigorous test is one of blind prediction such as the CASP[62] test. SUPERFAMILY was submitted to LiveBench (http://bioinfo.pl/LiveBench) which continuously benchmarks prediction servers, which is based on the CASP concept and offers difficult targets of recently solved structures. All targets have a BLAST[21] E-Value higher than 0.1 to all other members of PDB. Out of the 203 targets in the LiveBench-2 project (collected between 13.4.00 and 29.12.00), 45 were assigned to the correct SCOP superfamily by SUPERFAMILY and one falsely assigned. The one incorrect assignment involved a very short cysteine-rich protein and sequences of this kind are known to produce false matches with good scores[32]., 30598=It is worth noting that there have been alternative approaches to profile methods which use multiple pair-wise sequence searches. In 1997 Park and Chothia et al. produced an intermediate sequence search procedure[31] (ISS). The principle is to detect distant relationships using the fact that sequence homology is transitive. Pair-wise methods may be unable to detect a relationship between two divergent proteins, but if there exists an intermediate sequence to which both may be individually linked, then homology between the two divergent proteins is inferred. This gave a significant improvement over the simple pair-wise methods, but was less successful than the profile methods[32]., 279491=As mentioned above the most extensive structural assignments to genomes other than the work presented here is by the Gene3D project at University College London by Daniel Buchan, Dr. Frances M.G. Pearl, Dr. Adrian J. Shepherd, Dr. David Lee, Dr. Christine A. Orengo, Prof. J.M. Thornton, Stuart Rison and Ian Sillitoe. This database is the most similar to SUPERFAMILY and the coverage of the genomes from each of the databases are compared in figures 7.6 and 7.7. This comparison was made some months ago in February 2001. All of the genomes from both databases are included, some of which were not included in one or the other at the time. SUPERFAMILY now contains all 56 complete genomes whilst GENE3D only covers those shown here, most notably only two eukaryotes: yeast and worm. Some of the assignments made by GENE3D are so poor (e.g. `cp') that there must be some error, which has not been fixed at the time of writing., 27330=There still did not exist a robust profile method which could be widely used, until Krogh and Haussler et al. introduced hidden Markov models to computational biology in 1994[10]. Hidden Markov models put the profile methods on firmer mathematical ground by casting the problem within a tight probabilistic framework. This resolved many of the problems associated with profile analysis, improved performance, and by 1996 there were two independent (freely available) software packages being applied to large-scale problems[11]. Without the probabilistic framework provided by the hidden Markov model theory, previous methods had been assigning the position specific scores and gap penalties in a relatively ad hoc manner. The early profile methods could be applied to specific families by tuning the parameters by trial and error, but were unable to achieve the automatic and reliable construction of profiles necessary for them to be applied on a large scale., 17319=It was suggested some time ago that there is a limited repertoire of approximately 1000 protein families [3,4], which has been backed up with stronger evidence more recently [5]. By combining sequence and structure information it should be possible in the future to classify all of the sequences in all of the genomes into this limited number of families. Genome projects have so far supplied us with complete sequence sets, and structural genomics will hopefully soon provide us with structural representatives for every family.}",
    "textBeforeTable": "Table 2.1: The structural alignment of seven structures to plastocyanin (1plc). For each structure the PDB code is shown, followed by the number of residues of the domain, the number of those which align to the structure of plastocyanin, the number of those which are identical in sequence, the identical residues expressed as a percentage of those aligned, and the root mean square deviation in angstroms between the aligned parts of the two structures. --> $\\resizebox*{0.9\\textwidth}{!}{\\includegraphics{figures/mult_align.eps}}$",
    "textAfterTable": "27 1.452 Stellacyanin 1jer 109 58 13 22 1.300 Pseudo-azurin 1paz 123 81 21 26 1.063 Rustacyanin 1rcy 155 59 13 22 2.021 Plastocyanin 1plc 99 99 99 100 0 Once the pair-wise alignments have been made, a comparison of the regions of plastocyanin which align to the other structures can be used to find the regions which are common to all. This effectively gives the multiple structural alignment between all of the cupredoxins. The equivalent regions of all seven structures are listed here using the PDB residue numbering in the `ATOM' records: [1plc]1-6, 12-23, 24-33, 36-42, 68-75, 78-87, 91-99 [1paz]3-8, 16-27, 28-37, 39-45, 62-69, 72-81, 85-93 [2cbp]3-12, 28-36, 27-36, 38-44, 64-71, 73-84, 88-96 [1jer]5-14, 25-33, 34-43, 45-51, 73-80, 83-94, 98-106 [1aaj]21-26, 28-39, 40-49, 52-58, 76-83, 86-95, 97-105 [1aiz]5-10, 13-24, 28-37, 45-51, 91-98, 105-117, 120-128 [1rcy]40-45, 52-68, 71-80, 84-90, 121-128, 132-141, 147-155 It became clear during the analysis that the cupredoxins fall into two sub-families with rustacyanin (1rcy) and stellacyanin (1jer) being more similar to each other than to the rest, and vice versa. 2.1.2.3 Contacts It is possible to calculate the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}