{
    "relation": [
        [
            "Argument",
            "host",
            "port",
            "user",
            "password",
            "compositeName",
            "revision",
            "label",
            "partition"
        ],
        [
            "Definition",
            "Hostname of the Oracle WebLogic Server (for example, myhost).",
            "Port of the Oracle WebLogic Server (for example, 7001).",
            "User name for connecting to the running server to get MBean information (for example, weblogic).",
            "Password for the user name.",
            "Name of the SOA composite application.",
            "Revision of the SOA composite application.",
            "Optional. Label of the SOA composite application. The label identifies the MDS artifacts associated with the application. If the label is not specified, the system finds the latest one.",
            "Optional. The name of the partition in which the SOA composite application is located. The default value is default. If you do not specify a partition, the default partition is searched for the SOA composite application. However, no other partitions are searched."
        ]
    ],
    "pageTitle": "Deploying SOA Composite Applications - 11g Release 1 (11.1.1.5.0)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E25054_01/dev.1111/e10224/sca_lifecycle.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00310-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74013019,
    "recordOffset": 73962603,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{85511=For information about deploying SOA composite applications with task flows to multiple partition environments, see Section 40.7.1.2, \"What You May Need to Know About Deploying Human Task Composites with Task Flows to Partitions.\"}",
    "lastModified": "Thu, 20 Sep 2012 17:59:37 GMT",
    "textBeforeTable": "Table 40-22 ant SOA Composite Application Stop Commands Table 40-22 describes the syntax. Note: After specifying the user name, enter the password when prompted. -DcompositeName=HelloWorld -Drevision=1.0 -Dpartition=partition.name ant -f ant-sca-mgmt.xml stopComposite -Dhost=myhost -Dport=8001 -Duser=weblogic Example 40-27 Stopping an Application    Example 40-27 provides an example of stopping a SOA composite application. 40.7.5.2.12 Stopping a SOA Composite Application          Optional. The name of the partition in which the SOA composite application is located. The default value is default. If you do not specify a partition, the default partition is searched for the SOA composite application. However, no other partitions are searched.   partition     Optional. Label of the SOA composite application. The label identifies the MDS artifacts associated with the application. If the label is not specified, the system finds the latest one.   label     Revision of the SOA composite application.   revision     Name of the SOA",
    "textAfterTable": "40.7.5.2.13 Activating a SOA Composite Application Example 40-28 provides an example of activating a SOA composite application. Example 40-28 Activating an Application ant -f ant-sca-mgmt.xml activateComposite -Dhost=myhost -Dport=8001 -Duser=weblogic-DcompositeName=HelloWorld -Drevision=1.0 -Dpartition=partition.name Note: After specifying the user name, enter the password when prompted. Table 40-23 describes the syntax. Table 40-23 ant SOA Composite Application Activation Commands Argument Definition host Hostname of the Oracle WebLogic Server (for example, myhost). port Port of the Oracle WebLogic Server (for example, 7001). user User name for connecting to the running server to get MBean information (for example, weblogic). password",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}