{
    "relation": [
        [
            "Award",
            "Classic Shrub",
            "Modern Shrub"
        ],
        [
            "Winning Variety",
            "Darlow’s Enigma",
            "Oliver Roellinger"
        ],
        [
            "Shown By",
            "Kevin Glaes",
            "Bill & Kathy Kozemchak"
        ]
    ],
    "pageTitle": "American Rose Society | Page 2",
    "title": "",
    "url": "http://www.rose.org/author/afiglio/page/2/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00011-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 690611567,
    "recordOffset": 690593999,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{57206=Show Date: Sept. 6, 2014, 62115=Show Date: July 25-27, 2014, 51225=Date of Show: Sept. 6, 2014, 78921=The 2015 American Rose Center Trial Grounds testing is now open! Please contact Carol Spiers (carol[at]ars-hq[dot]org) for your packet of information if you are interested in testing your new varieties for the 2015-2016 testing seasons., 27178=Date of Show: Sept. 21, 2014, 46156=Date of Show: Sept. 13, 2014, 6252=Show Date: Oct. 10-12, 2014, 20427=Show Date: October 3, 2014, 80696=Show Date: June 28, 2014}",
    "textBeforeTable": "Hybrid Teas & Grandifloras   Reporter:Linda S. Boland Show Date: Oct. 10-12, 2014 City/State: Columbia, SC Type of Show: District Society: SC Rose Society District: Carolina District Posted in EQ by Amanda October 27, 2014 Posted on Carolina District Rose Show Author Archives: Amanda Shop RIR Donate JOIN Gallery Resources",
    "textAfterTable": "Princess Louise Estes Delores Snellgrove Royal Court Gemini Fred Wright Royal Court Cajun Sunrise Fred Wright Royal Court Marlon’s Day Fred Wright Royal Court Carolina Pride Fred Wright Royal Court Not Awarded Hybrid Tea Open Sweet Marlon Fred Wright HT/Grandiflora Spray Jewel Grace Gary Whitt Floribundas & Polyanthas Category Name Winning Variety Shown By Floribunda One Bloom Kanegem Paul & Charlotte Blankenship Floriunda Spray Queen (Best) Johnny Becnel Delores Snellgrove Floribunda Spray King Not Awarded Floribunda Spray Princess Not Awarded Floribunda Spray Court Not Awarded Polyantha Spray Verdun Linda & Ken Boland Shrubs & Climbers Category Name Winning Variety Shown By Best Shrub Not Awarded Classic Shrub Prosperity Mrs. Dot Waites Modern Shrub Lady Carolina Rita & Frank Van Lenten Climber Not Awarded Old Garden Roses Category Name Winning Variety Shown By Dowager Edith de Murat Patricia Henry Victorian Pink Pet Patricia Henry Genesis Not Awarded Miniatures Category Name Winning Variety Shown By Mini Queen Best of ’04 Paul & Charlotte Blankenship Mini",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}