{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Everyone knows everyone and people are very friendly.",
            "Phi Theta Kappa",
            "A small but diverse selection of clubs.",
            "Students who live nearby in WI and want to save a few $ before transferring to a 4 year school, or who don't know what their major will be.",
            "UW-Marinette is a small campus with a fairly small class selection, but the professors are all very dedicated and will definitely help if you are willing to ask. Professors will, more often than not, go out of their way to assist.",
            "Marinette is a tiny town and there isn't much for entertainment, unless you're creative!",
            "It's ok, although it is not utilized often.",
            "No on campus housing",
            "This is basically where you will get your gen-eds done. Therefore, the classes are (usually) not difficult, but you will still need to show up and do homework to pass.",
            "Get to know your classmates and professors. In such a small town, chances for opportunity are slim and you will need their guidance at some point. Also, the professors are just fun, interesting people.",
            "UW Marinette is a small and intimate school with very knowledgeable faculty. Don't let the community college cliche fool you: you will need to work and get to know students and professors. If you're in the NEW area and want to save some money before attending your ultimate college, this is your best bet."
        ]
    ],
    "pageTitle": "University of Wisconsin Colleges Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Wisconsin-Colleges/reviews?_escaped_fragment_=/show/73190",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896454787,
    "recordOffset": 896398903,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{215361=There is only one place to eat on campus and it closes about 2:30, but there are plenty of vending machines and plenty of place to eat outside of campus in the surrounding city., 56810=the first building for dorms is currently being built (march 2012)., 63126=Why pay $12000 to take the same gen eds at a bigger college? Take your math and English at a small college and save yourself some money., 131918=Tuition at UW Colleges is very affordable, around $2200 for full time. Online classes have an added fee of $60. This is extremely good rates for University level learning., 275731=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "03/16/2011 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 of 61 Elizabeth from Madison, WI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Am enjoying being here I love the friendly enviornment UW-Waukesha has to offer. All of the staff is extremely helpful and encouraging. The people are very nice and it is really an opportunity to grow as an individual and as a team player. I was never involved in high school, but I jumped right into two clubs my first year at Waukesha, I was even an officer my first semester! Am learning a lot I attend UW-Waukesha and the professors there have really opened my mind to the variety of ways one can study a topic. Also, the class sizes are small so if you have any questions you feel comfortable asking. Thirdly, there are many free tutoring options available to really help you learn and better understand the material. Login to rate or flag the reviews Ashley from Janesville, WI 06/09/2011 Reviewer is A past student here. 1 out of 1 people found this review useful. 3 of 61 Categories Comments Great for",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}