{
    "relation": [
        [
            "Patent application number",
            "20150051036",
            "20150105202"
        ],
        [
            "Description",
            "TRANSMISSION SYSTEM OF HYBRID ELECTRIC VEHICLE - A transmission system of a hybrid electric vehicle may include two shafts, two hollow shafts and two motor/generators. A first shaft connected to an engine. A first hollow shaft disposed without rotational interference with the first shaft, selectively connected to the first shaft, and provided with a first output gear. A second hollow shaft disposed without rotational interference with the first hollow shaft and provided with a second output gear. A second shaft disposed in parallel with the first shaft and operably connected to the first shaft and the first hollow shaft through a gear unit to selectively transmit torque of the first shaft to the first hollow shaft. Clutches may connect the first shaft and the second shaft selectively to the first hollow shaft. A first motor/generator operably connected to the second hollow shaft and a second motor/generator operably connected to the second shaft.",
            "POWER TRANSMISSION SYSTEM OF HYBRID ELECTRIC VEHICLE - A power transmission system for a hybrid vehicle according to an exemplary embodiment of includes an input shaft through which torque from an engine, which is a power source, is inputted, first and second motor/generators that have the functions of both of a motor and a generator, as individual power sources, a planetary gear set that may be disposed on a line from the input shaft and includes a first rotating element directly connected with the first motor/generator and selectively connected to a transmission housing, a second rotating element directly connected with the input shaft and selectively connected to the transmission housing, and a third rotating element operating as an output element and connected with the second motor/generator, an output shaft that transmits torque from the planetary gear set and the second motor/generator to driving wheels through a differential, and a friction member disposed on the selective connecting portion."
        ],
        [
            "Published",
            "02-19-2015",
            "04-16-2015"
        ]
    ],
    "pageTitle": "Huh - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/huh-6/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00298-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 444617320,
    "recordOffset": 444589396,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jun Hoi Huh, Hanam-Si KR 12-27-2012 CAPACITIVE TOUCH PANEL AND A METHOD FOR MANUFACTURING THE SAME - The present invention relates to a capacitive touch panel and a method for manufacturing the same, in which the material having lower resistance than that of ITO is filled in the intaglio formed on the resin layer, which is patterned to form the embedded sensing electrode and the sensing electrodes and the wiring electrodes are formed at the same time by using the same resistance material; in which the capacitive touch panel includes a first sensing layer formed with a plurality of first direction sensing electrodes, which are patterned and a plurality of first wiring electrodes; and a second sensing layer formed with a plurality of second direction sensing electrodes, which are patterned and a plurality of second wiring electrodes; in which the first sensing layer and the second sensing layer are bonded in the mutual vertical direction. 20120327021 Published Description Patent application number Jong Wook Huh, Anseong-Si KR 11-15-2012 WHEEL DRIVE VEHICLE AND WHEEL CONTACT SENSING METHOD OF THE SAME - Disclosed is a wheel drive vehicle including a main body having a rotatable arm and an arm driving unit for driving the arm, a wheel rotatably mounted to the arm, respectively, and a sensing unit for sensing a non-contact state of the wheel from a ground, wherein the sensing unit includes a spring, first and second",
    "textAfterTable": "Jun Hoi Huh, Hanam KR Patent application number Description Published 20140349798 POWER TRANSMISSION DEVICE FOR HYBRID VEHICLE - A power transmission device for a hybrid vehicle includes a series-parallel type power transmission path capable of varying an engine output for each driving mode, using a Ravigneaux gear train and two or more clutches, to improve the fuel efficiency of the hybrid vehicle. The power transmission device includes two or more kinds of engine fixing gear stages capable of distributing the output of the engine to a driving wheel, which are implemented using the Ravigneaux gear train, in which a single pinion planetary gear is integrally configured with a double pinion planetary gear including a carrier obtained by combining two pinion gears with the two or more clutches. 11-27-2014 Jun Woo Huh, Daejeon KR Patent application number Description Published 20140154565 ELECTRODE ASSEMBLY, FABRICATING METHOD OF THE ELECTRODE ASSEMBLY AND ELECTROCHEMICAL CELL CONTAINING THE ELECTRODE ASSEMBLY - A fabricating method of a unit structure for accomplishing an electrode assembly formed by a stacking method, and an electrochemical cell including the same are disclosed. The fabricating method of the electrode assembly is characterized with fabricating the unit structure by conducting a first process of laminating and forming a bicell having a first electrode/separator/second electrode/separator/first electrode structure, and conducting a second process of laminating first separator/second electrode/second separator one by one on one of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}