{
    "relation": [
        [
            "Task ID",
            "isis",
            "rib",
            "basic-services"
        ],
        [
            "Operations",
            "execute",
            "read, write",
            "read, write"
        ]
    ],
    "pageTitle": "Routing Command Reference for Cisco NCS 6000 Series Routers - IS-IS Commands [Cisco Network Convergence System 6000 Series Routers] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/ncs6000/software/routing/command/reference/b-routing-cr-ncs6k/b-routing-cr-ncs6k_chapter_0100.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00087-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 371587255,
    "recordOffset": 371465769,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{323055=seconds : 1200 seconds (20 minutes), 958301=Summary prefix designated for a range of IPv6 prefixes. The ipv6-prefix argument must be in the form documented in RFC 2373, in which the address is specified in hexadecimal using 16-bit values between colons., 654300=(Optional) Specifies that the output be restricted to the last number of entries. Range is 1 to 1000., 333792=See RFC 2973 for details about the mesh group specification., 273177=Under normal conditions, the default MTU size should be sufficient. However, if the MTU size of a link is less than 1500 bytes, the LSP MTU size must be lowered accordingly on each router in the network. If this action is not taken, routing becomes unpredictable., 654734=(Optional) Specifies that the output be restricted to the first number of entries. Range is 1 to 1000., 128794=Advertised hold time in IS-IS hello packets is set to the hello multiplier times the hello interval. Range is 3 to 1000. Neighbors declare an adjacency to this down router after not having received any IS-IS hello packets during the advertised hold time. The hold time (and thus the hello multiplier and the hello interval) can be set on an individual interface basis, and can be different between different networking devices in one area., 275662=The following example shows how to set the MTU size to 1300 bytes:}",
    "textBeforeTable": "Syntax Description { unicast } { ipv4 | ipv6 } address-family no { unicast } { ipv4 | ipv6 } address-family To enter address family configuration mode for configuring Intermediate System-to-Intermediate System (IS-IS) routing that use standard IP Version 4 (IPv4) and IP Version 6 (IPv6) address prefixes, use the address-family command in router configuration or interface configuration mode. To disable support for an address family, use the no form of this command. address-family (IS-IS) trace (IS-IS) tag (IS-IS) suppressed summary-prefix (IS-IS) spf prefix-priority (IS-IS) spf-interval snmp-server traps isis single-topology shutdown (IS-IS) show protocols (IS-IS) show isis topology show isis statistics show isis spf-log show isis route show isis protocol show isis neighbors show isis mpls traffic-eng tunnel show isis mpls traffic-eng advertisements show isis mpls traffic-eng adjacency-log show isis mesh-group show isis lsp-log show isis interface show isis hostname show isis fast-reroute show isis database-log show isis database",
    "textAfterTable": "An address family is not specified. The default subaddress family (SAFI) is unicast. Command Modes Router configuration Interface configuration Command History Release Modification Release 5.0.0 This command was introduced. Usage Guidelines To use this command, you must be in a user group associated with a task group that includes appropriate task IDs. If the user group assignment is preventing you from using a command, contact your AAA administrator for assistance. Use the address family command to place the router or interface in address family configuration mode. In router address family configuration mode, you can configure routing that uses standard IPv4 or IPv6 address prefixes. An address family must be specified in interface configuration mode. In interface address family configuration mode, you can alter interface parameters for IPv4or IPv6. You must specify an address family in order to configure parameters that pertain to a single address family. Task ID",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}