{
    "relation": [
        [
            "Release",
            "10.3",
            "12.2(33)SRA",
            "12.2SX"
        ],
        [
            "Modification",
            "This command was introduced.",
            "This command was integrated into Cisco IOS Release 12.2(33)SRA.",
            "This command is supported in the Cisco IOS Release 12.2SX train. Support in a specific 12.2SX release of this train depends on your feature set, platform, and platform hardware."
        ]
    ],
    "pageTitle": "Cisco IOS Wide-Area Networking Command Reference - x25 accept-reverse through x25 pvc XOT [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/wan/command/wan-cr-book/wan-x1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 360336347,
    "recordOffset": 360270461,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{9100=The following example assigns the X.121 address of 12345 to the TTY line:, 1110=An X.25 call may be addressed to the receiving interface; calls addressed to the receiving interface are eligible for acceptance as a datagram encapsulation, PAD or QLLC connection, and may not be routed. In the following example, serial interface 0 is configured with a native address of 0000123 and a destination alias for any address that starts with 1111123. That is, serial interface 0 can accept its own calls and calls for any destination that starts with 1111123.}",
    "TableContextTimeStampAfterTable": "{352373=Maximum input packet size (in-size) and output packet size (out-size) for both the PVC and SVC. Values may differ but must be one of the following: 16, 32, 64, 128, 256, 512, 1024, 2048, or 4096., 367987=Maximum input packet size (in-size) and output packet size (out-size) for the PVC. Both values must be one of the following values: 16, 32, 64, 128, 256, 512, 1024, 2048, or 4096., 358980=The last x25 pvc command configures the circuit to accept an incoming call from 101603 to 201700 and connects the call to PVC 7 on serial interface 0. If no data is sent or received on the circuit for two minutes, the call will be cleared. If traffic is received on PVC 7 on serial interface 0 before the call is established, a call will be placed to 101503 to 201700., 226179=Cisco supports RFC 1144 TCP/IP header compression (THC) on serial lines using HDLC and X.25 encapsulation. THC encapsulation is only slightly different from other encapsulation traffic, but these differences are worth noting. The implementation of compressed TCP over X.25 uses one virtual circuit to pass the compressed packets. Any IP traffic (including standard TCP) is separate from TCH traffic; it is carried over separate IP encapsulation virtual circuits or identified separately in a multiprotocol virtual circuit., 5462=The following example configures serial interface 0 to require an EXEC command from you before it participates in emergency mode. The host IP address is 21.0.0.12, and the address of the remote BFE unit is 21.0.0.1. When the BFE enters emergency mode, the Cisco IOS software prompts you for the bfe enter EXEC command to direct the router to participate in emergency mode., 207676=snap --RFC 1356 operation where IP is identified with SNAP rather than the standard Internet Engineering Task Force (IETF) method (the standard method is compatible with RFC 877)., 242932=(Optional) Proposes maximum input packet size (in-size) and maximum output packet size (out-size). Both values typically are the same and must be one of the following values: 16, 32, 64, 128, 256, 512, 1024, 2048, or 4096., 180502=ietf --Default RFC 1356 operation: protocol identification of single-protocol virtual circuits and protocol identification within multiprotocol virtual circuits use the standard encoding, which is compatible with RFC 877. Multiprotocol virtual circuits are used only if needed., 149091=The following example sets a valid outgoing-only virtual circuit range of 2000 to 2005:, 339482=snap --RFC 1356 operation where IP is identified when more than one protocol is carried using the SNAP encoding., 92892=1024 for X.25 network service interfaces; 4095 for CMNS network service interfaces., 185249=Proposes maximum input packet size (in-size) and maximum output packet size (out-size) for an outgoing call. Both values typically are the same and must be one of the following values: 16, 32, 64, 128, 256, 512, 1024, 2048, or 4096., 358422=The second x25 pvccommand configures the circuit to allow incoming calls from 101602 to 201700 to be connected to PVC 6 on serial interface 1. Because idle is set to 0, the call will remain connected until cleared by the remote host or an X.25 restart. Because outgoing calls are not permitted for this connection, if traffic is received on PVC 6 on serial interface 0 before the call is established, the traffic will be discarded and the PVC will be reset., 340411=Maximum input packet size (in-size) and output packet size (out-size) for the PVC. Both values are typically the same and must be one of the following values: 16, 32, 64, 128, 256, 512, 1024, 2048, or 4096., 265565=In the following example, when serial interface 1/0 receives a call from a remote host that has the X.121 address 12132, the router will open a TCP connection to port number 9999 on the TCP/IP host that has the IP address 10.0.0.1., 38827=Proposes input maximum packet size (in-size) and output maximum packet size (out-size) for flow control parameter negotiation.Both values must be one of the following values: 16, 32, 64, 128, 256, 512, 1024, 2048, or 4096., 126172=Byte count. It can be one of the following values: 16, 32, 64, 128, 256, 512, 1024, 2048, or 4096., 339056=ietf --Default RFC 1356 operation; single-protocol encapsulation unless more than one protocol is carried, and protocol identification when more than one protocol is carried., 251107=In the following example, when the router receives a TCP connection request on port 9999, the host will make an X.25 call to X.121 address 12131 with no call user data., 14775=The following example configures serial interface 0 to require an EXEC command from you before it participates in emergency mode. The host IP address is 21.0.0.12, and the address of the remote BFE unit is 21.0.0.1. When the BFE enters emergency mode, the Cisco IOS software prompts you for the bfe enterEXEC command to direct the router to participate in emergency mode., 66975=The following example sets a valid outgoing-only VC range of 2000 to 2005:, 181031=snap --RFC 1356 operation where IP is identified with SNAP rather than the standard IETF method (the standard method is compatible with RFC 877)., 357850=Traffic received on PVC 5 on serial interface 0 will cause a call to be placed from address 201700 to the X.121 address 101601. The routing table will then forward the call to serial interface 2. If no data is sent or received on the circuit for two minutes, the call will be cleared, as defined by the x25 idle command. All incoming calls from 101601 to 201700 will be refused, as defined by the no-incoming attribute., 285314=Byte count that is one of the following: 16, 32, 64, 128, 256, 512, 1024, 2048, or 4096.}",
    "textBeforeTable": "Command History Interface configuration X.25 profile configuration Command Modes Disabled Command Default This command has no arguments or keywords. Syntax Description accept-reverse x25 no accept-reverse x25 To configure the Cisco IOS software to accept all reverse-charge calls, use the x25 accept-reversecommand in interface or X.25 profile configuration mode. To disable this facility, use the no form of this command. x25 accept-reverse x25 pvc (XOT) x25 pvc (switched) x25 pvc (switched PVC to SVC) x25 pvc (encapsulation) x25 profile x25 pad-access x25 ops x25 nvc x25 modulo x25 map rbp remote x25 map rbp local x25 map pad x25 map compressedtcp x25 map cmns x25 map bridge x25 map x25 ltc x25 loc x25 linkrestart x25 lic x25 ips x25 ip-precedence x25 idle x25 hunt-group",
    "textAfterTable": "Usage Guidelines This command causes the interface to accept reverse-charge calls by default. You can also configure this behavior for each peer with the x25 map interface configuration command. Examples The following example sets acceptance of reverse-charge calls:  interface serial 0 x25 accept-reverse Related Commands Command Description x25 map Sets up the LAN protocols-to-remote host mapping. x25 address To set the X.121 address of a particular network interface, use the x25 address command in interface or X.25 profile configuration mode. x25 address x121-address Syntax Description",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}