{
    "relation": [
        [
            "First Name",
            "Lisa",
            "Matthew"
        ],
        [
            "Last Name",
            "Rickard",
            "Webb"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=29B9B0A4-B691-4413-957E-D79FC4094FA8&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00256-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 229176200,
    "recordOffset": 229167998,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 21547=H.R. 2635, lawsuit-related provisions of the Carbon-Neutral Government Act, 27757=H.R. 3013/S. 186/S. 3217, Attorney-Client Privilege Protection Act S. 1267/H.R. 2102, Free Flow of Information Act S. 221, Fair Contracts for Growers Act General background on legal reform issues S. 1135, the Fair Arbitration Act H.R. 2419, the arbitration-related provisions contained in section 11102 of the Farm, Nutrition, and Bioenergy Act H.R. 2135, the arbitration-related provisions of the Competitive and Fair Agricultural Markets Act H.R. 3915, the arbitration-related provisions contained in section 206 of the Mortgage Reform and Anti-Predatory Lending Act S. 1782/H.R. 3010, Arbitration Fairness Act Mass tort litigation/medical screening reform and investigations General background on discovery reform General background on the preservation of the attorney-client privilege P.L. 109-2, Class Action Fairness Act S. 2449/H.R. 5884, Sunshine in Litigation Act S. 2636, the arbitration-related provisions of the Foreclosure Prevention Act S. 2554/H.R. 5129, the arbitration-related provisions of the Civil Rights Act of 2008 H.R. 5312, Automobile Arbitration Fairness Act H.R. 1519, the arbitration-related provisions of the American Homebuyers Protection Act H.R. 1443, the arbitration related-provisions of the Consumer Fairness Act H.R. 2061, the arbitration-related provisions of the Predatory Mortgage Lending Practices Redution Act H.R. 3393, the arbitration-related provisions of the Reservist Access to Justice Act S. 2838/H.R. 6126, Fairness in Nursing Home Arbitration Act H.R. 5913, Protecting Americans from Unsafe Foreign Products Act, 16031=H.R. 4040, Consumer Product Safety Modernization Act S. 2045/S. 2663, CPSC Reform Act S. 2831, Federal Trade Commission Reauthorization Act, 40537=Implementation of H.R. 3580 (P.L. 110-085), the drug labeling and preemption provisions of the Food and Drug Administration Amendments Act General Background on Drug Labeling Rules and Preemption H.R. 6381, Medical Device Safety Act of 2008, 46309=H.R. 3773, the lawsuit immunity-related provisions of the FISA Amendments Act of 2008 S. 2248, the lawsuit immunity-related provisions of the FISA Amendments Act of 2007, 12235=S. 1638/H.R. 3753, Federal Judicial Salary Restoration Act S. 2353, Fair Judicial Compensation Act S. 2041/H.R. 4854, False Claims Act Correction Act S. 2450, the untitled bill designed to amend the Federal Rules of Evidence to address the waiver of the attorney-client privilege and the work product doctrine General background and information on the doctrine of Federal preemption H.R. 1, P.L. 110-53, preemption-related homeland security and railroad provisions of the Implementing Recommendations of the 9/11 Commission Act of 2007, 34484=H.R. 2989, an amendment to the Death on the High Seas Act dealing with retroactive expansion of liability under the Death on the High Seas Act, 18887=H.R. 4110, Restitution for Victims of Crime Act of 2007, 43405=H.R. 6049, tax deduction for contingency fee lawyers provision in the Renewable Energy and Job Creation Act of 2008 S. 814, untitled legislation to amend the Internal Revenue Code of 1986 to allow the deduction of attorney-advanced expenses and court costs in contingency fee cases}",
    "textBeforeTable": "",
    "textAfterTable": "City Washington State DC Zip Code 20062 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  Steven J. Law  2026596000  slaw@uschamber.com 5. Senate ID#  51172-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}