{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is located just blocks from downtown Searcy. The main aspect of campus safety is that Harding University is committed to Christian values which greatly reduces the number of security-related problems that are so common on other college campuses.",
            "Harding does not have traditional fraternities and sororities. Instead there are social clubs that do service projects and promote school spirit. Harding assures club membership to all students who desire it.",
            "Area churches to participate and serve. --Theatre productions --Musicals --Art Shows --Athletic events --Honor Societies --10+ music organizations --Student Publications: newspaper & yearbook --Social Clubs --Student Association",
            "Students who have an all-encompassing love for God and other people will love Harding University. Students who prefer a smaller college environment.",
            "The swing in the gardens is a great tradition. --Regular student-led devotionals --Homecoming --Spring Sing Variety Show with over 1000 students participating --Annual Lectureship that connects with churches around the world.",
            "I am a non-resident student paying out of state tuition at a private Christian university and the cost is only $2000 more a year than if I had attended a state-supported school in my home state.",
            "Too many things to list. From athletic events, to club formals, to Spring Sing. Harding is a great place to be.....",
            "Not the best food in the world, but a great place to meet up with friends.",
            "I had the time of my life my first year at Harding. I cannot wait to go back....",
            "You have to study, but the professors are so helpful. Because it is a smaller school the class sizes are not so ridiculously large that you are just a number.",
            "Go with an open mind. You will meet so many new friends so try not to make roommate decisions until you get to HU and begin to meet people. Make sure you attend chapel. It will change your life.",
            "Attending Harding University is a life-changing experience, and one of the best decisions I have ever made because you aren't just a number or a face-in-the-crowd you're a person that the professors and staff; all the way up to the President of the university, know by name. Not only do you grow spiritually in your relationship with Jesus Christ, but you are offered an amazing opportunity to obtain a great education. You will never be disappointed if you choose Harding University as your location to pursue your dream of a college degree."
        ]
    ],
    "pageTitle": "Harding University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Harding-University/reviews?_escaped_fragment_=/show/92355",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00234-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907323759,
    "recordOffset": 907264843,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{126532=There is always something going on at campus! Social club stuff starts this thursday. (August 28th), 102790=The swing in the gardens is a great tradition. --Regular student-led devotionals --Homecoming --Spring Sing Variety Show with over 1000 students participating --Annual Lectureship that connects with churches around the world., 129674=I live in Stephens which is an upperclassmen female dorm (however, freshman overflow can get in and its much nicer than other freshman dorms.) and I absolutely love it. The atmosphere is what's great. You can go down the hall and know everyone and wave to them and stop and genuinely ask about their day. Plus, they aren't tiny by any means. Stephens was remodeled in 2011 and I believe they are planning on building another dorm as well due to the amount of freshman coming in are multiplying each year. The opposite gender is not allowed on any floor except the lobby and they can't be in each other's rooms aside from during open dorm. The goal of this is to make sure we keep Harding's christian mission, and while some people are bothered by this, it has never affected me. I love it. There is also a midnight curfew on week days and one AM on weekends. I've never had a reason to be out past midnight because if you're following your pledge (to not drink, party, go to clubs, etc) then except for midnight walmart trips, going out late at night is pointless. I like not coming home to a drunk roommate or a suitemate with a boy in her bed. The rules are like boundaries. They keep us safe. I know some of you will think that's hogwash and that's fine. It's all about perspective. If you think of the rules as guidelines and less like fences and collars, you will love dorm life. You do have to live on campus until you're 22 or married so basically your whole time here. But honestly, I wouldn't want to live off of campus. You miss too much just being gone on the weekends. Just this past week, we had the Ice Bucket Challenge, Steps Devos constantly, Spider-Man 2 showing, blood drives, etc. :) You will be happier if you live on campus and get involved!, 103309=I am a non-resident student paying out of state tuition at a private Christian university and the cost is only $2000 more a year than if I had attended a state-supported school in my home state., 266673=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/17/2009 Reviewer is A current student here. 12 out of 12 people found this review useful. 1 of 59 Brittanie from Fort Worth, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Categories Comments Great for these types of students Members of the Church of Christ or any Christian religion, personable people, Bible majors, Nursing majors. Tips for prospective students This school is conservative so if you expect to get drunk every night and just party all the time then this isn't the school for you. It's a great place to live a christian life. Bang for the buck The school is expensive but I would never leave it. Am enjoying being here The people are some of the nicest you'll ever meet. Most of the boys aren't just looking for hookups. People find creative activities to do and are very personable. Am learning a lot I am not just learning things in my field of study but also from experiences. Login to rate or flag the reviews Noelani from Manchester, NH 10/05/2010 Reviewer is A current student here. 6 out of 6 people found this review",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}