{
    "relation": [
        [
            "Payment method",
            "",
            "Money Order/Bank cheque",
            "Personal cheque"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "IT'S A Grand Life DVD NEW Sealed Frank Randle Diana Dors DAN Young 5060082511615 | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/Its-A-Grand-Life-DVD-NEW-SEALED-Frank-Randle-Diana-Dors-Dan-Young-/350552780242",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 422647759,
    "recordOffset": 422606106,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details business days of receiving cleared payment - opens in a new window or tab. Will usually send within 3 Domestic handling time Please enter five or nine numbers for the postcode. Please enter a valid postcode. Postcode: Select a valid country. There are 26 items available. Please enter a number less than or equal to 26. -Select- Australia Austria Belgium Denmark Finland Germany Guernsey Iceland Jersey Luxembourg Norway Sweden Switzerland",
    "textAfterTable": "Seller's payment instructions Any customers outside the UK must pay by Paypal please. Payment by Paypal, cheque or postal order is more than welcome from UK customers. If paying by post please use the Pay button to complete Checkout, this will let us know how you are going to pay and provide a page that can be printed to include with your payment. If including your own note please include your User ID, without your ID your order will be delayed. Please do not make payments out to our User ID, we can not accept them. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}