{
    "relation": [
        [
            "Region",
            "All countries",
            "Industrial Countries",
            "Emerging Market Economies"
        ],
        [
            "Before",
            "0.23",
            "0.15",
            "0.32"
        ],
        [
            "Peak Boom",
            "0.15",
            "0.08",
            "0.23"
        ],
        [
            "After",
            "0.23",
            "0.31",
            "0.14"
        ],
        [
            "Total",
            "0.60",
            "0.54",
            "0.68"
        ]
    ],
    "pageTitle": "FRB: An Anatomy of Credit Booms: Evidence From Macro Aggregates and Micro Data",
    "title": "",
    "url": "http://www.federalreserve.gov/pubs/ifdp/2008/936/ifdp936.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00119-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 452789415,
    "recordOffset": 452736451,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=The thresholds method proposed by GVL uses the ratio of nominal credit to the private sector to nominal GDP as the measure of credit.18 They define the long-run trend of credit using an \"expanding trend\" by applying the HP filter as follows: Given a sample of data for dates =1,...,T, denote as the expanding HP trend of the credit-GDP ratio in country i at date t, for 1 ≤ t ≤ T. This expanding trend is the trend component of the HP filter applied to the sequence of data , where is a positive integer that defines the length of a sample of \"initial data.\" In particular, GVL used a sample for 1960-1996 and set =5, so their expanding trend starts in 1965 with as the 1965 value of the HP trend computed using data from 1960 to 1965, is the 1966 value of the HP trend computed using data from 1960 to 1966, and so on. Thus, the sample over which the trend is computed expands by one year as each successive year in the sample is added. GVL compute all these trends setting the HP smoothing parameter to 1000.19}",
    "TableContextTimeStampAfterTable": "{412111=1/  Because of data availability we have used the 1975-2005 period only. 2/  The three-year average of capital inflow before the peak of the boom ranks in the top quartile of their corresponding country group. 3/   The three-year average of the annual growth rate of TFP before the peak of the boom ranks in the top quartile of their corresponding country group. 4/   The three-year change before the peak of the boom in the financial reform index ranks in the top quartile of their corresponding country group., 69076=Klenow, Peter and Andres Rodriguez-Clare (1997). \"The Neoclassical Revival in Growth Economics: Has It Gone Too Far?\" in B. Bernanke and J. Rotemberg (eds.) Macroeconomics Annual 1997, pp. 73-102., 50786=The bank-level data was obtained from Bankscope and it covers the 1995-2005 period.14 These data include balance sheet information for commercial banks, saving banks, cooperative banks, mortgage banks, medium- and long-term credit banks, and bank holding companies. The coverage varies from country to country, and since the sample starts in 1995 our analysis of banking behavior around credit booms is limited to the last decade. In the analysis below, we do not report bank indicators for the industrial countries because these countries have experienced only three credit booms since 1995. It is worth noting, however, that the behavior of these indicators is broadly in line with that observed in the emerging market economies., 5133=We apply our method to data for 48 countries over the 1960-2006 period and find 27 credit booms in industrial countries and 22 in emerging economies. We then take the peak dates of these booms and construct seven-year event windows around them to examine the dynamics of macro aggregates and firm- and bank-level financial indicators during credit booms. The results show that credit booms are associated with periods of economic expansion, rising equity and housing prices, real appreciation and widening external deficits in the build-up phase of the booms, followed by the opposite dynamics in the downswing. Credit booms also feature similar pro-cyclical movements in firm-level indicators of leverage, firm values, and use of external financing, and in bank-level indicators of credit issuance and asset returns. The banks' ratios of capital adequacy and non-performing loans show the opposite pattern (falling in the upswing and rising in the aftermath). Moreover, credit booms tend to be synchronized internationally and centered on \"big events\" like the 1980s debt crisis, the 1992 ERM crisis, and the 1990s Sudden Stops in emerging economies. In addition, splitting our sample into financial crisis vs. non-crisis cases, we find that booms in the crisis group were larger., 430282=*  We thank participants at the 2007 AEA Meetings in Chicago and the April 2008 IMF conference on \"Financial Cycles, Liquidity and Securitization\" for comments and suggestions. We also thank Ricardo Caballero, Charles Calomiris, Stijn Claessens, Jose De Gregorio, Giovanni Dell'Ariccia, Simon Gilchrist, Dale Henderson, Ayhan Kose, and Jonathan Ostry for their comments, and Dio Kaltis for high-quality research assistance. The views in this paper are solely the responsibility of the authors and should not be interpreted as reflecting the views of the Board of Governors of the Federal Reserve System or the International Monetary Fund or of any person associated with the Federal Reserve System. Return to text, 313=Board of Governors of the Federal Reserve System International Finance Discussion Papers Number 936, July 2008--- Screen Reader Version*, 10809=Our frequency analysis of the association of credit booms with capital inflows, financial reforms, and TFP gains is related to theoretical and empirical studies on the mechanisms that drive credit booms. These include theories in which excessive credit expansion is due to herding behavior by banks (Kindleberger (2000)); information problems that lead to bank-interdependent lending policies (Rajan (1994) and Gorton and He (2005)), the underestimation of risks (Borio, et. al. (2001)) and the lowering of lending standards (Dell'Ariccia and Marquez (2006)); the presence of explicit or implicit government guarantees (Corsetti, et. al. (1999)); or limited commitment on the part of borrowers (Lorenzoni (2005)).Similarly, our analysis of the connection between credit booms and macroeconomic activity is related to the literature on business cycle models that incorporate \"financial accelerators,\" by which shocks to asset prices and relative good prices are amplified through balance sheet effects (see, for example, Fisher (1933), Bernanke and Gertler (1989), Bernanke, Gertler and Gilchrist (1999), Kiyotaki and Moore (1997), and Mendoza (2005) and (2006))., 25079=Our baseline results in Panel 1 indicate that Chile experienced a credit boom that peaked in 1981 and lasted five years (from 1979 to 1983). Panel 3 shows that if we use the credit-GDP ratio as the measure of credit, the boom peaks in 1984 and also lasts five years (from 1981 to 1985). Thus, under our method the choice of credit variable affects the timing of the boom but not its duration. In contrast, Panels 2 and 4 show that increasing the smoothing parameter from 100 to 1000 affects the timing of the boom, and increases both the size of its peak and its duration. This occurs because a larger smoothing parameter produces a smoother trend with larger and more persistent deviations from trend., 26253=The results in Panel 1 of Figure 5 are nearly identical to those obtained by GVL (see Figure 2b in their paper), confirming that our implementation of their methodology is accurate. The GVL method indicates that Chile experienced a credit boom that peaked in 1982 and lasted fourteen years (from 1971 to 1984).10Panels 3 and 4 show that if we change the credit measure to real credit per capita, the GVL method cannot identify a credit boom in Chile in the sample period, regardless of the value of the smoothing parameter. This is because deviations from trend in real credit per capita at least as large as 19.5 percent were not observed in Chile, and indeed are extremely large relative to the Chilean history of deviations from trend in real credit per capita. In contrast, our method adjusts the boom threshold to the observed country cyclical variability of credit. As a result, our methodology is robust to the choice of measuring credit in real per capita terms v. as a share of GDP., 71254=Rajan, Raghuram G. (1994). \"Why Bank Credit Policies Fluctuate: A Theory and Some Evidence,\" Quarterly Journal of Economics, Vol. 109, pp. 399-441., 434631=7.  For example, Rajan (2005) argues that technical change, deregulation, and institutional change have resulted in an increasing number of arm's length transactions away from banks in the financial system. Return to text, 434201=6.  There are also four emerging economies (India, South Africa, Turkey, and Venezuela) that were identified as experiencing credit booms in 2006, the end of the sample period, but they were excluded from the event analysis because they have yet to be completed (i.e. the ending thresholds have yet to be crossed). Return to text, 415718=Australia (AUS, 1989), Austria (AUT, 1972 and 1980), Belgium (BEL, 1980 and 1990), Canada (CAN, 1967), Denmark (DNK, 1987 and 1991), Finland (FIN, 1991), France (FRA, 1991), Germany (DEU, 1973), Greece (GRC, 1972), Ireland (IRL, 1979 and 2000), Italy (ITA, 1973 and 1992), Japan (JPN, 1973), Netherlands (NLD, 1979), New Zealand (NZL, 1974), Norway (NOR, 1988), Portugal (PRT, 1973 and 2001), Spain (ESP), Sweden (SWE, 1990), Switzerland (CHE, 1990), United Kingdom (GBR, 1974 and 1990), and United States (USA, 1999)., 44682=Consider now the frequency analysis of the association between credit booms and large capital inflows, financial reforms, and TFP gains. Capital inflows are measured as gross liability flows (i.e. foreign direct investment, portfolio flows, and other investments liabilities) in percent of GDP, using data from IFS (see Appendix 2). We define a state of large capital inflows as of date when the preceding three-year average of capital inflows ranked on the top quartile of its respective country group (i.e. emerging markets, industrial countries, or both) over the 1975-2006 period.12 Domestic financial reforms are measured using the index produced by Abiad, Detragiache, and Tressel (2007). This index takes values between 0 and 21 and includes information on reserve requirements and credit controls, interest rate controls, barriers to entry, state ownership, policies on securities markets, banking regulation, and capital account restrictions. We identify a country undertaking significant financial reforms as of date if the preceding three-year change in this index ranks on the top quartile of its respective country group over the 1975-2002 period. Our measure of TFP is based on standard growth accounting methods (see, for instance, Klenow and Rodriguez (1997) and Kose, Prasad, and Terrones (2008)), using labor and investment data from PWT 6.2. A country is identified to have experienced high TFP growth as of date if the preceding three-year average of TFP growth ranked on the top quartile of its respective group over the 1975-2006 period., 435421=10.  GVL dated the peak in the same year and found the boom to be of about the same magnitude, but estimated its duration at 10 years. This difference is due to the longer sample in our data (which ends in 2006 instead of 1996), and because of data revisions in the credit-to-GDP data relative to our sample. Return to text, 71449=Rajan, Raghuram G. (2005). \"Has Financial Development Made the World Riskier?\" In The Greenspan Era: Lessons for the Future, pp. 313-369. Federal Reserve Bank of Kansas City, 416290=Algeria (DZA), Argentina (ARG, 1982), Brazil (BRA), Chile (CHL, 1981), Colombia (COL, 1997), Costa Rica (CRI, 1979), Côte d'Ivoire (CIV, 1978), Ecuador (ECU), Egypt (EGY,1982), Hong Kong (HKG, 1998), India (IND,*), Indonesia (IDN, 1997), Israel (ISR, 1979), Jordan (JOR, 1970), Korea (KOR, 1998), Malaysia (MYS, 1997), Mexico (MEX, 1994), Morocco (MAR, 1977), Nigeria (NGA, 1982), Pakistan (PAK, 1986), Peru (PER), Philippines (PHL, 1983 and 1997), Singapore (SGP, 1984), South Africa (ZAF, *), Thailand (THA, 1997), Turkey (TUR, 1997 and *), Uruguay (URY, 1981), and Venezuela, Rep. Bol. (VEN, *)., 64408=Bernanke, Ben, Mark Gertler, and Simon Gilchrist (1999). \"The Financial Accelerator in and Quantitative Business Cycle Framework.\" In Handbook of Macroeconomics, Vol. 1C, ed. by John Taylor and Michael Woodford (Amsterdam: North-Holland), pp. 1531-1614., 59938=This paper proposed a new thresholds method for measuring credit booms, used this method to identify credit booms in industrial and emerging economies, and conducted an event study analysis of the dynamics of macro aggregates and micro-level financial indicators during credit booms. We identified 27 credit booms in industrial countries and 22 in emerging economies during the 1960-2006 period. The build up phase of these booms is associated with economic expansions, rising equity and housing prices, real currency appreciation, and widening external deficits, followed by the opposite dynamics in the downswing. Similar dynamics are observed in firm-level indicators of leverage, firm values, and dependence on external financing, and in bank-level indicators of asset quality, profitability and lending activity. Moreover, credit booms tend to be synchronized internationally and centered on \"big events\" like the 1980s debt crisis, the 1992 ERM crisis, and Sudden Stops in emerging economies., 17763=We use data on credit from the financial sector to the private non-financial sector obtained from the IMF's International Financial Statistics for a sample of 49 countries, 21 industrial and 28 emerging economies (see Appendix 1), for the 1960-2006 period. Our measure of credit is the sum of claims on the private sector by deposit money banks (IFS line 22d) plus, whenever available for the entire sample period for a given country, claims on the private sector by other financial institutions (IFS line 42d). Because credit is a year-end stock variable that we are going to compare with flow variables like output and expenditures, real credit per capita is calculated as the average of two contiguous end-of-year observations of nominal credit per capita deflated by their corresponding end-of-year consumer price index. Data sources for these and all other variables used in the paper are listed in Appendix 2., 50093=The firm-level data correspond to nonfinancial, publicly-traded firms as reported in Worldscope and Datastream. The sample period is 1980 to 2005 for the industrial countries and 1991 to 2005 for the emerging markets. This restricts our analysis to credit booms dated after 1991 in the emerging markets. Moreover these data have the drawbacks that the coverage is limited to corporations listed in stock exchanges, and that they are reported on a fiscal year basis, rather than calendar year. Note, however, that there is no other firm-level, cross-country database with wider coverage available.13, 66431=Dell'Ariccia, Giovanni, and Robert Marquez (2006). \"Lending Booms and Lending Standards.\" The Journal of Finance, Vol. 51, No. 5, pp. 2511-2546.}",
    "lastModified": "Mon, 28 Jul 2008 19:20:39 GMT",
    "textBeforeTable": "Data for Figure 1 Figure 1:  Credit Booms: Seven-Year Event Windows (Deviations from HP-trend in Real Credit Per-Capita) Tornell, Aaron, and Frank Westermann (2005). Boom-Bust Cycles and Financial Liberalization. Cambridge, MA: The MIT Press. Scheneider, Martin and Aaron Tornell (2004). \"Bailout Guarantees, Balance Sheet Effects and Financial Crises.\" Review of Economic Studies. Reinhart Carmen M. and Kenneth S. Rogoff (2004), \"The Modern History of Exchange Rate Arrangements: A Reinterpretation,\" Quarterly Journal of Economics, v 119(1), pp. 1-48. Rajan, Raghuram G. (2005). \"Has Financial Development Made the World Riskier?\" In The Greenspan Era: Lessons for the Future, pp. 313-369. Federal Reserve Bank of Kansas City Rajan, Raghuram G. (1994). \"Why Bank Credit Policies Fluctuate: A Theory and Some Evidence,\" Quarterly Journal of Economics, Vol. 109, pp. 399-441. Ottens, Daniel, Edwin Lambregts, and Steven Poelhekke (2005). \"Credit Booms in Emerging Market Economies: A Recipe for Banking Crises?.\" Manuscript, De Nederlandsche Bank. Neumeyer, Pablo and Fabrizio Perri (2005). \"Business Cycles in Emerging Economies: The Role of Interest Rate.\" Journal of Monetary Economics, V. 52, pp. 345-380. Montiel, Peter (2001). \"What Drives Consumption Booms?.\" The World Bank Review, Vol. 14, No. 3 , pp. 457-480. ----- (2006). \"Endogenous Sudden Stops in a Business Cycle Model with Collateral Constraints: A Fisherian Deflation of Tobin's Q.\" NBER Working Paper No. 12564; Cambridge, MA: National Bureau of Economic Research. ----- (2005). \"Real Exchange Volatility",
    "textAfterTable": "8.16 9.95 18.51 21.77 0 13.02 13.84 25.88 28.17 1 9.54 9.58 21.10 22.62 2 3.44 3.10 6.51 6.33 3 -1.26 -1.38 -0.24 -5.78 Figure 2:  Relative Credit Booms: Seven-Year Event Windows (Deviation from trend at peak of credit boom as a ratio of the std deviation of credit) 1/  Emerging Market Economy ongoing credit booms are shown in green. Data for Figure 2 Industrial Countries: Country Industrial Countries: Ratio Emerging Markets: Country Emerging Markets: Ratio DNK_1991 1.829",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}