{
    "relation": [
        [
            "",
            "Tightened considerably",
            "Tightened somewhat",
            "Remained basically unchanged",
            "Eased somewhat",
            "Eased considerably",
            "Total"
        ],
        [
            "Number of Respondents",
            "0",
            "4",
            "12",
            "1",
            "0",
            "17"
        ],
        [
            "Percent",
            "0.0",
            "23.5",
            "70.6",
            "5.9",
            "0.0",
            "100.0"
        ]
    ],
    "pageTitle": "FRB: Senior Credit Officer Survey on Dealer Financing Terms, June 2012",
    "title": "",
    "url": "http://www.federalreserve.gov/econresdata/releases/SCOOS_201206.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00071-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437349447,
    "recordOffset": 437316311,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{7501=As in the March survey, respondents indicated that nonprice terms incorporated in new or renegotiated OTC derivatives master agreements were broadly unchanged during the past three months. Dealers also reported that initial margin requirements, which fall outside the scope of the master agreements, were little changed over the same period. However, almost one-fifth of respondents indicated that the posting of nonstandard collateral (that is, other than cash and U.S. Treasury securities) permitted under relevant agreements had increased somewhat., 6214=Responses to the June survey indicated little change, on balance, in credit terms applicable to important classes of counterparties over the past three months. Viewed in conjunction with similar responses to the March survey, the results suggest that these terms have been generally stable since the beginning of the year. However, about one-half of firms, on net, reported an increase in the amount of resources and attention devoted to the management of concentrated exposures to dealers and other financial intermediaries, and about two-thirds of respondents noted such an increase with respect to central counterparties and other financial utilities.1 About one-fourth of respondents indicated that the use of financial leverage by hedge funds had decreased somewhat during the past three months. The use of financial leverage by trading real estate investment trusts (REITs), mutual funds, exchange-traded funds (ETFs), pension funds and endowments, and insurance companies remained basically unchanged.2 Notable net fractions of dealers reported that the provision of differential terms to most-favored hedge funds and trading REITs had increased over the past three months., 8067=With regard to securities financing, survey respondents indicated that the credit terms applicable to the securities types included in the survey were generally little changed, on balance, over the past three months. Modest net fractions of dealers noted that the demand for funding of high-grade and high-yield corporate bonds as well as non-agency residential mortgage-backed securities (RMBS) had increased over the past three months. Dealers reported a much more pronounced increase in demand for funding of agency RMBS with almost one-half of respondents pointing to an increase. Modest net fractions of respondents also reported an increase in demand for term funding with a maturity greater than 30 days for both agency and non-agency RMBS. In contrast to the improvement reported in the March survey, responses to the June survey suggested that liquidity and functioning in the underlying asset markets for most collateral types covered by the survey had remained basically unchanged over the past three months., 12193=Hedge funds. As in March, the responses to the June survey indicated that price and nonprice terms applicable to hedge funds across the spectrum of securities financing and OTC derivatives transactions were little changed over the past three months. Only a small number of dealers reported having changed somewhat price terms (such as financing rates) or nonprice terms (including haircuts, maximum maturity, covenants, cure periods, cross-default provisions, or other documentation features) offered to hedge funds, with some dealers reporting a tightening and others reporting an easing of credit terms. The few institutions that reported an easing of credit terms most frequently pointed to more-aggressive competition from other institutions, and the most important reason cited by the few respondents that reported a tightening was a worsening in general market liquidity and functioning. Only about one-fourth of dealers, a significantly smaller fraction than in the March survey, noted an increase in the intensity of efforts by hedge funds to negotiate more-favorable price and nonprice terms over the past three months. Despite credit terms that were said to be little changed, about one-fourth of respondents--a slightly larger fraction than in March--suggested that the use of financial leverage by hedge funds had decreased somewhat over the past three months. A vast majority of dealers noted that the availability of additional financial leverage under agreements currently in place with hedge funds had remained basically unchanged. About one-fifth of respondents, on net, indicated that the provision of differential terms to most-favored hedge funds had increased somewhat over the past three months., 14674=Mutual funds, exchange-traded funds, pension plans, and endowments. As in March, the responses to the June survey suggested that, on balance, there had been little change in the price and nonprice terms offered to mutual funds, ETFs, pension plans, and endowments during the past three months. Of note, about one-fourth of respondents stated that the intensity of efforts by clients in this category to negotiate more-favorable credit terms had increased somewhat over the same period. Both the provision of differential terms to most-favored mutual funds, ETFs, pension plans, and endowments as well as the use of financial leverage by clients of this type remained basically unchanged., 19755=In contrast to the March survey, which pointed to an improvement in liquidity and functioning in the underlying markets in which the various specified collateral types are traded, dealers reported in June that conditions in these markets had remained basically unchanged.6 As in the March survey, nearly all of the respondents reported that the volume, duration, and persistence of mark and collateral disputes were basically unchanged for all collateral types., 15393=Insurance companies. Dealers reported in the June survey, as they had in March, that price and nonprice terms applicable to insurance companies had remained basically unchanged over the past three months despite an apparent continued increase in the intensity of efforts by such clients to negotiate more-favorable credit terms. The use of financial leverage by clients of this type also remained basically unchanged., 11772=Central counterparties and other financial utilities.About two-thirds of dealers indicated that the amount of resources and attention devoted to management of concentrated exposures to central counterparties and other financial utilities had increased over the past three months. This fraction is somewhat higher than that in the previous survey but similar to that in the December survey., 17365=As in the March survey, dealers reported that nonprice terms incorporated in new or renegotiated OTC derivatives master agreements were broadly unchanged over the past three months.4 A few respondents, on net, indicated that they had tightened requirements, timelines, and thresholds for posting additional margin, and a few noted that they had eased with respect to other documentation features, such as cure periods and cross-default provisions as well as acceptable collateral requirements. Nearly all of the survey respondents noted that initial margins (which fall outside the scope of master agreements) on contracts referencing most underlying collateral types were basically unchanged over the past three months. About one fifth of respondents, on net, indicated that the posting of nonstandard collateral (that is, other than cash and U.S. Treasury securities) permitted under relevant agreements had increased somewhat. For most contract types included in the survey, almost all of the dealers reported that the volume, duration, and persistence of mark and collateral disputes remained basically unchanged over the past three months. However, a few respondents, on net, indicated that the volume of disputes with regard to contracts referencing foreign exchange and equities had decreased., 11360=Dealers and other financial intermediaries. In the June survey, about one-half of respondents indicated that the amount of resources and attention devoted to management of concentrated credit exposure to dealers and other financial intermediaries had increased over the past three months. In the March survey, about one-third of respondents, on net, had reported such an increase., 5262=The June Senior Credit Officer Opinion Survey on Dealer Financing Terms collected qualitative information on changes over the previous three months in credit terms and conditions in securities financing and over-the-counter (OTC) derivatives markets. In addition to the core set of questions, this survey included a set of special questions about derivatives prime brokerage, a second set of special questions focused on bilateral repurchase agreements (repos), and a final set of special questions regarding the appetite of institutional investors for credit and duration risk. The 22 institutions participating in the survey account for almost all of the dealer financing of dollar-denominated securities for nondealers and are the most active intermediaries in OTC derivatives markets. The survey was conducted during the period from May 22, 2012, to June 4, 2012. The core questions ask about changes between March 2012 and May 2012.}",
    "lastModified": "Fri, 04 Oct 2013 19:04:44 GMT",
    "textBeforeTable": "Over the past three months, how has the amount of resources and attention your firm devotes to management of concentrated credit exposure to dealers and other financial intermediaries (such as large banking institutions) changed? Dealers and Other Financial Intermediaries In some questions, the survey differentiates between the compensation demanded for bearing credit risk (price terms) and the contractual provisions used to mitigate exposures (nonprice terms). If your institution's terms have tightened or eased over the past three months, please so report them regardless of how they stand relative to longer term norms. Please focus your response on dollar-denominated instruments; if material differences exist with respect to instruments denominated in other currencies, please explain in the appropriate comment space. Where material differences exist across different business areas--for example, between traditional prime brokerage and OTC derivatives--please answer with regard to the business area generating the most exposure and explain in the appropriate comment space. Questions 1 through 40 ask about credit terms applicable to, and mark and collateral disputes with, different counterparty types, considering the entire range of securities financing and over-the-counter (OTC) derivatives transactions. Question 1 focuses on dealers and other financial intermediaries as counterparties; questions 2 and 3 on central counterparties and other financial utilities; questions 4 through 10 focus on hedge funds; questions 11 through 16 on trading real estate investment trusts (REITs); questions 17 through 22 on mutual funds, exchange-traded funds (ETFs), pension plans, and endowments; questions 23 through 28",
    "textAfterTable": "Central Counterparties and Other Financial Utilities Over the past three months, how has the amount of resources and attention your firm devotes to management of concentrated credit exposure to central counterparties and other financial utilities changed? Number of Respondents Percent Increased considerably 3 13.6 Increased somewhat 12 54.5 Remained basically unchanged 7 31.8 Decreased somewhat 0 0.0 Decreased considerably 0 0.0 Total 22 100.0 To what extent have changes in the practices of central counterparties, including margin requirements and haircuts, influenced the credit terms your institution applies to clients on bilateral transactions which are not cleared? Number of Respondents Percent To a considerable extent 0 0.0 To some extent 7 31.8 To a minimal extent 10 45.5 Not at all 5 22.7 Total 22 100.0 Back to section top",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}