{
    "relation": [
        [
            "Year of Coverage",
            "1972",
            "1973",
            "1974",
            "1975",
            "1976",
            "1977",
            "1978",
            "1979",
            "1980",
            "1981",
            "1982",
            "1983",
            "1984",
            "1985",
            "1986",
            "1987",
            "1988",
            "1989",
            "1990",
            "1991",
            "1992",
            "1993",
            "1994",
            "1995",
            "1996",
            "1997"
        ],
        [
            "Vol./No.",
            "22:4, 23:1-2",
            "23:3-4, 24:1",
            "24:5, 25:2",
            "25:5, 26:3",
            "26:6, 27:3",
            "27:6, 28:3",
            "28:6, 29:3",
            "29:6, 30:3",
            "30:6, 31:3",
            "31:6, 32:3",
            "32:6, 33:3",
            "33:6, 34:3",
            "34:6, 35:3",
            "35:6, 36:3",
            "36:6, 37:3",
            "37:6, 38:3",
            "38:6, 39:3",
            "39:6, 40:3",
            "40:6, 41:3",
            "41:6, 42:3",
            "42:6, 43/44:3",
            "43/44:5/6",
            "43/44:5/6, 45:3",
            "45:5/6, 46:3",
            "46:6, 47:3",
            "47:6"
        ],
        [
            "Year of Journal",
            "1972, 1973",
            "1973, 1974",
            "1974, 1975",
            "1975, 1976",
            "1976, 1977",
            "1977, 1978",
            "1978, 1979",
            "1979, 1980",
            "1980, 1981",
            "1981, 1982",
            "1982, 1983",
            "1983, 1984",
            "1984, 1985",
            "1985, 1986",
            "1986, 1987",
            "1987, 1988",
            "1988, 1989",
            "1989, 1990",
            "1990, 1991",
            "1991, 1992",
            "1992, 1993/1994",
            "1993/1994",
            "1993/1994, 1995",
            "1995, 1996",
            "1996, 1997/1998",
            "1997/1998"
        ],
        [
            "Page Numbers",
            "384-401; 153-180",
            "328-357; 87-116",
            "457-485; 160-184",
            "461-496; 261-287",
            "521-549; 245-275",
            "525-557; 266-291",
            "542-580; 241-275",
            "535-573; 257-294",
            "536-574; 262-300",
            "540-591; 250-286",
            "527-579; 231-277",
            "515-573; 246-295",
            "559-602; 256-311",
            "563-619; 260-304",
            "531-572; 213-257",
            "518-550; 256-287",
            "549-581; 258-294",
            "549-580; 254-291",
            "550-574; 282-305",
            "619-634; 240-265",
            "548-582; 229-249",
            "250-287",
            "557-575; 265-285",
            "529-550; 101-120",
            "81-99; 95-118",
            "92-110"
        ]
    ],
    "pageTitle": "Resources for Bulgarian Linguistics",
    "title": "",
    "url": "http://www.library.illinois.edu/spx/webct/subjectresources/subsourbul/lingbulg2.html",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00243-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 551837007,
    "recordOffset": 551812209,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{62296=Sofiia: The Academy, 1959-1990. UIUC Call Number: Main Stacks Q. 405 SOF (1959-1962); Q. 405 SO (1963-1970:1) [UIUC lacks 1970:2-1990:3], 105431=Andreichin, Liubomir D.; Georgieva, Elena. Sofiia: BAN, 1975. 655 p. UIUC Call Number: Oak Street Facility 491.81 Ob61, 94742=This title is the standard Bulgarian scholarly dictionary produced by the Bulgarian Academy of Sciences. In 2001 a second, revised edition began publication in spite of the fact that the first edition was never finished. As of 2002 the first edition has eleven volumes out of a projected twenty covering up through the letter O. As of 2002 only two volumes of the second edition have appeared covering up through the letter V (Cyrillic alphabetical order). In 2006, the third volume was published, covering G - Deiatel. These dictionaries present the modern Bulgarian lexicon from the second quarter of the 19th century through the present day. The goal is comprehensive coverage of words and definitions with substantial coverage of usage in special phrases and expressions. For a more scholarly annotation of this dictionary see the entry for it in Entsiklopediia na suvremenniia bulgarski ezik annotated above. Like most standard, scholarly dictionaries this one provides not only definitions but also some grammatical forms and excerpts from literature to show usage. The first volumes in both editions contain the extremely long list of sources including the literary texts used to establish the definitions and usage. See the entry on the left for the word \"Bairam\" from volume 1 of the first edition., 70957=Onomastics is a branch of linguistics that studies various types of names. These three bibliographies present citations for both books and articles related to Bulgarian names and works of Bulgarian scholars on onomastics that do not necessarily concern Bulgaria. The slim volume covering 1960-1970 has been superseded by the one encompassing 1940-1970. The two larger volumes are arranged according to similar schemes: general works, bibliographies, congresses, the Bulgarian language, Slavic languages, Indo-European languages, non-Indo-European languages, reviews. Within these broader categories there are smaller subjects delineated such as geographic names, onomastics and ethnography, personal names, etc. Many of the entries have a brief annotation explaining what kind of names are discussed in the work and from what area these names come. There are indexes for authors and names of all kinds. See the citations below from the general section of the 1971-1980 volume., 74841=This book combines a review of research in the area of Bulgarian syntax with a bibliography. Various topics are discussed and citations for relevant works are included within each discussion. Some topics include an overview of the development of linguistic Bulgaristika, the Academy grammar, Maslov's 1981 grammar, morphosyntax, children's speech, etc. A full bibliography of works arranged by author is appended at the conclusion of the discussions. The works are for both books and articles published in Bulgaria, other European countries and North America. Note the citations below which are from the bibliography., 45697=With coverage of the years 1824-1900 this retrospective bibliography in an excellent source for locating books, textbooks, articles and reviews written in Bulgarian about linguistics. Every item included in this bibliography (over 1200 of them) was examined in person (de visu) by the compiler. All of the citations  are arranged into four main groups: general topics, the Bulgarian language, other languages, language learning/textbooks. Within each of these four groups the items are further subdivided by subjects such as dialectology, etymology, onomastics, and by individual languages as subjects. In addition to full bibliographic citations the entries also provide a one-line annotation on the content. The bibliography is equipped with an index for names, a list of sources, and many see references. The table of contents at the end elucidates the subject arrangement of the citations in the volume. See the image below for an article citation about a Bulgarian dialect., 111322=Sofiia : Izd-vo \"Kheizul\", 2002. 1069 p. UIUC Call Number: Main Stacks 491.8181 N859, 49352=This serialized bibliography of current works on linguistics by Bulgarian scholars has been appearing in the journal Bulgarski ezik since 1951 and was still being printed at least up to 1997 under a slightly different title, \"Bibliografiia na bulgarskata ezikovedska literatura\". Annually it publishes hundreds of citations for books, articles, and reviews arranged in different ways depending on the years of the bibliography. Earlier it was a strict author arrangement, but later the citations were grouped by subjects with an author index. The table below gives the citations for each installment of the bibliography. The image to the right is an example of what the citations look like in the 1994 bibliography., 98458=Georgiev, V.; Gulubov, I.; Zaimov, I.; Ilchev, S. Sofiia: BAN, 1971- . UIUC Call Number: Main Stacks 491.812 B8711971 v.1-5 [up through the word Puska] [UIUC lacks v.6], 110033=Scatton, Ernest A. Columbus, OH: Slavica, 1983. 448 p. UIUC Call Number: Main Stacks 491.815 Sc88r, 73072=Bulgarian phraseology from 1861-2000 is the subject of this bibliography. The first half of the volume lists citations for articles, books, and reviews on the topic, while the second half lists actual Bulgarian phrases and refers the user to the works that discuss them. The citations are arranged into three groups (dictionaries, books, articles/reviews) and then by author with the author's name in bold face. The phrases are organized by significant word. Finally, there is an alphabetical index of complete phrases which also refers the user to the works that contain them. See the image below for some citations in the phrase index., 77944=One of the main bibliographies of foreign linguistic Bulgaristika is produced annually in serialized form in the journal Bulgarski ezik. Details are given below. Of course, the main bibliography for Bulgaristika is Bulgariia v chuzhdata literatura, series 7 of the Bulgarian national bibliography, and its precursors. It has sections devoted to linguistics. An example of a bibliography found as part of a collection of Bulgaristika is on pages 334-359 of the book Ezikovedskata Bulgaristika v Chekhoslovakiia. Sofiia: Nauka i izkustvo, 1987., 42056=Resources found on this page include works about Bulgarian language/ linguistics regardless of the language of publication and works about linguistics in general that are published in Bulgarian. Resources about Slavic linguistics or other Slavic languages that are published in Bulgarian will appear on the pages devoted to the individual languages or the General Resources for Slavic Linguistics page. Cross references are provided for works that could be listed under multiple categories. Also, please note that there are two special sections on the page for General Resources for Slavic Linguistics that are particularly relevant for Bulgarian, South Slavic and Balkanistika. Works on the \"Old Bulgarian\" language will be found on the page concerning Old Church Slavic/Church Slavic. Scholars interested in Macedonian linguistics may also find some of these early resources useful as Macedonian was not formally declared a language independent of Bulgarian and Serbian until 1944. As is true for all of the pages in this guide, clicking on either portraits or names of bibliographers and authors will lead to their biographical data., 45474=Konstantinova, Violeta. Sofiia: Izd-vo na Bulgarskata akademiia na naukite, 1979. 229 p. UIUC Call Number: International & Area Studies Slavic -- Bulgarian Reference 016.41 K8376e, 63926=Ivanova, Liliana. Sofiia: Narodna biblioteka \"Kiril i Metodii\", 1973. 392 p. UIUC Call Number: Main Stacks 016.49181 Iv1b, 96853=Romanski, Stoian. Sofiia: BAN, 1955-1959. 3 vols. UIUC Call Number: Main Stacks Q. 491.81 B87r v.1-3, 47808=This serialized bibliography covers just a few years of Bulgarian work on linguistics, 1950-1953. The citations are for books, textbooks, dictionaries, and articles, but the contents of collections are also provided. The entries are arranged by author's surname and just give a bibliographic citation. Textbooks and dictionaries are listed in a separate section from the other citations. See the entries above left from the volume covering 1953., 102007=Muzhlekova, Mariia. Sofiia: BAN, 1990. 221 p. UIUC Call Number: Main Stacks 491.817 M987r, 66081=This atypical bibliography is devoted to works on Bulgarian/Macedonian dialectology. It is atypical in that it does not provide citations to books or articles, but rather helps to locate dialect texts such as proverbs, songs, stories, words, etc. that appear within various books or journals. The list of sources is a helpful guide to sources about dialectology except when it just lists journals that were consulted without giving individual article citations. It contains over 1700 citations for locating texts related to a particular dialect or village. The citations are arranged alphabetically by village or place of dialect without article titles or authors' names, but they do provide detailed page references and indications of the genre of text found on each page as well as the village districts in brackets. There are indexes for places and genres. You must use the abbreviation key to sources to understand the citations. Since this work was compiled before Macedonian was officially declared a language it is also extremely useful for the study of Macedonian dialectology. It contains many villages and districts located in the current territory of Macedonia (FYROM). See the citations below for works on the town of Krushovo. In the citations Gat. = gatanki (riddles), Posl. = poslovitsi (proverbs), etc. and SbNU = Sbornik za narodni umotvoreniia, nauka i knizhnina., 47420=in Izvestiia na Instituta za bulgarski ezik pri BAN, v.1, 1952, pp.291-295 (covers June 1950-Dec. 1951); v.3, 1954, pp.374-381 (covers 1952); v.4, 1956, pp.483-487 (covers 1953). Ivanova, Ekaterina. Sofiia: Izdanie na Bulgarskata Akademiia na naukite, 1952-1956. UIUC Call Number: Main Stacks 491.81 B872i v.1-26, 106768=Grammars often appear in library catalogs with subject headings such as Bulgarian language--Grammar. Specialized grammars sometimes further delineate this subject heading with additional terms such as \"History\" or \"Comparative.\" Try some of these headings in WorldCat or in your online catalog to find other Bulgarian grammars. You should also consider looking at language textbooks since most of them have grammatical explanations. Many of them can also be found with the same subject heading. For an annotated bibliography of Slavic grammars and dictionaries published before 1850, see Stankiewicz which is described in the Sources for Dictionaries and Language Resources section of this course. Many Bulgarian titles are included in this work. There is also a list of Bulgarian grammars, including modern ones, at the back of Entsiklopediia na suvremenniia bulgarski ezik., 98713=This dictionary and its 1971 revision are the standard etymological dictionaries for the Bulgarian language. Scholars at the Bulgarian Academy of Sciences compiled and revised both editions. To date neither edition has been completed, but the University of Illinois also lacks the latest volume. Volume 6 of the later edition published in 2002 goes up through the word Slovar'. The entries provide a definition in Bulgarian, a posited derivation, forms of the word in other languages including other Slavic languages as well as citations to the sources in which these forms were found. Dialectal forms are also mentioned. The first volume of the 1971 edition opens with a long bibliography of sources. See the entry below showing the derivation of the word \"bankrut\" or bankruptcy., 43888=One of the standard sources for Bulgarian bibliography, the annual Bibliografiia na bulgarskata bibliografiia, is very helpful for finding bibliographies of Bulgarian linguistics. One of its sections is devoted to \"Ezikoznanie\". See the page on Bulgarian Bibliographies of Bibliographies for annotations and call numbers for this publication and two retrospective bibliographies of bibliographies with coverage going back to 1852. These sources cover not only bibliographies that were published as monographs, but also ones that appeared in journals. Thus, for example, citations for the many specialized linguistic bibliographies that were printed in the journal Bulgarski ezik can be found here., 100220=Ilchev, Stefan; Ivanova, Ana, et al. Sofiia: BAN, 1974. 606 p. UIUC Call Number: International & Area Studies Slavic -- Bulgarian Reference 491.81 R243, 89274=There are several bibliographies of dictionaries annotated in this guide that include Bulgarian dictionaries. For annotations of Bulgarian dictionaries published before 1850 see Stankiewicz which is described on the page Sources for Dictionaries and Language Resources. Another major source for identifying Slavic dictionaries including Bulgarian is Lewanski's Bibliography of Slavic dictionaries. A Bulgarian guide to reference works, \"Spravochno-bibliografski izdaniia\" by Boris Desev [UIUC Call Number: Bulgarian Reference 016.0287 D45s], also annotates major Bulgarian dictionaries as does the recent encyclopedia of the Bulgarian language., 68155=Balevska, Elka. Sofiia: Izd-vo na Bulgarskata akademiia na naukite, 1973. 165 p. UIUC Call Number: International & Area Studies Slavic -- Bulgarian Reference 016.49181 B19b; also available in Oak Street Facility, 90731=Manolova, Liliia. Sofiia: Izd-vo na Bulgarskata akademiia na naukite, 1993. 107 p. UIUC Call Number: Main Stacks 413.91811 M317k, 108584=Boiadzhiev, Todor Apostolov; Tilkov, Dimitur; Stoianov, Stoian; Popov, Konstantin Petrov. Sofiia : Izd-vo na Bulgarskata akademiia na naukite, 1982-1983. 3 vols. UIUC Call Number: Oak Street Facility 491.815 G761 v.1 [UIUC lacks v.2, 3], 78941=This serialized bibliography of linguistic Bulgaristika from foreign sources has been published since 1969, but may have ceased with the 1993/1994 volume. It has citations for both articles and books. In earlier years the citations are arranged by author's surname, in later years by broad subject categories. In later years the title was changed to \"Bulgaristikata v chuzhdata ezikovedska periodika prez ...g.\" and ceases to cover book titles. Some of the bibliographies contain supplements for previous years and author indexes. The table below gives the particulars for each installment., 108857=This grammar published by the Bulgarian Academy of Sciences consists of three volumes: tom 1. Fonetika -- tom 2. Morfologiia -- tom 3. Sintaksis. Volume One opens with a brief overview of notable Bulgarian grammars and then launches into phonetics, the subject of the volume. The subject matter is divided into sections typical for the topic - vowels, consonants, stress, intonation, etc. and every section has a number of examples from Bulgarian to illustrate the points. There is a very detailed table of contents at the end of the volume, but no index. UIUC lacks Volume Two and Three so no description of these titles is included here. In 1993 a second, \"fototipno\" edition of the set was issued., 104914=compiled by Stefan Mladenov., 114139=Purvev, Khristo. Sofiia: Narodna prosveta, 1987. 374 p. UIUC Call Number: International & Area Studies Slavic -- Bulgarian Reference 491.810922 P977s, 70807=Choleva, Anna. et al. Veliko Turnovo, 1993. 158 p. UIUC Call Number: Main Stacks 016.491812 B471, 103638=Antonova-Vasileva, Luchiia; Keremidchieva, Slavka. Sofiia: Planeta, 2001. 284 p. UIUC Call Number: Main Stacks 491.81703 An88k, 94473=Cholakova, Kristalina; Boiadzhiev, Simeon. Sofiia: Akad. izd-vo \"Prof. Marin Drinov\", 2001. 2nd revised and expanded edition. UIUC Call Number: International and Area Studies Slavic-- Bulgarian Reference 491.813 R2431 v.1-3, 112918=At the back of Entsiklopediia na suvremenniia bulgarski ezik there is a bibliography of biographical resources that either are devoted to Bulgarian linguists or contain biographical entries for them. One source that contains entries for Bulgarian linguists is Biografsko-bibliografski sbornik, annotated on the page devoted to Resources for Bulgarian Literature. A few others are listed below including an example of a bio-bibliography, in this case of the famous Bulgarian linguist Stefan Mladenov. Some older, general biographical sources for Bulgaria that may include linguists are discussed on pp.106-112 of Boris Desev's Spravochno-bibliografski izdaniia, a guide to Bulgarian reference sources (UIUC Call Number: IAS Slavic--Bulgarian Reference 016.0287 D45s., 90894=This small volume published by the Bulgarian Academy of Sciences is a dictionary of Bulgarian linguistic terminology. In fact, it is the first one of its kind to be compiled for Bulgarian. The bibliography opens with a brief overview of the historical development of linguistic vocabulary in Bulgarian including a discussion of earlier works that can be considered precursors to this dictionary. Terms are arranged alphabetically and appear in all capital letters and bold face. Most of the definitions are about several lines in length with some spanning up to two pages. A greatly expanded second edition of this dictionary was published in 1999 under the title Rechnik na lingvistichnite termini v bulgarskiia ezik, but the University of Illinois does not hold the volume. A list of sources appears at the end. See the definition below for the dual number., 65706=Stoikov, Stoiko. Sofiia: Pechatnitsa P. Glushkov, 1937. 141 p. (Sbornik na Bulgarskata akademiia na naukite ; kniga XXXI). UIUC Call Number: International & Area Studies Slavic -- Bulgarian Reference 016.49181 St6p, 62486=Produced for over 30 years by the Academy of Sciences in Sofia, this periodical presents abstracts in English or French of more important books and articles from Bulgaria on the topics of literature, language and linguistics. (UIUC holds only volumes of the French version). The year of coverage is one year earlier than the year of publication, thus works from 1962 appear in the volume that was printed in 1963. The abstracts for linguistics are arranged into five sections: general linguistics, the Bulgarian language, Slavic languages, Indo-European languages, non-Indo-European languages. Every entry provides a full bibliographic citation and an abstract that is signed by the contributor. The abstracts range in length from a short paragraph to a full column. The abstract on the right is one of the shorter ones from the 1970:1 issue., 115669=Mikhailova, Ekaterina D. Sofiia: Izd. na BAN, 1956. 308 p. UIUC Call Number: Main Stacks 016.49181 M69m, 115808=Stefan Mladenov, 1880-1963, was a leading Bulgarian linguist who wrote on numerous subjects such as Indo-European, dialectology, and the history of the Bulgarian language. This volume is an example of a biobibliography. It begins with a brief biography of the scholar written by one of his colleagues, follows with a chronology of important dates, a bibliography of works about Mladenov, and then presents an annotated bibliography of his works. The bibliography is divided into several sections: scholarly works, reviews of scholarly works, biographical and bibliographical works, other reviews and sketches, editing, prefaces and translations. All citations in the sections are arranged chronologically. There are indexes for titles, names, and words and parts of words. See the image below for the first citation in the second section of the bibliography of works by Mladenov., 107967=Below we cite only two standard reference grammars out of the many grammars that exist for Bulgarian, the Academy grammar and a reference grammar in English that is commonly used in US universities that teach Bulgarian. Also included in this category are orthographic manuals and we describe a recent one from the Academy of Sciences to give you an idea of what they contain. One subject heading for locating other orthographic manuals is Bulgarian language--Orthography and spelling., 78711=Naumova, Mariia; Bekhar-Zakhariia, T.; Tsonkova, Mariia. et al. Sofiia: Izd. na Bulgarskata akademiia na naukite, 1970-1993/1994. UIUC Call Number: Main Stacks 491.81 B874 v.20 (1970) - v. 48 no. 1-2 (1999-2000), 98150=Georgiev, V.; Gulubov, I.; Zaimov, I.; Ilchev, S. Sofiia: BAN, 1962- . UIUC Call Number: Main Stacks 491.81 B87bu sv.1-24, 27-28 (= v.1-3, up through the word Mingo) +, 49077=Ivanova, Ekaterina; Ikonomova, Zhivka. Kurpacheva, Marta. Sofiia: Izd. na Bulgarskata akademiia na naukite, 1951- . UIUC Call Number: Main Stacks 491.81 B874 v.4 (1954) - v. 48:2 (1999-2000) [UIUC lacks v.1-3, 5, 10, 11], 110227=Compiled by an American scholar of Bulgarian linguistics, this English-language reference grammar of Bulgarian is widely held by US libraries. The introduction provides some historical background for the Bulgarian language as well as a list of primary sources consulted. The grammar is divided into 6 section plus appendices: the structure of Contemporary Standard Bulgarian, phonology, orthography, inflectional morphology, derivational morphology, syntax. The appendices provide examples and further details on certain topics such as accent shifts in nouns or alternative plurals. The grammar concludes with a bibliography., 94216=Sofiia: BAN, 1977- . UIUC Call Number: International & Area Studies Slavic -- Bulgarian Reference 491.81 R2432 v.1-14; v. 1, 4, 6-8 available in the Main Stacks. +, 68429=Works on Bulgarian lexicology and lexicography from 1944-1968 are the subject of this specialized bibliography from the Bulgarian Academy of Sciences. More than 1800 citations for books, articles, and reviews are arranged into 8 sections including lexicological and phraseological works, textbooks, dictionaries and phrasebooks, criticism and reviews, the language of Bulgarian writers and publicists, etc. The works cited are either in the Bulgarian language or published in Bulgaria. The body of the work is supplemented by an author index and a list of sources. The University of Illinois copy of this bibliography is poorly printed with a couple of blank pages that represent a loss of about 40-50 citations. See the citations below which are the first two listed under the section for the language of Bulgarian writers and publicists., 87724=Rusinov, Rusin; Georgiev, Stan'o. V. Turnovo: IPK \"Sveti Evtimii Patriarkh Turnovski\", 2000. 583 p. UIUC Call Number: International & Area Studies Slavic -- Bulgarian Reference 491.81014 En874}",
    "lastModified": "Fri, 31 Jul 2015 01:00:00 GMT",
    "textBeforeTable": "  This serialized bibliography of current works on linguistics by Bulgarian scholars has been appearing in the journal Bulgarski ezik since 1951 and was still being printed at least up to 1997 under a slightly different title, \"Bibliografiia na bulgarskata ezikovedska literatura\". Annually it publishes hundreds of citations for books, articles, and reviews arranged in different ways depending on the years of the bibliography. Earlier it was a strict author arrangement, but later the citations were grouped by subjects with an author index. The table below gives the citations for each installment of the bibliography. The image to the right is an example of what the citations look like in the 1994 bibliography. Ivanova, Ekaterina; Ikonomova, Zhivka. Kurpacheva, Marta. Sofiia: Izd. na Bulgarskata akademiia na naukite, 1951- . UIUC Call Number: Main Stacks 491.81 B874 v.4 (1954) - v. 48:2 (1999-2000) [UIUC lacks v.1-3, 5, 10, 11] Statii i trudove po ezikovi vuprosi v bulgarskiia pechat ot ... do... in Bulgarski ezik, Top of Page This serialized bibliography covers just a few years of Bulgarian work on linguistics, 1950-1953. The citations are for books, textbooks, dictionaries, and articles, but the contents of collections are also provided. The entries are arranged by author's surname and just give a bibliographic citation.",
    "textAfterTable": "Year of Coverage Vol./No. Year of Journal Page Numbers 1972 22:4, 23:1-2 1972, 1973 384-401; 153-180 1973 23:3-4, 24:1 1973, 1974 328-357; 87-116 1974 24:5, 25:2 1974, 1975 457-485; 160-184 1975 25:5, 26:3 1975, 1976 461-496; 261-287 1976 26:6, 27:3 1976, 1977 521-549; 245-275 1977 27:6, 28:3",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}