{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They are always on top of everything. They care for our safety, and can be reached anywhere and anytime. If you are nice to them, they will be nice to you. Please remember that.",
            "We have over 70 clubs and organizations on campus...plus more are created every year. We have a club for everything, from knitting to longboarding. There is a Student Involvement Fair at the beginning of the year, that's the only time where you will find all of the clubs in one places.",
            "If you were incredibly involved in planning in high school, join the Activities Programming Board. If you love theater, join the UNE Players. There is a club on campus for every type of person.",
            "Venture into the Multicultural Lounge or Global Education Office in Decary, you won't regret it. Get to know your Dean of Students in the Student Affairs Office.",
            "You pay for everything that they provide. The education is phenomenal, and the institution is small, so that you are a face, not a number. The faculty and staff do everything they can to help you succeed. There are so many opportunities that are offered to you. Every event on campus is free. You can learn to surf, learn to sail, and learn to kayak. All of these activities, plus a ton more are free. You get your bang for your buck.",
            "There is plenty to do if you look for it. There is an event to go to every night sponsored by many different clubs. The school owns a private beach. There is an ice skating rink open year-round. The school offers discounted tickets to the bowling alley, ropes course, and movie theaters. You will have fun, if you look for it.",
            "If you are picky, you will struggle with the meals at the main dining hall. However, you have 5 options for places to eat on campus, and plenty off-campus eateries. The food ranges from Panera-like to Mexican. If you like greasy foods, the Hang is for you. Windward is where you find your paninis and wraps. Alfond is quick meals, and the Forum is where you get your tacos.",
            "The first-year residence halls are being remodeled. The building were pretty old, but they are beginning to look really nice. The upperclassmen buildings are livable. Some are better than others, but it is really what you make of it. In your first year, you may have one or two roommates. Your sophomore and junior year, you are likely to have three in a suite. In your senior year, they ask for you to find off-campus housing in the beach homes nearby, however, you are allowed to live on-campus in the upperclassmen buildings.",
            "There are classes that will cause you great stress, and then there are classes where you question why you attend. Go to class, you will receive credit for it. Ask for help when you need it, and don't take studying for granted.",
            "Get involved in at least one club or organization. Take advantage of the free trips, and activities that they provide. Travel through Downtown Biddeford, the shops are cute, and the food is amazing. Get to know your professors, attend their office hours, they will remember that during finals week. Make sure to get out and make connections.",
            "This private institution is absolutely gorgeous, with a view of the ocean right out your residence hall. The classes are small, and the professors know you by your first name within a week. You will find that everyone is rooting for your success."
        ]
    ],
    "pageTitle": "University of New England Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-New-England/reviews?_escaped_fragment_=/show/10100",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00062-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909765155,
    "recordOffset": 909701264,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{100444=UNE is a very safe and low key school. Campus security officers are on duty 24/7 and cops make routine visits throughout the day. I can walk from my dorm to the computer lab across campus at 11:30 at night and not think twice about it., 109960=NOTHING. If you have a car as a Freshman, you should probably thank your mom & dad or grandparents for paying for the EXTREMELY OVER PRICED FRESHMAN PARKING, right now... If you have a car, that means you can get off of that remote campus and explore the surprisingly decent Southern Maine area. L.L bean/ outlet shopping in Freeport, cool restaurants and shops in Portland, beautiful lighthouses up and down the coast, and you can take the Downeaster train to Boston (a two hour trip from the Saco train station). A lot of the beach activity and other lively things happen in the summer May-September. By the time school starts, the weather turns cold and the beaches are deserted... If you do not have a car, well, make friends with someone who does. Otherwise you can take the sketchy Biddeford bus to Wal-Mart., 124486=Thats all up to you. However, i must warn you that the area is patrolled and enforced by the towns police as if it were Eastern Germany in 1983., 302406=There is a club for EVERYTHING. Knitting to Rugby to the Alliance our LGBTQ+ club. And if we don't have it you can create a club for it. All you need is a few friends and an advisor. The Women's Rugby Captain and President started Rugby as a club her sophomore year, after just a few years we are now going to be varsity in 2015-16 Check out Clubs and Orgs here: http://www.une.edu/studentlife/biddeford/involvement-activities/clubs-and-organizations, 242524=Very nice dorms to begin with. Easy to make friends. May get boring at times., 303399=We dedicate the month of April as Gaypril, during Gaypril there is a drag ball and a drag show, usually with a past contestant from Ru Paul's Drag Race. This isn't unusual as much as unique. Right before finals each semester we also have events intended to help you relax run by the Activities Programming Board or the Resident student life association, 310037=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/12/2009 Reviewer is A current student here. 24 out of 27 people found this review useful. 1 of 64 Zach from Portland, ME Check out reviews left by other students or leave your own review. You could win a free scholarship. University of New England Reviews University of New England › Maine › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Evan from Woodstock, CT 01/14/2010 Reviewer is A current student here. 14 out of 14 people found this review useful. 3 of 64 Categories Comments Great for these types of students This school is for students who have an interest in medical fields or marine biology. If you work hard as a student, your hard work will pay off here, and you will not be just another number in the crowd. Tips for prospective students If you want to go to a school that is focused on the success of each and every student, UNE is a great place to be. You have to find a school that fits you. If you love the outdoors, the campus is beautiful. It is on the bank of the Saco River where it meets the Atlantic. I fish about 100 yds from my dorm! I would recommend that anyone whose academic interests meet what the school has to offer, come to the school and meet with the helpful and friendly staff and enjoy the sights of the campus. Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}