{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I have never once felt unsafe on campus. There are precautions that are taken and put into force to decrease the chance of something happening, such as constant patrol of campus grounds, required student id card for entry into buildings, etc. There are also emergency buttons around campus that you can push where campus security will attend to should you need it, but half the time I don't even think about them or notice that they're there. Campus security is great and easy going, I've made friends with a lot of the officers. Even off campus I feel relatively safe. I can walk across the street to the Walgreens or Sheetz and not feel threatened. However, there are some parts of Winchester, that I would not want to walk alone in, especially at dark. Overall though, I feel that SU is a very safe campus, night or day.",
            "I don't know that much about greek life other than there are no true sororities or fraternities, at least not the ones with the huge pillared houses that you normally think of when it comes to that. There are some though that are for academics and performance, or music at well. There are definitely sweatshirts with the greek letters on them, other than that I don't know much of anything about greek life.",
            "There are so many clubs to join at SU. Only this year, I participated with FCA, racquetball club, and health sciences club. All of which were created this past year or soon before. There is flag football, club soccer, volleyball and basketball. There are also clubs for those who are musically and vocally talented, I not being one of them. There is almost always something going on or a group that you can join that has something you are interested in. What's even better is if there is no club that you would want to join, you can make it yourself.",
            "Shenandoah is truly a hodgepodge group of students. As I said earlier, there are so many programs offered that there is no 'cookie cutter' student. I have friends who from school who are very outgoing and active in multiple clubs, sports, and activities and then I also have friends who choose to invest all their time into one specific thing. If I had to say what kind or 'type' of student is great for SU, I'd say one that is willing to new things, new people, and ideas. I've had a female professor from Iran who taught a Global Communications course and a very outgoing white woman who taught aerobics. Even though the two were very different, they taught me to open my eyes to things I hadn't seen before and to even look at certain things with a different perspective. At SU, you just have to be open minded to different people and the way they teach and perceive things.",
            "This is perfect for Shenandoah as there are so many things that make SU and its location unique. First of all, we offer a program for all students known as GCP, Global Citizen Project. This is a program where any student can apply, by written essay and interview, and have the chance to travel to one of many places that the University chooses. This is a spring break trip, fully paid by the school, that in the past has gone to places such as Ireland, Uganda, and Australia. It's a great opportunity to see parts of the world that often you would never get to see. Another HUGE traditions for Shenandoah, and Winchester in general, is Apple Blossom. The weekend before exams, all of Winchester shuts down. From Thursday to Sunday there are parades, carnivals, and activities that happen all over town. Students are off Friday, and some teachers even don't have class on Thursday! It is Winchester's biggest tourist attraction and brings people in from all over.",
            "This completely depends on what you make of it. Shenandoah offers so many opportunities for students, both on campus, off, and abroad, that are often free and if not at a discounted price. For example, on some Thursday nights students get a discount on bowling. There are trips that students can take, such as tubing, horse back riding, and hiking that you only have to sign up for. Getting your money's worth also applies to classes. SU is private, so it's tuition is much more than that of a public university. However, if you really invest your time and efforts into the classes, get to know the professors, and build relationships with them, I believe it will pay off in the future. The connections you can make just through one person and that relationship you have are incredibly vast.",
            "What isn't there to do is the real question. There is a decent sized and stocked malled within walking distance of campus. There are also other stores not far, five minute drive/15 minute walk such as Target, Old Navy, and Five Below. Downtown Winchester is a great and beautiful place to go walk around and shop. A movie theatre is also a ten minute drive from main campus. There is a park with a large pond right off campus with tons of room to go for a walk or run, have a BBQ, or just sit and talk with friends. Other outdoor activities such as hiking, camping, and even horse back riding are only a thirty minute drive. If you're looking for something a little more exciting Washington DC is about an hour drive and offers clubs, more shopping, and more city life activities.",
            "The dining hall is definitely one of Shenandoah's downfall. The main dining hall, known as 'the caf,' is about the size of a high school cafeteria. It offers multiple buffets, with a salad bar, pasta and bread, a specialty buffet that changes day to day, and a kind of general 'American food' that changes day to day as well. There is also a soft serve machine and a dessert bar which has the best cookies ever. In the student center, there is also 'the grill' which offers a menu including burgers, fries, chicken tenders, and sandwiches and flatbreads. This is open nearly all day and night and is great to swing by for a snack or a small meal.",
            "Dorm life completely depends on which dormitory you are put into. Some of the buildings have very spacious bedrooms with four rooms sharing one bathroom, known at SU as quad style. Other buildings have somewhat large rooms with two bedrooms joined by one bathroom. A final room style has smaller rooms with hall style bathrooms. My first semester I stayed in a bedroom with a hall bathroom. It was a little inconvenient to have to walk down the hallway at night just to use the bathroom, and to walk out with only a towel around you after a shower. However, it was definitely not as bad as I was expecting it to be. No matter what type of bedroom/bathroom style you're in, make friends with your hall mates. You will need them and will like being able just to pop in their room to hang out or to help you study.",
            "This is a hard topic to discuss as being a Kinesiology major/Spanish minor is very different than a performing arts or history major. However, to the best of my knowledge there are no majors that are 'easy.' While some classes may differ in reading material, study time, or even necessity of attendance, the overall objective of obtaining your major will require you to work, and work hard. My hardest classes were definitely Gen Bio and Antatomy, both with labs. Classes where there is a large student body require more work outside of class, studying on your own, meeting with the professor, etc.",
            "Shenandoah is definitely a divided school at times. We are well known for our conservatory program but we also have competitive athletic teams, Nursing, Occupational and Physical Therapy, and Athletic Training programs. There seems to be tension between a lot of the athletes and the dancers and the conservatory. Coming in, no matter what individual curriculum you will be studying, know that it doesn't matter. Make an effort to meet with all sorts of people; dancers, musicians, football and soccer players, and the business majors. You won't believe the amazing friends you'll make and the connections you'll have for years down the road.",
            "SU is an amazing place to be with a small but exciting atmosphere in Winchester. There are plenty of outdoor activities within walking and reasonable driving distance, shopping opportunities, and close to larger cities such as Washington DC, Richmond, and Martinsburg, West Virginia. However more than anything, Shenandoah is a place that I can easily call my home, it's somewhere where I feel at ease and supported."
        ]
    ],
    "pageTitle": "Shenandoah University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Shenandoah-University/reviews?_escaped_fragment_=/show/3264",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00324-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 886614639,
    "recordOffset": 886575067,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{145476=© 2015, Cappex.com, LLC, 130799=On move-in day for freshman, the university sets up a mock graduation for the freshman so they can get a feel of what it will be like to walk across the stage to accept their diploma four years later. The night before exam week, the university serves a free dinner at 10:00PM for all students., 54426=We celebrate something called the Apple Blossom, it's celebrated in late April and many parties are thrown, and we even get a few days off from school.}",
    "textBeforeTable": "12/21/2010 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 31 Rebecca from Winchester, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. Shenandoah University Reviews Shenandoah University › Virginia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "All staff is amazing! the students are so nice. All the programs are top notch Login to rate or flag the reviews Nathan from Sandusky, OH 01/31/2011 Reviewer is A current student here. 4 out of 4 people found this review useful. 3 of 31 Categories Comments Great for these types of students Shenandoah is an environment that makes you feel like you're at home. It is a small school with a small campus, so if you are looking to party every night, this is not the school for you. If you are looking for a school that will make you achieve your potential, make you employable after graduation, and give you some great friends, then Shenandoah is your best bet. My schedule is nonstop, and my classes are rigorous, but if you are tenacious you can keep up with your studies and practicing what you learn. I have no doubt you will love it here as much as I do. Tips for prospective students If you have a dream, stick to it.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}