{
    "relation": [
        [
            "",
            "AUT 163",
            "AUT 163A",
            "AUT 181A",
            "AUT 283"
        ],
        [
            "",
            "Adv Auto Electricity",
            "Adv Auto Electricity Lab",
            "Engine Performance 1 Lab",
            "Advanced Auto Electronics"
        ],
        [
            "C-L-Cl-SHC",
            "2-3-3",
            "0-3-1",
            "0-3-1",
            "2-2-3"
        ]
    ],
    "pageTitle": "Catalog - Registrars Office, CCCC - Central Carolina Community College",
    "title": "",
    "url": "http://www.cccc.edu/catalog/2008-2010/transport/",
    "hasHeader": true,
    "headerPosition": "NONE",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00162-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 347369350,
    "recordOffset": 347361148,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1261=The Automotive Restoration Technology curriculum is designed to provide individuals with the competencies needed to work in the automotive restoration industry. The coursework includes research and application of information on specific components of a wide range of classic vehicles (1900 - 1970), such as internal combustion engines, transmissions, brakes, sheet metal, upholstery, starters, generators, and related systems. Graduates of the curriculum should qualify for entry-level employment opportunities in the automotive restoration industry.}",
    "TableContextTimeStampAfterTable": "{62031=Last updated Wednesday, 23 September 2009 Page Issues? Web Admin Find us on Facebook Find us on MySpace Follow us on Twitter Watch us on YouTube}",
    "textBeforeTable": "A. General Education Courses (6 SHC) Course Requirements for Automotive Restoration Technology Diploma Program Site: Lee Campus - Day Program Career Pathway Option: Diploma in Automotive Restoration Technology Program Length: 3 semesters Academic Standards: See General Academic Standards. Entrance Standards: See General Admission Standards. The Automotive Restoration Technology curriculum is designed to provide individuals with the competencies needed to work in the automotive restoration industry. The coursework includes research and application of information on specific components of a wide range of classic vehicles (1900 - 1970), such as internal combustion engines, transmissions, brakes, sheet metal, upholstery, starters, generators, and related systems. Graduates of the curriculum should qualify for entry-level employment opportunities in the automotive restoration industry. Automotive Restoration Technology Credential: Diploma in Automotive Restoration Technology D60140 Transport Systems Technologies College Catalog 2008-2010 Table of Contents Money for College College Services Distance Education Continuing Education Programs of Study Admissions --> Webadvisor GroupWise Business Office Intranet Faculty & Staff Transcript Request Give to CCCC Alumni & Friends Webadvisor",
    "textAfterTable": "ARS 101 Intro to Auto Rest 2-0-2 ARS 102 Auto Restoration Research 3-0-3 ARS 103 Automobile Upholstery 2-4-4 ARS 104 Restorative Skills I 2-4-4 ARS 107 Automotive Engines 1-3-2 ARS 108 Wood & Metal Restoration 2-2-3 ARS 131 Chassis and Drive 2-3-3 ARS 161 Electrical Systems Fundamentals 2-6-4 AUB 134 Auto Body MIG Welding 1-4-3 AUB 141 Mech & Elec Components I 2-2-3 C. Other Major Hours Required for Graduation (11 SHC) C-L-Cl-SHC AUB 111 Painting and Refinishing I 2-6-4 AUB 112 Painting and Refinishing II 2-6-4 AUB 121 Non-Structural Damage I 1-4-3 Total Semester Hours Credit Required for Graduation: 48 Semester Curriculum for Automotive Restoration Technology Diploma 1st Semester (Fall) C-L-Cl-SHC ARS 101 Intro to Auto Rest 2-0-2 ARS 107 Automotive Engines 1-3-2 ARS 108 Wood & Metal Restoration 2-2-3 ARS 161 Electrical Systems Fundamentals 2-6-4 AUB 111",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}