{
    "relation": [
        [
            "",
            "Tests",
            "ODIs",
            "First-class",
            "List A",
            "Twenty20"
        ],
        [
            "Mat",
            "67",
            "26",
            "239",
            "150",
            "57"
        ],
        [
            "Inns",
            "122",
            "26",
            "",
            "",
            "56"
        ],
        [
            "Balls",
            "13909",
            "1306",
            "42349",
            "6932",
            "1127"
        ],
        [
            "Runs",
            "7564",
            "1152",
            "21739",
            "5273",
            "1553"
        ],
        [
            "Wkts",
            "248",
            "32",
            "786",
            "205",
            "51"
        ],
        [
            "BBI",
            "7/61",
            "5/49",
            "7/49",
            "5/28",
            "3/19"
        ],
        [
            "BBM",
            "12/205",
            "5/49",
            "",
            "5/28",
            "3/19"
        ],
        [
            "Ave",
            "30.50",
            "36.00",
            "27.65",
            "25.72",
            "30.45"
        ],
        [
            "Econ",
            "3.26",
            "5.29",
            "3.07",
            "4.56",
            "8.26"
        ],
        [
            "SR",
            "56.0",
            "40.8",
            "53.8",
            "33.8",
            "22.0"
        ],
        [
            "4w",
            "13",
            "0",
            "",
            "2",
            "0"
        ],
        [
            "5w",
            "7",
            "1",
            "26",
            "4",
            "0"
        ],
        [
            "10",
            "1",
            "0",
            "1",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Matthew Hoggard | England Cricket | Cricket Players and Officials | ESPN Cricinfo",
    "title": "",
    "url": "http://www.espncricinfo.com/county-cricket-2011/content/player/14236.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00051-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 431714499,
    "recordOffset": 431683281,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{82534=4391 runs after 35, and 2354 outside top five, 65399=May 6, 2015, 60830=To his credit, Hoggard retreated to the ECB Academy in Adelaide, and returned with a snappier run-up to play his part in England's fifth-Test win at Sydney. By his own admission, he took a while to learn his role in the side, and his flashier colleagues consistently stole his limelight. But his moments when they came were worth waiting for - a brilliant hat-trick at Barbados in April 2004, and then a phenomenal 12-wicket haul at Johannesburg the following winter, where he single-handedly bowled England into a series-clinching 2-1 lead. And the following summer, he shrugged off a quiet start to the summer to contribute nine wickets at Trent Bridge and The Oval, as England sealed their first Ashes victory for 18 years., 34098=Born December 31, 1976, Leeds, Yorkshire, 66892=Sep 20, 2013, 59656=Big, bustling, and with the sort of energy coaches kill for, Hoggard shapes the ball away from the right-hander at pace and is surprisingly slippery off the pitch, although he can be Fraserishly ineffective when the ball refuses to move. Hoggard was one of the leading lights among Yorkshire's bright young things, but it was under the astute tutelage of Duncan Fletcher and Nasser Hussain that he grew the senior bowler of the England quartet that swept all before them in an unbeaten year 2004. His apprenticeship was long and at times tortuous. With just two Tests under his belt, Hoggard was chosen to lead the attack on an arduous tour of India in 2001-02, where he charged in obediently and accurately, and capped his winter with figures of 7 for 63 against New Zealand at Christchurch. By the end of the following summer he had been voted the bowler of the season by readers of Wisden Cricket Monthly, but he endured a horrific winter Down Under, where his arcing inswing was meat and drink to Australia's legion of left-handers - in particular, Matthew Hayden., 61600=His batting is limited, but he has developed into a reliable tailend blocker and one of the most effective nightwatchmen in the game. After a solid series against Sri Lanka in 2006 - 15 wickets at 24.60 - he struggled against Pakistan with 10 expensive wickets, but showed unstinting efforts on the Ashes tour including a seven-wicket haul at Adelaide. He carried a huge workload and was ruled out of the final Test with a side strain, bringing an end to 40 consecutive appearances. A rusty display against New Zealand led to his axing after the first Test in Hamilton and though he earned a recall to the squad for the first Test of the 2008 season, he was subsequently overlooked on home soil at Headingley when the uncapped Darren Pattinson played as a replacement for Ryan Sidebottom. Lawrence Booth July 2008, 86164=Since the beginning of 2012, Ian Bell averages 34.69 when batting in the top six; among regular top-order batsmen, only Shane Watson has a lower average, 68069=NBC Denis Compton Award 1998 Awarded the MBE in 2005 Wisden Cricketer of the Year 2006, 66120=Sep 8, 2014}",
    "textBeforeTable": "Batting and fielding averages }); } } window.setTimeout(fixIframe,1300); if($('.FB_ElementReady iframe').height()>38 || $('.FB_ElementReady iframe').height()==0 || $('.FB_ElementReady iframe').height()== null){ $('.FB_ElementReady iframe').css({'height':'30px','width':'300px'}); function fixIframe(){ fixIframe(); jQuery(document).ready(function($){",
    "textAfterTable": "6 3 8 0 Bowling averages Mat Inns Balls Runs Wkts BBI BBM Ave Econ SR 4w 5w 10 Tests 67 122 13909 7564 248 7/61 12/205 30.50 3.26 56.0 13 7 1 ODIs 26 26 1306 1152 32 5/49 5/49 36.00 5.29 40.8 0 1 0 First-class 239 42349 21739 786 7/49 27.65 3.07 53.8 26 1 List A 150 6932 5273 205 5/28 5/28 25.72 4.56 33.8 2 4 0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}