{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "Anyone can take advantage of the opprotunity. International, traditional, disabled, commuting, working parents, grandparents even. There are programs for almost everyone. Classes are offered both day & evening. Now, there are some local highschools who offer college classes. Something you have to look into.",
            "Know what you want to do before you start. College is a huge step. If it is not what you want, look for other options. When you get there, stick to your plan & make sure it is realistic. They offer services for career planning. Follow your dreams! I started out in an unrealistic dream, but I am following my realistic dream. It is something I am good at. That is the key I have found, to my success.",
            "University of Akron offers many services & programs. it is up to you to utilize them. There are also services & plans for those who are not quite college material. It is up to the individual to find it & ask many questions.",
            "There is a wonderful recreation center on campus. Discounts are provided throughout the city fro U of A students. Local theatres, churches, etc get involved in our school. Businesses are honored when a student wants to volunteer their time, or Interview the staff. There are also the special events throughout campus. Do not forget out wonderful steel drun band!",
            "Our professors are very experienced in their fields. They emphasize taking control of our education. When entering your actual major, experience & practice is emphasized."
        ]
    ],
    "pageTitle": "University of Akron (UA) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Akron-Main-Campus/reviews?_escaped_fragment_=/show/81836",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00191-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910243699,
    "recordOffset": 910103009,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{116293=rethinking race in january is a great way to learn about others., 726275=There are so many events one can do for fun. One can go to the game room to bowl and play pool. One can go to the amazing rec center we here, they can go swimming, rock climbing, play sports there, or just workout. One can join intramural teams for sports. Every week there are movies showing. One can go to any of the home sports games at no additional cost. One can also join organizations in which they find interesting. And finally, every week we have different 9:09 and 7:17 events put on by RHPB and RHC., 193993=The Quaker Square Inn is one of the most unusual hotels in the nation, being built within a grain silo. The Hower House is also a historic house that was built in 1871 by John Henry Hower and is filled with unique treasures and furnishings collected by the Hower family during their travels around the world., 53150=You can tell that the university is using tuition for the benefit of the students. Quite a few new buildings have been built since 2005 and they are still in the process of building new dorms and sports facilities. The teachers here actually want to help you succeed, unlike other colleges where they could care less if you attend class or not. With tuition a lot of things are included such as parking passes, membership to the rec center, and all home games for any sport are free to students (you even get points which earn you free stuff just for going to games!)., 637524=Again, The University of Akron is right in downtown Akron so there is a lot to do in the city. We are also very close to the Cuyahoga Valley National Park, which has hiking, bikini, canoeing, and many other activities! Cleveland is only a 40 minute drive North and Canton is 20 minutes South. If you are looking to stay on campus, there are movies every Thursday-Saturday in the movie theatre. The game room is open 7 days a week and there is always a sporting event. Men's soccer is particularly popular after they won the NCAA championship in 2010., 51936=Soccer fans (we are home to the 2010 national champions, 2009 runners up; two years ranked number 1 team), students who enjoy small class sizes but still want to experience a large university, 85639=I am starting as a freshmen in the Fall of 2012. I have to learn more about the university in the fall., 781166=© 2015, Cappex.com, LLC, 332261=Akron as amazing new football stadium and are men soccer time is really good. In 2010 Akron were national championships. If you want to go to sport game go to Men Soccer team. Join the Ak-Rowdies. There is lot of fun things to do at Lock 3 and Ej Thomas., 282731=I used to have the Unlimited dining plan. With Unlimited we had 1000 swipes for Rob's Cafe. But if you're really looking for something where you can have access to Subway the market and so on etc I hear the Gold Plan is just one step up from the Unlimited dining plan and you have access to many fast food restaurants., 738221=Make sure you make time to study because it will count. Always party/go out in groups at night. AND NEVER TAKE A 7:45 CLASS BECAUSE YOU WILL HATE IT.}",
    "textBeforeTable": "07/10/2009 Reviewer is A current student here. 26 out of 26 people found this review useful. 1 person found this inaccurate. 1 of 172 Tonja from Painesville, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp",
    "textAfterTable": "06/05/2009 Reviewer is A current student here. 10 out of 12 people found this review useful. 2 of 172 Categories Comments Tips for prospective students Awesome school! I live at home and commute to and from daily. Parking can be a hassle but if you get there early it's a breeze to find a parking spot. I am definitely learning a lot in all of my classes and almost all of the professors are willing to help you out if you are struggling with anything. Highly recommend the University of Akron! Login to rate or flag the reviews Abby from Bellville, OH 02/06/2011 Reviewer is A current student here. 8 out of 8 people found this review useful. 3 of 172 Categories Comments Great for these types of students Athletes, honor students, nursing students, engineering student, art students, social work, business, and sports",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}