{
    "relation": [
        [
            "Patent application number",
            "20080271981",
            "20120205226"
        ],
        [
            "Description",
            "ELECTRICAL SWITCHING APPARATUS, AND YOKE ASSEMBLY AND SPRING ASSEMBLY THEREFOR - A spring assembly is provided for a yoke assembly of an electrical switching apparatus including a housing, separable contacts enclosed by the housing, and an operating mechanism structured to open and close the separable contacts. The operating mechanism includes a pole shaft. The yoke assembly is coupled to the pole shaft and is movable among first and second positions corresponding to the separable contacts being closed and open, respectively. The spring assembly includes a number of first springs having a first spring rate and being coupled to the yoke assembly, and a number of second springs having a second spring rate and being coupled to the yoke assembly. The second spring rate is different than the first spring rate. The number of first springs and the number of second springs bias the yoke assembly toward the second position.",
            "LATCH ASSEMBLY AND ELECTRICAL SWITCHING APPARATUS INCLUDING THE SAME - A latch assembly includes a latch plate having an opening therethrough; and a latch shaft having a shaft member and a positioning shoulder disposed on the shaft member. The positioning shoulder has a seating surface thereon. The shaft member passes through the opening of the latch plate. The latch plate engages the positioning shoulder of the shaft member. The seating surface of the shaft member is swaged to retain the latch plate to the shaft member."
        ],
        [
            "Published",
            "11-06-2008",
            "08-16-2012"
        ]
    ],
    "pageTitle": "Parks, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/parks-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00190-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441417727,
    "recordOffset": 441382664,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "David A. Parks, Baden, PA US 11-27-2008 Fishing lure having an action halo - The present invention provides for a variety of soft plastic fishing lures having an enlarged soft plastic attachment as part of the leading edge of the bait. The soft plastic attachment, preferably disk shaped and concave, provides for unique back and forth swimming motion in the leading edge of the bait and, when fished on the surface, creates a wake of water and produces vibration. The soft plastic attachment also adds additional weight to the front of the bait, causing it to fall in a natural lifelike position, and also allows the hook eye and line knot to be embedded into th 20080289244 Published Description Patent application number Danny R. Parks, Daphne, AL US 02-28-2013 Fecal Incontinence Treatment Device and Method - Various embodiments of an implant system for treating fecal incontinence are provided. The devices and systems can include a mesh or like device that can include a variable porosity to control the degree of expansion of the anal canal. The mesh can be constructed at least in part of patterned strut members allowing for various geometric configurations, with varying load and tension properties for the designated portions of the device according to the needs for a particular patient application. 20130053626 Published Description Patent application number Daniel R. Parks, Big Lake, MN US",
    "textAfterTable": "Patent applications by David A. Parks, Baden, PA US David Allen Parks, Baden, PA US Patent application number Description Published 20120061219 Charging Handle Apparatus and Switchgear Apparatus - A charging handle apparatus includes a two-piece support apparatus that is disposed on a handle assembly and that is engaged with a gear. One of the two pieces is movable with respect to the first piece. The second piece of the support apparatus includes a number of engagement structures that are engaged with the gear and that retain the gear in a given position with respect to the handle assembly. The charging handle apparatus thus can be provided as a pre-assembled component that is readily mountable to a shaft of a circuit interrupter. 03-15-2012 Dean L. Parks, Ocala, FL US Patent application number Description Published 20090297589 Method of treating burns using Avermectin compound - A method of treating a superficial or partial thickness burn caused by heat, or by UV or laser radiation is disclosed. The method includes topically applying a topical composition containing an avermectin compound to an affected area immediately after a burn occurs. The method further includes",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}