{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Eggheads",
            "Japanese News",
            "Seven Early News",
            "Today",
            "The Project"
        ],
        [
            "Time",
            "5:30 am - 6 am",
            "5:40 am - 6:15 am",
            "5:30 am - 6 am",
            "5:30 am - 6 am",
            "5 am - 6 am"
        ]
    ],
    "pageTitle": "The Age - Business, World & Breaking News | Melbourne, Australia",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.theage.com.au/am/2012/05/18/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 756756675,
    "recordOffset": 756685288,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{40986=RAYMOND GILL Robert Gould yesterday said his former partner, Geoffrey Smith, had 'voraciously' pursued his clients since their relationship ended in 2004., 52447=MATTHEW MOORE The beginning of the end for the Star's high-flying managing director Sid Vaikunta came just before lunch on a Tuesday last December.}",
    "TableContextTimeStampAfterTable": "{125466=May 23 Ducati’s latest motorcycle is so cool, it's getting its own party., 126230=August 18 The first instalment of this soon-to-be annual festival is includes hot Aussie headliners., 264245=May 16 2012, 146426=Emotional Ian \"Dicko\" Dickson crowned Celebrity Apprentice 2012., 124616=May 17 Burswood seems to be the place with a huge line-up of events., 269049=2012 Olympic torch is lit in Greece, 253062=Bron, May 16, 2012, 12:33AM, 127166=May 17 Gyroscope accident causes reshedule of fundraiser., 241347=$288m Majura Parkway starts end of October, 216371=Bonus 0.25% p.a. for accounts opened befored 9th June, 103437=Early Bird entries for event on Sunday, July 15 are now open., 254054=Hungry, May 17, 2012, 10:54PM}",
    "textBeforeTable": "8am 7:30am 7am 6:30am 6am 5:30am Skip to: This light-hearted period drama wraps up tonight, providing our nosy heroine with the answers she's been looking for. Miss Fisher's Murder Mysteries What's on TV Tonight Read more now Get this for only $2 - save 53% Pizza Hut $2 Pizza - Perfect for the Weekend! Living SocialBrisbanePartner site 9 Bypass the supermarket and shop straight from the source. Brisbane markets guide About Town 9 Classic first-person shooter is 20. Here's how to play, right now. Happy birthday, Wolfenstein 3Screens Debugging the buzz around Cirque du Soleil's latest creature feature.",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD ABC News Breakfast 6 am - 9:30 am SBS ONE Queensland Hong Kong News 6:15 am - 6:35 am Channel Seven Brisbane Sunrise 6 am - 9 am Channel Nine Brisbane Today 6 am - 9 am Network TEN Brisbane Breakfast 6 am - 9 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD ABC News Breakfast 6 am - 9:30 am SBS ONE Queensland Chinese News 6:35 am - 7:05 am Channel Seven Brisbane Sunrise 6 am - 9 am Channel Nine Brisbane Today 6 am - 9 am Network",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}