{
    "relation": [
        [
            "Vehicle",
            "BMW 550i",
            "Infiniti M56"
        ],
        [
            "Score",
            "7.5",
            "7.5"
        ],
        [
            "Rank",
            "1",
            "1"
        ]
    ],
    "pageTitle": "2011 BMW 550i vs. 2011 Infiniti M56 Comparison Test",
    "title": "",
    "url": "http://www.edmunds.com/infiniti/m56/2011/comparison-test.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00263-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428465703,
    "recordOffset": 428419639,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10009=The 2011 Infiniti M56 uses cubic inches and plenty of revs to achieve its power. Its 5.6-liter V8 is good for 420 hp at 6,000 rpm and 417 lb-ft of torque at 4,400. It's no dinosaur, also utilizing direct-injection and variable valve timing and valve lift for a smooth, reasonably efficient power plant., 12902=How They Stack Up Not surprisingly, the 2011 BMW 550i and 2011 Infiniti M56 have plenty of similarities. Both are rear-drive sedans powered by sizable V8s. In this case, both are hooked to automatic transmissions, a seven-speed in the Infiniti and an eight-speed in the BMW., 13484=Now that the all-new twin-turbo 2011 BMW 550i is here, it was time to see just how well it stacks up against its newest competitors. But instead of going toe-to-toe with a classic European rival, we figured a match-up with the latest from Japan would be more interesting. For that we turned to the all-new 2011 Infiniti M56, a thoroughly redesigned sedan that is once again aiming for the Germans. It has all the makings of a worthy competitor, but how does it hold up on the road?}",
    "TableContextTimeStampAfterTable": "{132630=Top 14 Sedans With the Smallest Turning Circles for 2014}",
    "textBeforeTable": "Features You'd think any luxury/sport sedan starting at around $60,000 would come with a plethora of the latest features to both coddle you and make your driving experience more fun. But as the list below shows, BMW and Infiniti have widely differing views on what should come standard and what the customer should have to cough up extra coin for. A critical miscue by Infiniti is the lack of a limited-slip differential, even as an option. Here's our list of features that we think a sport sedan in this category should have. The manufacturers provided Edmunds these vehicles for the purposes of evaluation. With the 550i, you get the refined driving experience along with plenty of sport sedan capability. Should it weigh less? Yes. Would we prefer more precise steering? Yes again. The new 5 Series is by no means perfect, but it still puts all the pieces together in a way that makes it feel like a proper luxury sport sedan. The Infiniti is close, but the BMW is already there. The BMW 550i is simply a better all-around sedan. Infiniti may have figured out the sport sedan piece of the formula, but BMW is better at making a sport sedan that you can live with. We like a tightly wound sedan as much as the next enthusiast, but we don't want to be reminded of the car's",
    "textAfterTable": "Cooled front seats O* S Heated front seats O S Limited-slip differential S N/A Paddle shifters O* O Rear-wheel steering O* O Key: S: Standard O: Optional N/A: Not Available Adaptive cornering headlights: Anyone who drives on curvy roads at night will find much joy in \"cornering\" headlights, which are standard equipment on the BMW 550i. BMW's system decides how much the lights, which look through the turns, should move based on steering, yaw rate and vehicle speed. Adaptive suspension damping: The 550i's optional Driving Dynamics Control lets the driver choose among four different settings for its electromagnetic shocks, allowing you to cruise comfortably on the highway, or stiffen things up for back-road duty. Adjustable suspension isn't even optional on the Infiniti. Cooled front seats: No one likes showing up to a meeting with a sweaty backside on a stifling hot summer day. Luckily, more and more carmakers have been making seat cooling available — better yet, it's standard equipment on the M56. Heated front seats: \"Bun warmers\" have become pretty much standard fare on luxury cars these days. Yet BMW still makes you pay for that toasty feeling in its 5 Series. Limited-slip differential: There's nothing quite like powering out of a turn, only to have the inside rear wheel spin uselessly, as on the Infiniti. The",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}