{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Will enjoy being here",
            "Will learn a lot"
        ],
        [
            "Comments",
            "All students no matter you major nor interest. There is a piece of the University for everyone.",
            "Come with an open mind and once you get to the University of Memphis you will not want to leave.",
            "Tuition is paid for my first and second semester. It is very great.",
            "Eager!",
            "My journey with the University of Memphis began in July 2011 and has not failed yet. I went to Orientation and I grew to love it. I learned about the educational programs, but most of all I learned respect and humbleness."
        ]
    ],
    "pageTitle": "University of Memphis (U of M) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Memphis/reviews?_escaped_fragment_=/show/23621",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00052-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898325043,
    "recordOffset": 898212215,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{54110=The campus is amazing. There are buildings for every department and the school is working on improving it's organization and curb-appeal. Recently a new parking lot was added, and though it has less parking spaces, there are plans for many more, as well as new/nicer buildings, finished by approx. 2016. There is a four-story library that has a bagel shop, so students and faculty may munch and read. There is ample seating area with some of the most comfortable chairs on campus. There are many places to eat, including healthy choices such as Subway and Chik-Fil-A. As well as these amazing things, however, are the excellent academic programs. There are qualified teachers in every department, and the undergraduate catalog includes a vast variety of majors, minors, and concentrations. What is particularly unique about the university is the wonderful music program, which is very extensive and not found in many schools., 188971=The Student Activities Council and Registered Student Organizations always have events going on, almost every day. In the Spring there's Spring Fling, in 2014 (the year before I was a student) Big Sean came to campus and performed for students for free!!, 611859=For students who believe they might find difficulty in transitioning from high school to college, this University offers the class â??ACAD 1100.â?? Taught by an admissions advisor, this class focuses on topics such as time-management and helpful study habits that have been proven to aid students transitioning from high school into college. For students who are coming into this University without a vehicle, the University offers a free means of transportation known as â??the Blue Line.â?? A bus line that travels around most of both the campus and city. For students who are normally stressed, the Counseling Center sponsors a fully interactive relaxation zone called the â??Relaxation Zone.â?? Comfy lounge chairs, couches, massage chairs and bean bags habitat the area. There, free massages are available along with a fully functioning sauna., 641399=© 2015, Cappex.com, LLC, 90669=My journey with the University of Memphis began in July 2011 and has not failed yet. I went to Orientation and I grew to love it. I learned about the educational programs, but most of all I learned respect and humbleness.}",
    "textBeforeTable": "07/23/2009 Reviewer is A current student here. 32 out of 32 people found this review useful. 1 of 155 Margaret from Henry, TN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "01/27/2010 Reviewer is A current student here. 20 out of 20 people found this review useful. 2 of 155 Categories Comments Great for these types of students Every student that's looking for a great school Tips for prospective students 1.STUDY, STUDY, STUDY!!!! 2.Get enough sleep for class 3.Have a light snack or eat breakfast 4.Try to workout whenever possible-we have a free recreational facility for students to partake in a variety of exercises and sports---It's FREE with school ID- don't gain the FRESHMAN 15 5.Get a study group started or join one, every bit of studying will help with even the hardest class 6.keep a steady schedule so that you can still schedule other things you would like to do like spending time with family and friends or enjoying you favorite hobby. 7.if you work or would like to work make sure it does not interfere with school. I learned that the hard way but I fixed the mistake before it was too later 8. Take every scholarship opportunity available. College isn't cheap, and take it from me, you will not want to continue paying for school well after you graduate, many,many,many years late Bang for the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}