{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2015-09590",
            "",
            "USCG-2015-0235"
        ]
    ],
    "pageTitle": "33 CFR Part 165 - REGULATED NAVIGATION AREAS AND LIMITED ACCESS AREAS | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/33/part-165",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 425,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00052-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 920864935,
    "recordOffset": 920756773,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1019=Title 33 published on 2014-07-01.}",
    "TableContextTimeStampAfterTable": "{455331=The Coast Guard is establishing temporary safety zone in the navigable waters of the San Francisco Bay near Pier 39 in support of the Pier 39 36th Anniversary Fireworks Display on October 4, 11, 18 and 25, 2014. The safety zone is established to ensure the safety of participants and spectators from the dangers associated with pyrotechnics. Unauthorized persons or vessels are prohibited from entering into, transiting through, or remaining in the safety zone without permission of the Captain of the Port or their designated representative., 861509=The Coast Guard proposes to establish a temporary moving safety zone during the Swim Around Charleston, a swimming race occurring on the Wando River, the Cooper River, Charleston Harbor, and the Ashley River, in Charleston, South Carolina. The Swim Around Charleston is scheduled on Saturday, September 26, 2015. The temporary moving safety zone is necessary to protect swimmers, participant vessels, spectators, and the general public during the event. Persons and vessels would be prohibited from entering the safety zone unless authorized by the Captain of the Port Charleston or a designated representative., 648889=On July 25, 2014, the Coast Guard published in the Federal Register (79 FR 43257) a notice of enforcement for the Seattle's Seafair Fleet Week Moving Vessels security zones. In the Notice of Enforcement, the Coast Guard identified three participating vessels that are designated as part of the security zone. One of those vessels was the HMCS YELLOWKNIFE (NCSM 706). After the Notice of Enforcement was published, the Coast Guard was informed by the Canadian government that the HMCS EDMONTON (NCSM 703) will be participating in the Seattle Seafair Fleet Week event and not the HMCS YELLOWKNIFE. This document corrects that error., 1137777=The Coast Guard proposes to issue a temporary safety zone on the waters of the Intracoastal Waterway in Myrtle Beach, South Carolina. The Xterra Swim is scheduled to take place on Sunday, May 3, 2015. The temporary safety zone is necessary for the safety of the swimmers, participant vessels, spectators, and the general public during the event. The temporary safety zone will restrict vessel traffic in a portion of the Intracoastal Waterway, preventing non-participant vessels from entering, transiting through, anchoring in, or remaining within the regulated area unless authorized by the Captain of the Port Charleston or a designated representative., 927931=The Coast Guard proposes to establish a temporary safety zone encompassing certain waters of the Patapsco River. This action is necessary to provide for the safety of life on navigable waters during a fireworks display launched from a barge located within the Inner Harbor at Baltimore, MD, on July 2, 2015. This safety zone is intended to protect the maritime public in a portion of the Patapsco River., 1105601=The Coast Guard is proposing to establish a temporary moving safety zone on the waters of the Tampa Bay in Tampa, Florida during the 24 Mile Tampa Bay Marathon Swim. The swim is scheduled to take place from 4 a.m. to 9 p.m. on April 25, 2015. Approximately 30 swimmers are anticipated to participate in the marathon swim event. No spectators are expected to be present during the event. The safety zone is necessary to provide for the safety of the participants, participant vessels, and the general public on the navigable waters of the United States during the event. The safety zone will establish a moving protective area around all swimmers involved in the race. Persons and vessels, except those participating in the event, will be prohibited from entering, transiting through, anchoring in, or remaining within the regulated area unless authorized by the Captain of the Port St. Petersburg or a designated representative., 779431=The Coast Guard will enforce the safety zone on Lake Michigan in Manistee, MI. for the Manistee Independence Day fireworks. This zone will be enforced from 9 p.m. until 11 p.m. on July 4, 2014. This action is necessary and intended to ensure the safety of life on navigable waters during a fireworks display., 752656=The Coast Guard is establishing a temporary safety zone on the navigable waters of the Colorado River in Bullhead City, AZ in support of the 2014 Bullhead City River Regatta. This temporary safety zone is necessary to provide for the safety of the participants, crew, spectators, sponsor vessels, and other users of the waterway. Persons and vessels are prohibited from entering into, transiting through, or anchoring within this safety zone unless authorized by the Captain of the Port, or his designated representative., 794390=116 Stat. 2064, 70283=The Coast Guard will establish a safety zone in the waters of Agat Marina, Guam, to be enforced daily during the repairs to the Agat marina channel markers from 7:30 a.m. through 6:00 p.m. from May 25, 2015 through June 8, 2015 while the construction barge is in the channel. The safety zone will encompass all waters within 25 yards of the construction barge in the Agat Marina Channel. This safety zone is necessary to protect the crew working the channel markers, and the mariners from the hazards of the repairs taking place at the Agat Marina., 1554272=The Coast Guard proposes to establish a temporary safety zone on the waters of Biscayne Bay, east of Bayfront Park, in Miami, Florida during the 2014 Ironman 70.3 Miami, a triathlon. The Ironman 70.3 Miami is scheduled to take place on October 26, 2014. Approximately 2,500 participants are anticipated to participate in the swim portion of the event. No spectators are expected to be present during the event. The safety zone is necessary to provide for the safety of the participants, participant vessels, and general public on the navigable waters of Biscayne Bay during the event., 110382=The Coast Guard is establishing a temporary safety zone on the South Branch of the Chicago River, Chicago, Illinois. This temporary safety zone is intended to restrict vessels from a designated portion of the South Branch of the Chicago River due to the transit of a floating construction platform on April 26, 2015, or alternatively on a later date. This temporary safety zone is necessary to protect the surrounding public and vessels from the hazards associated with the transit of the floating construction platform., 1000277=The Coast Guard proposes to establish a 500-yard safety zone around each of five locations where the Block Island Wind Farm (BIWF) wind turbine generator (WTG) foundations will be constructed in the navigable waters of the Rhode Island Sound, RI, from July 1 to September 30, 2015. These safety zones are intended to safeguard mariners from the hazards associated with construction of the BIWF WTG foundations. Vessels will be prohibited from entering into, transiting through, mooring, or anchoring within these safety zones while construction vessels and associated equipment are present, unless authorized by the Captain of the Port (COTP), Southeastern New England or the COTP's designated representative., 1446238=The Coast Guard proposes to establish safety zones for underwater detonation operations in the waters of outer Apra Harbor, Guam. This rule would be effective from 2 p.m. on November 5, 2014, until 4 p.m. on November 6, 2014 (kilo, Local Time). The enforcement period for this rule would be from 2 p.m. to 4 p.m. on November 5, 2014 and from 2 p.m. to 4 p.m. November 6, 2014. The Coast Guard believes this safety zone regulation is necessary to protect all persons and vessels that would otherwise transit or be within the affected area from possible safety hazards associated with an underwater detonation operation., 1441632=The Coast Guard proposes to establish a safety zone on the navigable waters of the Chesapeake Bay in the vicinity of Bayshore Road in the Cape Charles Harbor, Cape Charles, VA. This proposed safety zone would restrict vessel movement in the specified area during the Town of Cape Charles New Years Eve fireworks display between 10 p.m. and 10:30 p.m. on December 31, 2014. This action is necessary to provide for the safety of life and property on the surrounding navigable waters during the fireworks displays., 599708=The Coast Guard will enforce a safety zone in the Captain of the Port (COTP) New York Zone on August 20, 2014. This action is necessary to ensure the safety of vessels and spectators from hazards associated with fireworks displays. During the enforcement period, no person or vessel may enter the safety zone without permission from the COTP or a designated representative., 568268=The Coast Guard is establishing two 1000-yard temporary security zones around the President of the United States (POTUS) and/or the first family in conjunction with their visit to Martha's Vineyard, Massachusetts. Vessels and people will be prohibited from entering these security zones during the effective period. These security zones will be effective from 30 minutes prior to the arrival of the POTUS and/or the first family within 1000 yards of navigable waters of the U.S. in the the coastal areas of Chilmark and Edgartown Great Pond, Martha's Vineyard, Massachusetts, until departure of the POTUS and/or the first family from the area. These security zones are needed to safeguard the POTUS and the first family from potential threats or harm. Entry into these zones by any vessel or person is prohibited unless specifically authorized by the Captain of the Port (COTP) or the COTP's designated on-scene representative., 105810=The Coast Guard is establishing a temporary security zone for the U.S. Open Golf Championship at Chambers Bay Golf Course in South Puget Sound, University Place, WA, from June 14, 2015 through June 22, 2015. This action is necessary to ensure the safety and security of participants, spectators, and event officials at the U.S. Open Golf Championship, and will do so by prohibiting any person or vessel from entering or remaining in the security zone unless authorized by the Captain of the Port or his Designated Representative., 215591=The Coast Guard published in the Federal Register of March 5, 2015, a final rule document making final an interim rule previously published at 79 FR 66622 on November 10, 2014. The March 5 final rule incorrectly cited the interim rule as published at 77 FR 75850 on December 26, 2012. This document corrects the citation and date in that final rule to correctly reflect the proper interim rule citation and effective date., 555225=The Coast Guard will enforce a safety zone for a USS MIDWAY private fireworks display on October 6, 2014. This marine event occurs on the navigable waters of San Diego Bay, immediately to the west of the USS MIDWAY located in San Diego Bay, California. This action is necessary to provide for the safety of the participants, crew, spectators, safety vessels, and general users of the waterway. During the enforcement period, persons and vessels are prohibited from entering into, transiting through, or anchoring within this regulated area unless authorized by the Captain of the Port, or his designated representative., 252211=The Coast Guard is establishing a safety zone within Milwaukee Harbor in Milwaukee, Wisconsin. This zone is intended to restrict vessels from a portion of Milwaukee Harbor due to the 2015 Olympic and Sprint Distance National Championships. This safety zone is necessary to protect the surrounding public and vessels from the hazards associated with the 2015 Olympic and Sprint Distance National Championships., 716032=The Coast Guard will enforce the safety zone on Lake Erie in Cedar Point, Ohio, for the Revolution 3 Triathlon in Cedar Point, Ohio. This zone will be enforced from 6 a.m. until 10 a.m. on each day of September 6 and 7, 2014. This action is necessary and intended to ensure safety of life on navigable waters during the Revolution 3 Triathlon. During the aforementioned periods, the Coast Guard will enforce restrictions upon, and control movement of, vessels in the safety zone. No person or vessel may enter the safety zone while it is being enforced without permission of the Captain of the Port Detroit., 761553=The Coast Guard is temporarily changing the enforcement date of a safety zone for one recurring fireworks display in the Fifth Coast Guard District. This regulation applies to only one recurring fireworks event held in the waters of Metedeconk River in Brick Township, NJ. Instead of the usual enforcement periods—July 4, every Thursday in August, and the first Thursday in September—in 2014 enforcement will take place on July 3, July 17, and August 14. The safety zone is necessary to provide for the safety of life on navigable waters during the event. This action is intended to restrict vessel traffic in a portion of Metedeconk River near Brick Township, NJ, during the event., 1081776=The Coast Guard proposes to establish a safety zone on the waters of the Atlantic Ocean east of Daytona Beach, Florida during the Daytona Beach Grand Prix of the Seas, a series of high-speed personal watercraft boat races. This proposed safety zone would be enforced from 7 a.m. on Friday until 7 p.m. on Sunday during the last weekend in April. Approximately 50 high-speed personal watercrafts are anticipated to participate in the races, and approximately 20 spectator vessels are expected to attend the event. This safety zone is necessary to ensure the safety of life on navigable waters of the United States during the races. The regulated area would consist of the following location: All waters of the Atlantic Ocean encompassed within the following points: starting at Point 1 in position 29°14.601′ N, 81°00.767′ W; thence south to Point 2 in position 29°13.677′ N, 81°00.283′ W; thence east to Point 3 in position 29°13.860′ N, 080°59.763′ W; thence north to Point 4 in position 29°14.781′ N, 80°59.802′ W; thence west back to origin. All persons and vessels, except those persons and vessels participating in the high-speed personal watercraft event, are prohibited from entering, transiting, anchoring, or remaining in the regulated area unless authorized by the Captain of the Port Jacksonville or a designated representative., 770871=The Coast Guard is establishing a temporary moving safety zone during the Swim Around Charleston, a swimming race occurring on waters of the Wando River, the Cooper River, Charleston Harbor, and the Ashley River, in Charleston, South Carolina. The Swim Around Charleston is scheduled to take place on September 21, 2014. The temporary safety zone is necessary for the safety of the swimmers, participant vessels, spectators, and the general public during the event. Persons and vessels are prohibited from entering, transiting through, anchoring in, or remaining within the safety zone unless authorized by the Captain of the Port Charleston or a designated representative., 133533=The Coast Guard is establishing a temporary safety zone in the navigable waters of the San Francisco Bay near AT&T Park in support of Giants Enterprises Fireworks Display on May 22, 2015. This safety zone is established to ensure the safety of participants and spectators from the dangers associated with pyrotechnics. Unauthorized persons or vessels are prohibited from entering into, transiting through, or remaining in the safety zone without permission of the Captain of the Port or their designated representative., 353870=The Coast Guard will enforce the safety zone for Connectquot River Fall Fireworks on Connectquot River in Oakdale, NY from 6:30 p.m. to 7:30 p.m. on November 29, 2014. In the event of inclement weather the safety zone will be enforced from 6:30 p.m. to 7:30 p.m. on November 30, 2014. This action is necessary and intended to ensure safety of life on the navigable waters immediately prior to, during, and immediately after the fireworks event. During the aforementioned period, the Coast Guard will enforce restrictions upon, and control movement of, vessels in a specified area immediately prior to, during, and immediately after the fireworks event. During the enforcement period, no person or vessel may enter the safety zone without permission of the Captain of the Port., 941015=The Coast Guard proposes to establish a temporary safety zone encompassing certain waters of Prospect Bay. This action is necessary to provide for the safety of life on navigable waters during a fireworks display launched from a barge located between Hog Island and Kent Island in Queen Anne's County, MD on July 4, 2015. This safety zone is intended to protect the maritime public in a portion of the Prospect Bay., 653763=This document provides required notice of substantive rules issued by the Coast Guard and that were made temporarily effective between July 2013 and June 2014, and that expired before they could be published in the Federal Register . This notice lists temporary safety zones, security zones, special local regulations, drawbridge operation regulations and regulated navigation areas, all of limited duration and for which timely publication in the Federal Register was not possible., 511244=The Coast Guard is establishing a temporary safety zone on the navigable waters of Oceanside Harbor in Oceanside, CA for the 2014 Life Time Triathlon on October 26, 2014. This temporary safety zone is necessary to provide safety for the swimmers, crew, rescue personnel, and other users of the waterway. Persons and vessels are prohibited from entering into, transiting through, or anchoring within this safety zone unless authorized by the Captain of the Port or his designated representative., 197015=The Coast Guard will enforce the RiverFest fireworks safety zone on the Neches River in Port Neches, TX from 8:30 p.m. until 9:30 p.m. on May 2, 2015. This action is necessary to protect persons from the hazards associated with a fireworks display. During the enforcement period no person or vessel may enter the safety zone without the permission of the Captain of the Port (COTP) Port Arthur or his designated on-scene Patrol Commander., 692968=The Coast Guard will enforce Seattle's Seafair Fleet Week Moving Vessels Security Zones from 12:00 p.m. on July 29, 2014 through 6:00 p.m. on August 4, 2014. These security zones are necessary to help ensure the security of the vessels from sabotage or other subversive acts during Seafair Fleet Week Parade of Ships. The designated participating vessels are the HMCS BRANDON (NCSM 710), the HMCS YELLOWKNIFE (NCSM 706), and the USCGC MELLON (WHEC 717). During the enforcement period, no person or vessel may enter or remain in the security zones without the permission of the Captain of the Port, Puget Sound or his designated representative. The COTP has granted general permission for vessels to enter the outer 400 yards of the security zones as long as those vessels within the outer 400 yards of the security zones operate at the minimum speed necessary to maintain course unless required to maintain speed by the navigation rules., 617673=The Coast Guard is establishing a safety zone on the navigable waters of the James River in Newport News, VA for multiple periods, one hour in length each, on all weekdays from August 6 until August 15, 2014. This action will restrict vessel traffic movement in the designated area during the United States Navy's operation involving unmanned and remote-operated crafts. This action is necessary in order to protect the life and property of the maritime public due to the high speed maneuvering of the vessels and the experimental nature of the control technology., 794973=Title 33 published on 2014-07-01, 586168=The Coast Guard will enforce a safety zone for the Bob O'Connor Foundation Fireworks on the Ohio River from mile 0.0 to 0.1. This zone will be in effect on August 20, 2014 from 8:30 p.m. until 9:40 p.m. This zone is needed to protect vessels transiting the area and event spectators from the hazards associated with the Bob O'Connor Foundation Fireworks. During the enforcement period, entry into, transiting, or anchoring in the safety zone is prohibited to all vessels not registered with the sponsor as participants or official patrol vessels, unless specifically authorized by the Captain of the Port (COTP) Pittsburgh or a designated representative., 295312=The Coast Guard is establishing a temporary safety zone on the navigable waters around the Eastport Breakwater Terminal in Eastport, Maine. This safety zone is intended to restrict vessels from approaching within 100 yards of the eastern face of the Eastport Breakwater Terminal without authorization from the Captain of the Port (COTP), Sector Northern New England. This action is necessary due to the uncertainty regarding the breakwater's strength following a partial collapse of the structure on December 4, 2014., 16992=The Coast Guard will enforce the safety zone for the Crescent City Fourth of July Fireworks display in the Captain of the Port, San Francisco area of responsibility during the dates and times noted below. This action is necessary to protect life and property of the maritime public from the hazards associated with the fireworks display. During the enforcement period, unauthorized persons or vessels are prohibited from entering into, transiting through, or anchoring in the safety zone, unless authorized by the Patrol Commander (PATCOM)., 423465=The Coast Guard is establishing a temporary safety zone in the navigable waters of South San Francisco Bay in support of the Semisubmersible Loading Operation taking place between October 14 and 23, 2014 for a 24-hour period. This safety zone is established to ensure the safety of workers, mariners, and other vessels transiting the area from the dangers associated with the loading operations. Unauthorized persons or vessels are prohibited from entering into, transiting through, or remaining in the safety zone without permission of the Captain of the Port or their designated representative., 794566=116 Stat. 2604, 1077551=The Coast Guard proposes to establish a safety zone on the navigable waters of the Chesapeake Bay in Cape Charles, VA. This proposed safety zone would restrict vessel movement in the specified area during the Cape Charles Clam Slam fireworks display between 9:30 p.m. and 10 p.m. on August 1, 2015. This action is necessary to provide for the safety of life and property on the surrounding navigable waters during the fireworks displays., 747961=The Coast Guard will enforce the safety zone on Lake Michigan near Chicago, IL for the start of the Chicago to Mackinac Race. This zone will be enforced on July 18, 2014, from 1:30 p.m. until 4 p.m., and on July 19, 2014, from 10 a.m. until 4:30 p.m. This action is necessary and intended to ensure safety of life on navigable waters during the start of the Chicago to Mackinac Race. During the aforementioned periods, the Coast Guard will enforce restrictions upon, and control movement of, vessels in the safety zone. No person or vessel may enter the safety zone while it is being enforced without permission of the Captain of the Port, Lake Michigan., 358896=This document provides required notice of substantive rules issued by the Coast Guard and that were made temporarily effective between July 2014 and September 2014, and that expired before they could be published in the Federal Register. This notice lists temporary safety zones, security zones, special local regulations, drawbridge operation regulations and regulated navigation areas, all of limited duration and for which timely publication in the Federal Register was not possible., 61171=The Coast Guard is establishing a safety zone for underwater detonation operations in the waters of Apra Outer Harbor, Guam. This rule is effective from 10 a.m. until 4 p.m. on May 15, 2015 and May 21, 2015 (kilo, Local Time). The enforcement period for this rule is from 10 a.m. to 4 p.m. on May 15, 2015 and May 21, 2015. The Coast Guard believes this safety zone regulation is necessary to protect all persons and vessels that would otherwise transit or be within the affected area from possible safety hazards associated with underwater detonation operations., 528748=The Coast Guard will enforce a segment of the Safety Zone; Brandon Road Lock and Dam to Lake Michigan including Des Plaines River, Chicago Sanitary and Ship Canal, Chicago River, Calumet-Saganashkee Channel on all waters of the Chicago Sanitary and Ship Canal from Mile Marker 296.1 to Mile Marker 296.7 at specified times from September 3, 2014, to November 26, 2014. This action is necessary to protect the waterway, waterway users, and vessels from the hazards associated with the U.S. Army Corps of Engineers' installation of a new permanent fish barrier. During the enforcement periods listed below, entry into, transiting, mooring, laying-up or anchoring within the enforced area of this safety zone by any person or vessel is prohibited unless authorized by the Captain of the Port, Lake Michigan, or her designated representative., 897877=The Coast Guard is establishing a temporary safety zone in Lake Union for the Seattle Seafair 4th of July fireworks display. The safety zone is necessary to help ensure the safety of the maritime public during the display and will do so by prohibiting all persons and vessels from entering the safety zone unless authorized by the Captain of the Port or his designated representative., 622404=The Coast Guard will enforce its safety zone for the Superior Man Triathlon in Duluth, MN from 6 a.m. through 9 a.m. on August 24, 2014. This action is necessary to protect participants during the swimming portion of the Superior Man Triathlon. During the enforcement period, entry into, transiting, or anchoring within the safety zone is prohibited unless authorized by the Captain of the Port Duluth or his designated on-scene representative., 684726=On May 12, 2014, the Coast Guard published in the Federal Register (79 FR 26848) a temporary interim rule and request for comments establishing a safety zone on the navigable waters of Gerritsen Inlet surrounding the Belt Parkway Bridge. Inadvertently, this rule included an error in one of the coordinates of the safety zone. This document corrects that error., 680233=The Coast Guard announces that the Fleet Week Maritime Festival's Pier 66 Safety Zone in Elliott Bay, WA will be in effect from 8 a.m. until 8 p.m. on July 30, 2014. In addition to enforcing the safety zone during the parade of ships and aerial demonstration, the safety zone will only be enforced thirty minutes prior and thirty minutes following the conclusion of the parade of ships and aerial demonstration. This action is necessary to promote safety on navigable waters. During the enforcement period, entry into, transit through, mooring, or anchoring within this zone is prohibited unless authorized by the Captain of the Port, Puget Sound or his designated representative., 52361=The Coast Guard will enforce a Safety Zone on the waters of Mission Bay, California for the 2015 Sea World Summer Fireworks displays held on specific evenings from Memorial Day to Labor Day. This action is necessary to provide for the safety of the marine event crew, spectators, safety vessels, and general users of the waterway. During the enforcement period, persons and vessels are prohibited from entering into, transiting through, or anchoring within this regulated area unless authorized by the Captain of the Port, or his designated representative., 331810=The Coast Guard is establishing temporary safety zones for all of Tampa Bay during periods of reduced visibility. The safety zones will be enforced when visibility falls below one nautical mile. Tampa Bay will be categorized into seven zones in order to close only the affected areas of Tampa Bay. Heavy fog affects Tampa Bay an average of 22 days annually, mainly between the months of November through March. These safety zones are necessary to protect commercial traffic from the hazards resulting from reduced visibility. Entering, transiting within, or transiting through this safety zone is prohibited unless authorized by the Captain of the Port St. Petersburg or a designated representative., 706663=The Coast Guard will enforce the safety zone on Lake Michigan within Milwaukee Harbor, Wisconsin for the 2014 Olympic and Sprint Distance National Championships at specified times from August 8 to August 10, 2014. This action is necessary and intended to ensure safety of life on the navigable waters of the United States during the Olympic and Sprint Distance National Championships. During the aforementioned period, the Coast Guard will enforce restrictions upon, and control movement of, vessels in the safety zone. No person or vessel may enter the safety zone while it is being enforced without permission of the Captain of the Port Lake Michigan., 1120011=The Coast Guard proposes to establish a temporary safety zone on the waters of the New River in Fort Lauderdale, Florida during the Rotary Club of Fort Lauderdale New River Raft Race, on Saturday, April 18, 2015. The safety zone will encompass the waters between Esplanade Park to just east of the Southeast 3rd Avenue Bridge. Approximately 100 participants will attend the race. The safety zone is necessary to ensure the safety of the participants, participant vessels, and the general public during the event. Persons and vessels, except those participating in the event, are prohibited from entering, transiting through, anchoring in, or remaining within the regulated area unless authorized by the Captain of the Port Miami or a designated representative., 372653=The Coast Guard is establishing a safety zone on the navigable waters of the Elizabeth River in Portsmouth, VA for 12 periods of 48 hours beginning at midnight on January 5, January 12, January 19, January 22, January 27, February 9, March 2, March 5, March 10, March 23, March 30 and April 6, 2015. This action will restrict vessel traffic movement in the designated area during construction of the new Midtown Tunnel. This action is necessary to protect the life and property of the maritime public due to the number of work vessels in the designated area and their lack of maneuverability while engaged in construction operations., 138101=The Coast Guard is establishing a temporary safety zone during the Xterra swim, a swimming race occurring on waters of the Intracoastal Waterway in Myrtle Beach, South Carolina. The Xterra Swim is scheduled to take place on Sunday, May 3, 2015. The temporary safety zone is necessary for the safety of the swimmers, participant vessels, spectators, and the general public during the event. Persons and vessels are prohibited from entering, transiting through, anchoring in, or remaining within the safety zone unless authorized by the Captain of the Port Charleston or a designated representative., 1353944=The Coast Guard proposes to establish a temporary safety zone encompassing certain waters of Kent Island Narrows in Queen Anne's County, MD. This action is necessary to provide for the safety of mariners and their vessels on navigable waters during bridge repairs at the Kent Narrows (MD-18B) Draw Bridge. This action is intended to restrict vessel traffic movement to protect mariners from potential safety hazards associated with the bridge project scheduled to occur in the federal navigation channel between December 15, 2014 and February 16, 2015. Entry into this zone is prohibited unless specifically authorized by the Captain of the Port Baltimore or his designated representative., 830181=The Coast Guard proposes to establish a temporary safety zone in the navigable waters of Mt. Hope Bay and the Taunton River in the vicinity of Fall River, MA, during the Fall River Grand Prix marine event from August 14-16, 2015. This safety zone is intended to safeguard mariners from the hazards associated with high-speed, high-performance motorboats competing in the event. Vessels will be prohibited from entering into, transiting through, mooring, or anchoring within this safety zone during periods of enforcement unless authorized by the Captain of the Port (COTP), Southeastern New England or the COTP's designated representative., 788093=The Coast Guard will enforce the 2014 San Diego Symphony Summer Pops fireworks display safety zone on Saturday and Sunday evenings from June 28, 2014 thru August 31, 2014, as well as on Friday August 29, 2014. The brief fireworks displays are scheduled to occur between 9 p.m. to 10 p.m., to coincide with the end of the concert. This reoccurring annual summer firework display event occurs on the navigable waters of San Diego Bay in San Diego, California. This action is necessary to provide for safety of the marine event crew, spectators, safety vessels, and general users of the waterway. During the enforcement period, persons and vessels are prohibited from entering into, transiting through, or anchoring within this regulated area unless authorized by the Captain of the Port, or his designated representative., 608580=The Coast Guard will enforce the Pyro Spectaculars USS MIDWAY Museum firework display safety zone on August 28, 2014. This marine event occurs on the navigable waters of San Diego Bay, immediately to the west of the USS MIDWAY, in San Diego, California. This action is necessary to provide for the safety of the participants, crew, spectators, safety vessels, and general users of the waterway. During the enforcement period, persons and vessels are prohibited from entering into, transiting through, or anchoring within this regulated area unless authorized by the Captain of the Port, or his designated representative., 640139=The Coast Guard will enforce the safety zone on Sister Bay in Sister Bay, WI for the Sister Bay Marinafest Ski Show. This zone will be enforced from 1 p.m. until 3:15 p.m. on August 30, 2014. This action is necessary and intended to ensure the safety of life on navigable waters during the ski show. During the aforementioned period, the Coast Guard will enforce restrictions upon, and control movement of, vessels in the safety zone. No person or vessel may enter the safety zone while it is being enforced without permission of the Captain of the Port Lake Michigan., 1235269=The Coast Guard proposes to establish a safety zone within Milwaukee Harbor in Milwaukee, Wisconsin. This zone is intended to restrict vessels from a portion of Milwaukee Harbor due to the 2015 Olympic and Sprint Distance National Championships. This proposed safety zone is necessary to protect the surrounding public and vessels from the hazards associated with the 2015 Olympic and Sprint Distance National Championships., 949653=The Coast Guard proposes temporary safety zones in the Port of Dutch Harbor, Broad Bay, and adjacent navigable waters in the Dutch Harbor area on June 15, 2015. The temporary safety zones would encompass the navigable waters within a 25-yard radius of moored or anchored offshore exploration or support vessels, and the navigable waters within a 100-yard radius of underway offshore exploration or support vessels. The purpose of the safety zones is to protect persons and vessels during an unusually high volume of vessel traffic in the Port of Dutch Harbor, and the adjacent territorial sea due to additional vessel traffic associated with exploratory drilling operations in the Chukchi and Beaufort seas during the summer of 2015. Lawful demonstrations are permitted outside of the temporary safety zones so long as they do not endanger the safety of vessels either moored or anchored within the port, transiting through the port, or transiting through the adjacent waters of the territorial sea., 128870=The Coast Guard establishes a temporary moving safety zone on the waters of Tampa Bay in the vicinity of Tampa, Florida during the 24 Mile Tampa Bay Marathon Swim. The 24 Mile Tampa Bay Marathon Swim is scheduled to take place on April 25, 2015. Approximately 30 swimmers are anticipated to participate in the marathon swim event. No spectators are expected to be present during the event. The safety zone is necessary to provide for the safety of the participants, participant vessels, and the general public on the navigable waters of the United States during the event. The safety zone will establish a moving protective area around safety vessels including kayaks involved in the race. Persons and vessels, except those participating in the event, will be prohibited from entering, transiting through, anchoring in, or remaining within the regulated area unless authorized by the Captain of the Port St. Petersburg or a designated representative., 564064=The Coast Guard will enforce a safety zone for a fireworks display in the Sector Long Island Sound area of responsibility on August 30-31, 2014. This action is necessary to provide for the safety of life on navigable waterways during the event. During the enforcement period, no person or vessel may enter the safety zone without permission of the Captain of the Port (COTP) Sector Long Island Sound or designated representative., 327220=The Coast Guard is establishing a temporary safety zone encompassing certain waters of Kent Island Narrows in Queen Anne's County, MD. This action is necessary to provide for the safety of mariners and their vessels on navigable waters during bridge repairs at the Kent Narrows (MD-18B) Draw Bridge. This action is intended to restrict vessel traffic movement to protect mariners from potential safety hazards associated with the bridge project scheduled to occur in the federal navigation channel between December 15, 2014 and February 16, 2015. Entry into this zone is prohibited unless specifically authorized by the Captain of the Port Baltimore or his designated representative., 418400=The Coast Guard will enforce a segment of the Safety Zone; Brandon Road Lock and Dam to Lake Michigan including Des Plaines River, Chicago Sanitary and Ship Canal, Chicago River, Calumet-Saganashkee Channel on all waters of the Chicago Sanitary and Ship Canal from Mile Marker 296.1 to Mile Marker 296.7 at specified times from October 8, 2014 to November 26, 2014. This action is necessary to protect the waterway, waterway users, and vessels from the hazards associated with the U.S. Army Corps of Engineers' installation of a new permanent fish barrier. During the enforcement periods listed below, entry into, transiting, mooring, laying-up or anchoring within the enforced area of this safety zone by any person or vessel is prohibited unless authorized by the Captain of the Port Lake Michigan, or his or her designated representative., 7861=The Coast Guard is establishing a temporary safety zone on the waters of the New River in Fort Lauderdale, Florida during the Rotary Club of Fort Lauderdale New River Raft Race, on Saturday, June 13, 2015. The safety zone will encompass all waters of the New River between Esplanade Park and the west side of the Florida East Coast Railroad Bridge. Approximately 100 participants will attend the race. The safety zone is necessary to ensure the safety of participants, participant vessels, and the general public during the event. Persons and vessels, except those participating in the event, are prohibited from entering, transiting through, anchoring in, or remaining within the regulated area unless authorized by the Captain of the Port Miami or a designated representative., 1558525=The Coast Guard proposes to establish a safety zone on the navigable waters of the Elizabeth River in the vicinity of the Midtown Tunnel, Portsmouth, Virginia for 12 periods of 48 hours each beginning at midnight on January 1, January 12, January 19, January 22, January 27, February 9, March 2, March 5, March 10, March 23, March 30 and April 6, 2015. This proposed safety zone is intended to restrict vessel movement in the specified area during the construction of the new Midtown Tunnel. This action is necessary to provide for the safety of life and property on the surrounding navigable waters during the aforementioned dates due to the increased amount of work vessels in the area., 25501=The Coast Guard will enforce the safety zone for the Fourth of July Fireworks, City of Eureka in the Captain of the Port, San Francisco area of responsibility during the dates and times noted below. This action is necessary to protect life and property of the maritime public from the hazards associated with the fireworks display. During the enforcement period, unauthorized persons or vessels are prohibited from entering into, transiting through, or anchoring in the safety zone, unless authorized by the Patrol Commander (PATCOM)., 313309=The Coast Guard is establishing a safety zone on the navigable waters of the Elizabeth River in Portsmouth, VA for 10 periods of 48 hours beginning at midnight on February 18, February 23, February 26, March 3, March 9, April 20, April 23, April 27, April 30, and May 11, 2015. This action will restrict vessel traffic movement in the designated area during construction of the new Midtown Tunnel. This action is necessary to protect the life and property of the maritime public due to the number of work vessels in the designated area and their lack of maneuverability while engaged in construction operations., 644494=The Coast Guard will enforce the safety zone on Green Bay in Sister Bay, WI for the Sister Bay Marinafest Fireworks. This zone will be enforced from 8:30 p.m. until 10:30 p.m. on August 30, 2014. This action is necessary and intended to ensure the safety of life on navigable waters during a fireworks display. During the aforementioned periods, the Coast Guard will enforce restrictions upon, and control movement of, vessels in the safety zone. No person or vessel may enter the safety zone while it is being enforced without permission of the Captain of the Port, Lake Michigan., 483783=The Coast Guard is establishing three temporary safety zones on the waters of the Delaware Bay and North Atlantic Ocean adjacent to Cape May, New Jersey. The safety zones will restrict vessel traffic on a portion of the Delaware Bay and North Atlantic Ocean while a Navy exercise is taking place. These temporary safety zones are necessary to protect the surrounding public and vessels from the hazards associated the exercise., 409240=The Coast Guard will enforce the Sea World San Diego 2014 Firework safety zone on November 15, December 12, and December 31, 2014. These reoccurring annual firework display events occur on the navigable waters of Mission Bay in San Diego, California. This action is necessary to provide for the safety of the marine event crew, spectators, safety vessels, and general users of the waterway. During the enforcement period, persons and vessels are prohibited from entering into, transiting through, or anchoring within this regulated area unless authorized by the Captain of the Port, or his designated representative., 234203=The Coast Guard will establish a safety zone on the waters of Cooper River, and Town Creek Reaches in Charleston, South Carolina during the Cooper River Bridge Run on March 28, 2015 from 7:30 a.m. to 10:30 a.m. The Cooper River Bridge Run is a 10K run across the Arthur Ravenal Bridge. The safety zone is necessary for the safety of the runners and the general public during this event. Persons and vessels will be prohibited from entering, transiting through, anchoring in, or remaining within the safety zone unless authorized by the Captain of the Port Charleston or a designated representative., 865851=The Coast Guard is proposing to establish a temporary safety zone extending 200 feet from the left bank Allegheny River Mile 0.0 to 0.25 and extending 200 feet from the right bank Monongahela River Mile 0.0 to 3.09 from 8:00 a.m. to 11:00 a.m. September 5, 2015. A safety zone will also be established extending 300 feet from the left bank Monongahela River Mile 2.32 to 3.09 from 11:00 a.m. to 4:00 p.m. September 5, 2015. This safety zone is needed to protect persons and vessels from the potential safety hazards associated with a paddle board marine event. Entry into this zone will be prohibited to all vessels, mariners, and persons unless specifically authorized by the Captain of the Port (COTP), Pittsburgh or a designated representative., 954346=The Coast Guard proposes temporary safety zones in the Port of Goodhope Bay, Alaska, and adjacent U.S. territorial sea from 12:01 a.m. local time on July 1, 2015, through 11:59 p.m. on October 15, 2015. The temporary safety zones would encompass the navigable waters within a 25-yard radius of moored or anchored offshore exploration or support vessels, and the navigable waters within a 100-yard radius of underway offshore exploration or support vessels. The purpose of the safety zones are to protect persons and vessels during an unusually high volume of vessel traffic in the Port of Goodhope Bay, Alaska, and the adjacent territorial sea due to additional vessel traffic associated with exploratory drilling operations in the Chukchi and Beaufort seas during the summer of 2015. Lawful demonstrations are permitted outside of the temporary safety zones so long as they do not endanger the safety of vessels either moored or anchored within the port, transiting through the port, or through the adjacent waters of the territorial sea., 267875=The Coast Guard is establishing a temporary safety zone in the navigable waters of the San Francisco Bay near Yerba Buena Island, CA in support of the San Francisco-Oakland Bay Bridge (SFOBB) Demolition Safety Zone from December 31, 2014 through December 30, 2015. An earlier temporary safety zone was established in this same area from September 1, 2013 through December 30, 2014 to protect mariners transiting the area from the dangers associated with over-head demolition and debris removal operations of the SFOBB. Extended demolition efforts necessitate a new temporary safety zone in the area. Unauthorized persons or vessels are prohibited from entering into, transiting through, or remaining in the safety zone without permission of the Captain of the Port or their designated representative., 1276323=The Coast Guard proposes to establish a permanent safety zone on the navigable waters of Port Valdez, Valdez, Alaska, in the vicinity of the Valdez Spit. The proposed safety zone is necessary to protect persons and vessels from the hazards associated with the annual City of Valdez July 4th Fireworks Display event. This rule is intended to restrict vessels from a portion of the navigable waters of Port Valdez, in the immediate vicinity of the fireworks launch platforms, before, during, and immediately after the fireworks event., 1110272=The Coast Guard is proposing to establish a temporary moving safety zone on the waters of the Sarasota Bay in Sarasota, Florida during the Swim Around Lido Key. The swim is scheduled to take place from 8 a.m. to 2 p.m. on April 12, 2015. Approximately 100 swimmers are anticipated to participate in the swim event. No spectators are expected to be present during the event. The safety zone is necessary to provide for the safety of the participants, participant vessels, and the general public on the navigable waters of the United States during the event. The safety zone will establish a moving protective area around all swimmers involved in the race. Persons and vessels, except those participating in the event, will be prohibited from entering, transiting through, anchoring in, or remaining within the regulated area unless authorized by the Captain of the Port St. Petersburg or a designated representative., 666403=The Coast Guard is establishing a safety zone for the Marine Week Seattle Seahawks Demonstration area on Lake Washington, Seattle, WA. This event will occur on July 30, 2014 and July 31, 2014. This action is necessary to protect participants and the maritime public from the safety hazards associated with this event, which involves low flying aircraft, combat equipment, and other on-water displays, and will do so by prohibiting any person or vessel from entering or remaining in the safety zone unless authorized by the Captain of the Port (COTP) or a Designated Representative., 124624=The Coast Guard will enforce the safety zone for the Fourth of July Fireworks, Tahoe City, CA in the Captain of the Port, San Francisco area of responsibility during the dates and times noted below. This action is necessary to protect life and property of the maritime public from the hazards associated with the fireworks display. During the enforcement period, unauthorized persons or vessels are prohibited from entering into, transiting through, or anchoring in the safety zone, unless authorized by the Patrol Commander (PATCOM)., 661887=The Coast Guard will enforce the annual Seafair Air Show safety zone on Lake Washington, Seattle, WA from 8 a.m. on August 1, 2014 to 4 p.m. on August 3, 2014. This action is necessary to ensure the safety of the public from inherent dangers associated with these annual aerial displays. During the enforcement period, no person or vessel may enter or transit this safety zone unless authorized by the Captain of the Port or his designated representative., 790494=§ 1231 - Regulations, 775334=The Coast Guard will enforce the safety zone on Lake Michigan in Sheboygan, WI, for the Miesfeld's Lakeshore Weekend fireworks. This zone will be enforced from 8:30 p.m. until 9:45 p.m. on July 25, 2014. This action is necessary and intended to ensure the safety of life on navigable waters during a fireworks display., 702280=The Coast Guard will enforce the safety zone on Lake Michigan in New Buffalo, MI for the New Buffalo Ship and Shore Fireworks display. This zone will be enforced from 9:30 p.m. until 11:15 p.m. on August 9, 2014. This action is necessary and intended to ensure the safety of life on navigable waters during a fireworks display. During the aforementioned period, the Coast Guard will enforce restrictions upon, and control movement of, vessels in the safety zone. No person or vessel may enter the safety zone while it is being enforced without permission of the Captain of the Port Lake Michigan., 730451=The Coast Guard will enforce a segment of the Safety Zone; Brandon Road Lock and Dam to Lake Michigan including Des Plaines River, Chicago Sanitary and Ship Canal, Chicago River, Calumet-Saganashkee Channel on all waters of the Chicago Sanitary and Ship Canal from Mile Marker 296.1 to Mile Marker 296.7 at specified times from June 30 to September 26, 2014. This action is necessary to protect the waterway, waterway users, and vessels from the hazards associated with the U.S. Army Corps of Engineers' installation of a new permanent fish barrier. During the enforcement periods listed below, entry into, transiting, mooring, laying-up or anchoring within the enforced area of this safety zone by any person or vessel is prohibited unless authorized by the Captain of the Port, Lake Michigan, or her designated representative., 995913=The Coast Guard proposes to establish temporary moving safety zone during the Low Country Splash, a swimming race occurring on the Wando River, the Cooper River, and Charleston Harbor, in Charleston, South Carolina. The Low Country Splash is scheduled on May 30, 2015, from 7:30 a.m. to 9:45 a.m. The temporary moving safety zone is necessary to protect swimmers, participant vessels, spectators, and the general public during the event. Persons and vessels would be prohibited from entering the safety zone unless authorized by the Captain of the Port Charleston or a designated representative., 1147363=The Coast Guard proposes to establish twenty three new fireworks display safety zones at various locations in the Sector Columbia River Captain of the Port zone. The Coast Guard previously published a notice of proposed rulemaking with respect to this proposed rule on June 18, 2014. This supplemental notice of proposed rulemaking changes the proposed regulation in the following respects. First, the Coast Guard proposes to amend the regulatory text to clarify that the coordinates for all safety zones addressed by the proposed rule are approximate. Second, the Coast Guard proposes to make corrections to the location of nine existing and ten new fireworks events in the Sector Columbia River Captain of the Port zone. Third, the Coast Guard will be removing a duplicate entry of the Hood River 4th of July event., 1170433=The Coast Guard proposes to establish a temporary security zone for the U.S. Open Golf Championship at Chambers Bay Golf Course in South Puget Sound, University Place, WA, from June 14, 2015 through June 22, 2015. This action is necessary to ensure the safety and security of participants, spectators, and event officials at the U.S. Open Golf Championship, and will do so by prohibiting any person or vessel from entering or remaining in the security zone unless authorized by the Captain of the Port or his Designated Representative., 720863=The Coast Guard will enforce the Lakeside Labor Day Fireworks safety zone on Lake Erie in Lakeside, Ohio for the Lakeside End of Season Fireworks. This zone will be enforced from 9:45 p.m. until 10:30 p.m. on August 30, 2014. This action is necessary and intended to ensure safety of life on the navigable waters during the Lakeside End of Season Fireworks. During the aforementioned periods, the Coast Guard will enforce restrictions upon, and control movement of, vessels in the safety zone. No person or vessel may enter the safety zone while it is being enforced without permission of the Captain of the Port Detroit., 21238=The Coast Guard will enforce the safety zone for the Berkeley Marina Fourth of July Fireworks display in the Captain of the Port, San Francisco area of responsibility during the dates and times noted below. This action is necessary to protect life and property of the maritime public from the hazards associated with the fireworks display. During the enforcement period, unauthorized persons or vessels are prohibited from entering into, transiting through, or anchoring in the safety zone, unless authorized by the Patrol Commander (PATCOM)., 1492046=The Coast Guard proposes to establish temporary safety zones on the waters of Tampa Bay, Florida during Old Port Tampa Exercise 2014. The exercise is scheduled to take place on November 4, 2014. The proposed safety zone is necessary to protect the public from the hazards associated with environmental response operations occurring during the exercise. Persons and vessels will be prohibited from entering, transiting through, anchoring in, or remaining within the safety zone unless authorized by the Captain of the Port St. Petersburg or a designated representative., 657882=The Coast Guard is establishing a safety zone encompassing certain waters of the Patapsco River. This safety zone is necessary to protect the public and vessels on navigable waters during a fireworks display launched from a barge located adjacent to the East Channel of Northwest Harbor at Baltimore, MD on August 5, 2014., 460119=The Coast Guard will enforce a safety zone for the Pittsburgh Steeler/Steelers Fireworks on the Allegheny River from mile 0.0 to 0.2 and Ohio River from mile 0.0 to 0.3. This zone will be in effect on October 20th, November 2nd, and December 28th, 2014 from 7:30 p.m. until 8:50 p.m. This zone is needed to protect vessels transiting the area and event spectators from the hazards associated with the Pittsburgh Steeler/Steelers Barge-based Fireworks. During the enforcement period, entry into, transiting, or anchoring in the safety zone is prohibited to all vessels not registered with the sponsor as participants or official patrol vessels, unless specifically authorized by the Captain of the Port (COTP) Pittsburgh or a designated representative.}",
    "lastModified": "Thu, 04 Jun 2015 03:28:17 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 31467 - Security Zone; Portland Rose Festival on Willamette River, Portland, OR 2015-06-03; vol. 80 # 106 - Wednesday, June 3, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 33. Title 33 published on 2014-07-01. 72 FR 36328, 36329165 160.56.04-66.04-11.05-1195 , July 2, 2007. appear by USCG-2006-25556, Nomenclature changes to part Editorial Note: CGD 79-034, 47 FR 29660, July 8, 1982, unless otherwise noted. Source: ; Pub. L. 107-295, 116 Stat. 2064; Department of Homeland Security Delegation No. 0170.1. , and , , ; 33 CFR",
    "textAfterTable": "DEPARTMENT OF HOMELAND SECURITY, Coast Guard Interim final rule. This rule is effective on June 3, 2015. This rule will be enforced on JUNE 3, 2015 through JUNE 8, 2015. Comments and related material must be received by the Coast Guard on or before July 6, 2015. Requests for public meetings must be received by the Coast Guard June 10, 2015. 33 CFR Part 165 Summary The Coast Guard is permanently amending the Portland Rose Festival on Willamette River security zone. This regulation is enforced annually during the Portland, Oregon Rose Festival on the waters of the Willamette River between the Hawthorne and Steel Bridges. This final rule will eliminate inconsistencies between the actual event dates and the enforcement period published in the Code of Federal Regulations. This will serve to better inform the public of the security zone. 2015-06-02; vol. 80 # 105 - Tuesday, June 2, 2015 80 FR 31300 - Safety Zone; Rotary Club of Fort Lauderdale New River Raft Race, New River; Fort Lauderdale, FL GPO FDSys",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}