{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus has security. Parking-lots are well lit at night, except for the one near the observatory. Have never felt uneasy on campus.",
            "Animal Science Nursing Sports Therapy",
            "Great classes and professors. Well worth the time and money.",
            "I have never eaten on campus but there are a number of places just off of the campus.",
            "There are no dorms.",
            "Most classes transfer to top class universities.",
            "Register as early as you can, classes can be difficult to get into.",
            "All the professors I have had have been great. The classes are challenging and interesting. The only college with am exotic animal training and management program."
        ]
    ],
    "pageTitle": "Moorpark College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Moorpark-College/reviews?_escaped_fragment_=/show/84636",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00234-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907515247,
    "recordOffset": 907460395,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{272003=© 2015, Cappex.com, LLC, 106141=October is domestic violence awareness, so the Campus is having events all this month to promote awareness. The Red Cross Blood Mobile is on campus at least once a month. Most clubs and organizations give back to charities., 4995=15 Units? Less than $1000 dollars. Yes. Bang for the buck, indeed., 229880=It is a pretty decent community college. The teachers are pretty good, and they have lots of great sports areas like a nice track, tennis courts, baseball fields, field hockey, golf, etc. The only real negatives so far have been no swimming pool, and the parking is a mess unless you get there by 8:00 am.}",
    "textBeforeTable": "04/26/2011 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 65 Zachary from Moorpark, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Great for these types of students It's great if you have little money or know you want to transfer to the UC/Cal State. Tips for prospective students If you want to save money, GO TO MOORPARK. However, if you plan on transferring to a private school, check their transfer agreements before signing up for classes. Also, know the CRN numbers before the sign-up dats. Do choir; Vail Keck is a wonderful professor. Take a philosophy class with Janic Daurio; brilliant woman. Bang for the buck 15 Units? Less than $1000 dollars. Yes. Bang for the buck, indeed. Am enjoying being here It's in a beautiful area, but I personally don't like the feel of it. It's just a personal things. Nice professors though. Am learning a lot Most of the teachers are quiet knowledgeable and have a good grasp of their subject matter. Login to rate or flag the reviews Dustin from Irvine, CA 07/07/2011 Reviewer is A past student here.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}