{
    "relation": [
        [
            "Patent application number",
            "20110277672",
            "20110278887",
            "20130009009",
            "20130009389",
            "20130009430",
            "20130015642",
            "20130015686",
            "20130026803",
            "20140077478"
        ],
        [
            "Description",
            "TRAY TABLE STOP ASSEMBLY - Described are tray table stop assemblies comprising a housing comprising at least one deployment track, a force-receiving mechanism comprising at least one protuberance, wherein the at least one protuberance is slidingly coupled to the at least one deployment track, and a biasing mechanism positioned between the force-receiving mechanism and the housing. In some embodiments, the tray table stop assembly is coupled to a passenger seat assembly adjacent a tray table assembly having at least one arm. In these versions, the arm of the tray table assembly is positioned to apply pressure to the force-receiving mechanism when the tray table assembly travels between a stowed position and a deployed position. When the tray table assembly moves forward beyond the stowed position, the force-receiving mechanism is positioned within the travel path of the arm.",
            "SEAT SUPPORT ASSEMBLY - Described are seat support assemblies comprising at least one of a pitch reducer assembly, a fitting assembly, an energy absorption assembly, and an integrated leg assembly. The pitch reducer assembly may include a pitch reducer housing, at least one pitch riser, and at least one pitch stop. The integrated leg assembly may include a forward leg and an aft leg, where the forward leg is coupled to the pitch reducer assembly. The fitting assembly may include a pair of forward housing mating components and a pair of aft housing mating components, where the pairs of mating components are coupled to the forward and aft legs, respectively. The energy absorption assembly may include a tubular member, a die slidingly coupled to the tubular member, and a die holder coupled to the die, wherein the die holder has a hemispherical outer surface that is configured to pivotally mate with a passenger seat housing and rotate about an arc of rotation relative to the tubular member",
            "AIRBAG IN PRIVACY WALL - Embodiments of the present invention provide an airbag system designed to deploy from a privacy wall in a diagonal manner.",
            "DEVIATING AIRBAG - Embodiments of the present invention provide an airbag system formed from non-traditional or asymmetric airbag shapes that deflect a vehicle occupant away from an interior vehicle structure.",
            "ENERGY ABSORBER - Described are energy absorbers for a structure within a vehicle cabin having at least one airbag, an inflator, a control module, and an outer surface positioned adjacent the airbag. The outer surface may include a plurality of mechanical energy absorbers positioned adjacent the airbag and coupled to the outer surface, wherein the outer surface comprises a surface area that is greater than an inflated surface area of the airbag. The outer surface may also include a breakable area positioned adjacent the airbag, wherein the breakable area has a weaker coupling to the outer surface on at least a first side and a stronger coupling to the outer surface on at least a second side.",
            "BONNET AIRBAG - Embodiments of the present invention provide a bonnet airbag system that is configured to deploy in a forward manner from a back portion of a seat.",
            "ACTIVE SEAT BACK - Described are active seat backs for a passenger seat having a seat back with a pivot location, at least one active system coupled to the pivot location, and at least one sensing circuit electrically connected to the at least one active system. The at least one sensing circuit comprises integrated logic to monitor for crash scenarios and to transmit a signal to the at least one active system when such a scenario is detected. The passenger seat back may be rotated aft when the at least one active system receives the signal from the at least one sensing circuit.",
            "AIRBAG MODULE ON SEAT BACK - Described are airbag modules for a passenger seat having a seat back, a container coupled to the seat back, wherein the container includes at least one airbag, and a structure positioned aft of the seat back, wherein the structure includes a recess configured to receive the at least one airbag in a deployed state. In certain examples, the container also has a cover with a breakable line, and the structure also has a breakable area positioned aft of the recess, wherein the breakable line is configured to form an opening in the cover and the breakable area is configured to form an opening in the aft surface when a force is applied by the at least one airbag in a deployed state.",
            "AIRBAG IN PRIVACY WALL - Embodiments of the present invention provide an airbag system designed to deploy from a privacy wall in a diagonal manner."
        ],
        [
            "Published",
            "11-17-2011",
            "11-17-2011",
            "01-10-2013",
            "01-10-2013",
            "01-10-2013",
            "01-17-2013",
            "01-17-2013",
            "01-31-2013",
            "03-20-2014"
        ]
    ],
    "pageTitle": "Trimble, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/trimble-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00009-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 448174747,
    "recordOffset": 448149614,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Robert W. Trimble, Gainesville, TX US 11-15-2012 DOOR ASSEMBLY FOR AN ELECTRONIC EQUIPMENT RACK - A door assembly for an equipment rack. A unitary frame includes an upper horizontal member, a left-hand vertical member, and a right-hand vertical member. A left-hand door is pivotally mounted on the left-hand vertical member for movement between an open position, in which equipment is accessible through a left-hand portion of the frame, and a closed position, in which access to equipment through the left-hand portion is blocked by the left-hand door. A right-hand door is pivotally mounted on the right-hand vertical member for movement between an open position, in which equipment is accessible through a right-hand portion of the frame, and a closed position, in which access to equipment through the right-hand portion is blocked by the right-hand door. A locking mechanism locks the left-hand door and the right-hand door in their respective closed positions, thereby blocking access to the equipment through the frame. 20120285095 Published Description Patent application number Robert James Trimble, Canyon Lake, CA US 09-18-2008 Automated banking machine system and method - An automated banking machine is operatively controlled from a front consumer user station and a rear maintenance user station. The machine is operative to output a consumer user interface through a front display device. The consumer user interface includes interactive options for performing transactions with the machine including dispensing cash with a cash dispenser.",
    "textAfterTable": "Patent applications by Robert W. Trimble, Gainesville, TX US Ronald Ray Trimble, Acton, MA US Patent application number Description Published 20110184921 System and Method for Data Driven De-Duplication - Described are computer-based methods and apparatuses, including computer program products, for removing redundant data from a storage system. In one example, a data delineation process delineates data targeted for de-duplication into regions using a plurality of markers. The de-duplication system determines which of these regions should be subject to further de-duplication processing by comparing metadata representing the regions to metadata representing regions of a reference data set. The de-duplication system identifies an area of data that incorporates the regions that should be subject to further de-duplication processing and de-duplicates this area with reference to a corresponding area within the reference data set. 07-28-2011 20110184966 System and Method for Summarizing Data - Described are computer-based methods and apparatuses, including computer program products, for removing redundant data from a storage system. In one example, a data delineation process delineates data targeted for de-duplication into regions using a plurality of markers. The de-duplication system determines which of these regions should be subject to further de-duplication processing by comparing metadata representing",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}