{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Eggheads",
            "Japanese News",
            "Seven Early News",
            "Today",
            "The Project"
        ],
        [
            "Time",
            "5:30 am - 6 am",
            "5:40 am - 6:15 am",
            "5:30 am - 6 am",
            "5:30 am - 9 am",
            "5 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2012/11/02/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00086-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 705242019,
    "recordOffset": 705167595,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{19013=Relive the classis 2012 comp with five days of sun and swell with the old school battling generation next., 10291=LUCY MACKEN For all those who have always wished they bought a big house in Vaucluse in, say, 2006, now's your chance.}",
    "TableContextTimeStampAfterTable": "{121059=November 2 - 4 The futuristic-building is about to open its doors., 124675=November 9 - 17 Could there be any more enticing a headline than 'Beer Week'?, 264926=November 01 2012, 251945=johnno, Nov 2, 2012, 3:03AM, 100995=Entries now open! Event on Sunday, November 11., 122815=November 3 & 4 Take a tour through the Perth buildings that you wouldn't normally have access to., 252824=jeremy, Nov 2, 2012, 1:21AM, 121960=November 3 Pull out the doggie tu-tus and bowties – the time has come for your mutt's debut., 32612=TRAVEL INSIDER Forget CDs and evening classes: here's how to pick up a new lingo, 2012-style., 246621=1214 views, 123769=November 9 - 11 Celebrating its 20th year, the annual festival has once again pulled some big names., 242968=Total votes: 11453., 245793=1820 views, 247613=1087 views}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: Something is missing from this two-part, four-hour telemovie besides pace. The Sinking of the Laconia What's on TV Tonight Click here to find out how to win one of three 32GB iPhone 5’s. Win an iPhone 5 Stay Connected Your chance to claim exclusive signed Supanova merchandise Win Supanova merchandise Competitions Brisbane's best in business recognised. Click for more photos Lord Mayor's Business Awards Honoured 1 Guide to celebrating the Melbourne Cup in Brisbane.",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD National Press Club Address 4:30 am - 5:30 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane Sunrise Extra 5 am - 5:30 am Channel Nine Brisbane Nine's Early Morning News 5 am - 5:30 am Network TEN Brisbane The Project 5 am - 6 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:30 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane Seven Early News 5:30 am - 6 am Channel Nine Brisbane Today 5:30",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}