{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "NO greek life just theme houses!",
            "WAYYY EXPENSIVE and wont let u in if u owe too much more than 800 dollars u cant check in.",
            "lots of activities, clubs and social events.",
            "Through time you either get used to it or it gets better! Lol",
            "NO AC!!",
            "Teachers are so nice!!!",
            "Manage time wisely Be prepared to come into such a friendly atmosphere",
            "This school is great. The school is nicknamed The Forest. It has some deers and squirrels around the campus. The school is peaceful and just a good environment to study."
        ]
    ],
    "pageTitle": "Drew University - College of Liberal Arts Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Drew-University-College-of-Liberal-Arts/reviews?_escaped_fragment_=/show/6987",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00023-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898207923,
    "recordOffset": 898158385,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{171690=© 2015, Cappex.com, LLC, 30153=Drew is the most expensive school in New Jersey at $52,500 (not including books) for the 2011-2012 year. It's just not worth it, particularly considering all the BS that Drew students have to deal with with the school's administration. To make matters worse, scholarships and merit aid has decreased in recent years., 6440=Ever heard of the ol' quote, Life is what you make of it? This undeniably applies to student life at Drew. I will be honest: when I first arrived at Drew, I did not fall in love with it within the first few days or even with in the first couple of weeks. It took time for the school and campus life to grow on me. I think it was because my expectations were too high. I wanted to love it immediately without putting any effort into making the most of my life here. I think the trick to falling in love with any university is to get involved! For such a tiny school, Drew has a ridiculous amount of clubs and organizations, sports, internship opportunities, and campus jobs to immerse yourself in. There isn't much to do off-campus, because Madison is a very suburban town mostly filled with boutiques and restaurants, and the neighboring towns are not-so-cheap train rides away. But if you want to have fun, you can make it happen! So don't coop yourself up in your room all day. I've found that the people I know here who are truly unhappy are those who coincidentally are not involved (physically or emotionally). This is NOT the way to go. You must be interactive and social - even if you are shy or introspective by nature, like me, apply your social skills and you will find that it is easy to have fun on campus. I am someone who has never been very interested in sports, but in November, I joined the Varsity Fencing team - and later, began to take up free fitness and exercise courses offered at Drew. Get involved!, 2109=Very diverse student body, which is great. Lots of good people! Gorgeous campus! Not nearly enough parking... Freshmen and sophomore residents can't have cars. Not at all flexible for those of us who have to work! You have to work within walking distance. LOTS of drinking on campus. They actually change the cafeteria food when parents are expected... eg. homecoming weekend. Not a lot to do in town. Close to trains and buses, though. Would be happier if things were more flexible... eg. parking, food plans, campus safety rules (in dorms by 8pm or you have to be let in by campus safety - new rule 2009-10), etc.}",
    "textBeforeTable": "08/31/2009 Reviewer is A current student here. 16 out of 17 people found this review useful. 1 of 33 S in NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp =",
    "textAfterTable": "Great for these types of students Drew University is a melting pot of all types of students, although I will say that most of them are upper-middle class White kids from South Jersey. Still, we also have international and out-of-state students; we have artists and fashionistas; and we have athletes. Tips for prospective students Get involved. Make the most of your time at Drew. Enjoy yourself. And GO TO CLASS. This should not even need to be mentioned, but many college students assume that they don't need to go to class because they are adults. At Drew, students take their education quite seriously, and prospective students should enter this college - or any college, for that matter - with the same mindset. Bang for the buck The quality of education here is excellent, but Drew is very expensive. Apparently, it is one of the most expensive schools in the nation. Why I rate this four/five stars is because Drew gives terrific financial aid. Am enjoying being here Ever heard of the ol' quote, Life is what you make of it? This undeniably applies to student life at Drew. I will be honest: when I first arrived at Drew, I did not fall in love with it within",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}