{
    "relation": [
        [
            "",
            "SFR",
            "Average Class Size",
            "Unique Course",
            "Small Course"
        ],
        [
            "CSU",
            "7.29%",
            "4.91%",
            "2.08%",
            "-15.61%"
        ],
        [
            "SSU",
            "9.29%",
            "18.10%",
            "-1.99%",
            "-52.94%"
        ]
    ],
    "pageTitle": "CRC Minutes 12-11-1998",
    "title": "Percent Change Comparison",
    "url": "https://www.sonoma.edu/afd/crc/1998-1999/crc19981211.html",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00230-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 920438975,
    "recordOffset": 920423017,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{34402=In 1992-93, both enrollment and faculty positions dropped dramatically. The Target FTES declined from 5800 to 5267, or 9%; the actual FTES dropped from 6005 to 5442, also 9%; Faculty positions in instruction also declined, from 298 to 263, or 12%, explained by \"golden handshake\" early retirement and part-time faculty positions which were not replaced. As a result, the SFR increased from 20.1 in 1991-92 to 20.7, or 3%. The following three years - 1993-94, 1994-95, and 1995-96, actual FTES fell below targeted FTES., 32312=The study uses the Academic Year 1987-88 as a starting point, since this was the last year in which the State of California, the CSU, and SSU itself enjoyed a budget surplus until the recent recovery. The following year, the Gann Initiative, Prop. 13, took effect., 38331=The table below shows the change in SFR from year to year during the period under study. The years of greatest SFR deterioration (or increasing SFR) where 1990-91, 1991-92, 1988-89, and 1992-93. The years of greatest decline have been 1995-96 and that projected for 1998-9., 37953=Since Spring enrollments historically fall below those of the Fall, the Actual figures for 1998-99 should more closely approximate those projected. As a result,, 43852=The unadjusted Student Faculty Ratio (SFR) has increased systemwide 1.4 persons (from 19.2 to 20.6) and 1.7 persons for the SSU (18.3 to 20.0) since 1989. SSU has been slightly above the systemwide average since 1993., 1298=Schlereth then asked for a motion to approve the minutes of November 13, 1998. Dennis Harris made a motion. A second was obtained from Bernie Goldstein. The minutes were then approved with no nay notes but with abstentions from those Members not present at the November 13, 1998 meeting., 18157=Because the budget model recommended by the PBAC, when taken in concert with the final budget figures received from the Governor, would have produced a shortfall in Academic Affairs, the President and the Cabinet met to devise a method to minimize the impact of externally driven changes on the instructional program. Specifically, the Cabinet recommended that while the marginal cost formula was a good method to distribute new revenue in most years, it urged the President to modify the formula to the advantage of Academic Affairs in 1998-1999. The President agreed and the following budget allocations were approved for 1998-1999:, 7459=Again, referencing materials contained in the Agenda Packet, Schlereth explained how the final campus budget for fiscal 1998-1999 was developed. In Spring, 1998, the President's Budget Advisory Committee (PBAC) analyzed projected new revenue sources to the campus and identified several University-Wide priorities that it believed warranted \"off the top\" funding. These new revenue and University-Wide expense items are outlined below:, 43465=Harris then summarized an analysis of the SFR prepared by Rose Bruce, SSU's Director of Assessment and Analytic Studies, showing changes in Fall SFR, Average Class Size, Unique Courses, and Small Sections, for both SSU and the CSU, from Fall 1989 through Fall 1997. That material, also contained in the Agenda Packet, is reproduced below., 36649=SSU projected enrollment to decline slightly from that in 1997-98; however it also projected faculty positions to increase, resulting in a lowering of the SFR. Actual data is only available for the Fall 1998 Semester. This shows that both FTES and FTEF exceeded projections. Nonetheless, the SFR has declined., 5040=Schlereth also explained the nature of the Parking Decentralization initiative which returned resources to the campus previously held by the CSU. He noted that this decentralization step made it possible for the campus to transfer certain expenses from the General Fund to the Parking program in 1995-1996, creating a mechanism to assist with balancing the General Fund during a budget cutting year in order that cuts to the instructional program would not be necessary. He acknowledged the President's leadership in this regard. Schlereth also reviewed where the $485,000 allocated for land acquisition had come from including:, 60392=Schlereth reminded Members of the Spring Meeting schedule of the CRC as outlined in the Packet. A suggestion was made to ask Deborah DuVall to attend the February 1999 CRC meeting in order to outline the various components of the proposed Campus Master Plan revision. Schlereth indicated that he would coordinate DuVall's presentation. Several Members raised concerns about the presence of mice in certain campus locations. John Bond indicated he would take steps to address this problem., 1015=Furukawa-Schlereth brought the meeting to order at 12:10 AM and asked for a motion to approve the Agenda. A motion was made by Floyd Ross. A second was obtained from Ahamad Hosseini. The Agenda was approved unanimously., 12152=Both the PBAC and VPBAC recommendations were finalized in May 1998 even though the final budget from the State was not approved until early in the fall, 1998 semester. As is almost always the case, the final budget approved by the Governor contained certain differences from what was expected earlier in the budget process. These items are summarized below:, 45384=The Average Class Size is the average number of students enrolled in class sections excluding courses that are only supervision, independent study or in non-traditional classrooms (CS numbers C01-C21). The Average Class Size has increased systemwide 1.3 people (26.5 to 27.8) and 4.0 people for the SSU (22.1 to 26.1) between 1989 and 1997. SSU is below the system average with respect to the Average Class Size., 61102=CRC Minutes 1998-1999 Updated 2008-01-08 AFD.WebContact@Sonoma.edu, 60915=Given the time, Schlereth thanked the Members for their attendance and participation and adjourned that meeting at 4:15 PM., 23416=Referencing materials contained with the Agenda Packet (Packet) Schlereth then explained the 1998-1999 Academic Affairs Plan for Financial Adjustment. The following specific points were made:, 58493=Schlereth then recognized Ogg who coordinated the second reading on the proposed Key Control \"blue paper\" policy. Ogg indicated that she had incorporated suggestions made regarding the policy made at the 11-13-98 CRC meeting. Harris then moved to approve the policy as presented. A second was obtained from Goldstein. The Harris motion was approved unanimously., 41073=Comparisons between institutions may be inappropriate, even within the same university setting. However, they are also unavoidable. Even though decisions regarding enrollment (FTES) and the allocation of resources to Direct Instruction (FTEF) are made at the campus level, the Chancellor's Office does aggregate data in order to compare SFR's among campuses and with the CSU as a whole over time. The following table shows the CSU system Average SFR, that of SSU, and the difference between the two for the period 1987-88 through 1996-97 (the last year currently available)., 56396=Schlereth then recognized Harris, who moved to table his previous motion (made at the CRC Meeting of 11-13-98) regarding campus consultation on the budget. A second to Harris's motion was obtained from Barnier. Harris explained that his reason for moving to table his 11-13-98 motion was due to general acceptance of the Goldstein/Schlereth proposal on budget consultation (outlined below):, 90=Approved Unanimously by CRC, February 12, 1999}",
    "textBeforeTable": "The overall shift in Student Faculty Ratio, Average Class Size, Unique Courses and Small Courses are reflected in the table and figure below. -52.94% -15.61% Change 89-97 104 4508 97 106 4359 96 134 4166 95 118 3885 94 113 3657 93 118 3499 9 146 4060 91 171 5179 90 221 5342 89 SSU CSU Fiscal Year Small Sections Comparison The number of Small Sections is the count of class sections with enrollments lower than 13 (LD), 10 (UD), and 5 (GR) for sections with CS numbers C01-C21. The number of Small Sections has dropped 15.6% systemwide and 52.9% for SSU. -1.99% 2.08% Change 89-97 937 31363 97 936 30868 96 907 30351 95 898 29802 94 886 29460 93 918 29443 92 974 30524 91 993 31146 90 956 30724 89 SSU CSU Fiscal Year Unique Courses Comparison",
    "textAfterTable": "Harris concluded the analysis of SFR by noting that changes in any of these measures (Class Size, Course and Section size and offerings, as well as SFR) are subject to different interpretations. For instance, a rising SFR could be interpreted as a sign of increasing productivity by some and as a sign of decreased student-faculty interaction by others. What the institution needed to do is have a strategic discussion of what is appropriate for SSU's mission. If that discussion results in a determination that a lower SFR is an appropriate measure of the degree to which SSU is fulfilling its mission, the institution should figure out what the target SFR ought to be. PBAC should then develop a multi-year plan to reduce the SFR to that target level. AFD FINANCIAL ISSUES Schlereth then moved to a discussion of various financial issues facing the Division of Administration and Finance. He noted that the Division had been given responsibility for a number of new operational requirements, which had been funded as reflected below: Renovation Costs - Temporary High School $565,000 Sonoma State Enterprises 97-98: $100,000 Sonoma State Enterprises 98-99: $100,000 Housing Growth Administration: $100,000 Housing Reserves: $265,000 TOTAL: $560,000 Costs Associated with New Space $ 83,240 Permanent funding expected in 99-00 from CSU \"funds to open new buildings\". Temporary funding in 98-99 from CMS-AFD Specific Budget and Division general salary savings. Funding for EMT Summer Stipends $ 10,000 General Housing Operations $ 10,000 Funding for Historical COLA",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}