{
    "relation": [
        [
            "Key",
            "Enable",
            "Defer",
            "UserEntersMissingInfo",
            "UseRecoveryKey",
            "ShowRecoveryKey",
            "OutputPath",
            "Certificate",
            "PayloadCertificateUUID",
            "Username",
            "Password",
            "UseKeychain"
        ],
        [
            "Type",
            "String",
            "Boolean",
            "Boolean",
            "Boolean",
            "Boolean",
            "String",
            "Data",
            "String",
            "String",
            "String",
            "Boolean"
        ],
        [
            "Value",
            "Set to 'On' to enable FileVault. Set to 'Off' to disable FileVault. This value is required.",
            "Set to true to defer enabling FileVault until the designated user logs out.",
            "Set to true for manual profile installs to prompt for missing user name or password fields.",
            "Set to true to create a personal recovery key.",
            "Set to true to display the personal recovery key to the user after FileVault is enabled.",
            "Path to the location where the recovery key and computer information plist will be stored.",
            "DER-encoded certificate data if an institutional recovery key will be added.",
            "UUID of the payload containing the asymmetric recovery key certificate payload.",
            "User name of the Open Directory user that will be added to FileVault.",
            "User password of the Open Directory user that will be added to FileVault. Use the UserEntersMissingInfo key if you want to prompt for this information.",
            "If set to true and no certificate information is provided in this payload, the keychain already created at /Library/Keychains/FileVaultMaster.keychain will be used when the institutional recovery key is added."
        ]
    ],
    "pageTitle": "Configuration Profile Key Reference",
    "title": "",
    "url": "https://developer.apple.com/library/ios/featuredarticles/iPhoneConfigurationProfileRef/Introduction/Introduction.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00104-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 860580923,
    "recordOffset": 860542063,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{211793=Copyright © 2015 Apple Inc. All Rights Reserved. Terms of Use | Privacy Policy | Updated: 2015-01-31, 115831=Optional. The key size in bits, either 1024 or 2048., 161821=Optional SA lifetime (rekey interval) in minutes. Valid values are 10 through 1440. Defaults to 1440 minutes., 44345=PEM-encoded certificate without private key. May contain root certificates., 44107=DER-encoded certificate without private key. May contain root certificates.}",
    "textBeforeTable": "At the top level, a profile property list contains the following keys: Configuration Profile Keys Note: Before you get started working with configuration profiles, you should create a skeleton configuration profile. This provides a useful starting point that you can then modify as desired. This document describes the keys in a configuration profile and provides examples of the resulting XML payloads. Devices can be supervised when preparing them for deployment with Apple Configurator (iOS 5 or later) or by using the Device Enrollment Program (iOS 7 or later). When a device is supervised, you can use profiles to control more of its settings. For more information about the Device Enrollment Program, visit Apple’s iPad in Business or IT in the Classroom pages. Both iOS and OS X support using encryption to protect the contents of profiles. Profiles can also be signed to guarantee data integrity. To learn about encrypted profile delivery, read Over-the-Air Profile Delivery and Configuration. Over the air using a Mobile Device Management Server Using over-the air configuration as described in Over-the-Air Profile Delivery and Configuration On a webpage In an email message Using Apple Configurator (iOS only) There are five ways to deploy configuration profiles: Configuration profiles are in property list format, with Data values stored",
    "textAfterTable": "RemovalDate date Optional. The date on which the profile will be automatically removed. DurationUntilRemoval float Optional. Number of seconds until the profile is automatically removed. If the RemovalDate keys is present, whichever field yields the earliest date will be used. ConsentText Dictionary Optional. This dictionary’s keys must be locale strings that contain a canonicalized IETF BCP 47 language identifier. Additionally, the key default may be present to provide the default localization. The system chooses a localized version in the order of preference specified by the user (OS X) or based on the user’s current language setting (iOS). If no exact match is found, the default localization is used. If there is no default localization, the \"en\" localization is used. If there is no \"en\" localization, then the first available localization is used. You should provide a default localization. No warning will be displayed if the user’s locale does not match any of the localizations in the consentText dictionary. Note:  Profile payload dictionary keys that are prefixed with “Payload” are reserved key names and must never be treated as managed preferences. Any other key in the payload dictionary may be considered a managed preference for that preference domain. Keys in the payload dictionary are described in detail in the next section. Payload Dictionary Keys Common to All Payloads If",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}