{
    "relation": [
        [
            "Number of Discs",
            "EMS",
            "Resister Air",
            "AirMail",
            "SAL"
        ],
        [
            "One",
            "1800yen",
            "1160yen",
            "750yen",
            "500yen"
        ],
        [
            "Two",
            "2190yen",
            "1560yen",
            "1150yen",
            "850yen"
        ],
        [
            "Three",
            "2580yen",
            "1760yen",
            "1350yen",
            "1200yen"
        ],
        [
            "Four",
            "2970yen",
            "1960yen",
            "1550yen",
            "1400yen"
        ]
    ],
    "pageTitle": "Hitotsuma Yuri Komuro [DVD]",
    "title": "Europe",
    "url": "http://c.manifo.jp/detailview.html?KEY=ENFD-4094&site=cdjapan",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00281-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 43510747,
    "recordOffset": 43483568,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Fri, 31 Jul 2015 21:21:50 GMT",
    "textBeforeTable": "1400yen 1200yen 850yen 500yen SAL 1550yen 1350yen 1150yen 750yen AirMail 1960yen 1760yen 1560yen 1160yen Resister Air 2550yen 2200yen 1850yen 1500yen EMS Four Three Two One Number of Discs North, Central America/Oceania/ Middle East Cardboard sleeve CD is lighter than regular CD/DVD (click here for details). Our website lists weights by default. The actual weight of the item will be different. You can calculate shipping charges with the Shipping Charge Calculator in Shopping Cart. Shipping Charge (Regular CD/DVD) We use JP Express Pelican Service for sending packages domestically for a flat rate shipping charge of 399yen. 1-2 days Domestic Shipping (Japan) It may take up to 12 weeks to arrive. Very low shipping charge. 7-21 days (1-3 weeks) SAL (Surface Air Lift) It may take up to 8 weeks to arrive. Registerd Air Mail (Option) For customers who prefer more reliable delivery for an additional fee of 410yen. Resonable shipping charge Available for sending packages all over the world. 4-12 days Air Mail Large orders available (up to 20 kg possible). Online Tracking available. Very fast and reliable delivery. 3-6 days EMS (Express",
    "textAfterTable": "Asia Number of Discs One Two Three Four EMS 1200yen 1500yen 1800yen 2100yen Resister Air 1060yen 1360yen 1560yen 1760yen AirMail 650yen 950yen 1150yen 1350yen SAL 450yen 750yen 950yen 1150yen South America / Africa Number of Discs One Two Three Four EMS 2000yen 2300yen 2700yen 3100yen Resister Air 1360yen 1860yen 2360yen 2660yen AirMail 950yen 1450yen 1950yen 2250yen SAL 600yen 980yen 1360yen 1740yen Payment Method Credit Card We accept VISA, MasterCard, American Express, Diners Club, JCB. We also accept VISA Check Card, Visa Electron Card issued as a credit card, and Debit MasterCard. International Postal Money Order (IPMO) IPMO is a safe and reliable method of remitting payments internationally. Cash We accept cash payment in Japanese Yen or in US Dollars. Please refer to the order confirmaion email you receive upon placing your order online for the total amount in both currencies. Your order will be processed once we receive your cash payment. Make sure to get the envelope containing your cash payment registered, or send it using a courier that requires signature of recipient upon delivery. Please Note",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}