{
    "relation": [
        [
            "",
            "",
            ""
        ],
        [
            "Saeed Zavareh",
            "Mojdeh Salehnia",
            "Adel Saberivand"
        ],
        [
            "First Author",
            "Other Author",
            "Other Author"
        ],
        [
            "",
            "salehnim@modares.ac.ir",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ijfs.ir/components4.php?rQV===AfABDQ6QnchR3cfZGfAFTMApDZJRnblJXYw9lZ8B0M2EDQ6QWStVGdp9lZ8BEMApDZJxWY0J3bQxWYuJXdvp2XmxHQyATNApDZJ52bpR3Yh9lZ",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 515233490,
    "recordOffset": 515225288,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{23300=Journal Title: Volume 3,Number 3,Nov-Dec 2009, Pages: 87-156 Article title: Comparison of Different Vitrification Procedures on Developmental Competence of Mouse Germinal Vesicle Oocytes in the Presence or Absence of Cumulus Cells, 34062=  Copyright © 2013 Powered By www.itpco.net    www.itpco.ir    www.niloofar.co.ir}",
    "textBeforeTable": "Article Authors: Article keywords: Oocytes, Cryopreservation, Cumulus Cells, In vitro Article abstract: Background: An evaluation of the developmental competence of vitrified mouse germinal vesicle (GV) oocytes with various equilibration and vitrification times; in the presence or absence of cumulus cells and by comparison between the cryotop method and straws was performed. Materials and Methods: Mouse GV oocytes were considered in cumulus-denuded oocytes (CDOs) and cumulus-oocyte complexes (COCs) groups. Their survival and developmental rates were studied in the following experiments: (I) exposure to different equilibration times (0, 3 and 5 minutes) and vitrification (1, 3 and 5 minutes) without plunging in LN2 as toxicity tests, (II) oocytes were vitrified using straws followed by exposure to equilibration solution for 0, 3 and 5 minutes and vitrification solution for 1 and 3 minutes, and (III) oocytes were vitrified by cryotop following exposure to equilibration for 5 minutes and vitrification for 1 minute, respectively. Results: Maturation and developmental rates of the COCs were higher than CDOs in the nonvitrified group (p<0.05). The survival and maturation rates were low in all oocytes exposed to vitrification solution for 5 minutes (p <0.05). In vitrified CDOs and COCs using straws, the survival rates ranged from 56.9% to 85.4% and 44.0% to 84.5%, and the maturation rates from 35.3%",
    "textAfterTable": "Received: 14 Jun 2009 Accepted: 19 Sep 2009 * Corresponding Address: P.O.Box: 14115-111 Anatomy Department Faculty of Medical Sciences Tarbiat Modares University Tehran Iran Email: salehnim@modares.ac.ir Up Home Page  |   Contact Us  |   Journal Archive  |   Site Map  |   Join Us  |   Send Article  |   Article Review",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}