{
    "relation": [
        [
            "",
            "",
            "",
            "View"
        ],
        [
            "Craig, Stanley Lelan",
            "Craig, Thos.",
            "Crail, Absolom",
            "Crail, John"
        ],
        [
            "Clark, Anna",
            "Mountjoy, Phebe [w/o Genl. Wm. Mountjoy, dec'd]",
            "Tate, Lyddia",
            "Stephens, Rachiel"
        ]
    ],
    "pageTitle": "E. E. Barton Papers",
    "title": "",
    "url": "http://www.kykinfolk.com/pendleton/marriage/Barton_MarriagesC5.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00307-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 556309121,
    "recordOffset": 556300919,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{212777=©Copyright 2005-2015 by Pendleton County Genealogy Project All files on this website are copyrighted by their submitter and creator. They may be linked to, but may not be reproduced on another website or in any other form, without specific permission of the submitter, owner, publisher and this site moderator. Although public records are as such not copyrightable, the manner in which they are presented, including the notes, comments, etc. are. The information on this site is provided free of charge, by volunteers, for your personal use only., 211447=NOTE: These records have been transcribed from several different sources, either by us or by other researchers and provided as a starting point to assist you in your research; we've verified as many as we could, but be aware that there may be errors (either mis-spellings on the original records, almost illegible writing on the records, and/or typing errors on my part), so make sure to double check them prior to assuming they're \"the gospel truth\". We will never deliberately include erroneous information in any part of this site. These records have not been copied by either of this site's coordinators from other sites, as has been implied by some. Sources have included records from the E. E. Barton research files, military records, newspapers, microfilm and/or compiled lists that were provided by family members and other researchers. The majority of the additions to the marriage index pages on 17 and 30 Jun 2007 were transcribed from FHC microfilm #973027.}",
    "textBeforeTable": "E. E. Barton Papers Pendleton County Marriages \"C\" FHL US/CAN A-G, Film # 358489 Cooper, Henry - Crawford, Jno., Jr.  ",
    "textAfterTable": "View Cooper, Myrtie Simpson, Cora C. Groom Bride",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}