{
    "relation": [
        [
            "Condition:",
            "Connector:",
            "MPN:"
        ],
        [
            "New: A brand-new, unused, unopened, undamaged item in its original packaging (where packaging is applicable). Packaging should be the same as what is found in a retail store, unless the item is handmade or was packaged by the manufacturer in non-retail packaging, such as an unprinted box or plastic bag. See the seller's listing for full details. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "N/A",
            "Does not apply"
        ],
        [
            "Brand:",
            "Sound Mode:",
            ""
        ],
        [
            "N/A",
            "N/A",
            ""
        ]
    ],
    "pageTitle": "Ear Cup Pads Earpads Earphone for Sony MDR V600 V900 | eBay",
    "title": "",
    "url": "http://www.ebay.com/itm/Ear-Cup-Pads-Earpads-Earphone-Sony-MDR-V600-V900-/290490723364?_trkparms=algo%3DSIC.NPJS%26its%3DI%26itu%3DUA%26otn%3D5%26pmod%3D380459356489%26ps%3D63%26clkid%3D1512034645650550582",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00140-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 422161019,
    "recordOffset": 422117898,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  Jul 30, 2015 06:38:10 PDT  Seller assumes all responsibility for this listing. 290490723364 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Close this window Buy only this item close this window and add these items to your cart. If you Buy It Now, you'll only be purchasing this item. If you'd like to get the additional items you've selected to qualify for this offer, Add to cart to save with this special offer",
    "textAfterTable": "Questions and answers about this item No questions or answers have been posted about this item. Ask a question - opens in a new window or tab Seller assumes all responsibility for this listing. Shipping and handling This item will ship to United States, but the seller has not specified shipping options. Contact the seller- opens in a new window or tab and request a shipping method to your location. Shipping cost cannot be calculated. Please enter a valid ZIP Code. Item location: Shenzhen, China",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}