{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "rage",
            "Japanese News",
            "NBC Today",
            "Good Morning America",
            "Home Shopping"
        ],
        [
            "Time",
            "5 am - 6 am",
            "5:40 am - 6:15 am",
            "4 am - 6 am",
            "4:30 am - 6 am",
            "5:30 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2012/04/21/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00245-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 701261575,
    "recordOffset": 701192810,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{249870=2461 views, 246987=Total votes: 11521., 256439=change-broker, Apr 20, 2012, 11:47PM, 128353=April 19 Few are aware of the comedy scene in our own backyard., 131215=April 22 Perth artist Jess Lyn is holding her own at hip-hop festival., 218669=Guaranteed return of 5.80% p.a. for 7 mnths. Ends April 23, 127431=April 19 What's going to hit the spot in Perth this weekend?, 267528=April 19 2012, 130317=April 28 Pencil this in your diary kids, that's when tickets go on sale and it's going to sell out fast., 36327=MATT CAMPBELL Forbes Global 2000 survey reveals the highest ranking car makers among the top 2000 companies in the world., 250656=1562 views, 251417=1156 views, 255535=change-broker, Apr 20, 2012, 11:49PM, 129433=April 27 - 28 Circus Joseph Ashton is in town but it's not just the little ones that are being entertained..., 246064=Total votes: 12051., 86633=Watch the start of this award winning animation, DVD available April 25.}",
    "textBeforeTable": "8am 7:30am 7am 6:30am 6am 5:30am Skip to: Who better to take us through 25 years of rage than You Am I frontman Tim Rogers? Rage: Silver Jubilee What's on TV Tonight Read more now Get this for only $19 - save 53% Kideo Cartoon DVD Starring Your Child Living SocialBrisbanePartner site 14 If you didn't know about these indie music hubs, now's the perfect time. Ready for Record Store Day? About Town Watch the opening scene from the The Secret of the Unicorn. Click to play video The Adventures of Tintin Exclusive This article contains a video that will play automatically.",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD rage 6 am - 10 am SBS ONE Queensland Hong Kong News 6:15 am - 6:35 am Channel Seven Brisbane Stitch! 6 am - 6:30 am Channel Nine Brisbane Team Umizoomi 6 am - 6:30 am Network TEN Brisbane Flight of the Wombats 6 am - 7 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD rage 6 am - 10 am SBS ONE Queensland Chinese News 6:35 am - 7:05 am Channel Seven Brisbane Handy Manny 6:30 am - 7 am Channel Nine Brisbane Dora the Explorer 6:30 am - 7 am",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}