{
    "relation": [
        [
            "Patent application number",
            "20090028603",
            "20100315478",
            "20120127252",
            "20120141167",
            "20140198171",
            "20140376966"
        ],
        [
            "Description",
            "BEAM DEFLECTOR, LIGHT SCANNING UNIT AND IMAGE FORMING APPARATUS HAVING THE SAME - A beam deflector having a base, the beam deflector including a polygon mirror to reflect a light beam, a mirror driving unit including a rotor shaft erected from the base and a rotor to support the polygon mirror and to rotate about the rotor shaft, a friction member to contact with and be separated from the rotor so as to obstruct and release rotation of the rotor, respectively, and a friction member driving unit to drive the friction member.",
            "Semiconductor laser diode, printhead including the diode, and image forming apparatus including the diode - Provided are a semiconductor laser diode, and a printhead and an image forming apparatus including the semiconductor laser diode. The semiconductor laser diode includes a concave-convex pattern, and emits light having a Gaussian light intensity distribution. High quality images are provided by applying the semiconductor laser diode to a printhead and an image forming apparatus.",
            "Polygon mirror assembly, light scanning unit employing polygon mirror assembly, and image forming apparatus - A polygon mirror assembly, a light scanning unit employing the polygon mirror assembly, and an image forming apparatus. The polygon mirror assembly includes a polygon mirror formed of a plastic material and having a plurality of reflection surfaces; and a motor unit to support and rotate the polygon mirror, where the polygon mirror is coupled to the motor unit by using an adhesive material.",
            "Polygonal mirror, light scanning unit using the polygonal mirror, and image forming apparatus - A polygonal mirror, a light scanning unit using the polygonal mirror, and an image forming apparatus. The polygonal mirror is formed of a plastic and includes a plurality of reflection surfaces that are formed in an outer portion of the polygonal mirror and rotate around a rotational axis, and an internal mirror surface that defines a hole, wherein a ratio of an internal diameter d to an outer diameter D satisfies 0.1≦d/D≦0.3.",
            "WEIGHT-BALANCED POLYGONAL MIRROR, LIGHT SCANNING UNIT USING THE POLYGONAL MIRROR, AND IMAGE FORMING APPARATUS - A light scanning unit includes a light source to emit a light beam; a polygonal mirror to deflect the light beam in a main scanning direction; and an imaging optical system to image the light beam onto a scanning surface. The polygonal mirror includes a plurality of reflection surfaces that are formed in an outer portion of the polygonal mirror and rotate around a rotational axis and an internal mirror surface that defines a hole. A ratio of an internal diameter d to an outer diameter D satisfies 0.1≦d/D≦0.3. The polygonal mirror is adhered to a motor unit that supports and rotates the polygonal mirror, using an adhesive. The internal mirror surface of the polygonal mirror defining the hole is point-bonded to the motor unit using the adhesive, and the point-bonding is conducted in a direction toward a corner of the reflection surfaces.",
            "POLYGON MIRROR ASSEMBLY, LIGHT SCANNING UNIT EMPLOYING POLYGON MIRROR ASSEMBLY, AND IMAGE FORMING APPARATUS - A polygon mirror assembly, a light scanning unit employing the polygon mirror assembly, and an image forming apparatus. The polygon mirror assembly includes a polygon mirror formed of a plastic material and having a plurality of reflection surfaces; and a motor unit to support and rotate the polygon mirror, where the polygon mirror is coupled to the motor unit by using an adhesive material."
        ],
        [
            "Published",
            "01-29-2009",
            "12-16-2010",
            "05-24-2012",
            "06-07-2012",
            "07-17-2014",
            "12-25-2014"
        ]
    ],
    "pageTitle": "Yoo, Yongin-Si - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/yoo-yongin-si-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 445991516,
    "recordOffset": 445953133,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jae-Hwan Yoo, Yongin-Si KR 12-31-2009 (S)-(-)-Amlodipine Camsylate or Hydrate Thereof And Pharmaceutical Composition Comprising Same - Disclosed is (S)-(−)-amlodipine camsylate or a hydrate thereof having good photostability and high solubility, and a pharmaceutical composition comprising same, which can be efficiently used in treating cardiovascular diseases. 20090326234 Published Description Patent application number Jaeho Yoo, Yongin-Si KR //]]> BarDraw('2494968',['Patent applications by Jae Haeng Yoo, Yongin-Si KR'],[[1,2,1,1,2]],['2009','2010','2011','2012','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2494968\" align=\"center\"></div> </div> <canvas id=\"bg2494968\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Jae Haeng Yoo, Yongin-Si KR</p> <div class=\"bar2494968\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>11-21-2013</td> <td><a href=\"/patents/app/20130307253\">AIRBAG COVER AND MODULE</a> - An airbag cover includes a housing section which forms an upper part of which is opened and into which a folded airbag cushion is housed; and a guide section which is formed by extending an upper rear end and both ends of the opened housing section to form an additional space for extending a space of the housing section and a front surface of which at a passenger side is opened to guide an initial deployment direction of the airbag cushion toward a passenger side.</td> <td>20130307253</td> <tr> </tr> <td>01-24-2013</td> <td><a href=\"/patents/app/20130020789\">ACTIVE SAFETY APPARATUS FOR VEHICLES AND METHOD OF CONTROLLING THE SAME</a> - An active safety apparatus for vehicles and a method of controlling the apparatus, which can actively control the operation of a safety device,",
    "textAfterTable": "Patent applications by Jae-Hwan Yoo, Yongin-Si KR Jae Won Yoo, Yongin-Si KR Patent application number Description Published 20130137653 THEANINE DERIVATIVE, PREPARATION METHOD THEREOF, AND USE THEREOF FOR ALLEVIATING ACNE - The present invention relates to a theanine derivative, a preparation method thereof, and a use thereof for anti-acne treatment, having a selective inhibitory effect on 05-30-2013 20140357593 TOPICAL COMPOSITION CONTAINING THEANINE DERIVATIVES FOR USE ON SKIN - The present invention relates to a topical composition for use on skin containing theanine derivatives as active components and, more particularly, to a topical composition for use on skin having anti-aging, skin wrinkle repair, skin barrier enhancement, skin immunity enhancement, skin moisturizing, and atopy alleviation effects by containing theanine derivatives as active components. 12-04-2014 Jang Yong Yoo, Yongin-Si KR Patent application number Description Published 20100196778 MANUFACTURING METHOD OF POROUS METAL ELECTRODE FOR MOLTEN CARBONATE FUEL CELLS USING DRY PROCESS - The present invention provides a method of manufacturing a porous metal electrode for a molten carbonate fuel cell using a dry process. According to the method of manufacturing a porous metal electrode of the present invention, in the press",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}