{
    "relation": [
        [
            "Title",
            "Wellington conference fieldtrip guides.",
            "1. Wellington Fault: Neotectonics and Earthquake. Geology of the Wellington-Hutt Valley Segment.",
            "2. Beach Geology and Geomorphology at Turakirae Head, Wellington.",
            "5. Southern Wairarapa Fault and Wharekauhau Thrust (Palliser Bay.",
            "7. Wanganui: Sea Level Cycles, Tephras and Terraces in the Late Cenozoic."
        ],
        [
            "Authors/Leaders",
            "Compiled by Timothy Little",
            "John Begg et al.",
            "Mauri McSaveney & David Kennedy",
            "Timothy Little et al.",
            "Warren Dickenson et al."
        ],
        [
            "Duration",
            "-",
            "1 day",
            "1 day",
            "1 day",
            "2 day"
        ],
        [
            "Download",
            "1.3MB pdf",
            "7.5MB pdf",
            "576KB pdf",
            "6.4MB pdf",
            "3MB pdf"
        ]
    ],
    "pageTitle": "Conference field trip guides",
    "title": "",
    "url": "http://www.gsnz.org.nz/conference-field-trip-guides-c-2_9.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00212-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479449289,
    "recordOffset": 479432895,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{50164=Jan Lindsay, Andrew Needham, Lucy McGee, Tracy Howe., 67552=Tauranga Conference, 2007 Field Trip Guides. GSNZ Misc. Pub. 123B, 27562= New Plymouth Conference, 2014. GSNZ Misc Pub 139B, 25647=Download version 1.0 (18 Feb 2006 doc format) Download version 2.0 (7 Sept 2006 pdf format) Download version 3.0 (Sept 2009 pdf format) Download version 3.0 (Sept 2009 doc format) Roadside stops appendix (Sept 2009 pdf format), 30610=Christchurch Conference, 2013 Field trip Guides. GSNZ Misc. Pub. 136B, 40837=Nelson Conference, 2011 Field Trip Guides. GSNZ Misc. Pub. 130B, 48159=Auckland Conference, 2010 Field Trip Guides. GSNZ Misc. Pub. 129B, 94962=Whangarei Conference, 2002 Field Trip Guides. GSNZ Misc. Pub. 112B, 83018=Taupo Conference, 2004 Field Trip Guides. GSNZ Misc. Pub. 117B, 26962=Since 2002 GSNZ fieldguides have been converted to pdf format and are posted below for ready reference. Such guides often contain useful syntheses of information that may not be published elsewhere. Proper citation is encouraged and, where appropriate, users should contact the authors for permission to cite material., 72109=Massey Conference, 2006 Field Trip Guides. GSNZ Misc. Pub. 122B, 62999=Wellington Conference, 2008 Field Trip Guides. GSNZ Misc. Pub. 124B, 36071=Hamilton Conference, 2012 Field trip Guides. GSNZ Misc. Pub. 134B, 52845=Oamaru Conference, 2009 Field Trip Guides. GSNZ Misc. Pub. 128B, 75267=Kaikoura Conference, 2005 Field Trip Guides. GSNZ Misc. Pub. 119B, 102306=Bibliography of field guides 1891-1990. GSNZ Misc Pub 51, 87558=Dunedin Conference, 2003 Field Trip Guides. GSNZ Misc. Pub. 116B, 102407=Thompson, B.N.; Hayward, B.W. (compilers) 1991. Bibliography of New Zealand earth science excursion guides, 1891-1990. GSNZ Misc Pub 51, 85 pp. Download 490kb Excel file.}",
    "textBeforeTable": "Oamaru Conference, 2009 Field Trip Guides. GSNZ Misc. Pub. 128B 3.7Mb pdf 5 day Bernhard Spörli, Dan Hikuroa 6. \u0093Northland, New Zealand: Onset of a new subduction regime.\u0094 4.3Mb pdf 1 day Károly Németh, Lucy McGee 4. \u0093Styles of phreatomagmatism recorded in the pyroclastic successions of Auckland\u0092s maars and tuff rings.\u0094 2.8Mb pdf 1 day Jan Lindsay, Andrew Needham, Lucy McGee, Tracy Howe. 3. \u0093Rangitoto re-visited: new insights to an old friend.\u0094 677kb pdf 1 day Bruce Hayward, Hugh Grenfell 2. \u0093The Puketoka Formation and the age of the Hauraki Graben.\u0094 Download Duration Authors/Leaders Title",
    "textAfterTable": "6. \"Aviemore - a dam of two halves.\" D.J.A. Barrell, S.A.L. Read, R.J. Van Dissen, D.F. Macfarlane, J. Walker, U. Rieser  1 day 4.3Mb pdf 7. Field Trip 7 \"Vanished World.\"  Ewan Fordyce  1 day 7.1Mb pdf 8. Field Trip 8 \"Victorian Oamaru.\"  Scott Elliffe  - 7.1Mb pdf 9. \"Miocene phreatomagmatic monogenetic volcanism of the Waipiata Volcanic Field, Otago, New Zealand.\"  Karoly Nemeth & James White  1 day 7.1Mb pdf 10. \"West Coast student trip.\"  D. Jugum, D., R.J. Norris, A.F. Cooper, V.G. Toy  4 days 11.3Mb pdf 11. \"Waitaki/Canterbury Basin.\"  Ewan Fordyce  2 days 11.3Mb pdf 12. \"Paleobotany, palynology and sedimentology of Late Cretaceous \u0096 Miocene sequences in Otago and Southland.\"  Daphne Lee, Jon Lindqvist, Dallas Mildenhall, Jennifer Bannister, Uwe Kaulfuss  3 days 5.1Mb pdf 13. \"Deepest Fiordland.\" Mo",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}