{
    "relation": [
        [
            "Activity",
            "Trek to search for the Golden Monkeys near Ruhengeri (if time allows)",
            "Trek in the forests of Rwanda's Volcanos National Park in search of the mighty mountain gorillas - an unforgettable experience!",
            "Trek out to Dian Fossey's Memorial in the forests around Ruhengeri (if time allows)",
            "Head out for a full day trekking around Visoke and other high volcanos in Volcanos National Park (if time allows)",
            "Visit the weaving collective at the Red Rocks Community Project (if time allows)"
        ],
        [
            "Approximate Cost",
            "USD 100",
            "Included in Kitty",
            "USD 75",
            "USD 75",
            "USD 10"
        ]
    ],
    "pageTitle": "Trip Notes for",
    "title": "",
    "url": "http://www.dragoman.com/holidays/trip-notes/africa-encompassed?format=dossier&vid=3814&did=49943",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 408790871,
    "recordOffset": 408719913,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{153620=Learn all about the tragic 1994 Rwanda genocide at the extremely moving Genocide Memorial in Kigali, 187820=As of December 2014, there is a new common visa available called the UNIVISA or Kazavisa, costing USD50 for all nationalities - this will cover Zimbabwe and Zambia for a maximum of 30 days, and for as many entries back and forth between the two countries as required. Please note this is currently undergoing a trial period and is only available at Harare or Lusaka airports, Victoria Falls airport and land border, and the Kazangula land border to Botswana - it is not yet available at the Chirundu border to Malawi or the Plumtree border to Botswana used by Dragoman trips, so this scheme is currently most useful for those arriving in Victoria Falls., 175728=From September 2015 it will no longer be possible to obtain a visa on arrival or at a consulate, and tourists of all nationalities will have to obtain an e-visa at least 7 days in advance of arrival into Kenya - please go to www.ecitizen.go.ke to set up an account and apply; it may take up to 7 days to be approved, then they will send a visa approval confirmation to your email address which you must print out to present at the border. At the time of writing (2015), the cost of a single-entry visa is USD50, EUR40 or GBP30 for all nationalities., 136837=Mji wa Neema is Swahili for 'house of hope'. an is a small UK based charity raising funds to support orphaned children in and around Naivasha and Gilgil in Kenya, and specifically to fund Saidia Children's Home and projects started by Jill Simpson MBE, Teresa Wahito and Jane Kinuthia. Jill sadly passed away in October 2009 after a lifetime of good work, but Jane and Teresa continue to work tirelessly on behalf of AIDS orphans and other deprived children in the area., 247880=These trip notes were printed on 31/07/2015, 191396=Zambian Kwacha - please note that the currency of Zambia (the Kwacha, old code ZMK, new code ZMW) was re-based in 2013, and the old notes are no longer accepted. Please be careful that you only accept notes of the new currency (2013 and later) when exchanging money as some money changers have been known to offload old currency onto travellers. The new currency comes in denominations of ZMW2, 5, 10, 20, 50 and 100 - any notes such as ZMK5000 are the old currency, do not accept them!, 89973=Hwange National Park became the royal hunting grounds to the Ndebele warrior-king Mzilikazi in the early 19th century and was set aside as a National Park in 1929. Today Hwange boasts a tremendous selection of wildlife with over 100 species of mammals and nearly 400 bird species. The elephants of Hwange are world famous and the park elephant population is one of the largest in the Africa.  We will explore the park in open 4x4 vehicles and stay within the park at one of the camp grounds., 68813=The Strip is a classic example of how the former colonial powers shaped the boundaries of modern Africa. At 500km long, with the game reserve only 32 kms wide, the Strip opens up to almost 100kms wide at the eastern end, before narrowing to a point on the Zambezi River - and this is where the boundaries of Zimbabwe, Namibia, Zambia and Botswana meet. During the struggle for independence the Caprivi region was home to the South African Army and Police, and from the early 1960s until 1990, the region was in a constant state of war., 48970=The Namib Desert stretches for about 2000 km from Southern Angola to Olifants River in South Africa. It is squeezed into an area less than 200 kms wide between the South Atlantic Ocean and the Great Western Escarpment., 207672=United States. http://travel.state.gov/travel/travel_1744.html, 13235=Rwanda is a landlocked republic situated on the eastern rim of the western arm of the Great Rift Valley. It is part of the watershed of Africa's two largest river systems, the Nile and the Congo. Much of the country is covered in mountains, especially in the volcanic Virunga chain protected by the Volcanoes National Park. The two main tribal groupings are the Hutu and the Tutsi. The 1994 genocide was just the most recent chapter of a long and bitter relationship between the two groups. In recognition of this, whilst in Rwanda we will organise a visit to the Genocide Memorial at Kigali. Rwanda has made enormous progress in rebuilding itself following the troubles, and is rapidly acquiring a reputation for the warmth of the welcome provided to travellers., 95798=The city’s exact history is unknown but recent research suggests a gold-rich civilisation flourishing between 1200 and 1450 AD.  The site consists of three main groups of stone structures: the Hill Complex, once thought to be the home of the witch doctor but now believed to be the King’s residence; the Great Enclosure; and the Valley Complex. Its splendour is best appreciated at sunrise or sunset. Archaeologists have found fragments of Chinese pottery at the site suggesting that Great Zimbabwe is the end of the Silk Trading Route from the east., 133031=+254-20-2722358, 242184=For mobile phones, please note that most countries in the Americas operate at 850MHz and 1900 MHz which is not the same frequencies used in Europe, Africa, Asia and Australia. Most modern tri-band and quad-band mobile phones will be able to operate on these frequencies but please check your mobile phone specifications before travelling to ensure that you'll be able to use your phone in the Americas., 186148=As of December 2014, there is a new common visa available called the UNIVISA or KAZA visa, costing USD50 - this will cover Zimbabwe and Zambia for a maximum of 30 days, and for as many entries back and forth between the two countries as required. Please note this is currently undergoing a trial period and is only available at Harare or Lusaka airports, Victoria Falls airport and land border, and the Kazangula land border to Botswana - it is not yet available at the Chirundu border to Malawi or the Plumtree border to Botswana used by Dragoman trips, so this scheme is currently most useful for those arriving in Victoria Falls. The KAZA visa is available to citizens of the UK, Australia, New Zealand, USA, Canada and most EU countries, but is not available to Irish passport holders., 2360=Botswana is one of the finest safari destinations in Africa. With 17% of the country covered by national parks, the wildlife is diverse. There are over 85 species of mammals and well over 1000 types of birds that reside in the country's national parks. Chobe, probably best know for its elephant population, is Botswana's premier national park., 137741=Lake Nakuru National Park was established in 1968 to protect the huge flocks of lesser and greater flamingos that live here. At times there are over one million of these spectacular birds roaming around the acrid waters of the soda lake that is the centrepiece of the park. Even if you are not a keen birdwatcher the sight is inspiring and it is not hard to understand why the lake has become such a favourite for African wildlife documentaries. Nakuru is also where much of the film \"Out of Africa\" was shot., 16747=The show case of the 2010 FIFA world cup has shown the world that South Africa is a modern country with deep routes in traditional culture. It's the perfect destination to understand how the modern world can blend with traditional African culture., 167410=Please note that this trip spends time above 2800 metres/9200 feet where it is possible for travellers to experience some adverse effects on your health due to the altitude, potentially including Acute Mountain Sickness (AMS), High Altitude Cerebral Edema (HACE) and High Altitude Pulmonary Edema (HAPE)., 49201=The desert has some stunning flora and fauna. Probably the most famous is the wonder plant, Welwitschia mirabilis, which is endemic to the Namib. Many of these horizontal trees are over 1000 years old. This plant, which is part of the pine tree family, only has two leaves, but these leaves are vital as they allow the plant to take up fog water. In fact, the incessant fog, which comes in from the Atlantic in the mornings, is the reason that the Namib has such prolific flora and fauna, providing just enough moisture for life to carry on. Both plants and animals have adapted to utilising the small amount of moisture that is available., 176727=As of May 2014, there is a new East African Tourist Visa available – this is a common visa that covers Kenya, Uganda and Rwanda. It is available on arrival at Jomo Kenyatta International airport in Nairobi, or any major land border into Kenya (e.g. from Tanzania or Ethiopia). At the time of writing (2015), the cost of this visa is USD100 for all nationalities. This is recommended if you are doing our ‘gorilla loop’ through Uganda and Rwanda.}",
    "lastModified": "Fri, 31 Jul 2015 21:28:00 GMT",
    "textBeforeTable": "+27 21 424-6169 Cape Town Gardens 8001 73 Kloof Street Once in Cape Town (was Saasveld Lodge) Hotel for the night: Saasveld Lodge You can arrive at any time on day one, as there are no activities planned until the important welcome meeting tonight at 6pm. Your leader will leave a note at reception telling you where this important meeting will take place. Please ask a member of reception for this information. After the group meeting there is the option of joining the group for dinner.  We stay in a hotel situated in Cape Town's popular, lively and vibrant Kloof Street with a large variety of restaurants, coffee shops, cafe's and bars all within walking distance. Border Information: If joining in Cape Town, enter Cape Town at airport. ( Thu 31 Jan ) Day 1: Cape Town ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2013-01-31 00:00:00.000000 [timezone_type] => 3 [timezone] => UTC ) ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2013-01-31 00:00:00.000000 [timezone_type] => 3 [timezone] => UTC ) ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2013-01-31 00:00:00.000000 [timezone_type] => 3 [timezone] => UTC )",
    "textAfterTable": "Tour of Cape Town Townships and the District Six Museum ZAR 395 About Cape Town: With its stunning coastline, dominating mountain and modern cityscape, Cape Town is one of Africa's most appealing cities. With vineyards on its doorstep, adventure activities around every other corner and plenty of restaurants and cafes to while away the time, this is a fantastic holiday destination in it's own right. Whether you're finishing or joining a Dragoman trip here, Cape Town is a very easy city to spend some extra time in. Cape Town and the Western Cape in general has a very cosmpolitan feel thanks to it's cultural diversity, vibrancy and creativity. The city is also lucky enough to benefit from great weather, with warm languid summers and mild winters - making it a great destination all year round. Home to 6 internationally recognised Blue Flag beaches, it's a great place to kick back and relax, or if you'd rather get active, hop inside the revolving cable car and set off on one of hundreds of hiking trails that criss cross Table Mountain to it's summit, stopping off to admire the views of Camps Bay down below. If you've got any energy left you can even strap on a harness and abseil all the way down. Other attractions in the city include the Kirstenbosch National Botanical Gardens, Robben Island and the Cape Point Nature Reserve.  ZenDate Object ( [tz:protected] => DateTimeZone Object",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}