{
    "relation": [
        [
            "Type",
            "Fall Turkey Permit",
            "Spring Turkey Permit"
        ],
        [
            "$",
            "2.75",
            "2.75"
        ],
        [
            "DNR",
            "",
            ""
        ],
        [
            "Agents & Phone",
            "Agent",
            "Agent"
        ],
        [
            "Buy Online",
            "",
            ""
        ],
        [
            "Delivery Method",
            "",
            ""
        ]
    ],
    "pageTitle": "Nonresident hunting, fishing and other recreational licenses - Wisconsin DNR",
    "title": "Nonresident Duplicates - Turkey",
    "url": "http://dnr.wi.gov/Permits/Nonresidentlicense.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00109-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74872983,
    "recordOffset": 74853280,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2996=Licenses are valid from April 1st through March 31st of the following year. 2015 licenses go on sale March 4th.}",
    "textBeforeTable": "To purchase a license online, use the (cart icon) in the \"Buy Online\" column to go to our Wisconsin Licensing Services Center, for hunting and fishing sales. For online purchases, the \"Delivery Method\" column indicates how you receive your license: by printing your license using your home computer or receiving the license via mail . Select a license and click Go! Nonresident Conservation Patron or Sports Nonresident Fishing Nonresident Harvesting Nonresident Hunting Nonresident Park & Trail Nonresident Duplicates Nonresident Collector Stamps & Contributions To view the list of nonresident license information, scroll down the browser window or select a license type from the drop down menu and click go. Nonresident License Types ATF [exit DNR], or by calling 1-800-800-3855 [this number is for ATF only]. Important: New Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) regulations regarding nonimmigrant visitors bringing firearms or ammunition into the United States, requires the completion of ATF Form 6 NIA(5330.3D) (Import Application). Once approved, Form 6 NIA(5330.3D) becomes the actual permit. The visiting nonimmigrant must also posses a valid hunting license issued by one of the 50 states, or an",
    "textAfterTable": "Small Game First-time buyer 42.75 Annual Fishing First-time buyer 25.75 Trapping First-time buyer 75.75 Furbearer First-time buyer 79.75 Spring Turkey First-time buyer 29.75",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}