{
    "relation": [
        [
            "Patent application number",
            "20090148530",
            "20100021554",
            "20140220149"
        ],
        [
            "Description",
            "METHOD FOR PREVENTION AND TREATMENT OF REFLUX INJURY IN THE AERODIGESTIVE TRACT AND LARYNGOPHARYNX CAUSED BY PEPSIN - A method for treating or preventing disorders, diseases, and symptom of reflux, that is laryngopharyngeal reflux (LPR), in the laryngopharynx caused by pepsin comprises orally administering to the laryngopharynx of a patient an effective amount of cellulose powder. A method for treating or preventing damage to the lining membranes of at least some of the aerodigestive tract, the damage caused by pepsin, comprises coating at least some of the lining membranes with an effective amount of a cellulose powder. Upon inhalation of the powder, the powder coats the lining membranes. Upon coating the lining membranes, the powder becomes a gel. The gel prevents the pepsin from binding with the lining membranes, thereby preventing damage caused by pepsin in laryngopharyngeal reflux or in extra-esophageal reflux.",
            "METHOD FOR PREVENTION AND TREATMENT OF REFLUX INJURY IN THE AERODIGESTIVE TRACT AND LARYNGOPHARYNX CAUSED BY PEPSIN - A method for treating or preventing disorders, diseases, and symptom of reflux, that is laryngopharyngeal reflux (LPR), in the laryngopharynx caused by pepsin comprises orally administering to the laryngopharynx of a patient an effective amount of cellulose powder. A method for treating or preventing damage to the lining membranes of at least some of the aerodigestive tract, the damage caused by pepsin, comprises coating at least some of the lining membranes with an effective amount of a cellulose powder. Upon inhalation of the powder, the powder coats the lining membranes. Upon coating the lining membranes, the powder becomes a gel. The gel prevents the pepsin from binding with the lining membranes, thereby preventing damage caused by pepsin in laryngopharyngeal reflux or in extra-esophageal reflux.",
            "METHOD FOR PREVENTION AND TREATMENT OF REFLUX INJURY IN THE AERODIGESTIVE TRACT AND LARYNGOPHARYNX CAUSED BY PEPSIN - A method for treating or preventing disorders, diseases, and symptom of reflux, that is laryngopharyngeal reflux (LPR), in the laryngopharynx caused by pepsin comprises orally administering to the laryngopharynx of a patient an effective amount of cellulose powder. A method for treating or preventing damage to the lining membranes of at least some of the aerodigestive tract, the damage caused by pepsin, comprises coating at least some of the lining membranes with an effective amount of a cellulose powder. Upon inhalation of the powder, the powder coats the lining membranes. Upon coating the lining membranes, the powder becomes a gel. The gel prevents the pepsin from binding with the lining membranes, thereby preventing damage caused by pepsin in laryngopharyngeal reflux or in extra-esophageal reflux."
        ],
        [
            "Published",
            "06-11-2009",
            "01-28-2010",
            "08-07-2014"
        ]
    ],
    "pageTitle": "Jamie - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/jamie-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00172-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438745991,
    "recordOffset": 438711974,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jamie Koufman, New York, NY US 10-09-2008 FLIP-DOWN FOOTREST FOR AN ALL-TERRAIN VEHICLE - A two-seater all-terrain vehicle (ATV) has straddle-type driver and rear passenger seats, and a pair of movable rear footrests to support the feet of a rear passenger. The rear footrests pivot from a stowed non-supporting position to a supporting position. When folded into the non-supporting position, the rear footrests become substantially flush with side paneling of the vehicle. The all-terrain vehicle may further include a pair of vertical and horizontal adjustment mechanisms for independently vertically adjusting each of the rear passenger footrests so that passengers of varying height can be comfortably accommodated on the rear seat. A cargo space is provided under the passenger's footrest, the cargo space being enlarged when the passenger's footrests are in the stowed position. Restraints and other holding mechanisms are also provided. The flip-down adjustable rear footrests may be used on other types of straddle-type recreational vehicles. 20080246300 Published Description Patent application number Jamie Ibbett, Montreal CA 02-27-2014 CONTACT MANAGEMENT - Contact management using a callsheet record, including: enabling a user to make entries and selections to the callsheet record, wherein the entries and selections to the callsheet record creates call scripts and tracks results and status of calls made by the user; and storing the entries and selections made to the callsheet record for future reference and modification. 20140057672 12-02-2010 CONTACT MANAGEMENT",
    "textAfterTable": "Patent applications by Jamie Koufman, New York, NY US Jamie Kovalaske, Charlotte, NC US Patent application number Description Published 20100263958 Power Unit and Vehicle Equipped With It - A power unit includes an engine, a belt transmission driven by the engine, and a second transmission driven by the belt transmission. The engine includes an engine output shaft having an end portion projecting outward from the engine. The second transmission includes a transmission input shaft and a transmission output shaft having respective end portions projecting outward from the second transmission. The belt transmission includes a drive pulley provided on the end portion of the engine output shaft, a driven pulley provided on the end portion of the transmission input shaft, and a belt looped over the drive and driven pulleys. The belt has first and second portions between the drive and driven pulleys. The first portion runs from the drive pulley to the driven pulley. The second portion runs from the driven pulley to the drive pulley. The end portion of the transmission output shaft is extended through a portion of the belt transmission between the drive and driven pulleys and between the first and second portions of the belt",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}