{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "rage",
            "Portuguese News",
            "Beyond Tomorrow",
            "Wesley Impact",
            "Hour of Power"
        ],
        [
            "Time",
            "5 am - 6 am",
            "5:30 am - 6 am",
            "5 am - 6 am",
            "5:30 am - 6 am",
            "5 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2012/12/02/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00273-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 710169291,
    "recordOffset": 710096476,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{17323=Did the ancient Mayans know something we don't about December 21?, 20285=Police seize over 1400 firearms (04:13), 94892=Will the world end on December 21 this year?}",
    "TableContextTimeStampAfterTable": "{253849=Rylo, Dec 2, 2012, 5:50AM, 80840=International Day of a People with a Disability 2012., 245009=Total votes: 1434., 127616=February 8 - March 7: PIAF program for 2013 is full of WA spirit., 124501=December 6 Magicians and hawkers will take over Rokeby Road at the Subi Street Festival., 266893=December 01 2012, 123513=November 29: The annual Ad School Awards at the Vic Hotel, Subiaco., 244043=Total votes: 1978., 194805=Revamped music quiz show, Chris Lilley comedy set for 2013., 254806=stojo01, Dec 2, 2012, 12:48AM, 102722=Start your training for Run Melbourne 2013, to be held on Sunday, July 21., 126568=December 15 CBD to come alive with 30 floats and 2,000 performers.}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: The confusing narrative and overt obfuscation continue in the second episode of this spy thriller. Hunted What's on TV Tonight Heading to Brisbane Powerhouse? It could be your ticket to Paris! Win an art adventure in Paris Competition Get in early for Brisbane City2South race entry discount. On your marks Fun run Top performers descending on Brisbane for comedy event. Millican leads stellar line-up Comedy festival We reveal who is most likely to",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD rage 5 am - 6 am SBS ONE Queensland WeatherWatch & Music 5 am - 5:30 am Channel Seven Brisbane Beyond Tomorrow 5 am - 6 am Channel Nine Brisbane Life Today with James Robison 5 am - 5:30 am Network TEN Brisbane Hour of Power 5 am - 6 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD rage 5 am - 6 am SBS ONE Queensland Portuguese News 5:30 am - 6 am Channel Seven Brisbane Beyond Tomorrow 5 am - 6 am Channel Nine Brisbane Wesley Impact 5:30",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}