{
    "relation": [
        [
            "Date:",
            "2002",
            "Runtime:",
            "114 Minutes",
            "Genre:",
            "Thriller / Dance"
        ],
        [
            "Studio:",
            "MG.M. (Am. Zoetrope)",
            "Country Made:",
            "Argentina",
            "Featured Dancer:",
            "Robert Duvall"
        ],
        [
            "Director:",
            "Robert Duvall (also Writer)",
            "Language:",
            "English / Spanish",
            "Featured Dance:",
            "Argentine Tango"
        ],
        [
            "Availability: YES!",
            "DVD | VHS | Download",
            "Color:",
            "Color",
            "Dance Rating:",
            "Very, Very Good"
        ]
    ],
    "pageTitle": "Assassination Tango |Argentine Tango|Duvall|DVD|Clip",
    "title": "",
    "url": "http://www.streetswing.com/films/video/f0_assassination_tango.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00004-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 730966147,
    "recordOffset": 730956218,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Synopsis: John J. (Duvall) plays an aging hit man sent to Argentina to kill General Rojas (Nessier). While delayed, John meets an Argentinean girl named Manuela (Pedraza), who helps him to learn authentic style Tango. * Features: Robert Duvall's real life fascination with tango finds its expression in this labor of love, a film he wrote, directed, and stars in. Not many people know that Robert Duvall is an avid dancer and hobbyist. West Coast Swing and especially the dance he loves the most 'Argentine Tango' are his favorite dances long before this film was made. \"No one is more dangerous than the man who lives two lives\" Assassination Tango",
    "textAfterTable": "Known Dancers: Choreographers / Directors: Actors / Actresses: Alicia Beatriz Sampayo (Bllrm Dancer) n/a Delfina (Manuelita) Armando Orzuza (Manuela's Partner)   Elvio Nessier (General Humberto Rojas) Dario Dorzi (Ballroom Dancer)   Frank Cassavetes (Jo Jo) Estela Arcos (Ballroom Teacher)   Frank Gio (Frankie) Géraldine Rojas (Pirucha)   Géraldine Rojas (Pirucha) Javier Rodriguez (Pirucha 1 Partner) Video Clip / Trailer James Keane (Whitey) Jorge Dispari (Tango Instructor) Julio Oscar Mechoso (Orlando) Luciana Pedrazza (Manuela) Katherine Micheaux Miller (Jenny) Orlando Paiva (Paiva) Kathy Baker (Maggie) Pablo Verón (Pirucha final partner) Luciana Pedrazza (Manuela) Renee Victor (Stella) María del Carmen Romero (La Turca) Robert Duvall (John J) María Nieves (Tia Maria)   Michael Corrente (Cop)   Natalia Lobo (Prostitute)     Raúl Outeda (Tony Manas)     Renee Victor (Stella)",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}