{
    "relation": [
        [
            "Transit Noise and Vibration Impacts",
            "Number times offered",
            "Total participants"
        ],
        [
            "2004",
            "0",
            "0"
        ],
        [
            "2005",
            "0",
            "0"
        ],
        [
            "2006",
            "0",
            "0"
        ],
        [
            "2007",
            "1",
            "22"
        ],
        [
            "2008",
            "2",
            "52"
        ]
    ],
    "pageTitle": "The Transportation Planning Capacity Building Program | About TPCB",
    "title": "",
    "url": "https://www.planning.dot.gov/documents/annualreport/annualreport_04-08.asp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00181-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 938194895,
    "recordOffset": 938149518,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{109841=FTA/AMPO Innovation in Safety & Security Incentive Grant Program FTA established the Innovation in Safety & Security Incentive Grant Program in coordination with AMPO in June 2005. The grant program was developed to fund innovative planning work that addresses safety and security considerations in the metropolitan transportation planning process., 95892=Several programs exist to fund transportation research activities on issues impacting regional, state, local, and tribal planning agencies. Included among those during the period of FYs 2004–2008 are the FHWA Surface Transportation Environment and Planning (STEP) Cooperative Research Program, and the FTA Section 5314 — Research and FTA Section 5327 - Oversight programs, all of which support the TPCB Program. These programs, in concert with several other grant and research programs such as the Public Transportation Participation Pilot Program (PTP), represent over 200 separately funded research initiatives that support capacity building efforts across a wide range of transportation planning areas. The activities of these research programs are detailed below to provide an overview of past efforts to improve the state-of-the-practice of transportation planning., 43646=Fargo, North Dakota — March 4, 2007 Long-term transportation processes and changing economic situations, 97450=During the 3-year period of FYs 2006–2008, STEP sponsored a total of 186 initiatives, an average of 62 per year. STEP serves a number of stakeholders who are interested in environment and planning research and broadly includes Federal agencies; tribes, state, and local governments; MPOs; and non-governmental transportation and environmental stakeholders., 123347=The TPCB Program website has become more central to the information dissemination core area over the 5 years covered by this report. As print documents become more expensive to produce, and as use of the Internet for information-gathering grows more common, the program has been transitioning away from paper documents. Major publications are available in print; however, web statistics show that it is accessed online over 1,000 times per month (more times in 1 year than its total printing of 10,000 copies). The TPCB Program website is a one-stop clearinghouse for state-of-the-practice transportation planning information and resources, averaging over 600 visits per day in FY 2008., 102716=The PTP Program funded 23 projects between FYs 2006–2008, which are organized below by fiscal year, grantee, project title, and purpose., 49551=In FY 2004, there were over 220 award nominations submitted in 10 categories. The categories for submission were:, 138716=The TPCB Program supported, or was represented at, more than 60 conferences on topics from travel demand forecasting to TOD and the planning needs of small- and medium-sized communities in over 20 states around the nation between FYs 2004–2008. The table below provides details on where and for which event the TPCB Program was represented, conducted outreach, or provided conference support:, 53537=The award winners represented five state DOTs, as well as several MPOs and COGs from across the country. Honorable mention winners represented a tribal government, three state DOTs, and three MPOs. Award and honorable mention winners were recognized in July 2006 at the 2006 TRB Joint Summer Meeting of the Planning, Economics, Environment, Finance, Freight, and Management Committees in La Jolla, California. An FY 2006 Awards Program was developed and provided to attendees of the awards ceremony at the TRB Joint Summer Meeting. The two-page program provided a brief overview of the TPEA Program, the award selection process, a list of award categories, judges' panel members, and award and honorable mention winners and presented the agenda for award presentations., 43480=Frankfort, Kentucky — March 6, 2007 Statewide transportation planning processes, land use, and funding issues impacting growth, 43374=Chico, California — August 9, 2006 Critical regional growth issues, 42502=Orlando, Florida — December 9, 2004 Demographic, environmental, and transportation safety challenges, 31725=The TPCB Peer Program sponsored a total of 39 events during the 5-year period of FYs 2004-2008, an average of eight peer events annually. There are a total of 17 focus areas for peer events, though FHWA and FTA identify new focus areas as the challenges facing the transportation planning community change. Reports on the Peer Program events are available on the TPCB website located at: www.planning.dot.gov/peer.asp., 43131=Monterey, California — June 2, 2006 Addressing growth and housing issues, 48527=FHWA and FTA created the TPEA Program and announced the first round of awardees in 2004. Subsequent award ceremonies were held 2006 and 2008. The TPEA awards are co-sponsored by the American Planning Association (APA)., 14665=The reach of the TPCB Program is broad, with participation by professionals in all corners of the U.S., from rural and tribal areas to the nation's largest metropolitan corridors. From FYs 2004 to 2008, the TPCB Program has sponsored peer exchanges and scenario planning workshops in 32 states and the District of Columbia. The map below features the host cities for peer exchanges and scenario planning workshops during the 5-year period., 21710=In concert with maintaining its website, the program has published many popular guidebooks, brochures, and reports for experts, new planning staff, and transportation planning stakeholders. The 2007 update to the 2004 Briefing Book on Key Issues in Statewide and Metropolitan Transportation Planning serves as an invaluable guide to board members and planning staff around the country. In addition to printing more than 10,000 copies of the book, its online version was accessed more than 12,000 times in FY 2008., 96875=SAFETEA-LU established the STEP Cooperative Research Program in FY 2006. The objective of STEP is to improve the understanding of the complex relationship between surface transportation, planning, and the environment. STEP is the sole source of SAFETEA-LU funds available to conduct all FHWA research on planning and environmental issues. In addition, Congress mandated several special studies, including the Report on Non-Motorized Transportation Pilot Program and the Annual Report for the Surface Transportation Project Delivery Pilot Program, also funded by STEP., 54902=There were just over 70 nominations for the FY 2008 TPEA Program. Nominations were submitted in the following 11 categories:, 51247=The award winners represented several MPOs and Council of Governments (COG), a state DOT, a city government, and transit agencies from across the country. Honorable mention winners represented two state DOTs, a city government, and a tribal transit agency. Award and honorable mention winners were recognized at the 2004 TRB Joint Summer Meeting of the Planning, Economic, Environmental, Finance, Freight, and Management Committees in Park City, Utah. An FY 2004 Awards Program was developed and provided to attendees of the awards ceremony at the TRB Joint Summer Meeting. The two-page program provided a brief overview of the TPEA Program, the award selection process, a list of award categories, judges' panel members, and award and honorable mention winners and presented the agenda for award presentations. A 2004 TPEA booklet was developed to commemorate the award and honorable mention winners and publicize the 2006 TPEA Program., 63026=The 2008 FHWA/FTA Planners' Seminar involved attendees from various headquarter and regional offices within FHWA and FTA, as well as the Office of Federal Lands Highway. Attendees were given a detailed overview of reauthorization issues and highlighted issues, including proposed solutions to the Highway Trust Fund shortfall and a discussion on the challenges facing FHWA and FTA relating to reauthorization and revenue constraints., 56242=Award winners included three joint submissions from an MPO and two state DOTs; from town and county governments as well as a state DOT; an FHWA State Division Office, a state DOT, and a tribal government. Other award winners represented four state DOTs, a tribal transportation agency, a national transportation association, three MPOs, and a city government. Honorable mention winners included a joint submission from a state DOT, an FHWA State Division Office, and a Federal agency. Other honorable mention winners represented four state DOTs and four MPOs. Award and honorable mention winners were recognized in June 2008 at the 2008 TRB Joint Summer Meeting of the Planning, Data, Finance, Administration, Freight, and Management Committees in Baltimore, Maryland. An FY 2008 Awards Program was developed and provided to attendees of the awards ceremony at the TRB Joint Summer Meeting. The two-page program provided a brief overview of the TPEA Program, the award selection process, a list of award categories, judges' panel members, and award and honorable mention winners and presented the agenda for award presentations., 113680=Printed documents are a primary outreach tool and are distributed through FHWA Division Offices and FTA Regional offices, and as handouts at national transportation conferences attended by TPCB target audiences. The TPCB website (http://www.planning.dot.gov) provides both online HTML versions as well as downloadable copies of TPCB documents. The website also provides links to over 150 resources on FHWA, FTA, and non-U.S. DOT websites. The TPCB Peer Program generated about 34 informational books, pamphlets, conference displays, and video products in FYs 2004-2008, as well as an additional 39 reports on the discussions and conclusions of peer exchange events., 153907=A variety of additional venues serve to fund important transportation research and projects. These activities include, for example, the production of best practices manuals and industry reports that provide review, analysis, and evaluation of existing issues and innovative approaches relevant to the field. During the 5-year period of FYs 2004–2008, approximately 21 such activities were sponsored by the program with an average of about five activities per year. The areas studied cover a range of topics including, but not limited to, bicycle and pedestrian planning, climate change, freight, safety, land use planning, metropolitan, statewide, rural, and tribal planning, travel forecasting, congestion mitigation, fiscal constraint policy, and planning and visualization practices. The activities are organized below by fiscal year, partner agency, and topics area., 11297=Created in 2001 as the Metropolitan Capacity Building program with a focus on the MPO planning process, the expanded TPCB Program has achieved success in developing a high performing workforce, enabling professionals to make better transportation decisions, and facilitating the development of better transportation plans and projects., 124071=The MPO Database was developed in 2004 by the TPCB Program in an effort to provide transportation planning professionals with a resource for examining travel and transportation issues and needs in metropolitan areas. The database contains contact information for all MPOs in the United States. The database assists transportation professionals and others in finding and contacting peers in MPOs or in specific job positions while providing a snapshot summary of agency information, including an MPO's major region covered, area in square miles, population, primary contact (telephone and email), and designation year. MPOs can update the database online by selecting the \"New Info?\" icon in the MPO Summary Information view. The MPO database is located at: http://www.planning.dot.gov/overview.asp., 42642=Dubuque, Iowa — May 13, 2005 Planning processes and land use issues, 43243=Traverse City, Michigan — July 27, 2006 Comprehensive multimodal transportation plan update, 49344=The text below describes the TPEA Program process, judges' panel, and award winners and honorable mentions for each FY in which the TPEA occurred (2004, 2006, and 2008)., 55661=For the FY 2008 TPEA Program, a panel consisting of 11 judges selected 13 award winners and nine honorable mention winners from the nominations. The judges used several criteria to assess each nomination, including demonstrations of innovation, community and public involvement, partnerships and collaboration, multimodalism, equity, sustainability, results, replication, effectiveness, and transferability. The criterion of \"demonstrated results\" included two new areas-effectiveness and transferability-neither of which was included in the FY 2006 TPEA Program., 53167=For the FY 2006 TPEA Program, a panel comprised of eight judges selected 13 award winners and seven honorable mention winners. To assess the nominations, the judges' panel used criteria that included demonstrations of innovation, community and public involvement, partnerships and collaboration, multimodalism, equity, sustainability, results, and replicability., 42868=Mooresville, North Carolina — July 20, 2005 Critical growth issues and an update to land use and transportation plans, 43025=Kansas City, Missouri — April 5, 2006 Ensuring quality development, 54314=An FY 2006 TPEA booklet was developed to commemorate the award and honorable mention winners and publicize the FY 2006 TPEA Program. Approximately 1,000 copies of this 24-page booklet were produced and distributed to multiple stakeholders, including FHWA Division Offices and Regions, FTA Office of Planning and Environment, the award and honorable mention winners, the Association of Metropolitan Planning Organizations (AMPO), the American Association of State Highway and Transportation Officials (AASHTO), and others at the conference of the APA., 101391=The Public Transportation Participation Pilot Program (PTP) The PTP Program was authorized and funded under SAFETEA-LU to support the development of innovative public participation tools, techniques, and strategies in public transportation planning. In 2006, the PTP Program began to sponsor small, short-term, applied research that resulted in innovative products (e.g., tools, methodologies, and evaluation results). The products are implemented by agencies around the country to advance the state-of-public-participation practice. Projects are focused on one or more of the following themes:, 164085=HIS/EM PCB was initially established as an FHWA Security PCB Program. Its original objective was to enhance the knowledge and understanding of security among the nation's highway workforce. In 2007, the objective was expanded to also include the need for providing knowledge and understanding about emergency management to the highway workforce. (http://www.fhwa.dot.gov/security/emergencymgmt/profcapacitybldg/), 136578=The Key Issues: Briefing Book and the joint FTA-National Historic Trust document, The Returning City are both popular destinations and common entry pages, indicating that they have been bookmarked by users or that users search for them (using Google or Yahoo) and enter the TPCB website via these two documents. In FYs 2004 and 2005, these two documents combined accounted for nearly three-fourths as many site entries as the homepage. Interest in the Briefing Book more than doubled in FY 2008 when the FY 2004 version was freshly updated., 126956=The graph below shows that daily website visitors have risen steadily over the last 5 years from an average of 151 per day in FY 2004 to an average of 642 per day in FY 2008. About 30 to 40 percent of all visitors are \"repeat\" users, defined as those who have visited the site at least once in the previous month., 171695=The following table displays the full list of documents produced under the auspices of TPCB in the 5-year period between FYs 2004–2008, including the documents described above:, 42749=Champaign, Illinois — June 15, 2005 Regional growth trends and corridor studies, 21074=The TPCB website (www.Planning.dot.gov) acts as a source of information and provides resources about planning news, guidance, policies, and practices. Its calendar of events keeps planners and transportation stakeholders abreast of training sessions, peer exchanges, and other upcoming activities. The website archives all major TPCB Program publications and makes them available for download and printing at any time. The website is a one-stop clearinghouse for state-of-the-practice transportation planning information and resources, averaging more than 600 visits per day in FY 2008., 29569=In the 5 years between FYs 2004-2008, the TPCB Program supported 39 Peer Program Events, 15 Scenario Planning Workshops, and 28 additional transportation planning workshops. The TPEA Program named 37 awardees and 21 honorable mentions over three award cycles (FYs 2004, 2006, and 2008)., 52222=There were over 100 award nominations submitted in 12 categories for the FY 2006 TPEA Program. Several new categories were introduced for the FY 2006 TPEA Program while other categories remained the same as in FY 2004. The complete list of categories for the FY 2006 TPEA Program included:, 50320=A major focus of the FY 2004 TPEA Program was promoting the integration of safety and transportation planning. The category of \"Playing it Safe\" Safety Conscious Planning was developed to highlight those nominations that prioritized safety in the planning process. For this special category, a select panel of judges evaluated nominees according to criteria that included innovativeness, effectiveness, replication, partnerships and collaboration, demonstrations of evaluation, and leveraging of resources and funding., 105044=FY 2007 Projects:, 112204=The TPCB Program includes many outreach activities to share information on the complexities of transportation planning. Information dissemination occurs via print and online media. The TPCB Program supported the development of 34 printed and online documents from FYs 2004–2008. These documents provide key information and resources to agency board members, staff, and local officials. The TPCB website also serves as a centralized clearinghouse for information and contacts within the transportation planning community and includes tools such as the MPO Database., 43789=Burlington, Vermont — November 9, 2007 Completed the metropolitan transportation plan update, 59574=TPCB Training activities taking place between FYs 2004–2008 included three sessions of the biennial Planners' Seminar in Washington, D.C., which was attended by more than 300 Federal staff. Also during this period, the National Highway Institute (NHI) and National Transit Institute (NTI) offered 23 in-class training courses a total of 514 times with the participation of 13,969 attendees from across the country; an average of 27 attendees per class., 42223=Newport, Rhode Island — June 7, 2004 Land use growth challenges and updates to land use plans, 42356=Honolulu, Hawaii — June 24, 2004 Maximization of transportation investments and assessing growth scenarios, 41753=A total of 15 Scenario Planning Workshops were held across 14 states from FYs 2004–2008. The map on the next page identifies the locations (marked by a circle) where workshops were held., 107166=FY 2008 Projects:, 102861=FY 2006 Projects:, 60896=The 2004 FHWA/FTA Planners' Seminar was attended by approximately 100 staff from FHWA and FTA headquarters and regional offices, as well as staff from the Columbia Pike Revitalization Organization, a nonprofit agency focused on the planning and revitalization of a central transportation corridor in Arlington, Virginia. Also participating were staff from the Anacostia Waterfront Initiative, an effort coordinated by the District of Columbia Office of Planning to revitalize the shores of the Anacostia River and surrounding communities., 112776=The TPCB Program also conducts outreach by supporting and attending conferences where transportation professionals working across multiple scales and modes come to network and share tools and information. Outreach efforts seek to build awareness of the TPCB Program and identify new activities and program areas that respond to the needs of practitioners in the field. Conference support efforts include organizing/moderating panels and giving presentations, distributing TPCB Program materials (e.g., the Transportation Planning Briefing Book, Peer Program pamphlets and sample final reports, and Transit at the Table), and conducting direct outreach with conference attendees through a fully-staffed TPCB Program exhibit booth. From FYs 2004–2008, the TPCB Program supported or conducted outreach at more than 60 conferences; an average of 12 per year., 57378=An FY 2008 TPEA booklet was developed to commemorate the award and honorable mention winners and publicize the FY 2008 TPEA Program. Approximately 1,300 copies of the 28-page TPEA booklet were produced and distributed to multiple stakeholders, including FHWA Division Offices and Regions, FTA Office of Planning and Environment, the award and honorable mention winners, AMPO, AASHTO, TRB, APTA, and to others at the conferences of APA and the Community Transportation Association of America (CTAA)., 32209=Listed below are the topics and host locations of the 39 peer events that occurred during FYs 2004-2008., 62249=The 2006 FHWA/FTA Planners' Seminar had more than 180 attendees representing FHWA and FTA field and headquarters staff, including the Office of Federal Lands Highway. While the seminar focused on implementation of SAFETEA-LU, it also included sessions on other topics of diverse interest to planners in both agencies., 129952=The entry page shows how users access the website. An entry page other than the home page can indicate either that the user has a particular page bookmarked or that the page was reached by a link from a related website or from a search engine. The most requested pages may be entry pages or may be reached after visiting another site page. As such, the list of most requested pages is expected to include the pages most used as entries. The data, as displayed in Table 1-2 below, show that the home page was the page most frequently used to enter the TPCB website. Since the data in Table 1-3 show that the most frequently requested page across FYs 2004–2008 was the home page, it appears that most site visitors were using the home page to access the website. Indeed, the home page was used as an entry page 84 percent of the time that it was visited., 44403=The TPCB Program provided funding for a variety of additional workshops and webinars that help to inform the broader transportation planning community about emerging issues and noteworthy trends in the field. During the 5-year period of FYs 2004–2008, the TPCB Program sponsored approximately 16 workshops with key industry partners across a range of transportation planning topic areas. Following is a list of workshop partners and topics., 43921=El Paso, Texas — June 4, 2008 Development of a Bus Rapid Transit (BRT) system and land use change projections, 42110=Binghamton, New York — June 2, 2004 Long-range transportation plan update, 12319=This executive summary provides an overview of TPCB accomplishments during FYs 2004-2008, and the program's future., 94766=In addition to the NTI and NHI training deliveries, FHWA worked with the Center for Transportation and the Environment, a University Transportation Center (UTC) at North Carolina State University within the Institute for Transportation Research and Education, to deliver a national course on Community Impact Assessment (CIA). The course focuses on seven key issue areas, including mobility/accessibility, economic sociocultural, sensory/aesthetic, land use, displacement, and safety/health. Among several objectives, the course identifies how to identify the key steps in the CIA process, how to engage in community outreach and participation strategies, and how to maintain accurate and thorough project diaries. Two CIA Pilot Courses were held in Harrisburg, PA (March 22-24, 2005), and Lacey, WA (September 20–22, 2005). There were also two CIA Regional Workshops held in Scottsdale, AZ (June 5–9, 2005), and Trenton, NJ (September 11–14, 2005).}",
    "textBeforeTable": "Section II: Training in Transportation Planning Training is a key aspect of the TPCB Program that includes events to educate transportation professionals from the public, private, and academic sectors on current issues in the state-of-the-practice issues, as well as future challenges that planners may face. Training formats vary depending on subject matter and audience needs and include formal classroom trainings, webinars, seminars, etc. TPCB Training activities taking place between FYs 2004–2008 included three sessions of the biennial Planners' Seminar in Washington, D.C., which was attended by more than 300 Federal staff. Also during this period, the National Highway Institute (NHI) and National Transit Institute (NTI) offered 23 in-class training courses a total of 514 times with the participation of 13,969 attendees from across the country; an average of 27 attendees per class. FHWA/FTA Planners' Seminar The FHWA/FTA Planners' Seminar provides a forum for Federal headquarters and field staff to exchange information and perspectives regarding current transportation planning policies, useful procedures, and opportunities for improvement. The 3-day event highlights methods to enhance service delivery from central offices to the field and from the field offices to state and local customers. FHWA/FTA Planners' Seminars are held every other year and serve to explore a variety of topics relevant to the evolving professional needs of FHWA and FTA planning staff. The following text provides information on FHWA/FTA Planners' Seminars over the past 5 years, including event dates and locations; topic areas highlighted, and selected speaker information. Alexandria, Virginia —",
    "textAfterTable": "Advanced Seminar on Managing the Environmental Review Process: Efficient and effective management of environmental processes in the development and construction of transit and multimodal transportation projects by providing current information on Federal requirements, identifying best practices, and facilitating the sharing of information and insight among advanced practitioners. Managing Environmental Review Process 2004 2005 2006 2007 2008 Number times offered 0 0 0 2 2 Total participants 0 0 0 198 102 Application of the FHWA Traffic Monitoring Guide: Application of procedures published in FHWA \"Traffic Monitoring Guide\" (TMG) and other recent developments in traffic monitoring. FHWA Traffic Monitoring Guide 2004 2005 2006 2007 2008 Number times offered 3 5 0 3 3 Total participants 91 129 0 84 51 Applying Geographic Information Systems (GIS) and Spatial Data Technologies to Transportation (NHI): How to implement transportation planning applications that rely on spatial data technologies. This course describes example applications and discusses topics, including the level of effort for development, technological challenges, training needs, and evaluation measures. GIS and Spatial Data 2004 2005 2006 2007 2008 Number times offered 1 4 2",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}