{
    "relation": [
        [
            "Patent application number",
            "20090038917",
            "20090114507"
        ],
        [
            "Description",
            "Transport system including vertical rollers - A transport system for conveying articles along conveyance paths including straight, curvilinear, horizontal, inclined and declined conveyance sections. The articles are conveyed between a pair of vertical belts while being supported by protrusions extending from the vertical belts. The vertical belts are guided using a multiplicity of vertical rollers that are configurable into straight, curvilinear and dynamically changing conveyance sections. Multiple conveyance sections can be joined end to end to transport articles over complex paths and over long distances. The articles conveyed may include semiconductor wafers.",
            "Integrated overhead transport system with stationary drive - A transport system is provided to move an article from a conveyance section to a location. The conveyance section transports the article using a pair of transport belts. A lift lowers the article downward between the pair of transport belts. A hoist translates the article beneath the conveyance section to the location while supporting the article from above. The article may include a FOUP, semiconductor wafer, substrate for the manufacture of display devices or photovoltaics. The hoist may comprise a carriage and a gripper configured to grasp and vertically move the article while suspended beneath the carriage."
        ],
        [
            "Published",
            "02-12-2009",
            "05-07-2009"
        ]
    ],
    "pageTitle": "Parikh, CA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/parikh-ca-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00182-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 436597727,
    "recordOffset": 436556876,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Mihir Parikh, Los Altos Hills, CA US 06-04-2015 METHOD AND SYSTEM FOR RECEIVER CONFIGURATION BASED ON A PRIORI KNOWLEDGE OF NOISE - A signal receiver may be configured to determine when signal generation adjustments directed to particular components of signals received by the signal receiver, cause performance changes relating to effects of the signal generation adjustments on other components of the received signals. Operations of the signal receiver may then be controlled based on the performance changes, to mitigate at least some of the effects on the one or more other components of the signals. The performance changes may comprise amplitude glitches, phase glitches, and/or bit or packet errors. The signal generation adjustments may comprise channel-to-frequency re-assignment. Controlling operations of the signal receiver may comprise adjusting such parameters as amplification gain and/or tracking loop bandwidth, and/or determining whether (or not) to ignore bit/packet errors. 20150156558 12-12-2013 METHOD AND SYSTEM FOR RECEIVER CONFIGURATION BASED ON A PRIORI KNOWLEDGE OF NOISE - A signal receiver may be configured to determine when signal generation changes affecting signals being received by the signal receiver may cause performance related changes; and to modify its (the signal receiver) configuration to handle the performance related changes. In this regard, the modifying of configuration may comprise determining characteristics of performance related changes, and controlling operations of the signal receiver based on the determined characteristics of the performance related changes. The performance related changes may comprise amplitude glitches, phase glitches, and/or bit",
    "textAfterTable": "Patent applications by Mihir Parikh, Los Altos Hills, CA US Neha J. Parikh, Los Angeles, CA US Patent application number Description Published 20100268301 IMAGE PROCESSING ALGORITHM FOR CUEING SALIENT REGIONS - A method for cueing salient regions of an image in an image processing device is provided and includes the steps of extracting three information streams from the image. A set of Gaussian pyramids are formed from the three information streams by performing eight levels of decimation by a factor two. A set of feature maps are formed from a portion of the set of Gaussian pyramids. The set of feature maps are resized and summed to form a set of conspicuity maps. The set of conspicuity maps are normalized, weighted and summed to form the saliency map. 10-21-2010 Neha J. Parikh, West Hills, CA US Patent application number Description Published 20140066884 SENSOR MODEL SUPERVISOR FOR A CLOSED-LOOP INSULIN INFUSION SYSTEM - An electronic device includes a processor architecture and a memory element that stores instructions that, when executed by the processor architecture, perform a method of controlling an insulin infusion device for a user. The method",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}