{
    "relation": [
        [
            "Pseudo classes",
            "disabled",
            "vertical"
        ],
        [
            "Description",
            "",
            ""
        ]
    ],
    "pageTitle": "Oracle ADF Faces - Selectors for Skinning ADF Faces Components",
    "title": "",
    "url": "http://jdevadf.oracle.com/adf-richclient-demo/docs/skin-selectors.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00186-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 128201623,
    "recordOffset": 128095242,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 20 Mar 2014 21:21:52 GMT",
    "textBeforeTable": "Color->Unclassified ColorColors that are not classified as either Anchor, Derivative, or Specialty colors. The core and accent color ramps are included in other components. Then to change the color scheme, you would change these core/accent color ramps and it will affect all the components it is including in. Color Global Selectors are selectors that affect more than one component. If the selector name ends in the :alias pseudo-class, then the selector is most likely included in other component-specific selectors. Defining properties for a selector that ends in :alias will most likely affect the skin for more than one component. For example, most, if not all of our components use the .AFDefaultFontFamily:alias definition to specify the font-family. If your skin overrides the .AFDefaultFontFamily:alias selector with a different font-family, that change will affect all the components that have included it in their selector definition. Global Selectors } background-color: red; { af|inputText::content /* Component-specific selector. */ } font-family: Tahoma, Verdana, Helvetica, sans-serif; .AFDefaultFontFamily:alias { /* Global selectors affect more than one component */ Examples of some ADF Faces Skin selectors:    This document lists the skin-selectors that can be used in an ADF Faces skin .css file to skin ADF Faces components. Overview   Renderer Selectors   Themes  Common Pseudo-classes  Message Selectors  Drag and Drop Pseudo-classes",
    "textAfterTable": "Only used by fusion skins. .AFDarkBackground:alias The dark background color in the core color ramp. Only used by fusion skins. .AFDarkForeground:alias The dark foreground color in the core color ramp. Only used by fusion skins. .AFMediumBackground:alias The medium background color in the core color ramp. Only used by fusion skins. .AFMediumForeground:alias The medium foreground color in the core color ramp. Only used by fusion skins. .AFLightBackground:alias The light background color in the core color ramp. Only used by fusion skins. .AFLightForeground:alias The light foreground color in the core color ramp. Only used by fusion skins. .AFVeryLightBackground:alias The very light background color in the core color ramp. Only used by fusion skins. .AFVeryLightForeground:alias The very light foreground color in the core color ramp. Only used by fusion skins. .AFVeryDarkAccentBackground:alias The darkest background color in the accent color ramp. Only used by fusion skins. .AFVeryDarkAccentForeground:alias The darkest foreground color in the accent color ramp. Only used by fusion skins. .AFDarkAccentBackground:alias The dark background color in the accent color ramp. Only used by fusion skins. .AFDarkAccentForeground:alias The dark foreground color in the accent color ramp. Only used by fusion skins. .AFMediumAccentBackground:alias The medium background color in the accent color ramp.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}