{
    "relation": [
        [
            "Patent application number",
            "20090086522",
            "20120127675"
        ],
        [
            "Description",
            "ADDRESS LINE WIRING STRUCTURE AND PRINTED WIRING BOARD HAVING SAME - An address signal line having a stub structure connects between at least three memory elements and a data transferring element and transmits address signals for the memory elements. An address terminal of the data transferring element has an impedance lower than a characteristic impedance of the address signal line. A wiring length TL",
            "APPARATUS HAVING A WIRING BOARD AND MEMORY DEVICES - An address signal line having a stub structure connects between at least three memory elements and a data transferring element and transmits address signals for the memory elements. An address terminal of the data transferring element has an impedance lower than a characteristic impedance of the address signal line. A wiring length TL"
        ],
        [
            "Published",
            "04-02-2009",
            "05-24-2012"
        ]
    ],
    "pageTitle": "Aoki, Tokyo - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/aoki-tokyo-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00288-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 426807900,
    "recordOffset": 426761984,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{35428=Patent applications by Jun Aoki, Tokyo JP}",
    "textBeforeTable": "Koichiro Aoki, Tokyo JP 05-17-2012 ULTRASONIC TESTING PROBE AND ULTRASONIC TETING APPARATUS - Provided are an ultrasonic testing probe and an ultrasonic testing apparatus capable of reducing the time required for flaw detection while maintaining the flaw-detection capability, irrespective of the shape of the inner surface of a tested object. A first probe ( 20120118064 05-03-2012 IMMERSION-TYPE ULTRASOUND FLAW DETECTION DEVICE AND ULTRASOUND FLAW DETECTION SYSTEM - It is intended to provide an ultrasound flaw detection device of an immersion-type that is inserted into a tube and is capable of moving smoothly within the tube just with water pressure, as well as an ultrasound flaw detection system. The ultrasound flaw detection device which detects abnormalities within the tube while moving in the tube by pressure of water flow, includes: an ultrasound flaw detector which is divided into a plurality of parts and includes an ultrasound probe 20120109540 09-29-2011 Thin Connector - A connector includes a housing and a terminal. The housing has an insertion space into which a thin insertion object is inserted. The terminal member has a supported portion supported by the housing, an elastic portion configured to be elastically deformed according to an insertion of the thin insertion object into the insertion space, and a terminal portion to be soldered to a board. The terminal portion is extended from the supported portion in a direction different form an extending direction of the elastic portion. The terminal member",
    "textAfterTable": "Patent applications by Koichiro Aoki, Tokyo JP Kouichi Aoki, Tokyo JP Patent application number Description Published 20090295812 INFORMATION DISPLAY DEVICE - To provide an information display device for displaying at least one item of display target information in respective screen element, receiving, while catalog display takes place, an instruction operation which is made utilizing display target information shown in the screen elements displayed as a catalog, and executing a process based on the instruction operation. 12-03-2009 20120075295 INFORMATION DISPLAY DEVICE - To provide an information display device for displaying at least one item of display target information in respective screen element, receiving, while catalog display takes place, an instruction operation which is made utilizing display target information shown in the screen elements displayed as a catalog, and executing a process based on the instruction operation. 03-29-2012 20120075344 INFORMATION DISPLAY DEVICE - To provide an information display device for displaying at least one item of display target information in respective screen element, receiving, while catalog display takes place, an instruction operation which is made utilizing display target information shown in the screen elements displayed as a catalog, and executing a process based on the instruction operation.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}