{
    "relation": [
        [
            "Attribute",
            "multiplicity",
            "name",
            "jointTable",
            "joinTable",
            "fkColumn",
            "roleName",
            "foreignKeyTable",
            "primaryKeyTable",
            "cmrField",
            "dbCascadeDelete",
            "cascadeDelete",
            "targetEjb",
            "id"
        ],
        [
            "Description",
            "Sets the multiplicity of the relationship. Valid values for this attribute are: Relation.Multiplicity.UNSPECIFIED Relation.Multiplicity.ONE Relation.Multiplicity.MANY",
            "Specifies the name of the relationship. Use the same name on both ends of a relationship (this constraint also applies to unidirectional relationships).",
            "Deprecated. Oracle recommends that you use joinTable instead.",
            "Only needed in a many-to-many relationship. The name of an existing table that will be used to hold the join table containing the relationships. If you are using a compound primary key, specify a set of corresponding foreign keys separated by a comma. The default value of this attribute is UNSPECIFIED.",
            "Needed only in a relationship having at least one One side. The non-One side EJB must declare the column that it will use to store the primary key of its counterpart. The default value of this attribute is UNSPECIFIED.",
            "The name of this role (such as \"ParentHasChildren\"). If no role name is given, EJBGen will generate one for you. You must specify a role-name in order to inherit relations. The default value of this attribute is UNSPECIFIED.",
            "The name of a DBMS table that contains a foreign-key. The default value of this attribute is UNSPECIFIED.",
            "The name of a DBMS table that contains a primary-key. The default value of this attribute is UNSPECIFIED.",
            "Specifies the CMR field where this relationship will be kept. This field is optional. If it not present, the relationship is unidirectional. The default value of this attribute is UNSPECIFIED.",
            "Determines whether a cascade delete will use the built-in cascade delete facilities of the underlying DBMS. See Constants.Bool for valid values for this attribute. The default value is Constants.Bool.UNSPECIFIED.",
            "See Constants.Bool for valid values for this attribute. The default value is Constants.Bool.UNSPECIFIED.",
            "Specifies the EJB name of the target of this relationship, which is used t generate the role name. If not supplied, a unique string will be generated. The default value of this attribute is UNSPECIFIED.",
            "The identity of this tag (used for tag inheritance only). The default value of this attribute is UNSPECIFIED."
        ],
        [
            "Data Type",
            "Enum",
            "String",
            "String",
            "String",
            "String",
            "String",
            "String",
            "String",
            "String",
            "Enum (Constants.Bool)",
            "Enum (Constants.Bool)",
            "String",
            "String"
        ],
        [
            "Required?",
            "Yes",
            "Yes",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No"
        ]
    ],
    "pageTitle": "E EJBGen Reference",
    "title": "",
    "url": "http://docs.oracle.com/cd/E23943_01/web.1111/e13719/ejbgen.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00217-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74974831,
    "recordOffset": 74938901,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 13 May 2015 05:20:19 GMT",
    "textBeforeTable": "Table E-26 Relation EJBGen Annotation Attributes Attributes Target: Class weblogic.ejbgen.Relation This tag is deprecated, use the attribute primkeyField on weblogic.ejbgen.CmpField. weblogic.ejbgen.PrimKeyField This annotation does not have any values, other than the array of weblogic.ejbgen.MethodPermissionPattern annotations. Target: Class weblogic.ejbgen.MethodPermissionPatterns No Enum (Constants.Bool) Specifies whether this pattern will apply to unchecked methods. See Constants.Bool for valid values for this attribute. The default value is Constants.Bool.UNSPECIFIED. unchecked No String The identity of this tag (used for tag inheritance only). The default value for this attribute is UNSPECIFIED. id No Enum (Constants.Interface) Specifies the interface to which this permission pattern applies. See Constants.Interface for valid values for this attribute. The default value is Constants.Interface.UNSPECIFIED. itf Yes",
    "textAfterTable": "weblogic.ejbgen.Relations Target: Class This annotation does not have any attributes, other than the array of weblogic.ejbgen.Relation annotations. weblogic.ejbgen.RelationshipCachingElement Target: Class Attributes Table E-27 RelationshipCachingElement EJBGen Annotation Attributes Attribute Description Data Type Required? cachingName Specifies the name of an eager relationship caching. String Yes cmrField Specifies a comma-separated list of CMR field names. String Yes groupName Specifies the name of the group to be loaded for the CMR field. The default value of this attribute is UNSPECIFIED. String No parentId Specifies the parent ID of this element. The default value of this attribute is UNSPECIFIED.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}