{
    "relation": [
        [
            "Nominee",
            "Jill Whalen",
            "Greg Boser",
            "Matt Cutts",
            "Stoney DeGeytor",
            "Dave Naylor"
        ],
        [
            "Count",
            "222",
            "110",
            "84",
            "60",
            "23"
        ],
        [
            "Percent %",
            "44.49%",
            "22.04%",
            "16.83%",
            "12.02%",
            "4.61%"
        ]
    ],
    "pageTitle": "Hooley Archives - Chris Hooley's -ThinkBait- Chris Hooley's -ThinkBait-",
    "title": "",
    "url": "http://www.chris-hooley.com/tag/hooley/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 363719527,
    "recordOffset": 363658010,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{24007=I’ve owned this Phoenix SEO company since 2001, but let it go stale because I spent years as a corporate SEO.  Well, I’m no longer somebody else’s executive.  I’m my own boss now.  So it makes sense that I knock the dust off of my old site and start taking clients again!, 79042=Turns out the first two transactions where not just deposits. They were checks written to me, Christopher Hooley. The first one was $6200. The guy kept $5k and left $1200 in my account. The next one was a day later at a different center for $7500. Again, the guy kept $5k. I saw the debit slip online, and this guy’s signature wasn’t even a remote attempt to copy mine. To make matters worse, it turns out he was forging checks from another valley business, who subsequently called the police on ME!, 80968=Booked: 07-09-2008, 81002=Sex: MALE Race: WHITE D.O.B: 10-11-1975 Height: 5’09 Weight: 200 Eye: BROWN Hair: BLACK, 87786=The time has come to announced the winners for the 2008 SEO Superlatives. But before the announcement, I’d like to thank everybody who contributed. The SEO Superlatives Committee was awesome. All you crazy guys and gals who where socializing this, kick ass. Thanks so much for making this contest so much fun!, 203272=EDIT- we hit 250 responses in about an hour, so it’s opened up to 1000 responses. There’s STILL TIME to cast YOUR votes!}",
    "textBeforeTable": "1. SEO Most Likely to Succeed Report: SEO Superlatives Summary – Compiled 07/04/08 As you’ll see, the committe only chose one or two winners over the unfiltered voting results. And sorry Michael, but it’s hard to believe you’re more feared than Matt Cutts in the SEO world. Below are the unfiltered results of the vote. Despite attempts at altering the vote, much like Google we also had manual review. And much like Google, the popular vote still overpowered the spam for the most part, so the committee’s job was pretty darn easy in that regard. There were more polls that only voted for one single person than completed surveys. IN all, half the votes were spam. HALF. Numerous nominees, especially in the categories for unknown or up and coming SEOs had bots voting themselves up in an almost embarrasingly traceable way. Same IP from nominee’s city votes for self 100 times in an hour? yep. Lots of that. Rushes of voters from India, Russia, Malaysia, and Poland overnight? Some of that too. The winners were chosen almost 100% from the unfiltered voting results, allowing SEOs to game the voting system to the best of their abilities. And game they did. The Results Jason Gambert",
    "textAfterTable": "2. SEO Conference Clown Nominee Count Percent % Chris Hooley 309 60.00% Neil Patel 166 32.23% Darren Slatten 23 4.47% Gab Goldberg 14 2.72% Gab Goldenberg 3 0.58% 3. Best SEO Couple Nominee Count Percent % Carolyn Shelby and Dave Rohrer 197 38.70% Greg and Barbara Boser 161 31.63% Chris Hooley and Anna Rule 94 18.47% David & Irma Wallace 30 5.89% Jeff Quipp & Jennifer Osborne 27 5.30% 4. Best Dressed SEO Nominee Count Percent % Brett Tabke 208 38.88% Kid Disco 127 23.74% Pamela Lund 87 16.26% Mikkel deMib Svendsen 66 12.34%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}