{
    "relation": [
        [
            "VOTE:",
            "",
            "",
            ""
        ],
        [
            "Alan Dexter Bowman",
            "Josephine DiRienzo",
            "Margaret E. L. Howard",
            "Robert J. Long"
        ],
        [
            "(Yes)",
            "(Abstained)",
            "(Yes)",
            "(Yes)"
        ]
    ],
    "pageTitle": "Civil Service Commission | Meeting Minutes of November 20, 2002",
    "title": "",
    "url": "http://www.nj.gov/csc/about/meetings/minutes/021120m.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 617788990,
    "recordOffset": 617773035,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3451=A regular meeting of the Merit System Board was held on Wednesday, November 20, 2002, in Trenton, New Jersey., 2877=Notice of this meeting was filed with the Secretary of State and sent to the Trentonian, Trenton Times, Courier-Post and Star Ledger on March 7, 2002, and posted at the Department of Personnel, 3 Station Plaza, Trenton, New Jersey., 3009=In accordance with L.1975, c.231, Margaret E. L. Howard opened the meeting with the following statement:}",
    "TableContextTimeStampAfterTable": "{16889=B-12 MICHAEL STOECKER Michael Stoecker, a Fire Fighter with the North Regional Fire and Rescue Service, represented by Bruce Leder, Esq., petitions the Merit System Board for interim relief in relation to his immediate suspension, effective July 15, 2002., 3850=A-5 RANDY GEIS Randy Geis, Fire Fighter, City of Bayonne, Fire Protection Department, release at the end of the working test period effective August 16, 2000., 38502=B-54 MERIT SYSTEM BOARD MINUTES The Merit System Board Minutes for the meeting of November 7, 2002 are submitted for adoption., 8806=A-10 WILLIE GOODMAN Willie Goodman, Senior Correction Officer, Central Reception and Assignment Facility, Department of Corrections, removal effective June 20, 2001, on charges of conduct unbecoming a public employee and use, possession or sale of any controlled dangerous substance., 38776=There being no further business before the Merit System Board, the meeting was adjourned to convene on Wednesday, December 4, 2002 at 10:00 a.m., at 3 Station Plaza, Trenton, New Jersey. __________________________________ MARGARET E. L. HOWARD PRESIDING BOARD MEMBER MERIT SYSTEM BOARD, 9354=A-11 DANNY KELLY Danny Kelly, Head Cook 3, Mid-State Correctional Facility, Department of Corrections, removal effective December 28, 2000, on charges of discrimination that effects equal employment opportunity, conduct unbecoming a public employee, and verbal abuse of an employee, inappropriate physical contact or mistreatment of an employee, and threatening, intimidating, harassing, coercing, or interfering with a fellow employee on state property., 11171=A-14 GEORGE ROSKILLY George Roskilly, Institutional Trade Instructor, Edna Mahan Correctional Facility for Women, Department of Corrections, removal effective December 21, 2000, on the charge of violation of rule, regulation, policy, procedure, order or administrative decision., 4858=Frank Perez, Police Officer, City of Newark, Police Department, appeals the following disciplinary actions: 1) Five-day suspension on the charge of conduct unbecoming a public employee. 2) Ten-day suspension on the charge of violation of Police Department rules regarding conduct in public and private. 3) Removal effective August 29, 1997, on charges of, inter alia, neglect of duty and official inefficiency or incompetency, absence without leave, insubordination, and malingering. 4), 28356=ACTION: The Merit system Board adopted the meeting dates for 2003., 17187=ACTION: The Merit System Board awarded back pay for the period from July 21, 2002 to July 25, 2002., 28174=B-35 PROPOSED MERIT SYSTEM BOARD MEETING DATES FOR 2003 The proposed Merit System Board Meeting Dates for 2003, are submitted for approval., 18810=B-16 KENNETH LITTLE Kenneth Little, a Senior Correction Officer at East Jersey State Prison, Department of Corrections, formerly represented by Kirk D. Rhodes, requests counsel fees in accordance with the Merit System Board decision rendered on February 8, 2000, which acknowledged the appointing authority's withdrawal of all charges underlying his 15-day suspension and three removals., 19731=B-18 THOMAS WALLACE The appeal of Thomas Wallace, a Police Officer with Little Egg Harbor Township, of his removal effective August 2, 1999 on charges, was heard by Administrative Law Judge Joseph F. Martone (ALJ), who rendered his initial decision on August 15, 2002 reversing the removal. At its meeting on October 23, 2002, the Merit System Board (Board) adopted the ALJ's recommendation. The proposed final decision is now submitted for the Board's review., 10053=A-12 GREGORY MCDANIEL Gregory McDaniel, Human Services Specialist 2, Mercer County Board of Social Services, removal effective March 15, 2000, on the charge of violation of the County Board of Social Services tardiness and absenteeism policy., 35700=B-52 KETLINE CHARLOT The appeal of Ketline Charlot, a Human Services Assistant with Woodbridge Developmental Center, Department of Human Services, of her removal effective November 19, 2001 on charges, was heard by Administrative Law Judge Richard F. Wells, (ALJ), who rendered his initial decision on July 26, 2002 upholding her removal. At its meeting on October 23, 2002, the Merit System Board modified the removal to a resignation in good standing. The proposed final decision is now submitted for the Board's review., 29633=B-38 DEBORAH MCDERMOTT Deborah McDermott, represented by Thomas E. Stover, Esq., petitions the Merit System Board (Board) for reconsideration of the final administrative decision, rendered on April 18, 2000, in which the Board upheld her removal from a special remployment list., 10587=A-13 GILBERT MCGILL, JR. Gilbert McGill, Jr., Senior Therapy Program Assistant, New Jersey Veteran's Memorial Home, Paramus, Department of Military and Veteran's Affairs, removal effective October 9, 2001, on charges of inability to perform duties and other sufficient cause., 11709=A-15 GAYE DAVIS - SETTLEMENT Gaye Davis, Youth Worker, Division of Youth and Family Services, Department of Human Services, removal effective December 20, 2000, on the charge of conduct unbecoming a public employee.}",
    "lastModified": "Wed, 07 May 2014 18:26:36 GMT",
    "textBeforeTable": "  ACTION: The Merit System Board affirmed the recommendation of the Administrative Law Judge. Recommendation of the Administrative Law Judge - Modify the 45-day suspension to a ten-day suspension. A-2 ARNOLD BORRERO Arnold Borrero, Police Officer, City of Newark, Police Department, 45-day suspension on charges of insubordination and violation of Police Department rules and regulations SECTION A - HEARING MATTERS A-1 SETTLEMENTS In the Matter of Glenn Dusz Township of Sparta Police Department Demotion In the Matter of William Restiano County of Union Department of Public Safety Suspension RECOMMENDATION OF THE ADMINISTRATIVE LAW JUDGE IN THE ABOVE CASES - SETTLEMENT ACTION: The Merit System Board acknowledged the settlements. Sammy Tse, Human Services Assistant, Ancora Psychiatric Hospital, Department of Human Services, suspension. Paul Soyka, Principal Accountant, Department of Administration, City of Jersey City, demotion in lieu of layoff. Bryan Snyder, Senior Correction Officer, South Woods State Prison, Department of Corrections, removal. Sheena Sistrunk, Human Services Assistant, Vineland Developmental Center, Department of Human Services, removal. William Singleton, Laborer, Roads Department, County of Ocean, release at the end of the working test period. Thomas Pavlik, Laborer, Department of Public Works, Township of Brick, removal. Roberto Medina, Senior Correction Officer, Juvenile Justice Commission, Department of Law and Public",
    "textAfterTable": "A-3 MARILYN A. GANGES Marilyn A. Ganges, County Correction Captain, County of Burlington, County Jail, six-day suspension and demotion to the position of County Correction Lieutenant on charges of incompetency, inefficiency or failure to perform duties, neglect of duty, and violation of rules and regulations. Recommendation of the Administrative Law Judge - Uphold the six-day suspension and demotion. ACTION: The Merit System Board affirmed the recommendation of the Administrative Law Judge. A-4 EDWARD C. GARVIN Edward C. Garvin, Truck Driver, Borough of Wildwood Crest, Department of Public Works, 60-day suspension on charges of, inter alia, misconduct, misuse of public property, conduct unbecoming a public employee, and violation of employee rules and regulations. It is noted that the appointing authority in addition to suspension ordered random drug/alcohol testing for a period of 12 months. Recommendation of the Administrative Law Judge - Uphold the 60-day suspension and random drug/alcohol testing for a period of 12 months. ACTION: The Merit System Board originally affirmed the recommendation of the Administrative Law Judge. However, after executive session a motion was made to reopen the matter.   VOTE: Alan Dexter Bowman (Abstained)   Josephine DiRienzo (Yes)   Margaret E. L. Howard (Yes)   Robert J. Long (Yes) Upon reconsideration, the Board modified",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}