{
    "relation": [
        [
            "Patent application number",
            "20100308916",
            "20100311362",
            "20110274221"
        ],
        [
            "Description",
            "Programmable gain MOS amplifier - A programmable gain MOS amplifier is disclosed. The programmable gain MOS amplifier is capable of increasing its programmable gain linearly in dB unit by increasing its gain level data linearly. The programmable gain MOS amplifier includes a plurality of gain providers for providing predetermined gains respectively, and a plurality of gain tuners. Each of the plurality of the gain tuners is disposed for adjusting the predetermined gain from the corresponding gain provider. Each of the gain tuners includes a gain enabling module and a gain decreasing module. The gain enabling module allows the corresponding predetermined gain to add to the programmable gain of the MOS amplifier. The gain decreasing module declines the corresponding predetermined gain added to the programmable gain of the MOS amplifier.",
            "Gain compensation device over temperature and method thereof - A gain compensation device for adjusting gain of an amplifier over temperature is disclosed. The gain of the amplifier is controlled by signals on a gain control end of the amplifier. The gain compensation device comprises a temperature compensation generator, an adder, and a temperature sensor. The temperature compensation generator is for generating an additional gain parameter according to a reference temperature, a current temperature, and a temperature coefficient. The adder comprises a first input end, coupled to the temperature compensation generator for receiving the additional gain parameter, a second input end for receiving a default gain parameter, and an output end coupled to the gain control end of the amplifier for outputting sum of the additional gain parameter and the default gain parameter. The temperature sensor is for providing the current temperature.",
            "METHODS FOR ADJUSTING SYSTEM CLOCK IN TERMS OF OPERATIONAL STATUS OF NON-BASEBAND MODULE, METHODS FOR PERIPHERAL DEVICE CONTROL ADJUSTMENT, AND ELECTRONIC DEVICES USING THE SAME - A method for adjusting a system clock in terms of an operational status of at least one non-baseband module includes: getting first information corresponding to the system clock required by at least one baseband module, wherein the first information comprises a frequency characteristic of the system clock; getting second information corresponding to the at least one non-baseband module, wherein the second information comprises a frequency characteristic of a radio frequency (RF) signal to be received by the non-baseband module; and selectively adjusting a frequency of the system clock by referring to the first information and the second information."
        ],
        [
            "Published",
            "12-09-2010",
            "12-09-2010",
            "11-10-2011"
        ]
    ],
    "pageTitle": "Tseng, Hsinchu County - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/tseng-hsinchu-county-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00178-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 431421391,
    "recordOffset": 431395373,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Po-Sen Tseng, Hsinchu County TW 07-14-2011 MULTI-FIELD ARRANGING METHOD OF LED CHIPS UNDER SINGLE LENS - A multi-field arranging method of LED chips under a single lens includes the steps of: setting a first concentric circle on a bottom of a hemispherical lens, wherein the first concentric circle is centered at an axis of the hemispherical lens; and equidistantly arranging at least one first color chip, at least one second color chip and at least one third color chip on the first concentric circle in sequence. The present invention allows the color chips to present symmetrical light patterns through the hemispherical lens, thereby obtaining a light field with evener color mixture. 20110171765 Published Description Patent application number Po-Ming Tseng, Hsinchu County TW 01-14-2010 DEVICE FOR PRODUCING LAMINATED FILM - A device for producing a laminated film includes a plurality of thin film extruding dies, a case, and a thin film pressing module. Each thin film extruding die has a conveying channel, and extrudes a thin film through the conveying channel. The case forms an accommodation space together with the thin film extruding dies. One end of the conveying channels is respectively communicated with the accommodation space. The case has a through hole communicated with the accommodation space. The through hole is connected to a vacuum pump, and the vacuum pump is used to remove the gas in the accommodation space. The thin film pressing module",
    "textAfterTable": "Shau-Yin Tseng, Hsinchu County TW Patent application number Description Published 20090110316 APPARATUS AND METHOD FOR PERFORMING VIDEO DECODING PROCESSES IN PARALLEL - An apparatus and a method for performing video decoding processes in parallel are provided. The method is adapted for utilizing a first cluster and a second cluster of a processor to perform the video data decoding process in parallel. The method includes performing a VLD process to the video data with the first cluster, so as to obtain a plurality of coefficients and then performing an IZ process, an IQ process, and an IDCT process to the coefficients with the second cluster, so as to obtain a plurality of pixels values of the video data. When the first cluster decodes a coefficient of the video data, the second cluster performs the IZ, IQ, and IDCT processes to a coefficient previously decoded by the second cluster of the video data. Accordingly, a parallel process is realized and the decoding speed is increased. 04-30-2009 Sheng-Che Tseng, Hsinchu County TW Patent application number Description Published 20140141734 DIRECT-CONVERSION TRANSMITTER AND COMMUNICATION SYSTEM UTILIZING THE SAME - A direct-conversion transmitter including an oscillator, a frequency divider, a transmitter, and a filter is provided. The oscillator generates an oscillating signal with an original frequency. The frequency divider performs frequency dividing on the oscillating signal, so as to generate a carrier signal. The transmitter receives",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}