{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Overall good, probably better on the Brunswick campus.",
            "None that I know of.",
            "Plenty of clubs and activities.",
            "Undecided students, Culinary, Nursing, Business",
            "There was an event held Fall 2012 that was a Humans v. Zombies week long event.",
            "This school gives you bang for your buck.",
            "The Campus Activity Board is always holding events including dances, helpful lunch and learns, and hosting guest speakers.",
            "Food is definitely better than high school cafeteria food. However I will say there is no official cafeteria at the Camden campus so you eat prepared sandwiches or salads if you eat from the Camden campus.",
            "I do not personally know about the dorm life, but from what I have seen and heard it is nice.",
            "The rigor can range depending upon your teacher, but overall the rigor is fairly moderate.",
            "Don't put CCGA as a last resort if you can't get in anywhere else it is just as good as a large university.",
            "The price to attend is excellent. The classes are more one-on-one. Everyone is relatively friendly."
        ]
    ],
    "pageTitle": "College of Coastal Georgia Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/College-of-Coastal-Georgia/reviews?_escaped_fragment_=/show/73006",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00048-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905903175,
    "recordOffset": 905859793,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{171573=© 2015, Cappex.com, LLC, 27994=since we have gotten to be a four year university the price for tuition has definitely gone up. yes it is still pretty cheap compared to the other schools. but for one class it was almost $1000. so the price has changed since i first registered. my first semester was $1600 for 5 classes., 35353=I live off campus so cannot comment on dorm life. I can say I know that on campus living was new as of the 2011-2012 school year so I'm sure it would be exciting to be among the first to live in the new residence hall., 3523=If you plan on going to this college, it will be really great if you apply up for it in your early senior year after you get your SAT scores (if you took them early in the year). It will be a lot easier to apply, especially BEFORE summer. But since sigining up for the 30 scholarship's deadline is by March 1st this year, you might want to apply there in the winter., 4178=The proffesors here are really professional, and this school is not a community college anymore, they have raised up to a university system. They are going to be building dorms soon which will be finisheed by 2011. Recently I have gone to one of their seminars and it was thouroughly informitive. The college is really nice and the professors here are exceptional., 112156=There was an event held Fall 2012 that was a Humans v. Zombies week long event., 31103=this school has improved since i started back in 2009. becoming more involved with students. they have gotten more sports now and seems to be doing very well., 34686=The dining hall is EXCELLENT. I attended college back in 1999-2003 and the food then doesn't even hold a candle to what CCGA offers. The food is really good and the set up is amazing. It's all you can eat, open buffet style and you have 4 different areas to choose 4 different meals from plus a complete salad bar. Dining is new this year at CCGA and they have done an excellent job.}",
    "textBeforeTable": "07/20/2011 Reviewer is A current student here. 7 out of 8 people found this review useful. 1 of 40 Merrie from St. Marys, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Categories Comments What to do for fun there are lots of activities and programs you can do for fun within campus and lost of organization sto get involved with. off campus we are very close to the beach and that is what most of our students love to do. Food and Dining the dining hall is very convenient and has a wide variety of meals to offer students. some meals are better than others but they take all suggestions and comments and do something with them. they do not take a suggestion and leave it as a note on their desk. they take that suggestion and use it to better themselves, so that they can better serve use students. Dorm Life the residence life and housing staff here at ccga are phenomenal. they do erverything they can to help the residential students get involved, stay invovled and succeed academically. i love living in the residence halls. Academic Rigor i am a student in the bachelors of business administration program and i continually see the courses getting harder, but that also means i continue to get more out of them. you get out of classes what you",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}