{
    "relation": [
        [
            "Series/Grade",
            "GS-592-07",
            "GS-1101-09",
            "GS-1101-11",
            "GS-1101-12"
        ],
        [
            "Description",
            "• Moderate supervisory control is expected • Completed work is reviewed for appropriateness, soundness, and conformance with established guidelines",
            "• Little or no supervisory control is exercised • Completed work is reviewed for technical soundness, appropriateness, and conformance with established guidelines • Incumbent exercises independent judgment and initiative in determining the course of action on routine bankruptcy cases • Guidance is limited to cases where unusual or unfamiliar situations arise, case actions which require an interpretation of the Bankruptcy Code or IRM, or cases which involve matters of public interest or have potential to create adverse publicity",
            "• Little or no supervisory control is exercised • Completed work is reviewed on the basis of results accomplished and is normally accepted without change • Guidance is limited to cases in which unusually difficult problems arise, case actions involving matters of public interest or the potential to create adverse publicity, or cases which may set a precedent",
            "• Little or no supervisory control is exercised • Samples of completed work are reviewed to ensure fulfillment of program procedures and guidelines • Completed work is rarely changed as incumbent is considered a technical expert • Supervisory consultations are limited to cases involving significant or sensitive issues, decisions which deviate from established policy, cases which significantly impact other functions with the IRS, cases which involve matters of public interest or have potential for adverse publicity"
        ]
    ],
    "pageTitle": "Internal Revenue Manual - 1.4.51 Insolvency (Cont. 1)",
    "title": "",
    "url": "http://www.irs.gov/irm/part1/irm_01-004-051-cont01.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00248-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 507339587,
    "recordOffset": 507267735,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{102123=Excluded property in the form of ERISA-style pension plans with anti-alienation clauses does not require the Service to have an NFTL on file before pursuing collection action. Insolvency specialists work these cases themselves usually eliminating the need to issue an OI. (See IRM 5.9.17.4.3,Insolvency Levy Procedures for Excluded Retirement Plans.), 58777=Significant Cases. Significant cases must be referred to Counsel regardless of chapter. (See IRM 5.9.4.14.3,Referrals on Significant Bankruptcy Case Issues.) The AIS history must annotate if Counsel has assumed the responsibility for plan review., 66887=The APOC program systemically calculates and classifies liabilities to populate AIS proofs of claim fields so Forms B-10 can be produced for the bankruptcy court. A full discussion on employee instructions for generating and perfecting APOC data is found in IRM 5.9.14,Automated Proofs of Claim. This IRM 1.4.51 subsection deals with manager reports and APOC permissions, topics not covered in IRM 5.9.14., 229665=Unreversed TC 520s. This report identifies cases closed on AIS but with at least one IDRS module showing an unreversed TC 520. IRM 5.9.12.8.1,LAMS Closed Case Listing provides step instructions for printing and working this report., 201091=Enter beginning date. An old date, like 01/01/1950, should be input to capture cases previously overlooked or cases entered with an erroneous date., 64084=NFTL Refile. Procedures outlining the issues involved and the reviews required for potential NFTL refiles are found in IRM 5.9.5.9.2,Refiling of Liens,IRM 5.9.8.16.2,Monitoring the Plan and Reviewing for Lien Refile, and IRM 5.9.17.4.2(13),Lien Refiles., 61676=Any case filed on or after October 17, 2005, under any chapter, is subject to dismissal or conversion if the debtor fails to file a postpetition return. (See 11 USC § 521(j).), 12782=Respecting assignment of duties by operation established in IRM 5.9 and IRM 1.4.51, 96027=IRM 10.8.34, Integrated Data Retrieval System (IDRS) Security Controls, 56828=Secured Assets. Where valid NFTLs have been filed and the criteria in IRM 5.9.4.14.4,Referral Tolerances, are met, Insolvency should pursue adequate protection of the government's interest in assets that will lose significant value during the life of the plan., 254657=If the caseworker is generating the report on 01/10/2013 they will use 12/23/2012 as the beginning date and 12/29/2012 as the end date., 127086=Administrative/Compliance Conformance focuses on ensuring adherence to servicewide managerial requirements and law, regulation and policy. Such items may or may not seem directly related to program delivery. Examples include: 1204 certifications, hiring, travel authorizations/vouchers, remittance control reviews, etc., 237943=Chapter 13 Plans. IRM 5.9.10.6,Field Insolvency AIS Actions provides instructions on required AIS actions concerning input of plan data., 184476=Narratives are an effective tool in documenting and informing a employee of their performance. They should be used to emphasize the positive as well as the negative aspects of the employee's performance. They can be used as either stand alone documentation (EQRS Individual and/or Cumulative Feedback Reports) and/or with the Form 6850 (when appropriate). See Article 12, Section 4P, of the 2012 National Agreement II, regarding Form 6850 narratives. Effective narratives:, 10860=You should review the number of cases on the Court Closure Follow-up Report to monitor inventories identified as \"at risk\" for backlogs or lack of timely processing. Closure actions on discharged and dismissed cases must be initiated within 30 days of notice. As a part of closing actions, managers must ensure liens are released timely when release is appropriate. IRM 5.9.17.18,Release of Liens provides procedures for lien releases which may include requests for manual lien release., 150300=1204/ROTERs. On an ongoing basis, screen case and performance documentation for inappropriate use of ROTERs. Quarterly, complete the 1204 self certification and certify the group manager’s completion of their self certification. (See IRM 1.5.3.6.3, Retention Standard Documentation.), 52692=Timely Claims. In most cases to be timely, a POC must be filed no later than 180 days (the government bar date) from after the date of the order of relief (which is the date the bankruptcy petition was filed in voluntary cases). (See 11 USC § 502 and Federal Rules of Bankruptcy Procedure Rule 3002.) Claims prepared through APOC processing should be filed prior to the first meeting of creditors. A full discussion of time frames for filing claims can be found in IRM 5.9.13.7,Bar Dates., 234375=Time frames. This report should be run quarterly to identify ASEDs due the following April 15, the presumptive filing date of 941 returns. This catches cases that may have been recently filed or cases where a TFRP review was overlooked., 247007=Purpose of Report. Cases are listed on this report because their TINs do not match any TINs in the presumed AIS database, and the Bankruptcy/Litigation Location Code (BLLC) is for a district other than the presumed district. Under normal conditions these cases belong to taxpayers with a Primary Location Code in the home district and a bankruptcy in a foreign district. IRM 5.9.12.8.2,Lams Not Found on AIS Case Listing Report provides step instructions for generating and working this report., 59159=Review and Documentation. IRM 5.9 provides detailed text and procedures for reviewing and documenting plans. (See IRM 5.9.5.4(3),Chapter 13 Plan Documentation,IRM 5.9.5.4(4),Chapters 11 and 12 Plan Documentation,IRM 5.9.8.14.2,The Plan of Reorganization,IRM 5.9.9.6,Chapter 12 Plans,IRM 5.9.9.6.2,Plan Modification,IRM 5.9.9.7,Reasons to Object to the Plan, and IRM 5.9.10.5,The Chapter 13 Plan.), 334445=1204/ROTERs, 142193=Annual Appraisal/Performance Document Approval - You are responsible for ensuring timely feedback and appropriate ratings of employees. This should be an ongoing process during the year through approval of the annual rating. Ensure consistency between the Form 6850 critical job element rating/narrative and the performance documentation contained in the EPF. Review for potential 1204 violations/ ROTERs during this process. Ensure that the GM has a review schedule that includes all required reviews such as mid-year, field visits, etc. A mutually agreeable review schedule should be established the beginning of each fiscal year. Ensure that GMs conduct mid-year reviews between the 5th and 7th month of the rating cycle. Annual reviews/ratings should be completed at least 60 days prior to the end of the rating period so that employees have enough time to demonstrate improvement if necessary. Discuss GM compliance with review schedules during periodic briefings and document compliance in the program review annual narrative., 61889=In Chapter 11 cases filed on or after October 17, 2005, failure to file a postpetition return is an express ground for dismissing or converting a case. (See 11 USC § 1112(b)(4)(I).), 111622=Coordinating with Field Collection if appropriate (See IRM 5.9.8.10,Trust Fund Considerations in Chapter 11); and, 14402=Identify cases with which the employees may need assistance such as listed in IRM 1.4.51.7.3(3), Case Management Tools., 63166=Fraud Detection. All caseworkers, regardless of grade or position title, should review cases with an eye for indications of bankruptcy fraud. However, Field Insolvency is responsible for referring accounts to the Fraud Technical Advisor (FTA) or to Counsel when warranted. (See IRM 5.9.4.11, Bankruptcy Fraud, and IRM 5.9.17.7.1,The Fraud or Willful Evasion Exception.), 203888=If during the manager’s review a missed bar date is identified, the manager may need to complete Form 14167, Bar Date Expiration Report. See IRM 1.4.51.10.1 (3) , Missed Bar Dates, for specific procedures., 135779=Case reviews - At a minimum, review 2 to 3 cases per employee in the group. The reviews should assess whether the case is moving toward a logical resolution, if the employee is using good workload management techniques, and whether there are any trends that may be adversely impacting group performance. The TM review is a higher level review that considers if actions taken on the case are appropriate and are effectively moving the case toward a logical resolution. As part of the case review process, customer service considerations may be assessed by determining if taxpayer contacts were timely and whether the employee has been responsive to taxpayer requests. In addition, confirm that employee has appropriately observed valid POAs on file. When case reviews are conducted, it is mandatory to ensure that managers are addressing TP rights, particularly with respect to direct contact provisions. You may also include “mirror” reviews of cases which the GM has already reviewed in order to assess the accuracy of the GM's EQ attribute review and if proper direction was given by the GM as part of the review. You may use the EQ review reports to determine if the GM reviewed the appropriate number and mix of cases during both the mid and annual appraisal segments. This may also be accomplished at the mid-year approval if the TM has elected to approve the mid-year appraisal of each employee. (See IRM 1.4.51.4.2.2,Requirements for Annual Performance Case Reviews.) Additional considerations include; annual field visit conducted, annual time utilization reviews conducted, follow-up review conducted, and whether the reviews were provided to employee timely., 219612=For individual Chapter 11 cases filed on or after October 17, 2005, confirmation of the plan does not result in a discharge. Instead, the court will grant a discharge when all plan payments are completed., 260498=Purpose of Report. This AIS report identifies cases that are older than a certain number of days (270 for 7N and 7A cases, and 2190 for Chapter 13 cases) and do not yet have a dismissal/discharge date on AIS. IRM 5.9.12.10,Aged Case Reports gives more information on this report., 96908=You must ensure case discharge processing begins no later than 30 calendar days after receipt of the discharge notice for all cases except non-liquidating corporate Chapter 11 cases or individual Chapter 11 cases commenced prior to October 17, 2005. Discharge actions on non-liquidating corporate Chapter 11 cases or individual Chapter 11 cases commenced prior to October 17, 2005, must be initiated within 30 calendar days of plan completion., 71082=Only users with User Admin privileges will be able to add or change permissions in APOC. See IRM 1.4.51.7.2, for more information on obtaining AIS privileges., 103845=Insolvency must protect assessment statute expiration dates (ASEDs) and collection statute expiration dates (CSEDs). For information on ASEDs and CSEDs including the effect of BAPCPA on cases filed on or after October 17, 2005, see IRM 5.9.5.7,Serial Filers,IRM 5.9.4.2.1,BRA 94 and BAPCPA's Effect on Assessments, and IRM Exhibit 5.9.6-1,Chapter 7 Trustee Turnover Procedures., 100016=Chapter 7 and Chapter 13 cases discharged by the court will be run through ADS by the CIO twice a week. ADS processing allows all discharged cases in these chapters to be reviewed by the same standards. Some circumstances may warrant a case's remaining open even though the court has entered a discharge. IRM 5.9.5.4(6),Classification \"PDSC,\" explains procedures for these cases. A majority of cases are closed systemically as either non-dischargeable and a TC 521 is input, or dischargeable and a TC 971 is input followed by a TC 521 after a two-cycle delay. Discharge determination reports (DDRs) are generated for cases that cannot be fully processed without caseworker intervention. Insolvency caseworkers must begin resolving DDRs within 30 calendar days of the Service's receiving notification of discharge. (See IRM 5.9.17.3,Time frames for Required Actions.) Those DDRs for accounts assigned to the CIO and involving complex issues should be forwarded to the appropriate Field Insolvency office for resolution. The review frequency for DDR resolutions on specific cases is set by the CIO Operations Manager. IRM 5.9.18,Automated Discharge System (ADS) outlines procedures for running ADS and resolving DDRs., 245199=Range of Uses. This report identifies cases in all chapters where referrals have been made, and the AIS referral screen has been completed. (See IRM 5.9.4.14 Referrals – Representing IRS in Bankruptcy Court.) For month end reporting purposes, the group secretary can pull the report to count Chapter 11 referrals within the monthly reporting period., 147440=Controls. Determine if appropriate and sufficient controls are in place for items such as: • Statutes, IRM 5.1.19.5, Imminent CSEDs • Trust fund, IRM 5.19.8, Collection Appeal Rights • CDP, IRM 5.7.10.2, Case Review and Processing, 183811=Evaluative documents retained in the caseworker's EPF, such as EQRS Individual Feedback and/or Cumulative Feedback Reports. Also IRM 1.4.51.4, Performance Management and IRM 1.4.51.4.2, Reviews for other considerations., 149603=Credit Bureau. Ensure the GM is approving credit bureau requests as required and has a system in place to monitor for proper documentation. (See IRM 5.1.18.18.2, Limitations on Ordering Consumer Credit Reports.), 99041=If exempt, excluded or abandoned assets are identified, Insolvency managers should ensure prompt action is taken to determine if such assets are worth pursuing, including appropriate investigation and valuation of the assets. (See IRM 5.9.17.4.2,Addressing Lien Issues for specific time frames.) Once a determination is made not to pursue such assets, managers should ensure that caseworkers are initiating closing actions to adjust the dischargeable modules within 30 days of the determination, which will result in a systemic release of the NFTL. Generally, a manual release of the NFTL is not required. However, if a systemic release of the NFTL will not be issued, a manual release of the NFTL should be requested. Quarterly checking of the Lien Research report will identify liens that have not been released so corrective actions can be taken. See Exhibit 1.4.51-25., 113791=Imminent and Expired CSEDs. The procedures outlined in IRM sections 5.1.19.5 through 5.1.19.5.6 should be followed when addressing imminent (CSED will expire in 12 months or less) or expired CSEDs under the bankruptcy freeze, substituting the words \"Insolvency caseworker(s)\" for \"revenue officer(s).\", 65369=BAPCPA Change. The Service has addressed compliance requirements brought about by BAPCPA by including annotations on claims and sending courtesy copies of Letter 1714 to trustees to provide information regarding unfiled returns. The Letter 1714 courtesy copy alerts the trustee that the Service may be amending its POC or filing a motion to dismiss or convert the bankruptcy. The trustee may wish to delay distributions or plan confirmation until this tax administration issue has been resolved., 270847=On the Reports menu, under Inventory select the \"L-1714 F/U\" button., 280264=Purpose of Report. The Large Dollar Report lists all cases in the open AIS file with POC data meeting a dollar criterion established by the caseworker or reviewer allowing prioritization of casework by dollar amount. IRM 5.9.4.14.3,Referrals on Significant Bankruptcy Case Issues requires all cases meeting certain criteria to be identified and reported to Counsel as significant. This report also identifies cases likely to have postpetition trust fund or income tax pyramiding, assuming a large proportion of bankruptcy filers who owe prior to bankruptcy have the likelihood of owing significant dollar amounts after bankruptcy is filed., 148889=Correspondence/File Retention. Identify the GMs correspondence and file retention procedures to ensure they comply with Document 12990, Records and Information Management Record Control Schedules., 210171=Frequency of Use by Caseworker. Field Insolvency will work these weekly reports for cases in its inventory within five work days of receipt. The CIO will work required LTS reports for cases in its inventory. The reports must be worked in accordance with the instructions and time frames established in IRM 5.9.16.3,Litigation Transcript System., 241716=Purpose of Report. The LAMS Postpetition Case Listing lists both IMF and BMF postpetition liabilities found on master file. Although the LTS FIDUC transcripts identify pyramiding more promptly, the postpetition report gives a complete history of postpetition compliance and lists all the postpetition modules involved, be they IMF or BMF. IRM 5.9.12.8.3,LAMS Postpetition Case Listing provides information on generating and distributing this report., 111393=Monitoring trust fund ASEDs as long as the taxpayer is complying with the terms of a Chapter 11 plan (See IRM 5.9.8.10,Trust Fund Considerations in Chapter 11.);, 50605=IIP generates reports identifying cases in status 22 (ACS), status 24 (Federal Payment Levy Program - FPLP), status 60 (installment agreements), status 26 (field revenue officer), and status 71 (OIC). The CIO works all status reports except those pertaining to Chapter 9 and Chapter 15 cases. Cases that cannot be resolved by the CIO must be transferred to Field Insolvency for resolution. (See IRM 5.9.12.5.1,IIP Status Reports.), 183300=Form 6850 is the numerical representation of the employee's performance during the course of the evaluation period. It must be consistent with the employee's casework and evaluative documents prepared during the course of the evaluative period. You should ensure that the preparation of Form 6850 is in accordance with Article 12 of the 2012 National Agreement II. Base your appraisal of the employee on documented materials such as:, 254083=If the manager is running the report on 04/01/2013, they will use 10/01/2012 as the beginning date and 12/31/2012 as the end date., 105857=A TFRP ASED is generally three years from the date a return is filed or the due date of the return, whichever is later, for quarterly periods involving trust fund 941s, collected excise taxes, and annual 943s and 944s with trust fund tax. (See IRM 5.19.14.1.5,Trust Fund Recovery Penalty Statute of Limitations.), 270199=Purpose of Report. The 1714 Letter Report lists all cases where a letter requesting return information has been sent. The letter explains the debtor's duties under the Bankruptcy Code to file returns and the consequences of non-compliance which may include dismissal or conversion., 114420=Should a CSED expire without prior approval, follow procedures in IRM 5.1.19.5.5, Collection Statutes That Expire Without Prior Approval. The memo should be prepared and routed as follows: a) Field Insolvency from group manager to Territory Manager, and, if warranted, to the Director. b) Centralized Insolvency from unit manager to Department Manager, and, if warranted, to the Operation Manager., 218766=Range of Uses. This report identifies closures for Chapters 7N, 12, and 13 as well as individual Chapter 11 cases filed on or after October 17, 2005., 62383=See IRM 5.9.8.11,Postpetition/Preconfirmation BMF Monitoring,IRM 5.9.8.11.1,Postpetition Debts - Chapter 11 Individuals,IRM 5.9.9.10,Monitoring Compliance, and IRM 5.9.10.9,Postpetition Tax Liabilities, for more information.}",
    "textBeforeTable": "The chart below lists actions which are \"Mandatory\" in bankruptcy case processing. The chart separates duties overseen by managers in Field Insolvency, overseen by managers at the CIO, and duties which are supervised by managers in both functions. The links to exhibits and IRM references cited within the chart provide cross references to report tools or IRM procedures for meeting those actions. When exceptions to these retention periods apply, the exceptions appear within the report exhibits found at the end of this IRM. Field Insolvency and CIO managers must establish controls to verify these reports are worked timely. Note: Annual reports are retained for two years Quarterly reports are retained for six months Monthly reports are retained for one quarter Weekly reports are retained for one month Minimum retention of completed reports be they optional or mandatory, unless specified otherwise by the Formal Retention Standards, for completed reports are as follows: As each case on a report is worked, the caseworker should document the AIS history if action is taken. No AIS documentation is required if no action is taken on an account. Each case on a report should be checked off when action has been completed and the history is documented. With Territory Manager's or Department Manager's approval, AIS reports may be",
    "textAfterTable": "Protect assessment statutes. See Exhibit 1.4.51-13. See Exhibit 1.4.51-18. Ensure timely responses to the Taxpayer Advocate. See IRM 5.9.3.8. Download ENS. See IRM 5.9.12-1. Respond to claim objections timely and follow-up. See Exhibit 1.4.51-22. Generate and work litigation transcripts. SeeExhibit 1.4.51-21. See Exhibit 1.4.51-11. Work IIP error reports and PIT reports. See IRM 5.9.12.5.2. Submit plan objection referrals timely and follow-up. See Exhibit 1.4.51-22. Generate and work Aged Case Report annually. See Exhibit 1.4.51-27. Work IIP status reports. See IRM 5.9.12.5.1. Address adequate protection when appropriate. See IRM 5.9.8.5. Work LAMS Not Found on AIS report. See Exhibit 1.4.51-23. Work LAMS Closed Case List. See Exhibit 1.4.51-16. Run IIP 2 (ADS). See IRM 5.9.12.6. File",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}