{
    "relation": [
        [
            "Round",
            "Day One",
            "Day One"
        ],
        [
            "Date",
            "Tue., Dec. 27",
            "Tue., Dec 27"
        ],
        [
            "Time",
            "6:00 p.m.",
            "8:00 p.m."
        ],
        [
            "Visitor",
            "Northern Freeze 43",
            "Fosston 42"
        ],
        [
            "Home",
            "East Grand Forks 60",
            "Crookston 65"
        ],
        [
            "Location",
            "Crookston High School, Crookston",
            "Crookston High School, Crookston"
        ]
    ],
    "pageTitle": "2011 Holiday Tournaments",
    "title": "",
    "url": "http://www.mngirlsbasketballhub.com/page/show/428429-2011-holiday-tournaments",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00171-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 594436415,
    "recordOffset": 594402733,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Crookston Holiday Tournament, Crookston (Dec. 27-28) Rogers High School, Rogers Forest Lake Anoka 7:00 p.m. Wed., Dec. 28 Championship Rogers High School, Rogers Rogers St. Francis 5:00 p.m. Wed., Dec. 28 Consolation Final Location Home Visitor Time Date Round Rogers High School, Rogers Rogers 46 Forest Lake 55 7:00 p.m. Tue., Dec 27 Semifinal 2 Rogers High School, Rogers Anoka 58 St. Francis 44 5:00 p.m. Tue., Dec. 27 Semifinal 1 Location Home Visitor Time Date Round Rogers Holiday Classic, Rogers (Dec. 27-28) Pelican Rapids High School, Pelican Rapids Lester Norman County East 5:30 p.m. Wed., Dec. 28 Championship Pelican Rapids High School, Pelican Rapids Rothsay Park Rapids 2:00 p.m. Wed., Dec. 28 Consolation Final Location Home Visitor Time Date Round Pelican Rapids High School, Pelican Rapids Rothsay 26 Lester Prairie 49 3:45 p.m. Tue., Dec 27 Semifinal 2 Pelican Rapids High School, Pelican Rapids",
    "textAfterTable": "Round Date Time Visitor Home Location Day Two Wed., Dec. 28 6:00 p.m. Fosston East Grand Forks Crookston High School, Crookston Day Two Wed., Dec. 28 8:00 p.m. Northern Freeze Crookston Crookston High School, Crookston Ogilvie Lions Holiday Tournament, Ogilvie (Dec. 27-28) Round Date Time Visitor Home Location Semifinal 1 Tue., Dec. 27 6:00 p.m. Cromwell 31 Zimmerman 57 Ogilvie High School, Ogilvie Semifinal 2 Tue., Dec 27 8:00 p.m. Wrenshall 41 Ogilvie 76 Ogilvie High School, Ogilvie Round Date Time Visitor Home Location Consolation Final Wed., Dec. 28 6:00 p.m. Cromwell Wrenshall Ogilvie High School, Ogilvie Championship Wed., Dec. 28 8:00 p.m. Zimmerman Ogilvie Ogilvie High School, Ogilvie Saint Agnes Holiday Tournament, St. Agnes (Dec. 28-29) Round Date Time Visitor Home Location Semifinal 1 Wed., Dec. 28 5:30 p.m. Minneapolis Edison 13 PACT Charter 59 St. Agnes High",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}