{
    "relation": [
        [
            "Binding:",
            "Subject:",
            "Topic:",
            "Year Printed:"
        ],
        [
            "Fine Binding",
            "Literature & Fiction",
            "Poetry",
            "1940"
        ],
        [
            "Special Attributes:",
            "Origin:",
            "Country/Region of Manufacture:",
            ""
        ],
        [
            "Illustrated, Signed, Numbered Limited Edition, with slip cover",
            "Canadian",
            "Canada",
            ""
        ]
    ],
    "pageTitle": "Brebeuf HIS Brethren E J Pratt Numbered Limited Edition Signed BY Author W Slip | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/Brebeuf-His-Brethren-E-J-Pratt-Numbered-Limited-Edition-Signed-by-Author-w-Slip-/161262081550?pt=Antiquarian_Collectible&hash=item258bf8160e",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00207-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 416184667,
    "recordOffset": 416133383,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{74832=Brebeuf and His Brethren by E.J. Pratt, published by The Macmillan Company of Canada Limited at St.Martin's House, Toronto, 1940 copyright by the publishers; this is the second and slightly revised limited edition, with a new epilogue, signed by the author and limited to 500 copies, of which this is number 76, printed in Canada by the Hunter-Ross Co. Limited. 9 1/2 by 6 1/2\" in two- toned ecru and maroon cloth hard cover with gilded embossed title on the front, in its original brown cardboard slip cover, ecru label with black lettered title affixed to the front, 66 pages with one fold out map at the end, and one black and white pressed wood block print: Site of Fort St Marie by Hary D. Wallace as frontispiece. Edwin John Dove Pratt (1882-1964) was considered by some to be the greatest Canadian poet in the 1st half of the 20th Century. This is his famous blank verse epic poem about St Jean de Brebeuf, one of the North American Jesuit Martyrs. Northrop Frye considered the work to be ' the foremost cultural tragic theme of the Canadian imagination'. Condition of the book: Near Mint, quite perfect- although the slip cover shows some wear and is slightly split on the top. A FREE prayer card of the North American Martyrs (see photo #6) is included with the purchase of the book.}",
    "textBeforeTable": "“Please see item description.” Seller Notes: Item specifics Seller assumes all responsibility for this listing. Shipping and payments Description current Report item - opens in a new window or tab Historical Album St Anne de Beaupre... C $58.64 Buy It Now Free shipping 161262081550 eBay item number:",
    "textAfterTable": "Veronicas Liturgical Art Visit my eBay store   Search Store Store Tour About Me and Contact Information Payment and Shipping Items On Sale Store Categories Store home Books Spiritual Studies Prayerbooks Non-Religious Books Bibles Religious Biography Polish Books Children's Books Bookends Candle Holders Crucifixes Holy Cards and Graphics Holy Water Fonts Medals Religious Frames Rosaries and Chaplets Statues and Figures Plates and Plaques Pins and Pendants Vestments & Religious Fabrics",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}