{
    "relation": [
        [
            "District",
            "Purba & Paschim Medinipur",
            "North 24 Parganas",
            "Birbhum",
            "Coochbehar",
            "Purulia"
        ],
        [
            "Hub",
            "Patachitra",
            "Pottery",
            "Leather & Kantha Stitch",
            "Jute / Sitalpati",
            "Tassar / Incense Sticks"
        ],
        [
            "Linkage",
            "Puja Pandal Decoration 2008, Selling of Patachitra at different places during Pujas, selling wares by attending 10 fairs in West Bengal, linkage with SASHA, different exhibitions, workshop etc.",
            "Linked to decorator house in Udaipur (Rajasthan), Sukanya, SASHA.",
            "Sukanya and SASHA for retailing leather products and Sukanya Weavers Studio retailing for Kantha Stitch.",
            "Attended fairs at Kolkata, Malda and Siliguri.Linked to Bally Fabs and Sukanya for jute products and SASHA for Sitalpati.",
            "Linked to Weavers Studio, Fab India and Industree for Tasar in Kolkata and with dealers in South India for Incense Sticks."
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://banglanatak.com/sectoreco.aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00293-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 23277903,
    "recordOffset": 23265528,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12523=Action research on forest based livelihoods,2007-2008, 10692=Development of Cluster with weaver SHGs,2008-2009, 16090=Jute Diversified Product,200-2005, 11539=Action research to set up rural business hubs,2007-2008, 13365=Leveraging economic activities of the Poor (LEAP),2007-2008, 16855=Ethnomagic Going Global,2009-2011, 17765=Ambedkar Hasthshilpa Vikas Yojana,2010-2015, 18563=Evaluation study of UNESCO South Asia Seal of Excellence Awards for Crafts,2010, 14287=Knowledge Aided Rural Marketing Initiatives (KARMI),2003-2005, 15229=Study to develop five year  district action plan for developing nonfarm sector,2005, 36004=Puja Pandal Decoration 2008, Selling of Patachitra at different places during Pujas, selling wares by attending 10 fairs in West Bengal, linkage with SASHA, different exhibitions, workshop etc.}",
    "textBeforeTable": "Networking and Linkages Established We have mobilized various stakeholders like fair trade organizations, retailers, associations of industries to partner with rural producers. Design development, workshops and visits to various markets and cultural fairs have led to improved awareness and exposure of market trends. MOU partners SASHA, Weavers Studio Centre for Arts, Project Sukanya, Marwari Traders-Udaipur, D K Enterprise New partners Caljute, Industree, Artisana, Fab India- SRC, Ballyfab, Metallogic, HSBC, Deutsche Bank Technology providers like Weavers Service Centre Facilitating Partners like SHEFAXIL Embroidery There are large number of women who do Kantha, Zari and other types of hand embroidery work at  Barasat-I, Basirhat-II and Deganga blocks of North 24 Parganas. However unlike the Kantha embroiders of Birbhum, quality is not of very high standard.    Lac Lac cultivation and lac business started in Balarampur area of Purulia during British rule and was known for quality and volume production.  Lac cultivation was thriving in the villages of Balarampur and Baghmundi in the 90s. The area has an abundance of Palash, Kusum and Kul trees",
    "textAfterTable": "Home | Sitemap | Contact Us | Careers | Feedback | Disclaimer | Copyright Notice © Copyright 2003 i-land informatics Limited . All Rights Reserved Technicals by Expectrum Solutions",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}