{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Catholic",
            "Other",
            "None"
        ],
        [
            "Adherents",
            "10,658",
            "644",
            "190",
            "-",
            "5,333"
        ],
        [
            "Congregations",
            "53",
            "5",
            "1",
            "1",
            "-"
        ]
    ],
    "pageTitle": "Benton, Tennessee (TN 37307) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Benton-Tennessee.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00225-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 374651883,
    "recordOffset": 374524585,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4870=According to our research of Tennessee and other state lists there were 14 registered sex offenders living in Benton, Tennessee as of July 30, 2015. The ratio of number of residents in Benton to the number of sex offenders is 96 to 1., 23646=Incorporated in 1915, 124868=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!}",
    "TableContextTimeStampAfterTable": "{32133=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.87. This is about average. Closest monitor was 9.8 miles away from the city center., 46354=2004 Presidential Elections Results, 42911=School Enrollment by Level of School (%) in 2013, 16117=On 4/3/1974, a category F4 tornado 25.1 miles away from the town center killed 4 people and injured 26 people and caused between $5,000,000 and $50,000,000 in damages., 15808=On 5/2/1953, a category F4 (max. wind speeds 207-260 mph) tornado 25.0 miles away from the Benton town center killed 4 people and injured 8 people and caused between $50,000 and $500,000 in damages., 46068=2000 Presidential Elections Results, 34307=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 9.03. This is about average. Closest monitor was 19.4 miles away from the city center., 30674=Carbon Monoxide (CO) [ppm] level in 2002 was 1.00. This is significantly worse than average. Closest monitor was 9.8 miles away from the city center., 33557=Particulate Matter (PM10) [µg/m3] level in 2012 was 18.4. This is about average. Closest monitor was 12.3 miles away from the city center., 61344=7.02% of this county's 2010 resident taxpayers moved to other counties in 2011 ($27,466 average adjusted gross income), 89604=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 88295=Total of 2 patent applications in 2008-2015., 30027=Air Quality Index (AQI) level in 2012 was 74.0. This is about average., 59524=7.24% of this county's 2011 resident taxpayers lived in other counties in 2010 ($31,368 average adjusted gross income), 46640=2008 Presidential Elections Results, 45782=1996 Presidential Elections Results, 31406=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 7.30. This is about average. Closest monitor was 9.8 miles away from the city center., 42513=Educational Attainment (%) in 2013, 47210=Graphs represent county-level data. Detailed 2008 Election Results, 32858=Ozone [ppb] level in 2012 was 31.0. This is about average. Closest monitor was 8.6 miles away from the city center., 46926=2012 Presidential Elections Results}",
    "textBeforeTable": "Religion statistics for Benton town (based on Polk County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Other fuel (0%) Fuel oil, kerosene, etc. (2%) Bottled, tank, or LP gas (10%) Electricity (87%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 2 Polk County: 1.28 / 10,000 pop. Tennessee: 1.99 / 10,000 pop. Number of convenience stores (with gas): 12 Polk County: 7.68 / 10,000 pop. State: 5.16 / 10,000 pop. Number of full-service restaurants: 8 Here: 5.12 / 10,000 pop. State: 6.56 / 10,000 pop. Adult diabetes rate: This county: 12.7% Tennessee: 11.4% Adult obesity rate: Polk County: 31.3% Tennessee: 30.2% Low-income preschool obesity rate: This county: 15.1% State: 13.5%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}