{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Looking to save money on loans. Unsure of what career path to follow. Not ready to leave home.",
            "Great low price, for great quality education",
            "An array of clubs and student run organizations to join. Weekly activity periods to help students become involved around campus.",
            "Very limited variety, but the food is still tasty!",
            "Non- Applicable",
            "Go in with a plan. If you are unsure of what you would like to pursue as a career, research, browse different websites, and ask for help.",
            "HCC is a very diverse school, in aspects of cultures, educational courses, and in the interests of the student body as a whole."
        ]
    ],
    "pageTitle": "Holyoke Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Holyoke-Community-College/reviews?_escaped_fragment_=/show/22974",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00263-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909736487,
    "recordOffset": 909696049,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{160096=© 2015, Cappex.com, LLC, 15001=anime club, radio club, soccer, softball, basketball, black/white, writing, and about 50 others you can find on their website. yet all the clubs happened at 12:00 on wednesday so you had to choose only one to stick with. there were always a bunch of raffles or sales the clubs would do in the hallways where you could get stuff., 25219=The program I am entering in for September is very competitive, only 22 out of 250 applicants made it. The building classes and gen eds are wonderful and move at a manageable pace, 46457=Holyoke Community College has a friendly and supportive environment. I graduated from HCC in 2005 and now am returning for the R.N. program. I wouldn't have chosen any where else!}",
    "textBeforeTable": "02/24/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 39 Alannah from Ware, MA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students HCC is great for students who do not know what to major in. The liberal arts program at HCC is a great start for any indecisive college student. Tips for prospective students Make sure to tour the campus before your classes start. Also, parking can get pretty ridiculous so leave your house early to get a good spot. Bang for the buck HCC is pretty affordable, financial aid helps though. Am enjoying being here HCC have great clubs to join and awesome events. Just recently the music majors had a Jazz concert for all to go. The environment is warm and friendly. I have made so many new friends from my classes. Am learning a lot The professors are great, every one I had were very helpful and taught well. I am a photography major and the photo professors are such special people, I am so happy I went to HCC first to learn from them. Every photography major there come out pros in the Dark Room when they leave. Login to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}