{
    "relation": [
        [
            "",
            "m (g)",
            "M (g/mol)",
            "n (mol)"
        ],
        [
            "2 NaSi",
            "2572",
            "51.08",
            "50.36"
        ],
        [
            "+ 5 H2O →",
            "2268",
            "18.015",
            "125.9"
        ],
        [
            "1 Na2Si3O5",
            "",
            "182.15",
            ""
        ],
        [
            "+ 5 H2",
            "253.8",
            "2.016",
            "125.9"
        ]
    ],
    "pageTitle": "Hydrogen Powered Bicycles \"Run on Water\" - ChemPRIME",
    "title": "",
    "url": "http://wiki.chemprime.chemeddl.org/index.php/Hydrogen_Powered_Bicycles_%22Run_on_Water%22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00049-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 266047299,
    "recordOffset": 266019734,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{92498=Suppose the 2572 g cannister of NaSi in Example 3 is completely depleted, which means completely converted to Na2Si2O5. What mass of the product results?, 88269=Suppose it is reasonable to carry about 5 pounds (2268 g) of water on a bicycle for \"fuel\". Calculate the mass of NaSi that needs to be supplied by a cartridge on the bicycle to completely react with the water., 94845=Now we can complete the table above by adding the amount of Na2Si2O5 (25.18 mol, half the amount of NaSi) and its mass, 4033 g (or about 8.9 lb). Will the bike have gained weight, since the cartridge went from 2572 g of NaSi to 4033 g of Na2Si2O5?, 89481== 2268 g/18.015 g/mol = 125.9 mol H2O}",
    "textBeforeTable": "These calculations can be organized as a table, with entries below the respective reactants and products in the chemical equation. You may verify the additional calculations that have been done to show the masses of hydrogen product that would be expected. We'll fill in the remaining spots below. Thus With practice this kind of problem can be solved in one step by concentrating on the units. The appropriate stoichiometric ratio will convert moles of H2O to moles of NaSi and the molar mass will convert moles of NaSi to grams of NaSi. A schematic road map for the one-step calculation can be written as This is a reasonably sized cartridge (about 5.67 lb). The mass of NaSi is =\\text{50.36 mol NaSi}\" src=\"/images/math/3/a/3/3a3b81fa9d556b38ccef91b95e9c8145.png\" /> The amount of H2 present is =\\frac{\\text{2 mol NaSi}}{\\text{5 mol H}_{\\text{2}}}\" src=\"/images/math/6/7/6/6765f0fd4aeb51707c24f6dd4c126be9.png\" />",
    "textAfterTable": "EXAMPLE 4 Suppose the 2572 g cannister of NaSi in Example 3 is completely depleted, which means completely converted to Na2Si2O5. What mass of the product results? The problem gives the mass of NaSi and asks for the mass of Na2Si2O5 that would result from it's complete reaction with water. Thinking the problem through before trying to solve it, we realize that the molar mass of NaSi could be used to calculate the amount of NaSi consumed. Then we need a stoichiometric ratio to get the amount of Na2Si2O5 produced. Finally, the molar mass of Na2Si2O5 permits calculation of the mass of Na2Si2O5. Symbolically nNaSi Now we can complete the table above by adding the amount of Na2Si2O5 (25.18 mol, half the amount of NaSi) and its mass, 4033 g (or about 8.9 lb). Will the bike have gained weight, since the cartridge went from 2572 g of NaSi to 4033 g of Na2Si2O5?",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}