{
    "relation": [
        [
            "",
            "SEC Registration Fee",
            "Auditor Fees and Expenses",
            "Legal Fees and Expenses",
            "EDGAR fees",
            "Transfer Agent Fees",
            "TOTAL"
        ],
        [
            "",
            "$",
            "$",
            "$",
            "$",
            "$",
            "$"
        ],
        [
            "",
            "10.91",
            "3,500.00",
            "2,500.00",
            "1,000.00",
            "1,000.00",
            "8,010.91"
        ]
    ],
    "pageTitle": "STARSTREAM ENTERTAINMENT, INC. - FORM S-1/A - January 28, 2013",
    "title": "",
    "url": "http://www.getfilings.com/sec-filings/130128/GELIA-GROUP-CORP_S-1.A/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00083-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 458159499,
    "recordOffset": 458093557,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{432885=As to indemnification for liabilities arising under the Securities Act of 1933, as amended, for a director, officer and/or person controlling Gelia Group, Corp., we have been informed that in the opinion of the Securities and Exchange Commission such indemnification is against public policy and unenforceable., 345065=     Our financial statements from inception to October 31, 2012, immediately follow:, 121745=The offering price and other terms and conditions relative to the Company\u0092s shares have been arbitrarily determined by us and do not bear any relationship to assets, earnings, book value or any other objective criteria of value. Additionally, as the Company was formed on August 20, 2012 and has only a limited operating history and no earnings, the price of the offered shares is not based on its past earnings and no investment banker, appraiser or other independent third party has been consulted concerning the offering price for the shares or the fairness of the offering price used for the shares, as such our stockholders may not be able to receive a return on their investment when they sell their shares of common stock., 437604=We issued the foregoing restricted shares of common stock to our sole officer and director pursuant to Section 4(2) of the Securities Act of 1933. He is a sophisticated investor, is our sole officer and director, and is in possession of all material information relating to us. Further, no commissions were paid to anyone in connection with the sale of the shares and general solicitation was not made to anyone., 315171=The following table sets forth certain information concerning the number of shares of our common stock owned beneficially as of January 28, 2013 by: (i) each person (including any group) known to us to own more than five percent (5%) of any class of our voting securities, (ii) our director, and or (iii) our officer.  Unless otherwise indicated, the stockholder listed possesses sole voting and investment power with respect to the shares shown., 349961=Statement of Stockholders\u0092 Equity\u0096  August 20, 2012 (inception) through  October 31, 2012, 17877=Tel. (702) 866-2500, 124050=The shares being offered are defined as a penny stock under the Securities and Exchange Act of 1934, as amended (the \u0093Exchange Act\u0094), and rules of the Commission. The Exchange Act and such penny stock rules generally impose additional sales practice and disclosure requirements on broker-dealers who sell our securities to persons other than certain accredited investors who are, generally, institutions with assets in excess of $4,000,000 or individuals with net worth in excess of $1,000,000 or annual income exceeding $200,000 ($300,000 jointly with spouse), or in transactions not recommended by the broker-dealer. For transactions covered by the penny stock rules, a broker dealer must make certain mandated disclosures in penny stock transactions, including the actual sale or purchase price and actual bid and offer quotations, the compensation to be received by the broker-dealer and certain associated persons, and deliver certain disclosures required by the Commission. Consequently, the penny stock rules may make it difficult for you to resell any shares you may purchase, if at all., 423114=On October 31, 2012 the Director loaned the Company $117 to pay for incorporation costs.  As of October 31, 2012, total loan amount was $117. The loan is non-interest bearing, due upon demand and unsecured., 458056=In accordance with the requirements of the Securities Act of 1933, this registration statement was signed by the following persons in the capacities and on the dates stated., 72951=Gelia Group, Corp. was founded in the State of Nevada on August 200, 2012. We are a development stage company and intend to provide 3D printing services. 3D printing is a process of making three dimensional solid objects from a digital model. We intend to use the net proceeds from this offering to develop our business operations (See \u0093Description of Business\u0094 and \u0093Use of Proceeds\u0094). To implement our plan of operations we require a minimum of $40,000 for the next twelve months as described in our Plan of Operations. We expect our operations to begin to generate revenues during months 8-12 after completion of this offering. However, there is no assurance that we will generate any revenue in the first 12 months after completion our offering or ever generate any revenue., 18847=If any of the securities being registered on this Form are to be offered on a delayed or continuous basis pursuant to Rule 415 under the Securities Act of 1933, please check the following box:  x, 41294=(1) In the event of a stock split, stock dividend or similar transaction involving our common stock, the number of shares registered shall automatically be increased to cover the additional shares of common stock issuable pursuant to Rule 416 under the Securities Act of 1933, as amended., 313423=On October 31, 2012, we issued a total of 4,000,000 shares of restricted common stock to Yulia Marach, our sole officer and director in consideration of $4,000. Further, Ms. Marach has advanced funds to us. As of October 31, 2012, Ms. Marach advanced us $117. Ms. Marach will not be repaid from the proceeds of this offering. There is no due date for the repayment of the funds advanced by Ms. Marach. Ms. Marach will be repaid from revenues of operations if and when we generate revenues to pay the obligation. There is no assurance that we will ever generate revenues from our operations. The obligation to Ms. Marach does not bear interest. There is no written agreement evidencing the advancement of funds by Ms. Marach or the repayment of the funds to Ms. Marach. The entire transaction was oral. Ms. Marach is providing us office space free of charge and we have a verbal agreement with Ms. Marach that, if necessary, she will loan the company funds to complete the registration process., 235110=From Inception on August 20, 2012 to October 31, 2012, 261090=On November 8, 2012 we have executed a Referral Agreement with Alexey Hramtsov, an independent contractor who is going to refer potential clients to us. The material terms of the Contract are the following:, 97091=The accompanying financial statements have been prepared assuming that the Company will continue as a going concern. For the period August 20, 2012 (date of inception) through October 31, 2012 we had a net loss of $133. As of October 31, 2012, the Company has not emerged from the development stage. Our independent auditor has expressed substantial doubt about our ability to continue as a going concern. In view of these matters, recoverability of any asset amounts shown in the accompanying financial statements is dependent upon our ability to begin operations and to achieve a level of profitability., 380600=For the period from inception (AUGUST 20, 2012) to OCTOBER 31, 2012, 340012=Regarding indemnification for liabilities arising under the Securities Act of 1933, which may be permitted to directors or officers under Nevada law, we are informed that, in the opinion of the Securities and Exchange Commission, indemnification is against public policy, as expressed in the Act and is, therefore, unenforceable., 462920=January 28, 2013   , 359917=OCTOBER 31, 2012, 95880=Our current operating funds are less than necessary to complete our intended operations in development of 3D printing business. We need the proceeds from this offering to start our operations as described in the \u0093Plan of Operation\u0094 section of this prospectus. As of October 31, 2012, we had cash in the amount of $3,984 and liabilities of $117. As of this date, we have no income and just recently started our operation. The proceeds of this offering may not be sufficient for us to achieve revenues and profitable operations. We need additional funds to achieve a sustainable sales level where ongoing operations can be funded out of revenues. There is no assurance that any additional financing will be available or if available, on terms that will be acceptable to us., 357747=50 S. Jones Blvd. Suite 202 Las Vegas, NV 89107 Phone: (888)727-8251 Fax: (888)782-2351, 436041=October 31, 2012, 354121=We have audited the accompanying balance sheets of Gelia Group Corp. (A Development Stage Company) as of October 31, 2012, and the related statements of operations, stockholders\u0092 equity, and cash flows for the period from inception on August 20, 2012 through October 31, 2012. Gelia Group Corp.\u0092s management is responsible for these financial statements. Our responsibility is to express an opinion on these financial statements based on our audits., 391008=For the period from inception (August 20, 2012) to October 31, 2012, 405358=The financial statements have been prepared on a going concern basis which assumes the Company will be able to realize its assets and discharge its liabilities in the normal course of business for the foreseeable future.  The Company has incurred a loss since inception resulting in an accumulated deficit of $133 as of October 31, 2012 and further losses are anticipated in the development of its business.  Accordingly, there is substantial doubt about the Company\u0092s ability to continue as a going concern.  , 355912=In our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of Gelia Group Corp. (A Development Stage Company) as of October 31, 2012, and the related statements of operations, stockholders\u0092 equity, and cash flows for the period from inception on August 20, 2012 through October 31, 2012 in conformity with accounting principles generally accepted in the United States of America., 384409=October 31, 2012, 130187=We will be required, pursuant to Section 404 of the Sarbanes-Oxley Act of 2002, to include in our annual report our assessment of the effectiveness of our internal control over financial reporting.  We expect to incur significant continuing costs, including accounting fees and staffing costs, in order to maintain compliance with the internal control requirements of the Sarbanes-Oxley Act of 2002. Development of our business will necessitate ongoing changes to our internal control systems, processes and information systems. If our business develops and grows, our current design for internal control over financial reporting will not be sufficient to enable management to determine that our internal controls are effective for any period, or on an ongoing basis. Accordingly, as we develop our business, such development and growth will necessitate changes to our internal control systems, processes and information systems, all of which will require additional costs and expenses., 357598=January 10, 2013, 348915=Statement of Operations \u0096 August 20, 2012 (inception) through  October 31, 2012, 13863=As filed with the Securities and Exchange Commission on January 28, 2013, 209742=Our cash balance is $3,984 as of October 31, 2012.  We believe our cash balance is not sufficient to fund our operations for any period of time.  We have been utilizing and may utilize funds from Yulia Marach, our Chairman and President, who has informally agreed to advance funds to allow us to pay for offering costs, filing fees, and professional fees.  As of October 31, 2012, Ms. Marach advanced us $117. Ms. Marach, however, has no formal commitment, arrangement or legal obligation to advance or loan funds to the company. In order to implement our plan of operations for the next twelve month period, we require a minimum of $40,000 of funding from this offering. Being a development stage company, we have very limited operating history. After twelve months period we may need additional financing. We do not currently have any arrangements for additional financing. Our principal executive offices are located at Klenovy Blvd, 6-7, Moscow, Russia 115470. Our phone number is (702) 605-4165., 273900=Yulia Marach has acted as our President, Treasurer, Secretary and sole Director since our incorporation on August 20, 2012. Ms. Marach graduated from Baikal National University of Economics and Law in 2004. She obtained a bachelor degree in Computer Science and Services. In 2007-2010 Ms. Marach worked in TranceConteiner Company as an IT specialist. Since November 2010, she has been working as a chief specialist of IT department in Trancegroupe AC, a freight cargo company. Ms. Marach intends to devote 15 hours a week of her time to planning and organizing activities of Gelia Group, Corp. Once we expand operations, and are able to attract more customers to purchase our product, Ms. Marach has agreed to commit more time as required. Because Ms. Marach will only be devoting limited time to our operations, our operations may be sporadic and occur at times which are convenient to her. As a result, operations may be periodically interrupted or suspended which could result in a lack of revenues and a cessation of operations., 347921=Balance Sheet \u0096 October 31, 2012, 74714=From inception until the date of this filing, we have had limited operating activities.  Our financial statements from inception (August 20, 2012) through October 31, 2012, reports no revenues and a net loss of $133. Our independent registered public accounting firm has issued an audit opinion for Gelia Group, Corp. which includes a statement expressing substantial doubt as to our ability to continue as a going concern. To date, we have developed our business plan and entered into a Referral Agreement with Alexey Hramtsov, an independent contractor on November 8, 2012., 322329=(1) A beneficial owner of a security includes any person who, directly or indirectly, through any contract, arrangement, understanding, relationship, or otherwise has or shares: (i) voting power, which includes the power to vote, or to direct the voting of shares; and (ii) investment power, which includes the power to dispose or direct the disposition of shares. Certain shares may be deemed to be beneficially owned by more than one person (if, for example, persons share the power to vote or the power to dispose of the shares).  In addition, shares are deemed to be beneficially owned by a person if the person has the right to acquire the shares (for example, upon exercise of an option) within 60 days of the date as of which the information is provided.  In computing the percentage ownership of any person, the amount of shares outstanding is deemed to include the amount of shares beneficially owned by such person (and only such person) by reason of these acquisition rights.  As of January 28, 2013, there were 4,000,000 shares of our common stock issued and outstanding., 41925=THE REGISTRANT HEREBY AMENDS THIS REGISTRATION STATEMENT ON SUCH DATE OR DATES AS MAY BE NECESSARY TO DELAY ITS EFFECTIVE DATE UNTIL THE REGISTRANT SHALL FILE A FURTHER AMENDMENT WHICH SPECIFICALLY STATES THAT THIS REGISTRATION STATEMENT SHALL THEREAFTER BECOME EFFECTIVE IN ACCORDANCE WITH SECTION 8(A) OF THE SECURITIES ACT OF 1933, OR UNTIL THE REGISTRATION STATEMENT SHALL BECOME EFFECTIVE ON SUCH DATE AS THE COMMISSION, ACTING PURSUANT TO SECTION 8(A), MAY DETERMINE., 446587=(4) That, for the purpose of determining liability under the Securities Act of 1933 to any purchaser:, 53647=SUBJECT TO COMPLETION, DATED JANUARY 28, 2012, 412538=As of October 31, 2012 the Company has not issued any stock-based payments to its employees., 404680=GELIA GROUP, CORP. (the \u0093Company\u0094) was incorporated under the laws of the State of Nevada on August 20, 2012 and intends to provide 3D printing services. The Company is in the development stage as defined under Financial Accounting Standards Board (\u0093FASB\u0094) Accounting Standards Codification (\u0093ASC\u0094) 915-205 \"Development-Stage Entities.\u0094 Since inception through October 31, 2012 the Company has not generated any revenue and has accumulated losses of $133., 17662= 2360 CORPORATE CIRCLE, STE. 400, 407363=The Company's bank accounts are deposited in insured institutions. The funds are insured up to $250,000. At October 31, 2012 the Company's bank deposits did not exceed the insured amounts., 100541=We have accrued net losses of $133 for the period from our inception on August 20, 2012 to October 31, 2012, and have no revenues as of this date. Our future is dependent upon our ability to obtain financing and upon future profitable operations in development of 3D printing business. Further, the finances required to fully develop our plan cannot be predicted with any certainty and may exceed any estimates we set forth. If we fail to raise sufficient capital when needed, we will not be able to complete our business plan. As a result we may have to liquidate our business and you may lose your investment. You should consider our independent registered public accountant\u0092s comments when determining if an investment in Gelia Group, Corp. is suitable., 451794=Pursuant to the requirements of the Securities Act of 1933, the registrant has duly caused this registration statement to be signed on its behalf by the undersigned, thereunto duly authorized in the City of Moscow, Russia on January 28, 2013., 420433=2012, 344767=Our fiscal year end is October 31. We will provide audited financial statements to our stockholders on an annual basis; the statements will be prepared by us and audited by Seale and Beers, CPA\u0092s, 441904=   Referral agreement with, dated November 8, 2012 *, 387141=Balance as of  October 31, 2012, 410124=The Company\u0092s policy regarding advertising is to expense advertising when incurred. The Company incurred advertising expense of $0 during the period ended October 31, 2012., 418769=The valuation allowance for deferred tax assets as of October 31, 2012 was $47. In assessing the recovery of the deferred tax assets, management considers whether it is more likely than not that some portion or all of the deferred tax assets will not be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income in the periods in which those temporary differences become deductible. Management considers the scheduled reversals of future deferred tax assets, projected future taxable income, and tax planning strategies in making this assessment. As a result, management determined it was more likely than not the deferred tax assets would not be realized as of October 31, 2012., 129948=WE MAY BE EXPOSED TO POTENTIAL RISKS AND SIGNIFICANT EXPENSES RESULTING FROM THE REQUIREMENTS UNDER SECTION 404 OF THE SARBANES-OXLEY ACT OF 2002., 423607=The Company has evaluated subsequent events from October 31, 2012 through the date the financial statements were available to be issued and has determined that there are no items to disclose., 241368=Gelia Group, Corp. was incorporated in the State of Nevada on August 20, 2012 and established a fiscal year end of October 31. We do not have revenues, have minimal assets and have incurred losses since inception. We are a development-stage company formed to commence operations in the business of 3D printing. We have recently started our operation. As of today, we have developed our business plan, and executed a Referral Agreement with Alexey Hramtsov, dated November 8, 2012. We maintain our statutory registered agent's office at 2360 Corporate Circle, Suite 400, Henderson, Nevada 89074. Our business office is located at Klenovy Blvd, 6-7, Moscow, Russia 115470. Our telephone number is (702) 605-4165 ., 467179=   Referral agreement, dated November 8, 2012 *, 406676=The Company uses the accrual basis of accounting and accounting principles generally accepted in the United States of America (\u0093GAAP\u0094 accounting).  The Company has adopted October 31 fiscal year end., 334249=Our authorized capital stock consists of 75,000,000 shares of common stock, par value $0.001 per share. As of January 28, 2013, there were 4,000,000 shares of our common stock issued and outstanding those were held by one registered stockholder of record and no shares of preferred stock issued and outstanding. Our sole officer and director, Yulia Marach owns 4,000,000., 414499=As of October 31, 2012 the Company had net operating loss carry forwards of $133 that may be available to reduce future years\u0092 taxable income through 2032. Future tax benefits which may arise as a result of these losses have not been recognized in these financial statements, as their realization is determined not likely to occur and accordingly, the Company has recorded a valuation allowance for the deferred tax asset relating to these tax loss carry-forwards., 236158=As of October 31, 2012, the Company had $3,984 cash and our liabilities were $117, comprising $117 owed to Yulia Marach, our sole officer and director. Significant amounts of the Company\u0092s cash and current assets will be located offshore. The available capital reserves of the Company are not sufficient for the Company to remain operational., 373726=For the period from inception (August 20, 2012) to October 31,  2012, 244276=3. Execution a Referral Agreement with Alexey Hramtsov, an independent contractor, dated November 8, 2012., 447936=(5) That, for the purpose of determining liability of the registrant under the Securities Act of 1933 to any purchaser in the initial distribution of the securities: The undersigned registrant undertakes that in a primary offering of securities of the undersigned registrant pursuant to this registration statement, regardless of the underwriting method used to sell the securities to the purchaser, if the securities are offered or sold to such purchaser by means of any of the following communications, the undersigned registrant will be a seller to the purchaser and will be considered to offer or sell such securities to such purchaser:, 449883=Insofar as indemnification for liabilities arising under the Securities Act of 1933 (the \u0093Act\u0094) may be permitted to our directors, officers and controlling persons pursuant to the provisions above, or otherwise, we have been advised that in the opinion of the SEC such indemnification is against public policy as expressed in the Securities Act, and is, therefore, unenforceable., 433506=Since inception, the Registrant has sold the following securities that were not registered under the Securities Act of 1933, as amended., 118874=We will remain an \u0093emerging growth company\u0094 for up to five years, or until the earliest of (i) the last day of the first fiscal year in which our total annual gross revenues exceed $1 billion, (ii) the date that we become a \u0093large accelerated filer\u0094 as defined in Rule 12b-2 under the Securities Exchange Act of 1934, which would occur if the market value of our ordinary shares that is held by non-affiliates exceeds $700 million as of the last business day of our most recently completed second fiscal quarter or (iii) the date on which we have issued more than $1 billion in non-convertible debt during the preceding three year period., 445897=(2) That, for the purpose of determining any liability under the Securities Act of 1933, each such post-effective amendment shall be deemed to be a new registration statement relating to the securities offered therein, and the offering of such securities at that time shall be deemed to be the initial bona fide offering thereof., 98667=We were incorporated on August 20, 2012 and to date have been involved primarily in organizational activities.  We have commenced limited business operations. Accordingly, we have no way to evaluate the likelihood that our business will be successful.  Potential investors should be aware of the difficulties normally encountered by new companies and the high rate of failure of such enterprises.  The likelihood of success must be considered in light of the problems, expenses, difficulties, complications and delays encountered in connection with the operations that we plan to undertake. These potential problems include, but are not limited to, unanticipated problems relating to the ability to generate sufficient cash flow to operate our business, and additional costs and expenses that may exceed current estimates. We anticipate that we will incur increased operating expenses without realizing any revenues. We expect to incur significant losses into the foreseeable future. We recognize that if the effectiveness of our business plan is not forthcoming, we will not be able to continue business operations. There is no history upon which to base any assumption as to the likelihood that we will prove successful, and it is doubtful that we will generate any operating revenues or ever achieve profitable operations. If we are unsuccessful in addressing these risks, our business will most likely fail. , 414004=The Company has 75,000,000 common shares authorized with a par value of $ 0.001 per share. On October 31, 2012, the Company issued 4,000,000 shares of its common stock at $0.001 per share for total proceeds of $4,000., 90530=(Inception) to October 31, 2012 ($), 131264=In the future, if we fail to complete the annual Section 404 evaluation in a timely manner, we could be subject to regulatory scrutiny and a loss of public confidence in our internal controls. In addition, any failure to implement required new or improved controls, or difficulties encountered in their implementation, could harm our operating results or cause us to fail to meet our reporting obligations. However, as an \u0093emerging growth company,\u0094 as defined in the JOBS Act, our independent registered public accounting firm will not be required to formally attest to the effectiveness of our internal control over financial reporting pursuant to Section 404 of the Sarbanes-Oxley Act of 2002 until the later of the year following our first annual report required to be filed with the SEC, or the date we are no longer an emerging growth company. At such time, our independent registered public accounting firm may issue a report that is adverse in the event it is not satisfied with the level at which our controls are documented, designed or operating., 161967=As of October 31, 2012, the net tangible book value of our shares of common stock was $3,867 or approximately $0.001 per share based upon 4,000,000 shares outstanding., 242191=From inception until the date of this filing we have had limited operating activities, primarily consisting of the incorporation of our company and the initial equity funding by our sole officer and director.  We received our initial funding of $4,000 through the sale of common stock to Yulia Marach, our sole officer and director, who purchased 4,000,000 shares at $0.001 per share.  Our financial statements from inception on August 20, 2012 through our first fiscal period ended October 31, 2012 report no revenues and a net loss of $133.  Our independent auditor has issued an audit opinion for our Company which includes a statement expressing substantial doubt as to our ability to continue as a going concern., 84459=October 31, 2012 ($), 90418=Accumulated From August 20, 2012, 16503=68-0682786, 239343=Management believes that current trends toward lower capital investment in start-up companies, volatility in Internet market pose the most significant challenges to the Company\u0092s success over the next year and in future years.  Additionally, the Company will have to meet all the financial disclosure and reporting requirements associated with being a publicly reporting company. The Company\u0092s management will have to spend additional time on policies and procedures to make sure it is compliant with various regulatory requirements, especially that of Section 404 of the Sarbanes-Oxley Act of 2002.  This additional corporate governance time required of management could limit the amount of time management has to implement is business plan and impede the speed of its operations., 83259=The tables and information below are derived from our audited financial statements for the period from August 20, 2012 (Inception) to October 31, 2012.  , 419620=Reconciliation between the statutory rate and the effective tax rate is as follows at October 31, 2012:, 415905=2012, 351022=Statement of Cash Flows \u0096  August 20, 2012 (inception) through  October 31, 2012, 283009=The following tables set forth certain information about compensation paid, earned or accrued for services by our Executive Officer from inception on August 20, 2012until October 31, 2012:, 415076=Components of net deferred tax assets, including a valuation allowance, are as follows at October 31, 2012., 292940=The following table sets forth director compensation as of October 31, 2012:, 235289=During the period we incorporated the company, prepared a business plan and executed a Referral Agreement with Alexey Hramtsov, an independent contractor dated November 8, 2012. Our loss since inception is $133. We have not meaningfully commenced our proposed business operations and will not do so until we have completed this offering., 14740=REGISTRATION STATEMENT UNDER THE SECURITIES ACT OF 1933, 289145=August 20, 2012 to October 31, 2012}",
    "textBeforeTable": " (Exact name of registrant as specified in its charter) GELIA GROUP, CORP. REGISTRATION STATEMENT UNDER THE SECURITIES ACT OF 1933 FORM S-1 Amendment #1 to Washington, D.C. 20549 SECURITIES AND EXCHANGE COMMISSION UNITED STATES As filed with the Securities and Exchange Commission on January 28, 2013 Registration No. ___________________ (adsbygoogle = window.adsbygoogle || []).push({}); @media(min-width: 800px) { .sec-filings-responsive-top { width: 728px; height: 90px; } } @media(min-width: 500px) { .sec-filings-responsive-top { width: 468px; height: 60px; } } #ad-top { margin-top: 5px; } .sec-filings-responsive-top { width: 320px; height: 50px; }",
    "textAfterTable": "If this form is filed to register additional securities for an offering pursuant to Rule 462(b) under the Securities Act, check the following box and list the Securities Act registration statement number of the earlier effective registration statement for the same offering:   ¨ If this form is a post-effective registration statement filed pursuant to Rule 462(c) under the Securities Act, check the following box and list the Securities Act registration statement number of the earlier effective registration statement for the same offering:   ¨ If this form is a post-effective registration statement filed pursuant to Rule 462(d) under the Securities Act, check the following box and list the Securities Act registration statement number of the earlier effective registration statement for the same offering:  ¨ Indicate by check mark whether the registrant is a large accelerated filer, an accelerated filer, a non-accelerated filer, or a smaller reporting company.  See the definitions of \u0093large accelerated filer,\u0094 \u0093accelerated filer\u0094 and \u0093smaller reporting company\u0094 in Rule 12b-2 of the Exchange Act. (check one): Large accelerated filer ¨      Accelerated filer ¨       Non-accelerated filer     ¨       Smaller reporting company    x (Do not check if a smaller reporting company) CALCULATION OF REGISTRATION FEE  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}