{
    "relation": [
        [
            "First Name",
            "Martin",
            "Brian",
            "Steven"
        ],
        [
            "Last Name",
            "Hight",
            "Pallasch",
            "Fier"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=67A4CC59-2F39-43B7-B903-0BAEE65E17E2&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00121-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 233677312,
    "recordOffset": 233669110,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 44292=HR 2067 Good Samaritan Protection for Construction, Architectural, and Engineering Volunteers Act, 56050=HR 2701, Transportation Energy Security and Climate Change Mitigation Act of 2007 S. 775, National Infrastructure Improvement Act of 2007 HR 1098/ HR. 3224, Dam Rehabilitation and Repair Act of 2007 S. 294, Passenger Rail Investment and Improvement Act of 2007 HR 401, National Capital Transportation Amendments Act of 2007 S. 1125, The Freight Rail Infrastructure Capacity Expansion Act S. 2238 Dam Rehabilitation and Repair Act of 2007 S. 1926/ H.R. 3401 National Infrastructure Bank Act of 2007 H.R. 3999, National Highway Bridge Reconstruction and Inspection Act HR 3538/HR 3398 National Infrastructure Improvement Act of 2007 H.R. 5161 Green Transportation Infrastructure Research and Technology Transfer Act H.R. 1195, SAFETEA-LU Technical Corrections Act of 2008 H.R., Restoration of the Highway Trust Fund Balance ASCE's Report Card for America's Infrastructure, 40257=HR 2067 Good Samaritan Protection for Construction, Architectural, and Engineering Volunteers Act Procurement Reform S. 680, Accountability in Government Contracting Act of 2007, 52075=HR 2480, Gas Price Relief Act of 2007 HR 2448, Emergency Gas Price Relief Act of 2007 HR 1023, Withholding Tax Relief Act of 2007 Federal Motor Fuels Tax HR 3056, Tax Collection Responsibility Act of 2007 HR 1870, Contractor Tax Enforcement Act S. 777, Withholding Tax Relief Act of 2007 S. 1300 Aviation Investment and Modernization Act of 2007 (aviation taxes) HR 288, FAA Reauthorization Act of 2007 (aviation taxes) S. 3162 Made in the USA Tax Act (withholding) HR 6327, Federal Aviation Administration Extension Act of 2008 H.R., Restoration of the Highway Trust Fund Balance HR 5995, Gas Tax Relief and Earmark Moratorium Act of 2008 S. 3335, Jobs, Energy, Families, and Disaster Relief Act of 2008, 14550=HR 2881 Federal Aviation Administration Act of 2007 S. 1300 Federal Aviation Administration Act of 2007 Funding for Aviation Trust Fund Reauthorization of Aviation Improvement Program HR 6327, Federal Aviation Administration Extension Act of 2008, 12306=HR 2419 Farm, Nutrition, and Bioenergy Act of 2007 Reauthorization of Small Watershed Dam Rehabilitation Acts ASCE's Report Card for America's Infrastructure, 34526=Water Resources Development Act of 2008 HR 720, Water Quality Financing Act of 2007 HR 2421, Clean Water Restoration Act of 2007 HR 569, Water Quality Investment Act of 2007, HR 135 Twenty-First Century Water Commission Act of 2007 S. 775 The National Infrastructure Improvement Act of 2007 S. 1870 Clean Water Restoration Act of 2007 HR 1098/ HR 3224 Dam Rehabilitation and Repair Act of 2007 S. 2238 Dam Rehabilitation and Repair Act of 2007 HR 2701 Transportation Energy Security and Climate Change Mitigation Act of 2007 HR 2407 National Hurricane Research Initiative Act of 2007 S.931 National Hurricane Research Initiative Act of 2007 S. 1766 Low Carbon Economy Act of 2007 HR 1587, National Levee Safety Program Act of 2007 S. 2191, America's Climate Security Act of 2007 S. 1926/H.R. 3401 National Infrastructure Bank Act of 2007 H.R. 3221 New Direction for Energy Independence, National Security, and Consumer Protection Act H.R. 5336 Brownfields Reauthorization Act of 2008 (Introduced in House) H.R. 5161 Green Transportation Infrastructure Research and Technology Transfer Act Water Infrastructure Funding HR 6065, Green Schools Act HR 6109, Pre-Disaster Mitigation Act of 2008 S. 3175, The Pre-Disaster Mitigation Reauthorization bill (Stafford Act) HR 7159 National Windstorm Impact Reduction Reauthorization Act S. 3638 National Windstorm Impact Reduction Reauthorization Act S. 2842 Aging Water Infrastructure and Maintenance Act of 2008 H.R. 6658, Disaster Response, Recovery, and Mitigation Enhancement Act of 2008 (Stafford Act) S. 3500 Clean Water Act State Revolving Loan Fund & the Safe Drinking Water Act of 2008 ASCE's Report Card for America's Infrastructure, 24078=Water Resources Development Act of 2008 H.R. 720 Water Quality Financing Act of 2007 HR 2421, Clean Water Restoration Act of 2007 HR 569, Water Quality Investment Act of 2007, HR 135 Twenty-First Century Water Commission Act of 2007 S. 775 The National Infrastructure Improvement Act of 2007 S. 1926/H.R. 3401National Infrastructure Bank Act of 2007 H.R. 3401 National Infrastructure Bank Act of 2007 S. 1870 Clean Water Restoration Act of 2007 H.R. 2421 Clean Water Restoration Act of 2007 Water Infrastructure Funding S. 2842 Aging Water Infrastructure and Maintenance Act of 2008 HR 3538/HR 3398, National Infrastructure Improvement Act of 2007 S. 3500 Clean Water Act State Revolving Loan Fund & the Safe Drinking Water Act of 2008 ASCE's Report Card for America's Infrastructure, 48169=HR 2407 National Hurricane Research Funding Initiative S. 931 National Hurricane Research Funding Initiative HR 1867 The National Science Foundation Authorization Act of 2007 HR 1868, Technology Innovation and Manufacturing Stimulation Act of 2007 HR 4461, The Community Building Code Administration Grant Act of 2007 HR 2642, FY 2008 War Supplemental Funding Bill HR 7159 National Windstorm Impact Reduction Reauthorization Act S. 3638 National Windstorm Impact Reduction Reauthorization Act, 18629=H.Con. Res. 312 Fiscal Year 2009 Budget Resolution S.Con.Res.70 Fiscal Year 2009 Budget Resolution Agriculture, Rural Development, Food and Drug Administration and Related Agencies Appropriations FY 2009 Science, State, Justice, Commerce, and Related Agencies Appropriations FY 2009 Department of Homeland Security Appropriations FY 2009 Department of the Interior, Environment, and Related Agencies Appropriations FY 2009 Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations FY 2009 Transportation, Treasury, Housing and Urban Development, the Judiciary, the District of Columbia, and Independent Agencies Appropriations FY 2009 H.R. 2642 FY 2008 War Supplemental Funding Bill HR 6109, Pre-Disaster Mitigation Act of 2008 S. 3175, Pre-Disaster Mitigation Act Reauthorization bill (Stafford Act) HR 7159 National Windstorm Impact Reduction Reauthorization Act S. 3638 National Windstorm Impact Reduction Reauthorization Act H.R. 6658, Disaster Response, Recovery, and Mitigation Enhancement Act of 2008 (Stafford Act) HR 1424 Emergency Economic Stabilization Act FY 2009 Department of Homeland Security Appropriations Act Continuing Resolution ASCE's Report Card for America's Infrastructure, 28167=HR 325 Standards to Provide Educational Achievement for Kids (SPEAK) Act S. 224 Standards to Provide Educational Achievement for Kids (SPEAK) Act HR 362, 10,000 Teachers, 10 Million Minds Science and Math Scholarship Act ASCE's Report Card for America's Infrastructure HR 363 Sowing the Seeds Through Science and Engineering Research Act HR 364 The Advanced Research Projects Agency - Energy (ARPA-E) Act HR 2470, America's Better Classrooms Act of 2007 S. 912, America's Better Classrooms Act of 2007 HR 6314, Fulfilling the Potential of Women in Academic Science and Engineering Act HR 3021, 21st Century High - Performing Public Schools Facilities Act, 30950=HR 2701 Transportation Energy Security and Climate Change Mitigation Act of 2007 HR 364 The Advanced Research Projects Agency - Energy (ARPA-E) Act S. 2191 America's Climate Security Act of 2007 ASCE's Report Card of America's Infrastructure H.R. 3221 New Direction for Energy Independence, National Security, and Consumer Protection Act}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20001 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  BRIAN PALLASCH  2027897850  bpallasch@asce.org 5. Senate ID#  3413-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}