{
    "relation": [
        [
            "Name",
            "perms",
            "type",
            "group",
            "scope",
            "user"
        ],
        [
            "Description",
            "Permissions for the ACL. This can either be a single octal digit (e.g., 6 would indicate read and write, but not execute), or a symbolic mode including ‘r’, ‘w’, and ‘x’. You can include ‘-‘ for operations that are not permitted, but it’s not required. I.e., all of the following are identical: perms=\"5\" perms=\"rx\" perms=\"r-x\"",
            "ACL type",
            "Group the ACL applies to (with scope = group).",
            "ACL scope. This is omitted for type = default.",
            "User the ACL applies to (with scope = user)."
        ],
        [
            "Values",
            "string",
            "default | access",
            "string",
            "user | group | other",
            "string"
        ],
        [
            "Required",
            "Yes",
            "Yes",
            "No",
            "No",
            "No"
        ],
        [
            "Default",
            "None",
            "None",
            "None",
            "None",
            "None"
        ]
    ],
    "pageTitle": "Rules — Bcfg2 1.3.6 documentation",
    "title": "",
    "url": "http://docs.bcfg2.org/server/plugins/generators/rules.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 73069519,
    "recordOffset": 73047146,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 11 Jun 2015 20:39:27 GMT",
    "textBeforeTable": "Attributes: Rules. The top-level tag for concrete descriptions of entries in ¶ Rules element Rules Tag¶ Running bcfg2-lint will check your configuration specification for the presence of any mandatory attributes that are necessary for the entry specified. Tag Attributes in Rules¶ Group membership may be negated. assign to literal config if client is a member of group1 and group2 then  Nested groups are conjunctive (logical and).:  assign to literal config if client is a member of group1 then  Groups are used by the Rules plugin, along with host metadata, for selecting the Configuration Entity entries to include in the clients literal configuration. They can be thought of as: Usage of Groups in Rules¶ Each file in the Rules directory has a priority. This allows the same Entities to be served by multiple files. The priorities can be used to break ties in the case that multiple files serve data for the same Entity. For an entity specification to be included in the Literal configuration the name attribute from an Abstract Entity Tag (from Base or Bundler) must match the name attribute of an Entity",
    "textAfterTable": "name Package name. string Yes None type The package type, which determines which client driver will handle installation of this package. apk | ips | macport | opencsw | pacman | deb | rpm | blast | encap | sysv | ebuild | yum | freebsdpkg Yes None arch The architecture of the package to be installed. string No None bname The name of the package for installing (as opposed to the name when verifying) with the Blast and OpenCSW drivers. string No None file Package file name. Several other attributes (name, version) can be automatically defined based on regular expressions defined in the Pkgmgr plugin, which is the only plugin",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}