{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "If you take a look at any of the buildings, those are pretty unusual.",
            "Cincinnati parks, rec center, Ludlow business district.",
            "A tip for prospective students would to be proactive about your learning. Most professors are willing to work with you and don't know that you need extra help if you don't tell them.",
            "The University of Cincinnati provides excellent opportunities and academics in a healthful learning environment."
        ]
    ],
    "pageTitle": "University of Cincinnati (UC) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Cincinnati-Main-Campus/reviews?_escaped_fragment_=/show/34973",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00123-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 922313955,
    "recordOffset": 922155290,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{782158=Any athletic events with the sea of red and black are the place to be on the weekends. The student recreation center also has a variety of classes offered to students such as hip hop hustle, belly dancing, spinning, boxing, and even rock wall climbing. UC also hold a spring concert every year for students that headline artists such as Juicy J, T-Pain, Kendrick Lamar, Big Boi and many others., 760319=Rated the #1 best value in 2013 for a reason!, 860040=Although Cincinnati has a reputation for being dangerous, that is not the case on campus. I've always felt completely safe on campus, even at night. The UCPD has done an excellent job of keeping an eye out, but students have to be smart too. You shouldn't go wandering about on Jefferson by yourself carrying all of your valuables at 3:00 in the morning. Be smart, and stay on campus when in doubt, and you will be very safe!, 801796=When I went to the campus I was able to tour the entire campus and dorm. Which I chose to live in when I arrive in the fall of 2014. an unusual location on campus to me was how the dorms are right by the class building their not set apart. So making a choice of living is easy for the students., 510164=The greek Life is about 1000 to 2500 students so about 5%-8% of the total student population and the greek houses are right next to campus., 368939=There's things to do in there area. Be smart around the neighborhood. Don't wander around drunk at 3:00 in the morning., 735=Use office hours, study groups, learning communities, and learning center hours to your advantage. There are tons of resources at your disposal when you are a student at UC. Apply early -- even if you're not sure, because applying before December guarantees you a $2000/year scholarship. Go on a campus visit, but also wonder around campus on your own (during the school day) and try to drop in a couple classes (discreetly of course)., 42600=I am currently a college freshman at the University of Cincinnati for the 2010-2011 school year. At UC, I am studying interior design in the School of Design, Architecture, Art and Planning, also known as DAAP. The interior design program is ranked nationally as the best interior design school in the United States. As a result, I am learning leaps and bounds of new information and new techniques in this program. I am learning to think outside the box, to solve different kinds of problems, and to develop my creativity to a whole new level., 173368=I'm born and raised a UC Bearcat fan so I know I'll enjoy being here. Everyone is so energetic and so passionate about everything they're involved in. It's been my dream to march with the UC marching band., 575608=There is the nearly naked mile run every October. The football field is very unusual because it is one of the only fields in the nation that is totally accessible during the day and night to any student at any time because it sits directly in the heart of campus. You can use the stadium at anytime., 896511=© 2015, Cappex.com, LLC, 243809=try your best to get your applications in before december so you are eligible for more of the scholarship opportunities that aren't available later in the registration process.}",
    "textBeforeTable": "08/05/2009 Reviewer is A current student here. 22 out of 22 people found this review useful. 1 of 203 Nathan from Edgewood, KY Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Cincinnati-Main Campus Reviews University of Cincinnati-Main Campus › Ohio › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot I was delighted to find that most of the professors at UC really know their stuff and they are willing to help if you don't understand them on the first go. However, it certainly is useful to ask around about potential professors. I had a Chemistry lecture that was useless, but the TA really helped me stay on track. That being said, a lot of the TA's, especially in the math department, are really truly horrible. Office hours and learning centers (free!) are your friend if you get stuck with one of these TA's. Login to rate or flag the reviews Timothy from Cincinnati, OH 07/13/2009 Reviewer is A current student here. 11 out of 12 people found this review useful. 2 of 203 Categories Comments Great for these types of students Engineers DAAP (artistic outlooks) Coop (UC founded it) Finding a major. Tips for prospective students Be forward. Make friends join an learning community where you will be placed",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}