{
    "relation": [
        [
            "Payment method",
            "",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Venus Rising Celestial Amulet ON Linen Cord Necklace | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/Venus-Rising-Celestial-Amulet-on-linen-cord-necklace/201061844616?_trkparms=aid%3D444000%26algo%3DSOI.DEFAULT%26ao%3D1%26asc%3D20140107090229%26meid%3D6426700702605109761%26pid%3D100012%26prg%3D20140107090229%26rk%3D2%26rkt%3D10%26sd%3D191087567992",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00124-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 412229595,
    "recordOffset": 412184667,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at Ensure to contact us immediately if you aren't happy with an item! We gladly offer a 30 day money back guarantee! Return policy details The buyer is responsible for return postage costs. Money Back 30 days after the buyer receives it Refund will be given as Item must be returned within Return policy",
    "textAfterTable": "Seller's payment instructions Please email us should you have any issues with an item you receive and we will resolve any problems asap. See our shipping policies in item descriptions - we are happy to combine postage wherever possible. Make sure to email us for an invoice giving combined postage before checking out! Please remember to include your eBay ID if paying via bank deposit. Also, please note that some banks take up to four working days to send funds and this may delay receipt of your goods. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}