{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Alma has security everywhere. They are super nice. They are not looking to ruin fun they just make sure everyone is safe.",
            "Greek life is big at Alma. They aren't your stereotypical Greek lives though. aren't snooty or anything they hang out with just as many non-greeks that they do Greeks.",
            "Alma offers a club for anything and all the clubs put on tons of activities.",
            "Alma is great for students who I would say are intense. That really love what they're going into and are willing to put in extra work to be great at their job.",
            "The health and wellness center is kind of far from the dorms. If you live on South Campus it is a long walk to Saga.",
            "Alma is very expensive college but in all honesty it is worth it. You have so many opportunities here and you are basically guaranteed a job once you graduate with an Alma College degree.",
            "I like to go out with my friends on the weekends to the Greek or Sports houses. There is a movie theater in town and a place for bowling. Also we are a short drive from Mount Pleasant which offers a lot more things.",
            "Saga, our cafeteria is very hit or miss. Some days it is fabulous sometimes I want to cry. We also have a place called Joes where you order your food so that is nice.",
            "The dorms are actually really nice and you have a lot more space then you'd think but community bathrooms are kind of a bummer.",
            "I for once love to learn.",
            "Alma requires a lot more work than most colleges. My friends that attend Michigan State and Central Michigan average about an hour of homework a night where as I average 3. Also do not be afraid to talk to teachers, one time I went in for help and a teacher raised my grade for that reason.",
            "Alma College has amazing professors. It also has so many opportunities to travel and further your education which most schools I looked at while applying did not. At Alma College you are not just a number. The faculty knows you and cares about you. The only bad thing is the food is not the greatest."
        ]
    ],
    "pageTitle": "Alma College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Alma-College/reviews?_escaped_fragment_=/show/7869",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00146-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890189671,
    "recordOffset": 890145947,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{86525=As I said before, we have any club you can think of. I'm a part of a swing dancing club, a gamer's club, an interfaith club, and oftentimes jump in to see what else my friends are doing with their plethora of activities that they participate in. That doesn't even start on all the activities that the clubs put on, like Almacon that ACOG puts on in February. That alone is a massive thing that we're pretty proud of., 146368=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/28/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 27 Kristin from Charlotte, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Am learning a lot This school is a very academically challenging institution. They are well known for their academics and stand up to it in every aspect imaginable. Alma challenges your way of thinking and makes you become a more well rounded thinker. Critical thinking becomes a main component on campus, whether in class or with your residential life. The classes you take will help you become that critical thinker you need to be in life and the lifestyle on this campus helps challenge your new found abilities. Login to rate or flag the reviews Rachel from Stevensville, MI 06/29/2011 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 27 Categories Comments Great for these types of students Alma College is perfect for students looking for a smaller school where they can stand out and their unique achievements be recognized. It is a place for students who are ready to find a home away from home, and truly enthrall themselves in their college career.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}