{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Title",
            "The Covenant",
            "Hollywoodland",
            "Invincible",
            "The Protector",
            "Crank",
            "The Illusionist",
            "Little Miss Sunshine",
            "The Wicker Man",
            "Talladega Nights",
            "Barnyard"
        ],
        [
            "Weekend Gross",
            "$9,000,000",
            "$6,008,000",
            "$5,784,000",
            "$5,032,228",
            "$4,800,000",
            "$4,639,000",
            "4,425,000",
            "$4,120,000",
            "$3,000,000",
            "$2,586,000"
        ],
        [
            "Total Gross",
            "$9,000,000",
            "$6,008,000",
            "$45,654,000",
            "$5,032,000",
            "$19,859,000",
            "$18,089,000",
            "$41,646,000",
            "$17,490,000",
            "$142,181,000",
            "$66,885,000"
        ],
        [
            "Week #",
            "1",
            "1",
            "3",
            "1",
            "2",
            "4",
            "7",
            "2",
            "6",
            "6"
        ]
    ],
    "pageTitle": "The Covenant Rules The US Box Office | Movie News | Empire",
    "title": "",
    "url": "http://www.empireonline.com/news/story.asp?NID=19487",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00017-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438863471,
    "recordOffset": 438843885,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{58324=Posted by doobydoo at 13:06 on 11 September 2006 | Report This Post, 59150=Posted by sanchia at 10:36 on 11 September 2006 | Report This Post, 57360=Posted by 02PARSIM at 18:29 on 11 September 2006 | Report This Post}",
    "textBeforeTable": "This Monday morning, Renny Harlin will be riding around the streets of Los Angeles in a specially built car proclaiming, “I have the Number One film in America! I am officially best!” But it’ll be a hollow victory. For his latest movie – The OC-meets-Harry-Potter blend of teen angst and superpowers known as The Covenant – has won the weekend, but it did so with just $9 million dollars. It’s a win, but it’s the lowest chart topper since David Spade’s “comedy” Dickie Roberts: Former Child Star, which launched with $6.7 million three years ago. Let’s see if word of mouth has an effect next week… Also arriving this weekend is what everyone’s calling Ben Affleck’s comeback, Hollywoodland. With Adrien Brody and Diane Lane featuring in the mystery of legendary TV Superman star George Reeves’ death, the movie made $6 million and leaped several tall buildings to land in second place. The only other new opening this week was Tony Jaa’s follow-up to Ong Bak, The Protector. It’s faced some fan chatter about the US version arriving eviscerated courtesy of the Weinsteins, but it still looks like this second serving from Jaa isn’t exactly as popular as his first. The movie made a relatively low $5 million and turned up in fourth. The rest of the charts sees a few slips and some films hanging on nicely. Invincible",
    "textAfterTable": "Have Your Say To comment on this, and all articles, register for free or login now. World Exclusive: The New Wall-E Trailer This kicks shiny metal butt! Next Year's Oscars Host Announced DeGeneres to host 79th Academy Awards Your Comments Nothing remotely decent came out in the US this week so that's obviously the major reason. Also its the entering the Autumn stage where nothing comes out, we've got to wait until late October for the Box Office t really fire up again. More Posted by 02PARSIM at",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}