{
    "relation": [
        [
            "First Name",
            "M. Scott",
            "Rob"
        ],
        [
            "Last Name",
            "Vinson",
            "Green"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=FC3BAA0E-2F56-43DE-8171-2A1898C9B96C&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00073-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 221252406,
    "recordOffset": 221236012,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{23298=HR 2 Repealing the Job-Killing Health Care Law Act; HR 4 Comprehensive 1099 Taxpayer Protection and Repayment of Exchange Subsidy Overpayments Act; HR 1063 Strengthening Medicare and Repaying Taxpayers Act; S. 18 Small Business Paperwork Mandate Elimination Act; S. 19 American Liberty Restoration Act; S. 20 American Job Protection Act; S. 192 Repealing the Job-Killing Health Care Law Act; S. 312 Patients Freedom to Choose Act; Health Care Reform; Health Care Mandate Penalties; Employer/Employee Flexibility; Consumer-Directed Health Care; Health Insurance Exchanges; Medicare Secondary Payer Judgments; Comments on FDA's Suggested Questions & Answers for the Final Patient Protection & Affordable Care Act Section 4205 Guidance, 15979=S. 575 Debit Interchange Fee Study Act of 2011 to delay interchange swipe fee reform, all provisions; H.R.1081, Consumers Payment System Protection Act, all provisions, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 19959=Urge support for Flake-Stark Amendment No. 377 to the Continuing Resolution prohibiting funds for ethanol blender pumps and other ethanol infrastructure and storage facilities; Support Commodity Futures Trading Commission funding levels necessary to ensure transparency, stability and proper functioning of commodity derivatives markets; Comments on Commodity Futures Trading Commission proposal on position limits for derivatives, RIN 3038-AD15 and 3038-AD16; H.R. 1188, the Repeal Ethanol Subsidies Today Act, all provisions; support amendment to block EPA funds for implementation of rule allowing E15; Support the STOP Commodity Speculation Act (no bill number yet)., 38460=HR 572, Clean Ports Act of 2011 Oppose the bill; Highway Bill Reauthorization support reauthorization of highway bill to include a focus on freight policy, oppose new fees or taxes as a pay for; FMCSA Drivers Hours of Service proposed regulation oppose changes to current drivers hours of service regulations; Ocean Carrier Antitrust Immunity support efforts to remove antitrust immunity granted to ocean carriers under the Shipping Act., 34019=H.R.1265, To amend the Internal Revenue Code of 1986 to permanently extend the 15-year recovery period for qualified leasehold improvement property, qualified restaurant property, and qualified retail improvement property, all provisions; S.687, A bill to amend the Internal Revenue Code of 1986 to permanently extend the 15-year recovery period for qualified leasehold improvement property, qualified restaurant property, and qualified retail improvement property, all provisions. H.R. 1075, legislation to end the Volumetric Ethanol Excise Tax Credit, all provisions; S. 520, the VEETC Repeal Act, offered also as amendment no. 220 to S. 493, all provisions.}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20004 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  MALLORY DUNCAN  2027837971  duncanm@nrf.com 5. Senate ID#  28468-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}