{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very Safe. There is a bus that takes students to Notre Dame and a bus that drives around St. Mary's to pick up students anywhere.",
            "No greek life but Notre Dame dorms are like Greek Life. The whole school feels like a sorority.",
            "Notre Dame football! Football weekends are the best.",
            "Dining hall could use a tune up but it's not too bad.",
            "Great for girls who want to focus on studying during the week and then relax and party on the weekends.",
            "Courses are challenging but intellectually stimulating.",
            "Visit! You will know if Saint Mary's is for you if you visit. It's a place that feels like home in your heart.",
            "Saint Mary's is a great academic environment. The faculty is very supportive and interesting in the progress of their students. While the courses are challenging, it is a great intellectual environment that provides women with great skills for the future."
        ]
    ],
    "pageTitle": "Saint Mary's College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Saint-Marys-College/reviews?_escaped_fragment_=/show/105997",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00326-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897196687,
    "recordOffset": 897144193,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{56958=Saint Mary's College is a beautiful all-women's Catholic college located across the street for Notre Dame University and next door to Holy Cross College. There are currently around 1600 students, so the class sizes are small and the professors know their students. The school provides many opportunities for the women, such as a variety of majors, a large network to aid in job applications, and a chance to take classes at the other two schools., 195529=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/20/2009 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 person found this inaccurate. 1 of 38 Joan from Sharps Chapel, TN Check out reviews left by other students or leave your own review. You could win a free scholarship. Saint Mary's College Reviews Saint Mary's College › Indiana › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Great for these types of students This college is great for students who love to excel in school, but also for those students who need a little extra help in the classroom. Professors are really nice. Make sure to get their email though because that is the best way to get a hold of them. The small class sizes make it easy to talk amongst the class and since it is mainly girls, some feel more comfortable. Plus, you get to go to class in your pajamas!! Tips for prospective students I was a freshman last year and lived in Le Mans Hall, which is a dorm for any age student. To first year students I would recommend living in McCandless since it is primarily freshmen living there. You get to meet a whole bunch of freshman and it makes it easier. I regret not choosing to live there because I felt like I would have made a lot more friends. I know, I know, all the other dorms are so much more lovely, but in the end you will agree that you think it was one of the best decisions you could ever make. As for the classes, they are tough! Make sure you do your assigned reading. Don't be afraid to ask a professor for help either. They are more than willing to work with you on whatever issue you may be having.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}