{
    "relation": [
        [
            "Publisher",
            "Elsevier",
            "Springer’s Science + Business Media",
            "John Wiley & Sons",
            "Informa.plc"
        ],
        [
            "Revenue",
            "£2﻿b",
            "€866m",
            "$253",
            "£﻿145"
        ],
        [
            "Profit",
            "£724m﻿",
            "€294m",
            "$106",
            "£﻿47"
        ],
        [
            "Margin",
            "36%",
            "33.9%",
            "42%",
            "32.4%"
        ]
    ],
    "pageTitle": "News / Comments / A fistful of dollars: why corporate publishers have no place in scholarly communication - blogarchive.brembs.blog",
    "title": "",
    "url": "http://blogarchive.brembs.net/comment.php?comment.news.820",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00147-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 27584529,
    "recordOffset": 27568570,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Fri, 31 Jul 2015 00:58:51 GMT",
    "textBeforeTable": "great profit margins: website, 7,000 paid journal editors are working for the approx. 2,000 journals of Elsevier, while 970,000 unpaid board members, reviewers and authors, largely funded by the tax payer, are donating their time, brains and other valuable resources to the corporation.﻿ With hardly any labor costs to speak of and great value provided from outside for free by tax-funded researchers, it is not surprising hat corporate publishers sport Thus, according to their Library or researcher pays subscription fees to access article Publisher copy-edits manuscript and puts it online. Researchers pay page charges Researchers modify the manuscript Publisher's editor sends manuscript to other researchers who peer-review the manuscript at no cost to the publisher Researchers write manuscript Researchers generate data How can a private company be so isolated from the general economy? The reason is that they're largely funded by the tax payer and so far education and R&D budgets have been relatively spared. How do commercial publishers do their job? Here is a brief sketch of how a scholarly paper comes about: What is Elsevier's top priority, though, is making money. Like all scholarly publishers, Elsevier is thriving, despite global financial and economic crises in recent years: admitted to publishing a set of six fake journals, aimed to promote medical products and drugs",
    "textAfterTable": "On top of very small up front costs publishers increase subscription prices manifold beyond inflation: Quite obviously, with low costs and an ever increasing stream of tax funds burning holes in your pocket, you wonder how all the money could be invested to protect your shareholder value for the future. Therefore, commercial publishers: Buy access to elected representatives Use this access to lobby for protective legislation Pay full-time employees for government lobbying Support SOPA Discredit Open Access by hiring professional 'pit-bull' campaigners Lobby against Open Access at the US White House Comparing commercial with non-profit publishers shows how competition doesn't bring the price down in scholarly communication: non-profit publishers are providing a publishing service that is consistently half or less of what commercial publishers provide (see also here). Therefore, I am very skeptical of suggestions to transform the scholarly communication ecosystem into a service business. Given that commercial publishers have a proven track record of untrustworthiness, price-gouging and political interference, what would keep them from increasing their prices for the services they provide, just as they have increased subscription prices? No, the evidence is very clear, we need to rid the scholarly communication system from commercial publishers if we want to reduce or at least limit the burden on tax-payers:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}