{
    "relation": [
        [
            "Patent application number",
            "20100101564",
            "20110048234",
            "20130118482"
        ],
        [
            "Description",
            "SHOP-ASSEMBLED SOLAR RECEIVER HEAT EXCHANGER - A shop-assembled solar receiver heat exchanger having an arrangement of heat transfer surfaces and a vertical steam/water separator structurally and fluidically interconnected thereto. A vertical support structure is provided to support the vertical separator and the heat transfer surfaces. The vertical support structure is bottom supported, while the vertical steam/water separator and heat exchanger heat transfer surfaces are top supported from the vertical support structure. The vertical support structure provides structural support and rigidity for the heat exchanger and a means by which the heat exchanger can be picked up and lifted for placement at a desired location. A fabrication/transport/lifting fixture is provided which facilitates fabrication, assembly, transportation and erection of the heat exchanger from the shop to the field. The fixture supports two trunnion shafts attached to the support structure of the receiver. Lifting lugs would be located on the top end of the support structure. Upon arrival at the job site in the field, a crane lifts the heat exchanger receiver to vertical, rotating about the trunnion shafts on the fixture, and then lifts the heat exchanger receiver for placement at a desired location.",
            "SYSTEM AND METHOD FOR PROTECTION OF SCR CATALYST - The present invention relates generally to the field of emission control equipment for boilers, heaters, kilns, or other flue gas-, or combustion gas-, generating devices (e.g., those located at power plants, processing plants, etc.) and, in particular to a new and useful method and apparatus for preventing the plugging, blockage and/or contamination of an SCR catalyst. In another embodiment, the method and apparatus of the present invention is designed to protect an SCR catalyst from plugging and/or blockage from large particle ash that may be generated during combustion.",
            "HIGH EFFICIENCY SOLAR RECEIVER - A solar receiver includes a multi-sided central assembly with wing assemblies extending from corners thereof. The central assembly includes one-sided heat absorption panels, while the wing assemblies use two-sided heat absorption panels. Stiffener structures run across the exposed faces of the various heat absorption panels."
        ],
        [
            "Published",
            "04-29-2010",
            "03-03-2011",
            "05-16-2013"
        ]
    ],
    "pageTitle": "Steven P. - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/steven-p-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437494535,
    "recordOffset": 437457129,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Steven P. Iannacchione, Canal Fulton, OH US 09-11-2008 Configurable printer for different locations and methods of configuring a printer for different locations - A configurable printer for different locations and methods for configuring a printer for different locations are provided. The printer includes memory loaded with different versions of firmware. Each version of firmware may enable a different printer configuration for a corresponding location. The printer also includes an interface for accepting a signal from a control device. The signal may comprise instructions to the printer to load a particular version of the firmware that corresponds to the location of the control device. 20080218774 Published Description Patent application number Steven P. Hilsdorf, Willseyville, NY US 03-12-2009 Blow Molded Case and System for Creating Same - A blow molded case is disclosed generally comprising a double wall, blow molded base portion having inner and outer case walls, and a lid portion connected to the base portion such that the lid, when in a closed position, at least partly covers the inner case wall of the base portion, which accommodates a first object. The outer wall of the base portion has a hole for receiving a second object, such as a drawer or other receptacle. In certain embodiments, the hole is a punched hole, created by extending a punch through a sidewall of the base portion substantially perpendicular to the parting line thereof. In certain embodiments, the",
    "textAfterTable": "Patent applications by Steven P. Iannacchione, Canal Fulton, OH US Steven P. Kalalian, New York, NY US Patent application number Description Published 20080235262 DIGITAL FILE MANAGEMENT SYSTEM WITH FILE MAPPING FOR HIGH RESOLUTION AND OTHER IMAGES - Uploading high resolution or other digital assets includes searching a first directory in a web-enabled digital asset management system for one or more digital assets that have the same file name, but a different file extension or a different file type, as a corresponding digital asset in an external directory. A copy of the digital asset from the external directory is stored in a database with a link to the corresponding one or more digital assets in the first directory. 09-25-2008 20080235281 Digital File Management System With Unstructured Job Upload - Uploading digital assets from a source media directory into a web-based digital asset management system includes representing a structure of the source media directory, and the digital assets, as a XML object, and storing the XML object in a database. Based on the XML object, the source media directory structure and the digital assets can be displayed through a web-enabled user interface. 09-25-2008 20080235603",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}