{
    "relation": [
        [
            "Patent application number",
            "20090264623",
            "20110117112"
        ],
        [
            "Description",
            "SODIUM CHANNEL PROTEIN TYPE III ALPHA-SUBUNIT SPLICE VARIANT - The present invention is directed to a splice variant of a human sodium channel alpha subunit and methods and compositions for making and using the same.",
            "SODIUM CHANNEL PROTEIN TYPE III ALPHA-SUBUNIT SPLICE VARIANT - The present invention is directed to a splice variant of a human sodium channel alpha subunit and methods and compositions for making and using the same."
        ],
        [
            "Published",
            "10-22-2009",
            "05-19-2011"
        ]
    ],
    "pageTitle": "Mccormack, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/mccormack-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00247-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 449934959,
    "recordOffset": 449900850,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kenneth J. Mccormack, Raleigh, NC US //]]> BarDraw('2999658',['Patent applications by Kenneth Mccormack, Albany, OR US'],[[4,3,1,2]],['2007','2009','2010','2011'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2999658\" align=\"center\"></div> </div> <canvas id=\"bg2999658\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Kenneth Mccormack, Albany, OR US</p> <div class=\"bar2999658\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>07-21-2011</td> <td><a href=\"/patents/app/20110175999\">VIDEO SYSTEM AND METHOD FOR OPERATING SAME</a> - A method for operating a video system includes performing a visual surveillance tour of a predetermined control area with a pan/tilt/zoom (PTZ) camera. The method also includes recording at least one video image frame of the predetermined control area. The method further includes recording at least one coordinate value associated with a predetermined coordinate system. The method also includes transmitting each of the at least one video image frame and the at least one coordinate value to at least one storage device. The method further includes indexing the at least one video image frame as a function of the at least one coordinate value. The method also includes retrieving the at least one video image frame based on the at least one coordinate value and displaying the at least one video image frame on at least one video display device.</td> <td>20110175999</td> <tr> </tr> <td>06-23-2011</td> <td><a href=\"/patents/app/20110149072\">SURVEILLANCE SYSTEM AND METHOD FOR OPERATING SAME</a> - A method for operating a surveillance system includes performing a first portion of an automated visual surveillance tour of a predetermined control area by inducing movement of at least",
    "textAfterTable": "Patent applications by Kenneth J. Mccormack, Raleigh, NC US Kenneth John Mccormack, Raleigh, NC US Patent application number Description Published 20120283314 SODIUM CHANNEL PROTEIN TYPE III ALPHA-SUBUNIT SPLICE VARIANT - The present invention is directed to a splice variant of a human sodium channel alpha subunit and methods and compositions for making and using the same. 11-08-2012 Margaret A. Mccormack, Pittsburgh, PA US Patent application number Description Published 20090118590 MULTI-SENSOR SYSTEM, DEVICE, AND METHOD FOR DERIVING HUMAN STATUS INFORMATION - The invention is a wireless communications device, such as a cellular telephone, having sensors to generate data indicative of a physiological or contextual parameters of a user. A processor on the wireless communications device is adapted derive physiological state information of the user from the contextual or physiological parameters. The apparatus may include a central monitoring unit remote from the sensors for storing data and transmitting data to a recipient. 05-07-2009 20120059230 WEARABLE BODY MONITOR TO PROVIDE INDICATORS OF AN INDIVIDUAL - The invention is a system for detecting, monitoring, and reporting an individual's physiological or contextual status. The system works deriving a physiological or",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}