{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "its in the top 10 for safest campuses in the nation.",
            "none existent",
            "to many to go into but you can find anything.",
            "independent, ones that like small classes where the professors know your name.",
            "Prescott pray chapple is a good place to pray and is always open. freshman boys will most likely get hazed into NOSing. its a christian campus",
            "defiantly worth the money",
            "surf, swim, bike, run the cliffs. play video games. go to the many activities they have up on cafe lane on the weekends.",
            "not as good as home but better then most college campuses.",
            "the RAs are great and make sure you get to know people and make friends, its a small campus so you start to know everyone.",
            "it is a pretty challenging course load. it has been named in the top 50 educations worth the price, and its a pretty expensive school. they make sure that they get experts in the fields they teach.",
            "make sure you can stand being in a christian environment, and know you cant have cars as freshmen.",
            "Point Loma Nazarene University have some of the best professors that could be imagined. The campus is small and inviting, with a great view over the ocean. my favorite thing though is its Christ based atmosphere."
        ]
    ],
    "pageTitle": "Point Loma Nazarene University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Point-Loma-Nazarene-University/reviews?_escaped_fragment_=/show/1807",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00278-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895312371,
    "recordOffset": 895255339,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{58722=College is hard, but with the right support you can get through it! Learn time management before you go to school, waking up at 7:30 in the morning for high school was easy, but for some reason in College it's way harder. School work overloads but with the right organization and proper mindset you can successfully pass all your classes! My knowledge for you incoming freshman is, don't worry about the little things. God is there to provide and support you with everything. Just trust in His name and listen to what He has to tell you!, 34042=Apply for the Cal-Grant early, as well as completing your FAFSA before the end of February. March is the date when a lot of scholarships require you have your FAFSA completed in order to be recognized which includes the Cal-Grant. I missed the Cal-Grant this year because I was a week late on completing my FAFSA., 190304=The campus is located in a really nice suburban area, so crime isn't a big issue. However, since there is public property on campus, people are essentially free to come and go as the like until 12:00 am., 254445=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/20/2009 Reviewer is A current student here. 19 out of 19 people found this review useful. 1 of 53 Adam Corfman from San Diego, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Login to rate or flag the reviews cali girl 07/08/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 11 out of 11 people found this review useful. 3 of 53 Categories Comments Great for these types of students people who love the beach (a good surf), the LORD and having fun Tips for prospective students Interviews are not mandatory but if you want to impress make an interview and dress professionally Bang for the buck it is quite costly but it is a great school and you can meet great Godly people there so it is worth the money Will enjoy being here whats not to love, located on the cliffs of a San Diego Beach Will learn a lot Very challenging school",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}