{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Took on-line classes, so this is not applicable.",
            "Took on-line classes, so this is not applicable.",
            "Took on-line classes, so this is not applicable.",
            "Working adults and anyone in the military.",
            "Took on-line classes, so this is not applicable.",
            "Not the most expensive school, but not the cheapest either. On-line classes are great for working adults.",
            "Took on-line classes, so this is not applicable.",
            "Took on-line classes, so this is not applicable.",
            "Took on-line classes, so this is not applicable.",
            "All depends on how many classes you have at once. Very easy if you only have one class at a time.",
            "Schedule your time appropriately. Remember, if you are taking a class on-line, sometimes computer issues and power outages happen. It is better to submit your work earlier than later. Also do not depend on a teacher's help or input in-order to get your work completed.",
            "My experience with UMUC was very disappointing. Many of the teachers do not provide feedback or grade in a timely manner. If you can learn the material on your own, and not depend on a teacher, you will do great."
        ]
    ],
    "pageTitle": "University of Maryland-University College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Maryland-University-College/reviews?_escaped_fragment_=/show/44216",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00092-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899852791,
    "recordOffset": 899769493,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{487409=This year each credit hour is $212, and I think it's absolutely worth every one! I've already completed 16 credit hours since September and aim to double that by the time the summer semester starts. The flexibility of the class scheduling and the approachability of the professors combined with fairly rigorous academic standards and expectations makes this well worth the price of tuition., 463292=Depending on what class you take, the workload can go from 2 questions to a 1500 word essay a week. It can get crazy in there., 526879=© 2015, Cappex.com, LLC, 26485=The classes are how you make them. The classes are eight weeks long so everything that is normally in a semester from August to December is crammed, so you really have to be focused. The professors are very eager to help. Because we are not in a classroom setting, our basic way of communication is thru weekly conferences. Make sure you reply to whatever topic it is for the week. When the professor responds, respond back to him or her. You will receive assistance from an adviser, that will tell you what path you should take with what ever major you have., 289524=i am currently enrolled in the online 1 year mba program which started fall 2011. i researched a lot of universities before deciding on this one and am pleased with my decision so far., 170489=There are three divisions: USA, Europe and Asia. Each once may have different classes and can only be taken one at a time but change of division easy. If taking online classes and military, nothing except the type of classes may change. May sure to apply for transfer credit evaluation within the first two semesters to compensate for any documents the school may need. In addition to the latter, UMUC is very flexible is awarding transfer credit!}",
    "textBeforeTable": "07/16/2011 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 136 Erica from Ellicott City, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Login to rate or flag the reviews Jason from Upper Marlboro, MD 12/02/2011 Reviewer is A past student here. 3 out of 3 people found this review useful. 3 of 136 Categories Comments Great for these types of students *Willing to learn to quite a bit *Scheduling that can fit a busy lifestyle *Good financial aid system Tips for prospective students Great school, but it will hammer you if you are a student that studies poorly or is looking for a fast degree. Bang for the buck The cost of a UMUC education is quite reasonable. Also, UMUC has an abundance of ways to help gain financial aid through scholarships, grants, and loans. Did enjoy being here The course format was great in that I took both online and face-to-face courses. Every class fit in my internship at FDIC. The teachers were hit & miss because most participated in discussions",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}