{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2014-26185",
            "1625-AA01",
            "USCG-2014-0142"
        ]
    ],
    "pageTitle": "33 CFR Part 110 - ANCHORAGE REGULATIONS | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/33/part-110",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00235-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912215419,
    "recordOffset": 912195049,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1040=Title 33 published on 2014-07-01.}",
    "TableContextTimeStampAfterTable": "{29741=§ 1224 - Considerations by Secretary, 30041=§ 1227 - Investigatory powers, 30980=§ 1233 - Regulations as to regattas or marine parades, 31559=§ 2035, 30337=§ 1230 - International agreements, 30132=§ 1228 - Conditions for entry to ports in the United States, 30253=§ 1229 - Applicability, 30432=§ 1231 - Regulations, 29927=§ 1226 - Port, harbor, and coastal facility security, 31650=§ 2071 - Inland navigation rules, 29839=§ 1225 - Waterfront safety, 31358=§ 1236 - Penalties for violations of regulations, 30619=§ 1232 - Enforcement provisions, 29379=§ 1221 - Statement of policy, 29469=§ 1222 - Definitions, 31468=§ 2030, 31226=§ 1235 - Transfer of authority to regulate to head of other department, 31095=§ 1234 - Enforcement of regulations; use of public or private vessels, 65459=The Coast Guard announces a November 20, 2014 public meeting to receive comments on a notice of proposed rulemaking entitled “Anchorage Regulations: Subpart A—Special Anchorage Areas, Marina del Rey Harbor, California ” that was published in the Federal Register on May 28, 2014. As stated in that document, the Coast Guard proposes to disestablish the special anchorage area at the north end of the main channel in Marina del Rey Harbor, California. This proposed action would remove the anchorage area from Coast Guard regulations. This proposed rule would not prevent vessels from anchoring in the harbor during storms, stress, or other emergency situations. We have reopened the comment period which will now end November 28, 2014., 29551=§ 1223 - Vessel operating requirements, 8826=The Coast Guard published a final rule in the Federal Register on January 15, 2015, to establish and modify anchorage grounds within the Port of New York. One of the amendatory instructions for an existing regulation, which was intended to revise only paragraph (f)(2), mistakenly indicated that all of paragraph (f) was being revised. This rule corrects that error., 32018=Title 33 published on 2014-07-01}",
    "lastModified": "Thu, 04 Jun 2015 03:27:30 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 5282 - Vessel Requirements for Notices of Arrival and Departure, and Automatic Identification System 2015-01-30; vol. 80 # 20 - Friday, January 30, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 33. Title 33 published on 2014-07-01. 1.05-1122133 U.S.C. 471 SUBPART B — Anchorage Grounds (§§ 110.130 - 110.255) CGFR 67-46, 32 FR 17728, Dec. 12, 1967, unless otherwise noted. Source: ; Department of Homeland Security Delegation No. 0170.1. through 1236, 2030, 2035, 2071; 33 CFR , Authority:",
    "textAfterTable": "DEPARTMENT OF HOMELAND SECURITY, Coast Guard Final rule. This final rule is effective March 2, 2015, except for amendments to 33 CFR part 160 which become effective April 30, 2015, with the further exception of § 160.204(a)(6), which is effective April 30, 2015 through December 31, 2015; and except for §§ 160.204(a)(5)(vii), 160.205, 160.208(a) and (c), and 164.46(b) and (c), which contain collection of information requirements that have not yet been approved by the Office of Management and Budget (OMB). The Coast Guard will publish a document in the Federal Register announcing the effective date of these four collection-of-information related sections. The incorporation by reference of certain publications listed in the final rule is approved by the Director of the Federal Register on March 2, 2015. 33 CFR Parts 62, 66, 101, 110, 117, 118, 151, 160, 161, 164, and 165 Summary Consistent with statutory requirements and provisions, the Coast Guard is expanding the applicability of notice of arrival (NOA) and automatic identification system (AIS) requirements to include more commercial vessels. This final rule amends the applicability of notice of arrival requirements to include additional vessels, sets forth a mandatory method for electronic submission of NOAs, and modifies related reporting content, timeframes, and procedures. This final rule also extends the applicability of AIS requirements beyond Vessel Traffic Service (VTS) areas to all U.S.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}