{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Black Protestant",
            "Catholic",
            "Other",
            "None"
        ],
        [
            "Adherents",
            "20,209",
            "3,403",
            "961",
            "595",
            "11",
            "34,737"
        ],
        [
            "Congregations",
            "52",
            "24",
            "8",
            "1",
            "1",
            "-"
        ]
    ],
    "pageTitle": "Creedmoor, North Carolina (NC 27522) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Creedmoor-North-Carolina.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00328-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 357382931,
    "recordOffset": 357250253,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7397=According to our research of North Carolina and other state lists there were 14 registered sex offenders living in Creedmoor, North Carolina as of July 30, 2015. The ratio of number of residents in Creedmoor to the number of sex offenders is 302 to 1., 128928=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!}",
    "TableContextTimeStampAfterTable": "{31351=Particulate Matter (PM10) [µg/m3] level in 2012 was 14.0. This is significantly better than average. Closest monitor was 13.9 miles away from the city center., 52443=Graphs represent county-level data. Detailed 2008 Election Results, 51587=2004 Presidential Elections Results, 30646=Ozone [ppb] level in 2012 was 25.4. This is better than average. Closest monitor was 6.7 miles away from the city center., 29181=Carbon Monoxide (CO) [ppm] level in 2012 was 0.282. This is about average. Closest monitor was 12.4 miles away from the city center., 25471=Hotels: Comfort Inn Creedmoor (1585 Highway 56), Econo Lodge Creedmoor (2574 Lyons Station Road)., 29899=Sulfur Dioxide (SO2) [ppb] level in 2012 was 0.574. This is significantly better than average. Closest monitor was 8.6 miles away from the city center., 70018=6.19% of this county's 2010 resident taxpayers moved to other counties in 2011 ($35,915 average adjusted gross income), 77546=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population), 47696=Educational Attainment (%) in 2013, 68201=6.02% of this county's 2011 resident taxpayers lived in other counties in 2010 ($39,594 average adjusted gross income), 102651=Total of 161 patent applications in 2008-2015., 104030=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 13730=On 11/23/1992, a category F3 (max. wind speeds 158-206 mph) tornado 21.6 miles away from the city center killed 2 people and injured 10 people and caused between $50,000 and $500,000 in damages., 13406=On 11/28/1988, a category F4 (max. wind speeds 207-260 mph) tornado 17.9 miles away from the Creedmoor city center killed 4 people and injured 154 people and caused between $50,000,000 and $500,000,000 in damages., 51015=1996 Presidential Elections Results, 51873=2008 Presidential Elections Results, 32121=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 9.47. This is about average. Closest monitor was 13.9 miles away from the city center., 28534=Air Quality Index (AQI) level in 2012 was 88.2. This is about average., 51301=2000 Presidential Elections Results, 48094=School Enrollment by Level of School (%) in 2013, 52159=2012 Presidential Elections Results}",
    "textBeforeTable": "Religion statistics for Creedmoor city (based on Granville County data) Wyndhorse neighborhood Neighborhood in Creedmoor (Creedmoor, North Carolina Neighborhood Map): Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Fuel oil, kerosene, etc. (1%) Other fuel",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 8 Granville County: 1.43 / 10,000 pop. North Carolina: 2.05 / 10,000 pop. Number of convenience stores (no gas): 6 Granville County: 1.07 / 10,000 pop. North Carolina: 0.92 / 10,000 pop. Number of convenience stores (with gas): 28 Granville County: 5.00 / 10,000 pop. State: 4.75 / 10,000 pop. Number of full-service restaurants: 18 Here: 3.21 / 10,000 pop. State: 7.57 / 10,000 pop. Adult diabetes rate: This county: 10.5% North Carolina: 9.8% Adult obesity rate: Granville County: 36.1% North Carolina:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}