{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "guards patrol regularly",
            "none",
            "there are numerous clubs and activities.",
            "any type, they have very flexible tuition options and shcedules.",
            "this school has excellent bang for the buck",
            "there are many clubs and sports to pick from.",
            "the food is okay, but there are more food chains just down the road",
            "they do not have on campus dorms.",
            "i thought it was going to be a cake walk, but many of my classes are challenging.",
            "stay on top of your classes. dont commit to more than you can handle. Enjoy it.",
            "PHCC is a good community college. It has a very high cost value because they offer quality tuition at a great price. I enjoy it there, but they do not have soccer as a sport so i am transfering."
        ]
    ],
    "pageTitle": "Pasco-Hernando Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pasco-Hernando-Community-College/reviews?_escaped_fragment_=/show/26846",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00214-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892858919,
    "recordOffset": 892791126,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{226432=I am very happy at PHCC. The staff there is very helpful. I started my classes in August of this year and I'm amazed at how much I have accomplished., 46477=I just started attending this school this year (January). So far, the two teachers I have taken a class with have been very nice and helpful. I met with an adviser once who was quite nice as well, but not real knowledgeable about the field of study I wish to enter (marine biology). Truthfully for the money, it is a pretty good college so far. I plan to pick back up with classes in January., 365852=© 2015, Cappex.com, LLC, 212702=There is also something going on at Pasco-Hernando Community College. For example, this being the month of October, PHCC is holding a trick or treat day for your kids and/or siblings. There is always free food and games to play held by the many clubs here at PHCC.}",
    "textBeforeTable": "07/21/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 94 Victoria from Brooksville, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students If you are pursuing a career that has a limited access program, such as LPN or RN, I would suggest living in the same county as the college. I had a 4.0 GPA and lived close to the county line of Pasco County, but lived in Hillsborough County and did not get into their program, only because I did not live in their county. I am currently pursuing other colleges because of this issue. I only wish that the college would have stressed this issue to me earlier. Other than that, this is a good college. Tips for prospective students This is a good college. Colleagues are friendly and supportive. Most teachers are passionate about teaching their classes. Staff is very helpful. The classes are easy to find. Login to rate or flag the reviews Ashley from Spring Hill, FL 08/12/2009 Reviewer is A current student here. 4 out of 4 people found this review useful. 4 of 94 Categories Comments Great for these",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}