{
    "relation": [
        [
            "First Name",
            "Ed",
            "Larry",
            "Brendan",
            "Mia"
        ],
        [
            "Last Name",
            "Wytkind",
            "Willis",
            "Danaher",
            "Clarkson"
        ],
        [
            "Suffix",
            "",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            "",
            "Legislative Director, Rep. Julia Carson (IN-7)"
        ],
        [
            "New",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=C6F402A7-450A-4451-855C-ED9DE426270D&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00040-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 217456293,
    "recordOffset": 217448091,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12242=H.R. 658 and S. 223 - FAA Air Transportation Modernization and Safety Improvement Act H.R. 2553 - Airport and Airway Extension Act of 2011, Part IV H.R. 2887 - Surface and Air Transportation Programs Extension Act of 2011 H.R. 970 - Federal Aviation Research and Development Reauthorization Act of 2011 H.R. 1474 - Freedom from Government Competition Act H.R. 3011 - Transportation Security Administration Authorization Act of 2011 Foreign Ownership and Cabotage Issues Air Traffic Control Privatization Aviation Security Federal Aviation Administration Staffing Issues Federal Aviation Administration Labor-Management Relations Flight Attendant Workplace Safety and Fatigue Issues (application of OSHA standards) Federal Aviation Administration Standards for Airport Rescue and Fire Fighting Employee Background Checks Helicopter Safety Airline Pensions E.U.-U.S. Air Transport Service Agreement Airline Mergers Flight Duty Time Aircraft Maintenance Tax Credit Joint Venture Protections Consolidation of Automated Flight Service Stations (AFSS) Open Skies China Essential Air Service Repair Station Safety and Security Lithium Battery Transportation Aviation Taxes and Fees, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 53634=H.R. 1351 - United States Postal Service Pension Obligation Recalculation and Restoration Act of 2011, 26848=S.158 - Surface Transportation Board Reauthorization Act of 2011 S. 49 - Railroad Antitrust Enforcement Act of 2011 Mica/Shuster Passenger Rail Privatization Bill High Speed Rail Amtrak Funding Rail Apprenticeships Rail Labor Protections Railroad Retirement Board Nominations Worker Security Training Railroad Retirement/Occupational Disability Amtrak Board Nominations, 31290=H.R. 2887 - Surface and Air Transportation Programs Extension Act of 2011 H.R. 2459 - Safe Roads Act of 2011 H.R. 929 - Transportation Job Corps Act of 2011 S. 652 - Building and Upgrading Infrastructure for Long-Term Development H.R. 873 and S. 453 - Motorcoach Enhanced Safety Act of 2011 H.R. 328 - Safety, Efficiency, and Accountability in Transportation Projects Through Public Inspection Act of 2011 H.R. 402 - National Infrastructure Development Bank Act of 2011 H.R. 1690 - MODERN Security Credentials Act S. 1230 and H.R. 2350 - Protecting Taxpayers in Transportation Asset Transfers Act S.1300 - Lincoln Legacy Infrastructure Development Act S. 936 - American Infrastructure Investment Fund Act of 2011 S. 1546 - Department of Homeland Security Authorization Act of 2011 H.R. 3116 - Department of Homeland Security Authorization Act for Fiscal Year 2012 Surface Transportation Authorization Operating Assistance for Transit Agencies Hazardous Materials Transportation Reauthorization Transit Safety and Security Issues Background and Security Clearances for the Transportation Workforce Department of Transportation Nominations Over-the-Road Bus Safety and Security Issues Transit Apprenticeships Worker Training School Bus Transportation Issues, 17718=H.R. 12, S. 1549 - American Jobs Act of 2011 S. 1596 - Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2012 S. 1599 - Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, 2012 H.R. 2017 - Department of Homeland Security Appropriations Act, 2012 HR 2354 - Energy and Water Development and Related Agencies Appropriations Act, 2012 (High speed rail provision) H.R. 2017, H.R. 2608 - Continuing Appropriations Act, 2012 Homeland Security Appropriations Transportation Appropriations Labor-HHS Appropriations National Mediation Board Appropriations, 45512=H.R. 1861 - Infrastructure Jobs and Energy Independence Act Climate Change (issues related to transportation), 22445=S. 832 - SAFE Port Reauthorization Act of 2011 S. 1430 - Maritime Administration Authorization Act for Fiscal Year 2012 Transportation Worker Identification Credential Infrastructure Investment in Ports Harbor Maintenance Tax Piracy Prevention Measures Cargo Preference Coast Guard Reauthorization Port Security}",
    "textBeforeTable": "",
    "textAfterTable": "3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  LARRY WILLIS  2026289262  larryw@ttd.org 5. Senate ID#  38392-12 7. Client Name Self Check if client is a state or local government or instrumentality  TRANSPORTATION TRADES DEPARTMENT, AFL-CIO 6. House ID#  305640000",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}