{
    "relation": [
        [
            "",
            "CHARLES ”KIT” CRITTENDEN",
            "WRITE-IN",
            "Total"
        ],
        [
            "Vote Count",
            "10",
            "2",
            "12"
        ],
        [
            "Percent",
            "83.33%",
            "16.67%",
            "100.00%"
        ]
    ],
    "pageTitle": "Imperial County Newspapers, Holtville Tribune - I.V. Weekly - Calexico Chronicle | Imperial County Election Primary Results",
    "title": "",
    "url": "http://tribwekchron.com/2010/06/imperial-county-election-primary-results/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00175-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 252506459,
    "recordOffset": 252478284,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{170212=For Supervisor District 1, John Renison defeated incumbent Louis Fuentes with 33.86% of the vote against 25.06% that Louis Fuentes received. Fuentes and Renison will meet in the run-off in November to decide who will represent District 1 at the County level. The winner will take oath of office in January., 169898=For Imperial Irrigation District Division 1, Matt Dessert will meet former director Rudy Maldonado in November.}",
    "textBeforeTable": "124/124 100.00% By Mario Conde According to the Imperial County office of elections the unofficial election results show that in Calexico as Carlton Hargrave and Maritza Hurtado-Barron were elected to the Calexico City Council. In a very competitive election, Carlton Hargrave got 783 votes, Martiza Hurtado received 774, and Bill Hodge a little bit behind with 749. Hargrave and Hodge were the leading candidates as of 10p.m. but Hurtado-Barron took the lead later on. They are currently 25 votes that separate both candidates as of Wednesday morning. For Supervisor District 1, John Renison defeated incumbent Louis Fuentes with 33.86% of the vote against 25.06% that Louis Fuentes received. Fuentes and Renison will meet in the run-off in November to decide who will represent District 1 at the County level. The winner will take oath of office in January. For Imperial Irrigation District Division 1, Matt Dessert will meet former director Rudy Maldonado in November. Division 5 is lead by Anthony Sanchez who defeated Norma Sierra-Galindo. James Hanks came out as victor for Division 3. Juan Vargas and Mary Salas are in a dead heat race for District 40th State Senate. Measure H won by a strong 60% of the vote. The final numbers could come in the next couple of days. IMPERIAL County Sup. of Schools //--> google_ad_height = 60; google_ad_width = 468; google_ad_slot = \"6310313224\"; /* 3 */ google_ad_client = \"ca-pub-3268029602753000\";",
    "textAfterTable": "SUPERVISOR, 1st DISTRICT 19/19 100.00% Vote Count Percent LOUIS A. FUENTES 607 25.06% JOHN R. RENISON 820 33.86% CARMEN DURAZO 506 20.89% LUIS J. CASTRO 471 19.45% WRITE-IN 18 0.74% Total 2,422 100.00% SUPERVISOR, 5th DISTRICT 34/34 100.00% Vote Count Percent WALLY LEIMGRUBER 851 48.22% ESTEBAN (STEVE) VASQUEZ 446 25.27% RAYMOND R. CASTILLO 459 26.01% WRITE-IN 9 0.51% Total 1,765 100.00% ASSESSOR Imperial 124/124 100.00% Vote Count Percent ROY D. BUCKNER 5,327 50.16% CARLOS ZARAGOZA 5,227 49.22%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}