{
    "relation": [
        [
            "Postage and packaging",
            "Free P&P",
            "US $5.95",
            "US $26.95"
        ],
        [
            "Each additional item",
            "Free",
            "US $3.95",
            "US $3.95"
        ],
        [
            "To",
            "United States",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Shipping",
            "Expedited Delivery (USPS Priority Mail®)",
            "Expedited Delivery (USPS Priority Mail Express®)"
        ],
        [
            "Delivery*",
            "Estimated within 5 working days",
            "Estimated within 2-5 working days",
            "Estimated within 2-3 working days"
        ]
    ],
    "pageTitle": "Solar/Battery Powered Mix-Color LED Xmas Tree/Party Novelty String Light Decor | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/Solar-Battery-Powered-Mix-Color-LED-Outdoor-Xmas-Tree-Party-String-Light-Decor-/291012348811?pt=US_String_Lights_Fairy_Lights&var=&hash=item8969888905",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00177-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 429336575,
    "recordOffset": 429294048,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter up to 7 characters for the postcode Please enter a valid postcode. Postcode: Select a valid country. There are 35 items available. Please enter a number less than or equal to 35. -Select- Afghanistan Albania Algeria American Samoa Andorra Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Republic Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana British Virgin Islands Brunei Darussalam Bulgaria Cambodia Canada Cayman Islands Chile China Colombia Cook Islands Costa Rica Croatia, Republic of Cyprus Czech Republic Denmark Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Estonia Falkland Islands (Islas Malvinas) Fiji Finland",
    "textAfterTable": "* You’ll see an estimated delivery date based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your payment clears - opens in a new window or tab. Domestic dispatch time Will usually dispatch within 1 working day of receiving cleared payment - opens in a new window or tab. Returns policy After receiving the item, cancel the purchase within Refund will be given as 14 days Money back or item exchange (buyer's choice) The buyer is responsible for return postage costs. Return policy details * Returns are accepted within 14",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}