{
    "relation": [
        [
            "Student",
            "McDonnell, Andrew",
            "Prahl, William",
            "Warlick, Ian",
            "Wert, Adam",
            "Williams, Nathan"
        ],
        [
            "Title of Presentation",
            "Invitation to an Engagement: The Voice of Contemporary Da’wa Materials in Western Discourse on the Nature of Islam",
            "Learning from Atrocity: The Holocaust and Divine Pathos in Heschel’s Theology",
            "Fixing Christianity: Religion without Religion as Lived by Ikon",
            "(Deconstructive) Theological Parallels: Rowan Williams and John Caputo",
            "Why (and How) Religious Studies?"
        ],
        [
            "Faculty MAP Director(s)",
            "Caleb Elfenbein",
            "Harold Kasimow",
            "Tyler Roberts",
            "Tyler Roberts",
            "Ed Gilday"
        ],
        [
            "Conference Information",
            "American Academy of Religion Midwest Regional Conference, Ada, OH",
            "American Academy of Religion Upper Midwest Region Theological Conference, St. Paul, MN",
            "American Academy of Religion Upper Midwest Region Theological Conference, St. Paul, MN",
            "American Academy of Religion Upper Midwest Region Theological Conference, St. Paul, MN",
            "Upper Midwest Regional Meeting of the American Academy of Religion, St. Paul, MN"
        ],
        [
            "MAP Year",
            "2012",
            "2012",
            "2009",
            "2009",
            "2002"
        ],
        [
            "Conference Start",
            "12-Apr-13",
            "5-Apr-13",
            "9-Apr-10",
            "9-Apr-10",
            "2003"
        ],
        [
            "Conference End",
            "13-Apr-13",
            "6-Apr-13",
            "10-Apr-10",
            "10-Apr-10",
            ""
        ]
    ],
    "pageTitle": "Publications, Presentations, & Awards | Grinnell College",
    "title": "",
    "url": "http://www.grinnell.edu/academics/arc/academic-affairs/map/pubs_pres_awards",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00015-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 490558155,
    "recordOffset": 490505929,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sat, 01 Aug 2015 06:02:14 GMT",
    "textBeforeTable": "Anthropology Works presented off-campus or at conferences hosted by Grinnell College Presentations Wilson, Leann, [Professor Dan Kaiser], \"'Smertnost' v Tule: Analiz okruzhaiushchei sredy na osnove metricheskikh knig odnogo prikhoda,1780-1804 (Mortality in Tula: An Analysis of the Role of Environment on the Basis of Parish Registers of One Parish, 1780-1804),\" Izvestiia Tul'skogo gosudarstvennogo universiteta, Seriia Istoriia I kul'turologiia (Transactions of Tula State University, Series on History and Cultural Studies), 2006, no. 5, pp 57-71 (History: Summer 2006). Williams, Alison [Professor Martha Voyles] \"Gender Differences in Attributions and Behavior in a Technology Classroom,\" Journal of Computers in Mathematics and Science Teaching, (Education, Summer 2001) West, R; Wang, Q.; Jin, Jay J. and Professor Leslie J. Lyons. \"Ionic Conductivity Studies of Methyl Polysiloxane Polymer Electrolytes with Oliog(oxyethylene) Side Chains,\" Polymer Preprints, 2003, 44 (1), 1148. (Chemistry: Jin/Lyons: Summer 2002) Ward, Elizabeth [Professor Ralph Savarese] \"Truth at War: Nam Memoir.\"Mortar Board, Spring 2007 (English, Summer 2006) Wang, Q.; Jin, Jay J.; West, R. and Professor Leslie J. Lyons. \"Ionic Conductivity Studies of Methyl Polysiloxane Polymer Electrolytes with Oliog(oxyethylene) Side Chains,\" Polymer Preprints, 2003, 44 (1), 1148. (Chemistry: Jin/Lyons: Summer 2002) Ventis, Summer [Professor Kenneth Christiansen] Illustrations and five reconstruction drawings for \"Cretaceous Collembola from the upper Cretaceous of Canada.\" (Christiansen & Pike) Cretaceous Research 23: 165-188 (Biology, Summer 2001). Tomasulo, Gabe [Professors Terri Geller and Matthew Kluber] \"Photo Technique: Variations on the Photographic Arts.\" (Spring 2010).",
    "textAfterTable": "Casson, Sarah Austin Sinagua Point Lithics: a Comparison of Four Sites in the Flagstaff Region John Whittaker Society for American Archaeology Annual Meeting 2011, Sacramento, CA 2010 30-Mar-11 2-Apr-11 Doxsie, Christina Narrative in Ethnography Doug Caulkins Society for Cross-Cultural Research, Charleston, SC 2002 Feb-03   Elliott, Thomas Mediating Memoryscapes: The Role of the Tower Museum in Derry Northern Ireland Doug Caulkins American Council on Irish Studies, Penn State 2010 May-10   Falley, Emma Civil Society and Possible Futures for Derry-Londonderry, Northern Ireland Douglas Caulkins Society for Applied Anthropology Conference in Pittsburgh, PA. http://www.sfaa.net/annual-meeting/pittsburgh-2015/ 2014 25-Mar-15 28-Mar-15 Gamble, Maja Social Memory, Contested Territory, and New Public Spaces in Derry, Northern Ireland Doug Caulkins Society for Applied 2011 11-Apr   Gamble, Maja Competing Ideologies and Museum Narratives in Derry, Northern Ireland Doug Caulkins American Council on Irish Studies, Penn State 2009 May-10   Ghadiri, Mona From Protest to Advocacy: Forty years of student activism Doug Caulkins Central States Anthropological Society 2011 Apr-11   Gossett, Sarah Tuberculosis in Inuits from Pt. Hope, Alaska: A possible maritime resource connection Doug Caulkins 73rd Annual meeting of the American Association of Physical Anthropologists, Tampa, FL 2003 Apr-04   Guzman, Graciela Geraldine Development and Expression of Environmental Values in a Transnational Context: The Case of Mexican Immigrants in a Central Iowa Community Eric Carter Race, Ethnicity, and Place Conference, Binghampton, NY 2010 6-Oct-10 8-Oct-10 Hadden, Elise Discourses of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}