{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Catholic",
            "Mainline Protestant",
            "Black Protestant",
            "Other",
            "None"
        ],
        [
            "Adherents",
            "64,326",
            "15,271",
            "12,581",
            "5,479",
            "1,822",
            "22,251"
        ],
        [
            "Congregations",
            "177",
            "4",
            "38",
            "24",
            "11",
            "-"
        ]
    ],
    "pageTitle": "Longview, Texas (TX 75601, 75602) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Longview-Texas.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00205-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 377931087,
    "recordOffset": 377789482,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6896=According to our research of Texas and other state lists there were 234 registered sex offenders living in Longview, Texas as of July 28, 2015. The ratio of number of residents in Longview to the number of sex offenders is 347 to 1.}",
    "TableContextTimeStampAfterTable": "{17812=On 4/1/1979, a category F3 tornado 5.6 miles away from the city center caused between $500,000 and $5,000,000 in damages., 17572=On 4/26/1957, a category F3 (max. wind speeds 158-206 mph) tornado 2.8 miles away from the Longview city center caused between $5000 and $50,000 in damages., 96972=8.08% of this county's 2010 resident taxpayers moved to other counties in 2011 ($39,019 average adjusted gross income), 94773=8.17% of this county's 2011 resident taxpayers lived in other counties in 2010 ($38,756 average adjusted gross income), 54848=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.77. This is about average. Closest monitor was 9.4 miles away from the city center., 73978=2000 Presidential Elections Results, 198440=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 70475=Educational Attainment (%) in 2013, 74836=2012 Presidential Elections Results, 70873=School Enrollment by Level of School (%) in 2013, 197147=Total of 166 patent applications in 2008-2015., 20861=Birthplace of: Miranda Lambert - Country music artist, Karen Silkwood - Labor union activist, José Francisco Torres - Soccer player, Mark White - Ameriacn politician, Josh Scobee - 2005 NFL player (Jacksonville Jaguars, born: Jun 23, 1982), Craig Anthony Washington - Politician, Willie Andrews - Player of football, Trent Williams - College football player, Don Fambrough - Football player and coach, Fred Talley - Player of football., 73692=1996 Presidential Elections Results, 74264=2004 Presidential Elections Results, 47062=Hotels: Best Western (310 East Loop 281) (1), American Thrifty Inn (2015 East Marshall Avenue) (2), Best Western Inn of Longview (3119 Estes Parkway) (3), Comfort Inn Longview (203 North Spur 63) (4). Display/hide their approximate locations on the map, 74550=2008 Presidential Elections Results, 56272=Particulate Matter (PM2.5) [µg/m3] level in 2005 was 12.3. This is worse than average. Closest monitor was 9.4 miles away from the city center., 55573=Ozone [ppb] level in 2012 was 29.7. This is about average. Closest monitor was 9.4 miles away from the city center., 53468=Air Quality Index (AQI) level in 2012 was 82.5. This is about average., 54115=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 5.07. This is better than average. Closest monitor was 9.4 miles away from the city center., 75120=Graphs represent county-level data. Detailed 2008 Election Results}",
    "textBeforeTable": "Religion statistics for Longview city (based on Gregg County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Bottled, tank, or LP gas (1%) Utility gas (42%) Electricity (57%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 19 Gregg County: 1.63 / 10,000 pop. Texas: 1.47 / 10,000 pop. Number of supercenters and club stores: 3 This county: 0.26 / 10,000 pop. State: 0.14 / 10,000 pop. Number of convenience stores (no gas): 16 Gregg County: 1.37 / 10,000 pop. Texas: 1.11 / 10,000 pop. Number of convenience stores (with gas): 92 Gregg County: 7.87 / 10,000 pop. State: 3.95 / 10,000 pop. Number of full-service restaurants: 91 Here: 7.79 / 10,000 pop. State: 6.13 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}