{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "71.11",
            "69.65",
            "72.62",
            "76.34"
        ],
        [
            "NSE",
            "71.30",
            "69.74",
            "72.23",
            "76.35"
        ]
    ],
    "pageTitle": "Nahar Capital and Financial Services Stock Price, Share Price, Live BSE/NSE, Nahar Capital and Financial Services Bids Offers. Buy/Sell Nahar Capital and Financial Services news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/finance-investments/naharcapitalfinancialservices/NCF",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00123-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 608603687,
    "recordOffset": 608558556,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{133669=28 July 2015, 200757=Nahar Capital is in the Finance - Investments sector. The current market capitalisation stands at Rs 122.25 crore. The company management includes Jawahar Lal Oswal - Chairman, Dinesh Oswal - Managing Director, Dinesh Gogna - Director, Satish Kumar Sharma - Director, Kamal Oswal - Director, H K Bal - Independent Director, Kanwar Sain Maini - Independent Director, Suresh Kumar Singla - Independent Director, Yash Paul Sachdeva - Independent Director, Amrik Singh Sohi - Independent Director. It is listed on the BSE with a BSE Code of 532952 and the NSE with an NSE Code of NAHARCAP. Its Registered office is at 375, Industrial Area - A , Ludhiana,Punjab - 141003. Their Registrars are Alankit Assignment Ltd., 134887=JSWSteel Jul Fut, 134180=UnitedBrewerie Jul Fut, 199448=Astec LifeSciences Recommended on Mar 31st 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}