{
    "relation": [
        [
            "Hardware Name (socket type)",
            "GA-965GM-S2",
            "GA-965P-S3 rev 1.0",
            "GA - 8I848P-G",
            "GA-945GZM-S2",
            "GA - 8I945GZME - RH",
            "GA - 8I945GMH - RH",
            "GA - 8I945GMF",
            "GA - 8I945P - G",
            "GA - 945P - S3",
            "GA - 945G - S3",
            "GA - 965P - DS3",
            "GA- 965P - S3",
            "GA - 965P - DS3",
            "GA - 965P - DS3P",
            "GA - 965P - DS4",
            "GA - 965P - DQ6",
            "GA - 8VT880P Combo",
            "GA - 945GM - S2",
            "GA - 865PE 1-st rev.",
            "GA - 8IPE 1000 - G rev.4.x",
            "GA-8S661-FXM-775 rev.1.x",
            "P35-DS3R",
            "GA-8I865GME-775"
        ],
        [
            "Chipset",
            "Intel G965 ICH8",
            "Intel i965 ICH8",
            "Intel 848P MCH / ICH 5",
            "Intel 945GZ / ICH7",
            "Intel 945 / ICH 7",
            "Intel 945 / ICH 7",
            "Intel 945 / ICH 7",
            "Intel 945P / ICH 7",
            "Intel 945P / ICH7",
            "Intel 945G / ICH7",
            "Intel 965P",
            "Intel P965",
            "Intel 965P",
            "Intel 965Pe",
            "Intel 965P",
            "Intel 965P",
            "VIA PT880P",
            "Intel 945 / ICH 7",
            "Intel 865",
            "Intel 865PE",
            "SiS 661FX/964L",
            "Intel P35",
            "Intel 865G"
        ],
        [
            "Notes",
            "Uncheck everything except Intel patches Then use the Natit drivers for video, and these instructions for network card and sound. For walk through.",
            "Using F8 BIOS & non-semthex 8.8.1 kernel. Tested/Working: IDE, SATA0/1(Purple), AHCI0/1 (Orange), USB1.1/2.0, GBEthernet, ALC883 Multichannel Audio (analog) - up to 7.1/Mic/Line-In Not Working: AHCI4/5 (Orange). Installed with USB2.0 DVD drive, very fast, very stable. For more info, visit this step-by-step guide.",
            "SATA works.LAN drivers are included in Myzar releases. Audio works. HDD works on pata.USB works.",
            "Everything works! Out of the box: SATA,ATA,USB work, GMA950 works with QE/CI. Don't install anything extra from the DVD, you're asking for kernel panic! Network needs this driver (here's the thread) Sound is fully working with skippyretard's AzaliaAudio883.pkg - use the 6 port custom install!",
            "Semthex Kernel: SATA,ATA,USB work, GMA950 grapihc chip works with QE/CI supported! 2 channel Audio works after applying this hack Fixed, just change 882 to 883. LAN works after recompiling skge driver 8001 kext. Full Walkthrough for 10.4.8 install here [8]",
            "Everything works except shutdown/restart problem. Audio not tested. Bios sata settings- avoid 'AHCI'.",
            "SATA 2, ATA, USB 2.0, Fireware , Video GMA950 works with Quartz Extreme and OpenGL, (Line In / Line Out / MIC In / SPDF Audio works after applying this hack ONLY Kernel 8.8.1), LAN works",
            "SATA Worked, Audio Worked After use AppleHDA 0.4b Driver, Broadcom 5789 Gigabit Ethernet Controller can work after use the kext that modified Dev id of \"AppleBCM5751Ethernet.kext\", But cannot recongize the MAC Address. USB is OK, IT8212 ATA/RAID Controller cannot work",
            "Core 2 Duo E6400/1GB/SATA HD...First attempt installed, but then yielded an unbootable system (\"unrecognized platform: ACPI\" halt w/ restart msg). Second attempt, only installed the AzaliaAudio extra driver and it booted OK. No audio or Ethernet, but RTL1xxx and ALC883Audio worked fine. Also, latest NATIT worked fine w/ my GeForce 7300 GS PCI-E card w/ full CI/QE support. Seems to run GREAT!",
            "Pentium Dual Core E2160/1GB/SATA HD, ALC883 audio working, Realtek 8111 Gigabit ethernet working, GMA950 working QE/CI &res change. needs \"-legacy\" key for recognizing SATA HDD during installation. Dual booting with Chain0",
            "Everything works, more information here demonoid has a patch for Jas 10.4.8 reseed to fix IDE on install disc. Search for \"jmb\" (no quotes) and it should come up on demonoid",
            "Core 2 Duo 6600. Everything installed fine (Using DVD-ROM hooked up via USB). Followed instructions for Western Digital SATAII Drive. Had trouble getting Ethernet running, but fixed with simple file edit. Pion's System profiler fix works after running a second time.",
            "Everything works, more information here",
            "Same issues as the DS3 and same fixes. Works fine once patched, USB, Firewire, audio.",
            "Everything works, CPU:Intel Core 2 duo 6300; Graphics:PowerColor X1600 PRO; Display:DELL 2007WFP Harddisk:WDC800JD-75MSA1;DVD-ROM:PIONEER DVD-127P:MERMORY:A-DATA Vitesta DDR2-800...more information here",
            "Everything works apart from sound works out of the box with JaS 10.4.8 DVDv1, install ALC888 patch and select 6 channel (not digital). BIOS setup",
            "Everything seems to work (LAN, USB, SATA *fix, IDE, Audio,USB working, use v 256.4.2*",
            "installed via VMware, native install needs \"-legacy\" boot arg. everything works fine, DDR2 800 PC6400 is seen as \"RAM 133Mhz\"... Apple original security update (12/2006) works fine without patching. OnBoard audio fixed with ALC883 patch from here",
            "Sound, USB without patching. SATA/RAID not tested.",
            "Intel SSE3 package.Sound working in stereo only (disable top performance in bios if the sound is intermitent), Ethernet working with DaemonES' drivers, USB + SATA fully working. Can also be patched with Jas 10.4.9 update",
            "Intel SSE3 package. Sound does not work, Ethernet does not work, USB works as 1.1, SATA is not recognized, PATA works but needs Bikedude's patched APPLEVIAATA.kext to get full speed.",
            "ICH9 driver not disponible, but able to use disks on it, JMicron patch works, sound ACL889B is not disponible at the moment. Ethernet RTL 8168/8111 works with modified kext and RTL1xxx driver but you need to enable Wake On Lan on bios or windows drivers.",
            "Sound, USB, SATA worked out of the box. Lan needed to add VID/PID to AppleIntel8225x.kext. Using ATI9600Pro with Callisto008. Updated to 10.4.9 using JaS from same package and 10.4.10 from TPB."
        ],
        [
            "Fully working without patching",
            "JaS 10.4.8 AMD Intel SSE2.SSE3",
            "JaS 10.4.8 AMD Intel SSE2.SSE3 (patched with ppf1 & defiant disk utility patch)",
            "Myzar 10.4.8 AMD Final",
            "JaS OS X 10.4.8 (AMD-Intel-SSE2-SSE3 with PPF1) + network + audio",
            "JaS 10.4.8 Install with Semthex Kernel then upgraded to latest Semthex Nebukadnezar Kernel",
            "Hotiso 10.4.6 upgraded with 10.4.8 for intel",
            "JaS 10.4.8 Kernel 8.8.1",
            "JaS 10.4.8 Intel SSE3 Only",
            "\"JaS 10.4.8 AMD INTEL SSE2 SSE3 beta 2\" DVD w/ semthex 8.8.1 and extra drivers (Azalia, NATIT, etc.)",
            "\"10.4.9 uphuck v1.3\" DVD w/ 8.9.1 kernel",
            "JaS 10.4.8 DVD reseed + pion's package",
            "JaS 10.4.8 DVD w/ JMicron patch, Pion's Patch, Prasis Kernel Update",
            "JaS 10.4.8 DVD reseed + pion's package",
            "JaS 10.4.8 DVD + pion",
            "JaS 10.4.8 DVD reseed + OSX 10.4.8 Jmicron JMB IDE patch + AppleHDA Solution(ALC833) + pion's package",
            "Jas 10.4.8 DVDv1 + ALC888",
            "Yes JaS Update 10.4.8",
            "TubGirl AMD SSE3 test1 PPF2 DVD",
            "JaS 10.4.8 DVD on Semthex 8.8.1",
            "JaS OS X 10.4.8 (AMD-Intel-SSE2-SSE3 with PPF1 & PPF2)",
            "JaS OS X 10.4.8 (AMD-Intel-SSE2-SSE3 with PPF1 & PPF2)",
            "uphuck OS X 10.4.9",
            "JaS OS X 10.4.8 (AMD-Intel-SSE2-SSE3 with PPF1 & PPF2)"
        ]
    ],
    "pageTitle": "HCL 10.4.8 - OSx86",
    "title": "",
    "url": "http://wiki.osx86project.org/wiki/index.php/HCL_10.4.8",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00102-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 253094187,
    "recordOffset": 253019489,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{91241=JaS 10.4.8 DVD for Intel SSE3 w/semthex. And probe 10.4.10 koolkal 10.4.10 combo update intel sse3 and very good function all. with 10.4.10 audio install applehda and AC97 in package kool and reinstall applehda v 0.4. (koolkal 10.4.10 combo update intel sse3 only.mpkg.zip). Wireless (RTL 8187) Doesn't work: Remote. webcams whith macam driver., 229553=7600GT required edit of Natit and NV40 kext and digital output won't work unless convert to analogue by adaptor. Make sure don't click X1000 ad NV40 support in 10.4.8 AMD Final SSE3 installation, then install latest Natit or Natit dual, then edit kext if 7600 GT., 94330=EVGA Geforce 7900GS work perfect with Macvidia driver. D-Link DGE-530T PCI Gigabit LAN works after applying the [skge.kext patch] and edit info.plist with 0x4C001186.}",
    "lastModified": "Mon, 09 Jun 2014 03:14:03 GMT",
    "textBeforeTable": "[edit] Abit [edit] AMD PLEASE INCLUDE THE SOUTH BRIDGE TOO Also please note which CPU you are using A comprehensive list of possible Intel chipsets [edit] Motherboard 6 Other Expansion Hardware 5.3 Wireless 5.2 Wired (Ethernet) 5.1 Device IDs 5 Network Cards 4 Sound Cards 3.4 Mobile 3.3 PCI 3.2.3 NVidia 3.2.2 ATi 3.2.1 Matrox 3.2 AGP 3.1.4 NVidia 3.1.3 Matrox 3.1.2 Intel 3.1.1 ATi 3.1 PCI Express 3 Graphics Cards 2.2 Intel 2.1 AMD 2 Processors 1.2.20 Tyan 1.2.19 Shuttle",
    "textAfterTable": "SiS 760GX/SiS 964 Sound and vdeo not tested (using vdeo Geforce2 Mx400). Ethernet SiS 900 doesn't work. IDE works perfectly. USB 2.0 also perfectly. Sata not tested. JaS 10.4.8 AMD.Intel SSE2.SSE3 defiant diskutil biker880 ICH7-R patch integrated.iso [edit] ECS Hardware Name (socket type) Chipset Notes Fully working without patching 760GX-M (V1.1) (Socket 754) SiS 760GX/964 Base devices work (USB, Firewire, PS/2). Must disable legacy USB devices in BIOS for PS/2 mouse and keyboard to work. Sound: Requires SiS 7012 Driver for correct line out/mic in. Ethernet: Requires Realtek 8139 Driver. ATA: Requires SiS Driver for all ATA channels to be active. All drives will appear as SATA devices, including DVD+-RW. SATA: Works when set to IDE mode in BIOS and ID 0x01801039 added to Info.plist in above driver in \"IOPCIPrimaryMatch\" under \"VIA SATA Controller\". Video: Basic VESA 3.0 framebuffer. AGP enabled with AGPGart.kext version extracted from this package. On board graphics are quite fast, but no QE/CI or OpenGL. Note: If AGPGart.kext is not modified QE AND CI are supported with nitan_uni.install. Sleep: Does not wake from sleep. Tubgirl: OSX_1048_AMD.iso (requires patches listed in Notes) NFORCE4M-A (v3.0)",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}