{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Catholic",
            "Mainline Protestant",
            "Black Protestant",
            "Other",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "93,334",
            "78,909",
            "47,961",
            "21,263",
            "14,123",
            "4,205",
            "275,358"
        ],
        [
            "Congregations",
            "306",
            "34",
            "143",
            "56",
            "41",
            "3",
            "-"
        ]
    ],
    "pageTitle": "Brookville, Ohio (OH 45309) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Brookville-Ohio.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00274-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 382565663,
    "recordOffset": 382431748,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6570=According to our research of Ohio and other state lists there were 15 registered sex offenders living in Brookville, Ohio as of August 04, 2015. The ratio of number of residents in Brookville to the number of sex offenders is 392 to 1., 128550=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!, 25268=Incorporated in 1978}",
    "TableContextTimeStampAfterTable": "{32740=Air Quality Index (AQI) level in 2012 was 91.9. This is worse than average., 48620=Educational Attainment (%) in 2013, 52164=2000 Presidential Elections Results, 16857=On 4/3/1974, a category F5 (max. wind speeds 261-318 mph) tornado 24.2 miles away from the Brookville village center killed 36 people and injured 1150 people and caused between $50,000,000 and $500,000,000 in damages., 34130=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.64. This is about average. Closest monitor was 4.7 miles away from the city center., 71597=5.27% of this county's 2010 resident taxpayers moved to other counties in 2011 ($40,700 average adjusted gross income), 140458=Total of 21 patent applications in 2008-2015., 141764=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 69397=4.87% of this county's 2011 resident taxpayers lived in other counties in 2010 ($36,349 average adjusted gross income), 78601=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population), 35555=Particulate Matter (PM10) [µg/m3] level in 2012 was 20.9. This is about average. Closest monitor was 4.7 miles away from the city center., 52736=2008 Presidential Elections Results, 17185=On 4/25/1961, a category F4 (max. wind speeds 207-260 mph) tornado 12.3 miles away from the village center injured 7 people and caused between $500,000 and $5,000,000 in damages., 53306=Graphs represent county-level data. Detailed 2008 Election Results, 51878=1996 Presidential Elections Results, 49018=School Enrollment by Level of School (%) in 2013, 52450=2004 Presidential Elections Results, 33392=Carbon Monoxide (CO) [ppm] level in 2012 was 0.212. This is significantly better than average. Closest monitor was 10.7 miles away from the city center., 53022=2012 Presidential Elections Results, 34855=Ozone [ppb] level in 2012 was 28.4. This is about average. Closest monitor was 11.9 miles away from the city center., 36304=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 9.32. This is about average. Closest monitor was 13.0 miles away from the city center.}",
    "textBeforeTable": "Religion statistics for Brookville village (based on Montgomery County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Bottled, tank, or LP gas (1%) Other fuel (3%) Electricity (26%) Utility gas (69%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 82 Montgomery County: 1.52 / 10,000 pop. Ohio: 1.89 / 10,000 pop. Number of supercenters and club stores: 8 This county: 0.15 / 10,000 pop. State: 0.13 / 10,000 pop. Number of convenience stores (no gas): 75 Montgomery County: 1.39 / 10,000 pop. Ohio: 1.25 / 10,000 pop. Number of convenience stores (with gas): 124 Montgomery County: 2.31 / 10,000 pop. State: 2.93 / 10,000 pop. Number of full-service restaurants: 310 Here: 5.76 / 10,000 pop. State: 6.25 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}