{
    "relation": [
        [
            "First Name",
            "Brian",
            "Catherine",
            "Raymond"
        ],
        [
            "Last Name",
            "Henneberry",
            "Haggett",
            "Paul"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=0FB6DF75-41D6-48CF-993B-08B5A5ECF415&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00284-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 222537473,
    "recordOffset": 222521564,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{54276=H.R. 10, Regulations From the Executive in Need of Scrutiny Act of 2011,To amend chapter 8 of title 5, United States Code, to provide that major rules of the executive branch shall have no force or effect unless a joint resolution of approval is enacted into law, entire bill Issues related to First Amendment rights S. 299, Regulations From the Executive in Need of Scrutiny Act of 2011, To amend chapter 8 of title 5, United States Code, to provide that major rules of the executive branch shall have no force or effect unless a joint resolution of approval is enacted into law, entire bill, 64669=H.R. 2682, Business Risk Mitigation and Price Stabilization Act of 2011, To provide end user exemptions from certain provisions of the Commodity Exchange Act and the Securities Exchange Act of 1934, and for other purposes, entire bill Commodity Futures Trading Commission Proposed Rule, \"Margin Requirements for Uncleared Swaps for Swap Dealers and Major Swap Participants\" (RIN 3038-AC97) General education regarding regulation of energy derivatives H.R. 1779, Federal Hiring Freeze Act of 2011, To amend title 5, United States Code, to reduce the number of civil service positions within the executive branch, and for other purposes, entire bill, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 64060=​An affiliated organization, INVISTA S.a r.l., disclosed on 2009 Q1 Form LD-2, has an interest in the specific issue listed above., 12298=H.R. 964, Federal Price Gouging Prevention Act, To protect consumers from price-gouging of gasoline and other fuels, and for other purposes, entire bill Energy Market Legislation Environmental Legislation H.R. 199, Protect America's Energy and Manufacturing Jobs Act of 2011, To suspend, during the 2-year period beginning on the date of enactment of this Act, any Environmental Protection Agency action under the Clean Air Act with respect to carbon dioxide or methane pursuant to certain proceedings, other than with respect to motor vehicle emissions, and for other purposes, entire bill H.R. 1380, New Alternative Transportation to Give Americans Solutions Act of 2011, To amend the Internal Revenue Code of 1986 to encourage alternative energy investments and job creation, entire bill H.R. 964, Federal Price Gouging Prevention Act, To protect consumers from price-gouging of gasoline and other fuels, and for other purposes, entire bill H.R. 1748, Taxpayer and Gas Price Relief Act of 2011, To provide consumers relief from high gas prices, and for other purposes, entire bill S. 782, Economic Development Revitalization Act of 2011, To amend the Public Works and Economic Development Act of 1965 to reauthorize that Act, and for other purposes, entire bill S.1392 : EPA Regulatory Relief Act of 2011, To provide additional time for the Administrator of the Environmental Protection Agency to issue achievable standards for industrial, commercial, and institutional boilers, process heaters, and incinerators, and for other purposes, entire bill H.R.2250 : EPA Regulatory Relief Act of 2011, To provide additional time for the Administrator of the Environmental Protection Agency to issue achievable standards for industrial, commercial, and institutional boilers, process heaters, and incinerators, and for other purposes, entire bill H.R 2401, Transparency in Regulatory Analysis of Impacts on the Nation Act of 2011, To require analyses of the cumulative and incremental impacts of certain rules and actions of the Environmental Protection Agency, and for other purposes, entire bill Renewable Fuels Reform, draft legislation S.1863, New Alternative Transportation to Give Americans Solutions Act of 2011, To amend the Internal Revenue Code of 1986 to encourage alternative energy investments and job creation, entire bill S. 2146, Clean Energy Standard Act of 2012, To amend the Public Utility Regulatory Policies Act of 1978 to create a market-oriented standard for clean electric energy generation, and for other purposes, entire bill, 62363=S. 1813, MAP-21, To reauthorize Federal-aid highway and highway safety construction programs, and for other purposes, entire bill, 58684=S. 847, Safe Chemicals Act of 2011, To amend the Toxic Substances Control Act to ensure that risks from chemicals are adequately understood and managed, and for other purposes, entire bill H.R. 901, Chemical Facility Anti-Terrorism Security Authorization Act of 2011, To amend the Homeland Security Act of 2002 to codify the requirement that the Secretary of Homeland Security maintain chemical facility anti-terrorism security regulations, entire bill, 39263=H.R. 1380, New Alternative Transportation to Give Americans Solutions Act of 2011, To amend the Internal Revenue Code of 1986 to encourage alternative energy investments and job creation, entire bill S. 1813, MAP-21, To reauthorize Federal-aid highway and highway safety construction programs, and for other purposes, entire bill S. 1863, New Alternative Transportation to Give Americans Solutions Act of 2011, To amend the Internal Revenue Code of 1986 to encourage alternative energy investments and job creation, entire bill, 74169=Agriculture FY2013 appropriations, draft language, 67980=S. 473, Continuing Chemical Facilities Anti-terrorism Security Act of 2011, To extend the chemical facility security program of the Department of Homeland Security, and for other purposes, entire bill S. 1483, Incorporation Transparency and Law Enforcement Assistance Act, To ensure that persons who form corporations in the United States disclose the beneficial owners of those corporations, in order to prevent wrongdoers from exploiting United States corporations in ways that threaten homeland security, to assist law enforcement in detecting, preventing, and punishing terrorism, money laundering, and other misconduct involving United States corporations, and for other purposes, entire bill H.R. 3416, Incorporation Transparency and Law Enforcement Assistance Act, To amend title 31, United States Code, to ensure that persons who form corporations or limited liability companies in the United States disclose the beneficial owners of those corporations or limited liability companies, in order to prevent wrongdoers from exploiting United States corporations and limited liability companies for criminal gain, to assist law enforcement in detecting, preventing, and punishing terrorism, money laundering, and other misconduct involving United States corporations and limited liability companies, and for other purposes, entire bill S. 2105, Cybersecurity Act of 2012, To enhance the security and resiliency of the cyber and communications infrastructure of the United States, entire bill S. 2151, SECURE IT, To improve information security, and for other purposes, entire bill H.R. 3523, Cyber Intelligence Sharing and Protection Act of 2011, To provide for the sharing of certain cyber threat intelligence and cyber threat information between the intelligence community and cybersecurity entities, and for other purposes, entire bill H.R. 4263, SECURE IT Act of 2012, To improve information security, and for other purposes, entire bill H.R. 3674, PRECISE Act of 2011, To amend the Homeland Security Act of 2002 to make certain improvements in the laws relating to cybersecurity, and for other purposes, entire bill. H.R. 901, Chemical Facility Anti-Terrorism Security Authorization Act of 2011,To amend the Homeland Security Act of 2002 to codify the requirement that the Secretary of Homeland Security maintain chemical facility anti-terrorism security regulations, entire bill H.R. 908, Full Implementation of the Chemical Facility Anti-Terrorism Standards Act, To extend the authority of the Secretary of Homeland Security to maintain the Chemical Facility Anti-Terrorism Standards program, entire bill S. 709, Secure Chemical Facilities Act, To enhance the security of chemical facilities and for other purposes, entire bill, 44172=S. 2155, A bill to amend the Farm Security and Rural Investment Act of 2002 to promote biobased manufacturing, To amend the Farm Security and Rural Investment Act of 2002 to promote biobased manufacturing, entire bill S. 1658, REFRESH Act of 2011, To reform and reauthorize agricultural programs, and for other purposes, entire bill Monitor Farm Bill progress and energy programs/subsidies H.R. 2682, Business Risk Mitigation and Price Stabilization Act of 2011, To provide end user exemptions from certain provisions of the Commodity Exchange Act and the Securities Exchange Act of 1934, and for other purposes, entire bill Biomass Crop Assistance Program (BCAP), Farm Bill Proposal H.R. 2779, To exempt inter-affiliate swaps from certain regulatory requirements put in place by the Dodd-Frank Wall Street Reform and Consumer Protection Act, entire bill, 48867=H.R. 1380, New Alternative Transportation to Give Americans Solutions Act of 2011, To amend the Internal Revenue Code of 1986 to encourage alternative energy investments and job creation, entire bill H.R. 1864, Mobile Workforce State Income Tax Simplification Act of 2011, To limit the authority of States to tax certain income of employees for employment duties performed in other States, entire bill S. 1863, New Alternative Transportation to Give Americans Solutions Act of 2011, To amend the Internal Revenue Code of 1986 to encourage alternative energy investments and job creation, entire bill Business Tax Reform Corporate and International Tax Reform, draft legislation H.R. 2735, To amend the Internal Revenue Code of 1986 to make permanent the look-through treatment of payments between related controlled foreign corporations, entire bill Senate Mobile Workforce State Income Tax Simplification Act, draft legislation S. 2091, United States Job Creation and International Tax Reform Act of 2012, To amend the Internal Revenue Code of 1986 to reform the international tax system of the United States, and for other purposes, entire bill H.R. 3630, Middle Class Tax Relief and Job Creation Act of 2012, To provide incentives for the creation of jobs, and for other purposes, entire bill S. 1813, MAP-21, To reauthorize Federal-aid highway and highway safety construction programs, and for other purposes, entire bill Potential legislation related to taxation of capital gains and dividends income, 28601=S.1392, EPA Regulatory Relief Act of 2011, To provide additional time for the Administrator of the Environmental Protection Agency to issue achievable standards for industrial, commercial, and institutional boilers, process heaters, and incinerators, and for other purposes, entire bill S.847, Safe Chemicals Act of 2011, To amend the Toxic Substances Control Act to ensure that risks from chemicals are adequately understood and managed, and for other purposes, entire bill S. 228, Defending America's Affordable Energy and Jobs Act, To preempt regulation of, action relating to, or consideration of greenhouse gases under Federal and common law on enactment of a Federal policy to mitigate climate change, entire bill H.R. 910, Energy Tax Prevention Act of 2011, To amend the Clean Air Act to prohibit the Administrator of the Environmental Protection Agency from promulgating any regulation concerning, taking action relating to, or taking into consideration the emission of a greenhouse gas to address climate change, and for other purposes, entire bill S. 231, EPA Stationary Source Regulations Suspension Act, To suspend, until the end of the 2-year period beginning on the date of enactment of this Act, any Environmental Protection Agency action under the Clean Air Act with respect to carbon dioxide or methane pursuant to certain proceedings, other than with respect to motor vehicle emissions, and for other purposes, entire bill H.R 2401, Transparency in Regulatory Analysis of Impacts on the Nation Act of 2011, To require analyses of the cumulative and incremental impacts of certain rules and actions of the Environmental Protection Agency, and for other purposes, entire bill S. 482, Energy Tax Prevention Act of 2011, To amend the Clean Air Act to prohibit the Administrator of the Environmental Protection Agency from promulgating any regulation concerning, taking action relating to, or taking into consideration the emission of a greenhouse gas to address climate change, and for other purposes, entire bill H.R.2250,EPA Regulatory Relief Act of 2011, To provide additional time for the Administrator of the Environmental Protection Agency to issue achievable standards for industrial, commercial, and institutional boilers, process heaters, and incinerators, and for other purposes, entire bill, 19380=Public Law 111-203, Dodd-Frank Wall Street Reform and Consumer Protection Act, proposed regulations implementing Title VII (Wall Street Transparency and Accountability). S. 1483, Incorporation Transparency and Law Enforcement Assistance Act, To ensure that persons who form corporations in the United States disclose the beneficial owners of those corporations, in order to prevent wrongdoers from exploiting United States corporations in ways that threaten homeland security, to assist law enforcement in detecting, preventing, and punishing terrorism, money laundering, and other misconduct involving United States corporations, and for other purposes, entire bill H.R. 3416, Incorporation Transparency and Law Enforcement Assistance Act, To amend title 31, United States Code, to ensure that persons who form corporations or limited liability companies in the United States disclose the beneficial owners of those corporations or limited liability companies, in order to prevent wrongdoers from exploiting United States corporations and limited liability companies for criminal gain, to assist law enforcement in detecting, preventing, and punishing terrorism, money laundering, and other misconduct involving United States corporations and limited liability companies, and for other purposes, entire bill H.R. 2779, To exempt inter-affiliate swaps from certain regulatory requirements put in place by the Dodd-Frank Wall Street Reform and Consumer Protection Act, entire bill H.R. 2682, Business Risk Mitigation and Price Stabilization Act of 2011, To provide end user exemptions from certain provisions of the Commodity Exchange Act and the Securities Exchange Act of 1934, and for other purposes, entire bill Public Law 112-106, H.R. 3606, Jumpstart Our Business Startups Act, To increase American job creation and economic growth by improving access to the public capital markets for emerging growth companies, entire bill, 34215=S. 711, Secure Water Facilities Act, To amend the Safe Drinking Water Act and the Federal Water Pollution Control Act to authorize the Administrator of the Environmental Protection Agency to reduce or eliminate the risk of releases of hazardous chemicals from public water systems and wastewater treatment works, and for other purposes, entire bill H.R.2250, EPA Regulatory Relief Act of 2011, To provide additional time for the Administrator of the Environmental Protection Agency to issue achievable standards for industrial, commercial, and institutional boilers, process heaters, and incinerators, and for other purposes, entire bill H.R. 2401, Transparency in Regulatory Analysis of Impacts on the Nation Act of 2011, To require analyses of the cumulative and incremental impacts of certain rules and actions of the Environmental Protection Agency, and for other purposes, entire bill H.R. 910, Energy Tax Prevention Act of 2011, To amend the Clean Air Act to prohibit the Administrator of the Environmental Protection Agency from promulgating any regulation concerning, taking action relating to, or taking into consideration the emission of a greenhouse gas to address climate change, and for other purposes, entire bill H.R. 2018, Clean Water Cooperative Federalism Act of 2011, To amend the Federal Water Pollution Control Act to preserve the authority of each State to make determinations relating to the State's water quality standards, and for other purposes, entire bill S.1392, EPA Regulatory Relief Act of 2011, To provide additional time for the Administrator of the Environmental Protection Agency to issue achievable standards for industrial, commercial, and institutional boilers, process heaters, and incinerators, and for other purposes, entire bill, 24600=S.158, Surface Transportation Board Reauthorization Act of 2011, To reauthorize the Surface Transportation Board, and for other purposes, entire bill H.R. 763, Safe and Efficient Transportation Act of 2011, To amend title 23, United States Code, with respect to vehicle weight limitations applicable to the Interstate System, and for other purposes, entire bill S. 1813, MAP-21, To reauthorize Federal-aid highway and highway safety construction programs, and for other purposes, entire bill H.R. 7, American Energy and Infrastructure Jobs Act of 2012, To authorize funds for Federal-aid highway, public transportation, and highway and motor carrier safety programs, and for other purposes, entire bill}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20005-2099 Country USA 3. Principal place of business (if different than line 2) City  Wichita State  KS Zip Code  67220 Country  USA 4a. Contact Name b. Telephone Number c. E-mail  Ms.  Jenny Kim  2028798569  jenny.kim@kochps.com 5. Senate ID#  400390816-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}