{
    "relation": [
        [
            "Payment method",
            "",
            "Money Order/Bank cheque",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Pink I'M NOT Dead CD NEW | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/PINK-IM-NOT-DEAD-CD-NEW-/360335043035?pt=AU_Audio_CDs&hash=item53e5a469db",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 402049239,
    "recordOffset": 401998882,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{69582=I'm Not Dead is the fourth album by pop singer Pink, released in North America on April 4, 2006  it was released a day earlier in most other territories. Pink worked with producers and songwriters Billy Mann, Josh Abraham, Max Martin, Luke Gottwald, Butch Walker and Mike Elizondo. The tracks range from the intrinsically personal to political. The album was originally titled Long Way to Happy, after the song of the same name, but Pink changed her mind because she thought I'm Not Dead made a stronger statement that this was a comeback album.}",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at The buyer is responsible for return postage costs. Money Back 30 days after the buyer receives it Refund will be given as Item must be returned within Return policy receiving cleared payment - opens in a new window or tab. Will usually post within 1 business day of Domestic handling time",
    "textAfterTable": "Seller's payment instructions AUSTRALIAN BUYERS the payment options are Commonwealth Bank Deposit, Paypal, Australian Money Orders BUYERS OUTSIDE AUSTRALIA the only payment method is Paypal Buyers are to make contact within 3 days and have their payment finalized within 7 days. When paying by Bank Deposit please leave your Ebay ID or your postcode as the reference Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}