{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I am back to school after 10 years and didn't feel the least bit out of place. It's wonderful for returning students.",
            "Phenomenal, couldn't be happier with what I got for what tuition costs.",
            "Running near the campus is very nice. Beautiful area, on both campuses.",
            "Great, inexpensive, overall nice offering.",
            "I had a misconception that a community college would be easier than the University, and was completely wrong, it was challenging in a very good way.",
            "Get to know your professors.",
            "This place is great, reminds me of the University I got my degree from. Very nice, clean, organized. I preferred going here over the other Colleges which were much closer to where I live."
        ]
    ],
    "pageTitle": "Red Rocks Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Red-Rocks-Community-College/reviews?_escaped_fragment_=/show/87834",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00211-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906955135,
    "recordOffset": 906903116,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{268133=© 2015, Cappex.com, LLC, 166405=Classes are very cheap compared to many other colleges and universities [~$2500 per semester for a full time student]. Many discounted or free services are available and paid for by the student fees.}",
    "textBeforeTable": "05/17/2012 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 68 Manda from Thornton, CO Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "In three sentences Red Rocks is a great school. I am 26 years old and work full time, and Red Rocks made it really easy for me to go to school online. I loved all of the classes I took over the last two years and I would recommend every single one of my teachers. I felt that each teacher was passionate about teaching and was very active in engaging students, which I k ow is not always easy. I have found that when I am on a school break, I long to be back in school and I think that part of the reason for this is because Red Rocks is a great school. One more thing I would like to add that I particularly liked about RRCC is the small campus!! Login to rate or flag the reviews Casey from Denver, CO 02/05/2010 Reviewer is A current student here. 2 out of 2 people found this review useful. 2 of 68 Categories Comments Bang for the buck Red Rocks has",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}