{
    "relation": [
        [
            "Image",
            "504:00",
            "505:00",
            "506:00",
            "507:00",
            "508:00",
            "509:00",
            "510:00",
            "511:00",
            "512:00",
            "513:00",
            "514:00",
            "515:00",
            "516:00",
            "517:00",
            "518:00",
            "519:00",
            "520:00",
            "521:00",
            "522:00",
            "523:00",
            "524:00",
            "525:00",
            "526:00",
            "527:00"
        ],
        [
            "Time",
            "22/00:00",
            "22/01:00",
            "22/02:00",
            "22/03:00",
            "22/04:00",
            "22/05:00",
            "22/06:00",
            "22/07:00",
            "22/08:00",
            "22/09:00",
            "22/10:00",
            "22/11:00",
            "22/12:00",
            "22/13:00",
            "22/14:00",
            "22/15:00",
            "22/16:00",
            "22/17:00",
            "22/18:00",
            "22/19:00",
            "22/20:00",
            "22/21:00",
            "22/22:00",
            "22/23:00"
        ],
        [
            "Original image hash",
            "033eb40ad0c4a1768481dfca0dfebcf8056b1eac8b4c81fe9c527d0f36318e50.png",
            "5bdb7df9be231abcea11e0bea70da5647d9c7fd696c9203502257d4be0d9c961.png",
            "912a35da2e23348fece426cee796aea94a7fc495ab85037724a3602951210946.png",
            "e1642663abe0df4369ce34456920dd62ee082a7352dae9790afe4831545cfda9.png",
            "e000665a9f5dad2bae0fe76319ad5d6b28f2728d827a32fe58ba8996cc16f836.png",
            "3c48b2bc3e461943aa8c750f14166e0f269496441feb15af96d019c780aa6aad.png",
            "b3a789400017eee98b773f3e67c0bff8ba826543f694e8dd408f805c69a851a4.png",
            "44970c6707be3b0e9de111d43c18d6cf455286e44bfa456037157500afafa60a.png",
            "cd03b5308807c5931ab9735cbcfa8563fe8fa6062dc6da2a5632b8f339a9133f.png",
            "d46519af37be319d669e721c4efa73fda1256422833fdbfc26f3f311efa32dd1.png",
            "47af6d1986a86e3161fdfde5c75a7554c20da3fa27114776d74c654a5eb2aa33.png",
            "5b562db10d93a8dc9c9734d4833630a7bda65bf35166cd27d658fde20f46772b.png",
            "8f6c6024e1299fee95941d55f348e176ffdc3cbbca58b0e8152c134e09c1a896.png",
            "88dd86d52f26487cf07e2e2dcb487c115589b1710479fea1ac2d54a161ab40b5.png",
            "c13d1010939e8bc175e8be06362bce73230a859bcbd682bc53ab9cd913ea7e06.png",
            "d72b6b9bd8e9e37cd8b0ad060c2f60e0a7c00e47fddefb12e339a2d2f59b40c0.png",
            "677dcc253fcb42f5cb3179596366dea3113f4e064b01b584222434c4797aa652.png",
            "87d340523cfd7aa3b9c009779444141bd61d006c9cb6cf25458515d038c800ef.png",
            "1e14a815a6150bb1ca6ca07adf1292cc1b93ae59ce9814b2726dc82ddfcfd636.png",
            "abd5676897db7cad0baaa2650006d6176a920b16b9e56e6f8218f74e1bdf87af.png",
            "92cb7e2a4d678123b81e5cb3ef3d1a76541fc4b4cf2e40766e628cee9d6afd13.png",
            "95da0525eb29e7f78fc303206029cb4b929523f3af4bbd679dd248ad397421b9.png",
            "bc581767471defed5e906a48b4bc488975a90b43d3f3a02f33aea38134d6727a.png",
            "8035d32a8d8751e367b906a44caa1e71972a884ba9d76748677613dedea92ea7.png"
        ]
    ],
    "pageTitle": "1190: Time - explain xkcd",
    "title": "",
    "url": "http://www.explainxkcd.com/wiki/index.php?title=1190:_Time&diff=35570&oldid=35567",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00329-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 443049595,
    "recordOffset": 442856191,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1797=Let's do 1017, but using current frame instead of a progress bar. Does anyone know what formula should we use for this? Something similar to the one in [[1017] won't work, because we don't know when (if ever) the Time will end. I was thinking about T = c + n * (1 hour), where n is current frame and c is a couple of days before the beginning of Time, but it seems too boring. --DiEvAl (talk) 14:57, 11 June 2013 (UTC)}",
    "TableContextTimeStampAfterTable": "{548329=I did mean \"Simple English\" as Randall did mention before, not only here Up Goer Five. Look at this WIKI for Simple English Wiki--Dgbrt (talk) 23:09, 22 May 2013 (UTC), 463719=Just an afterthought, a meteor hit directly on the sand castle would let Randall go out in a blaze of glory. I hope beret girl is OK.Galois (talk) 23:27, 28 April 2013 (UTC), 477767=It will end with image 1190, of course. 66.38.57.117 16:54, 30 April 2013 (UTC), 717410=Probably the \"strangers\" ought to be called the \"castle people\" since that is how Megan and Cueball seem to think of them. Taibhse (talk) 09:35, 17 July 2013 (UTC), 681478=I think it's an telescope or something like this. Maybe they see the sea rising with this thing... Joggl (talk) 19:22, 11 July 2013 (UTC), 473492=Just wanted to say: I don't think the beret girl is a girl at all. It's a boy with an old-fashioned navy-style cap. Popular with boys at the beach (in the old days). See images here (http://i180.photobucket.com/albums/x130/JTMarcus/h1.jpg) and here (http://cabinetcardgallery.files.wordpress.com/2011/10/kidwithcap_0003.jpg) I also like the fact that, just before the castle completely fades away, you can barely see the little boy bringing more materials (maybe another support beam?) to continue the work. I like the continuity of letting the beret boy (not girl), 364468=Megan just wheeled in a trebuchet! This is going to be fun! 69.246.10.71 16:34, 29 March 2013 (UTC) Now she's launching a rock. I wonder which tower it might hit. March 2013, at 17:08. Flew over the first two and might impact far right tower if it continues. 17:48, 561318=Go to a vineyard in late summer or early autumn, you will not see the \"The Planting People\". We only know that we are at this particular season because they can eat grapes from that plants and before they could swim in the sea. And both are following the sun in the morning, witch does mean they are walking East. --Dgbrt (talk) 19:28, 29 May 2013 (UTC), 414156=How could a small hill of sand stopped the entire sea. The world might be two dimensional, or Randall might have wanted to gain some time but it doesn't make much sense. 212.253.22.219 (talk) 12:06, 16 April 2013‎ (UTC) (please sign your comments with ~~~~), 426346=In the frame-by-frame breakdown, the \"Image\" field simply gives the time in hours, while the \"Time\" field gives the time in days+hours. It would be helpful if the \"Image\" field instead gave an ordinal number indicating the number of frames (e.g., this would help to correlate the Transcript on this page with the frame numbers here. The current \"Image\" field need not be deleted (I personally prefer time in hours to time in days+hours), but it might be relabeled as \"Time in Hours\". Implementing this would require some use of scripts, and would be best if adopted by the person updating the frame-by-frame breakdown in the first place. 132.236.6.90 16:42, 19 April 2013 (UTC), 776891=It's Gilligan's Island! Sorry couldn't help it.69.126.70.32 19:02, 26 July 2013 (UTC), 595929=Journey update: As of (right edge of) image 2103, they climbed 1290 pixels or 193.5 ft (59 m) from the place the two slept by the small river (image 1908). Galois (talk) 18:30, 15 June 2013 (UTC), 332627=http://pastebin.com/dLiWsFyN 79.180.173.88 09:48, 25 March 2013 (UTC), 585655=(please sign your posts - don't worry, we're all here out of a mutual enjoyment of the xkcd comics) Actually, I looked into the possibility a while back, but it didn't work. Randall runs 3-5 frame updates with the two walking across the same panel. As they leave one panel on the right, they enter the next on the left (and visa-verse for the trip back to the sunken castle). Additionally, I only came across three panels that didn't adjoin perfectly (one in the sand dunes and two trees that didn't continue into the next panel). Galois (talk) 11:12, 6 June 2013 (UTC), 785552=If Randall is reading: Thanks for the story. We all loved it. 206.191.28.43 21:25, 26 July 2013 (UTC)dbuck, 709719=Megan started wearing a backpack after they left the tower. They lost Cueball's backpack when the animal clawed it up, so he carried everything in Megan's to keep weight off her leg. That ointment must be good stuff if she's able to walk with a backpack. The locals must have given her a new one.--Gerry (talk) 01:50, 16 July 2013 (UTC), 647519=Has anyone been able to map exactly where the sun is on the stars? That would show where in the precession sequence we are. If it's in Libra, for example 15,000 years forward the sun would set in Libra around June at 31-32 degrees north at that point. Which would explain the grapes and the camping without shelter. Tavella (talk) 20:27, 28 June 2013 (UTC), 597872=I believe Randall is writing this as it goes along, preparing the scenes only a little bit in advance. The story (quest?) reads more like a series of isolated vignettes, but with a few themes being carried forward, such as the quest for the source of the rising sea. I'm here in homage to Randall's unique wit and humor, and having fun trying to second guess what he'll do next. I don't believe the setting is an actual place, but we have several clues that limit its location. I see this as a collection of disparate objects and events; some go together, some not, but with some running themes. Randall may be making some points (such as conservation, ecology, and not eating squirrels); although, I would have never filled a canteen from the small river without first boiling or purifying the water. Galois (talk) 14:27, 8 June 2013 (UTC), 757624=78.108.152.10 14:37, 21 July 2013 (UTC), 484562=Not sure if it has ever been brought up but has anyone noticed it says \"BTC 1NEPgrUmed3VyXpqbYZom7YVJ8MozYrNWx We did not invent the algorithm. The algorithm consistently finds Jesus. The algorithm killed Jeeves. The algorithm is banned in China. The algorithm is from Jersey. The algorithm constantly finds Jesus. This is not the algorithm. This is close.\" at the bottom of every page. i could not find this algorithm anywhere else 74.4.25.11 18:58, 1 May 2013 (UTC), 588533=OK, apparently it was completely broken at that time. I just felt I needed to ask, since I wasn't downloading actual images at that time, just the references, and so I have a broken reference in my list. --Divad27182 (talk) 02:03, 7 June 2013 (UTC), 487847=Has anyone considered connections to this already? http://www.oldielyrics.com/lyrics/the_alan_parsons_project/time.html Greyhoundc (talk) 12:38, 7 May 2013 (UTC), 690448=So are they getting sleepy from the bad night's sleep or something more nefarious? 216.239.45.92 05:31, 10 July 2013 (UTC), 408472=Has it slowed to once every 2 hours for new frames? --209.74.126.175 14:12, 13 April 2013 (UTC), 464669=The early 80s song Fade to Grey from the band Visage comes to my mind. Memories of what happened start to fade over time and get more and more pale. 213.23.38.20 (talk) (please sign your comments with ~~~~), 520359=It seems like the two river halves (or two rivers) merge as Megan and Cueball hike upstream. New point: I joined all the images covering their journey since image 1150 (last stop for water). it spans 18204 pixels. Assuming Cueball is 6 feet tall (wild guess + it's an even number), they have now hiked a total of 0.517 miles (83228.7 cm) from image 1150.Galois (talk) 13:32, 10 May 2013 (UTC), 409554=Yes, I haven't been able to retrieve anything since 23:40 EDT. Larry (talk) 06:05, 14 April 2013 (UTC), 615459=As we now know that they are in the Mediterranean region, a Eurasian lynx or an Iberian lynx look quite good guesses but the cat in the comic has a tail that is too long and it doesn't have ear tufts. I guess if it is far enough in the future, the distribution of animals could have changed, so it might be Caracal (desert lynx), a Serval or an African golden cat. Of course if it is even further in the future, it might be a whole new species that doesn't currently exist.NHSavage (talk) 21:11, 20 July 2013 (UTC), 52603=Below is the list of all the frames of the comic, in the order that they were revealed. The given times denote the time since the comic was initially released on midnight, March 25, 2013, Eastern Daylight Savings Time (UTC - 0400)., 390341=Looks like they are re-enacting the trebuchet incident on the mini-castle. AH --108.244.73.186 23:53, 5 April 2013 (UTC), 438806=For me, this is clearly about cancer and the impacts it has on a relationship over time. Randall's now wife was diagnosed and treated for cancer recently and through this comic, he's trying to portray the anxious wait they faced through treatment and remission. He has put us into his shoes by keeping us waiting in suspense to see how things end up. The passing of time represents their life together. At first it's just them relaxing together, probably the dating phase. Soon they start building a life together, represented by the sand castle. The castle evolves over time, much like their life has. Difficulties and gaffes in their relationship are depicted, for example when cueball trips and breaks down part of the wall. Eventually all efforts are diverted and put into defending against the approaching sea, which represents the cancer. The wall, the platform, all represent the steps taken to prevent and/or prepare for it's impending progress. The river represents the cure for cancer, which is still pretty far out, as cueball mentioned. There are many many more clues I see and explanations I can give to support this idea (castle in the sky, the rain, progress with research, etc.), but this is just starting point. I'm excited to see where the comic will end up, but I guess we just need to \"wait for it\". --Nick (talk) 21:25, 24 April 2013 (UTC), 612101=Why is everyone assuming the location corresponds to an actual modern day location (e.g. Madagascar)? Given that http://xkcd.com/505/ is staged on an infinite plane full of rocks we shouldn't limit our search to the real, simply the rational. 216.239.45.91 14:32, 21 June 2013 (UTC), 736607=By the way, Cueball and Megan have walked quite a long distance. On Hair Woman's map their home appears to be due south of If, same longitude, and roughly at the latitude of Sassari, Sardinia. A minute of latitude is a nautical mile, essentially, and they walked a polygonal path, not a straight line north; a couple hundred nautical miles, at least. That's a long walk. Taibhse (talk) 05:30, 19 July 2013 (UTC), 462541=Beret Girl at 950! Bdemirci (talk) 18:18, 28 April 2013 (UTC), 507009=--Dgbrt (talk) 19:54, 6 May 2013 (UTC), 556993=This may be more speculation than not, but the two turned north to follow the river and are now walking on a heading somewhere between NE and NW, which puts them in the northern hemisphere if they can see their shadow in front of them. This is also confusing since there aren't many Grandidier's Baobab trees there [7].Galois (talk) 20:46, 29 May 2013 (UTC), 480161=Wait, what? It looks like they are suddenly back at a beach that looks the same as the first one, just zoomed out. But before when the scene was presumably inverted, the terrain didn't look quite like that. If the scene really did get inverted, maybe they aren't actually on a beach right now, but the sea will eventually expand until it reaches them. Then again, we don't know if this is the same plane of space that the original beach was either. They were just walking to the right. The concept of space in this comic is confusing me right now. I wonder if this will make sense later. 129.21.63.158 18:41, 30 April 2013 (UTC), 504836=I found a way to updates the pictures, it's just a little bit tricky... --Dgbrt (talk) 19:25, 6 May 2013 (UTC), 308758=Can't tell if this is emo xkcd or trolling xkcd. Alpha (talk) 04:53, 25 March 2013 (UTC), 755601=\"I think there's stuff floating on the sea... I think something on the sea.\" Frame 3024 and Frame 3025 -- Ship? 216.239.45.91 23:30, 23 July 2013 (UTC), 323332=http://www.explainxkcd.com/wiki/images/f/f8/time.png http://imgs.xkcd.com/comics/time/1e349a579b5f9b5ed487ddf7e88244b70330941ddedac9c6abf6ed2e3f589b97.png http://imgs.xkcd.com/comics/time/752687b61523144c61736cd89f8c153dc41e19128f72d78d44947ff800f057fa.png http://dl.dropbox.com/u/932170/timeasdf.png http://dl.dropbox.com/u/932170/time6.png, 351031=---Thanks for the script!. Ctrl+Shift+J on Windows Chrome Shine (talk) 13:11, 27 March 2013 (UTC), 541733=\"Description: The allocated data traffic of the hosting account for this website has been exceeded and the website is temporarily suspended\" Maybe we should host the map here on the wiki? --DiEvAl (talk) 20:14, 30 May 2013 (UTC), 381621=This comic has been running and updating so long I think perhaps it is a sand castle creation/destruction program that autonomously lets the two indefinitely build, destroy and rebuild new sand castles all the time… 80.101.210.21 09:55, 4 April 2013 (UTC), 562306=Finally seeing where all the wood came from -- stumps everywhere. Tavella (talk) 21:28, 3 June 2013 (UTC), 769127=Frame 3060 \"Is there any way to keep us pointing forward?\" \"We could start calling this the front.\" Clearly, someone is a mathematician. JimmyK4542 (talk) 21:37, 25 July 2013 (UTC), 362318=I don't think the title text is a reference to anything except for... wait for it... THE MONGOLS ;-) 81.23.24.34 23:00, 28 March 2013 (UTC), 669651=Here is an animated gif with enhanced brightness. You can see the Milky Way in the beginning and by the end some birds appear in the sky.--Dgbrt (talk) 11:51, 1 July 2013 (UTC), 335871=When I saw this comic last night and that there was no explanation up, I thought to myself \"How zen.\" I figured that Randall was going through a calm streak before throwing us the utterly ridiculous April 1st comic. Did it come early, or does he have something even bigger planned for us? 76.106.251.87 07:05, 26 March 2013 (UTC), 493420=All frames and hashes are automatically saved to http://xkcd.mscha.org/. Patzer (talk) 12:53, 3 May 2013 (UTC), 670469=Since we r watching the scene toward west, shouldn't the sky appear darker near the horizon, with respect to the sky above, at sunrise? (I'm asking here but of course I'm not referring to your animated gif but to the xkcd scene itself...) 217.200.201.97 11:46, 2 July 2013 (UTC), 682656=just - what's going on??! 83.8.22.78 22:15, 6 July 2013 (UTC), 432288=I just setup an own cronjob which checks the image hash periodly and writes them to a list when its changed: http://panther.stummi.org/xkcdtime.txt It checks every 10 minutes so it also should notice if the interval changes --Stummi (talk) 09:12, 21 April 2013 (UTC), 451559=I agree - the water has started eroding the castle to the right, and it makes sense for the erosion to potentially loop the comic back to frame 1. That said, the title text was \"wait for it\". This could be a euphamism suggesting \"keep waiting, this comic changes\", but it does have an implication that there is a \"finale\" to the comic that you should wait for. Hard to tell as it's vague. TheHYPO (talk) 13:54, 26 April 2013 (UTC), 616626=They're back to the kitty! Will it run, or does it bear a grudge? 121.72.165.205 04:09, 22 July 2013 (UTC), 704078=I'm guessing the cake-house of the Big Translator Guy is going to look like a sandcastle, thus the Oh, Wow from Megan. Tavella (talk) 18:31, 15 July 2013 (UTC), 620931=After noticing the snafu around 2231-2232, I whent and re downloaded the full set from imgs.xkcd.org and what I downloaded today doesn't match what I downloaded before (generally when they were <24h old). Everything from 1068 back seems to be a pixle match for what is there now but have different MD5s and is generally smaller. 216.239.45.91 20:31, 21 June 2013 (UTC), 373774=I'm seeing some strange stuff now. I have a script that uses wget of time.png to get the redirected hash png like Lockyy is doing. And I can verify that when you go to the 1190 page in the browser you get a different hash. But the previous hour and this hour, unlike the ones before it, the two hash pngs are different. And when I refresh the screen in my browser at the 1190 page, first I see the image I get from time.png, then the image refreshes with the other one. I'm not sure what this means or what we are supposed to do with it. I added the time.png hashes to the table for the last two hours but we probably need a way of indicating the difference. -- Bugstomper (talk) 20:38, 30 March 2013 (UTC), 622016=Can it just be about Mr. Munroe's life? I don't know many personal details, but it would be easy to draw about and still be important without being funny. --Irino. (talk) 04:39, 24 June 2013 (UTC), 540537=This map is a great job and when we do know that this is correct we have include it here.--Dgbrt (talk) 20:51, 17 May 2013 (UTC), 607759=Nom nom nom. The end. 121.74.128.126 23:54, 20 June 2013 (UTC), 718418=Maybe the castle is there to defend humans against other creatures. So other humans are always welcome, even if they don't wear silly hats.134.102.219.242 12:58, 17 July 2013 (UTC), 348996=Is it just me, or do the last two frames look like someone just threw a rock at the castle? 67.167.81.143 14:20, 29 March 2013 (UTC), 646725=So, how far away are we viewing them from? We know (about) how tall Cueball is and the stars give us an angular ruler so we should be able to figure that out. Also, when will sunrise be? 99.72.154.66 03:54, 28 June 2013 (UTC), 540809=Map URL has changed (old URL displays link to new URLs). New map links: JavaScript version and non-JS version - Acrisius (talk) 13:37, 28 May 2013 (UTC), 320304=It's entirely possible that the \"hash\" is actually randomly generated. Just a thought. 129.21.119.153 07:03, 25 March 2013 (UTC), 488769=Okay, so it didn't end with 1190. Must have misread the prophecies. 66.38.57.117 00:51, 9 May 2013 (UTC), 578802=Now either that's a pet cat or this just got less PG. Also, the thing that showed up by the cairn is the right height for a nose. 216.239.45.91 23:06, 20 June 2013 (UTC), 619967=I'll take a shot... The bottom part is curved and aligns perfectly with Cueball's head in Photoshop, just cutoff on the left (and the right as it goes out of frame). The rounded slice at the top matches Megan's head as well. The full slice does not match any scene to date (the only one close is 1885 with Megan in the tree, but that's not it); thus, it must be a slice from a future scene (or maybe part of a template with assorted characters). Galois (talk) 16:20, 21 June 2013 (UTC), 671921=These clouds moving with the sky could be the milkyway. FG 10:18, 4 July 2013 (UTC), 617490=I'm surprised nobody has mentioned or come up with theories about Frame 2188. I guess we now know that it was the cat stalking them. --68.147.179.172 01:04, 21 June 2013 (UTC), 385296=Could Cueball and Megan be building a European city, as it evolved, was damaged and remodelled where 1 day of strips is 100 years? Maybe Cueball is curretly remodelling Notre Dame de Paris or Westminster??? If so, it should get interesting around day 17 129.238.237.96 17:34, 4 April 2013 (UTC)rbnm, 733521=Frame 2909 confirms that this is the future, as it refers to it happening before, when our ancestors (\"parents\") were learning to walk upright, i.e. 3-6 million years ago. KenBrown (talk) 06:44, 19 July 2013 (UTC), 471468=And now we're off to see the wizard!! This is great! A comic within a comic! Taibhse (talk) 17:23, 29 April 2013 (UTC), 505892=--Dgbrt (talk) 19:41, 6 May 2013 (UTC), 116555=changing to 89fbcd5accd704c98f0e79b4adee58c7490cca4e53a508ceb050a78ceffd2611.png, 734509=It does resemble Chateau D'If. [25]. The distant future is sounding more reasonable than the distant past. 206.191.28.43 01:48, 19 July 2013 (UTC)dbuck, 761551=Cueball is concerned that the water is fresh. Although this may seem to disprove the theory that the Atlantic is flooding into the Mediterranean, it actually doesn't. Notice that Cueball \"felt\" that something was strange. What was strange was that they were accustomed to an extremely salty sea. Can you imagine filling up the Mediterranean Sea with ocean water then cutting it off from the Atlantic and allowing it to evaporate down to the size of C&M's sea? It would be extremely salty and you could float easily in it. The water from the Atlantic Ocean is nowhere near that salty so Cueball interprets it as fresh water. This will cause problems with the rescue because these people are not used to swimming in water that's not super salty. They can't float like they're used to and risk drowning. 198.103.184.76 16:32, 23 July 2013 (UTC)dbuck, 322442=220.224.246.97 07:14, 25 March 2013 (UTC), 552477=I'm really interested to see what the truth is, because it's got me thinking along all kinds of planes.184.99.231.23 21:38, 24 May 2013 (UTC), 308990=Something seems a little fishy because the image url is different than normal. Bugefun (talk) 04:55, 25 March 2013 (UTC), 502024=Why are images 2816 and 2817 the same? http://geekwagon.net/projects/xkcd1190/?frame=2816 http://geekwagon.net/projects/xkcd1190/?frame=2817 121.72.166.59 21:56, 16 July 2013 (UTC), 482254=Near the end of the transcript, it says that at +847 Beret Girl drops in again, dragging something. I used Photoshop to lower the brightness, and can see about half of her head facing away from the sandcastle. She's not dragging anything. Here's my evidence: [6] 108.51.68.241 22:24, 30 April 2013 (UTC), 397794=I think by tasting the water Cueball was preparing himself for the inevitable - the water is going to continue to rise and nothing they can do will stop it: they are going to drown. This strip is about the slow, inextirpable, approach of Death - and this isn't the Death from a Terry Pratchett novel. Joncaves (talk) 20:29, 9 April 2013 (UTC), 498263=I still could get the correct update, but I have to check all downloads so far.--Dgbrt (talk) 18:41, 4 May 2013 (UTC), 430331=I think we have seen the profile of various famous castles come and go, but nobody has identified any of them. 174.62.108.29 17:51, 20 April 2013 (UTC), 365288=Re explanation of hour 110:00. My first thought was \"How can a person whose face is an empty ovoid look upset?\". However, looking at the image again I can see how it does. Respects to Randall. Possibly an April Fool, but I will be even more impressed if it runs beyond Monday. I'm waiting for the tide to come in. jasq 79.123.80.87 23:12, 29 March 2013 (UTC), 389241=Whoa -- big change in scale, zoom in on Megan holding a mini trebuchet at about 5 pm central time Friday the 5th.--205.208.92.136 22:20, 5 April 2013 (UTC)--~~, 549540=A great guy at the xkcd forum did identify the big trees starting at frame 1503 (1382:00 hours). They belong to Madagascar and their name is Adansonia grandidieri. But also a few of them do exist in the US. So I am still not sure where we are.--Dgbrt (talk) 18:11, 23 May 2013 (UTC), 732395=So they are in the Mediterranean Sea. We can see Italy and to the left the Strait of Gibraltar leading to the Atlantic ocean. Would this have been thousands of years ago? 206.191.28.43 01:18, 19 July 2013 (UTC)dbuck, 747562=Did the learner/teacher/leader/ruler know the truth? She did some guesses and used a map that their people had found. I can't imagine their parents did travel 2.000 kilometers to Gibraltar, Megan and Cueball must have walked to a level more than 1.000 meters above their home, and also several hundreds of kilometers. A Cougar does not belong to Europe; they were walking to a higher level, running out of breath. At sea level? I'm pretty sure this story is still not solved.--Dgbrt (talk) 21:49, 20 July 2013 (UTC), 738014=Assuming this is the Mediterranean sea[26], the predicted sea level map in frame 2907 shows that the Balearic Islands will become completely submerged. Since the highest point on the Balearic Islands is 1432 meters above sea level [27], and Chateau D'If isn't nearly as high, wouldn't Chateau D'If become completely submerged as well? Or maybe the Translator just omitted the Balearic Islands from the map. I'm guessing the latter is true. JimmyK4542 (talk) 21:50, 20 July 2013 (UTC), 577761=\"--LOOK OUT!\" I rest my case. 216.239.45.91 21:05, 20 June 2013 (UTC), 352220=And the one for the following half hour is located at http://imgs.xkcd.com/comics/time/c2ea85f1ab92f2f80e9c4655c47f5c7effc0a7da01c8a88493864845855b3be8.png 141.161.133.106 09:31, 27 March 2013 (UTC), 422755=My favorite episode from the Batman TV series was one where the Riddler gave Batman a nonsense clue which contained a surveillance microphone. He'd then eavesdrop on what Batman “deducted” his next coup would be, and he made it happen. Seeing how the discussion here does seem to affect the events in the comic, I wonder if Randall is pulling a Riddler on us. Just as an experiment, I thought I'd mention that it's odd there are no seagulls at the beach ;-) 201.235.179.15 16:49, 17 April 2013 (UTC), 371971=Anyone else getting a 404 error with the latest image (http://imgs.xkcd.com/comics/time/d1b3b1b6e23995a093377c5ddc044dd98a42a3ae1327c8b6620d51d2a7003c1d.png)? Joncaves (talk) 15:19, 30 March 2013 (UTC), 789701=I thought that we might get one, and indeed something is coming into view under the bush on the right. I am expecting the hedgehog, possibly pursued by the wildcat, whose choices on who to eat continue to be painful. There are really the only two extraneous elements that haven't been wrapped up. Tavella (talk) 23:31, 26 July 2013 (UTC), 357643=Is someone gonna update the transcript to note them building a sandcastle, as well as the dialogue so far (consisting of Megan and Cueball saying goodbye to each other at No. 52)?--69.119.250.251 00:38, 28 March 2013 (UTC), 535187=Hmm, and despite the overall journey feeling epic, didn't someone calculate the distance travelled (calculated via Cueball units) to be only a mile or two? 99.123.5.106 01:48, 16 May 2013 (UTC), 548098=Similar to the xkcd explaining the Saturn V rocket in simple english.173.49.75.137 03:57, 20 May 2013 (UTC), 756735=The images mirrored http://xkcd.mscha.org/ and those served by xkcd servers differs in two PNG 'tEXt' chunks with keywords 'date:create' and 'date:modify', which appears to contain the original timestamps. Images from mscha.org have wide range of these timestamps, indicating that the images weren't produced all at the same time. But the same frames downloaded from xkcd servers now have their time values set to \"2013-05-01T15:11:05-04:00\", so either mscha or xkcd must have modified the PNGs. The compressed image data seems to be modified, too., 470022=And [5] (972 +851:00 36/11:00) was missing for a couple of minutes... Mark Hurd (talk) 15:07, 29 April 2013 (UTC), 775839=You would think there would be considerable air movement. I wonder if they will figure out the concept of a sea anchor, or if it would even help. Taibhse (talk) 08:23, 26 July 2013 (UTC), 534095=The current frame (1355) looks remarkably similar to the area at left hand edge of XKCD 1110 (Click and Drag), which also features the same two characters discussing how they've walked \"pretty far\". I wonder how much of a coincidence this is. 82.69.211.1 11:46, 15 May 2013 (UTC), 509815=Any objection / comment / suggestion ? Biem (talk) 05:16, 8 May 2013 (UTC), 342342=What makes you think he's done? 129.138.30.95 04:25, 27 March 2013 (UTC), 341405=I guess we shall find out in ~10 minutes if Randall is trolling us. 129.138.30.95 04:20, 27 March 2013 (UTC), 420615=The bucket on the pulley used to be carrying just sand. Now, if I read the situation correctly, it's carrying something that's heavier than Megan, so she can't use the pulley (or, possibly, anything else) to pull it up. Lead? Depleted uranium? Dwarf star remnant? 67.168.18.37 15:06, 17 April 2013 (UTC), 350790=— Jan! 94.23.195.79 09:22, 27 March 2013 (UTC), 658785=geekwagon only has the final meteor frame (2440e) which it numbers 2441, and after that all the numbers on geekwagon are out by one compared to mscha's site., 545893=Conversation is in \"Simple English\". I am not native English but I think we should mention this. Am I wrong?--Dgbrt (talk) 20:57, 17 May 2013 (UTC), 590754=Nice work Galois! How we can show this pictures at the comic page? Maybe with a smaller preview for a link to to the full size picture with a warning about this. But also I think it should be at a different page. Any ideas?--Dgbrt (talk) 20:26, 5 June 2013 (UTC), 623283=At frame 2305 Cueball mentions that it's only one day to reach the top and at frame 2308 Megan says that they will not much farther away from home when being there. This means the comic shows no night sequences but it did run for many days in the world of them. Maybe each real day is also a day in this comic.--Dgbrt (talk) 20:17, 24 June 2013 (UTC), 402205=Can someone please move the list of images and their hashes to another page? Randal is showing no signs that the images will stop anytime soon. 184.5.152.192 22:32, 9 April 2013 (UTC), 449806=I expect that from now on (Friday April 26th 2013) there will be no more story and the sea will erode the castle until nothing is left (most likely software generated). Maybe Cueball and Megan will return someday, walk to the shore, sit down and, after a while, start building a castle... Jacx 217.81.72.248 11:56, 26 April 2013 (UTC), 463460=Updated projection: fade to white (rgb 255) at image # 967 (10:00 UTC) Galois (talk) 23:18, 28 April 2013 (UTC), 728689=Now we know why the sea is rising. I wonder if the castle people connected the two seas intentionally, or if it was an act of nature.--Gerry (talk) 18:43, 18 July 2013 (UTC), 482879=I added a section for normalized versions of the first 10 hours of day 36. If anyone wants me to add more, e.g. go back to where the fade started, I would. BTW, I used something like 'pngtopnm $i | pnmnorm | pnmtopng > $j' inside a loop. Those commands are from the NetPBM package. Larry (talk) 23:33, 30 April 2013 (UTC), 345990=Its probably going to loop back on itself, eventually, and repeat this way forever. 113.160.224.209 07:12, 27 March 2013 (UTC), 626248=Upper right corner of Frame 2352? Also the other three corners have something going on. 99.72.154.66 03:25, 26 June 2013 (UTC), 483721=If Randall decides to go into a loop, let's not forget he can change any single frame or create a parallel storyline from any frame he likes. Blue Charizard (talk) 07:16, 1 May 2013 (UTC), 499612=Has anyone noticed that the exact same identical image was re-used several times recently? If you go to http://geekwagon.net/projects/xkcd1190/ and tell it to show differences from frame 1090, and then start clicking forward, the following frames are all exactly the same: 1094, 1097, 1101, 1103, 1107. Looking at http://xkcd.aubronwood.com/# you can then see that 1111 and 1113 are also the same. The rapid perspective change makes the animation appear to strobe. Could this be some strange attempt to illustrate something like an earthquake, or are they just re-using frames to avoid having to draw so many? 65.183.156.9 02:38, 5 May 2013 (UTC), 502988=Hour 983 on image 1104 Saturday (23:00 UTC) also appears on image 1105 Sunday (00:00 UTC). The image numbers are correct, but the hour count appears to be off by 1 hour now.Galois (talk) 16:34, 5 May 2013 (UTC), 573475=The snake also seems to appear in frames 1645 to 1651 http://geekwagon.net/projects/xkcd1190/?frame=1645&framediff=1644 Flying Djinn (talk) (please sign your comments with ~~~~), 480913=But what about their knapsacks? I guess they are not going to throw them to the sea... Hope this won't end up with loop right now, it would be too disappointing --Electrichk (talk) 19:07, 30 April 2013 (UTC), 487604=Are there efforts underway to make 3D representations of the landscape? 63.153.208.177 18:14, 5 May 2013 (UTC), 599460=Anyone else notice how still the air is? In the frames I have looked at, the grass never moves, so there must be no wind. 174.27.36.133 12:20, 11 June 2013 (UTC), 631023=The images now fading to black, going to the dark night. I am hoping we will get a new scene on top of that mountain, but maybe we will just seeing them awakening below a tree. We just have to wait... Stay tuned as me!--Dgbrt (talk) 23:06, 26 June 2013 (UTC), 655746=Day 95 1:00 Megan squats alone on the right side of frame while Cueball sits in the middle of frame http://www.explainxkcd.com/wiki/images/d/d9/time2378.png, 389526=A tiny trebuchet for use on the tiny turrets? Megan is kinda awesome. --Druid816 (talk) 22:32, 5 April 2013 (UTC), 521722=First could be \"1190 Time Images 2013-03 March\" (<- I am calling this human readable ISO) So, if you understand, each month of picture links and hashes on a separate page., 513947=Biem (talk) 09:13, 28 May 2013 (UTC), 363229=Can someone identify for sure what Cueball is doing in 105:00? His arms seems to be crossed, and his holding something in his hand. mem (talk) 14:30, 29 March 2013 (UTC), 725647=I make that out as \"What is forty? My numbers are no same.\" Riprap (talk) 16:51, 18 July 2013 (UTC) Meagan and Cueball explain why they are there. In reply I read it as \"You do not know. I make sea rise.\" Riprap (talk) 17:10, 18 July 2013 (UTC), 617893=Re: 2188 check the \"Following\" section. 99.72.154.66 03:15, 21 June 2013 (UTC), 686794=Any ideas what the hats or hair cut does belong to?--Dgbrt (talk) 20:08, 8 July 2013 (UTC), 586513=At about 22:35 on the 67th day, the image reference \"6fa2b361791e805aac0a89008a891e3999a0519ed870c1bc3dcc8dbff5e071d5.png\" appeared for a time. It was after \"f4e2276e4c47409412666b28be0cca75fedae3c182c4017932891c147004c720.png\", followed by a few more of that reference and then by \"133fddaecbdee3f5160771b68ce02cbc2b4b1c84a40faffb1bcaa6f75588edd0.png\". At the time, I did not get a copy of the image, and it is not now available for download. Did anybody else see this image, and does anybody have a copy of it? --Divad27182 (talk) 20:12, 6 June 2013 (UTC), 477968=Well, they've made it back to the beach. I think it will end either at 1000 or 1024, and the only reason it might go to 1024 is allow some dialog and zooming in. :-) --Divad27182 (talk) 18:01, 30 April 2013 (UTC), 477124=I could hack a little bash script on my server which uploads the current image every hour. However for this i need uploads by URL from API allowed ($wgAllowCopyUploads in LocalSettings.php). --Stummi (talk) 12:25, 30 April 2013 (UTC), 470450=And now there is an image again (frame 971/972)! Looks like slightly uneven black ground under a white sky. Wow, I really thought that was it when it faded to white. Cool cool cool. --Therrufying 83.233.5.126 15:53, 29 April 2013 (UTC), 673086=Is there any BOT here understanding the new naming? I'm missing many picture uploads, I will not do this by manual because that's stupid. This is still a job for a bot.--Dgbrt (talk) 22:32, 2 July 2013 (UTC), 750680=Please do not start a new topic for each post here.--Dgbrt (talk) 00:39, 21 July 2013 (UTC), 369693=Does anyone have an opinion on how we should continue naming the saved timeNN.png files if the updates do not continue on the half hour? Right now the link for the skipped update 242 got renamed to the nonexistent time242NA.png and the next update's link is time242.png. But what do we do if the updates are changing to once per hour? By the way it does look like the next half-hour update has been skipped too. -- Bugstomper (talk) 05:57, 30 March 2013 (UTC), 333393=http://www.explainxkcd.com/wiki/images/1/1e/f46c6571393bee1ee649a7daae41f6328e63482506aef1e22607d22c47dd7027.png --Johnsmith (talk) 22:51, 25 March 2013 (UTC), 506332=--Dgbrt (talk) 19:43, 6 May 2013 (UTC), 390587=Meta-physical time again: \"I don't understand what the sea is doing\" - wasn't it a river earlier? Is it a different sea? The river of time maybe? Where is Randall leading us? Joncaves (talk) 03:09, 6 April 2013 (UTC), 339334=Some of the images on the wiki (looks like time38.png through time48.png) are slightly different than what is on the main site. The lines are slightly thicker, as though someone did them based on screen captures. Royce (talk) 14:37, 26 March 2013 (UTC), 445549=Well, I don't know if the intention here is that the \"river\" is making the \"sea\" grow. My point is that the dialogue is so nonsensical at points that it seems to be code. I'm taking every noun as a metaphor for something. \"Sea\" being \"cancer\" seems to fit (\"The cancer can't make more of itself forever, can it?\") I guess go back through the dialogue and see what other words could substitute for what they're saying. Like I said, I don't know what \"river\" or \"rain\" or \"ground\" could be in this metaphor. 98.117.33.206 00:56, 25 April 2013 (UTC), 413045=Just wondering, could the river/sea conundrum have anything to do with http://www.explainxkcd.com/wiki/index.php?title=4:_Landscape_%28sketch%29 and the original accompanying text \"Don't ask me why there's a river running through the ocean. Please.\"? Blue Charizard (talk) 17:45, 14 April 2013 (UTC), 408292=—98.83.126.232 04:16, 13 April 2013 (UTC), 494238=hey, can we upgrade the animated gif to a picture with a sliding bar? maybe with a play/pause button as well? this way you can jump to whatever frame you're interested in, and pause for however long you like on frames with text and such... 81.218.146.161 11:40, 2 May 2013 (UTC), 458503=Does the ladder and railing look like the axis for a graph? Is this a graph of people or area affected by water rise due to global warming - as a function of time? 174.50.74.170 15:58, 27 April 2013 (UTC) rbnm, 563520=Two month's in this comic and we really do not know much more. Stay tuned, wait for it. We do not know much more essentials. Does Randall?--Dgbrt (talk) 22:43, 29 May 2013 (UTC), 659683=Patzer (talk) 07:01, 30 June 2013 (UTC), 521632=Since this 1190 will never end, will it? I think we need some archive sites., 334497=Is it just me or or did Randall manage to make all of us perform a Denial of Service on xkcd.com, and explainxkcd.com ? xkcd.com seems much slower, and I keep getting \"500 Internal server error\" when accessing this site (explainxkcd.com). I guess that's the effect of having everybody hit F5 every few minutes :) 193.239.192.194 11:57, 25 March 2013 (UTC), 436985=I call cancer. The tide slowly increasing, the castle threatened, the upper castle... I don't know, it just all gives me that impression. --193.205.81.1 09:02, 24 April 2013 (UTC), 558253=At least this time we know it's a snake. In image 1738 [8] the curled snake is fully visible, complete with a raised head and tail. At 2 pixels high, details are a little sketchy.Galois (talk) 17:06, 31 May 2013 (UTC), 681829=After seeing Frame 2803 I'm pretty sure these are triangulation points which historically were used for geodetics, see e.g. [23] (3.6MB, sorry only German text). --Chtz (talk) 21:03, 14 July 2013 (UTC), 377478=--79.236.3.216 18:51, 30 March 2013 (UTC), 395679=Are they building a giant trebuchet? Another zoom out maybe? Bdemirci (talk) 05:13, 9 April 2013 (UTC), 648302=If the stars are real I'm sure it still does map to the current time frame of this comic. Venus and also Jupiter (even also Mercury, but hard to see) did follow the sun at dawn. Tomorrow I will have to fix my (Linux) xOrg for running Stellarium or Celestia. So for now I'm only on heavens-above, which is still not accurate enough for this cloudy comic sky at night.--Dgbrt (talk) 21:37, 28 June 2013 (UTC), 437927=Is it just me, or are the last 4 images missing? I don't know how often this gets updated, if it's still manual at all, I may have did bad calculations with timezones, but at least the current image isn't there. 86.81.124.236 19:39, 24 April 2013 (UTC), 667534=I made this page to show the differences between numbering systems at mscha's site, geekwagon, aubronwood and explainxkcd. http://xkcd-time.wikia.com/wiki/Frame_numbering Patzer (talk) 15:17, 2 July 2013 (UTC), 668266=How do we even know that it's a meteor? Maybe Mr. Munroe has finally decided to use his best idea ever? Then it was just a damaged space station falling through the atmosphere. Also the mountain they are climbing is actually a volcano and the sea is rising because of all the tyrannosaurs swimming in it. --DiEvAl (talk) 21:53, 2 July 2013 (UTC), 452171=The most recent event is Megan walking in, saying \"bye!\" in *lower case*, and leaving. From the lower case, which is different from the rest of the comic, I infer that she was talking to *us*, not (eg) herself or the sandcastle! I reckon it's just going to fill up with water until the page is a static black rectangle. Especially since she and Cueball just talked about going off and exploring, grabbed their bags, and left. -cosmogoblin 94.197.127.235 13:57, 26 April 2013 (UTC), 507230=image4 is changed (again)--Dgbrt (talk) 19:25, 6 May 2013 (UTC), 576584=In the hut scene (June 20) there seems to be something large moving in the bushes next to the fence. There was also something something poking in on the left back by the cairn (a few frames back). 216.239.45.91 18:18, 20 June 2013 (UTC), 313538=72.21.198.66 05:11, 25 March 2013 (UTC)It could be a reference to the old proverb \" time and tide wait for none\" Cueball and the girl could be waiting for the tide in the beach! (Just a guess)72.21.198.66 05:11, 25 March 2013 (UTC), 795436=It's sad having to go back to getting new XKCD comics on MWF. I really enjoyed getting to read new stuff everyday. Puck0687 (talk) 13:55, 2 August 2013 (UTC), 704694=Man that is an atrocious accent. 216.239.45.91 13:37, 17 July 2013 (UTC), 409940=Has anyone else considered the relationship of this comic to John Cage's musical composition \"As Slow As Possible?\" http://en.wikipedia.org/wiki/As_Slow_as_Possible Taibhse (talk) 07:08, 14 April 2013 (UTC), 498524=I'm seeing that, too. For myself, I'm going to filter them into a separate directory. Larry (talk) 22:45, 4 May 2013 (UTC), 772643=Frame 3072 - Title text has once again changed to \"....\" Uglystick (talk) 22:12, 25 July 2013 (UTC), 778459=Oh my. What a letdown. Taibhse (talk) 20:03, 26 July 2013 (UTC), 387236=Maybe it's some sort of reference to Model Rail where Cueball ends up with multiple model railways in his basement...--77.100.193.92 13:14, 5 April 2013 (UTC), 767276=So to theft (the maps) do we now add looting? What they are taking was left behind by others who evacuated in the face of a natural disaster. Our tribe seems not to have needed these things before, back in the sand castle days, but are taking advantage of this opportunity to load up on stuff now. I hope they don't sink the raft under their loot. deepfatfriar 75.109.36.232 17:02, 25 July 2013 (UTC), 556599=New clue, image 1692 - \"Still, it's better than when we were following the sea, walking straight into the sun all morning.\" Walking east along the sea, it places them on the south side of anything. Galois (talk) 15:23, 29 May 2013 (UTC), 735470=I don't think there is any doubt. The castle is the Chateau d'If. The correspondence on the map to Marseille harbor is exact. The map and the outline of the castle are pretty explicit, including the depiction of the Strait of Gibraltar as the \"passage\" between seas. So if the level of the Atlantic is anywhere near our own, they will end up on the Île d'If. If higher, who knows. Taibhse (talk) 05:30, 19 July 2013 (UTC), 555636=http://geekwagon.net/projects/xkcd1190/?frame=1647&framediff=1646--Deplicator (talk) 01:35, 28 May 2013 (UTC), 428119=When the server had a problem one image was 100 minutes late, and another was 50 minutes late. Because of this there was a file between time682 and time683 that wasn't posted here (time683 should have been time684), and many files after that are displayed here an hour before they should have been displayed, with the wrong filename. It also affects xkcd-time.wikia.com as I had got many of the files on there from here. I am currently trying to correct this. Patzer (talk) 03:01, 20 April 2013 (UTC), 758537=The good news is, Megball can save about a third of the distance by their direct path through the hills. The bad news is, it's about a 50 mile journey from the likely location of the \"tents\" to the first part of the ridge they need to take to safety. Tavella (talk) 05:00, 22 July 2013 (UTC), 535502=Does anyone has an explanation for the change from frame 1360 to 1361? --FG (talk) 10:41, 16 May 2013 (UTC), 456518=14:00, 26 April 2013 EDT image is http://imgs.xkcd.com/comics/time/3d8c2ab949ba7a18e64397eec0e9860bd8ce8dd7aa0475e985a4fde4e108ea2e.png Kaori Emora (talk) 18:39, 26 April 2013 (UTC), 538172=The latest frame (1506) has two trees. They are almost certainly baobab trees. There are 8 species of baobab tree, but of those 8, 6 are endemic to the island of Madagascar, including the species which the trees in the comic most resemble, the Grandidier baobab. Even if they are not one of the six species endemic to Madagascar, the fact that they are baobabs still limits them to the continent of Africa, the countries of Oman and Yemen, and northwestern Australia. This means that the big sea, if it is an ocean, is most likely the Indian Ocean. 76.92.118.150 18:30, 21 May 2013 (UTC), 610987=Not a cougar (too small for one) as I think they grab their prey by the throat and hold on till it's dead, not just knock it over and sniff. Bobcat's out (too big). Besides, what's coming in on the right? 99.72.154.66 03:16, 21 June 2013 (UTC), 531648=You realize that what we've seen so far is what the beginning of a comic that goes on forever looks like :-) Tom A. (\"I don't want to be immortal through my art! I want to be immortal by not dying.\" - Woody Allen.) Meteoricshipyards (talk) 14:20, 13 May 2013 (UTC), 554702=I see the streak. I expected the squirrel to follow her. Geekwagon showed it, so did Photoshop.Galois (talk) 22:07, 27 May 2013 (UTC), 539281=Does anyone else agree that frames 1485 through 1487 are exactly identical? Just a glitch somewhere?98.201.4.16 01:56, 23 May 2013 (UTC), 405252=Perhaps it is about global climate change? \"The sea is rising.\" and now they are building a very tall structure to cope with this ?AH --209.74.126.175 01:54, 12 April 2013 (UTC), 552823=Randall seems to be stuck at hour 1524 (image number 1545), at 20:00 UTC we now have 5 copies of the same empty image with half a vineyard with no end in sight.Galois (talk) 20:31, 27 May 2013 (UTC), 379573=anyone else notice the water is slowly rising? not unlike a tide (depending on the time scaling implemented? perhaps a flooding river (as might correspond to the mention of a river)? 70.192.210.128 18:08, 2 April 2013 (UTC), 366555=To review, the first two are: 8eb156cce408df8bb83528382d6a2aa2ce6c74f3c573fd12b058cd1c56420672 1e349a579b5f9b5ed487ddf7e88244b70330941ddedac9c6abf6ed2e3f589b97 Googled the third one, but it only shows up on xkcd discussion forums :( Hashed some of the hashes, but didn't see the result in the list, so it dosen't look like a hash chain. Someone should google all the other hashes, and someone else should figure out what the guy in the \"wait\" directory (presuming it wasn't Randall) was hashing. --Venal dwarf (talk) 21:37, 29 March 2013 (UTC), 595469=They're coming back... in Frame 1928 we can see the two heading off following the small river with their knapsacks (or rucksacks) left behind by the tree where they slept. Galois (talk) 14:09, 8 June 2013 (UTC), 500901=You can see it in the log for geekwagon, do an in page search (ctrl+f) for f8a6414c334a71481e16428691fe8465098b2bae956e44727d0482c7632a84ff. That image is collected multiple times and causes other images to be duplicated too because the script only checks to see if the current link is different than the previous.--Deplicator (talk) 13:15, 5 May 2013 (UTC), 743078=I'll bet their instruments are intended to judge the level of the Atlantic and to determine if they will be an island or completely swamped. They were also used to draw the map of their guess about the future sea level.--Gerry (talk) 08:46, 19 July 2013 (UTC), 413729=Notice the last couple of frames have begun to show waves in the rising sea. (Frames 627-628) Taibhse (talk) 07:32, 15 April 2013 (UTC), 706643=I suppose it is safe to assume that the black frame (Frame 2698) represents some indeterminate passage of time, since we do see Cueball now speaking the language of the Beanie-Wearers. What is strange, and perhaps it is just Randall being lazy, is that if you compare the frames before and after the black frame, there is absolutely no changes to vegetation, and very few changes to anything else. Vegetation would have been the biggest culprit to a lengthy time interval. (Again, assuming it took some non-trivial amount of time for Cueball to learn the new language.) --68.147.179.172 20:01, 10 July 2013 (UTC), 407171=Looks like that small tower that Megan added in 500-502 is acting like a levee. The water outside it is higher now (569) than the water inside it. I can't imagine it'll help much, though. --Mlv (talk) 20:40, 12 April 2013 (UTC), 446782=If it's true this represents their struggle with cancer, this strip might very well continue into the future, updating alongside her real-time cancer progress, possibly for years, hopefully not for mere months. Randall knows how this will end no more than we do. 24.29.73.162 23:49, 24 April 2013 (UTC), 448933=I think this is the last day. It's been exactly a month, they seem pretty done with it, and tomorrow's friday....On top of that, the most recent comic was the flipping of a switch on a time machine, in which, something happened, but we don't yet know what....it may be that the \"Time\" comic is being refreshed. ...Just a thought.... 138.49.1.8 03:20, 26 April 2013 (UTC)Luke Wah, 419632=Now they are 'building castles in the air' - dreaming of a future that will never come to pass? Joncaves (talk) 11:43, 17 April 2013 (UTC), 602132=Still no squirrels, though. Tavella (talk) 20:58, 14 June 2013 (UTC), 475959=Odd, it looks like +861, +862, and +863 are out of order, judging by the ground not changing at all and the characters not walking continuously. I wonder if that was an accidental mistake in XKCD server's delivery of the images or if there's an actual meaning to it. 129.21.63.158 02:17, 30 April 2013 (UTC), 575585=We've got chicks, and not the first time: In image 1830-1831 Megan says \"I heard chirps from the night sky once. I was looking at the stars one night and I heard peeping. - It was very quiet. - just a single chirp now and then.\" They were sleeping under a tree around image 1354, a bird flies overhead, later Cueball takes a walk. We can see some chicks at the end of his walk at images 1374-1376 [11]. It just took me a while to figure out what it was.Galois (talk) 20:35, 4 June 2013 (UTC), 687686=It's the wrong end of the river for them to be building a dam, but I'm wondering, with all the surveying equipment, if they are diverting more water into the basin that Cueball and Megan live in. But they seem like pleasant enough people, quick to help Megan. It's hard to be believe they would drown the area without checking to see if, y'know, people live there. Tavella (talk) 23:02, 9 July 2013 (UTC), 416994=Water depth is increasing quadratically? (Probably not, but it looks nice on the graph so far. My current guess is that it's a sine wave that will peak out at 103 pixels.) Codegardener (talk) 15:18, 16 April 2013 (UTC), 746966=Now (frame 3077 at geekwagon) it's back to '...'71.212.147.246 03:23, 26 July 2013 (UTC), 734312=Is the castle Chateau D'If in France? --203.0.215.2 01:41, 19 July 2013 (UTC), 485893=Just a thought - In panel 1018 (time 897), Megan states \"If we don't find something today, we'll have to start using the steam bottle.\" If that means they're out of water... the last update has both of them drinking water at the edge of the river. No one spit it out this time. If they refilled their water bottle at the river, it's not the source of the pollution. Galois (talk) 23:38, 1 May 2013 (UTC), 768609=This has to be one of the best dialogues Randall has ever written: \"Why is everything flooding? Why is the water full of trees? Why do you have little tables covered in sand?\" Taibhse (talk) 21:05, 25 July 2013 (UTC), 735150=Not only that, if you look at the map which shows the channel, the location of the castle is highlighted and it does correspond to the location of Chateau D'If. --203.0.215.2 04:11, 19 July 2013 (UTC), 469646=OK, *now* it's completely white (as of day 36 10:00) Larry (talk) 14:08, 29 April 2013 (UTC), 447206=Guys, if a new frame comes out and it's not uploaded yet, please consider uploading it yourself in the correct time slot. I'm trying to keep up, but there's always 8-hour gaps in our archives every time I go to bed. Davidy²²[talk] 00:33, 25 April 2013 (UTC), 722171=It's interesting that the castle is mostly underground. I wonder if the \"little houses\" also extend underground? And I wonder if this is a sign this is a very hot climate for the Beanies / Long-haired woman (I like the idea of naming her Hypatia, as was suggested elsewhere.) If it's hot for them up on the mountain where it is significantly cooler to Cuegan, maybe that explains why they didn't think there were people down in the sea basin. Tavella (talk) 22:55, 17 July 2013 (UTC), 763791=Another map, with better resolution, of the rising water levels: File:rising-water.png Tavella (talk) 06:39, 24 July 2013 (UTC), 518932=Both characters have slept occasionally but never at the same time. There has been no depiction of night (unless the fade counts as one.) Hmm... Taibhse (talk) 20:21, 8 May 2013 (UTC), 786092=Thank you Randall for the nice story! The End remembers me of Lucasarts-Adventures... May someday a new frame appears with \"That's really the end, you can shutdown your computer now\" ;-) Joggl (talk) 11:47, 27 July 2013 (UTC), 501590=I think what happened is that one of the three sites (107.6.97.102) started giving the same result each time. Now, I think they are down for maintenance.... --Divad27182 (talk) 20:47, 5 May 2013 (UTC), 623003=This is beginning to look a lot like the plot outline of a quest video game. --deepfatfriar 17:34, 21 July 2013 (UTC), 574243=Megan is looking back sometimes since a few frames... May she has the feeling that someone is following them? People from the hills? The squirrel? -- Joggl (talk) 18:08, 2 June 2013 (UTC), 324859=It just went back to the second image... 220.224.246.97 07:59, 25 March 2013 (UTC), 504353=I will check all carefully and post my updates at the bottom of this section. --Dgbrt (talk) 19:01, 6 May 2013 (UTC), 568595=Sevitz (talk) 06:59, 31 May 2013 (UTC), 530374=My theory: Based on the frames don't change much; Randell is an expert at creating xkcd frames; he only needs 24 per day to keep going; and we have no idea how long he's been preparing for this. It could last forever.--Deplicator (talk) 19:42, 12 May 2013 (UTC), 559930=They appear to be either hunter-gatherers or have abandoned the area (for some reason - why?). From [9] \"Many groups of 'nomadic' hunter-gatherers (also known as foragers) moved from campsite to campsite, following game and wild fruits and vegetables.\" We have seen three campsites; Cueball burried the embers from their fire (see image 1048 & 1062-1064 [10]). Galois (talk) 13:22, 29 May 2013 (UTC), 643112=One last thing (for the moment): The angle of the sun and planets are what they should be for c. 30-33 degrees N, but to get the constellations angled the right way, it's closer to 12 degrees north. This may be precession, which could also explain the grapes in what would be currently by the stars the beginning of November -- the vernal equinox may have precessed forward, resulting in the sun being in Virgo/Libra in summer rather than fall. 15,000 years would put it in Libra in June, for example Tavella (talk) 16:27, 28 June 2013 (UTC), 656024=Day 97 6:00 Cueball walks over and squats near where Megan herself squatted http://imgs.xkcd.com/comics/time/8490469c3f8cea3b8dd7f55f8152d8048166af8a13bf2473af5b0b032b9c6f30.png, 351514=- updated script with another text panel 24.77.229.71 21:00, 2 April 2013 (UTC), 539905=Sóme hardcores made a map of The One True Comic: http://edfel.atwebpages.com/Time-Map.svg Including in on main page could be a good idea 80.52.210.93 06:58, 15 May 2013 (UTC), 737310=What if this is the map from http://what-if.xkcd.com/53/ where the Earth's oceans had been drained? That shows the Strait of Gibraltar having been cut off from a now much-receded Mediterranean sea!155.95.80.253 15:36, 19 July 2013 (UTC), 659058=Another logical option is to number them from 2441 to 2445., 584172=I'd like to think Cueball is shorter, I used 6 ft because it's convenient and yields longer distances. The tallest Baobob tree is 516 px (rescaled to the running comic) = 77.4 ft (23.6 m) using a 6 ft Cueball. Note that using a 5.5 ft (1.7 m) Cueball, the tree drops to 71 ft (21.6 m). The Wikipedia page [12] on the Grandidier's baobab states they can reach 25 to 30 m (80-100 ft) in height, 23.6 m is about right. Galois (talk) 23:40, 4 June 2013 (UTC), 722956=Underground, an interesting theory but, many such structures had several levels below ground level, so as to reach the bedrock wherein to support the massive stone structure above. Once dug, why waste it, especially if it provided a comfortable environment? Still, the temperature theory is interesting. If one takes the images with the partially obscured text and play with the brightness and contrast, you can make out many more words, which do not seem to be spoken aloud. Are these sub-conscious thoughts dealing with translation or something a tad more sinister? (I just saw the image change over at :40 after the hour. Just a hiccup on my browser or are these frames speeding up?)Riprap (talk) 23:56, 17 July 2013 (UTC), 537043=Here's another example of the slightly 'strange' way of talking: \"I'm surprised we haven't been seen by any people yet\". Wouldn't most people say: \"I'm surprised we haven't seen any people yet\"? So who are 'people'? Are 'people' somehow invisible to both Cueball and Megan? Are 'people' a threat? Have 'people' also moved on because of the rising sea level? Joncaves (talk) 19:25, 17 May 2013 (UTC), 358389=I think they're bulding a sand replica of King's Landing for the Game Of Thrones season 3 premiere 201.239.18.75 (talk) (please sign your comments with ~~~~), 503780=I did run this great command posted here before on 13 April 2013:, 521920=Next would be \"1190 Time Images 2013-04 April\", 614981=Given that they're been hiking up into the mountains, my guess is that it was a mountain lion... which is also known as a cougar. Or puma. --Druid816 (talk) 08:07, 22 June 2013 (UTC), 652895=I'm sure i remember seeing a shooting star in one of the frames but it doesn't seem to be in any of the recorded frames? 75.181.22.10 19:33, 29 June 2013 (UTC), 679978=Looks like a great platform to build another sand castle. Too bad there's probably no sand...--Gerry (talk) 13:19, 5 July 2013 (UTC), 343002=Well, strip 1191 is up so I assumed it was over. I guess it's not. Until April's Fools maybe? 189.59.175.92 04:32, 27 March 2013 (UTC), 543472=Regarding the accuracy, I imagine Randall may have used a data model of countoured landscape (1D or 2D, plus height) to auto-generate the scrolling/panning/rotating scenery base prior to decorating with figures/etc, but whether there's enough information to fully back-derive such a map from the ever-changing landscape I couldn't say. I assume assumptions, at the very least, and maybe some inventiveness on the part of any given interpreter. 178.98.124.195 19:42, 8 June 2013 (UTC), 731650=Aw yea, finally! I just hope that we don't get another 500 frames with 2 bits of dialogue (like when they left the beach) Bdemirci (talk) 22:00, 18 July 2013 (UTC), 581279=The elevation map on the edfel map hasn't been updated in ages, and I'd like to see how high up they are now. Anyone else found one anywhere? Tavella (talk) 21:31, 3 June 2013 (UTC), 476390=During the last glacial period the sea level was more than 100 meters lower than it is nowadays, so coastal structures looked very different and the continents exposed much more land. I believe the first act of this comic references medieval ages in Europe where people would witness (over the scope of hundreds of years or longer) losing land and coastal towns to the sea but not understanding the process, as Megan states. I'm expecting the second act, and possibly further acts, to reference the abundance of scientifical discoveries made during the last few centuries. 37.201.91.80 12:17, 30 April 2013 (UTC), 774213=I have no idea what is going on. The \"boat\" looks like it's moving over land in 3079/3080, not floating on water. --68.147.179.172 06:20, 26 July 2013 (UTC), 505381=--Dgbrt (talk) 19:37, 6 May 2013 (UTC), 488432=...And there we got as far as frame 1190, which several people have called as the end, and the story does not appear to be resolved at all. How long can this go on? --Therrufying 83.233.5.126 17:07, 8 May 2013 (UTC), 606024=It might be interesting, however, that there's a striking resemblance between the Grandidier's Baobab depicted in the comic at frame 1525 Frame 1525 and the tree on the left in the Wikimedia picture Grandidier's Baobab (Adansonia grandidieri) near Morondava, Madagascar. Galois (talk) 18:24, 16 June 2013 (UTC), 533717=The yawn suggests that they haven't slept yet, so quite possibly the same day. Also interesting that they seem to treat first the small bush and now the tree as worthy of notice -- were there no trees where they lived? 173.228.6.11 06:36, 15 May 2013 (UTC), 734142=ATLANTIS!!!! 98.201.4.16 01:34, 19 July 2013 (UTC), 611642=If this is Madagascar, then it would be a fossa ... but the head looks too big and cat-like. Perhaps a juvenile cougar/puma? Would help explain why it bit the backpack instead of Cueball's neck. Geographically, that or one of the ocelots / relatives would put us in South or North America. AH 209.74.126.175 14:00, 21 June 2013 (UTC), 495617=The Discussion block is pretty huge and I thing it should be removed from the main page. Maybe a link and a hint to the link at the tab on top of this article. What do you think? --Dgbrt (talk) 15:12, 2 May 2013 (UTC), 471878=I don't see this as a comic in a comic -- I see it more as act 2 (after the fadeout of act 1, with the stage crew jumping the gun and being caught on camera heading on stage to change the set). Theoretically, this second act can be as long as the first one -- The Quest for the Source of the River/Sea. (Hmmm, that reminds me of the song \"River in the Sea\" from the musical Ten November, a 2 minute sample available at http://www.prudencejohnson.com/sounds/gales/River_in_the_Sea.mp3). Meteoricshipyards (talk) 18:18, 29 April 2013 (UTC) Tom A., 723974=Has anyone transcribed the blurred English words? Having trouble with a few.98.201.4.16 13:04, 18 July 2013 (UTC), 417600=I think in the end it's about what you build up during life and how \"the time\" washes all of it away, eventually 87.178.224.240 (talk) 16:05, 16 April 2013‎ (UTC) (please sign your comments with ~~~~), 520899=Considering the elaborate and fragile sand castles, the one- and two-person construction of the platform and its castle components, and maybe the latest antics at the top of the dunes, it appears that gravity is not Earth-normal. Or perhaps the law of gravitation is not our-universe-normal. (No reason it should be, of course.) Taibhse (talk) 03:11, 11 May 2013 (UTC), 443299=I'm taking it that \"sea\" is a phonetic substitute for \"c,\" \"meaning \"cancer.\" For better or worse, this kind of phoenetic clue was used in the Batman movie: Batman: Pretty fishy what happened to me on that ladder. Gordon: You mean, where there's a fish, there could be a Penguin. Robin: But wait! It happened at sea! See? \"C\" for Catwoman! Sigh. I wish I knew what \"river\" and \"rain\" represented. Medicine, maybe? 98.117.33.206 23:03, 24 April 2013 (UTC), 372621=Strange: As far as I know http://imgs.xkcd.com/comics/time.png always redirects to the current frame. But if you visit the current one (133:00) at http://xkcd.com/1190/ and check the displayed image, it says 'c6976fbb244af4fc2286ffe3ac2cf78d408c1f610ecd71e18b4a677a048f084d.png' while time.png redirects to '1d9ce7199935b1b629d6b8744e62c7700a3780357b2dc74bb70471db616ddadb.png'. If you take a md5 of both images, they appear to be the same., 428986=Anyone have the slightest prediction on how many frames this Time series will last? 118.186.193.26 07:44, 20 April 2013 (UTC), 498930=I'm getting ...a84ff from http://imgs.xkcd.com/comics/time.png, but the main http://xkcd.com/1190/ gives the current image. Galois (talk) 23:43, 4 May 2013 (UTC) The 00:00 UTC (8 pm EDT) update worked. Galois (talk) 00:02, 5 May 2013 (UTC), 315983=Likely there is a way to hack the URLs; they look like some sort of hash, probably a hashed timestamp. Of course, he could easily have added some salt to the hash, making it significantly *harder* to hack. But they're strings of a specific length, so it should be pretty easy to bruteforce it, fetch all the images, and then (maybe) reverse-engineer the sequence. *That* all depends on how many of them there are. 76.90.249.178 05:44, 25 March 2013 (UTC), 315301=Perhaps there is a way to hack the URL to view future images. 199.30.248.121 05:29, 25 March 2013 (UTC), 460908=It's fading to white a lot faster now than the sea is rising. Unless something else happens, I'd say it's all white by tomorrow. So, maybe if one source of entropy doesn't get you, another will. 67.168.18.37 12:54, 28 April 2013 (UTC), 474980=I am hoping that this \"Time\" somehow connects to the \"Click and Drag\" comic i.e. when the camera zoom out far enough, we'll see that they are actually in the \"Click and Drag\" world. --98.14.191.109 23:59, 29 April 2013 (UTC), 465226=Again, if you're awake and the frame for the current hour hasn't been uploaded yet, please upload it yourself. I am doing the brunt of the work right now, and I am not available 24/7 to get the latest frame up. Davidy²²[talk] 10:37, 29 April 2013 (UTC), 563841=They are also apparently now heading west, or mostly west. Their shadows are in front of them, and while that could be west in the morning or east in the evening, they are contrasting it with walking into the sun in the morning as they were along the shore, so it's west. Presumably they were walking mostly north until the decision to head for the mountains, since Cueball has just started playing with his shadow. Tavella (talk) 00:50, 30 May 2013 (UTC), 766545=Beret Girl said \"boat\" and I congratulate her resourcefulness but, I wonder if she meant \"raft\" instead. (Let us not dwell heavily on the difference.) Is there any doubt now that Randall has been planning this for a long time, in fair detail? He seemed to have responded, to some degree, to some of the postings made here on the Wiki, yet I wonder if perhaps it was just coincidence? Riprap (talk) 14:41, 24 July 2013 (UTC), 337620=wanted to add an image to the list above, but didn't know at what timestamp to add it, got 69085b480cb82911b19fe8f114909756989eed89b0d227db0f59c1843de7ba24.png at 2013-03-26 09:47 CET (UTC+0100) /Puggan, 318192=It seems that the image is updated every 1/2 hour. 152.23.97.150 06:17, 25 March 2013 (UTC), 514286=It doesn't have to be an \"ocean.\" Consider the Aral Sea. The Dead Sea. Our \"sea\" doesn't have any surf, apparently. Frame 1187: \"I wonder if it's possible to swim in.\" Our characters don't know whether you can swim in a river? Have they never seen fresh water deep enough for swimming? Taibhse (talk) 13:26, 8 May 2013 (UTC), 596383=I think the huge following that this comic has gathered - the amount of work by people like Aubron Wood and the guys at geekwagon, explainxkcd editors, general xkcd enthusiasts, the people at XKCD time wiki - raises some interesting questions. At this point we're not even clear how Randall is writing these comics: he may have designed them all from the start, or he may be writing 24 a day, going along with it, according to the natural progression of events and what has led up to now. It has interesting parallels with the design argument. It also makes you wonder about how it's all going to end. There are so many ongoing discussions - and have been from the start - about how the comic is going to conclude. Just as in real life we take so many different roads and never really know where we're going to end up. If we're continuing with the religious theme we could extend the metaphor even further, about what happens after we die. We don't know if we're going to just stop existing or if we're going to end up in some elaborate afterlife. We don't know what Randall's going to do - how long will the comic go on? Could it last his entire lifetime? We have no way of knowing. --Mynotoar (talk) 14:05, 8 June 2013 (UTC), 360941=Guys, i think we might have lost a few frames in between, no? When did he upload the first image? like, the exakt time... knowing this we could calculate the amount of images there should be and compare to what we have... Caranhyas (talk) 18:04, 28 March 2013 (UTC), 362870=Is that rain in two recent panels? Larry (talk) 14:21, 29 March 2013 (UTC)r, 566574=They are moving East as Megan did explain. When they can see their shadows in front of them it's just evening, the sun is now behind them. What tells me that Day One is coming to an end. --Dgbrt (talk) 19:59, 2 June 2013 (UTC), 736199=This is a future version of Julian May's \"The Many-Colored Land.\" Taibhse (talk) 05:30, 19 July 2013 (UTC), 404549=Just a theory. On Friday, April 19th at 00:00 there will be 1200 images in the comic, at the same time the strip 1201 of xkcd should be posted on the site. I'm guessing that will end it. (UPDATE: Math is wrong, was still counting half an hour updates. Sorry about that. The numbers will match on May 2nd at 6 in the morning, nothing special there.)--Yinosanchez (talk) 18:27, 10 April 2013 (UTC), 641321=I wandered over to the forum, and they agree with our conclusion of Sagittarius, and one of them had a interesting observation: Antares is gone. It should be the brightest thing in this view apart from Venus, and you can see the two stars that should flank it appear at Frame 2392, between Cueball's head and the tree, but no Antares. Which suggests that this is set sufficiently far in the future that Antares has gone supernova (which it is due to do.) Tavella (talk) 06:27, 28 June 2013 (UTC), 571584=This makes me think of one area: The Great Salt Lake. The Bear River empties into it from a northerly direction, and the area has the rubber boa and at least one type of poisonous horned snake. Native Americans of the area even had legends of the Horned Serpent. And that had to be a teepee we saw earlier. (I don't think Native Americans had trebuchets or berets, though....) --Druid816 (talk) 01:59, 2 June 2013 (UTC), 632675=Where are the astronomical freaks? Can't we find out where they are depending on the stars? Joggl (talk) 17:12, 27 June 2013 (UTC), 340935=Story so far: linky Odysseus654 (talk) 19:30, 26 March 2013 (UTC), 346244=For those wondering about the Javascript behind this: I posted my analysis of the Javascript on the xkcd forums, and further de-obfuscated and annotated the code over on GitHub. Here's a quick summary though: it holds open a connection to xkcd's servers and listens for instructions and follows them. Those instructions are either \"load a new image\" or \"reload the page\". So, you don't have to mash F5, it will automatically update the image when they're available. We have no way to control how fast the images come or when they do, and it's quite possible for them to update forever. --Fiveofoh (talk) 06:41, 27 March 2013 (UTC), 378186=I've offered up own explanation. The obvious metaphor is how time continues to flow and things change when you’re not watching. And how this could be a conceptual art project that could continue the rest of our lives... 72.183.97.36 19:36, 31 March 2013 (UTC) Lawrence Person, 677803=What is it? Sort of looks like on oil derrick, but of course it is not. What is the mechanical bits up top? --68.147.179.172 08:26, 5 July 2013 (UTC), 777244=I feel like Randall is playing a little too fast and loose with the science here. I mean, this MASSIVE influx of water never overwhelms their makeshift rafts, carries them all the way to land, deposits them gentle on the shore, and then suddenly stops rising, without even pulling back? Did he decide he needed to speed things along, as the comic was becoming too time consuming? KenBrown (talk) 19:08, 26 July 2013 (UTC), 457866=Is it just me, or did the sea/river started to rise faster since the picture started fading to white? --201.53.213.201 14:58, 27 April 2013 (UTC), 450284=Starting at frame 895 the black started fading to white, I think. 217.81.72.248 12:03, 26 April 2013 (UTC), 351715=The one for the prior half hour (5AM - 5:30AM EST, 27 March 2013) is located at http://imgs.xkcd.com/comics/time/5450bd39ee84a394467fabcaf92f1a5711c2a4eca24c8bd8a8cec829496e3dd7.png 141.161.133.106 09:26, 27 March 2013 (UTC), 502601=There seems to be a problem starting with today (Sunday, 2013-05-05): The first picture should be 984:00 and not 983:00. I'm not able to check if it's simply a bot (?) error writing down the hours or something more serious. --82.135.84.245 15:56, 5 May 2013 (UTC), 793499=I wish there WERE credits. I would love to get Randall's view on what his original idea was, whether he fashioned the whole story from the beginning or if it started simple and evolved into this post-apocalyptic drama, what his inspirations were, what real-wold sources he used to develop the science, a language translation, etc. I loved the whole series and checked daily (mostly) and don't think the ending in any way diminished the richness of the whole. As usually happens with XKCD, it spawned some wonderful discussions, speculations and scientific explorations. We don't usually get much explanation and I don't anticipate much from this one, either, but it doesn't make me long for it (or am I missing something). Thank you for the wonderful four month exercise in patience. Every time XKCD does something amazing that I think cannot be topped, Randall always comes up with something that amazes me. What's next? I guess I have to, \"Wait for it.\"--Gerry (talk) 16:47, 28 July 2013 (UTC), 754046=I do believe it quite likely that Hair Woman's people's ancestors/forbears already were spread as far west as Gibraltar, which would explain why her people know about the Atlantic seeping in, and then flowing, through the barrier. She said they attempted to reinforce the barrier, but failed, so certainly they were there at Gibraltar in the \"present time\" of the story. And to draw (\"build\" she said) the outlines on the map, they had to have information about the second sea basin on the other side of Italy-Sardinia and the outlines of what we call the Adriatic, etc. Taibhse (talk) 05:45, 21 July 2013 (UTC), 564873=--Dgbrt (talk) 17:07, 30 May 2013 (UTC), 691183=Now things are getting meta; Cueball drawing a stick figure of himself.... 216.239.45.87 06:04, 11 July 2013 (UTC), 659131=aubronwood has the frames numbered 2444 to 2448 (like the previous suggestion, but I think aubronwood had been out by three for a long time compared to other sites), 607415=That Theory seems to be out of date by now - post-apocalyptic(?) mediteran sea it is... 212.202.64.10 04:24, 19 July 2013 (UTC), 713099=The one map view strongly suggests, to me, survey work using trigonometry (or some variation) to determine location. It would seem to be a case of figure the location first, get there, then see what you find. The greater and lesser circles are intriguing as well, along with the long, straight lines and other geometrical figures seen. Wish there was a bigger, clearer view of it.Riprap (talk) 00:11, 17 July 2013 (UTC), 786961=We still get updates every hour, even when most pictures are not new. The latest NEW picture was on 02:00, 27 July 2013 (EDT), ten hours after the \"end frame\".--Dgbrt (talk) 14:53, 27 July 2013 (UTC), 739410=Am I the only one who finds the \"strangers\" a little sinister? Especially this question. It reminded me of the scene in Invader Zim when he asks the teacher about Earth'd defences... 77.87.179.62 07:56, 19 July 2013 (UTC), 776317=And we're back to building sandcastles on top of the raft with the left-over sand there. I guess the story is going to move slowly for a while again. We'll have to \"Wait for it\" even though the hover-over text has gone back to \"RUN.\" 198.103.184.76 12:47, 26 July 2013 (UTC)dbuck, 351272=- updated script 'coz there are three text panels now. User schnitz 19:00, 29 March 2013 (UTC), 448445=Maybe a baby on the way? Waiting for the unknown tide to roll in (in 9 months)? 76.15.31.215 (talk) (please sign your comments with ~~~~), 558823=So what do we know about them? They've been gone a while, long enough for Cueball to believe it was fine to take grapes. But they haven't been gone for a long time, because we've seen a staked sapling that is likely only a year or two old. They have vineyards and what look to be orchards. They appear to use tents, at least the frame we saw looked to be tied together at the top to form a teepee frame. They are sophisticated enough to do things like put benches next to trees, so they aren't subsistence farmers. Anything else? Tavella (talk) 18:14, 28 May 2013 (UTC), 504613=Ok, how can I change that images? --Dgbrt (talk) 19:07, 6 May 2013 (UTC), 732942=Which makes me wonder if we're in the far future. Castles and such large architecture is only a few thousand years old. So was there an earthquake that closed the Straights of Gibraltar again, and the Mediterranean dried up? And it's now filling up again?--Gerry (talk) 01:30, 19 July 2013 (UTC), 436395=The pace at which the water is rising has begun to slow. I think it's just a regular tide, and it only has a few more pixels to go before it begins to ebb. Codegardener (talk) 14:49, 23 April 2013 (UTC), 567415=Does today's \"What If\" give a clue to the current year? Unless it's been \"fixed\", it says \"two hundred years from now, in April of 2432\".  :-) Larry (talk) 13:34, 4 June 2013 (UTC), 544714=Has Randall ever said anything in the past 2 months pertaining to this comic? Better yet, has anyone ever tried to ask him? Schiffy (Speak to me|What I've done) 05:18, 17 May 2013 (UTC), 770064=33 heads Frame 3072 << \"About forty of us\" Frame 2896. Where are the others? 216.239.45.91 22:10, 25 July 2013 (UTC), 498165=969:00 41/09:00 f8a6414c334a71481e16428691fe8465098b2bae956e44727d0482c7632a84ff.png, 584882=I don't follow this as religously as others so maybe I missed the obvious answer, but why is it assumed that we have seen all of the way they went? I alway thought the parts where they are hiking is like a \"montage\" in film, where lots of parts might be missing in between the snapshots we see. 193.171.69.65 (talk) 05:58, 6 June 2013 (please sign your comments with ~~~~), 461264=The fade rate poly is now [7.912739E-004 x^3 - 0.018842 x^2 + 0.794901 x + 0.09838], and is still on the same progression. At this rate, the panel hits 255 (full white) at 09:00 UTC, 4/29/13. Wait for it. Galois (talk) 14:24, 28 April 2013 (UTC), 356182=looky here: http://imgs.xkcd.com/comics/time/4c92727698b704ee1d02fbd37c94c220d16be4ad3ff6fc03a3fb77ea6d96434f.png 97.88.147.176 23:14, 27 March 2013 (UTC) That was a glitch on the server that revealed a future frame, but it has been corrected and that link is now a 404 not found. I guess if we want to see it in context we'll just have to \"Wait for it.\" Bugstomper (talk) (please sign your comments with ~~~~), 344572=Considering the common theme with \"today's\" strip, anyone wanna guess that he's sending us a hex-encoded file over a really slow modem link, slated to complete April 1? Anyone wanna run \"magic\" over the hashes and see if they come up with a compression codec or something? Odysseus654 (talk) 04:45, 27 March 2013 (UTC), 529079=Does anyone else see the last frame (whenever it may be), have the ability to connect to the first, thus creating a cycle? Schiffy (Speak to me|What I've done) 22:14, 11 May 2013 (UTC), 428774=I think it's now fixed. Patzer (talk) 03:59, 20 April 2013 (UTC), 361506=The four comics from 89:00 to 90:30 (most recent so far) look the same to me, but the PNG files have different CRCs for the image data blocks, though the metadata in the PNG files are all the same. I wonder if there might be something subtle hidden in the images, or the way they're compressed. 24.160.133.3 22:54, 28 March 2013 (UTC), 608674=http://xkcd.com/231/ 121.74.128.126 23:57, 20 June 2013 (UTC), 335007=Earlier today, the server handled all the image redirections. The script you see above went through several mutations (currently at #8), with each mutation it seems that Randall is adding more servers and trying to split the load between them. This is basically how a bot-net works - we all run code written by some evil genius, and he's changing the code as time passes to serve some hidden purpose. 79.180.173.88 15:44, 25 March 2013 (UTC), 644433=So if it's Earth, where could they be? There's not a lot of south-facing coasts around 30N. The only large one is the Gulf Coast of the US, but there's not much in the way of hills much less anything you could call a mountain close to the shore. The only exception I can really see is maybe around Mobile, which at last has some hills. There's the north end of the Persian Gulf and of the Gulf of California, but for both of those the hills are east of of the most obvious large river. Though the Gulf of California would make sense in other ways -- rivers that only run to the sea in the wet season, for example. There's South Korea, but the southern coast of that is broken up into a fringe of islands and peninsula, there's not really a solid stretch of coast to walk east along. Tavella (talk) 00:14, 28 June 2013 (UTC), 684151=I haven't done the exact calculations, but my impression from those we did that they have only climbed 300-400 cueball-heights, which would be only a couple of thousand feet. Doesn't it usually take more than that before you start getting oxygen effects? Could they have started at a higher elevation than we thought? Anyone have a current calculation for elevation gain? Tavella (talk) 22:15, 7 July 2013 (UTC), 406647=It could be a raptor-proof tower .... not seen any of those in XKCD for a while 86.128.14.32 (talk) (please sign your comments with ~~~~), 789281=I think it's time to change the text on the main page to reflect the fact that the comic has actually ended. Djbrasier (talk) 00:13, 28 July 2013 (UTC), 308538=Pretty sure we're just getting trolled with this one 99.108.190.136 04:48, 25 March 2013 (UTC), 542526=Where did the map go? I'm getting \"...does not exist or cannot be displayed\" Does your page have an error? Or are you having hosting issues?--Gerry (talk) 01:36, 31 May 2013 (UTC), 530073=My only prediction is: We will see what did happen to that castles and we will see that Beret Girl again. Wait for it!--Dgbrt (talk) 17:27, 12 May 2013 (UTC), 518750=--Dgbrt (talk) 19:38, 8 May 2013 (UTC), 369252=Is Randall training us like Pavlov's dogs - every 30 minutes we are compelled to refresh the web-page? Joncaves (talk) 01:59, 30 March 2013 (UTC), 364854=I think this is all an elaborate 'joke' which will keep running until Monday - April Fools' Day Joncaves (talk) 17:17, 29 March 2013 (UTC), 700807=I just noticed that translator often puts a ° or ¯ above last letter in some sentences, just like in stranglish (did we come up with a better name for it yet?). I think this confirms that ° and ¯ is stranglish punctuation. Also since stranglish has punctuation, it can't be substitution cipher applied to lojban. --DiEvAl (talk) 21:55, 17 July 2013 (UTC), 322609=Let's just compare the two pictures and see how the bottom right changes, which I believe is water and they are indeed waiting for the tide. Statharas.903 (talk) 07:19, 25 March 2013 (UTC), 656368=Day 97 7:00 & 8:00 Cueball is seen washing his hands in subsequent two frames? 24.91.69.220 (talk) (please sign your comments with ~~~~), 462898=Just wanted to let you guys know (since you are the most hard core of 1190 fans), you can do this now geekwagon.net/projects/xkcd1190/?frame=890&framediff=217.--Deplicator (talk) 19:32, 28 April 2013 (UTC), 355162=A controllable version of the same comic is available at http://xkcd.aubronwood.com/ - slow/fast movement, pause, control back and forth. It also has the image # on the top left. Auto updating. 59.182.173.88 20:56, 27 March 2013 (UTC), 611352=Now I'm starting to feel sorry for the poor kitty. 99.72.154.66 05:06, 21 June 2013 (UTC) (p.s. \"it didn't bite you?\" -- More for it being a lonely lost pet?), 734921=That certainly looks like the modern Mediterranean sea, now doesn't it? 24.22.89.85 02:47, 19 July 2013 (UTC), 487214=HTH 216.239.45.71 00:51, 2 May 2013 (UTC), 588184=My image number 1728 is 133fddaecbdee3f5160771b68ce02cbc2b4b1c84a40faffb1bcaa6f75588edd0.png. The image fits properly in sequence with the other images around it. Galois (talk) 22:32, 6 June 2013 (UTC), 750092=Now that we have their location, did anyone try to match it up against the night sky from Scene 2 - Part 6 in order to see how far in the future the action might be taking place? It should be easier to make more accurate predictions now, right?--Michael85 (talk) 23:46, 20 July 2013 (UTC), 507779=Boy, that one gave me headaches. 1236 and 1237 seem to be the same. MediaWiki doesn't like multiple images that are the same... --SlashMe (talk) 20:15, 10 May 2013 (UTC), 637736=Is someone already stitching together a map of the stars as they move through the frames? I could do it, but I'm too lazy *g*. And if we have that, the relative position of the sun to the stars should be sufficient to determine the day of the year (depending on the accuracy of the drawings) and probably, assuming the first bright dot was indeed Venus, we might even be able to determine if the story takes/took place this year. Maybe other astronomical objects show (or don't show) and help to further narrow down the time. --92.76.250.121 00:18, 28 June 2013 (UTC), 752286=There is a nice artist's conception of the Zanclean Flood at http://upload.wikimedia.org/wikipedia/commons/4/4f/Roger_Pibernat_-_landscape_-_messianic_med-1024x768.jpg Taibhse (talk) 05:45, 21 July 2013 (UTC) It's not quite the same configuration as Randall's sea basin, but similar. The flood has its own wiki page at http://en.wikipedia.org/wiki/Zanclean_flood. I really do not think there is any doubt that Randall's story takes place in a far-future (possibly with liberties taken) Mediterranean Basin, and Hair Woman's castle is the Chateau d'If under restoration. The original Messinian Salinity Crisis (q.v.) is estimated to have taken a thousand years or so to stabilize once the Gibraltar (and possibly other) passage(s) closed, presumably as a result of tectonic activity under the influence of the two opposing continental plates colliding at the site of the present Mediterranean Sea. Taibhse (talk) 05:45, 21 July 2013 (UTC), 487379=Is this now a choose your own adventure? I choose 'Walk Up River'! 162.5.71.176 16:27, 3 May 2013 (UTC), 557606=I agree that these orientations are plausible from the dialog in the strip, but remember, we're already pretty certain that they're not in the same universe as us, so we may not be able to assume that the sun rises in the east. There's no evidence to demonstrate that their world rotates west-to-east like ours does, but there's no evidence that it doesn't, either. Let's at least remember the possibility that all of these directions are reversed from what our current theory states. 71.201.53.130 18:24, 30 May 2013 (UTC), 319373=Hash appears to be SHA-256. I tried some obvious hashes (\"1\", \"11901\", \"1190_1\", \"1190.1\") to no avail. Maybe this is HMAC-SHA256? Also, I would suggest trying Unix timestamps. 131.156.236.149 06:19, 25 March 2013 (UTC), 522085=What do you think? --Dgbrt (talk) 20:46, 10 May 2013 (UTC), 342538=I'm still waiting for the water level to drop precipitously... and then for red spiders to run over everything Odysseus654 (talk) 04:28, 27 March 2013 (UTC), 432050=I wonder if this could be building up to an all black panel for April 22. 74.129.166.50 09:07, 21 April 2013 (UTC), 783330=So, is it time to pin down the skydate more accurately? Taibhse (talk) 20:34, 26 July 2013 (UTC), 691932=Is someone trying to decipher what they are saying? It might be more or less some kind of substitution cypher, but I'm not sure yet which letters are actually the same (e.g. 1st in Frame 2663 and 1st in Frame 2664 are quite likely the same. But the last but ones in these frames just look close in my view (also to 9th in Frame 2671)). Sentences seem to end with the an ° or ¯ above the last letter. Chtz (talk) 09:29, 9 July 2013 (UTC), 508963=I just uploaded a bunch of hashes and files, there have been some errors. The hashes are now correct, but could somebody please check that the files (1410 to 1420) match the hashes? --SlashMe (talk) 07:59, 18 May 2013 (UTC), 767800=That might be the tribes own camp. They may have moved the camp up into the hills to pick up the stuff that was left behind. Also, if there us no reasonable chance of the former owner getting it back I think the proper term is \"salvaging\" or \"scavenging\" not \"looting\". 216.239.45.91 19:40, 25 July 2013 (UTC), 697406=It is clearly not a letter-per-letter cipher; I think Randall has been considerably cleverer than that. It looks like a (fictional) Semitic language, in which case individual characters could indicate syllables rather than letters, but I doubt that it is a simple cipher for English at the syllable level either. At this stage it is impossible to say how far he has gone in creating an original syntax, but I would note that we have seen the word that means \"water\" (or \"drink\") in at least two forms (a simple form used by Cueball, and a form with a kind of 3 at the beginning used as the last word of the Beanie's response to Cueball's picture). I'm confident the ¯ is simply a period, ° a question mark, and the double ¯ is an exclamation mark. The other stray marks could be other punctuation marks as well. KenBrown (talk) 15:55, 11 July 2013 (UTC), 795972=The second night is darker on geekwagon than on mscha and aubronwood, which both use this image from xkcd.com. Did we miss a rapid animation? Jahvascriptmaniac (talk) 14:31, 27 July 2013 (UTC), 699563=Next speculation: could mean \"(the) castle\" and could mean something like \"(move) to the castle\" or \"(to be) at the castle\". Maybe we should start a subpage for all language investigations. --Chtz (talk) 00:42, 16 July 2013 (UTC), 333945=http://www.explainxkcd.com/wiki/images/b/b0/88e3a0c8bba935c669606d9134314f811a0961985f968dd5d329e4695acc67c8.png --Johnsmith (talk) 23:10, 25 March 2013 (UTC), 688668=Is this pair the Cueball and Meagan we've known from before? What impresses me is the level of ignorance this pair exhibits, compared to the couple we've come to know. This pair do not seem to understand oxygen starvation at higher altitudes, how tides work, etc. This almost flies in contradiction to the fact that, in the beginning, they were building sand castles. This presumes castles existed at some point in their own history if not currently. Castles indicate a certain level of knowledge and technology, which this current couple seem to lack knowledge of, to some large degree at least. If this strip 'ends' at the level of technology we've seen thus far and hinted at by this new tribe of people, I would suggest this indicates a world wide (or at least very large area) collapse of a prior civilization. Riprap (talk) 23:14, 9 July 2013 (UTC), 362582=Unless the 99:30 image was misnamed, it's not included in the list of images. Does anyone know where this frame went? Bob 14:18, 29 March 2013 (UTC), 732109=I'm guessing we are less than 100 feet above the \"higher\" sea. Sort of a dead-sea kind of difference (>1k ft) 216.239.45.91 22:05, 18 July 2013 (UTC), 425205=We seem to be missing time 561 from Wednesday? Jillysky (talk) 13:20, 18 April 2013 (UTC), 592318=Maybe they will be disturbed by some flies or other animals, but now it's night... They will sleep because the first day is over. Good night!--Dgbrt (talk) 23:27, 7 June 2013 (UTC), 764645=I've got a feeling.. that it's beret girl and the 'platform' from way back in the first 'act'! - \"10:02, 24 July 2013‎ 98.144.105.195\", 517729=Swimming in a river is dangerous if there's a strong current. Even slow moving water has a lot of power. The sea could be the ocean, connected to the ocean, or one of the large bodies of water referred to as a sea. Enjoy the comic and have fun second guessing Randall.Galois (talk) 18:17, 8 May 2013 (UTC), 702970=How do we call the new guy that appears in Frame 2819? One Suggestion: Black Hat Stranger (He's clearly not Black Hat). --Chtz (talk) 14:19, 15 July 2013 (UTC), 680394=My guess is that the tower may semaphore tower that is under instruction (or abandoned) and part semaphore tower in a Semaphore_line. In Frame 2594 where Megan reports seeing flashes. Could those flashes be distant semaphore signals? Chongo (talk) 00:05, 7 July 2013 (UTC), 490134=Can I please not be one of the only three people on this wiki uploading frames? I live a busy life, I miss some of the time slots. If you see that the frame for the current hour hasn't been uploaded yet, try clicking on the red link and uploading it yourself. Davidy²²[talk] 08:39, 2 May 2013 (UTC), 484158=He guys, what was with the grey on I think 1008-1011? And what happened to it? It disappeared on everything.--108.70.209.33 16:23, 1 May 2013 (UTC) Don't know if anyone else has noticed this, but from frame 998 to 1001 (sitting, side-on view), the 'water' level continues to rise., 464040=Seems like the story is not going to stop with total fadeout: image is still readable, as what was black is going to be 100% transparent (and probably still black), and white is still opaque. Maybe geekwagon page owner (or someone) could add a feature of removing alpha channel? --Electrichk (talk) 08:47, 29 April 2013 (UTC), 357991=Anyone else think that they're roleplaying Dom and Mal in Limbo? Fry-kun (talk) 05:36, 28 March 2013 (UTC), 696230=I believe it's possible to translate their language into pervect english by simple replacing their symbols by roman letters (the right way). For \"water\" we have an example. (talk) 17:12, 11 July 2013 (UTC), 545475=Finally, Randall has this to say: http://blog.xkcd.com/2013/07/29/1190-time/ 122.182.0.94 06:26, 30 July 2013 (UTC), 784364=Be patient, this is NOT the END, maybe just a fading out, but images still do get updates.--Dgbrt (talk) 21:12, 26 July 2013 (UTC), 382312=I think numbers in \"As of this writing, it is still updated after more than XXX hours - even after Y new, different comics were posted on the front page\" at the top of the page should be calculated using {{#expr}}. I changed it for number of comics, but I have no idea how to calculate number of hours since it was posted.DiEvAl (talk) 11:15, 4 April 2013 (UTC), 418169=If this were a 2D universe, wouldn't the best course of action be to bury one of the poles directly at the water's edge? That way, like the small sand hill, the sea would have to rise to the very top of the pole before it would flood the remaining sand structures. 74.94.246.5 (talk) 16:33, 16 April 2013‎ (UTC) (please sign your comments with ~~~~), 532756=So Cueball and Megan seem to entering a region with much more vegetation. Up until now I had assumed that the previous regions had vegetation as well but Randall just hadn't bothered drawing it (such detail is rare in XKCD). So what does presence of vegetation mean? More rainfall? Higher elevation? Also how far have Cueball and Megan travelled? I don't think the frames are necessarily contiguous - if this was a movie we'd have background music to go with the images. They could have been travelling for days or weeks - I definitely don't think it is still the same day as the start of Act II. I suppose 'time' will tell. Joncaves (talk) 17:13, 14 May 2013 (UTC), 470807=Hmm... we gonna see a guy floating in a barrel?? -z64dan 204.57.93.104 15:56, 29 April 2013 (UTC), 457160=It's just about over: the picture is fading out now. 81.246.195.216 22:47, 26 April 2013 (UTC), 432932=The castle on the top appears to be the Disneyland Paris castle (http://0.tqn.com/d/goparis/1/0/1/A/-/-/disneylandaparisxmas09_francoisdurandgetty.jpg) Galois (talk) 21:46, 21 April 2013 (UTC), 437286=I have to hand it to him though. He has entirely captivated all of us. I can't help but check every day (as opposed to every MWF) to see how the story unfolds. Many thanks to geekwagon for keeping me up to date! Puck0687 (talk) 14:26, 24 April 2013 (UTC), 519836=Has anyone noticed that when the camera zooms out to show the other side of the river/see the middle island just becomes smaller, but the distance between Cueball / Magan and the middle island stays the same? --FG (talk) 15:0, 10 May 2013 (UTC), 481424=It appears that the camera perspective has changed. 1 - 970 are all perpendicular to the shoreline, with the water on the right, camera looking down the shore. 971-996 are shown parallel to the shore line, with the camera position apparently out over the water or standing at the shore, looking back toward land. (If the camera had maintained the original position, the characters would have simply gotten smaller as the walked away, but instead we got to see the walk across the frame while presumably following the shore.) In 997, the camera perspective just comes back around to be a profile shot again, looking down the shoreline, water once again on the right. -- 65.183.156.9 19:40, 30 April 2013 (UTC), 488995=\"How long can this go on? I would say a very long time. Currently, each day is filled mostly with a very few backgrounds used over several comics with only the characters moving -- not that difficult to produce -- and maybe a few lines of dialog, which also allows for the repetition of the background. He can probably keep this pace for months. It would be a bit disappointing, but possible. The strip certainly doesn't seem to be approaching any sort of conclusion. But, I think, like certain kinds of art, its the presentation that important. And he is presenting Time. -Tom A. \"Time is a local condition.\" - wish I could remember who said that. Meteoricshipyards (talk) 15:12, 9 May 2013 (UTC), 441638=The cancer metaphors are quite intriguing, but my take is environmental, possibly pollution and global warming. The French girl (beret) could be a nod to the Disneyland Paris castle. If so it’s our first interactive feedback with Randall on the 1190 strip.Galois (talk) 22:42, 24 April 2013 (UTC), 407674=Graph of water level over time Codegardener (talk) 22:10, 12 April 2013 (UTC), 459140=I've logged the fade panels (8-bit r=g=b) by image #, where image# 895=hour 774. 895-0,896-2,901-4,906-4,907-8,908-8,909-10,910-10,911-12,912-12,913-15,915-15,916-17, 917-18,918-20,919-20,920-21,921-23,922-23,923-24,924-26,925-29,926-30,927-31,928-34,929-37 The fade appears to be accelerating. Galois (talk) 20:47, 27 April 2013 (UTC), 589124=I opened a new page for the pictures: 1190: Time: Pictures. It's experimental and subject to (wiki-style collaborative) change. Galois (talk) 15:40, 16 June 2013 (UTC), 314009=This could be a cinematic custom to change scenes or to show the passage of time: fade to black (white) on Act I, come up on Act II. Get some popcorn during the intermission. Gerry (talk) 11:38, 29 April 2013 (UTC) (please sign your comments with ~~~~), 627973=If you look at the image diff on GeekWagon it looks like they are experiancing a solar eclipse.162.5.71.176 15:18, 26 June 2013 (UTC), 460243=I don't have a web page to share plots, but here's the poly fit. Starting with time 774 as x=0: it's [3.6647e-4 x^3 + 2.4545e-3 x^2 + 0.5396 x + 0.4184] up to time 810. Galois (talk) 22:36, 27 April 2013 (UTC), 341668=Did I just miss something or we've all been epically trolled for 48 hours? 189.59.175.92 04:22, 27 March 2013 (UTC), 737749=I wonder if the flag in frame 2944 (and 2812) is intended to be a marker for the new sea level? 173.212.109.235 19:15, 20 July 2013 (UTC), 396084=I love how Randall is reacting to the discussion here. Is it a sea? Or a river? Let's have Cueball drink from it to clarify ;) Blue Charizard (talk) 09:42, 9 April 2013 (UTC), 349252=I believe it is the cannon ball that I have been expecting since they first started building castles. ChrisPUT (talk) 16:34, 29 March 2013 (UTC), 556106=The squirrel appears to be in the tree the first time Megan & Cueball walk by in image numbers 1582 & 1583. http://geekwagon.net/projects/xkcd1190/?frame=1583&framediff=1582 Galois (talk) 13:05, 29 May 2013 (UTC), 579497=Has anyone noticed that the aubronwood site only seems to show every other frame after a certain point? Schiffy (Speak to me|What I've done) 15:52, 3 June 2013 (UTC)}",
    "textBeforeTable": "Day 1, Monday, March 25, 2013 Below is the list of all the frames of the comic, in the order that they were revealed. The given times denote the time since the comic was initially released on midnight, March 25, 2013, Eastern Daylight Savings Time (UTC - 0400). Frame by Frame Breakdown +851:00 [New scene: probably water.]   +850:00 [The entire scene is white.] +847:00 [Beret Girl drops in again, dragging something. The fade and tide continue.] +830:00 [Beret Girl drops in for one frame. The fade and tide continue.] +775:00 [The entire scene begins a slow fade to white. The 'tide' continues to rise and the castle on the right continues to be subsumed.] +761:00 [Megan exits.] bye. Megan: +760:00 Megan: I'll get some bags. +744:00 Cueball: Yes. Megan: Want to find out? +743:00 Megan: Yeah. +741:00 Cueball: Or maybe it's just raining somewhere. We have no idea what's out there. +740:00 Megan: Does it have to be water? Maybe something is adding more land somewhere. And it's making the sea overflow. +739:00 Something is adding water to the sea. Cueball: Megan: Do you",
    "textAfterTable": "12:00 01/12:00 a3aa116efca3c01d8a64c0c7e79158dc8a62241aba767064e3a6c724cc5ade93.png 12:30 01/12:30 fce427e9442e1b4bea98fa5ddae9d32d7c1cb0219de663196ee160a0e04cd4f8.png 13:00 01/13:00 470d6f2b03fd4b08d4a3f40c1a969ce84ce7b87fefd441a561908f2f5700dc88.png 13:30 01/13:30 c2e1cc28a59b7184d3c3306a655d048669963412c0cf19f164afdc283ffdaf94.png 14:00 01/14:00 b2c52fd7587a8b429a27c0b94aaaec7dda657baa71f8651458440912d6de9049.png 14:30 01/14:30 4ec08b20b0be913f7f0f9faf77b30f4bf2d683d224cc9b87479fd8706ad0aa75.png 15:00 01/15:00 fc4a27fd780fbba0e88ffc6c4552093f082acbdfeeedbcd38319cb5793a07e32.png 15:30 01/15:30 d8a70a1ca8aa3a3f9933169fead2d6f0784863f4563f83345bfafcb42a9dcafa.png 16:00 01/16:00 7725087f3a098133ddd849f7e6ab7660a916acef3315e80244bd849ec491ccb5.png 16:30 01/16:30 bfe8bc08b7cf436df87ed9c4c49a8bfb4be2f09b6e28aa1a54ceedc41cb1ff5a.png 17:00 01/17:00 5295b1eeffffdac0385c84511f7d6258136bd390b7215027bc18f845b189095c.png 17:30 01/17:30 f00822bdd210187c867b3408180ba93f715ca23a178758d12a0e4bddcbee0679.png 18:00 01/18:00 40c463ee4cd0797979ec9ced3fe4705f4f71050d8ade084cc6ce82ba414784c1.png 18:30 01/18:30 f46c6571393bee1ee649a7daae41f6328e63482506aef1e22607d22c47dd7027.png 19:00 01/19:00 88e3a0c8bba935c669606d9134314f811a0961985f968dd5d329e4695acc67c8.png 19:30 01/19:30 c18731de1f786d812d41800e7c86a6b05b537c1e86519776fbaed6a90db7d432.png 20:00 01/20:00 1d51d7be045fe97dc2359c27dd9f9eba8e9f2dc18cc5bea5796ea1e7ebcccf66.png 20:30 01/20:30 121d97f2b78cd18e2f6de40882f13b8759b865581d12edf665e66566edb2e333.png 21:00 01/21:00 13bed763cccb9909272f00e1a1fe92e8360c58a6dfcd322054491bb2d53bd084.png 21:30 01/21:30 6187b994ac8a43b71203733c7d28d384f47480b115524e41a30bfaf3ae77a405.png 22:00 01/22:00 b842e5ecde53fb92406dd1de1d8a07571e67a265a458e57e79c77c2e932f989e.png 22:30 01/22:30 6482bafdc122a24f837eb45ac530c7f7f3f54adfb3f309061520c394f895b184.png 23:00 01/23:00 2545500fe415f155cde884403f48520d64cae3ae7bc2aaf0cdd66a1b3a5ac1e9.png 23:30 01/23:30 1da3859627430022485c53ad90e88e8771b2bec2d60e910b59ef332325bba29f.png Day 2, Tuesday, March 26, 2013 Image Time Original image hash 24:00 02/00:00 7db653f7045aa6781ec3c7db54279b56f39ec3ef24807cf02bf58a62492579df.png",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}