{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "870.70",
            "869.90",
            "853.62",
            "812.39"
        ],
        [
            "NSE",
            "871.04",
            "870.29",
            "854.15",
            "812.81"
        ]
    ],
    "pageTitle": "Amara Raja Batteries Stock Price, Share Price, Live BSE/NSE, Amara Raja Batteries Bids Offers. Buy/Sell Amara Raja Batteries news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/auto-ancillaries/amararajabatteries/ARB",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00113-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 600487547,
    "recordOffset": 600437141,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{135186=UnitedBrewerie Jul Fut, 219276=Astec LifeSciences Recommended on Mar 31st 2015, 220587=Amara Raja Batt is in the Auto Ancillaries sector. The current market capitalisation stands at Rs 14,835.92 crore. The company management includes T R Narayanaswamy - Ind. Non-Executive Director, Bruce A Ronning Jr - Director, Ramachandra N Galla - Chairman, Jayadev Galla - Vice Chairman & Mng.Director, Raymond J Brown - Ind. Non-Executive Director, Shu Qing Yang - Non Executive Director, Nagarjun Valluripalli - Ind. Non-Executive Director, Raymond J Brown - Ind. Non-Executive Director, Nagarjun Valluripalli - Ind. Non-Executive Director, N Sri Vishnu Raju - Ind. Non-Executive Director, Bhairavi Tushar Jain - Additional Director, Eric Stuart Mitchell - Non Executive Director. It is listed on the BSE with a BSE Code of 500008 and the NSE with an NSE Code of AMARAJABAT. Its Registered office is at Renigunta-Cuddapah Road, Karakambadi, Tirupati,Andhra Pradesh - 517520. Their Registrars are Cameo Corporate Services Ltd., 134675=28 July 2015, 135893=JSWSteel Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}