{
    "relation": [
        [
            "Attribute properties",
            "highResolutionLoad",
            "noExtractFS",
            "fslimitZoom"
        ],
        [
            "Type",
            "Integer",
            "Boolean",
            "Boolean"
        ],
        [
            "Description",
            "Time to wait before switching photo to high res",
            "Flag to prevent looking up a high res version",
            "Flag to prevent or limit zooming"
        ]
    ],
    "pageTitle": "O'Reilly Network: Quick Reference\u0097Developer Guide - Palm webOS",
    "title": "",
    "url": "http://archive.oreilly.com/lpt/a/7585",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00010-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 13603451,
    "recordOffset": 13561204,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{321496=A mailto URI formatted as specified in RFC2368, 429377=Copyright © 2009 O'Reilly Media, Inc., 227065=RFC 2445 recurrence string, may only include RRULE, EXRULE, RDATE, or EXDATE}",
    "textBeforeTable": "Buttons are the most basic UI element, bounding an action to a region. When a button is pushed, it can change state but gracefully returns to the previous state, like a doorbell. Button This section includes all of the Mojo widgets. Each widget section includes a brief description repeating some of the information from Chapters 3, 4, and 5, followed by an enumeration of the widget’s attribute and model properties, relevant events, and public methods. Widgets Controller APIs Services Storage Menus Dialogs Widgets This is not a comprehensive list of all Mojo APIs; for that you should refer to the SDK site. There you will find the APIs mentioned in this book, including: This excerpt is from Palm webOS. This is the official guide to building native JavaScript applications for Palm's new mobile operating system, Palm® webOS™. Written by Palm's software chief technology officer along with the Palm webOS development team, Palm webOS offers you a complete tutorial on the design principles, architecture, UI, tools, and services necessary to develop webOS applications. If you're familiar with HTML, CSS, and Javascript, you're ready to build applications for webOS-based devices, including the Palm Pre.",
    "textAfterTable": "labelProperty String Model property name for label Model properties Type Description buttonClass String Style options are primary, secondary, dismissal, affirmative, or negative label String Displayed label disabled Boolean Default property that when true, disables the widget Events Mojo.Event.tap Methods activate() For an activity button, start the spinner deactivate() For an activity button, stop the spinner Check Box A Check Box widget is used to control and indicate a binary state value in one element. Attribute properties Type Description modelProperty String Name of model",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}