{
    "relation": [
        [
            "Pitch Type",
            "FB",
            "CB",
            "CH"
        ],
        [
            "Present Grade",
            "70",
            "50",
            "40"
        ],
        [
            "Future Grade",
            "80",
            "60",
            "50"
        ],
        [
            "Sitting Velocity",
            "94-98",
            "76-80",
            "84-86"
        ],
        [
            "Peak Velocity",
            "99",
            "82",
            "87"
        ],
        [
            "Report",
            "Elite velocity; explosive offering capable of reaching upper velo bands on a consistent basis; easy velo; heavy fastball off a terrific plane; shows arm-side run as well; FB has extreme life and hitters have difficult time barreling; command is very projectable; able to spot his pitches; keeps ball low and was attacking hitters low all night; could be plus command in future; command wavered in final two innings when he started to tire; held velocity in stretch at 94-97 velo band; touched 97 in sixth; needs to work on attacking glove side with FB; could be one of the most electric FB from a SP in the game.",
            "11-5 offering; inconsistent currently; flashes shape and depth at its best; tight spin with good rotation through its trajectory; arm speed is consistent with FB; cast a couple; release points are slightly inconsistent but looks to still be learning feel for the pitch; best in the 76-78 velo band; could be a plus offering when he is able to throw more consistently; command is currently fringe.",
            "Able to replicate FB arm speed; pitch has feel; too firm right now but displays mild fading action; able to work low in zone and only hung one in the middle of the plate out of a dozen; command is currently below average; release points seem to waver; repetition and refinement of CH are well in reach and could be an average pitch with more consistency."
        ]
    ],
    "pageTitle": "Baseball Prospectus | Eyewitness Accounts: August 21, 2014",
    "title": "",
    "url": "http://www.baseballprospectus.com/article.php?type=2&articleid=24474",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00307-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 317270623,
    "recordOffset": 317249089,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{89695=Copyright © 1996-2015 Baseball Prospectus, LLC.            Surprise Me!, 8016=August 21, 2014, 78917=Kline's role/ceiling isn't surprising because that's what it was when he was drafted. Still not too satisfied with taking him in the second round, 65th overall, in 2012., 71510=He is an interesting story. Here is what I am aware of in terms of his background: - Signed for 17K - Spent first year or two signed tweaking his delivery. - Sent to short season in 2013 but was shut down due to injury - Has gradually gained velocity in the past year or two. - He was sitting 88-91 when signed There was not much time for him to really jump on the radar. He's really fun to watch. One of the best arms I have seen all year., 64675=Sanchez is an intriguing player with a hit-first style. His bat will likely work at C, but the defense is not at the level needed to stick defensively at the highest level. He is not reliable behind the plate currently, although there have been slight improvements in his horizontal movement since my last viewing in 2013. The bat may play at 1B, but it takes away his best value as a prospect - the arm. Sanchez is still a high-risk player even with significant time at the Double-A level. His defensive game is not ready for the majors and could significantly alter his value as a prospect. With fringe defense at C, he is a bat-first prospect who will need to crush the ball to stick as a consistent starter as a 1B/DH hybrid who can play C in a pinch. I think he is closer to the realistic role than the OFP.}",
    "lastModified": "Sat, 01 Aug 2015 05:57:25 GMT",
    "textBeforeTable": "No Video 2016 MLB ETA 50; Middle Reliever/7th Inning Arm Realistic 55/Moderate OFP/Risk 8/7/2014 Dates Seen Frederick Keys (High A, Orioles) Affiliate 08/08/2014 Report Date Tucker Blair Evaluator Athletic frame; chiseled body; probably maxed; high 3/4 arm slot; nearly over the top; excellent arm speed; slight stab; generates good drive; excellent extension; keeps body tall and compact; mechanics look weird but are fluid and seem to work for him; delivery is methodical and he needs to repeat everything for his arsenal to work; delivery times 1.41 - 1.56. Mechanics Weight: 210 Height: 6' 3\" Throws: Right Bats: Right Born: 09/29/1991 (Age: 22) Branden Kline table.overall tr td { padding: 6px;} table.overall tr.header td { background: #25408f; color: #fff; font-weight: bold; font-size: 10pt;} table.overall {float: right; border: 1px solid #000; margin: 20px 0; font-size: 10pt;} table.repertoire tr td.rpt { text-align: left; font-size: 10pt;} table.repertoire tr td.mid { text-align: center; font-weight: bold; font-size: 11pt;} table.repertoire tr td.mid1 { text-align: center;} table.repertoire tr:nth-child(odd) {background: #eee;} table.repertoire tr td { padding: 6px; vertical-align: top;} table.repertoire tr.header td { background: #25408f; color:",
    "textAfterTable": "CH 45 50 80-83 84 CH has improved some since beginning of the season; slight parachute action; mild arm-side run; ball moves well out of hand; slightly too firm at times; pounds low and away against LHH; not afraid to throw against RHH but loses some of the deception; works well with his fastball but not a true difference maker; average command. Overall Kline has an explosive FB but lacks extreme movement on any of his arsenal. He has a methodical delivery that might turn off some due to the quirkiness of it. The high 3/4 to a long extension and drive looks odd, but it works for Kline and he has become much more consistent with his delivery since last season. I like Kline's role as a reliever more than a starter, although I think he is one that you keep as a starter for as long as possible. The stuff is going to play out of the bullpen for certain, but keeping him in the rotation will allow refinement of his CH and SL. He's a low-risk bullpen option, but as a starter he has more risk simply due to the fact he will need to work on retaining velocity consistently throughout a game and refining the command and crispness of his arsenal. In the bullpen, Kline's FB/CH/SL combo will play up.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}