{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "25.98",
            "26.10",
            "32.13",
            "42.09"
        ],
        [
            "NSE",
            "25.98",
            "26.10",
            "32.13",
            "42.09"
        ]
    ],
    "pageTitle": "Jaiprakash Associates Stock Price, Share Price, Live BSE/NSE, Jaiprakash Associates Bids Offers. Buy/Sell Jaiprakash Associates news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/infrastructure-general/jaiprakashassociates/JA02?sc_did=JA02",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00212-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 595881155,
    "recordOffset": 595823527,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{225589=Jaiprakash Asso is in the Infrastructure - General sector. The current market capitalisation stands at Rs 2,220.83 crore. The company management includes Manoj Gaur - Executive Chairman & CEO, Sunil Kumar Sharma - Executive Vice Chairman, Sarat Kumar Jain - Vice Chairman, Sunny Gaur - Managing Director, Pankaj Gaur - Joint Managing Director, S C Rathi - Nominee Director, R N Bhardwaj - Independent Director, S C Bhargava - Independent Director, Homai A Daruwalla - Independent Director, B K Goswami - Independent Director, K N Bhandari - Independent Director, Ranvijay Singh - Whole Time Director, Rahul Kumar - WholeTime Director & CFO, K P Rau - Independent Director, SCK Patne - Independent Director, C P Jain - Independent Director, Shiva Dixit - Director, T R Kakkar - Independent Director. It is listed on the BSE with a BSE Code of 532532 and the NSE with an NSE Code of JPASSOCIAT. Its Registered office is at Sector - 128 , Noida,Uttar Pradesh - 201304. Their Registrars are Alankit Assignment Ltd., 134566=UnitedBrewerie Jul Fut, 134055=28 July 2015, 224278=Astec LifeSciences Recommended on Mar 31st 2015, 135273=JSWSteel Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}