{
    "relation": [
        [
            "Patent application number",
            "20090147237",
            "20090148032",
            "20090169662",
            "20100038827"
        ],
        [
            "Description",
            "Spatial Phase Feature Location - Methods for locating an alignment mark on a substrate are described. Generally, the substrate includes one or more locator marks adjacent to a substrate alignment mark. Locator marks provide the relative location of the substrate alignment mark such that the substrate alignment mark may be used in aligning a substrate with a template within a lithographic system with a reduced magnitude of relative displacement.",
            "Alignment Using Moire Patterns - Methods of determining relative spatial parameters between two substrates in a process of alignment are described. Generally, multiple alignment data may be collected from phase information using a pair of alignment marks.",
            "Enhanced Multi Channel Alignment - An imprint lithography system operable for imprinting a pattern into a material deposited between an imprint mold and a substrate, the system including, inter alia, a first set of imaging units positioned at a first angle relative to normal of the substrate; and a second set of imaging units positioned at a second angle relative to normal of the substrate, wherein the first and second angles are not equal to each other.",
            "Interferometric Analysis Method for the Manufacture of Nano-Scale Devices - The present invention features a method to determine relative spatial parameters between two coordinate systems, which may be a mold and a region of a substrate in which mold is employed to generate a pattern. The method includes sensing relative alignment between the two coordinate systems at multiple points and determines relative spatial parameters therebetween. The relative spatial parameters include a relative area and a relative shape."
        ],
        [
            "Published",
            "06-11-2009",
            "06-11-2009",
            "07-02-2009",
            "02-18-2010"
        ]
    ],
    "pageTitle": "Rafferty, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/rafferty-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 424575191,
    "recordOffset": 424557126,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Tom H. Rafferty, Austin, TX US 08-28-2014 Systems and Methods for Performing Funds Freeze and/or Funds Seizure with Respect to Prepaid Payment Cards - Systems, mechanisms and processes are provided to allow law-enforcement officials, when encountering the potential use of prepaid payment cards in the furtherance of a crime or in relation to criminal activities, to (1) attempt to check the balances on such prepaid payment cards, including the ability to perform aggregate balance checks on a group of such prepaid cards, (2) attempt to freeze the funds on such prepaid payment cards, and/or (3) attempt to seize the funds on such prepaid payment cards. 20140244497 11-14-2013 Systems and Methods for Performing Funds Freeze and/or Funds Seizure with Respect to Prepaid Payment Cards - Systems, mechanisms and processes are provided to allow law-enforcement officials, when encountering the potential use of prepaid payment cards in the furtherance of a crime or in relation to criminal activities, to ( 20130304634 Published Description Patent application number Thomas Edward Rafferty, Cincinnati, OH US 07-24-2014 COMBINATION PAYMENT CARD AND METHODS THEREOF - Systems and methods for processing payment transactions using combination payment cards. The combination payment card is associated with an open-loop account and one or more closed-loop accounts. Transaction information is received from a point-of-sale device. At least one of the closed-loop and open-loop account is debited. 20140207593 07-03-2014 SYSTEMS, METHODS AND APPARATUS",
    "textAfterTable": "Patent applications by Tom H. Rafferty, Austin, TX US Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}