{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is actually very safe as no matter what time even when the school is quite as most students are in class the police on campus are always doing their patrols wheather it be on their car or on a golf cart or by foot. We have a new addition on campus now a few months ago. Having Camera now feels its even safer then it was then.",
            "All year round their always seem to have some kind of event or club outside with music. Often you can find them at the Grullo bulding across the cafeteria. You can even take a walk to the lake and watch ducks and other widlife passing by or finding their next meal. If you have sport gears you can play tennis or baseball when the place is not use or you can run up the hill and expolre the beauty of nature at the college.",
            "Food in the cafateria are very intresting as we have a lot of varietys from fast food to diffrent culturle food that students can get not to mention how we can get starbucks coffee is a big help to wake up in the morning class!",
            "Not much to say here as we don't have Dom life at least I haven't heard about it.",
            "Proffessors there are to help you learn for those that are serious about getting their degree or be just taking the class. Each Proffessor has their own adenda and style of teaching and lecturing. Then again most of them are very laid back as most went to community college like Evergreen valley college so they are able to relate to how the students feel.",
            "Take advantages of doing the assesment test soon. Sign up with counsoler and make an E.D Plan as soon as possible after you finish orientaion.Reap the benifits for your own education by apply for lots of help in the Finacial aid office and Eops.",
            "A very quiet and calming college enviroment to learn.If you want or need things just ask the staffs as most are very kind and will help you if they can.Relaxing and nature friendly place for everyone."
        ]
    ],
    "pageTitle": "Evergreen Valley College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Evergreen-Valley-College/reviews?_escaped_fragment_=/show/82556",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00130-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 884092403,
    "recordOffset": 884057976,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{71345=It use to be safer at this school until some gangsters started driving or hanging out around school around 2010. Still pretty safe., 124024=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "10/13/2009 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 29 KimVi from San Jose, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Categories Comments Bang for the buck Evergreen college is affordable, great school to get your foot in the college door. Food and Dining I always bring my own snack all the time so no comment on this. Dorm Life I live at home so I can give any comment on this. Academic Rigor professors are great and professional. Tips for prospective students Register your class early ! class seems to be filled up pretty quick. In three sentences Evergreen college is a great college. They have lots evening classes that fits my busy schedule. Thou I can be a stay home mom in the daytime and a college student at night. LOVE IT. Login to rate or flag the reviews Marianna from San Jose, CA 12/27/2012 Reviewer is A current student here. 1 out of 1 people found this review useful.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}