{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Black Protestant",
            "Catholic",
            "Mainline Protestant",
            "Other",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "149,286",
            "34,124",
            "32,003",
            "30,312",
            "6,684",
            "724",
            "159,859"
        ],
        [
            "Congregations",
            "354",
            "99",
            "35",
            "79",
            "30",
            "2",
            "-"
        ]
    ],
    "pageTitle": "Theodore, Alabama (AL 36590) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Theodore-Alabama.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00074-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 374183535,
    "recordOffset": 374048611,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{17131=Lead (Pb) [µg/m3] level in 2003 was 0.00318. This is significantly better than average. Closest monitor was 10.7 miles away from the city center., 22182=Air Quality Index (AQI) level in 2012 was 77.4. This is about average., 20821=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 4.03. This is significantly better than average. Closest monitor was 12.3 miles away from the city center., 41097=On 4/18/1950, a category F3 (max. wind speeds 158-206 mph) tornado 8.3 miles away from the Theodore place center injured 15 people and caused between $5000 and $50,000 in damages., 7975=Educational Attainment (%) in 2013, 19329=Ozone [ppb] level in 2012 was 34.7. This is about average. Closest monitor was 3.5 miles away from the city center., 17881=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 9.05. This is about average. Closest monitor was 5.8 miles away from the city center., 21537=Carbon Monoxide (CO) [ppm] level in 2003 was 0.324. This is about average. Closest monitor was 10.4 miles away from the city center., 4475=2000 Presidential Elections Results, 3333=Graphs represent county-level data. Detailed 2008 Election Results, 20076=Sulfur Dioxide (SO2) [ppb] level in 2012 was 0.696. This is significantly better than average. Closest monitor was 0.6 miles away from the city center., 3903=2008 Presidential Elections Results, 40820=On 11/3/1968, a category F3 tornado 15.6 miles away from the place center injured 18 people and caused between $50,000 and $500,000 in damages., 4761=1996 Presidential Elections Results, 26626=Tourist attractions: Mobile Public Libraries - Branches & Bookmobile- Theodore Branch (Cultural Attractions- Events- & Facilities; 5808 Highway 90), Bellefontaine Aquarium Services (Cultural Attractions- Events- & Facilities; 2911 Belle Air Blvd), Bellingrath Gardens and Home - OFC (Cultural Attractions- Events- & Facilities; 12401 Bellingrath Gardens), Rainbow Amusement CO Warehouse (Amusement & Theme Parks; 5841 Larue Steiner Road), River BOYZ Tours Inc (Tours & Charters; 4820 Fowl River Road)., 37588=Birthplace of: Etric Pruitt - 2005 NFL player (Atlanta Falcons, born: Aug 16, 1981), C. J. Mosley (linebacker) - College football player, Willie Quinnie - Player of and football., 54122=According to our research of Alabama and other state lists there were 55 registered sex offenders living in Theodore, Alabama as of July 28, 2015. The ratio of number of residents in Theodore to the number of sex offenders is 111 to 1., 4189=2004 Presidential Elections Results, 7577=School Enrollment by Level of School (%) in 2013, 3617=2012 Presidential Elections Results, 18630=Particulate Matter (PM10) [µg/m3] level in 2012 was 19.7. This is about average. Closest monitor was 5.8 miles away from the city center.}",
    "TableContextTimeStampAfterTable": "{94833=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 93523=Total of 20 patent applications in 2008-2015., 7476=4.37% of this county's 2010 resident taxpayers moved to other counties in 2011 ($37,482 average adjusted gross income), 5263=3.85% of this county's 2011 resident taxpayers lived in other counties in 2010 ($35,698 average adjusted gross income)}",
    "textBeforeTable": "Religion statistics for Theodore CDP (based on Mobile County data) Winfield neighborhood Westfield neighborhood Theodore Industrial Park neighborhood Rochon neighborhood Plantation neighborhood Muddy Creek neighborhood Mann (Man) neighborhood Koolman neighborhood Jefferson neighborhood Jackson Creek neighborhood Hillview neighborhood Hamilton neighborhood Deer River neighborhood Cypress Branch neighborhood Churchill neighborhood Cedar Grove neighborhood Bellmont neighborhood Bellfontaine neighborhood Bell Aire neighborhood Audubon neighborhood Argyle neighborhood Alligator Bayou neighborhood Theodore, Alabama Neighborhood Map) Neighborhoods in Theodore:( Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 61 Mobile County: 1.51 / 10,000 pop. Alabama: 1.89 / 10,000 pop. Number of supercenters and club stores: 6 This county: 0.15 / 10,000 pop. State: 0.20 / 10,000 pop. Number of convenience stores (no gas): 18 Mobile County: 0.45 / 10,000 pop. Alabama: 0.65 / 10,000 pop. Number of convenience stores (with gas): 246 Mobile County: 6.09 / 10,000 pop. State: 6.32 / 10,000 pop. Number of full-service restaurants: 211 Here: 5.22 / 10,000 pop. State: 5.75 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}