{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "5.51",
            "5.15",
            "5.24",
            "5.54"
        ],
        [
            "NSE",
            "5.39",
            "5.05",
            "5.16",
            "5.43"
        ]
    ],
    "pageTitle": "Ravi Kumar Distilleries Stock Price, Share Price, Live BSE/NSE, Ravi Kumar Distilleries Bids Offers. Buy/Sell Ravi Kumar Distilleries news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/breweries-distilleries/ravikumardistilleries/RKD?sc_did=RKD",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00125-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 598331287,
    "recordOffset": 598283463,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{132124=JSWSteel Jul Fut, 196119=Ravi Kumar Dist is in the Breweries & Distilleries sector. The current market capitalisation stands at Rs 14.52 crore. The company management includes R V Ravikumar - Managing Director, Badrinath S Gandhi - Executive Director, S Vijayalakshmi - Executive Director, K S M Rao - Independent Director, Ashok R Shetty - Independent Director, Popatlal Kathariya - Independent Director. It is listed on the BSE with a BSE Code of 533294 and the NSE with an NSE Code of RKDL. Its Registered office is at Ameen Manors S1 & S2,,Second Floor, B-Block Chennai (Madras),Tamil Nadu - 600034. Their Registrars are Karvy Computershare Private Ltd., 147388=Click here to view the Open, High, Low, Close, Volume and Spread data for Ravi Kumar Dist, 194808=Astec LifeSciences Recommended on Mar 31st 2015, 131417=UnitedBrewerie Jul Fut, 130906=28 July 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}