{
    "relation": [
        [
            "Cited Patent",
            "US6317787 *",
            "US6449739 *",
            "US6530024 *",
            "US6678835 *",
            "US6789115 *",
            "US6851061 *"
        ],
        [
            "Filing date",
            "Aug 11, 1998",
            "Jan 17, 2000",
            "Nov 20, 1998",
            "Jun 12, 2000",
            "Jul 9, 1999",
            "Aug 24, 2000"
        ],
        [
            "Publication date",
            "Nov 13, 2001",
            "Sep 10, 2002",
            "Mar 4, 2003",
            "Jan 13, 2004",
            "Sep 7, 2004",
            "Feb 1, 2005"
        ],
        [
            "Applicant",
            "Webtrends Corporation",
            "Mercury Interactive Corporation",
            "Centrax Corporation",
            "Alcatel",
            "Merrill Lynch & Company",
            "Networks Associates, Inc."
        ],
        [
            "Title",
            "System and method for analyzing web-server log files",
            "Post-deployment monitoring of server performance",
            "Adaptive feedback security system and method",
            "State transition protocol for high availability units",
            "System for collecting, analyzing, and reporting high volume multi-web server usage",
            "System and method for intrusion detection data collection using a network protocol stack multiplexor"
        ]
    ],
    "pageTitle": "Patent US20020138762 - Management of log archival and reporting for data network security systems - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20020138762?dq=552685",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00266-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479574043,
    "recordOffset": 479521553,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{245207=[0504] Sunday, August 31 full backup scheduled day of backup=31; days/wk=7 31 div 7=4}",
    "textBeforeTable": "Patent Citations Remote Access Services RAS Security Device Table SDT Log Collector Table LCT Security Device File SDF Log Transfer List LTL Log Exception List LEL Logfile Reference ID LRID Directory Reference ID DRID Electronic equivalent of “junk mail” SPAN: Security Investigations SECINV: Security Operations SECOPS: [0592] WC: Web Client—a web browser capable of interfacing with the web server for data presentation to the user. [0591] WS: Web Server—the user's access point",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US7114097 Dec 19, 2003 Sep 26, 2006 Lenovo (Singapore) Pte. Ltd. Autonomic method to resume multi-threaded preload imaging process US7231415 * Apr 8, 2003 Jun 12, 2007 At&T Corp. Method and system for provisioning facility-based displays in support of repairing outside network facilities US7251829 * Oct 26, 2002 Jul 31, 2007 Type80 Security Software, Inc. Data analysis and security system US7325002 * Apr 4, 2003 Jan 29, 2008 Juniper Networks, Inc. Detection of network security breaches based on analysis of network record logs US7409716 Feb 3, 2004 Aug 5, 2008 Lockheed Martin Corporation System for intrusion detection US7509625 Mar 10, 2005 Mar 24, 2009 Eric White System and method for comprehensive code generation for system management",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}