{
    "relation": [
        [
            "Payment method",
            "",
            "Visa/MasterCard",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "1200TC Egyptian Cotton Queen Size BED Sheet SET White | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/1200TC-EGYPTIAN-COTTON-QUEEN-SIZE-BED-SHEET-SET-WHITE-/170813491885?pt=AU_Bedding&hash=item27c5470aad",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00250-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 412518415,
    "recordOffset": 412475819,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at For your piece of mind we offer a 30-Day money back guarantee on goods found to be faulty, significantly different from the description, delivered incorrectly or lost or damaged in transit. If an item is found to be faulty on delivery, significantly different from the description, delivered incorrectly, or damaged in transit you must notify us within 7 days of receiving the item. Do not attempt to use, repair, or modify the item as this will void your warranty. Return policy details The buyer is responsible for return postage costs. Money Back 30 days after the buyer receives it Refund will be given as Item must",
    "textAfterTable": "Seller's payment instructions We also accept payment by credit card over the phone during office hours. When making payment by bank deposit please leave a message with the payment and email the details to us to ensure faster payment matching and delivery. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}