{
    "relation": [
        [
            "Patent application number",
            "20110320648",
            "20130198422"
        ],
        [
            "Description",
            "METHOD AND APPARATUS FOR REAL-TIME TRANSPORT OF MULTI-MEDIA INFORMATION IN A NETWORK - In one embodiment of a networking module, a first block receives a serial digital media signal, and provides a parallel digital media signal based on the serial digital media signal. A second block, operative with the first block, stores the parallel digital media signal in a corresponding slot in an outgoing frame, and sends the outgoing frame in response to receiving an incoming frame.",
            "Method and apparatus for networking musical instruments - In one embodiment of a networking module, a first block receives a serial digital media signal, and provides a parallel digital media signal based on the serial digital media signal. A second block, operative with the first block, stores the parallel digital media signal in a corresponding slot in an outgoing frame, and sends the outgoing frame in response to receiving an incoming frame."
        ],
        [
            "Published",
            "12-29-2011",
            "08-01-2013"
        ]
    ],
    "pageTitle": "Jimenez, CA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/jimenez-ca-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00266-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 442860571,
    "recordOffset": 442835993,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Lomberto P. Jimenez, Hollister, CA US 10-24-2013 FISHING LURE AND METHOD OF USE - An improved artificial fishing lure is provided that comprises a lure body with a hook attached to the rear end, a plurality of discs disposed along the body of the lure, and a spoon portion disposed at the front end of the body. The plurality of discs may be the type of discs traditionally used in fastening jewelry pins. The plurality of discs and the spoon portion of the artificial lure provide random movement through the water, as well as light reflection, to catch the attention of fish in the area. 20130276347 Published Description Patent application number Kenneth F. Jimenez, Mount Shasta, CA US //]]> BarDraw('2894201',['Patent applications by Juan Manuel Jimenez, Escondido, CA US'],[[1,8,1]],['2010','2013','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2894201\" align=\"center\"></div> </div> <canvas id=\"bg2894201\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Juan Manuel Jimenez, Escondido, CA US</p> <div class=\"bar2894201\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>05-01-2014</td> <td><a href=\"/patents/app/20140118764\">SMART MOBILE DEVICE HOLDER ON MULTIFUNCTION PRINTER</a> - A multifunction printer includes a printing apparatus including: a printing device; a media advance system for advancing recording medium for printing on by the printing device; a controller for controlling the operation of the multifunction printer; an image capture platform; a lid having a closed position in which the lid covers the image capture platform, and an",
    "textAfterTable": "Lucita Arenas Jimenez, San Jose, CA US Patent application number Description Published 20130005799 THE USE OF FENOTEROL AND FENOTEROL ANALOGUES IN THE TREATMENT OF GLIOBLASTOMAS AND ASTROCYTOMAS - This disclosure concerns the discovery of the use of fenoterol and (R,R)- and (R,S)-fenoterol analogues for the treatment of a tumor expressing a β2-adrenergic receptor, such as a primary brain tumor, including a glioblastoma or astrocytoma expressing a β2-adrenergic receptor. In one example, the method includes administering to a subject a therapeutically effective amount of fenoterol, a specific fenoterol analogue or a combination thereof to reduce one or more symptoms associated with the tumor, thereby treating the tumor in the subject. 01-03-2013 Michael Pe Jimenez, San Carlos, CA US Patent application number Description Published 20120011026 METHOD AND APPARATUS FOR CUSTOM STRATEGY SPECIFICATION IN A HOSTED ELECTRONIC TRANSACTION SERVICE SYSTEM - A merchant generates a customized service strategy related to a suite of electronic transaction services hosted by a service provider. The custom strategy specifies services to perform, and possibly an order in which to perform the services, by a service provider in relation to an electronic transaction associated with the merchant. Through use of a user interface, the strategy can be represented as a graphical decision tree, with terminal nodes representing services or actions. A customized strategy is transmitted to a service provider, as is transaction related information, whereby the service provider",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}