{
    "relation": [
        [
            "Plant Size Category",
            "All",
            "1-19",
            "20-99",
            "100-499",
            "500+"
        ],
        [
            "Number of Establishments",
            "211,945",
            "134,044",
            "54,705",
            "20,101",
            "3,095"
        ],
        [
            "Mean Location Quotient: Raw",
            "5.13",
            "1.86",
            "2.79",
            "4.38",
            "6.92"
        ],
        [
            "Mean Location Quotient: NAICS Fixed Effect",
            "5.13",
            "3.67",
            "4.14",
            "4.91",
            "5.82"
        ]
    ],
    "pageTitle": "FRB: Finance and Economics Discussion Series: Screen Reader Version - An Alternative Theory of the Plant Size Distribution With an Application to Trade",
    "title": "",
    "url": "http://www.federalreserve.gov/pubs/feds/2010/201030/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00163-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 461808547,
    "recordOffset": 461742559,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{16388=The approach has been extremely influential. It underpins recent developments in the international trade literature. Melitz (2003) and Bernard, Eaton, Jensen, and Kortum (2003, hereafter BEJK) use the approach to explain plant-level trade facts. In Melitz, plants with higher productivity draws have large domestic sales and also have the incentive to pay fixed costs to enter export markets. In this way, the Melitz model explains the fact--documented by Bernard and Jensen (1995)--that large plants within narrowly defined industries are more likely to be exporters than small plants. Relatedly, in BEJK, more productive plants have wider trade areas. Both the Melitz and the BEJK theories have a sharp implication about the impact of increased exposure to import competition on a domestic industry: the smaller plants in the industry--which are also the low productivity plants in the industry under these theories--are the first to exit., 11409=We obtain four main empirical results. First, we estimate that in most industries, more than half of the plants in an industry can be classified as being in the specialty segment; the specialty segment dominates plant counts. Second, the pure BEJK model fails to quantitatively match the plant size/geographic concentration relationship, whereas the general model that includes the specialty segment fits this relationship well. For example, in High Point where the wood furniture industry concentrates, average plant size (as measured by sales revenue) is 6.6 times the national average. The pure BEJK model predicts a difference of only a factor 1.6, but the general model comes in quite close with a factor 6.9. The third empirical result concerns industries negatively affected by a surge of imports from China. We examine the period between the 1997 and 2007 Economic Census years. Our estimated pure BEJK model predicts that those locations with high industry concentration and high average plant size should have experienced a small increase in relative share of the domestic industry; e.g., High Point's market share in wood furniture should have risen relative to the rest of the country. Instead these areas experienced sharp declines over the period, consistent with our hypothesis. Indeed, we show that the High Point region went from having 14 wood furniture plants with more than 500 employees to only 3 plants. For our fourth empirical result, we use our general model and estimate the distribution of plant counts by standardized and specialty segments for 1997 and 2007 and analyze the changes over time. Consistent with our hypothesis, we find that those industries facing a surge of imports from China experienced a dramatic decline in the number of standardized plants. In these industries, standardized plants in 2007 numbered only about one-third of their 1997 level. In contrast, changes in counts of specialty segment plants were much less pronounced., 9422=We find it particularly revealing to analyze what has happened in large metropolitan areas. Generally speaking, in recent decades large cities have not been home to huge manufacturing plants in the kinds of industries, like furniture and clothing, that China now dominates. In the United States, large plants in these industries have been concentrated in smaller, manufacturing-oriented areas like High Point. We show that over the period 1997 to 2007, in industries where exports from China have surged, the domestic industry has shifted toward large metropolitan areas, places where average plant size has typically been small. These are places where we expect to see a large demand for specialty and custom goods. And we also expect to find there a large supply of inputs suited for specialty and niche products. These are different from the low-skill inputs used in mass production of standardized products in large plants--inputs readily available in China and places like High Point. Our theory with a specialized-good sector can account for how import pressure from China shifts industries from places like High Point to places like New York City. Without the specialized-good segment in the model, the shift goes the other way. An interesting analogue to recent experience is found in an early case study of the garment industry circa 1960 (Hall, 1959). That study explained how large plants in places like North Carolina tended to mass-produce standardized garments like nurses' uniforms, while the small plants in New York City tended to produce fashion items. The new development is that China has entered to play the role of North Carolina, while New York still plays New York (albeit in a relative sense, given the overall decline of manufacturing as a share of the domestic economy)., 19794=Table 14 reports our results, comparing the predictive power for plant counts of the pure BEJK model and our general model. As in Tables 12 and 13, to calculate the fitted values for 2007, we take the estimated models for 1997 and plug in the China surge (15) as well as the 2007 population values. Panel A looks at the primary locations. Analogous to what happens in Table 12 with sales revenue shares, the pure BEJK model fails with plant counts as well. The model predicts too many plants at the primary locations (i.e., plants are too small), but in addition predicts the count shares at these locations will increase from the China surge, while in actuality they decreased significantly. The predictions of the general model are roughly in line with what happened. Across the China surge industries, the count quotients decrease on average from 6.8 to 5.5 (a decline of 1.3 points), while in the data the decrease is from 5.8 to 3.9 (a decline of 1.9 points). Panel B considers a prediction exercise that looks at all 177 Economic Areas together. For each industry, we regress the change in count quotient for location on the predicted changes for both models. For the pure BEJK model, the slope in the regression is actually slightly negative as changes tend to go in the opposite direction from what the pure BEJK model predicts. In contrast, for the general model the slope is close to one. (It equals .93 for wood furniture and averages .89 across all 17 industries.) This is what we get when we do this exercise on the industries actually experiencing a China surge. For the food and beverage industries, which didn't actually experience such a surge, we get a range of noisy values that on average are relatively close to zero.}",
    "TableContextTimeStampAfterTable": "{154714=Table 2. The cell counts that cross-classify the 1997 Census plants by NAICS and SIC use public data files E97B1 and E97B2 distributed at the Census web site. These files report employment by SIC and NAICS, from which mean plant size by SIC/NAICS was derived. The confidential micro data were used to calculate export shares and mean plant sales location quotients in the table., 55356=The second data file is the 1997 Commodity Flow Survey (CFS). The CFS is a survey of the shipments that leave manufacturing plants.5 Respondents are required to take a sample of their shipments (e.g., every 10 shipments) and specify the destination, the product classification, the weight, and the value of the shipment at origin. On the basis of this probability-weighted survey, the Census tabulates estimates of figures such as the total ton-miles shipped of particular products. There are approximately 30,000 manufacturing plants with shipments in the survey., 61104=Table 2 shows the seven NAICS manufacturing industries that were affected this way. We will refer to these industries as the 1997 Reclassification Industries and sometimes as the Seven Industry Sample. All are consumer goods industries, producing some kind of candy, textiles, or furniture. We do not regard these reclassifications in 1997 as a \"mistake\" by the statistical authority or any kind of deviation from normal philosophy about how to aggregate plants into industries. It is infeasible for the Census to define industry boundaries at extremely narrow detail because otherwise cells become so thin in tabulations that disclosure issues preclude publication. The Census must aggregate in some way, and its general procedure is to group standardized versions and specialty versions of the same product into the same industry., 152229=To construct public revenue estimates by location, we begin with the 1997 Location of Manufacturing plants (LM) data series. The LM data are public data of cell counts by industry, county, and narrowly defined employment size categories (1-4, 5-9, 10-19, 20-49, 50-99, 100-249, 250-499, 500-999, 1,000-2,499, 2,500 and above). This is file E9731e2 from the 1997 Economic Census CD (U.S. Bureau of the Census (2001)). These cell counts are not considered a disclosure, and no information is held back. Thus, for each of the 362,829 plants in the Census of Manufactures, we have as public data the plant's county, industry, and detailed employment size category. We produce an estimate of average sales revenue conditioned on industry and employment size, and assign this to each plant as an estimate of its sales.20 We then aggregate up the plant-level sales estimates to the BEA Economic Area level for each industry to obtain estimates of the location-level data needed to implement the second stage of our procedure. We found that in running the second-stage procedure, it made little difference when we used the estimated revenue data instead of the actual revenue data. For 2007, we use the analogous cell count data from County Business Patterns, and we use the same mapping between sales estimate and employment size category that we use for 1997., 276111=Note: Each regression used to construct results in Panel B has 177 Economic Area observations. Observations are weighted by 1997 population. The table reports means across the industries for each group of industries., 153814=We use the U.S. Benchmark Input-Output Accounts for 2002 (Stewart, Stone, and Streitwieser (2007)) to classify industries. We first define a set of downstream demand (or \"use\") of goods that we categorize at \"local demand.\" These are all uses in the following categories: structures, transportation, retail trade, information (publishing), finance, insurance, real estate, services, personal consumption expenditures, fixed private investment, and government services. Then for each commodity, we determine which of these deliver 75 percent or more of their sales to the local demand categories. We define these to be the diffuse demand industries. We also include borderline cases of Surgical and Dental Equipment (NAICS 339112) and Dental Equipment (NAICS 339114)., 159552=Table A3 provides evidence on the relevance of the wholesale sector, for our sample of manufacturing industries. The CFS is a sample of shipments leaving both manufacturing plants and wholesale plants. To link manufacturing shipments with wholesale shipments, we exploit the product-level information available in the CFS. Each shipment in the 1997 CFS is classified by SCTG product code.22 Define the ton-miles of a shipment to be the shipment's weight times its distance. For each SCTG product, we estimate the share of ton-miles originating out of wholesale plants rather than manufacturing plants. Next, for each NAICS industry, we use the manufacturing plants in the CFS to estimate the revenue share across different SCTGs. Finally, we use the SCTG sales shares to weight the SCTG-level ton-mile shares, to produce a NAICS-level Ton-Mile Wholesale Share. On average across the sample industries, about a quarter of ton-miles go through the wholesale sector. When we repeat the exercise for the 1992 SIC sample industries, the results are virtually the same.23 We conclude that for our sample industries, the wholesale sector plays a large enough quantitative role for it to potentially be a factor in accounting for why there are more local shipments than are predicted by the model., 70408=The SIC/Retail plants in these industries are clearly what we have in mind by specialty plants. But what about the many small plants in the SIC/Man segment in these industries? We address this issue for the furniture plants by exploiting unique information available for these plants. The Census of Manufactures asks a sample of plants to itemize their shipments in various product categories. In most cases, the product definitions are unrelated to the specialty product versus standardized product distinction that would be useful for our paper. However, for the furniture industries, new product definitions were created as part of the 1997 reclassification that get directly at what we want. Specifically, across all the various furniture products, a distinction is made between products that are custom made and those not custom made, and custom products are an example of what we have in mind for specialty products.8 For each plant with the requisite data, we define the custom share for the plant to be the share of product shipments in the custom category. (Not all small plants are required to fill out the detailed survey of shipments and we throw out imputed values, so our data here are for a sample of plants rather than for the universe.) Table 3 reports unweighted means of this variable for the three furniture industries from Table 2 together, and with Kitchen Cabinets separated out from Household Furniture (where Household Furniture combines Wood and Upholstered)., 244325=1997-2007, 118497=We classify an industry as having a China import surge if the industry experienced a 25 percentage point increase in overall imports as a share of shipments over the period 1997 to 2007 and if China's share of total imports in the industry as of 2007 exceeds 40 percent.17 Of the 172 industries for which we have model estimates, there are 17 China surge industries, and they are listed in Table 10. The overall import share of these 17 industries rose on average from 34 percent in 1997 to 70 percent in 2007. The share of imports from China increased from 26 to 61 percent over this same period. Employment declined 66 percent on average over the period. In the infant apparel industry, employment declined an astonishing 97 percent., 127026=We address an issue regarding the definition of the primary location. It is defined as the location of first rank in its relative market share as of 1997. A number one location can only go down in the ranking. In particular, we expect the well-understood mechanism of \"regression to the mean\" to play some role, given the normal ebb and flow of market shares across locations. To gain some perspective on its contribution, we similarly define primary locations in the food and beverage comparison industries. Just as is the case for the China surge industries, average plant size is quite high for the food and beverage industries at the primary locations. Also, the average sales revenue quotient is similarly quite high (37.4 in the food and beverage industries, 26.9 in the China surge industries). Even though these industries were not actually affected by imports, we can use the estimated model to simulate a hypothetical China surge. For these industries, the predicted BEJK sales revenue quotients indeed increase on average at the primary locations, just as they do for the China surge industries. As we would expect from regression to the mean, in the data there is actually a decline, from 37.4 to 31.6. The decline is relatively small, only 16 percent, compared with the average 59 percent decline for the China surge industries. We get the same conclusion if we look at the median instead of the mean. We conclude that the sharp observed fall at the primary locations of the China surge industries extends substantially beyond anything we would expect to see from regression to the mean, in the normal ebb and flow of market shares., 61976=The reclassification of these plants is fortunate for our purposes as it yields additional information that can be exploited. The data for 1997 contain a plant's SIC code in addition to its NAICS code because tabulations were published both ways for this switchover year. We refer to the plants that are in retail under SIC as SIC/Retail plants and the remaining plants as SIC/Man., 155454=Table 10 uses import information posted by the U.S. International Trade Commission at its web site. (For two furniture industries, NAICS 337122 and 337125, we used revised figures reported at the web site of the International Trade Administration.) Imports are \"Customs Value of U.S. Imports for Consumption.\" The variables are reported at the six-digit NAICS level, though in some cases the five-digit level is used. Imports are reported as a share of the domestic shipments plus imports, where domestic shipments equal the product shipments in the given six-digit NAICS product for the given Economic Census year (1997 or 2007)., 125500=To examine the broader set of China surge industries, we find the equivalent of High Point for these other industries. Define the 1997 Primary Location to be the location with the highest 1997 location sales quotient, of those locations with at least 5 percent of 1997 sales. Table 12 restates the variables just discussed for wood furniture and then presents the summary statistics about these same variables for the other industries. For the China surge industries, simulating the BEJK model for 2007 leads to a predicted increase on average of the revenue quotient from 26.9 to 29.4. (If we look at the 17 individual industries, there are only 2 exceptions going the other way.) What actually happened is that the sales revenue location quotients fell dramatically, on average, from 26.9 to 12.2. (If we look at the industries individually, there is only one exception to this pattern.) When we look at the detailed size distribution information for all the China surge industries in Panel B of Table 11, we see the same thing is true with the broader set of industries as holds for just wood furniture. The big plants are collapsing and the primary locations are bearing the brunt of this collapse. Note in particular that the primary locations had 33 plants with more than 500 employees in 1997, but by 2007 this count had plunged to only 3 plants., 59672=In 1997, the Census changed its industry classification from the SIC system to the NAICS system. Seven NAICS manufacturing industries were redefined to include plants that had previously been classified as retail under SIC. For example, under the SIC system, establishments that manufactured chocolate on the premises for direct sale to consumers were classified as retail. Think here of a fancy chocolate shop making premium chocolate by hand. These were moved into NAICS 311330, \"Confectionery Manufacturing from Purchased Chocolate.\" This industry also includes candy bar factories with more than a thousand employees. This situation--where retail candy operations are lumped into the same industry as mass-production factories making standardized goods--epitomizes what we are trying to capture in our model. Analogous to chocolate, facilities making custom furniture and custom curtains in storefront settings were moved from retail under SIC to manufacturing under NAICS. The logic underlying these reclassifications was an attempt under the NAICS system to use a \"production-oriented economic concept\" (Office of Management and Budget, 1994) as the basis of industry classification. The concept is that plants that use the same production technology should be grouped together in the same industry. The previous SIC system sometimes followed this logic but was inconsistent in its application., 243923=(Percent): 1997, 255497=United States: 1997, 255619=United States: 2007, 244515=Employment: 2007, 134239=Taking the results of Table 14 as a validation of our general model, our final exercise uses 2007 data to estimate specialty and standardized plant counts for that year and compares these with the 1997 estimates. The results are in Table 15.19 We begin as before with a discussion of wood furniture. For 1997, we estimate there are 697 and 3,150 plants in the standardized and specialty segments of this industry, or shares of 18.1 and 81.9 percent, respectively. For 2007, the respective counts are 213 and 3,215, or 6.2 and 93.8 percent. Thus, according to these estimates, the standardized segment collapsed to about a third of its initial plant counts, while the specialized segment remained relatively stable. This finding is consistent with the hypothesis of this paper., 244027=(Percent): 2007, 155104=Tables 3 through 6. These tables use the confidential micro data at the Census. Population at the EA level was calculated using Census county-level estimates for 1992 and 1997 (and below for 2007) and aggregating up to the EA level., 244425=Employment: 1997, 255734=Primary Location (High Point): 1997, 91670=We have also reestimated the model using the data from the 1992 Census of Manufactures. We call this the 1992 SIC sample because industry classification was based on SIC that year. We use the same selection criterion to identify industries with diffuse demand and arrive at 175 industries. The mean values of the estimates are similar to the baseline 1997 NAICS case. For those industries with no change in definition between the 1992 SIC and 1997 NAICS, there is a very high correlation in the implied values of . The CFS survey for the earlier period was a larger, better-funded survey, with many more observations. In particular, the average number of shipments used to estimate the parameters of each industry is 8,500 for the earlier period and about 4,000 in the later period. Thus, estimates for the 1992 SIC sample are more precise., 117527=Imports from China have surged in a number of manufacturing industries in recent years. This subsection identifies a set of \"China surge\" industries.16 For this set of industries, the subsection examines how the geographic distribution of production in the United States has shifted in response. It compares the results to the prediction of the constrained model that does not allow for the specialty segment (i.e., the pure BEJK model). The constrained model is inconsistent with what actually happened. In contrast, the full model with the specialty segment fits the data. The last part of the subsection uses the full model to estimate the specialty count share in 2007 and compares the estimates to 2007. In the China surge industries, there is a dramatic decline in standardized segment plant counts., 54949=We analyze the confidential micro data for two programs of the U.S. Census Bureau. In the first, the 1997 Census of Manufactures (CM), the data are collected at the plant level, e.g., at a particular plant location, as opposed to being aggregated up to the firm level. For each plant, the file contains information about employment, sales revenue, location, and industry classification., 255865=Primary Location (High Point): 2007}",
    "lastModified": "Thu, 16 May 2013 12:57:28 GMT",
    "textBeforeTable": "for Various Parameters --> $Q_2^{size}$ $Q_2^{count}$",
    "textAfterTable": "Location 2 Larger (3 (=.31 and =1.23): Location 1 Larger ( = 3 (=.57 and =2.29): Location 1 Larger ( = 3 (=.57 and =2.29): Location 1 Larger ( = 3 (=.57 and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}