{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "You will want to get scholarships, because Cornish is very expensive, though worth it.",
            "It seems like a very fun and dedicated school. I have been looking for colleges such as Cornish. So far, Cornish is in the lead."
        ]
    ],
    "pageTitle": "Cornish College of the Arts Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Cornish-College-of-the-Arts/reviews?_escaped_fragment_=/show/80202",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00114-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908275895,
    "recordOffset": 908237464,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9718=Cornish College of the Arts is a topnotch fine art school, for those who are serious about their art. Class sizes are small, with a student-to-teacher ratio of only 8:1. Students are helped and encouraged to find their own voice and develop their own personal style., 55310=The chair of the Art department, Bonnie Biggs, advised me to read Art in America magazine the Summer before I attended, and she was right to do so: I was so inspired to start creating, and also knew how the current art world looked. Also, attend National Portfolio day in January before you come back for your Admissions portfolio review, and that way you will get college level feedback beforehand, and also be less nervous., 119858=© 2015, Cappex.com, LLC, 47169=I was so excited to attend Cornish College of the Arts in their performance production department. I couldn't wait to move to such an artsy city to be surrounded by other artists 24/7. I headed to Cornish in September for the 2011/2012 school year as a freshman. Right from the beginning of the year I made many friends and started learning in many of my classes. The design of performance production department is very similar to other schools with similar programs like UCSD, DePaul and Carnegie Mellon.. They say that their students will have a well rounded view of what is involved with technical theatre (I wouldn't just learn stage Management. I would take lighting classes, set design classes, etcÃ?Â¢Ã?Â?Ã?Â¦) Which can be very beneficial! I thought this school would be great and would put on awesome productions and provide multiple opportunities to work on shows. I realized this wouldn't be the case when they told me that the students in the tech department do not get to be on the run crew for the shows, instead they allow the theatre freshman to do it to get experience. I think it is a great opportunity for the actors to see what the tech students do, but at the same time I should be involved directly with the run of the show because I am there to LEARN how to work on productions. For the first half of the year, one of my classes was to work in the scene shop. This was a great experience and I enjoyed it very much and learned plenty from the knowledgeable faculty in the shop They had a production in the Fall of 2011 in their main venue (an old bar that Cornish bought and renovated... It's dirty and old and nothing is up-to-date except for their lighting console and a few of the fixturesÃ?Â¢Ã?Â?Ã?Â¦ As of May 2011) I went to go see it with one of my friends in the department. Not only was the acting choppy and dull but the sound was pitchy, the stage floor was all dirty and looked as if people had spilled paint in some areas and didn't take the time to fix it properly with detail. By this point, half way through my first semester... I was still deciding wether or not I would stay for the next semester. The best part of my time in Seattle would have to be my work study job. I was able to work for the city of Seattle in their arts admin offices, it was the one thing I looked forward to each week! I was able to make many professional connections with the staff here more than at school. At the end of the fall semester, close to 1/4 of the performance production freshman students left the program. Their reasons ranged person to person. Many of them left the program however because they knew it was not worth the 40,000 per year. 1 student went to go work for a theatre company in Seattle while another went to go work throughout LA, New York, and Idaho on productions. (She is now hired by the UCLA school of theatre) I decided to come back to the school for the spring semster. The one main change in my class schedule was how I worked in the costume shop rather then the scene shop. Long story short, the costume shop students would sometimes work on costumes for upwards of 22 hours a week and yet only get credit for 4 or 6 of those hours. I brought this up to the registrars office and the provost, I am still not aware if anything has changed. In the costume shop, the teacher would be smart with his students and say things about particular students when they were not around. In one incident, the teacher referred to a student who had accidentally messed up a costume as a Fat Cow. These 22 hour weeks were NOT optional. There was a 3 week period when I did not have a single day off because these costume shop work days went on Saturdays and Sundays. Like I said, I was there to study Stage Management. Little opportunities showed themselves within the school to stage manage. Few of the positions were filled by the stage management students and the school even PAID outside stage managers or students that had graduated to come do the work. If you go to a school to learn something, especially within theatre or entertainment the only way to learn is to do. Every single stage manager will tell you that. The only way to learn is to DO. The school also rarely brought in speakers for our department. This year I am a student at CalArts in Valencia, CA. We have had many speakers including the third Vice (only stage manager) on the AEA (union of professional actors and stage managers). I also have been able to shadow the stage manager at The Book of Mormon and other large shows throughout southern CaliforniaThe staff here at CalArts seem to have a more updated sense of our career path rather then Seattle where technology and practices seem very outdated. From my teachers this year in Los Angeles, I have already been able to work for The Shakespeare Center of Los Angeles and the tour of GATZ produced by New York theatre company Elevator Repair Service. When you are applying to Cornish, they will probably tell you that your scholarships will increase over the years, which makes schooling cheaper the longer you stay there. However, this is not the case. The school sent an email to the performance production freshman last spring while I was there letting us know that all returning students in my department who were considered sophomores would not be eligible for any departmental scholarships. So just saying there alone, watch your back. Other than that, I would say that I am much happier here at CalArts. Many more opportunities, cheaper tuition due to more scholarship opportunities, large amounts of cross pollination to work in a variety of shows like dance and film rather where Cornish strictly limited what you could do, Job connections outside of school while Cornish would not permit outside production work during the school year, and many work study opportunities on campus, where as Cornish would force you to do some things as part of a class EX: dirty laundry for productions. That is my review of Cornish College of the Arts. Please take in mind that this is only my personal view and experience. I highly suggest you talk with current students, admission staff and program faculty to receive other view points.}",
    "textBeforeTable": "01/06/2010 Reviewer is Researching this school. Reviewer has been to campus. 15 out of 15 people found this review useful. 1 of 25 Dudley from West Linn, OR Check out reviews left by other students or leave your own review. You could win a free scholarship. Cornish College of the Arts Reviews Cornish College of the Arts › Washington › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Bang for the buck Cornish is expensive, not going to lie. Then again, it's a private arts college. What would you expect? But if you really research it, and you really know it's right for you, it's totally worth it. You just have to be willing to go the extra mile. Will enjoy being here Cornish is located in the heart of Seattle, with several buildings spread out within a 20-block area. And, there's brand new dorms (as of 2009) that are converted motel rooms. So they're spacious, and each one has its own bathroom (!!). And, you'll be surrounded by people who are just as motivated and dedicated as you are. Will learn a lot I'm a performance production major, with an emphasis on lighting design and stage management. I have known several people from my school who have gone there and graduated, and they have all said it's a fabulous school. There are a limited number of students and a lot of teachers, so you really get a lot of personal time with your instructor, no matter what major you are going to have. Login to rate or flag the reviews",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}