{
    "relation": [
        [
            "Name, Age",
            "Hollis C. Cheek, 62",
            "Jon A. Crocker, 65",
            "J. Marlin Ivey, 71",
            "Otho E. Pettit, Jr., 57",
            "Charles W. Ritter, Jr., 74",
            "L.F. Sams, Jr., 69"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Positions & Offices With Company and/or Employment",
            "Mr. Cheek is the President of Cheek Companies, as well as the President of Techno Catch. He has been a director of the Company since 2004. He is a member of the Audit Committee of the Board of Directors.",
            "Mr. Crocker is currently retired. He worked as a Business Development Officer from 1999 to 2005. He also served as the Chairman and CEO of the M&F Bank branch in Bruce, Mississippi from 1995 to 1999. He has been a director of the Company since 1996.",
            "Mr. Ivey is the President of Ivey National Corporation, a holding company for various businesses. He has been a director of the Company since 1979. He is a member of the Audit Committee of the Board of Directors.",
            "Mr. Pettit is Of Counsel with the Dorrill and Pettit law firm. He has been a director of the Company since 1993.",
            "Mr. Ritter is the former President of The Attala Company, a feed manufacturing company. He has been a director of the Company since 1979. He is a member of the Audit Committee of the Board of Directors. Mr. Ritter is a Director of Sanderson Farms, Inc.",
            "Mr. Sams is a Director and Vice-President of Mitchell, McNutt & Sams, P.A., a law firm. He has been a director of the Company since 2000."
        ]
    ],
    "pageTitle": "Unassociated Document",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/320387/000114420408014447/v105924_def14a.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00306-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 704570991,
    "recordOffset": 704520150,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 11 Mar 2008 16:15:18 GMT",
    "textBeforeTable": "We look forward to seeing you at the Annual Meeting. First M&F Corporation’s audited financial statements and other required disclosures are included in the enclosed First M&F Corporation Annual Report to shareholders. I urge you to complete the enclosed proxy promptly and return it in the enclosed self-addressed postage paid envelope, even if you plan to attend the meeting. If you attend the meeting, you may withdraw your proxy and vote in person. This institution is grateful for the loyalty and support of you, our friends and shareholders. The Annual Shareholders’ Meeting is to be held on Wednesday, April 9, 2008, at 1:30 P.M. at the Mary Ricks Thornton Cultural Center, located at the corner of",
    "textAfterTable": "ELECTION OF DIRECTORS (Item 1) 2     INFORMATION CONCERNING NOMINEES AND DIRECTORS 3     EXECUTIVE OFFICERS 6     CODE OF ETHICS",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}