{
    "relation": [
        [
            "New York Giants",
            "Victor Cruz",
            "Hakeem Nicks",
            "Jerrel Jernigan",
            "Rueben Randle",
            "Brandon Myers"
        ],
        [
            "Gms",
            "6",
            "4",
            "3",
            "2",
            "1"
        ],
        [
            "Targets",
            "10.5",
            "9.3",
            "9.0",
            "10.0",
            "9.0"
        ],
        [
            "Target %",
            "41%",
            "35%",
            "30%",
            "28%",
            "29%"
        ],
        [
            "Yards",
            "89.0",
            "71.0",
            "79.0",
            "80.0",
            "66.0"
        ],
        [
            "% of Yards",
            "41%",
            "33%",
            "45%",
            "34%",
            "17%"
        ],
        [
            "Catches",
            "6.3",
            "4.5",
            "6.3",
            "4.5",
            "7.0"
        ],
        [
            "TDs",
            "0.2",
            "0.0",
            "0.7",
            "1.0",
            "1.0"
        ]
    ],
    "pageTitle": "Primary Receivers Report - Fantasy Football Articles",
    "title": "",
    "url": "http://www.thehuddle.com/2014/articles/dmd-primary-receivers-report.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00290-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 755669551,
    "recordOffset": 755644822,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{3406=For the 2013 regular season, here is a rundown of which receivers were thrown the most passes in a game for their team., 23854=This was the exact result from 2012 except Bryant went from only four games to nine as the primary while Miles Austin all but disappeared. Bryant will continue to dominate as the primary and Witten is likely to recede since he turns 32 year-old. The Cowboys will talk about wanting to run more and better but there is no pretense who is the primary here and Bryant should see an increase so long as he remains healthy., 17519=An entirely new coaching staff was in place for 2013 with prolific results thanks to Aaron Kromer and Marc Trestman. In 2012 it was Brandon Marshall with 14 games as the primary receiver but Alshon Jeffery stepped up in a big way and nearly split the games as the most favored receiver. No reason to expect any different this year as this is the most prolific two-wideout set in the NFL., 98515=Use of this website constitutes acceptance of it's Privacy Notice and Terms of Use. © 2015 THEHUDDLE.COM. Part of USA TODAY Sports Digital Properties., 13298=Stevie Johnson was the primary receiver for 14 games in 2012 but he suffered through a groin injury last year plus a much less effective quarterback situation since Ryan Fitzpatrick was gone and the rookie E.J. Manuel only played for ten games. Donald Jones was gone but the rookie Robert Woods showed some promise. The same offensive scheme remains but the quarterback situation needs to improve and the Bills are not completely sold on Manuel., 66745=Antonio Brown was clearly the main man here and Emmanuel Sanders is expected to leave in free agency. That should make Brown even more important and remain a top ten receiver in volume of passes. The rookie Markus Wheaton made little progress last year but should be a bigger factor. Heath Miller turns 33 this year and is unlikely to repeat his career best season in 2012., 15715=For the first time, Steve Smith played a full season and yet did not have the majority of catches in most games. He tied with the tight end Greg Olsen and since he is 35-years-old it is likely that he won't command the lead again. The Panthers languish with a marginal passing game each year and do little to improve. That is bound to change this year since Brandon LaFell has proven to not be up to the task and there is just no one else to turn to on the 2013 roster. Free agency and the draft has to deliver some help for this declining unit., 76671=The team that covets a passing game and yet never seems to discover one. Losing Sam Bradford in week seven last year ruined what could have been an improving year. Bradford had thrown 14 touchdowns in those seven games but he'll need to start over again thanks to a torn ACL. And that is assuming that the 2010 Offensive Rookie of the Year is welcomed back as there is at least some talk about the Rams looking for a new answer at quarterback. Givens was the most common target in games and yet had minimal catches and yardage in those games. Jared Cook may be primed to improved but there is no certainty here. Making Tavon Austin be the first wideout drafted seems pretty suspect so far since he was never much more than a few gimmick plays and deep catches., 68733=That Antonio Gates was the primary in half of the games speaks to the problems the Chargers had in 2013 until the rookie Keenan Allen stepped up to make a major difference. Vincent Brown did nearly nothing and Eddie Royal made little difference. But Gates turns 34 and was able to last all 16 games for the first time in four seasons. His stats are bound to decline and Allen will hopefully improve and not suffer from a sophomore slump. The Chargers elevated Frank Reich from QB coach to offensive coordinator and should maintain the same basic offense., 73962=Michael Crabtree was the primary wideout in 11 games for 2012 but his injury ruined the regular season. Problem now is that Anquan Boldin is likely to remain - if they can figure out how - and that could dig into Crabtree's business. Make no mistake, Crabtree is the preferred wideout here and should rebound nicely in 2014 but Boldin's status could have at least minor impact., 53547=The Saints may want to get Jimmy Graham under contract without breaking the bank but he's clearly the main cog of the offense. Lance Moore was a far bigger factor in 2012 but disappeared this last season. Marques Colston turns 32 years old but still provides a possession complement to Graham. Kenny Stills should improve but he's going to remain more of a deep ball player that won't detract from the volume of passes for both Colston and Graham., 43147=Of all the positive improvements ushered in by HC Andy Reid, re-energizing the passing game really wasn't one of them. Dwayne Bowe remains the only one with any fantasy value and that is even less than 2012. This remains a run-first team with a solid defense. Passing is rarely needed and not done all that well when it does happen., 10525=Anquan Boldin was the most common primary receiver in 2012 and as expected Torrey Smith took his place. But he was less dominant than expected especially considering how much weaker the receiver corps were with Dennis Pitta missing most of the year and the rushing effort much less effective. Gary Kubiak was the first year offensive coordinator but just had little to work with and that should be cured in free agency and/or the draft., 61798=Greg Olsen's offense produced very similar stats to 2012 only Rod Streater and Denarius Moore swapped places as being the more targeted receiver and the tight end position was almost eliminated as a receiving position. Terrelle Pryor started the season well but later was injured and gave way to Matt McGloin. This offense spreads the ball around but mostly because there is no one receiver who merits that much more attention than the others. Barring a quarterback change or acquiring a talented veteran there's no reason to expect much change here.}",
    "textBeforeTable": "Receivers tend to be inconsistent, in no small part because they have to rely on someone else to get the ball in their hands while three or four other receivers also contend for the pass.. Still, we can identify trends in how teams use their primary receivers to help us properly asses their fantasy value. For the purposes of this report, a team’s “primary receiver” is the player who sees the most passes thrown his direction in a game. With some teams it’s a role that changes hands (no pun intended) on a weekly basis; with others, there is a clear-cut go-to guy being fed regularly. Overall, however, there is more spreading the ball around than you might think: 135 different players—101 wideouts, 34 tight ends—were the most targeted receiver on their team for at least one game last year. Additionally, no player was his team’s top target in all 16 games, and only two (A.J Green and Pierre Garcon) were the leading target in more than 12 of their team's games. For the 2013 regular season, here is a rundown of which receivers were thrown the most passes in a game for their team.   Print  ",
    "textAfterTable": "8.2 0.2 Tony Gonzalez 5 10.2 33% 90.4 37% 8.2 0.8 Julio Jones 3 11.7 42% 124.3 56% 9.0 0.7 Roddy White 3 13.0 42% 102.0 45% 9.3 0.7 Same offense, coaches and players came into the year but it was a disaster thanks to injuries. Now there are still questions as to how well Julio Jones can return from his foot fracture since it is an older injury that appears to continue to be an issue. Roddy White has been the primary in Atlanta for many years but now he turns 34 this year and suffered through an injurious season all last year. The question this year is how healthy Jones and White can be this year. With Gonzalez sternly claiming retirement, it should play out for a 50/50 primary share between the two wideouts if they can just stay on the field. Baltimore Ravens Gms Targets Target % Yards % of Yards Catches TDs Torrey Smith 9 10.6 38% 85.9 42% 5.1 0.4 Marlon Brown 3 9.0 26% 72.3 31% 5.0 1.0 Jacoby Jones 2 7.0 28% 67.5 29% 4.0 0.5 Dallas Clark 1 12.0 27% 87.0 28% 7.0 0.0 Dennis Pitta 1 11.0 31% 63.0 48% 8.0 0.0 Anquan Boldin was the most common primary receiver in 2012 and as expected",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}