{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Hartwick, has a campus activities board that plans activities every week. there is never not something to do, whether it be volunteering, sporting event or activities board event.",
            "If there is something in the Commons that you want all you have to do is ask the chef, he will either prepare it right there for you or have it the next day as a feature meal.",
            "Dorm life is amazing, your dorms are very small making for a community with in your residential halls. You make friends that truly last forever.",
            "Hartwick is a challenging college, if you do not want to work hard this school is not for you. 75 percent of the students are athletes, student athletes on this campus have a higher average GPA than those who do not participate in college athletics.",
            "Know what you want to do career wise, start early it is never to early to start interning. Go to career services and let them help you. Do well in class it is the best method to your ultimate college success.",
            "Hartwick college is an academically challenging school with professors that truly care about what you want to do with your career. My academic success come from my professors constantly pushing me to be a better student in multiple aspects. This college truly transforms a student into a professional."
        ]
    ],
    "pageTitle": "Hartwick College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Hartwick-College/reviews?_escaped_fragment_=/show/37849",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00098-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904492319,
    "recordOffset": 904448492,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{159733=Although I am not a member of greek life myself I'll tell you it is prominent at Hartwick. Both of my freshmen year roommates pledged in spring 2015 and they love it! Also, you don't have to join greek life to attend their awesome house parties!, 6283=One thing Hartwick is great about is Merit Aid scholarships. They can look at your psat or sat scores, although they are sat optional, as well as your gpa and that is solely the basis to finding your scholarship. If you can manage a CR+M score of 1200 or higher combined with a 92 or higher average you qualify for 22,000 per year off your tuition! I would say those combined with the endless internship, study abroad, and J-term opportunities you definitely will receive a bang for your buck., 125971=The city of Oneonta is very small. The transit system only runs Monday through Saturday and starts running at 6:00. This makes it hard if you do not own a car to get to town. There are various activities on campus that are fun to do. On top of that, in the student lounge, there is an air hockey table and pool table free for any of the students to use. Since the college is so small, I've never run into a problem with the student lounge being to crowded. There are many places on campus in which a group of students can go to relax by themselves., 24059=Hartwick College is a great school with about 1500 students. The faculty and staff here are greatly dedicated to the education of the students. They also do their best to accommodate for special or financial needs., 166921=© 2015, Cappex.com, LLC, 126811=There is only one dining hall on campus. The food is very good and there are many options to choose from. The hours of the dining hall could be improved. For instance, the dining hall closes every day between 3:00 and 4:00 to prepare for dinner. There are many classes that end around that time and it is hard to eat as they have significantly less options during this time. Also, the dining hall closes at 8:00 p.m. during the week and closes at 7:00 p.m. on Saturday and Sunday. This makes it difficult for busy students.}",
    "textBeforeTable": "10/17/2010 Reviewer is A current student here. 20 out of 20 people found this review useful. 1 of 36 Gabriella D. Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp =",
    "textAfterTable": "Sarah from Liverpool, NY 06/10/2011 Reviewer is Researching this school. Reviewer has been to campus. 4 out of 4 people found this review useful. 2 of 36 Categories Comments Great for these types of students -Students who want great Study Abroad opportunities. -Students who would like a suburban area to attend school. -Students who don't mind the crazy Upstate NY weather! -Students who like good relationships with their professors, pre-career advisement, and small class sizes. Tips for prospective students -Visit! That's definitely the best way to get an idea for yourself. -If you can't make a personal visit then check out their website and scholarship calculator. -Take advantage of all the awesome opportunities like J-terms and such. Every student I talked to considered it a highlight of their college career. Bang for the buck One thing Hartwick is great about is Merit Aid scholarships. They can look at your psat or sat scores, although they are sat optional, as well as your gpa and that is solely the basis to finding your",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}