{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Students who want an engineering degree. Students who want a science/technology non-engineering degree, to a lesser extent.",
            "St. Pat's and the week that leads to it is commonly associated with hangovers.",
            "Rated pretty highly in the bang for buck category, US colleges are unnecessarily expensive, but this one will require you to go into less debt than most.",
            "Party at frats if you're into that sort of thing. Otherwise, you make your own fun.",
            "Two stars for variety alone, there is no quality to be had here. There's a soft-serve ice cream machine and plenty of drink choices so you'll never be thirsty or wanting ice cream. It's all buffet style, so you can have as much as you want, but you probably won't want much.",
            "Residential Life always puts on a bunch of events, the lounges on each floor are furnished pretty well. I live in TJ which was recently renovated so the rooms are pretty nice, the bathrooms are decent. Elevators break once in a while so get used to using stairs.",
            "It may seem pretty lax at first, but once you get out of gen eds it can be pretty rough. As long as you put forth the effort you will see a good return with your grades.",
            "Don't miss any classes if you can help it (pay attention in class, take notes), get your GPA/ACT scores up to grab good scholarships from the school itself. Go to office hours if you really need help, listen to instructor's advice on how to solve problems and how to prepare for tests.",
            "Good college for science and technology related majors, lots of engineering majors (all of them ABET accredited). Small class sizes for most courses, instructors are friendly and easily reachable during office hours. Only downsides are the lack of girls on campus and the town is pretty small (not a bad thing in my opinion)."
        ]
    ],
    "pageTitle": "Missouri University of Science and Technology (MST) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Missouri-University-of-Science-and-Technology/reviews?_escaped_fragment_=/show/15049",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00078-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901868083,
    "recordOffset": 901804489,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{112600=There are a lot more guys than girls at this university. Freshmen and Sophomores are ~3:2, after that age group, the ratio drops to ~4:1., 31187=I enjoy MS&T for the most part, but there are a few things that aren't so great about it. The work load seems to really build up sometimes and the Male to Female ratio is 3:1 to name a few. Things like the annual St. Pat's celebration always make up for stuff like that though., 13722=Engineers. This school gives you the knowledge to be successful in whichever area you're interested in. And the have quite a lot of engineering departments. Nerds. Hard workers. Team players. Hands-on learners. Boy to Girl ration - 5:1 - Ladies, must I say anymore?, 202048=I have visted S&T during one of there miner days and plan to attend Fall of 2013. I'm so excited about going to this school. I love the student body size and the courses offered., 323542=© 2015, Cappex.com, LLC, 299401=With the guy to girl ratio around 6:1, there are about 3 sororities and about 18 fraternities. Greek life is very social and active around campus. Many Greeks help out with volunteer work and other activities outside of their house. Greek housing can range from very ornate to run-down depending on different chapters.}",
    "textBeforeTable": "07/06/2009 Reviewer is A current student here. 20 out of 20 people found this review useful. 1 of 80 Julie from Camdenton, MO Check out reviews left by other students or leave your own review. You could win a free scholarship. Missouri University of Science and Technology Reviews Missouri University of Science and Technology › Missouri › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am enjoying being here I do like it here. The intelligence is something to admire. I do not mean to dog others, but there is a kind of freshness here that was not so much in high school. It is like my mind can breathe. Also, the town is COMPACT, not SMALL. It is very full but not fat. This makes it relatively easy to get to places and find what you need. Am learning a lot In the math class I took, I learned an interesting learning style; the math I'd had before in High School (like in a summary) but I learned how to make things stick very well in MS&T's math class. My focus is in Computer Science. While I've had programming experience before, the pace of the class is incredible and by the end of Semester One we are now pretty much at the extent of my knowledge. So, given the pace we were at, I expect to learn a lot Semester Two. Login to rate or flag the reviews Benjamin from Rolla, MO 07/26/2011 Reviewer is A current student here. 12 out of 12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}