{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "bradley's job placement rate is top notch making every cent count.",
            "there are many athletic games that can be watched and other bonding nights set up by the college.",
            "the food seemed ok. there are many options on campus.",
            "dorm life is offers the full college experience, with entire floor bonding and instant friends to be made.",
            "one of the top business schools in the country.",
            "1) vsit the campus. the atmosphere when stepping on the campus will tell you if it is right for you. 2) stay ahead of the deadlines.",
            "bradley has an indescribable atmosphere that gives students a sense of home. the professors and president are very personable and that is, in my opinion, every students dream."
        ]
    ],
    "pageTitle": "Bradley University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Bradley-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00156-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893009887,
    "recordOffset": 892933504,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{101734=definitely has improved since 2009. lots of vegetarian choices, great staff, and options that are even open late., 359697=© 2015, Cappex.com, LLC, 336764=The food isn't terrible. It's obviously not a fine dining experience though. As a vegetarian I am a tad disappointed with the options that I have. My main problem is with the options you have for meal plans. The only meal plans available cost 2000 dollars. I am 5'1 and 110 pounds, I do not eat 2000 dollars worth of food. If you do, it's a great deal! I do not., 164991=Students will find more than just the average college experience at Bradley University. With a student/faculty ratio of 12:1, each student receives personal attention in the classroom and is able to establish a unique relationship with their professors. In addition to the opportunity for students to get to know their professors well, students at Bradley also have numerous opportunities to meet with the President of the University; a very rare opportunity at most other Universities. Also unique to Bradley; all classes at Bradley University are taught by Professors with a degree in their area of expertise instead of a teaching assistant or graduate student. Each student is also offered two hours a week of free tutoring in any subject. Upon accepting admittance to Bradley University, students are setting themselves up for success. Excellent resources such as the Smith Career Center, assists students in achieving helpful internships and timely job placements upon graduation., 275763=The school is very proud of their founder, Lydia Moss. They take mornings class off one day in October to celebrate the founding of the school., 39442=Bradley's campus is a very greek campus. There are over 1300 students in the various fraternities and sororities., 233527=Peoria is somewhat a dangerous area. That's not to say that you should be scared out of your mind walking from the cafeteria to your dorm at 4 pm on a weekday.No! Just take precaution and think before you do. This means you should NOT take a jog at 5 o'clock in the morning carrying your brand new iphone-that wouldn't be smart!What you should do is walk in groups when you have to walk somewhere at night, and use your brain!! Nothing will happen to you if you make wise choices. Also, since police are always patrolling the campus you shouldn't have a reason to be afraid. They are always on guard for trouble.}",
    "textBeforeTable": "07/16/2009 Reviewer is A current student here. 25 out of 28 people found this review useful. 1 of 76 BRITTANY from Matteson, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Categories Comments Great for these types of students Engineering or nursing students should definitely look into Bradley. The programs here are recognized nationwide and they provide some of the best knowledge in these areas of study. Tips for prospective students From the moment you arrive at campus, go out and get involved. Join a fraternity or a sorority, clubs, groups, anything that you might find interesting or fun. You can learn so many things that you never thought you'd have the chance to. I myself took a fencing class, something I never pictured myself doing, but it was absolutely worth it. Go out and meet people, Bradley isn't a huge campus, so you'll be seeing the same people a lot, might as well make them your friends. As for classes, study, ask for help, and focus on you goals. Bang for the buck Bradley is a top school in the nation. It is known nationwide, I know this personally as I had a friend mention my school to her friend in California, and they had heard of Bradley's prestige. If you put in the work, you are guaranteed to get the education you are seeking. Outside of classes, the school offers so many extracurricular activities at no extra charge. You get your moneys worth. Am",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}