{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Never had to live in the dorms.",
            "Never had to live in the dorms.",
            "Great if you need to work during the day. Night and online classes offered.",
            "Pretty good school. Great for working students. Teachers not the greatest."
        ]
    ],
    "pageTitle": "Brenau University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Brenau-University/reviews?_escaped_fragment_=/show/88893",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 915620403,
    "recordOffset": 915580128,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{162576=© 2015, Cappex.com, LLC, 86566=Be ready to pay a lot more for online classes. Each online class costs $1600. A lot of classes are not offered on ground, therefore you are forced to take the classes online and pay twice the cost., 66422=Just completed the Miracle Mile Walk for Breast Cancer in October 2012....it was nice, but more people need to be invovled., 29632=This is a wonderful school. The august campus only gets up to about 30 students in a room but they are usually not that full. This helps you have more one on one with the teacher, which can mean better grades., 47889=The education is good, but everything else is SEVERELY overpriced. The food quickly becomes bland (again, no variety - same entrees and sides every week) and the housing is comparable to student housing that costs $2000 or less but will cost you at least $8,000+. If you must go here, choose the online school option. Even without needing to pay for housing or a meal plan, Brenau has cost me $10,000 for ONE semester of online schooling, not one year. That's extremely pricey., 46561=When a student becomes engaged, it's tradition to toss her into the fountain. Other traditions include annual celebrations such as May Day (which actually occurs in April), an event where the student body wears dresses, and (if you like) fancy hats and revel in Brenau's past and progress. Alumni come to speak and share wisdom with current students. Food and dancing is abundant during this day in the sun. Brenau also has a barbeque competition known as the Brenau BBQ Championship. Many different vendors sell their barbeque and compete for bragging rights (and possibly other prizes, I'm not sure). Everyone may attend both these events, not just students. These are a great opportunity to meet new people or invite your family to spend a day with you. ***Some believe Pearce Auditorium is haunted by a female ghost named Agnes. She's supposedly a friendly ghost, and many stories have been told about her. There is a specific seat in Pearce Auditorium in which you can supposedly feel her presence. Look it up, if you are curious!}",
    "textBeforeTable": "06/07/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 11 out of 12 people found this review useful. 1 of 40 Paola from Cumming, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. Brenau University Reviews Brenau University › Georgia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Shannon from Lincolnton, GA 12/29/2009 Reviewer is A current student here. 11 out of 11 people found this review useful. 2 of 40 Categories Comments Tips for prospective students Be willing to work hard and take pride in your hard work! It's all worth it in the long run! Bang for the buck College is very expensive and Brenau is a private school. I do highly recommend attending Brenau, but I also recommend working hard to find scholarships for yourselves. That's why I'm here on Cappex, and let me just say how thankful I am for how easy Cappex makes searching and applying for scholarships! Am enjoying being here I actually attend Brenau's Online College, but it allows me to travel full-time with my family and to make a difference in lives around the country all while pursuing my degree. Am learning a lot The professors that I have had thus far have proven",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}