{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "178.60",
            "171.62",
            "151.54",
            "141.73"
        ],
        [
            "NSE",
            "178.69",
            "171.68",
            "151.57",
            "141.75"
        ]
    ],
    "pageTitle": "Fortis Healthcare Stock Price, Share Price, Live BSE/NSE, Fortis Healthcare Bids Offers. Buy/Sell Fortis Healthcare news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/hospitals-medical-services/fortishealthcare/FH",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00159-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 606632559,
    "recordOffset": 606580800,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{133445=28 July 2015, 133956=UnitedBrewerie Jul Fut, 217789=Astec LifeSciences Recommended on Mar 31st 2015, 134663=JSWSteel Jul Fut, 219098=Fortis Health is in the Hospitals & Medical Services sector. The current market capitalisation stands at Rs 8,593.46 crore. The company management includes Malvinder Mohan Singh - Executive Chairman, Shivinder Mohan Singh - Executive Vice Chairman, Brian Tempest - Non Executive Director, Gurcharan Das - Non Executive Director, Harpal Singh - Non Executive Director, Joji Sekhon Gill - Non Executive Director, Pradeep Ratilal Raniga - Non Executive Director, Preetinder Singh Joshi - Non Executive Director, Sunil Godhwani - Non Executive Director, Udai Dhawan - Non Executive Director, Lynette Joy Hepburn Brown - Addnl.Non Exe.Independent Director, Ravi Umesh Mehrotra - Non Exe.Non Ind.Director, Shradha Suri Marwah - Addnl.Non Exe.Independent Director. It is listed on the BSE with a BSE Code of 532843 and the NSE with an NSE Code of FORTIS. Its Registered office is at Escorts Heart Institute and Research Cen Okhla Road, New Delhi,Delhi - 110025. Their Registrars are Karvy Computershare Private Ltd.}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}