{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "DMACC is very safe. They have security everywhere.",
            "Downtown Des Moines!",
            "Go to SE Delaware! We call it Food Street.",
            "The academics aren't super difficult. I'd say this is a good place to break yourself in for a 4 Year College.",
            "It is affordable! I love small classes and individual attention you can get from the instructors."
        ]
    ],
    "pageTitle": "Des Moines Area Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Des-Moines-Area-Community-College/reviews?_escaped_fragment_=/show/81962",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00321-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890796367,
    "recordOffset": 890740054,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{151458=https://go.dmacc.edu/clubs/ankeny/phithetakappa/Shared%20Documents/Phi%20Theta%20Kappa%20Orientation%20Packet-fall-2012.pdf Is the link to read about the Phi Betas, 200582=I do not live in the dormitories. However, brand new construction is underway and will be completed for the fall 2013 - 2014 year. The location is perfect and located minutes from major freeways and interstates as well as, prominent entertainment, lodging, restaraunts, and shopping., 25145=I am graduating in May from the DMACC Carroll Campus with my Associates Degree. I have greatly enjoyed my experiences here! I have received tremendous encouragement from all of my instructors! I love the small campus and atmosphere!, 260524=© 2015, Cappex.com, LLC, 199331=DMACC most definitely offers a quality education for the a lower and affordable price. My average cost for 12 hour is about $1800.00 for classes and about $600.00 for books.}",
    "textBeforeTable": "01/07/2010 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 61 Sam from Clive, IA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Login to rate or flag the reviews Krista from Urbandale, IA 02/01/2011 Reviewer is A current student here. 2 out of 3 people found this review useful. 2 of 61 Categories Comments Great for these types of students If you are unsure of what you would like to major in, I highly suggest going to this college. It's a great way to get your generals done and by taking a variety of classes, maybe you can narrow down your decision by seeing what you like/dislike. If you are thinking about transferring to a four year college after going to a two year, DMACC offers a few 2+2 programs that will help make a smooth transfer. It will also be cheaper than many other colleges. Tips for prospective students There are many resources that are offered for students, so use them to your advantage. If you ever are struggling in a certain class, seek out some extra help. The Academic Achievement Center at DMACC can help out with a lot of different subject areas including math, writing, science, and other areas.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}