{
    "relation": [
        [
            "",
            "Previous Forecast (A)",
            "Revised Forecast (B)",
            "Change (B-A)",
            "Change (%)",
            "(Reference) Year ended March 31, 2011"
        ],
        [
            "Net Sales",
            "260,000",
            "245,000",
            "(15,000)",
            "(5.8%)",
            "239,363"
        ],
        [
            "Operating Income",
            "30,000",
            "24,000",
            "(6,000)",
            "(20.0%)",
            "32,102"
        ],
        [
            "Ordinary Income",
            "32,000",
            "26,000",
            "(6,000)",
            "(18.8%)",
            "32,671"
        ],
        [
            "Net Income",
            "23,000",
            "-",
            "-",
            "-",
            "24,428"
        ],
        [
            "Net Income per Share (Yen)",
            "70.44",
            "-",
            "-",
            "-",
            "74.80"
        ]
    ],
    "pageTitle": "NGK Insulators Ltd : NAS Battery Fire Incident and Response | 4-Traders",
    "title": "",
    "url": "http://www.4-traders.com/NGK-INSULATORS-LTD-6491164/news/NGK-Insulators-Ltd--NAS-Battery-Fire-Incident-and-Response-13863456/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00317-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 271114803,
    "recordOffset": 271086510,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{69800=The fire occurred at around 7:20 a.m. on September 21, and at around 3:55 p.m. that afternoon the fire authorities declared the fire had been brought under control. Thereafter, the temperature of the combustion residue was monitored and at 3:25 p.m. on October 5 the fire authorities confirmed that the fire had been extinguished., 68715=Release: October 28, 2011 Company Name: NGK INSULATORS, LTD. Listing Code: 5333 Stock Exchange Listings: Tokyo and Nagoya Representative: Taro Kato (Mr.), President Contact: Susumu Sakabe (Mr.), Director & Senior Vice President (TEL: +81-52-872-7230), 70162=At present, the fire authorities are investigating the cause of the fire. NGK, for its part, formed an Accident Investigation Committee (chaired by Takeyuki Mizuno, Director and Senior Vice President) on September 21, which is looking into the cause of the fire and measures to prevent a reoccurrence., 69456=On September 21, NGK-manufactured NAS batteries for storing electricity owned by The Tokyo Electric Power Company, Incorporated (Head Office: Chiyoda-ku, Tokyo) and installed at the Tsukuba Plant (Joso City, Ibaraki Prefecture) of Mitsubishi Materials Corporation (Head Office: Chiyoda-ku, Tokyo) caught on fire., 71924=Despite the best efforts with the help of interested parties, more time is needed to identify the cause of the fire a month after the incident. At present, NGK continues to place top priority on safety measures and therefore asks customers not to use NAS batteries for the time being. NGK will also not manufacture batteries at its plants for the time being. Regarding new shipments, NGK has no option but to postpone shipments until safety is confirmed. Accordingly, NGK expects to see a sharp drop in sales of batteries that it had expected to be concentrated in the fourth quarter of the current fiscal year, and also expects to incur a loss on operations at plants from October., 70495=NGK began shipping NAS batteries in 2002 and since then they have been installed in a total of 174 locations in 6 countries around the world, storing 305,000 kilowatts of electricity. In February 2010, a fire broke out in an NAS battery operating at a customer's business premises. However, the NAS battery that caused the fire was a different, special type of battery. NGK implemented preventative measures with respect to this special type of battery, as well as re-confirmed the safety of all NAS battery types. NGK regrets there has been another fire despite these efforts., 73208=(Reference) Forecasts of consolidated financial results for the fiscal year ending March 31, 2012 (April 1, 2011 to March 31, 2012), 69037=NGK INSULATORS, LTD. has announced that it decided today to revise its forecasts of full-year consolidated financial results due to the enactment of safety countermeasures and other responses to a fire incident on September 21 this year relating to NAS (sodium-sulfur) batteries manufactured and sold by NGK., 75865=(Note) Figures for the year ended March 31, 2011 have been retrospectively restated to reflect changes in accounting policy.}",
    "textBeforeTable": "(Millions of yen, except per share data and percentage) (Reference) Forecasts of consolidated financial results for the fiscal year ending March 31, 2012 (April 1, 2011 to March 31, 2012) For details of revisions to operating results, please refer to the separate press release issued today titled \"Notice Regarding Differences in Business Forecasts and Revisions to Business Forecasts.\" Additional special losses may arise for additional safety measures on the installed batteries and at the manufacturing stage. However, because of the uncertainty at this stage, NGK has not determined its net income forecast. NGK will make an announcement as soon as it is reasonably able to do so. Despite the best efforts with the help of interested parties, more time is needed to identify the cause of the fire a month after the incident. At present, NGK continues to place top priority on safety measures and therefore asks customers not to use NAS batteries for the time being. NGK will also not manufacture batteries at its plants for the time being. Regarding new shipments, NGK has no option but to postpone shipments until safety is confirmed. Accordingly, NGK expects to see a sharp drop in sales of batteries that it had expected to be concentrated in the fourth quarter of the current fiscal year, and also expects to incur a loss on operations at plants from October. 2. Outlook and Impact on Business Performance NGK deeply regrets any",
    "textAfterTable": "(Note) Figures for the year ended March 31, 2011 have been retrospectively restated to reflect changes in accounting policy. NOTICE This document contains forward-looking statements that are based on management's expectations, estimates, projections and assumptions that were available and reasonable at the time of release. Actual future results and trends may differ materially from those in the forecasts due to a variety of factors.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}