{
    "relation": [
        [
            "Places - M",
            "Merton",
            "Methwold",
            "Metton",
            "Middleton",
            "Mileham",
            "Mintlyn",
            "Morley St Botolph",
            "Morley St Peter",
            "Morningthorpe",
            "Morston",
            "Morton-on-the-Hill",
            "Moulton St Michael(Great)",
            "Moulton St Mary",
            "Mulbarton",
            "Mundesley",
            "Mundford",
            "Mundham"
        ],
        [
            "Pre 1834",
            "",
            "",
            "",
            "",
            "MitL-I",
            "",
            "Fore-I",
            "Fore-I",
            "",
            "",
            "",
            "",
            "Acle-GU",
            "",
            "Gim-GU",
            "",
            "Lodd-I"
        ],
        [
            "Post 1834",
            "Wayland",
            "Thetford",
            "Erpingham",
            "Freebridge Lynn",
            "Mitford and Launditch",
            "Freebridge Lynn",
            "Forehoe",
            "Forehoe",
            "Depwade",
            "Walsingham",
            "St Faith's",
            "Depwade",
            "Blofield",
            "Henstead",
            "Erpingham",
            "Thetford",
            "Loddon and Clavering"
        ]
    ],
    "pageTitle": "GENUKI: Norfolk: Genealogy: Poor: Unions:",
    "title": "",
    "url": "http://www.origins.org.uk/genuki/NFK/norfolk/poor/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00046-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 632838111,
    "recordOffset": 632825690,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{823=The relief of the Poor after the Dissolution of the Monastries was covered by Poor Law Acts in the reign of Elizabeth I in 1601. Further Acts followed in the next 250 years. Villages could build poorhouses (from 1732) and this was done in some parishes. These local Incorporations are indicated by \"-I\" in their names., 1200=Gilbert's Act 1782 enabled parishes to group together forming a union (which are listed later) to build workhouses. These are indicated by \"-GU\" in the name., 149754=See also the Workhouses before 1834 page and the Post 1834 Unions page, 150151=Copyright © Mike Bristow. March 2015}",
    "textBeforeTable": "List of Towns & Parishes A - Z This replaced the parish basis of poor relief. Poor Law Unions were brought in with Boards of Guardians. A number of Incorporations chose not to join the new Unions although some did in later years. Poor Law Amendment Act of 1834 Gilbert's Act 1782 enabled parishes to group together forming a union (which are listed later) to build workhouses. These are indicated by \"-GU\" in the name. Gilbert's Act 1782 Unions The relief of the Poor after the Dissolution of the Monastries was covered by Poor Law Acts in the reign of Elizabeth I in 1601. Further Acts followed in the next 250 years. Villages could build poorhouses (from 1732) and this was done in some parishes. These local Incorporations are indicated by \"-I\" in their names. (Unions, Incorporations and Workhouses) Norfolk: Poor Law  ",
    "textAfterTable": "Ashill WkHse Swaffham Ashmanhaugh Tuns-I (to 1869) Smallburgh (from 1869) Ashwellthorpe Depwade Ashwicken Freebridge Lynn Aslacton Depwade Attleborough Wayland Attlebridge St Faith's Aylmerton Aldb-GU Erpingham Aylsham WkHse Aylsham Places - B Pre 1834 Post 1834 Babingley Freebridge Lynn Baconsthorpe Erpingham Bacton Tuns-I (to 1869) Smallburgh (from 1869) Bagthorpe Docking Bale Walsingham Banham (to 1902) Banham (from 1902) WkHse Guiltcross Wayland Banningham Oult-GU Aylsham Barford Fore-I Forehoe Barmer Docking Barney Walsingham Barnham Broom Fore-I Forehoe Barningham Town(or Winter) Erpingham Barningham, North Erpingham Barningham, Little Aylsham Barsham, East Walsingham Barsham, West Walsingham Barsham, North Walsingham Barton Bendish Downham Barton Turf Tuns-I (to 1869) Smallburgh (from 1869) Barwick Docking Bastwick (Repps with Bastwick) Fleggs",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}