{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2004-08-02T00:00:00",
            "2007-07-24T00:00:00",
            "2007-12-26T00:00:00"
        ],
        [
            "Description",
            "GPS and XYZ-Point Data Processing The National Geodetic Survey's PAGES-NT software was used to compute double differenced, ionospherically corrected, static GPS solutions for each GPS base station with precise ephemeredes from the International GPS Service (IGS). As part of the solution tropospheric zenith delays were estimated and L1 and L2 phase biases were fixed as integers. Aircraft trajectories were estimated with respect to all base stations using National Geodetic Survey's Kinematic and Rapid-Static Software (KARS) software. Trajectories were double-differenced, ionospherically corrected, bias-fixed GPS solutions computed with precise IGS ephemeredes. Coordinates for base stations and trajectories were in the International Terrestrial Reference Frame of 2000 (ITRF00). The aircraft trajectory were transformed from the ITRF00 to North American Datum of 1983 (NAD83) using the Horizontal Time Dependent Positioning (HDTP) software (Snay, 1999) The 1Hz GPS trajectory and 50Hz aircraft inertial measurement unit (IMU) data were combined in Applanix's POSProc version 2.1.4 to compute an aided inertial navigation solution (INS) and a 50Hz, smoothed best estimate of trajectory (SBET). The SBET, laser range observations, scanner position information, and GPS/internal clock files were processed in Realm 2.27 software suite to generate lidar data points in the Universal Transverse Mercator (UTM) projection. Lidar point data were compared to GPS ground survey data and 1998 ATM lidar data to estimate lidar instrument calibration parameters: roll and pitch biases, scanner scale factor, and first/last return elevation biases. An iterative, least-squares methodology was used to estimate calibration parameters so as to minimize differences between lidar and ground GPS data. Samples of lidar data were used to create high-resolution digital elevation models (DEM); these DEM were inspected for horizontal or vertical anomalies. After system calibration and initial quality control step, the adjusted lidar x,y,z-point data were generated by REALM software and output, by shoreline pass, in UTM Zone 11 with elevations being heights above the GRS-80 reference ellipsoid (HAE). The output format from REALM 2.27 was a 9-column ASCII file containing: the second in the GPS week, easting, northing and HAE of the first lidar return, the easting, northing and HAE of the last lidar return, and the laser backscatter intensity of the first and last returns. Using the GEOID99 geoid model, heights above the GRS80 ellipsoid were converted to orthometric heights with respect to the North American Vertical Datum of 1988 (NAVD88). Parse the 9-column lidar point file into 3.75-minute quarter-quadrangle components. Convert UTM Easting and Northing to geodetic latitude and longitude with respect to the GRS80 ellipsoid. The conversion was computed using the TMGEOD and TCONPC fortran subroutines written by T. Vincenty (NGS). Each record contains 9 columns of data: time tag (seconds in the GPS week), first return Latitude, first return Longitude, first return NAVD88, last return Latitude, last return Longitude, last return NAVD88, first return intensity, and last return intensity. In some cases either the first or last return values may be missing (5 columns). Latitude and longitude are in decimal degrees with nine significant digits to retain the 0.01m resolution of the UTM coordinates. West longitude is negative and north latitude is positive. The UTM quarter-quad files were re-organized into latitude delineated files. UTM quarter-quads files that were delineated by the same upper and lower latitude bounds were concatenated. The lat-long files were named by the month-year of the survey (e.g. mar03) and the lower latitude bounding the quarter-quad.",
            "The NOAA Coastal Services Center (CSC) received files in ASCII format. The files contained LiDAR intensity and elevation measurements. CSC performed the following processing on the data to make it available within the LiDAR Data Retrieval Tool (LDART) 1. Data returned to ellipsoid heights from NAVD88, using GEOID99. 2. Data converted to LAS format. 3. The LAS data were sorted by latitude and the headers were updated.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/200310_SCRIPPS_m49.xml&view=ISO19115Components-HTMLTable",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00074-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 615889208,
    "recordOffset": 615872814,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:200310_SCRIPPS_m49Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Component Title Date Citation Identifier 1 Air and Ground GPS files from 08703 and 08803 2003-10-25 1 North American Datum 1983 2007-01-19 1 October 2003 Lidar Point Data of Southern California Coastline: Newport Beach to US/Mexican Border 2004-08-31 1 Raw lidar data output from ALTM 1225 2003-10-25 3 none Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 3 Bureau of Economic Geology, University",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}