{
    "relation": [
        [
            "Patent application number",
            "20100055674",
            "20100310605",
            "20120141977"
        ],
        [
            "Description",
            "UTILIZING LIVER CELL LINE QSG-7701 TO BE INFECTED WITH HEPATITIS B VIRUS - The use of the liver cell line QSG-7701 for HBV infection includes the following steps: directly infecting QSG-7701 cells with purified HBV particles and facilitating the infection by DMSO and/or PEG treatment. The easily available QSG-7701 liver cell line may not require pre-differentiation induction and is naturally susceptible for HBV infection. This cell line provides near normal physiological conditions for HBV infection, especially the infection conditions that are characterized with Chinese origin. This cell line is suitable for investigating the life cycle of HBV. Therefore, this cell line is useful for the investigation of viral infection processes and for the development of drugs that specifically target these processes.",
            "ANTI-HCV VACCINE AND PREPARATION METHODS AND USES THEREOF - An anti-HCV vaccine, which is prepared through recombination of an NS gene in series, including NS3/NS4 and NS4/NS5, with an adenovirus vector. The preparation methods and uses of the anti-HCV vaccine.",
            "HEPATITIS B VIRUS MUTATION STRAIN WITH RESISTANCE TO ADEFOVIR DIPIVOXIL AND THE USES THEREOF - A HBV mutation strain is provided, wherein rtE218G mutation occurs at the polymerase region of the mutation strain. The use of the HBV strain in screening anti-HBV drugs and related detection reagents used to detect rtE218G mutation are also provided."
        ],
        [
            "Published",
            "03-04-2010",
            "12-09-2010",
            "06-07-2012"
        ]
    ],
    "pageTitle": "Wei, Beijing - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/wei-beijing-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00045-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 451681099,
    "recordOffset": 451640696,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Lai Wei, Beijing CN 06-20-2013 GENERATING A TEST WORKLOAD FOR A DATABASE - A method of transferring files in a data-processing network using a current node within the network includes reading an outbound content and outbound characteristics of an outbound file. An outbound message is created having outbound strings including a first set of the outbound strings representing the outbound characteristics and a second set of the outbound strings representing the outbound content. The outbound message is sent to a receiver node within the network. An inbound message is received from a sender node within the network. The inbound message has inbound strings including a first set of the inbound strings representing inbound characteristics and a second set of the inbound strings representing inbound content. An inbound file having the inbound content is stored, and the inbound characteristics are applied to the inbound file. 20130159353 05-30-2013 ESTIMATION OF A FILTER FACTOR USED FOR ACCESS PATH OPTIMIZATION IN A DATABASE - A computer program product and method for estimating a filter factor for access path optimization in a database are provided. The method includes extracting from a statement segment for database query a relation condition which defines the relationship between a variable and a first table. The method includes obtaining first statistics information according to the relation condition and the statistics information of the first table. The method includes extracting from the statement segment a filter condition which defines the relationship between the variable",
    "textAfterTable": "Lei Wei, Beijing CN Patent application number Description Published 20110022596 Method and system for document indexing and data querying - Generating a document index comprises: obtaining a document to be indexed; performing a monadic partition operation on the document to obtain a plurality of monadic partitions; and for each monadic partition in the plurality of monadic partitions: determining whether said each monadic partition is a filter character; in the event said each monadic partition is a filter character, forming a polynary partition by combining the monadic partition with at least one other monadic partition adjacent to the monadic partition, and indexing the polynary partition; and in the event that the monadic partition is not a filter character, indexing the monadic partition. Querying data comprising: receiving a data query; performing a monadic partition operation on the data query to obtain a plurality of monadic partitions; and for each monadic partition in the plurality of monadic partitions: determining whether said each monadic partition is a filter character; in the event that the monadic partition is a filter character, forming a polynary partition by combining the monadic partition with at least one monadic partition adjacent to the monadic partition, and searching a preset index using the polynary partition to obtain a search result corresponding to the polynary partition; and in the event that the monadic partition is not a filter character, searching the preset index using the monadic partition to obtain a search result",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}