{
    "relation": [
        [
            "Argument",
            "id",
            "name",
            "class",
            "props",
            "server"
        ],
        [
            "Definition",
            "The unique identifier for the destination to be updated.",
            "Optional. A name for the destination.",
            "The full classname of the destination. See Table 6-4 for a list of available destinations.",
            "Optional. The name/value properties to use for the destination. You can add a new property, or update or remove an existing one. If you update properties, you must specify all properties. If you omit a property, it is removed. For example, if a destination contains the properties LoggerName and severity, and you omit severity, it will be removed from the destination. See addDMSEventFilter for information about the syntax and allowed values.",
            "Optional. The server on which to perform this operation. The default is the server to which you are connected."
        ]
    ],
    "pageTitle": "DMS Custom WLST Commands",
    "title": "",
    "url": "http://docs.oracle.com/cd/E15586_01/web.1111/e13813/custom_dms.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00259-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 73247659,
    "recordOffset": 73225728,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 20 Sep 2012 17:25:20 GMT",
    "textBeforeTable": "[,props= {'name': 'value'...}] [, server=server_name) updateDMSEventDestination(id=id [, name=dest_name], class=class_name Syntax      Updates an existing destination, allowing a specified argument to be updated. You must be connected to the Administration Server to update a destination. If you are not, an error is returned. Description    Use with WLST: Online Command Category: DMS Event Tracing updateDMSEventDestination    Event-route for filter \"None\", destination \"destination1\" removed removeDMSEventRoute(destinationid='destination1') The following example removes the event route with the destination destination1: Event-route for filter \"mds1\", destination \"jfr\" removed removeDMSEventRoute(filterid='mds1', destinationid='jfr') The following example removes the event route with the filterid mds1 and the destination jfr: Example       Optional. The server on which to perform this operation. The default is the server to which you are connected. server   Optional. The unique identifier for the specific destination. The destination must exist. destinationid   Optional. The unique identifier for the filter.",
    "textAfterTable": "Examples The following example updates the name of the destination jfr: updateDMSEventDestination(id='jfr', name='Alternative Flight-Recorder') Destination \"jfr\" updated. The following example attempts to update a destination that does not exist. The command returns an error: updateDMSEventDestination(id='destination1',  props={'loggerName': 'MyNewTrace2-logger'}) Destination \"destination1\" does not yet exist. Unable to update this. updateDMSEventFilter Command Category: DMS Event Tracing Use with WLST: Online Description Updates an existing filter in the Event Tracing configuration. You must be connected to the Administration Server to update an event filter. If you are not, an error is returned. Syntax updateDMSEventFilter(id=id [, name=name] [,etypes=etypes], props= {'prop-name': 'value'...} [,server=server_name]) Argument Definition id The unique identifier for the filter to be updated.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}