{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Our campus is extremely safe. Due to our small size, any suspicious activity is reported and handled right away and we have campus safety on call 24 hours a day, seven days a week, 365 days a year.",
            "Clubs are all student initiated at HIU. There are not too many right now, so the opportunity to develop your own is very realistic.",
            "This school is great for students who want to be more than a number and want to be cared for by a community of Christians who value education and living life together.",
            "One of our most famous events is called Clash-n-Bowl. We put on the most ridiculous outfits and go bowling for the night. We are the only people in the bowling alley and we dance and sing karaoke and look ridiculous and it the best!",
            "HIU is the cheapest Christian college in Southern California and if you choose to really embrace this community, the price is definitely worth it.",
            "We are only 15 minutes from Disneyland and 30 minutes from the beach, and those are always visited by students. The area also has a ton of restaurants, chain or not, to meet any dining needs and to also serve as fun places to hang out with friends. The campus also has a pool and the Student Activities team is always putting on events to bond students.",
            "Just like any cafeteria, the food is hit or miss. But, there is always a salad option, rotisserie chicken, burgers, sandwiches, grilled cheese, and my personal favorite, French fries. The cafeteria is a huge part of our community life and I would encourage all students, living on campus or not, to get a meal plan.",
            "I love dorm life! Never again will you have the opportunity to live with hundreds of other people from all different walks of life and it is acceptable to just randomly ask them about it. The residence assistants create an environment of community and are eager to help students with any problems that arise. I would recommend living in the dorms for any student attending HIU.",
            "In just two and half years I have learned the basics of Greek and Hebrew, how to study the Bible, how to write masterful papers, and how to ask for help. As I prepare to leave, I feel confident to not only be successful in my chosen career field, but to also be successful as I look at graduate schools and hopefully doctorate programs.",
            "My advice for prospective students would be to call your admissions counselor. Showing interest is always good, but then you are also able to develop some solid relationships before you even step foot on campus. Having at least one familiar person can make the transition easier.",
            "Choosing to attend HIU was the best choice I ever made. Not only have I received an excellent education and preparation for my future career, but the community has made me feel like I am home here. This is the place for any student who wants to grow academically, spiritually, and in countless other ways."
        ]
    ],
    "pageTitle": "Hope International University (Hope) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Hope-International-University/reviews?_escaped_fragment_=/show/41800",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00296-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901772635,
    "recordOffset": 901738835,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{51274=Every semester during finals, the teachers would go into the cafeteria and serve us breakfast betwen 11-12:30 am., 136105=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "02/13/2010 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 6 out of 6 people found this review useful. 1 of 30 Tabitha from Downey, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. Hope International University Reviews Hope International University › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Am enjoying being here I love this community. Everyone is laid back and fun. Because it is small, it is a very tight-knit community and you can really get to know the other students. Living on campus is so worth it as well. You get a much more complete college experience and become much more a part of the community by living on campus. Am learning a lot The professors here are amazing. It is a small school so you actually get to know your professors. They will work with you if you are struggling. They challenge your thinking and try to get you to think critically, not just accept everything you are told. The professors also have tons of life experience that you can learn from as well. Login to rate or flag the reviews Kaleigh from Fullerton, CA 01/30/2012 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 30 Categories Comments Campus Safety",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}