{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Other",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "116,941",
            "73,586",
            "46,521",
            "7,347",
            "6,129",
            "4,230",
            "287,027"
        ],
        [
            "Congregations",
            "33",
            "254",
            "127",
            "34",
            "26",
            "12",
            "-"
        ]
    ],
    "pageTitle": "Macedonia, Ohio (OH 44056, 44067) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Macedonia-Ohio.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00081-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 369649291,
    "recordOffset": 369517021,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5248=Educational Attainment (%) in 2013, 2032=1996 Presidential Elections Results, 20235=Air Quality Index (AQI) level in 2012 was 125. This is significantly worse than average., 35751=On 5/31/1985, a category F5 (max. wind speeds 261-318 mph) tornado 20.0 miles away from the Macedonia city center killed 18 people and injured 310 people and caused between $50,000,000 and $500,000,000 in damages., 1460=2004 Presidential Elections Results, 16658=Particulate Matter (PM10) [µg/m3] level in 2012 was 17.1. This is about average. Closest monitor was 13.4 miles away from the city center., 71686=Incorporated in 1971, 174437=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!, 888=2012 Presidential Elections Results, 17363=Ozone [ppb] level in 2012 was 25.4. This is better than average. Closest monitor was 4.4 miles away from the city center., 19574=Carbon Monoxide (CO) [ppm] level in 2012 was 0.129. This is significantly better than average. Closest monitor was 10.7 miles away from the city center., 18093=Sulfur Dioxide (SO2) [ppb] level in 2012 was 2.67. This is worse than average. Closest monitor was 3.1 miles away from the city center., 1746=2000 Presidential Elections Results, 1174=2008 Presidential Elections Results, 35427=On 6/8/1953, a category F4 (max. wind speeds 207-260 mph) tornado 17.0 miles away from the city center killed 17 people and injured 379 people., 4850=School Enrollment by Level of School (%) in 2013, 15908=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 9.98. This is about average. Closest monitor was 10.8 miles away from the city center., 18837=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 13.7. This is significantly worse than average. Closest monitor was 2.0 miles away from the city center., 604=Graphs represent county-level data. Detailed 2008 Election Results, 52961=According to our research of Ohio and other state lists there were 7 registered sex offenders living in Macedonia, Ohio as of July 28, 2015. The ratio of number of residents in Macedonia to the number of sex offenders is 1,621 to 1. The number of registered sex offenders compared to the number of residents in this city is a lot smaller than the state average.}",
    "TableContextTimeStampAfterTable": "{100031=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 98738=Total of 142 patent applications in 2008-2015., 18383=4.81% of this county's 2010 resident taxpayers moved to other counties in 2011 ($45,104 average adjusted gross income), 16180=4.25% of this county's 2011 resident taxpayers lived in other counties in 2010 ($41,659 average adjusted gross income), 26196=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population)}",
    "textBeforeTable": "Religion statistics for Macedonia city (based on Summit County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Bottled, tank, or LP gas (1%) Electricity (4%) Utility gas (95%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 84 Summit County: 1.54 / 10,000 pop. Ohio: 1.89 / 10,000 pop. Number of supercenters and club stores: 4 This county: 0.07 / 10,000 pop. State: 0.13 / 10,000 pop. Number of convenience stores (no gas): 42 Summit County: 0.77 / 10,000 pop. Ohio: 1.25 / 10,000 pop. Number of convenience stores (with gas): 145 Summit County: 2.67 / 10,000 pop. State: 2.93 / 10,000 pop. Number of full-service restaurants: 337 Here: 6.20 / 10,000 pop. State: 6.25 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}