{
    "relation": [
        [
            "Zeit",
            "11.07.",
            "29.06.",
            "25.06.",
            "11.06.",
            "09.06."
        ],
        [
            "Titel",
            "Bauspar-Skandal geht weiter: Vorsicht! BHW lockt Kunden mit verführerischen Schecks in die Kündigungsfalle(2)",
            "KMU - Unternehmenskredite: Kreditvermittler Lendico - \"In jeder Hinsicht eine Win-Win-Situation\"",
            "Ansturm aufs Betongold: \"Ey, du kommst hier net rein!\" - Immobilienfonds machen die Schotten dicht(3)",
            "EUR-USD: Läutet Zinsanstieg Wende am Devisenmarkt ein?",
            "Griechenland: Varoufakis - Geldgeber verbieten Syriza den Kampf gegen Steuersünder(9)"
        ]
    ],
    "pageTitle": "Finanznachrichten - Börse & Wirtschaft aktuell",
    "title": "",
    "url": "http://www.wallstreet-online.de/nachrichten",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00137-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 830604467,
    "recordOffset": 830578387,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{59741=Einen Tag vor der Zinsentscheidung der US-Notenbank Fed ist der Eurokurs am Dienstag unter Druck geblieben. Zwischenzeitlich war die Gemeinschaftswährung bis auf das bisherige Tagestief von 1,1023 US-Dollar abgerutscht. Zuletzt notierte sie bei …, 75053=Die kurze Einschätzung der Lage  Mit Erreichen des gestrigen Tiefs bei 11026 hat der DAX die erwartete Pause auf seinen Weg zum Zielfenster eingelegt.  Nach wie vor deutet der impulsiv zählbare Start der roten E auf ein Zigzag hin, das bei …}",
    "textBeforeTable": "Aktuelle Nachrichten POLITIK III KOMMENTAR POLITIK II CHARTANALYSE GOLD POLITIK I CHARTANALYSE DAX MARKT Horror-Rezession oder Tod des freien Marktes - Die Katastrophe ist nicht mehr aufzuhalten China -o-background-size: cover;display: inline-block;\"> -webkit-background-size: cover; -moz-background-size: cover; -ms-background-size: cover; background-size:cover; background: url(//assets.wallstreet-online.de/_media/3129/laender/china/china-boerse-kursschwankungen-foto-how-hwee-young-copy-dpa.jpg) no-repeat left center; China-Crash lässt Diamanten wieder funkeln Diamantenpreise -o-background-size: cover;display: inline-block;\"> -webkit-background-size: cover; -moz-background-size: cover; -ms-background-size: cover; background-size:cover; background: url(//assets.wallstreet-online.de/_media/3129/anlageklassen/rohstoffe/diamant-foto-sotheby-s-copy-dpa.jpg) no-repeat left center; Griechische Olympiade in Steuerhinterziehung - Damit ist jetzt Schluss! Oder? Patriotischer Akt -o-background-size: cover;display: inline-block;\"> -webkit-background-size: cover; -moz-background-size: cover; -ms-background-size: cover; background-size:cover; background: url(//assets.wallstreet-online.de/_media/3129/justiz/korruption-geldscheine-peter-steffen-copy-dpa.jpg) no-repeat left center; Pattsituation im Goldpreis – Risiken nicht vom Tisch GOLD -o-background-size: cover;display: inline-block;\"> -webkit-background-size:",
    "textAfterTable": "SouthGobi Resources Announces Further 30 Day Extension of Delisting Review by TSX mehr aktuelle Nachrichten » Neueste Marktberichte Zeit Titel 05:47  ROUNDUP: Zweifel an Chinas Reformwillen - Aktienmärkte wieder im Minus 05:34  Aktien China: Börsen halten nach positivem Start leichte Gewinne 28.07. ROUNDUP/Aktien New York Schluss: Gute Quartalszahlen hieven Dow wieder ins Plus 28.07. Aktien New York Schluss: Gute Quartalszahlen hieven Wall Street wieder ins Plus 28.07. US-Anleihen: Verluste im Zuge wieder steigender Aktienmärkte 28.07. Devisen: Euro bleibt unter Druck - Märkte schauen auf Zinsentscheidung der Fed mehr",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}