{
    "relation": [
        [
            "",
            "INDYVAX",
            "INDYSTAT",
            "Bloomington-based research systems (STARRS, Chrome, Zinc, Cobalt, SP)",
            "Unix Workstation Support Group (UWSG, 855-2627)",
            "Center for Statistical and Mathematical Computing (Located in Bloomington: statmath@indiana.edu, 855-4724)"
        ],
        [
            "Mean",
            "3.56 ±0.11",
            "3.50 ±0.12",
            "3.64 ±0.11",
            "3.61 ±0.10",
            "3.73 ±0.11"
        ],
        [
            "Satisfaction",
            "83.01 ±4.4%",
            "79.77 ±4.7%",
            "78.45 ±4.8%",
            "87.79 ±3.9%",
            "90.84 ±3.4%"
        ],
        [
            "Usage",
            "31.6",
            "7.4",
            "3.0",
            "3.0",
            "2.0"
        ],
        [
            "Responses",
            "301 [G&F]",
            "298 [G&F]",
            "299 [G&F]",
            "299 [G&F]",
            "297 [G&F]"
        ]
    ],
    "pageTitle": "1998 UITS IUPUI User Survey Summary",
    "title": "",
    "url": "http://www.indiana.edu/~uitssur/1998/iupui/iupui_summary98.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00248-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 528266695,
    "recordOffset": 528250559,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{55339=30. During 1997-98, UITS implemented a plan for dedicated servers for e-mail (Jewel), Web pages (including a personal home page server, php.iupui.edu), and general computing (Auburn). How satisfied are you with the information and support provided to help users change to these new servers?, 56230=31. During 1997-98, UITS made several changes to enhance computer security on campus including the creation of the University Computer Security Office, testing user passwords and where necessary requiring users to create a more secure password, scanning university and department servers and workstations for known security vulnerabilities, and regularly notifying users of the latest changes in security enhancement. Overall, how satisfied are you with the security measures implemented by UITS?, 57316=32. The Year 2000 presents a series of potential problems for computer users on campus. Please indicate your satisfaction with UITS efforts to provide information and support concerning the Year 2000 problem., 314=The UITS User Survey is administered by the IUPUI Office of Information Management and Institutional Research. Surveys were sent to 2000 randomly selected people at Indiana University-Purdue University, Indianapolis (400 faculty, 400 staff, 400 graduate students, and 800 undergraduate students). The questions on the survey are primarily Likert opinion scales (1-5 rating scales with 5 always being the most favorable rating). For questions asking opinions of services, the results shown include in order: the average opinion score (labeled \"Average\"), the percentage of people who were satisfied with the service (graded it as a 3 or better, labeled \"Satisfaction\"), the percentage of people who use the service (which we have taken to be the percentage of people who expressed an opinion about it, labeled \"Usage\"), and the total number of respondents to each question (raw number of respondents who did not leave a given item blank, labeled \"Responses\")., 58134=33. Do you feel that your department is ready for dealing with Year 2000 problems?}",
    "lastModified": "Tue, 28 Aug 2007 21:02:55 GMT",
    "textBeforeTable": "1. The Telecommunications Division of UITS provides a wide range of telephone services to faculty, student, and staff customers. If you use such facilities and services, please indicate your overall satisfaction by circling the appropriate response. TELECOMMUNICATION SERVICES Unless indicated otherwise, the results shown are weighted to estimate the average response of the entire IUPUI community. Some services, however, are used only by certain subpopulations, so results are shown for the appropriate subpopulations. Subpopulations are indicated by F for faculty, S for Staff, G for graduate students, and U for undergraduate students. In some cases, the scores are for groups of subpopulations, indicated for example by [G&U] for services used by graduate and undergraduate students. Results are shown separately for multiple subpopulations where appropriate. For the average opinion and the satisfaction percentage scores, confidence intervals are also provided. The confidence intervals indicate the sampling error for each estimate at the 95% confidence level (i.e. each mean and satisfaction score falls within the range indicated by the estimated value, plus or minus the interval score). The UITS User Survey is administered by the IUPUI Office of Information Management and Institutional Research. Surveys were sent to 2000 randomly selected people at Indiana University-Purdue University, Indianapolis (400 faculty, 400 staff, 400 graduate students, and 800 undergraduate students). The questions on the survey are primarily Likert opinion scales (1-5 rating scales with 5 always being the",
    "textAfterTable": "Campus office telephone equipment (single line sets, business sets, etc.) 3.99 ±0.09 96.00 ±2.1% 74.6 394 [F&S] Campus office long distance service 4.25 ±0.09 96.04 ±2.1% 89.2 390 [F&S] Campus office voice mail services (274-6245) 4.19 ±0.09 95.17 ±2.2% 89.3 394 [F&S] Optional telephone features and packages 3.92 ±0.09 93.75 ±2.5% 52.4 391 [F&S] Cellular telephone services 3.93 ±0.09 95.40 ±2.2% 11.0 390 [F&S] Pager services 4.04 ±0.08 97.22 ±1.8% 36.7 390 [F&S] Campus office monthly invoice format 3.82 ±0.09 93.33 ±2.6% 26.9 394 [F&S] Customer services and consulting 4.01 ±0.08 96.74 ±1.9% 38.8 394 [F&S] Teleconference service provided by Campus Switchboard 4.01 ±0.07 98.24 ±1.4% 28.3 392 [F&S] Telecommunications Device for the Deaf (TDD) 3.92 ±0.08 91.27 ±2.0% 4.6 783 [F&S] 2. On a weekly basis, how often do you call the Campus Switchboard (274-5555 or 0)?",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}