{
    "relation": [
        [
            "Part #",
            "FT6201C",
            "FT6202C",
            "FT6203C",
            "FT6204C"
        ],
        [
            "Description",
            "3 Way T-Splicer – Beadlock – Universal",
            "3 Way T-Splicer – Beadlock – Universal",
            "3 Way T-Splicer – Beadlock – Universal",
            "3 Way T-Splicer – Beadlock – Universal"
        ],
        [
            "Fittings",
            "6 Hose – 6 Hose – 6 Hose Drop",
            "8 Hose – 8 Hose – 8 Hose Drop",
            "10 Hose – 10 Hose – 10 Hose Drop",
            "12 Hose – 12 Hose – 12 Hose Drop"
        ]
    ],
    "pageTitle": "Automotive Air Conditioning A/C Hose Fittings || TechChoice Parts",
    "title": "",
    "url": "http://www.techchoiceparts.com/ac-fittings",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00225-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 741944943,
    "recordOffset": 741933788,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{51282=Designed and powered by SageKey Software Inc. Copyright © 2012 SageKey Software Inc. All rights reserved. Automotive accounting software powered by Auto Plus XP.}",
    "textBeforeTable": "Bulk A/C hose TechChoice Parts can supply a wide wange of air conditioning hose fittings. Use the chart below to find your fittings. AC Fittings Tune Up show Transmission show Tools show Tire and Wheel show Steering and Suspension show Lights show Ignition show Hoses and Fittings show Fuel and Emissions show Four Wheel Drive show Exhaust show Engine Timing show Engine Cooling show Engine show Electrical show Drive and Axle show Chemicals and Fluids show Charging and Starting",
    "textAfterTable": "Straight fittings Straight female flare fittings Part # Description Fittings FT0045C Straight Female Flare – Beadlock – Without Service Port 6 Fitting – 6 Hose FT0046C Straight Female Flare – Beadlock – Without Service Port 8 Fitting – 8 Hose FT1106C Straight Female Flare – Beadlock – Without Service Port 8 Fitting – 10 Hose FT0047C Straight Female Flare – Beadlock – Without Service Port 10 Fitting – 10 Hose Straight female O-ring fittings – with R134a service port Part # Description Fittings FT3013C Straight Female O-Ring – Beadlock – With Service Port 6 Fitting – 6 Hose – 16mm FT1301-3SBC Straight Female O-Ring – Steel Beadlock – With Service Port 6 Fitting – 6 Hose – 16mm FT3023C Straight Female O-Ring – Beadlock – With Service Port 8 Fitting – 8 Hose – 16mm FT1302-3SBC Straight Female O-Ring – Steel Beadlock – With Service Port 8 Fitting – 8 Hose – 16mm FT3033C Straight Female O-Ring – Beadlock – With Service Port 10 Fitting – 10 Hose – 13mm",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}