{
    "relation": [
        [
            "Patent application number",
            "20120227811",
            "20130042902"
        ],
        [
            "Description",
            "ELECTROCHEMICAL METHOD OF PRODUCING COPPER INDIUM GALLIUM DISELENIDE (CIGS) SOLAR CELLS - The present invention describes a method of producing a photovoltaic solar cell with stoichiometric p-type copper indium gallium diselenide (CuIn",
            "HYBRID SOLAR ENERGY CONVERSION SYSTEM WITH PHOTOCATALYTIC DISINFECTANT LAYER - The present invention provides a hybrid solar energy conversion system in which a working fluid is made to flow between an internal photovoltaic array and a transparent top layer, where the working fluid is disinfected by a photocatalytic disinfectant layer provided on a light transmitting surface contacting the working fluid. The working fluid is further contacted with the photovoltaic array for the absorption of heat, and the absorbed heat is extracted via an external heat extraction device such as a water tank or a heat exchanger. Accordingly, the present invention provides an improved solar energy conversion system providing both electrical and thermal power, and further utilizing a portion of the solar spectrum for the photocatalytic disinfection of the working fluid."
        ],
        [
            "Published",
            "09-13-2012",
            "02-21-2013"
        ]
    ],
    "pageTitle": "Ding, CA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/ding-ca-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00307-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 457783263,
    "recordOffset": 457767892,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Zhifeng Ding, London CA 04-04-2013 Query Transformation for Masking Data Within Database Objects - According to one embodiment of the present invention, a system processes a database query, and comprises a computer system including at least one processor. The system identifies one or more expressions within the database query utilizing a database object with value masking. Masking requirements are determined for each identified expression and the database object utilized by that identified expression is replicated to provide masked and actual versions of that database object in response to the masking requirements for that expression including masked values and actual values of that database object. The value masking of the database object is applied to the identified expressions within the database query based on the determined masking requirements to produce search results with masked values for the database query. Embodiments of the present invention further include a method and computer program product for processing a database query in substantially the same manner described above. 20130086088 Published Description Patent application number Yuping Ding, Markham CA 02-14-2013 SUBSTITUTED ARYL SULFONE DERIVATIVES AS CALCIUM CHANNEL BLOCKERS - A series of substituted aryl sulfone derivatives represented by Formula I, or pharmaceutically acceptable salts thereof. Pharmaceutical compositions comprise an effective amount of the instant compounds, either alone, or in combination with one or more other therapeutically active compounds, and a pharmaceutically acceptable carrier. Methods of treating conditions associated with, or caused",
    "textAfterTable": "Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}