{
    "relation": [
        [
            "Name",
            "drawable",
            "state_focused",
            "state_window_focused",
            "state_enabled",
            "state_checkable",
            "state_checked",
            "state_selected",
            "state_active",
            "state_single",
            "state_first",
            "state_middle",
            "state_last",
            "state_pressed"
        ],
        [
            "Type",
            "reference",
            "boolean",
            "boolean",
            "boolean",
            "boolean",
            "boolean",
            "boolean",
            "boolean",
            "boolean",
            "boolean",
            "boolean",
            "boolean",
            "boolean"
        ],
        [
            "Default",
            "null",
            "false",
            "false",
            "false",
            "false",
            "false",
            "false",
            "false",
            "false",
            "false",
            "false",
            "false",
            "false"
        ],
        [
            "Description",
            "The drawable to use for this item. Either this must be present or a drawable subelement must exist.",
            "This state indicates the view is focused.",
            "This state indicates the view's window has focus.",
            "This state indicates the view is enabled.",
            "This state indicates the view can be checked",
            "This state indicates the view is checked.",
            "This state indicates the view is selected.",
            "Used by SlidingTab. This state indicates that the view is active.",
            "Used by views that contain lists of items. This state indicates that the view is showing only one item.",
            "Used by views that contain lists of items. This state indicates that the view is showing the first item.",
            "Used by views that contain lists of items. This state indicates that the view is showing the middle item.",
            "Used by views that contain lists of items. This state indicates that the view is showing the last item.",
            "Used by views that contain lists of items. This state indicates that the view is pressed."
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://idunnolol.com/android/drawables.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00201-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 117830471,
    "recordOffset": 117822269,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Mon, 03 May 2010 14:08:44 GMT",
    "textBeforeTable": "The missing manual! Each of the top-level elements are useable in Android XML files, in /res/drawable/. Some of them are allowed to be contained in others and this is noted below. Android Drawable XML Documentation",
    "textAfterTable": "Type Default Description visible boolean parent|true Determines if drawable is visible. frameDuration integer 150 The duration of each frame, in milliseconds. framesCount integer 12 Number of frames of rotation to animate. pivotX float|fraction .5 The pivot point, as a fraction of the width. pivotY float|fraction .5 The pivot point, as a fraction of the height. drawable reference null The drawable to use for this item. Either this must be present or a drawable subelement must exist. Children Element Description <[any drawable tag]> Any drawable xml. Either this must be present or the 'drawable' attribute must be set. <[any drawable tag]> Any drawable xml. Either this must be present or the 'drawable' attribute must be set. <animation-list> An object used to create frame-by-frame animations, defined by a series of Drawable objects, which can be used as a View object's background. Attributes Name Type Default Description visible boolean parent|true Determines if drawable is visible. variablePadding boolean false If true, allows the drawable's padding to change based on the current state that is selected. oneshot boolean false If true, the animation will only run a single time and then stop. Children Element Description <item> A drawable for a frame",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}