{
    "relation": [
        [
            "First Name",
            "Raymond",
            "Belinda",
            "Ivan"
        ],
        [
            "Last Name",
            "Bracy",
            "Garza",
            "Zapien"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            "DirDemCauc02-04;COSSenMenendez05-08"
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=4BB8D711-432B-4A00-9AA3-1F5E3B687776&filingTypeID=55",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00274-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 218944562,
    "recordOffset": 218936360,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38127=Interchange fees: legislation to amend the antitrust laws to ensure competitive market-based rates and terms for merchants' access to electronic payment systems (H.R. 5546 & S. 3086 in 110th Congress) S. 470 to combat organized crime involving retail theft for the purpose of re-selling stolen merchandise H.R. 1173 Organized Retail Crime Act to combat, deter, and punish individuals and enterprises engaged in organized crime involving theft and fencing of retail merchandise H.R. 1166 The E-Fencing Enforcement Act of 2009 - to provide for more effective enforcement of the Federal prohibition on the interstate shipment of stolen property, 55419=H.R. 1548 & S. 1427, Legislation amending title XIX of the Society Security Act to ensure that individuals eligible for medical assistance under the Medicaid Program continue to have access to prescription drugs, and for other purposes Average Manufacturers Price, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 12263=S. 730, Affordable Footwear Act of 2009 H.R. 496, Trade Enforcement Act of 2009 China: Discussions related to expiration of textile quotas Digital television: Discussions related to conversion H.R. 1, American Recovery and Reinvestment Act, Pub. L. No. 111-5, provisions related to Trade Adjustment Assistance, 49626=Issues related to cap and trade, energy efficiency, smart grid, advanced meters, demand response, decoupling, EPACT05 proceedings, transmission grid, competitive markets/renewables, consumer rights to environmental attributes, green jobs, and renewable projects H.R. 1, American Recovery and Reinvestment Act, Pub. L. No. 111-5 clean technology issues Potential amendment to Pub. L. No. 111-5 for aggregation of sites for renewable projects S. 2191, Americas Climate Security Act of 2007 & S. 3036, Lieberman-Warner Climate Security Act of 2008 (Boxer substitute) Dingell-Boucher discussion draft bill on climate change, 33518=H.R. 1, American Recovery and Reinvestment Act, Pub. L. No. 111-5, provisions related to health information technology policy and COBRA expansion ERISA preemption of State laws on health benefits requirements Educational outreach and information sharing on Companys health care benefits, open enrollment online tools, $4 generic prescriptions, health clinics and health information technology S. 391 & H.R. 1321, Healthy Americans Act, a bill to provide affordable, guaranteed health coverage General Medicare secondary payer issues Health care whitepaper (Senator Baucus) Public-private partnership with ONDCP to raise awareness to combat drug abuse, 43756=H.R. 1409 & S. 560, Employee Free Choice Act (H.R. 800 & S. 1041 in 110th Congress) Re-Empowerment of Skilled and Professional Employees and Construction Tradeworkers (RESPECT) Act (H.R. 1644 & S. 969 in 110th Congress) H.R. 11 & S. 181, Lilly Ledbetter Fair Play Act, Pub. Law No. 111-2 A bill to amend Title II of the Civil Rights Act of 1964 to clarify the filing period applicable to charges of discrimination, and for other purposes (S. 3209 in 110th Congress) Introduction of Wal-Marts international labor practices and ethical sourcing program, including Wal-Marts China Sustainability Initiative Paycheck Fairness Act, to amend the Fair Labor Standards Act of 1938 (H.R. 1338 in 100th Congress) Healthy Families Act, a bill to provide paid sick leave (H.R. 1542 & S. 910 in 110th Congress), 20322=H.R. 1398 the Labeling Education and Nutrition (LEAN) Act of 2009 S. 510 FDA Food Safety Modernization Act H.R. 759 FDA Globalization Act of 20 Women, Infants & Children (WIC) Program reauthorization & H.R. 1105 (FY09 omnibus appropriations bill) eWIC issues, 58909=S. 2191, Americas Climate Security Act of 2007 & S. 3036, Lieberman-Warner Climate Security Act of 2008 (Boxer substitute) Dingell-Boucher discussion draft bill on climate change Issues related to Companys China Sustainability Initiative Issues related to cap and trade, energy efficiency, smart grid, advanced meters, demand response, decoupling, EPACT05 proceedings, transmission grid, competitive markets/renewables, consumer rights to environmental attributes, green jobs, and renewable projects H.R. 1, American Recovery and Reinvestment Act, Pub. L. No. 111-5 clean technology issues}",
    "textBeforeTable": "",
    "textAfterTable": "State AR Zip Code 72716 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  RAYMOND BRACY  2024340999  raymond.bracy@wal-mart.com 5. Senate ID#  40305-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}