{
    "relation": [
        [
            "File Name",
            "How Do I Work with Businesses tha Display My Poster or Brochure?",
            "Suggestions for Distribution of Materials"
        ],
        [
            "File Type",
            "Word",
            "Word"
        ],
        [
            "Date Posted",
            "8/1/11",
            "8/1/11"
        ]
    ],
    "pageTitle": "ABE File Cabinet",
    "title": "",
    "url": "http://wvde.state.wv.us/abe/file-cabinet/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00081-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 265821159,
    "recordOffset": 265805196,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Pre-service Forms for New Personnel   07/09/15 Excel Session Evaluation This evaluation form may be used at WVAdultEd training sessions to evaluate the quality of the presentation. 07/09/15 Word PD Sign-in Sheet This sign-in sheet may be used at WVAdultEd training sessions to assure that participants receive professional development credit. Date Posted File Type File Name In-Service Forms   WKEYS PLAN WRITE 1 NXT GEN UDL NRS4U TECH-SHOW LESSON SLN MATH SEAL INTAKE READ 3 DOK READ 2 CSI READ 1 AEMIS4U CORE Session Core Session Handouts Professional Development Resources",
    "textAfterTable": "Peer Training Checklist Word 07/16/2015 WVAdultEd Pre-Service Data Form Word 07/28/2015 Follow-up Study (not for Subs) Word 07/16/2015 WVAdultEd Personnel Confidentiality Agreement Word 07/16/2015 Pre-service Observation Job Shadowing Form This is the form that new instructors need to take with them when observing a class as part of pre-service training. There is a different form for current instructors who need elective credit. Word 07/28/2015 CDC Pre-Service Observation Job Shadowing Form New CDCs should take this form with them when observing a class as part of their pre-service training. Word 07/16/2015   Professional Development Planning Resources File Name File Type Date Posted Online Professional Development Calendar Online 8/9/11 Certification Renewal Chart This chart is a graphic that shows the certification renewal process for the Adult License, the WV Teaching Certificate, and the Substitute Permit. PDF 7/18/12",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}