{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The beach is near by that most students go to.",
            "Academic rigor varies with each class, however, each professor wants their student to succeed and will do whatever possible to make sure that happens.",
            "Prospective students should first decide if Florida State College at Jacksonville has the appropriate degree they are seeking. If so, this school would be the best decision.",
            "I rate Florida State College at Jacksonville very highly. There are wonderful professors who take the time to help and work with their students. All other staff, including financial aide and business office go the extra mile to help each student."
        ]
    ],
    "pageTitle": "Florida State College at Jacksonville Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Florida-State-College-at-Jacksonville/reviews?_escaped_fragment_=/show/20052",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00121-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906220663,
    "recordOffset": 906105832,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{524675=Academics are about an average level of difficulty here, depending on what classes you have. I know that the French classes focus more on the grammar of the language than they do vocabulary, so it goes to show how you get a different sort of emphasis in some of the more traditional academics such as foreign language., 772417=© 2015, Cappex.com, LLC, 298835=FSCJ is amazingly cheap, 4 classes this semester ended up being $1234.56, which was cheap and amusingly consecutive. Your education will be good, but that money is pretty much only going to pay for the faculty. Do not expect a shining campus or well-trained staff members. If you are looking to have the full college experience, look somewhere else. If you just want a degree and to enjoy your teachers, you have come to the right place., 677777=I love being a student here at Fscj. This is my second semester. I can't wait to accomplish my goals and graduate in 2017 as a registered nurse., 143690=I don't have any I start class May 14, 2012., 464842=Academic rigor is a little bit of an overstatement. You can learn here, and learn a lot, even if you are a very smart cookie. Getting an A often takes work, but as long as you turn everything in, you'll probably pass a lot of the classes, especially in English. Seems like people pass ENC1101 without knowing anything about MLA.}",
    "textBeforeTable": "08/22/2009 Reviewer is A current student here. 13 out of 14 people found this review useful. 1 of 205 Kristina from Jacksonville, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Am learning a lot A lot of people put down community colleges, but I have been able to learn a lot due to the small class sizes. Login to rate or flag the reviews Maureen from Jacksonville, FL 03/26/2011 Reviewer is A current student here. 9 out of 10 people found this review useful. 2 of 205 Categories Comments Great for these types of students First-time college students. Students looking for small class sizes and a high school feel. Students looking for a smaller, easier to navigate college. Students looking for friendly, accepting peers and understanding faculty. Students who want to test out the waters and find their major. Tips for prospective students This is a great school for first-time college students. If you happen to mess up, the faculty are more than willing to help out and try their best to give you advice. Most of the classes are very similar to high-school classes and due to the smaller class sizes, you get a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}