{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Clubs, work study, hang out with friends. (the usual).",
            "Metz dining hall doesn't offer the most delicious or healthiest of options. You just have to adjust and see what you like and go from there. The possibilities are endless!",
            "The dorms can be a little boring on the weekends so make lots of friends to keep busy.",
            "These classes are challenging but not too difficult. Just enough to make you work for your GPA.",
            "Get involved! Volunteer, do intermural sports, go on retreats, join a sport, join clubs!",
            "This school is so friendly and welcoming and really provides a great learning environment. The classes challenge your thinking and shape you into future adults. This school is the best- that's why I chose it!"
        ]
    ],
    "pageTitle": "Misericordia University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Misericordia-University/reviews?_escaped_fragment_=/show/106852",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00130-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 884179443,
    "recordOffset": 884139616,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{10446=Football team is new, coming fall 2012....our campus is about to change...forever. Get involved in the club for your major, as well as campus ministry., 53628=Dorms are semi decent if you like to party; however, starting in the 2010/13 school year, there is a new program being created for all substance free students., 128466=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/14/2010 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 28 Alexandra from Prospect, CT Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Victoria from Prospect, CT 01/14/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 28 Categories Comments Great for these types of students Go here if you want: -great faculty-student relationships; name not a number -good faculty-student ratio -small-town environment -a great Health Science or Education major Go here if you are: -friendly, optimistic, respectful, kind -studious/hard-working -LOVE community service (there's a lot to do; its a school passion) Tips for prospective students -Freshmen residents are not allowed cars on campus, beware; but there is a shuttle so USE IT! -Work hard in high school! If you can exempt from classes using AP credit it will make your life SO much easier. Also, the more community service and extracurricular activities the do, the more Merit Aid you're likely to receive. -Get involved!! Cheesy, but do it. Its how you meet people and fight off boredom. Coming from 3 hours away knowing no one...trust me. Bang for the buck Yes! MU provides a great education, and offers",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}