{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "there are campus police that patrol unh and make their presence felt, as well as emergency aid posts all around campus if you need to sound an alarm. there is a fire department right on campus and they do fire safety checks. and the campus is pretty safe, even after dark - just use common sense and walk with a friend if possible, just to be safe.",
            "those i know who are members of sororities or fraternities seem to really enjoy the sense of community and the socials that greek life offers them. but those same people are still part of the university at large, and still make many friends outside their greek house.",
            "there is an organization for any interest - salsa dancing, the environment, religion, fitness, healthy eating, engineering, and so much more! check the unh website for a list of clubs and activities.",
            "anyone can find a place at unh - the introvert, the social butterfly, the nerd, the scientist, the musician, etc. - and everyone can find friends with similar interests. and i have found people to be very accepting.",
            "there is a food van that comes late at night that is said to have to best cheesy fries. everyone raves about the dairy bar ice cream shop in the summer. we have college woods - a huge expanse of trails on one edge of campus. and we have an ice rink that has free skate hours.",
            "pretty reasonable for what college costs these days, especially if you are in state. and it is a quality education, with so many things made available to you. there is a math help center, writing help center, and so many more. there are multiple libraries (the main one and branch ones for the sciences). there are free social events. and you meet so many great people!",
            "take the free unh wildcat transit bus to portsmouth (only about 20 minutes away), a really interesting coastal town with great restaurants and stores for shopping, as well as paths to walk on. or take the bus to the mall (about 20 minutes). first thursday of the month there are contra dances in dover town hall (10 minutes away). durham has a cute little downtown where you can go get pizza or coffee. the mub (memorial union building) on campus shows not-yet-released movies on the weekends, and hosts many events, from amazing a-capella shows, to discussions, workshops, and (near finals) stress-relief events. unh has faculty and student concerts quite frequently (and actual concerts every once in a while), as well as its own art museum. and you can always hang out with friends in the dorm - watch movies, eat snacks, bake (if your dorm or one nearby has a kitchen).",
            "unh has 3 dining halls, and a wide range of options for food, from soup and sandwiches to hot entrees, pizza, salad, fruit, desserts, and breakfast foods. they even have vegetarian and gluten-free options, and hard serve ice cream on the weekends! yes, it still doesn't compare to home cooking, but it's one of the best dining halls i've heard of, and there's something for even the pickiest eater.",
            "i live in engelhardt, the drug-free dorm, and love it! the people are all so friendly and inclusive, the dorm is quiet enough to study in, and it's very centrally located. i have heard some scary stories about the freshman dorms, stoke, williamson, and christenson - they seem to be loud and i think all the residents get stuck with bills for damages from rowdy people.",
            "i have found my classes to be very manageable. yes, in college you spend less time in class and more time on homework, but it isn't that difficult - there is always someone to help you if you need it, and it's really just a matter of putting in the time. studying for tests, learning the concepts, and going to ask for help when you don't understand are all key.",
            "for any college, you must be self-motivated - set your own schedule, keep track of important deadlines and dates, and go out and meet people. but at unh, it is especially important to do so because it is a fair-sized public university - you have an academic advisor, but they are not going to hold your hand through every little problem or tell you what to do. when you need help, ask for it - your advisor is happy to help when you ask, there is a career center, and another center that helps with study habits, time management, etc. (both right on campus!), not to mention your ras, fellow students, and your teachers. in addition, i would say try to balance work and play - meet people, but get your homework done. go out and get involved! volunteer, find out about opportunities for research and study abroad, join a club, join an intramural sports team. and try to eat and sleep well - it makes everything so much easier.",
            "unh is a beautiful school, with a wide range of people, many of whom (both students and staff) are friendly and helpful. i have found the teachers to be open and engaging. there are so many opportunities there, but it is up to you to find them and go for them!"
        ]
    ],
    "pageTitle": "University of New Hampshire (UNH) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-New-Hampshire-Main-Campus/reviews?_escaped_fragment_=/show/123621",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00282-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902653799,
    "recordOffset": 902545349,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{552874=© 2015, Cappex.com, LLC, 428215=The academics of UNH can range, as they do with most institutions. UNH does offer much of everything though and also offers many times to try and get into that class you want. UNH also offers J-term (January Term) or classes during the rest of the university's winter vacation time. Class can range and I'm positive that everyone has found one class that has inspired them, intrigued them, or challenged them; but nonetheless I'm sure they loved it., 148322=College is expensive, that's hard to get around, but I really feel that my money is going to good use. Just since I started in the fall of 2011 I feel that I am a totally transformed person. I have learned so much and feel really lucky to be a student at a university that offers so much., 2055=One the first night that freshmen come to school, there’s an event called “WildActs.” It’s an improv show that focuses on many aspects of college life. There’s a lot of school spirit during Basketball and football games. Also, there’s Jukebox, which brings students to learn about extracurricular activities, raffles, and IHOP gives out free pancakes, and you get a lot of free stuff. Also, there’s an annual parade where everyone, including the school’s fraternities and sororities make floats for prizes. There are endless possibilities-all you have to do is get involved. Every time you go to the MUB, they have events open to the public that are informative. Also they are big concerts near the end of the semester. I was told last year that there was a Snoop Dogg concert, and that this year Lupe Fiasco concert is going to be sold out. Sometimes, they also invite people to give lectures-I met Angela Davis during the Martin Luther King Celebration in January., 12192=I am really enjoying attending UNH. There are so many clubs and organizations to get involved in, ranging from the College Democrats, to the Organic Gardening Club, to Greek Life, to Fencing. There is truly a niche for everyone, and there is always something going on. Aside from academics, concerts and guests are brought to UNH to perform. In December, the comedian Bo Burnham came to the Whittemore Center. The dorms are above average and although campus incidents occur, as is inevitable with a school the size of UNH, I feel safe on campus. There is a free bus for students which travels to surrounding towns such as Portsmouth, Dover and Newmarket, and the nearby train station travels throughout the northeast (Boston, Portland, etc.) Even though UNH is situated in Durham, New Hampshire, I have never felt isolated whatsoever. I enjoy the classes, I enjoy the community, and I enjoy the social aspect of UNH., 250911=DHOP is the place to be on a weekend night around 12:30 am., 227553=The campus' three dining halls are well-placed, and the availability of food is exceptionally good. During the week, at least one dining hall is always open from 7:30 am straight through to 11:00 pm. Food quality is excellent, and eating healthy is definitely an option, aided by nutrition guides. The staff is accommodating to diners with special dietary needs as long as the student is willing to consistently stay in contact with dining hall administrators., 122084=unh has three dining halls that always have freshly cooked food everyday and always have variety. the dining halls often participate in holidays and theme nights (such as valentine's day, mardi gras, march madness, etc), which give the students a refreshing dining experience. one thing that sets unh dining apart from other colleges is that unh dining has a messaging system called “napkin notes.” with napkin notes, students can write questions, suggestions, and comments on napkins and deposit them into a box to await a response. the napkin notes are then responded to by the dining hall manager an pinned up on a bulletin board outside of the dining hall for everyone to see. i think that it is a very clever way for students to express their opinions and comments directly to the person who is in charge of their food. the manager often takes students' suggestions and does whatever it takes to give unh students pleasant, satisfactory dining experiences., 87694=The tips i have from when i visited were that it is better to have a high GPA and a 1900 on the SATs to get the best scholarships. The lowest score for a scholarship is 1780.}",
    "textBeforeTable": "07/09/2009 Reviewer is A current student here. 12 out of 12 people found this review useful. 1 of 119 Funmi from Harvard, MA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Am learning a lot The classes are amazing and there is so much to choose from and UNH really tries to cater the classes so that individuals are actually interested in the classes they are attending and want to be there. For example, I'm a HUGE horse person but not a big history buff and I discovered that UNH offered a class that studied the use of the horse in history that I could take for the history requirement. You can even find work study jobs that cater to your major as well (as a pre-vet major I work in the NH State Diagnostic Lab on campus with veterinarians and get to observe interactive necropsies (animal autopsies) where the vets ask for your ideas and opinions and it's ok to say I don't know because they'll fill you in. Login to rate or flag the reviews Cara from NH 12/29/2009 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 119 Categories Comments Great for these types of students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}