{
    "relation": [
        [
            "TOPIC 1",
            "imag",
            "file",
            "pictur",
            "like",
            "line",
            "high",
            "resolut",
            "photoshop",
            "layer",
            "hand"
        ],
        [
            "TOPIC 2",
            "need",
            "imag",
            "attach",
            "size",
            "file",
            "word",
            "2",
            "make",
            "logo",
            "1"
        ],
        [
            "TOPIC 3",
            "element",
            "exist",
            "etc",
            "logo",
            "icon",
            "halloween",
            "app",
            "add",
            "like",
            "theme"
        ],
        [
            "TOPIC 4",
            "tree",
            "snow",
            "santa",
            "thanksgiv",
            "leav",
            "gold",
            "outlin",
            "make",
            "fall",
            "turkey"
        ],
        [
            "TOPIC 5",
            "yellow",
            "use",
            "view",
            "new",
            "servic",
            "replac",
            "team",
            "super",
            "feel",
            "color"
        ],
        [
            "TOPIC 6",
            "creativ",
            "take",
            "add",
            "fun",
            "logo",
            "pumpkin",
            "spooki",
            "bat",
            "skeleton",
            "offer"
        ],
        [
            "TOPIC 7",
            "celebr",
            "logo",
            "decor",
            "make",
            "etc",
            "word",
            "possibl",
            "add",
            "text",
            "bit"
        ],
        [
            "TOPIC 8",
            "file",
            "background",
            "logo",
            "holiday",
            "need",
            "vector",
            "transpar",
            "white",
            "png",
            "ai"
        ],
        [
            "TOPIC 9",
            "like",
            "look",
            "snowflak",
            "logo",
            "would",
            "color",
            "want",
            "make",
            "someth",
            "font"
        ],
        [
            "TOPIC 10",
            "chang",
            "color",
            "blue",
            "code",
            "red",
            "font",
            "dark",
            "green",
            "match",
            "panton"
        ],
        [
            "TOPIC 11",
            "festiv",
            "pdf",
            "send",
            "file",
            "need",
            "back",
            "page",
            "digit",
            "psd",
            "version"
        ],
        [
            "TOPIC 12",
            "logo",
            "card",
            "christma",
            "use",
            "font",
            "attach",
            "like",
            "creat",
            "file",
            "busi"
        ],
        [
            "TOPIC 13",
            "need",
            "attach",
            "page",
            "imag",
            "text",
            "websit",
            "px",
            "pictur",
            "use",
            "photo"
        ],
        [
            "TOPIC 14",
            "name",
            "follow",
            "busi",
            "logo",
            "chang",
            "incorpor",
            "compani",
            "card",
            "line",
            "replac"
        ],
        [
            "TOPIC 15",
            "x",
            "cover",
            "photo",
            "like",
            "would",
            "look",
            "suppli",
            "73",
            "websit",
            "templat"
        ]
    ],
    "pageTitle": "99designs Tech Blog",
    "title": "",
    "url": "http://99designs.com/tech-blog/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00318-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 1408623,
    "recordOffset": 1358623,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{13016=Apr 22nd, 2014, 7684=Ultimately, having an accurate training set is perhaps the most important part of developing a good classifier. I rolled up my sleeves, and manually inspected and classified approximately 1200 Swiftly design briefs myself. This was slow and monotonous, but it meant that I knew I had an excellent quality training set., 21913=Aug 11th, 2014, 21491=99designs pushes four million background jobs through beanstalkd each day. beanstalkd is a fantastic job queue which we’ve used for more than five years, via the pheanstalk client which I wrote in 2008.}",
    "TableContextTimeStampAfterTable": "{93411=As such, we set ourselves a technical goal in 2013 to migrate to a more service-oriented architecture. This means breaking big masses of functionality into discrete services and libraries that do one thing well. Such a design tends to yield smaller, more cohesive services, and provides natural lines along which our team can subdivide., 114867=Jun 4th, 2013, 23362=Jan 30th, 2014, 142604=Copyright © 2014 - 99designs - Privacy Policy - Terms of Use - Powered by Octopress, 110520=Our Javascript similarly needed to be prepared for translation, with rich client-side pages the worst hit. All strings needed to be hoisted to a part of the JS file which could be marked up for translation. String concatenation was no longer ok, since it made flawed assumptions about the grammar of other languages. Strings served through a JSON API were likewise hidden from translation, meaning we had to find other ways to serve the same data., 65749=need make titl look better take text top adjust remain element offic los angel mayor eric garcetti partnership ucla labor center rosenberg foundat california communiti foundat california endow asian americans/pacif island philanthropi cordial invit close recept also add hashtag bottom descriptor dreamsummer13 take rsvp august 19 2013, 46970=Jan 22nd, 2014, 92387=Jul 1st, 2013, 113052=Over time, we repeatedly found our translation queue clogged with huge numbers of strings awaiting translation. Many of these cases were bugs where we hadn’t appropriately marked up user-generated content, but the most stubborn were due to our long-tail marketing efforts. Having a page for each combination of industry, product category and city led to an explosion of strings to translate. Tackling these properly would require a natural language generation engine with some understanding of each language’s grammar. For now we’ve simply excluded these pages from our translation efforts., 116374=When your app starts up (in development), it should make a request to http://localhost:11111/assets/manifest.json, which provides a JSON hash linking asset names (e.g. “application.css”) to the relative URLs the compiled assets can be fetched from. To generate a link to an asset in your app, use the JSON hash you fetched to lookup the URL. For example, the URL for “application.css” this might look like http://localhost:11111/application-8e5bf6909b33895a72899ee43f5a9d53.css., 19651=Mar 31st, 2014, 121872=Oct 30th, 2012, 23650=At 99designs we heavily (ab)use Varnish to make our app super fast, but also to do common, simple tasks without having to invoke our heavy-by-contrast PHP stack. As a result, our Varnish config is pretty involved, containing more than 1000 lines of VCL, and a non-trivial amount of embedded C., 105179=Jun 17th, 2013, 118454=Jan 5th, 2013}",
    "lastModified": "Tue, 12 Aug 2014 08:22:13 GMT",
    "textBeforeTable": "Our pipeline first tokenises the sentence into words. Follow each word from left to right in the table below to see how it gets transformed by the pipeline. Please change the email on this business card from coolguy99@gmail.com to koolguy99@gmail.com. Thanks! Let’s do a worked example using the sentence below: The pipeline in action 20 name logo 20 busi name 21 pumpkin skeleton 21 spooki element 21 bat pumpkin 22 festiv element 22 creativ festiv 24 $URL $URL 28 transpar background 33 busi card 44 exist logo 44 add fun 47 fun creativ 47 take exist 49 logo add 72 would like frequency bigram Previously I had worked with each word in the text individually (“unigrams”), but this often means words have no context. So, for example, “business card” was broken into “business” and “card”, and the importance of those words appearing together was lost. Bigrams are simply pairs of words that appear next to each other. So, if we include both unigrams and bigrams, the text “business card” would provide us the features “business”, “card” and “business card”. This captures more of the context of",
    "textAfterTable": "0.00241 logo 0.00096 0.0054 0.0266 0.00513 0.00075 0.00512 0.00408 need 0.00832 0.00672 0.00717 0.00478 0.00139 0.00623 0.00232 attach 0.00467 0.00622 0.00364 0.00414 0.0017 0.00484 0.0012 updat 0.00013 0.00104 0.00079 0.00391 0.00032 0.00042 9e-05 $EMAIL 0.00019 0.00073 0.0002 0.00373 0.00032 0.00014 0.00028 Given the the brief: update the logo on my business card We would match up each token with it’s probabilities in the table above, giving us the following table. Adding up each column would then give us a score for that class. Token name Other Image Header / Banner / Ad / Poster / Flier Logo Business Card Template work (ppt / pdf /word etc) Icon Social Media card 0.00019 0.00322 0.00257 0.0155 0.00021 0.00055 9e-05 busi 0.00038 0.00154 0.00325 0.00915 0.00021 0.00048",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}