{
    "relation": [
        [
            "Patent application number",
            "20110313966",
            "20140019875",
            "20140019975"
        ],
        [
            "Description",
            "ACTIVITY SCHEMES FOR SUPPORT OF KNOWLEDGE-INTENSIVE TASKS - An activity scheme designer may associate an activity scheme with a task of a process model that includes a plurality of tasks, the activity scheme including a directed graph of nodes in which the nodes represent knowledge actions to be performed at least partially by human users, and in which edges of the directed graph connecting the nodes are probabilistically weighted. A workflow engine may instantiate the process model for execution, including associating an instance of the task with a user of the human users, the task instance including instance-specific data associated with completing the execution. An activity scheme transformer may transform the activity scheme for the user, based on the instance-specific data, a context of the user including applications and information resources available to the user, and a personal profile of the user.",
            "TASK IDENTIFICATION BASED ON SEMANTICS AND TEMPORAL RELATIONSHIPS - The present description refers to a computer implemented method, computer program product, and computer system to receive a list of computer events, each of the events including a user interacting with a computer, determine one or more desktop operations, with each desktop operation including one or more computer events that are performed to accomplish the desktop operation, determine one or more knowledge actions, where each knowledge action includes a group of one or more desktop operations performed using a same application on a same information object, determine one or more tasks, with each task including a group of knowledge actions that include information objects that are semantically related, and combine two or more tasks that are temporally related.",
            "SERVICE TO RECOMMEND OPENING AN INFORMATION OBJECT BASED ON TASK SIMILARITY - The present description is directed to a technique to store one or more tasks, each task including one or more knowledge actions (KAs) that includes an action of one of a plurality of KA types being performed, determine a degree of similarity between each of one or more of the stored tasks and a current task, identify one of the stored tasks that most closely matches the current task based on the degree of similarity for each of the one or more stored tasks, identify one or more information objects that were open for the identified stored task, identify one or more information objects that are currently open for the current task, determine an additional information object that was open for the identified stored task but is not currently open for the current task, and provide a recommendation to a user to open the additional information object."
        ],
        [
            "Published",
            "12-22-2011",
            "01-16-2014",
            "01-16-2014"
        ]
    ],
    "pageTitle": "Benedikt - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/benedikt-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00201-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441405039,
    "recordOffset": 441384277,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Benedikt Schmidt, Winterberg DE 09-30-2010 Device and Method for Emulating an Actuator - The invention related to a device for emulating at least one first actuator, comprising at least one electric network that can be connected to at least one control electronic circuit, wherein the electric network is operatively connected to at least one second actuator by means of at least one first control and/or regulating unit and at least one first parameter of the electric network can be changed by means of the first control and/or regulating unit, and to a method for emulating at least one first actuator. 20100250092 Published Description Patent application number Benedikt Schemmer, Dreieich DE 09-08-2011 MAGNETIC RESONANCE IMAGING APPARATUS, EVALUATION DEVICE, AND METHOD - An image is generated from data acquired with a magnetic resonance tomography, wherein nuclear spins in an excitation region are excited with different transmission modes and a common image is generated from the response signals. 20110215803 Published Description Patent application number Benedikt Poser, Heikendorf DE //]]> BarDraw('2521039',['Patent applications by Benedikt Ohlig, Vallendar DE'],[[2,4,4,1,3,1,1]],['2005','2006','2008','2009','2010','2011','2012'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2521039\" align=\"center\"></div> </div> <canvas id=\"bg2521039\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Benedikt Ohlig, Vallendar DE</p> <div class=\"bar2521039\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>05-10-2012</td> <td><a href=\"/patents/app/20120111673\">BALL SCREW FOR A MOTOR VEHICLE BRAKE AND A MOTOR VEHICLE",
    "textAfterTable": "Benedikt Schmidt-Kortenbusch, Hamburg DE Patent application number Description Published 20100264269 DEVICE FOR ADJUSTING THE HEIGHT OF AN ASSEMBLY WITHOUT THE USE OF TOOLS - The invention relates to a device comprising a base plate and a support for adjusting the height of an assembly, in particular of a galley module in an aircraft, without using tools. 10-21-2010 Benedikt Schmulling, Herne DE Patent application number Description Published 20130300211 INDUCTIVE CONTACTLESS ENERGY AND DATA TRANSMISSION SYSTEM - The invention relates to an inductive contactless energy and data transmission system ( 11-14-2013 20130328412 FLAT COIL FOR A CONTACTLESS INDUCTIVE ENERGY TRANSMISSION - The invention relates to an inductive energy transmission system for the transfer of electrical energy between a base station and a movable consumer, in particular a vehicle, the energy transmission system being able to transfer electrical energy from a base station to the consumer and/or from the consumer to the base station, said energy transmission system comprising at least one primary-side flat coil (S 12-12-2013 Benedikt Skulasson, Reykjavik IS Patent application number Description Published 20130085581 FRICTIONLESS VERTICAL SUSPENSION MECHANISM FOR PROSTHETIC FEET - A vertical suspension system for a prosthetic foot includes a first member operatively coupleable to an amputee's residual leg. The suspension system can also include a second member coupleable to a prosthetic foot. One",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}