{
    "relation": [
        [
            "Logo",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Party",
            "Partido Rodriguista de eChile",
            "Movimiento Americano Social",
            "Partido Nacional Republicano",
            "Union Democrata Liberal",
            "eChile Q5",
            "Union Progresista"
        ],
        [
            "In English",
            "Rodriguista Party of eChile",
            "American Social Movement",
            "National Republican Party",
            "Liberal Democratic Union",
            "eChile Q5",
            "Progresist Union"
        ],
        [
            "Abb",
            "PR",
            "MAS",
            "PNR",
            "UDL",
            "EQ5",
            "UP"
        ],
        [
            "Party President",
            "Zakery",
            "rforster",
            "Nano Lavayen",
            "centy.noir",
            "DrKaban",
            "nkw180"
        ],
        [
            "Economical Orientation",
            "Far-left",
            "Center",
            "Center-right",
            "Center-right",
            "Center",
            "Center-left"
        ],
        [
            "Social Orientation",
            "Libertarian",
            "Libertarian",
            "Authoritarian",
            "Libertarian",
            "Libertarian",
            "Libertarian"
        ],
        [
            "Congress Seats",
            "0",
            "5",
            "10",
            "9",
            "9",
            "7"
        ],
        [
            "Total Members",
            "117",
            "101",
            "107",
            "108",
            "162",
            "110"
        ]
    ],
    "pageTitle": "Chile - eRepublik Official Wiki",
    "title": "",
    "url": "http://wiki.erepublik.com/index.php/Chile",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00308-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 258991439,
    "recordOffset": 258957861,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{113600=Content was updated on November 4, 2011., 155744=It was announced that Chile would be added to eRepublik in an eRepublik Insider[17] article in 2009. A forum announcement [18] on January 5, 2009 notified the community that Chile would be added on January 14., 117293=Content was updated on December 19, 2014., 128623=The following lists the presidents of Chile, as well as all the people who was in charge at certain times of the country's history. Some of them may never had ostentated the ingame position, but during the specificated period they where in charge, as recurrently happens on the unofficial (which didn't get reflected directly ingame) political crisis that Chile often suffers. At the current time, 3 of these had happened: on july, after a failed war; on november, after an almost inactive president; and at the end of february, due to the earthquake on RL., 33568=Chile, officially the Republic of Chile (Spanish: República de Chile) is a country in South America occupying a long, narrow coastal strip between the Andes mountains to the east and the Pacific Ocean to the west. It borders Peru to the north, Bolivia to the northeast, Argentina to the east, and New Zealand to the west. It was the first nation added to eRepublik in 2009., 103452=Content was updated on January 02, 2015., 98703=Chile has a population of 5615 citizens, from which more than half of them are a product of a recent Baby Boom that took place during the last weeks of October, 2011. Chile has an average citizen level of 18., 156688=January 14, 2009: Chile was created. Hundreds of Chileans came to the inauguration, and the first party of Chile was created, Partido Nacionalista de Chile. After the Party President elections on January 15, the party was renamed Chile Unido, reuniting all true Chileans. January 25, 2009: Chileans secured their government from a TO, obtaining a majority in the Congress. February 6, 2009: The first President of Chile is chosen: -Chuck Norris-. Two days later, on February 8, Chile confirmed its entrance to the PEACE Global Community. February 15, 2009: Three of the five existing parties were taken over by Chilean citizens, bringing about more competition in government. The next day, the Chilean Army was organized and became ready to participate in any conflict, whenever the \"peace time\" imposed by the eGods ends..., 113753=Chile's Armed Forces are subject to civilian control exercised by the president through the Minister of Defense. The president has the authority to remove the commanders-in-chief of the armed forces. As of November 4, 2011, Chile has no official Armed Forces, only private Military Units specialized in combat. Chile has a training unit called Chile Training Militia (abbreviated CTM). The Government is currently studying the possibility of creating a National Army., 117787=Chile is currently a member of the Terra Alliance since June 1st, 2011, along with Brazil, Canada, Cyprus, France, Germany, Russia and USA. Terra (along with the EDEN Alliance and their allies) is currently waging war against the ONE Alliance. For more information see World War V, 97691=Content was updated on January 10, 2014.}",
    "lastModified": "Thu, 16 Jul 2015 20:59:23 GMT",
    "textBeforeTable": "Conquered Regions Otago Patagonia Zona Sur 359 ▲ Zona Austral ZA Canterbury Patagonia Wellington Zona Austral Zona Central 877 ▲ Zona Sur ZS",
    "textAfterTable": "Victoria New South Wales 20px Western Australia Tasmania Queensland Northern Territory Tasmania 122 Victoria Otago South Australia Tasmania Victoria",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}