{
    "relation": [
        [
            "Parameter",
            "cloned_propagation_name",
            "propagation_name",
            "queue_name",
            "perform_actions",
            "script_name",
            "script_directory_object"
        ],
        [
            "Description",
            "The name of the cloned propagation used by the stream that was split off from the original stream using the SPLIT_STREAMS procedure. The name of the cloned propagation also identifies the cloned queue and capture process used by the cloned propagation. You must specify an existing propagation name. Do not specify an owner.",
            "The name of the propagation that is merged back to the original stream. If NULL, then the name of the original propagation in the original stream is used. Specify NULL only if the streams were split using the SPLIT_STREAMS procedure. Specify a non-NULL value if you want to use a name that is different than the original propagation name or if you are merging two streams that were not split by the SPLIT_STREAMS procedure. See \"Usage Notes\" for more information. If a non-NULL value is specified, then an error is raised under either of the following conditions: The queue specified in the queue_name parameter does not exist. The queue specified in the queue_name parameter exists but is not used by a capture process.",
            "The name of the queue that is the source queue for the propagation that is merged back. If NULL, then the existing, original queue is the source queue for the propagation that is merged back. Specify NULL only if the streams were split using the SPLIT_STREAMS procedure. Specify a non-NULL value if you are merging two streams that were not split by the SPLIT_STREAMS procedure. Specify the name of the existing queue used by the capture process that will capture changes in the merged stream. See \"Usage Notes\" for more information.",
            "If TRUE, then the procedure performs the necessary actions to merge the streams directly. If FALSE, then the procedure does not perform the necessary actions to merge the streams directly. Specify FALSE when this procedure is generating a script that you can edit and then run. The procedure raises an error if you specify FALSE and either of the following parameters is NULL: script_name script_directory_object",
            "If non-NULL and the perform_actions parameter is FALSE, then specify the name of the script generated by this procedure. The script contains all of the statements used to merge the streams. If a file with the specified script name exists in the specified directory for the script_directory_object parameter, then the procedure appends the statements to the existing file. If non-NULL and the perform_actions parameter is TRUE, then the procedure generates the specified script and performs the actions to split the stream directly. If NULL and the perform_actions parameter is TRUE, then the procedure performs the actions to merge the streams directly and does not generate a script. If NULL and the perform_actions parameter is FALSE, then the procedure raises an error.",
            "The directory object for the directory on the local computer system into which the generated script is placed. If the script_name parameter is NULL, then the procedure ignores this parameter and does not generate a script. If NULL and the script_name parameter is non-NULL, then the procedure raises an error."
        ]
    ],
    "pageTitle": "DBMS_STREAMS_ADM",
    "title": "",
    "url": "http://docs.oracle.com/cd/B28359_01/appdev.111/b28419/d_streams_adm.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00297-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 75941839,
    "recordOffset": 75866327,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 09 Jul 2015 23:29:26 GMT",
    "textBeforeTable": "Table 130-24 MERGE_STREAMS Procedure Parameters Parameters script_directory_object IN VARCHAR2 DEFAULT NULL); script_name IN VARCHAR2 DEFAULT NULL, perform_actions IN BOOLEAN DEFAULT TRUE, queue_name IN VARCHAR2 DEFAULT NULL, propagation_name IN VARCHAR2 DEFAULT NULL, cloned_propagation_name IN VARCHAR2, DBMS_STREAMS_ADM.MERGE_STREAMS(  Syntax SPLIT_STREAMS Procedure MERGE_STREAMS_JOB Procedure See Also: Drops the cloned queue. Drops the cloned capture process. Drops the cloned propagation. When the original capture process is started, it might recapture changes that it already captured, or it might capture changes that were already captured by the cloned capture process. In either case, the relevant apply processes will discard any duplicate changes they receive. The lowest acknowledged SCN of the other propagations that propagate changes captured by the original capture process. The acknowledged SCN of the cloned propagation. Starts the original capture process from the lower SCN value of these two SCN values: Copies the cloned propagation back to the original propagation. The propagation has the same name as the original propagation after it is copied back. Stops the original capture process. Stops the cloned capture process. The MERGE_STREAMS procedure performs the following actions: The CAPTURE_MESSAGE_CREATE_TIME in the GV$STREAMS_CAPTURE view of the cloned capture process has caught up to, or nearly caught up to, the CAPTURE_MESSAGE_CREATE_TIME of the original",
    "textAfterTable": "Usage Notes You can use the MERGE_STREAMS procedure to merge two streams that were not split using the SPLIT_STREAMS procedure. Merging streams in this way can save resources and improve performance when a single database is running two or more capture processes. MERGE_STREAMS_JOB Procedure This procedure determines whether the original capture process and the cloned capture process are within the specified merge threshold. If they are within the merge threshold, then this procedure runs the MERGE_STREAMS procedure to merge the two streams. Typically, this procedure is used to merge two streams that were split using the SPLIT_STREAMS procedure in this package. The SPLIT_STREAMS procedure clones components of the original stream when it splits the streams. Therefore, the information in this section uses the following terminology: The stream before it was split off has the original queue, original capture process, and original propagation. The stream that was split off by the SPLIT_STREAMS procedure has a cloned queue, cloned capture process, and cloned propagation. If the auto_merge_threshold parameter was set to a positive number in the SPLIT_STREAMS procedure that split the streams, then a merge job runs the MERGE_STREAMS_JOB procedure automatically according to its schedule. The schedule name is specified for the schedule_name parameter, and the merge job name is specified for the merge_job_name parameter when the MERGE_STREAMS_JOB procedure is run automatically. The merge job and its schedule",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}