{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Item",
            "Sequence No.",
            "Docket No.",
            "FAC"
        ],
        [
            "regulations.gov",
            "2014-27662",
            "",
            "V",
            "4",
            "2014-0053",
            "2005-78"
        ]
    ],
    "pageTitle": "48 CFR Part 52, Subpart 52.1 - Instructions for Using Provisions and Clauses | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/48/part-52/subpart-52.1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00034-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 919628643,
    "recordOffset": 919601636,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1015=Title 48 published on 2014-10-01}",
    "TableContextTimeStampAfterTable": "{80660=§ 2322 - Repealed., 77268=§ 2303 - Applicability of chapter, 80451=§ 2320 - Rights in technical data, 78907=§ 2307 - Contract financing, 81126=§ 2324 - Allowable costs under defense contracts, 19477=DoD, GSA, and NASA are issuing a final rule amending the Federal Acquisition Regulation (FAR) to strengthen protections against trafficking in persons in Federal contracts. These changes are intended to implement Executive Order (E.O.) 13627, entitled “Strengthening Protections Against Trafficking in Persons in Federal Contracts,” and title XVII of the National Defense Authorization Act for Fiscal Year 2013., 79443=§ 2312 - Remission of liquidated damages, 82188=§ 2332 - Share-in-savings contracts, 80252=§ 2318 - Advocates for competition, 79103=§ 2309 - Allocation of appropriations, 79202=§ 2310 - Determinations and decisions, 9058=DoD, GSA, and NASA are issuing corrections to the Technical Amendments; (Item III), which was published in the Federal Register at 80 FR 4994, January 29, 2015., 76719=§ 2302 - Definitions, 81799=§ 2330 - Procurement of contract services: management structure, 140344=DoD, GSA, and NASA are proposing to amend the Federal Acquisition Regulation (FAR) to implement a section of the National Defense Authorization Act (NDAA) for Fiscal Year (FY) 2013 to include in the Federal Awardee Performance and Integrity Information System (FAPIIS), to the extent practicable, identification of any immediate owner or subsidiary, and all predecessors of an offeror that held a Federal contract or grant within the last three years. The objective is to provide a more comprehensive understanding of the performance and integrity of the corporation before awarding a Federal contract., 145808=DoD, GSA, and NASA are proposing to amend the Federal Acquisition Regulation (FAR) to further implement the inflation adjustment of acquisition-related dollar thresholds. A statute requires an adjustment every five years of acquisition-related thresholds for inflation using the Consumer Price Index for all urban consumers, except for the Construction Wage Rate Requirements statute (Davis-Bacon Act), Service Contract Labor Standards statute, and trade agreements thresholds. DoD, GSA, and NASA are also proposing to use the same methodology to adjust nonstatutory FAR acquisition-related thresholds in 2015., 78468=§ 2306 - Kinds of contracts, 81326=§ 2326 - Undefinitized contractual actions: restrictions, 79769=§ 2314 - Laws inapplicable to agencies named in, 80172=§ 2317 - Repealed., 79301=§ 2311 - Assignment and delegation of procurement functions and responsibilities, 80348=§ 2319 - Encouragement of new competitors, 77445=§ 2304 - Contracts: competition requirements, 82695=§ 2336 - Intergovernmental support agreements with State and local governments, 79878=§ 2315 - Law inapplicable to the procurement of automatic data processing equipment and services for certain defense purposes, 81571=§ 2328 - Release of technical data under Freedom of Information Act: recovery of costs, 78996=§ 2308 - Buy-to-budget acquisition: end items, 81719=§ 2329 - Repealed., 81444=§ 2327 - Contracts: consideration of national security objectives, 82043=§ 2331 - Procurement of services: contracts for professional and technical services, 81236=§ 2325 - Restructuring costs, 82458=§ 2334 - Independent cost estimation and cost analysis, 82285=§ 2333 - Joint policies on requirements definition, contingency program management, and contingency contracting, 79545=§ 2313 - Examination of records of contractor, 80065=§ 2316 - Disclosure of identity of contractor, 80546=§ 2321 - Validation of proprietary data restrictions, 76639=§ 2301 - Repealed., 13949=DoD, GSA, and NASA are issuing a correction to FAR Case 2014-008; Management and Oversight of the Acquisition of Services (Item II), which was published in the Federal Register at 80 FR 4992, January 29, 2015., 82574=§ 2335 - Prohibition on collection of political information, 80740=§ 2323 - Contract goal for small disadvantaged businesses and certain institutions of higher education, 4178=DoD, GSA, and NASA are issuing corrections to FAR Case 2013-001; Ending Trafficking in Persons (Item I), which was published in the Federal Register at 80 FR 4967, January 29, 2015., 82835=§ 2337 - Life-cycle management and product support, 78224=§ 2305 - Contracts: planning, solicitation, evaluation, and award procedures, 55270=DoD, GSA, and NASA are issuing a final rule amending the Federal Acquisition Regulation (FAR) to delete obsolete regulations relating to the year 2000 compliance.}",
    "lastModified": "Thu, 26 Feb 2015 07:18:00 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 6908 - Federal Acquisition Regulation; Ending Trafficking in Persons; Corrections 2015-02-09; vol. 80 # 26 - Monday, February 9, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 48. Title 48 published on 2014-10-01 § 52.107 — Provisions and clauses prescribed in subpart 52.1. § 52.106 — [Reserved] § 52.105 — Procedures for using alternates. § 52.104 — Procedures for modifying and completing provisions and clauses. § 52.103 — Identification of provisions and clauses. § 52.102 — Incorporating provisions and clauses. § 52.101 — Using part 52. § 52.100 —",
    "textAfterTable": "Corrections DEPARTMENT OF DEFENSE, GENERAL SERVICES ADMINISTRATION, NATIONAL AERONAUTICS AND SPACE ADMINISTRATION Final rule; corrections. Effective: March 2, 2015. 48 CFR Parts 1, 2, 9, 12, 22, 42, and 52 Summary DoD, GSA, and NASA are issuing corrections to FAR Case 2013-001; Ending Trafficking in Persons (Item I), which was published in the Federal Register at 80 FR 4967, January 29, 2015. 80 FR 6909 - Federal Acquisition Regulation; Technical Amendments; Corrections GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-02529 RIN Sequence No. 5 Docket No. 2014-0053 FAC 2005-80 Corrections Technical Amendments DEPARTMENT OF DEFENSE, GENERAL",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}