{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Make friends by being social and have study sessions together! After all, you are paying to learn, not to party.",
            "Food is not really good here. They have the basic minimum, enough to get by but nothing to brag about.",
            "They don't have dorms I think.",
            "This place will challenge you to do your best and to be on top of you stuff. Manage your time wisely to suceed.",
            "Sign up for classes on time, they go fast. Don't forget to purchase a parking pass and to park at the right spots to avoid unnecessary fees.",
            "Cypress College provides affordable education to its students. The school is convenient to attend since it is not overcrowded. The professors are good as well."
        ]
    ],
    "pageTitle": "Cypress College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Cypress-College/reviews?_escaped_fragment_=/show/85472",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00052-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911749895,
    "recordOffset": 911697999,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{77149=Although there are no dorms at Cypress College, apartments nearby are very affordable. Houses on Orange Street average two bedrooms with rent under $1000/month., 243057=© 2015, Cappex.com, LLC, 228613=The campus is pretty safe. I have been there three years and have never felt unsafe. I have taken several night classes that end as late as 10:30 pm and have never felt like I was in danger. This is due to the several security guards that walk/drive around the campus constantly and will answer your call promptly if you call them. There is also security cameras installed in the buildings. Campus security will also offer to walk you to your car if you ever feel unsafe.}",
    "textBeforeTable": "12/04/2009 Reviewer is A current student here. 8 out of 9 people found this review useful. 1 of 62 Julieta from Lakewood, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Danielle from Anaheim, CA 12/08/2009 Reviewer is A current student here. 3 out of 4 people found this review useful. 2 of 62 Categories Comments Am enjoying being here The administrative part can be a bit frustrating at times, but I love it at Cypress. Am learning a lot I really like all of my classes, and I can tell my teachers really know a lot about their subjects. Mark Majarian, my theatre professor, really tries to push you to be the best student you can. Login to rate or flag the reviews Hayley from Anaheim, CA 10/30/2010 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 62 Categories Comments",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}