{
    "relation": [
        [
            "Deposit Amount",
            "$200-$1,999",
            "$2,000-$4,999",
            "$5,000-$14,999",
            "$15,000-$29,999",
            "$30,000-$69,999",
            "$70,000-$149,999",
            "$150,000-$200,000"
        ],
        [
            "Return On Investment",
            "500% after 12 hours",
            "500% after 10 hours",
            "500% after 8 hours",
            "800% after 6 hours",
            "800% after 4 hours",
            "800% after 2 hours",
            "800% after one hour"
        ],
        [
            "Deposit Now",
            "Deposit Now",
            "Deposit Now",
            "Deposit Now",
            "Deposit Now",
            "Deposit Now",
            "Deposit Now",
            "Deposit Now"
        ]
    ],
    "pageTitle": "Paying HYIP Online - Legit Hyip - Perfect Money Investment - 800% in 1 hour",
    "title": "",
    "url": "http://www.payinghyiponline.com/legithyip.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00301-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 650935806,
    "recordOffset": 650927604,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{23561=Legit Hyip - Perfect Money Investment - 800% in 1 hour Legit Hyip LLC is a global investment manager dedicated to growing and preserving client assets and building trust, in partnership with financial professionals and institutions worldwide, since January, 2005 with their initial capital of $10 million. By our successful and open work we've proved our reliability and enjoyed confidence of our clients. Our professionals take advantage of currency price fluctuations to make profit for their clients by buying and selling major currencies and stocks. This Company is designed for a person who desires to acquire stable high profits from their funds. Are you looking for investment opportunities and services which are designed to meet your financial goals? Are you seeking peace of mind investing in emerging markets? Do you want your investments to deliver superior value growth? If so, you should certainly consider Legit Hyip,an ideal solution for your requirements. Confident in your choices. Clear about your goals. In control of your financial life. That's how we want you to feel when you're planning for your future. And that's why Legit Hyip puts you and your needs at the center of our business, from our approach to our philosophy on how advisors work with you. Learn more about what Legit Hyip can offer you below.We believe our success lies in adherence to highly disciplined, objective and well-defined investment processes, supported by intensive, original research and analysis. To encourage innovation, we organize our investment analysts into independent, focused teams operating in an entrepreneurial environment .We wish you all the best as we together strive toward financial security. Deposit Now ( Perfect Money Investment ) 100% Guaranteed Return, 20015=That’s me in the center of the picture there. Nancy Price just an ordinary person. In Feb 2009 I was able  to quit working and this activity has become my sole source of funds. I have been working online now since 2002 then I discovered some sites that would pay you these are some sites that are paying me I am constatantly looking for new places to work and invest in so bookmark my webpage and I will update soon., 7091=Your site here for $1000}",
    "lastModified": "Thu, 30 Jul 2015 07:31:50 GMT",
    "textBeforeTable": "Legit Hyip - Perfect Money Investment - 800% in 1 hour Legit Hyip LLC is a global investment manager dedicated to growing and preserving client assets and building trust, in partnership with financial professionals and institutions worldwide, since January, 2005 with their initial capital of $10 million. By our successful and open work we've proved our reliability and enjoyed confidence of our clients. Our professionals take advantage of currency price fluctuations to make profit for their clients by buying and selling major currencies and stocks. This Company is designed for a person who desires to acquire stable high profits from their funds. Are you looking for investment opportunities and services which are designed to meet your financial goals? Are you seeking peace of mind investing in emerging markets? Do you want your investments to deliver superior value growth? If so, you should certainly consider Legit Hyip,an ideal solution for your requirements. Confident in your choices. Clear about your goals. In control of your financial life. That's how we want you to feel when you're planning for your future. And that's why Legit Hyip puts you and your needs at the center of our business, from our approach to our philosophy on how advisors work with you. Learn more about what Legit Hyip can offer you below.We believe our success lies in adherence to highly disciplined, objective and well-defined investment processes, supported by intensive, original research and analysis. To",
    "textAfterTable": "PerfectMoney Proof of Payment Invest Here If you don't get paid,please mailto: services@payinghyiponline.com I will return 200% of your deposit.You have no risk! If you want to find more paying hyips, Please check our site.     Disclaimer:We are in no way affiliated with any of the investment programs listed on our website. The information presented on our website is based on statistics and personal experience only. Please keep in mind that all HYIPs investments are highly risky. We do not recommend you to invest more than you can afford to lose. Copyright © 2008-2015 PayingHyipOnline.com",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}