{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus Safety is always here, I have never felt unsafe. Nobody except for the residents have keys to their speicific dorms, so nobody can get in without the keys. There are also people who sit at the gatehouse entrance to watch for any cars that are not owned by residents and ID them.",
            "Shorter does have Greek life, and it is very popular on campus; I am a huge fan of the Greek life here.",
            "There are a lot of clubs and activitites for their majors as well as activites such as free bowling night or movies in the front lawn.",
            "Students who like small campuses and kind atmospheres Students who want to get involved Students who don't want to get involved Students looking for great professors",
            "There are catacombs for the underground of the school that goes all over campus that many students like to travel through, but they sadly blocked them off this year keeping students from going into them.",
            "The dorms need a few updates, and the food needs improving; however, I love Shorter and wouldn't change colleges for anything.",
            "Students at Shorter usually walk around Broadstreet, walk on the lock bridge, loval parks, hike at Berry, or go to the Mount Berry mall. You can do anything you want, and it's always fun with a group of friends.",
            "The caf (dining hall) here has good days and bad days; there are always multiple choices, so you can always find an option. The food is bland sometimes though, but stocking food in your dorm is always a great option. There are lots of great places close to the school to get food, and Chickfila has a deal on Thursdays specifically for students that a lot of people partake in.",
            "The dorms need to be renovated some, but they are definitely not bad. How much you like your dorm also depends on how you make it feel for you, so make it the way you want it; you will enjoy it a lot more when you make it your own.",
            "The courses can be challenging, but with the understanding staff and open door policy, there is no way to fail unless you don't try.",
            "Get involved on campus; it will make your experience more fun and exciting. Stay serious about your assignments, but save time to have fun as well. Make as many friends as possible and some closer friends to hang out with whenenver you want.",
            "Shorter has the nicest student body and faculty that I have ever witnessed. The students are so fun and beyond welcoming; it's impossible not to make friends by the end of your first day. The teachers all have an open door policy, so it's very easy to get help on your assignments."
        ]
    ],
    "pageTitle": "Shorter University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Shorter-University/reviews?_escaped_fragment_=/show/72100",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00202-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900283487,
    "recordOffset": 900256006,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{105392=© 2015, Cappex.com, LLC, 85483=There is always something to do on campus. May it be games in the front circle, FAB sponsored events, or even a fun evening in the game room.}",
    "textBeforeTable": "05/07/2011 Reviewer is Researching this school. Reviewer has been to campus. 2 out of 2 people found this review useful. 1 of 26 Lauren from Atlanta, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. Shorter University Reviews Shorter University › Georgia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "a major tip needed for college is time management. what you do on your free time is very important. In three sentences shorter university is a very small campus, which i really like. i also feel that there are a lot of kind and nice people here at shorter univesity. if i were to rate my school it would defiantly be 8 out of 10. Login to rate or flag the reviews Rachel from Rock Spring, GA 07/31/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 26 Categories Comments Campus Safety If there are any problems on campus, those who ensure campus are quick to take action. Greek Life I am not a part of greek life, but they always have events going on, such as big/little week, crush parties, etc... Clubs and Activities We have",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}