{
    "relation": [
        [
            "Pitch Type",
            "FB",
            "CB",
            "CH"
        ],
        [
            "Present Grade",
            "65",
            "70",
            "45"
        ],
        [
            "Future Grade",
            "80",
            "80",
            "55"
        ],
        [
            "Sitting Velocity",
            "93-96",
            "79-81",
            "81-84"
        ],
        [
            "Peak Velocity",
            "98",
            "83",
            "85"
        ],
        [
            "Report",
            "Explosive offering with elite velocity; sits comfortable at 93-96; ball has terrific and natural arm-side run up to 95; straightens out at higher velocity; boring action; late life that is hard to pick up out of hand; velocity and movement is heightened due to extreme plane; ball looks 100 out of hand; hitters struggled to catch up; absolute weapon running inside on RHH; shattered two bats with run; command is currently average; struggles at times on release points; command tightening and extra stamina could lead to the FB becoming an elite offering and one of the more dominant pitches in the game.",
            "One of the best secondary offerings in the minors; extremely hard spin; deep depth; 11-5 with great rotation throughout the entire action; easy strikeout pitch; ability to throw in any count at any time; two-plane break; command can waiver at times due to release points; no contact on the pitch through first three innings; has full confidence in the CB; only aspect holding this back from elite is repetition of release points and command; absolute hammer.",
            "CH needs work; flashes solid-average; shows ability to throw with same arm speed as FB; replication and release points are biggest issue; grip seems too firm at times; releases too early at other times; floated a few in; pitch has some fade but is not a true weapon; command is not quite there; will be a solid pitch once he gets a full year under his belt working on it."
        ]
    ],
    "pageTitle": "Baseball Prospectus | Eyewitness Accounts: June 19, 2014",
    "title": "",
    "url": "http://www.baseballprospectus.com/article.php?articleid=23928",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00000-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 325236383,
    "recordOffset": 325215450,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{70970=Copyright © 1996-2015 Baseball Prospectus, LLC.            Surprise Me!, 7613=June 19, 2014}",
    "lastModified": "Wed, 29 Jul 2015 04:56:06 GMT",
    "textBeforeTable": "No Video 2016 MLB ETA 40; Middle Relief Realistic 50/High OFP/Risk 5/21/2014 Dates Seen Myrtle Beach Pelicans (High A, Rangers) Affiliate 05/22/2014 Report Date Tucker Blair Evaluator Tall; slender frame with long limbs; good extension; plane is average; does not hide pitches extremely well; arm speed is a tick above average; mild crossfire; compacts body too much on delivery at times; alters SL release point. Mechanics Weight: 180 Height: 6' 6\" Throws: Left Bats: Left Born: 09/09/1990 (Age: 23) Will Lamb table.overall tr td { padding: 6px;} table.overall tr.header td { background: #25408f; color: #fff; font-weight: bold; font-size: 10pt;} table.overall {float: right; border: 1px solid #000; margin: 20px 0; font-size: 10pt;} table.repertoire tr td.rpt { text-align: left; font-size: 10pt;} table.repertoire tr td.mid { text-align: center; font-weight: bold; font-size: 11pt;} table.repertoire tr td.mid1 { text-align: center;} table.repertoire tr:nth-child(odd) {background: #eee;} table.repertoire tr td { padding: 6px; vertical-align: top;} table.repertoire tr.header td { background: #25408f; color: #fff; font-weight: bold; font-size: 10pt;} table.repertoire {border: 1px solid #000; margin-top: 20px; font-size: 10pt;} .scouting table.mechanics tr td { padding: 6px; } .scouting",
    "textAfterTable": "Overall Lamb has a three-pitch arsenal, but the ceiling is likely a middle reliever due to no pitch projecting solid-average or higher. His fastball can top mid 90s, but lacks the necessary movement to fool hitters at the major-league level. Lamb has some mechanical issues to fix, such as repeating his delivery and arm slots. These issues could make or break his chance at hitting his ceiling of a solid middle-inning arm.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}