{
    "relation": [
        [
            "Shipping and handling",
            "US $4.99",
            "US $9.99"
        ],
        [
            "Each additional item",
            "US $3.99",
            "US $3.99"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Shipping",
            "Expedited Shipping (USPS Priority Mail®)"
        ],
        [
            "Delivery*",
            "Estimated between Thu. Aug. 6 and Thu. Aug. 13",
            "Estimated between Thu. Aug. 6 and Mon. Aug. 10"
        ]
    ],
    "pageTitle": "Denver Bicycle Club T Shirt Mile High Colorado Cycling Bike 303 New XS 4XL | eBay",
    "title": "",
    "url": "http://www.ebay.com/itm/DENVER-BICYCLE-CLUB-T-shirt-Mile-High-Colorado-Cycling-Bike-303-NEW-XS-4XL-/180785187694?pt=US_Mens_Tshirts&var=&hash=item6fc567c28f",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00094-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 412546263,
    "recordOffset": 412490446,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter 5 or 9 numbers for the ZIP Code. Please enter a valid ZIP Code. ZIP Code: Select a valid country. There are 4,799 items available. Please enter a number less than or equal to 4,799. -Select- Albania American Samoa Andorra Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Republic Bahamas Bahrain Barbados Belarus Belgium Belize Bermuda Bhutan Bolivia Bosnia and Herzegovina Brazil British Virgin Islands Brunei Darussalam Bulgaria Canada Cape Verde Islands Cayman Islands Chile Colombia Cook Islands Costa Rica Croatia, Republic of Cyprus Czech Republic Denmark Dominica Dominican Republic Ecuador Egypt Estonia Falkland Islands (Islas Malvinas) Fiji Finland France French Guiana French Polynesia",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Handling time Will usually ship within 3 business days of receiving cleared payment - opens in a new window or tab. Return policy After receiving the item, contact seller within Refund will be given as Return shipping 7 days Item exchange only Buyer pays return shipping",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}