{
    "relation": [
        [
            "Talkgroup name",
            "New Albany Police",
            "New Albany Police Tac 1",
            "New Albany Police Tac 2",
            "Ohio State University Police - Newark and other regional campuses",
            "Licking County Sheriff Mutual Aid (SO-45)",
            "Licking County Emergency Management Agency",
            "ODH mutual aid with Licking County Health Department",
            "ODH mutual aid with Newark Health Department",
            "Licking Memorial Hospital"
        ],
        [
            "DEC",
            "4864",
            "4880",
            "4896",
            "59856",
            "63296",
            "58320",
            "8272",
            "8288",
            "8864"
        ]
    ],
    "pageTitle": "Licking County (OH) - The RadioReference Wiki",
    "title": "",
    "url": "http://wiki.radioreference.com/index.php?title=Licking_County_(OH)&curid=4058&diff=92974&oldid=92924",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00244-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 265740923,
    "recordOffset": 265718192,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{104788=Heath public works (Street Department, Water Department, and Wastewater Department) were formerly on the (now defunct) Heath trunking system. They retain 858.2125, although this channel is rarely used except for snow removal and communications between public works departments and the Heath Police Department. The channel is also shared with the Police department, which uses it as a special event/tactical channel. Licking County is in ODOT district 5. The district headquarters is in Jacksontown in Licking Township.}",
    "textBeforeTable": "list of county fire apparatus Also see the Fire/EMS Fire/EMS departments 13 Related links 12 Neighboring counties 11 Unconfirmed frequencies from the FCC Database 10 Air Traffic 9.1.3 Local Talkgroups 9.1.2 Sites near Licking County 9.1.1 Sites in Licking County 9.1 American Electric Power EDACS system 9 Utilities 8 Weather 7 Education 6 Public Works 5.3.3 Other 5.3.2 Highway Patrol 5.3.1 Local agencies 5.3 Locally-used Talkgroups 5.2 Sites near Licking County 5.1 Sites in Licking County 5 State of Ohio MARCS 4 Hospitals 3 Emergency Management 2.3 Law enforcement map",
    "textAfterTable": "Bowling Green Township (part) Glenford Village (Perry County) Hopewell Township (Perry County) KWV805 33.860 33.860 is used for Licking County runs only. The Perry County Sheriff's Office dispatches other runs on 33.980. Granville Township Fire Department 200 Granville (133 North Prospect Street) Granville village Granville Township Union Township (part) McKean Township (part) KBW856 33.860 Alternate website Hanover Volunteer Fire Department 801 Toboso (2475 Gratiot Road SE) Hanover village Hanover Township Perry Township KCR802 33.860 802 Hanover (198 Newhome Drive) Hartford Volunteer Fire Department 960 Hartford (Croton) (180 Smith Street) Hartford (Croton) village Hartford Township Bennington Township KBZ960 33.860 151.1225 Heath Fire Department 1 Heath (193 Heath Road) Heath city Franklin Township (part) KLR398 33.860 Haz-Mat 2 is located at station 1",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}