{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Security will always there when you need them or when you want them. Library too far from your car after dark? Call security, they'll gladly pick you up and take you! No charge!",
            "Hard workers.",
            "It's worth it.",
            "Los Angeles, Laguna Beach, Irvine Spectrum, Santa Monica, Hollywood, and everything else Southern Cali has to offer is all an hour or so in the vicinity!",
            "Stay clear or the pizza. It's good, but by third quarter you'll be regretting that two-piece bikini.",
            "The deans and RA's know more than you think!",
            "Whether you choose business, medicine, humanities, or a pre-allied health program, don't underestimate your peers. It's a competition.",
            "Study hard, study smart, but on't forget that God is always on your side no matter what. Breathe. Don't forget to stop and just breathe. Take a walk. Read a funny blog. Take a break.",
            "La Sierra University has professors that care not only for your academic well-being, but for you as an individual. La Sierra has pushed me to strive academically and spiritually as a student. I can't imagine a better campus that works towards helping me fulfill my goals."
        ]
    ],
    "pageTitle": "La Sierra University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/La-Sierra-University/reviews?_escaped_fragment_=/show/76211",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00303-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910084659,
    "recordOffset": 910027741,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{258818=© 2015, Cappex.com, LLC, 51945=i play sports.. soccer... we made it to nationals..2011 but a lost of activities year round}",
    "textBeforeTable": "08/03/2009 Reviewer is A current student here. 13 out of 13 people found this review useful. 1 of 59 shantal from Fresno, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Tips for prospective students Do all your work and go to worship every week. Login to rate or flag the reviews Nikki from Perris, CA 06/15/2011 Reviewer is A past student here. 3 out of 3 people found this review useful. 3 of 59 Categories Comments Great for these types of students Any and all!!! Tips for prospective students If you can afford it it's a great school. Bang for the buck It is worth its weight in gold. But it is way to expensive when we have a family of 7 and I have a loan of over $15k from one semester :( Did enjoy being here I loved attended La Sierra. It was so personal and helpful. Did learn a lot I learned more at this school",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}