{
    "relation": [
        [
            "'",
            "Corporate Headquarters",
            "Total",
            ""
        ],
        [
            "Hot Topic (HOTT)",
            "800",
            "8,900",
            ""
        ],
        [
            "Buckle (BKE)",
            "570",
            "7,600",
            ""
        ],
        [
            "Wet Seal (WTSLA)",
            "407",
            "6982",
            ""
        ],
        [
            "Urban Outfitters (URBN)",
            "-",
            "14,000",
            ""
        ]
    ],
    "pageTitle": "Stock:Hot Topic (HOTT)",
    "title": "",
    "url": "http://www.wikinvest.com/stock/Hot_Topic_(HOTT)",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00119-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 836389867,
    "recordOffset": 836352528,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{106293=As a percentage of net sales, selling, general and administrative expenses were 34.9% in fiscal 2010 compared to 32.2% in fiscal 2009. The majority of this increase was attributed to Increase in store payroll expense primarily due to deleveraging on lower store sales and higher payroll and related costs according to their annual report., 109237=Hot Topic announced Chris Daniel, the President of the company's Torrid division, has resigned effective April 29, 2011. Following the departure of Mr. Daniel, Betsy McLaughlin will assume direct oversight for Torrid. The company will conduct an outside search for a replacement. [3], 102800=Comparable Store Sales: Net sales decreased approximately $28.5 million, or 3.9% from FY 2009 to FY2010. $36.8 million of that decrease can be attributed to comparable net sales from Hot Topic stores in FY 2010 compared to FY 2009. Sustained negative same store sales are normally a sure telltale that a retailer is in trouble. As large retail chains expand geographically they eventually run out of prime locations and often end up cannibalizing their existing stores to some extent, which leads to a relative decline in this metric. As we can see Hot Topic has almost double the amount of stores than its competitors. A rapid expansion in the number of stores followed by weak same store sales numbers shows (in hindsight) that the store additions might have been careless or rushed., 103609=Performance of Selling Space: It is critical for the success of a business to constantly work towards improving not only the efficiency and productivity of the store's selling space and inventory as well. Hot Topic has had average store sales of $401 and $422 for FY2010 and FY2009, respectively, making them relatively competitive in this regard. However, their average sales per store are substantially lower than their competitors. It is important to keep in mind that they operate almost double the stores as their competitors, but even if you double the avg. sale per store placing them around $1400, it is still much lower than Buckle and Urban Outfitters. In order to remain competitive in the industry they must find a way to increase the sales volume per store. Their profit margins are being crushed by the fixed costs and overhead required to operate so many stores., 81533=During the first quarter of fiscal 2011, they announced that the business segment ShockHound would be discontinued. Estimates are that they will incur a total pre-tax charge of approximately $15 million primarily in the first quarter of fiscal 2011. However, the estimated costs and charges associated with those initiatives may vary depending on a variety of factors, including the outcome of negotiations with landlords and other third parties. Additionally, the loss of personnel and reduction in the number of stores they operate may result in decreased operational efficiencies, unanticipated operational challenges and decreased revenues., 102505=Revenue/Net Income: As we can see from the tables above, Hot Topic’s revenues are significantly smaller than Urban Outfitters, but compared to Buckle and Wet Seal they are relatively comparable. Unfortunately, Hot Topic is the only one to recognize net losses in FY 2010., 78209=Torrid was launched in the first half of the fiscal year 2001.The obvious goal being to become the leading specialty retailer of a “fashion forward” plus-size clothing line for young women. They had a target market of females from ages 15 to 29. More specifically those who interested in current fashion trends and pop culture.The sizes targeted were women wearing 12 to 26., 73508=Hot Topic operates two different brands: Hot Topic and Torrid. As stated, at the end of FY 2010 they operated 657 and 153 primarily mall-based Hot Topic and Torrid stores, respectively, in the United States, Puerto Rico and Canada as well. In addition, they offer merchandise through hottopic.com and torrid.com websites, including some internet exclusive items. Customers can also access their hottopic.com website through touch screen kiosk terminals located within each Hot Topic store., 61642=Like other retailers, HOTT has struggled to improve profit margins and maintain their customer base during and following the 2008-2009 U.S. Recession. In addition, HOTT's dependence on the downtrodden California economy has further put the retailer behind. California still has a $20 billion deficit,[2] which will cause HOTT to continue to underperform until it can deleverage its dependence on the California economy. Since HOTT sales are highly correlated to the success of music-inspired apparel, its success is affected by changing fashion trends., 75676=Although Hot Topic has seen decreses in net sales since 2008, they have had increased sales through their online websites. Hot Topic and Torrid both have seen increases in the volume of online sales since 2008 as well as an increase in the percentage of their total sales coming from thier respective sites., 60915=Hot Topic, Inc. (NASDAQ: HOTT) is a mall and web-based specialty retailer of apparel, accessories, music, and gift items for young men and women whose lifestyles reflect a passion for music, fashion and pop culture. They operate under two primary concepts: Hot Topic and Torrid. Their sub-brand Torrid primarily focuses on providing “fashion forward” plus-size clothing for young women. In fiscal 2010, HOTT posted net sales of $708 million and a net income loss of $8.2 million.[1], 92337=Hot Topic has been hit particularly hard by the financial crisis due to its dependence on the California economy. HOTT has 130 stores in California -- almost double the amount in the next leading state.[10] California was hit much harder than other U.S. states, as unemployment in the state topped at 12.6% compared to the national average of 9.9%.[11] In addition, despite cutbacks in 2009, California still has a $20 billion deficit.[2] Until California's economy can improve, or HOTT can de-leverage its dependence on the state, the retailer will continue to struggle getting sales figures., 90987=The 2008-2009 U.S. Recession had an immediate impact on retailers, as consumer confidence decreased 87% from February 2007 to February 2009.[6] Because of this, retailers had to face a short-term problem of reduced net sales, as well as long-term problems of suffocating debt and losing customers. Consumer confidence has rebounded since the crash, but some retailers are still failing to meet analyst sales estimates. In April 2010, only four of 22 retail firms beat analyst sales estimates.[7] Hot Topic was one such retailer with an underperforming April, as comparable store sales were down 12.5%.[8] Hot Topic continued to underperform in May, as comparable store sales for the month were down 9%.[9], 69288=Hot Topic was founded by Orv Madden in 1988. after the executive became aware of the marketing opportunities which had been created by MTV and other popular forms of alternative youth culture. Previous to starting Hot Topic, Madden had spent the entirety of his working life in the retail industry. The first Hot Topic store was located in a mall in Montclair, California. After his first year as an independent entrepreneur he found no shortage of outside investors willing to aid him in making the company's growth a reality. In the next few years, Madden raised over $11 million for Hot Topic and began to open new stores at strategically located sites around the country. By 1996 Hot Topic had sales of over $44 million and had opened almost 80 locations nationwide. In the fall of that year, Hot Topic went public with an initial public offering of 1.3 million shares of stock. The stock, which initially sold at $18 a share, raised almost $24 million for the company. Madden retained a 30 percent ownership in the company, which only one year later was valued at over $100 million. After going public in the autumn of 1996, Hot Topic's stock had by May of the following year skyrocketed in value, trading at almost double its initial price.}",
    "lastModified": "Fri, 04 Jan 2013 19:43:03 GMT",
    "textBeforeTable": "",
    "textAfterTable": "Try It Now! New! Portfolio       Login / Sign Up Search Industries Technology Energy Media Finance Green Issues China All Concepts Metals Energy Meats Grains Softs",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}