{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They'll throw money at you.",
            "Awesome food.",
            "You get first come, first serve on dorms, so make sure to apply early.",
            "From what I've researched, they've got awesome professors who are willing to help with anything.",
            "Contact the school, you can most likely receive a fee-waiver. Make sure to do early admit as well.",
            "Amazing school from what I've seen, I got my acceptance letter and then a grant worth $30,000! Super exciting to compare Geneva to other schools."
        ]
    ],
    "pageTitle": "Geneva College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Geneva-College/reviews?_escaped_fragment_=/show/18145",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00191-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899544411,
    "recordOffset": 899509906,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{118995=Great home away from home feel; the community is outstanding, and you will get to know many different people. There is only 1400 undergraduate students, so it is nice and small. You get the academics you are looking for, with high job placement rates and a career development office that knows what they are doing, chances are you will have a job or be in grad school when you are done., 70364=Geneva offers on campus activities like film fest in october, the black and white in the winter and then a campus wide talent show at the end of the year. Geneva also puts together road trips and athletic rallies. another locational perk for Geneva is that it is only 30 minutes from Pittsburg., 61674=2011 2012 school year had some strange counts of vandalism, but the security is usually on top of things although a bit aged., 31793=The food at Alex's and the Brig is not the best, but Alex's is receiving a complete remodel over the Summer of 2014., 41951=In April, many students on Geneva's campus participate in the event Humans vs. Zombies. For a straight week they run around campus, humans with Nerf guns trying to avoid being tagged by and turned into a zombie, and zombies trying to avoid being shot by a human. Even if you are not playing, it is quite an entertaining sight to see., 135498=© 2015, Cappex.com, LLC, 101239=one cool tradition is Humans vs. Zombies, a week-long game students play every year in April. It makes the campus a little more interesting and wacky as students wearing orange bandannas chase each other around with nerf guns.}",
    "textBeforeTable": "06/06/2009 Reviewer is A current student here. 11 out of 12 people found this review useful. 1 of 29 Amanda from Villa Rica, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Tuition only covers up to 17 credit hours, instead of 18. So, if you take more than the allowed 17, be ready to dish out about $800 per credit. Mealplan costs don't vary as much as the mealplans themselves vary. Am enjoying being here There are some of the most wonderful people I've met at Geneva! Unfortunately, aside from just haning out, there's not much to do except go to walmart. Am learning a lot The professors are all so nice and caring. They are very easy to get to know personally, thanks to small class size. Login to rate or flag the reviews Stephanie 01/06/2010 Reviewer is A current student here. 8 out of 8 people found this review useful. 3 of 29 Categories Comments Great for these types of students Geneva College is great for any student who wants to attend a small, Christian",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}