{
    "relation": [
        [
            "Model",
            "2ACK-1/8",
            "2ACK-1/4"
        ],
        [
            "Port (NPT)",
            "1/8\"",
            "1/4\""
        ],
        [
            "Flow Rate (Cv)",
            "0.23 Cv",
            "0.23 Cv"
        ],
        [
            "Orifice Size (mm)",
            "2",
            "2"
        ],
        [
            "Length",
            "30",
            "30"
        ],
        [
            "Width",
            "22",
            "22"
        ],
        [
            "Height",
            "66",
            "66"
        ]
    ],
    "pageTitle": "1/4\" Inch NPT 2 Way Normally Closed Pneumatic Aluminum Solenoid Air Valve 220VAC | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/1-4-Inch-NPT-2-Way-Normally-Closed-Pneumatic-Aluminum-Solenoid-Air-Valve-220VAC-/110917995534?pt=Pneumatic_Hydraulic_Valves_Parts&hash=item19d33a4c0e",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00040-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 430313667,
    "recordOffset": 430261960,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Brand New WIC Valve 2ACK Series 1/4\" Inch NPT 2 Way Normally Closed Pneumatic Anodized Aluminum Electric Air, Water Solenoid Valve 220/240V AC Zero Differential Valve (Grommet Coil with 12\" Lead Wire)   WIC Valve 2ACK series 2-way normally closed solenoid valve is to control On/Off of air and inert gas. This solenoid valve has one 1/4\" inch NPT inlet and one 1/4\" inch NPT outlet port. Valve stays close when the coil is de-energized, and it opens when energized. This valve has two holes in the bottom and can be mounted in any position.  2ACK Series solenoid valve comes with a ED 100% coil which suitable to operate in continuous service and constant energized. 2ACK Series valve is a Zero differential solenoid valve which can be operated at 0 PSI (Vacuum). WIC Valve is compatible with SMC and Parker.   2ACK Series Solenoid Valve Specification: Model Number: 2ACK-1/4-220VAC-G Valve Type: 2 Way Normally Closed (Valve opens with energized) Service Media: Air, Gas, Liquid, Water Operation Model: Direct Acting Flow Model: Uni-Directional Flow Rate: 0.23Cv (Fluid Flow), 22 SCFM at 100 PSI (Air Flow) Response Time: Less than 20 ms Body Material: Anodized Aluminum Seal Material: NBR (Buna N) Armature Tube Material: Brass Plunger & Spring Material: Stainless Steel Coil Certification: CE Certification Coil Power: 6 - 6.5VA Coil Class: F Class IP 65 (CE Certification) Coil Duty: 100% ED (Continuous Duty) Operating Pressure: Vacuum to 115 PSI Operating Temperature:",
    "textAfterTable": "    Shipping Information: Shipping on this item is FREE within the United States . We ship to Alaska , Hawaii , Puerto Rico, Guam, Virgin Islands , APO/FPO. For domestic fitting orders, we ship via US Postal Service First Class Mail (transit time for delivery 2 - 5 business days), unless other shipping method is requested. For international orders, we ship via US Postal Service First Class Mail. (transit time for delivery 5 - 14 business days), unless other shipping method is requested.  International customers are responsible for all customs duties, taxes and tariffs. Order Tracking Info: Most orders are shipped within 1-2 business days. Delivery confirmation number will be emailed to you once your package has been shipped. Sales Tax:",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}