{
    "relation": [
        [
            "Timestamp",
            "2013-11-28",
            "2012-12-07",
            "2012-12-07"
        ],
        [
            "Action",
            "Added",
            "Added",
            "Added"
        ],
        [
            "Category",
            "RELATION",
            "RELATION",
            "RELATION"
        ],
        [
            "Detail",
            "is a GO:0044710 (single-organism metabolic process)",
            "is a GO:0097435 (fibril organization)",
            "is a GO:0019538 (protein metabolic process)"
        ]
    ],
    "pageTitle": "GO:1990000 amyloid fibril formation",
    "title": "",
    "url": "http://www.ebi.ac.uk/QuickGO/GTerm?id=GO:1990000",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00207-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 416446463,
    "recordOffset": 416424847,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{121359=Copyright (c) EMBL-EBI 2013 | EBI is an Outstation of the European Molecular Biology Laboratory | Privacy | Cookies | Terms of use, 121226=EMBL-EBI, Wellcome Trust Genome Campus, Hinxton, Cambridgeshire, CB10 1SD, UK +44 (0)1223 49 44 44}",
    "textBeforeTable": "icon for more details. Synonyms are alternative words or phrases closely related in meaning to the term name, with indication of the relationship between the name and synonym given by the synonym scope. Click on the Synonyms GO:1990000 Wiki Page GONUTS The generation of amyloid fibrils, insoluble fibrous protein aggregates exhibiting beta sheet structure, from proteins. An example of this is seen when human RIP1 and RIP3 kinases form a heterodimeric functional amyloid signaling complex (PMID:22817896). PMID:16533927 PMID:21148556 PMID:22817896 Definition Biological Process Ontology amyloid fibril formation Name GO:1990000 ID Term Information Dataset Web Services P06727 Term Basket",
    "textAfterTable": "Display Key ShowHide GO IDs ShowHide Term box width Term box height Slim colours ShowHide Show children ShowHide Image size limit (in megapixels) Note that setting the limit too high may result in images being generated slowly; it may even cause the browser to crash. The maximum limit is 20 megapixels. Child Terms This table lists all terms that are direct descendants (child terms) of GO:1990000: Term has no children Protein Annotation Display ID Mapping",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}