{
    "relation": [
        [
            "Patent application number",
            "20080228352",
            "20090216403",
            "20100030425",
            "20110093239"
        ],
        [
            "Description",
            "VEHICLE SUSPENSION SYSTEM AND METHOD OF OPERATING SAME - A suspension system for use on a vehicle having two or more rear axles. The suspension system includes a plurality of gas springs and plurality of height sensors capable of outputting signals having a relation to distances between the respective ends of the respective first and second rear axles and the sprung mass of the vehicle. A control system adapted to selectively inflate or deflate respective ones of the plurality of gas springs to thereby adjust a leveled orientation of the sprung mass. The control system includes a controller that is adapted to determine a rear axle vertical offset and a rear axle articulation offset. The controller is adapted to determine whether conditions are appropriate for adjusting the suspension system by comparing the rear axle vertical offset and/or the rear axle articulation offset to a corresponding vertical offset threshold and/or an articulation offset threshold. A method is also included.",
            "VEHICLE CHASSIS HEIGHT ADJUSTMENT METHOD AND SYSTEM - A method and system for adjusting a relative leveled height of a sprung mass of a vehicle to an unsprung mass of the vehicle. The method also includes receiving an input from an operator for incrementally/decrementally changing the height of the sprung mass. A system for performing the method is also disclosed.",
            "METHOD AND SYSTEM FOR ALIGNING A VEHICLE WITH AN ARTIFICIAL HORIZON - A method and system for positioning a vehicle chassis in approximate alignment with a predetermined datum are provided. The vehicle includes a first longitudinal end adapted to be pivotally connected to a substantially fixed point and a second longitudinal end including at least one axle and an operatively associated two-corner fluid suspension system. According to the method, the fluid suspension system controls the alignment of the vehicle chassis to be aligned with an artificial horizon represented as the predetermined datum.",
            "VEHICLE WEIGHT SENSING METHODS AND SYSTEMS - Disclosed are vehicle weight sensing methods and systems. According to one aspect of this disclosure, provided is a method of characterizing a vehicle to determine gross axle weights by accessing a computer readable database which correlates a plurality of pressures associated with fluid suspension members incorporated into the vehicle."
        ],
        [
            "Published",
            "09-18-2008",
            "08-27-2009",
            "02-04-2010",
            "04-21-2011"
        ]
    ],
    "pageTitle": "Holbrook, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/holbrook-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00273-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 444126391,
    "recordOffset": 444089823,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Gregory A. Holbrook, Zionsville, IN US 09-18-2014 CENTRIFUGAL COMPRESSORS AND METHODS OF DESIGNING DIFFUSER VANES FOR THE SAME - Centrifugal compressors, methods of forming centrifugal compressors, and methods of designing diffuser vanes in centrifugal compressors are provided herein. In an embodiment, a method of designing diffuser vanes includes providing an initial two-dimensional diffuser vane layout including initial diffuser vane peripheries radially spaced about an axis. The initial diffuser vane peripheries are rotated using a computer processor to produce rotated diffuser vane peripheries having offset trailing ends relative to the initial diffuser vane peripheries. The rotated diffuser vane peripheries are circumferentially shifted about the axis to produce shifted diffuser vane peripheries. Leading ends of the shifted diffuser vane peripheries are offset from the leading ends of the initial diffuser vane peripheries. Diffuser vane surfaces are generated that connect the shifted diffuser vane peripheries to the corresponding initial diffuser vane peripheries to form diffuser vanes in a twisted configuration. 20140271170 Published Description Patent application number Greg Holbrook, Scottsdale, AZ US 09-18-2014 RESERVE CARD SYSTEM AND METHOD - A system, method and/or computer program product for enrolling in and/or issuing a transaction account with enhanced capabilities and improved functionality is disclosed herein. This new type of transaction account, a reserve transaction account, is disclosed herein. Similar to credit and/or charge transaction accounts, the reserve transaction account avails its users the ability to purchase now and pay for the",
    "textAfterTable": "Patent applications by Gregory A. Holbrook, Zionsville, IN US Hugh W. Holbrook, Palo Alto, CA US Patent application number Description Published 20090138692 Self describing line cards in network switch - A network switch device includes a switch chassis, a supervisor mounted in the switch chassis; and a line card mounted in the chassis. The line card has independently addressable line card hardware components, and a line card memory storing a software-readable description of the line card hardware components. The supervisor controller reads the software-readable description of the line card hardware components from the line card, and creates software drivers for the line card hardware components from the software-readable description of the line card hardware components. 05-28-2009 20120236723 Latency Analysis of Traffic Passing Through an Ethernet Switch - A method for accurately measuring, recording and reporting latency of an Ethernet switch is disclosed. Various packet queues in the switch are monitored at any given time and forwarding latency is calculated. Latency data from multiple switching elements in a network is collected to provide end-to-end forwarding latency of a system. 09-20-2012 20140108642 Efficient Reliable Distributed Flow-controlled Event Propagation - Improved utilization of connections that can",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}