{
    "relation": [
        [
            "Payment method",
            "",
            "Visa/MasterCard, Amex"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Australia Victoria Share Issue Form OF Renunciation Revenue NO 3278 ID R14009 | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/AUSTRALIA-VICTORIA-SHARE-ISSUE-FORM-RENUNCIATION-REVENUE-/390435019986?pt=LH_DefaultDomain_0&hash=item5ae7bd9cd2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00283-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 416400063,
    "recordOffset": 416346210,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details Return Policy Details: Satisfaction Guaranteed! Any lot may be returned within 14 days for full refund including shipping fees, if the item is incorrectly described. Return policy details The buyer is responsible for return shipping costs. Money Back 14 days after the buyer receives it Refund will be given as Item must be returned within Return policy receiving cleared payment - opens in a new window or tab. Will usually ship within 3 business days of Domestic handling time cleared",
    "textAfterTable": "Seller's payment instructions Seller ships worldwide. We accept PAYPAL, and all major Credit Cards (these can be sent over 2-3 emails or to our fax number +64 67598213). Sorry we do not accept personal cheques. Our postal address if required is Kadine Stamps, PO Box 3382, New Plymouth 4341, New Zealand. We can not take responsibility for items that go missing in the post, if not sent by Registered Mail. Your item will be sent 2/3 days after payment has been received and confirmed. time left Current bid amount + Shipping amount Bid Count",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}