{
    "relation": [
        [
            "Date Issued",
            "11-9",
            "11-10",
            "11-10",
            "11-13",
            "11-13",
            "11-13"
        ],
        [
            "Type of Case(1)",
            "OPP",
            "OPP",
            "OPP CANC",
            "EX",
            "OPP",
            "OPP"
        ],
        [
            "Proceeding or Appn. No.",
            "91183919",
            "91181958",
            "91171509 92045956",
            "77145880",
            "91174770",
            "91168033"
        ],
        [
            "Party or Parties",
            "Boucheron Holding v. Second Wind Consulting, Inc.",
            "KingPenn Industries, Inc. v. TopDown, Inc.",
            "Anthony’s Pizza & Pasta International, Inc. v. Anthony’s Pizza Holding Company, Inc.",
            "Advanced Pavement Technology Inc.",
            "ViaSat, Inc. v. Viewtech Incorporated",
            "UBS AG v. United Bankers’ Bank"
        ],
        [
            "Issue",
            "2(d), 2(a)",
            "2(d)",
            "2(d)",
            "2(e)(1)",
            "2(d)",
            "2(d)"
        ],
        [
            "TTAB Decision",
            "Opposition Sustained on Section 2(d) ground",
            "Opposition Sustained",
            "Opposition Sustained, Petition to Cancel Granted [Counter-claim dismissed]",
            "Refusal Affirmed",
            "Opposition Sustained (as to all three applications)",
            "Opposition Sustained (as to both classes)"
        ],
        [
            "Opposer's or Petitioner's Mark and Goods or Services",
            "\"JAIPUR\" [perfume, lotions, creams, balms, shampoos, deodorants, essential oils, soaps, make-up and cosmetics, tanning preparations, cosmetics kits comprised of various items]",
            "\"WIND RESTRICTOR\" [automobile wind screens]",
            "\"ANTHONY’S PIZZA & PASTA\" [restaurant services]",
            "",
            "\"VIASAT\" [Class 42: designing custom communication systems] \"VIASAT\" [Class 9: modems, receivers, radios, simulators and networks for satellite and terrestrial communication terminals]; \"VIASAT\" (stylized) [Class 9: networking hardware and software; modems, receivers, radios, antennas, simulators and networks for communication terminals] [Class 40: custom manufacture of networking hardware and software, communications equipment and systems] [Class 42: design, development and testing of networking hardware and software, communications equipment and systems]",
            "\"UBS\" [banking and financial services]"
        ],
        [
            "Applicant's or Respondent's Mark and Goods or Services",
            "\"JAIPUR\" (stylized) [in Class 3: an extensive listing of personal care, body and beauty products and preparations for cleansing, hygiene and cosmetic purposes]",
            "\"WIND RESTRICTOR\" [automobile windshields]",
            "Application: \"ANTHONY’S COAL-FIRED PIZZA\" (and design) Registration: \"ANTHONY’S COAL-FIRED PIZZA\" [Both for: restaurant services, namely eat-in and take-out coal oven pizza and other items]",
            "\"ECOLOGICAL PAVER SYSTEMS\" [paving contractor services]",
            "\"VS VIEWSAT\" (stylized), \"VIEWSAT\" and \"VIEWSAT LITE\" [three applications, all for: satellite receivers, namely integrated receiver /decoder set-top-boxes that receive only one-way direct-to-home free-to-air satellite television broadcasts and excluding two-way broadband satellite communications]",
            "\"UBB\" [Class 35: human resources advisory and management services for banks; business management and consulting services for banks] [Class 36: correspondent banking services, asset and liability management services for banks, securities brokerage services, investment portfolio advisory and management services, providing online information to community banks in the field of banking and finance, online banking services for community banks]"
        ],
        [
            "Mark and Goods Cited by Examining Attorney",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Issued as Precedent of TTAB",
            "No",
            "No",
            "Yes",
            "No",
            "No",
            "No"
        ]
    ],
    "pageTitle": "Patent and Trademark Office Notices",
    "title": "",
    "url": "http://www.uspto.gov/web/offices/com/sol/og/2009/week50/TOC.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00333-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 801284443,
    "recordOffset": 801194821,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{216288=This is the tenth annual report of TPAC. This report reviews the trademark operations of the USPTO for the FY ending September 30, 2009. TPAC\u0092s mission, which is specified in enabling legislation, 35 U.S.C. § 5(b)(1) and (d)(1), is \u0093to represent the interests of diverse users\u0094 of the USPTO and to \u0093review the policies, goals, performance, budget, and user fees\u0094 of the USPTO with respect to trademarks., 272467=Status. In June 2009, the Trademark Operation detailed a Managing Attorney to be the CIO\u0092s Acting Special Assistant for Trademarks. In addition, two Examining Attorneys were selected for limited work details with the OCIO. The work details will last for 90 to 120 days each and can be extended with the mutual agreement of both business units and the employees. The CIO has indicated he would like to have more Examining Attorneys assigned to such limited work details, and the senior managers of the Trademark Operation have agreed to try to identify suitable candidates. TPAC commends both business units for working together on this issue and hopes that, so long as circumstances warrant, more Examining Attorneys can be detailed to assist the OCIO., 217175=Members of TPAC. As of the end of FY 2009, the following individuals are members of TPAC:, 298986=Problem #1 – Appointment Timing. The beginning of this report listed the terms of the current TPAC members. There is no common date for the ending of terms. The dates fall at various times during the year – June, October and December. Two other members rotated off TPAC in August 2009. This creates problems. The PAC year is built around the federal fiscal year (which ends September 30) and the requirement that a PAC produce an annual report within 60 days after the end of each fiscal year. It creates hardship when PAC membership changes in the middle of a fiscal year or in the 60-day period immediately thereafter., 268186=Status. TPAC and the Trademark Operation agree that the TMEP should be updated more frequently. The Trademark Operation plans to publish an updated version of the TMEP before the end of 2009. Also, TPAC understands that the Trademark Operation aspires to update the TMEP much more frequently than in the past, as part of its technology development plans., 287068=Background. On August 31, 2009, the U.S. Court of Appeals for the Federal Circuit issued a decision in the appeal of the case entitled In re Bose Corporation, 2009 U.S. App. LEXIS 19658; 91 U.S.P.Q.2d 1938 (Fed. Cir. 2009)., 269981=Status. Since assuming his position in late FY 2008, the CIO, John Owens II, has stressed several times to the senior managers of the Trademark Operation his desire to receive detailed input on how the current trademark IT can be improved. He has also repeatedly indicated his willingness to take in and train qualified trademark personnel for specified periods (see below). More recently, he has solicited recommendations from the Trademark Operation (and the public – see below) with respect to what current or additional IT features and functionality should be included in TSNG. The Commissioner for Trademarks has responded by increasing the Trademark Operation\u0092s input to OCIO and by detailing a managing attorney and selected Examining Attorneys to support OCIO for specific periods. Both the Commissioner for Trademarks and the CIO have indicated they are pleased by the increased level of communications between the Trademark Operation and OCIO. TPAC believes that, although there is still room for improvement in this area, particularly with regard to communications from the Trademark Operation to OCIO, communications between the two organizations improved in FY 2009. TPAC commends both OCIO and the Trademark Operation for that improvement and encourages both organizations to strive for further improvement in communicating with and cooperating with one another., 243717=Nevertheless, previous leadership of the USPTO pushed for and secured a new statute temporarily abrogating the Trademark Fence. While the previous leadership of the USPTO may have had good intentions, TPAC feels it mishandled this situation. It believes there were better alternatives to address the financial distress of the Patent Operation. TPAC feels the previous leadership\u0092s failure to pursue those other alternatives vigorously and earlier led to a situation where there was not sufficient time to deploy any option other than breaching the Trademark Fence. Previous USPTO leadership knew of the financial distress facing the Patent Operation in late 2008 but allowed it to unfold well into 2009 before taking action to secure additional funding resources for the Patent Operation., 266491=The USPTO website contains a link to the TMEP and also contains a link to \u0093Trademark Examination Guides, Notes and Announcements.\u0094 The Trademark Operation generally issues two to four Trademark Examination Guides each year. At present, the oldest Trademark Examination Guide, 2-07, dates back to November 2007. The TMEP itself was last published on September 30, 2007. At present there are seven Trademark Examination Guides posted on the USPTO website. Not all trademark owners and practitioners know to check the Trademark Examination Guides to see whether it changes or supplements the TMEP regarding a particular issue. Also, doing so in addition to checking the TMEP is a hassle., 250048=Explanation. One of the most significant new projects launched in FY 2009 was a review of existing trademark fees, spearheaded by the OCFO. In October 2008, TPAC requested the study, which is also required by the Office of Management and Budget (\u0093OMB\u0094), to determine the primary and secondary costs of trademark filing and maintenance and to determine if any fee adjustments should be made. The executive level kickoff for the study took place in January 2009 with the formal cost study team kickoff following in March. The team consisted of senior members of both the Trademark Operation and the OCFO., 262061=Status. On August 14, 2009, the Director of the USPTO instructed the CIO to separate the trademark information technology (\u0093IT\u0094) infrastructure from the rest of the USPTO IT infrastructure and to completely update the trademark IT to produce TSNG. (The rest of the USPTO\u0092s August 2008 \u0093OCIO Road Map and Transformation Plan\u0094 Road Map remains intact.) Part of updating the trademark IT will consist of moving to \u0093cloud computing,\u0094 which the United States National Standards for Information Technology has defined as \u0093a model for enabling convenient, on-demand network access to a shared pool of configurable resources (for example, networks, servers, storage, applications, and services) that can be rapidly provisioned and released with minimal management effort or service provider interaction.\u0094 Basing TSNG on cloud computing will make the USPTO a leader among federal agencies with respect to embracing this new technology., 248710=Explanation. Not surprisingly given the economic climate, trademark fee collections were down in FY 2009, although the downward trend leveled off in the fourth quarter. Nonetheless, in part due to increased efficiencies and cost savings by the Trademark Office, there was a surplus in excess of $75 million at the end of FY 2008. Even with an expected growth of only 0.6% in new filings in FY 2010, a further surplus is anticipated for next year., 265014=Status. On September 15, 2009, the Trademark Operation issued the first of the new paper registration certificates – ones that are single page and prepared in-house. The same week the Trademark Operation began e-mailing Notices of Publication to trademark applicants who have agreed to receive e-mail communications from the USPTO. The Trademark Operation estimates it will achieve a savings of $600,000 per year by transitioning completely to electronic records of registration and an additional savings (not yet quantified) by sending out some Notices of Publication by e-mail instead of postal mail. TPAC commends the Trademark Operation for these practical and beneficial initiatives., 279466=New filings are down compared to FY 2008: new appeals are down 13.5%, new oppositions are down 21.4%, and new cancellation proceedings are down 15.5%. The number of cases maturing in FY 2009 for a final decision on the merits was virtually the same as FY 2008. The number of final decisions issued in FY 2009 decreased by 11.9% due to the assignment of half of the TTAB\u0092s judges to work on revisions to the Trademark Board Manual of Procedure (\u0093TBMP,\u0094 discussed below). In addition, the number of decisions on contested motions decreased slightly (by 1.5%) due to the assignment of interlocutory attorneys to work on TBMP revisions., 249252=Status. According to very preliminary numbers from the OCFO, the Trademark Operation surplus is projected to grow to $88 million by the end of FY 2010. Part of this surplus growth results from cost-savings measures implemented USPTO-wide to address the financial crunch in the Patent Operation, which measures resulted in some foregone spending in the Trademark Operation., 242073=The Patent Operation came into dire financial straits at the end of 2008 and remains in that status. TPAC will not comment on the reasons for that financial distress because doing so is not within TPAC\u0092s purview. Yet, TPAC notes that, during the current recession, trademark filings are down more than patent filings, yet the Trademark Operation has been able to increase its small surplus while the Patent Operation\u0092s financial situation has worsened. At the least, this demonstrates the prudent management of the Trademark Operation., 246064=TPAC is told by the OCFO that it believes no borrowing will occur based upon present economic forecasts and the USPTO\u0092s extensive cost cutting. That is good. Nevertheless, borrowing could still occur. That depends on how long and deep the recession is. TPAC hopes the USPTO has economically modeled various economic forecasts from best case to worst case and has planned for the worst case. If the worst case should come to pass and borrowing must occur, TPAC hopes the USPTO has determined how much of the Trademark Operation\u0092s surplus should be withheld from borrowing to prevent the reasonable possibility of any furloughs or RIF\u0092s in the Trademark Operation between the time of borrowing and the time by which the loan would have to be repaid (September 30, 2014). In a worst case there may not be enough of a Trademark Operation surplus to prevent furloughs and RIF's in both the Patent Operation and Trademark Operation. In such a tradeoff, the Trademark Operation should be protected first because the surplus consists of trademark fees. Of course, TPAC hopes this situation never arises., 254667=Explanation. During most of FY 2009, nearly all trademark-related transactions could be performed electronically. However, there were still a few that required paper processing – for example, submitting a request to divide an application. The shared goal of the Trademark Operation and the trademark community is to enable trademark owners to perform all trademark-related transactions online, thereby increasing the speed and efficiency of the transactions as well as lowering the cost of performing them. For example, applications that are filed electronically are processed and disposed of more quickly than paper-filed applications: 9.3 months for TEAS Plus applications and 11.7 months for TEAS applications as compared to 13.9 months for paper-filed applications (in each instance excluding suspended and inter partes cases)., 241366=All fees available to the Director under section 31 of the Trademark Act of 1946 shall be used only for the processing of trademark registrations and for other activities, services, and materials relating to trademarks and to cover a proportionate share of the administrative costs of the Patent and Trademark Office., 290817=Status. The TTAB anticipates completion, approval and posting of the revised TBMP on the USPTO website in FY 2010. When the TBMP text is completed and approved, it will be posted in HTML. It is unclear how often the TBMP will be updated in the future. TPAC has reiterated the importance of frequent future updates to the TTAB. TPAC will continue to work with the TTAB regarding the three goals stated above., 238200=Status. The Office began issuing the new certificates in September 2009., 256619=On September 12, 2009, the USPTO introduced a new \u0093global trademark form,\u0094 which permits virtually all trademark documents to be filed electronically. TEAS now encompasses 50 domestic forms, 25 of which require all information to be entered into structured data fields and another 25 of which use the global-form approach wherein information is entered as free-text or .jpg/.pdf attachments. TEAS also includes three forms for making international filings under the Madrid Protocol., 278896=The average total pendency from filing to decision of \u0093Trial Cases\u0094 (litigations of opposition petitions and petitions to cancel) rose from 171 weeks in FY 2008 to 192 weeks in FY 2009. Average total pendency is affected by parties\u0092 decisions to suspend cases, and extend deadlines. However, this increase is not of concern because (a) virtually all trial cases decided on the merits in FY 2009 were decided within three months of the time they became ready for final decision and (b) median pendency for trial cases remained the same at 150 weeks., 290396=The TTAB has not updated the TBMP since significant rules changes were made two years ago. In FY 2009, the TTAB made major progress on a TBMP update. The TTAB assigned a significant number of judges and interlocutory attorneys to update the TBMP, resulting in the expenditure of 3,500 hours of staff time in FY 2009 on this project., 371193=U.S. Patent and Trademark Office Information Products Division MDW - 4C18 P.O. Box 1450 Alexandria, VA 22313-1450 (571) 272-5600 or email at IPD@uspto.gov, 301274=Have all TPAC terms run from December 1 to November 30, to line things up with the annual report duty., 252888=Explanation. The financial data and analysis supplied by the USPTO for FY 2009 showed a commitment to both proper internal accounting for trademark user fees and responsible expenditure of those fees by business units outside of the Trademark Operation. TPAC appreciated the periodic reporting from the USPTO that confirmed this positive trend., 252004=Status. TPAC will review and discuss results of the fee study when they become available. Also, once the recession ends and it becomes clear trademark funds will not be tapped to fund the Patent Operation, this fee study may create a basis for possible realignment of trademark fees and/or reductions in some trademark fees. TPAC will discuss any available results of the study at its public meeting in November 2009 and thereafter., 263002=The CIO estimates this work will take two to three years, with most of it being completed within 12 to 18 months. Reasons for developing TSNG include: (i) to work at peak efficiency, trademark IT needs to be wholly separate from patent IT; (ii) the Trademark Operation has money to upgrade its IT; and (iii) the Trademark Operation has a largely developed, detailed plan for what it wants to do with respect to IT. With respect to the desktop/laptop configuration issue, the OCIO plans to adopt six to eight standard desktop and laptop configurations. If adequate funding is available, the OCIO believes it can implement those configurations by the end of FY 2010., 299936=Possible Solution. It would be better if TPAC members were appointed to terms that coincide with the calendar year due to the statutory requirement that TPAC produce an annual report to the President, the Secretary of Commerce and Congress. 35 U.S.C. § 35(d)(2) requires that this report be submitted within 60 days of the end of the federal fiscal year. That means the report is due by November 29 each year. The report needs to be written by TPAC members who were on TPAC for the prior federal fiscal year. Not much happens on TPAC for the rest of the calendar year after preparation of the annual report due to the hard work it takes to produce it and due to the December holiday season. Thus, it makes sense for turnover to occur at or near the end of the year. Here, there are two options:, 287313=The TTAB had found Bose committed fraud on the USPTO in renewing a trademark registration for the mark WAVE. In a de novo review of the TTAB\u0092s legal conclusions, the Court found that, because there was no substantial evidence that Bose intended to deceive the USPTO in the renewal process, the case should be reversed and remanded. The Federal Circuit specifically addressed the TTAB\u0092s prior ruling in Medinol v. Neuro Vasx, Inc., in which the TTAB found the proper inquiry for a finding a registration was obtained fraudulently is \u0093not into the registrant\u0092s subjective intent, but rather into the objective manifestations of that intent.\u0094 67 U.S.P.Q.2d 1205, 1209 (TTAB 2003). While the Federal Circuit agreed with the test, it disagreed with the Board\u0092s holding that a \u0093trademark applicant commits fraud in procuring a registration when it makes material representations of fact in its declaration which it knows or should know to be false or misleading.\u0094 Id. (emphasis added). The Court found the Board had erroneously lowered the fraud standard in Medinol to a simple negligence standard. The Court found that, to prove fraud, the proponent must prove a willful intent to deceive, and prove it by clear and convincing evidence., 275062=Explanation. Because of the legacy problems with the trademark IT, TEAS is sometimes unavailable during periods of high demand – for example, between noon Eastern Time (9:00 a.m. Pacific Time) and 8:00 p.m. Eastern Time (5:00 p.m. Pacific Time). To reduce public frustration during such situations, OCIO was asked to post a warning message on the USPTO\u0092s website. In the time since this request, TPAC members have encountered TEAS unavailability infrequently at most., 251385=Phase two of the study involved interviews with relevant business personnel and further allocation of trademark costs. The revised costing model was completed in September. Phase three of the study covers validation of the results and is expected to be completed by December 2009., 271847=Explanation. Because of the significant decrease in the number of trademark applications, the corps of Examining Attorneys had a smaller volume of work than was expected for FY 2009. On the other hand, the OCIO had 92 employee vacancies as of August 28, 2009. The CIO indicated throughout FY 2009 that he was willing to take in and train qualified trademark personnel for specified periods, which would provide work for potentially underutilized Examining Attorneys during the recession and provide much-needed help to OCIO., 215260=TPAC dedicates this report to Jeffery W. Storie, who was a member of TPAC until his death on November 8, 2009. We always will remember Jeff for his kindness, humility, faith and wonderful sense of humor, in addition to his strong contributions to TPAC. We miss him greatly. We send our prayers and thoughts to him and his family., 236972=Explanation. On its own initiative, the USPTO reformatted paper trademark registration certificates in FY 2009. There are four major changes: (i) the certificates are now printed on standard-sized 8½- by 11-inch paper, (ii) the folder has been eliminated, (iii) the director\u0092s signature and USPTO seal now appear on the first page, and (iv) the registration maintenance information now appears on the final page., 328201=SUMMARY OF FINAL DECISIONS ISSUED BY THE TRADEMARK TRIAL AND APPEAL BOARD November 9-13, 2009, 261361=Explanation. As the CIO has briefed TPAC at each TPAC meeting in FY 2009, for several historical reasons the USPTO\u0092s computer infrastructure is largely out-of-date, inefficient, undocumented, and potentially unstable. One example is that because the USPTO has not required its employees to use standard desktop or laptop computer configurations, very few of the USPTO\u0092s thousands of desktops and laptops share exactly the same configuration. The USPTO recognizes it can save considerable maintenance time and money by adopting a few standard configurations and requiring all of its employees to use them., 256087=Status. The percentage of applications filed electronically continues to rise, increasing from 96 percent in FY 2008 to almost 98 percent in FY 2009. This year the Trademark Operation developed a new measure to identify the degree to which it is able to receive, process, examine, and dispose of applications in a completely electronic environment. Through June 2009, 62.3 percent of office disposals (registrations and abandonments) were electronically filed and processed, exceeding the annual target of 62 percent.}",
    "lastModified": "Thu, 10 Dec 2009 15:36:34 GMT",
    "textBeforeTable": "SUMMARY OF FINAL DECISIONS ISSUED BY THE TRADEMARK TRIAL AND APPEAL BOARD November 9-13, 2009     Summary of Final Decisions Issued by the Trademark Trial and Appeal Board        Print This Notice 1349 OG 257  US PATENT AND TRADEMARK OFFICE  Top of Notices December 15, 2009                7,410,773 7,548,203 7,585,518 RE. 40,92 7,407,955 7,547,721 7,585,504 RE. 40,59 7,406,413 7,547,534 7,585,122 D. 601,90 7,402,177 7,546,376 7,584,870 D. 601,80 7,401,369 7,546,346 7,584,462 D. 601,61 7,397,398 7,545,858 7,583,844 D. 601,35 7,396,092 7,545,799 7,583,772 D. 601,29 7,393,543 7,545,765 7,583,758 D. 600,98 7,391,563 7,545,004 7,583,633 D. 600,59 7,390,821 7,544,768 7,583,609 D. 599,95 7,390,484 7,544,661 7,583,590 D. 599,68 7,386,147 7,544,467 7,583,564 D. 597,34 7,384,786 7,544,190 7,583,551 D. 597,22 7,384,747 7,544,105 7,583,393 D. 597,22 7,381,424 7,543,446 7,582,805 D. 596,05 7,376,837 7,543,338 7,582,665 D. 594,99 7,373,432 7,542,873 7,582,661 D. 592,80 7,373,199 7,542,809 7,582,149 D. 582,84 7,371,240 7,542,802 7,582,037 D. 555,90 7,370,610 7,542,566 7,582,035 D. 547,95 7,367,509 7,542,193 7,581,881 7,606,868 7,367,499 7,541,802 7,581,777 7,606,798 7,367,141 7,541,723 7,581,680 7,606,158    1349 OG 256  US PATENT AND TRADEMARK OFFICE  December 15, 2009",
    "textAfterTable": "(1) EX=Ex Parte Appeal; OPP=Opposition; CANC=Cancellation; CU=Concurrent Use; (SJ)=Summary Judgment; (MD)=Motion to Dismiss; (MR)=Motion to Reopen; (R)=Request for Reconsideration (2) *=Opinion Writer; (D)=Dissenting Panel Member      Top of Notices December 15, 2009 US PATENT AND TRADEMARK OFFICE Print Appendix 1349 OG  Mailing and Hand Carry Addresses for Mail to the United States Patent and Trademark Office  MAILING AND HAND CARRY ADDRESSES FOR MAIL TO THE UNITED STATES PATENT AND TRADEMARK OFFICE MAIL TO BE DIRECTED TO THE COMMISSIONER FOR PATENTS For most correspondence (e.g., new patent applications) no mail stop is required because the processing of the correspondence is routine. If NO mail stop is included on the list below, no mail stop is required for the correspondence. See the listing under \"Special Mail Stops Applicable To Both Patent And Trademark Mail\" for additional mail stops for patent-related correspondence. Only the specified type of document should be placed in an envelope addressed to one of these special mail stops. If any documents other than the specified type identified for each special mail stop are addressed to that mail stop, they will be significantly delayed in reaching the appropriate",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}