{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Really safe campus, I always walk my girlfriend home at night time, but just because I wouldn't be able to live with myself if something did happen.",
            "lots of clubs and activities going on all the time just have to find the one that suites you!",
            "all kinds, especially engineering student!",
            "lots of great art work around campus to check out, and the mountains all around are just amazing!",
            "Really good price for a great school, only complaint is how much it cost for room and board, but only have to live on campus yours first year, so not too bad.",
            "hit the slopes, go to the rec. center on campus (bowling, billiards, other games), go to the movies, have dances a lot, and get late night bites with friends!",
            "Dining hall food is dining hall food, but there is an amulet bar every morning in Miller dining hall that is extremely delicious, they make amulets, and eggs to order every morning. Lunch and dinner are average i would say.",
            "Well the dorm life isn't bad, mostly quiet at nights, and enough room to live comfortably, but the beds are rough and bathrooms are average. The laundry room is in the basement in my dorm (North) which is really nice, but sometimes all the machines are full, so if there were some more put in that would be nice.",
            "I probably didn't study as much as i should have, but there is definitely challenging work ahead, and my first semester wasn't a walk in the park..",
            "Apply for housing EARLY! I live in North and its a little dated, but is connected to dining hall which is really nice during the winter. It does get pretty cold in Bozeman, so bring plenty of warm clothing for winter time, recommend snowboarding or skiing the slopes are great, and my favorite place to eat is the garage, they have great burgers, pulled pork sandwiches, soups, and aren't very expensive! Great place for a casual date or to go with friends if your getting tired of the dinning hall food! Kathy makes the best amulets in miller for breakfast, so i recommend North, or South Hedges if you want a great breakfast everyday!",
            "Beautiful, beautiful campus, the foot ball field is awesome, GO CATS! Lots of really nice people, dorms are a little small but very livable, they gym is high caliber! Overall been a great experience for me!"
        ]
    ],
    "pageTitle": "Montana State University (MSU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Montana-State-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00004-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894961275,
    "recordOffset": 894850210,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{540225=The annual Undie Run. Students run a 5k race in their underwear every November., 58963=They start placing people into the residence halls as soon as March so sign up early for housing in order to get the placement you want. Make sure to ask questions because everyone is willing to answer but they won't really double check to make sure everyone is doing fine. Talk to your professors., 619847=© 2015, Cappex.com, LLC, 585210=If you love to ski/snowboard, and I mean REALLY love the snow, MSU is the place for you. In my first year here, there has been snow cover since november with temps in the -20s. Great, friendly people, and a great atmosphere for learning with lots of outlets for help in every class., 153188=Bring warm clothes! It's a lot colder starting in September than I would have imagined., 512599=If you like the outdoors, MSU is the place for you! Almost every one here rides a bike, skateboards, hikes, skis, snowboards, or all of the above! Also, MSU has a great engineering program, ranking very high in the US. There will also be a new business college in 2015 that focuses especially on those looking into entrepreneurship!, 543495=Get a good winter coat. Bozeman is sunny and beautiful all through september and most of october but after that the temperature drops rapidly, the snow flies, and the skiers come out of hibernation, 217645=There is an undies run in September where everyone goes running in their underwear even when it's snowing., 11810=If you are looking for great research or internship opportunities this is the place to be. Montana State is within the Nation's top tier for this! If you are a minority this would be a great place to go if interesting in the hard sciences, math, engineering, etc. But I would also like to add that with the past few years MSU lost about 9 million in funding. This is significant because programs across campus have been cut completely, some altered(budget cuts), some merged into other programs, and some may lose all funding in 2012., 28884=No doubt, I am learning a ton! The vacations are longer: Winter break is 17-Jan11 and summer starts May 5. Despite these relatively short semesters, the professors pile on the homework and I think that they truly care about theit students.}",
    "textBeforeTable": "09/16/2009 Reviewer is A current student here. 25 out of 26 people found this review useful. 1 of 138 Margaret from Bozeman, MT Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Am enjoying being here I love living in Bozeman. It's a great town and the campus is lovely, and it's really easy to find fun things to do. There's a lot of outdoor activities and fun places to explore and new things to try, and most people are very friendly. Am learning a lot My classes here are amazing. Most professors are really flexible with office hours and love to have students stop by, which is so great. They are such good resources to take advantage of. They also push you to your limits and make you really think about what you know and what you're learning, which makes it that much better. Login to rate or flag the reviews Ashley from Sioux Falls, SD 01/06/2010 Reviewer is A current student here. 6 out of 8 people found this review useful. 3 of 138 Categories Comments Great for these types of students Any and all don't be afraid to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}