{
    "relation": [
        [
            "Name",
            "Ontario Sneed, Cent. Mich.",
            "Felix Jones, Arkansas",
            "Jamaal Charles, Texas",
            "Keegan Herring, Ariz. State",
            "Shonn Greene, Iowa",
            "Tyrell Sutton, Northwestern",
            "James Davis, Clemson"
        ],
        [
            "Opener",
            "14-148-1",
            "8-137-1",
            "14-135-1",
            "12-134-1",
            "18-116-1",
            "17-104-2",
            "19-101-0"
        ],
        [
            "Rivals Rank",
            "Unranked",
            "No. 19 athlete",
            "No. 7 running back",
            "No.7 all-purpose back",
            "3-star",
            "No. 41 running back",
            "No. 6 running back"
        ]
    ],
    "pageTitle": "HuskerOnline.com - Freshmen backs excel on opening weekend",
    "title": "",
    "url": "https://nebraska.rivals.com/content.asp?CID=452306",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00246-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 869502927,
    "recordOffset": 869484763,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1928=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 HuskerOnline.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{40054=September 8, 2005}",
    "textBeforeTable": "Seven true freshmen topped the 100-yard rushing mark in the first week of the college football season: 'Fresh' approach Keegan Herring of Arizona State did most of his damage in the second half against Temple, putting up 134 yards and a touchdown on just 12 carries. Still, 148 yards is nothing to Sneed at. That's what Central Michigan's Ontario Sneed posted on only 14 carries in a 20-13 loss to Big Ten opponent Indiana. It was the biggest output by any of the freshmen. Sneed scored on an 80-yard run to pull his team to 14-13 just 12 seconds into the fourth quarter, but the Chippewas couldn't pull off the upset. Neither did the rest of the Precocious Seven, though none did it against a top 25 team like Davis did. \"But I did well, and the coaches said they could use me in there on the last couple of drives. That's something I didn't want to turn down.\" \"It came out of the blue for me,\" Davis told Rivals.com. \"I never thought I'd get that many carries in my first game, maybe six or seven. Clemson's James Davis left Texas A&M crying. Without his running, a performance that earned him Rivals.com",
    "textAfterTable": "\"The offensive line was working well and we were clicking together,\" Herring told Rivals. \"I just had to get through the holes.\" While Sneed and Davis were posting 100 for underdog teams, Herring and the other four freshmen to top the century mark did so in games in which their teams were on the positive side of lopsided victories. That by no means diminishes their accomplishment, but rather points out that the road to stardom won't always seem quite so smoothly paved. There will be potholes. It was easy to avoid them against Missouri State (Arkansas' Felix Jones had 137 yards) and Louisiana Lafayette (Jamaal Charles gained 135 yards); it will be less so this weekend for Herring (against No. 5 LSU) and Charles (at No. 6 Ohio State). Not to mention defenses that had no clue who these guys were before the season openers now will see their jersey numbers flickering across the screen in their film rooms. These freshmen went from off the radar to primary targets. The Next Seven Rivals.com believes these will be the next seven freshmen to top the 100-yard rushing mark this season: Name Rivals Rank Opener",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}