{
    "relation": [
        [
            "RPM:",
            "2,500",
            "2,700",
            "2,900",
            "3,100",
            "3,300",
            "3,500",
            "3,700",
            "3,900",
            "4,100",
            "4,300",
            "4,500",
            "4,700",
            "4,900",
            "5,100",
            "5,200",
            "5,300",
            "5,500",
            "5,700",
            "5,900",
            "6,100",
            "6,300",
            "6,500"
        ],
        [
            "TQ:",
            "470",
            "499",
            "512",
            "503",
            "511",
            "523",
            "532",
            "542",
            "554",
            "562",
            "570",
            "582",
            "595",
            "603",
            "604",
            "603",
            "601",
            "595",
            "587",
            "577",
            "563",
            "542"
        ],
        [
            "HP:",
            "224",
            "256",
            "283",
            "297",
            "321",
            "348",
            "375",
            "403",
            "432",
            "461",
            "489",
            "521",
            "555",
            "586",
            "598",
            "609",
            "630",
            "646",
            "659",
            "670",
            "675",
            "671"
        ]
    ],
    "pageTitle": "AMSOIL Engine Masters Challenge - Popular Hot Rodding Magazine",
    "title": "",
    "url": "http://www.hotrod.com/events/coverage/1302phr-amsoil-engine-masters-challenge/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00204-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 505076427,
    "recordOffset": 505028912,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{44388=Our 2012 Xtreme Street Winner School of Automotive Machinists (SAM) Houston, TX 402ci Chevy SB2, 334751=1744 Hartzler Road, 41247=It wasn't, however, just a matter of flinging open the doors and letting in all comers. Our competitors were chosen based on the merits of their applications, variety, and prior performance. To make things more interesting, we created two classes: Street and Xtreme Street. Street class entries consisted of engines that have 300 ci or higher, 10.5:1 compression or lower, cast dual-plane intake, carb size limited to a single 4150-style carb (or fuel injection), any commercially available cylinder heads with intake ports compatible with the stock location, hydraulic roller cam, and a test range from 2,500 to 6,500 rpm. Street class engines run on VP Racing VP100 unleaded fuel. Xtreme Street is for more radical engines 400 ci and up with unlimited compression, race-style cylinder heads, multiple carburetion (or fuel injection), cast single-plane intake, solid roller cam, and a test range of 4,000-8,000 rpm. Xtreme Street engines run on VP Q16 fuel., 43579=Are you an engine builder who wants to be a part of the AMSOIL Engine Masters Challenge, but don't know how to get involved? We would really love to have you. We're always looking for new engines, new builders, and new ideas. We're looking for pros and amateurs alike, and we need all kinds of engines from basic old-school street-style small-blocks, to crazy high-tech monsters. We'll have all the specifics for the 2013 AMSOIL Engine Masters Challenge at PopularHotRodding.com, and our competition announcement in the Mar. '13 issue of PHR, so keep a sharp eye out. In the meantime, let the motorific mayhem begin!, 150643=Our 2012 Street Winner Bradley Built Engines Laurel, IN 417ci Gen III Chrysler Hemi}",
    "textBeforeTable": "3/34 Our 2012 Xtreme Street Winner School of Automotive Machinists (SAM) Houston, TX 402ci Chevy SB2 Xtreme Street Division Are you an engine builder who wants to be a part of the AMSOIL Engine Masters Challenge, but don't know how to get involved? We would really love to have you. We're always looking for new engines, new builders, and new ideas. We're looking for pros and amateurs alike, and we need all kinds of engines from basic old-school street-style small-blocks, to crazy high-tech monsters. We'll have all the specifics for the 2013 AMSOIL Engine Masters Challenge at PopularHotRodding.com, and our competition announcement in the Mar. '13 issue of PHR, so keep a sharp eye out. In the meantime, let the motorific mayhem begin! You'll also be happy to know that out of this year's field of AMSOIL Engine Masters competitors, we selected nine of them to be featured in more detail in the coming months. Look for more on the School of Automotive Machinists' (SAM) SB2, Mike Phillips' Buick, Brad Wise's Oldsmobile, Bret Bowers' LS, the SKMFX Mopar Magnum small-block, Clark Hinkle's Mopar Wedge, Chris Henderson's small-block Chevy, Ray Clayton's Pontiac, and Todd Miller's Ford Boss Hemi. (Hint: If you're an engine lover, now's the time to",
    "textAfterTable": "Wires: MSD Performance Fasteners: ARP Flywheel: PRW Engine damper: ATI Water pump: Meziere Headers: SAM custom Valve covers: Mickey Williams Hose & fittings: Aeroquip AMSOIL oil viscosity: 5w20 Oil pump: Schumann Oil pan: Mickey Williams Mufflers: Flowmaster Fuel: VP Fuels Q16 On The Dyno Best Qualifying Pull RPM: TQ: HP: 4,000 671 404 4,200 555 444 4,400 567 475 4,600 600 526 4,800 624 570 5,000 638 608 5,200 648 642 5,400 650 669 5,600 653 696 5,800 659 728 6,000 664 758 6,200 664 784 6,400 660 804 6,600 651 818 6,800 641 830 7,000 634 846 7,200 622 853 7,400 604 850 7,600 584 846 7,800 564 838 8,000 546 831 Jon Kaase Racing Engines Winder, GA 537ci Big-Block Chevy 4/34 Qualifying score: 3,277",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}