{
    "relation": [
        [
            "Followers",
            "1+",
            "10+",
            "100+",
            "1,000+",
            "10,000+",
            "100,000+",
            "1,000,000+"
        ],
        [
            "Typical behaviour",
            "Very new, or dormant user",
            "Likely to be using the site for social purposes, has influence within a close circle of friends",
            "Connecting with a modest number of people, has influence amongst a wide circle of friends or industry colleagues",
            "Fairly well known within their industry, and likely to have influence well beyond those they know personally",
            "Very well known with their industry or niche; likely to have some off-line awareness",
            "Popular amongst a wide variety of users; likely to very influential and be widely 'retweeted'",
            "Amongst the top 200 users and very influential within the site; almost certainly a genuine off-line celebrity"
        ],
        [
            "Example User",
            "Example",
            "Example",
            "Example",
            "Example",
            "Example",
            "Example",
            "Example"
        ]
    ],
    "pageTitle": "SEO and Social Media Benchmarking - Moz",
    "title": "",
    "url": "https://moz.com/blog/seo-and-social-media-benchmarking",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00319-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 887458415,
    "recordOffset": 887421406,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{391=N.B.: The 'moz' metrics use data exposed by SEOMoz's Linkscape, and are on an exponential scale from 0 - 10. Data collected in 2006 suggested that the no visitor metric - Compete included - could be used to precisely estimate unique visitors to blogs at the time.}",
    "TableContextTimeStampAfterTable": "{36780=Exceptionally useful post Rob, particulary the Digg and Reddit benchmarks! You've saved us all a lot of time trying to find that perfect 2000 diggs example!, 54215=Nice post - as a UK agency, the first part isn't necessarily that useful, but the social media benchmark section will be one I'll definitely point a few Tamar clients towards. Thanks guys!, 55305=Nice post - as a UK agency, the first part isn't necessarily that useful, but the social media benchmark section will be one I'll definitely point a few Tamar clients towards. Thanks guys!, 49082=Thanks nice a blog post. It is true, you any topic post one social site and 1000 people follow this post., 37971=<p>Exceptionally useful post Rob, particulary the Digg and Reddit benchmarks! You&#39;ve saved us all a lot of time trying to find that perfect 2000 diggs example! </p><p>Bookmarked - I love the drop downs by the way - a technique worthy of a blog post all on its own! </p>, 50089=Thanks nice a blog post. It is true, you any topic post one social site and 1000 people follow this post., 156368=Copyright © 2015 SEOmoz, Inc. All Rights Reserved.}",
    "textBeforeTable": "Arts & Entertainment N.B.: The 'moz' metrics use data exposed by SEOMoz's Linkscape, and are on an exponential scale from 0 - 10. Data collected in 2006 suggested that the no visitor metric - Compete included - could be used to precisely estimate unique visitors to blogs at the time.   Unique Vistors: Compete.com's estimate of the number of monthly unique visitors to a site. Domain mozTrust: the trustworthiness of a website, based on links from trusted sites & pages, Domain mozRank: the strength of a website, based on the sites & pages that link to it, This section uses three particular metrics: Links and Traffic: Website Benchmarks This post should be useful to anyone who needs to orientate themselves around such numbers. The Website Benchmarks section shows metrics for around half a dozen sites from ten different niches (based on the list originally prepared for comparing SEOMoz Trifecta data.) This is followed by Social Media Benchmarks, to give an idea of the impact and influence of votes and people on three popular social websites. We'll often rattle off various metrics quite casually in conversation, but it's easy to forget that others (such as your clients!) might not know whether these are big numbers or small ones. For example: \"We've just published a guest post on a site with Domain mozTrust 5.67. Mr_Gadget mentioned it",
    "textAfterTable": "The Official Whitlams Website 4.77 4.95 822 EntertainmentTonight.org 2.87 3.01 401 Business Website DmR DmT Visitors Business.gov 6.87 7.37 185,142 Business.com 6.47 6.75 4,882,836 Prudential 6.40 6.86 1,028,829 Kansas Insurance Commissioner 5.71 6.18 8,826 WorldBiz.com 5.48 6.03 4,033 HRM Business Practices and Notes 3.89 4.11 114 Chevron Corporate Solutions 2.76 3.01 n/a Economy & Politics Website DmR DmT Visitors The White House 7.90 8.55 1,976,338 Barak Obama 6.93 7.38 1,180,883 The Democratic Party 6.49 7.01",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}