{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Fresno City College, takes safety seriously. They have there own campus police who are visible on campus. If you have a night class and request a escort then they can arrange to have someone meet you and walk you to your car. They are awesome!",
            "Yes, as I mentioned in Clubs and Activities, they do have an active Greek Life so you don't have to feel like you are missing out on the University opportunity. It is a wonderful way to meet people and have a great time with events and activities.",
            "If you want a club, you can find it a Fresno City College and if it doesn't exist then there is room to be a pioneer on campus and make a club that meets your needs. I was surprised to hear that they actually have sorority and fraternities. This is almost unheard of at other community colleges. Need I say more.",
            "For students who may still searching for what they want to do when they grow up, this is wonderful environment. Most faculty have an open door policy and are more than eager to provide advice or give you some connections of the right people to talk to. This is very unique, most college professors are not as open at other colleges/universities.",
            "One of my favorite locations is the beautiful library. The staff are very knowledgeable and helpful. Plus just look up and you can see these wonderful artistic ceilings. It makes you feel like you are studying in a tradition steeped university such as Oxford or Cambridge but for a tenth of the price.",
            "Fresno City College is the oldest of the Community Colleges and has a wonderful park-like setting with lots of trees, beautiful old buildings and charm. It is a very diverse campus with young to older students, from all socio-economic classes from several countries who practice diverse religious, political beliefs. In a way you are getting an education abroad bought home. What a great opportunity to expand your own knowledge about other cultures and learn an appreciation of what we have to be thankful for in America.",
            "Fresno City College has a very active student life component. On almost any given weekend you will find performances by the performing arts or music department and the best thing is that most of these are free or at a discounted price for students.",
            "I have eaten at both the cafeteria as well as the cafe located outside the bookstore and all the food is good. Sometimes a few items are a bit pricey but you are sure to find something good in your price range.",
            "Fresno City College is a commuter college so it does not have dorms.",
            "Fresno City College professors are top notch. Most of them have real jobs outside the college so they bring a new and broader meaning to what you are studying in the textbooks. I would give them an A+.",
            "Get to know the Academic Affairs side of education. For example, the counselors can be invaluable. They have both academic counselors to help with your academic planning. Fresno City College is one of the few Community Colleges to have personal counselors as well. These counselors are all Master-level and doctoral level trained therapists. They are helpful in helping you navigate a stressful time of your life like going to college, relationships issues, and much more.",
            "I would rate academic rigor as a 4+, I had a very good experience with my faculty members. Every now and then you may have one that is more into research or other activities than teaching but this is the exception. As for dorm life, Fresno City College does not have dorms but this does not mean it lacks a sense of unity among students. Their are more than enough opportunities to meet others in various activities and fun events the campus sponsors. They even have a Greek Life. I would rate this a 5/5. As for food and dining, it is easily accessible, quick and most college student can afford it, so I would rate it a 4/5."
        ]
    ],
    "pageTitle": "Fresno City College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Fresno-City-College/reviews?_escaped_fragment_=/show/91078",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00008-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901291023,
    "recordOffset": 901226016,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{324219=Love going to the movies when I can, enjoy trying new restaurants and small dining places to our Fresno area with friends and or family. And I try to get out to the local events. April is packed: being treated to Wicked for my birthday at the Saroyan Theater, last weekend Clovis hosted Big Hat Days, and soon we have Vintage Days at Fresno State, and the Clovis Rodeo at the end of the month. But lately with my higher pace with school, sometimes I just like to enjoy relaxing with my dogs and enjoying some reruns of Bones or Castle., 339956=© 2015, Cappex.com, LLC, 249998=October fest, people come to school in costumes... it's a little strange., 154156=Avoid the parking for the first three weeks of school and park in neighborhood street before 7:20. Just make sure the street allows parking. See a counselor often and sit in the front row of your classes., 69444=Study and really put the effort into your courses. It is school, after all. If necessary, have a weekly schedule to manage your time wisely and have an agenda to keep track of deadlines and important dates. Look into Transfer Day during the month of September. Use Assist.ORG and Ratemyprofessor.com to make the best out of your semester. Accept every chance that is offered for PRIORITY registration. You will have the best selection of classes and schedules. Classes fill up fast so this is your chance. If you really want to save money on books, use CRAIGSLIST.ORG and search in the Books category. Most of the time, you find the book(s) for your class. No waiting needed and you can resell them instead of just returning them when you rent them. So use Craigslist, Craigslist, Craigslist!}",
    "textBeforeTable": "03/09/2011 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 of 78 Paige from Fresno, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Share any unusual traditions or locations on campus By the Student Lounge you will find an Arcade with pool tables and arcade games Bang for the buck A community college for your general ed or transfer AA is the way to go. Fresno City is truly affordable, with tuition fee waivers. FASFA and CAL grant will always end up in your pocket due the affordability of Fresno City. What to do for fun City college has lots of on campus activities. There are clubs. Vendor malls. Free Ram burger day. Many campus event and free workshops. Even an arcade! The possibilities off campus are endless, located in such a large city. Food and Dining Fresno city college has a decent cafe, with cooks to make you a fresh and custom breakfast or lunch. Dorm Life City College has no dorms. Academic Rigor It all depends on your professors. There teaching styles will varies. I recommend using ratemyprofessor.com to chose your professors. There are many professors at City college. Choosing the one that teaching style best meet your learning need",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}