{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2014-22148",
            "1218-AB67",
            "OSHA-S215-2006-0063"
        ]
    ],
    "pageTitle": "29 CFR 1926.1501 - Cranes and derricks. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/29/1926.1501",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00173-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910942255,
    "recordOffset": 910911703,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{974=Title 29 published on 2013-07-01.}",
    "TableContextTimeStampAfterTable": "{12259=On April 11, 2014 (79 FR 20316), the Occupational Safety and Health Administration published a final rule: Revising the general industry standards for electric power generation, transmission, and distribution work and for electrical protective equipment; revising the construction standard for electric power transmission and distribution work; and adopting a new construction standard for electrical protective equipment. The final rule updated those standards and made the general industry and construction standards consistent. This document corrects errors in the preamble and regulatory text of the final rule., 32879=§ 1819, 17064=OSHA last issued rules for the construction of transmission and distribution installations in 1972. Those provisions are now out of date and inconsistent with the more recently promulgated general industry standard covering the operation and maintenance of electric power generation, transmission, and distribution lines and equipment. OSHA is revising the construction standard to make it more consistent with the general industry standard and is making some revisions to both the construction and general industry requirements. The final rules for general industry and construction include new or revised provisions on host employers and contractors, training, job briefings, fall protection, insulation and working position of employees working on or near live parts, minimum approach distances, protection from electric arcs, deenergizing transmission and distribution lines and equipment, protective grounding, operating mechanical equipment near overhead power lines, and working in manholes and vaults. The revised standards will ensure that employers, when appropriate, must meet consistent requirements for work performed under the construction and general industry standards. The final rule also revises the general industry and construction standards for electrical protective equipment. The existing construction standard for the design of electrical protective equipment, which applies only to electric power transmission and distribution work, adopts several national consensus standards by reference. The new standard for electrical protective equipment, which matches the corresponding general industry standard, applies to all construction work and replaces the incorporation of out-of-date consensus standards with a set of performance-oriented requirements that is consistent with the latest revisions of the relevant consensus standards. The final construction rule also includes new requirements for the safe use and care of electrical protective equipment to complement the equipment design provisions. Both the general industry and construction standards for electrical protective equipment will include new requirements for equipment made of materials other than rubber. OSHA is also revising the general industry standard for foot protection. This standard applies to employers performing work on electric power generation, transmission, and distribution installations, as well as employers in other industries. The final rule removes the requirement for employees to wear protective footwear as protection against electric shock., 31494=§ 1911, 7837=OSHA is extending its November 10, 2014, deadline for employers to ensure that crane operators are certified by three years, until November 10, 2017. OSHA is also extending its employer duty to ensure that crane operators are competent to operate a crane safely for the same three-year period., 33244=Title 29 published on 2013-07-01, 27936=On June 13, 2013, OSHA published in the Federal Register (78 FR 35559) a direct final rule that revised its signage standards for general industry and construction by updating the references to national consensus standards approved by the American National Standards Institute, a clearinghouse that verifies that the criteria for approval of consensus standards have been met. OSHA stated in that Federal Register notice that it would withdraw the companion proposed rule and confirm the effective date of the direct final rule if the Agency received no significant adverse comments on the direct final rule. Since OSHA received no such significant adverse comments, the Agency now confirms that the direct final rule became effective as a final rule on September 11, 2013., 70937=This notice schedules an informal public hearing on OSHA's proposed extension of the crane-operator certification deadline and the separate existing employer duty to ensure that their crane operators are competent. The Agency proposed three-year extensions for both, from November 10, 2014, to November 10, 2017., 46571=OSHA is extending the comment period on the Request for Information on Chemical Management and Permissible Exposure Limits (PELs) to October 9, 2015., 33334=The following are ALL rules, proposed rules, and notices (chronologically) published in the Federal Register relating to 29 CFR Part 1926 after this date., 82326=On August 9, 2010, OSHA issued a final standard establishing requirements for cranes and derricks used in construction work. The standard requires employers to ensure that crane operators are certified by November 10, 2014. Until that date, employers also have added duties under the standard to ensure that crane operators are trained and competent to operate the crane safely. The Agency is proposing to extend the deadline for operator certification by three years to November 10, 2017, and to extend the existing employer duties for the same period., 51073=ACCSH will hold a special meeting March 31-April 1, 2015, in Washington, DC, to consider a proposed rule to revise OSHA's crane operator qualification requirement in the Cranes and Derricks in Construction standard., 23688=This document contains corrections to the final regulations, which were published in the Federal Register of Thursday, June 13, 2013 (78 FR 35559). The regulations update OSHA's general industry and construction signage standards by adding references to the latest American National Standards Institute (ANSI) standards on specifications for accident prevention signs and tags., 32788=§ 1801}",
    "lastModified": "Sun, 28 Jun 2015 18:31:49 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 25366 - Confined Spaces in Construction 2015-05-04; vol. 80 # 85 - Monday, May 4, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 29. Title 29 published on 2013-07-01. 75 FR 48134, Aug. 9, 2010] 61 FR 5510, Feb. 13, 1996. Redesignated at [44 FR 8577, Feb. 9, 1979; 44 FR 20940, Apr. 6, 1979, as amended at 52 FR 36382, Sept. 28, 1987; 53 FR 29139, Aug. 2, 1988; 54 FR 15406, Apr. 18, 1989; 54 FR 24334, June 7, 1989; 58 FR 35183, June 30, 1993; 59 FR 40730, Aug. 9, 1994; This meeting shall be held prior to the trial lift at each new work location, and shall be repeated for any employees newly assigned to",
    "textAfterTable": "DEPARTMENT OF LABOR, Occupational Safety and Health Administration Final rule. The final rule becomes effective on August 3, 2015. 29 CFR Part 1926 Summary OSHA is adding a new subpart to provide protections to employees working in confined spaces in construction. This new subpart replaces OSHA's one training requirement for confined space work with a comprehensive standard that includes a permit program designed to protect employees from exposure to many hazards associated with work in confined spaces, including atmospheric and physical hazards. The final rule is similar in content and organization to the general industry confined spaces standard, but also incorporates several provisions from the proposed rule to address construction-specific hazards, accounts for advancements in technology, and improves enforceability of the requirements. 2014-09-26; vol. 79 # 187 - Friday, September 26, 2014 79 FR 57785 - Cranes and Derricks in Construction: Operator Certification GPO FDSys XML | Text",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}