{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The food was very good, they have many options.",
            "Centennial (the new freshman dorm) is very pretty, but the rooms are smaller. The others may not be as ascetically pleasing,but the rooms are bigger.",
            "Make sure you research well, if you want to go to a crowded school, this school won't be for you.",
            "This is very small and comfortable school. Everyone there is absolutely amazing, which (i hope) is going to make it an easier transition. I can't wait for the fall."
        ]
    ],
    "pageTitle": "Texas Lutheran University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Texas-Lutheran-University/reviews?_escaped_fragment_=/show/37390",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00017-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900477931,
    "recordOffset": 900435421,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{167460=© 2015, Cappex.com, LLC, 25277=The dorms were okay for the incoming class of 2011-2012 but the new freshmen will be getting the brand new dorms., 52528=dorms at tlu are spacious, clean, well built, and very inviting. for the 2012 fall semester a new dorm for freshman will be opened up also. the dorms here at tlu are located near most classrooms, and all are steps away from the hein dining hall., 3740=I sure am! I was accepted to TLU in December of 2008 and started attending August of 2008 and have been there since. Providing small classes that consist of around 20 to 25 students really does make a difference. At TLU you matter unlike other institutions where your just another kid in the class. All the teachers know your name and always are encouraging you to ask questions and very helpful when you are unsure about things. TLU offers free tutoring Sunday-Thursday for all math courses, physics, etc. They even have a writing tutor! The higher level classes have an SI which has already taken the class and offers study sessions for homeworks and upcoing tests. From a personal experience, a few classmates as well as I had trouble in our economics class which didn't not have a tutor or an SI, so the teacher himself set a once a week study session with the 4 of us! It truly made a difference! Overall TLU has taught me so much. I still have much to learn and I wouldn't choose any other insitution to be at while I progress in my learning experience!}",
    "textBeforeTable": "12/30/2009 Reviewer is A past student here. 4 out of 4 people found this review useful. 1 of 36 Cassandra from Pleasanton, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Did learn a lot I sure am! I was accepted to TLU in December of 2008 and started attending August of 2008 and have been there since. Providing small classes that consist of around 20 to 25 students really does make a difference. At TLU you matter unlike other institutions where your just another kid in the class. All the teachers know your name and always are encouraging you to ask questions and very helpful when you are unsure about things. TLU offers free tutoring Sunday-Thursday for all math courses, physics, etc. They even have a writing tutor! The higher level classes have an SI which has already taken the class and offers study sessions for homeworks and upcoing tests. From a personal experience, a few classmates as well as I had trouble in our economics class which didn't not have a tutor or an SI, so the teacher himself set a once a week study session with the 4 of us! It truly made a difference! Overall TLU has taught me so much. I still have much to learn and I wouldn't choose any other insitution to be at while I progress in my learning experience! Login to rate or flag the reviews Emily from San Antonio, TX 03/06/2011",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}