{
    "relation": [
        [
            "Windows XP Service Pack 3",
            "Microsoft IE 8 or higher",
            "1 GHz or higher processor; 2 GHz for optimal performance.",
            "512 MB RAM; 2 GB for optimal performance.",
            "3 GB Hard Drive Space; 10 GB for optimal performance."
        ],
        [
            "Windows Vista Service Pack 2",
            "Microsoft IE 8 or higher",
            "1.4 GHz or higher processor; 2 GHz for optimal performance.",
            "1 GB RAM (2GB for 64 bit); 4 GB for optimal performance.",
            "3 GB Hard Drive Space; 10 GB for optimal performance."
        ],
        [
            "Windows 7, 8, & 8.1",
            "Microsoft IE 8 or higher",
            "1.4 GHz or higher processor; Dual core processor for optimal performance.",
            "2 GB RAM; 4 GB for optimal performance (2GB for 32 bit)",
            "3 GB Hard Drive Space; 10 GB for optimal performance."
        ]
    ],
    "pageTitle": "Telehelp Publications's Christian Literature Ministry: Thought For Today - June 12 - Thy Will Be Done As It Is In Heaven !",
    "title": "",
    "url": "http://telehelppublications.blogspot.com/2013/06/thought-for-today-june-12-thy-will-be.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00171-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 239598723,
    "recordOffset": 239416733,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{780803=The most popular annual Bible commentary for teaching adults and personal study for over 20 years! With 52 weeks of thorough Bible study, the Standard Lesson Commentary is an abundance of resources at your fingertips! Unique content including teacher tips, lesson background, verse-by-verse explanation, maps & charts, pronunciation guides, quarterly quizzes, thoughtful questions and examples, and daily Bible reading lists. The KJV Standard Lesson Commentary 2014-2015 Large Print Edition is 8.5\" wide x 11\" high x 1\" thick. 460 pages, softcover from Standard Publishing., 630617=The home management section provides mothers with room to list memories of the year, keep a greeting card log, record a monthly budget, detail a weekly household cleaning schedule with room for monthly projects, collect contacts, and more. The month of December also includes a special holiday organization section with room to record Christmas cards, events, gift-giving ideas, and shopping plans., 276655=This resource is also known as Bob Jones Grade 3 Hard Drive & Complete Grade Kit with 2011 updates., 499707=In conjunction with the My Hope America campaign and events in November 2013, millions around the world will be mobilized to invite friends and neighbors to hear the message of Jesus Christ. Join with them and claim Dr. Graham's reason for hope as your own., 570864=The most popular annual Bible commentary for teaching adults and personal study for over 20 years! With 52 weeks of thorough Bible study, the Standard Lesson Commentary is an abundance of resources at your fingertips! Unique content including teacher tips, lesson background, verse-by-verse explanation, maps & charts, pronunciation guides, quarterly quizzes, thoughtful questions and examples, and daily Bible reading lists. The KJV Standard Lesson Commentary 2014-2015 is 6.5\" wide x 8.5\" high x 1\" thick. 448 pages, softcover from Standard Publishing., 885720=1631 pages (including maps & other helps), in hardcover., 290432=A full-featured study Bible at an amazing price! Dr. C.I. Scofield's classic study system (1917 edition) accompanies the authoritative KJV to form this matchless resource. A clear, red letter typeface and convenient size add to the usefulness of the Standard Edition. Features include book introductions and outlines, a unique subject chain reference system, comprehensive indexes and concordance and accurate New Oxford Bible Maps., 628438=264 pages, softcover spiralbound; three-hole-punched. Full-color pages. Covers July 2014 - June 2015., 296679=Daily planner starts in July 2014 and continues to end of December 2015, just right for college.}",
    "lastModified": "Tue, 28 Jul 2015 18:52:24 GMT",
    "textBeforeTable": "SOS 2014 System Requirements: Note: XP users MUST have Service Pack 3 Installed; XP will NOT be supported after this 2014 release. Windows RT is NOT supported. Vista users MUST have Service Pack 2 installed prior to installation. Vista, Windows 7 & Windows 8 users are strongly recommended to meet the optimal performance requirements. Only English Language versions of Microsoft are supported. Updated user interface, audible notifications for new messages, and more! New teacher reports that display the percentage complete for each course and units assigned and a Daily Homework Report showing assignments due that day. New SOS Student Reports: Daily Work Report and a Past Due Report covering selected date ranges Ability to export Lesson Plan Report to PDF, .doc, .rtf, .xls, .xlsx, or .csv Simplified assignment of alternate or supplemental assignments Allow students to entire their own activities into the Activities Log Create recurring events or activities once using the school or student calendar See a list of reusable custom assignments while creating new custom assignments Save projects to your computer and upload to the SOS database when finished Make the most of technology's benefits! Switched on Schoolhouse 2014 provides engaging and thorough computer-based instruction for homeschool students. With a core curriculum of 5 primary subjects --Bible, History & Geography, Language Arts, Math, and Science --this multi-subject program has everything needed for a comprehensive, flexible school year. Biblically-based, interactive, and with",
    "textAfterTable": "CD-ROM Drive CD-ROM Drive CD-ROM Drive Adobe Reader Adobe Reader Adobe Reader Printer Recommended Printer Recommended Printer Recommended 1024 x 768 or higher 1024 x 768 or higher 1024 x 768 or higher &nbsp; 5 Sub mega kit Lifepac 5-Subject Mega Kit, Grade 2 By Alpha Omega Publications Homeschooling is full of challenges, decisions, and hard work. Get a break with Lifepac's 5-subject set! Colorful, complete, and featuring the Lifepac method of step-by-step mastery learning with hands-on activities, you'll get everything you need for your child's primary subjects. Biblically-based lessons are integrated throughout for a solid education both spiritually and academically; a simple way to teach your students exactly what they need to know! This Grade 2 Lifepac Set includes 10 Lifepac Worktexts and 1 Teacher's guide for each of the following subjects: Bible: 7 Major Bible Themes (Creation, God's love, Old Testament Stories, God's Promises) History & Geography: Your",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}