{
    "relation": [
        [
            "",
            "ODIs",
            "T20Is",
            "First-class",
            "List A",
            "Twenty20"
        ],
        [
            "Mat",
            "9",
            "5",
            "139",
            "112",
            "127"
        ],
        [
            "Inns",
            "-",
            "1",
            "",
            "",
            "7"
        ],
        [
            "Balls",
            "-",
            "6",
            "2437",
            "398",
            "48"
        ],
        [
            "Runs",
            "-",
            "9",
            "1379",
            "315",
            "76"
        ],
        [
            "Wkts",
            "-",
            "1",
            "28",
            "17",
            "1"
        ],
        [
            "BBI",
            "-",
            "1/9",
            "3/43",
            "3/19",
            "1/9"
        ],
        [
            "BBM",
            "-",
            "1/9",
            "6/114",
            "3/19",
            "1/9"
        ],
        [
            "Ave",
            "-",
            "9.00",
            "49.25",
            "18.52",
            "76.00"
        ],
        [
            "Econ",
            "-",
            "9.00",
            "3.39",
            "4.74",
            "9.50"
        ],
        [
            "SR",
            "-",
            "6.0",
            "87.0",
            "23.4",
            "48.0"
        ],
        [
            "4w",
            "-",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "5w",
            "-",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "10",
            "-",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Joe Denly | England Cricket | Cricket Players and Officials | ESPN Cricinfo",
    "title": "",
    "url": "http://www.espncricinfo.com/countycricket2010/content/player/12454.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00322-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 433658831,
    "recordOffset": 433623077,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{59874=A product of the Kent youth system, having been with the county since the age of 13, Denly made his debut in 2004 against Oxford University. He served notice of his considerable talent with three half centuries in three Under-19s Tests whilst touring India with England in 2005. He captained both Kent 2nd XI and the ECB Development of Excellence XI team, and scored his maiden first-class hundred against Cambridge University in 2006. Then the release of David Fulton opened up a place in the Kent top order, which Denly took with both hands during the first part of the 2007 season. His prolific form caught the eye of England's selectors and he was named in the England Lions side to face India., 83393=4391 runs after 35, and 2354 outside top five, 67894=NBC Denis Compton Award 2008, 67650=NBC Denis Compton Award 2004, 64932=Jun 28, 2015, 78696=The Cricket Monthly: The IPL lasts two months, but through the year talent hunters are scouring India (and the internet) for the next big thing. By Niyantha Shekar TCM July issue, 61139=At one stage he went nearly two years without a Championship hundred. Sensing a need to revive his career he left Kent at the end of 2011 and moved to Middlesex. But his form continued to be patchy, and in 2014 he regularly found himself left out of the side, as he averaged just 23.35 in the Championship. In three seasons at Lord's, Denly hit only two centuries in all formats of the game. After he was released, he opted to return to Kent to try and reinvigorate his career, hoping to rekindle a highly effective partnership with Rob Key. In the winter of 2014/15, Denly played domestic cricket for Brother Union in Bangladesh., 87158=Since the beginning of 2012, Ian Bell averages 34.69 when batting in the top six; among regular top-order batsmen, only Shane Watson has a lower average, 65772=Jun 18, 2014, 34565=Born March 16, 1986, Canterbury, Kent, 66605=Jul 14, 2013, 67833=NBC Denis Compton Award 2007, 67772=NBC Denis Compton Award 2006, 67711=NBC Denis Compton Award 2005, 60615=The 2008 summer again kept him in the frame, especially in one-day cricket, where he enjoyed an impressive T20 tournament. But it was in 2009, after averaging 51.85 in the Friends Provident Trophy, that Denly got his international call-up. He had his moments opening the batting, making half-centuries against Ireland and Australia. But he struggled for consistency and, like many before him, then suffered a lengthy domestic slump after being dropped from the international side., 59461=Joe Denly looked well placed to establish himself in England's ODI and T20 teams after deservedly earning an international call-up in 2009 - and many thought he might also break into the Test line-up. But five years on, with many top-order batsmen now ahead of him in the queue, those ideas seemed fanciful.}",
    "textBeforeTable": "Batting and fielding averages }); } } window.setTimeout(fixIframe,1300); if($('.FB_ElementReady iframe').height()>38 || $('.FB_ElementReady iframe').height()==0 || $('.FB_ElementReady iframe').height()== null){ $('.FB_ElementReady iframe').css({'height':'30px','width':'300px'}); function fixIframe(){ fixIframe(); jQuery(document).ready(function($){",
    "textAfterTable": "306 64 49 0 Bowling averages Mat Inns Balls Runs Wkts BBI BBM Ave Econ SR 4w 5w 10 ODIs 9 - - - - - - - - - - - - T20Is 5 1 6 9 1 1/9 1/9 9.00 9.00 6.0 0 0 0 First-class 139 2437 1379 28 3/43 6/114 49.25 3.39 87.0 0 0 0 List A 112 398 315 17 3/19 3/19 18.52 4.74 23.4 0 0 0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}