{
    "relation": [
        [
            "Patent application number",
            "20140160520",
            "20140160528"
        ],
        [
            "Description",
            "APPLICATION MANAGEMENT OF PRINTING REQUESTS THROUGH INDUCED ANALYTICS - An approach for managing printing requests of a computer printing system is provided. In one aspect, the approach comprises a computing printing system receiving a printing request based on parameters of a printing request data. The approach further comprises the computing printing system determining printing alternatives for the printing request based on the printing request data. In addition, the computing printing system detects if the printing request can be archived in an email repository or transmitted to a mobile device of the requestor based on the printing alternatives. Moreover, the approach further comprises the computing printing system redirecting the printing request to one or more of an email archive of the email repository or the mobile device based on the detection of the printing request.",
            "APPLICATION MANAGEMENT OF PRINTING REQUESTS THROUGH INDUCED ANALYTICS - An approach for managing printing requests of a computer printing system is provided. In one aspect, the approach comprises a computing printing system receiving a printing request based on parameters of a printing request data. The approach further comprises the computing printing system determining printing alternatives for the printing request based on the printing request data. In addition, the computing printing system detects if the printing request can be archived in an email repository or transmitted to a mobile device of the requestor based on the printing alternatives. Moreover, the approach further comprises the computing printing system redirecting the printing request to one or more of an email archive of the email repository or the mobile device based on the detection of the printing request."
        ],
        [
            "Published",
            "06-12-2014",
            "06-12-2014"
        ]
    ],
    "pageTitle": "Linda M. - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/linda-m-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00289-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 447173371,
    "recordOffset": 447154428,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Linda M. Twaddle, Angier, NC US 12-25-2008 VOTING COMPARATOR METHOD, APPARATUS, AND SYSTEM USING A LIMITED NUMBER OF DIGITAL SIGNAL PROCESSOR MODULES TO PROCESS A LARGER NUMBER OF ANALOG AUDIO STREAMS WITHOUT AFFECTING THE QUALITY OF THE VOTED AUDIO STREAM - A method and apparatus for selecting a preferred signal from homogenous streams of a subscriber call in an analog or mixed mode wireless communication network. The method and apparatus have particular significance to un-decoded analog radio packets which require digital signal processing to decode at least their signaling information. The method allocates at least one stream with the best signal qualities to real-time full-decoding in a DSP, and allocates lower quality streams to non-real time burst decoding in the same or another DSP. As signaling quality changes in the homogenous streams, the full-decoding can be re-allocated to a now higher quality stream. Burst decoding lower quality streams allows for more efficient use of DSP processing power and allows more streams to be processed without significant affect on audio content or quality. 20080317066 Published Description Patent application number Linda M. Trine, Keller, TX US 08-21-2008 TARGETED MARKETING SYSTEM AND METHOD - A computer-implemented method for targeting marketing content to an online user, includes the steps of collecting data describing the user or the user's ownership item in a user profile, comparing the user profile with a target profile and presenting the user with content based",
    "textAfterTable": "Linda M. Vermote, Hb Sittard NL Patent application number Description Published 20130252288 ENANTIOSELECTIVE REDUCTION - The invention relates to a process for the preparation of a chiral compound, comprising enantioselectively reducing a carbon-carbon double bond of an α,β-unsaturated compound in a mixture comprising both an E isomer and a Z isomer of the α,β-unsaturated compound, wherein both E isomer and Z isomer are converted in the presence of a hydrogenation catalyst. 09-26-2013 Linda M. Zeger, Lexington, MA US Patent application number Description Published 20130107764 Traffic Backfilling Via Network Coding In A Multi-Packet Reception Network 05-02-2013 20130114611 Method and Apparatus for Efficient Transmission of Information to Multiple Nodes - A system and method to reduce the number of data transmissions between nodes in a network is described. In one embodiment, a system and method for reducing the amount of ACK and NAK traffic in a network is described. 05-09-2013 Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}