{
    "relation": [
        [
            "s",
            "c16",
            "ps"
        ],
        [
            "-",
            "-",
            "-"
        ],
        [
            "窄字符数组的多字节字符将被存储的指针 原文： pointer to narrow character array where the multibyte character will be stored 这段文字是通过 Google Translate 自动翻译生成的。 您可以帮助我们检查、纠正翻译中的错误。详情请点击这里。",
            "16位字符的转换 原文： the 16-bit character to convert 这段文字是通过 Google Translate 自动翻译生成的。 您可以帮助我们检查、纠正翻译中的错误。详情请点击这里。",
            "解释的多字节字符串时使用的转换状态对象的指针 原文： pointer to the conversion state object used when interpreting the multibyte string 这段文字是通过 Google Translate 自动翻译生成的。 您可以帮助我们检查、纠正翻译中的错误。详情请点击这里。"
        ]
    ],
    "pageTitle": "c16rtomb - cppreference.com",
    "title": "",
    "url": "http://zh.cppreference.com/w/c/string/multibyte/c16rtomb",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00047-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 870643083,
    "recordOffset": 870631662,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 03 Oct 2013 12:08:22 GMT",
    "textBeforeTable": "[编辑] 参数 这里。 您可以帮助我们检查、纠正翻译中的错误。详情请点击 Google Translate 自动翻译生成的。 这段文字是通过 __STDC_UTF_16__ is defined, the 16-bit encoding used by this function is UTF-16, otherwise it is implementation-defined. In any case, the multibyte encoding used by this function is specified by the currently active C locale. If the macro 原文： __STDC_UTF_16__的定义，使用此功能的16位编码是UTF-16，否则它是实现定义的。在任何情况下，使用此功能指定多字节编码由目前活跃的C语言环境. 如果宏 这里。 您可以帮助我们检查、纠正翻译中的错误。详情请点击 Google Translate 自动翻译生成的。 这段文字是通过 *ps is updated to represent the initial shift state. u'\\0', a null byte is stored, preceded by any shift sequence necessary to restore the initial shift state and the conversion state parameter If c16 is the null wide character 原文： *ps代表初始位移状态的. u'\\0'的，一个空字节存储，在此之前通过必要的任何变化序列，恢复初始移位状态的更新和转换状态参数 如果C16是空宽字符 这里。 您可以帮助我们检查、纠正翻译中的错误。详情请点击 Google Translate 自动翻译生成的。 这段文字是通过 buf. c16rtomb(buf, u'\\0', ps) for some internal buffer s is a null pointer, the call is equivalent to If 原文：",
    "textAfterTable": "[编辑] 返回值 如果成功，则返回的字节数（包括任何移位序列）写入的字符数组，该数组的第一个元素是指向 s。此值可为 ​0​，例如当处理 char16_t中的替代品对. 原文： On success, returns the number of bytes (including any shift sequences) written to the character array whose first element is pointed to by s. This value may be ​0​, e.g. when processing the first char16_t in a surrogate pair. 这段文字是通过 Google Translate 自动翻译生成的。 您可以帮助我们检查、纠正翻译中的错误。详情请点击 这里。 失败（如果 c16是不是一个有效的16位字符），返回 -1，店 EILSEQ errno不明确的状态，并留下 *ps. 原文： On failure (if c16 is not a valid 16-bit character), returns -1, stores EILSEQ in errno, and leaves *ps in unspecified state. 这段文字是通过 Google Translate 自动翻译生成的。 您可以帮助我们检查、纠正翻译中的错误。详情请点击 这里。 [编辑] 另请参阅 mbrtoc16 （C11） 产生下一个16位宽的字符从一个狭窄的多字节字符串",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}