{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Local not national",
            "Come with an open mind. It is a small school, beware of what you do as not only students will know but also professors.",
            "You'll find a group of friends you never would anywhere else. Faculty is supportive and conducive to your learning. Grading is tough but you'll be prepared for grad schools."
        ]
    ],
    "pageTitle": "Austin College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Austin-College/reviews?_escaped_fragment_=/show/33267",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00214-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891453823,
    "recordOffset": 891414910,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28933=You will definitely learn a lot at Austin College. The work can be difficult, but the college's reputation will make it worth it later on. The professors have a tremendous amount of knowledge and are ready to pass it along. At times, it can be very overwhelming, but if you study and do the work, it will all work out. The college tries to ensure a broad range of study with each student through January terms, C/I courses, etc., 16960=The liberal arts curriculum allows, and even forces, each student to take a wide variety of classes. Many classes are geared more to learning through class discussion and readings that don't come from text books. In fact, most teachers enforce attendance policies and class participation as part of your final grade. I'm an art major, but my education is in no way limited academically because of this. I'm a part of the Posey Leadership Institute and have taken three courses specifically on leadership. Required 'janterms allow you to take a crash course in a variety of subjects, and in many cases study abroad. This January I'll be taking a class on blogging and the digital self. Even though I have not studied abroad yet, attending a school where it's almost expected to learn outside of the country has given me a lot of knowledge from my peers., 46132=As a student originally from Houston, I'm not going to lie; Sherman is a very small, quiet town, and your college experience will be greatly improved if you know or are someone with a car. If you aren't, don't worry! The campus is small, with under 2000 students, so you're practically guaranteed to meet someone with driving abilities! The residence halls are conveniently located close to the academic buildings, and it's possible to cross the entire campus on foot in under 10 minutes. Also, we have a variety of extracurricular organizations, as well as an on-campus coffee shop and a fantastic library. Moreover, if you're worried about staying in Sherman for four straight years, don't! Study Abroad programs are readily available, and about 70% of the students go abroad at least once., 26830=If you have taken courses for college credit, find out how they transfer. My dual credit classes transferred as three hours and AC's course credits are four hours. So, my four courses at community college only count as three at AC. Take a look at what all courses are required before committing. January terms, foreign language, lifetime sports, etc. Do not just look at what is required for certain degrees, but also what the general requirements are. Living off campus saves a lot, but I have found it's a bit harder to be involved. Determine which is more important to you. Study, Study, Study., 58811=austin college really offers a lot of unique advantages and opportunities. one of my favorites is the size of the campus and the teacher to student ratio. there are about 1300 students on campus and ive even had a class with as little as 7 students!, 120245=© 2015, Cappex.com, LLC, 47216=The classes offered at this school are phenomenal--despite the small size, there are a wide range of available subjects, including Japanese. The pre-med and educational departments stand out in particular, as well as a special residence hall/immersion program for language students--the Language House. The small class sizes also help with the learning experience--the classes are challenging, but the professors are willing to help, and they actively encourage questions! Also, there is a January semester (known as Jan Term) which allows for more learning opportunities; many of these classes are special courses not offered at any other time, such as courses on space westerns and (I'm not kidding) the history of swear words., 12117=Austin College offers rigorous courses and a large variety that can suit any one's interests. The basic requirements allow students to explore in a variety of different subjects that may not relate to their field of study, but be applied to their major. Also, if Austin College doesn’t have the major you would like, but has the classes, students can make their own major, such as Japanese. Austin College also has a Jan-term when in January students have an opportunity to explore creative topics and even have opportunities to study abroad. Austin College has a rigorous Pre-Med program and an education program that allows students to graduate in five years. As a small school, students can easily contact their professors during their office hours or by email. The staff is supportive and strives to help you succeed., 22445=I have attained so much here. I enjoy going to classes like A History of Beauty in Art, or a class about Rock and Roll or Magic. There are so many different things to learn here, it is amazing. The liberal arts education makes you get away from your standard major and minor study and into new fields. The Janterms help further this by allowing you the whole month of January to study whatever you want., 27717=As a private school, AC is quite expensive. If you apply early, you can get scholarships which help tremendously. Living at home has helped me save a lot. One negative was a $2000 increase in tuition made this summer after I had already committed.}",
    "textBeforeTable": "08/25/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 27 Cassandra from Lake Jackson, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Am enjoying being here Beyond all of the studying and pressure put on by all of your classes, Austin College knows how to keep students interested and having fun. There is always something going on no matter how big or how small the activity is. Austin College likes to get the students active even if they are not in sports or any organizations. After a long day of studying it's nice to go to the Pub or the lawn and get your mind off of the pressures of classes. They have activities for just having fun as well as activities that raise money for a good cause. Many organizations put on performances or any kinds of programs for entertainment at the auditorium. Theatre puts on plays where students can go and enjoy a show before they go back to working hard. Being a student there, you get to enjoy many cultural experiences. Every month or so, there are dinners from different cultures that students can sign up for. One month there may be a Pakistani dinner, and another month, there is a Japanese dinner. Not only do you have fun in the Pub or auditorium, but you can also have fun in the dormitories. Every hall way has their clusters. Clusters are a group of kids that live on your side of the hallway with an assigned RA, with who you can have dinner with or just go",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}