{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "97.26",
            "91.85",
            "80.41",
            "75.73"
        ],
        [
            "NSE",
            "97.32",
            "91.87",
            "80.43",
            "75.75"
        ]
    ],
    "pageTitle": "Kokuyo Camlin Stock Price, Share Price, Live BSE/NSE, Kokuyo Camlin Bids Offers. Buy/Sell Kokuyo Camlin news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/diversified/kokuyocamlin/C02",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00016-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 590047579,
    "recordOffset": 589992243,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{210599=Astec LifeSciences Recommended on Mar 31st 2015, 133461=28 July 2015, 133972=UnitedBrewerie Jul Fut, 134679=JSWSteel Jul Fut, 211908=Kokuyo Camlin is in the Diversified sector. The current market capitalisation stands at Rs 1,183.58 crore. The company management includes Subhash Dandekar - Chairman Emeritus, Dilip Dandekar - Chairman & Executive Director, Takuya Morikawa - Sr. Vice Chairman & Non Exe. Director, Shriram Dandekar - Vice Chairman & Exe.Director, Yasushi Inoue - Non Executive Director, Takeo Iguchi - Executive Director, Nobuchika Doi - Executive Director, Ramanathan Sriram - Independent Director, Devendra Kumar Arora - Independent Director, Hisamaro Garugu - Independent Director, Venkataraman Sriram - Independent Director. It is listed on the BSE with a BSE Code of 523207 and the NSE with an NSE Code of KOKUYOCMLN. Its Registered office is at 48/2 , Hilton House, Central Road,,MIDC, Andheri (East) Mumbai,Maharashtra - 400093. Their Registrars are Sharepro Services (India) Pvt.Ltd.}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}