{
    "relation": [
        [
            "First Name",
            "Julie",
            "Elizabeth",
            "Donna"
        ],
        [
            "Last Name",
            "Landry",
            "VanDersarl",
            "Harman"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=EBA821D4-B75B-4170-8C6A-BBA78FCB6BD4&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00155-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 225064131,
    "recordOffset": 225056352,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27479=HR 908, Full Implementation of the Chemical Facility Anti-Terrorism Standards Act S 473, Continuing Chemical Facilities Anti-Terrorism Security Act of 2011, 12288=HR 6083, S 3240 Farm Bill Reauthorization; conservation, energy and forestry titles; USDA \"biobased\" language HR 5873, S 2346, Forest Products Fairness Act S 2155 Grow it here, Make it Here Paper Industry Check-Off, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 16879=HR 4310, provisions related to green building construction HR 5973, S 2375, Agriculture Appropriations -- Energy Title HR 5854, Military Construction, provisions related to green building construction HR 6020, S 3301, Financial services, provisions related to GSA green building policy, 47778=Corporate tax reform (general) HR 8, Job Protection and Recession Prevention Act of 2012 Tax rates on capital gains and dividends (general) Tax extenders legislation HR 6439, Keep the Forest in the Family Estate Tax Act Biomass tax items (general), 20956=EPA Clean Water Regulations related to Forest Roads EPA Boiler MACT regulation EPA \"Coal Ash\" regulation S 3512, Coal Ash Recycling and Oversight Act of 2012 HR 4078, the Red Tape Reduction and Small Business Jobs Creation Act EPA's final National Emission Standards for Hazardous Air Pollutants for the Pulp and Paper Industry, also known as the residual risk and technology review rule National Emission Standards for Hazardous Air Pollutants for Major Sources: Industrial, Commercial, and Institutional Boilers and Process Heaters; proposed rule National Ambient Air Quality Standards for Particulate Matter; proposed rule HR 2273, Coal Residuals Reuse and Management Act EPA Clean Water Regulations EPA regulation on national standards for fine particulate matter (PM2.5) HR 4607, the \"Midnight Rule Relief Act of 2012\" HR 4078, the Regulatory Freeze for Jobs Act HR 4078, Matheson (D-UT) amendment #61 HR 6172, To prohibit the Administrator of the EPA from finalizing any rule imposing any standard of performance for carbon dioxide emissions form any existing or new source that is a fossil fuel-fired electric utility generating unit unless and until carbon capture and storage is found to be technologically and economically feasible. S 2245, the Preserve the Waters of the U.S. Act HR 2250, EPA Regulatory Relief Act of 2011 S 1392, EPA Regulatory Relief Act of 2011 Clean Air regulations Clean Water regulations relating to Forest Roads, 44413=HR 2309, Postal Reform Act of 2011 S 1789, 21st Century Postal Service Act Potential Graves/Emerson/Connelly Amendment to HR 2309 regarding 6-day delivery, 54591=HR 3210, RELIEF Act Lacey Act Amendments (general) Russia PNTR and Jackson-Vanik waiver legislation HR 4171, S 2062, FOCUS Act, 35320=Educating Members of Congress on building energy codes as they relate to the forest products industry. S 1000, Energy Savings and Industrial Competitiveness Act of 2011 Exec. Order 13264, Accelerating Investment in Industrial Energy Efficiency, 51251=HR 763, the Safe and Efficient Transportation Act of 2011 S 747, the Safe and Efficient Transportation Act of 2011 S 1813, MAP-21}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20036 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mrs.  JANET A. POLING  2024632590  Jan_Poling@afandpa.org 5. Senate ID#  2376-12 7. Client Name Self Check if client is a state or local government or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}