{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6"
        ],
        [
            "RxCUI",
            "858726",
            "858726",
            "998282",
            "998282",
            "1010671",
            "1010671"
        ],
        [
            "RxNorm NAME",
            "chlorhexidine gluconate 20 MG/ML / Isopropyl Alcohol 0.7 ML/ML Topical Solution",
            "chlorhexidine gluconate 2 % / isopropyl alcohol 70 % Topical Solution",
            "chlorhexidine gluconate 20 MG/ML / Isopropyl Alcohol 0.7 ML/ML Topical Solution [ChloraPrep One-Step]",
            "ChloraPrep One-Step (chlorhexidine gluconate 2 % / isopropyl alcohol 70 % ) Topical Solution",
            "Lidocaine Hydrochloride 20 MG/ML Injectable Solution",
            "lidocaine hydrochloride 2 % Injectable Solution"
        ],
        [
            "RxTTY",
            "SCD",
            "SY",
            "SBD",
            "SY",
            "SCD",
            "SY"
        ]
    ],
    "pageTitle": "DailyMed - A3711-19 NERVE BLOCK - regional anesthesia kit",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=cb93958f-5c64-4aae-89f1-d5b5048baf6f",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00232-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 56266279,
    "recordOffset": 56233476,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5840=When using this product • keep out of eyes, ears, and mouth. May cause serious or permanent injury if permitted to enter and remain. If contact occurs, rinse with cold water right away and contact a doctor., 79521=Multiple-dose vials contain 0.1% of methylparaben added as preservative. May contain sodium hydroxide and/or hydrochloric acid for pH adjustment. The pH is 6.5 (5.0 to 7.0). See HOW SUPPLIED section for various sizes and strengths. Lidocaine is a local anesthetic of the amide type. Lidocaine Hydrochloride, USP is chemically designated 2-(diethylamino)-N-(2,6-dimethylphenyl)-acetamide monohydrochloride monohydrate, a white powder freely soluble in water. The molecular weight is 288.82. It has the following structural formula:, 9973=Single-dose products are preservative-free. Store at 20 to 25°C (68 to 77°F). [See USP Controlled Room Temperature.] Lidocaine Hydrochloride Injection, USP solutions packaged in ampuls and glass teartop vials may be autoclaved one time only. Autoclave at 15 pounds pressure, 121°C (250°F) for 15 minutes. DO NOT AUTOCLAVE PRODUCT IN PLASTIC VIALS. Revised: February, 2010 Printed in USA EN-2421 Hospira, Inc., Lake Forest, IL 60045 USA, 10102=1000}",
    "textBeforeTable": "Number of versions: 3 A3711-19 NERVE BLOCK - regional anesthesia kit View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close manufacture 830430778 CareFusion 213 LLC Business Operations ID/FEI Address Name Establishment manufacture 093132819 Hospira, Inc. Business Operations ID/FEI Address Name Establishment manufacture 137835299 Smiths Medical ASD, Inc. Business Operations",
    "textAfterTable": "1 858726 chlorhexidine gluconate 20 MG/ML / Isopropyl Alcohol 0.7 ML/ML Topical Solution SCD 2 858726 chlorhexidine gluconate 2 % / isopropyl alcohol 70 % Topical Solution SY 3 998282 chlorhexidine gluconate 20 MG/ML / Isopropyl Alcohol 0.7 ML/ML Topical Solution [ChloraPrep One-Step] SBD 4 998282 ChloraPrep One-Step (chlorhexidine gluconate 2 % / isopropyl alcohol 70 % ) Topical Solution SY 5 1010671 Lidocaine Hydrochloride 20 MG/ML Injectable Solution SCD 6 1010671 lidocaine hydrochloride 2 % Injectable Solution SY Get Label RSS Feed for this Drug A3711-19 NERVE BLOCK - regional anesthesia kit To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=cb93958f-5c64-4aae-89f1-d5b5048baf6f To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To view updated drug label links, paste the RSS feed address (URL) shown below into a RSS",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}