{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "Great for these types of students",
            "What to do for fun",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Phi Theta Kappa and Honors Council",
            "Hard working student who cannot afford college.",
            "There are always activities going on in the atrium",
            "I did not live in the dorms, but I only heard good remarks about them.",
            "Take advantage of every opportunity the school offers: the honors program, the leadership program, clubs, etc. Not only do these activities help you personally, it will also make you a better candidate.",
            "MCC is one of the best community colleges. The teachers are wonderful and there are many opportunities for students."
        ]
    ],
    "pageTitle": "Monroe Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Monroe-Community-College/reviews?_escaped_fragment_=/show/22775",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00217-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899599919,
    "recordOffset": 899547182,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{284924=© 2015, Cappex.com, LLC, 121606=The Monroe Cafe was opened in April of 2012 and it has new dishes everyday, a popular hangout spot and rather relaxing.}",
    "textBeforeTable": "07/28/2009 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 69 Iman from Rochester, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Janice from Brooklyn, NY 01/18/2012 Reviewer is A current student here. 3 out of 3 people found this review useful. 2 of 69 Categories Comments Campus Safety We have a great security team at the college and they are very strict in respect to the people they let into the collegebuildings. Clubs and Activities This college has a lot of clubs such as NABA, SIFE, a marketing, IT, minorityclub. It also has a lot of sporting activities where both male and female participate. Great for these types of students It caters to just about every need as they have a business school, an allied health care and a culinary school. Bang for the buck At Monroe there is a family atmosphere where everyone on the faculty looks out for the students and help them to adjust to the learning environs. This is particularly so for international students who left their country to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}