{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "There not much fun here if you not into the party scene and that is only on the weekends. However there is always Netflix!",
            "Its the not the best its the same thing everyday kinda tiresome. However there is this new thing where its food carts from local restaurants and that's nice.",
            "Its nice and you meet new people however, sometime when your roommate is not the nicest your stuck. You could get a room change but there is that chance that they wont be nice either.",
            "Its not the hardest, but I am still a freshman and I still have to study so its up there.",
            "If you want to go to school for the cheapest and still get education, then this is the school for you."
        ]
    ],
    "pageTitle": "University of California-Merced (UC Merced) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-California-Merced/reviews?_escaped_fragment_=/show/87627",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00081-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910683163,
    "recordOffset": 910557735,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{19130=This is a major case of Your mileage may vary. The University itself is very nice and modern, with facilities that are, while a little limited, very good--the fitness center and the library, in particular. The downside is, of course, that the area surrounding it isn't the most spectacular. It may get a little boring, especially if you don't have a car or a way to get around. It also doesn't have as many activities as other schools, being fairly new. Though, again, there is a greater bond with teachers (15:1 student-teacher ratio!), and the facilities that the school DOES have are top-notch., 77081=As the question says I really feel I am getting the Bang for the Buck here at Merced. There are only 6000 students on Campus as of 2013. We are growing every year. Like I said we are a well kept secret., 3337=If you live on campus, you have a $2500 balance placed on your CatCard. Your CatCard is your ID card that is used for, of course, identification purposes, and for everything else on campus--to access some doors, the key to your room (some rooms), to check out things from the library, and of course, for your meal-plan. So again, you have $2500 for the entire year, $1250 per semester. The leftover money from the $1250 from the 1st semester gets carried over to the 2nd semester, but you have to use it all up by the end of the school year, as the leftover money from 2nd semester doesn't carry onto the next year. Most people end up with a lot of money by the end of the semester (I still have $400 and there's 2 weeks of class left before the end of the semester) while others like my roommate have $47 left for the next two weeks. I ended up with a lot of money left because my parents always brought me food from home. My roommate, however, only ate the DC food, plus he spent about $30 per day worth of food. To make sure you spend just the right amount, a typical day of food should consist of only 2 meals per day, usually around $10 per meal. Meal prices can vary, but it's about $10 average. $10 for a meal...doesn't seem bad right? But in fact, it's terrible at times. Knowing that most students have no other choice but the DC food, they over-charge things. A small bag of Kettle Chips is $1.75. String cheese is $0.97. A banana is around $0.75. An English Muffin, yogurt, string cheese, and Raspberry Candied Almonds costs $8. Many people complain about the price of food here, but you just have to accept the prices. Education-wise, you pay to attend school here (assuming you weren't completely covered by financial aid) and you really do get a bang for your buck. You get a great education here. Many class sizes are restricted to 20 people per discussion section, and lectures usually consist of only 250-300 people max. It's a really small environment, great for learning. However, the trend for the past few years has been that the population of UC Merced has been doubling every year, and expects to continue doing so. However, when UC Merced is critiqued, it might be appreciated for its' small population size, and if it is shown that students perform better in much smaller population conditions, the school might decrease the amount of admissions to the school--but for now, it's definitely increasing greatly every year. You get a solid education here. This is a University of California, the 10th UC, and the 1st UC of the 21st century. Everything is pretty much new. You're truly getting what you pay for, regardless of the food situation at times., 260908=UCM gives out a lot of financial aid. It's a pain in the butt if you have to do the verification process, but their staff members makes it easy for you. You can get a hold of them real fast and their more than willing to help. I believe that what I'm paying to attend UCM is worth it. It's a new school so we get new everything, and plus we get a concert just for UCM students only. In 2011, LMFAO performed for us and in 2012 we had Travis Porter., 135039=UC Merced provides instructor's at the top of their field and provides undergraduate research opportunities for students which makes UC Merced so unique. The student to teacher ratio averages from 20:1 which is great because we are still paying for a UC education with a private school learning environment. UC Merced also is one of world leading research facilities and have made groundbreaking research in cognitive science, biology and archaeology., 626422=© 2015, Cappex.com, LLC, 133109=UC Merced is the newest UC campus and students get to have their college experience with new facilities. Recently the school opened their new management building fall of 2011. Two of the buildings on campus have received Gold Leed award for energy efficiency, one of them being the new management building and other the early childhood daycare center. UC Merced provides free tutoring where students can benefit from working in groups and combine socializing with class preparation. The Counseling Services are UC Merced offers assistance with test-taking anxiety, stress management and other academic difficulties, in addition to emotional problems. UC Merced has The Bright Success Center that offers workshops on time management, note-taking skills, test-taking strategies and other useful topics. Career Services in Kolligian Library offers free assistance in helping students determine the best career path for your personality type, in addition to general guidance and support in finding your pathway to a meaningful career., 6307=This section all depends on the person and what your preferences are. Obviously, as mentioned earlier, if you simply want to learn, then there's no problem at all. However, UC Merced has some perks..some that can be good and some bad. I don't want to spoil everything for you and chase you away/convince you--I want you to form your own opinions based on facts. - UC Merced is in the middle of NOWHERE. There's really nothing to do here. Sure, there are clubs and stuff, parties here and there, the typical (if this is what you were concerned about don't worry haha). The university is about an 8 minute drive to downtown Merced, which is where all the fun is. There are a lot of places to eat in downtown Merced. From In N Out, Carl's Jr., Jack in the Box, and Sonic to Jamba Juice, Apple Bee's, Hometown Buffet, Chinese Buffets, great Indian food places, Steak Houses, BBQ places, and other Merced exclusive food places. The most popular non-partying/drinking thing to do here is go to the movies. There are 2 theaters here, one significantly bigger than the other. The bigger theater has In N Out a 5 minute walk away, while the smaller theater has the Merced Mall a 5 minute walk away and Carl's Jr a 10 minute walk away. Merced Mall is disappointing. It's not your Great Mall or Sunvalley Mall in Concord, or any other big mall. It's more like a medium sized strip with the main shopping stores. I've only been there 2 or 3 times so I can't really remember what they have, but they have some good stuff, and a food court. One troublesome thing is the transportation between UC Merced and downtown Merced. Merced has what are called CatTracks which is basically the free bus system provided for UCM students. (btw if you didn't know already, the UCM mascot is the bobcat) The problem is, it takes approximately 45 minutes to get from UCM to downtown Merced and vice-versa, when a car ride takes about 8 minutes. I've ridden the CatTracks at least 10 times this semester to get downtown and back. It was okay at first, but then I started picking up motion sickness easily, and it was really horrible. Thankfully one of my roommates was able to bring his car after Thanksgiving break. Also, another thing to note is that Freshman that are staying at the Residence Halls (aka dorms) aren't allowed to park their car at the school (aren't allowed to have a parking permit). You're only allowed to have a permit to park at the community college, which is about a 10 minute bike-ride away. The campus itself is nice. It's still fairly new, having been opened since 2005 I believe? The school is also famous for having Michelle Obama at the 08-09' Commencement Ceremony. Whenever I mentioned UC Merced to my friends in high school when I first got accepted, the majority never even heard of it. The school has a lot of opportunities for you, and a lot to offer. I almost forgot--the food. The dining center/commons (aka DC) is a non-profit organization and isn't directly connected to the UC itself (most people don't know this). Thus, a lot of people typically complain about the food here, saying common phrases such as The DC food..ugh.. or DC food again? I want some REAL food. The food here, is better than people exclaim. There is a wide variety of items to choose from. I don't want to spoil anything, so I'll just be very brief about the food. There's the grill where you can order your hot dogs, burgers, fries, and other items. The Asian section has rice/noodle bowls. The Mexican section has nachos, quesadillas, burritos, and other items. There's a salad bar, a section to make your own sandwich, and a dessert section. There's the pizza section, hot sandwich and smoothie section, refrigerated section (with standard refrigerated foods like microwaveable burritos, string cheese, eggs, milk, yogurt, etc.). There's the Blue Plate section, which is supposedly the healthiest section and has foods that are served at a typical buffet like Hometown Buffet. Finally, there's a fruit section along with a breakfast section that has cereal, a Quiznos-style mini-oven, and your basic breakfast essentials (except for pancakes). Some of the food really is just terrible, but there's a lot of good food here that overpowers the terribleness. Overall, if you're going to school and want to get something out of it, this is the place for you. But if you're the party every weekend type of person, you might be a bit disappointed...might be., 365199=Campus food is campus food, but there are some nice varieties throughout the weeks. The meal plan, instead of giving you a certain number of meals per week, gives you around 1300 dollars per term to work with. That's about 11 dollars a day, which sounds difficult at first, but you can always add more money in, so that's good. My main gripe about the food here is that many of our food options close on the weekends, leaving us with very little choice about what to eat. Overall though, I've been happy with the food here, and it's good enough for me., 115372=This university is small, but I love it! It also means smaller classes and a great opportunity have more office hours to meet the professors! Its new so that means everything on campus is new! I am very excited to attend this school in fall 2011., 49021=I had to pay 29000 dollars and its a lot of money but its worth it. Each student is given about 1000 dollars in something called Cat Card and the we can buy pretty much anything we want on campus with it.}",
    "textBeforeTable": "12/03/2009 Reviewer is A current student here. 32 out of 32 people found this review useful. 1 of 138 Gabriel from Hercules, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. University of California-Merced Reviews University of California-Merced › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews krysta mae from Merced, CA 08/24/2009 Reviewer is A current student here. 12 out of 12 people found this review useful. 2 of 138 Categories Comments Great for these types of students Students who want to branch out will have the opportunity to at UC Merced. This university is still growing which will provide a lot of opportunities for students to make the most out of it. New clubs are always being made and just recently, a friend of mine pushed members of a committee to give her credit as a triple major. UC Merced gives students possibilities to make it their college. Tips for prospective students Always visit potential colleges before making a decision and apply for as many scholarships as humanly possible so as not to take out so many loans and have to worry about them after graduation. The last thing on a student's mind should be how they will be able to pay off their student loans. Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}