{
    "relation": [
        [
            "Metadata",
            "m",
            "con",
            "tr",
            "to",
            "iv",
            "duratn",
            "vru script name"
        ],
        [
            "ECC Variable Value",
            "D, V or N - Indicates whether the user responded with Voice (V), DTMF (D), or not at all (N). (Note that for the Menu micro-application, any successful single digit entry will result in m being set to V or D, even if the entry was an invalid menu selection.)",
            "000 to 100 - Indicates the ASR percent confidence level at which the voice input was finally recognized. This field is only valid if m is Voice (V).",
            "00 to 99 - Indicates how many tries were required. 01 means user responded successfully after the first prompt.",
            "00 to 99 - Indicates how many timeouts occurred. Does not include interdigit timeouts.",
            "00 to 99 - Indicates how many invalid entries were received, including interdigit timeouts.",
            "000000 to 999999 - Indicates the micro-application duration in milliseconds. Duration is defined as the elapsed time between entering and exiting the RunExternalScript node, as measured in the IVR Service.",
            "Full name of the VRU script which was executed. This is the only variable length field."
        ]
    ],
    "pageTitle": "Configuration Guide for Cisco Unified Customer Voice Portal, Release 10.0(1) - Unified ICM Configuration [Cisco Unified Customer Voice Portal] - Cisco",
    "title": "Table 3 Metadata ECC Variable Values",
    "url": "http://www.cisco.com/c/en/us/td/docs/voice_ip_comm/cust_contact/contact_center/customer_voice_portal/cvp10_0/configuration/guide/CVP_BK_CFD64ACC_00_configuration-guide-for-cvp-1001/CVP_BK_CFD64ACC_00_configuration-guide-for-cvp-1001_chapter_0111.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00114-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 379371483,
    "recordOffset": 379330773,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{64534=Root of the URL for all media files and external grammar files used in the script., 7208=Up to 1024 characters, 118399=Set the Name: by convention, this is the name of the target VRU peripheral, followed by the DNIS that this route will use, for example, MyVRU_2000, 66818=Directory for all application-specific media files and grammar files., 63881=Locale, a combination of language and country which defines the grammar and prompt set to use.}",
    "textBeforeTable": "To configure General settings on an ICM Server, on the General tab, enter the field values, as listed in the following table: A Unified ICM Server is required in Unified CVP Comprehensive, Call Director, and VRU-Only call flow models. Unified CVP provides VoIP routing services for the Unified CCE and Unified CCX products. Unified ICM provides the services to determine where calls should be routed. These calls can be routed to ACDs, specific agents, or to VRUs. However, the routing services themselves must be provided by an external routing client. General Settings ICM Server Settings Click Save. Step 5   (Optional) Click the Device Pool tab and add the Unified ICM Server to a device pool. See Add Unified ICM to Device Pool. Step 4   Click the General tab and enter the field values. See General Settings. Step 3   To use an existing ICM Server as a template for configuring a new ICM Server, select an ICM Server from the list of available Unified ICM Servers and click Use As Template and perform Steps 3 to",
    "textAfterTable": "No Add Unified ICM to Device Pool See Add or Remove Device From Device Pool. Configure ICM Settings for Standalone Call Flow Model You can convert a configuration from a nonreporting configuration (that is, no Call Server is defined) to a Reporting or ICM Lookup Configuration. If you have configured Unified CVP for a Standalone call flow model without reporting, the version of the VXML Server you defined cannot be associated with a Call Server. This VXML Server definition is required for reporting and for the ICM Lookup. Hence, delete the existing VXML Server definition and begin with Step 4 to incorporate a Call Server, a Reporting Server, and ICM Lookup Configuration steps. Variations Applicable steps Reporting Steps 2, 5, and 6 Without Reporting Not applicable ICM lookup Steps 1 to 7",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}