{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Police and Safety is always riding around campus and ALWAYS busting parties. ALWAYS. Plus there are blue light systems around campus. They are just poles with buttons that you push and they come.",
            "No sororities or fraternities at MU.",
            "I can't really comment specifically on them but there are a lot to choose from and this year they held a campus involvement fair where you could go around to booths and get information about all the clubs and organizations.",
            "People who are ready to work hard but definitely hard to make friends here if you are socially awkward or introverted.",
            "There are rumors that MU is haunted. More can be found online about this.",
            "Mercyhurst isn't always filled with different activities for students to have fun but it is a great school academically.",
            "Most people just got to parties at upperclassmen apartments. But all students can use the Erie bus system for free which even goes out of town. People also go to clubs downtown. There are on campus activities as well such as the Fall Ball (a dance), poetry nights, movie showings, dance classes like zumba and more.",
            "The meal plans at MU for freshman are all unlimited and higher priced meals include more guest passes and spending money across campus, while the lowest included 2 passes and $50. These plans can be used at Egan Dining Hall. The food is simply okay on most days but sometimes they have really really good options. There are always unique flavors of ice cream that change multiple times a day. The Laker Inn is another dining hall type of place but only dining dollars and cash can be used here. Mostly an upperclassman place to eat but it has a grill, chinese, snacks, etc. and is open til 1am while Egan closes at 11 and puts food away at 10.",
            "For freshmen, there are the options of an all-girl (Baldwin) or all-guy (McAuley) dorm or the newer co-ed one (Warde). I live in Baldwin and the rooms are decent with a pretty good sized closet, bureau, desk and bed. Also, every two rooms has a bathroom inbetween so there are no communal bathrooms (expect in McAuley). Baldwin is pretty quiet but there are some opportunities for good friendships to build. It also has a lounge on each floor with a TV and couches and also a microwave, oven, stovetop and sink. Warde is the newer dorm and has beautiful and spacious rooms and each one has its own bathroom. There are also lounges and a small gym on each floor as well as a convenience store downstairs. I've heard more parties go on here and it is louder. All upperclassmen live in apartments on campus if they don't commute.",
            "I am a freshman in my first term, so I am only a little over halfway through my first three classes here. In my classes there is a LOT of reading and writing every week. Professors expect a lot from you but if you do what they assign you will be perfectly fine. Especially the reading. Also, some majors require a minimum GPA, so be conscious of that.",
            "You don't have to be religious to come here but it is a catholic school. Therefore, you will be required to take a religious traditions class. Sometimes in class it is expected that you know things about religion that one who doesn't have that background would not. Aim for high grades, it'll get you more financial aid of course. Also, if you're an Education Major, you receive a $15,000 scholarship right off the bat. MU has its terms split into three trimesters instead of the usual two semesters, but will be switching next year to two semesters plus one term in January where one intensive course is taken.",
            "A great school academically with a very small campus. Financial aid is awesome. Became a university NOT college during the 2011-12 school year."
        ]
    ],
    "pageTitle": "Mercyhurst University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Mercyhurst-University/reviews?_escaped_fragment_=/show/75155",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00219-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901002311,
    "recordOffset": 900954871,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{103523=A great school academically with a very small campus. Financial aid is awesome. Became a university NOT college during the 2011-12 school year., 102728=You don't have to be religious to come here but it is a catholic school. Therefore, you will be required to take a religious traditions class. Sometimes in class it is expected that you know things about religion that one who doesn't have that background would not. Aim for high grades, it'll get you more financial aid of course. Also, if you're an Education Major, you receive a $15,000 scholarship right off the bat. MU has its terms split into three trimesters instead of the usual two semesters, but will be switching next year to two semesters plus one term in January where one intensive course is taken., 175388=Mercyhurst operates on a traditional fall/spring semester calendar but also has what is called J-term. J-term is through the month of January and each student takes one class everyday for three hours. It crams a lot of information in a short amount of time but you push another credit out of the way so that's pretty nice. Classes are small which allows for more personal and individualized learning. Because it is a liberal arts college, there are quite a bit of core classes that have to be taken. Some of them are completely irrelevant to your major but you do learn from them., 179321=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/16/2010 Reviewer is A current student here. 9 out of 10 people found this review useful. 1 of 42 Molly from Cranberry, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Categories Comments Campus Safety Police and safety advertises their number everywhere and they are always driving around to make sure things are safe. They are always sending our emails when there is something wrong so that students can pay attention and be safe. Greek Life As far as I know there is nothing special about Greek life Clubs and Activities There are plenty of intermeral sports such as basketball, softball, dodgeball, hockey, soccer, and plenty more. And there are A LOT of clubs! Great for these types of students Students who are serious about their education, and have a little more money to pay the high tuition. Share any unusual traditions or locations on campus St. Patricks day seems to be really big on campus. Our school color is green and there are shamrocks on our clothes. So we seem to be an Irish traditional school is seems. St. Pattys day is really big on campus! Bang for the buck Mercyhurst is a very expensive school. It is a very small campus but it is very benificial to your education. The",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}