{
    "relation": [
        [
            "",
            "ODIs",
            "First-class",
            "List A",
            "Twenty20"
        ],
        [
            "Mat",
            "1",
            "215",
            "184",
            "50"
        ],
        [
            "Inns",
            "1",
            "",
            "",
            "34"
        ],
        [
            "Balls",
            "54",
            "31587",
            "6757",
            "479"
        ],
        [
            "Runs",
            "48",
            "17322",
            "5701",
            "687"
        ],
        [
            "Wkts",
            "0",
            "524",
            "198",
            "20"
        ],
        [
            "BBI",
            "-",
            "7/56",
            "6/27",
            "2/12"
        ],
        [
            "BBM",
            "-",
            "",
            "6/27",
            "2/12"
        ],
        [
            "Ave",
            "-",
            "33.05",
            "28.79",
            "34.35"
        ],
        [
            "Econ",
            "5.33",
            "3.29",
            "5.06",
            "8.60"
        ],
        [
            "SR",
            "-",
            "60.2",
            "34.1",
            "23.9"
        ],
        [
            "4w",
            "0",
            "",
            "3",
            "0"
        ],
        [
            "5w",
            "0",
            "11",
            "3",
            "0"
        ],
        [
            "10",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Paul Franks | England Cricket | Cricket Players and Officials | ESPN Cricinfo",
    "title": "",
    "url": "http://www.espncricinfo.com/countycricket2010/content/player/12906.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00085-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 426442703,
    "recordOffset": 426409492,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{54463=One of Franks' most outstanding achievement for Notts came in 1997, his first full season, when he took the county's first hat-trick for a decade. The following February he became a World Cup winner, vice-captain and influential performer in the England Under-19 side defeat their New Zealand counterparts in the final in Johannesburg. H, 34384=Born February 3, 1979, Mansfield, Nottinghamshire, 61487=Jun 22, 2011, 73484=The Cricket Monthly: The IPL lasts two months, but through the year talent hunters are scouring India (and the internet) for the next big thing. By Niyantha Shekar TCM July issue, 78181=4391 runs after 35, and 2354 outside top five, 60639=Aug 28, 2012, 62668=NBC Denis Compton Award 1997, 1998, 1999, 59742=Jun 6, 2013, 54843=The following winter he was called up as a replacement for the England A team in Zimbabwe and South Africa, and was selected in his own right for the following winter's A tour to Bangladesh and New Zealand. Having previously attended the MRF Pace Foundation in Chennai under the guidance of Dennis Lillee, he was in the provisional squad to attend the 2002-03 ECB National Academy in Australia but did not make the final cut., 53983=Paul Franks' sterling service for Nottinghamshire seemed to be approaching its end when the county of his birth appointed him 2nd XI captain for 2014. He had been playing senior cricket for Notts since 1996, an inspiring example of a one-county professional, and, in his mid-30s, was eager to stay ion the game by working towards the ECB's level four coaching qualification., 55312=Injury struck at exactly the wrong time. An intelligent, thoughtful fast-medium bowler who could make serious contributions with the bat, he had gained international recognition with an appearance for England in a one-day international against the West Indies on his home ground, Trent Bridge. That was in 2000, the year he was elected Young Cricketer of the Year by the Cricket Writers' Club. However he missed much of the 2001 season with a knee injury and did not re-appear until midway through the 2002 season by which time he had fallen a long way down the pecking order. A poor 2003 season further hampered his chances of a recall and gradually he slipped from view., 81946=Since the beginning of 2012, Ian Bell averages 34.69 when batting in the top six; among regular top-order batsmen, only Shane Watson has a lower average, 56027=Injuries and fluctuating form dogged Franks for a number of years but he remained a committed member of the Nottinghamshire squad, bowling at a lively medium pace and contributing useful runs in a number of positions, sometimes opening but more often at number eight. A member of the title-winning sides in 2005 and 2010, he has scored more than 6,800 first class runs, although he is no longer considered a first-choice selection. He was told during the 2012 season that Nottinghamshire would allow him to talk to other counties but said he would prefer to fight for his place at Trent Bridge.}",
    "textBeforeTable": "Batting and fielding averages }); } } window.setTimeout(fixIframe,1300); if($('.FB_ElementReady iframe').height()>38 || $('.FB_ElementReady iframe').height()==0 || $('.FB_ElementReady iframe').height()== null){ $('.FB_ElementReady iframe').css({'height':'30px','width':'300px'}); function fixIframe(){ fixIframe(); jQuery(document).ready(function($){",
    "textAfterTable": "8 8 0 Bowling averages Mat Inns Balls Runs Wkts BBI BBM Ave Econ SR 4w 5w 10 ODIs 1 1 54 48 0 - - - 5.33 - 0 0 0 First-class 215 31587 17322 524 7/56 33.05 3.29 60.2 11 0 List A 184 6757 5701 198 6/27 6/27 28.79 5.06 34.1 3 3 0 Twenty20 50 34 479 687 20 2/12 2/12 34.35 8.60 23.9 0 0 0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}