{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The occasional theft apparently takes place. I have not encountered anyone who has lost anything on this way, i am merely assuming it must happen because of the little signs in the library that say, Watch for thieves! Otherwise, i have never heard of a fight breaking out, nor any other kind of untoward treatment as everyone is marvelously polite (student body and staff). Since the roads connect to a main drag near a Costco, sometimes traffic can be a little hectic but that's the most dangerous thing i can think of near the school.",
            "NONE as far as i know.",
            "I have only participated in Music club, which has been growing into a weekly jam session of many kinds of people. The criminal justice folks hold free legal advice meetings sometimes, International club invites people to multicultural fests sometimes with food, Leadership club gets the students involved in many aspects of campus life... There are more but I am not informed enough to speak at length..!",
            "I am having a great time being back in school, and i feel that Whatcom CC itself is a large part of that! Since I graduated over a decade ago, i have earned some life experience and have developed more patience for academic rigor too. The friends i have made, both students and teachers, are enriching my life with their outlook on life and delightful personalities!",
            "Sports fields border the Western side of campus (soccer/football, tennis), bike and hike trails all over the county, mountains are a popular feature of Whatcom county for hiking, camping, snowboarding/skiing. The nightlife downtown is pretty active, considering the 2 colleges and Western University adding to the youthful energy. Pickford theater plays all kinds of movies, new and old, the IMAX theater is doing its state-of-the-art thing on the East side of town. There are plenty of activities and sights to see in this area if you look for them!",
            "The campus cafe has pre-made sandwiches, veggies, snacks as well as burgers, pizza, rice bowls with veggies and optional chicken. There are plenty of restaurants in the vicinity as well. Among them are a Chinese buffet restaurant, Billy McHale's, Pho Ly, Goji Berry (asian fusion), a pizza place, more pho, Olive Garden, and the nearby Bellis Fair Mall food court.",
            "No dorms here, and i live a few miles away anyhow. There are apartments to the West of campus that make it a mere 3 minute walk to school, though.",
            "There are some very tough classes here as the specialization increases. I have heard stories about some rigorous classes, Nutrition and Anatomy for example, that will keep you busy right up to the end of the quarter. If the classes you are taking are within your interests and you get along well enough with the teacher, you will take a lot away from most classes.",
            "Become friends with the office, cafe, and library folk, their help is invaluable in unexpected ways! There are a number of places around campus to post up outside during sunny weather for outdoor study times when the weather cooperates. Once you get to know some students, ask them about the teachers they have had for classes you intend to take. If their learning style is similar to yours, their advice/review on the matter could save a lot of grief for all involved! Oh, and Bellingham has a great bus system. For $40 (student discount), a 3-month bus pass gives you free range of the county and beyond.",
            "This college has many quality instructors and staff who are enthusiastic about their various fields of work and the student body is diverse as well. In the year i have been there, not one person has been unkind; there have been a couple spots of impatience from the odd person every now and again (understandably around finals time). I look forward to being at school, even under the duress of research papers, projects, and presentations!"
        ]
    ],
    "pageTitle": "Whatcom Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Whatcom-Community-College/reviews?_escaped_fragment_=/show/108746",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00075-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894230127,
    "recordOffset": 894198121,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{113531=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/22/2009 Reviewer is A past student here. 1 out of 2 people found this review useful. 1 of 26 Alanna from Bellingham, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Bang for the buck I feel like I'm getting my money's worth at Whatcom, when I have the very rare bad class it carries less of a heft because I didn't pay University prices for it. For the most part, I feel like I'm getting a great education with a small price tag and for most people's economic situations, that is a very valuable characteristic. Am enjoying being here Other than just good classes, WCC has a beautiful campus that makes the students feel at home. The Syre building is the student center; part cafe, part auditorium, classrooms, and mostly open areas for people to study or talk. There are many clubs, societies, social and academic groups to join or check out. Plus it is close to a lot of local restaurants and Apartments for student housing. Am learning a lot WCC has been a great stepping stone in the progress of my education. Their wide variety of classes gave me an opportunity to become well rounded in different subject matter, from Drawing, to Physics, to Spanish. The teachers are supportive and they have provided as much help as I wanted when I needed it. WCC is a very good learning environment. I feel like a student with a name instead",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}