{
    "relation": [
        [
            "Date",
            "2009-10-15 17:00:00",
            "2008-10-02 11:00:00"
        ],
        [
            "Roundtable Name",
            "2009 NLCS Game One (Phillies/Dodgers)",
            "Thursday Playoff Games"
        ],
        [
            "Comment",
            "Hence my earlier point--you *know*, barring a double-switch, that whoever pitches the eighth is leaving the game before the ninth. You're in a one-run game. One of your relievers is Scott Elbert, and another, Billingsley, is someone on this night you won't use for more than a right-handed batter. Kuo was firing bullets. Certainly seems like over-managing to me. (Christina Kahrl)",
            "Fair point. What do you think about James McDonald and Scott Elbert in terms of their 2008 progress. Did any pitchers in the Dodger org take a big step forward? (Jay Jaffe)"
        ]
    ],
    "pageTitle": "Scott Elbert | Baseball Prospectus",
    "title": "",
    "url": "http://www.baseballprospectus.com/card/card.php?id=ELBERT19850513A",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00098-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 309190943,
    "recordOffset": 309168557,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{106902=Although he has not thrown an MLB pitch in 2015, Scott Elbert threw 1,858 pitches that were tracked by the PITCHf/x system between 2008 and 2014, including pitches thrown in the MLB Regular Season, the MLB Postseason, Spring Training and Fall/Winter Ball. In 2014, he relied primarily on his Slider (84mph) and Fourseam Fastball (89mph)., 44926=Last Update: 12/31/2014 23:59 ET}",
    "lastModified": "Wed, 05 Aug 2015 04:30:18 GMT",
    "textBeforeTable": "BP Roundtables Double ouch, and I thought I had it rough trying to consider the merits of a stack of mediocre lefties for my bullpen. I'd take Elbert, if only because the track record for getting hurt is slightly shorter, and in part out of recognition that the Dodgers should do a good job getting him back in action. (Christina Kahrl) In a keeper strato league would perfer Adam Loewen or Scott Elbert? (goiter6 from MN) 2008-02-28 14:00:00 (link to chat) He does, and I think he future lies in the bullpen because of it. (Kevin Goldstein) Kevin, what do the Dodgers think of Scott Elbert? Has he become a bullpen arm, or might he get a shot at a rotation opening? He seems to have that \"fragile\" tag, no matter what the facts indicate. (Drew from New York) 2010-01-04 14:00:00 (link to chat) It's gonna be really interesting to see what they do with the bottom of their rotation. Hell, it's already pretty strange what they're doing with the top of their rotation. (Do you think they'd start Padilla Game 1 if this was the playoffs? I really",
    "textAfterTable": "  PITCHf/x Pitcher Profile A Collaboration between BrooksBaseball.net and Baseball Prospectus - Pitch classifications provided by Pitch Info LLC Although he has not thrown an MLB pitch in 2015, Scott Elbert threw 1,858 pitches that were tracked by the PITCHf/x system between 2008 and 2014, including pitches thrown in the MLB Regular Season, the MLB Postseason, Spring Training and Fall/Winter Ball. In 2014, he relied primarily on his Slider (84mph) and Fourseam Fastball (89mph).   Baseball Prospectus Analysis Blog Radio Events Newsletter Search News Player Cards Player Search Team Audit Statistics Fantasy Player Forecast Manager Depth Charts Team Tracker Hacking Mass Team Health Reports BP.com Terms of Service Customer Service Privacy Policy Contact Us Glossary AMERICAN LEAGUE Baltimore Orioles",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}