{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3"
        ],
        [
            "Command or Action",
            "Switch(config)# atm lecs-address-default address1 [address2... ]",
            "Router(config)# exit",
            "Switch# copy running-config startup-config"
        ],
        [
            "Purpose",
            "Specifies the LECS's ATM address for the entire switch. Use the addresses from your LANE worksheet and specify the full 40-digit ATM address.",
            "Exits global configuration mode.",
            "Saves the configuration value permanently."
        ]
    ],
    "pageTitle": "Asynchronous Transfer Mode Configuration Guide, Cisco IOS Release 12.4T - Configuring Token Ring LAN Emulation [Cisco IOS Software Releases 12.4 T] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/atm/configuration/12-4t/atm-12-4t-book/atm-cfg-tr-lan-em.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00106-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 371524727,
    "recordOffset": 371482509,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{66400=To enter a LECS ATM address into a LightStream 1010 switch and save it there permanently, use the following commands on the Cisco LightStream 1010 switch beginning in global configuration mode:, 140052=1005, 197071=This section provides a configuration example composed of two Catalyst 5000 series switches and a Cisco LightStream 1010 ATM switch as shown in the figure below., 54443=To display the current prefix on the Cisco LightStream 1010 switch, use the show network EXEC command., 54645=To set the ATM address prefix, use the following commands on the Cisco LightStream 1010 switch beginning in global configuration mode:, 140286=If you currently have a different ELAN name for VLAN 1 or VLAN 1003, you must change the ELAN name to default (for VLAN 1) or trcrf-default (for VLAN 1003) in the LECS database. The following example shows an LECS database configuration that specifies marktng as the ELAN name for VLAN 1003:, 139393=VLAN0002 through VLAN1002, 139905=VLAN1004, 52634=Before you configure LANE components on a Catalyst 5000 series switch ATM module, you must configure the Cisco LightStream 1010 switch with the ATM address prefix to be used by all LANE components in the switch cloud., 206716=4.    Using the LECS address obtained in Step 3, set the address of the default LECS in the LightStream 1010 switch by entering the configure terminal and atm lecs-address-default commands on the console of the LightStream 1010 switch. You see the following display:, 139557=1003, 141062=You must change the ELAN name for VLAN 1003 from marktng to trcrf-default in the second and last lines of the display, as follows:, 139291=2...1002, 139807=1004, 66004=You must enter the LECS ATM address into each ATM switch (such as a Cisco LightStream 1010 ATM switch) connected to an ATM module in your LANE network and save the address permanently so that the value will not be lost when the switch is reset or powered off. Programming the LECS addresses allows the LESs and LECs to determine the LECS addresses dynamically through ILMI., 210017=The LightStream 1010 ATM switch provides a default prefix.}",
    "textBeforeTable": "DETAILED STEPS 3.    Switch# copy running-config startup-config 2.    Router(config)# exit 1.    Switch(config)# atm lecs-address-default address1 [address2... ] SUMMARY STEPS To enter a LECS ATM address into a LightStream 1010 switch and save it there permanently, use the following commands on the Cisco LightStream 1010 switch beginning in global configuration mode: You must enter the LECS ATM address into each ATM switch (such as a Cisco LightStream 1010 ATM switch) connected to an ATM module in your LANE network and save the address permanently so that the value will not be lost when the switch is reset or powered off. Programming the LECS addresses allows the LESs and LECs to determine the LECS addresses dynamically through ILMI. Entering the LECS ATM Address on the LightStream 1010 Switch Displays the LANE default addresses. ]] [.subinterface-number ATM# show lane default-atm-addresses [interface atm number        Purpose    Command",
    "textAfterTable": "Configuring the LECS Database The LECS database contains LANE configuration information, including ELAN name-to-LES/BUS ATM address mappings, LEC address-to-ELAN name mappings, and the name of the default ELAN, if specified. You must configure at least one LECS database in the LANE network. When configuring the LECS database, remember the following guidelines: You can configure redundant LECSs. Redundant LECSs should be configured on different devices in the LANE network. If you configure more than one LECS, make sure that all databases with the same name are identical. You can specify one default ELAN in the database. The LECS assigns any client that does not request a specific ELAN to the default ELAN. ELANs are either restricted or unrestricted. The LECS assigns a client to an unrestricted ELAN if the client specifies that particular ELAN in its configuration. However, the LECS only assigns a client to a restricted ELAN if the client is specified in the LECS's database as belonging to that ELAN. The default ELAN should have unrestricted membership. If you are configuring fault tolerance, you can have any number of servers per ELAN. Priority is determined by entry order; the first entry has the highest priority unless you override",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}