{
    "relation": [
        [
            "Patent application number",
            "20110094806",
            "20130296094"
        ],
        [
            "Description",
            "Electric Drive Unit With Modular Motor Assembly - An electric drive module for a motor vehicle includes an electric motor assembly having a cartridge housing containing a stator, a rotor, and a rotor shaft. The rotor shaft is supported by the cartridge housing. The electric motor assembly is positioned within an axle housing. A reduction unit includes an input member being driven by the rotor shaft and includes an output member driven at a reduced speed relative to the input member. A differential assembly includes an input driven by the output member, a first differential output driving a first output shaft, and a second differential output driving a second output shaft.",
            "ELECTRIC DRIVE UNIT WITH MODULAR MOTOR ASSEMBLY - An electric drive module for a motor vehicle includes an electric motor assembly having a cartridge housing containing a stator, a rotor, and a rotor shaft. The rotor shaft is supported by the cartridge housing. The electric motor assembly is positioned within an axle housing. A reduction unit includes an input member being driven by the rotor shaft and includes an output member driven at a reduced speed relative to the input member. A differential assembly includes an input driven by the output member, a first differential output driving a first output shaft, and a second differential output driving a second output shaft."
        ],
        [
            "Published",
            "04-28-2011",
            "11-07-2013"
        ]
    ],
    "pageTitle": "Mann, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/mann-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00271-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 444056759,
    "recordOffset": 444018374,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Harminder Mann, Sterling Heights, MI US 04-02-2009 Program memory test access collar - A memory access device includes logic to switch data from a processor memory bus to a memory bus in a first operational mode, and to switch data from a test bus to the memory bus in a second operational mode, and logic to switch address signals from the processor memory bus to the memory bus in the first operational mode. In the second operational mode the device accepts from the test bus a starting memory address for memory reads and writes, and automatically and independently of the test bus adjusts a memory address for reads and writes during burst memory operations. 20090089472 Published Description Patent application number Gregory J. Mann, Colorado Springs, CO US 10-01-2009 PROCESS CONTROL SYSTEM WITH ABILITY TO EXCHANGE DATA WITH PRODUCTION LINE MACHINE CONTROLLERS - A system and method for integrating a production line process control system (PCS) with production line machine controllers to record data about processes completed on a production line. The PCS receives data from line controllers regarding processes that are completed on each part. Process data including process order data is stored by the PCS and used to instruct line controllers on whether a particular part should be accepted for machining or handled in another way. Rejected parts are flagged electronically so when they arrive at a subsequent line controller, they are directed to",
    "textAfterTable": "Herrick A. Mann, Pepper Pike, OH US Patent application number Description Published 20120110862 Marker installation tool - A method and apparatus of installing markers into a variety of ground conditions is described. Application of marker installation tool provides for complete installation in hard, soft, wet, dry, frozen, and a variety of other ground conditions, whether the marker is rigid or flexible. By inserting a marker into the tool, it can be easily and rapidly driven into the ground. A sharpened end portion on one end of the tool provides for driving a hole into the ground in preparation of installing a marker. 05-10-2012 James H. Mann, Hyde Park, VT US Patent application number Description Published 20100320713 Truckbed access apparatus - A truckbed access apparatus consisting of a first hollow support component, a second hollow support component affixable over and about the first support component with a step plate affixed thereto, a first holding pin for holding the first support component to a truck reese hitch unit, a second holding pin for holding the second hollow support component to the first one, a vertically inclined support rod affixed through a hole in the step plate to one side thereof and also to the second hollow support component and with a brace component held to the support rod and also to a threaded hook unit in turn hooked into a hole found",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}