{
    "relation": [
        [
            "QTY & UK SIZE",
            "2 Per Pack Fully Lined Narrow (Sml toe)",
            "4 Per Pack Fully Lined Narrow (Sml toe)",
            "2 Per Pack Fully Lined Wide (Big toe)",
            "4 Per Pack Fully Lined Wide (Big toe)"
        ],
        [
            "CODE",
            "P1090",
            "P1090A",
            "P1091",
            "P1091A"
        ],
        [
            "PRICE",
            "£5.95",
            "£9.95",
            "£6.50",
            "£10.95"
        ],
        [
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Treatments for Osteoarthritis and Rheumatoid Athritis in the feet - Gel insoles & pads.",
    "title": "",
    "url": "http://www.footcareonline.co.uk/arthritis.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00076-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 464384957,
    "recordOffset": 464376755,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40545=P1090, 42292=P1091}",
    "lastModified": "Sat, 01 Jun 2013 08:51:12 GMT",
    "textBeforeTable": "OSTEOARTHRITIS & RHEUMATOID ARTHRITIS There are various types of arthritis but the two most commonly found in the feet are Osteoarthritis and Rheumatoid arthritis. Osteoarthritis is a localised condition and is caused due to gradual wear and tear of the cartilage in the joints. Age, excessive weight, ill-fitting shoes and trauma (injury) can all be contributory factors to osteoarthritis. In the case of Rheumatoid arthritis this is a systemic condition and has the potential to affect every joint in the body. Arthritis is usually a very painful condition and is advisable to seek advice and treatment from your family doctor. In diagnosis of arthritis, a good complete history including blood tests are used to differentiate between one arthritis type and another. Also x-ray evaluation to view the bone structure of the foot and in more advanced cases of arthritis an MRI (magnetic resonance imaging) or CT scan (computerised axial tomography) are extremely helpful. In most cases, the ball of the foot is painful due to a lack of the the fatty padding, leaving the bones on the soles of the feet exposed and unprotected, combined with this the feet and legs can ache because",
    "textAfterTable": "1 Pair Per Pack       Unisex One Size AP3465 £8.95 CURRENCY CONVERTER - ORDER BY POST OR PHONE  FULL LENGTH GEL ARCH SUPPORT",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}