{
    "relation": [
        [
            "Date of Receipt",
            "11/8/2006",
            "11/8/2006",
            "11/21/2006"
        ],
        [
            "Date of review",
            "11/17/2006",
            "11/17/2006",
            "11/22/2006"
        ],
        [
            "Action Taken",
            "Called Engineer",
            "Called Engineer",
            "Approved Plans 11/22/06 Approval Number: 0689145"
        ]
    ],
    "pageTitle": "ISDH: Wayne County Plan Review Project Status",
    "title": "Plan Status:",
    "url": "http://in.gov/isdh/23136.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 131823307,
    "recordOffset": 131804400,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33523=Martin Dale School 12020 Mendenhall Rd Project Number: 8914137 Reviewer: Robert Synko, 34995=Meadow Creek Amish School 5079 Palmer Rd Project Number: 8912118 Reviewer: Ed Miller, 13153=For information on projects submitted before January 1, 2005, please contact the Environmental Public Health Division., 43988=Warm Glow Candle Co. 2131 N. Centerville Rd Project Number: 8905364 Reviewer: Ed Miller, 52120=Harbor Lights MHP 812 NW 5th St Project Number: 8912155 Reviewer: Robert Synko, 42313=Sunny Meadow School 1099 Overman Rd Project Number: 8914136 Reviewer: Robert Synko, 24070=Deer Run Amish School 10206 Bonn Rd Project Number: 8912082 Reviewer: Ed Miller}",
    "textBeforeTable": "System Type: No Referred to LHD: Action Taken: Date of Review: Soils Survey Received: Soils: Deer Run Amish School 10206 Bonn Rd Project Number: 8912082 Reviewer: Ed Miller System Type: No Referred to LHD: Action Taken: Date of Review: 6/4/2015 Soils Survey Received: Soils 2:   Mound System Type: No Referred to LHD: Technical Data Sheet issued Action Taken: 5/12/2015 Date of Review: 4/21/2015 Soils Survey Received: Soils 1: Cope Environmental Ctr Airport Rd Project Number: 8915084 Reviewer: System Type: No Referred to LHD: Technical Data Sheet issued Action Taken: 5/8/2009 Date of Review: 4/14/2009 Soils Survey Received: Soils: Bohlander Pet Crematory 13271 W US 40 Project Number: 8909066",
    "textAfterTable": "Plan Status: Date of Receipt Date of review Action Taken 2/9/2007 2/13/2007 Approved Plans 2/9/2007 2/13/2007 Approved Plans 02/15/07 Approval Number: 0789017 Equine Veterinarian Clinic S of 3361 SR 227 Project Number: 8908274 Reviewer: Ed Miller Soils: Soils Survey Received: 9/11/2008 Date of Review: 10/16/2008 Action Taken: Technical Data Sheet issued Referred to LHD: No System Type: Flood-Dosed Plan Status: Date of Receipt Date of review Action Taken 1/15/2009 1/16/2009 Called Engineer 1/15/2009 1/16/2009 Called Engineer 1/21/2009 1/22/2009 Approved Plans 01/22/09 Approval Number: 0989005 Firehouse Green TWP Williamsburg Comm. Cntr Project Number: 8907029 Reviewer: Dennis Ehlers (Retired) Soils: Soils Survey Received: 1/19/2007 Date of Review: 2/5/2007 Action Taken: Technical Data Sheet issued Referred to LHD: No System Type: Flood-Dosed Hillcrest Baptist Church",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}