{
    "relation": [
        [
            "VESSEL NAME",
            "Esso Mercia",
            "Esso Anglia",
            "Esso Bernicia",
            "Esso Scotia",
            "Esso Cambria",
            "Esso Northumbria",
            "Esso Hibernia",
            "Esso Ulidia",
            "Esso Caledonia",
            "Esso Demetia",
            "Esso Dalriada"
        ],
        [
            "YEAR",
            "1967",
            "1968",
            "1968",
            "1969",
            "1969",
            "1970",
            "1970",
            "1970",
            "1971",
            "1973",
            "1973"
        ],
        [
            "GRT",
            "87,002",
            "97,082",
            "96,903",
            "127,158",
            "127,158",
            "126,543",
            "126,539",
            "126,538",
            "126,535",
            "125,293",
            "125,331"
        ],
        [
            "DWT",
            "169,496",
            "193,361",
            "193,658",
            "253,962",
            "253,962",
            "254,277",
            "254,277",
            "254,011",
            "250,011",
            "258,979",
            "259,042"
        ],
        [
            "BUILDER",
            "A. G. Weser",
            "Chantiers de l’A",
            "Howaldtswerke",
            "A. G. Weser",
            "Verolme Dok en Sch.",
            "Swan Hunter S. B. Ltd.",
            "Swan Hunter S. B. Ltd",
            "Harland & Wolff Ltd",
            "Harland & Wolff Ltd",
            "Kockums Mekaniska",
            "Kockums Mekaniska"
        ],
        [
            "PROPULSION",
            "Steam Turbine",
            "Steam Turbine",
            "Steam Turbine",
            "Steam Turbine",
            "Steam Turbine",
            "Steam Turbine",
            "Steam Turbine",
            "Steam Turbine",
            "Steam Turbine",
            "Steam Turbine",
            "Steam Turbine"
        ],
        [
            "ULTIMATE FATE",
            "B/U at Kaohsiung in 1984",
            "B/U at Kaohsiung in 1978",
            "B/U at Kaohsiung in 1979",
            "B/U at Kaohsiung in 1981",
            "B/U at Kaohsiung in 1982",
            "B/U at Kaohsiung in 1982",
            "B/U at Kaohsiung in 1984",
            "Laid up 1983. B/U in 1983",
            "B/U at Masan in 1982",
            "B/U in 1994 after E.R. fire",
            "Sold to Liberia in 1984"
        ]
    ],
    "pageTitle": "Clyde Maritime | The one-stop resource for all Clyde-based shipping news",
    "title": "",
    "url": "http://www.clydemaritime.co.uk/esso",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00226-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 385540751,
    "recordOffset": 385508869,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38465=B/U in 1923, 47349=Lost due to mine in 1944, 117023=Broken up in 1935 by UK shipbreakers, 229673=Dec  1963, 99652=Capsized in 1900, 251642=1975, 93193=Foundered in 1917, 210189=B/U at Santander in 1975, 257820=Esso Al Duriyah in 1983. Laid up in 1985., 153866=Submarine loss in Oct 1941, 96142=Disposed of in 1924, 241065=B/U at Masan in 1982, 245437=B/U Masan, Korea in 1982, 233481=B/U at Dongsham in 1988, 115092=Sunk by enemy torpedo on 05-07-1917, 158763=Sunk Atlantic by U-67 -  June 1942, 202072=B/U at Essex in 1966, 236763=B/U at Kaohsiung in 1984, 32543=B/U in 1925, 237301=B/U at Kaohsiung in 1978, 176211=1944, 194228=1954, 250514=B/U Kaohsiung in 1983, 209254=Sold in 1972, 170167=B/U in Japan in 1953, 203196=The Esso Wandsworth was in collision with a large Dutch vessel (Moerdyk) in fog on the night of 23 September 1965, in the vicinity of the Ovens Buoy, Lower Hope Reach, and was beached on nearby mudflats.  Subsequently refloated, she discharged her cargo at Purfleet then proceeded to Gravesend to undergo repairs.  On 12 October 1965, whilst this work was in progress, there was a massive explosion on board and subsequent drydocking at Tilbury indicated that the vessel could not be economically repaired.  In December of that year, she was delivered to Grays of Essex for scrapping., 241595=B/U in 1994 after E.R. fire, 173874=1943, 132166=Broken up in 1972, 126745=1936, 166280=B/U at Formosa in November 1959, 172373=B/U Antwerp in 1959, 107335=1902, 260219=Laid up at Aalesund 1983, 138141=Hulked in 1959, 186410=B/U Middlesbrough in 1980, 209755=B/U at Piraeus in 1976, 121946=1919, 202578=B/U at Bruges in 1969, 161678=1940, 207057=Arrived Valencia for scrapping - February 1965, 158315=B/U at Istanbul in 1960, 194662=1961, 176049=B/U Belgium in 1967, 118601=Sunk by enemy torpedo on 01-03-1941, 262746=The name of the Humble Transportation Company became the Exxon Transportation Company, Houston, and from around mid-1973 all the ships of the Company were renamed with the prefix ‘Exxon’ to their place names., 123268=1921, 96566=Stranding loss in 1909, 175595=Sold off in 1963, 234516=1964, 81406=B/U in 1950, 107855=1899, 116642=Broken up at Morecambe in1916, 172820=B/U Belgium in 1961, 205938=To Canadian owners in 1960  :   Barge in 1978, 152561=Broken up at Blyth in 1954, 182166=B/U Bremerhaven 1954, 254388=B/U Kaohsiung in 1986, 261750=Laid up at Brunei Bay 1983.   Sold to USA 1986., 48843=Lost by fire in 1915, 238365=B/U at Kaohsiung in 1981, 228686=B/U at Kaohsiung in 1976, 127136=DISTRIBUTING SHIPS OF ANGLO-AMERICAN OIL COMPANY FROM 1915 TO 1939, 160136=B/U at Savona in 1959, 201593=B/U at Hamburg in 1965, 234083=1963, 230228=On 22 February 1965, the S.S. Esso Lincoln struck the Avocet Rock in the Red Sea, at speed, during a passage from Jabbal Dhanna to Milford Haven, sustaining severe damage, which was later repaired in Italy. , 240522=Laid up 1983. B/U in 1983, 29572=Submarine Loss in 1917, 36978=Scuttled in 1944, 215652=Esso Nicaragua in 1964, 117594=1906, 237838=B/U at Kaohsiung in 1979, 157408=Mined/Sunk near Falmouth - 1940, 115649=1905, 258239=Laid up in Brunei Bay in 1984, 259792=Sold to Gibraltar 1985.      Sold for storage1985., 257375=Damaged by Exocet missile 50 miles South of Kharg Island in Oct 1986.  Sold to Greece 1986, 105198=B/U Osaka in 1936, 66603=B/U in 1931, 185534=B/U Haulbowline in 1984, 124408=Sold off for breaking up in 1947, 128745=Sunk as blockship in 1940, 216090=Esso Balboa in 1962, 108373=1907, 166900=Deleted from the Argentinian Navy List in 1971, 153006=Broken up at Blyth in 1953, 101323=Hulked China in 1928, 136011=W.G.S. Crouch Ltd. in 1963, 209693=Sold in 1968, 129589=Scuttled at Brest in June 1940, 106806=1909, 118988=Sunk by enemy gunfire on 25-06-1940, 62142=Stranded & B/U in 1924, 53295=B/U in 1947, 168067=Torpedoed/Sunk by E-Boat  -  November 1944, 138575=Broken up in 1956, 84648= COASTERS/RIVER CRAFT OF ANGLO-AMERICAN OIL COMPANY OF LONDON  :   1856-1912, 151251=Broken up at Vado in 1966, 161048=Esso Cheyenne in 1945, 135582=Alden Shipping Coy. in 1956, 102586=Foundered in 1907, 165366=Scuttled in the Whangpoo River -  May 1949, 59193=B/U in 1949, 41438=Wrecked in 1908, 118771=1918, 113711=OIL TANKERS ACQUIRED BY ANGLO-AMERICAN OIL DURING THE 1914-1918 WAR, 188142=Sold in 1981 to Lebanon, 113241=1886, 131741=Broken up in Belgium in 1962, 118217=Broken up in 1935 at Queenstown, 144775=1934, 217908=B/U Masan in 1975, 222723=Renamed Petro Milford Havenin 1994, 129755=1912, 178240=B/U Vado in 1963, 185979=B/U Aviles in 1975, 42912=Stranding loss in 1913, 146243=1922, 106982=1895, 155712=SHIPS MANAGED BY ANGLO-AMERICAN OIL COMPANY FOR M.O.W.T.  :   1939  -  1946, 229267=May 1963, 101744=B/U London in 1938, 215724=B/U Kaohsiung in 1977, 205565=Broke in two, off Colon, in December 1968, 184844=1952, 57714=Scuttled in 1936, 153430=Broken up at Trieste in 1958, 177798=B/U Castellon in 1965, 155593=Broken up at Baltimore - 1949, 110808=1898, 160581=B/U at Burght, Belgium in 1961, 111331=1892, 115480=Sunk by enemy torpedo on 07-12-1917, 217396=Esso Jamaica in 1962, 167799=B/U at Formosa in 1963, 83529=The Company’s fleet of oil carriers flew the Anglo-American houseflag portraying a black eagle astride a white ball, with navy blue and deep red diagonal sections as its background colours. During the Great War of 1914-1918, many of the Company’s vessels were taken over by the Government for war duties and during this war the Purfleet facility received the unwelcome attention of German Gotha bombers and Zeppelins, but no serious damage was sustained.  The facility was enlarged again in 1938, to provide further storage capacity in preparation for the war that was foreseen as inevitable. , 149113=The Anglo-American Oil Company lost nine of its vessels through enemy action during the 1939-1945 War, leaving ten of its pre-war vessels in the fleet in 1946.  From 1947, with the formation of the Esso Transportation Company Limited, formed by renaming the Lago Shipping Company Limited, a new funnel emblem was introduced in place of the red black-topped Anglo-American funnel.  It took the form of the ESSO oval on a white band on a black funnel.  The ‘oval’, edged in blue, had the word ‘Esso’ in red.  Gradually the vessels from this time were renamed with the Esso prefix., 225652=May  1961, 232768=1962, 187012=1958, 226142=Jul    1962, 84147=During the Second World War, the Purfleet terminal did not escape as lightly from enemy attention as was the case in the previous War.  Twenty direct hits were recorded in 1940 and further hits during 1941 caused much devastation and destruction.  Ships alongside were hit and caught fire, ashore there were many fires and resulting explosions, some of these fires burning for over a week.  Inevitably some lives were lost during this difficult time., 248748=Laid up in 1983.    Sold off in 1985 to USA, 86854=B/U in 1939, 226635=Jan   1967, 244812=1972, 110458=1890, 220150=THE ‘ESSO FAWLEY’ CLASS OF 1967 / 1968, 131303=Broken up at Essex in 1948, 25132=Wrecked in 1929, 167214=B/U at Formosa in 1965, 125884=1930, 238001=1969, 222313=Renamed Petro Fawleyin 1994, 90659=ACQUISITIONS OF THE ANGLO-AMERICAN OIL COMPANY OF LONDON  :   1897-1917, 136174=1925, 123710=1928, 139454=Sold to Bowker King in 1966, 250883=Laid up in Brunei Bay in 1983, 177371=B/U Aioi in 1963, 157864=B/U at Spain in 1953, 127012=B/U Grimstad 1962 as Esso Plymouth, 203085=B/U at Bilbao in 1970, 261876=In late 1972, the Standard Oil Company (New Jersey) changed its name to the Exxon Corporation.  One of the main reasons for the name change was the long-standing confusion there had been between Standard Oil (New Jersey) and other competing companies in the USA that used the ‘Standard Oil’ name.  The decision to change came about following a court ruling that the Esso trademark could not be used nationwide. , 244274=B/U Kaohsiung in 1982, 117197=1873, 215286=B/U Kaohsiung in 1975, 102165=B/U Italy in 1923, 109941=1901, 71040=Wrecked in 1932, 121571=1920, 228852=Feb  1963, 129154=Bombed & Sunk in Dec 1940, 134715=Broken up in 1950, 163777=B/U in 1977, 143806=1927, 63632=Submarine Loss in 1918, 139012=Sold to H.G. Pounds in 1958, 225004=Sold in 1981, 112370=1883, 209316=B/U at Castellton in 1974, 44392=Wrecked in 1916, 239069=1970, 108027=1900, 199284=During the Second World War, ten special shallow-draught oil tankers were built for the newly-formed Creole Petroleum Corporation of Panama, a subsidiary of the Standard Oil Company of New Jersey.  Four of these vessels were transferred from the Panamanian flag to the British flag and Esso Petroleum Company in 1956.  These were trunk-decked twin-screw triple expansion engine vessels of 5,500 DWT and on arrival in UK waters from Venezuela they were fitted out for UK coastal service by Brigham & Cowan Limited and Palmers of Hebburn.  Their primary purpose was the carriage of oil between Fawley Refinery and the various power stations of the CEGB.  The four vessels were:, 15705=OIL CARRIERS OF THE ANGLO-AMERICAN OIL COMPANY OF LONDON  :  1889-1914, 255858=Laid up in Phuket, Thailand in 1984, 170091=Returned to Owners in 1946, 92340=Submarine Loss - 1917, 39944=Posted missing in 1921, 116030=1915, 198748=1960, 168668=B/U at Formosa in 1962, 162422=Renamed Esso Appalachee in 1946, 54777=B/U in 1933, 185266=1955, 260008=1977, 151692=Broken up in 1960, 106457=1894, 12868=In 1855, at the age of sixteen years, the American John D. Rockefeller moved into an office of commission brokers in Cleveland, Ohio, and soon after became a partner in his own firm, Clark & Rockefeller.  In 1859, oil was discovered in Pennsylvania and the visionary Rockefeller took an early interest in these developments, travelling to Pennsylvania to see for himself what this new industry might have to offer.  Although the industry was highly unstable in these early days, Rockefeller saw the great potential of oil.  In 1863, in partnership with a British engineer named Samuel Andrews, Rockefeller invested $4,000 in the construction of a refinery in Cleveland, Ohio, and took the first steps to becoming one of the richest men in the world.  Within two years, Rockefeller bought out his partner (Clark) and the firm became known as Rockefeller & Andrews.  By 1870 the business had expanded rapidly and in June of that year all their interests were incorporated as the Standard Oil Company (Ohio).  The business continued to grow rapidly and on 27 April 1888 acquired their first foreign affiliate which was named the Anglo-American Oil Company, destined to become one of the largest companies in Great Britain involved in the bulk transportation of oil products.  The Company opened offices at 16 Great St. Helens, London, later moving to Dock House, Billiter Street, and later 22 Billiter Street., 260977=Laid up at Vestnes   1983, 100492=Submarine loss in 1916, 163878=The following twelve small Type T1-M-A1 oil tankers, all built by the Barnes-Duluth Shipbuilding Company of Minnesota, USA between May 1943 and October 1943, were operated for a period during WWII by the Anglo-Amercian Oil Company under the Red Ensign as part of the Lease/Lend Agreement.  All these vessels were built to the same design, measuring 210 feet in length x 37 feet in breadth, 1,600 DWT, with oil engines giving a speed of 10 knots., 123100=Sold off for breaking up in 1933, 23661=B/U in 1929, 225486=Sold in 1980, 122217=Bombed and sunk in February 1941, 205181=Sank in the Gulf of Campeche in January 1960, 180414=B/U Bilbao in 1975, 102708=AMERICAN-BUILT SHIPS OF THE ANGLO-AMERICAN OIL COMPANY OF LONDON  :  1900-1902, 35498=B/U in 1934, 219161=Esso Honduras in 1964, 251853=Laid up in Brunei Bay in 1985, 114871=1914, 130870=Broken up at Llanelly in 1953, 255130=B/U Kaohsiung in 1985, 137878=1926, 15088=To accommodate the growing fleet, Anglo-American Oil constructed the large storage wharf at Purfleet on the Thames from where smaller vessels transhipped the commodity to various ports around the British Isles and Dublin, Ireland.  By the turn of the century, the ships were increasing in size, up to 8,400 DWT.  In 1903 the Company took delivery of its largest ship until then, the 9,196 GRT NARRAGANSETT, at that time the largest oil tanker in the world and the largest vessel to be built in the lower reaches of the Clyde, from the Yard of Scott & Coy of Greenock., 178677=B/U Split in 1963, 224524=Sold in 1978, 226467=Sold in 1985, 176489=B/U/ Faslane in 1963, 19223=B/U in 1924, 154732=Submarine loss in Sept 1941, 226950=Sold in 1983, 151415=1932, 89168=B/U in 1954, 163328=B/U at Split in 1960, 218344=B/U Kaohsiung in 1978, 97843=Stranding loss in 1901, 182276=In 1951 the Anglo-American Oil Company was primarily a marketing organisation dealing with distribution and sales, whereas responsibility for the provision of tonnage and management of the tanker fleet had been covered by the Esso Transportation Company Limited from 1947.  In 1951, with the new refinery at Fawley about to begin production, the Anglo-American Oil Company became a major producer of petroleum products and its whole scope of activities changed.  The transportation aspect also greatly increased at this time with increased distribution and requirements to feed the new refinery.  Consequently it was decided to re-assume control of the tanker fleet and set up a Marine Department to take responsibility for the management and operation of the fleet, maintenance and repairs of the ships, new construction, and the chartering of vessels.  With these changes came a change of Company name, from the Anglo-American Oil Company to the Esso Petroleum Company Limited.  In a similar manner, the parent Company in the USA, the Standard Oil Company (New Jersey), had been transferred to a new subsidiary Company in 1950, the Esso Shipping Company., 189591=1951, 220276=When built in Sweden, the ‘Esso Fawley’ class at just over 18,000 TDW were the largest vessels in Esso’s coastal fleet and were designed for distributing refined products from the Fawley and Milford Haven refineries.  They became frequent users of the Dingle tanker buoy berth in the River Mersey, completed in August 1967, and connected to the onshore Dingle Bank Oil Storage Facility adjacent to the Herculaneum Branch Dock, where importation of oil first began in 1892.  Two oil engines, geared to a single controllable-pitch propeller, giving the vessels a speed of 16.25 knots powered these ships.  (A third vessel of the same class, the Esso Slagen, was completed by A/B Lindholmens, in October of 1968, for Esso Norske of Oslo)., 78445=Bombed & B/U in 1940, 87785=Collision loss -1943, 26610=Submarine Loss in 1941, 94879=Was still afloat in 1950, 161505=Bombed/Sunk Mediterranean - 1940, 230455=In 1977, the S.S. Esso Newcastle was converted by a Japanese shipyard to become a ‘floating separation/gas-treating/storage facility’ for crude oil production, and renamed W.P. No. 1.  Her deckhouse, funnel and engines were removed for this new purpose.  In 1980, she was renamed Exxon Santa Ynez and moored some 3-4 miles offshore at the Hondo Field, off Santa Barbara, California, attached to a single anchor leg mooring system about 1-2 miles from the production platform., 262969=Although the name ‘Esso’ offered no such problems to international affiliates, the new name, ‘Exxon’, was registered in virtually every country in the world where trademark registration is available in order to protect its possible future use worldwide.  In May 1983, all ships of the Exxon Transportation Company were transferred to Exxon Shipping Company of Houston., 258988=Laid up at Aalesund 1982. Sold for storage 1986., 225972=Sold in 1973, 179114=B/U Bilbao in 1971, 158477=1941, 116806=1916, 115858=Sunk by enemy torpedo on 04-09-1915, 222085=Sep 1967, 89625=B/U in 1955, 245984=1974, 244647=B/U Inchon, Korea in 1984, 217838=Esso Trieste in 1963, 126577=Submarine loss in December 1940, 129320=1911, 162881=B/U at Dunston in 1949, 74009=B/U in 1962, 50327=B/U in 1932, 228436=Sep  1962, 176930=B/U Belgium in 1963, 206697=Sunk in Caribbean, by U-518, in March 1944, 219232=B/U Kaohsiung in 1976, 135746=1924, 177527=1945, 234788=B/U at Split in 1982, 123540=Sold off for breaking up in 1936, 266792=Site designed and maintained using drupal by Montfode Design ©2013 ClydeMaritime, 155158=Broken up at Baltimore - 1950, 22189=B/U in 1937, 122656=Submarine loss in September 1939, 232602=B/U at Kaohsiung in 1975, 117815=Broken up in 1947 by Indian shipbreakers, 20696=Posted missing in 1929, 171935=B/U Osaka in 1959, 94025=Sold at auction - 1903, 168780=In addition to the above small oil tanker wartime fleet, Anglo-American Oil Company also operated a 1920-built 3-cylinder triple-expansion steam engined vessel built by the Bethlehem Shipbuilding Corporation of Alameda, California, for Standard Transportation Company Incorporated of New York (Socony Vacuum Oil Company)., 218275=Esso Genova in 1963, 188563=Sold in 1964 to Whitaker Ltd, 211606=The 1954-built Esso Cambridge of the Esso Petroleum Company was one of the first oil tankers affected by the Suez crisis of 1956.  At 21:30 hours on 31st October 1956 the Esso Cambridge was in a position 110 miles East of Gibraltar bound for Mena Al Ahmadi in the Persian Gulf via the Suez Canal, to load crude oil for the refinery at Fawley.  A radio message came through to the Master from Esso instructing the vessel to proceed to the Gulf via the Cape of Good Hope calling in Cape Town for bunkers due to the expiry of the Anglo-French ultimatum to Egypt earlier that day without result.  The impact of the non-navigable Suez Canal for over five months, until early April 1957, had a profound effect on the marine operations of Esso and all other oil majors. , 187709=Sold in 1981 to Saudi Arabia, 214426=B/U Bilbao in 1976, 133892=Broken up at Essex in 1950, 167507=B/U at Formosa in 1959, 230038=In July of 1964, the S.S. Esso Cardiff was sent to the Tyneside Yard of Palmers of Hebburn to become the first of the Company’s ships to have the new bulbous bow fitted. , 225169=Mar  1961, 95294=Foundered in 1909, 214856=B/U Kaohsiung in 1979, 224691=Nov  1960, 135308=1923, 117413=Broken up in 1935 by Italian shipbreakers, 245814=Was still in service in 1986, 88706=Disposed of in 1921, 255489=B/U Ulsan in 1984, 163489=1946, 240689=1971, 242133=Sold to Liberia in 1984, 193793=1953, 224201=Feb   1960, 119092=Following the First World War, a new British company was formed by the New York based Atlantic, Gulf and West Indies S.S. Lines, a company involved in shipping since 1844, but also owning properties and oilfields in Mexico.  The new British company was called A.G.W.I. Petroleum Corporation Limited and was incorporated in 1920.  On its formation, the Company acquired 406 acres in Hampshire that was to become the new Fawley refinery and oil storage depot.  The first of the Company’s vessels, the newly built S.S. Agwilake, landed the first oil at Fawley on 18 June 1921, discharging 1,398 tons of Mexican crude oil, 5,843 tons of fuel oil and 2,677 tons of gas oil.  In 1921 the facility had storage capacity of 99,000 tons.  In 1923, A.G.W.I. Petroleum Corporation was taken over by the British Mexican Petroleum Company.  In 1925 the Anglo-American Oil Company acquired the British Mexican Petroleum Company and its fleet of eight oil tankers of 10,000 DWT. , 175145=B/U Forth in 1963, 108199=1910, 100070=Became barge in 1928, 132587=Sold to Admiralty in 1956, 152125=Broken up at Spezia in 1960, 173715=B/U Belgium in 1962, 185112=B/U Kent in 1975, 179974=Sold off in 1953, 117992=1917, 218717=Esso El Salvador in 1964, 187875=1959, 236926=1968, 34020=Submarine Loss in 1944, 187279=B/U Santander in 1985, 96994=B/U Matola in 1955, 136437=Foundered in May 1960, 222495=Jan 1968, 185697=1956, 97970=BRITISH-BUILT SHIPS OF THE ANGLO-AMERICAN OIL COMPANY OF LONDON  :  1901-1903, 130019=Broken up in 1935, 130441=Foundered in December 1948, 214364=Sold in 1969, 229511=B/U at Ulsan in 1983, 56247=B/U in 1946, 28095=Lost by fire in 1911, 107682=1893, 93612=Became a barge 1931, 121775=Bombed and sunk in September 1941, 216526=Sold in 1967, 259386=Laid up at Vestnes 1983.   Sold to USA in 1985., 211064=B/U at Bombay in 1981, 233917=B/U at Barcelona in 1977, 174620=B/U Belgium in 1969, 246364=1976, 211492=B/U at Kaohsiung in 1982, 219343=The Esso Portsmouth and Esso Durham both suffered major damage, in July 1960 and January 1961 respectively, due to serious explosions and fire.  Both ships were subsequently salvaged and new mid-sections pieced in, together with other major modifications including modernisation to accommodation.  The Esso Portsmouth, with an additional 4,000 tons of steel increasing her size to 40,300 DWT and length to 733 feet, was later sold to Winson Tankers Limited of Panama in 1972.  On a voyage from Galveston to India in January 1975, carrying wheat, the vessel went aground on North Danger Reef in the South China Sea, remaining there until refloated on 6th August 1975.  However, two days later she foundered in heavy weather whilst under tow., 160292=1942, 126146=Submarine loss in September1939, 241225=1973, 137309=Broken up in 1985, 254000=B/U Masan in 1982 (as Esso Flandre), 181290=B/U La Seyne in 1958, 159688=Renamed Esso Saranac in 1946, 133019=Broken up Gateshead in 1956, 206324=Arrived Hamburg for scrapping - October 1961, 236393=1967, 150975=1933, 159226=Sunk Atlantic by U-659 - Sept 1942, 106632=1903, 123976=Broken up at Faslane in 1953, 79932=B/U in 1953, 179556=B/U Split in 1958, 173262=B/U Faslane in 1960, 252880=B/U Busan in 1982, 110983=1891, 186137=1957, 133453=Converted to barge in 1927, 104787=B/U Yawata in 1936, 107161=1908, 217021=Foundered August 1975, 105756=THE FLEET OF THE ANGLO-AMERICAN OIL COMPANY OF LONDON IN 1910, 116255=Broken up at Spezia in 1949, 161966=Renamed Esso Cadillac in 1946, 210624=Sank following an explosion in 1972, 212570=There were twelve vessels of this class built between 1957 and 1960.  These vessels were of around 36,000 TDW and propulsion was by means of two steam turbines geared to a single shaft, providing a speed of around 16.5 knots.  The vessels had an overall length of 696 feet and breadth of 90 feet.  The vessels details are shown in the Table below :, 104377=Stranded in 1919, 211002=Lighter 1969, 14349=The first ships of the Anglo-American Oil Company were both Clyde-built.  The first was the 1889-built BAYONNE, from the yard of A. & J. Inglis Ltd., and the second was the 1889-built MANHATTAN, from the yard of D. J. Dunlop & Coy., each with a carrying capacity of 4,000 tons, equivalent to about 28,000 barrels of oil per vessel, arranged in nine pairs of tanks that could be pumped out in ten hours using the two ship’s own cargo pumps.  These were followed over the next few years by the steamers WEEHAUKEN (1891- Armstrong Mitchell & Coy), DELAWARE (1893 - D. J. Dunlop), POTOMAC (1893 – A. & J. Inglis Ltd) LACKAWANNA (1894 – D. J. Dunlop & Coy) CHESAPEAKE (1895 – D. J. Dunlop & Coy), 154304=Submarine loss in June 1942, 109073=1888, 180850=B/U Genoa in 1962}",
    "lastModified": "Wed, 29 Jul 2015 04:50:08 GMT",
    "textBeforeTable": "OIL CARRIERS OF THE ANGLO-AMERICAN OIL COMPANY OF LONDON  :  1889-1914   To accommodate the growing fleet, Anglo-American Oil constructed the large storage wharf at Purfleet on the Thames from where smaller vessels transhipped the commodity to various ports around the British Isles and Dublin, Ireland.  By the turn of the century, the ships were increasing in size, up to 8,400 DWT.  In 1903 the Company took delivery of its largest ship until then, the 9,196 GRT NARRAGANSETT, at that time the largest oil tanker in the world and the largest vessel to be built in the lower reaches of the Clyde, from the Yard of Scott & Coy of Greenock. The first ships of the Anglo-American Oil Company were both Clyde-built.  The first was the 1889-built BAYONNE, from the yard of A. & J. Inglis Ltd., and the second was the 1889-built MANHATTAN, from the yard of D. J. Dunlop & Coy., each with a carrying capacity of 4,000 tons, equivalent to about 28,000 barrels of oil per vessel, arranged in nine pairs of tanks that could be pumped out in ten hours using the two ship’s own cargo pumps.  These were followed over the next few years by the steamers WEEHAUKEN (1891- Armstrong Mitchell & Coy), DELAWARE (1893 - D. J. Dunlop), POTOMAC (1893 – A. & J. Inglis Ltd) LACKAWANNA (1894 – D. J. Dunlop & Coy) CHESAPEAKE (1895 – D. J. Dunlop & Coy) In 1855, at the age of sixteen years, the American John",
    "textAfterTable": "T/E 3-Cyl Stm Recip Scuttled in 1944 Tonawanda 3.416 Armstrong, Mitchell & Coy 330 x  43 T/E 3-Cyl Stm Recip B/U in 1923",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}