{
    "relation": [
        [
            "Special Situations",
            "Combat Zone and other Military Operations",
            "Examination case",
            "Fiduciary Relationships (Minor Child and POA)",
            "Frivolous Filer/Non-Filer Returns",
            "Hardship",
            "Killed in Terrorist Action (KITA)",
            "National Disaster/Emergency Relief Program",
            "Refund Schemes",
            "Identity Theft"
        ],
        [
            "IRM Reference",
            "IRM 3.11.3.7.1.1",
            "IRM 3.11.3.7.1.2",
            "IRM 3.11.3.7.1.3",
            "IRM 3.11.3.7.1.4",
            "IRM 3.11.3.7.1.5",
            "IRM 3.11.3.7.1.6",
            "IRM 3.11.3.7.1.7",
            "IRM 3.11.3.7.1.8",
            "IRM 3.11.3.7.1.9"
        ]
    ],
    "pageTitle": "Internal Revenue Manual - 3.11.3 Individual Income Tax Returns (Cont. 2)",
    "title": "",
    "url": "http://www.irs.gov/irm/part3/irm_03-011-003r-cont02.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00189-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 518585251,
    "recordOffset": 518550556,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{35751=Rebatch as International and transship to AUSPC when conditions listed at IRM 3.11.3.7.2.11 are present., 59481=Accept Form 1310 as documentary evidence when all of the following are present:, 38469=Figure 3.11.3-33, 24153=Figure 3.11.3-27, 61670=Figure 3.11.3-39, 166797=Figure 3.11.3-71, 160905=Figure 3.11.3-68, 147109=Form 8332 or Form 2120 must show entries. If Form 8332 or Form 2120 is blank, correspond., 47815=*Work leaders will review all returns to verify that conversion to Form 1041 is necessary before transshipment. Check signature line to verify that the taxpayer is deceased. If a surviving spouse's signature is present on the return or if the taxpayer has signed the return, do not transship to BMF SPC. Process as Form 1040., 17867=When a street address in the caption is incomplete (such as a number without a street name or a street name without a number), and a complete address that matches the caption is found on an attachment, perfect the street address. If the street address cannot be perfected, underline or edit the name control. (See Figure 3.11.3-24, 103805=Figure 3.11.3-50, 148971=Figure 3.11.3-63, 78411=Edit CCC \"Q\" and transship to CSPC when Form 8939 is attached to a final Form 1040., 109955=Figure 3.11.3-51, 187740=If Form 1099-MISC is attached with or without a notation and an amount is present in box 7, Form 1099-MISC, edit RPC \"N\" unless the amount is less than $434 or Schedule SE is present., 128646=See IRM 3.11.3.14.5.5., 77499=Figure 3.11.3-45, 114869=Figure 3.11.3-54, 218356=Figure 3.11.3-76, 90843=Refer to the FS \"4\" instructions (IRM 3.11.3.12.2.4 ) if a spouse's exemption is claimed on line 6b or 6c., 59295=Correspond when the refund payee is a claimant other than a legal representative, and a completed Form 1310 is not present., 73853=Figure 3.11.3-44, 110943=Figure 3.11.3-53, 53398=Accept any court papers naming the claimant as a court-appointed or court-certified personal representative for the estate of the deceased taxpayer. A will validated through the court is acceptable documentary evidence. Acceptable documentary evidence also includes a properly completed Form 1310. (See IRM 3.11.3.10.2(7))., 205684=Form 1099-OID (found when editing withholding or excess Social Security tax), 18952=Refer to the international return instructions in IRM 3.11.3.7.2.11 when the return has a foreign address., 17282=Underline or edit the name control when there is no street address (for example, 4116 Grant Ave) or P.O. Box present in the caption. (see Figure 3.11.3-17 and Figure 3.11.3-24)., 68862=Figure 3.11.3-41, 125764=Figure 3.11.3-58, 121397=Exemptions are entered by the taxpayer on Form 1040 or Form 1040A on the four lines and one box located directly to the right of line 6c in the exemption area of the return., 166303=Figure 3.11.3-70, 205575=Form 1099-INT (found when editing withholding or excess Social Security tax), 47291=\"Return transshipped to BMF SPC for conversion to Form 1041.\", 156560=Figure 3.11.3-67, 59650=A signature. Correspond when missing. See IRM 3.11.3.14.10 for signature requirements., 150356=Figure 3.11.3-64, 73365=Figure 3.11.3-43, 202551=Disability indicated on Form 1099-R., 197664=If gross and taxable amounts with a difference of $1 or more can be determined, move to lines 16a and 16b. See IRM 3.11.3.14.2.10(4)., 43420=Edit the caption information from Form 1310. If Form 1310 is not present, edit caption information from the court certificate. (See Figure 3.11.3-34). Edit the caption address before corresponding., 52233=Figure 3.11.3-35, 164193=3. Continue processing the return without a TIN. Forward Forms W-7A missing required documentation to AUSPC. 4. Mail all Forms W-7A to: Internal Revenue Service, 3651 S. IH 35, Austin, TX 78741-7855. 5. AUSPC ONLY: Do not detach Form W-7A from the return. Follow local routing procedures. Do NOT send Letter 86C. When the ATIN unit sends the return back through processing after the ATIN has been assigned, they will edit, for example, \"02 RPC 05-14-2015\" in the left side margin for the date the ATIN was assigned on refund returns only. Edit this date on the Edit Sheet, Form 3471, line 4 if current date is after April 15., 204422=Figure 3.11.3-73, 208064=Form 1099-DIV (found when editing withholding or excess Social Security tax), 208338=\"X\" the amount on line 9a if it matches the entry on line 7 of Form 1040., 171428=Do not edit RPC \"V\" on computer-generated returns when there is an indication the return was prepared by Volunteer Income Tax Assistance (VITA) or Tax Counseling for the Elderly (TCE) (e.g., the presence of an \"S\" within the P-TIN field). See IRM 3.11.3.14.13.2., 43673=Figure 3.11.3-34, 91033=Figure 3.11.3-48, 183163=Refer to the decedent return instructions in IRM 3.11.3.10 when any of the following are present:, 120492=Figure 3.11.3-55, 99369=Figure 3.11.3-49, 22443=Figure 3.11.3-26, 143417=Figure 3.11.3-61, 202480=Form 1099-R with Code 3 in Box 7., 109435=See the decedent return editing information in IRM 3.11.3.10., 32167=Underline any other address as the AIL if the street address is present with a notation of Private Mail Box or \"PMB\" . DO NOT separate the address from the PMB number. See Figure 3.11.3-31., 85457=See IRM 3.11.3.3.11 for information on identifying uncomputed returns. See IRM 3.11.3.13.2 for further information on exemption editing., 146449=Do not move a child from exemption position 3 to position 2. See IRM 3.11.3.13.2.1.2 for child exemption relationships., 58923=Figure 3.11.3-37, 123204=Figure 3.11.3-56, 64959=Figure 3.11.3-40, 19114=Figure 3.11.3-24, 76103=Form 1310, 80957=Figure 3.11.3-46, 139751=Figure 3.11.3-60, 217643=If income reported from Insurance Companies Demutualization is present (reported by the taxpayer on Form 1099-B), but entered on a line other than 13, edit that amount to line 13 and dummy a Schedule D., 147513=Figure 3.11.3-62, 3410=Refer to the Name Control Job Aid 2303 or Document 7071, Name Control Job Aid for Individual Master File (IMF) Taxpayers., 32675=Figure 3.11.3-31, 6166=Figure 3.11.3-18, 217862=Figure 3.11.3-75, 15211=Figure 3.11.3-21, 81445=Figure 3.11.3-47, 154876=If a Form W-7A is attached, see IRM 3.11.3.13.3.1.1., 220873=Figure 3.11.3-77, 146727=If an entry is present in exemption position 3, Form 8332, Form 2120 or copy of divorce decree must be present. If not present, \"X\" exemption position 3. Correspond unless rejected ITIN condition is present., 11318=Figure 3.11.3-20, 213539=Figure 3.11.3-74, 117153=Edit the DSI on Forms 1040 or Form 1040A in the blank area, directly above line 6c, column (4) or to the right of the text., 42163=Death certificate, Form 1310, or other documentation is attached, 124221=Figure 3.11.3-57, 151546=Figure 3.11.3-65, 45272=If a return is filed for a single deceased taxpayer or two deceased taxpayers on a joint return and the return covers a tax period after the one in which the taxpayer(s) died, Form 1041 must be filed:, 37095=Figure 3.11.3-32, 128837=Only correspond if the credit is being claimed on lines 52 or 67, Form 1040, (Line 35 or 43, Form 1040A)., 171024=Edit RPC \"V\" when the tax form is computer generated. Computer-generated forms are identified by a three-alpha character software code in the bottom margin of page 1 or 2. (See Figure 3.11.3-72.), 61182=Figure 3.11.3-38, 110449=Figure 3.11.3-52, 10812=Figure 3.11.3-19, 41914=\"Deceased\" written on the top of Form 1040, Form 1040A or Form 1040EZ, 19608=Figure 3.11.3-25, 153127=Figure 3.11.3-66, 64744=Only Form 1040 may be filed as a short-period return. Convert Form 1040A or Form 1040EZ to Form 1040. See IRM 3.11.3.63 for instructions on converting returns., 29200=Figure 3.11.3-29, 53855=Check to make sure that the signature of the person signing matches the court papers or Form 1310., 154074=For Form 1040 or Form 1040A, up to four dependents' name controls and TINs can be transcribed., 111849=Refer to the decedent editing instructions in IRM 3.11.3.10 if the spouse died during the tax period of the return., 167696=The instructions provided in this subsection of the manual are for editing pages 1 and 2 of the Form 1040. These instructions include:, 73006=Figure 3.11.3-42, 161399=Figure 3.11.3-69, 16211=Figure 3.11.3-23, 214047=When the line 13 box is marked and a negative entry is present on line 13 and no Schedule D is attached, follow the instructions for IRM 3.11.3.14.2.7(3) below (i.e., treat a negative amount on line 13 as if the line 13 checkbox is not marked)., 191944=If Schedule A is attached, see IRM 3.11.3.15.11, 171784=Figure 3.11.3-72, 31652=Figure 3.11.3-30, 15711=Figure 3.11.3-22, 36628=Perfect the ZIP code from the attachment(s) if a complete ZIP code is found for exactly the same address (including apartment number, if present). See Figure 3.11.3-32, 28700=Figure 3.11.3-28, 141324=See IRM 3.11.3.12.2 for instructions about the filing status and the exemption when an exemption is claimed for a spouse on:, 154579=Every dependent claimed as an exemption must have a TIN. Search attachments, including Schedule EIC and Form 2441, for any dependent exemption TIN not listed on line 6c.}",
    "textBeforeTable": "Do not delete \"DECD\" or \"MINOR\" from the name line: Both taxpayers have signed the return. The FS is \"2\" . Only one name appears in the first name line. Edit the spouse's name from the signature line when all of the following conditions apply: Circle the spouse's name when there are two names in the name line, the FS is \"1\" , \"3\" , or \"4\" , and there is only one signature. Perfect the name line to agree with the signature. (e.g., If John signs the return, delete Mary's name from the caption). Refer to the Name Control Job Aid 2303 or Document 7071, Name Control Job Aid for Individual Master File (IMF) Taxpayers. 3.11.3.9.2.2.1  (01-01-2015) Name Line, General 3.11.3.9.2.2  Name and Additional Information Lines 3.11.3.9.2  Caption Editing 3.11.3.9  Taxpayer Identification Information 3.11.3.14   Form 1040 3.11.3.13   Exemptions 3.11.3.12   Filing Status (FS) 3.11.3.11   Presidential Election Campaign Fund (PECF)",
    "textAfterTable": "3.11.3.9.2.2.1.2  (01-01-2015) Name Line on Other Than an IRS Label Without a label, the primary taxpayer's name will appear on the first line. The secondary taxpayer's name may appear on the first or second line. Do not separate the primary and secondary taxpayers' names onto different lines if they are both on the same line. On a return without an IRS label: If the taxpayer Then Uses a first initial but signs the return with a name,* Edit the name from the signature line to the name line. See Figure 3.11.3-19). Uses a middle initial and no first name,* Edit the name for the middle initial, if present. (See Figure 3.11.3-19),. Writes his/her last name first,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}