{
    "relation": [
        [
            "Patent application number",
            "20080204724",
            "20110032515",
            "20110069895",
            "20110228258",
            "20130058558"
        ],
        [
            "Description",
            "Method Of Apparatus For Detecting Particles On A Specimen - A method and apparatus of detecting a defect by inspecting a specimen in which a surface of a specimen on which plural patterns are formed is illuminated with an elongated shape light flux from one of plural directions which are different in elevation angle by switching an optical path of the light flux emitted from an illuminating light source in accordance with a kind of defect to be detected. Plural optical images of the specimen illuminated by the elongated shape light flux are captured with plural image sensors installed in different elevation angle directions by changing an enlarging magnification in accordance with a density of the pattern formed on the sample in an area irradiated with the illuminating elongated shape light flux. A defect on the specimen is detected by processing the images captured by the plural image sensors.",
            "METHOD OF APPARATUS FOR DETECTING PARTICLES ON A SPECIMEN - A method and apparatus of detecting a defect by inspecting a specimen in which a surface of a specimen on which plural patterns are formed is illuminated with an elongated shape light flux from one of plural directions which are different in elevation angle by switching an optical path of the light flux emitted from an illuminating light source in accordance with a kind of defect to be detected. Plural optical images of the specimen illuminated by the elongated shape light flux are captured with plural image sensors installed in different elevation angle directions by changing an enlarging magnification in accordance with a density of the pattern formed on the sample in an area irradiated with the illuminating elongated shape light flux. A defect on the specimen is detected by processing the images captured by the plural image sensors.",
            "DEFECT INSPECTION SYSTEM - The present invention relates to a defect inspection system which can perform inspection condition setting easily in a relatively short period of time, can examine the inspection condition setting even when there is no sample, and further can provide an inspection condition and a defect signal intensity to a person, who sets the inspection condition, to assist the inspection condition setting. In the defect inspection system, a defective image, which is an inspection image, and a reference image corresponding thereto and a mismatched portion of the defective image and the reference image are digitalized as a defect signal intensity and accumulated in association with the inspection condition, and the inspection conditions are changed to repeat evaluations while repeating accumulating works until the evaluation of all the inspection conditions in a set range is completed. After all the evaluations are completed, if there are a plurality of defects to be inspected, the work is repeated by times corresponding to the number of kinds of the defects and a recipe file including the accumulated conditions having the high defect signal intensity and an inspection condition item distribution as a inspection condition recipe is automatically outputted and is provided to the person who sets the inspection condition. And, appearance inspection for detecting a pattern defect or a foreign material defect on a substrate is performed.",
            "METHOD OF APPARATUS FOR DETECTING PARTICLES ON A SPECIMEN - A method and apparatus of detecting a defect by inspecting a specimen in which a surface of a specimen on which plural patterns are formed is illuminated with an elongated shape light flux from one of plural directions which are different in elevation angle by switching an optical path of the light flux emitted from an illuminating light source in accordance with a kind of defect to be detected. Plural optical images of the specimen illuminated by the elongated shape light flux are captured with plural image sensors installed in different elevation angle directions by changing an enlarging magnification in accordance with a density of the pattern formed on the sample in an area irradiated with the illuminating elongated shape light flux. A defect on the specimen is detected by processing the images captured by the plural image sensors.",
            "DEFECT INSPECTION SYSTEM - A defect inspection system is disclosed for easily setting inspection conditions and providing an inspection condition and a defect signal intensity to an operator. The defect inspection system digitizes a defective image, and a reference image corresponding thereto and a mismatched portion of the defective image and the reference image as a defect signal intensity and accumulates them in association with the inspection condition. The inspection conditions are changed to repeat evaluations while repeating accumulating works until the evaluation of all the inspection conditions in a set range is completed. A recipe file including the accumulated conditions having the high defect signal intensity and an inspection condition item distribution as a inspection condition recipe is automatically outputted and provided to the operator."
        ],
        [
            "Published",
            "08-28-2008",
            "02-10-2011",
            "03-24-2011",
            "09-22-2011",
            "03-07-2013"
        ]
    ],
    "pageTitle": "Taketo - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/taketo-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00153-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434112038,
    "recordOffset": 434096072,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Taketo Ueno, Fujisawa JP 06-05-2014 PHOTOVOLTAIC MODULE - A photovoltaic module has a photovoltaic cell assembly and a diode assembly. The photovoltaic cell assembly is formed by stacking a rear surface electrode layer, a photoelectric conversion layer, and a transparent electrode layer on one surface of a substrate, and an electrode layer formed on the other surface of the substrate. The diode assembly is formed by sequentially stacking a first electrode layer, a semiconductor layer, and a second electrode layer on one surface of a second substrate. The first electrode layer or the second electrode layer of the diode assembly is formed of a conductive oxide. The electrode layer formed on the other surface of the substrate of the photovoltaic cell assembly and the electrode layer of the diode assembly surface-contact and electrically connected with each other. The photovoltaic cell assembly and the diode assembly are sealed and integrated with each other by a sealing member. 20140150851 09-20-2012 PHOTOELECTRIC CONVERSION ELEMENT MANUFACTURING APPARATUS - Provided is a photoelectric conversion element manufacturing apparatus capable of effectively performing an annealing treatment on a flexible substrate in a small space, minimizing an increase in the area of the apparatus in an installation space and the processing time, ensuring high productivity, and improving the electric characteristics of a photoelectric conversion element. The photoelectric conversion element manufacturing apparatus forms the photoelectric conversion element and a transparent conductive film on a flexible substrate ( 20120233831 Published Description",
    "textAfterTable": "Patent applications by Taketo Ueno, Fujisawa JP Taketo Ueno, Tokyo JP Patent application number Description Published 20140160471 Optical Filtering Device, Defect Inspection Method and Apparatus Therefor - An optical filtering device and an optical inspection apparatus for detecting a defect in a high sensitivity using an optical filtering device which includes a shutter array formed in a two-dimensionally on an optically opaque thin film produced on a SOI wafer and the SOI wafer is removed at portions thereof on the lower side of the shutter patterns to form perforation portions while working electrodes are formed at the remaining portion of the SOI wafer, a glass substrate having electrode patterns formed on the surface thereof and having the shutter array mounted thereon, and a power supply section for supplying electric power to the electrode patterns formed on the glass substrate and the working electrodes of the SOI wafer. And the working electrodes is controlled to cause the shutter patterns to carry out opening and closing movements with respect to the perforation portions to carry out optical filtering. 06-12-2014 20140233024 Defect Inspecting Apparatus and Defect Inspecting Method - An invention being applied is a defect detecting apparatus that has: an",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}