{
    "relation": [
        [
            "Job Title",
            "High School Director (2015 School Year)",
            "Internship Coordinator - Home Support Office",
            "-Public Service Trainee",
            "Human Resources Assistant",
            "Lead Teachers for 2015-2016 SY"
        ],
        [
            "Location",
            "Arkansas",
            "Los Angeles, CA",
            "San Francisco, CA",
            "Reno, NV",
            "Washington, DC"
        ]
    ],
    "pageTitle": "Teaching - Entry Level Jobs, Internships, and Career Overview",
    "title": "",
    "url": "http://www.onedayonejob.com/jobs-internships/teaching/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00222-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 637140607,
    "recordOffset": 637025725,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{11416=Photo Credit: Flickr user Chicago 2016 Photos}",
    "TableContextTimeStampAfterTable": "{177121=The Public Learning Media Laboratory - he Public Learning Media Laboratory isn’t explicitly hiring, but their Get Involved page mentions that they plan on adding to their team in January., 72047=Teton Science Schools - Teton Science Schools is based in Jackson, WY based and has “been educating, training, and inspiring students about the natural world” since 1967., 254878=Copyright © 2007-2013 One Day, One Job. All rights reserved.}",
    "textBeforeTable": "teaching public policy program development policy operations non-profit Massachusetts education all employers advocacy See the complete Generation Citizen profile Generation Citizen - Generation Citizen is a Boston, MA based non-profit that “teaches teenagers direct political action through an innovative in-class curriculum.” Companies with Entry Level Jobs and Internships in Teaching Academia Education Careers Related to Teaching Teachers Seeking Employment Job Search Resources Teachers Networking Group Teacher’s Lounge Networking Opportunities PBS Teachers Top 20 Teacher Blogs Sites for Teachers Master of Arts in Teaching Programs Online Blogs and Websites Tools for Teaching by Barbara Gross Davis What the Best College Teachers Do by Ken Bain McKeachie’s Teaching Tips by Marilla Svinicki and Wilbert J. McKeachie Required Reading If teaching still sounds like your cup of tea, here are a few things you should do to get started. Teaching Resources Start with higher salaries and benefit from improved job security. Meet the requirements for",
    "textAfterTable": "See all 2,439 job postings The Learning Experience - The Learning Experience is a Boca Raton, FL based company that aims to \"give every child the opportunity to develop to their greatest potential.” See the complete The Learning Experience profile all employers Colorado Connecticut education Florida Illinois Massachusetts Michigan New Jersey New York North Carolina Ohio Pennsylvania software development teaching Texas Virginia web development Job Title Location Full-time Faculty (Fall 2015), Computer and Information Sciences Paterson, NJ Plumber Manager Broken Arrow, OK Civil Designer/Drafter San Luis Obispo, CA General Dentist - Graduating 2015 or Experienced Tucson, AZ Spanish Teacher -Middle and High School (2015-16 School",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}