{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Overall I feel safe on campus. Campus police officers are always present and visible. They are available to escort students to places on campus when requested.",
            "There are numerous organizations to become a part of. They include athletic clubs, fraternities and sororities, academic clubs, social, and media organizations.",
            "we have a location on campus called 'the set'. this is where we gather and have small concerts, book fairs, food vendors.this is the place to 'hang out'.",
            "On campus we have a bowling alley, beauty and barber salon, and a game room. Having these on campus prevents us from always leaving campus looking for things to do in our leisure and campus security is always available.We also have an area where students gather to hang out and fellowship with each other.",
            "In the food and dining area we have a food court so we are able to choose from different places to eat and variety of foods. with the meal plan each student is given a card that allows them to purchase from the available food vendors.",
            "Dorm life is great. It feels like you have your own place away from home because you are allowed to bring items in like refrigerators, microwaves, and televisions. I feel very safe because all the entrances have to be accessed with the student badge only and to add to the feeling of security there are not multiple entrances and exits.",
            "The classes that I have taken so far have been what I expected for my first year in college. I have to study a lot and take lots of notes because there is so much information. I was able to pass all of my classes the first semester and look forward to passing the next semester as well.",
            "Because of the climate here in Tallahassee I would advise all incoming students to bring clothes for very warm weather and raincoats, rain boots, and hat because it rains a lot.",
            "overall I rate this school as very good. I am in my second semester and during my first semester I knew without a doubt that I will be continuing and completing my education here. I will be acquiring a doctorate degree in Pharmacy."
        ]
    ],
    "pageTitle": "Florida Agricultural and Mechanical University (FAMU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Florida-Agricultural-and-Mechanical-University/reviews?_escaped_fragment_=/show/29126",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 878963323,
    "recordOffset": 878828128,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{118425=Every student knows and learns the history of the university. It was founded October 3rd, 1887, 346996=When you start getting into your majors your professors expect you to buckle down and do what you have to do. When a paper or an assignment is due by 11:59 by a certain day make sure you turn it in then. Unlike high school teachers professors here will not baby you, and will expect you to go by your syllabus to find out when things are due because you wont be told or reminded., 319970=The set- Right in front of Diamond & McGuinn and the H. Manning Efferson building. When ever some says I represent all FAMUans say Florida Agricultural & Mechanical University October 3rd, 1887. Whhatt??? in unison. It's crazy and it fills you with pride., 737073=The brand new co-ed dorms will be open and ready starting from the 2014-2015 school year. Weekly are room inspections making sure your room is tidy. Dorms have building wide movie nights and socials., 520432=We offer a service call the safe team which i really love, they run from 10:00 to 3am and if your walking anywhere on campus they'll come pick you up in a golf cart and take you where you need to go,its awesome., 130684=Florida A&M University, (FAMU) is considered highly among Historically Black Colleges/ Universities. In 1997, FAMU recieved the award of College of the Year, which was presented by the Princeton Review and Time Magazine. If you are interested in the fields of Pharmacy and Pharmeceutical Sciences, Business, Nursing, Engineering, Architecture, or Journalism and Graphic Design, know that Florida A&M is ranked profoundly in these areas amongst other schools in the nation., 61242=There is always something to do on campus. 2013 will be the return of the Marching 100. And that means more excitement for all Rattlers in Rattler Nation., 790924=© 2015, Cappex.com, LLC, 275542=Florida A&M University has a very skewed image in the public media. Coming here you get a completely different experience then what is expected. FAMU is one of the nations top HBCUs but it's also way more than that. It is a university who prides themselves on the success of their students. Like every school there are students who come here just to play around. The majority of us who continue their education here at FAMU are dedicated to our studies. If you are ready to be part of something great and rich with history. You are ready to be a part of Florida Agricultural and Mechanical University, established 1887. When the dark clouds gather on the horizon, When thunder and lightening fill the sky ......... You must always remember that the RATTLERS WILL STRIKE, AND STRIKE AND STRIKE AGAIN!, 492570=Florida A&M is one of the best universities that has been establish since 1887. I wouldnt change a thing about it.}",
    "textBeforeTable": "06/08/2009 Reviewer is A current student here. 67 out of 70 people found this review useful. 1 of 200 Antonio from Frankford, DE Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Tips for prospective students Be prepared to have fun but work hard. Its a great HBCU and you will learn alot. FAMU is a historical school that has many activities and clubs that anyone would love to join. Any major you choose you will excel in at Florida A&M as long as you remain focused. Remember what you came to college for and maintain that goal throughout your years of attending any college. Login to rate or flag the reviews Karl from Dallas, TX 07/10/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 31 out of 32 people found this review useful. 4 of 200 Categories Comments Great for these types of students African americans with great pride in their culture. Anyone else who wants a great education while having a great time... Tips for prospective students The teachers as well as your peers really care about your success, that's the atmosphere that has been set. The campus life is incredible. It's the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}