{
    "relation": [
        [
            "vote",
            "0+",
            "1+",
            "2+",
            "3+",
            "4+"
        ],
        [
            "quantity (% of cytoplasm volume occupied by the azoic stain precipitate)",
            "nothing",
            "50%",
            "50-80%",
            "80-100%",
            "100%"
        ],
        [
            "granule size",
            "-",
            "small",
            "small",
            "medium-large",
            "medium and large"
        ],
        [
            "stain intensity",
            "nothing",
            "mild to moderate",
            "moderate to strong",
            "strong",
            "bright"
        ],
        [
            "cytoplasm background",
            "nothing",
            "colorless to pale pink/blue",
            "colorless to pale pink/blue",
            "colorless to pink/blue",
            "invisible"
        ]
    ],
    "pageTitle": "Homo sapiens diseases - Myeloproliferative neoplasms (MPN)",
    "title": "",
    "url": "http://www.ufrgs.br/imunovet/molecular_immunology/pathohomotissueblood_MPD.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 784038523,
    "recordOffset": 783849419,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sun, 05 Apr 2015 14:56:09 GMT",
    "textBeforeTable": "absent or reduced LAP (except during blast phase). Scoring system based on evaluation of azoic stain precipitated in cytoplasm : increase in [LDH1, hyperuricemia, transcobalamin and vitamin B12]plasma creatinine, azotemia, SGOT, SGPT, gGT, ESR, PCR, serum protein electrophoresis, IgG, IgA, IgM quantification, sideremia, ferritin, total cholesterol, urinalysis CBC (anemia, leukocytosis) ref Laboratory examinations : although in most cases the diagnosis is easily made from morphologic evaluation of the blood smear (including leukocyte alkaline phosphatase), confirmation by genetic studies is essential, particularly in view of the advent of therapy that targets the BCR/ABL fusion protein [large foci or clusters of blasts in bone marrow biopsy] extramedullary blast proliferation other than hepatosplenomegaly blasts > 30% of peripheral blood white cells or bone marrow cells one or more of following is present: Diagnose if T lymphoblastic and megakaryoblastic BCref1, ref2 T lymphoid/myeloid bilineal BCref1, ref2 mixed BC : undifferentiated BC (10%) lymphoblastic BC (15-20%) : 40-70% can be reconverted to chronic phase with chemotherapy; including lymph node BCref promyelocyticref megakaryoblastic or erythroid (10%) myeloblastic BC (60%) CML, blast phase (BP) /",
    "textAfterTable": "The final score is S(vote class x number of cells in the class) in 100 observed cells (normal range 20-180 points). BMAB : hypercellularity of granulocytic (and sometimes megakaryocytic but never erythrocytic) lineage Co-diagnosis : CP-CML and HCL ref1, ref2 Evolution : CML => HCL ref (atypical in a few ways, with an initial high white blood cell count, the absence of monocytopenia, and atypical morphology. Immunophenotyping also showed that hairy cells were CD25 negative) Therapy : BCR-c-Abl inhibitors : chronic phase : 400 mg PO daily. The dose is increased to 400 mg PO twice daily in those in whom a complete hematologic response was not achieved after 3 months of treatment; in those whose disease relapsed within 3 months after the achievement of a complete hematologic response; and in those in whom a major cytogenetic response had not been achieved after 12 months of therapy. Neutropenia grade 3 (27%) or 4 (8%), leukopenia grade 3 (22%) or 4 (2%), anemia grade 3 (6%) or 4 (1%), grade 3-4 thrombocytopenia (20%), weight gain (4%), rash and related events (3%), nausea (2%), superficial edema (1%) => median time to first grade 3 or 4 episode of neutropenia",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}