{
    "relation": [
        [
            "Related Topic",
            "Cisco IOS commands",
            "Security commands",
            "IPsec configuration",
            "Recommended cryptographic algorithms"
        ],
        [
            "Document Title",
            "Cisco IOS Master Command List, All Releases",
            "Cisco IOS Security Command Reference Commands A to C Cisco IOS Security Command Reference Commands D to L Cisco IOS Security Command Reference Commands M to R Cisco IOS Security Command Reference Commands S to Z",
            "Configuring Security for VPNs with IPsec",
            "Next Generation Encryption"
        ]
    ],
    "pageTitle": "FlexVPN and Internet Key Exchange Version 2 Configuration Guide, Cisco IOS XE Release 3S - Configuring the FlexVPN Server [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/sec_conn_ike2vpn/configuration/xe-3s/sec-flex-vpn-xe-3s-book/sec-cfg-flex-serv.html?referring_site=smartnavRD",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00265-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 370259983,
    "recordOffset": 370219843,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "The following table describes the conditions when the initiator and the responder send different configuration payload types: IKEv2 configuration mode allows IKE peers to exchange configuration information such as IP addresses and routes. The configuration information is obtained from IKEv2 authorization. Both pull and push models are supported. The pull model involves the exchange of configuration requests and replies; the push model involves the exchange of configuration sets and acknowledgements. IKEv2 Configuration Mode Figure 2. IKEv2 Exchange with the query-identity Keyword The figure below shows the IKEv2 exchange for EAP authentication with the query-identity keyword. Figure 1. IKEv2 Exchange Without the query-identity Keyword The figure below shows IKEv2 exchange for EAP authentication without the query-identity keyword. The FlexVPN client IKEv2 identity used as the EAP identity. The EAP identity queried from the client when the query-identity keyword is configured. The EAP identity provided by the EAP server with the EAP success message.",
    "textAfterTable": "Note The commands to send configuration requests and configuration set payloads are enabled by default. Depending on your release, the IKEv2 initiator can trigger a configuration mode when the initiator is a FlexVPN client, or any static tunnel interface initiating IKEv2 can trigger configuration mode by enabling the config-mode command in the IKEv2 profile. The IKEv2 FlexVPN server supports the following standard IPv4 configuration attributes: INTERNAL_IP4_ADDRESS INTERNAL_IP4_NETMASK INTERNAL_IP4_DNS INTERNAL_IP4_NBNS INTERNAL_IP4_SUBNET The IKEv2 FlexVPN server supports the following standard IPv6 configuration attributes: INTERNAL_IP6_ADDRESS INTERNAL_IP6_DNS INTERNAL_IP6_SUBNET Note IPv6 configuration attributes are only supported by the Microsoft Windows IKEv2 client. The INTERNAL_IP4_SUBNET and INTERNAL_IP6_SUBNET configuration attributes, controlled by the route set and aaa attribute list commands in the IKEv2 authorization policy, are not supported when you",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}