{
    "relation": [
        [
            "Expected Result",
            "The negotiation of international trade agreements at the bilateral, regional and multilateral levels maintain or improve global market access for Canada.",
            "Market access barriers faced by Canadian industry abroad and international trade disputes are addressed or mitigated.",
            "Canada's obligations to control trade in specific goods and technologies are met in accordance with established service standards."
        ],
        [
            "Performance Indicator",
            "Degree to which, on a scale of 1 to 5, progress was made in advancing negotiation milestones.",
            "Degree to which, on a scale of 1 to 5, systemic market access barriers, disputes or other strategic policy issues were effectively addressed in conjunction with partners, stakeholders and foreign interests.",
            "% of permits and other documents processed in accordance with service delivery standards."
        ],
        [
            "Target",
            "Establish baseline data.",
            "Establish baseline data.",
            "94% baseline measured in 2011-12"
        ],
        [
            "Result",
            "Establish baseline data.",
            "Establish baseline data.",
            "Over 95%"
        ]
    ],
    "pageTitle": "Departmental Performance Report 2012-13",
    "title": "Program Performance Summary",
    "url": "http://www.international.gc.ca/department-ministere/plans/dpr-rmr/dpr-rmr_1213.aspx?lang=eng",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 522510715,
    "recordOffset": 522450133,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7025=We are pleased to present the 2012-13 Departmental Performance Report for Foreign Affairs and International Trade Canada (DFAIT). This is the final DFAIT performance report prior to the department's amalgamation into the new Department of Foreign Affairs, Trade and Development., 4760=Closer to home, progress was achieved on Arctic boundary issues related to the Continental Shelf and the Lincoln Sea, and priorities were developed for Canada's Chairmanship of the Arctic Council (2013-15). DFAIT improved passport services to Canadians by launching the ePassport, which has significantly enhanced security features., 583=This Departmental Performance Report is aligned with the department's new 2013-14 Program Alignment Architecture and related Performance Measurement Framework (PMF). The department updated its PAA and PMF in 2012-13 to more accurately reflect its business and to improve planning, performance management and reporting., 3753=On June 26, 2013, the Budget Implementation Act (Bill C-60) received royal assent, enacting the provision from the Economic Action Plan 2013, which announced the amalgamation of the Canadian International Development Agency (CIDA) and the Department of Foreign Affairs and International Trade (DFAIT) into the new Department of Foreign Affairs, Trade and Development (DFATD). As well, effective July 2, 2013, Passport Canada moved from DFAIT to Citizenship and Immigration Canada. For 2012-13, both former departments are producing separate Departmental Performance Reports. For 2013-14, the new department will produce a single Departmental Performance Report. This report will reflect both CIDA and DFAIT program performance against expected results from their respective Reports on Plans and Priorities.}",
    "TableContextTimeStampAfterTable": "{14831=Summary of Progress: All of the plans aligned with this priority in the 2012-13 RPP were fully achieved. The department exceeded one and met three performance targets related to summitry and multilateral diplomacy and advocacy., 7412=DFAIT's organizational priorities reflect key areas of interest in which the department delivered significant, tangible results in 2012-13. These priorities, as well as significant results related to the department's PAA, are integrated into Section 2 of this report to provide a comprehensive overview of the department's performance in 2012-13. The priorities below are numbered for clarity of presentation only, and are aligned with relevant Strategic Outcomes (SO)., 173840=In 2011-12, an internal audit was conducted on real property management. The department worked to address audit recommendations through 2012-13., 172883=To improve efficiency and cost-effectiveness of the international platform, a new size standard for Official Residences (OR) abroad was established. In 2012-13, six ORs were converted to the new standard size. Over the next four years, approximately 80 ORs will be moved to the new standard, and representational activities moved from ORs to Chanceries and other commercial alternatives., 27911=This is the first time this risk has been included in DFAIT's CRP. DFAIT undertook seven initiatives in 2012-13, summarized above, to address the likelihood and impact of this external risk, should it occur. Mitigating this risk was also a focus within DFAIT's Departmental Security Plan (see section 2.3.1.3). DFAIT's Operations Committee monitored progress on initiatives on a quarterly basis. While the Operations Committee was satisfied with the progress achieved in mitigating this risk over the past year, more work clearly remains. A risk-based audit of Information Technology security completed in early 2012 provided a number of recommendations on how to improve IT security within DFAIT., 53688=The variance between the main estimates ($2,582.1 million), planned spending ($3,075.8 million) and total authorities ($2,860.9 million) is due to the timing differences of these three financial processes, the way in which the department is expected to report revenues and the fact that a portion of funding was not approved until after the publication of the 2012-13 RPP., 217475=Revenues earned on behalf of the government were $141 million in 2012-13 compared to $185 million in 2011-12., 17614=At the 2012 Nuclear Security Summit in Seoul, South Korea, Prime Minister Stephen Harper announced a renewed commitment of $367 million through Canada's Global Partnership Program to enhance global security and reduce the proliferation of weapons of mass destruction., 216427=The department's overall expenses decreased by $239 million during 2012-13, primarily due to three factors: a $123-million decrease in transfer payments; an $81-million decrease in salaries and employee benefits; and a $35-million decrease in operating expenses (excluding salaries and employee benefits). The Financial Statement's Note 13 Segmented Information provides detailed information by Standard Object and Program., 152491=Based on recommendations from an internal evaluation completed in November 2012, DFAIT established a single communications portal for partner departments to use in contacting the department during emergencies. Similarly, following recommendations from the same evaluation, the department developed an integrated risk-based strategy for managing international emergencies, which took into account regional risks and threats., 17081=DFAIT continued to provide humanitarian, development and security assistance in response to the crisis in Syria and contributed $15 million to the G-8 Deauville Transition Fund for democratic development in Egypt, Jordan, Libya, Morocco and Tunisia. Within the G-8, Canada pledged $110 million per year (2015-18) to support the transfer of responsibility for security and governance from the international community to the government and people of Afghanistan., 203683=In early 2012, DFAIT assumed responsibility from the Treasury Board Secretariat (TBS) for the administration of all LES pensions, insurance and social security policies and payments. In 2012-13, DFAIT updated insurance plans in 46 countries., 219710=The department's total liabilities decreased by $121 million (or 22.6 percent) in 2012-13 compared to 2011-12, mainly related to a net decrease in accounts payable to third parties as a result of timing differences ($77 million), a decrease in the accrual for severance benefits ($30 million) and a decrease in the accrual for potential Work Force Adjustment Costs ($14 million)., 210703=The performance of DFAIT's People Management function was rated \"Acceptable\" overall through the 2012-13 MAF process, and action plans were put in place to address specific opportunities for improvement identified within the MAF assessment., 100993=The International Civil Aviation Organization (ICAO) is the largest UN agency headquartered in Canada. In 2012-13, Canada contributed approximately $2.25 million to ICAO, which promotes safe and orderly civil aviation. Its presence provides about $100 million annually to the Montréal region., 91315=An internal evaluation in September 2012 recommended that the North American Platform Program establish a program secretariat and standard operating procedures and work to clarify responsibilities and accountabilities of program partners and governance bodies., 141531=Approximately 3,120 updates to travel advice and advisory pages were performed, including several prompted by international emergencies, to ensure that Canadians were provided with up-to-date information and advice. The 2012-13 hurricane season featured 20 named storms, 12 of which became hurricanes that necessitated the posting of 11 travel advisories., 108062=The Softwood Lumber Agreement with the United States was extended until 2015. DFAIT led a successful trade arbitration defence over British Columbia's timber pricing and addressed a range of other trade irritants., 57204=Actual spending was $67.1 million lower than planned spending, mainly due to the fact that planned spending did not include $34.6 million in revenues credited to the vote generated through the delivery of real property services abroad, and $12.4 million in efficiencies related to Budget 2012. Other variances were due to projected funding of $13.0 million, which was included in planned spending but was not received in 2012-13., 19825=Summary of Progress: All of the plans aligned with this priority in the 2012-13 RPP were fully achieved. DFAIT exceeded one and met one performance target related to the Passport Canada program., 210436=The Canadian Foreign Service Institute Learning Portal received over 9,000 individual visits and in February 2013, the Leadership@DFAIT portal was launched. The portal will help managers cope with change management issues, among other development needs., 30632=Other notable progress in addressing this risk included the introduction of a new program to ensure that the 37 highest-risk missions have access to professionally trained Security Program Managers. The program was 70-percent completed before April 2013 and will have been completely rolled out by September 2013., 127994=Outreach events in the United States and at the 2012 Summer Olympic Games in London were leveraged to raise awareness among investors of Canada's investment advantages. Post-event surveys indicated that over 92 percent of participants had increased their knowledge of investment opportunities in Canada., 208031=The Quality and Use of Evaluations was assessed as being \"Acceptable\" in the 2012-13 MAF process., 207289=The performance of DFAIT's internal audit function was assessed as being \"Acceptable\" by the Treasury Board Secretariat (TBS) through the 2012-13 Management Accountability Framework (MAF) process., 113294=An internal evaluation in January 2013 recommended that the GPP establish a governance framework to provide policy advice and strategic guidance to GPP programming and improve coordination with DFAIT's security programs., 55894=Actual spending was $11.8 million lower than planned spending, mainly due to $9.0 million in efficiencies related to Budget 2012 and the fact that planned spending did not include revenues of $3.1 million credited to the vote generated through trade fairs and investment technology missions., 20970=DFAIT's 2012-13 External Corporate Risks and Response Strategies, 66846=Implementation of the department's 2012-13 plans and priorities was monitored, and updates were provided to senior management to help identify gaps and prioritize resource allocation., 94862=Canada's priorities at the UN were communicated through a September 2012 speech delivered by Minister Baird at the UN General Assembly. Canada worked with like-minded countries to improve the UN by calling for increased accountability and transparency and the delivery of tangible results., 177786=As of March 31, 2013, full BTAs were completed for 40 percent of high-priority missions. For the remainder of high-priority missions, other types of threat assessments were produced as required, such as threat alerts, intelligence reports and shorter baseline threat assessments. Therefore, by the end of the fiscal year BTAs or shorter baseline threat assessments were available for 75 percent of all DFAIT missions. Overall, a total of 800 threat assessment products were produced in support of mission security work., 157407=A new fee-for-service structure was approved and came into force on July 1, 2013, to coincide with the ePassport's launch., 71228=To inform strategic planning and the identification of policy priorities, DFAIT completed a comprehensive and widely consulted environmental scan that examined key emerging global and domestic trends that will shape the department's operating context between 2013 and 2016, and beyond., 96271=Canada worked through the Association of Southeast Asian Nations to counter illicit trafficking of chemical, biological, radiological, and nuclear defence materials. An agreement was concluded at the APEC Economic Leaders' Meeting to develop an APEC list of Environmental Goods that would have tariffs reduced to 5 percent or less by 2015., 198855=Financial management controls continued to be improved for FSDs approved and managed at both headquarters and missions. The number of CBS respondents to the Client Service Questionnaire who rated their FSD knowledge from good to excellent increased to 89 percent from 82 percent in 2011-12. The satisfaction rate of relocation services provided in Canada for outgoing employees and for employees returning to Canada was 87 percent, compared to 80 percent in 2011-12., 8235=Summary of Progress: Most of the plans aligned with this priority in the 2012-13 RPP were fully achieved. A total of 16 free trade, air transport, and foreign investment protection and promotion agreements were concluded against a target of 10 agreements. Overall, international trade-related performance targets were exceeded for 11 performance indicators. Baseline data were established for four new performance indicators., 229203=Specifically, revenues credited to the vote of $356.9 million were not deducted from the 2012-13 planned spending figure, including revenues from passport applications, real property services abroad and the International Youth Exchange program. These revenues were deducted from the main estimates and total authorities figures. Revenues credited to the vote are net revenues generated by the department within the fiscal year., 172578=The implementation of the government's new office standard, Workplace 2.0, began at DFAIT missions abroad. All project plans for new and renovated missions have been prepared in compliance with this standard, with the first two of these new locations-Hong Kong and Bangalore-opening in 2014., 12302=Summary of Progress: All of the plans aligned with this priority in the 2012-13 RPP were fully achieved. The department exceeded one and met three performance targets related to bilateral and regional diplomacy and advocacy., 58868=The increase of $188.2 million from 2009-10 to 2010-11 is largely explained by new spending initiatives such as the settlement of $130.7-million in litigation costs under NAFTA Chapter 11 and $57.3 million in spending for employees abroad of other government departments., 25844=Versions of this risk have been addressed through DFAIT's CRP since 2010-11, and crises with similar impacts have occurred in the past. For example, the 2010 earthquake in Haiti and the 2011 Fukushima Daiichi nuclear incident in Japan had significant impacts on mission and departmental operations. Risk tolerance discussions with senior managers, including Deputy Ministers, indicated concern that DFAIT, while reasonably well prepared for a single crisis, may not be as prepared for the possibility that two or more crises may occur simultaneously., 59707=From 2014-15 to 2015-16, the decrease of $83.8 million is primarily due to the sunsetting of funds for several initiatives., 172060=DFAIT's portfolio abroad consists of 2,269 Crown-owned and leased properties, comprising approximately 900,000 square metres, which is valued at an estimated $3.2 billion. In 2012-13, DFAIT invested $76.6 million in major capital projects and $16.7 million on approximately 665 maintenance projects., 95165=Within the G-8, Canada pledged $110 million per year from 2015 to 2018 to support the transfer of responsibility for security and governance from the international community to the government and people of Afghanistan. At the G-8 Summit, leaders sent strong messages on Syria, Iran and North Korea., 136965=This program is in place to deliver up-to-date safe travel information to Canadians as well as to provide the best possible consular assistance abroad, and to manage the Government of Canada's responses to international emergencies. Out of the 11 performance indicators that the department uses to assess its performance in this program, seven targets were exceeded and two were met. Two targets were deemed not feasible for assessment in 2012-13., 208335=Corporate risk management practices improved through the provision of enhanced training and customized support. DFAIT's integrated risk management practices received a \"Strong\" assessment in the 2012-13 MAF process., 13941=At the 2012 Summit of the Americas, Prime Minister Harper announced the creation of the $25-million Canadian Initiative for Security in Central America to bolster efforts to address security challenges in the region, including transnational organized crime and illicit drug trafficking., 29523=The department undertook six initiatives in 2012-13, summarized above, to address the likelihood and impact of this external risk, should it occur. This risk is addressed by DFAIT's Departmental Security Plan, and the Operations Committee monitored progress in this area on a quarterly basis. DFAIT's DSP was put in place in June 2012, and a Chief Security Officer at the assistant deputy minister level was identified to improve the integration of security issues into senior management decision making., 217055=The $29-million increase in revenues is explained by an increase in the issuance of passports from 4.8 million in 2011-12 to 5.1 million in 2012-13. This generated a $19-million increase to Passport Canada's revenue and DFAIT realized an associated $7-million increase in consular revenues since each time an adult passport is issued DFAIT receives a fixed $25 from Passport Canada to cover consular costs., 227799=Export Development Canada (EDC) 150 Slater Street Ottawa, ON K1A 1K3 Tel.: 613-598-2500 (local) or 1-800-267-8510 (toll-free) TTY: 1-866-574-0451 www.edc.ca, 15653=Canada's foreign affairs priorities were communicated through a speech delivered by Minister Baird in September 2012 at the UN General Assembly (UNGA). Canada participated in initiatives to improve accountability, transparency and the delivery of tangible results., 128311=Of the 410 participants who attended the 2012-13 U.S. outreach events, 62 companies were identified as targets, leads, or prospects. The three sector-focused investment conferences held during the Summer Games provided outreach to 250 business executives, including 20 targets, leads and prospects, and 25 current investors., 26408=DFAIT undertook 12 specific initiatives in 2012-13, summarized above, focused mainly on managing the potential impact of this external risk, if it materialized as a real event. Monitoring these initiatives was undertaken by DFAIT's Operations Committee on a quarterly basis. Overall, the Operations Committee was satisfied with the progress achieved in this area. While the risk did not materialize as a crisis event, significant progress was achieved in improving the crisis resilience of Canada's network of missions abroad as well as enhancing emergency management capabilities within DFAIT headquarters., 185128=In order to ensure the effectiveness of the IM/IT program abroad, DFAIT is undertaking a review of the IM/IT support structure with a focus on client relationships, information management, applications and client support. The results of the review, which will involve extensive consultations with partners, are expected to be fully implemented by 2015., 96017=Canada chaired the International Atomic Energy Agency (IAEA) Board of Governors from November 2012 to March 2013 and promoted a robust international response to North Korea's missile and nuclear tests through the UN, G-8, NATO and the IAEA., 54635=Actual spending was $12.6 million lower than planned spending, mainly due to $10.5 million in efficiencies related to Budget 2012 and a $3.7-million surplus in the International Centre for Human Rights and Democratic Development grant. This was offset by expenditures of approximately $1.6 million approved after the publication of the 2012-13 RPP., 20479=As a federal department operating in a complex and rapidly changing global environment, DFAIT is exposed to a broad range of external risks. Through its 2012-13 Corporate Risk Profile (CRP), and as reported in its 2012-13 RPP, DFAIT identified three key external corporate risks and related mitigation plans. All of these risks could have had significant impacts on the achievement of DFAIT's strategic outcomes and plans and priorities if they had materialized as real events., 228323=Roosevelt Campobello International Park 459 Route 774 Welshpool, New Brunswick E5E 1A4 Tel.: 506-752-2922 (local) or 1-877-851-6663 (toll-fee) Fax: 506-752-6000 www.fdr.net/home, 60545=The Federal Sustainable Development Strategy (FSDS) outlines the Government of Canada's commitment to improving the transparency of environmental decision making by articulating its key strategic environmental goals and targets. DFAIT ensures that consideration of these outcomes is an integral part of its decision-making processes. DFAIT contributes to the following FSDS 2010-13 theme as denoted by the visual identifier and associated program below., 59153=Over the period of 2013-14 to 2015-16, the overall decrease in planned spending reflects the transfer of Passport Canada to Citizenship and Immigration Canada resulting from the formation of the new Foreign Affairs, Trade and Development Canada. The additional $100-million decrease from 2013-14 to 2014-15 is due to the reduction for Budget 2012 efficiencies, which was $52.3 million higher in 2014-15, the sunsetting of funds related to Afghanistan ($20 million) and the LES pension, insurance and social security program ($21.8 million)., 54074=When revenues credited to the vote are included in planned spending ($2,718.9 million), the figure is $142 million lower than total authorities, primarily due to funding received after the publication of the 2012-13 RPPFootnote 5. The variance between planned spending ($3,075.8 million) and actual spending ($2,394.9 million) in 2012-13 is explained below by program., 208152=A new DFAIT Values and Ethics Code for all DFAIT employees was launched. The rating for Values and Ethics at DFAIT was \"Acceptable\" in the 2012-13 MAF process., 113528=An internal evaluation in October 2012 recommended the ACCBP establish standard operating practices to improve coordination with other departmental security programs and enhance its performance measurement and information management practices., 189447=The majority of staffing decisions related to LES in the context of staff reduction related to Budget 2012 were implemented with minimal grievances (nine) and/or legal actions (five)., 58400=The decrease of $87.6 million from 2011-12 to 2012-13 in the actual spending is due to efficiencies related to Budget 2012. From 2010-11 to 2011-12, the decrease in expenditures of $222.6 million is primarily due to the transfer of $31.1 million to SSC in 2011-12 and significant one-time initiatives in 2010-11 including $130.7 million for the settlement of AbitibiBowater Inc.'s NAFTA Chapter 11 dispute; and $85.2 million for the G-8 and G-20 summits., 231405=The term \"consular\" describes the services that a country provides for its citizens abroad, as established in the 1963 Vienna Convention on Consular Relations, to which Canada is a signatory., 145768=A Consular Torture/Mistreatment Working Group was established to review consular cases with serious and credible allegations of torture or mistreatment. The group considered 17 consular cases. In keeping with Recommendation 17 of the Report of the Commission of Inquiry into the Actions of Canadian Officials in Relation to Maher Arar, these protocols improved the management of such sensitive consular cases. To promote best practices, consular training in dealing with allegations of mistreatment or torture was provided. For cases of parental child abductions, DFAIT works closely with its provincial and territorial partners to assist parents facing this very difficult and complex situation. This past year, Minister Ablonczy launched a new manual entitled International Child Abduction, A Guidebook for Left-Behind Parents. In addition, partners working on the Our Missing Children initiative were engaged on a number of complex child abduction cases, which yielded positive results, such as the case of the Maryk children, who were abducted to Mexico and returned to Canada in May 2012., 176851=DFAIT's Departmental Security Plan (DSP) was approved in June 2012. A Chief Security Officer at the assistant deputy minister level was also identified over the past year to improve the integration of security issues into senior management decision making., 8926=Building on high-level advocacy by ministers Baird and Fast and Canada's missions in Europe to increase European support for a Canada-European Union Comprehensive Economic and Trade Agreement (CETA), Canadian interests were advanced on a range of issues. Negotiations progressed on a CETA in 2012, the most ambitious trade initiative in Canada's history. This agreement would directly benefit workers and businesses in every region of our country., 57711=Actual spending was $22.9 million higher than planned spending due to increases in funding after the publication of the 2012-13 RPP., 119881=The Canada-Saudi Arabia Joint Economic Commission was re-launched to help expand and diversify trade within a two-way trading relationship that represented $3.6 billion in 2011., 213816=The charts below illustrate the March 31, 2013 ending balances for each major financial statement grouping, along with the corresponding change from the previous fiscal year., 58170=The department's total actual spending in 2012-13 of $2,394.9 million was within its total authorities of $2,860.9 million granted by Parliament. The actual spending trend over the past four years is described below., 220294=The department's total assets increased by $70 million (or 4.4 percent) in 2012-13 compared to 2011-12. The most significant financial transaction of 2012-13 was the purchase of a new building in London, United Kingdom, for $114 million. This purchase, along with several, much smaller, capital asset transactions (net increase of $33 million) was partially offset by an $84-million decrease in the amount due from the Consolidated Revenue Fund (CRF). That reduction is the result of timing differences at year-end between the time when a transaction affects authorities and when it is processed through the CRF, and is directly related to the reduction in the amount of accounts payable and accrued liabilities., 209590=DFAIT developed strategies to manage and modernize its CBS workforce over the next five years. Human resource management risks associated with the implementation of Budget 2012 decisions were successfully managed through the provision of timely work force analysis and support to managers., 74974=This sub-program helps to ensure that government decision makers are satisfied with the policy advice provided by the department. This is a new sub-program, and performance information was not collected in 2012-13. DFAIT is developing a methodology for the next reporting cycle to assess the alignment of activities with priorities, the impact and effectiveness of advocacy, the quality and relevance of political and economic reporting, and results achieved by missions in advancing Canadian interests., 118897=DFAIT used key international outreach events in the United States and at the 2012 Summer Olympic Games as well as at other international events and conferences to highlight the advantages of investing in Canada., 106648=To expand Canada's trade relationships with high-growth markets in the Asia-Pacific region, DFAIT secured entry into the Trans-Pacific Partnership negotiations in October 2012 and participated in two rounds of negotiations., 168414=Canada concluded an agreement with the United Kingdom to enhance mutual support at missions abroad, which was signed by Minister Baird and the U.K.'s Secretary of State for Foreign Commonwealth Affairs in September 2012., 100258=The largest share of Canada's 2012-13 contributions to international organizations went to UN peacekeeping operations ($228 million), including Afghanistan, the Democratic Republic of Congo, Côte d'Ivoire, Cyprus, Haiti, Kosovo, Liberia, Sudan, and South Sudan. Canada paid its assessed contributions of $104.8 million to the core budget of the United Nations in full, on time and without conditions., 56276=Actual spending was $11.2 million lower than planned spending, due to the fact that planned spending did not include $4.3 million in revenues credited to the vote generated through specialized consular fees, and $1.0 million in efficiencies related to Budget 2012., 226925=International Joint Commission (Canadian Section) 234 Laurier Avenue West, 22nd Floor Ottawa, ON K1P 6K6 Tel.: 613-996-2984 Fax: 613-993-5583 www.ijc.org, 124518=DFAIT addressed internal audits and evaluations that were conducted in 2011-12, for example, by developing a tool to predict program costs in response to the Early Implementation Audit of Global Commerce Support Program. DFAIT addressed the Evaluation of the Global Commerce Strategy by further incorporating GCS objectives into departmental initiatives., 210967=The implementation of DFAIT's Financial Management Advisor model was further advanced in 2012-13 to ensure sound advice is provided to ADMs on resource management and financial performance issues. Financial management and control was rated \"Acceptable\" through the 2012-13 MAF process., 227476=National Capital Commission (NCC) 202-40 Elgin Street Ottawa, ON K1P 1C7 Tel.: 613-239-5000 or 1-800-465-1867 (toll-free) TTY: 613-239-5090 or 1-866-661-3530 (toll-free) Fax: 613-239-5063 www.capitaleducanada.gc.ca, 228811=Effective July 2, 2013, Passport Canada moved from DFAIT to Citizenship and Immigration Canada., 30295=While progress was made on improving the physical infrastructure of chanceries, official residences and staff quarters to better protect personnel at high-risk missions, this remains a resource-intensive, multi-year challenge. A new unit was established in 2012-13 to build additional capacity to advance work in this area., 61156=During 2012-13, DFAIT considered the environmental effects of initiatives subject to the Cabinet Directive on the Environmental Assessment of Policy, Plan and Program Proposals. Through the strategic environmental assessment (SEA) process, the department reviewed 81 departmental initiatives, which were found to have no environmental effects, either positive or negative. Further information on the results of the SEAs is available on the departmental website., 66549=Through its 2012-13 RPP, DFAIT developed a coherent and integrated vision of how to advance Canada's international priorities in a manner consistent with the government's objectives and in close cooperation with 32 other government departments, provinces and agencies working abroad., 57909=Actual spending was $12.1 million lower than planned spending mainly due to $4.2 million in efficiencies related to Budget 2012 and to the fact that the actual carry-forward was less than projected., 55054=Actual spending was $242.5 million lower than planned spending, mainly due to $47.7 million in efficiencies related to Budget 2012 and the fact that planned spending did not include revenues credited to the vote of $13 million generated through the International Youth Exchange program. Other variances are due to surpluses in vote 1Footnote 6, surpluses in vote 10Footnote 7, and a surplus of $19.6 million related to international assistance programmingFootnote 8., 226671=Canadian Commercial Corporation 50 O'Connor Street, Suite 1100 Ottawa, ON K1A 0S6 Tel.: 613-996-0034 (local) or 1-800-748-8191 (toll-free) Fax: 613-995-2121 www.ccc.ca, 168648=An internal audit of diplomatic mail services was completed in 2012-13 to ensure the overall adequacy and effectiveness of controls in place to protect the integrity of the diplomatic mail service. The audit confirmed that many controls are in place and operating effectively., 120072=The Canada-China Joint Economic and Trade Commission met in September 2012 to foster bilateral consultations focused on expanding and advancing two-way trade., 221461=Electronic supplementary information tables listed in the 2012-13 Departmental Performance Report can be found on DFAIT's web site., 88527=DFAIT supported the implementation of the Canada-U.S. Shared Vision for Perimeter Security and Economic Competitiveness by advancing work on the Beyond the Border Action Plan. The 2012 Great Lakes Water Quality Agreement was ratified and brought into force to address emerging issues related to water quality in the Great Lakes., 60036=For information on DFAIT's organizational votes and/or statutory expenditures, please see the Public Accounts of Canada 2013 (Volume II). An electronic version of the Public Accounts 2013 is available on the Public Works and Government Services Canada website., 177399=An enhanced approach to mission threat assessments, including baseline threat assessments (BTA), was implemented to support risk-based security policies and decisions. Based on lessons learned from a pilot project in 2011-12, the BTA methodology and consultation process was significantly strengthened, enabling greater comparability of BTAs across DFAIT's mission network.}",
    "textBeforeTable": "1.6 Summary of Performance Other notable progress in addressing this risk included the introduction of a new program to ensure that the 37 highest-risk missions have access to professionally trained Security Program Managers. The program was 70-percent completed before April 2013 and will have been completely rolled out by September 2013. While progress was made on improving the physical infrastructure of chanceries, official residences and staff quarters to better protect personnel at high-risk missions, this remains a resource-intensive, multi-year challenge. A new unit was established in 2012-13 to build additional capacity to advance work in this area. More information on the first year of implementation of the DSP is provided in section 2.3.1.3 of this report. By the end of the year, baseline threat assessments or shorter threat assessments were in place for 75 percent of DFAIT missions. The department undertook six initiatives in 2012-13, summarized above, to address the likelihood and impact of this external risk, should it occur. This risk is addressed by DFAIT's Departmental Security Plan, and the Operations Committee monitored progress in this area on a quarterly basis. DFAIT's DSP was put in place in June 2012, and a Chief Security Officer at the assistant deputy minister level was identified to improve the integration of security issues into senior management decision making. While personal security awareness training and physical security equipment and protocols have been in place for some time, risk tolerance discussions with senior management are ongoing. DFAIT is cognizant of the risk that",
    "textAfterTable": "Planned 2012-13 Actual 2012-13 Difference 2012-13 3 FTEs are a measure of the extent to which an employee represents a full person-year charge against a departmental budget. FTEs are calculated as a ratio of assigned hours of work to scheduled hours of work. Scheduled hours of work are set out in collective agreements. 4 The variance between planned FTEs and actual FTEs is mainly due to efficiencies related to Budget 2012, and to delays in planned staffing. 13,367 12,383 -984Footnote 4 Strategic Outcome 1:Canada's International Agenda The international agenda is shaped to Canada's benefit and advantage in accordance with Canadian values and interests. Program Total Budgetary Expenditures (Main Estimates 2012-13) Planned Spending Total Authorities (available for use) 2012-13 Actual Spending (authorities used) Alignment to Government of Canada Outcomes 2012-13 2013-14 2014-15 2010-11 2011-12 2012-13 P 1.1: International Policy Advice and Integration 100.5 105.1 75.3",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}