{
    "relation": [
        [
            "Joystick Position",
            "Center",
            "Up",
            "Down",
            "Right",
            "Left",
            "Upper Right",
            "Upper Left",
            "Lower Right",
            "Lower Left"
        ],
        [
            "Left Motor",
            "Locked",
            "Forward",
            "Reverse",
            "Forward",
            "Reverse",
            "Forward",
            "Locked",
            "Locked",
            "Reverse"
        ],
        [
            "Right Motor",
            "Locked",
            "Forward",
            "Reverse",
            "Reverse",
            "Forward",
            "Locked",
            "Forward",
            "Reverse",
            "Locked"
        ]
    ],
    "pageTitle": "Speed Controls - 4 Jan 2003",
    "title": "",
    "url": "http://www.rctankcombat.com/articles/speed-control/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00293-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 678310511,
    "recordOffset": 678294044,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Tri-Pact Speed Control The Tri-Pact Speed Control combines two relay-based MAG Speed Controls and a simple diode circuit to provide a speed control that drives two motors using a single transmitter joystick in a natural manner. Specifically, the Tri-Pact Speed Control provides the following motor controls based on the position of the joystick: Click Photo For Enlargement (64 Kb) Click Photo For Enlargement (144 Kb) The picture shows a dual MAG speed control implemented with 20amp automotive relays that is used to control two independent tracks. The relays are installed in sockets that come with all of the wires attached (can't beat that for $1.29) The battery is connected using the red and black wires on the bottom. The common ground (black) is connected to the normally-closed (NC) pole on each relay and to one side of each relay coil. The positive wire (red) is connected to the normally-open (NO) pole on each relay and through 4 individual switches (not shown) to the other side of the relay coil via the white wires. Finally, the yellow wires are connected to the common pole on each relay",
    "textAfterTable": "The Tri-Pact Speed Control requires a small number of relatively inexpensive parts that are easily obtained in any auto parts or electronics store, and can be built with nothing more than a set of wire strippers and a soldering iron. For example, the following parts list could be used to acquire all of the necessary components from All Electronics (last updated 8/11/2007): Component Part Number Quantity Each Cost 12 VDC SPDT 30 AMP AUTO POWER RELAY RLY-351 4 $2.40 $9.60 SOCKET FOR AUTOMOTIVE RELAY SRLY-2 4 $2.00 $8.00 SPST N.O. SNAP-ACTION SWITCH SMS-167 4 $0.50 $2.00 3AMP/1000 PIV DIODE 1N5408 12 $0.33 $4.00       TOTAL $23.60 H-Bridge Speed Control One of the most common circuits used for controlling the direction of a motor is known as an H-bridge (named because the circuit diagram looks like the letter 'H'). H-bridge controllers can be built using a variety of components, including",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}