{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,122 topics 2,124,999 replies",
            "85,557 topics 1,153,861 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,761 replies",
            "5,996 topics 75,814 replies",
            "50,548 topics 466,230 replies",
            "22,766 topics 196,305 replies",
            "4,271 topics 60,459 replies",
            "1,127 topics 8,216 replies",
            "3,604 topics 115,482 replies"
        ],
        [
            "Last Post Info",
            "Story Mode DLC discussion t... By thafablifee46 A minute ago",
            "Reasons why GTA IV is bette... By Militia 2 minutes ago",
            "Why does this game receive... By Sayuri 12 hours ago",
            "Whats your favourite radio... By Ivan1997GTA 2 hours ago",
            "Favorite Gang By crashrock2 3 minutes ago",
            "Favorite gym fighting style? By Militia 10 minutes ago",
            "Reasons why Vice City is be... By lolznc 44 minutes ago",
            "Favorite Character By crashrock2 A minute ago",
            "What do you hate of GTA 2? By Cerium 4 hours ago",
            "Grand Theft Auto: South Yan... By SpaceJunk 6 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=58&t=524836&p=1061800244",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00230-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 108412603,
    "recordOffset": 108391119,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14036=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 18465=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 16243=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 20600=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 116878=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 46925=Bing, Yahoo, Paulie050, Google, Furry_Monkey, xTrendSs, statistic, Nameless Foot Soldier, Bullit1990, ClaudX, ATastyCookie, Shiest Bubble, Eram, camo_boy67, Slam_Jones, Rucke, paperbagdude, p1ckl32, livejoker, Kingorion88, Vandous, crashrock2, Heatingexpert35, SuperGTFan, SSJEavan747, Official General, Google Mobile, dkluin, Stolas, Thousand Accent, unicornace, Trishan99, epoxi, stretchx9, Dillono, Vinewood Villain, Failure, Synshade, nordi, Kirkor, PSgtaplayer1, 11john11, doubleg213, DiscoPanda, FMMZ, The Made Man, thafablifee46, GTAandStuff, Luck of Murphy, Mika_0013, jalenliu, XCarlSagan865X, someoneyouwontknow, Edmachine, Bluntnation94, Alvarez, PS3KillsThe360, onespookyhuman, Angel Bryan, Victor Strawn, psymin, The Mysterious One, digitalclips, Modojo, Captain Sensib1e, sarpkafes, jam_1989, oCrapaCreeper, GTAKid667, Kirsty, m2roadwarrior, Pletzturra, top dog, Hades_, Turan, hornedturtle, DJQuaie, 8up local, garza337, unbindmoney, Fozzie_420, elhazard1790000, GTAVNoob, marshallbslayer, Rented, A.O.D.88, ChickenAndBeer, Killerman78, Phil Collin, skeochj.1, Hylskriksen, DarkVII, Silent, Maxandmov, DumbForum, ThirteenAG, DJ_Jiggles, MaqLite, Daemian, Pavle, ngazi, Craank_AG, Cover2blitz0, CMGreger, mirrorparkradio, Killerman29, Bender.ㅤ, TheNumberOfTheBreast, VikDarkbomb, fkikokikogta, SonofUgly, CrossPT, lord tammerlain, NubcakeVII, bamsaidcam, Saint_Jackie, longhurstgb, evinaz, FlexPiTo, mrpringles, ghoraaa, Heisenberg_GR, deadx23, nodtomc, GTAmazing, shadowkill98, Cognoscenti, GTA_Matt24, Huraldo, Wolf of Badenoch, D3ViOU5, corbinh123, Thecomrade9, AeroAviation, __TheGovernor__, Fakeplastictrees, Vaniox9, CBStian, Hjaere, Radius95, FlacidJack, Heists, Juicyfer, Antigenetic, theminted, Delta8042, Kixa, Spadge007, Scuba 21, whywontyoulisten, Retired Mafia, The Ghost 206, Royal22, missanthropy, Z i X, Shmoopy, conedotexe, Halal Cyborg, Pyroshox, Run, VideoGameJames, Money Over Bullshit, CrazyDog150, GTA@ddict13, SuperHolySheep, Jon3s, Neopolitan, TWOGUN, Vova07, RandomCholo, Evergreen, TheMcSame, Rendy Specter(Riandy), C64fanatic, BisP, Warliss, Fireman, laskaland, Megazocker, AztecaEh, josephene123, Matttheking2015, WestsideResider, BoomBapPoet, Midnight Hitman, Gangstaluv21_, arewenotmen, Fuzzknuckles, JuanG12, jerryinohio78, Major Seven, Red Lynx 23, Quinn_flower, Juan Capone, marmoo, m3tal z_DKI, SAVILLAIN, SevDoggX, tiringthepigpen, Lebowski_RS, KingxGregory, Beastly40, MajorVienna, Andreas, Jlogano22, The Squirrel, RocknRumble, Charmlessrogue, Lowi, Black_MiD, VercettiCrimeFamily, Warablo, funmw2, Andreaz1, Burr, MistGoose, ironMANx956, R4Yn1zzl3, Verstappen, _CP_, Private Custard, Guad, Cuesta, universetwisters, MGgames100, gta5fan1001, Nutduster, ED-E, DonSpeedy, Stoby200, topkek, novesori, NightTrainCaine, Braindawg, lazlow555, Cico555, lydianduck, Semaj 2JZ♢, Junko Enoshima, Gammoudicj, GTA4LIFE9000, Smooth Longsack, svanderman, o_Marvelous, Daequil, ten-a-penny, *MURDOC*, US Marshal1911, Richardbrown30, StoneCold-Y2J, INightwing, Aquilus, Sasuke Uzumaki, Marwin, Bane X01, Voit Turyv, saintsrow, spaceeinstein, Flesh-n-Bone, GTA_The_Series, PoeticWhisper, TacoSmuggler, IIOctaneII, JCX1992, Spaghetti Cat, Bms842, MaxInk076, Busta93, 9223=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 12470=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 3 minutes ago By Fozzie_420 The Duping Crew 613,487 replies 15,203 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By unicornace what do you do first...? 2,283,972 replies 113,415 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,468 topics 416,630 replies Vehicle sounds dont work! By Alaannnn 30 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}