{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,123 topics 2,125,011 replies",
            "85,557 topics 1,153,863 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,761 replies",
            "5,996 topics 75,814 replies",
            "50,548 topics 466,231 replies",
            "22,766 topics 196,305 replies",
            "4,271 topics 60,460 replies",
            "1,127 topics 8,216 replies",
            "3,604 topics 115,483 replies"
        ],
        [
            "Last Post Info",
            "Favorite \"One Line\" from an... By Cutter De Blanc 8 minutes ago",
            "Bored? Try these... By LightningLord 4 minutes ago",
            "Why does this game receive... By Sayuri 12 hours ago",
            "Whats your favourite radio... By Ivan1997GTA 3 hours ago",
            "Favorite Gang By crashrock2 42 minutes ago",
            "Favorite gym fighting style? By GamesBoy316 9 minutes ago",
            "Reasons why Vice City is be... By lolznc An hour ago",
            "Grand Theft Auto III Pre-Re... By gts. 8 minutes ago",
            "What do you hate of GTA 2? By Cerium 4 hours ago",
            "Deadliest Grand Theft Auto... By Claptrap NL 28 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=65&t=477192&p=1060498042",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00318-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 108076211,
    "recordOffset": 108047897,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16219=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 20480=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 119119=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 12445=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9382=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 18348=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 47355=Bing, Google, Yahoo, SuperHolySheep, A.O.D.88, Colbydogs, Ledorus, NikoB08, Rented, Thousand Accent, FunkyFreak, missanthropy, GTAKid667, lord tammerlain, MajorVienna, Bootels, Zaldrex, inadequate, Silent, Heysuse, ChumpDelux, FUBAR1991, Mockingbae, TrickyTrifecta, IDredMan, Scuba 21, Goukou, The Made Man, SonofLosSantos, derek0514, PsychoGamer, Kirsty, Sigurd, gpcguy1, marshallbslayer, blendnallbani, Raul Passos, Fox2Quick, FlacidJack, Zello, Muskidinho04, PoeticWhisper, Neopolitan, KyloW13, DragonSpade, RobinVerhulstZ, Claude4Catalina, Mona Sax, jakematos2, Wheatley, KILL_KILLUMINATI, TarHeelJohn, Fireman, GVJLIMA, Huraldo, VercettiGuy, Cripto136, dkluin, Jay5295, Viper5900, Neutrinobeam, tr28999, Legomanarthur, epoxi, -jr-, Google Mobile, starblind94, the nameless, Rucke, evoluon--720, Kirkor, CeltHD, TheMcSame, Billiam301, r.lorenzo13, Roadrage158, deadx23, Respect2, josephene123, Fozzie_420, Vandous, maxpin, alfscooby98, Flawless_mike, gts., Jon Snow, ManInBlack, AgentExeider, Katabasis, juhhooo, Speccy, Claude Slow (cousin), NubcakeVII, Aquilus, Slam_Jones, CaptianBackwoods, RussianCommie, Bane X01, Cognoscenti, PhillBellic, Swoorup, Wesser, ChickenAndBeer, GamesBoy316, TacoSmuggler, Scarface187, crashrock2, gtaguy95, Vaniox9, Ermacs, dewtech_2008, Saso70, alexnicnac, Dяno, Fuzzknuckles, jrl51592, BeckermannDewitt, allinclusive, Bread_, zerGoot, TJGM, ClaudX, MrLuquinhas, mrtommygunwhite, Gammoudicj, S1N0D3UTSCHT3K, pockings, CBStian, Legend2871, coach_wargo, Soldier Clown, customkingpimp, tonilcs, monkb4skunk, 69_black_69, Ezekeil2Ofive17, RayBanNeonColors420, SpaceJunk, iamcornholio, feloniousrick, SeekingAsylum, Matias_Montanna, topkek, Misunderstood, ash-274, Jammsbro, JaegerPilot1, CReaper210, Smooth Longsack, ItsThatGuy!, Andreas, SilentSeasons, Fakeplastictrees, progamer1258, Claptrap NL, Lord-Zaeon, Gamerjman19, Daequil, 313izzle, Spectacus, darthYENIK, nokuto, link-thezoraband, camo_boy67, Hyde Original, jvaccaro, BlackMilk, 018361, //XP//, CrossPT, ED-E, sebbellic01, McH2Oz2, Stoned Hillbilly, shadowkill98, Killerman29, KlIIUMlNATl, theminted, Trevor Philips Inc, Days Are Gone, ela089, Edward Nashton, Gtaultimatefanboy, Private Custard, xTrendSs, ashank975, Alaannnn, pigeons99, Spadge007, Hover_Mode, DeucesR, Neos7, *Lola, diamond-optic, magluts02, JmStyx, top dog, JimmyFantastic, Failure, Pavle, Rt001, Wesyeed, Bluntnation94, TheUnholy, Spaghettii, Tony_Florence, Stolas, Hylskriksen, Pandassaurus, Moryachok, Nameless Foot Soldier, AztecaEh, fac316, Gummy14, Stoney0503, OTFxPre, Lil_Timmis, AuSsIeThUnDeR36, Killerman78, Majestic81, KingxGregory, Cuesta, GTAandStuff, Pyro_Indigo, Ieech, Atrocityl87, C64fanatic, Craank_AG, cruncheee, joe grizzly, M.K.N., Quaid, Charmlessrogue, k2x, MGCrash, doubleg213, Fonshway, Black_MiD, EvilDog77, scottmacdougall, KiTTYReCkless, Garbear38, C06alt, Evergreen, MyName'sJeff, CrazyDog150, onefast96svt, DumbForum, hornedturtle, GuerrilleroESP, s2n vaniish, miclin, Logic301, humdinger13, 11john11, ibsmokin, statistic, Gytis-JDM, bewareofdoom, HunterGatherer, NightTrainCaine, MeatSafeMurderer, Electrogypsy, roboticsuperman, Bms842, RaduG, AboveAndBeyoncé, SonofUgly, xxJ0n4Th0Nxx, SuperGTFan, supanaut, DaveGrimes96, oCrapaCreeper, Kajjy, ghoraaa, 14011=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 3 minutes ago By PhillBellic Roman Bellic Enterprises 613,493 replies 15,204 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Bootels Sticky Bomb not working again? 2,284,024 replies 113,420 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,468 topics 416,631 replies Get accelerate key. (Diefin... By Neutrinobeam 2 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}