{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,124 topics 2,125,014 replies",
            "85,557 topics 1,153,865 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,761 replies",
            "5,996 topics 75,814 replies",
            "50,548 topics 466,231 replies",
            "22,766 topics 196,305 replies",
            "4,271 topics 60,461 replies",
            "1,127 topics 8,216 replies",
            "3,604 topics 115,484 replies"
        ],
        [
            "Last Post Info",
            "About Johnny By A.O.D.88 A minute ago",
            "Reasons why GTA IV is bette... By Ganton 3 minutes ago",
            "Why does this game receive... By Sayuri 13 hours ago",
            "Whats your favourite radio... By Ivan1997GTA 3 hours ago",
            "Favorite Gang By crashrock2 An hour ago",
            "Favorite gym fighting style? By GamesBoy316 30 minutes ago",
            "Reasons why Vice City is be... By lolznc An hour ago",
            "Where would you live in Lib... By Pikas_PK 4 minutes ago",
            "What do you hate of GTA 2? By Cerium 5 hours ago",
            "Lets play a game of \"Wo... By Claptrap NL A minute ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=116&t=322332&p=1058137887",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00047-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 110242459,
    "recordOffset": 110220120,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47301=CrysisAverted, Evil Blockahwood, Bing, AlphaSierra-1196, Google, Yahoo, Kirsty, Aquilus, Furry_Monkey, FangornStorm, Crubbiestimp42, bt flash, Fireman, Big_Boy_Bmw760Li, PsychoGamer, BengeyBoy, ClaudX, Ray, paperbagdude, LilSean, IDredMan, SlingShot753, GrandTheftRobbo, Synophrys, Midnight Hitman, alex8b, A.O.D.88, JSnipe135i, lord tammerlain, SuperVeloce, ReaperCrew, XJpostman, Malikstuntin, Semaj 2JZ♢, EL_Greco, xTrendSs, Jesse.yancey320, EvilDog77, Black_MiD, GrandMaster Smith, Killerman78, LFC484, DragonSpade, Claptrap NL, top dog, StangOne50, FlexPiTo, ringtone7, skit.mofo, Wikstr3, GradientDruid, Indignation, Respect2, Heists, gtuned, PS3KillsThe360, Rented, Pizentu, Red Lynx 23, Farque2, Mr. Jago, Pikas_PK, wh1t31v3y, Bread_, Saddler, jrl51592, Cripto136, Share Sharqi, VikDarkbomb, SchoolOfHardKnocks, Zello, Hover_Mode, MajorVienna, Fozzie_420, zombrex2311, ViciousSpirit, jukebox, Cognoscenti, evoluon--720, iamcornholio, Google Mobile, //XP//, Flawless_mike, Stolas, _CP_, Bender.ㅤ, lydianduck, Fox2Quick, Met-Hörnchen, missanthropy, ScarySKRILLEX, Choppers, Kirkor, PoeticWhisper, the consigliere, R4Yn1zzl3, L0SS4NT0SK1LL3RV, ghoraaa, r.lorenzo13, defiantx, tr28999, Lil Kenzo, Officer Vic, Miss Malevolent, TheSniperCat13, Prodigy_Rocks_, garza337, deadx23, SILENT_Pavel, ash-274, Epic., Leonazix, TacoSmuggler, Frantz Fuchs, ChickenAndBeer, tdavies457, 018361, Adrian J., NightTrainCaine, BeckermannDewitt, derek0514, -Anti-, Alfred Packer, MotelGuy, JaegerPilot1, Street Mix, Bane X01, gpcguy1, Adeel007, Trippyegreatest123, Thousand Accent, Wanderer800, TarHeelJohn, psymin, Goukou, TJGM, TrustedInstaller, ANDREWjkl, Taylor, celran, Viezo, diget2000, XxFA2EKILLERxX, Alaannnn, PhillBellic, roboticsuperman, Officer Ronson, DustyRider, RobinVerhulstZ, Elemunt, T.V. Eye, SeekingAsylum, FedoraTheExplora, D- Ice, Fuzzknuckles, joe1606, shadowkill98, cmp2005, Xpert.K, Itzreality, TheJez0r, doubleg213, icecoldkilla1467, dewtech_2008, Sentinel Driver, Scarface187, Eneveon, hornedturtle, Colbydogs, Edward Nashton, UNH1NG3D, TrickyTrifecta, Vinewood Villain, Cico555, southparkmayor, Slam_Jones, Viper5900, statistic, Daequil, TrevorAngry, Zealous2K18, Ezekeil2Ofive17, Matias_Montanna, magluts02, Failure, Beckerbrasil, shadowski, Rendy Specter(Riandy), Captain Sensib1e, stonedpimpso, oscardo, Majesticnug420, StoneCold-Y2J, Bms842, Shabazz916, GTAKid667, pigeons99, Artful., CptWuTang, p-s-3x, Jon Snow, Claude Slow (cousin), slowburn29, koobz123, Sigurd, eralebus, ringo336, Pavle, Modojo, Squirrel__Army, crashrock2, Mockingbae, epoxi, swirler, meta187, Katabasis, the nameless, abzz34, Scuba 21, s2n vaniish, ChumpDelux, ForcedFedSupra, SkynetOnlineID, unikatil, smokingndriving, Mona Sax, Rucke, Holo fenix, ApexReclaimer, K-ROSE, SonofLosSantos, GVJLIMA, adit999, GTA3Rockstar, Roadrage158, Jay5295, oCrapaCreeper, inadequate, *MURDOC*, Quarthon, GB981, topkek, PS-GTAIVplayer, JoeFury1997, Choco Taco, marshallbslayer, jakematos2, Pandassaurus, S1N0D3UTSCHT3K, athande, Heysuse, Ieech, silverharbinger, SkyChat, diegomart123, Nlwt, thewhitehammer99, Neopolitan, Antigenetic, conedotexe, Mottershead, Tony_Florence, Rippir1600, Arc_Angel, ZIPPORAID, JimmyFantastic, Retired Mafia, Zeuez, 16099=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 117813=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 9183=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 12328=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 20361=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 18229=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 13894=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By Heysuse The Duping Crew 613,497 replies 15,205 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By FlexPiTo You're not going to get... 2,284,059 replies 113,421 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,469 topics 416,631 replies Is there a good Ragdoll phy... By Aquilus A minute ago Mod Showroom Scripts & Plugins, Maps, Total",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}