{
    "relation": [
        [
            "GRADE",
            "4",
            "4",
            "5",
            "5",
            "6",
            "6",
            "6",
            "6",
            "7",
            "7",
            "7",
            "7",
            "7",
            "8"
        ],
        [
            "WINNER",
            "Douglas John Warren",
            "Lauren Tarsi",
            "Julie Klimchak",
            "Ryan Stainken",
            "James Karwacki",
            "Erin Downing",
            "William Duffy",
            "Ted Kozlowski",
            "Suzanne Haas",
            "Rich Infusino",
            "Naomi Makofsky",
            "Saray Noda",
            "Steven Smith",
            "Kyle Fischer"
        ],
        [
            "HOMETOWN",
            "Laurence Harbor",
            "Hampton",
            "Flemington",
            "Hillsborough",
            "Florence",
            "Marlton",
            "Hightstown",
            "Washington",
            "Franklin Lakes",
            "Franklin Lakes",
            "Franklin Lakes",
            "Newark",
            "Franklin Lakes",
            "Whitehouse Sta."
        ],
        [
            "PLACE",
            "1st",
            "2nd",
            "1st",
            "2nd",
            "1st",
            "2nd",
            "Honorable Mention",
            "Honorable Mention",
            "1st",
            "2nd",
            "Honorable Mention",
            "3rd",
            "Honorable Mention",
            "1st"
        ],
        [
            "SCHOOL",
            "Memorial School",
            "Union Twp. School",
            "Holland Brook School",
            "Auten Road School",
            "Holy Assumption School",
            "Marlton Middle School",
            "Melvin H. Kreps School",
            "Memorial School",
            "Franklin Ave. MS",
            "Franklin Ave. MS",
            "Franklin Ave. MS",
            "Glady\u0092s Hill Jones MS",
            "Franklin Ave. MS",
            "Not available"
        ]
    ],
    "pageTitle": "Fish Art & Writing Contest Winners Honored at Trout Season Opener",
    "title": "",
    "url": "http://www.state.nj.us/dep/fgw/news/2001/cntstwin.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991951.97/warc/CC-MAIN-20150728002311-00143-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 720618378,
    "recordOffset": 720610176,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{984=April 26, 2001, 1181=The winning entrants in the New Jersey Department of Environmental Protection's (DEP) Division of Fish and Wildlife's first Fish Art and Writing Contest were honored on the opening day of trout season, Saturday, April 7, at the Pequest Trout Hatchery & Natural Resource Education Center in Oxford, Warren County. Acting Governor Don DiFrancesco and DEP Commissioner Robert C. Shinn, Jr. were on hand to personally congratulate each of the winners as they fished in the facility's Fishing Education Pond., 2655=The purpose of the contest was to encourage children in grades 4 through 8 to learn about New Jersey's fish. Each student had to submit original artwork that depicted a New Jersey fish in its habitat along with a short bibliography of the species. The winners' artwork will be on display at the Pequest Trout Hatchery through the end of April and can also be viewed on the Division's website at www.njfishandwildlife.com.}",
    "lastModified": "Tue, 27 Mar 2007 18:00:20 GMT",
    "textBeforeTable": "Out of 150 entries, the following students were honored for their submissions: The purpose of the contest was to encourage children in grades 4 through 8 to learn about New Jersey's fish. Each student had to submit original artwork that depicted a New Jersey fish in its habitat along with a short bibliography of the species. The winners' artwork will be on display at the Pequest Trout Hatchery through the end of April and can also be viewed on the Division's website at www.njfishandwildlife.com. After fishing, the winners received plaques and fishing equipment at an awards luncheon held in the facility's auditorium. New Jersey Council of Trout Unlimited sponsored the awards, luncheon and fishing equipment. \"This is certainly one of the most enjoyable activities I have the pleasure to participate in,\" McDowell said. \"It is a credit to the parents of these youngsters to have instilled in their children the values and appreciation of nature that inspire them to create such fine work.\" Assistant Commissioner Cari Wild of DEP's Natural and Historic Resources and Division Director Bob McDowell were also on hand to spend time fishing with the youngsters. The winning entrants in the New Jersey Department of Environmental Protection's (DEP) Division of Fish and Wildlife's first Fish Art and Writing Contest were honored on the opening day of trout season, Saturday, April 7, at the Pequest Trout Hatchery & Natural Resource Education Center in Oxford, Warren",
    "textAfterTable": "",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}