{
    "relation": [
        [
            "",
            "Cheese Pizza",
            "Choose Your Toppings",
            "Pepperoni",
            "Onions",
            "Spinach",
            "Extra Cheese",
            "Chicken",
            "Shrimp"
        ],
        [
            "Slice",
            "$2.25",
            "",
            "Pineapple",
            "Mushrooms",
            "Artichokes",
            "Canadian Bacon",
            "",
            ""
        ],
        [
            "12”",
            "$11.95",
            "$1.25",
            "Bell Peppers",
            "Eggplant",
            "Salami",
            "Green Olives",
            "$1.95",
            "$3.75"
        ],
        [
            "18”",
            "$17.95",
            "$1.95",
            "Jalepenos",
            "Sausage",
            "Fresh Garlic",
            "Black Olives",
            "$4.95",
            "$6.95"
        ],
        [
            "Sicilian Square",
            "$18.95",
            "$2.25",
            "Ham",
            "Tomatoes",
            "Anchovies",
            "Meatball",
            "$4.95",
            "$6.95"
        ]
    ],
    "pageTitle": "Menu/Order at Russo's Specialty Las Vegas Pizza Kitchen",
    "title": "",
    "url": "http://russospizzakitchenlasvegas.com/menu-order",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991951.97/warc/CC-MAIN-20150728002311-00272-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 207694270,
    "recordOffset": 207686068,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21826=Executive Chef Rosario Russo immigrated to the United States from Palermo, Sicily in 1982 and has been tantalizing taste buds across the country since his arrival., 23635=Copyright 2012 © All rights reserved by RussosPizzaKitchenLasVegas, LLC.}",
    "textBeforeTable": "PIZZA $5.95 Bowl of pasta fagioli $4.95 Cup of pasta fagioli SOUP $3.95 Side salad Mixed greens with marinated roasted vegetables, ham, bacon, turkey, salami, mozzarella, tomatoes and eggs tossed in a balsamic dressing $11.95 Russo’s Chopped Salad $11.95 With grilled chicken $7.95 Standard Romaine lettuce, with Romano cheese and croutons tossed with Caesar dressing $7.95 Caesar Salad Lettuce, tomatoes, cucumbers, pepperoncini, feta cheese, kalamata olives, and House Dressing $9.95 Greek Salad Lettuce, tomatoes, cucumber, and House Dressing $5.95 Dinner Salad Mixed greens with salami, pepperoni, capicola, artichoke hearts, olives, tomatoes, roasted red peppers, red onions and provolone cheese $11.95 Antipasto Alla Russo's SALADS Genoa Salami, ham, capicola and provolone cheese, piled high with red onions; lettuce, tomatoes and Italian dressing (try it hot or cold). Served on ciabatta bread",
    "textAfterTable": "Cheese Pizza By the Slice $2.25 SPECIALTY PIZZA Can’t find tasty specialty pizza Las Vegas? Russo’s is here to help. We not only have some of the best New York style pizza in Las Vegas, we also cook up some of the most delicious specialty pizzas that will satisfy a plethora of different tastes. Whether you are a meat lover or prefer veggies, check out our list of great specialty pizza Las Vegas. The Russo’s Special is a popular one with our customers for its great blend of pepperoni and sausage mixed with sweet bell peppers and onions. It’s a crowd pleaser! We also have our delectable shrimp scampi pizza and our fresh tomato, basil and garlic which never disappoints. Stop in today and check out all of the specialty pizzas that we offer!   12\" 18\" Russo’s Special $14.95 $23.95 Pepperoni, sausage, mushrooms, bell peppers and onions Stuffed Pizza $13.95 $24.95 Pepperoni, salami, sausage, ham and mozzarella Vegetarian $12.95",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}