{
    "relation": [
        [
            "Competition",
            "League",
            "Coppa Italia",
            "Europe",
            "Others",
            "Total"
        ],
        [
            "Games",
            "24",
            "1",
            "5",
            "0",
            "30"
        ],
        [
            "Goals",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Assists",
            "2",
            "0",
            "1",
            "0",
            "3"
        ],
        [
            "Booked",
            "1",
            "0",
            "0",
            "0",
            "1"
        ],
        [
            "Sent off",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Who is AC Milan's Player of the Season? - Goal.com",
    "title": "",
    "url": "http://www.goal.com/en/news/1717/editorial/2013/04/22/3912822/who-is-ac-milans-player-of-the-season?ICID=AR_AB_next",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991951.97/warc/CC-MAIN-20150728002311-00326-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475553603,
    "recordOffset": 475532454,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2827=Goal.com nominates the top three stand-out performers for the Rossoneri in 2012-13 - cast your vote in the comments box at the foot of the page}",
    "lastModified": "Tue, 04 Aug 2015 20:47:34 +0000",
    "textBeforeTable": "MATTIA DE SCIGLIO | DEFENDER Goal.com's three nominees for Milan’s player of the season, based on their club performances in all competitions. Cast your vote in the comments box at the foot of the page. Below, in alphabetical order, are Consequently, while Milan will end their 2012-campaign without any silverware, they are, however, on course to claim a Champions League place courtesy of some stellar showings from two exciting young talents and one wonderfully shrewd signing from Fiorentina. However, what initially looked like a season of torment and transition has instead become a season of rapture and rejuvenation. Pessimism has given way to optimism, with the fans' faith having been restored by the cultivation of an exciting crop of youngsters, as well as a statement signing in the shape of Mario Balotelli. Rossoneri supporters effectively decided to issue a vote of no-confidence in the club's directors. AC Milan season ticket sales hit an all-time low last summer. Bewildered by the",
    "textAfterTable": "Mattia De Sciglio has been so good this season that he has not only been compared to Paolo Maldini, he has been praised by him. “I like the way he plays,” the legendary defender revealed last month. Comparisons between the two were inevitable. Like his idol, De Sciglio was born and raised in Milan. Like his idol, De Sciglio is a prodigiously gifted full-back capable of playing anywhere across the back line. The 20-year-old started the season as Ignazio Abate’s understudy, but he will end it as an Italy international and one of the poster boys of the new Milan. STEPHAN EL SHAARAWY | FORWARD Competition Games Goals Assists Booked Sent off League 32",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}