{
    "relation": [
        [
            "Candidate",
            "Desmond",
            "Freeman",
            "Gonzalez",
            "Pence",
            "Puig"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "AVG",
            ".280",
            ".307",
            ".300",
            ".264",
            ".394"
        ],
        [
            "HR",
            "15",
            "9",
            "14",
            "13",
            "8"
        ],
        [
            "RBI",
            "49",
            "56",
            "58",
            "43",
            "19"
        ],
        [
            "SB",
            "10",
            "0",
            "0",
            "13",
            "5"
        ],
        [
            "OPS",
            ".822",
            ".858",
            ".842",
            ".759",
            "1.061"
        ]
    ],
    "pageTitle": "Braves support Freeman with 'Hugs for Votes' | braves.com",
    "title": "",
    "url": "http://m.braves.mlb.com/news/article/53221172",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991951.97/warc/CC-MAIN-20150728002311-00089-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 143092335,
    "recordOffset": 143067976,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5245=Everything seemed to be great on May 7, 2012, when Freeman earned his second NL Player of the Week Award in a span of five weeks. But as he was taking batting practice at Wrigley Field that day, he began battling the vision problems that would bother him the remainder of the season., 8261=For the second consecutive year, the 2013 All-Star Game MLB.com Final Vote Sponsored by freecreditscore.com (#FinalVote) will include a social balloting element as Twitter support from the candidates' fans over the last six hours of balloting will count toward their Final Vote totals. From 10 a.m.-4 p.m. ET on Thursday, any tweet that includes a designated player hashtag will be tabulated as part of the overall vote total used to determine the American League and National League winners. Fans may follow @MLB on the popular social networking service for the latest standings updates in advance of the balloting deadline., 7911=Mobile voting in the U.S. and Canada is open to everyone. In the U.S., to receive the Final Vote mobile ballot, text the word \"VOTE\" to 89269. To vote for Freeman, simply text message N2 to 89269. To vote for Delabar, text A2. In Canada, fans should text N2 or A2 to 101010. Standard message and data rates may apply., 8909=There will be an extra treat for fans who participate in the Final Vote online. If you are not a current MLB.TV subscriber (MLB.TV or MLB.TV Premium), you are eligible to receive a 14-day free trial of MLB.TV from July 12-26. If you are a current MLB.TV subscriber (MLB.TV or MLB.TV Premium), you will receive a 15-percent discount to the MLB.com Shop. MLB.com will send an email on July 12 to all Final Vote voters with instructions on how to redeem the applicable offer., 7495=Now in its 12th year, the 2013 All-Star Game Final Vote sponsored by freecreditscore.com gives baseball fans around the world the opportunity to select the final player on each All-Star team. Balloting began immediately following Saturday's Major League All-Star Selection Show presented by Taco Bell and ends Thursday at 4 p.m. ET. The winners will be announced on MLB.com shortly thereafter.}",
    "textBeforeTable": "NL Candidates BY THE NUMBERS MIAMI -- Most of the optimism surrounding the Braves entering this season centered around the offseason additions of the Upton brothers. But as B.J. and Justin have produced disappointing results thus far, Freddie Freeman has carried the load and proven to be the undeniable Most Valuable Player of a club that has been in first place longer than any other Major League club this season. 0 COMMENTS + | MLB.com By Mark Bowman / 7/9/13: Dan Uggla shows his support for teammate Freddie Freeman in the All-Star Game Final Vote by wearing a special T-shirt 0:20 Uggla supports Freeman Print Email",
    "textAfterTable": "* Stats entering July 11 \"I think everybody in this clubhouse knows that,\" Braves veteran pitcher Tim Hudson said. \"He's been consistent all year. He's gotten the big hits. He's a baseball player and he's really good. He's a pure, pure hitter, and nowadays, there aren't too many of them.\" As Freeman has progressed through the first half of his third Major League season, he has continued to display power to all fields and the ability to consistently put the ball in play, especially in clutch situations. The 23-year-old Braves first baseman is one of 14 National League players who have hit at least .300 and produced a slugging percentage of at least .450. But he is the only member of this group that has not yet gained an All-Star selection. Freeman's hope to compete in the All-Star Game for the first time hinges on whether he maintains his lead over the four other NL candidates on this year's Final Vote ballot. When the latest results were released Tuesday morning, Freeman was holding a slight lead over Dodgers outfielder Yasiel Puig and Giants outfielder Hunter Pence. \"I want a teammate that I can give hugs to out there,\" said closer Craig Kimbrel, who currently stands as the only Braves representative on the NL roster. Playing off the fact that Freeman has become known for the frequent hugs he gives teammates before, during and after games, Braves players showed",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}