{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,134 topics 2,125,186 replies",
            "85,560 topics 1,153,915 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,761 replies",
            "5,996 topics 75,815 replies",
            "50,548 topics 466,241 replies",
            "22,767 topics 196,310 replies",
            "4,273 topics 60,473 replies",
            "1,127 topics 8,217 replies",
            "3,605 topics 115,516 replies"
        ],
        [
            "Last Post Info",
            "GTA V Deeper Story Themes/M... By UshaB A minute ago",
            "Reasons why GTA IV is bette... By GamesBoy316 19 minutes ago",
            "Why does this game receive... By Sayuri 22 hours ago",
            "Whats your favourite radio... By Ivan1997GTA 13 hours ago",
            "Favorite Gang By Mr. Fahrenheit 8 hours ago",
            "GTA San Andreas Remastered... By Megazocker 40 minutes ago",
            "In what order did you do th... By hornedturtle 37 minutes ago",
            "Money By GTAGuy1995 9 minutes ago",
            "What do you hate of GTA 2? By Vice City criminal 5 hours ago",
            "Grand Theft Auto: South Yan... By HipsterHillbilly 2 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=222&t=525379&p=1062312586",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988598.68/warc/CC-MAIN-20150728002308-00332-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 115202715,
    "recordOffset": 115182218,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47523=Bing, Osho, Google, PhillBellic, AK47-Mentalman, Phnx., Yahoo, WhitePimp, Bluntnation94, Google Mobile, Procopius, Verstappen, A8ul99, Caleb3030, Malcot, Mr. Fahrenheit, lunchxbles, NikoB08, Days Are Gone, Coleco, jrl51592, PoisonedGas, SuperGTFan, CrysisAverted, Zondar, jdwarfer, Retired Mafia, MovingTarget268, BlackMilk, Terra_S4, AcidRunner, FiS!!HeR, Kaber, NBAKingzFan10, missanthropy, JuanG12, Kippers, santtuu74., UshaB, Ieech, craigdyid, Ezuu, Maddeford, sherip008, DavidTheThird, Mike324467, HipsterHillbilly, Masiku, slayso, Braulioaej, Romanotype, Maxrevv, Vinewood Villain, bigjpc777, oMass3y91, Dex_LV, *-*Mini*-*, FedoraTheExplora, swirler, Braindawg, juarez, Edmachine, stef_92, GTA4LIFE9000, Scuba 21, Sea Bear, EvilFuture, MarQs, Claude Liberty, mirthless, josephene123, Jason Frost, Mockingbae, dimitrirock, Fuzzknuckles, 55d, Ocelot., Bangha, deadx23, XB36Hazard, Black Terminator, ermaccer, Artful., Zealous2K18, JasonStatham, Zyo, TweektheLegend, RICHIEB91, Tony_Florence, SatournFan, amullea, Glenni91, lydianduck, Furry_Monkey, WrongAgainNoobs, Psoloquoise, RM76, Gouge, gta4_player, Official General, D9fred95, saintsrow, Jinx., Sjonnie1989, oleg_aka_djmeg, MGgames100, Terroryaki, Lester-The-Molester, Dewbre97, Galanolefki, xTrendSs, TubewayArmy, sseebbyy, Superfrogger, Shenmue18, matinez, GTAGuy1995, MightyMax, Billiam301, 018361, CaptainMental, BlackZmith10, Total Failure, Private Custard, Owl Man, GRANDHEIST, maxx1013, Turbocharger, doubleg213, XP-_-LOBByHOST3R, svanderman, universetwisters, JRC99, The Hero, Mika_0013, Wscratch, armyraidfail404, Mrnrfan182, Hyde Original, The_Big_Show, ErMerGerd, iProGam3r, AndYuKnowTHIS, Smesi, hornedturtle, FourthLegion, wannaslide, SchroedingerKatz, tpotw, zoso80, Vaymasters, Arachne, SnowBell, ZEST, LH-PLAYS, pizt, SID44SID, Chuck Finley, Craank_AG, LONEW3LF, Victor Strawn, greenrock, Ewok626, Rysir, Sky_Light12, ParsoOnFire, enterthekyuubi-v1, SomeDBKid, GTA SIX, Shaundi., GamesBoy316, Miss Malevolent, TWOGUN, WHAT!?, TheIceWarrior, Giantsgiants, GTA_The_Series, luiz_tido, 14262=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 97511=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 18763=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 16475=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 20902=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12695=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9539=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 6 minutes ago By WhitePimp Looking For A Crew? Free Ag... 613,552 replies 15,210 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By PhillBellic The Wishlist Thread! 2,284,843 replies 113,454 topics This is a general discussion forum for Grand Theft Auto Online. Help &",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,469 topics 416,641 replies dx8vb.dll could not be found By husham2003 28 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}