{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,061 topics 2,123,117 replies",
            "85,546 topics 1,153,485 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,755 replies",
            "5,996 topics 75,807 replies",
            "50,536 topics 466,119 replies",
            "22,767 topics 196,273 replies",
            "4,270 topics 60,412 replies",
            "1,128 topics 8,213 replies",
            "3,595 topics 115,067 replies"
        ],
        [
            "Last Post Info",
            "What did you do after beati... By Geralt of Rivia 3 minutes ago",
            "What happened to Luis Lopez? By Johnny Spaz 18 minutes ago",
            "The Ultimate 100% Save File... By Militia 6 hours ago",
            "The Most Underrated GTA Ever By DragonpokeZ 3 hours ago",
            "Why LCS is better than V By GTAKid667 2 hours ago",
            "The Ultimate 100% Save File... By Militia 7 minutes ago",
            "Something that has always b... By Midnight Hitman 16 minutes ago",
            "Which Vehicle Do You Prefer? By inadequate 23 minutes ago",
            "v 11.44, where is the radio? By Cerium 22 hours ago",
            "Lets play a game of \"Wo... By Phoenix_Poop 24 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=120&t=271800&p=4157811",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00020-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 114774351,
    "recordOffset": 114744130,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16369=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 14111=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 47314=Google, Bing, Yahoo, Alvarez, darthYENIK, Gtaonlinelegitplayer14, Gigs84, Gamerjman19, CyberGhost101, Flamejim, BoDuken, josephene123, Cripto136, ninjaontour, GTAKid667, senator cashed, VikDarkbomb, evGTA, Fozzie_420, Mastah, PNutterSammich, Furry_Monkey, ZeroSafe5615, U.N.K.N.O.W.N, Junko Enoshima, epoxi, gta-massy, ATastyCookie, ChickenAndBeer, Daemian, Cosmic Gypsy, FishyDriftGTA, TWERKSCOPEZ, Lebowski_RS, Knuckle89, markiii10, NYgangster25, fastman92, craigdyid, Andreas, C4R3ON, 7 day survivor, Wscratch, silentkiller44, Th3MaN1, silverharbinger, Claptrap NL, Hyde Original, vlad polkiujhyt, XxFA2EKILLERxX, GTA4LIFE9000, Dabzilla, Romanotype, cheen, terminalnapkin, poppafewpills, Arachne, Ac3snip3r12345, slashjaw26, amar33494, XB36Hazard, Ponymau5, nls_whs_2010, Vrock_wave, Saya_, R.Rezzrax, ZenderAlpha, Scorpiomobile, StepNaza, Stephan90, HaythamKenway, Tilley, Malcot, Lukasdk, thatmobster, BoJack Cognac, MadeBrazen, Irontis, Pegassi Autobot, Memory Lanes, Andreaz1, HipsterHillbilly, iNeckle, Choco Taco, Bane X01, CMCSAVAGE, Twin Turbo, CaptainDowntown, mario_rz, DentureDynamite, zz latios, Huraldo, fullxthrottle94, Sparky McWonderpants, LDHalcrow1215, Psylo0, CjLosSantos, L00NEY, Netman005, Swift1, joe_alker, Geralt of Rivia, Carbonox, Thoomas98, McH2Oz2, marhex, s2n vaniish, bmendonc, kk9fan97, TheHellcat, crashrock2, kKatie, carlittoo, GandalfInSpace, MelloHello, AcidRunner, MF Modding, DeltaEliteKing9, Mastapogi, Reyks, dice, xTOMMYTROJANx, kuusko, Svip, Juicyfer, SAVILLAIN, cjarvis15, Dns2K, TOOMtheRaccoon, ManassaxMauler, OysterBarron, EarlyLifeFailure, The Lone Wanderer, Beto2O, gmwahiid, Red Lynx 23, sewersss, GTAnger, Bluntnation94, jacka, laskaland, Pavle, sebcreed, Imb44tu, NDH92, ljnet, crazyfluke, DMC14, Jambbaah, Whoop woop, Bombshock, Menjac123, Rashkovskys Shiv, Majestic81, NotTodayyJunior, J-B, MrSaucyZ, theminted, rvmod, JaegerPilot1, allinclusive, emelen, SRTTURBO4, Nightmare3883, jukebox, StangOne50, Chuck Finley, Class A, SumSkittles, VoidedAccess, ZAZ, Pyro_Indigo, ArmyDeCalifornia, dyons, Max Payne, Midnight Hitman, GTA_stu, Chazro, longhurstgb, Kirsty, The_Riddler, JTrocks9, TheMcSame, Reid505, REXX93, Ukeman5, CML99, icecoldkilla1467, Oddtester, JimmyFantastic, Mightywow, reditec, Stoney0503, FiS!!HeR, Rml_92, Zolika1351, J*star, ledzep71, sjaak327, ShadowCola, Above Omnipotence, fenzy09, Fishaar, RageFaceMax, bama764, guster-von, Roozii, qwerasdzxc, RussianCommie, Reywas1, Silent, shivix, jollythecat, gtaguy95, Ronzilla187, Captain Sensib1e, Gabriela_L, CBH, ChrissyBoi87, KiTTYReCkless, shmok2, dairyworker, *Lola, Rekia87, southparkmayor, wingbert69, EF2000, JRC99, Between3and20chars, YngDady, SwaGGer_1337, WinkingSkeever6, Brayla316, Rebel, David_CARP96, vortexHD, Faultierspy79, MrDemeulemeester, Josivers, Don Maximus Meridius, m3tal z_DKI, feckyerlife, Malikstuntin, eli.g1026, M4k3, Bms842, doppelblind, Peiva's Laahdin, Braindawg, downtheory, Pentalarc, Ameeno98, SpaceJunk, steve_blue5, M.K.N., Zook, Gantons Most Wanted, hbombz9, RandomStunt, Samuelsamsam, ClippedWings, This Guy Is Here, //XP//, greenrock, Doc302, Econobrick, Zeranus, Phoenix_Poop, Slam_Jones, enix, TJGM, Guns*R-Us, Katabasis, Kurosawa91, calambos, dewtech_2008, Doran22, Mach1bud, LordMarvel, gta_rulez, Robabank, Molster, logicspawn, BeckermannDewitt, AboveAndBeyoncé, Arch0n, Official General, Plage, Wesser, S_Y_N_1_S_T_3_R, hornedturtle, LeFix, Anger Personified, Charmlessrogue, dwestos, misak, AdusPL, Jvaz615, BisonOlf, Slasherr, wapster, Saunders420, FMMZ, SaL_Leone, Day Reaper, RedDagger, TheDeaconBosco, Taylor, Costar, RARusk, GTAOnlineAddict123, Suokukko, Imposssible, Remix1994PL, CaptainMarvel, ballen205, fac316, TwisterVictor1, Zonnex, psymin, Tony_Florence, Verstappen, ghostrider135, Aquilus, FacingGaming, Tycek, Antigenetic, ji.Ruichi, alex3, gtuned, SuperGTFan, 7nvd, Turan, joe grizzly, 20823=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12566=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9316=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 133797=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 18673=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 2 minutes ago By Tacymist Andolini Mafia Family 613,174 replies 15,174 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Claptrap NL [GTAO] The Official B*tch... 2,276,982 replies 113,080 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,435 topics 416,518 replies Big Bear Into GSF! By ZAZ 5 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}