{
    "relation": [
        [
            "Forum",
            "Woodworking Skill Share Your woodworking skills are displayed for several lifetimes in each project. Have you had to compromise your project...",
            "Woodturning On the lathe, by the lathe: do you have questions? frustrations? tips? This forum is for all the woodturners out there.",
            "Woodcarving Relief, 3D, chip-carving, whittling; carving knives, chisels, pocket-knives, power tools. If you are a carver or want...",
            "Scrollsawing Intarsia, fretwork, intricate design cutting and more! This forum is for scrollsawers: share your tips, ask questions...",
            "Joinery Have a question? a tip/strategy to share? a challenge, perhaps? Share your \"joinery\" discussion here.",
            "Finishing The finish, whether paint, wax, stain, or something else, can make or break a project. What are your tips and questio...",
            "Designing Woodworking Projects Looking for information on designing your projects? Having difficulties reading project plans? Looking for help with ...",
            "Power Tools, Hardware and Accessories Are you unsure of which tools, or hardware, you need, or which brands to buy? Investing in tools and hardware can be ...",
            "CNC Woodworking Questions and answers about CNC machines, tooling, best practices, and projects.",
            "Hand Tools Wood, your hand tools, you and a little know-how. Share your questions, tips and strategies for the use and maintenan...",
            "Jigs & Fixtures Using a jig is like having a couple extra hands helping out. Show us your jigs, share your tips, strategies and, of c...",
            "Wood & Lumber Different wood requires different woodworking strategies - from cutting to finishing. Share your tips and challenges ...",
            "Safety in the Woodworking Shop Before you pick up those woodworking tools, take the time to ensure your safety in the shop! Eyes, ears, fingers, and...",
            "Focus on the Workspace Are you looking for or do you have tips to share regarding the workshop? Storage, equipment placement, efficiency, an...",
            "Sweating for Bucks Through Woodworking If you are selling your work, then you have entered a woodworking dimension with added complexity and stress. If you...",
            "Woodworking Trade & Swap All of us are holding onto treasure in our shops, that we either don't need, don't want, or could part with if presen...",
            "LumberJocks.com Site Feedback Connect with the Website Gurus and tell us what you are thinking, suggestions, problems, functionality issues, and so...",
            "Coffee Lounge Need a break from all the standing and wood dust? Chat with your Forum Friends about their projects, their life, thei..."
        ],
        [
            "Topics",
            "10489",
            "1087",
            "224",
            "204",
            "698",
            "3228",
            "5105",
            "21968",
            "71",
            "3860",
            "1000",
            "4655",
            "1120",
            "1563",
            "1037",
            "3792",
            "1951",
            "7768"
        ]
    ],
    "pageTitle": "RAS Book - by Jahness @ LumberJocks.com ~ woodworking community",
    "title": "",
    "url": "http://lumberjocks.com/topics/26568",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00156-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 151313780,
    "recordOffset": 151297386,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{10955=#5 posted 04-27-2011 10:38 PM, 4097=#1 posted 04-25-2011 12:34 AM, 6160=#2 posted 04-25-2011 01:17 AM, 1940=04-24-2011 10:35 PM, 7904=#3 posted 04-26-2011 12:28 PM, 8226=I’ve got my red book too. Bought it in 1978 when I bought the RAS, and still have both of ‘em. Bill, 4419=Yup, looks just like the radial arm saw book I got from Sears when I bought my radial arm saw back in 1972. I still have it in my bookcase and review it every once in a while. By the same token, I just finished refurbishing that radial arm saw with a new table (I replace them every 40 years), removed some surface rust that had accumulated, turned a new handle on the elevation mechanism that I had broken a couple of years ago, and generally brought it back to semi-new condition. It’s still a workhorse and so accurate that I have often told my kids I thought I could shave with it. If yours is like mine, you’ve got a gold mine. I realize Craftsman may not have the best reputation, but 40 years ago they were tops. And they just keep working., 9388=#4 posted 04-27-2011 06:35 AM, 30882=©2015 Verticalscope Inc. All Rights Reserved. | Terms of Service | Privacy Policy, 2213=Just picked up an old RAS from someone that bought it, he thinks around 1972 for a home project. Beautiful condition but I don’t have a camera for picks yet. The 3 drawer cabinet had some accessories and original owners manual as well as this book. Anyone ever seen one of these books before?, 2530=http://s1143.photobucket.com/albums/n636/Jahness59/?action=view&current=RAS.jpg}",
    "textBeforeTable": "Show all forums View all topics Start new topic signed in to reply. You must be Have your say... -- excuse my typing as I have a form of parkinsons disease I bought by fortune from a dear friend of mine who was in the tool business a large dewalt r.a.s three phase 440 volts complete with the large dewalt table completely dismantled and sold to me for a fair but not small price.I am very pleased with it.I guess many people didn’t want a three phase industrial model with key locking electrics but I love it. Always have a set up for three phase which I don’t have directly in and has to be accomplished via rotary convertors and invertors great fun.Alistair #5 posted 04-27-2011 10:38 PM 5774 posts in 2558 days home | projects | blog SCOTSMAN",
    "textAfterTable": "All Posts RSS Projects RSS Blog Entries RSS Reviews RSS Forum Topics RSS Site Blog Entries RSS Go to Pulse page » LumberJocks Pulse   Author Latest activity New comments or replies",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}