{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "ExtremeSkins Exclusive Content ExtremeSkins Chats, ExtremeSkins Game Coverage, ES Chats Archive All of our exclusive chats, inside game or practice coverage and original columns are located here!!!!",
            "ES Original Content Archive A clearing house of ES orginal content; Redskins History 101; Art Mills columns; Mark \"Om\" Steven columns, exclusive interviews and more.",
            "2006 Archives Forum",
            "2005 Archives Forum The complete archive of posts from The Stadium forum for the 2005 season.",
            "2004 Archives Forum The complete archive of posts from The Stadium forum for the 2004 season.",
            "2003 Archives Forum The complete archive of posts from The Stadium forum for the 2003 season.",
            "2002 Archives Forum The complete archive of posts from The Stadium forum for the 2002 season.",
            "2001 Archives Forum The complete archive of posts from The Stadium forum for the 2001 season."
        ],
        [
            "Stats",
            "57 topics 157 replies",
            "5 topics 24 replies",
            "240 topics 17,871 replies",
            "24,621 topics 551,846 replies",
            "25,095 topics 432,201 replies",
            "15,729 topics 182,368 replies",
            "12,098 topics 131,596 replies",
            "4,432 topics 31,259 replies"
        ],
        [
            "Last Post Info",
            "Chalk Talk: Discussion: Pla... By KDawg 06 Aug 2010",
            "ES Content: Washington Reds... By FrFan 30 Sep 2006",
            "Copyright Statement By ExtremeSkins Staff 22 Aug 2013",
            "So Jerry Calls me From The... By Laxpunk2006 30 Jan 2009",
            "Worst Redskin qb in Recent... By bbuzz1962 11 Dec 2005",
            "And so it begins WT on Champ By Lavarleap56 17 Dec 2003",
            "Defense Next Year By Art 30 Dec 2002",
            "Baltimore Ravens By TK 23 Jul 2009"
        ]
    ],
    "pageTitle": "Extremeskins",
    "title": "",
    "url": "http://es.redskins.com/newreply.php?do=newreply&p=6490084",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00207-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 80193075,
    "recordOffset": 80162405,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{20820=Redskins Nation is a half-hour show devoted to giving fans unfiltered access to the day's events at Redskins Park. Hosted by Larry Michael, the show features Redskins players, coaches and sit-down interviews with team officials. (Show re-airs at 11:30 p.m/7:30 a.m. daily)}",
    "TableContextTimeStampAfterTable": "{45557=Happy 4th July, 54744=ExtremeSkins Staff - Today, 09:03 AM, 28250=The complete archive of posts from The Stadium forum for the 2005 season., 31346=The complete archive of posts from The Stadium forum for the 2003 season., 32870=The complete archive of posts from The Stadium forum for the 2002 season., 1210=Enjoy speaking about the Washington Redskins in friendly confines amongst your fellow Skins fans. Hail Skins! See ARCHIVES forums below for threads from 2001-2008, 52525=ExtremeSkins Staff - Today, 12:33 PM, 54014=mcsluggo - Today, 12:17 PM, 53248=@SkinsGoldPants - Today, 12:30 PM, 58015=SkinsGuy, grego, Bing, Forehead, Elessar78, zoony, GoSkins0721, Yahoo, Pwyl, Gibbs Hog Heaven, KLJ, Dan T., PlayAction, Google, g world, Kilmer17, PokerPacker, London Kev, Roger.Staubach, MattFancy, balki1867, RonArtest15, AllenGibbs, JarrettS13, bcl05, Peregrine, Bishop Hammer, SWFLSkins, Lombardi's_kid_brother, Mr. Sinister, ABQCOWBOY, Major Harris, Zguy28, LadySkinsFan, visionary, MEANDWARF, Rudechain, GOSKINS_08, just654, Hail4Life, Gary Clark Fan, RFKFedEx, Busch1724, Mooka, ksun247, skinsfan_1215, Xameil, STBonecrusher21, Corcaigh, clietas, DMVLeGenD, C.Taylor, BMORE SKINZ, skinny21, Califan007, Monk4thaHALL, SonnyandSam, DJD2, kaforema, LLandryistheshiz, Isifhan, Onaindia16, Davidmore27, d0ublestr0ker0ll, Stugein, Dirt, BeefJerky, SKiNz Jus 2 sick, tshile, hooskinz, dcdiscokid, goskins10, piratememorygame, Popeman38, DM72, lee21, sacase, Pedro, youngchew, StuckinIA, httrcirca87, ncr2h, JCB, 29814=The complete archive of posts from The Stadium forum for the 2004 season., 34314=The complete archive of posts from The Stadium forum for the 2001 season.}",
    "textBeforeTable": "Toggle THE REDSKINS TRADITION THE REDSKINS TRADITION 19 Jun 2015 By Larry Some posts linked into wron... 6,257 replies 961 topics Feedback and Tech Support An outlet for members inclined to offer feedback and suggestions regarding the facilities. As well as ask for assistance with any technical issues. Last Post Info Stats Forum   Toggle STADIUM MAINTAINANCE Forums STADIUM MAINTAINANCE Forums 27 Jun 2015 By timitim For the fans video",
    "textAfterTable": "Recent Status Updates · Unlock · Lock    26 Jul skins214428hail You know what really grinds my gears!! The media criticizing the Washington Redskins like we are a bunch of slouches. Show comments (1) Hide Comments 27 Jul   Stugein We kind of deserve it until we prove otherwise. · Unlock ·",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}