{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,169 topics 2,126,936 replies",
            "85,565 topics 1,154,221 replies",
            "1,071 topics 11,084 replies",
            "4,218 topics 64,772 replies",
            "5,997 topics 75,833 replies",
            "50,558 topics 466,352 replies",
            "22,767 topics 196,349 replies",
            "4,275 topics 60,565 replies",
            "1,127 topics 8,223 replies",
            "3,612 topics 115,981 replies"
        ],
        [
            "Last Post Info",
            "Franklin VS. CJ By Nico A minute ago",
            "Reasons why GTA IV is bette... By Phoenix_Poop 15 minutes ago",
            "The Ultimate 100% Save File... By Militia 5 hours ago",
            "Which Vehicle Do You Prefer? By svanderman 5 hours ago",
            "Which vehicle suits Toni? By ClaudX 17 minutes ago",
            "Compare GTA : San Andreas a... By Phoenix_Poop 8 minutes ago",
            "The Ultimate 100% Save File... By Militia 46 minutes ago",
            "Grand Theft Auto III Chain... By GTAGuy1995 An hour ago",
            "What do you hate of GTA 2? By Cerium 21 hours ago",
            "Create your own radio stati... By thedriver111 8 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=239&t=471442&p=1060384222",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00020-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 109094511,
    "recordOffset": 109066424,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9325=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 16423=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 125032=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 47462=Yahoo, Bing, Lebowski_RS, Google, Verlotsky, iamcornholio, Zyo, Cognoscenti, W2B, xXepicjasaXx, Totoyeahwhat123, jhall181, Shadowfennekin, Jebfive, Awesom-0, richard1997jones, Google Mobile, CyclonicForceJC, Majestic81, bamsaidcam, FlacidJack, MagellanFall, GTA_stu, fastman92, NightSpectre, SaL_Leone, TheD., josephene123, Gtaman_92, SILENCOM, theNGclan, lunchxbles, Malikstuntin, LiberatorBeast, WinkingSkeever6, Trentallica, HipsterHillbilly, TBONE1138, Jacob_Rivera_11232, Arazern, Randy93, MightyMax, VikDarkbomb, RedRyder2142, Dr. Sadler, Xxnightowlxx, Gtaultimatefanboy, Retired Mafia, Goetosyrus, lolznc, timason, ThirteenAG, Tomasak, Jon3s, CompactTerror, MotelGuy, GTA_fear, Superfrogger, CMCSAVAGE, //XP//, SSKYZX, HM128, deadx23, Saliva, sivispacem, LazyGator, DaltonWilliams123, Lennie., epoxi, Icantthinkofonew, COYBIG88, REXX93, svanderman, Tekno_Gecko, NicoC, LiangHuBBB, Cjs3315, CaptainDowntown, Russell_Brand, Modojo, NikkoCharger, JCFast, Leonazix, Chekoloco, scottmacdougall, Reywas1, No_Flex_zone, 458Speciale, Marwin, MapRef41N93W, SkynetOnlineID, Insincere, Xing of Virtue, iNero, zoosk8, Mona Sax, feckyerlife, kaizan, AsiaAssault, A3mode, DentureDynamite, spankyspeedster, r.lorenzo13, joe grizzly, Hylskriksen, Pyroshox, GTAnger, jennyjesus, Arms Dealer, m2roadwarrior, bulldog385, o0eVe0o, Heists, Verstappen, OrionSR, Stripes1981, Sticks4926, KornbreadMaf1a, DefiantPasty, zz latios, iLikeDrivinInMyTruck, MitchMaljers, Lay, DerpCat, Procopius, WHAT!?, RafaelSousaSam, AminB, bloodonfire3, Dauw, Ezekeil2Ofive17, temi4328, Doktor Gott, citizenzombie., Ballistic Jello, jollythecat, Ezuu, kcchief1981, stonemaggot666, SidSid, Shooter Hex, SuzukiBlaze, Fallback, gil62291, nexja, JONES6137, m3tal z_DKI, Nicinator16, smokingndriving, alexnicnac, S5L3T0, psymin, JTrocks9, Tony., BoomBapPoet, FlexPiTo, kudisanga, Jack0711, TDWP_Adam, yakoshadow, Linchpin636, blitz, Hades_, Dr. MAR!O, Darrel, Memory Lanes, nerdsnacks12, MRSJEIKS, StepNaza, noizekick, ceaton88, Anotic, AdusPL, boxr, troysayshi, TreFacTor, Extreme_Wrestler, Claptrap NL, CjLosSantos, Terra_S4, Majesticnug420, Captain Sensib1e, DREVIL919, ClaudX, meatrocket8, bruvs-mcfc, Jinx., BiiXteR, CyberGhost101, MaidenOfWar, ShiviSRT-10, Zeuez, xDatxJunkyx, scaldy78, Joekill95, doubleg213, WWEMichaelB, GunsNroses61, SeekingAsylum, ThatGamerChick, shivix, XIantonioIX, JuanG12, Owl Man, Johnny Playert, Trevorfirdaus, Pavle, -Z31N-, arewenotmen, Gridl0k, Nitty Don, toelias, BisP, ikazzah, bronysplatter, laskaland, GodHatesKittens, SatournFan, TWERKSCOPEZ, Rusty Balls, AztecaEh, velkan2010, Bullit1990, TovarishTony, Silent, hitman774, Ivan1997GTA, Larissa, Quejki, the nameless, evGTA, Kaito Katsumi, IxI JoKeR IxI, gta5fan1001, Masiku, GVJLIMA, WhyDoINeedAName, SlaveZer0, Payne Killer, Epic., The Hero, Braindawg, Hjaere, kuusko, Zombie.modder, GTA_Matt24, JF8494, Cheatz_N_Trickz, Videogames888, camo_boy67, Grootstrength, AcidRunner, Marticus, xInfamousRYANx, dice, reform, michael de santa shit, 7nvd, Facebook, GTA4LIFE9000, WhosYu, jerryinohio78, ChefCrimson, SNES, HaythamKenway, longhurstgb, BoDuken, kKatie, Foxy Stevenson, rzn7, LordMarvel, Chuck Finley, TempleOfLight, drewphilly, XCalinX, LilSean, Terroryaki, FANTSTIC, 69_black_69, Freakorama, Furry_Monkey, _Douglas_, BBHD, Smooth Longsack, EF2000, Kahkenbols, GtaFanatik, alexindex57, Bootels, 3d1n0, Dodow, RedDagger, TheSkyrimBacon, statistic, Days Are Gone, ice_phoenix_66, NBAKingzFan10, The Lone Wanderer, Waldie, Spaff, HumanRacehorse, Bms842, Dbollox, scania970, Cars247, LUC!D, Intergalactic Pimp, rafaelfiorindo, 12616=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 14165=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 18577=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 20861=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 2 minutes ago By longhurstgb The Paleto Bay Mayors Offic... 614,481 replies 15,214 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By SILENCOM [XBOX ONE] Car/Motorcycle M... 2,291,422 replies 113,694 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,511 topics 416,514 replies Can i spawn a custom Model?... By MrGTAmodsgerman A minute ago Mod Showroom Scripts & Plugins, Maps, Total Conversions,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}