{
    "relation": [
        [
            "Date",
            "Dec 4, 1998",
            "Sep 16, 2005",
            "Oct 22, 2009",
            "Dec 25, 2013",
            "Jan 15, 2014"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: NCR CORPORATION, OHIO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:BHYRAVABHOTLA, RAGHURAMA;REEL/FRAME:009639/0344 Effective date: 19981124",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: JPMORGAN CHASE BANK, N.A., AS ADMINISTRATIVE AGENT Free format text: SECURITY AGREEMENT;ASSIGNORS:NCR CORPORATION;NCR INTERNATIONAL, INC.;REEL/FRAME:032034/0010 Effective date: 20140106"
        ]
    ],
    "pageTitle": "Patent US6411196 - System and method of controlling an electronic price label - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6411196?dq=5251294",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00307-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478858875,
    "recordOffset": 478846074,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although the present invention has been described with particular reference to certain preferred embodiments thereof, variations and modifications of the present invention can be effected within the spirit and scope of the following claims. During the local mode, the operator stands adjacent EPL 22 so that Hand-held EPL controller terminal 48 is within a line of sight of EPL 22. The operator inputs a function code and initiates emission of the function code by IR emitter 64 using input device 68. Battery 72 provides power to Hand-held EPL controller terminal 48. Display 70 displays function codes as they are recorded. Input device 68 records and initiates transmission of function codes in response to operator inputs. With reference to FIG. 4, input device 68 is preferably a keypad. Control circuitry 66 controls operation of Hand-held EPL controller terminal 48. In particular, control circuitry 66 causes IR emitter 64 to emit function codes to EPL 22. IR emitter 64 emits IR energy in response to control signals from control circuitry 66. Hand-held EPL controller terminal 48 includes IR emitter 64, control circuitry 66, input device 68, display 70, and battery 72. IR sensor 62 senses IR emissions from Hand-held EPL controller terminal 48. With reference to FIG. 3, IR sensor 62 is preferably mounted in front surface 76. RF communication circuitry 59 and transmit and receive antenna 52 allow EPL 22 to communicate with EPL computer 24. Control",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US7026913 * Nov 30, 1999 Apr 11, 2006 Ncr Corporation Methods and apparatus for self-diagnosing electronic price labels US7213751 * Oct 31, 2001 May 8, 2007 Pricer Ab Method and device for transmission of data in an electronic shelf labeling system US7567219 * May 17, 2006 Jul 28, 2009 Dai Nippon Printing Co., Ltd. Merchandise management system and information storage medium US7933804 * Jan 24, 2006 Apr 26, 2011 Ncr Corporation Methods and apparatus for self-diagnosing electronic price labels US20020065726 * Nov 30, 1999 May 30, 2002 Raghurama Bhyravabhotla Methods and apparatus for self-diagnosing electronic price labels * Cited by examiner Classifications",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}