{
    "relation": [
        [
            "Citing Patent",
            "US7610279 *",
            "US7617199 *",
            "US7617200 *",
            "US7627565 *",
            "US7644072 *",
            "US7657518 *",
            "US7792694 *",
            "US8265981 *",
            "US8782046",
            "US8930377",
            "US8930389 *",
            "US8965835",
            "US9092504",
            "US20100004963 *",
            "US20110082873 *",
            "US20140005886 *",
            "CN102033900A *",
            "CN102033900B"
        ],
        [
            "Filing date",
            "Jan 31, 2007",
            "Jan 31, 2007",
            "Jan 31, 2007",
            "Jan 31, 2007",
            "Jan 31, 2007",
            "Jan 31, 2007",
            "Dec 16, 2004",
            "Jul 2, 2008",
            "May 29, 2012",
            "Mar 17, 2011",
            "Oct 6, 2009",
            "Aug 22, 2011",
            "Apr 5, 2013",
            "Jul 2, 2008",
            "Oct 6, 2009",
            "Jun 29, 2012",
            "Sep 29, 2010",
            "Sep 29, 2010"
        ],
        [
            "Publication date",
            "Oct 27, 2009",
            "Nov 10, 2009",
            "Nov 10, 2009",
            "Dec 1, 2009",
            "Jan 5, 2010",
            "Feb 2, 2010",
            "Sep 7, 2010",
            "Sep 11, 2012",
            "Jul 15, 2014",
            "Jan 6, 2015",
            "Jan 6, 2015",
            "Feb 24, 2015",
            "Jul 28, 2015",
            "Jan 7, 2010",
            "Apr 7, 2011",
            "Jan 2, 2014",
            "Apr 27, 2011",
            "Apr 24, 2013"
        ],
        [
            "Applicant",
            "Perfect Market, Inc.",
            "Northwestern University",
            "Northwestern University",
            "Northwestern University",
            "Perfect Market, Inc.",
            "Northwestern University",
            "International Business Machines Corporation",
            "Accenture Global Services Limited",
            "Taykey Ltd.",
            "Taykey Ltd.",
            "International Business Machines Corporation",
            "Taykey Ltd.",
            "Vivek Ventures, LLC",
            "Ficery Kristin L",
            "International Business Machines Corporation",
            "Microsoft Corporation",
            "国际商业机器公司",
            "国际商业机器公司"
        ],
        [
            "Title",
            "Filtering context-sensitive search results",
            "Characterizing context-sensitive search results as non-spam",
            "Displaying context-sensitive ranked search results",
            "Organizing context-sensitive search results",
            "Generating a ranked list of search results via result modeling",
            "Chaining context-sensitive search results",
            "Method, system, and storage medium for assessing and implementing an organizational transformation",
            "Method and system for identifying a business organization that needs transformation",
            "System and methods for predicting future trends of term taxonomies usage",
            "System and methods thereof for mining web based user generated content for creation of term taxonomies",
            "Mutual search and alert between structured and unstructured data stores",
            "Method for analyzing sentiment trends based on term taxonomies of user generated content",
            "Clustered information processing and searching with structured-unstructured database bridge",
            "Method and system for identifying a business organization that needs transformation",
            "Mutual Search and Alert Between Structured and Unstructured Data Stores",
            "Controlling automotive functionality using internal- and external-facing sensors",
            "Mutual search and alert between structured and unstructured data sources",
            "Method and system for mutual search and alert between structured and unstructured data sources"
        ]
    ],
    "pageTitle": "Patent US7426499 - Search ranking system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7426499?dq=7610056",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 45,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00332-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474363011,
    "recordOffset": 474289981,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6115=The computers (110, 120, 130) shown in FIG. 5 illustratively are personal computers or workstations that are widely available. Typical memory configurations for client personal computers (110) used with the present invention should include at least 1028 megabytes of semiconductor random access memory (111) and at least a 200 gigabyte hard drive (112). Typical memory configurations for the application-server personal computer (120) used with the present invention should include at least 5128 megabytes of semiconductor random access memory (121) and at least a 300 gigabyte hard drive (122). Typical memory configurations for the database-server personal computer (130) used with the present invention should include at least 5128 megabytes of semiconductor random access memory (131) and at least a 750 gigabyte hard drive (132).}",
    "TableContextTimeStampAfterTable": "{77298=As discussed previously, analytical applications are generally concerned with only the first three (3) context layers (physical, tactical and instant). One reason for this is that the information to define the last three layers of context (organization, mission and social environment—the strategic context layers) are not readily available and must be developed. The Entity Context System (100) develops context in a manner similar to that described previously in cross referenced application: Ser. No. 10/071,164 filed Feb. 7, 2002; Ser. No. 10/124,240 filed Apr. 18, 2002 and Ser. No. 10/124,327 filed Apr. 18, 2002. In one embodiment, the Entity Context System works in tandem with a Business Process Integration Platform to integrate narrow systems into a complete system for performance management. However, in an alternate mode the system would provide the functionality for process integration in the organization tier of the software architecture. In either mode, the system of the present invention supports the development of the strategic context layers and the storage of all six context layers as required to create a mission-oriented ContextBase (60)., 324097=The software in block 410 completes two primary functions. First it uses the narrow system interface data window (713) to interact with each narrow system (30) as required identify the context quotient for that system. Second, it provides context frame information to each narrow system (30) in a format that can be used by that narrow system (30). The context quotient is a score that is given to each narrow system (30) that identifies the relative ability of the narrow system to flexibly process information from the six different context layers. The scores range from 2 to 200 with 200 being the highest score. The Complete Context™ Systems (601, 602, 603, 604, 605, 606, 607 and 608) all have context quotients of 200. Twenty points are given for each context layer the narrow system is able to process. For example, a supply chain optimization system with the ability to optimize supplier purchase cost (instant impact) given an inventory status (physical) and order status (tactical) would be given sixty points—twenty points for each of the 3 layers it is able to process. If the supply chain optimization system was able to change its optimal solution based on new information regarding the relationship between the supply chain and other elements of performance (organization) like the customer base and channel partners, then another twenty points would be given for its ability to process organization layer information. The process is repeated for each layer. When the narrow system (30) changes its results in response to input from a new layer, then another twenty points are added to the context quotient for that system. Another thirteen points are awarded for the ability to respond to changes in the relative importance of different attributes within a context layer. For example, many systems include one or two factors from the social environment in their analyses, however, as new factors become important, these systems fail to recognize the new factors. The points awarded for each “ability” are not particularly important, what is important is that the context quotient score consistently reflects the ability of each system to reliably process the full spectrum information from each of the six context layers in the current environment and in the future when the relative importance of different attributes when each layer are expected to change. The results of the evaluation of the context quotient for a narrow system (30) seeking data from the system of the present invention are saved in the context quotient table (192) in the ContextBase (60). The results of the context quotient analysis are used to determine which context layers should be included in the context frame sent to each narrow system (30). After defining a context frame for the narrow system in a manner similar to that described previously for complete context frames, a packet containing the required information is transmitted to the narrow system (30) via a network. Alternatively, an operating system layer could be propagated as described in cross-referenced patent application Ser. Nos. 10/071,164 filed Feb. 7, 2002; Ser. No. 10/124,240 filed Apr. 18, 2002 and 10/124,327 filed Apr. 18, 2002. The ability to support ontology translation and integration is not provided in this software block as there are no known narrow systems with the ability to support the development and communication of a complete ontology. The ability to support this function could easily be added. The software in block 410 evaluates context quotients and provides customized context frames to the narrow systems (30) upon request. Processing continues to a software block 411., 30001=This application is a non provisional of U.S. Provisional Patent application No. 60/522,794 filed on Nov. 8, 2004 the disclosure of which is incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations ), the system of the present invention can generate reports that rank the elements, external factors and/or risks in order of their importance to mission performance and/or mission risk by organization level, by mission measure and/or for the organization as a whole. The system can also produce reports that compare results to plan for actions, impacts and mission measure performance if expected performance levels have been specified and saved in appropriate context layer as well as “metrics” reports that trace the historical values for performance drivers over time. The software in block 415 sends the designated reports to the printer (118). After the reports have been sent to the printer (118), processing advances to a software block 417. Alternatively, if no reports were designated for printing, then processing advances directly from block 412 to block 417. The software in block 417 checks the system settings table (140) to determine if the system is operating in a continuous run mode. If the system is operating in a continuous run mode, then processing returns to block 205 and the processing described previously is repeated in accordance with the frequency specified by the user (20) in the system settings table (140). Alternatively, if the system is not running in continuous mode, then the processing advances to a block 418 where the system stops. Thus, the reader will see that the system and method described above transforms data and information",
    "textAfterTable": "US5649181 Apr 3, 1996 Jul 15, 1997 Sybase, Inc. Method and apparatus for indexing database columns with bit vectors US5668591 Mar 29, 1995 Sep 16, 1997 Sony Corporation Information terminal apparatus that is remotely programmed by radio waves and that displays input keys of program functions on a display US5680305 Feb 16, 1995 Oct 21, 1997 Apgar, Iv; Mahlon System and method for evaluating real estate US5704045 Jan 9, 1995 Dec 30, 1997 King; Douglas L. System and method of risk transfer and risk diversification including means to assure with assurance of timely payment and segregation of the interests of capital US5704055 Apr 22, 1996 Dec 30, 1997 International Business Machines Corporation Dynamic Reconfiguration of main storage and expanded storage by means of a service call logical processor US5706495 May 7, 1996 Jan 6, 1998 International Business Machines Corporation Encoded-vector indices for decision support and warehousing US5737581 Aug 30, 1995 Apr 7, 1998 Keane; John A. Quality system implementation simulator",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}