{
    "relation": [
        [
            "Citing Patent",
            "US6486547 *",
            "US6500528 *",
            "US6572781",
            "US6587353 *",
            "US6602431",
            "US6759277 *",
            "US6856007",
            "US6885106",
            "US6939735",
            "US7012323",
            "US7176506",
            "US7232740",
            "US7268426",
            "US7563649 *",
            "US7723831",
            "US7754537",
            "US7807502",
            "US7960272",
            "US7964946",
            "US8021976",
            "US8026588",
            "US8138079",
            "US8168527",
            "US8174105",
            "US8241959",
            "US8334588",
            "US8349654",
            "US8426957",
            "US8431435",
            "US8461672",
            "US8461673",
            "US8466542",
            "US8476774",
            "US8513789",
            "US8513794",
            "US8551815",
            "US8629543",
            "US8680662 *",
            "US8680687",
            "US8704379",
            "US8723332",
            "US8742580",
            "US8883562",
            "US8884403",
            "US8912661",
            "US8999810",
            "US9048234",
            "US20040238857 *",
            "US20040238934 *",
            "US20050017348 *",
            "US20050023682 *",
            "US20050082654 *",
            "US20050087861 *",
            "US20050095835 *",
            "US20090316378 *"
        ],
        [
            "Filing date",
            "Mar 2, 2001",
            "Apr 27, 2000",
            "May 16, 2001",
            "May 25, 2001",
            "Nov 15, 2002",
            "Feb 27, 2003",
            "Aug 1, 2002",
            "Jan 11, 2002",
            "Sep 5, 2002",
            "Jun 2, 2003",
            "Dec 24, 2003",
            "May 16, 2005",
            "Feb 20, 2004",
            "Dec 5, 2006",
            "Jun 25, 2007",
            "Feb 25, 2004",
            "Apr 19, 2010",
            "Jun 11, 2007",
            "Aug 26, 2010",
            "",
            "",
            "Oct 29, 2007",
            "Aug 4, 2009",
            "May 18, 2011",
            "Jul 2, 2010",
            "",
            "May 25, 2011",
            "Apr 14, 2011",
            "Oct 20, 2010",
            "Jul 25, 2008",
            "Feb 9, 2012",
            "Mar 12, 2010",
            "Dec 12, 2011",
            "Feb 9, 2007",
            "Oct 17, 2011",
            "Aug 1, 2008",
            "Oct 27, 2010",
            "Jun 15, 2009",
            "Jun 23, 2010",
            "Aug 27, 2008",
            "May 20, 2008",
            "Feb 25, 2007",
            "Jun 6, 2013",
            "Dec 30, 2010",
            "Nov 4, 2010",
            "Aug 19, 2013",
            "Jun 11, 2013",
            "Dec 24, 2003",
            "Feb 20, 2004",
            "Feb 25, 2004",
            "Jul 31, 2003",
            "Sep 24, 2004",
            "Sep 24, 2004",
            "Sep 24, 2004",
            ""
        ],
        [
            "Publication date",
            "Nov 26, 2002",
            "Dec 31, 2002",
            "Jun 3, 2003",
            "Jul 1, 2003",
            "Aug 5, 2003",
            "Jul 6, 2004",
            "Feb 15, 2005",
            "Apr 26, 2005",
            "Sep 6, 2005",
            "Mar 14, 2006",
            "Feb 13, 2007",
            "Jun 19, 2007",
            "Sep 11, 2007",
            "Jul 21, 2009",
            "May 25, 2010",
            "Jul 13, 2010",
            "Oct 5, 2010",
            "Jun 14, 2011",
            "Jun 21, 2011",
            "Sep 20, 2011",
            "Sep 27, 2011",
            "Mar 20, 2012",
            "May 1, 2012",
            "May 8, 2012",
            "Aug 14, 2012",
            "Dec 18, 2012",
            "Jan 8, 2013",
            "Apr 23, 2013",
            "Apr 30, 2013",
            "Jun 11, 2013",
            "Jun 11, 2013",
            "Jun 18, 2013",
            "Jul 2, 2013",
            "Aug 20, 2013",
            "Aug 20, 2013",
            "Oct 8, 2013",
            "Jan 14, 2014",
            "Mar 25, 2014",
            "Mar 25, 2014",
            "Apr 22, 2014",
            "May 13, 2014",
            "Jun 3, 2014",
            "Nov 11, 2014",
            "Nov 11, 2014",
            "Dec 16, 2014",
            "Apr 7, 2015",
            "Jun 2, 2015",
            "Dec 2, 2004",
            "Dec 2, 2004",
            "Jan 27, 2005",
            "Feb 3, 2005",
            "Apr 21, 2005",
            "Apr 28, 2005",
            "May 5, 2005",
            "Dec 24, 2009"
        ],
        [
            "Applicant",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Sharp Kabushiki Kaisha",
            "Tessera, Inc.",
            "Sharp Laboratories Of America, Inc.",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Tessera Inc.",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "The United States Of America As Represented By The National Security Agency",
            "Tessera, Inc.",
            "Chris Karabatsos",
            "Micron Technology, Inc.",
            "Tessera, Inc.",
            "Micron Technology, Inc.",
            "Megica Corporation",
            "Micron Technology, Inc.",
            "Megica Corporation",
            "Megica Corporation",
            "Megica Corporation",
            "Megica Corporation",
            "Micron Technology, Inc.",
            "Tessera, Inc.",
            "Megica Corporation",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Invensas Corporation",
            "Tessera, Inc.",
            "Invensas Corporation",
            "Invensas Corporation",
            "Invensas Corporation",
            "Megit Acquisition Corp.",
            "Tessera, Inc.",
            "Iinvensas Corporation",
            "Invensas Corporation",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Morio Nakao",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Tessera, Inc.",
            "Tessera Research Llc"
        ],
        [
            "Title",
            "Microelectronic assembly incorporating lead regions defined by gaps in a polymeric sheet",
            "Enhancements in sheet processing and lead formation",
            "Microelectronic packaging methods and components",
            "Semiconductor device",
            "Enhancements in sheet processing and lead formation",
            "Crystalline silicon die array and method for assembling crystalline silicon sheets onto substrates",
            "High-frequency chip packages",
            "Stacked microelectronic assemblies and methods of making same",
            "Microelectronic assembly formation with releasable leads",
            "Microelectronic assemblies incorporating inductors",
            "High frequency chip packages with connecting elements",
            "Method for bumping a thin wafer",
            "High-frequency chip packages",
            "Chip packaging with metal frame pin grid array",
            "Semiconductor package having die with recess and discrete component embedded within the recess",
            "Manufacture of mountable capped chips",
            "Method for fabricating semiconductor packages with discrete components",
            "Method for fabricating thermal compliant semiconductor chip wiring structure for chip scale packaging",
            "Semiconductor package having discrete components and system containing the package",
            "Method of wire bonding over active area of a semiconductor circuit",
            "Method of wire bonding over active area of a semiconductor circuit",
            "Method of wire bonding over active area of a semiconductor circuit",
            "Semiconductor chip and method for fabricating the same",
            "Stacked semiconductor package having discrete components",
            "Microelectronic packages fabricated at the wafer level and methods therefor",
            "Circuit component with conductive layer structure",
            "Method of fabricating stacked packages with bridging traces",
            "Edge connect wafer level stacking",
            "Edge connect wafer level stacking",
            "Reconstituted wafer stack packaging with after-applied pad extensions",
            "Edge connect wafer level stacking",
            "Stacked microelectronic assemblies having vias extending through bond pads",
            "Off-chip VIAS in stacked chips",
            "Edge connect wafer level stacking with leads extending along edges",
            "Stacked assembly including plurality of stacked microelectronic elements",
            "Stack packages using reconstituted wafers",
            "Electrically interconnected stacked die assemblies",
            "Wafer level edge stacking",
            "Electrical interconnect for die stacked in zig-zag configuration",
            "Semiconductor die mount by conformal die coating",
            "Electrically interconnected stacked die assemblies",
            "Method of wire bonding over active area of a semiconductor circuit",
            "Reconstituted wafer stack packaging with after-applied pad extensions",
            "Semiconductor die array structure",
            "Stacked die assembly having reduced stress electrical interconnects",
            "Method of making a stacked microelectronic package",
            "Off-chip vias in stacked chips",
            "High frequency chip packages with connecting elements",
            "High-frequency chip packages",
            "Manufacture of mountable capped chips",
            "High reliability chip scale package",
            "Structure and self-locating method of making capped chips",
            "Back-face and edge interconnects for lidded package",
            "Structure and method of making capped chips having vertical interconnects",
            "Wafer level edge stacking"
        ]
    ],
    "pageTitle": "Patent US6228686 - Method of fabricating a microelectronic assembly using sheets with gaps to ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6228686?dq=%22ellis+chapman%22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475154431,
    "recordOffset": 475124815,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{81124=As seen in FIG. 11, some or all of the lead regions may include two signal conductors 332 and 333 extending along the top and bottom surfaces of the sheet in lead regions 324. Here again, the top surface signal conductor 332 is provided with a conductive element such as a via liner 335 extending through the polymer layer of the lead region at the tip end of the lead. Conductors 332 and 333 may be connected to terminals 343 and 345 on the main portion 326 of the sheet. These terminals may be disposed in pairs adjacent to one another and adjacent to the associated lead portion 324. These signal conductors provide a set of paired conductors extending along the lead which can provide a controlled impedance signal path. The use of leads incorporating multiple conductors is described in greater detail in co-pending, commonly assigned U.S. patent application Ser. No. 08/715,571, filed Sep. 19, 1996 and Ser. No. 09/020,754 filed Feb. 9, 1998, the disclosures of which are hereby incorporated by reference herein. As shown in certain embodiments disclosed in those applications, a circuit within a microelectronic element could be arranged to transmit signals as oppositely-directed pulses on two contacts. For example, circuit 303 is arranged to transmit signals as oppositely directed voltage pulses on contacts 344 and 345. These oppositely directed pulses will be conveyed through leads 332 and 333. As described in greater detail in the co-pending applications, the use of multiple conductors on a single lead can provide a balanced transmission line extending all the way from the contacts of the chip itself to the external circuit and minimizes a problem such as cross talk and interference. As for the described in the copending applications, arrangements including more than two conductors on a lead may be employed as, for example, in a lead with incorporates 3 conductors such as a reference conductor and two opposite signal conductors conveying oppositely directed voltage pulses. As also described in the copending applications, multiple-conductor signal paths and striplines may extend along the dielectric layer. For example, the main region of the dielectric layer may be provided with one or more layers of signal conductors, which may interconnect the signal conductors of the leads with one another. These interconnections can provide signal paths between multiple components attached to the dielectric element. As discussed in co-pending, commonly assigned U.S. patent application Ser. No. 09/053,816 filed Apr. 2, 1998, the disclosure of which is hereby incorporated by reference herein, such interconnections may be used to provide signal paths within a single semiconductor chip. All of these arrangements may be implemented within the present invention., 27351=The present application is a continuation-in-part of U.S. patent application Ser. No. 08/715,571, filed Sep. 18, 1996, which in turn claims benefit of U.S. Provisional Application Ser. No. 60/003,927 filed Sep. 18, 1995., 84040=As shown in FIG. 12, the reinforcing element 516 may remain in place on the polymeric layer at the end of the assembly process provided that the reinforcing element has apertures, such as apertures 517 aligned with the terminals 543. In other respects, the process may be the same as that described above. Where reinforcing element 516 is formed from a conductive material such as a metal, the reinforcing element may be connected to a few of the terminals so as to provide ground or power connections. In this case, the reinforcing elements serves as a potential reference plane. As seen in FIG. 13, the step of removing the reinforcing element may be performed by a process such as a selective etching process which leaves portions of the reinforcing element as terminals 643 connected to some or all of the conductive elements 632 of the lead portions as, for example, by via liner 633 extending through the main portion of polymeric layer 610. In other respects, the process is the same as that discussed above. Formation of terminals from a reinforcing element is described in co-pending, commonly assigned U.S. patent application Ser. No. 08/989,312 filed Dec. 12, 1997, the disclosure of which is also incorporated by reference herein., 27591=The present application further claims benefit of U.S. Provisional Patent Applications Ser. Nos. 60/057,741, filed Aug. 28, 1997 and 60/056,965 filed Aug. 26, 1997.}",
    "textBeforeTable": "Patent Citations As these and other variations and combinations of the features discussed above, can be utilized without departing from the present invention as defined by the claims, the foregoing description of the preferred embodiments should be taken by way of illustration rather than by limitation of the invention as defined by the claims. In embodiments discussed above, the electronically conductive bonding material is carried on the tip ends of the leads. However, this is not essential; a bonding material may be carried on the contacts of the microelectronic element. Alternatively, the conductors of the leads may be bonded to the contacts of the microelectronic element by a process such of thermocompression bonding or other bonding methods with do not require a separate bonding material. The conductors of the lead regions are electrically connected to the conductive elements of the reinforcing element. For example, the sheet may be fabricated separately from the reinforcing element and the terminals 843 of the sheet may be bonded to contacts 821 on the reinforcing element by any conventional bonding material and process. At this stage, the lead regions of the sheet extend along the lower surface of the reinforcing element. The tip ends of the lead regions are then bonded to the contacts 844 of the microelectronic element 840 in the manner discussed above, and the microelectronic element may be moved downwardly to bend the lead regions as described above. The reinforcing",
    "textAfterTable": "US8513794 Oct 17, 2011 Aug 20, 2013 Tessera, Inc. Stacked assembly including plurality of stacked microelectronic elements US8551815 Aug 1, 2008 Oct 8, 2013 Tessera, Inc. Stack packages using reconstituted wafers US8629543 Oct 27, 2010 Jan 14, 2014 Invensas Corporation Electrically interconnected stacked die assemblies US8680662 * Jun 15, 2009 Mar 25, 2014 Tessera, Inc. Wafer level edge stacking US8680687 Jun 23, 2010 Mar 25, 2014 Invensas Corporation Electrical interconnect for die stacked in zig-zag configuration US8704379 Aug 27, 2008 Apr 22, 2014 Invensas Corporation Semiconductor die mount by conformal die coating US8723332 May 20, 2008 May 13, 2014 Invensas Corporation Electrically interconnected stacked die assemblies US8742580 Feb 25, 2007 Jun 3, 2014 Megit Acquisition Corp. Method of wire bonding over active area of a semiconductor circuit US8883562 Jun 6, 2013 Nov 11, 2014",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}