{
    "relation": [
        [
            "Cited Patent",
            "US4812684 *",
            "US4860288 *",
            "US5003256 *",
            "US5122679 *",
            "US5140184 *"
        ],
        [
            "Filing date",
            "Jan 22, 1988",
            "Oct 23, 1987",
            "Sep 7, 1989",
            "Oct 13, 1989",
            "Nov 20, 1990"
        ],
        [
            "Publication date",
            "Mar 14, 1989",
            "Aug 22, 1989",
            "Mar 26, 1991",
            "Jun 16, 1992",
            "Aug 18, 1992"
        ],
        [
            "Applicant",
            "Hitachi, Ltd.",
            "Control Data Corporation",
            "Amdahl Corporation",
            "Hitachi, Ltd.",
            "Hitachi, Ltd."
        ],
        [
            "Title",
            "Multiphase clock distribution for VLSI chip",
            "Clock monitor for use with VLSI chips",
            "Clock skew measurement technique",
            "Integrated logic circuit with clock skew adjusters",
            "Clock feeding circuit and clock wiring system"
        ]
    ],
    "pageTitle": "Patent US5264746 - Logic circuit board with a clock observation circuit - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5264746?dq=6,621,746",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00305-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 469961837,
    "recordOffset": 469945443,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While the invention has been described in its preferred embodiments, it is to be understood that various modifications may be made therein. For example, five logic circuit IC chips are mounted in the above embodiments, but any number of such IC chips can be used. It is intended to cover in the appended claims all such modifications as fall within the true spirit and scope of the invention. In the second embodiment, the clock phase of the external terminal 39 is not set at the true central value for the observation terminals 34A to 34E, and the clock skew is a little larger than for the first embodiment. However, since the clock signals at the logic circuit IC chips 32A to 32E are output as they are to the external terminal 39, the clock signal can be adjusted taking change in clock skew due to temperature fluctuation into account. In the first embodiment, on the other hand, temperature fluctuation will cause a larger error since the clock skew differently changes for the logic circuit IC chips 12A to 12E and the propagation time adjustment means 18. After the clock phase at the external terminal 39 is determined, as in the first embodiment, the rise point (γ) of the clock signal at the external terminal 39 (closest to the central value (β)) has to be made identical to the rise point (α) of the clock signal at",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5430397 * Jan 26, 1994 Jul 4, 1995 Hitachi, Ltd. Intra-LSI clock distribution circuit US5578955 * Apr 26, 1994 Nov 26, 1996 Mitsubishi Denki Kabushiki Kaisha Signal supply circuit US5640112 * Dec 2, 1994 Jun 17, 1997 Rikagaku Kenkyusho Clock signal distributing system US5870621 * Dec 22, 1994 Feb 9, 1999 Texas Instruments Incorporated Quadrilateral multichip computer systems and printed circuit boards therefor US6025740 * Sep 3, 1993 Feb 15, 2000 Oki Electric Industry Co., Ltd. Clock feeding circuit and method for adjusting clock skew US6091165 * Dec 18, 1998 Jul 18, 2000 Intel Corporation Method and apparatus to reduce peak electro-magnetic emissions from ground and power",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}