{
    "relation": [
        [
            "Citing Patent",
            "US5278618 *",
            "US5312779 *",
            "US5552924 *",
            "US5567068 *",
            "US5567334 *",
            "US5579149 *",
            "US5579151 *",
            "US5610438 *",
            "US5612753 *",
            "US5640214 *",
            "US5696619 *",
            "US5706061 *",
            "US5754217 *",
            "US6002452 *",
            "US6044705 *",
            "US6467345",
            "US6799871",
            "US7791008 *",
            "US7971371 *",
            "US8767270",
            "US8791972",
            "US8872875",
            "US9030515",
            "EP0687962A2",
            "EP0692728A2",
            "EP0704737A2",
            "EP0712022A2",
            "EP0748128A1 *",
            "EP2561992A2 *",
            "WO2002008830A1 *"
        ],
        [
            "Filing date",
            "Mar 13, 1992",
            "May 26, 1992",
            "Nov 14, 1994",
            "Jun 27, 1995",
            "Feb 27, 1995",
            "Sep 12, 1994",
            "Feb 17, 1995",
            "Mar 8, 1995",
            "Jan 27, 1995",
            "Sep 30, 1994",
            "Feb 27, 1995",
            "Mar 31, 1995",
            "Apr 19, 1995",
            "Jun 6, 1996",
            "May 12, 1997",
            "Mar 3, 2000",
            "Jul 13, 2001",
            "Jul 31, 2008",
            "Oct 29, 2007",
            "Aug 24, 2011",
            "Feb 13, 2012",
            "Aug 24, 2011",
            "Aug 24, 2011",
            "Jun 19, 1995",
            "Jul 13, 1995",
            "Sep 21, 1995",
            "Nov 14, 1995",
            "Jun 7, 1996",
            "Aug 20, 2012",
            "Jul 13, 2001"
        ],
        [
            "Publication date",
            "Jan 11, 1994",
            "May 17, 1994",
            "Sep 3, 1996",
            "Oct 22, 1996",
            "Oct 22, 1996",
            "Nov 26, 1996",
            "Nov 26, 1996",
            "Mar 11, 1997",
            "Mar 18, 1997",
            "Jun 17, 1997",
            "Dec 9, 1997",
            "Jan 6, 1998",
            "May 19, 1998",
            "Dec 14, 1999",
            "Apr 4, 2000",
            "Oct 22, 2002",
            "Oct 5, 2004",
            "Sep 7, 2010",
            "Jul 5, 2011",
            "Jul 1, 2014",
            "Jul 29, 2014",
            "Oct 28, 2014",
            "May 12, 2015",
            "Dec 20, 1995",
            "Jan 17, 1996",
            "Apr 3, 1996",
            "May 15, 1996",
            "Dec 11, 1996",
            "Feb 27, 2013",
            "Jan 31, 2002"
        ],
        [
            "Applicant",
            "Hitachi Koki Co., Ltd.",
            "Texas Instruments Incorporated",
            "Texas Instruments Incorporated",
            "Matsushita Electric Industrial Co., Ltd.",
            "Texas Instruments Incorporated",
            "Csem Centre Suisse D'electronique Et De Microtechnique Sa",
            "Texas Instruments Incorporated",
            "Texas Instruments Incorporated",
            "Texas Instruments Incorporated",
            "Texas Instruments Incorporated",
            "Texas Instruments Incorporated",
            "Texas Instruments Incorporated",
            "Texas Instruments Incorporated",
            "Texas Instruments Incorporated",
            "Xros, Inc.",
            "Xros, Inc.",
            "Lg Electronics Inc.",
            "John Taylor Hargrove",
            "Mabe Canada Inc.",
            "Palo Alto Research Center Incorporated",
            "Xerox Corporation",
            "Palo Alto Research Center Incorporated",
            "Palo Alto Research Center Incorporated",
            "Texas Instruments Incorporated",
            "Texas Instruments Incorporated",
            "Texas Instruments Incorporated",
            "Texas Instruments Incorporated",
            "Texas Instruments Incorporated",
            "Palo Alto Research Center Incorporated",
            "Lg Electronics Inc"
        ],
        [
            "Title",
            "Thermal fixing device including a non-adhesive resin coated metal belt and PTC thermistor heater",
            "Color spatial light modulator and method of manufacture",
            "Micromechanical device having an improved beam",
            "Multifunction printer",
            "Method for creating a digital micromirror device using an aluminum hard mask",
            "Miniature network of light obturators",
            "Spatial light modulator",
            "Micro-mechanical device with non-evaporable getter",
            "Full-color projection display system using two light modulators",
            "Printer and display systems with bidirectional light collection structures",
            "Micromechanical device having an improved beam",
            "Spatial light image display system with synchronized and modulated light source",
            "Printing system and method using a staggered array spatial light modulator having masked mirror elements",
            "Sequential color display system with spoke synchronous frame rate conversion",
            "Micromachined members coupled for relative rotation by torsion bars",
            "Method of operating micromachined members coupled for relative rotation",
            "Lamp mounting structure",
            "Single spot focus control",
            "Apparatus and method for controlling a clothes dryer",
            "Single-pass imaging apparatus with image data scrolling for improved resolution contrast and exposure extent",
            "Reflex-type digital offset printing system with serially arranged single-pass, single-color imaging systems",
            "Single-pass imaging system with anamorphic optical system",
            "Single-pass imaging method using spatial light modulator and anamorphic projection optics",
            "Intelligent printing system",
            "Improvements in and relating to spatial light modulators",
            "Optical system for printers and display systems",
            "Improvements in or relating to micromechanical devices",
            "Imaging systems",
            "Single-Pass Imaging System Using Spatial Light Modulator and Anamorphic Projection Optics",
            "Lamp mounting structure"
        ]
    ],
    "pageTitle": "Patent US5101236 - Light energy control system and method of operation - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5101236?dq=6,249,7726,249,772",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00162-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478454107,
    "recordOffset": 478412751,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{43942=For a more complete understanding of spatial light modulators, reference is made to U.S. Pat. No. 4,596,992, issued June 24 1986; U.S Pat. No. 4,662,746, issued May 5, 1987; and U.S. Pat. No. 4,728,185, issued Mar. 1, 1988, all of which are hereby incorporated by reference herein. Aforementioned U.S. Pat. No. 4,596,992 also discusses the use of a deformable mirror device (DMD) in a printer., 83759=Digressing momentarily, one method of operating the automatic ticket machine would be for a customer to insert a preprinted ticket in slot 1102 (FIG. 11). The ticket would then pass, as above discussed, through optic reader 1470 or magnetic reader 1480, and the information predeposited on the ticket would then be electronically read. Based upon this reading, or upon information provided by the user via a keypad or other device to a central computer, the user could make changes necessary in flight plans or in other travel arrangements or the user could just confirm a particular flight. The system, under control of the central computer (not shown), can return the ticket to the user in a situation where no change is to be made to the ticket. Alternatively, the ticket can be directed to shuttle 1201 (FIG. 11), through partition 1160, and then through printer 1602 whereupon additional information can (if so desired) be printed onto the ticket. The ticket then would pass to sorter 1501 and be sorted in a manner to be discussed and either returned to the user via bin 1103 or discarded to an internal waste bin. This latter operation, where the ticket is put into an internal waste bin, would take place in a situation where perhaps a new ticket is being printed for a customer, or alternatively, where a customer has asked for a refund and the ticket has been confiscated by the automatic ticket machine., 77624=The sides of printing system 1101 have been shown fitted with doors 1151 and 1154 (shown in FIG. 13), each of which can be opened for maintenance and for adding stock or other supplies to the printing system. A preferred embodiment of the printer system housing is shown in FIG. 20 when the paper handling, control and printing mechanism is mounted in a manner to allow servicing from the front by a pull out mechanism. In both the door version and the door-less pull-out version, the inside of the printing system has been divided into two zones by a spine or vertical partition 1160 (FIG. 11). This partition performs several functions. One of these functions is maintaining the dust created by the bursting of the tugger stock away from the printing mechanism. This is so because the printing mechanism as seen in FIG. 13, is supported by vertical partition 1160 on the far (right) side as viewed from open door 1151. On the near (left) side, the tugger stock is directed from any one of the three bins, 1104, 1105, 1106, or from slot 1102 through magnetic and/or optic readers 1380, 1370, and via shuttle 1201 from the near side of partition 1160 to the far side. The ticket stock then moves from the back 1153 of the printing system along vertical partition 1160 toward the front 1150, passing below xerographic printing unit 1602 (FIG. 13) and through sorter 1501, to be deposited either in external bin 1103 or in internal bins 1561 or 1562. The spine design provides a precision reference plane for the assembly and alignment of the two parallel paper paths (magnetics side and printer side) and guaranties accuracy when passing a ticket from one path to the other via the shuttle mechanism (FIG. 12)., 119924=As shown in FIG. 28, a developer unit 1601 is designed to drop in from the top via molded in guide rails 2803 and handle 2804 when ATB is pulled from the enclosure (FIG. 20). Because it is the most frequently replaced consumables unit, top access is desirable for operator convenience and for ease of insertion. From the top side, visual alignment is more readily accomplished, and lighting is usually better. Magnetic brush 2802 holds a developer material which is in turn coated with the electrostatically charged toner particles. Doctor blade 2805 regulates the magnetic brush. Power to rotate the magnetic brush and other internal rollers 2806 of developer unit 1601 is provided in synchronization with the OPC via gears in the power train 2616 on XPM side-plate 2612. Large capacity toner reservoir 2801 (seen cut-away in FIG. 16) is a feature that allows a 50,000 coupon lifetime. Because of the narrow field-of-print, distribution of toner is less of a problem than in the wider A-size developer units. Wiper bars 2807 are provided internally to toner reservoir 2801 to allow effective distribution and full utilization of the toner supply., 95350=The automatic alignment process is then initiated and proceeds under control of computer 2203 according to the algorithm shown in FIG. 25., 65925=The dead-band concept, therefore, provides a considerable latitude in the system assembly and optical tolerances, while yielding high performance contrast ratios at the photoreceptor image, in excess of 100:1., 89813=FIG. 18 shows in stylized format the mating of the exposure unit 10 with a base 1800. The base 1800 represents the reproduction unit shown in stylized format since any one of a number of reproduction unit configurations can be utilized. Receptor position within base 1800 (not shown) would mate with the funnel 120 from the base of unit 10 to provide a light seal for modulated light prior to impact on the printing mechanism located in base 1800. As shown, ports 1801 and 1802 mate with protrusions 101 and 102 respectively, of exposure unit 10 while support 1803 is adapted to mate with tab 103 to provide a three point mating arrangement thereby maintaining perfect alignment between the two portions. Clips (not shown) can be positioned with respect to either unit 1800 or unit 10 to snap onto the other unit to maintain the units in position relative to each other., 118949=Turning now to FIG. 27, opening 2601 is designed to accept OPC cartridge 1602 which mates to XPM via molded-in rails 2701 and other features that mate to guide 2606, and drive cog 2607, and positioning pins 2611 on XPM side-plate 2613. Latch 2610 prevents removal of OPC cartridge 1602 prior to removal of developer unit 1601. Likewise, OPC 1602 is restrained by tray 2614 until it is dropped. Hence the fragile OPC drum surface 80 is protected from abrasion by developer unit 1601 magnetic brush 2802 and other elements parallel to and close-by the OPC surface. Latch 2610 cannot be operated until developer unit 1601 is removed from XPM 2600. Flip down tab 2705 provides a grip for OPC removal., 92179=Exposure module 10, FIG. 1, is preassembled, except for DMD 60. The module is placed in a fixture such as is shown in FIG. 18 that locates housing 10 from three points, 1801, 1802 and 1803. The two alignment reference pins 1301 and 1302 are approximately coincident with the DMD y-axis. Note that housing 1800 shown in FIG. 18 is shown as representative and can house either the photoreceptor elements (such as element 80, FIG. 8A) or a camera (such as a CCD camera, FIG. 22) as will be discussed. The photoreceptor would be mounted at a distance d (FIG. 8A), below exposure module mirror 31 to produce a locus of line image 82 of width w extending between points a and b on drum surface 81, as previously discussed., 80539=The actual movement of tugger stock 1010, 1010B, 1010C, from bins 1104, 1105 and 1106 is shown in FIG. 14 where each of the bins can provide printable stock material to burster 1730 via control wheels 1471, 1456 and 1451, respectively. These wheels are designed to move forward or backward and to move the stock as directed by the control mechanism of the system past burster 1720 and, as controlled by wheels 1455 and 1454, past optical reader 1470. The relative positions between wheel 1455 and burster 1730 is such that the stock can be positioned under reader 1470 while burster 1730 separates the stock into individual tickets. If the next ticket is not to come from the same tugger material, then wheel 1471 (or wheels 1456, 1451) could reverse and move the stock out of position so that stock from another bin, for example, tugger stock 1010B under control of wheel 1456, can move up into position under optical reader 1470., 81490=The position of optical reader 1470 is such that information (such as bar code) prepositioned at the front leading edge of the ticket stock can be read by optical reader 1470 even before burster 1730 bursts the stock. This can be used for control purposes. The separated stock then moves through magnetic reader 1480 under control of wheels 1481 and 1482 into shuttle 1201 under control of wheels 1484 and 1483. Stock from outside slot 1102 enters the system under control of wheel 1452. This stock can be brought in and merged into the line of tickets moving toward shuttle 1201 simply by having the control system backup and reverse whatever tugger material is currently being controlled by wheel 1454. Thus, a customer may insert a ticket into slot 1102, the ticket can be moved to optic reader 1470 or to magnetic reader 1480. The ticket is then read and can then either be returned to slot 1102 by the reversing of control wheel 1454 or the ticket can be passed to shuttle 1201 and shuttled to the other side of the partition for printing or to be discarded in the manner to be more fully discussed hereinafter., 68695=FIG. 10A shows blank coupon stock 1010 containing some preprinted information thereon. FIG. 10B shows stock coupon 1011 after it has passed under xerographic drum 80 and after information has been printed thereon by the series of dots which had been transferred to drum surface 81 by modulated light 402, as previously discussed., 94126=FIG. 21 illustrates one embodiment of an insertion device which, as will be seen, is driven by a computer to sequentially position a DMD, held by jaws 2111, around the six axes. Apparatus 2100 is designed so that the center of the rotational movement of a held DMD for the three major axes is around the exact crossing point of the three axes. This feature allows for sequential axis positioning., 92915=As will be discussed, one or more CCD cameras, such as camera 2200 (FIG. 22), can be positioned in place of the photoreceptor in order to assist in the alignment of DMD 60 within the exposure unit. The CCD camera advantageously can be positioned at the same distance from mirror 31 of the exposure module or at a different distance if so desired. The important factor is that the alignment of the optics for the DMD is with respect to the permanent three-point mounting pins and thus once aligned the exposure unit can be transferred from receptor to receptor without further alignment of the optics., 96797=Next, the \"roll\" is corrected, box 2503, by rotating the DMD about optical axis z. Roll angle misalignment would appear as a \"skew\" angle in the DMD image at the camera, FIG. 23. In the printed output this corresponds to the actual use image not being orthogonal to the edge of the print media. The system refocuses the center image, which now consists of all activated pixels. Focus is accomplished by calculations performed on the size of the image of a pixel as captured by video frame-grabber 2202 system. The video data is stored in up to 256 levels of intensity. A size and centroid calculation is performed according to the criteria of FIG. 24 which shows a one dimensional slice of a pixel image. The frame grabber, in reality, contains a two dimensional representation of the amplitude (corresponding to the x and y orientations of the DMD chip). It is a straightforward matter to compare and calculate the centroid (effectively the center-of-mass of the light distribution) and compare it to a desired \"location\" in the field-of-view as represented by the frame-grabber memory map. Similarly, by choosing a threshold amplitude variable, and calculating how many pixels of the CCD (charge coupled device) video imager are above that threshold, the size, or focus, of a spot can be calculated. The z-axis servo is actuated to achieve the desired spotsize. Alternatively the peak amplitude, amplitude between adjacent pixels and other criteria, can be used to determine a focused condition., 117679=Coupon path 1201 to 1501 passes below developer unit 1601, below but in contact with OPC drum 80 in cartridge 1602, and between fuser heater roller 1650 and fuser pressure roller 1651. Fuser pressure roller 1651 is clamped via dropdown mechanism 2634, and is clamped by a spring loaded pin-fixture (not shown) residing in lower tray 2614 which drops down when clips 2603 are released, thereby exposing the entire paper path to the operator when ATB chassis is pulled out for service (FIG. 20)., 79353=FIG. 12 shows shuttle 1201 which operates to move the individual ticket stock 1010 from the near side of partition 1160 to the far side of the partition. Thus, as shown in FIG. 12, ticket stock 1010 enters shuttle 1201, moving directly toward the reader, and is shuttled from left to right, as shown by arrow 1220, by wheels 1203, 1204. Wheel 1203 can be advantageously arranged with a flat surface which rests upwards. After ticket stock 1010 arrives in place, wheel 1203 driven by a stepper motor begins to turn. The wheel grips the ticket stock, moving it from left to right. The ticket stock passes under wheel 1222 which also can be arranged with a flat surface at the bottom. When wheel 1222 begins to turn, ticket stock 1010 moves away from the reader along the far side of partition 1160. Thus, the only opening in partition 1160 is a small window large enough for the shuttle to pass the individual ticket stock 1010. This window can be designed, if desired, to prevent dust from moving from one side to another. This, of course, can be accomplished with a physical barrier or by air moving from the printer side to the ticket stock side through the window., 76430=One embodiment of a printing system using the xerographics process is shown in FIG. 11, which is designed, among other things, to handle automatic ticket printing. Bins 1104, 1105 and 1106 hold the accordion folded (tugger) ticket stock as will be seen. These bins can be closed as shown or can be designed to be open for easy access with only the corners provided to support and hold the stock in place. The front of machine 1150 has a revalidation slot 1102 for the insertion of a customer ticket which previously had been printed, and a bin 1103 to hold tickets which have passed through machine 1150 and which have been printed or otherwise handled by printing system 1101. Other equipment can be mounted on the front of the machine, and this equipment typically would be operative to receive credit card information or dialing information. This would allow a customer to call a ticket agency to obtain ticket information and to process travel tickets. The printing system could handle telephone communications and would have various lights and switches appropriate to these functions. For clarity these switches, keypads and other control equipment have not been shown., 98604=The final series box 2506 and box 2507 iterates the adjustment of \"yaw-angle\", or rotation of DMD about x-axis, with end-to-end focus adjust. The yaw angle also centers the filament image on the imager assuring maximum optical throughput and contrast ratio. However, because the x-axis of rotation is at the chip centerline, the ends rapidly defocus due to inherent z axis component of motion. Hence the iterative adjustment of yaw and focus box 2509. This adjustment also controls the uniformity, box 2520, or balance, of pixel image intensity across the array. When all criteria are satisfied, alignment is complete. If, after a succession of attempts box 2508 the criteria are not met, the program aborts, and an operator intervenes to assess the failure mechanism., 118808=Tray 2614 must be lowered to remove fuser unit 1603. Heat shield 2630 further isolates user from hot roller 1650 contact., 48106=Returning now to FIG. 1, illumination source 16 advantageously can be a tungsten halogen bulb, such as the General Electric single-ended quartzline� photo lamp series. The source is selected to provide the required lifetime (typically 2000 on-hours), and a power level suitable to the print process exposure requirements. The light from bulb 16 is focused by a heat resistant spherical lens 17 onto lens 18 which serves to direct the light onto DMD 60. Lens 18 is mounted on a molded-in precision pivot point positioned in the lower flat surface at the longitudinal center line. The ends 180 of lens 18 are held in slots in inner wall 105 and in the outer wall of exposure module 10. These slots allow lens 18 to expand along its longitudinal axis. However, since lens 18 is mounted on a center pin (not shown), the focal distance does not change, and, therefore, the light remains uniformly directed onto DMD 60. Lenses 17 and 18 together comprise a condenser assembly. The function of this lens group is to provide uniform illumination at DMD 60, and also to provide a focused and magnified image of source filament 16 which is formed in the front plane of imager lens 40., 116773=The XPM provides power and synchronization of the rotating process module (Fuser, OPC, developer and coupon transport rollers) via a precision motor 2608 and a toothed-belt and gear transmission 2616 (not shown) on the side 2612 internal to the ATB central mounting wall. The inside wall of the XPM also contains high-voltage power supplies for the charging corona 2702 (FIG. 27), and transfer corona (not shown) which resides in the lower tray 2614 directly below OPC drum 80, and below the coupon path (1201 to 1501). The precision reference notches 2604 position the DMD exposure module 10 via molded-on features 102 and tab 103 which rests on cross-rail 2605. Power to OPC cartridge 1602 is provided through XPM side-plate 2612 via mating wheel 2607. Fuser shield 2615 provides isolation of fuser 1603 heat lamp 2638, not shown, but residing inside fuser heat roller 1650 (FIG. 16)., 99990=Once the DMD is aligned finally, an adhesive, or other bonding arrangement, is used to firmly position DMD 60 with respect to brackets 104 (FIG. 1). At that time, jaws 2111 open and device 2100 withdraws from exposure module 10., 88622=FIG. 17 shows in schematic form the cutting mechanism for burster 1720. Stepper motor 1702 turns at a revolution of 200 steps per revolution turning cam arm 1703. Cam arm 1703 in turn is connected to cutter 1701 which moves up and down within the confines of burster 1720. Blade 1701 is shown in the up position in FIG. 17 and ticket stock 1010 (moving toward the viewer) is positioned such that the perforations between the coupons lie below the plane of blade 1701. The base of burster 1720 (not shown) is arranged with an indentation therein such that blade 1701, as it moves downward under control of cam arm 1703, will burst through the perforations thereby separating the coupons. Springs 1705 serve to push downward on coupon grippers 1704. Thus, when blade 1701 moves downward, grippers 1704 hold the coupon stock 1010 in position to prevent movement and to help align the perforations of coupon stock 1010 with blade 1701. Note that blade 1701 begins to perforate coupon stock 1010 from the left thereby reducing the force required as the blade falls., 118192=Continuing in FIG. 16, roller 1651 and roller 1653 separate from rollers 1650 and 1652 respectively when tray 2614 drops to clear the paper path. As shown in FIG. 26, tray 2614 is hinged to XPM 2600 along side-plate 2612. Opening 2602 accepts fuser unit 1603 and positions it with respect to XPM paper path via guide rails 2637 and with positioning pins 2609 mating to holes 2632 in fuser 1603. Positive engagement is provided by latch-spring 2631. Removal/insertion is aided by thermally insulating handle 2633. Latch 2636 releases metal bracket 2635 containing fuser cleaner roller (now shown)., 94542=The alignment process begins with the preliminary insertion of DMD 60 into Jaws 2111 of device 2100 and lowering into approximate final position with respect to support 104, shown in FIG. 1. Electrical contact is made with DMD 60 via cable 2220 from DMD pattern generator 2204, FIG. 22. Light source 16 (FIG. 1) is also activated., 85917=Returning now to a description of the operation of sorter 1501 as shown in FIG. 15. Tickets from printer drum 80 enter sorter 1501 at position 1508. Depending upon the status of diverter 1502, the tickets move via roller 1551 to slot 1506 and via rollers 1551 to bin 1562. Bin 1562 is an internal bin arranged for securely storing tickets as they are printed. The bin can be designed to be any size and can hold a full night's printing of tickets and boarding passes for pickup by an operator in the morning. The bin can be locked separately from the rest of the system so that only authorized personnel can remove the ticket., 87506=Thus, under control of either an internal or an external computer signal, transportation tickets, or any of a number of other items, can be either printed from stock material located internally or from material provided by a user via an external slot. Boarding passes can be printed simply by changing the printing on the ticket stock or by using different bins for different boarding passes. These can be color coded or preprinted in any type of arrangement, and the automatic ticket machine can be programmed, to select from any one of the three or more bins without operator loading or unloading the material. These tickets can be interleaved with tickets or boarding passes provided by a user via slot 1102 as has been discussed., 86563=Tickets which enter from printer drum 80 with diverter 1502 in the position shown can, instead of passing to bin 1563, pass to bin 1561 of diverter 1503 which is moved to the downward position (shown in phantom). This movement is controlled either locally or externally, and can be computer or manually activated. When moved to the phantom position, tickets pass under control of wheel 1551 into space 1560, and by movement of spring loaded latch 1504, pass into the reject or waste bin 1561 for pickup by authorized personnel., 98344=The system then adjusts box 2505, the \"pitch angle\", phi, until pixel amplitudes are maximized. This motion centers the image of the source filament on the imager lens aperture, a condition for maximum power transfer to the image., 112362=The penalty usually associated with user replaceable consumables is a high cost per-page of print. This is acceptable in the general desk-top printer environment for the convenience, the resulting high print-quality, and the cost is offset by fewer service call requirements. Downtime is also typically reduced from hours to minutes. All of these features are highly desired by the ATB market place, but higher consumables costs are not desirable, due to competitive pressures from thermal, ion-deposition, and impact matrix printing technologies. To reduce consumable module costs, new design standards had to be met. In particular, the toner-developer unit, representing over 50% of consumable costs, must have sufficient toner capacity to print approximately 50,000 coupons at a 41/2% coverage factor. At that point, the cost of the components in the developer unit amortize out to acceptable levels. By contrast, the typical replaceable cartridge, that contains toner, in a desktop laser printer, is specified for about 2500 prints, a factor of 20� less (7� less allowing for area factors of the coupon to the A-size page)., 83442=The printed ticket stock then moves out of fuser 1603 and passes to sorter 1501 to be sorted in the manner to be discussed so that the ticket can either be deposited in outside bin 1103 or in one of several interior bins to be discarded, or to be stored for pickup by an operator at a future date., 94892=A preliminary center set of pixels is activated and the deflected light from these follows optic path 402 (FIG. 7A) to camera 2200 positioned as shown in FIG. 22. A preliminary image appears on viewing monitors 2210 and 2207, and a rough alignment (Box 2501 and 2502, FIG. 25), is performed by the operator using \"joystick\" 2205 override system. This alignment is sufficient to center the activated pixels on the viewing screen., 90703=For example, clips (not shown) could be permanently associated with the top surface 12 of unit 10. These clips can extend down below base 13 on either side of unit 10 and thus, when units 10 and 1800 are in mating relationship, the clips (not shown) would lock on the tabs (not shown) reference new drawing in preparation of the XRM unit for disclosure 10 on base 1800 to maintain the two units in secure relationship. Of course, the tabs could be replaced by traditional fastening devices, such as screws or bolts, for a more permanent connection. The clips, however, are useful in situations where the exposure unit is to be removed periodically from the base 1800 without the use of extra tools and by someone not particularly skilled., 119665=OPC cartridge 1602 is further comprised of removable charging corona 2702, cleaner blade 2707 and cleaner auger (not shown), waste toner exit port 2706, ozone filter 2703, drum 80, exposure access slot 2704, and mating slide surfaces 2701., 33256=Since the modulated light must hit the drum in a straight line and since all other light must be shielded from the drum, a system must be established which allows for the controlled disbursement of unwanted light rays while handling the proper modulated light signals. The system is further complicated by the fact that the modulation signals are changing extremely quickly, on the order of approximately 2000 per second, and thus light paths must be closely controlled and extremely repeatable. Because of the close tolerances, light divergences, which come about because of the transmission lengths, must also be controlled. All of these problems must be solved in an economical manner and without complicated alignment and light baffling trial and error techniques., 87110=Alternatively, tickets from printer drum 80 can be sent to external bin 1103 by moving diverter 1502 downward into the phantom position shown. Tickets then will move under control of wheel 1507 up and around and under what 1552 into bin 1103 and positioned under control of spring member 1504, which member could be arranged to sense when the bin is full for control purposes., 82626=Turning now to FIG. 16, when a ticket passes through the opening in the partition 1160, the direction of the ticket, which on the first side of the partition was from the front of the printer toward the back along the partition, is now reversed, and the ticket moves along the far side of the partition toward the front of the printer. As it moves toward the front (right to left in FIG. 16), the ticket moves under printing module 1602 and comes in contact with drum 80 as above discussed. The ticket can be printed or left blank, depending upon the control of the system. As the ticket stock moves out from under drum 80, it passes through fuser 1603 where roller 1651 and 1650 serve in a well known manner to fuse the toner onto the stock so that the printed material cannot be easily removed., 96249=The alignment begins as discussed above, by activating selected pixels in the center of the array, and adjusting the x and y travel to position this image on the optical axis of the imager lens, boxes 2501 and 2502 of FIG. 25. If this cannot be accomplished, the procedure is aborted. The positioning of the image at a specified location in the field of view of one camera accomplishes this. The camera stage is translated laterally along the DMD image until one camera lies directly in the center of the desired image position.}",
    "textBeforeTable": "Patent Citations As shown in FIG. 28, a developer unit 1601 is designed to drop in from the top via molded in guide rails 2803 and handle 2804 when ATB is pulled from the enclosure (FIG. 20). Because it is the most frequently replaced consumables unit, top access is desirable for operator convenience and for ease of insertion. From the top side, visual alignment is more readily accomplished, and lighting is usually better. Magnetic brush 2802 holds a developer material which is in turn coated with the electrostatically charged toner particles. Doctor blade 2805 regulates the magnetic brush. Power to rotate the magnetic brush and other internal rollers 2806 of developer unit 1601 is provided in synchronization with the OPC via gears in the power train 2616 on XPM side-plate 2612. Large capacity toner reservoir 2801 (seen cut-away in FIG. 16) is a feature that allows a 50,000 coupon lifetime. Because of the narrow field-of-print, distribution of toner is less of a problem than in the wider A-size developer units. Wiper bars 2807 are provided internally to toner reservoir 2801 to allow effective distribution and full utilization of the toner supply. OPC cartridge 1602 is further comprised of removable charging corona 2702, cleaner blade 2707 and cleaner auger (not shown), waste toner exit port 2706, ozone filter 2703, drum 80, exposure access slot 2704, and mating slide surfaces 2701. Turning now to FIG. 27, opening 2601 is designed",
    "textAfterTable": "US8767270 Aug 24, 2011 Jul 1, 2014 Palo Alto Research Center Incorporated Single-pass imaging apparatus with image data scrolling for improved resolution contrast and exposure extent US8791972 Feb 13, 2012 Jul 29, 2014 Xerox Corporation Reflex-type digital offset printing system with serially arranged single-pass, single-color imaging systems US8872875 Aug 24, 2011 Oct 28, 2014 Palo Alto Research Center Incorporated Single-pass imaging system with anamorphic optical system US9030515 Aug 24, 2011 May 12, 2015 Palo Alto Research Center Incorporated Single-pass imaging method using spatial light modulator and anamorphic projection optics EP0687962A2 Jun 19, 1995 Dec 20, 1995 Texas Instruments Incorporated Intelligent printing system EP0692728A2 Jul 13, 1995 Jan 17, 1996 Texas Instruments Incorporated Improvements in and relating to spatial light modulators EP0704737A2 Sep 21, 1995 Apr 3, 1996 Texas Instruments Incorporated Optical system for printers and display systems EP0712022A2 Nov 14, 1995 May 15, 1996 Texas Instruments Incorporated",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}