{
    "relation": [
        [
            "Type",
            "2160p (4k)",
            "1440p (2k)",
            "1080p",
            "720p",
            "480p",
            "360p"
        ],
        [
            "Video Bitrate, Standard Frame Rate (24, 25, 30)",
            "35-45 Mbps",
            "16 Mbps",
            "8 Mbps",
            "5 Mbps",
            "2.5 Mbps",
            "1 Mbps"
        ],
        [
            "Video Bitrate, High Frame Rate (48, 50, 60)",
            "53-68 Mbps",
            "24 Mbps",
            "12 Mbps",
            "7.5 Mbps",
            "4 Mbps",
            "1.5 Mbps"
        ]
    ],
    "pageTitle": "Recommended upload encoding settings (Advanced) - YouTube Help",
    "title": "",
    "url": "https://support.google.com/youtube/answer/1722171?hl=en&rd=1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00105-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890424201,
    "recordOffset": 890408253,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{2887=If letterboxing is added to a video before it is uploaded (i.e. in the case of creating a 4:3 video from a 16:9 master), the widescreen player will add pillarbox bars too, resulting in black bars all around the video (windowboxing) and a bad viewing experience (see the diagram below)., 1452=YouTube uses 16:9 aspect ratio players. If you are uploading a non-16:9 file, it will be processed and displayed correctly as well, with pillar boxes (black bars on the left and right) or letter boxes (black bars at the top and bottom) provided by the player. If you want to fit the player perfectly, encode at these resolutions:, 2229=For example, the player will automatically add pillarboxing to 4:3 videos in the new 16:9 widescreen player size. If the player is re-sized (i.e. when embedded on another website), the same process takes place so that 16:9 videos are letterboxed when the player is sized to 4:3. Similarly, anamorphic videos will be automatically letterboxed when shown in either 16:9 or 4:3 sized players. The player can only do this if the native aspect ratio of the video is maintained.}",
    "textBeforeTable": "Recommended video bitrates for uploads Note that the bitrates below are recommendations for uploads. Audio playback bitrate is not related to video resolution. Bitrate Interlaced content should be deinterlaced before uploading. For example, 1080i60 content should be deinterlaced to 1080p30, going from 60 interlaced fields per second to 30 progressive frames per second. Common frame rates include: 24, 25, 30, 48, 50, 60 frames per second (other frame rates are also acceptable). Content should be encoded and uploaded in the same frame rate it was recorded. Frame rate Chroma subsampling: 4:2:0 Variable bitrate. No bitrate limit required, though we offer recommended bit rates below for reference CABAC Closed GOP. GOP of half the frame rate. 2 consecutive B frames High Profile Progressive scan (no interlacing) Video codec: H.264 Sample rate 96khz or 48khz Channels: Stereo or Stereo + 5.1 Audio codec: AAC-LC moov atom at the front of the file (Fast Start) No Edit Lists (or the video might not get processed correctly) Container: MP4 Recommended bitrates, codecs, and resolutions, and more Recommended upload encoding settings (Advanced) }]);})();",
    "textAfterTable": "Recommended audio bitrates for uploads Type Audio Bitrate Mono 128 kbps Stereo 384 kbps 5.1 512 kbps Resolution and aspect ratio YouTube uses 16:9 aspect ratio players. If you are uploading a non-16:9 file, it will be processed and displayed correctly as well, with pillar boxes (black bars on the left and right) or letter boxes (black bars at the top and bottom) provided by the player. If you want to fit the player perfectly, encode at these resolutions: 2160p: 3840x2160 1440p: 2560x1440 1080p: 1920x1080 720p: 1280x720 480p: 854x480 360p: 640x360 240p: 426x240 The YouTube player automatically adds black bars so that videos are displayed correctly without cropping or stretching, no matter the size of the video or the player. For example, the player will automatically add pillarboxing to 4:3 videos in the new 16:9 widescreen player size. If the player is re-sized (i.e. when embedded on another website), the same process takes place so that 16:9 videos are letterboxed when the player is sized to 4:3. Similarly, anamorphic videos will be automatically letterboxed when shown in either 16:9 or 4:3 sized players. The player can only do this if the native aspect ratio of the video is maintained. You can adjust the fit of your video in our player after uploading your video by using formatting tags. If letterboxing is added to a video before it is uploaded (i.e. in the",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}