{
    "relation": [
        [
            "Date",
            "Jan 21, 1999",
            "Mar 28, 2001",
            "Sep 24, 2001",
            "Jun 17, 2002",
            "Jul 2, 2002",
            "Jun 8, 2006",
            "Dec 1, 2006",
            "Dec 11, 2006",
            "Jun 11, 2010"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "REMI",
            "FPAY",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: USA DIGITAL RADIO, INC., MARYLAND Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:USA DIGITAL RADIO PARTNERS, L.P.;REEL/FRAME:009711/0458 Effective date: 19981217",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "Owner name: IBIQUITY DIGITAL CORPORATION,MARYLAND Free format text: TERMINATION OF PATENT SECURITY INTEREST;ASSIGNOR:COLUMBIA PARTNERS, L.L.C. INVESTMENT MANAGEMENT, AS INVESTMENT MANAGER AND AGENT FOR LENDER;REEL/FRAME:018573/0111 Effective date: 20061130",
            "",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US5850415 - In-band on-channel digital broadcasting - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5850415?dq=7222078",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00010-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472130171,
    "recordOffset": 472076150,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{101224=The ACT tapped delay line may implement a programmable transversal filter (PTF) through the addition of on-chip tap-weighting and memory circuits and may be used as a notch filter by appropriate control of the taps. A notch filter based upon ACT tapped delay line is shown in FIG. 48. The weighting of the taps is accomplished through the use of programmable attenuators that set the magnitude of the coefficient. The accumulation function required by the transversal filter is performed by two summing busses; these busses are connected to the inverting and the noninverting inputs of an off-chip differential amplifier in order to permit bipolar tap weighting. The tap weights are stored in on-chip static random-access memory (SRAM). In order to change the response of the filter, the user simply supplies a data word containing the desired coefficient, the address of the tap to be loaded, and an enable signal at the time the change is desired. For further information on an ACT-based PTF, see The ACT Programmable Transversal Filter, Microwave Journal, May 1991., 32135=This is a Division of application Ser. No. 08/003,189 filed Jan. 12, 1993 now U.S. Pat. No. 5,465,396., 108906=Buffer circuits 1926, which correspond to buffer circuits 1924, are connected to outputs of the weighting circuits of the adjustable taps 1902, 1908, and 1910, 1916. Summers 1928, 1930, and 1932 are then connected to the outputs from the static and dynamic taps of the reference, delay, and quadrature tap groups, respectively., 107585=FIG. 48 illustrates a notch filter utilized in the IBOC FM-DAB receiver as the tracking notch 150 of FIG. 11. Notch filter N has an ACT transport channel 1900, with SAW generation, input and output pursuant to U.S. Pat. No. 4,633,285. Three groups of non-destructive sense (NDS) electrodes or taps are spaced along the surface of channel 1900 for sensing the charge packets moving through the channel with the SAW., 113295=Circuits used to tap off a tapped delay line are shown in FIG. 33a and FIG. 33b. These circuits have been combined to implement the variable delay elements shown in FIG. 32 and used for setting the tap weights in FIG. 48. The buffer 560 corresponds to buffer circuits 1924 and 1926 and is used to tap off a delayed signal from an analog tapped delay line without loading down the delay line. The analog weighting circuit 562 is used to implement a variable tap weight A of taps 1902, 1908, and 1910, 1916 of FIG. 48. The analog weighting circuit 562 requires two complementary control voltages, A 564 and A' 566, to implement an attenuation proportional to A through a FET voltage divider. The weighting circuit 562 is typically followed by a buffer similar to the buffer 560, so that the tap weighting is insensitive to output loading. When this circuit is applied to the types of tap groups shown in FIGS. 32 and 30, tap group relative delay ΔT is very linear with control voltage A., 108411=Buffer circuits 1924, more particularly explained later, are connected to the output of the taps of the reference, delay, and quadrature groups. Taps 1904, 1906 of the reference group are static, as are taps 1912, 1914 of the delay group. Taps 1902 and 1904 are dynamic and adjustable as a result of tap weight control voltages A and A', respectively. Similarly, taps 1910 and 1916 are dynamic and adjustable as a result of tap weight control voltages A' and A, respectively., 108019=NDS taps 1902, 1904, 1906, and 1908 are positioned at the input end of channel 1900 and are the reference taps. NDS taps 1910, 1912, 1914, and 1916 are at the output end of channel 1900 and are the delay taps. NDS taps 1918, 1920, and 1922 are disposed between the reference and delay tap groups and are used to provide a quadrature waveform for use by the phase detector., 103947=The charge packets are confined within a transport channel formed in an epitaxial surface layer having a thickness that is an appreciable fraction of the SAW wavelength at the clock frequency. This architecture isolates the charge packets from interfacial traps at the substrate surface and epitaxial layer interface. Thus, ACT devices operate in a deep \"buried-channel\" mode, and exhibit extremely high transport efficiencies at clock frequencies that are easily achieved in the UHF region (300 to 1000 MHz). The excellent transport efficiency at UHF clock rates forms the basis for a variety of high speed, high performance analog signal processors using ACT technology.}",
    "textBeforeTable": "Patent Citations While this invention has been described as having a preferred design, it is understood that it is capable of further modifications, uses and/or adoptions of the invention following in general the principle of the invention and including such departures from the present disclosure as come within the known or customary practice in the art to which the invention pertains and as may be applied to the central features hereinbefore set forth, and fall within the scope of the invention and of the limits of the appended claims. A third embodiment, based also on polynomial channel estimation, may be used for systems where DAB processing takes place at an intermediate frequency (IF). This system is illustrated in FIG. 49. Two separate polynomials are used to continuously estimate and cancel the in phase and quadrature components of the FM to AM interference. A second embodiment based on polynomial channel estimation is shown in FIG. 46. In this case, the FM signal frequency estimate drives a polynomial generator which estimates the FM to AM conversion interference 954 in the channel. This estimate is subtracted at 938 from the raw DAB composite 936. The coefficients 970 of the polynomial are derived by measuring and integrating the cross-correlation between the resulting DAB composite 960 and each term of the polynomial. In this manner, the coefficients of the FM to AM cancellation polynomial are always adjusted so as to drive the FM",
    "textAfterTable": "US5073898 * Jan 30, 1990 Dec 17, 1991 Clarion Co., Ltd. Communication device US5121211 * May 10, 1991 Jun 9, 1992 North American Philips Corporation System for echo cancellation comprising an improved ghost cancellation reference signal US5121407 * Sep 27, 1990 Jun 9, 1992 Pittway Corporation Spread spectrum communications system US5133081 * Nov 3, 1989 Jul 21, 1992 Mayo Scott T Remotely controllable message broadcast system including central programming station, remote message transmitters and repeaters US5150377 * Nov 2, 1990 Sep 22, 1992 At&T Bell Laboratories Direct sequence spread spectrum (dsss) communications system with frequency modulation utilized to achieve spectral spreading US5218717 * Dec 31, 1990 Jun 8, 1993 Rohde & Schwarz Gmbh & Co. Kg Simulcast transmission system with improved synchronizing system US5278826 * Apr 11, 1991 Jan 11, 1994 Usa Digital",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}