{
    "relation": [
        [
            "Citing Patent",
            "US7088766 *",
            "US7260160 *",
            "US7352795 *",
            "US7352817 *",
            "US7436894 *",
            "US7570719 *",
            "US7664207 *",
            "US7783963 *",
            "US7813447",
            "US7882421 *",
            "US7937643 *",
            "US8074156 *",
            "US8352842 *",
            "US20040063399 *",
            "US20040248549 *",
            "US20040252789 *",
            "US20090319838 *",
            "WO2006118684A1 *"
        ],
        [
            "Filing date",
            "Dec 14, 2001",
            "Aug 21, 2003",
            "May 4, 2005",
            "Sep 26, 2003",
            "Oct 28, 2003",
            "Oct 15, 2002",
            "Aug 10, 2007",
            "May 19, 2005",
            "Nov 15, 2006",
            "May 2, 2005",
            "Jul 19, 2007",
            "Feb 13, 2008",
            "Jun 16, 2009",
            "Sep 26, 2003",
            "Jun 4, 2003",
            "Oct 15, 2002",
            "",
            "Mar 20, 2006"
        ],
        [
            "Publication date",
            "Aug 8, 2006",
            "Aug 21, 2007",
            "Apr 1, 2008",
            "Apr 1, 2008",
            "Oct 14, 2008",
            "Aug 4, 2009",
            "Feb 16, 2010",
            "Aug 24, 2010",
            "Oct 12, 2010",
            "Feb 1, 2011",
            "May 3, 2011",
            "Dec 6, 2011",
            "Jan 8, 2013",
            "Apr 1, 2004",
            "Dec 9, 2004",
            "Dec 16, 2004",
            "Dec 24, 2009",
            "Nov 9, 2006"
        ],
        [
            "Applicant",
            "International Business Machines Corporation",
            "Trimble Navigation, Ltd.",
            "Harris Corporation",
            "Ibiquity Digital Corporation",
            "Harris Corporation",
            "Nokia Siemens Networks Oy",
            "Trimble Navigation, Ltd.",
            "Telefonaktiebolaget L M Ericsson (Publ)",
            "International Business Machines Corporation",
            "Seyfullah Halit Oguz",
            "Mediatek Inc.",
            "Sony Corporation",
            "Acterna Llc",
            "Marek Milbar",
            "Drews Paul C.",
            "Sathiaseelan Sundaralingam",
            "Acterna Llc",
            "Harris Corp"
        ],
        [
            "Title",
            "Dynamic measurement of communication channel characteristics using direct sequence spread spectrum (DSSS) systems, methods and program products",
            "Method and apparatus for decoding GPS satellite data at low signal to noise levels",
            "System and method for communicating data using constant amplitude waveform with hybrid orthogonal and MSK or GMSK modulation",
            "Method and apparatus for interleaving signal bits in a digital audio broadcasting system",
            "Method and apparatus for efficient bandwidth communication",
            "Receiver and a receiving method",
            "Decoding GPS satellite data at low signal to noise levels by computing total probability of current data bit at current time epoch",
            "Decoding a concatenated convolutional-encoded and block encoded signal",
            "Apparatus, system, and method for dynamic phase equalization in a communication channel",
            "Method and apparatus for joint source-channel map decoding",
            "Mobile communication device and data reception method",
            "Decoding method and decoding apparatus",
            "Determining contribution of burst noise to data errors",
            "Method and apparatus for interleaving signal bits in a digital audio broadcasting system",
            "Entropy collection",
            "Receiver and a receiving method",
            "Determining contribution of burst noise to data errors",
            "System and method for communicating data using constant amplitude waveform with hybrid orthogonal and msk or gmsk modulation"
        ]
    ],
    "pageTitle": "Patent US6944206 - Rate one coding and decoding methods and systems - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6944206?dq=5,598,374",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00301-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477447803,
    "recordOffset": 477405013,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{108264=The described decoding process is repeated for the state having the opposite sign of the leftmost hypothesized bit, i.e., 1000, and with the same new bit hypothesis of 0. A second candidate metric is, thus, obtained, which is compared with the first candidate metric. The lower of the two is selected to be the new path metric for a new 0000 state. The path history of the selected predecessor state is also selected to be the path history of the new 0000 state, and a 0 or 1 shifted left into the path history accordingly as old state 0000 or 1000 based on which was the selected one. The above procedure may be repeated for a new ‘1’ to give a new state 0001 and then the whole procedure may be repeated for all pairs of states, such as 0001 and 1001, 0010 and 1010, etc, with, in turn, a hypothesis of a new ‘0’ and then a new ‘1’ in order successively to generate a whole set of 16 new states., 55812=Methods of recording digital data on magnetic tape or disc providing for error correction are also known. Magnetic media manufacture is generally imperfect and the medium is typically characterized by missing patches of magnetic material that cause short gaps in the recording. If these gaps are comparable to or larger than the span of a data bit on the medium, then one or more errors will typically result. It is known to pass the data to be recorded through an all-pass filter having deliberately large group delay distortion, with the result that each bit would be spread in time and additively overlapping with other time-spread bits. The waveform at each recording instant, therefore, should represent part of many bits instead of all of one bit, so that, if that sample was lost, a small part of many bits would be lost and not all of one bit, possibly avoiding an error. The playback amplifier may then contain an all-pass filter or equalizer having the inverse characteristic to that used on recording, thus collecting up the dispersed fractions of each data bit. Such a system is described in “On the Potential Advantage of Smearing/De-smearing Filter Technique in Overcoming Impulse-Noise Problems in Data Systems” by Wainright, Trans IRE on Communications Systems, December 1961. U.S. Pat. No. 5,101,432 to Webb. discusses varying the smearing and desmearing filter characteristics according to a crypto code in order to achieve secrecy.}",
    "textBeforeTable": "Patent Citations In the drawings and specification, there have been disclosed typical preferred embodiments of the invention and, although specific terms are employed, they are used in a generic and descriptive sense only and not for purposes of limitation, the scope of the invention being set forth in the following claims. While described above, without regard to source-controlled decoding, it shall be realized that rate one coding is most useful when a a-priori information source probabilities are also incorporated into the decoding metrics. This can be done, for example, by simply adding to each metric a constant which is precomputed for each decoder state and stored in a look-up table. The constant may represent the log-probability of that decoder state appearing in that particular position of the source coder output bitstream. These probabilities can be determined in advance for particular types of source codes, such as voice encoders or image encoders, and stored as log-likelihood values. As described above, a form of channel coding is provided according to this invention that does not increase the number of transmitted bits, can be useful, herein called “rate one” coding. Such approaches may be particularly useful with source controlled decoding. In various implementations of “rate one” coding, each sequence of bits is uniquely mapped to a different sequence of bits of the same length by a rate one encoder. thus, the set of possible outputs from the decoder",
    "textAfterTable": "3 Joachim Hagenauer, Rate-Compatible Punctured Convolutional Codes (RCPC Code) and their Applications, IEEE Transactions on Communications, vol. 36, No. 4, Apr., 1998. 4 Martin E. Hellman, \"Convolutional Source Encoding\", IEEE Transactions in Information Theory, Nov. 1975, pps 651-656. 5 Pierce and Karlin, Reading Rates and the Information Rate of a Human Channel, BSTJ 1956. 6 Wainright, On the Potential Advantage of Smearing/De-smearing Filter Technique in Overcoming Impulse-Noise Problems in Data Systems, Trans IRE on Communications Systems, Dec. 1961. Referenced by Citing Patent Filing date Publication date Applicant Title US7088766 * Dec 14, 2001 Aug 8, 2006 International Business Machines Corporation Dynamic measurement of communication channel characteristics using direct sequence spread spectrum (DSSS) systems, methods and program products US7260160 * Aug 21, 2003 Aug 21, 2007 Trimble Navigation, Ltd. Method and apparatus for decoding GPS satellite data at low signal to noise levels US7352795 *",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}