{
    "relation": [
        [
            "Date",
            "12 Sep 1986",
            "30 Jul 1990",
            "30 Aug 1990",
            "12 Nov 1992",
            "25 Jan 1993",
            "18 Jul 1994"
        ],
        [
            "Code",
            "FPAY",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Owner name: ADAMS-RUSSELL, INC., A CORP. OF MA. Free format text: MERGER;ASSIGNOR:ADAMS-RUSSELL ELECTRONICS CO., INC., A CORP. OF DE.;REEL/FRAME:005381/0930 Effective date: 19890128",
            "Year of fee payment: 8",
            "Owner name: M/A-COM ACQUISITION CORP., MASSACHUSETTS Free format text: MERGER;ASSIGNOR:ADAMS-RUSSELL, INC.;REEL/FRAME:006353/0345 Effective date: 19900927 Owner name: M/A-COM ADAMS-RUSSELL, INC., MASSACHUSETTS Free format text: CHANGE OF NAME;ASSIGNOR:M/A-COM ACQUISITION CORP.;REEL/FRAME:006353/0353 Effective date: 19900927",
            "Owner name: M/A-COM, INC., MASSACHUSETTS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:M/A-COM ADAMS-RUSSELL, INC.;REEL/FRAME:006389/0711 Effective date: 19920627",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US4376920 - Shielded radio frequency transmission cable - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US4376920",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00157-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479601999,
    "recordOffset": 479575918,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While the invention has now been described in terms of certain preferred embodiments, and exemplified with respect thereto, those of skill in the art will readily appreciate that various modifications, changes, omissions and substitutions may be made without departing from the spirit of the invention. The unique construction of separated metallic sheaths and dielectric therebetween achieves a high series impedance and high propagation function in the path between the sheaths, remarkably improving the shielding over conventional sheaths either in electrical contact or separated by a dielectric having a low dielectric constant and a low dissipation factor thereby creating a small propagation function. Hence, the improved cable shielding suppresses the EMI and or RFI interference. The cable of the invention also minimizes the number of sheaths or allows use of less expensive poorer shielding sheaths (for example, braids with lower optical coverage) to achieve the same cable shielding, resulting in decreased manufacturing costs. From the foregoing, it should be apparent that the cable of the invention may take the form of numerous, different embodiments. The crucial feature in all embodiments is the requirement of a plurality of metallic sheaths with at least two sheaths separated with a dielectric to raise the series impedance of the paths between the sheaths and constructed in a manner to create a high propagation function for this triaxial path. Though the cable of the invention has been illustrated using longitudinally pulled \"cigarette-wrapped\"",
    "textAfterTable": "Coaxial conductor having parallel connected stranded layers of different pitch for equalizing inductance and current distribution US3193712 * 21 Mar 1962 6 Jul 1965 Harris Clarence A High voltage cable US3215768 * 23 Sep 1963 2 Nov 1965 Northrop Corp Flexible wire and cable shielding US3351706 * 18 Mar 1965 7 Nov 1967 Simplex Wire & Cable Co Spaced helically wound cable US3379824 * 25 Jun 1965 23 Apr 1968 Bell Telephone Labor Inc Coaxial cables US3484679 * 3 Oct 1966 16 Dec 1969 North American Rockwell Electrical apparatus for changing the effective capacitance of a cable US3509266 * 7 Dec 1966 28 Apr 1970 British Insulated Callenders Direct current electric cables US3541473 * 2 Oct 1967 17 Nov 1970 Allen Bradley Co Suppression of electro-magnetic interference in electrical",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}