{
    "relation": [
        [
            "Citing Patent",
            "US4798754 *",
            "US4917975 *",
            "US5335788 *",
            "US5562580 *",
            "US5972051 *",
            "US6219876",
            "US6224804 *",
            "US6233776",
            "US6417778",
            "US6507285",
            "US6562414 *",
            "US6735806",
            "US6873266",
            "US6886209",
            "US6899934",
            "US6917301",
            "US6940418",
            "US6982649",
            "US7009523",
            "US7109881",
            "US7145469",
            "US7205903",
            "US7358861",
            "US7404995",
            "US7456755",
            "US7511630",
            "US7629896",
            "US7726260 *",
            "US7849642",
            "US8397466",
            "US8407951",
            "US8596023",
            "US8955268",
            "US20040119602 *",
            "US20040139570 *",
            "US20040221411 *",
            "EP1681008A1"
        ],
        [
            "Filing date",
            "Aug 10, 1987",
            "Feb 3, 1989",
            "Mar 27, 1992",
            "Feb 8, 1994",
            "Dec 15, 1994",
            "May 4, 1999",
            "Jun 11, 1997",
            "Apr 19, 2000",
            "Jan 24, 2001",
            "May 3, 2002",
            "Oct 10, 2001",
            "May 11, 2001",
            "Nov 1, 2002",
            "Aug 14, 2001",
            "Feb 25, 2003",
            "Oct 10, 2003",
            "Feb 26, 2003",
            "May 16, 2003",
            "Jun 5, 2003",
            "Sep 22, 2005",
            "Dec 3, 2004",
            "Jan 20, 2004",
            "Aug 9, 2005",
            "Jan 18, 2005",
            "Jun 8, 2007",
            "Apr 16, 2007",
            "Jun 27, 2007",
            "Dec 20, 2001",
            "Mar 11, 2005",
            "Oct 5, 2005",
            "Apr 3, 2007",
            "May 27, 2010",
            "Nov 26, 2013",
            "Oct 10, 2003",
            "Aug 1, 2003",
            "Jun 8, 2004",
            "Jan 5, 2006"
        ],
        [
            "Publication date",
            "Jan 17, 1989",
            "Apr 17, 1990",
            "Aug 9, 1994",
            "Oct 8, 1996",
            "Oct 26, 1999",
            "Apr 24, 2001",
            "May 1, 2001",
            "May 22, 2001",
            "Jul 9, 2002",
            "Jan 14, 2003",
            "May 13, 2003",
            "May 18, 2004",
            "Mar 29, 2005",
            "May 3, 2005",
            "May 31, 2005",
            "Jul 12, 2005",
            "Sep 6, 2005",
            "Jan 3, 2006",
            "Mar 7, 2006",
            "Sep 19, 2006",
            "Dec 5, 2006",
            "Apr 17, 2007",
            "Apr 15, 2008",
            "Jul 29, 2008",
            "Nov 25, 2008",
            "Mar 31, 2009",
            "Dec 8, 2009",
            "Jun 1, 2010",
            "Dec 14, 2010",
            "Mar 19, 2013",
            "Apr 2, 2013",
            "Dec 3, 2013",
            "Feb 17, 2015",
            "Jun 24, 2004",
            "Jul 22, 2004",
            "Nov 11, 2004",
            "Jul 19, 2006"
        ],
        [
            "Applicant",
            "Tomek Lawrence S",
            "Guzman Joselito S De",
            "Sonoco Products Company",
            "Sonoco Products Company",
            "Vlsi Technology, Inc",
            "Tech Mats, L.L.C.",
            "Dlw Aktiengesellschaft",
            "Tech Mats, L.L.C",
            "Tech Mats Llc",
            "Intellimats, Llc.",
            "Sport Court, Inc.",
            "Eggs In The Pipeline, Llc",
            "Intellimats, Llc",
            "Tech Mats, Llc",
            "Illinois Tool Works Inc.",
            "Intellimats, Llc",
            "Intellimats, Llc",
            "Intellimats, Llc",
            "Intellimats, Llc",
            "Intellimats Llc",
            "Intellimats, Llc",
            "Intellimat, Inc.",
            "Intellimats",
            "Illinois Tool Works Inc.",
            "Intellimat, Inc.",
            "Intellimat, Inc.",
            "Intellimat, Inc.",
            "Pat Yananton",
            "Connor Sport Court International, Inc.",
            "Connor Sport Court International, Llc",
            "Connor Sport Court International, Llc",
            "Connor Sport Court International, Llc",
            "Connor Sport Court International, Llc",
            "Blum Ronald D.",
            "Blum Ronald D.",
            "Tech Mats, Lcc",
            "Illinois Tool Works, Inc."
        ],
        [
            "Title",
            "Oil-absorbent floor mat",
            "Contamination control mats and methods and apparatus for removing sheets therefrom",
            "Self-opening polyethylene bag stack and process for producing same",
            "Self-opening polyethylene bag stack and process for producing same",
            "Method and apparatus for removing particles from semiconductor wafer edges using a particle withdrawing means",
            "Floor mat",
            "Low-emission elastomer floor covering",
            "Advanced floor mat",
            "Advanced floor mat",
            "Cleaning system with electronic display",
            "Method of coating polyolefin floor tile",
            "Tacky roller for improved surface cleaning",
            "Electronic floor display",
            "Advanced floor mat",
            "Multi-layered renewable sticky surface bulletin board",
            "Floor display system with variable image orientation",
            "Electronic floor display cleaning system and protective cover",
            "Floor display system with interactive features",
            "Modular protective structure for floor display",
            "Electronic floor display with weight measurement and reflective display",
            "Display system for use on horizontal or non-horizontal surfaces",
            "Interactive and dynamic electronic floor advertising/messaging display",
            "Electronic floor display with alerting",
            "Contamination-control mat assembly with adhesive-coated sheets and composite polystyrene frame member and anti-slip backing member, and a process for fabricating the same",
            "Floor mat and system having electronic display device connectable to a network",
            "Dynamic electronic display system with brightness control",
            "Floor display system with interactive features and variable image rotation",
            "Absorbent pad for entrapping small and coarse particles, retaining liquids and eliminating odors",
            "Tile with wide coupling configuration and method for the same",
            "Tile with multiple-level surface",
            "Modular synthetic floor tile configured for enhanced performance",
            "Modular tile with controlled deflection",
            "Modular tile with controlled deflection",
            "Floor display system with variable image orientation",
            "Tacky sheets with reduced glare or shine",
            "Advanced floor mat",
            "Contamination-control mat assembly with adhesive-coated sheets, composite polystyrene frame member and anti-slip backing member, and a process for fabricating the same"
        ]
    ],
    "pageTitle": "Patent US4559250 - Contamination-control mats - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4559250?dq=7,104,347",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00226-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475106939,
    "recordOffset": 475084058,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21881=Current adhesive-coated contamination control plastic film mats are constructed of low-density polyethylene film at least 2.5 mils thick. The tensile strength of uncoated low-density polyethylene is generally 2800 p.s.i. Low-density polyethylene film can be made more resilient or stretchy by the addition of small percentages of other chemicals such as polyvinyl chloride. When such a sheet of plastic film is adhered to an adhesive-coated film which has an adhesion of eight to ten ounces of pull or adhesion per inch of width, the film must be strong enough to withstand the pull load of removal without tearing or shredding. This requisite strength has heretofore been accomplished via film thickness. A one-mil low-density polyethylene film would often tear upon removal from a ten-ounce adhesive-coated substrate., 20823=A major problem with current multi-layer stacks is the danger of premature sheet-to-sheet delamination. A clean rubber-soled shoe, typical of those used in hospitals, worn by a person weighing 150 pounds and pressed to an adhesive surface of ten ounces of adhesion (method 2050 or FTM STD NO-101 B) will develop 320 ounces of direct upward pull. This upward pull tends to pull the sheet loose from the underlying layer and to wrap around the shoe or wheel, thereby resulting in potential danger to the user. One company helps to solve this problem by providing a tiny dry-stripe non-adhesive coated edge on the edges of each sheet. Therefore a clean shoe sole does not come into contact with adhesive at the edge of the adhesive-coated sheet or layer where the danger of delamination is greatest. The other major producer uses its floor frame to good advantage. The edge of the frame being higher than the edge of the floor mat, the shoe of the user cannot come into contact with the extreme edge and, thereby, helps prevent delamination., 31263=The typical adhesive coated surface of the two largest producers of contamination control mats (approximately 90% of the total market) uses adhesive to provide a ten-ounce pull load per lineal inch. This can be measured by adhering an adhesive-coated film one inch wide to a clean #4 polished sheet of stainless steel. This strip of film is then removed via a pulling device which measures the amount of pull in ounces required to remove it from the stainless steel at a pull rate of twelve lineal inches per minute (method 2050 of FTM STD NO-101 B)., 26617=High-density polyethylene has a typical film tensile strength of 4800 PSI, ASTM test method D882. This is sufficient to withstand an adhesive pull load from an underlying layer of ten ounces pull per lineal inch of width. Linear low-density film also has a tensile strength sufficient to withstand ten ounces of adhesion per inch of width without tearing, typically 6000 p.s.i. Low density polyethylene in comparison has a typical tensile strength of 2800 p.s.i.}",
    "textBeforeTable": "Patent Citations To those skilled in the art to which this invention relates, many changes in construction and widely differing embodiments and applications of the invention will suggest themselves without departing from the spirit and scope of the invention. The disclosures and the descriptions herein are purely illustrative and are not intended to be in any sense limiting. The invention also employs aggressive adhesives, when desired by the user, up to an adhesion pull range of ten or more ounces per lineal inch. Therefore a low level of adhesion is not necessarily less efficient in dirt removal than a highly adhesive surface. Many contamination control users prefer a low tack, comfortable mat surface but dislike the washing process, because of slip danger and the labor cost. This invention thus preferably uses low-adhesion adhesives in a stack product configuration with an adhesive pull load range as low as one-half ounce per lineal inch. This gives the user the benefit of a surface that is comfortable to walk upon and enables use of large surfaces areas along with easy disposability, while eliminating the necessity of washing. Dirt and dust are picked up by an essentially non-adhesive rubber soled shoe or rubber cart wheel during normal walking or rolling, because the rubber wheel or shoe sole is more attractive (i.e., adhesive) to the particulate matter than is the hard surfaced floor on which the dirt had been sitting. When the same",
    "textAfterTable": "US7849642 Mar 11, 2005 Dec 14, 2010 Connor Sport Court International, Inc. Tile with wide coupling configuration and method for the same US8397466 Oct 5, 2005 Mar 19, 2013 Connor Sport Court International, Llc Tile with multiple-level surface US8407951 Apr 3, 2007 Apr 2, 2013 Connor Sport Court International, Llc Modular synthetic floor tile configured for enhanced performance US8596023 May 27, 2010 Dec 3, 2013 Connor Sport Court International, Llc Modular tile with controlled deflection US8955268 Nov 26, 2013 Feb 17, 2015 Connor Sport Court International, Llc Modular tile with controlled deflection US20040119602 * Oct 10, 2003 Jun 24, 2004 Blum Ronald D. Floor display system with variable image orientation US20040139570 * Aug 1, 2003 Jul 22, 2004 Blum Ronald D. Tacky sheets with reduced glare or shine US20040221411 * Jun 8, 2004 Nov 11, 2004 Tech",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}