{
    "relation": [
        [
            "Citing Patent",
            "US5416374 *",
            "US5418417 *",
            "US5471108 *",
            "US5479380 *",
            "US5610468 *",
            "US5914555 *",
            "US5945769 *",
            "US6020673 *",
            "US6064139 *",
            "US6166477 *",
            "US6177754 *",
            "US6218767 *",
            "US6404103 *",
            "US6467139",
            "US6586860 *",
            "US6707233 *",
            "US6909222 *",
            "US7215062 *",
            "US7365475 *",
            "US8841868 *",
            "US9091805",
            "US20010022485 *",
            "US20120119684 *",
            "EP2555412A3 *"
        ],
        [
            "Filing date",
            "6 Jul 1993",
            "13 Jul 1993",
            "3 Feb 1994",
            "22 Oct 1990",
            "1 Feb 1993",
            "16 Dec 1996",
            "12 Jul 1994",
            "19 Dec 1997",
            "11 Oct 1994",
            "7 Apr 1998",
            "23 Dec 1998",
            "30 Dec 1996",
            "31 Oct 2000",
            "11 Jul 2000",
            "26 Oct 2000",
            "12 Dec 2000",
            "28 Feb 2003",
            "5 Aug 1999",
            "17 Oct 2006",
            "10 Mar 2010",
            "25 Jul 2012",
            "12 Dec 2000",
            "10 Mar 2010",
            "1 Aug 2012"
        ],
        [
            "Publication date",
            "16 May 1995",
            "23 May 1995",
            "28 Nov 1995",
            "26 Dec 1995",
            "11 Mar 1997",
            "22 Jun 1999",
            "31 Aug 1999",
            "1 Feb 2000",
            "16 May 2000",
            "26 Dec 2000",
            "23 Jan 2001",
            "17 Apr 2001",
            "11 Jun 2002",
            "22 Oct 2002",
            "1 Jul 2003",
            "16 Mar 2004",
            "21 Jun 2005",
            "8 May 2007",
            "29 Apr 2008",
            "23 Sep 2014",
            "28 Jul 2015",
            "20 Sep 2001",
            "17 May 2012",
            "7 May 2014"
        ],
        [
            "Applicant",
            "Seiko Instruments Inc.",
            "Asulab S.A.",
            "Imra Europe Sa And Techsonic",
            "Seiko Epson Corporation",
            "Seiko Epson Corporation",
            "Seiko Instruments Inc.",
            "Canon Kabushiki Kaisha",
            "Nikon Corporation",
            "Seiko Instruments Inc.",
            "Asmo Co., Ltd.",
            "Seiko Instruments Inc.",
            "Canon Kabushiki Kaisha",
            "Seiko Instruments Inc.",
            "Nec Corporation",
            "Seiko Instruments Inc.",
            "Asmo Co., Ltd",
            "Seiko Epson Corporation",
            "Seiko Instruments Inc.",
            "Pentax Corporation",
            "National University Corporation Tokyo University Of Agriculture And Technology",
            "Canon Kabushiki Kaisha",
            "Nobumitsu Oda",
            "National University Corporation Tokyo University of Agruculture and Technology",
            "Canon Kabushiki Kaisha"
        ],
        [
            "Title",
            "Ultrasonic motor and electronic apparatus equipped with ultrasonic motor",
            "Piezoelectric motor",
            "Realization process of a distribution network of electric signals, obtained distribution network and piezoelectric motor including such a network",
            "Ultrasonic motor for driving an analog electronic watch",
            "Ultrasonic step motor",
            "Ultrasonic motor",
            "Wave driven motor",
            "Drive method and drive device of vibration actuator",
            "Ultrasonic motor",
            "Ultrasonic motor with rotor converting longitudinal vibrations into torque",
            "Ultrasonic motor and electronic apparatus with ultrasonic motor",
            "Vibration device",
            "Ultrasonic motor and electronic apparatus having ultrasonic motor",
            "Mounting structure and mounting method for surface acoustic wave element",
            "Ultrasonic motor and electronic device with ultrasonic motor",
            "Ultrasonic motor",
            "Piezoelectric actuator, and timepiece and portable equipment having the same",
            "Ultrasonic motor and electronic appliance with ultrasonic motor",
            "Ultrasonic motor",
            "Spherical ultrasound motor and control method for a spherical ultrasound motor",
            "Ultrasonic motor and lens apparatus including the same",
            "Ultrasonic motor",
            "Spherical ultrasound motor and control method for a spherical ultrasound motor",
            "Ultrasonic motor and lens apparatus including the same"
        ]
    ],
    "pageTitle": "Patent US5247220 - Ultrasonic motor - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US5247220",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00217-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 467727739,
    "recordOffset": 467689854,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{52243=Conventional types of ultrasonic motors using vibration have been proposed as described in, Japanese Patent Laid-Open Nos. 58-93477, 59-122385 and 60-51478 and Japanese Patent Publication 59-37673. The Japanese Patent Laid-Open No. 58-93477 discloses a method for arbitrarily switching the driving direction of a piezoelectric motor as required by applying a voltage output having the prescribed phase difference to a plurality of vibrators. Japanese Patent Laid-Open No. 59-122385 discloses a method for converting strong vibration energy of a supersonic wave into rotational or linear movement. This is accomplished by utilizing traveling waves combined with lateral waves and longitudinal waves excited on the surface of an elastic material. Japanese Laid-Open No. 60-51478 discloses a motor which displays accurate time by etching a pattern of 60 divisions of an electronic timepiece made of a piezoelectric motor. In this manner, the pattern detects the rotating state to control the drive of the motor., 122000=Referring specifically to FIGS. 52 and 53, an ultrasonic motor constructed in accordance with another embodiment of the invention having a stator 2-30 is disclosed. Hatched portions depict relief portions 52, while non-hatched portions depict projections 2a-30 of stator 2-30. A hole is formed within stator 2-30 at a central portion 2e-30 having a set screw 6-30 extending therethrough. Stator 2-30 is secured to base plate 4-30 by set screw 6-30 through a spacer 53-30. Relief portion 52-30 is formed by an etching process and the piezoelectric element 3-30 is formed by any process set forth in the description of stator 2-29. In this construction, the ultrasonic motor generates surface waves to continuously rotate as described in Japanese Patent Laid-Open Application No. 61-102177.}",
    "textBeforeTable": "Patent Citations It is also to be understood that the following claims are intended to cover all of the generic and specific features of the invention herein described and all statements of the scope of the invention which, as a matter of language, might be said to fall therebetween. It will thus be seen that the objects set forth above, among those made apparent from the preceding description, are efficiently attained and, since certain changes may be made in the above constructions without departing from the spirit and scope of the invention, it is intended that all matter contained in the above description or shown in the accompanying drawings shall be interpreted as illustrative and not in a limiting sense. As described above the relief portions of the stator or the rotor are formed by an etching process. In addition, the piezoelectric element can be formed directly on the stator. Accordingly, the shape and function of the relief portions and the projections are not limited to the various embodiment mentioned above of the ultrasonic motor according to the invention. Any materials including metals and silicone can be used to make the rotor and the stator as long as they can be formed by either an etching process or other micro-machining techniques. It is to be noted that with the electric conducting structure of the ultrasonic step motor constructed in accordance with the invention, the only requirement for the",
    "textAfterTable": "JPS6364582A * Title not available JPS59122385A * Title not available JPS60245482A * Title not available JPS61224883A * Title not available JPS62148077A * Title not available JPS62247770A * Title not available JPS63190569A * Title not available JPS63283475A * Title not available JPS63305772A * Title not available * Cited by examiner",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}