{
    "relation": [
        [
            "Citing Patent",
            "US6800014 *",
            "US6808437 *",
            "US6826973",
            "US6904820",
            "US6931951 *",
            "US7037112",
            "US7063590",
            "US7384325",
            "US20040118224 *",
            "US20040118225 *",
            "US20040121294 *",
            "US20040121701 *",
            "US20040127140 *",
            "US20120205285 *",
            "CN103142078B *",
            "WO2008001139A1 *"
        ],
        [
            "Filing date",
            "Jul 30, 2001",
            "Feb 4, 2003",
            "Dec 20, 2002",
            "Dec 20, 2002",
            "Dec 20, 2002",
            "Dec 20, 2002",
            "Sep 20, 2004",
            "Aug 15, 2003",
            "Dec 20, 2002",
            "Dec 20, 2002",
            "Dec 20, 2002",
            "Jul 30, 2001",
            "Aug 15, 2003",
            "Feb 11, 2011",
            "Mar 27, 2013",
            "Jun 27, 2007"
        ],
        [
            "Publication date",
            "Oct 5, 2004",
            "Oct 26, 2004",
            "Dec 7, 2004",
            "Jun 14, 2005",
            "Aug 23, 2005",
            "May 2, 2006",
            "Jun 20, 2006",
            "Jun 10, 2008",
            "Jun 24, 2004",
            "Jun 24, 2004",
            "Jun 24, 2004",
            "Jun 24, 2004",
            "Jul 1, 2004",
            "Aug 16, 2012",
            "Apr 15, 2015",
            "Jan 3, 2008"
        ],
        [
            "Applicant",
            "Carlo Maria Dominici",
            "Senario Llc",
            "Kimberly-Clark Worldwide, Inc.",
            "Kimberly-Clark Worldwide, Inc.",
            "Kimberly-Clark Worldwide, Inc.",
            "Kimberly-Clark Worldwide, Inc.",
            "Mattel, Inc.",
            "Mattel, Inc.",
            "Tate Martha L.",
            "Wright Audra S.",
            "Lord Patrick R.",
            "Dominici Carlo Maria",
            "Emily Kelly",
            "E. I. Du Pont De Nemours And Company",
            "苏州市晨彩纺织研发有限公司",
            "Big Ideas Product Dev Ltd"
        ],
        [
            "Title",
            "Device to obtain lengthening of the limbs and/or other parts of the body of a puppet, such as for example a doll and other similar toys such as small animals, soft toys and similar",
            "Extendible link soft or plush toy",
            "Heated mechanical arm",
            "Method of using a simulated skin substrate and method for determining material dryness performance",
            "Mechanical device with simulated skin substrate",
            "Virtual arm for measurement of humidity, temperature, and water vapor transmission rate in materials",
            "Doll having adjustable length hair",
            "Feature-altering toy",
            "Method of using a simulated skin substrate and method for determining material dryness performance",
            "Mechanical device with simulated skin substrate",
            "Virtual arm for measurement of humidity, temperature, and water vapor transmission rate in materials",
            "Device to obtain lengthening of the limbs and/or other parts of the body of a puppet, such as for example a doll and other similar toys such as small animals, soft toys and similar",
            "Feature-altering toy",
            "Targeted pretreatment and selective ring opening in liquid-full reactors",
            "一种服装展示模型",
            "Toy creature"
        ]
    ],
    "pageTitle": "Patent US6413142 - Expandable doll or the like - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6413142?dq=7800613",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00290-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471018175,
    "recordOffset": 470998570,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28580=There are other expanding doll devices designed for simulating growth. Typical of these is U.S. Pat. No. 4,160,338 issued to Paul Lyons et al. on Jul. 10, 1979., 28760=Another patent was issued to Thomas J. Fauls on Dec. 2, 1980 as U.S. Pat. No. 4,236,347. Yet another U.S. Pat. No. 4,246,722 was issued to Jurgis Sapkus on Jan. 27, 1981 and still yet another was issued on Apr. 7, 1981 to Marcia Silverstein as U.S. Pat. No. 4,259,807., 29048=Another patent was issued to Joseph M. Darrigo, Sr. on Nov. 11, 1986 as U.S. Pat. No. 4,622,021. Yet another U.S. Pat. No. 4,828,528 was issued to Jacob Chatkis on May 9, 1989. Another was issued to Beverly L. Munter on Nov. 26, 1991 as U.S. Pat. No. 5,067,924 and still yet another was issued on Jun. 30, 1992 to Henry Orenstein et al. as U.S. Pat. No. 5,125,865. Still another was issued to Jaime Ferri on May 16, 1995 as U.S. Pat. No. 5,415,580.}",
    "textBeforeTable": "Patent Citations It should be clear that the present invention can be adapted to and applied to many other types of small-scale representations or models of animals other than humans, e.g., dogs, horses, rabbits, monkeys, etc. Some of these other types of animals may not, e.g, have an elbow in the sense of a human, but may have comparable body junctions which serve to join various body appendages or limbs at an intermediate point. The present invention could be used in the other animals in a manner similar to that previously described for dolls in FIGS. 1 to 10. Turning to FIG. 10, shown therein is an exterior view of the present invention 10, showing the doll fully inflated in the toddler stage. Turning to FIG. 9, shown therein is an exterior view of the present invention 10, showing the doll uninflated in the infant stage. Turning to FIG. 8, shown therein is a section view of the expandable bellows 26 within the flexible skin cover 32 of the present invention 10, showing the bellows in both expanded and unexpanded condition. Turning to FIG. 7, shown therein is a view of the present invention 10, showing a the doll fully inflated by arrows 28 in the toddler stage wherein the arms, legs and head are larger and extended. Turning to FIG. 6, shown therein is a detail view of the present invention 10, showing a hand 30 operating",
    "textAfterTable": "US6826973 Dec 20, 2002 Dec 7, 2004 Kimberly-Clark Worldwide, Inc. Heated mechanical arm US6904820 Dec 20, 2002 Jun 14, 2005 Kimberly-Clark Worldwide, Inc. Method of using a simulated skin substrate and method for determining material dryness performance US6931951 * Dec 20, 2002 Aug 23, 2005 Kimberly-Clark Worldwide, Inc. Mechanical device with simulated skin substrate US7037112 Dec 20, 2002 May 2, 2006 Kimberly-Clark Worldwide, Inc. Virtual arm for measurement of humidity, temperature, and water vapor transmission rate in materials US7063590 Sep 20, 2004 Jun 20, 2006 Mattel, Inc. Doll having adjustable length hair US7384325 Aug 15, 2003 Jun 10, 2008 Mattel, Inc. Feature-altering toy US20040118224 * Dec 20, 2002 Jun 24, 2004 Tate Martha L. Method of using a simulated skin substrate and method for determining material dryness performance US20040118225 * Dec 20, 2002 Jun 24, 2004 Wright",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}