{
    "relation": [
        [
            "Cited Patent",
            "US3650277 *",
            "US5031618 *",
            "US5058584 *",
            "US5199428 *",
            "US5293879 *",
            "US5342409 *",
            "US5623937 *",
            "US5702429 *",
            "US5707400 *",
            "US5718721 *",
            "WO1995017921A1 *"
        ],
        [
            "Filing date",
            "Feb 17, 1970",
            "Mar 7, 1990",
            "Aug 30, 1990",
            "Mar 22, 1991",
            "Sep 23, 1991",
            "Jun 3, 1991",
            "Jun 7, 1995",
            "Apr 4, 1996",
            "Sep 19, 1995",
            "Dec 23, 1996",
            "Dec 27, 1994"
        ],
        [
            "Publication date",
            "Mar 21, 1972",
            "Jul 16, 1991",
            "Oct 22, 1991",
            "Apr 6, 1993",
            "Mar 15, 1994",
            "Aug 30, 1994",
            "Apr 29, 1997",
            "Dec 30, 1997",
            "Jan 13, 1998",
            "Feb 17, 1998",
            "Jul 6, 1995"
        ],
        [
            "Applicant",
            "Lkb Medical Ab",
            "Medtronic, Inc.",
            "Medtronic, Inc.",
            "Medtronic, Inc.",
            "Vitatron Medical, B.V.",
            "Medtronic, Inc.",
            "Kabushiki Kaisya Advance",
            "Medtronic, Inc.",
            "Cyberonics, Inc.",
            "Ross; Jesse",
            "Horst Edgar Krause"
        ],
        [
            "Title",
            "Apparatus for influencing the systemic blood pressure in a patient by carotid sinus nerve stimulation",
            "Position-responsive neuro stimulator",
            "Method and apparatus for epidural burst stimulation for angina pectoris",
            "Implantable electrical nerve stimulator/pacemaker with ischemia for decreasing cardiac workload",
            "System an method for detecting tremors such as those which result from parkinson's disease",
            "Position-responsive neuro stimulator",
            "Artifact detector for stimulator",
            "Neural stimulation techniques with feedback",
            "Treating refractory hypertension by nerve stimulation",
            "Method of relieving migraine headache pain",
            "Method of electrical nerve stimulation"
        ]
    ],
    "pageTitle": "Patent US6058331 - Apparatus and method for treating peripheral vascular disease and organ ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6058331?dq=6233682",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00156-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481476239,
    "recordOffset": 481428276,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{70805=The present invention may be implemented by providing pulses to lead 16 having amplitudes of 0.1 to 20 volts, pulse widths varying from 60 to 1000 microseconds, and repetition rates varying from 5 to 185 Hz or more. Those skilled in the art will appreciate that these ranges may vary depending upon the particular application. For example, repetition rates between 5 and 100 Hz are generally used to excite neurons and above 100 Hz to inhibit neurons. SCS and PNS may use the lower frequency range to cause paresthesia to responsively inhibit the sympathetic outflow. Stimulation of the sympathetic neuronal ganglia or sympathetic neurons may use the higher frequency range to directly inhibit the sympathetic outflow. The appropriate stimulation pulses are generated by generator 14 or 14A based on the computer algorithm shown in FIGS. 6-8 that reads the sensor signal and makes the appropriate analysis. Other stimulation algorithms are also conceivable including the algorithm similar to one disclosed in U.S. Pat. No. 5,702,429 (King)., 63735=Microprocessor 68 is suited to control pulse frequency, amplitude, pulse width, pulse frequency duty cycle, pulse polarity, and/or pulse waveform of the stimulation pulses. The stimulation may also be in the form of a constant or varying stimulation. The pulse frequency is controlled by programming a value to a programmable frequency generator (not shown). The programmable frequency generator provides an interrupt signal to microprocessor 68 when each stimulus pulse is to be generated. The frequency generator may be implemented by model CDP1878 sold by Harris Corporation. The pulse amplitude is programmed to receive the output of a digital to analog converter (not shown). Pulse width is controlled by microprocessor 68 using a programmable pulse width control module (not shown). The pulse width control module provides an enabling pulse of duration equal to the pulse width. Pulses with the selected frequency, amplitude and width characteristics are then delivered from signal generator 14 or 14A through cable 16 and lead 18 to spinal cord 12 or peripheral nerve 45., 38697=Clinical researchers have found that spinal cord stimulation (SCS) may be used to help improve blood flow and alleviate ischemic pain in limbs caused by poor blood flow due to peripheral vascular disease (PVD). SCS may reduce pain via the well known Gate Control Theory proposed by Ronald Melzack and Patrick Wall in 1965. There are also three probable mechanisms, based on animal and clinical research from SCS for PVD, of how SCS can improve blood flow: (1) inhibition of excess sympathetic nervous activity due to pain; (2) further inhibition of sympathetic nervous background tone; and (3) release of vasoactive substances in the limb. Normally the sympathetic nervous system controls peripheral blood flow. The sympathetic nervous system is able to contract the small precapillary smooth muscle sphincters that adjust local blood flow. During times of stress or vigorous activity, there is high sympathetic tone, and blood is shunted from the distal limbs to large proximal muscles. Pain in the periphery can also increase the sympathetic outflow and cause such shunting. Ironically, in the elderly person with PVD, the pain of limb ischemia can trigger more sympathetic outflow, and further decrease blood supply to distal limb areas. Researchers have studied the role of the sympathetic system in producing ischemia using rats and have shown that interventions that inhibit the sympathetic outflow like drugs or sympathetic ganglia destruction (sympathectomy) can dramatically increase vasodilation in the periphery. They have also shown in rats that SCS can recruit A-delta nerve fibers in dorsal roots (normally carrying pain messages). Antidromic actions potentials in these fibers travel to the distal limb parts and release CGRP and NO, molecules which greatly assist local vasodilation. Both of these effects may be present in humans getting SCS for their PVD, and depending upon the precise parameters of stimulation, may explain the mechanism for the benefit of vasodilation., 56564=Internal sensor 40 may also be a suitable accelerometer, such as those found in pacemakers manufactured by Medtronic, Inc. and described in patent application Ser. No. 08/399,072 filed Mar. 8, 1995, in the names of James Sikorski and Larry R. Larson and entitled \"Package Integrated Accelerometer\" now U.S. Pat. No. 5,674,258.}",
    "textBeforeTable": "Patent Citations By using the foregoing techniques for spinal cord stimulation, PVD patients may be treated to increase blood flow in the limbs, thereby reducing suffering from ischemic pain in the limbs. Advantageously, the present invention may be used to control blood flow to a patch of tissue, for example a skin dermatome, on the trunk of the patient which may have too little or too much blood flow, to alleviate a neuropathic or ischemic pain due to post-herpetic neuralgia or complex regional pain syndrome (CRPS). Alternatively, if internal organs have a loss of blood flow due to sympathetic neuronal over-activity, lead 18 may be placed at optimal spinal cord locations or in the sympathetic ganglia that project to those organs or along nerves that project to those organs. Those skilled in that art will recognize that the preferred embodiments may be altered or amended without departing from the true spirit and scope of the invention, as defined in the accompanying claims. The signal size may also be allowed to be adjusted automatically when the stimulation system is first turned on, by gradually increasing the amplitude of pulses until a prior stored value of feedback signal is produced. Memory unit 74 can store prior parameters of stimulation, polarities, or size of recorded feedback signal. Microcontroller 68 can be programmed to perform the foregoing functions described by those skilled in the art. Referring back to FIG. 5, controller 60",
    "textAfterTable": "* Cited by examiner Non-Patent Citations Reference 1 Bunt, Holloway, Lawarence, Cherney, Malone, \"Experience with Epidural Spinal Stimulation in the Treatment of End-Stage Peripheral Vascular Disease,\" Seminars in Vascular Surgery, vol. 14, No. 4, pp. 216-220 (Dec. 1991). 2 * Bunt, Holloway, Lawarence, Cherney, Malone, Experience with Epidural Spinal Stimulation in the Treatment of End Stage Peripheral Vascular Disease, Seminars in Vascular Surgery, vol. 14, No. 4, pp. 216 220 (Dec. 1991). 3 Bunt, Holloway, Robey, Malone, \"Dorsal Column Stimulation Delays Amputation In Some Patients With Ischemic Rst Pain and Ischemic Tissue Loss,\" Abstract: The Western Vascular Surg., Society Meeting, (Jan. 1994). 4 * Bunt, Holloway, Robey, Malone, Dorsal Column Stimulation Delays Amputation In Some Patients With Ischemic Rst Pain and Ischemic Tissue Loss, Abstract: The Western Vascular Surg., Society Meeting, (Jan. 1994). 5 Cameron, Cotter, Robertson, Maxfield, \"Nerve function in experimental diabetes in rats: effects of electrical stimulation,\" American Journal of Physiology: Endocrinology and Metabolism, (Feb. 1993) vol. 27, No. 2. 6",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}