{
    "relation": [
        [
            "Atom",
            "N(1)",
            "N(2)",
            "C(1)",
            "C(2)",
            "C(3)",
            "N(3)",
            "O(1)",
            "O(2)",
            ""
        ],
        [
            "Charges (e)",
            "−0.16920",
            "−0.28191",
            "0.13219",
            "−0.27626",
            "0.13913",
            "0.51394",
            "−0.38790",
            "−0.38977",
            ""
        ],
        [
            "Atom",
            "C(4)",
            "C(5)",
            "C(6)",
            "C(7)",
            "C(8)",
            "C(9)",
            "S(1)",
            "C(10)",
            ""
        ],
        [
            "Charges (e)",
            "−0.03329",
            "−0.18105",
            "−0.17616",
            "0.05712",
            "−0.17632",
            "−0.16957",
            "0.41951",
            "−0.22371",
            ""
        ],
        [
            "Atom",
            "C(11)",
            "C(12)",
            "C(13)",
            "C(14)",
            "C(15)",
            "C(16)",
            "C(17)",
            "C(18)",
            "C(19)"
        ],
        [
            "Charges (e)",
            "−0.22313",
            "−0.24353",
            "−0.37017",
            "0.14793",
            "−0.19406",
            "−0.18771",
            "−0.19584",
            "−0.18649",
            "−0.20411"
        ]
    ],
    "pageTitle": "Molecules | Free Full-Text | Synthesis, Crystal Structure, Spectra and Quantum Chemical Study on 1-Phenyl-3-(4-nitrophenyl)-5-(2-thienyl)-2-pyrazoline | HTML",
    "title": "Table 3. NPA atomic charge distributions obtained at B3LYP/6-311G** level.",
    "url": "http://www.mdpi.com/1420-3049/19/4/5313/htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00319-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 570980987,
    "recordOffset": 570955347,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17859=Molecules 2014, 19(4), 5313-5324; doi:10.3390/molecules19045313, 65653=CCDC-990511 contains the supplementary crystallographic data for this paper. These data can be obtained free of charge at www.ccdc.cam.ac.uk/conts/retrieving.html (or from the Cambridge Crystallographic Data Centre (CCDC), 12 Union Road, Cambridge CB2 1EZ, UK; Fax: +44(0)1222-336033; E-Mail: deposit@ccdc.cam.ac.uk)., 66268=Initial molecular geometry of the title compound was taken from its crystal structure. Then, DFT calculations at B3LYP/6-311G** levelof theory by the Berny method [33] were performed with the Gaussian 03 software package [34]. Vibrational frequencies calculated ascertain the structure was stable (no imaginary frequencies). Natural Bond Orbital (NBO) analyses were also performed on the optimized structure. On the basis of the MNDO Hamiltonian [35] and PM3 parametrization [36] with the MOPAC [37] program package, the molecular hyperpolarizability value was also calculated. All calculations were performed on a DELL PE 2850 server and a Pentium IV computer using the default convergence criteria., 74227=This work was supported by Fund of Jiangsu Key Laboratory for Chemistry of Low-Dimensional Materials (JSKC12107 and JSKC12106) and Huaian Science & Technology Bureau, Jiangsu Province, China (HAG2012005, HAG2013009 and HC201307)., 64277=The selected crystal of the title compound was mounted on an Rigaku raxis Rapid IP Area Detector diffractometer. Reflection data were measured at 293(2) K using graphite monochromated Mo-Kα (λ = 0.71073 Å) radiation and a ωscan mode. The correction for Lp factors and empirical absorption were applied to the data. The structures were solved by direct methods and refined by full-matrix least-squares method on Fobs2 using the SHELXTL software package [31]. All non-H atoms were anisotropically refined. The hydrogen atom positions were fixed geometrically at calculated distances and allowed to ride on the parent C atoms. The final least-square cycle gave R = 0.0707, wR2 = 0.1922. Atomic scattering factors and anomalous dispersion corrections were taken from International Table for X-ray Crystallography [32]. A summary of the key crystallographic information is given in Table 4., 21999=Pyrazoline derivatives are five-membered, nitrogen-containing heterocyclic compounds with high hole-transport efficiency, excellent blue emission and high quantum yield [1,2,3], which have made them useful as fluorescent brightening agents, fluorescence chemosensors, hole-transport materials in electrophotography, OLED and as fluorescent materials [4,5,6,7,8]. Since 2001, different groups have prepared pyrazoline nanoparticles ranging from tens to hundreds of nanometers in size by using the re-precipitation method and explored their size-tunable optical properties for application in optoelectronic devices [9,10,11]. Our group has also reported the synthesis, structure and spectra properties of a series of 2-pyrazolines by experimental and theoretical methods [12,13,14,15,16,17,18]., 105266=© 2014 by the authors; licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution license (http://creativecommons.org/licenses/by/3.0/).}",
    "textBeforeTable": "Editorial Process About Open Access Policy For Librarians For Editors For Reviewers For Authors Information & Guidelines Journals A-Z MDPI Submit to Molecules Login Register Identifying Stereoisomers by ab-initio Calculation of Secondary Isotope Shifts on NMR Chemical Shieldings Previous Article in Journal Rice Bran Feruloylated Oligosaccharides Activate Dendritic Cells via Toll-Like Receptor 2 and 4 Signaling Next Article in Journal",
    "textAfterTable": "Abstract Full-Text HTML Full-Text PDF [897 KB] Full-Text XML Article Versions Notes Related Info Article Statistics PubMed/Medline Google Scholar Order Reprints More by Authors [+] on DOAJ Guo, H Zhao, P Wu, Q Li, Y [+] on Google Scholar Guo, H Zhao, P Wu, Q Li, Y [+] on PubMed Guo, H Zhao, P Wu, Q Li, Y Share This Article  Twitter  Facebook  Mendeley  CiteULike Quick Links Open Access",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}