{
    "relation": [
        [
            "Model",
            "T-4",
            "T-5",
            "Fast Deep",
            "T-6",
            "T-7",
            "Deep Blue",
            "T-10",
            "T-11"
        ],
        [
            "Applications",
            "Standard probe used by the U.S. Navy for ASW operations",
            "Deep ocean scientific and military applications",
            "Provides maximum depth capabilities at the highest possible ship speed of any XBT",
            "Oceanographic applications",
            "Increased depth for improved sonar prediction in ASW and other military applications",
            "Increased launch speed for oceanographic and naval applications",
            "Commercial fisheries applications",
            "High resolution for U.S. Navy mine counter-measures and physical oceanographic applications."
        ],
        [
            "Maximum Depth",
            "460 m 1500 ft",
            "1830 m 6000 ft",
            "1000 m 3280 ft",
            "460 m 1500 ft",
            "760 m 2500 ft",
            "760 m 2500 ft",
            "200 m 600 ft",
            "460 m 1500 ft"
        ],
        [
            "Rated Ship Speed",
            "30 knots",
            "6 knots",
            "20 knots",
            "15 knots",
            "15 knots",
            "20 knots",
            "10 knots",
            "6 knots"
        ],
        [
            "Vertical Resolution",
            "65 cm",
            "65 cm",
            "65 cm",
            "65 cm",
            "65 cm",
            "65 cm",
            "65 cm",
            "18 cm"
        ]
    ],
    "pageTitle": "Bathythermograph - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Expendable_bathythermograph",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00123-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 863131259,
    "recordOffset": 863109748,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10077=The true origins of the BT began in 1935 when Carl-Gustaf Rossby started experimenting. He then forwarded the development of the BT to his graduate student Athelstan Spilhaus. Who then fully developed the BT in 1938[1] as a collaboration between MIT, Woods Hole Oceanographic Institution (WHOI), and the U.S. Navy.[3] The device was modified during World War II to gather information on the varying temperature of the ocean for the U.S. Navy. Originally the slides were prepared \"by rubbing a bit of skunk oil on with a finger and then wiping off with the soft side of one's hand,” followed by smoking the slide over the flame of a Bunsen burner.[4] Later on the skunk oil was replace with an evaporated metal film.[1]}",
    "TableContextTimeStampAfterTable": "{8186=For a considerable time, these equations were relatively well-established, however in 2007 Gouretski and Koltermann showed a bias between XBT temperature measurements and CTD temperature measurements.[10] They also showed that this varies over time and could be due to both errors in the calculation of depth and in measurement of the temperature. From that the 2008 NOAA XBT Fall Rate Workshop[11] began to address the problem, with no viable conclusion as to how to proceed with adjusting the measurements. In 2010 the second XBT Fall Rate Workshop was held in Hamburg, Germany to continue discussing the problem and forge a way forward.[12]}",
    "lastModified": "Sat, 25 Jul 2015 10:37:01 GMT",
    "textBeforeTable": "Source:[8] Types of XBTs[edit] The unit is composed of a probe; a wire link; and a shipboard canister. Inside of the probe is a thermistor which is connected electronically to a chart recorder. The probe falls freely at 20 feet per second and that determines its depth and provides a temperature-depth trace on the recorder. A pair of fine copper wires which pay out from both a spool retained on the ship and one dropped with the instrument, provide a data transfer line to the ship for shipboard recording. Eventually, the wire runs out and breaks, and the XBT sinks to the ocean floor. Since the deployment of an XBT does not require the ship to slow down or otherwise interfere with normal operations, XBT's are often deployed from vessels of opportunity, such as cargo ships or ferries, rather than a dedicated research ship where a CTD would normally be used in preference. Airborne versions (AXBT) are also used; these use radio frequencies to transmit the data to the aircraft during deployment. Today Lockheed Martin Sippican has manufactured over 5 million XBTs. A rendering of an XBT probe.",
    "textAfterTable": "Participation by Month of Country and Institutions deploying XBTs[edit] Below is the list of XBT deployments for 2013:[9] Cntry/Month JAN FEB MAR APR MAY JUN JUL AUG SEP OCT NOV DEC Total AUS 233 292 241 277 311 397 278 313 316 208 232 262 3360 AUS/SIO 97 59 0 0 55 100 0 52 0 105 55 182 705 BRA 0 46 0 35 0 48 0 46 0 48 5 40 268 CAN 16 53 32 38 73 130 146 105 10 72 54 40 769 FRA 2 42 258 93 47 71 301 7 62 0 51 206 1140 GER 38 21 0 0 0 0 0 0 0 0 0 0 59 ITA 29 0 54 38 27 30 0 0 40 16 26 29 289 JPN 58 25 41 57 81 94 74 115 34 67 99 37 782 USA/AOML 477 477 773 2 812 341 559 634 456 436 235 396 5598 USA/SIO 788 87 607 240 350 591 172 300 382 525 104 477 4623 ZA 84 144 0 0 0 0 0 0 0 0 26 84 338 USA/Others 0 0 0 0 0 0 12 39 10 0 0 0 61",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}