{
    "relation": [
        [
            "SACKS",
            "2009",
            "2010",
            "2011",
            "2012",
            "TOTAL"
        ],
        [
            "g",
            "13",
            "13",
            "11",
            "12",
            "49"
        ],
        [
            "ua",
            "1",
            "0",
            "3",
            "3",
            "7"
        ],
        [
            "a",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "total",
            "1.0",
            "0.0",
            "3.0",
            "3.0",
            "7.0"
        ],
        [
            "yards",
            "8",
            "0",
            "15",
            "31",
            "54"
        ]
    ],
    "pageTitle": "Michael Clay - GoDucks.com - The University of Oregon Official Athletics Web Site",
    "title": "",
    "url": "http://www.goducks.com/ViewArticle.dbml?DB_OEM_ID=500&ATCLID=204773762",
    "hasHeader": true,
    "headerPosition": "NONE",
    "tableType": "RELATION",
    "tableNum": 11,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988305.14/warc/CC-MAIN-20150728002308-00174-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474119299,
    "recordOffset": 474093873,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{42427=- Clay Featured For Volunteer Work at Boys and Girls Club of Emerald Valley 2012 — Named to the watch list for Lombardi Award (lineman or linebacker) … Third consecutive week leading the team in tackles with 10 stops in win at Oregon State … Recorded a career-high and game-high 20 tackles, including 1.5 tackles for a three-yard loss and also had a quarterback hurry in loss vs. Stanford … Had a team-high 11 stops at California … Credited with seven tackles (six solo) in win at USC … Made four stops, including 2.0 tackles for a two yard loss in victory over Colorado … Tied for a team-high six solo tackles, including 1.0 tackles for a two-yard loss in win at Arizona State … Recorded a team-high eight tackles along with 1.0 tackles for a 14-yard loss in win vs. Washington State … Game-high 13 tackles with 2.0 TFLs for a 10-yard loss, including a sack for an eight-yard loss and forced one fumble in victory vs. Arizona … Earned Pac-12 Player of the Week on defense for his performance vs. the Wildcats … Had one pass breakup and made two tackles in win vs. Tennessee Tech …  Made seven stops, including 0.5 TFL and one quarterback hurry in victory over Fresno State … Recovered one fumble and had three solo stops in win vs. Arkansas State. 2011 — Team’s second-leading tackler overall with 102 stops (54 solo) ranked second in Pac-12 in tackles per game at 8.9 … Recorded a career-high 13 tackles, including 2.0 TFL for a loss of four yards and recovered a fumble that sealed the win for the Ducks vs. Wisconsin in the Rose Bowl … Six tackles, including four solo tackles and a career-high two sacks for a total loss of six yards vs. UCLA in the Pac-12 Championship Game … Also forced and recovered a fumble against the Bruins … Had back-to-back team-highs of 12 tackles in win vs. Oregon State and loss to USC … Also had an interception against the Beavers … Game-high (tie) 11 tackles, including eight solo in victory at Stanford … Recorded six tackles, including 1.5 for loss in win at Washington … Had a game-high 12 tackles, including one tackle for a loss of one yard in victory vs. Washington State … Scored first touchdown of his career on a 32-yard interception and also had two tackles in win at Colorado … First game back after missing three games due to injury, recording seven tackles and a pass breakup in win vs. Arizona State … Had a game-high 12 tackles, including a career-high 2.0 TFL for a total loss of 17 yards and a sack in win vs. Nevada … Forced a fumble and recorded nine tackles in loss against LSU … Pac-12 all-academic honorable mention … Finished the shuttle in 3.96 seconds to lead all linebackers during winter conditioning … Also finished second in the “L run” (7.02) and the electronic 20-yard dash (2.86)., 47133=BEFORE OREGON— A two-time all-Mercury News first-team selection … A Tacoma News Tribune Northwest 100 selection … Played fullback and linebacker for head coach Mike Janda at Bellarmine Prep of the West Catholic League … Named the No. 4 linebacker in California by Superprep Magazine … Was named the West Catholic League Linebacker of the Year in 2008 with 81 tackles, seven sacks and four picks and again in 2007 after tallying 110 tackles in his junior season … 2008 GoldenStatePreps all-Northern California first-team Defense … Named a four-star recruit and the nation’s No. 14 weakside linebacker by Scout.com and a three-star recruit and the country’s No. 3 outside linebacker by Rivals.com … High School team went 12-1 in his senior season, with a 21-0 shutout victory against Valley Christian in the Central Coast Section Championship game … Bellarmine limited opponents to just 111 points on the season., 45516=2010 — Team’s top reserve linebacker … Pac-10 all-Academic honorable mention … Eighth overall and third among LBs with 42 tackles … Four solo tackles in BCS Championship vs. Auburn … Rushed for 64 yards on a fake punt, had an interception and two tackles at Oregon State … Four solo stops in win vs. Arizona … Three tackles in victory at Cal … Had a pair of tackles vs. Washington and one at USC … Career-high seven tackles in win vs. UCLA … Two stops at Washington State … Made three tackles vs. Stanford and one at Arizona State … Had four stops and recovered a fumble in win vs. Portland State … Made five tackles, including 0.5 TFL in win at Tennessee … Recorded four tackles vs. New Mexico … Second fastest at his position in the 20-yard dash (2.87 electronic) and shuttle run (3.95) during winter testing. 2009 — Forced coaches to take a look at him as one of team’s long snappers, but has since made his way onto the field as a reserve linebacker … One of the Ducks’ three true freshmen to experience game action, was the recipient of the team’s Len Casanova Award  as the first year player who best exemplifies ideals of competitiveness, team inspiration and outstanding performance … Snapped for all of Oregon’s punting situations in addition to accumulating 32 tackles, including two tackles for loss and one quarterback sack (8 yards) …Team’s co-leader with five tackles vs. Washington State, accumulated four stops the following week at UCLA, as well as at Arizona., 48412=  HONORS AND AWARDS 2010 •Pac-10 all-Academic Honorable Mention 2009 •Team First-Year Player of the Year (Casanova), 48125=PERSONAL — Born Michael Vincent Clay in Santa Clara, Calif. Parents: Rodney Clay and Sandra Ramirez. Family: One sister. High School (Coach): Bellermine College Prep (Mike Janda) 2009. Major: Pre-Business.}",
    "textBeforeTable": "- Clay Featured For Volunteer Work at Boys and Girls Club of Emerald Valley 2012 — Named to the watch list for Lombardi Award (lineman or linebacker) … Third consecutive week leading the team in tackles with 10 stops in win at Oregon State … Recorded a career-high and game-high 20 tackles, including 1.5 tackles for a three-yard loss and also had a quarterback hurry in loss vs. Stanford … Had a team-high 11 stops at California … Credited with seven tackles (six solo) in win at USC … Made four stops, including 2.0 tackles for a two yard loss in victory over Colorado … Tied for a team-high six solo tackles, including 1.0 tackles for a two-yard loss in win at Arizona State … Recorded a team-high eight tackles along with 1.0 tackles for a 14-yard loss in win vs. Washington State … Game-high 13 tackles with 2.0 TFLs for a 10-yard loss, including a sack for an eight-yard loss and forced one fumble in victory vs. Arizona … Earned Pac-12 Player of the Week on defense for his performance vs. the Wildcats … Had one pass breakup and made two tackles in win vs. Tennessee Tech …  Made seven stops, including 0.5 TFL and one quarterback hurry in victory over Fresno State … Recovered one fumble and had three solo stops in win vs. Arkansas State. 2011 — Team’s second-leading tackler overall",
    "textAfterTable": "TOTAL 49 1 64 0 64 64.0 1.3   TOTAL OFFENSE g rush pass total avg/g 2009 13 0 0 0 0.0 2010 13 64 0 64 4.9 2011 11 0 0 0 0.0 2012 12 0 0 0 0.0 TOTAL 49 64 0 64 1.3   SCORING g td rush rcv ret pat 2pat fg total avg/g 2009 13 0 0 0 0 0 0 0 0 0.0 2010 13 0 0 0 0 0 0 0 0 0.0 2011 11 1 0 0 1 0 0 0 6 0.5 2012 12 0 0 0 0 0 0 0 0 0.0 TOTAL 49 1 0 0 1 0 0 0 6 0.1   KICK",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}