{
    "relation": [
        [
            "",
            "2011-12",
            "2012-13",
            "2013-14",
            "2014-15",
            "Total"
        ],
        [
            "gp",
            "30",
            "29",
            "33",
            "34",
            "126"
        ],
        [
            "gs",
            "26",
            "28",
            "33",
            "34",
            "121"
        ],
        [
            "min",
            "943",
            "1060",
            "1119",
            "1219",
            "4341"
        ],
        [
            "off",
            "29",
            "48",
            "33",
            "28",
            "138"
        ],
        [
            "def",
            "70",
            "92",
            "115",
            "104",
            "381"
        ],
        [
            "reb",
            "99",
            "140",
            "148",
            "132",
            "519"
        ],
        [
            "pf",
            "87",
            "69",
            "80",
            "71",
            "307"
        ],
        [
            "dq",
            "1",
            "1",
            "0",
            "1",
            "3"
        ],
        [
            "ast",
            "138",
            "159",
            "177",
            "178",
            "652"
        ],
        [
            "to",
            "77",
            "82",
            "88",
            "88",
            "335"
        ],
        [
            "a/to",
            "1.8",
            "1.9",
            "2.0",
            "2.0",
            "1.9"
        ],
        [
            "stl",
            "31",
            "39",
            "49",
            "63",
            "182"
        ],
        [
            "blk",
            "6",
            "5",
            "4",
            "3",
            "18"
        ]
    ],
    "pageTitle": "John Jordan - Texas A&M-Corpus Christi Athletics",
    "title": "",
    "url": "http://www.goislanders.com/sports/mbkb/2014-15/bios/jordan_john_h0t0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00162-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475938139,
    "recordOffset": 475914922,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28921=2014-15 (SENIOR): Was named First Team All-Southland for the second straight year as well as NABC All-District and a Lou Henson Mid-Major All-American … set new school single-season records in assists (178) and minutes (1,220) … averaged 15.6 points, 3.9 rebounds and 5.2 assists on the season … placed in the national top 10 in free throws made (10th, 186) and attempted (2nd, 283) … finished 25th nationally in total minutes and 26th in total assists … placed 58th in the nation in steals per game … 63 steals were the third-most in a single season by an Islanders player, while 532 points were fifth … finished his career as the only active player in Division I with more than 1,500 points, 500 assists and 500 rebounds … only the second Southland player ever (Devin Gibson, UTSA) to accomplish that feat … posted 14 points and five assists to become the school’s all-time leader in dimes against MVSU (11/28) … scored 21 points on 7-of-12 shooting against UTSA (12/15) … delivered 17 points, nine assists and six rebounds at CSUN (12/20) … posted a season-best 22 points on 9-of-14 shooting at Fullerton (12/22) … bested that in the conference opener, with 23 points at UCA (1/6), going 13-for-16 at the line … added 22 points and eight dimes in 40 minutes against McNeese State (1/10) … led the team with 18 points at Nicholls (1/17) … scored 22 points and matched a career high with 11 assists against Northwestern State (1/20) … scored 18 on 7-of-13 shooting at Southeastern La. (1/26) … scored 19 points, including the tying three and the go-ahead two, to go with 10 assists against Incarnate Word (2/3) … scored 18 points with seven rebounds and six assists to break the Islanders’ career scoring record at HBU (2/9) … led the team in every category with 19 points, eight boards, six assists, three steals and a block against SHSU (2/28) … posted 20 points with five assists against HBU (3/5) … posted 22 points and five steals against UNO (3/12) … finished with 20 points, five assists and five boards against SHSU (3/13) … made it three straight with 20, adding seven dimes and three steals at FGCU (3/18) … wrapped up his career with 14 points, six assists and three steals against Kent State (3/23)., 33239=2012-13 (SOPHOMORE): Played in all 29 games and started the final 28 … set a school record with his 159 assists and 1,060 minutes played … averaged 12.8 points, 4.8 rebounds and 5.4 assists … was named Southland Conference Honorable Mention … posted three double-doubles on the season … scored 13 points to go with seven rebounds and four assists vs. Texas Lutheran (11/10) … had 10 points, four assists and two steals at Denver (11/14) … delivered 13 points and six assists at Utah State (11/17) … filled the stat sheet with eight points, nine rebounds, seven assists and three steals against Houston (11/25) … scored a career-high 22 points at Toledo (11/28) … added 13 points and three assists at Iowa (12/1) … scored 17 points and dished out five assists (12/16) … had six assists in 40 minutes against UTSA (12/21) … scored 17 points in the game with SFA (12/29) … netted 17 points and dished out nine assists at McNeese (1/10) on the strength of 12 free throws … posted a double-double with 15 points and 11 assists at Lamar (1/12) … scored 18 points to go with five assists at Nicholls (1/24) … posted a new career-high with 24 points and 10 rebounds against Southeastern La. (1/26) … made it back-to-back double-doubles with 17 points and 11 rebounds against Sam Houston State (2/2) … scored 20 points at Oral Roberts (2/16) … went 8-for-9 from the field for 21 points against Southeastern La. (2/28) … posted 16 points and nine assists against Nicholls (3/2)., 31253=2013-14 (JUNIOR): Had one of the best all-around seasons in program history, earning First Team All-Southland honors and Second Team All-District 23 recognition … was named the Athletics Department’s Male Athlete of the Year … averaged 14.5 points, 4.5 rebounds and 5.4 assists … was second in the Southland and 34th nationally with his 5.4 dimes per game … set a new school record for the third consecutive year in assists, posting 177 … also finished seventh in the league with his 1.5 steals per game … averaged 33.9 minutes, fourth in the Southland … posted 10 games with 20 points or more and 25 with 10 points or more … went for 21 points, six assists and six rebounds against Huston-Tillotson (11/8) … scored a career-high 28 points with four rebounds and three assists against IPFW (11/15), hitting the game-winning shot with 4.2 seconds left … added 18 points, nine rebounds and three assists against Tennessee Tech (11/16) … posted a season-best seven assists against Texas-Pan American (11/17) … scored 19 points to go with six assists and five rebounds at Houston (11/30) … netted 25 points along with five assists and five rebounds against UTPB (12/8) … went for 18, 8 and five against Cal State Northridge (12/20) … scored 21 points to go with six assists and four steals at Central Arkansas (1/2) … posted 22 points, eight boards and four assists against Northwestern State (1/9) … added 24 points and seven assists against Stephen F. Austin (1/11) … dished out season-high nine assists against Southeastern (1/23) … scored 20 points and added seven assists in a losing effort against New Orleans (1/25) … went for 20 points, nine assists and eight rebounds at Abilene Christian (2/8) … scored 22 points and added nine assists against Oral Roberts (2/15) … netted 10 points against McNeese (3/6) to surpass 1,000 for his career … dished out eight assists in the season finale at Pacific (3/22)., 35070=2011-12 ( FRESHMAN): Played in all 30 games and made 26 starts … set a new school record with his 138 assists on the season … averaged 6.5 points and 3.3 rebounds as the team’s point guard … also had 31 steals and shot 42.3 percent from the field … had five points and eight rebounds in the exhibition against Incarnate Word (11/5) … had six points, five boards and three assists against Oklahoma State (11/11) … went 3-for-3 from the field and 6-for-8 from the line against Denver (11/14), adding three steals … had four assists and two steals in the win over Utah State (11/22) … delivered four assists and seven rebounds at Texas A&M (11/26) … dished out six assists against Texas Tech (12/1) … filled the stat sheet with eight points, seven rebounds, five assists and three steals at Houston (12/3) … matched career high with six dimes at West Virginia (12/17) … career-high four steals, seven points, four boards and three assists at Rice (12/28) … netted a career-best 13 points against Lamar (1/4) … had career-best nine assists against McNeese (1/7) to go with 11 points and four boards in 38 minutes … had six assists to no turnovers at Southeastern La. (1/14) … delivered nine assists, matching his career best, against UT Arlington (1/18) … scored career-best 14 points and added five assists and two steals at Sam Houston State (1/21) … had nine points and seven assists against Stephen F. Austin (1/28) … posted nine assists without a turnover against Sam Houston State (2/11) … had 12 points and 10 assists against UTSA (2/22) for his first career double-double … scored 10 points, including the game-winning basket, against Central Arkansas (3/3)., 37341=PERSONAL: Johnathan D. Jordan was born on Oct. 7, 1992, in Houston … has two siblings, Darnell and Anaiah … parents are Sandra and Johnny Jordan … intends to major in sport management.}",
    "textBeforeTable": "John Jordan 10 10 Related Bios Hameed Ali Ehab Amin David Bloom Jelani Currie Bryce Douvier Dale Francis Viktor Juricek Joe Kilgore Cole Martinez Paul Perez Brandon Pye Rashawn Thomas Emmanuel Toney T.J. Traylor }); }); $(this).toggleClass('active').next('ul').toggleClass('active'); $('.secondary-nav > h1').click(function() { $(function() { })(jQuery); }); }); return false; $('html').removeClass('nav-active'); $('#nav .close').click(function(e) { }); $('html').toggleClass('nav-active'); e.preventDefault(); $('#jump-to-nav').click(function(e) { $(function() { (function($) { })(jQuery); }); }); $('.has-submenu.active').removeClass('active'); $(document).on('click', function(e) { }); return false; $(this).parent().toggleClass('active'); $('.has-submenu > a', '#nav').on('click', function() { }); return false; $('#nav').removeClass('active'); $('#jump-to-nav').removeClass('active'); $('#nav .close').click(function(e) { }); $('#nav').toggleClass('active'); $(this).toggleClass('active'); e.preventDefault(); $('#jump-to-nav').click(function(e) { $(function() { (function($) {",
    "textAfterTable": "Mar 5 Houston Baptist W, 85-72 Mar 7 Abilene Christian W, 58-27 Mar 12 vs. University of New Orleans W, 61-58 Mar 13 vs. Sam Houston State L, 70-67 Mar 18 at FGCU W, 75-69 Mar 23 Kent St. L, 69-65 Statistics category Overall Conf Games 34 18 Games started 34 18 Minutes 1219 651 Minutes per game 35.9 36.2 FG 167-373 90-197 FG Pct 44.8 45.7 3PT 12-42 10-27 3PT Pct 28.6 37.0",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}