{
    "relation": [
        [
            "Phone model",
            "Sony Ericsson T68i",
            "Sony Ericsson T100",
            "Sony Ericsson T105",
            "Sony Ericsson T200",
            "Sony Ericsson T206",
            "Sony Ericsson T230",
            "Sony Ericsson T250",
            "Sony Ericsson T270",
            "Sony Ericsson T280",
            "Sony Ericsson T290",
            "Sony Ericsson T300",
            "Sony Ericsson T303",
            "Sony Ericsson T310",
            "Sony Ericsson T600",
            "Sony Ericsson T606",
            "Sony Ericsson T608",
            "Sony Ericsson T610",
            "Sony Ericsson T630",
            "Sony Ericsson T650",
            "Sony Ericsson T700",
            "Sony Ericsson T707",
            "Sony Ericsson T715"
        ],
        [
            "Screen type",
            "Color",
            "Monochrome",
            "Monochrome",
            "Monochrome",
            "Monochrome",
            "Color",
            "Color",
            "Color",
            "Color",
            "Color",
            "Color",
            "Color",
            "Color",
            "Color",
            "Color",
            "Color",
            "Color",
            "Color",
            "Color",
            "Color",
            "Color",
            "Color"
        ],
        [
            "Released",
            "2002",
            "2002",
            "2002",
            "2002",
            "2003",
            "2003",
            "2007",
            "2008",
            "2008",
            "2004",
            "2002",
            "2008",
            "2003",
            "2002",
            "2003",
            "2003",
            "2003",
            "2004",
            "2007",
            "2008",
            "2009",
            "2009"
        ],
        [
            "S",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D",
            "D[7]"
        ],
        [
            "Technology/Frequency",
            "GSM",
            "GSM",
            "GSM",
            "GSM",
            "CDMA, AMPS",
            "GSM",
            "GSM",
            "GSM",
            "GSM",
            "GSM",
            "GSM",
            "GSM",
            "GSM",
            "GSM",
            "CDMA, AMPS",
            "CDMA, AMPS",
            "GSM",
            "GSM",
            "GSM, UMTS",
            "GSM, UMTS",
            "GSM, UMTS",
            "GSM, UMTS"
        ],
        [
            "Form factor",
            "Candybar",
            "Candybar",
            "Candybar",
            "Candybar",
            "Candybar",
            "Candybar",
            "Candybar",
            "Candybar",
            "Candybar",
            "Candybar",
            "Candybar",
            "Slider",
            "Candybar",
            "Candybar",
            "Candybar",
            "Candybar",
            "Candybar",
            "Candybar",
            "Candybar",
            "Candybar",
            "Clamshell",
            "Slider"
        ],
        [
            "Camera",
            "Accessory (MCA-25 CommuniCam)",
            "None",
            "None",
            "Accessory[citation needed]",
            "None",
            "None",
            "VGA",
            "None",
            "1.3-megapixel",
            "None",
            "Accessory",
            "1.3-megapixel",
            "None",
            "None",
            "Accessory",
            "Accessory",
            "CIF",
            "VGA",
            "3.2-megapixel",
            "3.2-megapixel",
            "3.2-megapixel",
            "3.2-megapixel"
        ]
    ],
    "pageTitle": "List of Sony Ericsson products - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Sony_Ericsson_W705",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 856598647,
    "recordOffset": 856567216,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{80056=The first Entertainment Unlimited Phones were announced and launched in 2009, creating a new category where the benefits of Audio and Images were combined in smart, good-looking and high-performing devices. Apart from first-rate Audio-Visual strength, what these products have in common are differentiating factors in the User Interface, borrowing from the wider Sony Group UI-developments. Aino is the first product that connects into the world of the Sony PlayStation remotely via remote media play. Vivaz is the first Sony Ericsson phone supporting High Definition (HD) video capture., 14069=The Sony Ericsson C902 was released during the second quarter of 2008. It is a java based feature device running on Sony Ericsson's proprietary A200 platform. A special feature was the presence of 8 touch sensitive keys using capacitive technology for the camera mode. The camera technology includes face detection and the music player is similar to the system used on the company's \"Walkman\" series handsets. The phone is the first in Sony Ericsson's new 'Cyber-shot' C-series of phones, designed to be a successor to the popular K800i and the K850.[1] The C902 is featured in the James Bond film Quantum of Solace, and has been praised for its user interface[1] design and its build quality.[2] Although the device received favourable reviews, analysts did not expect it to reach the same level of popularity or sales as its predecessor, the K800i, because it was not intended to be a \"flagship model.\"[3], 20103=The Sony Ericsson G700 was announced at the Mobile World Congress (formerly 3GSM congress) February 2008 and is based on the Symbian OS 9.1 UIQ 3.0 platform.[4] The handset has had below average reviews, with a lot of reviewers criticizing the phone for being priced too high as the better equipped G900 is in the same price bracket while others have lamented the fact that Sony Ericsson chose to implement the same technology that had been presented in late 2006 in the P1.[5], 21102=Announced at the 2008 Mobile World Congress (formerly 3GSM congress) in February of that year, G900 is a mid-to-high-end smartphone based on the Symbian 9.1 UIQ 3.0 platform. The phone sports high quality sound, 3G, Wi-Fi, and a clear 5.0-megapixel camera.[6]}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "C Series: Cyber-shot[edit] S = Status, where P indicates under production, D is discontinued and U indicates upcoming . Phones in boldface indicates that the phone is a smartphone. International phones[edit] 12 External links 11 References 10 See also 9 Other products 8 Bluetooth watches 7 Bluetooth handsfree 6 PC Cards or USB mobile modems 5 Sony Ericsson Japan Phones 4.4 TU-KA 4.3 SoftBank Mobile (previously as Vodafone and J-Phone) 4.2 NTT DoCoMo 4.1 au by KDDI (previously as IDO and DDI Cellular) 4 Sony Ericsson mobile phones for Japan market 3 Features 2 Overview 1.15 Greenheart Phones 1.14 Entertainment Unlimited Series: Entertainment phones 1.13 Z Series: Clamshell phones 1.12 X Series: Xperia phones 1.11 W Series:",
    "textAfterTable": "GSM Candybar VGA Sony Ericsson K300 Color 2004 D GSM Candybar VGA Sony Ericsson K310 Color 2006 D GSM Candybar VGA Sony Ericsson K320 Color 2006 D GSM Candybar VGA Sony Ericsson K330 Color 2008 D GSM Candybar VGA Sony Ericsson K500 Color 2004 D GSM Candybar VGA Sony Ericsson K510 Color 2006 D GSM Candybar 1.3-megapixel Sony Ericsson K530 Color 2007 D GSM, UMTS Candybar 2-megapixel Sony Ericsson K550 Color 2007 D GSM Candybar 2-megapixel Sony Ericsson K600 Color 2005 D GSM, UMTS Candybar 1.3-megapixel Sony Ericsson K610 Color 2006 D GSM, UMTS Candybar 2-megapixel Sony Ericsson K630 Color 2007 D GSM, HSDPA Candybar 2-megapixel Sony Ericsson K660 Color 2008 D GSM, HSDPA Candybar 2-megapixel Sony Ericsson K700 Color 2004 D GSM Candybar VGA Sony Ericsson K750 Color 2005 D GSM Candybar 2-megapixel Sony Ericsson K770 Color 2007 D GSM,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}