{
    "relation": [
        [
            "CONCERN",
            "IWN partnership",
            "Disparate component funding",
            "IWN program delays",
            "Availability of IWN funding",
            "Acquisition process increasing IWN costs",
            "Loss of focus on tactical communications",
            "Security of commercial solution",
            "Adequacy of legacy communication systems",
            "Dangerous “work arounds”"
        ],
        [
            "ATF",
            "X",
            "",
            "X",
            "X",
            "X",
            "",
            "",
            "",
            ""
        ],
        [
            "DEA",
            "X",
            "X",
            "X",
            "X",
            "X",
            "X",
            "X",
            "X",
            "X"
        ],
        [
            "FBI",
            "X",
            "X",
            "X",
            "X",
            "X",
            "X",
            "X",
            "X",
            "X"
        ],
        [
            "USMS",
            "X",
            "X",
            "X",
            "",
            "",
            "X",
            "",
            "X",
            ""
        ]
    ],
    "pageTitle": "OIG Audit Report 07-25",
    "title": "",
    "url": "https://oig.justice.gov/reports/OBD/a0725/findings.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00232-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 866066447,
    "recordOffset": 866046527,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Audit Report 07-25 March 2007 Office of the Inspector General}",
    "TableContextTimeStampAfterTable": "{11956=According to the DOJ CIO, while the DHS supports IWN, the DHS has not always lived up to its commitments to the IWN project, in part because DHS components receive independent funding for their wireless communications needs. The DOJ CIO stated that this makes it more difficult for the DOJ to obtain cooperation and compliance because narrowband conversion funds are not centrally managed and distributed by DHS, as is the case in the DOJ. At a May 2006 Department Investment Technology Review Board meeting, the Deputy Attorney General expressed concern that this disparate funding structure is encouraging inefficiencies and resulting in a lost opportunity to create a truly integrated network.44, 41157=When the Narrowband Communications Account was created in 1998, one of the primary concerns expressed in the appropriations language was the need to increase efficiency and savings through shared infrastructure and common procurement strategies. The 2002 IWN cost model estimated approximately $1.19 billion in additional investment costs if the departments do not collaborate and instead developed their own tactical communications solutions., 7535=Moreover, the DHS Wireless Management Office Director told us in March 2006 that DHS officials do not believe funding will be available for DHS and DOJ to implement the new nationwide replacement system using the same design demonstrated by the Seattle/Blaine Pilot Project., 36904=For example, the Department’s components have been able to establish some measure of interoperability among themselves and with state and local law enforcement organizations in specific law enforcement operations by using the current antiquated systems. But the process is not seamless and requires significant planning. During the Washington, D.C., area sniper shootings in 2002, federal, state, and local law enforcement agencies needed to communicate in order to respond and relocate quickly. This required interoperability between communications systems operating in several different frequency bands, and adherence to the federal requirement that radios be programmed with encryption keys., 43401=As shown in the following table, DOJ is one of the largest users of the very high frequency radio spectrum, with more than 14,000 frequency assignments. As of November 2005, approximately 70 percent of the radio frequencies assigned to DOJ were used for tactical communications support, which is critical to agent safety and operational effectiveness. The following table shows federal agency rate of compliance with the narrowband mandate., 9202=As the graph demonstrates, over the past 7 years almost two-thirds of the money in the DOJ’s Narrowband Communications Account has funded the maintenance of existing legacy systems instead of new wireless solutions. Since the inception of the Narrowband Communications Account in FY 2000, the cost of operating and maintaining legacy communications has been between 38 percent and 80 percent of the total program costs for a single fiscal year. In FY 2004, legacy costs accounted for $52.5 million of the total program cost of $ 137.6 million, while in FY 2001 legacy costs accounted for $ 89.2 million of the total program cost of $ 111.5 million. According to estimates from the Wireless Management Office, operating and maintenance costs for legacy systems are expected to increase by 5 percent annually. At that rate, by FY 2008 legacy systems operations and maintenance costs will consume 72 percent of the Narrowband Communication s Account at the current funding level ., 47697=WAIVERS GRANTED BY NTIA TO IWN PARTNERS DURING CALENDAR YEARS 2005 AND 2006, 42455=As noted earlier, as new wireless technologies and applications have developed, the demand for spectrum-based services has increased and efficient use of the radio frequency spectrum has become critical. Therefore, under instruction from Congress in October 1993 to manage the radio frequency spectrum more efficiently, the NTIA mandated that land mobile radio systems operating at very high frequencies and ultra high frequencies convert to narrowband channel bandwidth communications systems by January 1, 2005, and January 1, 2008, respectively., 6924=Through FY 2006, approximately $772 million has been appropriated to fund the DOJ Narrowband Communications Account. However, since FY 2000, the enacted appropriation for IWN has been consistently less than the DOJ Wireless Management Office budget request. For FY 2007 and FY 2008, the DOJ Wireless Management Office request has increased in anticipation of the IWN contract awards. DOJ officials told us, however, that they expect to receive approximately 50 percent of their requested funding. The DOJ CIO told us that the current level of IWN funding is not sufficient to implement IWN nationwide., 48309=However, in September 2006, NTIA’s Frequency Assignment Subcommittee approved a change to the NTIA Manual that eliminates the waiver provision and directs the Subcommittee to adjudicate only unresolved conflicts between agencies involving overlapping narrowband and wideband operations., 11545=An example of this approval process occurred in 2004 when the FBI requested replacement of its Las Vegas, Nevada, field office radio system. Because the FBI demonstrated that the system was failing, the Wireless Management Office approved and funded replacement of the old legacy system. The new system is a very high frequency, narrowband compliant system that meets the Advanced Encryption Standard., 13970=Our audit also found strong indications that the IWN partnership is fractured. It appears that the DOJ and DHS are pursuing separate wireless communications solutions instead of a single joint solution. The current MOU between DOJ, DHS and Treasury requires the departments to collaborate annually on a joint budget submission to request funding for the IWN program. For FYs 2005 through 2007, the departments collaborated on and submitted joint Office of Management and Budget Exhibit 300s. However, for FY 2008, DOJ and DHS submitted separate Office of Management and Budget Exhibit 300s for IWN. In our judgment, such a significant departure from the current MOU calls into question the nature of the IWN partnership., 6191=NARROWBAND COMMUNICATIONS ACCOUNT BUDGET SUMMARY FY 2000 – 2008, 19592=The June 2004 MOU assigns the governance of the IWN project to the IWN Executive Board. The IWN Executive Board is composed of the CIOs from DOJ, DHS, and Treasury. The IWN Executive Board has the authority to review and approve all key business and policy issues related to the implementation and management of the IWN program, including budgets, system deployment priorities, and program management issues such as acquisition strategy, overall concepts of operation, and security policies. The IWN Executive Board is also responsible for overseeing and evaluating the program management activities of the Joint Program Office. The MOU requires that decisions by the IWN Executive Board be made by consensus., 16011=In October 2006, the DHS CIO told us that DHS is fully committed to the IWN program and has demonstrated its commitment by contributing staffing and funding resources.47 The DHS CIO also told us that DHS is consolidating its existing networks into a primary communications infrastructure called OneNet, similar to the DOJ’s JUTNet, and expects all DHS networks to be operating on OneNet within a year.48, 2790=We also found that the lengthy IWN development and implementation process that began in 2001 has left DOJ components waiting for upgraded communications equipment. DOJ components still conduct their law enforcement and counterterrorism operations with aging equipment that does not meet current encryption standards. As a result of the amount of time it has taken to move forward with IWN, the DOJ has also spent increasingly significant amounts of money to maintain its legacy communications systems, thereby depleting available funding for IWN., 38732=OBSOLETE DOJ COMPONENT LEGACY LAND MOBILE RADIO SYSTEM SITES50 As of September 2006, 43013=By 2004, several federal agencies were advising the NTIA that they would not be able to meet the January 1, 2005, deadline for converting their very high frequencies to narrowband operations. DOJ was one of the departments that reported it would not meet the deadline, citing the lack of suitable equipment and encryption capability as part of the reason for its non-compliance., 7819=We asked for an estimate of the total amount of IWN project costs from the DOJ Wireless Management Office Administrative Officer. Although the DOJ Wireless Management Office has assumed the responsibility for managing the Joint Program Office, we were advised by the DOJ Wireless Management Office Administrative Officer that an estimate of total IWN project costs is not available because DHS costs are not reported to the Joint Program Office. We also requested this information from DHS in April 2006 and again in October 2006, but DHS did not provide this data. As a result, the following chart illustrates only the costs incurred by DOJ, through September 30, 2005, for IWN-related projects and equipment, and for operation and maintenance of existing DOJ legacy communication systems., 16482=However, in addition to the separate Office of Management and Budget Exhibit 300 submissions and the ongoing MOU negotiations, recent decisions made by the DHS provide further indications that the partnership is fractured. For example, in March 2006 the DHS CIO decided to relocate most of the DHS staff assigned to the Joint Program Office to DHS Headquarters. The DHS CIO told us that the decision was an internal business decision and was reached for economic and organizational efficiency reasons. This official stated that the relocated staff were still assigned to the Joint Program Office, but just were working from a different location. The DHS Wireless Management Office Director expressed the opinion that a joint program office, as it currently exists, probably will not be needed. Instead, he suggested that the relevant agencies create joint teams at the project level, either physically or virtually. In our view, these actions are consistent with DHS’s preferred approach of implementing unique solutions in specific locations rather than furthering the development of a joint, nationwide project with DOJ and Treasury., 47198=The Chief of the Spectrum Support Division of the Office of the Spectrum Management at NTIA told us that for calendar years 2005 and 2006, agencies that had not met the narrowband requirement were allowed to request waivers to continue protected wideband operations on the frequencies subject to the NTIA mandate. The Chief of the Spectrum Support Division said that during the past 2 years NTIA had received and granted tens of thousands of waiver requests.52, 4978=IWN is currently one of the most expensive items in the Department’s Information Technology Investment Portfolio. The DOJ life cycle costs for IWN through 2021 are projected to exceed $2.5 billion. 42 During our audit, the DOJ CIO told us that without a major increase in funding the IWN program will not be completed. The DOJ Deputy CIO for Information Sharing told us that if IWN is not implemented, DOJ will still need to invest about $900 million to replace legacy communications equipment, such as mobile and hand‑held radios, repeaters, and base stations that IWN was intended to upgrade. The DOJ CIO also noted that while replacing legacy equipment with new equipment would solve encryption problems and resolve the narrowband issue, it would not fully address the problem of “stove‑pipe” communications among DOJ components and would only marginally address interoperability. In our judgment, if IWN is not implemented DOJ will miss a critical opportunity to provide more effective communications support to its law enforcement agents in the field., 43851=NARROWBAND COMPLIANCE FOR AGENCIES WITH GREATER THAN 1,000 VERY HIGH FREQUENCY LICENSES51 As of April 18, 2006, 59219=Under the current IWN partnership MOU, DOJ and DHS equally share the design and implementation costs of IWN. Assuming the cost-sharing arrangement continues as the program goes forward, DOJ’s share of the estimated $5 billion in life cycle costs through 2021 is $2.5 billion., 20766=Since the formation of the current IWN partnership in June 2004, DHS has had three Wireless Management Office Directors, and as of October 3, 2006, the position was vacant. We were told that during this same period DHS has had two CIOs and one acting CIO. Furthermore, language in the DHS’s FY 2007 appropriations law established the Office of Emergency Communications and transferred IWN responsibilities to that office. Up to this point, IWN administration has been the DHS CIO’s responsibility, and we are concerned that DOJ will again be faced with the need to revisit previous decisions with new DHS personnel., 12693=The DHS CIO told us that DHS appropriations are not structured the same as DOJ’s and that DHS has separate funding for IWN and for its legacy communications systems. In the joint FY 2006 Office of Management and Budget Capital Asset Plan and Business Case (Exhibit 300), DHS reported its intent to consolidate narrowband conversion funding within DHS in a manner similar to the funding approach used by DOJ. 45 However, in contrast to this document, in October 2006 the DHS CIO told us that DHS does not intend to consolidate narrowband funding of DHS components into a central account. Consequently, the DHS CIO can continue to allocate narrowband conversion resources to individual components, programs, or geographic locations that he believes are in the best interest of the DHS. This allows the DHS CIO to meet the immediate needs of DHS components’ by replacing and upgrading their legacy communications systems while still participating in IWN. DOJ, in contrast, is required to develop an integrated department-wide solution because of the congressional requirement that all wireless communications spending be consolidated and managed by a central office., 33417=AGE OF DOJ COMPONENT LEGACY LAND MOBILE RADIOS SYSTEMS As of September 2006, 6073=The following chart shows DOJ funding for the Narrowband Communications Account from FY 2000 to the present., 41610=The DOJ CIO stated that from a cost perspective, he believes the 2002 IWN cost model estimate of increased costs to build separate systems is not unreasonable. However, in May 2006 the DOJ CIO identified a risk of funding falling substantially short of what is necessary to implement IWN. The mitigation strategies subsequently identified by the DOJ include looking for lower cost alternatives, reducing reliability and security features of the proposed solutions, and providing IWN coverage to only high‑priority areas., 48605=On October 11, 2006, DOJ submitted a waiver request for the 69 percent of its frequency assignments that have not been converted to narrowband. The NTIA Subcommittee rejected DOJ’s waiver request. As a result, beginning January 1, 2007, DOJ will be operating on a non-interference basis on 10,129 frequency assignments. This means that DOJ law enforcement communications on those frequency assignments may be subject to interference from narrowband communications of other agencies and that DOJ will have no basis to request the interfering operation to stop. Further, if DOJ wideband operations interfere with other users’ narrowband operations, DOJ could be required to cease operating on the frequency., 62129=The Secure Border Initiative (SBI) is a comprehensive multi-year plan to secure America’s borders. On September 18, 2006, DHS awarded a contract for information technology services, including telecommunications services, to implement SBInet along the United States northern and southern borders. SBInet is intended to detect and identify illegal entry attempts at U.S. land borders with Mexico and Canada., 8618=DOJ NARROWBAND COMMUNICATIONS ACCOUNT BY PROJECT43 FY 2000 - FY 2006 [Image Not Available Electronically], 21719=Two of the senior managers told us that their questions and concerns about the IWN project have gone unanswered by the IWN Executive Board. DOJ radio program managers from all four components expressed concern regarding the lack of incorporation of component concerns in decisions related to IWN. For example, all four radio program managers told us that the components’ preferred plan was to implement IWN in the Southeastern United States after the Seattle/Blaine Pilot Project was completed. However, in November 2004 the Joint Program Office began requirements analysis for the Southwest Border area and subsequently issued a request for design proposals for the Southwest Border area instead of the Southeastern area. Three of the four DOJ radio program managers attributed this change in the implementation plan to “an attempt to meet” DHS requirements., 15431=In March 2006, the DHS Wireless Management Office Director stated that DOJ appears focused on using trunking technology in a single, nationwide solution.46 However, he said that DHS wants to use the IWN contract or contracts to acquire the necessary supplies and services to implement individual solutions for its priority geographic locations rather than a single, integrated wireless communications solution. In our opinion, this shows DHS’s pursuit of individual solutions rather than a single integrated wireless communications solution., 61833=See Appendix 6 for the waivers granted in 2005 and 2006.}",
    "textBeforeTable": "DOJ SENIOR MANAGERS’ IWN-RELATED CONCERNS Source: OIG Interviews with DOJ radio program managers X X X   Dangerous “work arounds” X X X X Adequacy of legacy communication systems X X X X Security of commercial solution X X X X Deviation from system design concept X X X X Loss of focus on tactical communications X X X X Time consuming acquisition process X X X X Duplication of effort X X X X Changing implementation plans X X X  ",
    "textAfterTable": "Source: OIG interviews with DOJ senior managers Senior managers from the ATF, DEA, FBI, and USMS all expressed concern about IWN program delays. Three of the four senior managers shared the same concerns that were expressed by the radio program managers regarding the nature of the IWN partnership, the loss of focus on tactical communications, and the adequacy of legacy communications systems. Senior managers from the ATF, DEA, and FBI also expressed concern regarding the availability of sufficient funding to complete the IWN project. The DOJ Deputy CIO for Information Sharing told us that the component representatives regularly telephone, e-mail, or meet with the DOJ CIO to discuss their IWN-related concerns. DOJ component representatives also described this process as their method for raising IWN‑related concerns to the IWN Executive Board. However, as demonstrated by the consistency and critical nature of the concerns summarized in the preceding tables, the concerns of the components have not been addressed by the IWN Executive Board. In our judgment, the ultimate beneficiaries of IWN do not have an effective method to contribute to the design and execution of the program. Further, due to their inability to participate in the development and implementation of the IWN, DOJ components are losing confidence in the program. Consequences of IWN Project Failure Failure to upgrade DOJ components’ antiquated communications systems with or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}