{
    "relation": [
        [
            "feature",
            "new zone interaction code",
            "target zone",
            "blast zone",
            "spawn_zone, zone_radius, zone_position",
            "spawn_explosion",
            "respawn_player",
            "add_score_team/player",
            "authentification",
            "edlog",
            "/cmd",
            "chat log",
            "positioning",
            "Experimental AI Control",
            "SVG output"
        ],
        [
            "details",
            "rewrite of bouncing to include time parameter in the bouncing algorythm + extra settings: ball_interacts, ball_kills, ball_team_mode",
            "Zone to give points to the first players to reach it",
            "A zone in which the player tail is erased",
            "Command to interact with zones from console/script",
            "Command to spawn an explosion from console/script",
            "Command to respawn a player from console/script",
            "Command to grant points to team/player from script",
            "several settings to control players joining a game",
            "Extra messages to send information to script via edlog file",
            "send a COMMAND entry to the script",
            "Separate log file for chat to allow a view on the server action from a webpage",
            "Tactical positioning of cycles",
            "The goal was to give some control over bots to be able to create single player games",
            "generate and SVG image of the current game play."
        ],
        [
            "affected files",
            "gWinzone.*",
            "gWinzone.*",
            "gWinzone.*",
            "gwinzone.*, tString.*",
            "gwinzone.*",
            "ePlayer.* or gCycle.*",
            "ePlayer.*, eTeam.*",
            "ePlayer.*",
            "ePlayer.cpp, eTeam.cpp, gGame.cpp, gWinzone.cpp",
            "ePlayer.cpp",
            "ePlayer.*",
            "gCycle.*, gGame.cpp",
            "Files Affected?",
            "???"
        ],
        [
            "Action",
            "To be debug",
            "STABLE INTEGRATE",
            "Experimental. To be debug.",
            "Stable.",
            "Experimental.",
            "Experimental.",
            "Experimental. ACTION?",
            "REPLACE FEATURE",
            "MERGE with ladderlog",
            "Stable. ACTION?",
            "Experimental. ACTION?",
            "Experimental. ACTION?",
            "Experimental. ACTION?",
            "???"
        ],
        [
            "Add to Branch",
            "sty+ct",
            "sty+ct",
            "sty+ct",
            "sty+ct",
            "sty+ct",
            "sty+ct",
            "sty+ct",
            "none",
            "styball first, then arma",
            "sty+ct",
            "sty+ct",
            "sty+ct",
            "sty+ct",
            "sty+ct"
        ]
    ],
    "pageTitle": "Crazy Tronners Wiki - Armahacktron",
    "title": "",
    "url": "https://crazy-tronners.com/wiki/index.php?title=Armahacktron&oldid=2698",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988305.14/warc/CC-MAIN-20150728002308-00155-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 864014467,
    "recordOffset": 864006479,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "the extra features are : To merge features of Armahacktron back into the main armagetron repository (at LINK launchpad.net). CT_voodoo and [User:joda.bot] created this feature list. The list also contains actions to be taken for each feature. If we missed a feature or you think the feature should go to another branch. Please correct the information here. Features So, what can I actually do with it? Running a Server edlog.txt. The additional log file written to by the server. Give lots of extra information. To be read by a script to do all sorts of wonderful things. Edlog Extra settings that have been added The ability to spawn/collape/move/resize zones, either via the console or script. Settings An older source code with sample tables and scripts can be Downloaded here bzr up To update the code move to the 0.2.8-armagetronad-sty+ct directory and use the following  bzr co http://bazaar.launchpad.net/~armagetronad-ct/armagetronad/0.2.8-armagetronad-sty+ct Our current source code is on BZR (bzr >= 1.0)   Source This place is dedicated to trying to document the hacks that have been done to Armagetron Advanced.  Groundpig started it all off with his hacks that included shooting, zombies, styball and capture the Flag.",
    "textAfterTable": "Goal: Add Links or short descriptions to each feature. Possible Target? branches are general feature/\"bug fix\" goes to arma, styball related to styball, all others to CT branch (which will probably be a styball subbranch). Currently voodoo is working on gWinzone, while joda.bot is working on merging ePlayer and eTeam. Retrieved from \" https://crazy-tronners.com/wiki/index.php/Armahacktron\" Views Page Discussion View source History Personal tools Log in Armahacktron About Settings ladderlog.txt Running a Server Trunk Scripting Help Help Wiki",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}