{
    "relation": [
        [
            "Bill #",
            "HB13-1280",
            "HB13-1281",
            "HB13-1282",
            "SB13-230",
            "SB13-231",
            "SB13-233",
            "SB13-234",
            "SB13-235",
            "SB13-236",
            "SB13-237"
        ],
        [
            "Short Title",
            "Target Reserve Req Waiver For Building Reg Fund",
            "Medicaid Management Info System Approp Two Years",
            "Gov May Repay Transfers To Disaster Emergency Fund",
            "2013-14 Long Appropriations Bill",
            "Title IV-E Waiver Demonstration Project",
            "Transfers To General Fund From Repealed Cash Funds",
            "State Prepay Moneys To FPPA Old Hire Pension Plans",
            "Transfer To The Colorado State Veterans Trust Fund",
            "Transfers Of Money Related To Capital Construction",
            "General Fund Reserve Increase"
        ],
        [
            "Sponsors",
            "GEROU / HODGE",
            "GEROU / HODGE",
            "GEROU / LAMBERT",
            "STEADMAN / LEVY",
            "STEADMAN / LEVY",
            "LAMBERT / GEROU",
            "STEADMAN / GEROU",
            "LAMBERT / LEVY",
            "STEADMAN / LEVY",
            "STEADMAN / GEROU"
        ],
        [
            "Bill Summary",
            "Joint Budget Committee. By law, the uncommitted reserves of a cash fund that includes fees set by a state agency may not exceed a target reserve that is equal to 16.5% of the amount expended from the cash fund during the fiscal year. If they do, the state agency is required to adjust the fees as necessary to ensure that the amount of the uncommitted reserves in the cash fund remain at or below the target reserve. Alternatively, a state agency may submit a request for a waiver from the target reserve limitation to the joint budget committee, and the joint budget committee may recommend legislation to grant the request. The bill grants a waiver of the target reserve requirement for the building regulation fund for all uncommitted reserves for the 2012-13 and 2013-14 fiscal years.",
            "Joint Budget Committee. The bill establishes that unexpended and unencumbered moneys from an appropriation in the annual general appropriation act to the department of health care policy and financing (state department) for the medicaid management information system remain available for expenditure by the state department in the next fiscal year without further appropriation. On or before June 30 of each year, the state department is required to notify the state controller of the amount of the appropriation for the current fiscal year that the state department needs to remain available for expenditure for the next fiscal year, and it may not expend more than this amount. The state department must report to the joint budget committee the amount of the appropriation that remains available and the purpose for which the moneys are being used.",
            "Joint Budget Committee. Currently, when the costs of coping with a particular disaster exceed the moneys available in the disaster emergency fund (fund), the governor is authorized to transfer to and expend from the fund moneys that were appropriated for other purposes. The bill allows the governor to repay those transferred moneys when the state receives reimbursements for expenditures for which the moneys were transferred originally.",
            "*** No bill summary available ***",
            "Joint Budget Committee. The bill creates the Title IV-E waiver demonstration project (project) in the department of human services (department). The department is authorized to enter into performance agreements with individual counties or groups of counties for the purpose of the project. The Title IV-E waiver demonstration project cash fund is created. The state board of human services is authorized to promulgate rules for the implementation of the project and is required to submit a report on the outcomes of the project.",
            "Joint Budget Committee. The commission on mandated health insurance benefits cash fund was repealed on July 1, 2010, and the multiple employer welfare arrangement cash fund was repealed on July 1, 2008. The moneys in those funds were prohibited from reverting to the general fund. At the time of their repeal, there were balances in both cash funds. The bill requires the state treasurer to transfer to the general fund the unexpended and unappropriated moneys from these repealed cash funds and any related interest and income. The total of the transfers is $10,651.32.",
            "Joint Budget Committee. For the fiscal year 2013-14, the bill increases the state's contribution to assist in amortizing the unfunded accrued liability of old hire pension plans affiliated with the fire and police pension association by $20 million. In addition, the general assembly may appropriate moneys in the annual general appropriation bill or in supplemental appropriation bills to the old hire plan members' benefit trust fund.",
            "Joint Budget Committee. The bill requires the state treasurer to transfer $3,860,429 from the general fund to the Colorado state veterans trust fund. This transfer repays moneys expended from the trust fund for construction projects to build National Guard armories at Alamosa, Grand Junction, and Windsor.",
            "Joint Budget Committee. For the 2012-13 fiscal year, the bill increases the transfer from the general fund to the capital construction fund from $60,491,314 to $60,911,498. For the 2013-14 fiscal year, the bill transfers $192,566,495 from the general fund to the capital construction fund and $500,000 from the general fund exempt account of the general fund to the capital construction fund.",
            "Joint Budget Committee. Under current law, 4% of the amount appropriated for expenditure from the general fund in a fiscal year must be retained in the fund at the end of the fiscal year as a reserve. But once a personal income trigger occurs, which means that personal income grows by 5% from one calendar year to the next, the amount of the required general fund reserve increases by a one-half percent in each of the following 5 fiscal years. The bill changes the general fund reserve requirement by: * Increasing the reserve to 5% of general fund appropriations for the fiscal years 2012-13 and 2013-14; * Establishing the reserve as 5% of general fund appropriations for all subsequent years until the percentage increases after the personal income trigger occurs; * Eliminating the first 2 fiscal years of reserve increases, because the reserve will already be 5% of general fund appropriations; and * Delaying the remaining 3 fiscal years of one-half percent reserve increases until the third fiscal year that begins after the personal income trigger occurs so that the timing of these increases does not change from existing law."
        ],
        [
            "Most Recent Status",
            "06/05/2013 Governor Action - Signed",
            "05/11/2013 Governor Action - Signed",
            "05/11/2013 Governor Action - Signed",
            "04/29/2013 Governor Action - Signed",
            "05/14/2013 Governor Action - Signed",
            "04/29/2013 Governor Action - Signed",
            "05/10/2013 Governor Action - Signed",
            "06/05/2013 Governor Action - Signed",
            "05/10/2013 Governor Action - Signed",
            "04/29/2013 Governor Action - Signed"
        ],
        [
            "Calendar Notification",
            "NOT ON CALENDAR",
            "NOT ON CALENDAR",
            "NOT ON CALENDAR",
            "NOT ON CALENDAR",
            "NOT ON CALENDAR",
            "NOT ON CALENDAR",
            "NOT ON CALENDAR",
            "NOT ON CALENDAR",
            "NOT ON CALENDAR",
            "NOT ON CALENDAR"
        ],
        [
            "News Links",
            "No news items found",
            "No news items found",
            "No news items found",
            "No news items found",
            "No news items found",
            "No news items found",
            "No news items found",
            "No news items found",
            "No news items found",
            "No news items found"
        ]
    ],
    "pageTitle": "State Bill Colorado - Dossier",
    "title": "",
    "url": "http://statebillinfo.com/SBI/index.cfm?fuseaction=Public.Dossier&id=18926&pk=695",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00245-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 228022516,
    "recordOffset": 228014314,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "td {white-space:normal;} br {mso-data-placement:same-cell;}",
    "textAfterTable": "",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}