{
    "relation": [
        [
            "Name",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24",
            "25"
        ],
        [
            "Ratings",
            "Hill Farmstead Susan Hill Farmstead Brewery Greensboro, Vermont",
            "Grassroots Legitimacy Hill Farmstead Brewery Greensboro, Vermont",
            "AleSmith IPA AleSmith Brewing Company San Diego, California",
            "Tired Hands Extra Knuckle Tired Hands Brewing Company Ardmore, Pennsylvania",
            "Bells Two Hearted Ale Bells Brewery Galesburg, Michigan",
            "Alchemist Focal Banger The Alchemist Waterbury, Vermont",
            "Trillium Melcher Street - Double Dry Hopped Trillium Brewing Company Boston, Massachusetts",
            "Ballast Point Sculpin IPA Ballast Point Brewing Company San Diego, California",
            "La Cumbre Elevated IPA La Cumbre Brewing Company Albuquerque, New Mexico",
            "New England Fuzzy Baby Ducks IPA New England Brewing Co. Woodbridge, Connecticut",
            "Alpine Beer Company Nelson IPA Alpine Beer Company (CA) Alpine, California",
            "Tree House Julius Tree House Brewing Company Monson, Massachusetts",
            "Maine Beer Lunch Maine Beer Company Freeport, Maine",
            "Maine Beer Another One Maine Beer Company Freeport, Maine",
            "Russian River Blind Pig IPA Russian River Brewing Santa Rosa, California",
            "Tired Hands We Are All Infinite Energy Vibrating at the Same Frequency Tired Hands Brewing Company Ardmore, Pennsylvania",
            "Trillium Congress Street - Double Dry Hopped Trillium Brewing Company Boston, Massachusetts",
            "La Cumbre Project Dank La Cumbre Brewing Company Albuquerque, New Mexico",
            "Tree House Green Tree House Brewing Company Monson, Massachusetts",
            "Stone IPA (India Pale Ale) Stone Brewing Company Escondido, California",
            "Fat Head\u0092s Head Hunter IPA Fat Head\u0092s Brewery & Saloon North Olmsted, Ohio",
            "Surly Furious Surly Brewing Company Minneapolis, Minnesota",
            "Maine Beer I Maine Beer Company Freeport, Maine",
            "Le Castor Yakima IPA Microbrasserie Le Castor - Le Castor Brewing Co. Rigaud, Quebec",
            "Alpine Beer Company Duet Alpine Beer Company (CA) Alpine, California"
        ],
        [
            "Score",
            "197",
            "106",
            "2061",
            "27",
            "3406",
            "163",
            "20",
            "2226",
            "271",
            "21",
            "604",
            "98",
            "505",
            "267",
            "1311",
            "52",
            "28",
            "85",
            "51",
            "3618",
            "595",
            "1284",
            "34",
            "175",
            "574"
        ],
        [
            "",
            "4.12",
            "4.1",
            "4.09",
            "4.07",
            "4.06",
            "4.05",
            "4.04",
            "4.03",
            "4.03",
            "4.02",
            "4.02",
            "4.01",
            "4.01",
            "3.99",
            "3.99",
            "3.99",
            "3.98",
            "3.98",
            "3.98",
            "3.97",
            "3.97",
            "3.97",
            "3.96",
            "3.96",
            "3.96"
        ],
        [
            "",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find",
            "Find"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "The Best India Pale Ale (IPA) in the World according to RateBeer.com",
    "title": "",
    "url": "http://www.ratebeer.com/Ratings/TopBeersByStyle.asp?StyleID=17",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00146-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 664154282,
    "recordOffset": 664146080,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": " All  Retired Active Tulip Shaker Serve In Premium members can view the top 50 in each style category. Nonpremium members will be able to see the top 25. India Pale Ale, the modern version of which has largely been formed in the US, has an intense hop flavor, a golden to copper color, and a medium malty body. The aroma is moderate to very strong. IPAs work especially well at cutting the heat of chili, vindaloo or Sichuan cuisine. In England, IPA is often just another name for bitter although some micros are doing their own versions of an American IPA as well. India Pale Ale (IPA) The Worst Beers The Worst Beers In The World The Best Of The Beasts More Stats! The Most Active Brewers The Strongest Beers In The World The Top Ultralights The Top Weekly The Top IBU Top Beers of the Month  P  The Most Wanted Beers Newest Beers",
    "textAfterTable": "INTERESTED IN GREAT BEER? Join us! RateBeer is made by beer enthusiasts for the craft beer community. Membership is free and allows you to add your beer and place reviews! Sign Up Now About RateBeer | Add A Beer | Add A Brewer | Edit Personal Info | 100 Beer Club | FAQ | Log out | Contact/Feedback | Copyright 2000-2015, RateBeer LLC",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}