{
    "relation": [
        [
            "",
            "[37]",
            "[38]",
            "[39]",
            "[40]",
            "[41]",
            "[42]",
            "[43]",
            "[44]",
            "[45]"
        ],
        [
            "New Hampshire",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Massachusetts",
            "aye",
            "aye",
            "aye",
            "no",
            "aye",
            "aye",
            "aye",
            "no",
            "aye"
        ],
        [
            "Rhode Island",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Connecticut",
            "aye",
            "aye",
            "aye",
            "aye",
            "no",
            "no",
            "aye",
            "aye",
            "no"
        ],
        [
            "New York",
            "no",
            "aye",
            "aye",
            "aye",
            "no",
            "aye",
            "no",
            "no",
            "no"
        ],
        [
            "New Jersey",
            "no",
            "aye",
            "no",
            "aye",
            "no",
            "no",
            "no",
            "aye",
            "no"
        ],
        [
            "Pennsylvania",
            "aye",
            "aye",
            "aye",
            "no",
            "aye",
            "aye",
            "aye",
            "no",
            "aye"
        ],
        [
            "Delaware",
            "no",
            "no",
            "no",
            "aye",
            "no",
            "no",
            "no",
            "aye",
            "no"
        ],
        [
            "Maryland",
            "dd",
            "aye",
            "aye",
            "aye",
            "no",
            "no",
            "no",
            "aye",
            "no"
        ],
        [
            "Virginia",
            "aye",
            "aye",
            "aye",
            "no",
            "aye",
            "aye",
            "aye",
            "no",
            "aye"
        ],
        [
            "North Carolina",
            "aye",
            "aye",
            "aye",
            "no",
            "aye",
            "aye",
            "aye",
            "no",
            "aye"
        ],
        [
            "South Carolina",
            "aye",
            "aye",
            "aye",
            "no",
            "aye",
            "aye",
            "aye",
            "no",
            "aye"
        ],
        [
            "Georgia",
            "aye",
            "aye",
            "aye",
            "no",
            "aye",
            "aye",
            "aye",
            "no",
            "aye"
        ],
        [
            "Questions",
            "That the right of suffrage in the first branch of the N. L. ought not to be accordg to the rule established in the confedn but accordg to some equitable ratio of representation",
            "To postpone Mr Rutledge’s motion in order to take up Mr Wilson’s, respecting the right of suffrage in the N. L.",
            "That the right of suffrage in the first branch be accordg to the whole number of white and three fifths of the other inhabitants",
            "That in the second branch of the national Legislature each State have One vote",
            "That the right of suffrage in the second branch ought to be accordg to the rule established for the first",
            "To amend the 11th resolution submitted by Mr Randolph by adding the words voluntary junction or partition",
            "To amend theresolution by adding the words “national government” after the words",
            "To strike these words out of the 14 resolution “within the sevl States”",
            "To agree to the 14 resolution as submitted by Mr Randolph"
        ],
        [
            "Ayes",
            "7",
            "10",
            "9",
            "5",
            "6",
            "7",
            "7",
            "4",
            "6"
        ],
        [
            "Noes",
            "3",
            "1",
            "2",
            "6",
            "5",
            "4",
            "4",
            "7",
            "5"
        ],
        [
            "Divided",
            "1",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "The Records of the Federal Convention of 1787, vol. 1 - Online Library of Liberty",
    "title": "DETAIL OF AYES AND NOES",
    "url": "http://oll.libertyfund.org/titles/1057/95920",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 23,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00169-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 182943863,
    "recordOffset": 182677326,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{303=Max Farrand, The Records of the Federal Convention of 1787, ed. Max Farrand (New Haven: Yale University Press, 1911). Vol. 1. http://oll.libertyfund.org/titles/1057}",
    "TableContextTimeStampAfterTable": "{786232=Mr. Lansing moved to have the first article of the last plan of government read; which being done, he observed, that this system is fairly contrasted with the one ready to be reported — the one federal, and the other national. In the first, the powers are exercised as flowing from the respective state governments — The second, deriving its authority from the people of the respective states — which latter must ultimately destroy or annihilate the state governments. To determine the powers on these grand objects with which we are invested, let us recur to the credentials of the respective states, and see what the views were of those who sent us. The language is there expressive — it is, upon the revision of the present confederation, to alter and amend such parts as may appear defective, so as to give additional strength to the union. And he would venture to assert, that had the legislature of the state of New-York, apprehended that their powers would have been construed to extend to the formation of a national government, to the extinguishment of their independency, no delegates would have here appeared on the part of that state. This sentiment must have had its weight on a former occasion, even in this house; for when the second resolution of Virginia, which declared, in substance, that a federal government could not be amended for the good of the whole, the remark of an honorable member of South-Carolina, that by determining this question in the affirmative their deliberative powers were at an end, induced this house to wave the resolution. It is in vain to adopt a mode of government, which we have reason to believe the people gave us no power to recommend — as they will consider themselves on this ground authorized to reject it. See the danger of exceeding your powers by the example which the requisition of congress of 1783 afforded. They required an impost on all imported articles; to which, on federal grounds, they had no right unless voluntarily Edition: current; Page: [258] granted. What was the consequence? Some, who had least to give, granted it; and others, under various restrictions and modifications, so that it could not be systematized. If we form a government, let us do it on principles which are likely to meet the approbation of the states. Great changes can only be gradually introduced. The states will never sacrifice their essential rights to a national government. New plans, annihilating the rights of the states (unless upon evident necessity) can never be approved. I may venture to assert, that the prevalent opinion of America is, that granting additional powers to congress would answer their views; and every power recommended for their approbation exceeding this idea, will be fruitless., 83155=On Monday the 14th of May. ad 1787. and in the eleventh year of the independence of the United States of America, at the State-House in the city of Philadelphia — in virtue of appointments from their respective States, sundry Deputies to the fœderal-Convention appeared — but, a majority of the States not being represented, the Members present adjourned from day to day until friday the 25th of the said month, when, in virtue of the said appointments appeared from the States of, 63969=The fact of these changes being made does not rest merely upon the wording of the text and Madison’s statement in 1821 that he was intending to prepare his notes for posthumous publication. The manuscript22 shows that most of the changes thus made are easily recognizable. The ink which was used at the later date has faded quite differently from that of the original notes, so that most of the later revisions stand out from the page almost as clearly as if they had been written in red ink.23, 76113=Several copies of the drafts of August 6 and September 12, belonging to various delegates, are extant, and most of them have emendations and marginal notes indicating the action taken upon particular clauses and sections, and sometimes revealing the writer’s attitude or preference., 30220=Copyright, 1911, by Yale University Press, 853800=Monday June 18. 1787, 764964=Saturday June 16. 1787., 700059=Wednesday June 13. 1787., 73424=A few notes and memoranda relating to the Federal Convention were found among the papers of George Mason, and were printed in 1892 by Miss K. M. Rowland in her Life of George Mason. They are not of much importance, except in so far as they throw a little further light upon Mason’s position in the Convention., 93334=May 25. — (page 1 to 4) list of members assembled — G. Washington unanimously elected prest. notes of J. M. Major Jackson elected Secy — credentials of deputies read. Commee appd to prepare rules., 329812=Monday June 4. 1787., 479571=Thursday June 7. 1787., 58762=Madison’s correspondence and the manuscript itself reveal the fact that Madison went over his notes after the publication of the Journal in 1819.19 He not only noted differences between his own record and that of the Journal, but also in many cases corrected his own notes from the Journal. In the wording of motions, this is not to be wondered at, for Madison, during the sessions of the Convention, in his haste to note what the speaker was saying could do no more than take down the substance of motions and resolutions, while these would be copied into the journal in full. Nor is it surprising, when we remember that Madison accepted the printed Journal as authoritative, to find him in not a few cases copying from it proceedings of which he had no record. But the importance of this fact is evident at once, for these items have been accepted upon the double record of the Journal and Madison, Edition: current; Page: [xvii] whereas they are in reality to be stated upon the authority of the Journal alone., 546272=Dickerson — There can be no line of separation dividing the powers of legislation between the State & Genl. Govts. The consequence is inevitable that there must be a supreme & august national Legislature — the objection that the States may be prevented from training the Militia, is obviated by the mode of appointing the Senate and the actual representation of the people —, 54753=As Yates and his colleague Lansing left the Convention early — because they felt that their instructions did not warrant them in countenancing, even by their presence, the action which the Convention was taking — Yates’s notes cease with the fifth of July. For the earlier days of the Convention the notes of proceedings are quite brief; and while the reports are somewhat fuller after the presentation of the New Jersey plan on June 15, it was evident that they did not give at all a complete picture of the proceedings, though they threw a great deal of light upon what had taken place and in particular upon the attitude of individuals in the debates.13, 146981=State constitutions formed at an early period of the war, and by persons elected by the people for that purpose. These in general with one or two exceptions established about 1786. The confederation was formed long after this, and had its ratification not by any special appointment from the people, but from the several assemblies. No judge will say that the confederation is paramount to a State constition., 75299=In the present edition, all of these documents are brought together and placed in the Records between July 26 and August 6., 517985=Friday June 8. 1787., 50066=The results of his labor were printed at Boston in 1819 in an octavo volume of some 500 pages, entitled, Journal, Acts and Proceedings of the Convention, . . . which formed the Constitution of the United States.8 As Adams had nothing whatever to guide him in his work of compilation and editing, mistakes were inevitable, and not a few of these were important. Edition: current; Page: [xiii] In the present edition the secretary’s minutes are printed exactly as he left them, except that the scattered notes are brought together for each day. They are grouped under the heading of Journal. Where occasion requires, Adams’ edition is cited as Journal (in italics), while the secretary’s minutes are referred to as “the Journal”., 45795=The official authorization of the Federal Convention was a resolution of the Congress of the Confederation, adopted February 21, 1787:, 75648=The draft of August 6 was printed for the use of the delegates and was the subject of their discussions for over a month. The proceedings were then referred to a committee of five, known as the Committee of Style and Revision, of which William Samuel Johnson was chairman and Gouverneur Morris the most important member. The Committee of Style made its report on September 12, which was also printed for the delegates’ use., 654736=Tuesday June 12. 1787, 53248=When the seal of secrecy had been broken by the publication of the Journal, there was printed in Albany shortly afterward (1821): Secret Proceedings and Debates of the Convention Assembled at Philadelphia, in the year 1787, for the purpose of forming the Constitution of the United States of America. From Notes taken by the late Robert Yates, Esq. Chief Justice of New York, and copied by John Lansing, Jun, Esq. etc.10 J. C. Hamilton stated that Edmond C. Genet, former minister from France, was responsible for this publication.11 This is borne out by the fact that in 1808 Genet published A Letter to the Electors of President and Vice-President of the United States,12 which was an attack upon Madison, then a candidate for the presidency. The “Letter” consisted almost entirely of an abstract or extracts from the notes of Yates, mainly direct quotations, but cleverly pieced together in such a way as to represent Madison as the leader of the national party in the Federal Convention and working for the annihilation of the state governments., 1010344=Col. Mason. did not expect this point would have been reagitated. The essential differences between the two plans, had been clearly stated. The principal objections agst. that of Mr. R. were the want of power & the want of practicability. There can be no weight in the first as the fiat is not to be here, but in the people. He thought with his colleague Mr. R. that there were besides certain crisises, in which all the ordinary cautions yielded to public necessity. He gave as an example, the eventual Treaty with G. B. in forming which the Commsrs of the U. S. had boldly disregarded the improvident shackles of Congs. had given to their Country an honorable & happy peace, and instead of being censured for the transgression of their powers, had raised to themselves a monument more durable than brass. The impracticability of gaining the public concurrence he thought was still more groundless. (Mr. Lansing) had cited the attempts of Congress to gain an enlargment of their powers, and had inferred from the miscarrige of these attempts, the hopelessness of the plan which he (Mr. L) opposed. He thought a very different inference ought to have been drawn; viz. that the plan which (Mr. L.) espoused, and which proposed to augument the powers of Congress, never could be expected to succeed. He meant not to throw any reflections on Congs. as a body, much less on any particular members of it. He meant however to speak his sentiments without reserve on this subject; it was a privilege of Age, and perhaps the only compensation which nature had given for, the privation of so many other enjoyments; and he should not scruple to exercise it freely. Is it to be thought that the people of America, so watchful over their interests; so jealous of their liberties, will give up their all, will Edition: current; Page: [339] surrender both the sword and the purse, to the same body, and that too not chosen immediately by themselves? They never will. They never ought. Will they trust such a body, with the regulation of their trade, with the regulation of their taxes; with all the other great powers, which are in contemplation? Will they give unbounded confidence to a secret Journal — to the intrigues — to the factions which in the nature of things appertain to such an Assembly? If any man doubts the existence of these characters of Congress, let him consult their Journals for the years, 78, 79, & 80 — It will be said, that if the people are averse to parting with power, why is it hoped that they will part with it to a National Legislature. The proper answer is that in this case they do not part with power: they only transfer it from one sett of immediate Representatives to another sett. Much has been said of the unsettled state of the mind of the people. he believed the mind of the people of America, as elsewhere, was unsettled as to some points; but settled as to others. In two points he was sure it was well settled. 1. in an attachment to Republican Government. 2. in an attachment to more than one branch in the Legislature. Their constitutions accord so generally in both these circumstances, that they seem almost to have been preconcerted. This must either have been a miracle, or have resulted from the genius of the people. The only exceptions to the establishmt. of two branches in the Legislatures are the State of Pa. & Congs. and the latter the only single one not chosen by the people themselves. What has been the consequence? The people have been constantly averse to giving that Body further powers — It was acknowledged by (Mr. Patterson) that his plan could not be enforced without military coertion. Does he consider the force of this concession. The most jarring elements of nature; fire & water themselves are not more incompatible that such a mixture of civil liberty and military execution. Will the militia march from one State to another, in order to collect the arrears of taxes from the delinquent members of the Republic? Will they maintain an army for this purpose? Will not the citizens of the invaded State assist one another till they rise as one Edition: current; Page: [340] Man, and shake off the Union altogether. Rebellion is the only case in which 〈the military force of the State can be properly〉9 exerted agst. its Citizens. In one point of view he was struck with horror at the prospect of recurring to this expedient. To punish the non-payment of taxes with death, was a severity not yet adopted by depotism itself: yet this unexampled cruelty would be mercy compared to a military collection of revenue, in which the bayonet could make no discrimination between the innocent and the guilty. He took this occasion to repeat. that notwithstanding his solicitude to establish a national Government, he never would agree to abolish the State Govts. or render them absolutely insignificant. They were as necessary as the Genl. Govt. and he would be equally careful to preserve them. He was aware of the difficulty of drawing the line between them, but hoped it was not insurmountable. The Convention, tho’ comprising so many distinguished characters, could not be expected to make a faultless Govt. And he would prefer trusting to posterity the amendment of its defects, rather than push the experiment too far., 73964=For the first two months of its sessions the Convention had devoted itself mainly to the discussion of general principles, modifying and developing the resolutions Randolph had presented on behalf of the Virginia delegation. Late in July, the conclusions that had been reached were turned over to a committee of five, known as the Committee of Detail, of which Rutledge was chairman and Wilson an important member. On July 26, the Convention adjourned for ten days to permit this committee to prepare a draft of a constitution. Among the Wilson papers in the Library of the Historical Society of Pennsylvania are various documents revealing the work of the Committee of Detail in different stages of its progress.35 These documents, taken with an Edition: current; Page: [xxiii] important document found among the Mason papers,36 present clearly the work of the committee in preparing the draft of the constitution presented to the Convention on August 6., 632605=My learned colleague (Mr. Wilson) has already mentioned that the present method of voting by States, was submitted to originally by Congress, under a conviction of its impropriety, inequality, and injustice. This appears in the words of their Resolution. It is of Sepr. 6. 1774. The words are, 604912=Monday June 11. 1787., 56245=It was well known that James Madison had taken full and careful notes of the proceedings in the Convention, and he had often been urged to publish them. He had, however, decided that a posthumous publication was advisable.14 Madison died in 1836. His manuscripts were purchased by Congress, and shortly afterwards, in 1840, under the editorship of H. D. Gilpin, The Papers of James Madison were published in three volumes.15 More than half of this work was given over to his notes of the debates in the Federal Convention,16 and at once all other records paled into insignificance., 766050=Mr. Lansing called for the reading of the 1st. resolution of each plan, which he considered as involving principles directly in contrast; that of Mr. Patterson says he sustains the sovereignty of the respective States, that of Mr. Randolph distroys it: the latter requires a negative on all the laws of the particular States; the former, only certain general powers for the general good. The plan of Mr. R. in short absorbs all power except what may be exercised in the little local matters of the States which are not objects worthy of the supreme cognizance. He grounded his preference of Mr. P’.s plan, chiefly on two objections agst that of Mr. R. 1. want of power in the Convention to discuss & propose it.2 2 the improbability of its being adopted. 1. He was decidedly of opinion that the power of the Convention was restrained to amendments of a federal nature, and having for their basis the Confederacy in being. The Act of Congress The tenor of the Acts of the States, the commissions produced by the several deputations all proved this. and this limitation of the power to an amendment of the Confederacy, marked the opinion of the States, that it was unnecessary & improper to go farther. He was sure that this was the case with his State. N. York would never have concurred in sending deputies to the convention, if she had supposed the deliberations were to turn on a consolidation of the States, and a National Government. 2. was it probable that the States would adopt & ratify a scheme, which they had never authorized us to propose? and which so far exceeded what they regarded as sufficient? We see by their several acts 〈particularly in relation to the plan of revenue proposed by Congs. in 1783 not authorized by the articles of Edition: current; Page: [250] Confederation, what were〉3 the ideas they then entertained. Can so great a change be supposed to have already taken place. To rely on any change which is hereafter to take place in the sentiments of the people would be trusting to too great an uncertainty. We know only what their present sentiments are, and it is in vain to propose what will not accord with these. The States will never feel a sufficient confidence in a general Government to give it a negative on their laws. The Scheme is itself totally novel. There is 〈no〉 parallel to it to be found. The authority of Congress is familiar to the people, and an augmentation of the powers of Congress will be readily approved by them., 562933=Mr. Patterson considered the proposition for a proportional representation as striking at the existence of the lesser States. He wd. premise however to an investigation of this question some remarks on the nature structure and powers of the Convention. The Convention he said was formed in pursuance of an Act of Congs. that this act was recited in several of the Commissions, particularly that of Massts. which he required to be read: That the amendment of the confederacy was the object of all the laws and commissions on the subject; that the articles Edition: current; Page: [178] of the confederation were therefore the proper basis of all the proceedings of the Convention. We ought to keep within its limits, or we should be charged by our constituents with usurpation. that the people of America were sharpsighted and not to be deceived. But the Commissions under which we acted were not only the measure of our power. they denoted also the sentiments of the States on the subject of our deliberation. The idea of a national Govt. as contradistinguished from a federal one, never entered into the mind of any of them, and to the public mind we must accommodate ourselves. We have no power to go beyond the federal scheme, and if we had the people are not ripe for any other. We must follow the people; the people will not follow us. The proposition could not be maintained whether considered in reference to us as a nation, or as a confederacy. A confederacy supposes sovereignty in the members composing it & sovereignty supposes equality. If we are to be considered as a nation, all State distinctions must be abolished, the whole must be thrown into hotchpot, and when an equal division is made, then there may be fairly an equality of representation. He held up Virga. Massts. & Pa. as the three large States, and the other ten as small ones; repeating the calculations of Mr. Brearly as to the disparity of votes which wd. take place, and affirming that the small States would never agree to it. He said there was no more reason that a great individual State contributing much, should have more votes than a small one contributing little, than that a rich individual citizen should have more votes than an indigent one. If the rateable property of A was to that of B as 40 to 1. ought A for that reason to have 40 times as many votes as B. Such a principle would never be admitted, and if it were admitted would put B entirely at the mercy of A. As A. has more to be protected than B so he ought to contribute more for the common protection. The same may be said of a large State wch. has more to be protected than a small one. Give the large States an influence in proportion to their magnitude, and what will be the consequence? Their ambition will be proportionally increased, and the small States will have every thing to fear. It was once proposed by Galloway Edition: current; Page: [179] & some others that America should be represented in the British Parlt. and then be bound by its laws. America could not have been entitled to more than ⅓ of the no. of Representatives which would fall to the share of G. B. Would American rights & interests have been safe under an authority thus constituted? It has been said that if a Natl. Govt. is to be formed so as to operate on the people and not on the States, the representatives ought to be drawn from the people. But why so? May not a Legislature filled by the State Legislatures operate on the people who chuse the State Legislatures? or may not a practicable coercion be found. He admitted that there was none such in the existing System. He was attached strongly to the plan of the existing confederacy, in which the people chuse their Legislative representatives; and the Legislatures their federal representatives. No other amendments were wanting than to mark the orbits of the States with due precision, and provide for the use of coercion, which was the great point. He alluded to the hint thrown out heretofore by Mr. Wilson of the necessity to which the large States might be reduced of confederating among themselves, by a refusal of the others to concur. Let them unite if they please, but let them remember that they have no authority to compel the others to unite. N. Jersey will never confederate on the plan before the Committee. She would be swallowed up. He had rather submit to a monarch, to a despot, than to such a fate. He would not only oppose the plan here but on his return home do everything in his power to defeat it there, 227691=On the 30th May Govr. Randolph brought forward the principles of a federal Government. The idea suggested was, a national Government to consist of three branches. Agreed. The Legislature to consist of two branches.26, 541822=Mr. Madison confesses it is not without its difficulties on many accounts — some may be removed, others modified, and some are unavoidable. May not this power be vested in the senatorial branch? they will probably be always sitting. Take the question on the other ground, who is to determine the line when drawn in doubtful cases? The state legislatures Edition: current; Page: [171] cannot, for they will be partial in support of their own powers — no tribunal can be found. It is impossible that the articles of confederation can be amended — they are too tottering to be invigorated — nothing but the present system, or something like it, can restore the peace and harmony of the country., 387978=Tuesday June 5. 1787., 76734=It is possible, indeed probable, that other records of the Convention will be brought to light. Charles Pinckney stated explicitly that he had taken careful notes of the proceedings;37 William Jackson, secretary of the Convention, kept minutes of the debates;38 in a communication to the Massachusetts convention, Elbridge Gerry “subjoined a state of facts, founded on documents”;39 Gouverneur Morris referred to “some gentlemen” writing up their notes between sessions;40 and James Wilson in the Pennsylvania convention Edition: current; Page: [xxiv] on December 4, 1787, stated that within a week he had “spoken with a gentleman, who had not only his memory, but full notes that he had taken in that body”.41 Whatever may be the accuracy or the value of these various statements, at least they indicate that there once existed material of which we have no present knowledge, but which may at any time be found. It is not probable, however, that any such new material would modify to any great extent our conceptions of the Convention’s work, and it has, therefore, seemed worth while to gather in the present edition the existing records of the Federal Convention., 45970=“Resolved, That in the opinion of Congress, it is expedient, that on the second Monday in May next, a convention of delegates, who shall have been appointed by the several states, be held at Philadelphia, . . .”1, 194548=Thursday May 31. 1787., 902768=It may be said this constitutes an elective monarchy? Pray what is a monarchy? May not the governors of the respective states be considered in that light? But by making the executive subject to impeachment, the term monarchy cannot apply. These elective monarchs have produced tumults in Rome, and are equally dangerous to peace in Poland; but this cannot apply to the mode in which I would propose the election. Let electors be appointed in each of the states to elect the executive — (Here Mr. H. produced his plan, a copy whereof is hereunto annexed)11 to consist of two branches — and I would give them the unlimited power of passing all laws without exception. The assembly to be elected for three years by the people in districts — the senate to be elected by electors to be chosen for that purpose by the people, and to remain in office during life. The executive to have the power of negativing all laws — to make war or peace, with the advice of the senate — to make treaties with their advice, but to have the sole direction of all military operations, and to send ambassadors and appoint all military officers, and to pardon all offenders, treason excepted, unless by advice of the senate. On his death or removal, the president of the senate to officiate, with the same powers, until another is elected. Supreme Edition: current; Page: [301] judicial officers to be appointed by the executive and the senate. The legislature to appoint courts in each state, so as to make the state governments unnecessary to it., 186169=1787, 21 Febry. Resolution of Congress., 241819=Friday June 1. 1787., 93098=May 14, 178713 — appointed for the meeting of ye Convention on the 7 States met, 46335=The second Monday in May, 1787, fell on the fourteenth, and on that day delegates from several of the states gathered in the “long room” of the State House in Philadelphia.2 It was not until the twenty-fifth, however, that a sufficient number of delegates appeared to constitute a representation of a majority of the states. On May 25, the Convention organized and remained in continuous session until September 17, with the execption of one adjournment of two days over the Fourth of July and another of ten days, from July 26 to August 6, to allow the Committee of Detail to prepare its report., 1953=Volume 1 covers May 14 to July 13, 1787. The records of the Federal Convention which was held in Philadelphia between May and September 1787. The sessions were secret but the proceedings were reconstructed from notes kept by the official secretary and some participants, most notably James Madison., 552546=Saturday June 9. 1787., 430340=Wednesday June 6. 1787., 98670=Door keeper and messengers being appointed, the house adjourned to Monday the 28th day of May, at ten o’clock., 70924=The notes of William Paterson, of New Jersey,30 were evidently taken solely for his own use. While they are of little help in studying the general proceedings of the Convention, they are of great assistance in following Paterson’s own line of reasoning, and in particular in studying the development of the resolutions Paterson presented on June 15, commonly called the New Jersey Plan. This is here given in its various stages of construction.31, 70088=The notes of William Pierce of Georgia, which were first printed in the Savannah Georgian in 1828,28 add somewhat to our information of the proceedings of the first few days of the sessions. The character sketches of his fellow-members in Convention, which accompany these notes,29 are not only interesting, but are also helpful in portraying the delegates as they appeared to a contemporary., 367543=Mas. Cont. NYk. Pen. Virg. NC. SC. Geor. Ay N Jer. Del. Mar. No.21, 264374=1 June. Ex. power to be in one person, 68912=Quite the best of these are the notes of James McHenry, of Maryland.27 McHenry started out with the evident intention of taking somewhat extensive notes, and he adds not a little to our information of Randolph’s speech in presenting the Edition: current; Page: [xxi] Virginia Resolutions on May 29. On account of his brother’s illness, he left Philadelphia on June 1, and remained away during June and July, but in August he returned to the Convention and to his note-taking with all the enthusiasm of the beginner. The records became more and more brief as time passed, but they are valuable because they are, for the latter part of the Convention’s work, almost the only material we have besides the Journal and Madison’s Debates., 88139=Monday May 14th 1787 was the day fixed for the meeting of the deputies in Convention for revising the federal2 system of Government. On that day a small number only had assembled Seven States were not convened till,3, 40622=In publicly acknowledging his indebtedness to so many who have been of service to him, the editor desires to express his obligations in particular: to Mr. John A. Tonner, Chief of the Bureau of Rolls and Library of the Department of State, to his predecessors, Mr. William McNeir and Mr. Andrew H. Allen, and to their obliging assistants, in whose care are most of the manuscripts from which the texts of this edition have been taken; to the late Edward King, of New York City, for permission to use the Rufus King manuscripts, to the New York Historical Society and its Librarian, Mr. Robert H. Kelby, the custodians of these manuscripts; to the Historical Society of Pennsylvania and its Librarian, Mr. John Edition: current; Page: [ix] W. Jordan, for the privilege of examining and copying the Wilson manuscripts; to Mr. Herbert Putnam and his able staff in the Library of Congress for their many courtesies, especially to Mr. Worthington C. Ford, the former Chief of the Division of Manuscripts and to the present Chief, Mr. Gaillard Hunt, who have been unfailing in their kindliness and assistance; to Mr. William Harden, Librarian of the Georgia Historical Society, for his scholarly description of the annotations on Baldwin’s copy of the printed draft of September 12; to the Department of Foreign Affairs of the French Government for the privilege of examining and copying from its Archives; to the Editors of the American Historical Review for permission to reprint documents from that journal; to Miss Kate Mason Rowland for permission to use extracts from her Life of George Mason; to Mr. William M. Meigs for the privilege of reprinting the draft of the Committee of Detail, published in photograph facsimile in his Growth of the Constitution; to Messrs. G. P. Putnam’s Sons for permission to reprint freely from their series of “Writings of the Fathers of the Republic” — Jefferson, King, Madison, Randolph and Washington; and to the Macmillan Company for permission to reprint extracts from A. H. Symth, Writings of Benjamin Franklin., 72546=The plan of government which Pinckney presented to the Convention on May 29 is not among the papers of the Convention, nor has any copy of it ever been found. Among the Wilson manuscripts in the library of the Historical Society of Pennsylvania, however, are an outline of the plan and extracts from the same.33 These documents confirm and supplement another method of working, and make it possible to present a fairly complete restoration of the original text.34, 596420=See a similar document from the Brearley Papers, below July 10., 281708=Saturday June 2nd 1787., 1029644=Mr. Mason. The material difference between the two plans has already been clearly pointed out. The objection to that of Virginia arises from the want of power to institute it, and the want of practicability to carry it into effect. Will the first objection apply to a power merely recommendatory? In certain seasons of public danger it is commendable to exceed power. The treaty of peace, under which we now enjoy the blessings of freedom, was made by persons who exceeded their powers. It met the approbation of the public, and thus deserved the praises of those who sent them. The impracticability of the plan is still less groundless. These measures are supported by one who, at his time of life, has little to hope or expect from any government. Let me ask, will the people entrust their dearest rights and liberties to the determination of one body of men, and those not chosen by them, and who are invested both with the sword and purse? They never will — they never can — to a conclave, transacting their business secret from the eye of the public. Do we not discover by their public journals of the years 1778-9, and 1780, that factions and party spirit had guided many of their acts? The people of America, like all other people, are unsettled in their minds, and their principles fixed to no object, except that a republican government is the best, and that the legislature ought to consist of two branches. The constitutions of the respective states, made and approved of by them, evince this principle. Congress, however, from other causes, received a different organization. What, would you use military force to compel the observance of a social compact? It is destructive to the rights of the people. Do you expect the militia will do it, or do you mean a standing army? The first will never, on such an occasion, exert any power; and the latter may turn its arms against the government which employs them. I never will consent to destroy state governments, and will ever be as careful to preserve the one as the other. If we should, in the formation of the latter, have omitted some necessary regulation, I will trust my posterity to amend it. That the one government will be productive of disputes and jealousies against the other, I believe; but it will produce Edition: current; Page: [347] mutual safety. I shall close with observing, that though some gentlemen have expressed much warmth on this and former occasions, I can excuse it, as the result of sudden passion; and hope that although we may differ in some particular points, if we mean the good of the whole, that our good sense upon reflection, will prevent us from spreading our discontent further., 186253=Resolved that in the opinion of Congress it is expedient Edition: current; Page: [42] that on the 2d Monday of May next a convention of delegates who shall have been appointed by the several States to be held at Philada. for the sole and expres purpose of revising the articles of confederation, and reporting to Congress and the several legislatures, such alterations and provisions therein as shall when agreeed to in Congress, and confirmed by the States, render the fœderal constitution, adequate to the exigencies of government and the preservation of the union.”, 47242=The sessions of the Convention were secret; before the final adjournment the secretary was directed to deposit “the Journals and other papers of the Convention in the hands of the President”, and in answer to an inquiry of Washington’s, the Convention resolved “that he retain the Journal and other papers subject to the order of Congress, if ever formed under the Constitution.” Accordingly the secretary, William Jackson, after destroying “all the loose scraps of paper”, which he evidently thought unimportant, formally delivered the papers to the president.3 Washington in turn deposited these papers with the Department of State in 1796,4 where they remained untouched until Congress by a joint resolution in 1818 ordered Edition: current; Page: [xii] them to be printed.5 They are still in the keeping of the Bureau of Rolls and Library of that department., 796549=It is said and insisted on, that the Jersey plan accords with our powers. As for himself he considers his powers to extend to every thing or nothing; and therefore that he has a right and is at liberty to agree to either plan or none. The people expect relief from their present embarrassed situation, and look up for it to this national convention; and it follows that they expect a national government, and therefore the plan from Virginia has the preference to the other. I would (says he) with a reluctant hand add any powers to congress, because they are not a body chosen by the people, and consist only of one branch, and each state in it has one vote. Inequality in representation poisons every government. The English courts are hitherto pure, just and incorrupt, while their legislature are base and venal. The one arises from unjust representation, the other from their independency of the legislature. Lord Chesterfield remarks, that one of the States of the United Netherlands withheld its assent to a proposition until a major of their state was provided for. He needed not to have added (for the conclusion was self evident) that it was one of the lesser states. I mean no reflection, but I leave it to gentlemen to consider whether this has not also been the case in congress? The argument in favor of the Jersey plan goes too far, as it cannot be completed, unless Rhode-Island assents. A single legislature is very dangerous. — Despotism may present itself in various shapes. May there not be legislative despotism if in the exercise of their power they are unchecked or unrestrained by another branch? On the contrary an executive to be restrained must be an individual. The first triumvirate of Rome combined, without law, was fatal to its liberties; and the second, by the usurpation of Augustus, ended in despotism. — The two kings of Sparta and the consuls of Rome, by sharing the executive, distracted their governments., 940955=Tuesday June 19. 1787}",
    "textBeforeTable": "Edition: current; Page: [195] The Committee then rose. It was then moved and seconded that the Committee do now rise, report a further progress, and request leave to sit again it passed in the affirmative [Ayes — 6; noes — 5.] And on the question to agree to the same. It was then moved and seconded to agree to the 14th resolution as submitted by Mr. Randolph it passed in the negative [Ayes — 4; noes — 7.] and on the question to strike out. It was then moved by Mr Martin seconded byto strike out the words “within the several States” “Resolved that the legislative, executive, and judiciary powers within the several States ought to be bound by oath to support the articles of union” It was then moved and seconded to agree to the 14 resolution submitted by Mr Randolph namely “and that the assent of the national legislature ought not to be required thereto” It was agreed to postpone the following clause in the 13th resolution submitted by Mr Randolph namely it passed in the affirmative On the question to agree to the same Resolved that provision ought to be made for the amendment of the articles of union whensoever it shall seem necessary. It was then moved and seconded to agree",
    "textAfterTable": "Edition: current; Page: [196] MADISON Monday, June 11th. 〈Mr Abraham Baldwin from Georgia took His Seat.〉3 In Committee of the Whole. The clause concerning the rule of suffrage in the natl. Legislature postponed 〈on Saturday,〉 was resumed.4 Mr. Sharman proposed that the proportion of suffrage in the 1st branch should be according to the respective numbers of free inhabitants; and that in the second branch or Senate, each State should have one vote and no more. He said as the States would remain possessed of certain individual rights, each State ought to be able to protect itself: otherwise a few large States will rule the rest. The House of Lords in England he observed had certain particular rights under the Constitution, and hence they have an equal vote with the House of Commons that they may be able to defend their rights. Mr. Rutlidge proposed that the proportion of suffrage in the 1st branch should be according to the quotas of contribution. The justice of this rule he said could not be contested. Mr. Butler urged the same idea: 〈adding that money was power; and that the States ought to have weight in the Govt. — in proportion to their wealth.〉5 Mr. King & Mr. Wilson* 〈in order to bring the question to a point〉",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}