{
    "relation": [
        [
            "Start Date",
            "2005-10-28",
            "2012-07-01",
            "2000-10-28",
            "2007-09-01",
            "2003-10-28"
        ],
        [
            "End Date",
            "2007-08-31",
            "",
            "2003-10-27",
            "2012-06-30",
            "2005-10-27"
        ],
        [
            "Committee",
            "Faculty of Medicine, Board of the",
            "Faculty of Medicine, Board of the",
            "Faculty of Medicine, Board of the",
            "Faculty of Medicine, Board of the",
            "Faculty of Medicine, Board of the"
        ],
        [
            "Category",
            "The teachers who are members of the Faculty and who are full-time employees of the University",
            "The teachers who are members of the Faculty and who are full-time employees of the University",
            "Lecturers in Faculty",
            "The teachers who are members of the Faculty and who are full-time employees of the University",
            "Lecturers in Faculty"
        ],
        [
            "Body",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "HKU Scholars Hub: Researcher Page",
    "title": "",
    "url": "http://hub.hku.hk/cris/rp/rp00477/achievements",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00245-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 113888796,
    "recordOffset": 113880594,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "HKU Committee Appointments 2014 Phd Yang Xi Immunology   2013 MPhil Chen Miao Immunology Leptin modulates B cell responses against influenza infection   2004 Phd Lam Lai Kwan Queenie Immunology The Role of Leptin in Regulating Dendritic Cell Maturation and Function   2002 Phd Zhou Jie Immune Therapy for Chronic Viral Infections and Associated Cancers Genetic polymorphisms of type I interferon receptor 1 affect the susceptibility to chronic HBV infection: association analysis and mechanistic investigation   2004 MPhil Wong Pui Man Molecular and Developmental Genetics Hoxb3 mutation leads to Interleukin-6 dependent plasmacytoma   2008 Phd Yang Min",
    "textAfterTable": "Loading Content...Please Wait! Loading Content...Please Wait! Are You Missing Publications, Invited Lectures? Click Me. × Missing Publications? If you do not see your publications here, please note: We receive data from HKU's Research Output System (ROS), after you or your people enter data there. If you have entered, or are going to enter data into ROS, we do not want to enter them manually into the Hub, as it will create duplicates. When entering data into ROS, please remember to include the DOI or ISBN. It will help us match on outside sources, dedup, and bring in cleaner data than ROS supplies. If you are NOT going to enter publication data into ROS, or if you have publications from before your time at HKU, please put them into an EndNote file and send to us, hub@lib.hku.hk. It will allow us to enter in batch. HKU has a site license for EndNote. You may google for \"endnote@hku\". HKU Libraries can instruct on Endnote, either in class or one on one, http://lib.hku.hk/general/help.html Want to make a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}