{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Name",
            "Volvo V70 Plug-in HybridVolvo appears serious about producing a plug-in hybrid wagon with 30 or miles of electric range.",
            "Mitsubishi PX-MiEVThis mid-sized SUV plug-in hybrid has triple-threat functionality as a pure electric, a series hybrid, and a parallel hybrid. Result: About 120 mpg.",
            "Fisker KarmaThe rear-wheel drive sporty plug-in hybrid from designer Henrik Fisker.",
            "First Drive: 2014 Porsche Plug-In S E-HybridThe 2014 Porsche plug-in Panamera S E-Hybrid solidly improves on the 2013 non-plug-in while signaling a future direction for the iconic automaker.",
            "Cadillac ConverjAn angular, sleek, luxury concept version of the Chevrolet Volt.",
            "2015 Ford Fusion Energi ReviewThe range-topping 2015 Ford Fusion Energi plug-in hybrid offers a solid balance of attributes and is a leader among first-generation plug-in cars.",
            "2013 Ford C-Max Energi Review",
            "2013 Chevrolet Volt Review – VideoAll-electric gas-free driving for 40-mile stretches.",
            "2012 Toyota Prius Plug-in Hybrid ReviewToyota will begin delivery of the Prius Plug-in Hybrid in March of 2012.",
            "2012 Ford C-MAX EnergiThe segment-busting almost-a-van vehicle will offer 40+ mpg, but only five seats as a plug-in hybrid.",
            "2012 Fisker Karma Review – VideoIn a culture where you are often perceived by what you drive, showing up in a Fisker Karma is the next best thing to being some kind of star."
        ],
        [
            "EV Range",
            "30 miles",
            "30 miles",
            "50 miles",
            "miles",
            "40 miles",
            "miles",
            "miles",
            "40 miles",
            "10 miles",
            "21 miles",
            "33 miles"
        ],
        [
            "Body Type",
            "Van",
            "SUV",
            "Coupe",
            "Sedan",
            "Luxury",
            "Sedan",
            "Sedan",
            "Sedan",
            "Sedan",
            "Sedan",
            "Coupe"
        ],
        [
            "MSRP",
            "$0",
            "$0",
            "$96,000",
            "$99,000",
            "$0",
            "$34,700",
            "$32,950",
            "$39,100",
            "$32,000",
            "$32,950",
            "$111,000"
        ],
        [
            "Available",
            "Concept",
            "2014",
            "Now",
            "November 2013",
            "Concept",
            "Now",
            "Now",
            "Now",
            "Now",
            "Now",
            "Now"
        ]
    ],
    "pageTitle": "Plug-in Hybrid | HybridCars.com",
    "title": "",
    "url": "http://www.hybridcars.com/plug-in-hybrid-cars/feed/?sort=DESC&order=Name",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00031-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 501667151,
    "recordOffset": 501648980,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Fri, 31 Jul 2015 13:14:21 GMT",
    "textBeforeTable": "Several carmakers have or are planning to introduce 100+ mpg-hybrids that can be plugged into the electric grid. Find out which hybrid cars get the most miles per gallon. Most Fuel-Efficient Hybrids Top 5 Plug-in Hybrid Forums News Technology Oil Dependence Incentives and Laws Gas Mileage Fuels Environment Culture & Market Buying Guide",
    "textAfterTable": "Top News for Plug-in Hybrid Fisker Tries To Create Distance from Tesla It’s not surprising that Fisker Automotive and Tesla Motors—two California-based makers of high-end electric-drive A 'Couple Dozen' Volt Owners Seek to Sell Back Their Vehicles After Fire Concerns General Motors said today that a “couple dozen” Chevy Volt owners have indicated that they plan to take the company Chevy Volt Production Line Restarts a Week Early General Motors’ Detroit-Hamtramck plant is back to producing Chevy Volts and Opel/Vauxhall Amperas a week",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}