{
    "relation": [
        [
            "#",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Player",
            "Maureen Connolly Brinker",
            "Doris Hart",
            "Shirley Fry Irvin",
            "Margaret Court",
            "Billie Jean King",
            "Chris Evert",
            "Martina Navratilova",
            "Steffi Graf",
            "Serena Williams",
            "Maria Sharapova"
        ],
        [
            "Age",
            "18",
            "28",
            "29",
            "20",
            "28",
            "28",
            "26",
            "19",
            "21",
            "25"
        ],
        [
            "Australian Open",
            "1953",
            "1949",
            "1957",
            "1960",
            "1968",
            "1982",
            "1981",
            "1988",
            "2003",
            "2008"
        ],
        [
            "French Open",
            "1953",
            "1950",
            "1951",
            "1962",
            "1972",
            "1974",
            "1982",
            "1987",
            "2002",
            "2012"
        ],
        [
            "Wimbledon",
            "1952",
            "1951",
            "1956",
            "1963",
            "1966",
            "1974",
            "1978",
            "1988",
            "2002",
            "2004"
        ],
        [
            "US Open",
            "1951",
            "1954",
            "1956",
            "1962",
            "1967",
            "1975",
            "1983",
            "1988",
            "1999",
            "2006"
        ]
    ],
    "pageTitle": "Grand Slam (tennis) - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Grand_Slam_title",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00055-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 873994191,
    "recordOffset": 873918396,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{2852=The Grand Slam tournaments, or Majors, are the four most important annual tennis events. They offer the most ranking points,[1] prize money, public and media attention, the greatest strength and size of field, and greater number of \"best of\" sets for men. The Grand Slam itinerary consists of the Australian Open in mid January, the French Open in May and June, Wimbledon in June and July, and the US Open in August and September. Each tournament is played over a period of two weeks. The Australian and US tournaments are played on hard courts, the French on clay, and Wimbledon on grass. Wimbledon is the oldest, founded in 1877, followed by the US in 1881, the French in 1891, and the Australian in 1905. However, of these four, only Wimbledon was a major before 1924/25, the time when all four became designated Grand Slam tournaments., 261290=Players who have won three of the four Grand Slam tournaments in the same year. Jack Crawford, Lew Hoad and Martina Navratilova won the first three events, but lost the last grand slam tournament. Crawford, an asthmatic, won two of the first three sets of the 1933 U.S. Championships final against Fred Perry, then tired in the heat and lost the last two sets and the match.[22], 17402=Grand slam has been used in golf since 1930, when Bobby Jones won the four major championships, two British and two American. Although John F. Kieran is widely credited with first applying the term \"grand slam\" to tennis, to describe the winning of all four major tennis tournaments in a calendar year, sports columnist Alan Gould had used the term in that connection almost two months before Kieran.[6], 19986=The first definitive Grand Slam, of the current four majors, was accomplished when Don Budge won all four men's singles Majors in 1938. To date, 17 players have completed a Grand Slam, though only six in the most prestigious singles titles. Of these players, three have won multiple Grand Slams: Rod Laver accomplished the feat twice in men's singles; Margaret Court accomplished the feat three times, in two different disciplines – once in women's singles and twice in mixed doubles; and Esther Vergeer completed a grand slam twice in Women's wheelchair doubles., 375125=Serena Williams has come closer than any other currently active player to joining this elite group. She has yet to win the mixed doubles at the Australian and French Opens (finishing as the runner-up at the 1999 Australian Open and 1998 French Open). Prior to Williams, it was Billie Jean King who came close at completing a career boxed set. She only needed the Australian Open women's doubles title and although she reached the final twice (in 1965 and 1969), she failed to win the title., 70916=Laver was the most recent male grand-slammer even by this more relaxed definition until 2013, when the Bryan brothers won Wimbledon while holding the other majors. But Laver still is the most recent single male grand-slammer. Todd Woodbridge and Mark Woodforde reached the final of the 1997 French Open holding all the other three titles, but lost to Yevgeny Kafelnikov and Daniel Vacek; in singles, Roger Federer in 2006 and 2007 and Novak Djokovic in 2011 repeated this, both ultimately losing the Paris final to Rafael Nadal. Nadal himself was prevented from achieving this feat by his own countryman David Ferrer, who defeated him in the quarterfinal of the Australian Open 2011, with Nadal previously having won the French Open, Wimbledon and US Open in 2010., 231928=In 1970 a tournament was created to reunite the top male players of the season, which is today called the ATP World Tour Finals. In 1972 the women's tour introduced the same concept, now known as the WTA Tour Championships. Both are contested at the end of the year and are the last official competitions of the ATP and WTA seasons. Winning this event along with the four Grand Slams and the Olympic gold medal is nowadays known as completing the Super Slam.[19][20][21] But this achievement has only been possible since 1988, when tennis returned to the Olympic calendar., 201222=Helen Wills Moody won all 16 of the Grand Slam singles tournaments she played beginning with the 1924 U.S. Championships and extending to the 1933 Wimbledon Championships (not counting her defaults in the 1926 French and Wimbledon Championships). The first 15 of those were won without losing a set. During this period, she won 6 Wimbledons, 4 French Championships, and 6 U.S. Championships. She also won the 1924 Summer Olympics during this period. Moody never entered the Australian Championships., 202372=Doris Hart won all 13 of the Grand Slam mixed doubles tournaments she played beginning with the 1951 French Championships and extending to the 1955 U.S. Championships. During this period, she won 5 Wimbledons, 3 French Championships, and 5 U.S. Championships., 68993=In 1982 the International Tennis Federation (ITF) broadened the definition of the Grand Slam as meaning any four consecutive major victories, including the ones spanning two calendar years.[9] As defined in the constitution of the ITF: \"The Grand Slam titles are the championships of Australia, France, the United States of America and Wimbledon. Players who hold all four of these titles at the same time achieve the Grand Slam\".[10] As this definition differs from the original definition of the Grand Slam as restricted to a single calendar year, there has been some controversy towards this redefinition in the tennis world.[11][12] Subsequently, the ITF has distanced itself from the 1982 decision, reverting to the traditional calendar-year definition (when Martina Navratilova won the 1984 French Open to become the reigning champion of all four women's singles, the ITF awarded her $1 million Grand Slam bonus in recognition of her achievement.[9] However subsequently, the ITF abandoned recognizing non-calendar year grand slams., 376234=Of the many players who have managed to win a full set of four Majors, there is a small number who have gone on to win all four Majors a second or more times. The completion of \"Multiple Career Grand Slams\" or sometimes called \"multiple slam sets\" (MSS) has been achieved by only 22 unique players up to the end of the 2015 Wimbledon. MSS players can be found in each of the five tennis disciplines: men's or women's singles, men's or women's doubles, mixed doubles. It can also be found in women's wheelchair doubles. Of these, five players have completed MSS in more than one discipline: Roy Emerson, Martina Navratilova, Frank Sedgman and Serena Williams have MSS in two disciplines, Margaret Court has MSS in three disciplines., 429708=Before the Open Era began in 1968, only amateurs players were allowed to compete in the four majors. Many top players \"went pro\" in order to win prize money legally, competing on a professional world tour comprising completely different events.[28] From 1927 through 1967, the three oldest pro events were considered \"majors\" of the pro tour: the U.S. Pro Tennis Championships, French Pro Championship and Wembley Championships.[29][30] A player who won all three in a calendar year was considered to achieve a \"Professional Grand Slam\", or \"Pro Slam\".[29][30] The feat was accomplished twice:, 18308=The possibility of being the reigning champion of all the current four Majors did not exist until 1924/25, when the International Lawn Tennis Federation designated the Australasian, French (before 1925 only open to members of French tennis clubs), British and American championship tournaments as the four Majors. Before that time only three events: Wimbledon, the World Hard Court Championships (held in Paris & once in Brussels) and the World Covered Court Championships (held in various locations) were considered the premier international tennis events by the ILTF.[7][8] Tony Wilding of New Zealand won all three of those earlier majors in one year – 1913. It has been possible to complete a Grand Slam in most years and most disciplines since 1925. It was not possible from 1940 to 1945 because of interruptions at Wimbledon, the Australian and French opens due to the Second World War, the years from 1970 to 1985 when there was no Australian tournament in mixed doubles, and 1986 when there was no Australian Open at all., 16533=The term slam for winning all of the tricks in the whist family card games (see also whist terms) is attested from early in the 17th century. Grand slam for all of the tricks, in contrast to small slam or little slam for all but one, dates from early in the 19th century.[5] This use was inherited by contract bridge, a modern development of whist defined in 1925 that became very popular in Britain and America by 1930., 203018=Tennis was an Olympic sport from the inaugural 1896 Summer Olympics through the 1924 Games, then was dropped for the next 64 years (except as a demonstration sport in 1968 and 1984) before returning in 1988. As there were only three Major championships designated by the International Lawn Tennis Federation before 1925, none of the tennis players who participated in the Olympics between 1896 and 1924 had a chance to complete a Golden Grand Slam. However although it didn't occur, there was a possibility to complete a Career Golden Grand Slam by winning the 1920 Olympics or 1924 Olympics plus each of the four grand slams, all of which were present from 1925 onwards. The term Golden Slam (initially \"Golden Grand Slam\") was coined in 1988.[13], 378048=For example, the fourth row shows that Margaret Court completed her third career slam set in Women's Singles —winning each of the four majors three times— during the 1970 Wimbledon Championships (bold). More specific, she won: Australian open 11 times, the third in 1962; French Open five times, the third in 1969; Wimbledon three times (determines the maximum of sets), the third in 1970 and finally US Open five times, the third in 1969. Grey background shades lesser achievements by the same player in the same discipline (e.g., Court in the eighth row); yellow highlights the greatest achievement in the discipline (e.g., Graf in the third row)., 206744=Winning four consecutive Grand Slam tournaments and Olympic event in the period of twelve months, although not in one year is called a Non-calendar year Golden Slam.[16] Only Bob and Mike Bryan have achieved this by winning the 2012 Olympics, 2012 US Open, 2013 Australian Open, 2013 French Open and 2013 Wimbledon Championships. After they won the final at Wimbledon, this was coined the \"Golden Bryan Slam\".[17]}",
    "lastModified": "Sun, 02 Aug 2015 04:48:48 GMT",
    "textBeforeTable": "Seven men have won the four grand slam tournaments. Two of the seven men achieved a double career Slam. Men's singles[edit] The remainder of this section is a complete list, by discipline, of all players who have won the Career Grand Slam. Players are ordered chronologically by their completion of the Slam. Only six players have completed a Career Grand Slams in both singles and doubles, one male (Roy Emerson) and five female (Margaret Court, Doris Hart, Shirley Fry Irvin, Martina Navratilova and Serena Williams). Court, Hart and Navratilova are the only three players to have completed a \"Career Boxed Set\", winning all four titles in singles, doubles and mixed doubles; this has never been done by a male player. Several singles players have won three major championships without achieving the Career Grand Slam. Henri Cochet, Helen Wills, Althea Gibson, Tony Trabert and Margaret Osborne duPont never won the Australian Open. Frank Sedgman, Louise Brough Clapp, Pete Sampras, John Newcombe, Jimmy Connors, Lindsay Davenport, Martina Hingis and Novak Djokovic failed to win the French Open.",
    "textAfterTable": "1949 1950 1951 1954 3 Shirley Fry Irvin 29 1957 1951 1956 1956 4 Margaret Court 20 1960 1962 1963 1962 5 Billie Jean King 28 1968 1972 1966 1967 6 Chris Evert 28 1982 1974 1974 1975 7 Martina Navratilova 26 1981 1982 1978 1983 8 Steffi Graf 19 1988 1987 1988 1988 9 Serena Williams 21",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}