{
    "relation": [
        [
            "",
            "SPECviewperf 11",
            "1920x1080 Catia",
            "1920x1080 Ensight",
            "1920x1080 Lightwave",
            "1920x1080 Maya",
            "1920x1080 Pro/ENGINEER",
            "1920x1080 SolidWorks",
            "1920x1080 Tcvis",
            "1920x1080 Siemens NX"
        ],
        [
            "Eurocom Panther 3.0 Radeon HD 6990M, 990X EE, 2x Intel SSD 510 Series SSDSC2MH250A2 (RAID 0)",
            "",
            "4.94",
            "21.71",
            "12.87",
            "4",
            "2.06",
            "12.31",
            "2.13",
            "10.19"
        ],
        [
            "Alienware M17x R3 GTX 580M i7-2820QM GeForce GTX 580M, 2820QM, Seagate Momentus Thin ST320LT007-9ZV142",
            "3%",
            "6.6 34%",
            "24.8 14%",
            "13.7 6%",
            "11.3 183%",
            "1.2 -42%",
            "8.4 -32%",
            "0.8 -62%",
            "2.2 -78%"
        ],
        [
            "Schenker XMG P501 GeForce GTX 580M, 2720QM, Intel SSD 320 Series SSDSA2CW080G3",
            "-6%",
            "4.91 -1%",
            "24.91 15%",
            "11.87 -8%",
            "10.9 173%",
            "1.2 -42%",
            "7.11 -42%",
            "0.78 -63%",
            "2.22 -78%"
        ],
        [
            "Schenker XIRIOS W710 Quadro 5010M, X5670, 2x OCZ Vertex 3 VTX3-25SAT3-120G (RAID 0)",
            "564%",
            "33.89 586%",
            "36.73 69%",
            "40.01 211%",
            "53.62 1241%",
            "7.99 288%",
            "37.93 208%",
            "37.6 1665%",
            "34.9 242%"
        ],
        [
            "Fujitsu Celsius H710 WXP11DE Quadro 1000M, 2820QM, Toshiba THNSFC256GBSJ",
            "271%",
            "15.04 204%",
            "11.19 -48%",
            "35.99 180%",
            "33.48 737%",
            "8.32 304%",
            "25 103%",
            "16.17 659%",
            "13.3 31%"
        ]
    ],
    "pageTitle": "Review AMD Radeon HD 6990M Graphics Card - NotebookCheck.net Reviews",
    "title": "",
    "url": "http://www.notebookcheck.net/Review-AMD-Radeon-HD-6990M-Graphics-Card.60150.0.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 29,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00326-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 598411695,
    "recordOffset": 598337138,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{26945=The clock frequency of the core has been increased from 680 MHz to 715 MHz (+5%). The biggest difference is the number of shaders: AMD has increased the number of stream processors from 960 to 1120 (+17%). The pixel fill rate has risen 5% (22.9 vs. 21.8 GPixel/s), and the texture fill rate has increased about 23% (40.0 vs. 32.6 GTexel/s)., 27840=Enough about the case - time to take a look at the graphic card itself. The  Radeon HD 6990M resembles its predecessor (the HD 6970M) in a few ways. Both graphic cards use the desktop Barts chip with 1700 million transistors and have 2 GB of fast GDDR5 VRAM which operates at 900 MHz (bandwidth: 115.2 GB/s). The memory interface is also identical; 256 bit is right now more than enough for GDDR5 memory. The GPUs were produced in the 40 nm format., 1377=The Radeon HD 6990M delivers a great performance in the 3DMark 11 (1280 x 720, Performance setting). The GPU score of 3179 points beats almost all single mobile graphic cards. The Radeon HD 6970M is left behind at 2834 points @ Eurocom Racer (-11%), The GeForce GTX 485M scores around 16% less (2668 points @ Schenker XMG P501). The GeForce GTX 580M rubs shoulders with its AMD competition with a score of 3191 points (Alienware M17x R3). In our experience, the 3DMark 11 benchmark usually favors the AMD graphic cards., 41283=The Eurocom Panther 3.0 is extremely well-equipped with other high-end hardware modules, such as: 12 GB DDR3-RAM (1600 MHz @ 1333 MHz) and three Intel 510 SSDs in RAID 0 ( each 250 GB). The performance of the three Solid State Drives in RAID mode is incredible. We measured a sequential read and write rate of 600 MB/sec with the AS SSD benchmark. So how much does all this cost?  Eurocom has priced this configuration above 5000 Euros - hefty.}",
    "TableContextTimeStampAfterTable": "{387734=In the Unigine Heaven 2.1 benchmark, the frame rate rose about 6% from 37.2 to 39.4 fps (1280 x 1024, High, Tessellation normal). The GPU score of the 3DMark 11 (1280 x 720, Performance setting) increased about 4% (3299 vs. 3179 points). As long as the cooling system is adequate, users can push the graphic card to enjoy a bit extra performance. With overclocking, the Radeon HD 6990M almost reaches the level of the far more expensive GeForce GTX 580M., 366743=As expected, the Radeon HD 6990M is an exceptionally powerful \"High-End\" graphic card. It can deliver fluid gameplay with the highest graphics settings and high resolutions for almost any game (Metro 2033 and Crysis 2 are two exceptions). The graphic card even has enough power to turn up the anti-aliasing for most games., 387193=We tried to manually overclock the Radeon HD 6990M in an effort to coax as much performance as possible out of it. Overdrive allows the graphic card core and memory to turn up to 740 and 1000 MHz respectively. This is a rise of 3% (core) and 11% (memory) respectively. In short: the performance rose noticeably after the overclocking. In Dirt 3, the overclocking really upped the performance: from 35.3 fps to 37.6 fps which is a plus of 7% (1920 x 1080, Ultra High, 4x AA)., 10610=Let us move on to the gaming performance. For our game tests, the Eurocom Panther 3.0 had to compete with the Eurocom Racer (Core i7-2720QM, Radeon HD 6970M), as well as the Schenker XMG P501 (Core i7-2720QM, GeForce GTX 580M). In an attempt to hold the influence of the CPU to a minimum, we picked the highest settings with a resolution of 1920 x 1080 pixels. The use of any other model, aside from the ones mentioned above, is noted in the game test., 106122=The benchmark results from Call of Duty: Black Ops surprised us. As in, Modern Warfare 2 and Starcraft 2, the performance of the Radeon HD 6990M lay lower than that of the slower Radeon HD 6970M. While the latter managed 74.5 fps (1920 x 1080, Extra, 4x AA & 8x AF) in single player campaign, the HD 6990M could \"only\" deliver 70.1 fps (-6%)., 215260=1920 x 1080 pixels and Ultra settings coaxed a tired smile from the Radeon HD 6990M - 55.7 fps speaks loudly. As already mentioned before, the Radeon HD 6970M takes the lead from its stronger successor with 58.6 fps (difference of 5%). The GeForce GTX 580M lies above the other two with 58.8 fps (+6%)., 11902=Almost every years, Codemasters releases a high-quality racing game. Their latest creation, Dirt 3, is delivered smoothly to the screen with ultra high details by the Radeon HD 6990M. The graphic card managed 35.3 fps in the integrated game benchmark with 4x AA and a resolution of 1920 x 1080 pixels., 259712=This immersive game from the Ukraine developer 4A Games, can make even the Radeon HD 6990M shudder. Very high details, 1920 x 1080 pixels and DX 11 mode drop the frames to 19.1 fps, which means that the user will not be able to properly enjoy the game with these settings., 165421=As Mafia 2 has modest hardware requirements, the Radeon HD 6990M runs this game without a problem. In the integrated benchmark the graphic card delivers an impeccable 60.3 fps with high details, 16x AF, and a resolution of 1920 x 1080 pixels., 4819=The Unigine Heaven benchmark (1280 x 1024, High, Tessellation normal) favors Nvidia. The Radeon HD 6990M (37.2 fps) can not beat the GeForce GTX 485M (40.9 fps, +10%), or the GeForce GTX 580M (43.8 fps, +18%). The cheaper Radeon HD 6970M lies further behind: 33.2 fps (11% gap). However, the performance of all four graphic cards is very strong, and so the user should be content for the next 1-2 years., 314397=The biggest challenger of the Call of Duty series can not bring the Radeon HD 6990M to its knees. The boat trip at the beginning of the single-player campaign runs fluidly at 54.8 fps on the display with a resolution of 1920 x 1080 pixels, high details, 4x AA, 8x AF, an activated HBAO., 67564=The demanding Ego-Shooter, Crysis 2, takes everything the Radeon HD 6990M has to offer and is hungry for more. Even without the DirectX 11 patch, and high-resolution textures, the single player campaign did not run fluidly. Fraps measured on average 34 fps with 1920x1080 pixels and Extreme settings. Sadly, that is too little for a game which runs in the First-Person perspective.}",
    "lastModified": "Wed, 29 Jul 2015 01:44:29 GMT",
    "textBeforeTable": "Passionate gamers, who want to avoid the problems of a dual-CPU system, will be pleased with the Radeon HD 6990M. The Radeon HD 6970M loses its spot at the top of the AMD ladder. In our tests, the HD 6970M was around 5% slower than the 6990M. Sadly, even the Radeon HD 6990M cannot beat the graphic card currently holding #1: Nvidia's GeForce GTX 580M processes around 8% faster. As expected, the Radeon HD 6990M is an exceptionally powerful \"High-End\" graphic card. It can deliver fluid gameplay with the highest graphics settings and high resolutions for almost any game (Metro 2033 and Crysis 2 are two exceptions). The graphic card even has enough power to turn up the anti-aliasing for most games. Benchmark overview 105.4 \"> font-weight:bold; border: 1px solid #550000; color: #ffffff; text-align: right; line-height: 16px; padding-bottom:auto; padding-top:auto; padding: 3px; margin: 1px; width: 310px; height: 16px; background: #8a0101; (max)  990X EE, GeForce GTX 580M SLI    ... 56.7 \"> font-weight:bold; border: 1px solid #550000; color: #ffffff; text-align: right; line-height: 16px; padding-bottom:auto; padding-top:auto; padding: 3px; margin: 1px; width: 180.62618595825px; height: 16px; background: #8a0101; Schenker XMG U700 ULTRA",
    "textAfterTable": "64.6 -6% 81 18% Total Average (Program / Settings) -5% / -5% 8% / 8% We have the feeling that the graphic card could have performed better with a few tweaks. A few of our benchmarks indicated that the latest driver is not yet 100% compatible with the Radeon HD 6990M. The following table summarizes all the game test results. Readers who want to compare the gaming performance with that of other graphic cards, should look at our Game List. low med. high ultra Need for Speed Shift (2009) 105.3 91.7 68.8 fps Resident Evil 5 (2009) 201.6 118.6 84.2 fps Risen (2009) 157.5",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}