{
    "relation": [
        [
            "Citing Patent",
            "US7562810 *",
            "US7837099",
            "US8126773",
            "US8452645 *",
            "US8533036 *",
            "US8533083",
            "US8843385 *",
            "US20090192890 *",
            "US20120041808 *",
            "US20120041810 *",
            "US20120095820 *",
            "US20120226603 *",
            "WO2008083119A1 *",
            "WO2008150893A1 *"
        ],
        [
            "Filing date",
            "Aug 10, 2006",
            "Aug 10, 2006",
            "Aug 10, 2006",
            "Jan 29, 2008",
            "Oct 12, 2011",
            "Mar 23, 2010",
            "Dec 11, 2006",
            "",
            "Aug 13, 2010",
            "Aug 13, 2010",
            "Oct 12, 2011",
            "",
            "Dec 21, 2007",
            "May 29, 2008"
        ],
        [
            "Publication date",
            "Jul 21, 2009",
            "Nov 23, 2010",
            "Feb 28, 2012",
            "May 28, 2013",
            "Sep 10, 2013",
            "Sep 10, 2013",
            "Sep 23, 2014",
            "Jul 30, 2009",
            "Feb 16, 2012",
            "Feb 16, 2012",
            "Apr 19, 2012",
            "Sep 6, 2012",
            "Jul 10, 2008",
            "Dec 11, 2008"
        ],
        [
            "Applicant",
            "Oracle International Corporation",
            "Oracle International Corporation",
            "Oracle International Corporation",
            "Maritz Holdings Inc.",
            "Rewardspay, Inc.",
            "Loylogic Licensing Inc.",
            "Ecole Polytechnique Federale De Lausanne (Epfl)",
            "Maritz Inc.",
            "Loylogic Licensing Inc.",
            "Loylogic Licensing Inc.",
            "Vasanthi Chandrasekaram",
            "Vervise, Llc",
            "Visa Int Service Ass",
            "Joshua E Bestwick"
        ],
        [
            "Title",
            "Method and system for enabling multiple payment options in loyalty program transactions",
            "Partner account debit process",
            "Configurable enrollment data capture framework",
            "Interface between two reward programs for concurrently redeeming currencies",
            "Rewards based currency processing system",
            "Method and systems for generating dynamic rewards currency values",
            "Quality of service monitoring of a service level agreement using a client based reputation mechanism encouraging truthful feedback",
            "Interface between two reward programs for consolidating currency for redemption",
            "Mobile System and Method for Loyalty Currency Redemption",
            "Universal System and Method for Loyalty Currency Redemption",
            "Rewards Based Currency Processing System",
            "Systems and methods for transactions and rewards in a social network",
            "Real-time balance updates",
            "Method for enabling the exchange of online favors"
        ]
    ],
    "pageTitle": "Patent US20060248007 - Methods and systems for generating dynamic reward currency values - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20060248007?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00204-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480605031,
    "recordOffset": 480574664,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6316=FIG. 4 shows a “non-monetary currency value curve” that may be displayed to user 105 and may indicate the change of the “non-monetary currency shopping value” for user 105. The higher his/her share of cash is in the payment combination, the higher the value of each unit of non-monetary currency may be. As shown in FIG. 4, non-monetary currency value growth, for example, may be 0.1% before achieving the coverage price and may change to 5% after the coverage price for the product is reached. The change in value for user 105 may be important. In the current example, the “non-monetary currency shopping value” starts at $0.00177 (when $1 is paid in cash) and ends at $0.01489 (when $99 is paid in cash) which corresponds to a value increase for the user over 740% (all at the same price per point for the underlying reward program.)}",
    "TableContextTimeStampAfterTable": "{42049=To finance the rewards, reward program sponsors back up their non-monetary currency (program liability). Therefore every program sponsor attributes a backup value per non-monetary currency unit issued (e.g., US$0.01). Such backup values per non-monetary currency unit vary heavily among programs and typically depend on an enterprise's cost structure and/or general margin as well as an industry's competitive environment. For example, airline frequent flyer programs offer free seats for flights or upgrades as rewards. For such free seats, airlines only back up the variable cost. Since the airline industry's cost structure generates high fixed and low variable cost, the cost of such free seats are minimal compared to other programs. For example, if the participant of a frequent flyer program redeems 20,000 miles to purchase a flight having an average retail value of $400, the variable cost to the frequent flyer program might be around $50. Due to the great value for both airlines and customers, frequent flyer programs world-wide have been very successful. However, it has also led to a world wide frequent flyer program mileage liability of over 14 trillion miles by the end of 2004, making frequent flyer miles the biggest currency in the world. As a consequence, airlines face pressure on free seat availability while customers face devaluation of their mileage currency. In some situations, airlines offer non-flight rewards (products or services) to provide their customers alternative rewards. However, such alternative rewards are usually low-value mileage redemption opportunities. For example, an airline may offer a box of chocolates for 20,000 miles as a non-flight reward to its frequent flyer program participants. While the cost to the frequent flyer program facilitator is $50 for both the box of chocolates or the flight, the retail value to a customer for these two rewards differs substantially. The retail value to the program participant for a flight is $400 as compared to the $55 retail value for the box of chocolates.}",
    "textBeforeTable": "Referenced by It is intended, therefore, that the specification and examples be considered as exemplary only, with a true scope and spirit of the invention being indicated by the following claims and their full scope of equivalents. While certain features and embodiments of the invention have been described, other embodiments of the invention will be apparent to those skilled in the art from consideration of the specification and practice of the embodiments of the invention disclosed herein. Furthermore, although embodiments of the present invention have been described as being associated with data stored in memory and other storage mediums, one skilled in the art will appreciate that these aspects can also be stored on or read from other types of computer-readable media, such as secondary storage devices, like hard disks, floppy disks, or a CD-ROM, a carrier wave from the Internet, or other forms of RAM or ROM. Further, the steps of the disclosed methods may be modified in any manner, including by reordering steps and/or inserting or deleting steps, without departing from the principles of the invention. The CD player was purchased for $50. If the reward program member chooses the option to purchase the CD player using a combination of $75 cash and 1,000 miles, the present invention allows the system to provide the purchaser of the CD player with a substantially increased value for",
    "textAfterTable": "* Cited by examiner Classifications U.S. Classification 705/40 International Classification G06Q40/00 Cooperative Classification G06Q20/102, G06Q40/00, G06Q30/0233, G06Q40/12, G06Q30/0222, G06Q30/02 European Classification G06Q30/02, G06Q20/102, G06Q40/00, G06Q30/0233, G06Q40/10, G06Q30/0222 Legal Events Date Code Event Description Feb 24, 2010 AS Assignment Owner name: LOYLOGIC,SWITZERLAND Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:HOFER, DOMINIC;FRIEDEN, BRUNO M.;REEL/FRAME:023988/0054 Effective date: 20050504 Feb 22, 2011 AS Assignment Owner name: LOYLOGIC LICENSING INC., SWITZERLAND Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:LOYLOGIC;REEL/FRAME:025844/0645 Effective date: 20110222 Sep 27, 2013 FPAY Fee payment",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}