{
    "relation": [
        [
            "Citing Patent",
            "US7555556 *",
            "US7978064",
            "US8060128 *",
            "US8063789 *",
            "US8135443 *",
            "US8155590 *",
            "US8160634",
            "US8280456",
            "US8285340",
            "US8351895",
            "US8519834",
            "US8538484",
            "US8674825",
            "US8718193",
            "US8730031",
            "US8802183",
            "US8816847",
            "US8868453",
            "US8912908",
            "US8945005",
            "US8956287",
            "US8972573",
            "US8976724",
            "US8983381 *",
            "US8989659 *",
            "US9014779",
            "US9048881 *",
            "US9060708",
            "US9075587",
            "US9083589",
            "US20110021147 *",
            "US20110093583 *",
            "US20120122399 *",
            "US20120314745 *",
            "US20130137369 *"
        ],
        [
            "Filing date",
            "9 Feb 2006",
            "",
            "17 Mar 2009",
            "24 Apr 2007",
            "31 Aug 2006",
            "12 Feb 2008",
            "26 Oct 2009",
            "14 Aug 2009",
            "26 Sep 2011",
            "4 Sep 2009",
            "22 Aug 2010",
            "2 Jul 2010",
            "13 Mar 2009",
            "19 Nov 2007",
            "11 Jul 2011",
            "11 Jul 2011",
            "3 Jun 2011",
            "4 Nov 2010",
            "11 Jul 2011",
            "25 Oct 2007",
            "2 May 2007",
            "9 Sep 2013",
            "19 Apr 2011",
            "10 Nov 2011",
            "10 Sep 2012",
            "28 Jan 2011",
            "5 Jun 2012",
            "25 Jul 2014",
            "3 Jul 2012",
            "6 Mar 2014",
            "19 Jul 2010",
            "",
            "",
            "",
            "10 Sep 2012"
        ],
        [
            "Publication date",
            "30 Jun 2009",
            "12 Jul 2011",
            "15 Nov 2011",
            "22 Nov 2011",
            "13 Mar 2012",
            "10 Apr 2012",
            "17 Apr 2012",
            "2 Oct 2012",
            "9 Oct 2012",
            "8 Jan 2013",
            "27 Aug 2013",
            "17 Sep 2013",
            "18 Mar 2014",
            "6 May 2014",
            "20 May 2014",
            "12 Aug 2014",
            "26 Aug 2014",
            "21 Oct 2014",
            "16 Dec 2014",
            "3 Feb 2015",
            "17 Feb 2015",
            "3 Mar 2015",
            "10 Mar 2015",
            "17 Mar 2015",
            "24 Mar 2015",
            "21 Apr 2015",
            "2 Jun 2015",
            "23 Jun 2015",
            "7 Jul 2015",
            "14 Jul 2015",
            "27 Jan 2011",
            "21 Apr 2011",
            "17 May 2012",
            "13 Dec 2012",
            "30 May 2013"
        ],
        [
            "Applicant",
            "Ricoh Company, Ltd.",
            "Proteus Biomedical, Inc.",
            "Sprint Spectrum L.P.",
            "Mission Control Design Gmbh",
            "Qualcomm Incorporated",
            "Samsung Electronics Co., Ltd",
            "Sprint Spectrum L.P.",
            "Google Inc.",
            "Google Inc.",
            "Zomm, Llc",
            "Andrea Theresa Jersa",
            "Google Inc.",
            "Proteus Digital Health, Inc.",
            "Proteus Digital Health, Inc.",
            "Proteus Digital Health, Inc.",
            "Proteus Digital Health, Inc.",
            "Proteus Digital Health, Inc.",
            "Proteus Digital Health, Inc.",
            "Proteus Digital Health, Inc.",
            "Proteus Digital Health, Inc.",
            "Proteus Digital Health, Inc.",
            "Apple Inc.",
            "Zomm, Llc",
            "Samsung Electronics Co., Ltd.",
            "Kabushiki Kaisha Toshiba",
            "Proteus Digital Health, Inc.",
            "Fu Da Tong Technology Co., Ltd.",
            "Proteus Digital Health, Inc.",
            "Fu Da Tong Technology Co., Ltd.",
            "Proteus Digital Health, Inc.",
            "Tout Walid R",
            "Apple Inc.",
            "Samsung Electronics Co., Ltd.",
            "Fu Da Tong Technology Co., Ltd.",
            "Kabushiki Kaisha Toshiba"
        ],
        [
            "Title",
            "System, computer program product and method for using a wireless device to control a wireless network device",
            "Communication system with partial power source",
            "Intelligence in power control algorithm",
            "Method and apparatus for monitoring the maximum distance between two objects",
            "Portable device with priority based power savings control and method thereof",
            "Apparatus and method for bluetooth connection in a portable communication system",
            "Intelligent power control in a wireless network",
            "Providing a user with feedback regarding power consumption in battery-operated electronic devices",
            "Providing a user with feedback regarding power consumption in battery-operated electronic devices",
            "Wireless security device and method to place emergency calls",
            "Wrist wound vibrating device",
            "Providing a user with feedback regarding power consumption in battery-operated electronic devices",
            "Pharma-informatics system",
            "Active signal processing personal health signal receivers",
            "Communication system using an implantable device",
            "Communication system with enhanced partial power source and method of manufacturing same",
            "Communication system with partial power source",
            "System for supply chain management",
            "Communication system with remote activation",
            "Controlled activation ingestible identifier",
            "Patient customized therapeutic regimens",
            "Triggering actions based on changes in a network connection",
            "Method and system for repackaging wireless data",
            "Multi-mode short-range wireless signal processing apparatus and method",
            "Wireless communication device, power transmitter, and IC card device",
            "Data gathering system",
            "Method of time-synchronized data transmission in induction type power supply system",
            "Multi-mode communication ingestible event markers and systems, and methods of using the same",
            "Induction type power supply system with synchronous rectification control for data transmission",
            "Active signal processing personal health signal receivers",
            "System and method for determining connectivity status of short range wireless devices",
            "Triggering actions based on changes in a network connection",
            "Wireless signal processing apparatus and method",
            "Method of time-synchronized data transmission in induction type power supply system",
            "Wireless communication device, power transmitter, and ic card device"
        ]
    ],
    "pageTitle": "Patent US7336929 - Short range wireless communication system, portable terminal apparatus, and ... - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US7336929?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00034-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486286887,
    "recordOffset": 486259223,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6452=FIG. 3 is a block diagram showing a typical structure of control hardware in the mobile phone 10. The overall operation of the mobile phone 10 is controlled by a CPU 113. The CPU 113 is connected via a control line 100 to a communication circuit 103, a display control unit 109, an operation unit 106, a ROM 107, a RAM 108, a BT (Bluetooth) communication circuit unit 112, and a voice codec 114. These components connected to the CPU 113 are controlled thereby. The communication circuit 103 performs transmitting and receiving processes of the mobile phone and is connected to a base station through a wireless interface and an antenna 102. The display control unit 109 controls a display unit 110 such as a liquid crystal display unit. The operation unit 106 is furnished with numeric keys and other operation keys that accept commands entered by the user. The ROM 107 stores fixed programs for execution by the CPU 113 as well as fixed data used by the CPU 113 in conjunction with its processing. The RAM 108 is a memory that offers a temporary storage area and a working area in which the CPU 113 handles data. The ROM 107 may include a rewritable memory such as flash memory. The voice codec 114 is connected to a speaker 104 and a microphone 105 and carries out voice signal processing and input/output processing. The BT communication circuit unit 112 serves as the short-rage wireless communication facility of this embodiment and communicates wirelessly with the wireless communication apparatus 20 via a BT antenna 111. A data line 101 is connected to the CPU 113, communication circuit 103, display control unit 109, ROM 107, RAM 108, voice codec 114, and BT communication circuit unit 112. As such, the data line 101 serves as a data transfer path between these components.}",
    "TableContextTimeStampAfterTable": "{34843=One proposed solution to the problems above involves having authentication data transmitted from a suitable wireless card or authentication card to the portable terminal so that the terminal is rendered usable only when authenticated by the transmitted data, whereby the abuse of the terminal by anyone other than its legitimate user can be prevented (as disclosed in Japanese Patent Laid-Open Nos. 2001-352579 and 2001-358827)., 33815=The present invention contains subject matter related to Japanese Patent Application JP 2004-198175 filed with the Japanese Patent Office on Jul. 5, 2004, the entire contents of which being incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations Thus the scope of the invention should be determined by the appended claims and their legal equivalents, rather than by the examples given. In the description above, the apparatus targeted for protection against misplacement or theft was explained by citing electronic equipment such as the portable terminal apparatus. Alternatively, the short-range wireless communication facility described above as part of the portable terminal apparatus may be made independent. When turned into a stand-alone unit, the short-range wireless communication facility practiced according to this invention may be attached to (housed in or mounted on) the user's personal effects such as brief cases or handbags. Although the description above contains many specificities, these should not be construed as limiting the scope of the invention but as merely providing illustrations of some of the presently preferred embodiments of this invention. It is to be understood that changes and variations may be made without departing from the spirit or scope of the claims that follow. For example, although the wireless communication apparatus was shown used in combination with one portable terminal apparatus, this is not limitative of the invention. Alternatively, the same wireless communication apparatus may be shared by a plurality of portable terminals owned by the user. involves getting the wireless communication apparatus temporarily to reduce its adjustable upper limit of power in step S61 after entering the reduced power mode. When the active mode is",
    "textAfterTable": "US8816847 3 Jun 2011 26 Aug 2014 Proteus Digital Health, Inc. Communication system with partial power source US8868453 4 Nov 2010 21 Oct 2014 Proteus Digital Health, Inc. System for supply chain management US8912908 11 Jul 2011 16 Dec 2014 Proteus Digital Health, Inc. Communication system with remote activation US8945005 25 Oct 2007 3 Feb 2015 Proteus Digital Health, Inc. Controlled activation ingestible identifier US8956287 2 May 2007 17 Feb 2015 Proteus Digital Health, Inc. Patient customized therapeutic regimens US8972573 9 Sep 2013 3 Mar 2015 Apple Inc. Triggering actions based on changes in a network connection US8976724 19 Apr 2011 10 Mar 2015 Zomm, Llc Method and system for repackaging wireless data US8983381 * 10 Nov 2011 17 Mar 2015 Samsung Electronics Co., Ltd. Multi-mode short-range wireless signal processing apparatus and method US8989659",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}