{
    "relation": [
        [
            "Citing Patent",
            "US6117014 *",
            "US6139432 *",
            "US6165073 *",
            "US6234901 *",
            "US6267669 *",
            "US6361438 *",
            "US6368217 *",
            "US6390918 *",
            "US6398650 *",
            "US6409604 *",
            "US6411303 *",
            "US6419577 *",
            "US6424353 *",
            "US6429874 *",
            "US6431982 *",
            "US6475084 *",
            "US6612930",
            "US6623359 *",
            "US6626760",
            "US6639594 *",
            "US6676518",
            "US6692357",
            "US6699127",
            "US6712703 *",
            "US6749508",
            "US6767286",
            "US6784882 *",
            "US6784901",
            "US6831659 *",
            "US6855057 *",
            "US6917371",
            "US6971957 *",
            "US6972758 *",
            "US6980214 *",
            "US6989829",
            "US7104891 *",
            "US7137891",
            "US7455589",
            "US7532211",
            "US7564457 *",
            "US7737978 *",
            "US7783535",
            "US7796132 *",
            "US7946909",
            "US8210943",
            "US8342926",
            "US8827804",
            "US8884960 *",
            "US8968093 *",
            "US20010018362 *",
            "US20010040575 *",
            "US20020068626 *",
            "US20040224760 *",
            "US20050001834 *",
            "US20050035979 *",
            "US20100302237 *",
            "US20110034227 *",
            "US20130005458 *",
            "EP1208885A1"
        ],
        [
            "Filing date",
            "Nov 17, 1998",
            "Apr 21, 1999",
            "Oct 28, 1998",
            "Nov 21, 1997",
            "Nov 29, 1999",
            "Jul 24, 1998",
            "Feb 12, 1998",
            "Oct 4, 1999",
            "Mar 2, 2000",
            "Mar 29, 2000",
            "Aug 27, 1998",
            "Mar 18, 1999",
            "Sep 9, 1998",
            "Jan 16, 1998",
            "Oct 21, 1998",
            "Dec 27, 1999",
            "Oct 10, 2001",
            "Apr 23, 1999",
            "Oct 12, 2000",
            "Jun 3, 2001",
            "Jul 24, 2000",
            "Nov 17, 1999",
            "Sep 27, 2000",
            "Nov 19, 1999",
            "Oct 29, 2001",
            "Oct 12, 1999",
            "Sep 6, 2000",
            "Aug 31, 2000",
            "May 12, 1999",
            "Mar 29, 2001",
            "Oct 12, 1999",
            "Apr 8, 2003",
            "Aug 2, 2004",
            "Dec 27, 2000",
            "Feb 18, 1998",
            "Nov 6, 2002",
            "Jan 31, 2001",
            "Mar 13, 2006",
            "Jun 30, 2005",
            "Jun 15, 2006",
            "Apr 27, 2005",
            "Jan 15, 2004",
            "Oct 24, 2000",
            "Oct 31, 2006",
            "Jan 4, 2007",
            "Sep 15, 2008",
            "Jul 3, 2012",
            "Feb 2, 2010",
            "Jul 15, 2004",
            "Dec 27, 2000",
            "Feb 18, 1998",
            "Oct 2, 2001",
            "Jan 15, 2004",
            "Aug 2, 2004",
            "May 13, 2004",
            "Feb 2, 2010",
            "Aug 5, 2009",
            "Jul 2, 2012",
            "Oct 30, 2001"
        ],
        [
            "Publication date",
            "Sep 12, 2000",
            "Oct 31, 2000",
            "Dec 26, 2000",
            "May 22, 2001",
            "Jul 31, 2001",
            "Mar 26, 2002",
            "Apr 9, 2002",
            "May 21, 2002",
            "Jun 4, 2002",
            "Jun 25, 2002",
            "Jun 25, 2002",
            "Jul 16, 2002",
            "Jul 23, 2002",
            "Aug 6, 2002",
            "Aug 13, 2002",
            "Nov 5, 2002",
            "Sep 2, 2003",
            "Sep 23, 2003",
            "Sep 30, 2003",
            "Oct 28, 2003",
            "Jan 13, 2004",
            "Feb 17, 2004",
            "Mar 2, 2004",
            "Mar 30, 2004",
            "Jun 15, 2004",
            "Jul 27, 2004",
            "Aug 31, 2004",
            "Aug 31, 2004",
            "Dec 14, 2004",
            "Feb 15, 2005",
            "Jul 12, 2005",
            "Dec 6, 2005",
            "Dec 6, 2005",
            "Dec 27, 2005",
            "Jan 24, 2006",
            "Sep 12, 2006",
            "Nov 21, 2006",
            "Nov 25, 2008",
            "May 12, 2009",
            "Jul 21, 2009",
            "Jun 15, 2010",
            "Aug 24, 2010",
            "Sep 14, 2010",
            "May 24, 2011",
            "Jul 3, 2012",
            "Jan 1, 2013",
            "Sep 9, 2014",
            "Nov 11, 2014",
            "Mar 3, 2015",
            "Aug 30, 2001",
            "Nov 15, 2001",
            "Jun 6, 2002",
            "Nov 11, 2004",
            "Jan 6, 2005",
            "Feb 17, 2005",
            "Dec 2, 2010",
            "Feb 10, 2011",
            "Jan 3, 2013",
            "May 29, 2002"
        ],
        [
            "Applicant",
            "Konami Co., Ltd.",
            "Fuji Photo Film Co., Ltd.",
            "Nintendo Co., Ltd.",
            "Kabushiki Kaisha Sega Enterprises",
            "International Game Technology",
            "Konami Co., Ltd.",
            "Kabushiki Kaisha Sega Enterprises",
            "Konami Co., Ltd.",
            "Konami Computer Entertainment Japan, Inc.",
            "Square Co., Ltd.",
            "Sanyo Electric Co., Ltd",
            "Kabushiki Kaisha Bandai",
            "Sega Enterprises, Ltd.",
            "Namco Ltd.",
            "Konami Co., Ltd.",
            "Kabushiki Kaisha Konami Computer Entertainment Osaka",
            "Nintendo Co., Ltd.",
            "Namco Ltd.",
            "Nintendo Co., Ltd.",
            "Microsoft Corporation",
            "Konami Corporation",
            "Nintendo Co., Ltd.",
            "Nintendo Of America Inc.",
            "Nintendo Co., Ltd.",
            "Konami Corporation",
            "Kabushiki Kaisha Sega Enterprises",
            "Sony Computer Entertainment Inc.",
            "There",
            "Kabushiki Kaisha Sega Enterprises",
            "Kceo Inc.",
            "Kabushiki Kaisha Sega Enterprises",
            "Nintendo Co., Ltd.",
            "Sony Computer Entertaiment Inc.",
            "Square Co., Ltd.",
            "Kabushiki Kaisha Sega Enterprises",
            "Nintendo Co., Ltd.",
            "Sony Computer Entertainment America Inc.",
            "Sony Computer Entertainment America Inc.",
            "Kabushiki Kaisha Sega Enterprises",
            "Pixar",
            "Konami Digital Entertainment Co., Ltd.",
            "Nintendo Co., Ltd.",
            "Namco Bandai Games Inc.",
            "Sony Computer Entertainment America Llc",
            "Sony Computer Entertainment America Llc",
            "Sony Computer Entertainment America Llc",
            "Sony Computer Entertainment America Llc",
            "Nec Corporation",
            "Intel Corporation",
            "Square Co., Ltd.",
            "Norio Haga",
            "Yasushi Takeda",
            "Nintendo Co., Ltd.",
            "Sony Computer Entertainment Inc.",
            "Kabushiki Kaisha Sega Enterprises",
            "Casio Hitachi Mobile Communications Co., Ltd.",
            "Wei-Hsuan Wu",
            "3G Studios, Inc.",
            "Konami Corporation"
        ],
        [
            "Title",
            "Video game machine, action scoring method in video game, and recording medium on which action scoring program is recorded",
            "Image capture apparatus and method",
            "Video game apparatus and memory medium therefor",
            "Game device, picture data and flare forming method",
            "Hybrid gaming apparatus and method",
            "Video game transparency control system for images",
            "Input device, data processing device, data processing method, game device and medium",
            "Video game apparatus, model display method for video games, and readable recording medium for storing model display program for video games",
            "Game system, game progress control method, and computer-readable storage medium with a stored game program",
            "Computer readable program product, method of controlling display of game and game system",
            "Method of efficiently recording a number of texture images in memory",
            "Semi-real time simulation type video game device",
            "Computer game apparatus",
            "Image generating apparatus and method",
            "Video game system using radar picture",
            "Video game device, play control method for video game, and readable recording medium recording the method",
            "Video game apparatus and method with enhanced virtual camera control",
            "Game machine and information storage medium",
            "Video game apparatus and memory medium therefor",
            "View-dependent image synthesis",
            "Image generating device, an image generating method, a readable storage medium storing an image generating program and a video game system",
            "Video game apparatus and method with enhanced player object action control",
            "Real-time replay system for video game",
            "Video game apparatus and information storage medium for video game",
            "Display method and apparatus for displaying probability controlled orders of dynamic movements",
            "Game device, picture data forming method and medium",
            "Methods and apparatus for rendering an image including portions seen through one or more objects of the image",
            "Method, system and computer program product for the delivery of a chat message in a 3D multi-user environment",
            "Image processor unit, game machine, image processing method, and recording medium",
            "Network game system, network game device, network game method and readable storage medium storing network game program",
            "Game device, picture data forming method and medium",
            "Game system and program using a shadow volume to display a shadow of an object in a three dimensional video game",
            "Methods and apparatus for rendering an image including portions seen through one or more objects of the image",
            "Methods and apparatus for shading object drawings in video games",
            "Image processing device and image processing method",
            "Game machine and game program for displaying a first object casting a shadow formed by light from a light source on a second object on a virtual game space",
            "Game playing system with assignable attack icons",
            "Game playing system with assignable attack icons",
            "Image processing device and image processing method",
            "Shot shading method and apparatus",
            "Display, displaying method, information recording medium, and program",
            "Video game apparatus and information storage medium for video game",
            "Image generation system and program",
            "Ordered execution of actions in a game environment",
            "Target interface",
            "Game aim assist",
            "Target interface",
            "Controlling displayed 3-D depth based on the brightness of the surrounding area and/or based on the brightness of the display",
            "Dynamic insertion of personalized content in online game scenes",
            "Methods and apparatus for shading object drawings in video games",
            "Image processing device and image processing method",
            "Method related to object control of video game",
            "Video game apparatus and information storage medium for video game",
            "Methods and apparatus for rendering an image including portions seen through one or more objects of the image",
            "Image processing unit, game machine, image processing method, and recording medium",
            "Terminal Device and Control Program Thereof",
            "Reaction-training game machine",
            "Dynamic lighting and rendering techniques implemented in gaming environments",
            "Computer-readable recording medium storing display control program and display control device and method"
        ]
    ],
    "pageTitle": "Patent US5947823 - Three-dimensional game apparatus and image synthesizing method - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5947823?dq=6,373,753",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00152-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475890287,
    "recordOffset": 475860897,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{110398=The storage medium 1306 stores program codes for executing the computation of the virtual time, the computation of the positional object information, the three-dimensional computation and other computations. These program codes are then read out from the storage medium 1306 through the CPU 1100, image synthesizing unit 1220 and other units and executed so that various different processes described in connection with the first and second embodiments can be accomplished., 109007=The present invention may be applied to a home game apparatus, besides the service three-dimensional game apparatus. FIG. 19 shows a block diagram of a home game apparatus to which the present invention is applied. The home game apparatus comprises a main device 1000, a controller 1012 and a storage medium 1306 such as CD-ROM, game cassette, memory card, MO disc. The created images and sounds are outputted toward a TV monitor 1010 or the like so that a player can enjoy in playing a game. The main device 1000 comprises a CPU 1100 having a virtual three-dimensional space computation unit, a three-dimensional computation unit 1210, an image synthesizing unit 1220 including an image forming section 1228, a sound synthesizing unit 1300, a working RAM 1302 and a backup memory (memory card or the like) 1304 for backing up the data. The computation of the passage of time may be performed only by a program (program codes) that has been stored in a storage medium 1306. Alternatively, a time computing device may be mounted and used in the game apparatus together with a program. If the storage medium 1306 is replaced by a new storage medium for performing another program, it is desirable that the virtual time in the old storage medium is saved and stored in the backup memory 1304. If the program is re-started, the game will be started at the saved virtual time.}",
    "textBeforeTable": "Patent Citations The present invention may be similarly applied to a game apparatus in which synthesized game images are displayed on a display known as a head mount display (HMD). The structures of the virtual three-dimensional space computation unit, three-dimensional computation unit, image forming unit and other units as well as the computing techniques are not limited to those of the first and second embodiments. The computation executed in the virtual three-dimensional space computation unit, three-dimensional computation unit, image forming unit or other unit may be processed by the use of an exclusive image processing device or software-processed by utilizing a multi-purpose microcomputer, DSP or the like. The present invention may be similarly applied to a so-called multimedia terminal or a big attraction type game apparatus in which a number of players play the game. The storage medium 1306 stores program codes for executing the computation of the virtual time, the computation of the positional object information, the three-dimensional computation and other computations. These program codes are then read out from the storage medium 1306 through the CPU 1100, image synthesizing unit 1220 and other units and executed so that various different processes described in connection with the first and second embodiments can be accomplished. The present invention may be applied to a home game apparatus, besides the service three-dimensional game apparatus. FIG. 19 shows a block diagram of a home game apparatus to which the present invention",
    "textAfterTable": "US20040224760 * Jan 15, 2004 Nov 11, 2004 Nintendo Co., Ltd. Video game apparatus and information storage medium for video game US20050001834 * Aug 2, 2004 Jan 6, 2005 Sony Computer Entertainment Inc. Methods and apparatus for rendering an image including portions seen through one or more objects of the image US20050035979 * May 13, 2004 Feb 17, 2005 Kabushiki Kaisha Sega Enterprises Image processing unit, game machine, image processing method, and recording medium US20100302237 * Feb 2, 2010 Dec 2, 2010 Casio Hitachi Mobile Communications Co., Ltd. Terminal Device and Control Program Thereof US20110034227 * Aug 5, 2009 Feb 10, 2011 Wei-Hsuan Wu Reaction-training game machine US20130005458 * Jul 2, 2012 Jan 3, 2013 3G Studios, Inc. Dynamic lighting and rendering techniques implemented in gaming environments EP1208885A1 Oct 30, 2001 May 29, 2002 Konami Corporation",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}