{
    "relation": [
        [
            "Cited Patent",
            "US3449227 *",
            "US3449230 *",
            "US3626041 *",
            "US3642605 *",
            "US3655550 *",
            "US3658687 *",
            "US3943049 *"
        ],
        [
            "Filing date",
            "8 Nov 1966",
            "8 Nov 1966",
            "13 Nov 1968",
            "23 Jan 1968",
            "12 Mar 1969",
            "14 Nov 1969",
            "17 Apr 1974"
        ],
        [
            "Publication date",
            "10 Jun 1969",
            "10 Jun 1969",
            "7 Dec 1971",
            "15 Feb 1972",
            "11 Apr 1972",
            "25 Apr 1972",
            "9 Mar 1976"
        ],
        [
            "Applicant",
            "Turner Brothers Asbest",
            "Turner Brothers Asbest",
            "Monsanto Co",
            "Ceramique Du Batiment Soc Gen",
            "Xerox Corp",
            "Xerox Corp",
            "Xerox Corporation"
        ],
        [
            "Title",
            "Manufacture of asbestos",
            "Manufacture of asbestos products",
            "Apparatus and process for making continuous filament",
            "Apparatus for the extraction and dehydration of a solid phase from a liquid dispersion",
            "Electrostatic pigment filter",
            "Apparatus for forming images with applicator, shearing, smoothing and cleaning means",
            "Apparatus for separating agglomerated particles within suspensions"
        ]
    ],
    "pageTitle": "Patent US4170542 - Method and machine for manufacturing a plate-like material made from ... - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US4170542",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483176047,
    "recordOffset": 483159657,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13145=This is a divisional application of Ser. No. 679,012, filed Apr. 21, 1976, now U.S. Pat. No. 4,048,037.}",
    "textBeforeTable": "Patent Citations Therefore the invention is not at all limited to the forms of embodiment illustrated and described which have been given by way of example only, but it also comprises all the technical equivalents of the means disclosed as well as their combinations if same are carried out according to its gist and within the scope of the appended claims. In the alternative form of embodiment diagrammatically shown in FIG. 5 there has been used as an anodic surface instead of the outer surfaces of cylinders with circular cross-sections, both converging surfaces of two endless belts 55, 56 which are travelling while converging or tapering towards each other and moving past or in front of a V-shaped counter-electrode 57, whereas the remaining part of the operation of the machine may be the same as that disclosed hereinabove. In that instance the surfaces of the belts 55, 56 should of course be shaped so as to conform their electrode functions for receiving or accommodating the electrophoretic deposits or coatings in order to be also able to constitute a belt conveyor. In the machine illustrated a pair of cylinders having the same diameter and revolving at the same speeds are used for receiving the anodic deposits. Cylinders of different diameters may possibly be used provided that the speeds of rotation be adjusted so that the tangential velocities of both cylinders be substantially the same. There is then possible to",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4264422 * 14 Apr 1980 28 Apr 1981 Kureha Kagaku Kogyo Kabushiki Kaisha Method for producing shaped articles by electrodepositional shaping from fibrous substance having electrophoretic property and apparatus for same US4357222 * 5 Aug 1981 2 Nov 1982 Norton Company Electrolphoretic casting process US4432852 * 18 Feb 1982 21 Feb 1984 Corning Glass Works Method and apparatus for producing mica film US4695356 * 19 Mar 1986 22 Sep 1987 Andromaque S.A. Electrochemical procedure for the direct forming of generally thin elements with various contours and surfaces of usual and technical ceramics or refractory material * Cited by examiner Classifications U.S. Classification 204/623",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}