{
    "relation": [
        [
            "Date",
            "Jul 17, 2002",
            "Oct 2, 2007",
            "Sep 22, 2011",
            "Jan 26, 2012",
            "Mar 16, 2012"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: BIEDERMANN MOTECH GMBH, GERMANY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:BIEDERMANN, LUTZ;HARMS, JURGEN;REEL/FRAME:013120/0416;SIGNING DATES FROM 20020514 TO 20020518",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: BIEDERMANN MOTECH GMBH & CO. KG, GERMANY Free format text: CHANGE OF LEGAL FORM;ASSIGNOR:BIEDERMANN MOTECH GMBH;REEL/FRAME:027603/0504 Effective date: 20090720",
            "Owner name: BIEDERMANN TECHNOLOGIES GMBH & CO. KG, GERMANY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:BIEDERMANN MOTECH GMBH & CO. KG;REEL/FRAME:027873/0551 Effective date: 20120308"
        ]
    ],
    "pageTitle": "Patent US20030023243 - Bone screw and fastening tool for same - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20030023243?dq=5,838,906",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481856051,
    "recordOffset": 481832532,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations [0054] The bone screw is not restricted to the embodiment as polyaxial screw described here. The bone screw can in fact also be constructed as a monoaxial screw, according to which the screw head 3 and the receiver part 5 are constructed in one piece. [0053] As in the first embodiment, a further advantage is that owing to the concentric arrangement of the first and second screw or engagement elements 26, 27 only a small space is needed, which is of great advantage in an operation, as the operating field is always only limited. [0052] In order, for example, to fix a bone screw of the second embodiment, the first and the second screw or engagement element 26, 27 is brought into engagement with the head-fixing screw 12 and the rod-fixing screw 13′. One hand therein grips the first handle 22, while the other hand grips the gear housing 30, which serves as second handle. By rotating the two handles in opposite directions of rotation the first and second screw or engagement elements 26, 27 are also rotated and tightened in opposite directions. It is also possible to perform the rotational movements of the first or second handle or gear housing 22, 30 differently or for example to rotate only one handle and merely to fix the other handle or the gear housing. That means the rotational movements",
    "textAfterTable": "US7371239 Jul 6, 2004 May 13, 2008 Synthes (U.S.A.) Spinal rod insertion instrument US7491207 Apr 12, 2004 Feb 17, 2009 Synthes Usa, Llc Rod persuader US7618440 Apr 9, 2004 Nov 17, 2009 Zimmer Spine, Inc. Temporary spinal fixation apparatuses and methods US7618444 Sep 13, 2004 Nov 17, 2009 Zimmer Spine, Inc. Surgical instrument for moving a vertebra US7771426 * Oct 22, 2004 Aug 10, 2010 University Health Network Bone treatment instrument and method US7794452 * Oct 18, 2004 Sep 14, 2010 Warsaw Orthopedic, Inc. Device and method for positioning and attaching a member such as an implant or jig US7794482 Aug 20, 2007 Sep 14, 2010 Synthes Usa, Llc Device for osteosynthesis US7854751 Mar 28, 2007 Dec 21, 2010 Dupuy Spine, Inc. Percutaneous access devices and bone anchor assemblies US7857834 Jun",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}