{
    "relation": [
        [
            "Date",
            "Sep 22, 2003",
            "Jun 9, 2008",
            "Aug 15, 2008",
            "Sep 13, 2011",
            "Sep 23, 2011"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: COGNOS INCORPORATED, ONTARIO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:DESBIENS, MARC A.;SINCLAIR, JAMES W.;REEL/FRAME:014505/0452 Effective date: 20020418",
            "Owner name: INTERNATIONAL BUSINESS MACHINES CORPORATION, NEW Y Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:COGNOS ULC;REEL/FRAME:021067/0631 Effective date: 20080602 Owner name: COGNOS ULC, ALBERTA Free format text: MERGER;ASSIGNOR:COGNOS INC.;REEL/FRAME:021067/0303 Effective date: 20080201",
            "Owner name: COGNOS ULC,CANADA Free format text: CERTIFICATE OF AMALGAMATION;ASSIGNOR:COGNOS INCORPORATED;REEL/FRAME:021387/0813 Effective date: 20080201 Owner name: IBM INTERNATIONAL GROUP BV,NETHERLANDS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:COGNOS ULC;REEL/FRAME:021387/0837 Effective date: 20080703 Owner name: INTERNATIONAL BUSINESS MACHINES CORPORATION,NEW YO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:IBM INTERNATIONAL GROUP BV;REEL/FRAME:021398/0001 Effective date: 20080714",
            "Owner name: GOOGLE INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:INTERNATIONAL BUSINESS MACHINES CORPORATION;REEL/FRAME:026894/0001 Effective date: 20110817",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US20030088447 - Computer-based business planning processes - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20030088447?ie=ISO-8859-1&dq=inventor:%22Arthur+R.+Hair%22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00115-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481636719,
    "recordOffset": 481608054,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40295=[0016] The above is more fully and clearly described in “An Introduction to Database Systems” by C J Date, 7th Edition, 2000, Chapter 21 Decision Support, pp 694-729.}",
    "textBeforeTable": "Patent Citations [0140] In a yet further embodiment of the invention the distribution of work is carried out bypassing one or more levels of the management hierarchy so that the overall process may get under way more quickly. In this case a superior manager, knowing which user groups are to be involved, arranges for the sub-plans to be directly made available to those user groups. The corresponding merging, or collation, of the results follows the normal hierarchical process described above so that data collection and selection of appropriate sub-plans are controlled by the responsible managers. [0139] Multi-Level Delegation [0138] In a further embodiment of the invention a quick delegation function is provided so that a PM or CM can forward a plan or sub-plan to a single user class, and have the results returned directly to the forwarding PM or CM, thereby bypassing the use of the organisation object. In all other aspects, the workflow remains the same. This function allows a PM or CM to study a subset of the overall forecast or plan without invoking the full planning delegation process. [0137] Quick Delegation [0136] 6. Optionally review proposals rejected by superior and re-submit if necessary. [0135] 5. Optionally review any suggested changes from superior. (Refresh) [0134] 4. Forward one or more proposals to superior as proposals.",
    "textAfterTable": "U.S. Classification 707/802, 707/999.104 International Classification G06Q10/06, G06Q10/04 Cooperative Classification Y10S707/99945, Y10S707/99944, Y10S707/99943, G06Q10/06, Y10S707/99942, G06Q10/0637 European Classification G06Q10/06, G06Q10/0637 Legal Events Date Code Event Description Sep 22, 2003 AS Assignment Owner name: COGNOS INCORPORATED, ONTARIO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:DESBIENS, MARC A.;SINCLAIR, JAMES W.;REEL/FRAME:014505/0452 Effective date: 20020418 Jun 9, 2008 AS Assignment Owner name: INTERNATIONAL BUSINESS MACHINES CORPORATION, NEW Y Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:COGNOS ULC;REEL/FRAME:021067/0631 Effective date: 20080602 Owner name: COGNOS ULC, ALBERTA Free format text: MERGER;ASSIGNOR:COGNOS INC.;REEL/FRAME:021067/0303 Effective date: 20080201",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}