{
    "relation": [
        [
            "Cited Patent",
            "US4338621 *",
            "US4342069 *",
            "US4513355 *",
            "US4691225 *",
            "US4727410 *",
            "US4803546 *",
            "US4862231 *",
            "US5041899 *",
            "US5089881 *",
            "US5097318 *",
            "US5126818 *",
            "US5128831 *",
            "US5191511 *",
            "JPH03108743A *",
            "JPS61174752A *"
        ],
        [
            "Filing date",
            "Feb 4, 1980",
            "Feb 13, 1981",
            "Jun 15, 1983",
            "Jan 28, 1983",
            "Nov 23, 1983",
            "Feb 9, 1988",
            "Feb 7, 1986",
            "Jun 7, 1989",
            "Jun 25, 1990",
            "Apr 3, 1989",
            "Apr 2, 1990",
            "Oct 31, 1991",
            "Feb 4, 1992",
            "",
            ""
        ],
        [
            "Publication date",
            "Jul 6, 1982",
            "Jul 27, 1982",
            "Apr 23, 1985",
            "Sep 1, 1987",
            "Feb 23, 1988",
            "Feb 7, 1989",
            "Aug 29, 1989",
            "Aug 20, 1991",
            "Feb 18, 1992",
            "Mar 17, 1992",
            "Jun 30, 1992",
            "Jul 7, 1992",
            "Mar 2, 1993",
            "",
            ""
        ],
        [
            "Applicant",
            "Burroughs Corporation",
            "Mostek Corporation",
            "Motorola, Inc.",
            "Hitachi, Ltd.",
            "Cabot Technical Ceramics, Inc.",
            "Fujitsu Limited",
            "Harris Corporation",
            "Fujitsu Limited",
            "Micro Substrates, Inc.",
            "Hitachi, Ltd.",
            "Matsushita Electric Works, Ltd.",
            "Micron Technology, Inc.",
            "Kabushiki Kaisha Toshiba",
            "",
            ""
        ],
        [
            "Title",
            "Hermetic integrated circuit package for high density high power applications",
            "Integrated circuit package",
            "Metallization and bonding means and method for VLSI packages",
            "Semiconductor device and a method of producing the same",
            "High density integrated circuit package",
            "Heatsink package for flip-chip IC",
            "Non-contact I/O signal transmission in integrated circuit packaging",
            "Integrated circuit device having an improved package structure",
            "Fine-pitch chip carrier",
            "Semiconductor package and computer using it",
            "Semiconductor device",
            "High-density electronic package comprising stacked sub-modules which are electrically interconnected by solder-filled vias",
            "Semiconductor device including a package having a plurality of bumps arranged in a grid form as external terminals",
            "Title not available",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US5291062 - Area array semiconductor device having a lid with functional contacts - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5291062?dq=6008737",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00068-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473825139,
    "recordOffset": 473790356,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Thus it is apparent that there has been provided, in accordance with the invention, an area array semiconductor device having a functional lid which overcomes the problems associated with the prior art devices. Although the invention has been described and illustrated with reference to specific embodiments thereof, it is not intended that the invention be limited to these illustrative embodiments. Those skilled in the art will recognize that variations and modifications can be made without departing from the spirit of the invention. For example, the pattern of conductive traces on a substrate is not restricted by the present invention. The conductive trace pattern is dependent upon the types and configurations of the various semiconductor die used in a device. In addition, the present invention is not limited to any specific number or kind of semiconductor die used. The substrate may be enlarged to have multiple die cavities to accommodate multiple semiconductor dice. Furthermore, other methods than that described for electrically connecting the die to the substrate are possible, such as flip-chip mounting the die to the substrate. Thus it is intended to encompass within the invention all such variations and modifications falling within the scope of the appended claims. The foregoing description and illustrations contained herein demonstrate many of the advantages associated with the present invention. In particular, it has been revealed that an area array semiconductor device that is thermally efficient is possible. Furthermore, embodiments",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5418471 * Jan 26, 1994 May 23, 1995 Emulation Technology, Inc. Adapter which emulates ball grid array packages US5450283 * Jan 10, 1994 Sep 12, 1995 Motorola, Inc. Thermally enhanced semiconductor device having exposed backside and method for making the same US5500555 * Apr 11, 1994 Mar 19, 1996 Lsi Logic Corporation Multi-layer semiconductor package substrate with thermally-conductive prepeg layer US5532513 * Jul 8, 1994 Jul 2, 1996 Johnson Matthey Electronics, Inc. Metal-ceramic composite lid US5541450 * Nov 2, 1994 Jul 30, 1996 Motorola, Inc. Low-profile ball-grid array semiconductor package US5542175 * Dec 20, 1994 Aug 6, 1996 International Business Machines Corporation Method of laminating and circuitizing",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}