{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24",
            "25",
            "26",
            "27",
            "28",
            "29",
            "30",
            "31",
            "32",
            "33",
            "34",
            "35",
            "36",
            "37",
            "38",
            "39",
            "40",
            "41",
            "42",
            "43",
            "44",
            "45",
            "46",
            "47",
            "48",
            "49",
            "50",
            "51",
            "52",
            "53",
            "54",
            "55",
            "56",
            "57",
            "58",
            "59",
            "60",
            "61",
            "62",
            "63"
        ],
        [
            "",
            "State",
            "Iowa",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "2013 Statute Number",
            "Iowa Code § 475A.1 Public Utilities - Consumer advocate.",
            "Iowa Code § 475A.2 Duties",
            "Iowa Code § 475A. 3 Office - employees - expenses.",
            "Iowa Code § 475A.4 Utilities Division Records.",
            "Iowa Code § 475A.5 Service.",
            "Iowa Code § 475A.7 Consumer advisory panel.",
            "Iowa Code § 555A.1 Door-to-door sales -- definitions.",
            "Iowa Code § 555A.2 Contracts.",
            "Iowa Code § 555A.3 Cancellation.",
            "Iowa Code § 555A.4 Duties of seller.",
            "Iowa Code § 555A.5 Effect on indebtedness.",
            "Iowa Code § 555A.6 Penalties.",
            "Iowa Code § 714B.1 Prize promotions - Definitions.",
            "Iowa Code § 714B.2 Written prize notice - content - form.",
            "Iowa Code § 714B.3 Prohibited practices.",
            "Iowa Code § 714B.4 Prize award required.",
            "Iowa Code § 714B.5 Information requested by attorney general.",
            "Iowa Code § 714B.6 Criminal penalties.",
            "Iowa Code § 714B.7 Civil enforcement.",
            "Iowa Code § 714B.8 Private action.",
            "Iowa Code § 714B.9 Compliance with other laws.",
            "Iowa Code § 714B.10 Exemptions.",
            "Iowa Code § 714D.1 Telecommunications service provider fraud - Legislative intent.",
            "Iowa Code § 714D.2 Definitions.",
            "Iowa Code § 714D.3 Unfair and deceptive practices.",
            "Iowa Code § 714D.4 Prohibition of sweepstakes boxes.",
            "Iowa Code § 714D.5 Conditions on use of prize promotions to solicit authority to provide or change telecommunication services.",
            "Iowa Code § 714D.6 Private action.",
            "Iowa Code § 714D.7 Civil enforcement.",
            "Iowa Code § 714G.1 Consumer credit security - definitions.",
            "Iowa Code § 714G.2 Security freeze.",
            "Iowa Code § 714G.3 Temporary suspension.",
            "Iowa Code § 714G.4 Removal.",
            "Iowa Code § 714G.5 Fees.",
            "Iowa Code § 714G.6 Third parties.",
            "Iowa Code § 714G.7 Misrepresentation of fact.",
            "Iowa Code § 714G.8 Exceptions.",
            "Iowa Code § 714G.9 Written confirmation.",
            "Iowa Code § 714G.10 Waiver void.",
            "Iowa Code § 714G.11 Enforcement.",
            "Iowa Code § 714H.1 Consumer fraud - private actions - Title.",
            "Iowa Code § 714H.2 Definitions.",
            "Iowa Code § 714H.3 Prohibited practices and acts.",
            "Iowa Code § 714H.4 Exclusions.",
            "Iowa Code § 714H.5 Private right of action.",
            "Iowa Code § 714H.6 Attorney general notification.",
            "Iowa Code § 714H.7 Class actions.",
            "Iowa Code § 714H.8 Severability clause.",
            "Iowa Code § 715.1 Computer spyware and malware protection - Legislative intent.",
            "Iowa Code § 715.2 Title.",
            "Iowa Code § 715.3. Definitions.",
            "Iowa Code § 715.4 Prohibitions - transmission and use of software.",
            "Iowa Code § 715.5 Other prohibitions.",
            "Iowa Code § 715.6 Exceptions.",
            "Iowa Code § 715.7 Criminal penalties.",
            "Iowa Code § 715.8 Venue for criminal violations.",
            "Iowa Code § 715B.1 Protection of buyers of fine art and visual art multiples - Definitions.",
            "Iowa Code § 715B.2 Express warranties.",
            "Iowa Code § 715B.3 Falsifying certificates of authenticity or false representation - penalty.",
            "Iowa Code § 715B.4 Remedies to buyer.",
            "Iowa Code § 715C.1 Personal information security breach protection - Definitions.",
            "Iowa Code § 715C.2 Security breach - consumer notification - remedies."
        ],
        [
            "",
            "2013 Statute Language",
            "1. Appointment. The attorney general shall appoint a competent attorney to the office of consumer advocate, subject to confirmation by the senate, in accordance with section 2.32. The consumer advocate is the chief administrator of the consumer advocate division of the department of justice. The advocate’s term of office is for four years. The term begins and ends in the same manner as set forth in section 69.19. 2. Vacancy. If a vacancy occurs in the office of consumer advocate, the vacancy shall be filled for the unexpired term in the same manner as an original appointment under the procedures of section 2.32. 3. Disqualification. The existence of a fact which disqualifies a person from election or acting as utilities board member under section 474.2 disqualifies the person from appointment or acting as consumer advocate. 4. Political activity prohibited. The consumer advocate shall devote the advocate’s entire time to the duties of the office; and during the advocate’s term of office the advocate shall not be a member of a political committee or contribute to a political campaign fund other than through the income tax checkoff for contributions to the Iowa election campaign fund and the presidential election campaign fund or take part in political campaigns or be a candidate for a political office. 5. Removal. The attorney general may remove the consumer advocate for malfeasance or nonfeasance in office, or for any cause which renders the advocate ineligible for appointment, or incapable or unfit to discharge the duties of the advocate’s office; and the advocate’s removal, when so made, is final.",
            "The consumer advocate shall: 1. Investigate the legality of all rates, charges, rules, regulations, and practices of all persons under the jurisdiction of the utilities board, and institute civil proceedings before the board or any court to correct any illegality on the part of any such person. In any such investigation, the person acting for the office of the consumer advocate shall have the power to ask the board to issue subpoenas, compel the attendance and testimony of witnesses, and the production of papers, books, and documents, at the discretion of the board. 2. Act as attorney for and represent all consumers generally and the public generally in all proceedings before the utilities board. 3. Institute as a party judicial review of any decision of the utilities board, if the consumer advocate deems judicial review to be in the public interest. 4. Appear for all consumers generally and the public generally in all actions instituted in any state or federal court which involve the validity of a rule, regulation, or order of the utilities board. 5. Act as attorney for and represent all consumers generally and the public generally in proceedings before federal and state agencies and related judicial review proceedings and appeals, at the discretion of the consumer advocate. 6. Appear and participate as a party in the name of the office of consumer advocate in the performance of the duties of the office.",
            "1. Office. The office of consumer advocate shall be a separate division of the department of justice and located at the same location as the utilities division of the department of commerce. Administrative support services may be provided to the consumer advocate division by the department of commerce. 2. Employees. The consumer advocate may employ attorneys, legal assistants, secretaries, clerks, and other employees the consumer advocate finds necessary for the full and efficient discharge of the duties and responsibilities of the office. The consumer advocate may employ consultants as expert witnesses or technical advisors pursuant to contract as the consumer advocate finds necessary for the full and efficient discharge of the duties of the office. Employees of the consumer advocate division, other than the consumer advocate, are subject to merit employment, except as provided in section 8A.412. 3. Salaries, expenses, and appropriation. The salary of the consumer advocate shall be fixed by the attorney general within the salary range set by the general assembly. The salaries of employees of the consumer advocate shall be at rates of compensation consistent with current standards in industry. The reimbursement of expenses for the employees and the consumer advocate is as provided by law. The appropriation for the office of consumer advocate shall be a separate line item contained in the appropriation from the department of commerce revolving fund created in section 546.12.",
            "The consumer advocate has free access to all the files, records, and documents in the office of the utilities division except: 1. Personal information in confidential personnel records of the utilities division. 2. Records which represent and constitute the work product of the general counsel of the utilities board, and records of confidential communications between utilities board members and their general counsel, where the records relate to a proceeding before the board in which the consumer advocate is a party or a proceeding in any state or federal court in which both the board and the consumer advocate are parties. 3. Customer information of a confidential nature which could jeopardize the customer’s competitive status and is provided by the utility to the division. Such information shall be provided to the consumer advocate by the division, if the board determines it to be in the public interest.",
            "The consumer advocate is entitled to service of all documents required by statute or rule to be served on parties in proceedings before the utilities board and all notices, petitions, applications, complaints, answers, motions, and other pleadings filed pursuant to statute or rule with the board.",
            "The attorney general shall appoint five members and the governor shall appoint four members to a consumer advisory panel to meet at the request of the consumer advocate for consultation regarding public utility regulation. A member shall be appointed from each congressional district with the appointee residing within the congressional district at the time of appointment. The remaining appointees shall be members at large. No more than five members shall belong to the same political party as provided in section 69.16. Not more than a simple majority of the members shall be of the same gender. The members appointed by the attorney general shall serve four-year terms at the pleasure of the attorney general and their appointments are not subject to confirmation. The members appointed by the governor shall serve four-year terms at the pleasure of the governor and their appointments are not subject to confirmation. The governor or attorney general shall fill a vacancy in the same manner as the original appointment for the unexpired portion of the member’s term. Members of the consumer advisory panel shall serve without compensation, but shall be reimbursed for actual expenses from funds appropriated to the consumer advocate division.",
            "As used in this chapter, unless the context otherwise requires: 1. “Business day” means any calendar day except Saturday, Sunday, or public holiday, including holidays observed on Mondays. 2. “Consumer goods or services” means goods or services purchased, leased, or rented primarily for personal, family, or household purposes, including courses of instruction or training regardless of the purpose for which they are taken. 3. a. “Door-to-door sale” means a sale, lease, or rental of consumer goods or services with a purchase price of twenty-five dollars or more, whether under single or multiple contracts, in which the seller or the seller’s representative personally solicits the sale, including those in response to or following an invitation by the buyer, and the buyer’s agreement or offer to purchase is made at a place other than the place of business of the seller. Door-to-door sale does not include a transaction: (1) Made pursuant to prior negotiations in the course of a visit by the buyer to a retail business establishment having a fixed permanent location where the goods are exhibited or the services are offered for sale on a continuing basis. (2) In which the consumer is accorded the right of rescission by the provisions of the Consumer Credit Protection Act, 15 U.S.C. § 1635, or rules issued pursuant to this chapter. (3) In which the buyer has initiated the contact and the goods or services are needed to meet a bona fide immediate personal emergency of the buyer, and the buyer furnishes the seller with a separate dated and signed personal statement in the buyer’s handwriting describing the situation requiring immediate remedy and expressly acknowledging and waiving the right to cancel the sale within three business days. (4) Conducted and consummated entirely by mail or telephone, and without any other contact between the buyer and the seller or its representative prior to delivery of the goods or performance of the services. (5) In which the buyer has initiated the contact and specifically requested the seller to visit the buyer’s home for the purpose of repairing or performing maintenance upon the buyer’s personal property. If in the course of such a visit, the seller sells the buyer the right to receive additional services or goods other than replacement parts necessarily used in performing the maintenance or in making the repairs, the sale of those additional goods or services would not fall within this exclusion. (6) Pertaining to the sale or rental of real property, to the sale of insurance and prepaid health service plans, or to the sale of securities or commodities by a broker-dealer registered with the securities and exchange commission. b. “Door-to-door sale”, irrespective of the place or manner of sale, also means the following: (1) A sale of funeral services or funeral merchandise regulated under chapter 523A. (2) A sale of a social referral service or an ancillary service. For purposes of this subparagraph, “social referral service” means a service for a fee providing matching or introduction of individuals for the purpose of dating, matrimony, or general social contact not otherwise prohibited by law, and “ancillary service” means goods or services directly or indirectly related to or to be provided in connection with a social referral service. 4. “Place of business” means the main or permanent branch office or local address of a seller. 5. “Purchase price” means the total price paid or to be paid for the consumer goods or services, including all interest and service charges. 6. “Seller” means any person engaged in the door-to-door sale of consumer goods or services.",
            "Every seller shall furnish the buyer with a fully completed receipt or copy of any contract pertaining to a door-to-door sale at the time of its execution, which is in the same language as that principally used in the oral sales presentation and which shows the date of the transaction and contains the name and address of the seller, and in immediate proximity to the space reserved in the contract for the signature of the buyer or on the front page of the receipt if a contract is not used and in boldface type of a minimum size of ten points, a statement in substantially the following form: You, the buyer, may cancel this transaction at any time prior to midnight of the third business day after the date of this transaction. See the attached notice of cancellation form for an explanation of this right.",
            "Every seller shall furnish each buyer, at the time the buyer signs the door-to-door sales contract or otherwise agrees to buy consumer goods or services from the seller, a completed form in duplicate, captioned “Notice of Cancellation”, which shall be attached to the contract or receipt and easily detachable, and which shall contain in ten point boldface type the following information and statements in the same language as that used in the contract: NOTICE OF CANCELLATION ............. (enter date of transaction) You may cancel this transaction, without any penalty or obligation, within three business days from the above date. If you cancel, any property traded in, any payments made by you under the contract or sale, and any negotiable instrument executed by you will be returned within ten business days following receipt by the seller of your cancellation notice, and any security interest arising out of the transaction will be canceled. If you cancel, you must make available to the seller at your residence, in substantially as good condition as when received, any goods delivered to you under this contract or sale; or you may if you wish, comply with the instructions of the seller regarding the return shipment of the goods at the seller’s expense and risk. If you do not agree to return the goods to the seller or if the seller does not pick them up within twenty days of the date of your notice of cancellation, you may retain or dispose of the goods without any further obligation. To cancel this transaction, mail or deliver a signed and dated copy of this cancellation notice or any other written notice, or send a telegram, to ......, (Name of seller) at ........ (Address of seller’s place of business) not later than midnight of ...... (Date). I hereby cancel this transaction. ............ (Date) ........... (Buyer’s signature)",
            "A seller shall: 1. Furnish two copies of the notice of cancellation to the buyer, and complete both copies by entering the name of the seller, the address of the seller’s place of business, the date of the transaction, and the date, not earlier than the third business day following the date of the transaction, by which the buyer may give notice of cancellation. 2. Not include in any contract or receipt any confession of judgment or any waiver of any of the rights to which the buyer is entitled under this chapter including specifically the right to cancel the sale in accordance with the provisions of this chapter. 3. Inform each buyer orally, at the time the buyer signs the contract or purchases the goods or services, of the buyer’s right to cancel. 4. Not misrepresent in any manner the buyer’s right to cancel. 5. Honor any valid notice of cancellation by a buyer and within ten business days after the receipt of notice shall refund all payments made under the contract or sale, return any goods or property traded in, in substantially as good condition as when received by the seller, and cancel and return any negotiable instrument executed by the buyer in connection with the contract or sale and take any action necessary or appropriate to terminate promptly any security interest created in the transaction. 6. Not negotiate, transfer, sell, or assign any note or other evidence of indebtedness to a finance company or other third party prior to midnight of the seventh business day following the day the contract was signed or the goods or services were purchased. 7. Within ten business days of receipt of the buyer’s notice of cancellation notify the buyer whether the seller intends to repossess or to abandon any shipped or delivered goods.",
            "Rescission of any contract pursuant to this chapter or the failure to provide a copy of the contract to the buyer as required by this chapter shall void any contract, note, instrument, or other evidence of indebtedness executed or entered into in connection with the contract and shall constitute a complete defense in any action based on the contract, note, instrument or other evidence of indebtedness brought by the seller, the seller’s successors or assigns unless a successor or assignee of the seller after the seventh business day following the day the contract was signed has detrimentally relied upon a representation of the buyer that the contract has not been rescinded. This section shall not affect the rights of holders in due course of checks made by the buyer.",
            "1. Any seller who violates the provisions of this chapter shall be guilty of a simple misdemeanor. 2. A violation of this chapter is a violation of section 714.16, subsection 2, paragraph “a”.",
            "As used in this chapter, unless the context otherwise requires: 1. “Advertisement” means as defined in section 714.16, subsection 1. 2. “Merchandise” means as defined in section 714.16, subsection 1. 3. “Person” means as defined in section 714.16, subsection 1. 4. “Prize” means a gift, award, cash award, or other merchandise of value that is offered or awarded to a person in a real or purported contest, competition, sweepstakes, puzzle, drawing, scheme, plan, or other selection process. 5. “Retail value” of a prize means the following: a. A price at which the sponsor of the prize can substantiate that a substantial number of the items of merchandise have been sold to the public in the year preceding the date of the written prize notice in the regular course of business other than through a prize promotion. b. No more than one and one-half times the amount the sponsor paid for the prize in a bona fide purchase from an unaffiliated seller, if the sponsor is unable to substantiate a price pursuant to paragraph “a”. 6. “Sponsor” means a person who awards another person a prize or who allows the person to receive, use, compete for, or obtain information about a prize.",
            "1. a. A sponsor of a prize shall not require a person to purchase merchandise or pay or donate money as a condition of awarding a prize or as a condition of allowing the person to receive, use, compete for, or obtain information about a prize, unless the person has first received a written prize notice which satisfies the requirements of subsections 2 and 3. A sponsor shall not create the reasonable impression that such a purchase, payment, or donation is required, unless the person has first received a written prize notice which satisfies the requirements of subsections 2 and 3. b. For purposes of this chapter, a sponsor is deemed to have created the reasonable impression that a payment, purchase, or donation is required as a condition of awarding the person a prize, or as a condition of allowing the person to receive, use, compete for, or obtain information about a prize, if the sponsor does any of the following: (1) Fails to clearly and conspicuously disclose that a purchase, payment, or donation is not required in immediate proximity to, and in the same type and boldness as, each written reference to a purchase, payment, or donation, or in immediate proximity to, and in the same audio volume as, each verbal reference to a purchase, payment, or donation. (2) Uses a verbal or written solicitation, or other advertisement which contains any express or implied representations that a participant’s likelihood of receiving a prize or other favorable treatment is enhanced by making a purchase, payment, or donation. (3) Uses a verbal or written solicitation, course of solicitation, or other advertisement which when considered in its totality creates an overall impression that a participant’s likelihood of receiving a prize or other favorable treatment is enhanced by making a purchase, payment, or donation. c. A written prize notice satisfying the requirements of subsections 2 and 3 must precede every verbal advertisement by a sponsor which requires a person to purchase merchandise or pay or donate money, or gives the reasonable impression that such a purchase, payment, or donation is required, as a condition of awarding a prize, or as a condition of allowing a person to receive, use, compete for, or obtain information about a prize. d. Each written advertisement by a sponsor which requires a person to purchase merchandise or pay or donate money, or gives the reasonable impression that such a purchase, payment, or donation is required as a condition of awarding a prize or as a condition of allowing a person to receive, use, compete for, or obtain information about a prize, must satisfy the requirements of subsections 2 and 3. 2. A written prize notice must contain each of the following: a. The true name or names of the sponsor and the street address of the sponsor’s actual principal place of business. b. The retail value of each prize the person receiving the notice has been selected to receive or may be eligible to receive. c. A statement of the odds the person has of receiving each prize identified in the notice. d. Any requirement that the person pay shipping or handling fees, or any other charges to obtain or use a prize, including the nature and amount of the charge. e. A statement that a restriction applies and a description of the restriction, if receipt of the prize is subject to a restriction. f. Any limitations on eligibility to receive a prize. g. If a sponsor represents that a person is a winner or finalist, has been specially selected, is in first place, or is otherwise among a limited group of persons with an enhanced likelihood of receiving a prize; or that a person is entering a contest, sweepstakes, drawing, or other competitive enterprise from which a single winner or select group of winners will receive a prize, and if the notice is not prohibited under section 714B.3, subsection 1, paragraph “c”, a statement of the maximum number of persons in the group or purported group with this enhanced likelihood of receiving a prize. h. Any requirement or invitation for the person to view, hear, or attend a sales presentation in order to claim a prize, a good faith estimate of the length of the sales presentation, a description of the merchandise that is the subject of the sales presentation, and the total cost of such merchandise. 3. The information required in the written prize notice pursuant to subsection 2 must be provided as follows: a. The retail value and the statement of odds required under subsection 2 must be stated in immediate proximity to each identification of a prize on the written notice, and must be in the same size and boldness of type as the reference to the prize. b. The retail value must be stated in Arabic numerals, and must be in the following form: retail value: $..... c. The statement of odds must include, for each prize, the total number of prizes to be given away and the total number of written prize notices to be distributed. The number of prizes and written prize notices must be stated in Arabic numerals. The statement of odds must be in the following form: ... (number of prizes) out of ... (notices distributed). d. If a person is required to pay shipping or handling fees or any other charges to obtain a prize, to be eligible to obtain a prize, or to participate in a contest, a statement must appear in immediate proximity to each listing of the prize in the written prize notice in not less than ten point boldface type as follows: YOU MUST PAY $.... IN ORDER TO RECEIVE OR USE THIS ITEM, or, YOU MUST PAY $.... IN ORDER TO COMPETE FOR THIS ITEM, as applicable. e. The information required under subsection 2, paragraphs “e”, “f”, and “h” must be on the first page of the written prize notice in not less than ten point boldface type. f. A statement required under subsection 2, paragraph “g”, must appear in immediate proximity to each representation that the person is among a group of persons with an enhanced likelihood of receiving a prize, and must be in the same type size and boldness as the representation.",
            "1. A sponsor of a prize shall not do any of the following: a. Deliver a written prize notice, or an envelope containing a written prize notice, that contains language, or is designed in a manner, that would have the tendency or capacity to mislead intended recipients as to the source of the written prize notice. This prohibition includes, but is not limited to, a written prize notice or envelope which indicates that the notice or envelope originates from a government agency, public utility, insurance company, consumer reporting agency, debt collector, or law firm, unless the written prize notice or envelope originates from such source. b. Represent directly or by implication that the number of persons eligible for the prize is limited or that a person has been selected to receive a particular prize, unless the representation is true. c. Represent that a person is a winner or finalist, has been specially selected, is in first place, or is otherwise among a limited group of persons with an enhanced likelihood of receiving a prize, or that a person is entering a contest, sweepstakes, drawing, or other competitive enterprise, from which a single winner or select group of winners will receive a prize, when in fact the enterprise is a promotional scheme designed to make contact with prospective customers and all or a substantial number of those receiving the notice are awarded the same prize. d. Represent directly or by implication that a person will have an increased chance of receiving a prize by making multiple or duplicate purchases, payments or donations, or by entering a game, drawing, sweepstakes, or other contest more than one time, unless the representation is true. A sponsor is deemed to have made such representation if the sponsor delivers one or more prize notices to a person after the person has already made a purchase, payment, or donation to the sponsor for the same promotion, or has already entered the same game, drawing, sweepstakes, or other contest, unless the sponsor can demonstrate a bona fide error even though the sponsor has implemented procedures reasonably designed to prevent such duplication. e. Represent directly or by implication that a person is being notified a second or final time of the opportunity to receive or compete for a prize, unless the representation is true. f. Represent directly or by implication that a prize notice is urgent, or otherwise convey an impression of urgency by use of description, narrative copy, phrasing on an envelope, or similar method, unless there is a limited time period in which the recipient must take some action to claim or be eligible to receive a prize, and the date by which such action is required appears in immediate proximity to each representation of urgency and in the same type size and boldness as each representation of urgency. g. Knowingly sell, rent, exchange, transfer, or otherwise furnish to or purchase from other persons, financial data regarding Iowans disclosed in connection with a prize promotion not in compliance with this chapter. For purposes of this chapter, financial data includes credit card numbers, bank account numbers, other payment device numbers, and dollars spent on prize promotions which are not in compliance with this chapter. h. Request an individual to disclose the individual’s phone number, age, birthdate, credit card ownership, or financial data in connection with a prize promotion which is not in compliance with this chapter. 2. If a written prize notice requires or invites a person to view, hear, or attend a sales presentation in order to claim a prize, the sales presentation shall not begin until the sponsor does all of the following: a. Informs the person of the prize, if any, that has been awarded to the person. b. If the person is awarded a prize, delivers to the person the prize or the item selected by the person as provided in section 714B.4, if the prize awarded is not available.",
            "A sponsor of a prize who represents to a person that the person has been awarded a prize shall, no later than thirty days after making the representation, provide the person with the prize; with a voucher, certificate, or other document indicating the person’s unconditional right to receive the prize; or with either of the following items as selected by the person: 1. Any other prize listed in the written prize notice that is available and that is of equal or greater value. 2. The retail value of the prize, as stated in the written notice, in the form of cash, a money order, or a certified check.",
            "A sponsor shall provide, upon the request of the attorney general made within one year after the termination date of the promotion, a record of the names and addresses of all winners of prizes of one hundred dollars or more.",
            "A person who intentionally violates this chapter is guilty of an aggravated misdemeanor. A person intentionally violates this chapter if the act or acts in violation occur or continue after the attorney general or county attorney has notified the person by certified mail that the person is in violation of this chapter.",
            "A violation of this chapter constitutes a violation of section 714.16, subsection 2, paragraph “a”.",
            "In addition to any other remedies, a person suffering pecuniary loss as a result of a violation of this chapter by another person may bring an action against such other person to recover all of the following: 1. The greater of five hundred dollars or twice the amount of the pecuniary loss. 2. Costs and reasonable attorney fees.",
            "This chapter shall not be construed to permit an activity prohibited by section 714.16, or rules adopted pursuant to that section, or by chapter 725, or other applicable law.",
            "This chapter does not apply to the following: 1. Advertising by sponsors registered pursuant to chapter 557B, licensed pursuant to chapter 99B, or regulated pursuant to chapter 99D, 99F, or 99G. 2. Advertising in connection with the sale or purchase of books, recordings, videocassettes, periodicals, and similar goods through a membership group or club which is regulated by the federal trade commission pursuant to 16 C.F.R. pt. 425.1, concerning use of negative option plans by sellers in commerce. 3. Advertising in connection with the sale or purchase of goods ordered through a contractual plan or arrangement such as a continuity plan, subscription arrangement, or a single sale or purchase series arrangement under which the seller ships goods to a consumer who has consented in advance to receive the goods and who, after the receipt of the goods, is given an opportunity to examine the goods and to receive a full refund of charges for the goods upon return of the goods undamaged. 4. Advertising in connection with sales by a catalog seller. For purposes of this section,“catalog seller” means a person at least fifty percent of whose annual revenues are derived from the sale of merchandise sold in connection with the distribution of catalogs of at least twenty-four pages, which contain written descriptions or illustrations and sale prices for each item of merchandise and which are distributed in more than one state with a total annual distribution of at least two hundred fifty thousand.",
            "The general assembly finds that customers of telephone services have been subjected to fraud in the sale and advertisement of telephone long distance and local service, as well as other services related to residential and business telephone service. The general assembly further finds that companies acting in a lawful manner have lost customers to companies that obtain customers through fraud and deception. It is the intent of the general assembly to protect telephone service subscribers from fraud and to provide statutory remedies for the victims of fraud in the sale of telecommunications service. It is the intent of the general assembly to provide the attorney general with additional remedies to address the issue of fraud in the sale of telecommunications service. It is further the intent of the general assembly that this chapter does not limit the rights or remedies that are otherwise available to a consumer or the attorney general under any other law.",
            "As used in this chapter, unless the context otherwise requires: 1. “Advertisement” means the same as defined in section 714.16, subsection 1. 2. “Consumer” means a person who is not a telecommunications service provider and who uses telecommunications services. 3. “Deception” means the same as defined in section 714.16, subsection 1. 4. “Person” means the same as defined in section 714.16, subsection 1. 5. “Sweepstakes box” means the box or receptacle into which a person may place an entry form or document used to enter a sweepstakes, contest, or drawing of any description, and promotional materials attached to such entry form or document. 6. “Telecommunications Act” means 47 U.S.C. § 258, a portion of the federal Telecommunications Act of 1996, relating to changes in telephone service, and including regulations adopted pursuant to that section. 7. “Telecommunications service” means local exchange or long distance telephone service, and any additional service or merchandise for which any charge or assessment appears on a billing statement directed to a person by a provider of local exchange or long distance telephone service, but does not include commercial mobile radio service or charges or assessments imposed on consumers of local exchange or long distance telephone service or on such additional service or merchandise by governmental entities. 8. “Telecommunications service provider” means a person who advertises, sells, leases, or provides telecommunications services to another person. 9. “Unfair practice” means the same as defined in section 714.16, subsection 1, and also means any failure of a person to comply with the Telecommunications Act or with any statute or rule enforced by the utilities board within the utilities division of the department of commerce relating to a telecommunications service selection or change. 8. “Telecommunications service provider” means a person who advertises, sells, leases, or provides telecommunications services to another person. 9. “Unfair practice” means the same as defined in section 714.16, subsection 1, and also means any failure of a person to comply with the Telecommunications Act or with any statute or rule enforced by the utilities board within the utilities division of the department of commerce relating to a telecommunications service selection or change.",
            "The act, use, or employment by a person of deception or an unfair practice in connection with the lease, sale, or advertisement of a telecommunications service or the solicitation of authority to provide or execute a change of a telecommunications service is an unlawful practice.",
            "The use of a sweepstakes box by a person to solicit authority to provide or execute a change of a consumer’s telecommunications service is an unlawful practice.",
            "1. It is an unlawful practice for a person to use a form or document which is to be used or intended to be used by another person to enter a sweepstakes, contest, or drawing of any description as written authority to provide or execute a change of a consumer’s telecommunications service. 2. It is an unlawful practice for a person to solicit the lease or sale of or to solicit the authority to provide or execute a change of a telecommunications service to another person through or in conjunction with a sweepstakes, contest, or drawing without clearly, conspicuously, and fully disclosing in all direct mail solicitations to the other person the fact that the sweepstakes, contest, or drawing is intended to solicit authority to provide or execute a change of a telecommunications service. The disclosure required shall include, at a minimum, all of the following: a. A statement that an acceptance or change of telecommunications service is not required to enter the sweepstakes, contest, or drawing. b. An alternative means by which a person may enter the sweepstakes, contest, or drawing without accepting or authorizing a change in a telecommunications service. c. The name and telephone number of the entity soliciting the person to accept or to authorize a change of telecommunications service through the use of or in conjunction with the sweepstakes, contest, or drawing. d. A brief description of the nature of the telecommunications service for which authorization is sought through the use of or in conjunction with the sweepstakes, contest, or drawing.",
            "1. In addition to any other remedy, a consumer may bring an action against a person who commits an unlawful practice under this chapter to recover from the person all of the following: a. The amount of any moneys or property acquired by the person from the consumer by means of an unlawful practice under this section, or two hundred dollars, whichever is greater. b. If a court finds that the consumer prevails in the action and that the unlawful practice was an intentional violation of this chapter, five hundred dollars or twice the amount of the consumer’s actual damages, whichever is greater. c. Costs and reasonable attorney fees. 2. A cause of action under this section shall not apply unless, prior to filing the action, the consumer has submitted a complaint to the utilities board within the utilities division of the department of commerce, the utilities board has failed to resolve the complaint to the consumer’s satisfaction within one hundred twenty days of the date the complaint was submitted, and the consumer dismisses the complaint before the utilities board. The requirement that a consumer complaint be submitted to the utilities board and resolved by the utilities board to the consumer’s satisfaction within one hundred twenty days of filing before the consumer may file an action pursuant to this section shall not apply to an action by the attorney general to recover moneys for the consumer pursuant to section 714D.7 or any other law. A finding by the utilities board that a respondent has complied with rules governing carrier selection procedures adopted by the utilities board shall be an affirmative defense to any claim brought under this section or section 476.103 or 714D.7 that an unauthorized change in service has occurred.",
            "1. A violation of this chapter or a rule adopted pursuant to this chapter is a violation of section 714.16, subsection 2, paragraph “a”. The remedies and penalties provided by section 714.16, including but not limited to injunctive relief and civil penalties, apply to violations of this chapter. 2. In seeking reimbursement pursuant to section 714.16, subsection 7, from a person who has committed an unlawful practice under this chapter, the attorney general may seek an order from the court that the person pay to the attorney general on behalf of consumers the amounts for which the person would be liable under section 714D.6 for each consumer who has a cause of action pursuant to section 714D.6. Section 714.16, as it relates to consumer reimbursement, applies to amounts recovered by the attorney general as reimbursement under this chapter. However, a consumer who is awarded monetary damages pursuant to section 714D.6 is not eligible for monetary relief under this section for the same unlawful practice. 3. The remedies provided pursuant to this chapter are in addition to any other remedies provided to the state or to a person under other law. 4. The attorney general shall not file a civil enforcement action under this chapter or under section 714.16 against a person for an act which is the subject of an administrative proceeding to impose a civil penalty which has been initiated against the person by the utilities board within the utilities division of the department of commerce. This subsection shall not be construed to limit the authority of the attorney general to file a civil enforcement or other enforcement action against a person for violating a prior agreement entered into by the person with the attorney general or a court order obtained by the attorney general against the person. This subsection shall not be construed to limit the authority of the attorney general to file a civil enforcement or other enforcement action against the person for acts which are not the subject of an administrative proceeding which has been initiated against the person by the utilities board.",
            "For the purposes of this chapter, unless the context otherwise requires: 1. “Consumer” means an individual who is a resident of this state. 2. “Consumer credit report” means a consumer report, as defined in 15 U.S.C. § 1681a, that is used or collected in whole or in part for the purpose of serving as a factor in establishing a consumer’s eligibility for credit for personal, family, or household purposes. 3. “Consumer reporting agency” means the same as defined in 15 U.S.C. § 1681a(f). A consumer reporting agency does not include any of the following: a. A check service or fraud prevention service company that reports on incidents of fraud or issues authorizations for the purpose of approving or processing negotiable instruments, electronic fund transfers, or similar methods of payment. b. A deposit account information service company that issues reports regarding account closures due to fraud, overdrafts, automated teller machine abuse, or similar negative information regarding a consumer to inquiring financial institutions for use only in reviewing the consumer’s request for a deposit account at the inquiring financial institution. c. Any person or entity engaged in the practice of assembling and merging information contained in a database of one or more consumer reporting agencies and does not maintain a permanent database of credit information from which new consumer reports are produced. 4. “Identification information” means as defined in section 715A.8. 5. “Identity theft” means as used in section 715A.8. 6. “Normal business hours” means Sunday through Saturday, between the hours of 6:00 a.m. and 9:30 p.m., central standard time or central daylight saving time. 7. “Proper identification” means the same as defined in 15 U.S.C. § 1681h(a)(1). 8. “Security freeze” means a notice placed in a consumer credit report, at the request of the consumer and subject to certain exceptions, that prohibits a consumer reporting agency from releasing the consumer credit report or score relating to the extension of credit.",
            "A consumer may submit by certified mail to a consumer reporting agency a written request for a security freeze. The consumer must submit proper identification and the applicable fee with the request. Within five business days after receiving the request, the consumer reporting agency shall commence the security freeze. Within ten business days after commencing the security freeze, the consumer reporting agency shall send a written confirmation to the consumer of the security freeze, a personal identification number or password, other than the consumer’s social security number, for the consumer to use in authorizing the suspension or removal of the security freeze, including information on how the security freeze may be temporarily suspended.",
            "1. A consumer may request that a security freeze be temporarily suspended to allow the consumer reporting agency to release the consumer credit report for a specific time period. The consumer reporting agency may develop procedures to expedite the receipt and processing of requests which may involve the use of telephones, facsimile transmissions, the internet, or other electronic media. The consumer reporting agency shall comply with the request within three business days after receiving the consumer’s written request, or within fifteen minutes after the consumer’s request is received by the consumer reporting agency through facsimile, the internet, or other electronic contact method chosen by the consumer reporting agency, or the use of a telephone, during normal business hours. The consumer’s request shall include all of the following: a. Proper identification. b. The personal identification number or password provided by the consumer reporting agency. c. Explicit instructions of the specific time period designated for suspension of the security freeze. d. Payment of the applicable fee. 2. A consumer reporting agency need not remove a security freeze within the time frames provided in subsection 1 if the consumer fails to meet the requirements of subsection 1, or the ability of the consumer reporting agency to remove the security freeze within fifteen minutes is prevented by one of the following: a. An act of God, including a fire, earthquake, hurricane, storm, or similar natural disaster or phenomenon. b. Unauthorized or illegal acts by a third party, including terrorism, sabotage, riot, vandalism, labor strikes or disputes disrupting operations, or similar occurrences. c. Operational interruption, including electrical failure, unanticipated delay in equipment or replacement part delivery, computer hardware or software failures inhibiting response time, or similar disruption. d. Governmental action, including emergency orders or regulations, judicial law enforcement action, or similar directives. e. Regularly scheduled maintenance, during other than normal business hours, of the consumer reporting agency’s systems, or updates to the consumer reporting agency’s systems. f. Commercially reasonable maintenance of, or repair to, the consumer reporting agency’s systems that is unexpected or unscheduled. g. Receipt of a removal request outside of normal business hours.",
            "A security freeze remains in effect until the consumer requests that the security freeze be removed. A consumer reporting agency shall remove a security freeze within three business days after receiving a request for removal that includes proper identification of the consumer, the personal identification number or password provided by the consumer reporting agency, and payment of the applicable fee.",
            "1. A consumer reporting agency shall not charge any fee to a consumer who is the victim of identity theft for commencing a security freeze, temporary suspension, or removal if with the initial security freeze request, the consumer submits a valid copy of the police report concerning the unlawful use of identification information by another person. 2. A consumer reporting agency may charge a fee not to exceed ten dollars to a consumer who is not the victim of identity theft for each security freeze, removal, or for reissuing a personal identification number or password if the consumer fails to retain the original number. The consumer reporting agency may charge a fee not to exceed twelve dollars for each temporary suspension of a security freeze.",
            "If a third party requests a consumer credit report that is subject to a security freeze, the consumer reporting agency may advise the third party that a security freeze is in effect. If the consumer does not expressly authorize the third party to have access to the consumer credit report through a temporary suspension of the security freeze, the third party shall not be given access to the consumer credit report but may treat a credit application as incomplete.",
            "A consumer reporting agency may suspend or remove a security freeze upon a material misrepresentation of fact by the consumer. However, the consumer reporting agency shall send notice to the consumer in writing prior to suspending or removing the security freeze.",
            "A security freeze shall not apply to the following persons or entities: 1. A person or person’s subsidiary, affiliate, agent, or assignee with which the consumer has or prior to assignment had an account, contract, or debtor-creditor relationship for the purposes of reviewing the account or collecting the financial obligation owing for the account, contract, or debt, or extending credit to a consumer with a prior or existing account, contract, or debtor-creditor relationship. “Reviewing the account” includes activities related to account maintenance, monitoring, credit line increases, and account upgrades and enhancements. 2. A subsidiary, affiliate, agent, assignee, or prospective assignee of a person to whom access has been granted under a temporary suspension for purposes of facilitating the extension of credit or another permissible use. 3. A person acting pursuant to a court order, warrant, or subpoena. 4. Child support enforcement officials when investigating a child support case pursuant to Title IV-D or Title XIX of the federal Social Security Act. 5. The department of human services or its agents or assignees acting to investigate fraud under the medical assistance program. 6. The department of revenue or local taxing authorities, or any of their agents or assignees, acting to investigate or collect delinquent taxes or assessments, including interest and penalties and unpaid court orders, or to fulfill any of their other statutory or other responsibilities. 7. A person’s use of credit information for prescreening as provided by the federal Fair Credit Reporting Act. 8. A person for the sole purpose of providing a credit file monitoring subscription service to which the consumer has subscribed. 9. A consumer reporting agency for the sole purpose of providing a customer with a copy of the consumer credit report upon the consumer’s request. 10. A person’s use of a consumer credit report in connection with the business of insurance.",
            "After a security freeze is in effect, a consumer reporting agency may post a name, date of birth, social security number, or address change in a consumer credit report provided written confirmation is sent to the consumer within thirty days of posting the change. For an address change, written confirmation shall be sent to both the new and former addresses. Written confirmation is not required to correct spelling and typographical errors.",
            "A waiver by a consumer of the provisions of this chapter is contrary to public policy and is void and unenforceable.",
            "A person who violates this chapter violates section 714.16, subsection 2, paragraph “a”. All powers conferred upon the attorney general to accomplish the objectives and carry out the duties prescribed in section 714.16 are also conferred upon the attorney general to enforce this chapter including but not limited to the power to issue subpoenas, adopt rules, and seek injunctive relief and a monetary award for civil penalties, attorney fees, and costs. Additionally, the attorney general may seek and recover the greater of five hundred dollars or actual damages for each customer injured by a violation of this chapter.",
            "This chapter shall be known and may be cited as the “Private Right of Action for Consumer Frauds Act”.",
            "1. “Actual damages” means all compensatory damages proximately caused by the prohibited practice or act that are reasonably ascertainable in amount. “Actual damages” does not include damages for bodily injury, pain and suffering, mental distress, or loss of consortium, loss of life, or loss of enjoyment of life. 2. “Advertisement” means the same as defined in section 714.16. 3. “Consumer” means a natural person or the person’s legal representative. 4. “Consumer merchandise” means merchandise offered for sale or lease, or sold or leased, primarily for personal, family, or household purposes. 5. “Deception” means an act or practice that is likely to mislead a substantial number of consumers as to a material fact or facts. 6. “Merchandise” means the same as defined in section 714.16. 7. “Person” means the same as defined in section 714.16. 8. “Sale” means any sale or offer for sale of consumer merchandise for cash or credit. 9. “Unfair practice” means the same as defined in section 714.16.",
            "1. A person shall not engage in a practice or act the person knows or reasonably should know is an unfair practice, deception, fraud, false pretense, or false promise, or the misrepresentation, concealment, suppression, or omission of a material fact, with the intent that others rely upon the unfair practice, deception, fraud, false pretense, false promise, misrepresentation, concealment, suppression, or omission in connection with the advertisement, sale, or lease of consumer merchandise, or the solicitation of contributions for charitable purposes. For the purposes of this chapter, a claimant alleging an unfair practice, deception, fraud, false pretense, false promise, or misrepresentation must prove that the prohibited practice related to a material fact or facts. “Solicitations of contributions for charitable purposes” does not include solicitations made on behalf of a political organization as defined in section 13C.1, solicitations made on behalf of a religious organization as defined in section 13C.1, solicitations made on behalf of a state, regionally, or nationally accredited college or university, or solicitations made on behalf of a nonprofit foundation benefiting a state, regionally, or nationally accredited college or university subject to section 509(a)(1) or 509(a)(3) of the Internal Revenue Code of 1986. 2. A person shall not engage in any practice or act that is in violation of any of the following: a. Section 321.69. b. Chapter 516D. c. Section 516E.5, 516E.9, or 516E.10. d. Chapter 555A. e. Section 714.16, subsection 2, paragraphs “b” through “n”. f. Chapter 714A.",
            "1. This chapter shall not apply to any of the following: a. Merchandise offered or provided by any of the following persons, including business entities organized under Title XII by those persons and the officers, directors, employees, and agents of those persons or business entities, pursuant to a profession or business for which they are licensed or registered: (1) Insurance companies subject to Title XIII. (2) Attorneys licensed to practice law in this state. (3) Financial institutions which includes any bank incorporated under the provisions of any state or federal law, any savings and loan association or savings bank incorporated under the provisions of any state or federal law, and any credit union organized under the provisions of any state or federal law, and any affiliate or subsidiary of a bank, savings and loan association, savings bank, or credit union. (4) Persons or facilities licensed, certified, or registered under chapters 135B, 135C, 135J, 148, 148A, 148B, 148C, 149, 151, 152, 152A, 152B, 153, 154, 154B, 154C, 154D, 155A, 156, 169, 522B, 542, 542B, 543B, 544A, or 544B. b. Advertising by a retailer for a product, other than a drug or other product claiming to have a health-related benefit or use, if the advertising is prepared by a supplier, unless the retailer participated in the preparation of the advertisement or knew or should have known that the advertisement was deceptive, false, or misleading. c. In connection with an advertisement that violates this chapter, the newspaper, magazine, publication, or other print media in which the advertisement appears, including the publisher of the newspaper, magazine, publication, or other print media in which the advertisement appears, or the radio station, television station, or other electronic media which disseminates the advertisement, including an employee, agent, or representative of the publisher, newspaper, magazine, publication or other print media, or the radio station, television station, or other electronic media. d. The provision of local exchange carrier telephone service pursuant to a certificate issued under section 476.29. e. Public utilities as defined in section 476.1 that furnish gas by a piped distribution system or electricity to the public for compensation. f. Any advertisement that complies with the statutes, rules, and regulations of the federal trade commission. g. Conduct that is required or permitted by the orders or rules of, or a statute administered by, a federal, state, or local governmental agency. h. An affirmative act that violates this chapter but is specifically required by other applicable law, to the extent that the actor could not reasonably avoid a violation of this chapter. i. In any action relating to a charitable solicitation, an individual who has engaged in the charitable solicitation as an unpaid, uncompensated volunteer and who does not receive monetary gain of any sort from engaging in the solicitation. j. The provision of cable television service or video service pursuant to a franchise under section 364.2 or 477A.2. k. A corporation holding one or more industrial loan licenses pursuant to chapter 536A and employing fewer than sixty full-time employees or a corporation holding one or more regulated loan licenses pursuant to chapter 536 and employing fewer than sixty full-time employees. For purposes of this paragraph, “corporation” means the same as defined in section 536A.2. 2. “Material fact” as used in this chapter does not include repairs of damage to, adjustments on, or replacements of parts with new parts of otherwise new merchandise if the repairs, adjustments, or replacements are made to achieve compliance with factory specifications and are made before sale of the merchandise at retail and the actual cost of any labor and parts charged to or performed by a retailer for any such repairs, adjustments, and parts does not exceed three hundred dollars or ten percent of the actual cost to a retailer including freight of the merchandise, whichever is less, provided that the seller posts in a conspicuous place notice that repairs, adjustments, or replacements will be disclosed upon request. The exclusion provided in this subsection does not apply to the concealment, suppression, or omission of a material fact if the purchaser requests disclosure of any repair, adjustment, or replacement.",
            "1. A consumer who suffers an ascertainable loss of money or property as the result of a prohibited practice or act in violation of this chapter may bring an action at law to recover actual damages. The court may order such equitable relief as it deems necessary to protect the public from further violations, including temporary and permanent injunctive relief. 2. If the court finds that a person has violated this chapter and the consumer is awarded actual damages, the court shall award to the consumer the costs of the action and to the consumer’s attorney reasonable fees. Reasonable attorney fees shall be determined by the value of the time reasonably expended by the attorney including but not limited to consideration of the following factors: a. The time and labor required. b. The novelty and difficulty of the issues in the case. c. The skills required to perform the legal services properly. d. The preclusion of other employment by the attorney due to the attorney’s acceptance of the case. e. The customary fee. f. Whether the fee is fixed or contingent. g. The time limitations imposed by the client or the circumstances of the case. h. The amount of money involved in the case and the results obtained. i. The experience, reputation, and ability of the attorney. j. The undesirability of the case. k. The nature and length of the professional relationship between the attorney and the client. l. Attorney fee awards in similar cases. 3. In order to recover damages, a claim under this section shall be proved by a preponderance of the evidence. 4. If the finder of fact finds by a preponderance of clear, convincing, and satisfactory evidence that a prohibited practice or act in violation of this chapter constitutes willful and wanton disregard for the rights or safety of another, in addition to an award of actual damages, statutory damages up to three times the amount of actual damages may be awarded to a prevailing consumer. 5. An action pursuant to this chapter must be brought within two years of the occurrence of the last event giving rise to the cause of action under this chapter or within two years of the discovery of the violation of this chapter by the person bringing the action, whichever is later. 6. This section shall not affect a consumer’s right to seek relief under any other theory of law. 7. A person shall not be held liable in any action brought under this section for a violation of this chapter if the person shows by a preponderance of the evidence that the violation was not intentional and resulted from a bona fide error notwithstanding the maintenance of procedures reasonably adopted to avoid the error.",
            "1. A party filing a petition, counterclaim, cross-petition, or pleading, or any count thereof, in intervention alleging a violation under this chapter, within seven days following the date of filing such pleading, shall provide a copy to the attorney general and, within seven days following entry of any final judgment in the action, shall provide a copy of the judgment to the attorney general. 2. A party appealing to district court a small claims order or judgment involving an issue raised under this chapter, within seven days of providing notice of the appeal, shall notify the attorney general in writing and provide a copy of the pleading raising the issue and a copy of the small claims court order or judgment. 3. A party appealing an order or judgment involving an issue raised under this chapter, within seven days following the date such notice of appeal is filed with the court, shall notify the attorney general in writing and provide a copy of the pleading raising the issue and a copy of the court order or judgment being appealed. 4. Upon timely application to the court in which an action involving an issue raised under this chapter is pending, the attorney general may intervene as a party at any time or may be heard at any time. The attorney general’s failure to intervene shall not preclude the attorney general from bringing a separate enforcement action. 5. All copies of pleadings, orders, judgments, and notices required by this section to be sent to the attorney general shall be sent by certified mail unless the attorney general has previously been provided such copies of pleadings, orders, judgments, or notices in the same action by certified mail, in which case subsequent mailings may be made by regular mail. Failure to provide the required mailings to the attorney general shall not be grounds for dismissal of an action under this chapter, but shall be grounds for a subsequent action by the attorney general to vacate or modify the judgment.",
            "A class action lawsuit alleging a violation of this chapter shall not be filed with a court unless it has been approved by the attorney general. The attorney general shall approve the filing of a class action lawsuit alleging a violation of this chapter unless the attorney general determines that the lawsuit is frivolous. This section shall not affect the requirements of any other law or of the Iowa rules of civil procedure relating to class action lawsuits.",
            "If any provision of this chapter or its application to any person or circumstances is held invalid, the invalidity does not affect other provisions or applications of this chapter that can be given effect without the invalid provision or application, and to this end the provisions of this chapter are severable.",
            "It is the intent of the general assembly to protect owners and operators of computers in this state from the use of spyware and malware that is deceptively or surreptitiously installed on the owner’s or the operator’s computer.",
            "This chapter shall be known and may be cited as the “Computer Spyware Protection Act”.",
            "For purposes of this chapter, unless the context otherwise requires: 1. “Advertisement” means a communication, the primary purpose of which is the commercial promotion of a commercial product or service, including content on an internet website operated for a commercial purpose. 2. “Computer software” means a sequence of instructions written in any programming language that is executed on a computer. “Computer software” does not include computer software that is a web page or data components of a web page that are not executable independently of the web page. 3. “Damage” means any significant impairment to the integrity or availability of data, software, a system, or information. 4. “Execute”, when used with respect to computer software, means the performance of the functions or the carrying out of the instructions of the computer software. 5. “Intentionally deceptive” means any of the following: a. An intentionally and materially false or fraudulent statement. b. A statement or description that intentionally omits or misrepresents material information in order to deceive an owner or operator of a computer. c. An intentional and material failure to provide a notice to an owner or operator regarding the installation or execution of computer software for the purpose of deceiving the owner or operator. 6. “Internet” means the same as defined in section 4.1. 7. “Owner or operator” means the owner or lessee of a computer, or a person using such computer with the owner or lessee’s authorization, but does not include a person who owned a computer prior to the first retail sale of the computer. 8. “Person” means the same as defined in section 4.1. 9. “Personally identifiable information” means any of the following information with respect to the owner or operator of a computer: a. The first name or first initial in combination with the last name. b. A home or other physical address including street name. c. An electronic mail address. d. Credit or debit card number, bank account number, or any password or access code associated with a credit or debit card or bank account. e. Social security number, tax identification number, driver’s license number, passport number, or any other government-issued identification number. f. Account balance, overdraft history, or payment history that personally identifies an owner or operator of a computer. 10. “Transmit” means to transfer, send, or make available computer software using the internet or any other medium, including local area networks of computers other than a wireless transmission, and a disc or other data storage device. “Transmit” does not include an action by a person providing any of the following: a. An internet connection, telephone connection, or other means of transmission capability such as a compact disc or digital video disc through which the computer software was made available. b. The storage or hosting of the computer software program or an internet web page through which the software was made available. c. An information location tool, such as a directory, index, reference, pointer, or hypertext link, through which the user of the computer located the computer software, unless the person transmitting receives a direct economic benefit from the execution of such software on the computer.",
            "It is unlawful for a person who is not an owner or operator of a computer to transmit computer software to such computer knowingly or with conscious avoidance of actual knowledge, and to use such software to do any of the following: 1. Modify, through intentionally deceptive means, settings of a computer that control any of the following: a. The web page that appears when an owner or operator launches an internet browser or similar computer software used to access and navigate the internet. b. The default provider or web proxy that an owner or operator uses to access or search the internet. c. An owner’s or an operator’s list of bookmarks used to access web pages. 2. Collect, through intentionally deceptive means, personally identifiable information through any of the following means: a. The use of a keystroke-logging function that records keystrokes made by an owner or operator of a computer and transfers that information from the computer to another person. b. In a manner that correlates personally identifiable information with data respecting all or substantially all of the websites visited by an owner or operator, other than websites operated by the person collecting such information. c. By extracting from the hard drive of an owner’s or an operator’s computer, an owner’s or an operator’s social security number, tax identification number, driver’s license number, passport number, any other government-issued identification number, account balances, or overdraft history. 3. Prevent, through intentionally deceptive means, an owner’s or an operator’s reasonable efforts to block the installation of, or to disable, computer software by causing computer software that the owner or operator has properly removed or disabled to automatically reinstall or reactivate on the computer. 4. Intentionally misrepresent that computer software will be uninstalled or disabled by an owner’s or an operator’s action. 5. Through intentionally deceptive means, remove, disable, or render inoperative security, antispyware, or antivirus computer software installed on an owner’s or an operator’s computer. 6. Take control of an owner’s or an operator’s computer by doing any of the following: a. Accessing or using a modem or internet service for the purpose of causing damage to an owner’s or an operator’s computer or causing an owner or operator to incur financial charges for a service that the owner or operator did not authorize. b. Opening multiple, sequential, stand-alone advertisements in an owner’s or an operator’s internet browser without the authorization of an owner or operator and which a reasonable computer user could not close without turning off the computer or closing the internet browser. 7. Modify any of the following settings related to an owner’s or an operator’s computer access to, or use of, the internet: a. Settings that protect information about an owner or operator for the purpose of taking personally identifiable information of the owner or operator. b. Security settings for the purpose of causing damage to a computer. 8. Prevent an owner’s or an operator’s reasonable efforts to block the installation of, or to disable, computer software by doing any of the following: a. Presenting the owner or operator with an option to decline installation of computer software with knowledge that, when the option is selected by the authorized user, the installation nevertheless proceeds. b. Falsely representing that computer software has been disabled.",
            "It is unlawful for a person who is not an owner or operator of a computer to do any of the following with regard to the computer: 1. Induce an owner or operator to install a computer software component onto the owner’s or the operator’s computer by intentionally misrepresenting that installing computer software is necessary for security or privacy reasons or in order to open, view, or play a particular type of content. 2. Using intentionally deceptive means to cause the execution of a computer software component with the intent of causing an owner or operator to use such component in a manner that violates any other provision of this chapter.",
            "Sections 715.4 and 715.5 shall not apply to the monitoring of, or interaction with, an owner’s or an operator’s internet or other network connection, service, or computer, by a telecommunications carrier, cable operator, computer hardware or software provider, or provider of information service or interactive computer service for network or computer security purposes, diagnostics, technical support, maintenance, repair, authorized updates of computer software or system firmware, authorized remote system management, or detection, criminal investigation, or prevention of the use of or fraudulent or other illegal activities prohibited in this chapter in connection with a network, service, or computer software, including scanning for and removing computer software prescribed under this chapter. Nothing in this chapter shall limit the rights of providers of wire and electronic communications under 18 U.S.C. § 2511.",
            "1. A person who commits an unlawful act under this chapter is guilty of an aggravated misdemeanor. 2. A person who commits an unlawful act under this chapter and who causes pecuniary losses exceeding one thousand dollars to a victim of the unlawful act is guilty of a class “D” felony.",
            "For the purpose of determining proper venue, a violation of this chapter shall be considered to have been committed in any county in which any of the following apply: 1. An act was performed in furtherance of the violation. 2. The owner or operator who is the victim of the violation has a place of business in this state. 3. The defendant has control or possession of any proceeds of the violation, or of any books, records, documents, property, financial instrument, computer software, computer program, computer data, or other material or objects used in furtherance of the violation. 4. The defendant unlawfully accessed a computer or computer network by wires, electromagnetic waves, microwaves, or any other means of communication. 5. The defendant resides. 6. A computer used as an object or an instrument in the commission of the violation was located at the time of the violation.",
            "As used in this chapter: 1. “Artist” means the creator of a work of fine art or, in the case of multiples, the person who conceived or created the image which is contained in or which constitutes the master from which the individual print was made. 2. “Art merchant” means a person who is in the business of dealing, exclusively or nonexclusively, in works of fine art or multiples, or a person who by the person’s occupation claims or impliedly claims to have knowledge or skill peculiar to such works, or to whom such knowledge or skill may be attributed by the person’s employment of an agent or other intermediary who by occupation claims or impliedly claims to have such knowledge or skill. The term “art merchant” includes an auctioneer who sells such works at public auction, and except for multiples, includes persons not otherwise defined or treated as art merchants in this chapter who are consignors or principals of auctioneers. 3. “Author” or “authorship” refers to the creator of a work of fine art or multiple or to the period, culture, source, or origin, as the case may be, with which the creation of the work is identified in the description of the work. 4. “Counterfeit” means a work of fine art or multiple made, altered, or copied, with or without intent to deceive, in such a manner that it appears or is claimed to have an authorship which it does not in fact possess. 5. “Certificate of authenticity” means a written statement by an art merchant confirming, approving, or attesting to the authorship of a work of fine art or multiple, which is capable of being used to the advantage or disadvantage of some person. 6. “Fine art” means a painting, sculpture, drawing, work of graphic art, or print, but not multiples. 7. “Limited edition” means works of art produced from a master, all of which are the same image and bear numbers or other markings to denote a limited production to a stated maximum number of multiples, or which are otherwise held out as limited to a maximum number of multiples. 8. “Master” includes a printing plate, stone, block, screen, photographic negative, or other like material which contains an image used to produce visual art objects in multiples. 9. “Print” means a multiple produced by, but not limited to, such processes as engraving, etching, woodcutting, lithography, and serigraphy, a multiple produced or developed from a photographic negative, or a multiple produced or developed by any combination of such processes. 10. “Proof” means a multiple which is the same as, and which is produced from the same master as the multiples in a limited edition, but which, whether so designated or not, is set aside from and is in addition to the limited edition to which it relates. 11. “Signed” means autographed by the artist’s own hand, and not by mechanical means of reproduction, and if a multiple, after the multiple was produced, whether or not the master was signed. 12. “Visual art multiple” or “multiple” means a print, photograph, positive or negative, or similar art object produced in more than one copy and sold, offered for sale, or consigned in, into, or from this state for an amount in excess of one hundred dollars exclusive of any frame. The term includes a page or sheet taken from a book or magazine and offered for sale or sold as a visual art object, but excludes a book or magazine. 13. “Written instrument” means a written or printed agreement, bill of sale, invoice, certificate of authenticity, catalogue, or any other written or printed note, memorandum, or label describing the work of fine art or multiple which is to be sold, exchanged, or consigned by an art merchant.",
            "1. If an art merchant sells or exchanges a work of fine art or multiple and furnishes to a buyer of the work who is not an art merchant a certificate of authenticity or any similar written instrument presumed to be part of the basis of the bargain, the art merchant creates an express warranty for the material facts stated as of the date of the sale or exchange. 2. Except as provided in subsection 4, an express warranty shall not be negated or limited; however, in construing the degree of warranty, due regard shall be given the terminology used and the meaning accorded the terminology by the customs and usage of the trade at the time and in the locality where the sale or exchange took place. 3. Language used in a certificate of authenticity or similar written instrument, stating that: a. The work is by a named author or has a named authorship, without any limiting words, means unequivocally, that the work is by such named author or has such named authorship. b. The work is “attributed to a named author” means a work of the period of the author, attributed to the author, but not with certainty by the author. c. The work is of the “school of a named author” means a work of the period of the author, by a pupil or close follower of the author, but not by the author. 4. An express warranty and any disclaimer intended to negate or limit the warranty shall be construed wherever reasonable as consistent with each other but subject to the provisions of section 554.2202 on parol and extrinsic evidence. However, the negation or limitation is inoperative to the extent that the negation or limitation is unreasonable or that such construction is unreasonable. A negation or limitation is unreasonable if: a. The disclaimer is not conspicuous, written, and apart from the warranty, in words which clearly and specifically inform the buyer that the seller assumes no risk, liability, or responsibility for the material facts stated concerning the work of fine art. Words of general disclaimer are not sufficient to negate or limit an express warranty. b. The work of fine art is proved to be a counterfeit and this was not clearly indicated in the description of the work. c. The information provided is proved to be, as of the date of sale or exchange, false, mistaken, or erroneous. 5. This section shall apply to an art merchant selling or exchanging a multiple who furnishes the buyer with the name of the artist and any other information including, but not limited to, whether the multiple is a limited edition, a proof, or signed. The warranty provided under this subsection shall include sales to buyers who are art merchants.",
            "A person who makes, alters, or issues a certificate of authenticity or any similar written instrument for a work of fine art or multiple attesting to material facts about the work which are not true, or who makes representations regarding a work of fine art or a multiple attesting to material facts about the work which are not true, with intent to defraud, deceive, or injure another is guilty, upon conviction, of an aggravated misdemeanor.",
            "1. An art merchant who sells a work of fine art or a multiple to a buyer under a warranty attesting to facts about the work which are not true is liable to the buyer to whom the work was sold. a. If the warranty was untrue through no fault of the art merchant, the merchant’s liability is the consideration paid by the buyer upon return of the work in substantially the same condition in which it was received by the buyer. b. If the warranty is untrue and the buyer is able to establish that the art merchant failed to make reasonable inquiries according to the custom and the usage of the trade to confirm the warranted facts about the work, or that the warranted facts would have been found to be untrue if reasonable inquiries had been made, the merchant’s liability is the consideration paid by the buyer with interest from the time of the payment at the rate prescribed by section 535.3 upon the return of the work in substantially the same condition in which it was received by the buyer. c. If the warranty is untrue and the buyer is able to establish that the art merchant knowingly provided false information on the warranty or willfully and falsely disclaimed knowledge of information relating to the warranty, the merchant is liable to the buyer in an amount equal to three times the amount provided in paragraph “b”. This remedy shall not bar or be deemed inconsistent with a claim for damages or with the exercise of additional remedies otherwise available to the buyer. 2. In an action to enforce this section, the court may allow a prevailing buyer the costs of the action together with reasonable attorneys’ and expert witnesses’ fees. If the court determines that an action to enforce this section was brought in bad faith, the court may allow those expenses to the art merchant that it deems appropriate. 3. An action to enforce any liability under this section shall be brought within the time period prescribed for such actions under section 614.1.",
            "As used in this chapter, unless the context otherwise requires: 1. “Breach of security” means unauthorized acquisition of personal information maintained in computerized form by a person that compromises the security, confidentiality, or integrity of the personal information. Good faith acquisition of personal information by a person or that person’s employee or agent for a legitimate purpose of that person is not a breach of security, provided that the personal information is not used in violation of applicable law or in a manner that harms or poses an actual threat to the security, confidentiality, or integrity of the personal information. 2. “Consumer” means an individual who is a resident of this state. 3. “Consumer reporting agency” means the same as defined by the federal Fair Credit Reporting Act, 15 U.S.C. § 1681a. 4. “Debt” means the same as provided in section 537.7102. 5. “Encryption” means the use of an algorithmic process to transform data into a form in which the data is rendered unreadable or unusable without the use of a confidential process or key. 6. “Extension of credit” means the right to defer payment of debt or to incur debt and defer its payment offered or granted primarily for personal, family, or household purposes. 7. “Financial institution” means the same as defined in section 536C.2, subsection 6. 8. “Identity theft” means the same as provided in section 715A.8. 9. “Payment card” means the same as defined in section 715A.10, subsection 3, paragraph “b”. 10. “Person” means an individual; corporation; business trust; estate; trust; partnership; limited liability company; association; joint venture; government; governmental subdivision, agency, or instrumentality; public corporation; or any other legal or commercial entity. 11. “Personal information” means an individual’s first name or first initial and last name in combination with any one or more of the following data elements that relate to the individual if any of the data elements are not encrypted, redacted, or otherwise altered by any method or technology in such a manner that the name or data elements are unreadable: a. Social security number. b. Driver’s license number or other unique identification number created or collected by a government body. c. Financial account number, credit card number, or debit card number in combination with any required security code, access code, or password that would permit access to an individual’s financial account. d. Unique electronic identifier or routing code, in combination with any required security code, access code, or password that would permit access to an individual’s financial account. e. Unique biometric data, such as a fingerprint, retina or iris image, or other unique physical representation or digital representation of biometric data. “Personal information” does not include information that is lawfully obtained from publicly available sources, or from federal, state, or local government records lawfully made available to the general public. 12. “Redacted” means altered or truncated so that no more than five digits of a social security number or the last four digits of other numbers designated in section 715A.8, subsection 1, paragraph “a”, are accessible as part of the data.",
            "1. Any person who owns or licenses computerized data that includes a consumer’s personal information that is used in the course of the person’s business, vocation, occupation, or volunteer activities and that was subject to a breach of security shall give notice of the breach of security following discovery of such breach of security, or receipt of notification under subsection 2, to any consumer whose personal information was included in the information that was breached. The consumer notification shall be made in the most expeditious manner possible and without unreasonable delay, consistent with the legitimate needs of law enforcement as provided in subsection 3, and consistent with any measures necessary to sufficiently determine contact information for the affected consumers, determine the scope of the breach, and restore the reasonable integrity, security, and confidentiality of the data. 2. Any person who maintains or otherwise possesses personal information on behalf of another person shall notify the owner or licensor of the information of any breach of security immediately following discovery of such breach of security if a consumer’s personal information was included in the information that was breached. 3. The consumer notification requirements of this section may be delayed if a law enforcement agency determines that the notification will impede a criminal investigation and the agency has made a written request that the notification be delayed. The notification required by this section shall be made after the law enforcement agency determines that the notification will not compromise the investigation and notifies the person required to give notice in writing. 4. For purposes of this section, notification to the consumer may be provided by one of the following methods: a. Written notice to the last available address the person has in the person’s records. b. Electronic notice if the person’s customary method of communication with the consumer is by electronic means or is consistent with the provisions regarding electronic records and signatures set forth in chapter 554D and the federal Electronic Signatures in Global and National Commerce Act, 15 U.S.C. § 7001. c. Substitute notice, if the person demonstrates that the cost of providing notice would exceed two hundred fifty thousand dollars, that the affected class of consumers to be notified exceeds three hundred fifty thousand persons, or if the person does not have sufficient contact information to provide notice. Substitute notice shall consist of the following: (1) Electronic mail notice when the person has an electronic mail address for the affected consumers. (2) Conspicuous posting of the notice or a link to the notice on the internet website of the person if the person maintains an internet website. (3) Notification to major statewide media. 5. Notice pursuant to this section shall include, at a minimum, all of the following: a. A description of the breach of security. b. The approximate date of the breach of security. c. The type of personal information obtained as a result of the breach of security. d. Contact information for consumer reporting agencies. e. Advice to the consumer to report suspected incidents of identity theft to local law enforcement or the attorney general. 6. Notwithstanding subsection 1, notification is not required if, after an appropriate investigation or after consultation with the relevant federal, state, or local agencies responsible for law enforcement, the person determined that no reasonable likelihood of financial harm to the consumers whose personal information has been acquired has resulted or will result from the breach. Such a determination must be documented in writing and the documentation must be maintained for five years. 7. This section does not apply to any of the following: a. A person who complies with notification requirements or breach of security procedures that provide greater protection to personal information and at least as thorough disclosure requirements than that provided by this section pursuant to the rules, regulations, procedures, guidance, or guidelines established by the person’s primary or functional federal regulator. b. A person who complies with a state or federal law that provides greater protection to personal information and at least as thorough disclosure requirements for breach of security or personal information than that provided by this section. c. A person who is subject to and complies with regulations promulgated pursuant to Title V of the Gramm-Leach-Bliley Act of 1999, 15 U.S.C. § 6801 – 6809. 8. a. A violation of this chapter is an unlawful practice pursuant to section 714.16 and, in addition to the remedies provided to the attorney general pursuant to section 714.16, subsection 7, the attorney general may seek and obtain an order that a party held to violate this section pay damages to the attorney general on behalf of a person injured by the violation. b. The rights and remedies available under this section are cumulative to each other and to any other rights and remedies available under the law."
        ]
    ],
    "pageTitle": "Iowa CPS",
    "title": "",
    "url": "https://docs.google.com/spreadsheets/d/19DvB_-1NZW67ORanCVN0iodJJ_bcFEZaPxVgxAiglAo/pub?output=html",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987662.63/warc/CC-MAIN-20150728002307-00088-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 163042471,
    "recordOffset": 163011035,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Iowa CPS : Iowa",
    "textAfterTable": "Published by Google Sheets – Report Abuse – Updated automatically every 5 minutes",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}