{
    "relation": [
        [
            "Date",
            "May 14, 1993",
            "May 17, 1999",
            "Jun 18, 2003",
            "Nov 28, 2003",
            "Jan 27, 2004"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: KAISER OPTICAL SYSTEMS, INC., MICHIGAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:TEDESCO, JAMES M.;BRADY, LOIS A.K.;COLBURN, WILLIS S.;REEL/FRAME:006564/0555 Effective date: 19930513",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20031128"
        ]
    ],
    "pageTitle": "Patent US5471327 - Holographic diffuser for back-lit display - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5471327?dq=6008737",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00038-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 469170463,
    "recordOffset": 469145814,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17521=Due to their small size and low weight, flat-panel displays have become increasingly popular for volume-limited and portable applications. See \"Flat-Panel Displays,\" Scientific American, March 1993, p. 90. Transmissive displays such as liquid-crystal (LCD) displays have been especially well received due to their extremely low power consumption and potential for high resolution, including full color applications.}",
    "textBeforeTable": "Patent Citations FIG. 6 illustrates an alternative method of forming high aspect ratio holographic diffusers, this being a simple \"contact\" or close proximity-type copy of a master asymmetric diffuser, which may be holographic, in lieu of projection through a mask. This process typically produces a holographic copy that scatters over larger angles than the master, therefore requiring an appropriately compensated master design. Collimated incident laser illumination 140 is directed through a master diffuser 142 which may be protected by sealing plates 144. The hologram to be recorded 146, may take the form of a coating of dichromated gel material on a substrate 148. An absorbent layer 150 is added beneath substrate 148, and some type of spacer, 152, may be used to space recording surface 146 away from plate 144, thus providing protection during exposure. Essentially, the holographic diffuser records the speckle pattern generated by the masked diffuser, and if the mask is much larger in one dimension than in the other, the speckle pattern will have different feature size statistics in the two dimensions, which, in turn, will diffract light with different angular statistics in the two dimensions upon reconstruction. Unless the hologram is physically small relative to the rest of the recording setup shown in FIG. 5, the lobes may not be normal to the surface of the resulting diffuser but instead exhibit an angular diffraction pattern across the surface of the plate upon reconstruction. This",
    "textAfterTable": "US4984872 * Jun 16, 1989 Jan 15, 1991 Rockwell International Corporation Wide viewing angle avionics liquid crystal display US5037166 * Jan 13, 1989 Aug 6, 1991 Astronautics Corporation Of America Holographic optical element for instrument panel displays US5046793 * May 26, 1989 Sep 10, 1991 Litton Systems, Inc. Chromatically corrected directional diffusing screen US5278532 * Sep 14, 1987 Jan 11, 1994 Hughes Aircraft Company Automotive instrument virtual image display US5282117 * Jun 8, 1992 Jan 25, 1994 Fritts Robert W Light leveling means for fluorescent backlit displays or the like US5365354 * Mar 9, 1992 Nov 15, 1994 Physical Optics Corporation Grin type diffuser based on volume holographic material EP0420072A2 * Sep 21, 1990 Apr 3, 1991 TOSHIBA LIGHTING &amp; TECHNOLOGY CORPORATION Liquid crystal device FR2677136A1",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}