{
    "relation": [
        [
            "Date",
            "11 Jul 2001",
            "1 Nov 2002",
            "15 Mar 2007",
            "16 Mar 2007",
            "24 Apr 2008",
            "22 Jun 2010",
            "18 Jun 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: WESTERN UNION FINANCIAL SERVICES, INC., A DIVISION Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:DIVELEY, KEITH W.;REEL/FRAME:011972/0591 Effective date: 20010530",
            "Owner name: FIRST DATA CORPORATION, COLORADO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:DIVELEY, KEITH W.;HANSEN, KURT;REEL/FRAME:013437/0018;SIGNING DATES FROM 20021014 TO 20021031",
            "",
            "Owner name: FIRST DATA CORPORATION, COLORADO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:FIRST DATA CORPORATION;REEL/FRAME:019019/0653 Effective date: 20061019 Owner name: THE WESTERN UNION COMPANY, COLORADO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:FIRST DATA CORPORATION;REEL/FRAME:019019/0653 Effective date: 20061019",
            "Owner name: THE WESTERN UNION COMPANY, COLORADO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:FIRST DATA CORPORATION;REEL/FRAME:020848/0397 Effective date: 20080415",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US20020143709 - Payment service method and system - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US20020143709",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473997767,
    "recordOffset": 473976829,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations [0049]FIG. 13 shows a client-specific enrollment methodology, as contrasted with a generic enrollment procedure commencing with client-specific payment service advertising which identifies the payment service provider 4 and directs potential customers to its agent network 14. The payment service provider agent enrolls a customer on behalf of the client at 226. The customer is typically either a present or prospective customer for the client's goods or services and has been directed to the payment service providers agent network 14 as a way of paying for same. At 228 the customer and the payment service provider agent select the features and pricing desired by the customer for the client's products. An account number can optionally be assigned on behalf of the client by the payment service provider agent at 230. The payment service provider is paid by the customer at 232, and in turn pays the agent at 234. [0048] An additional product support procedure is shown in FIG. 12 and commences with the client 8 identifying multiple products to be supported at 208. For example, a telecommunications client might provide various products such as prepaid dialtone, prepaid cellular, prepaid internet access and insurance. All of these products could be provided on a single card. A premium fee could be charged by the payment service provider 4 at 210. Destination codes could be assigned to the client's various products and a preferred",
    "textAfterTable": "US8150763 * 1 Aug 2006 3 Apr 2012 The Western Union Company Systems and methods for staging transactions, payments and collections US8157165 10 Jul 2009 17 Apr 2012 HSBC Card Services Inc. User selectable functionality facilitator US8162208 27 Feb 2009 24 Apr 2012 HSBC Card Services Inc. Systems and methods for user identification string generation for selection of a function US8275702 28 Dec 2005 25 Sep 2012 United States Automobile Association Systems and methods for processing financial obligations of a customer US20040205023 * 15 Oct 2003 14 Oct 2004 First Data Corporation Money transfer convenience card, systems and methods US20040210476 * 28 Jan 2004 21 Oct 2004 First Data Corporation Airline ticket payment and reservation system and methods US20040243512 * 30 May 2003 2 Dec 2004 Regions Financial Corporation Dynamic enrollment control system, method and computer program product US20090216579",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}