{
    "relation": [
        [
            "Description",
            "Download the video",
            "Click to Watch",
            "",
            "Flash video player",
            ""
        ],
        [
            "Files",
            "fls_090910_galileo.flv",
            "fls_090910_galileo.html",
            "Galileo-Fac Lect 09Sep10_Page_01.jpg",
            "player_flv_multi.swf",
            "PlayVid-550x305.jpg"
        ],
        [
            "Size",
            "278.1Mb",
            "2.110Kb",
            "60.17Kb",
            "14.15Kb",
            "15.13Kb"
        ],
        [
            "Format",
            "video/flv",
            "HTML",
            "JPEG image",
            "application/swf",
            "JPEG image"
        ],
        [
            "View",
            "View/Open",
            "View/Open",
            "",
            "View/Open",
            ""
        ]
    ],
    "pageTitle": "Galileo: The First Astronomer to Use a Telescope",
    "title": "",
    "url": "http://scholarspace.manoa.hawaii.edu/handle/10125/12793?show=full",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00182-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 212476866,
    "recordOffset": 212468664,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item File(s) en_US Moving Image dc.type.dcmi en_US Presentation dc.type en_US Galileo: The First Astronomer to Use a Telescope dc.title en_US en-US dc.language.iso en_US This year celebrates the 400th anniversary of the use of telescopes for viewing the universe. On August 25, 1609, Galileo Galilei first demonstrated his telescope for Venetian lawmakers. To commemorate the event and inaugurate UH Manoa’s celebration of the International Year of Astronomy, Dr. Robert Joseph, Professor at the Institute for Astronomy, will present the first joint lecture for the 2009 Faculty and Astronomy Lecture Series on Thursday, September 10th at 3:30 pm in Hamilton Library’s Room 301. Galileo made several discoveries with the telescope which undercut the classical geocentric cosmology inherited from the Greeks. Because Aristotelian thought was the core of the university curriculum at that time, as well as part of the Scholastic synthesis with Christian theology, Galileo into some trouble with his academic colleagues as well the Church. In this talk Joseph will describe some of Galileo's discoveries with his telescope, his scientific style, and his confrontation with the Roman Inquisition. dc.description.abstract en_US Faculty Lecture Series: \"Galileo: The First Astronomer to Use a Telescope\" Robert Joseph Astronomer at Institute for Astronomy September 10, 2009",
    "textAfterTable": "This item appears in the following Collection(s) Joseph, Robert D. [1] Astronomer, Institute for Astronomy Special Presentations - UHM Library [16] Presentations given in the UH Manoa Libraries Show simple item record Search Search This Collection Advanced Search Browse All of ScholarSpace Communities & Collections By Issue Date Authors Titles Subjects This Collection By Issue Date Authors Titles Subjects My Account",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}