{
    "relation": [
        [
            "Rk",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24",
            "25",
            "26",
            "27",
            "28",
            "29",
            "30"
        ],
        [
            "Athlete",
            "Matt Biondi (USA)",
            "Kristin Otto (GDR)",
            "Daniela Silivaş (ROU)",
            "Vladimir Artyomov (URS)",
            "Florence Griffith Joyner (USA)",
            "Dmitry Bilozerchev (URS)",
            "Valery Lyukin (URS)",
            "Svetlana Boginskaya (URS)",
            "Yelena Shushunova (URS)",
            "Janet Evans (USA)",
            "Birgit Fischer-Schmidt (GDR)",
            "Heike Friedrich (GDR)",
            "Chris Jacobs (USA)",
            "Tom Jager (USA)",
            "Carl Lewis (USA)",
            "Silke Hörner (GDR)",
            "Katrin Meißner (GDR)",
            "Daniela Hunger (GDR)",
            "Manuela Stellmach (GDR)",
            "Birte Weigang (GDR)",
            "Vanya Gesheva (BUL)",
            "Paul MacDonald (NZL)",
            "Holger Behrendt (GDR)",
            "Uwe Daßler (GDR)",
            "Cornelia Sirch (GDR)",
            "Igor Polyansky (URS)",
            "Gabriela Potorac (ROU)",
            "Sven Tippelt (GDR)",
            "Gennady Prigoda (URS)",
            "Heike Drechsler (GDR)"
        ],
        [
            "Gold",
            "5",
            "6",
            "3",
            "4",
            "3",
            "3",
            "2",
            "2",
            "2",
            "3",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Silver",
            "1",
            "0",
            "2",
            "1",
            "1",
            "0",
            "2",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "2",
            "1",
            "1",
            "1"
        ],
        [
            "Bronze",
            "1",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "1",
            "2",
            "2",
            "2"
        ],
        [
            "Total",
            "7",
            "6",
            "6",
            "5",
            "4",
            "4",
            "4",
            "4",
            "4",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3"
        ]
    ],
    "pageTitle": "1988 Seoul Summer Games | Olympics at Sports-Reference.com",
    "title": "",
    "url": "http://www.sports-reference.com/olympics/summer/1988/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00082-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 728937439,
    "recordOffset": 728921479,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{11121=You Are Here > OLY Home > Summer Games > 1988 Seoul, 4528=By then, however, most of the Eastern Bloc countries had agreed to compete in Seoul, making 1988 the first Summer Olympic competition in 12 years between the United States, the Soviet Union and the German Democratic Republic. After the North Korean's final boycott announcement, Cuba and Ethiopia also announced that they would not attend the Olympics, out of solidarity with North Korea. Nicaragua, Albania, and the Seychelles also did not attend the Olympics, though their reasons were less clear and may not have been directly related to any boycott., 8661=Host City: Seoul, South Korea (September 17, 1988 to October 2, 1988) Opening Ceremony: September 17, 1988 (opened by President Roh Tae-Woo) Lighter of the Olympic Flame: Won-Tak Kim, Mi-Chung Sohn, Sun-Man Chung Takers of the Olympic Oath: Heo Jae, Son Mi-Na (athlete) and Hak-Rae Lee (official) Closing Ceremony: October 2, 1988 Events: 237 in 27 sports, 5834=In late September 1981, when the IOC awarded the 1988 Olympics to Seoul, the Olympic world was stunned. The choice was highly controversial as many prominent nations in the Olympic Movement, notably the Soviet Bloc nations, did not have diplomatic relations with the Seoul government. After the political problems that had marred the last few Olympics, there was widespread concern that another boycott would ensue because of this., 2653=On the track, the world was stunned by the performances of Florence Griffith Joyner. A solid world-class sprinter for a decade, she had re-dedicated herself in 1988 and had shattered records at the American Olympic Trials. At the Olympics she won the 100 and 200, setting world records in the 200 finals. In the 100, she posted a time that was wind-aided, but was otherwise the fastest time ever recorded. She then helped the American women win a gold medal in the 4×100 relay. Finally, she was asked by the American coaches to run anchor in the 4×400 relay. She did so, and narrowly missed catching the Soviet's Olha Bryzhina, as the Americans won a silver medal. Her total haul was three gold medals and one silver., 1513=The biggest media event of the 1988 Olympic Games was the disqualification of Canadian sprinter Ben Johnson, after he had won the 100 metres in the world record time of 9.79, and defeating Carl Lewis in the process. But a few days later, Johnson tested positive for stanazolol, an anabolic steroid, and was disqualified with Lewis receiving the gold medal. After the uproar of the scandal, the Canadian launched an inquiry into drug use in international sport, the Dubin Inqury. At the inquiry, Johnson admitted he had used steroids for several years., 778=One of Seoul's legacies to the Olympic Movement was a new Olympic Flag. The main Olympic flag was termed the Antwerp flag, because it had been made in 1920 and donated to the IOC by the Antwerp organizing committee. But the flag was worn and it was soon to be retired to the Olympic Museum. Seoul provided the IOC with a replacement, fashioned from pure raw Korean silk, with the needlework done by skilled Korean craftsmen. Thus the Seoul legacy will literally fly over many future Olympic Games.}",
    "textBeforeTable": "Athlete Medal Leaders 1 1 0 0 Greece 52 1 1 0 0 Djibouti 51 1 1 0 0 Pakistan 50 1 1 0 0 Mongolia 49 1 1 0 0 Thailand 48 1 1 0 0 Colombia 47 1 1 0 0 Philippines 46 1 0 1 0 Iran 45 1 0 1 0 Chile 44 1 0 1 0 Senegal 43 1 0 1 0 Indonesia 42 1 0 1 0 Peru 41 1 0 1 0",
    "textAfterTable": "Sports Archery Athletics Basketball Boxing Canoeing Cycling Diving Equestrianism Fencing Football Gymnastics Handball Hockey Judo Modern Pentathlon Rhythmic Gymnastics Rowing Sailing Shooting Swimming Synchronized Swimming Table Tennis Tennis Volleyball Water Polo Weightlifting Wrestling",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}