{
    "relation": [
        [
            "",
            "Kamehameha",
            "Punahou",
            "Iolani",
            "Pac-Five",
            "Mid-Pacific"
        ],
        [
            "W",
            "8",
            "8",
            "4",
            "3",
            "0"
        ],
        [
            "L",
            "1",
            "2",
            "6",
            "6",
            "8"
        ],
        [
            "T",
            "0",
            "0",
            "0",
            "1",
            "1"
        ],
        [
            "Pts",
            "24",
            "24",
            "12",
            "10",
            "1"
        ],
        [
            "GF",
            "29",
            "30",
            "16",
            "11",
            "3"
        ],
        [
            "GA",
            "5",
            "7",
            "17",
            "25",
            "35"
        ]
    ],
    "pageTitle": "StarBulletin.com | Sports | /2006/01/25/",
    "title": "",
    "url": "http://archives.starbulletin.com/2006/01/25/sports/scoreboard.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00152-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 15936691,
    "recordOffset": 15924656,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{15899=OIA division I playoffs: First round, Nanakuli at Moanalua, Roosevelt at Leilehua, quarterfinals, Campbell at Mililani, Kapolei at Kailua, 3:30 p.m., 16992=OIA girls playoffs: Quarterfinals, Kapolei-Kalani winne vs. Kaiser at Pearl City, Castle-Radford winner vs. Mililani at Moanalua, 5:15 p.m.; Kalaheo-Leilehua winner at Pearl City, Aiea-Kailua winner at Moanalua, 7 p.m., 17624=OIA division II playoffs: Semifinals, McKinley at Kalaheo, Aiea at Waipahu, 3:30 p.m., 15718=ILH: Sacred Hearts at Kamehameha, Mid-Pacific at Iolani, Punahou vs. Pac-Five at Ala Wai Field, St. Francis vs. Maryknoll at Moiliili Field, 3:45 p.m., 18641=Jan. 14, 17280=OIA playoffs: Consolation, Campbell-Mililani loser vs. Kapolei-Kailua loser, 3:30 p.m., at higher seed's field; quarterfinals, Nanakuli-Moanalua winner at Pearl City, Roosevelt-Leilehua winner at Castle, 3:30 p.m; semifinals, Campbell-Mililani winner vs. Kapolei-Kailua winner, 5 p.m., Central Oahu Regional Park., 14978=PWC men: Hawaii Pacific vs. Chaminade, 7:30 p.m., Blaisdell Arena., 16442=ILH division II boys: Word of Life vs. Lutheran at Hawaii Baptist, 6:30 p.m., 16749=PWC men: Hawaii-Hilo at Brigham Young-Hawaii, 7:30 p.m., Cannon Activities Center., 15500=OIA girls playoffs: First round, Kalaheo vs. Leilehua at Kapolei, Aiea vs. Kailua at Castle, 5:15 p.m.; Kalani at Kapolei, Radford at Castle, 7 p.m.}",
    "textBeforeTable": "At Detroit NFL Super Bowl HARRAH'S ODDS OIA division II playoffs: Semifinals, McKinley at Kalaheo, Aiea at Waipahu, 3:30 p.m. OIA playoffs: Consolation, Campbell-Mililani loser vs. Kapolei-Kailua loser, 3:30 p.m., at higher seed's field; quarterfinals, Nanakuli-Moanalua winner at Pearl City, Roosevelt-Leilehua winner at Castle, 3:30 p.m; semifinals, Campbell-Mililani winner vs. Kapolei-Kailua winner, 5 p.m., Central Oahu Regional Park. SOFTBALL OIA girls playoffs: Quarterfinals, Kapolei-Kalani winne vs. Kaiser at Pearl City, Castle-Radford winner vs. Mililani at Moanalua, 5:15 p.m.; Kalaheo-Leilehua winner at Pearl City, Aiea-Kailua winner at Moanalua, 7 p.m. SOCCER WAC women: Hawaii vs. Utah State, 7 p.m., Stan Sheriff Center. PWC men: Hawaii-Hilo at Brigham Young-Hawaii, 7:30 p.m., Cannon Activities Center. OIA West boys: Waipahu at Leilehua, Waialua at Mililani, Campbell at Radford, Waianae at Kapolei, Aiea at Pearl City, games start 15 minutes after end of 5 p.m. JV game. ILH division II boys: Word of Life vs. Lutheran at Hawaii Baptist, 6:30 p.m. BASKETBALL Oahu AJA: Ewa vs. McCully at Central Oahu Regional Park field 4, 7 p.m. BASEBALL Tomorrow MPSF men: Hawaii vs. UC Irvine, 7 p.m., Stan Sheriff Center. VOLLEYBALL OIA division I playoffs: First round, Nanakuli at Moanalua, Roosevelt at Leilehua, quarterfinals, Campbell at Mililani, Kapolei at Kailua, 3:30 p.m. ILH: Sacred Hearts at Kamehameha, Mid-Pacific at Iolani, Punahou vs. Pac-Five at Ala Wai Field, St. Francis",
    "textAfterTable": "SOCCER ILH Yesterday VARSITY BOYS Iolani 2, Punahou 1 Kamehameha 2, Pac-Five 0 Mid-Pacific 7, Damien 0 Saint Louis 3, Hawaii Baptist 0 Goal scorers--Iol: Dylan Langley, Morgan Langley. Pun: Kyle Ertel. Kam: Kimo Komomua, Esera Vegas. MPI: Pono Borges-Akau 3, Scotty Graham 2, Woody Woodhull, Dave Young. StL: Nick Botelho, Pat Muller, Austin Wakinekona. VARSITY GIRLS Correction to standings run yesterday (adds one more leading scorer to list) W L T Pts GF GA Kamehameha 8 1 0 24 29 5 Punahou 8 2 0 24 30 7 Iolani 4 6 0 12 16 17 Pac-Five 3 6 1 10 11 25 Mid-Pacific 0 8 1 1 3 35 Leading goal scorers-- 8: Caycie Gusman, Kam. 6: Nicole Ha, Iol. 5: Tani Costa, Pac. 4: Lizzy Carlson, Pun; Alyssa Chun, Kam; Ashley Nied, Pun; Marisa Schoen, Pun. Yesterday Iolani 3, Pac-Five 0 Kamehameha 5, Mid-Pacific 0 Goal scorers--Iol: Nicole Ha, Rachel Matsukawa, Jesi Sasaki. Kam: Caycie Gusman 3, Amber Fuller, Markee Nobriga. SURFING HASA surf series At Sandy Beach Saturday and Sunday SHORTBOARDS Menehune 2A--1. Benjamin Brand; 2. Isaiah Moniz; 3. Austin Vicente; 4. Eala Stewart; 5. Joshua",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}