{
    "relation": [
        [
            "Mode",
            "Motor Bus",
            "Heavy Rail",
            "Commuter Rail",
            "Light Rail",
            "Demand Response"
        ],
        [
            "2004",
            "0.63",
            "0.96",
            "6.86",
            "2.24",
            "0.29"
        ],
        [
            "2005",
            "0.63",
            "0.61",
            "8.16",
            "1.68",
            "0.50"
        ],
        [
            "2006",
            "0.76",
            "0.37",
            "7.52",
            "1.50",
            "0.43"
        ],
        [
            "2007",
            "0.79",
            "0.46",
            "7.46",
            "2.62",
            "0.68"
        ],
        [
            "2008",
            "0.70",
            "0.75",
            "7.06",
            "1.59",
            "0.41"
        ]
    ],
    "pageTitle": "2010 Conditions and Performance - Policy | Federal Highway Administration",
    "title": "Exhibit 5-21 Fatalities per 100 Incidents by Mode, 2004–2008",
    "url": "http://www.fhwa.dot.gov/policy/2010cpr/chap5.cfm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 28,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00093-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441997395,
    "recordOffset": 441967071,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{16389=U.S. Department of Transportation Federal Highway Administration 1200 New Jersey Avenue, SE Washington, DC 20590 202-366-4000, 1445=Statistics in this section are primarily drawn from the Fatality Analysis Reporting System (FARS). The FARS is maintained by NHTSA, which has a cooperative agreement with States to provide information on fatal crashes. Police crash reports, death certificates, and other documents provide data that are tabulated daily and included in the FARS. For consistency with other sections of this report, safety statistics in this section were compiled during the fall of 2009 and represent a “snapshot in time” during the preparation of this report, which is why they may not precisely correspond to other reports completed during the last year., 5773=FHWA Home / Policy & Governmental Affairs / 2010 Conditions and Performance, 471=There were more than 5.8 million police-reported motor vehicle crashes in the United States in 2008. Fewer than 1 percent (0.6 percent or 34,017) of these crashes were severe enough to result in a fatality, while 28.1 percent (approximately 1.63 million) resulted in injuries and 71.4 percent (approximately 4.15 million) resulted in property damage only, as shown in Exhibit 5-1.}",
    "TableContextTimeStampAfterTable": "{31865=Initiated in 2009, this $1.2-million program addresses the issue of local and rural safety through outreach and the demonstration and evaluation of innovative solutions. Outreach is aimed at actively engaging public decision makers through workshops and forums, providing easy-to-understand technical information and guidance, improving the Rural Highway Safety Clearinghouse, and providing peer-to-peer technical support., 50651=Intersection-related crashes accounted for nearly 40 percent of all police-reported crashes and approximately 47 percent of all people injured in 2008. Older drivers and pedestrians are particularly at risk at intersections; 40 percent of the traffic fatalities among drivers aged 80 or older and more than one-third of the pedestrian deaths among people aged 70 or older were intersection-related., 3405=Exhibit 5-2 describes the considerable improvement in highway safety since Federal legislation first addressed the issue in 1966. That year, the fatality rate was 5.50 fatalities per 100 million vehicle miles traveled (VMT). By 2008, the fatality rate had declined to 1.25 per 100 million VMT. This sharp decline in the fatality rate occurred even as the number of licensed drivers doubled over that same period., 47006=In 2008 fatal crashes in which a rollover occurred, the occupant fatality rate for light pickup trucks was six per 100,000 registered vehicles. Likewise, the rate per 100,000 registered vehicles was almost six for light utility trucks, three for other light trucks, and almost three for vans. Passenger cars had the lowest fatality rate for rollover crashes, when compared with other vehicle types., 63118=The number of occupant fatalities in light trucks decreased from 11,528 in 2000 to 10,764 in 2008 (a decrease of 6.6 percent). There were approximately 768,000 light-truck occupants injured in 2008, down from 886,566 in 2000., 94635=Exhibit 5-21 shows the number of fatalities per 100 incidents for each of the five largest transit modes from 2004 to 2008. This metric does not represent the percentage of incidents that are fatal, as some incidents result in multiple fatalities. The metric does, however, show the likelihood that a fatality will result from an incident. Although commuter rail has a very low number of incidents per PMT (as indicated in Exhibit 5-20), commuter rail incidents are far more likely to result in a fatality than incidents occurring on any other mode. Most likely, this is because the average speed of commuter rail vehicles is considerably higher than the other modes (except vanpools). Motor buses, on the other hand, have a high number of incidents per PMT, but a lower chance of having an incident result in a fatality than almost any other mode (perhaps related to their low average speed). While light rail and motor bus modes of transit have similar numbers of incidents per PMT, an incident on light rail is approximately 2.3 times more likely to produce a fatality than an incident on a motor bus, based on 2008 data. It is possible that this is a result of the higher mass and longer stopping distance of light rail vehicles relative to motorbuses. It could also be that light rail vehicles attract more suicide attempts, some of which may not be recognizable as such and are not excluded from the fatality count., 68197=Exhibit 5-13 describes the breakdown of occupant injuries between 2000 and 2008. The number of injuries decreased for passenger cars, buses, light trucks, and large trucks during that period. Injuries for motorcycle riders drastically increased during this same period, rising from 57,723 to approximately 96,000, an increase of more than 66 percent over 8 years., 58292=In 2008, there were 13,846 fatalities in which either the driver or motorcycle operator had a BAC of 0.01 g/dL or greater. Of all fatalities attributable to alcohol in 2008, 27 percent occurred between the hours of midnight and 3 a.m.; alcohol-related fatalities represent 64 percent of all fatalities that occurred during those hours. Of the fatalities from crashes that involved a driver with a BAC of 0.08 g/dL (alcohol-impaired) or higher, 43 percent (3,432) involved a driver between the ages of 21 and 34 years old. The age group of drivers 20 and younger made up 9 percent of the total. Underage drinking and driving continues to be a major problem, despite years of education and law enforcement programs., 21336=As shown in Exhibit 5-5, the absolute number of fatalities grew slightly between 2000 and 2006 and then declined to 37,261 deaths in 2008. During this period (from 2000 to 2008), the number of fatalities on urban roads decreased from 16,113 to 15,983 (a reduction of almost 1 percent). At the same time, the number of fatalities on rural roads decreased from 24,838 to 20,905 (a reduction of almost 16 percent). In 2008, fatalities from urban crashes accounted for 43 percent of all fatalities, while those resulting from rural crashes accounted for 56 percent.1 The fatality rate, however, decreased on both urban and rural roads since 2000, due in part to a combination of safety countermeasures and programs introduced by DOT and State partners, as well as a decrease in VMT between 2007 and 2008., 97789=Suicides and homicides represented about a quarter of transit fatalities in 2008, perhaps a bit more since it is possible not all suicide attempts are recognized as such. Data on these fatalities since 2000 are shown in Exhibit 5-22, which indicates a modest upward trend., 57174=Alcohol-related driving is a serious public safety problem in the United States. In 2008, 13,846 Americans were killed in alcohol-related crashes on the Nation's highways. The NHTSA estimates that alcohol was involved in 41 percent of fatal crashes in 2008., 60339=In 2000, the cost of speeding-related crashes was estimated to be $76,865 per minute or $1,281 per second. Speeding reduces a driver's ability to steer safely around curves or objects in the roadway, extends the distance necessary to stop a vehicle, and increases the distance a vehicle travels while the driver reacts to a dangerous situation., 41770=The majority of roadway departure crashes happen at night. About two-thirds of roadway departure fatalities occur on rural roads. Rural highways are often not as well-lit as urban roadways and are often designed with narrow travel lanes, sharp roadway curvatures, or unimproved shoulders. Environmental factors including inclement weather such as fog, snow, smoke, or dust storms can also decrease the visibility of pavement markings or roadway curvature. In 2008, about 17 percent of all crashes were attributed at least in part to weather conditions. Of the 19,794 total roadway departure fatalities that occurred in 2008, more than 45 percent involved the rollover of a passenger vehicle., 11339=The overall number of traffic deaths also decreased between 1966 and 2008. In 1966, there were 50,894 traffic deaths. Fatalities reached their highest point in 1972 with 54,589 fatalities, then declined sharply following the implementation of a national speed limit, reaching a record low point of 39,250 fatalities in 1992. Between 1992 and 2006, there was more limited progress in reducing the number of fatalities. The number of fatalities generally increased year-to-year from 1992 to 2006, when 42,708 Americans lost their lives in crashes. However, in 2008, there was a record low number of fatalities (37,261), the lowest number since 1966. Exhibit 5-3 and Exhibit 5-4 compare the number of fatalities with fatality rates between 1980 and 2008., 15256=Exhibit 5-5 and Exhibit 5-6 show the number of fatalities and fatality rates by rural and urban functional system between 2000 and 2008. These exhibits show the distinction between fatalities and fatality rates., 59794=Speeding is one of the most prevalent factors contributing to traffic crashes. The economic cost to society of speeding-related crashes is estimated by NHTSA to be $40.4 billion per year. In 2008, speeding was a contributing factor in 31 percent of all fatal crashes; 11,674 lives were lost in speeding-related crashes. In 2008, 35 percent of all motorcycle riders involved in fatal crashes were speeding, compared with 23 percent for passenger car drivers, 19 percent for light-truck drivers, and 8 percent for large-truck drivers., 25203=Exhibit 5-6 shows the fatality rates for every urban and rural functional system between 2000 and 2008. Urban Interstate highways were the safest functional system, with a fatality rate of 0.47 per 100 million VMT in 2008. Among urban roads, Interstate highways and other principal arterials recorded the sharpest declines in fatality rates over this 8-year period, as each experienced an overall reduction of approximately 23 percent., 34124=Timely emergency response and treatment can be challenging in rural areas, which has an impact on fatality rates. The December 2006 NHTSA publication, Traffic Crashes Take Their Toll on America's Rural Roads, indicates that it takes emergency personnel an average of 19 minutes to arrive at a crash scene in a rural area, compared with 7 minutes in an urban area. The total time from occurrence of a crash to arrival at the hospital averages 53 minutes in rural areas in contrast to 36 minutes in urban areas., 80835=Exhibit 5-15 shows annual fatalities for transit services in both absolute numbers and adjusted according to the number of passenger miles traveled (PMT) in each year for 2000 to 2008. Fatality numbers include reported incidents on commuter rail, heavy rail, light rail, demand response, and motor bus but exclude suicides and homicides. Both the count of 216 fatalities for 2008 and the rate of 0.42 fatalities per 100 million passenger miles demonstrate that transit is an extremely safe mode of transportation. With the fatality count steadily trending down since 2002, it experienced an unexplained increase of 30 deaths in 2007. This significant increase was not the result of any single incident. The fatality count in 2008 dropped back to the pre-2007 levels in spite of the September 13, 2008, collision between a Metrolink commuter train and a Union Pacific freight train in Chatsworth, California, that killed 25 and injured 135., 10858=While the overall number of fatalities dropped by more than 20 percent in 20 years (between 1988 and 2008), the overall number of traffic-related injuries also decreased by more than 31 percent during that same period (from 3,416,000 to 2,346,000). Injuries increased between 1992 and 1996, but have steadily declined since then. In 1988, the injury rate was 169 per 100 million VMT; by 2008, the number had dropped (by more than 52 percent) to 80 per 100 million VMT., 40798=Some roadway departures can be attributed to drivers being distracted while attempting to operate mobile devices in their vehicles, causing them to drift out of the lane and off the road. Research shows that using a cell phone while driving can pose a serious cognitive distraction that degrades driver performance. Distracted driving can be caused by anything that makes drivers take their eyes off the road or hands off the steering wheel, or that interrupts concentration. In 2008, a total of 5,870 fatalities and 515,000 injuries involved distracted driving. This accounts for 16 percent of total fatalities in 2008. Even the use of hands-free devices can impair drivers' reaction times. The available research indicates that operating either a hands-free or hand-held cell phone can present cognitive distraction significant enough to degrade a driver's performance, potentially causing a driver to miss key visual and audio cues needed to avoid a crash., 60696=For drivers involved in fatal crashes, young males are the most likely to be speeding. The relative proportion of speeding-related crashes to all crashes decreases with increasing driver age. In 2008, 37 percent of male drivers in the 15- to 24-year-old age groups who were involved in fatal crashes were reported to be speeding at the time of the crash., 62590=While speeding has often been seen as a prevalent occurrence on major highways, 88 percent of speeding-related fatalities occurred on roads that were not Interstate System highways in 2008., 67615=The most significant, consistent increase in fatalities among vehicle types involved those who ride motorcycles. The number of motorcyclists who died in crashes increased each year between 2000 and 2008, rising by almost 83 percent over 8 years from 2,897 to 5,290. Motorcycle crashes are frequently speed-related. Speed is two times more likely to be a factor in fatal motorcycle crashes than in passenger car or light truck crashes. Studies also have shown that alcohol is more likely to be a factor in motorcycle crashes than in passenger car or light truck crashes., 30762=The overall fatality rate decreased by 9 percent on rural roads between 2000 and 2008. Among rural roads, Interstate highways and minor collectors recorded the sharpest declines in fatality rates over this period. The fatality rate for rural minor collectors in 2008 was 17 percent lower than in 2000. Likewise, the fatality rate for rural Interstates dropped by 18 percent over the same period. Despite the overall decrease in fatality rate on both urban and rural functional systems, rural roads are far more dangerous than their urban counterparts. A number of factors collectively result in this rural road safety challenge, such as greater curvature and obstacles close to the roadway, designs that contribute to roadway departure, and higher levels of speeding on nonseparated roadways., 55022=The number of nonmotorist fatalities decreased from 5,597 in 2000 to 5,282 in 2008, a 5.6 percent decrease in 8 years. While the number of pedestrians killed by motor vehicle crashes has decreased by 8 percent over this period, the number of pedalcyclists and other nonmotorists killed has increased by 3 percent and 33 percent, respectively. Still, in 2008, 82.8 percent of all nonmotorist fatalities were pedestrians. About 13.5 percent were pedalcyclists, and the remaining 3.5 percent were other nonmotorists. More than 13 percent of the nonmotorist crash fatalities were alcohol-related in 2008, where a driver or motorcycle operator had a blood alcohol concentration (BAC) of 0.08 gram per deciliter (g/dL) or greater., 79841=Since 2002, an injury has been reported only when a person has been immediately transported away from the scene of a transit incident for medical care. Any event producing a reported injury is also reported as an incident., 90845=Exhibit 5-20 provides data on incidents and injuries per 100 million PMT for transportation services on the five largest modes from 2004 to 2008 (excluding suicides and homicides). This data suggests that the highway modes (motor bus and demand response) became significantly safer in 2007 and 2008; however, given this dramatic decrease is unexplained, the data for these years may also suggest a reporting inconsistency. Data for the rail modes is volatile, but does not suggest any significant positive or negative trends over this period., 80076=The definition of a transit-related fatality was not revised in 2002. A transit-related fatality is reported for any death occurring within 30 days of a transit incident which is confirmed to be a result of that incident. Fatality data are provided from 2000 through 2008., 63356=The number of occupant fatalities in large trucks decreased by 10 percent, from 754 in 2000 to 677 in 2008. While occupants of large trucks represent less than 2 percent of all highway fatalities, total fatalities from crashes that involve large trucks (including both the occupants of large trucks and others killed in crashes involving large trucks) account for more than 11 percent of all highway fatalities. The number of all other vehicle occupants killed in crashes involving a large truck decreased by 24 percent, from 4,114 in 2000 to 3,139 in 2008. Approximately 90,000 people were injured in crashes involving large trucks in 2008., 56709=The number of nonmotorists injured in crashes in 2008 was 130,000. This constitutes almost 6 percent of total crash-related injuries. Pedestrians represented 53 percent (69,000) of these injuries, while pedalcyclists represented 40 percent (52,000). Of the total injuries sustained by nonmotorists, 16 percent were incapacitating injuries (21,000), usually defined as inability to walk, drive, or continue other normal activities., 24684=FHWA launched this program in 2008 to improve rural road safety. Twenty-one rural safety projects were selected in 14 States, 3 counties, and 2 parishes to receive a total of $14.7 million. Nine projects focused on application of low-cost safety countermeasures and 12 focused on applying an Intelligent Transportation System to improve rural safety. As projects are completed and evaluated, good practices will be shared with the rural road safety community., 38174=In 2008, there were 19,794 fatalities related to a vehicle leaving the roadway and crashing. In some cases, the vehicle crossed the centerline and struck another vehicle, hitting it head-on or sideswiping it. In other cases, the vehicle left the roadway and struck one or more man-made or natural objects, such as utility poles, embankments, guardrails, trees, or parked vehicles., 57444=Exhibit 5-11 shows the number of fatalities attributable to alcohol between 2000 and 2008. Trends remained somewhat consistent in the number of alcohol-related fatalities during the period between 2000 and 2007; the number of alcohol-related fatalities declined by 10.9 percent from 2007 to 2008., 33622=The 2008 NHTSA Traffic Safety Facts: Rural/Urban Comparison publication indicates: “In 2008, 24,175 drivers were killed in fatal crashes. Of those, 64 percent of rural and 51 percent of urban drivers died at the scene. Data also shows that 39 percent of all drivers killed were transported to the hospital and 6 percent of these drivers died en route. Unfortunately, rural drivers represented 52 percent of drivers who died en route to the hospital versus 48 percent of urban drivers.”, 62867=Exhibit 5-12 shows the breakdown of occupant fatalities by vehicle type from 2000 to 2008. The number of occupant fatalities that involved passenger cars decreased from 20,699 in 2000 to 14,587 in 2008 (a decrease of 30 percent)., 32685=Established in June 2008, this web-based clearinghouse at http://www.ruralhighwaysafety.org links to a growing collection of rural road safety documents and resources. Another rural safety website is the Center for Excellence in Rural Safety at http://www.ruralsafety.umn.edu. The University of Minnesota developed the site through sponsorship by the FHWA and funding by SAFETEA-LU Section 5309., 88324=Exhibit 5-18 shows fatality rates per 100 million PMT for motor bus and demand response (excluding suicides and homicides). The data indicate demand response experienced a significant decrease in fatality rates in 2008 while motor bus experienced a less dramatic decrease. Absolute fatalities are not comparable across modes because of the wide range of passenger miles traveled on each mode and are therefore not provided. Exhibit 5-19 shows fatality rates per 100 million PMT for commuter rail, heavy rail, and light rail (excluding suicides and homicides). While no trends are apparent in this data, it appears to indicate that heavy rail is the statistically safest mode of travel., 62010=Nearly one-half of all fatal crashes in 2008 occurred on roads with posted speed limits of 55 miles per hour or more, as compared with 23 percent of injury crashes and 23 percent of property-damage-only crashes. Although much of the public concern about speed-related crashes focuses on high-speed roadways, speeding is a safety concern on all roads. In 2008, about 22 percent (10,812) of drivers involved in fatal crashes were cited for driving too fast for conditions or in excess of posted speed limits—the second-highest driver factor cited for all fatal crashes., 76309=Transit operators report safety information to the National Transit Database for three major categories: incidents, injuries, and fatalities. In 2002, the Federal Transit Administration revised the definitions of an “incident” and an “injury.” Given that there is no “statistical bridge” across the change in definitions, this chapter provides only injury and incident data from 2002 onward. Data on injuries and incidents prior to 2002, which are not comparable with the new data, are available in the 2004 C&P Report., 54729=Exhibit 5-10 displays nonmotorist traffic fatalities that occurred between 2000 and 2008. For the purposes of this report, the term “nonmotorist” refers to pedestrians, pedalcyclists (such as bicyclists), and other nonmotorists (such as skateboarders and roller skaters)., 82846=Exhibit 5-16 provides total incidents and injuries both in absolute terms and per 100 million PMT. A trend toward fewer incidents is apparent over the most recent 3 years, but there is no comparable downward trend in injuries. It is notable that the injury rate was low in 2007, even though the fatality rate was high that year. Exhibit 5-17 lists injuries and fatalities for the most significant light and heavy rail transit accidents for 2008, 2009, and 2010. As this exhibit indicates, the total injuries and fatalities in this time period are due to numerous accidents and no one accident accounts for the majority of the total; therefore, increases in annual injury and fatality rates are not merely the result of one or two bad incidents. However, multi-injury incidents (like the above-mentioned Chatsworth collision) must account for the absolute number of injuries being greater than the number of incidents in 2008., 42474=As shown in Exhibit 5-8, the total number of fatalities in rollover crashes has decreased, from 9,962 in 2000 to 9,007 in 2008 (a decrease of about 10 percent), with the number of fatalities varying by vehicle type. While the number of fatalities in rollovers among cars decreased, from 4,549 in 2000 to 3,640 in 2008 (a 20 percent decrease), the number of fatalities in rollovers among light (sport) utility trucks grew from 2,064 in 2000 to 2,414 in 2008 (an increase of 17 percent) at the same time the fatality rate from rollovers in light utility trucks decreased from 9.61 to 5.96 while the number of these vehicles almost doubled. The number of fatalities in rollovers among pickup trucks for the same period decreased by more than 5 percent (from 2,558 in 2000 to 2,424 in 2008). Among vans, fatalities related to rollover crashes decreased by 33 percent (from 770 in 2000 to 515 in 2008)., 79314=An incident is recorded by a transit agency for a variety of events occurring on transit property or vehicles, involving transit vehicles, or to persons using the transit system. Included among these is any event that results in significant property damage, one or more reported injuries, one or more reported fatalities, or some combination thereof. Since 2002, the definition of “significant property damage” has been total property damage in excess of $7,500 (in current-year dollars, not indexed to inflation)., 47445=Of the 37,261 fatalities that occurred in 2008, about 21 percent—7,772—occurred at intersections, of which at least 39.2 percent were at rural intersections and at least 60.8 percent urban, as shown in Exhibit 5-9., 35053=The total economic cost of crashes was estimated at $230.6 billion in 2000. Motor vehicle crashes cost society an estimated $7,300 per second. When a crash occurs, it is generally the result of numerous contributing factors. Driver, roadway, and vehicle factors all have an impact on the safety of the Nation's highway system. The FHWA is focused on reducing four types of roadway-related crashes: roadway departures and intersection incidents, pedestrian, and speeding-related crashes. Exhibit 5-7 shows data for these crash types between 2000 and 2008. These categories are not mutually exclusive; the fatalities shown in Exhibit 5-7 can involve a combination of factors—intersection- and pedestrian-related, for example—so that some fatalities appear in more than one category., 61063=As shown by cases for which blood alcohol data are available, alcohol involvement is prevalent for drivers involved in speeding-related crashes. In 2008, 41 percent of drivers with a BAC of 0.08 g/dL or higher involved in fatal crashes were speeding, compared with only 15 percent of drivers with a BAC of 0.00 g/dL involved in fatal crashes. In 2008, 27 percent of the speeding drivers under age 21 who were involved in fatal crashes also had a BAC of 0.08 g/dL or higher. In contrast, only 12 percent of the nonspeeding drivers under age 21 involved in fatal crashes in 2008 had a BAC of 0.08 g/dL or higher.}",
    "textBeforeTable": "Exhibit 5-21 shows the number of fatalities per 100 incidents for each of the five largest transit modes from 2004 to 2008. This metric does not represent the percentage of incidents that are fatal, as some incidents result in multiple fatalities. The metric does, however, show the likelihood that a fatality will result from an incident. Although commuter rail has a very low number of incidents per PMT (as indicated in Exhibit 5-20), commuter rail incidents are far more likely to result in a fatality than incidents occurring on any other mode. Most likely, this is because the average speed of commuter rail vehicles is considerably higher than the other modes (except vanpools). Motor buses, on the other hand, have a high number of incidents per PMT, but a lower chance of having an incident result in a fatality than almost any other mode (perhaps related to their low average speed). While light rail and motor bus modes of transit have similar numbers of incidents per PMT, an incident on light rail is approximately 2.3 times more likely to produce a fatality than an incident on a motor bus, based on 2008 data. It is possible that this is a result of the higher mass and longer stopping distance of light rail vehicles relative to motorbuses. It could also be that light rail vehicles attract more suicide attempts, some of which may not be recognizable as such and are not excluded from the",
    "textAfterTable": "Source: National Transit Database—Transit Safety and Security Statistics and Analysis Reporting. Suicides and homicides represented about a quarter of transit fatalities in 2008, perhaps a bit more since it is possible not all suicide attempts are recognized as such. Data on these fatalities since 2000 are shown in Exhibit 5-22, which indicates a modest upward trend.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}