{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "4",
            "4",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10"
        ],
        [
            "",
            ".18",
            ".19",
            ".1",
            ".2",
            ".3",
            ".4",
            ".5",
            ".6",
            ".7",
            ".8",
            ".9",
            ".10",
            ".11",
            ".12",
            ".13",
            ".14",
            ".15",
            ".16"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Support Agreement dated July 31, 2004, among Waste Services, Inc. and Michael DeGroote (Incorporated by reference to Exhibit 10 to Form 8-K (No. 000-25955) filed March 16,2004).",
            "Standby Purchase Agreement dated as of September 30, 2004 between Waste Services, Inc. and Michael DeGroote (Incorporated by reference to Exhibit 10.2 to Form 8-K (No. 000-25955) filed on October 5, 2004).",
            "Capital Environmental Resource Inc. 1999 Stock Option Plan (Incorporated by reference to Exhibit 4 to Schedule 13D (No. 005-57445) dated February 5, 2002 and filed by certain holders of the Company\u0092s Common Shares with the Commission on February 15,2002).",
            "Amended and Restated Stock Purchase Agreement dated as of March 11, 2004, by and among Waste Services, Inc., certain affiliates of Waste Services, Inc., Capital Environmental Resource Inc., Florida Recycling Services, Inc. and certain affiliates thereof (Incorporated by reference to Exhibit 10.5 to Form 8-K (No. 000-25955) filed May 10, 2004).",
            "First Amendment to Amended and Restated Stock Purchase Agreement and Settlement Agreement dated September 24, 2004 (Incorporated by Reference to Exhibit 10.2 to Form 8-K (No. 000-25955) filed September 24, 2004).",
            "Form of Subscription Agreement dated as of April 30, 2004,between Capital Environmental Resource Inc. and certain investors. (Incorporated by reference to Exhibit 10.1 to Form 8-K (No. 000-25955) filed May 10, 2004).",
            "Form of Registration Rights Agreement dated as of April 30,2004, among us and certain investors. (Incorporated by Reference to Exhibit 10.2 to Form 8-K (No. 000-25955) filed May 10, 2004)",
            "91/2% Senior Subordinated Notes Registration Rights Agreement dated April 20, 2004. (Incorporated by reference to Exhibit 10.3 to Form 8-K (No. 000-25955) filed May 10,2004).",
            "Second Amended and Restated Credit Agreement dated as of December 28,2006 among Waste Services, Inc., Waste Services (CA) Inc., the several lenders from time to time parties thereto, Lehman Brothers Inc., as Arranger, CIBC World Markets Corp., as Syndication Agent, Bank of America, N.A., as Documentation Agent, Canadian Imperial Bank of Commerce, as Canadian Agent, and Lehman Commercial Paper Inc., as Administrative Agent. (Incorporated by reference to Exhibit 20.1 to Form 8-K (No. 000-25955) filed January 3, 2007).",
            "Employment Agreement dated as of October 26, 2005 between Waste Services, Inc. and David Sutherland-Yoest (Incorporated by reference to Exhibit 10.1 to Form 10-Q (No. 000-25955) filed October 31, 2005).",
            "Employment Agreement dated as of July 1, 2004 between Waste Services, Inc. and Charles A. Wilcox (Incorporated by reference to Exhibit 10.13 to Form 10-K (No. 000-25955) filed March 16, 2004).",
            "Employment Agreement dated January 5, 2004, between Capital Environmental Resource Inc., Waste Services, Inc. and Ivan R. Cairns. (Incorporated by reference to Exhibit 10.1 to Form 10-Q (No. 000-25955), filed May 17, 2004).",
            "Employment Agreement dated as of February 23, 2004 between Capital Environmental Resource Inc., Waste Services, Inc. and Mark A. Pytosh (Incorporated by reference to Exhibit 10.2 to Form 10-Q (No. 000-25955) filed on May 17, 2004).",
            "Employment Agreement dated October 1, 2003, between Capital Environmental Resource Inc. and Brian A. Goebel (Incorporated by reference to Exhibit 4.27 to Form 20-F for the year ended December 31, 2003 (No. 000-25955), filed March 31, 2004).",
            "Subscription Agreement dated as of November 8, 2006 by and among Waste Services, Inc. , Westbury (Bermuda) Limited and Prides Capital Fund, LP. (Incorporated by reference to Exhibit 20.1 to Form 8-K (No. 000-25955) filed on November 9, 2006).",
            "Exchange and Redemption Agreement dated as of November 8, 2006 by and among Waste Services, Inc. and Kelso Investment Associates VI, L.P. and KEP VI, LLC. (Incorporated by reference to Exhibit No. 20.2 to Form 8-K (No. 000-25955) filed on November 9, 2006).",
            "Form of Registration Rights Agreement dated as of November 8, 2006 by and among Waste Services, Inc., Westbury (Bermuda) Limited and Prides Capital Fund, LP. (Incorporated by reference to Exhibit No. 20.3 to Form 8-K (No. 000-25955) filed on November 9, 2006).",
            "Form of Registration Rights Agreement dated as of November 8, 2006 by and among Waste Services, Inc. and Kelso Investment Associates VI, L.P. and KEP VI, LLC. (Incorporated by reference to Exhibit No. 20.3 to Form 8-K (No. 000-25955) filed on November 9, 2006)."
        ]
    ],
    "pageTitle": "Waste Services, Inc.",
    "title": "",
    "url": "http://www.wikinvest.com/stock/Waste_Services_(WSII)/Filing/10-K/2007/F3429419",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 71,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00296-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 832423091,
    "recordOffset": 832295561,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "  (Exact name of registrant as defined in its charter) (Successor registrant of Capital Environmental Resource Inc. now known as Waste Services (CA) Inc.) Waste Services, Inc.   Commission file number 000-25955   For the transition period from          to               TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934   o or",
    "textAfterTable": "Indicate by check mark whether the registrant is a shell company (as defined in Rule 12b-2 of the Exchange Act).  Yes  o     No  þ   The approximate aggregate market value of the voting stock held by non-affiliates of the Registrant as of June 30, 2006 was $209.1 million based upon the closing price of the Registrant\u0092s Common Shares as quoted on the Nasdaq National Market as of that date.   The number of Common Shares of the Registrant outstanding as of February 27, 2007 was 45,972,082 (assuming exchange of 6,307,862 exchangeable shares of Waste Services (CA) Inc. not owned by Capital Environmental Holdings Company for 2,102,620 of the registrant\u0092s common stock.)    ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}