{
    "relation": [
        [
            "Name",
            "William Campbell",
            "Justin Turner",
            "Bryce McNeal",
            "Kevin Newsome",
            "Jeremy Gallon",
            "DeQuinta Jones",
            "Shavodrick Beaver",
            "Fitz Toussaint",
            "Michael Schofield",
            "Teric Jones",
            "Isaiah Bell"
        ],
        [
            "Pos",
            "DT",
            "DB",
            "WR",
            "QB",
            "ATH",
            "DT",
            "QB",
            "RB",
            "OL",
            "RB",
            "LB"
        ],
        [
            "State",
            "MI",
            "OH",
            "MN",
            "VA",
            "FL",
            "LA",
            "TX",
            "OH",
            "IL",
            "MI",
            "OH"
        ],
        [
            "Stars",
            "5 stars",
            "4 stars",
            "4 stars",
            "4 stars",
            "4 stars",
            "4 stars",
            "4 stars",
            "4 stars",
            "4 stars",
            "3 stars",
            "3 stars"
        ],
        [
            "RR",
            "6.1",
            "6.0",
            "6.0",
            "5.9",
            "5.9",
            "5.8",
            "5.8",
            "5.8",
            "5.8",
            "5.7",
            "5.7"
        ],
        [
            "Commit'd",
            "Oct. 2007",
            "Mar 28",
            "May 1",
            "Apr 24",
            "Jun 05",
            "Jul 21",
            "Apr 29",
            "Apr 18",
            "Jun 16",
            "Mar 29",
            "Mar 31"
        ],
        [
            "Pos",
            "5",
            "3",
            "10",
            "4",
            "11",
            "NR",
            "8",
            "8",
            "18",
            "37",
            "26"
        ],
        [
            "Nat",
            "26",
            "35",
            "75",
            "163",
            "NR",
            "NR",
            "206",
            "NR",
            "NR",
            "NR",
            "NR"
        ],
        [
            "State",
            "1",
            "1",
            "1",
            "9",
            "31",
            "10",
            "24",
            "14",
            "6",
            "12",
            "27"
        ],
        [
            "Rec'd By:",
            "(Carr's staff)",
            "Bruce Tall",
            "Tony Dews",
            "Fred Jackson",
            "Rod Smith",
            "Jay Hopson",
            "Rod Smith",
            "Tony Gibson",
            "Scott Shafer",
            "Tony Dews",
            "Tony Gibson"
        ]
    ],
    "pageTitle": "200 Days: Rich Rod vs. Hoke | mgoblog",
    "title": "",
    "url": "http://mgoblog.com/content/200-days-rich-rod-vs-hoke?quicktabs_1=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00309-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 166884323,
    "recordOffset": 166839043,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=This morning His Dudeness posted a throwaway discussion topic for the board comparing Rodriguez's 2009 recruiting to Hoke's 2012. This was taken by some as an attempt to reopen 2008-'10 wounds but really it's another \"how many ways can we talk about how awesome our 2012 recruiting is going?\" (So so awesome). Anyway this started as a reply to fisk of that thread and ended up at 2,000 words plus charts. Hi, I'm Misopogon, have we met?}",
    "TableContextTimeStampAfterTable": "{134093= Dudeness makes me want to push the minimum point total to 12000 to create a thread. Clearly the higher point totals on this blog don't always lend way to higher levels of credibility. Isn't there an I *heart* RR site where people with like mindset could post fading memories of a Big East Championship?, 240021=Hoke won't go 3-9, so this class will probably pan out a bit better than 2008., 192053=I'd like to recalculate a bit so we can have that score down to three decimal points. Question: did you include 247's natonal rankings in your calculations? And where oh where did you get good data on the teams' fiber intake from year to year under each coach: Fremeau Nutritional Watch unfortunately only goes back to 2009., 117652=…and it's Hoke like whoa. A bad year in 2011 and maybe his class starts falling apart as well, but it is important to note that nobody on that list above is considered soft except the grayshirted Jeremy Clark** if he gets something better than high-ish MAC offers, whereas that label applied to half of RR's first full class by July., 98018=Rodriguez 2009 recruits as of July 26, 2008:, 115626=You'll note a lot of the 2008 haul never made it to campus. The 3-9 year was partly to blame of course, however as of late July 2008 many of RR's guys were soft. Will Campbell (right) committed to Carr in the middle of his junior (2007) year and remained a softie; he eventually de-committed in September only to re-up after a long and pulmonarily destructive flirtation with SEC schools. Bryce committed but looking around; he lost interest in October, presumably after many sleepless nights spent thinking of Nick Sheridan passing to him. Newsome was entertaining a camp visit at Virginia Tech this time three years ago, but turned it down and sounded like he was rock. He and Beaver gave up around the same time (right after you mentally gave up on the 2008 offense) and were immediately replaced by Tate and the hard pursuit of some supersonic kid in Florida who Urban wanted badly and nobody thought was a QB., 279541=I hear you, but you may not (or may?) have the history behind the man that is Dudeness.  I see that you're a fairly new member.  Dudeness has been posting for a much longer time than you (e.g. he's before your time) and has always been a very competent poster.  The \"CC\" discussions from late 2010 were enough to drive anyone crazy and it appears as though it did for Dudeness.  But you don't have that history and thus are not able to sympathize.  I however, lived and breathed it (was in the trenches with him)., 195095=I appreciate the article.  I wasn't reading this blog in 2008 so my recruiting knowledge was non-existant.  Thank you!, 95753=This is unfair to judge the coaches against each other. Rodriguez was hired in November and was taking over a Citrus-bound program with a retiring Hall of Fame coach, while Hoke was hired in the middle of January after a blowout Gator loss and following a fired guy. Rodriguez had less time than would have been optimal given the breadth of his transition, but it was no more of a transition than Hoke faces, and RR got a good two months, including the all-important December period, to bring the current class home., 117098=If you take away the guys who de-committed from RR's 2009 class it looks more like this…, 119257=Brian penned a State of Recruiting article in early August '08 that's worth a look-back so you can remember your comparable state of mind. How does that compare to now? And I didn't even make you compare \"Denard: The Upperclassman Years\" to \"gee I hope this Sheridan guy really is a Basanez.\", 103468=Hoke 2012 recruits as of July 26, 2011:, 118574=Not hugely dissimilar except that Hoke's got a lot more 3-stars and is missing four blue chips. In a worst case scenario the 2011 team starts losing a la 2008, while Ohio State's dancing along having gotten off virtually scot-free from the most obvious case of Failure to Monitor and Lack of Institutional Control I've ever witnessed in 20 years of college football fandom, and Hoke's Goodwill Ride of 2011 comes to a crashing, sudden stop, and then entire position groups are destroyed, and the 2012 guys start decomitting and the university hires Freakbass to rebrand us. If all those things don't happen, well, this probably turns out better than the last time., 118004=Stick their late additions to the hybrid class with their first-year recruiting by July and you get:}",
    "lastModified": "Thu, 30 Jul 2015 10:21:19 GMT",
    "textBeforeTable": "Rodriguez 2009 recruits as of July 26, 2008: Recruiting the Class of… Both did okay, not fantastic. Hoke got a kicker back, which was a big deal, but needed to flip someone's 5.9+ OT and pick up another good-to-great linebacker to avoid scary depths at that positions starting in 2012; RR's failure to get more help at defensive back (Carr had Brandon Smith, J.T. Floyd, and Cissoko) would haunt him the rest of his Michigan career (nobody planned on losing 2/4 LBs by next summer). Oh, and, ahem, quarterback. The recruiting is reflected in that. Other than bringing Hill from W.Va., Rodriguez mostly grabbed guys to fit his offensive system. Shaw's a speed-back, T-Rob, Roundtree and Odoms were slot receivers, Barnum and Omameh were the kind of agile offensive linemen who fit best in zone blocking, and Feagin was a last-minute consolation prize when Pryor decided he'd get more out of attending Ohio State. Hoke on the other hand found a handful of Michigan and Ohio State Sad Joshes (Clark, Carter, Heitzman, Rawls, Poole, Bellomy and Taylor), at positions of great need, replaced the kicker lost in the transition, yanked the requisite Purdue recruit (Bellomy) to ensure Danny Hope stays petty, and pulled in a last-minute coup on a national tight end. This is unfair to judge the coaches against each other. Rodriguez",
    "textAfterTable": "Hoke 2012 recruits as of July 26, 2011: Name Pos State Stars RR Commit'd Pos Nat State Rec'd By Kyle Kalis OL OH 4 stars 6.0 Jul 10 4 18 1 Greg Mattison Royce Jenkins-Stone LB MI 4 stars 5.9 Apr 16 7 87 1 Fred Jackson Erik Magnuson OL CA 4 stars 5.9 Jun 10 8 34 6 Dan Ferrigno Blake Bars OL TN 4 stars 5.8 Jun 26 34 NR 6 Mark Smith Joe Bolden LB OH 4 stars 5.8 Apr 29 16 NR 11 Greg Mattison Pharaoh Brown DE OH 4 stars 5.8 May 07 20 NR 17 Greg Mattison Terry Richardson DB MI 4 stars 5.8 May 19 18 NR 4 Greg Mattison James Ross LB MI 4",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}