{
    "relation": [
        [
            "",
            "2010-11",
            "2011-12",
            "2012-13",
            "2013-14",
            "Total"
        ],
        [
            "gp",
            "30",
            "31",
            "30",
            "32",
            "123"
        ],
        [
            "gs",
            "1",
            "16",
            "29",
            "31",
            "77"
        ],
        [
            "min",
            "755",
            "801",
            "1062",
            "1080",
            "3698"
        ],
        [
            "off",
            "22",
            "19",
            "20",
            "25",
            "86"
        ],
        [
            "def",
            "61",
            "63",
            "89",
            "71",
            "284"
        ],
        [
            "reb",
            "83",
            "82",
            "109",
            "96",
            "370"
        ],
        [
            "pf",
            "43",
            "33",
            "80",
            "65",
            "221"
        ],
        [
            "dq",
            "1",
            "0",
            "3",
            "0",
            "4"
        ],
        [
            "ast",
            "21",
            "27",
            "23",
            "24",
            "95"
        ],
        [
            "to",
            "34",
            "29",
            "21",
            "22",
            "106"
        ],
        [
            "a/to",
            "0.6",
            "0.9",
            "1.1",
            "1.1",
            "0.9"
        ],
        [
            "stl",
            "18",
            "19",
            "31",
            "29",
            "97"
        ],
        [
            "blk",
            "4",
            "4",
            "1",
            "3",
            "12"
        ]
    ],
    "pageTitle": "Laurent Rivard - Harvard",
    "title": "",
    "url": "http://www.gocrimson.com/sports/mbkb/2013-14/bios/rivard_laurent_mze5?view=career&pos=bc",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00043-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 468911011,
    "recordOffset": 468886397,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{65140=Team Canada: Named to Canada Basketball Senior Men’s National Team training camp in Aug. 2012. , 65296=Sophomore (2011-12): Played in all 31 games, starting 16 during sophomore season ... Was third on team with 10.1 points per game overall and 8.6 points per contest in Ivy games ... Shot 41.0 percent from beyond the arc (66-of-161) ... Made at least one trey in 26 of 31 games ... Reached double figures in scoring in 12 games ... Buried 4-of-6 treys and was 6-of-10 from the field for 16 points against MIT (Nov. 11) ... Led Harvard with 20 points, hitting 5-of-8 treys and 7-of-12 shots overall, at Loyola Marymount (Nov. 19) ... Made two treys, went 4-of-4 from the line and finished with 12 points at Vermont (Dec. 1) ... Scored 14 points, making six free throws against Seattle (Dec. 4) ... Drained two treys at No. 9 Connecticut (Dec. 8) ... Made a career-high six treys, scoring 18 points and grabbing four rebounds at Boston University (Dec. 10) ... Tallied 18 points, making four treys, at Boston College (Dec. 29) ... Netted 16 points, going 4-of-10 from long distance and played a season-high 36 minutes, getting the start at Monmouth (Jan. 10) ... Made three treys and was 5-of-5 from the foul line, finishing with 16 points against George Washington (Jan. 14) ... Went 6-of-6 from the free throw line and was 5-of-8 from the floor for a team-high 18 points at Yale (Jan. 27) ... Made 5-of-9 shots, including 3-of-7 from long distance for 16 points and added a career-high three steals against Cornell (Feb. 3) ... Sank five baskets and hit eight free throws for 20-point effort against Columbia (Feb. 4) ... Netted eight points, making two treys, against Penn (Feb. 25) ... Went 6-of-7 from beyond the arc, including 5-of-6 in the second half, scoring 20 points against Vanderbilt in second round of NCAA tournament (March 15)., 59606=Career Highlights: Two-time All-Ivy League (2013-14 second team, 2012-13 honorable mention) ... 2014 NABC Honors Court ... Has earned three Ivy League weekly awards (3 ROW) ... Ranks 11th in Harvard history with 1,270 career points ... Ranks first in Harvard history, second in Ivy League history, with 287 three-pointers., 67098=Freshman (2010-11): Averaged 88.3 percent from the foul line during rookie season ... Was third among Ivy League rookies in scoring (11.0 points per game) ... Played in all 29 games ... Made at least three 3-pointers in nine games  ... Drained at least one three-pointer for 15 straight games (Nov. 17-Jan. 8) ... Scored in double figures in 16 games ... Averaged 9.9 ppg in Ivy contests ... Named preseason Ivy League Newcomer of the Year by Lindy’s  ... Buried three from long distance and finished with 12 points in victory at Mercer (Nov. 20) ... Scored seven points and picked up three rebounds in win over Colorado (Nov. 28) ... Netted 21 points, making 5-of-8 from long distance, while coming down with three rebounds against Fordham (Dec. 1) ... Buried five treys for second straight game and came down with five rebounds at Michigan (Dec. 4) ... Tabbed Ivy League Rookie of the Week Dec. 6 ... Scored 15 points, making five shots from the floor and was 4-for-4 from the line in win over Boston University (Dec. 11) ... Made two treys, scored 12 points and blocked a shot at No. 4 Connecticut (Dec. 22) ... Hit several key baskets down the stretch and finished with 18 points, shooting 5-of-7 from the field and 6-of-6 from the line, against Monmouth (Dec. 29) ... Tallied 17 points, hitting five baskets, and dished out a career-best four assists against MIT (Dec. 31) ... Earned second Ivy Rookie of the Week honor Jan. 3 ... Scored a career-high 23 points, on seven field goals and three treys, in win at Boston College (Jan. 5) ... Scored all 16 of his points in the second half, shooting 3-of-4 from long distance, in win at George Washington (Jan. 15) ... Tabbed Ivy League Rookie of the Week for third time Jan. 17 ... Led Harvard with 13 points, drilling three treys, in victory over Dartmouth (Jan. 22) ... Buried 3-of-5 from beyond the arc to finish with 12 points against Cornell (Jan. 29) ... Drilled three treys and came down with four rebounds at Princeton (Feb. 4) ... Hit two 3-pointers in double-overtime victory at Penn (Feb. 5) ... Tallied 14 points in only 22 minutes against Yale (Feb. 11) ... Grabbed a career-high six rebounds and scored 12 points at Brown (Feb. 25) ... Shot 5-of-8 from long distance en route to a 21-point effort against Penn (March 4) ... Hit two treys and was 4-of-10 from the floor, finishing with 10 points, at Oklahoma State in NIT (March 15). Background: Lettered in basketball and track and field at Northfield Mount Hermon … Previously attended Seminaire Ste-Trinite … Captain basketball team and was named team most valuable player in 2009-10 … All-New England Prep School Athletic Conference Class first team as a shooting guard … Was high school teammate of fellow Crimson freshman Matt Brown … Was named Montreal Basketball League most valuable player and played in conference All-Star Game in 2008 … Three-time Quebec champion in mountain biking … Under-19 junior national team member, finishing seventh at World Championships in New Zealand in 2009 … Under-17 Quebec  team member, placing first at nationals in 2008 and second in 2007 … Inducted into Cum Laude Society., 198440=© Copyright 2014 Harvard University All Rights Reserved, 59972=Senior (2013-14): Team captain ... Named to the All-Ivy League second team ... Named to the NABC Honors Court ... Recipient of the Henry Zimmerman Free Throw Shooting Accuracy Award ... His 80 three-pointers tied his own school record for most three’s in a season ... Shot 4-of-7 from the field, including 3-of-6 from three, for 11 points against Holy Cross (Nov. 10) ... Matched his career-high with three steals against MIT (Nov. 12) ... Contributed 10 points and three rebounds at Colorado (Nov. 24) ... Hit five three-pointers and scored 17 points to set the Harvard record for career three’s and go over 1,000 points for his career against Green Bay (Nov. 29) ... Netted 15 points on 5-of-11 shooting from three against TCU (Nov. 30) ... Scored 10 points at Northeastern (Dec. 4) ... Added eight points at Boston University (Dec. 7) ... Contributed seven points and three assists versus Vermont (Dec. 21) ... Totaled 10 points and two assists at Fordham (Dec. 28) ... Recorded nine points and six boards at Rice (Jan. 4) ... Turned in 13 points, four assists and four steals at UConn (Jan. 8) ... Scored nine points and was 2-of-2 from beyond-the-arc at Florida Atlantic (Jan. 21) ... Chipped in 15 points on 4-of-5 shooting, 3-of-4 from three, and grabbed four rebounds at Dartmouth (Jan. 26) ... Went 5-of-8 from beyond-the-arc and 3-of-4 at the line for 18 points against Princeton (Jan. 31) and added five rebounds and three steals ... Scored 22 points on 6-of-9 shooting from deep with five rebounds and two steals versus Penn (Feb. 1) ... Turned in nine points with three makes from beyond-the-arc against Brown (Feb. 7) ... Recorded nine points against Yale (Feb. 8) ... Burried three three-pointers for 10 points and grabbed five rebounds at Columbia (Feb. 14) ... Registered 12 points on 4-of-6 shooting from three, grabbed four rebounds and dished out two assists at Cornell (Feb. 15) ... Scored 13 points on 5-of-8 shooting, 3-of-5 from three, and dished out two assists at Penn (Feb. 21) ... Grabbed four rebounds at Princeton (Feb. 22) ... Shot 2-of-4 from three and added two assists and two steals versus Cornell (Feb. 28) ... Totaled 21 points on 6-of-8 shooting from beyond-the-arc, 3-of-3 from the line, against Columbia (March 1) ... Scored six points and grabbed five rebounds at Yale (March 7) ... Shot 4-of-8 from three for 18 points at Brown (March 8) ... Went for 11 points on 3-of-5 shooting from three and grabbed five rebounds vs. Cincinnati (March 20) ... Notched seven points on 2-of-5 shooting from deep against Michigan State (March 22)., 62829=Junior (2012-13): Team co-captain ... Tabbed All-Ivy League honorable mention ... Named to Rivals.com’s Preseason All-Ivy League team ... Tabbed Best Shooter in the Ivy League by Rivals.com ... Named recipient of Henry Zimmerman Free Throw Shooting Accuracy Award ... Ranks second in program history with 207 career 3-pointers ... Stands third in Harvard record books in career 3-point shooting (.403, 207 of 514) ... Made 80 3-pointers this season, to set the record for a single year ... Ranks third on the Crimson with 10.3 points per game ... Averaged 9.6 points per contest in Ivy play ... Averaging 35.4 minutes per game, good for fifth in the conference ... Played in all 30 games, starting 29 ... Has reached double figures in scoring 15 times ... Has drained two or more 3-pointers in 23 games ... Made at least one 3-pointer in 26 straight games, the second longest streak in team history, between Feb. 24, 2012-Feb. 16, 2013 ... Scored 10 points in opener against MIT (Nov. 9) ... Sank five 3-pointers and led the team with 17 points against Manhattan (Nov. 16) ... Buried four treys and was 3-of-3 from the line, finishing with 15 points at Saint Joseph's (Nov. 20) ... Hit four 3-pointers, scoring 17 points against Vermont (Nov. 27) ... Made two treys and had 10 points and five rebounds against Holy Cross (Dec. 22) ... Poured in a season-high 19 points, hitting five 3-pointers, in victory at California (Dec. 29) ... Tabbed COOP Athlete of the Week Jan. 1 ... Had a season-high 21 points, making 5-of-7 3-pointers against Rice (Jan. 5) ... Drilled four 3-pointers and had 12 points in Ivy opener at Dartmouth (Jan. 12) ... Went 5-of-7 from beyond the arc for 15 points vs. Yale (Feb. 1) ... Played a career-high 49 minutes, scoring 16 points in double-overtime win over Brown (Feb. 2) ... Connected on four triples in win over Princeton (Feb. 16) ... Sank three treys and tallied 13 points at Yale (Feb. 23) ... Drained four 3-pointers and had 14 points at Penn (March 2) ... In Ivy clinching win, drained four treys and scored 17 points in 40 minutes against Cornell (March 9) ... Connected on five 3-pointers to break the school single-season record and scored 17 points to top No. 3 New Mexico in the second round of the NCAA tournament (March 21).}",
    "textBeforeTable": "Laurent Rivard 0 0 Related Bios Charlie Anastasi Matt Brown Kyle Casey Siyani Chambers Evan Cummins Brandyn Curry Zena Edosomwan Matt Fraschilla Dee Giger Michael Hall Tom Hamel Steve Moundou-Missi Hunter Myers Alex Nesbitt Agunwa Okolie Wesley Saunders Kenyatta Smith Patrick Steeves Jonah Travis }); }); $(this).toggleClass('active').next('ul').toggleClass('active'); $('.secondary-nav > h1').click(function() { $(function() { })(jQuery); }); }); $('.has-submenu.active').removeClass('active'); $(document).on('click', function(e) { }); return false; $(this).parent().toggleClass('active'); $('.has-submenu > a', '#global-nav').on('click', function() { }); return false; $('#global-nav').removeClass('active'); $('#jump-to-global-nav').removeClass('active'); $('#global-nav .close').click(function(e) { }); $('#global-nav').toggleClass('active'); $(this).toggleClass('active'); e.preventDefault(); $('#jump-to-global-nav').click(function(e) { $(function() { (function($) {",
    "textAfterTable": "vs. Cincinnati W, 61-57 Mar 22 vs. Michigan State L, 80-73 Statistics category Overall Conf Games 32 14 Games started 31 14 Minutes 1080 464 Minutes per game 33.8 33.1 FG 93-210 48-101 FG Pct 44.3 47.5 3PT 80-186 43-89 3PT Pct 43.0 48.3 FT 51-63 20-24 FT Pct 81.0 83.3 Off rebounds 25 14 Def rebounds 71 29 Total rebounds 96",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}