{
    "relation": [
        [
            "",
            "January",
            "February",
            "March",
            "April",
            "May",
            "June",
            "July",
            "August",
            "September",
            "October",
            "November",
            "December",
            "3 Mo. Total",
            "Yr. Total"
        ],
        [
            "2012",
            "54.4",
            "53.1",
            "64.5",
            "61.5",
            "63.7",
            "66.6",
            "69.2",
            "67.8",
            "57.4",
            "60.9",
            "58.7",
            "58.9",
            "172.0",
            "736.7"
        ],
        [
            "2013",
            "55.3",
            "52.5",
            "65.1",
            "61.0",
            "64.8",
            "67.1",
            "69.2",
            "67.7",
            "58.2",
            "62.1",
            "57.6",
            "62.5",
            "172.9",
            "743.1"
        ],
        [
            "2012-2013 Pct. Change",
            "1.7",
            "-1.2",
            "1.0",
            "-0.8",
            "1.7",
            "0.7",
            "0.0",
            "0.0",
            "1.3",
            "2.0",
            "-2.0",
            "6.1",
            "0.5",
            "0.9"
        ],
        [
            "2014",
            "55.8",
            "52.4",
            "66.4",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "174.6",
            ""
        ],
        [
            "2013-2014 Pct. Change",
            "0.8",
            "-0.1",
            "2.0",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "1.0",
            ""
        ]
    ],
    "pageTitle": "March 2014 U.S. Airline Traffic Data :: Travel Industry Wire",
    "title": "",
    "url": "http://www.travelindustrywire.com/article78374March______U_S__Airline_Traffic_Data.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00002-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 783724723,
    "recordOffset": 783704747,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{41786=Table 9. Top 10 U.S. Airlines, ranked by January-March 2014 Domestic Scheduled Enplanements, 30685=Table 5. Top 10 U.S. Airports, ranked by January-March 2014 Systemwide (Domestic and International) Scheduled Enplanements on U.S. Airlines, 9624=March 2009-March 2014, 10170=U.S. airlines carried 174.6 million systemwide (domestic + international) scheduled service passengers during the first three months of 2014, 1.0 percent more than during the same period in 2013 (Table 2). Domestically, U.S. airlines carried 151.1 million passengers, up 0.7 percent from 2013 (Table 8). Internationally, they carried 23.5 million passengers, up 2.8 percent from 2013 (Table 14). See Tables 2, 8 and 14 of Air Traffic Press Releases for previous-year data., 12665=International: The number of passengers on U.S. airlines’ international flights was the highest on record for the month of March, exceeding the previous high in March 2013. RPMs were also at the highest March level, exceeding the previous high in March 2008. Capacity measured in ASMs was also at the highest March level, exceeding the previous high in March 2012., 14941=Monthly: In March, more total systemwide passengers boarded planes at Atlanta Hartsfield-Jackson International than at any other U.S. airport. More domestic passengers boarded planes at Atlanta than any other U.S. airport while more international passengers boarded U.S. carriers at Miami (Tables 6, 12, 18)., 13611=Monthly: In March, Delta Air Lines carried more systemwide passengers than any other U.S. airline (Table 4). Southwest Airlines carried the most passengers on domestic flights (Table 10). United Airlines carried the most passengers on international flights (Table 16). The top 10 U.S. airlines carried 81.1 percent of systemwide passengers, up from 80.8 percent carried by the U.S. airlines that were in the top 10 in March 2013., 28113=Table 4. Top 10 U.S. Airlines, ranked by March 2014 Systemwide (Domestic and International) Scheduled Enplanements, 11461=The international load factor (79.2) was down from March 2013 (82.5) and was the lowest March international load factor since 2011.  International capacity rose 5.1 percent from March 2013 to March 2014, outpacing the 0.9 percent growth in RPMs, reducing the load factor (Table 13). Load factor is a measure of the use of aircraft capacity that compares RPMs as a proportion of ASMs., 65603=Table 18. Top 10 U.S. Airports, ranked by March 2014 International Scheduled Enplanements on U.S. Airlines, 44370=Table 10. Top 10 U.S. Airlines, ranked by March 2014 Domestic Scheduled Enplanements, 46921=Table 11. Top 10 U.S. Airports, ranked by January-March 2014 Domestic Scheduled Enplanements, 13068=Additional traffic data can be found on the BTS Airlines and Airports page.  Click on a link in the Quick Links box on the right.  For additional U.S. carrier passenger and freight data since 1996, see Traffic on the BTS website., 25510=Table 3. Top 10 U.S. Airlines, ranked by January-March 2014 Systemwide (Domestic and International) Scheduled Enplanements, 33200=Table 6. Top 10 U.S. Airports, ranked by March 2014 Systemwide (Domestic and International) Scheduled Enplanements on U.S. Airlines, 17635=Traffic numbers are available on the BTS website at TranStats, the Intermodal Transportation Database, at http://transtats.bts.gov.  Click on “Aviation.”  For systemwide passengers, RPMs and ASMs by carrier through March, click on “Air Carrier Summary Data (Form 41 and 298C Summary Data),” and then click on “Schedule T-1.” Use crosstabs to find scheduled service., 18683=International totals in this press release consist of all U.S. carrier operations to and from the U.S. and from one foreign point to another foreign point. TranStats T-100 systemwide and international totals do not include U.S. carriers’ foreign point-to-point flights. For March, U.S. carriers reported 178,510 foreign point-to-point passengers. For January through March, U.S. carriers reported 518,560 foreign point-to-point passengers., 11925=Systemwide: For the month of March, the 2014 systemwide passenger total was the highest since 2008. RPMs were at the highest March level, exceeding the previous high in 2008.  Capacity measured in ASMs was at the second highest March level, 1.2 percent below the March 2008 all-time high., 11864=Trends for the Month of March, 10837=The March 2014 systemwide load factor (83.5 percent) was down from the all-time high load factor for the month of March of 84.3 set in 2013.  Systemwide capacity measured by available seat-miles (ASMs) grew faster from March 2013 to March 2014 (2.9 percent) than the growth in revenue passenger-miles (RPMs) (2.0 percent) (Table 1). The domestic load factor (85.5) was a record high for the month of March, topping the previous high of 85.0 recorded in 2013. Domestic RPMS grew faster from March 2013 to March 2014 (2.5 percent) than capacity (2.0 percent), resulting in the higher load factor (Table 7)., 14204=Year-to-date: During the first three months of 2014, Delta carried more systemwide passengers than any other U.S. airline (Table 3). Southwest carried the most passengers on domestic flights (Table 9). United carried the most passengers on international flights (Table 15). The top 10 U.S. airlines carried 81.1 percent of systemwide passengers, up from 80.6 percent carried by the U.S. airlines that were in the top 10 during the first three months of 2013., 18127=For domestic numbers through March and international numbers through December by origin as well as by carrier, click on “Aviation,” then click on “Air Carrier Statistics (Form 41 Traffic).”  Click on “T-100 Market” for system passenger numbers, “T-100 Domestic Market” for domestic or “T-100 International Market” for international.  For flights, stage length and trip length, use the appropriate T-100 Segment database. Use crosstabs to find scheduled service., 49391=Table 12. Top 10 U.S. Airports, ranked by March 2014 Domestic Scheduled Enplanements, 57923=Table 15. Top 10 U.S. Airlines, ranked by January-March 2014 International Scheduled Enplanements, 15711=Data are compiled from monthly reports filed with BTS by commercial U.S. air carriers detailing operations, passenger traffic and freight traffic. This release includes data received by BTS from 79 carriers as of June 3 for U.S. carrier scheduled civilian operations., 19144=Data are subject to revision. BTS has scheduled July 14 for the release of April traffic data. None of the data are from samples so measures of statistical significance do not apply., 63089=Table 17. Top 10 U.S. Airports, ranked by January-March 2014 International Scheduled Enplanements on U.S. Airlines, 8437=The U.S. Department of Transportation\u0092s Bureau of Transportation Statistics (BTS) reported today that U.S. airlines carried 66.4 million systemwide (domestic + international) scheduled service passengers in March 2014, 2.0 percent more than in March 2013. The systemwide total was the result of a 2.1 percent increase in the number of passengers on domestic flights (57.7 million) and a 1.7 percent increase in passengers on international flights (8.7 million)., 60521=Table 16. Top 10 U.S. Airlines, ranked by March 2014 International Scheduled Enplanements, 15286=Year-to-date: During the first three months of 2014, more total systemwide passengers boarded planes at Atlanta Hartsfield-Jackson International than at any other U.S. airport. More domestic passengers boarded planes at Atlanta than any other U.S. airport while more international passengers boarded U.S. carriers at Miami (Tables 5, 11, 17)., 12250=Domestic: The March 2014 domestic passenger total was the highest since 2008 but was below the levels reached in the month of March from 2005 through 2008.  RPMs were at the second highest March level, 0.2 percent below the March 2008 peak. Capacity measured in ASMs was the highest since 2008 but was below the levels reached in the month of March from 2005 through 2008. , 9037=The U.S. Department of Transportation’s Bureau of Transportation Statistics (BTS) reported today that U.S. airlines carried 66.4 million systemwide (domestic + international) scheduled service passengers in March 2014, 2.0 percent more than in March 2013. The systemwide total was the result of a 2.1 percent increase in the number of passengers on domestic flights (57.7 million) and a 1.7 percent increase in passengers on international flights (8.7 million).}",
    "textBeforeTable": "Table 1. Scheduled System (Domestic and International) Airline Travel on U.S. Airlines   Data are subject to revision. BTS has scheduled July 14 for the release of April traffic data. None of the data are from samples so measures of statistical significance do not apply. International totals in this press release consist of all U.S. carrier operations to and from the U.S. and from one foreign point to another foreign point. TranStats T-100 systemwide and international totals do not include U.S. carriers’ foreign point-to-point flights. For March, U.S. carriers reported 178,510 foreign point-to-point passengers. For January through March, U.S. carriers reported 518,560 foreign point-to-point passengers. For domestic numbers through March and international numbers through December by origin as well as by carrier, click on “Aviation,” then click on “Air Carrier Statistics (Form 41 Traffic).”  Click on “T-100 Market” for system passenger numbers, “T-100 Domestic Market” for domestic or “T-100 International Market” for international.  For flights, stage length and trip length, use the appropriate T-100 Segment database. Use crosstabs to find scheduled service. Traffic numbers are available on the BTS website at TranStats, the Intermodal Transportation Database, at http://transtats.bts.gov.  Click on “Aviation.”  For systemwide passengers, RPMs and ASMs by carrier through March, click on “Air Carrier Summary Data (Form 41 and 298C Summary Data),” and then click on “Schedule T-1.” Use crosstabs to find scheduled service. For additional scheduled service numbers for U.S. airlines, U.S. and foreign airlines, by airline and by airport, see Passengers, Flights, Revenue",
    "textAfterTable": "April 61.5 61.0 -0.8     May 63.7 64.8 1.7     June 66.6 67.1 0.7     July 69.2 69.2 0.0     August 67.8 67.7 0.0     September 57.4 58.2 1.3     October 60.9 62.1 2.0     November 58.7 57.6 -2.0     December 58.9 62.5 6.1     3 Mo. Total 172.0 172.9 0.5 174.6 1.0 Yr. Total 736.7 743.1 0.9     Source: Bureau of Transportation Statistics, T-100 Market Note: Percentage changes based on numbers prior to rounding.   Table 3. Top 10 U.S. Airlines, ranked by January-March 2014 Systemwide (Domestic and International) Scheduled Enplanements Passenger numbers in millions (000,000) Jan-Mar 2014 Rank Carrier Jan-Mar 2014 Enplaned Passengers Jan-Mar 2013 Rank Jan-Mar 2013 Enplaned Passengers Pct. Change 2013-2014 1 Delta 28.368 1 27.012 5.0 2 Southwest* 27.896 2 26.188 6.5 3 American 21.029 4 20.883 0.7 4 United 20.972 3 21.187 -1.0 5 US Airways 13.770 5 13.807 -0.3 6 JetBlue 7.323 7 7.287 0.5 7 ExpressJet 7.242 6 7.507 -3.5 8 SkyWest 6.339 8 6.470 -2.0 9 Alaska 4.729 9 4.527 4.5 10 Envoy 3.871 11 4.169 -7.1 Source: Bureau of Transportation Statistics, T-100 Market * The merged Southwest",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}