{
    "relation": [
        [
            "Questions",
            "SQL stands Structured Query Language? 1. true 2. false",
            "Choose correct answers: 1 SQL can execute system applications like java ,c# . 2 SQL can delete or update or retrieve or create records from a database 3.SQL never permanently change database recodes . 4 All 5 None",
            "Choose correct options 1. MS Access, SQL Server, MySQL are database 2. MS Access, SQL Server, MySQL are vendor company. 3 MS Access, SQL Server, MySQL are programming language 4. All 5. None.",
            "Choose correct statements for fallowing sql statement SELECT * FROM r4r_emp; 1. used to select all records from table 2. used to select all columns name from table 3. used to select all rows from tables 4. None.",
            "SELECT * FROM r4r_emp; Above is part of DML in SQL? 1. true 2. false 3. no such query into sql. 4. None."
        ],
        [
            "Show Answers",
            "Show Answers",
            "Show Answers",
            "Show Answers",
            "Show Answers",
            "Show Answers"
        ],
        [
            "Total Posts",
            "19",
            "7",
            "3",
            "2",
            "5"
        ],
        [
            "Post Your Answers",
            "Post Your Answers",
            "Post Your Answers",
            "Post Your Answers",
            "Post Your Answers",
            "Post Your Answers"
        ],
        [
            "Last Post",
            "usha",
            "usha",
            "shweta",
            "usha",
            "Himanshu Varshney"
        ]
    ],
    "pageTitle": "SQL Objective Questions And Answers",
    "title": "",
    "url": "http://r4r.co.in/sql/SQL_Interview_Questions_And%20Answers/SQL_Objective_Questions_And_Answers.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00062-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 203749024,
    "recordOffset": 203740822,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Page 1 SQL Interview Questions And Answers 4 3 2 Totel:17 Click: 1 (adsbygoogle = window.adsbygoogle || []).push({}); (adsbygoogle = window.adsbygoogle || []).push({}); Oracle Interview Questions RDMS FAQS MySQL FAQS MySQL Objective question MySQL Interview question MySQL subjective question MySQL Interview Materials Codd's Twelve Rules Keys & Level of Abstraction Functions In MySQL Normalization DataTypes In MySQL Create Table In MySQL Create DB In MySQL Union In MySQL Right Join In MySQL Left Join In MySQL Inner Join In MySQL Joins In MySQL Aliases In MySQL Wildcards In MySQL Like In MySQL Select Limit In MySQL Injection In MySQL Delete In MySQL Update In MySQL Insert Into In MySQL Order By In MySQL And & Or In MySQL Where In MySQL",
    "textAfterTable": "Goto Page: SQL Interview Questions And Answers SQL Interview Questions And Answers SQL Interview Questions And Answers SQL Subjective Questions And Answers R4R, SQL Objective fresher and experienced, SQL Subjective fresher and experienced ,SQL Interview Questions And Answers,SQL fresher and experienced,SQL Interview fresher and experienced ,SQL Questions fresher and experienced,SQL Answers fresher and experienced R4R Topics C tutorial C++ tutorial Corejava Advanced java C# tutorial HTML CSS tutorial ASP.net WCF tutorial WPF tutorial Struts tutorial Spring Hibernate Android Unix tutorial Linux tutorial SQL tutorial WEB technology Hot Topics Database & SQL HR FAQs",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}