{
    "relation": [
        [
            "Year",
            "2012",
            "2013",
            "2014",
            "2015",
            "Total"
        ],
        [
            "GP",
            "6",
            "14",
            "15",
            "18",
            "53"
        ],
        [
            "GS",
            "1",
            "14",
            "13",
            "18",
            "46"
        ],
        [
            "Mins",
            "61:00",
            "811:43",
            "809:52",
            "1061:42",
            "2744:17"
        ],
        [
            "GA",
            "21",
            "122",
            "155",
            "150",
            "448"
        ],
        [
            "GAA",
            "20.66",
            "9.02",
            "11.48",
            "8.48",
            "9.80"
        ],
        [
            "Saves",
            "11",
            "138",
            "155",
            "199",
            "503"
        ],
        [
            "Sv Pct",
            ".344",
            ".531",
            ".500",
            ".570",
            ".529"
        ],
        [
            "W-L-T",
            "0-1-0",
            "10-4-0",
            "6-9-0",
            "14-4-0",
            "30-18-0"
        ],
        [
            "GB",
            "5",
            "22",
            "29",
            "42",
            "98"
        ],
        [
            "CT",
            "0",
            "6",
            "5",
            "6",
            "17"
        ]
    ],
    "pageTitle": "Dave Scarcello Bio - Marist College Red Foxes",
    "title": "",
    "url": "http://www.goredfoxes.com/ViewArticle.dbml?ATCLID=205304814&DB_OEM_ID=27700",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00152-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481650655,
    "recordOffset": 481636848,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6083=2012 Game-by-Game, 6432=2013 Game-by-Game, 3336=61:00, 7771=2014: MAAC All-Tournament Team, MAAC All-Academic Team... Appeared in all 15 games for Marist in net, notching 13 starts... Was named team-captain for the 2013-14 season... Had 155 saves for a save percentage of .500... Allowed 155 goals... Had a career-high 16 saves March 22 against Quinnipiac... Collected 29 ground balls, good for seventh on the team, including a career-high five March 22 against Quinnipiac... Had five caused turnovers, including a season-high two April 19 against Monmouth... Had one assist April 19 against Monmouth. , 7809=2015 Game-by-Game, 6394=2012: Appeared in six games, making one start March 10 vs. no. 4 Maryland, as a freshman... Made seven saves in 30 minutes in the season opener at Sacred Heart on Feb. 26., 2816=2013, 8875=2015: USILA Scholar All-American, MAAC Tournament Most Outstanding Player, 3x MAAC Defensive Player of the Week (2/16, 3/16, 4/6), ECAC Defensive Player of the Week (4/7), MAAC All-Academic Team... Posted double-digit saves in 11 of the 18 games he started... Led the Red Foxes to six wins in games decided by three or fewer goals including three one-goal wins... Made 199 saves while allowing 150 goals... Collected 42 ground balls for fifth on the team... Had a season-best .700 save percentage in the season opener at Air Force on Feb. 14, making 14 saves while allowing six goals... Made a career-high 19 saves and picked up his first career assist against High Point on March 7... Tied a career-high with three caused turnovers vs. Detroit on April 4... Allowed a career-low two goals at Manhattan on April 18... Ranked seventh in the nation in save percentage (.570) and 15th in goals against average (8.48)., 7077=2014 Game-by-Game, 2634=811:43, 3516=2012, 7039=2013: 4x MAAC Defensive Player of the Week (3/5, 3/11, 4/15, 4/23)... Started at goalkeeper in all 14 games as a sophomore… Posted a 9.02 goals against average… Finished with a .531 save percentage with 138 shots saved… Won 10 games and lost four… Allowed zero goals in 30 minutes of play March 30 vs. VMI… Allowed five or fewer goals three times… Saved 12 or more shots on five occasions.}",
    "textBeforeTable": "Career Highs Prior to Marist: Scarcello played four years of varsity lacrosse and had a career save percentage of .680... As a senior, he was named Second Team All-Western New York as well as his high school's Co-Athlete of the Year... Scarcello was also a four-time Monsignor Martin All-Catholic selection and three-time Monsignor Martin champion. 2012 Game-by-Game 2012: Appeared in six games, making one start March 10 vs. no. 4 Maryland, as a freshman... Made seven saves in 30 minutes in the season opener at Sacred Heart on Feb. 26. 2013 Game-by-Game 2013: 4x MAAC Defensive Player of the Week (3/5, 3/11, 4/15, 4/23)... Started at goalkeeper in all 14 games as a sophomore… Posted a 9.02 goals against average… Finished with a .531 save percentage with 138 shots saved… Won 10 games and lost four… Allowed zero goals in 30 minutes of play March 30 vs. VMI… Allowed five or fewer goals three times… Saved 12 or more shots on five occasions. 2014 Game-by-Game 2014: MAAC All-Tournament Team, MAAC All-Academic Team... Appeared in all 15 games for Marist in net, notching 13 starts... Was named team-captain for the 2013-14 season... Had 155 saves for a save percentage of .500... Allowed 155 goals... Had a career-high 16 saves March 22 against Quinnipiac... Collected 29 ground balls, good for seventh on the team, including a career-high five March 22 against Quinnipiac... Had five caused turnovers, including a season-high two April 19",
    "textAfterTable": "18 18 1061:42 150 8.48 199 .570 14-4-0 42 6 Total 53 46 2744:17 448 9.80  503 .529 30-18-0 98 17 Position: Goalie Height: 5'11\" Weight: 171 Year: Senior Hometown: Buffalo, N.Y. High School: Bishop Timon St. Jude Dave Photos: > View Gallery More From MARIST MEN'S LACROSSE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}