[
    {
        "query": "English (this page) Wikipedia",
        "title": "English Wikipedia",
        "pageid": "328159",
        "summary": "The English Wikipedia is the English-language edition of the free online encyclopedia Wikipedia. Founded on 15 January 2001, it is the first edition of Wikipedia and, as of  November 2017, has the most articles of any of the editions. As of December 2018, 12% of articles in all Wikipedias belong to the English-language edition. This share has gradually declined from more than 50 percent in 2003, due to the growth of Wikipedias in other languages. As of 16 December 2018, there are 5,768,894 articles on the site. In October 2015, the combined text of the English Wikipedia's articles totalled 11.5 gigabytes when compressed. On 1 November 2015, the English Wikipedia announced it had reached 5,000,000 articles and ran a special logo to reflect the milestone.The Simple English Wikipedia is a variation in which most of the articles use only basic English vocabulary. There is also the Old English (Ænglisc/Anglo-Saxon) Wikipedia (angwiki). Community-produced news publications include The Signpost.",
        "summary_1s": "The English Wikipedia is the English-language edition of the free online encyclopedia Wikipedia.",
        "attributes": {
            "Type of site": "Internet encyclopedia",
            "Owner": "Wikimedia Foundation",
            "Created by": "Jimmy Wales, Larry Sanger",
            "Website": "en.wikipedia.org",
            "Commercial": "No",
            "Registration": "Optional, but required for certain tasks including • protected page edit • page creation • file upload ",
            "Users": "35,211,893",
            "Launched": "15 January 2001; 17 years ago (2001-01-15)",
            "Content license": "Creative Commons Attribution/Share-Alike 3.0 (most text also dual-licensed under GFDL)Media licensing varies"
        }
    },
    {
        "query": "French Wikipedia",
        "title": "French Wikipedia",
        "pageid": "1147094",
        "summary": "The French Wikipedia (French: Wikipédia en français) is the French-language edition of the free online encyclopedia Wikipedia. This edition was started in March 2001, and has 2,065,181 articles as of December 16, 2018, making it the fifth-largest Wikipedia overall, after the English-, Dutch-, German-, Swedish- and Cebuano-language editions, the largest Wikipedia edition in a Romance language. It has the third-largest number of edits. It was also the third edition, after the English Wikipedia and German Wikipedia, to exceed 1 million encyclopedia articles: this occurred on 23 September 2010. In April 2016, the project had 4657 active editors who made at least five edits in that month.\nIn 2008, the French encyclopaedia, Quid, cancelled its 2008 edition, citing falling sales on competition from the French edition of Wikipedia.As of  June 2014, Wikipedia has an Alexa ranking of 6 and 5.06% of those visits are to the French-language edition. As of December 2018, there are 3,303,000 users, 156 admins and 56,438 files on the French Wikipedia.On 2 December 2014, the French-language Wikipedia encyclopedia became the 3rd linguistic edition by number of registered users since its creation, overtaking for the first time the German edition, with 2,022,504 registered users, behind the English (23,300,456) and Spanish (3,401,493) language editions.\nAccording to a 2013 study by the Oxford Internet Institute, Ségolène Royal (FR) and unidentified flying object (objet volant non identifié) were the most controversial articles on the French Wikipedia.",
        "summary_1s": "The French Wikipedia (French: Wikipédia en français) is the French-language edition of the free online encyclopedia Wikipedia.",
        "attributes": {
            "Type of site": "Online encyclopedia",
            "Available in": "French",
            "Owner": "Wikimedia Foundation",
            "Website": "fr.wikipedia.org",
            "Commercial": "No",
            "Registration": "Optional",
            "Launched": "23 March 2001; 17 years ago (2001-03-23)"
        }
    },
    {
        "query": "German Wikipedia",
        "title": "German Wikipedia",
        "pageid": "1245772",
        "summary": "The German Wikipedia (German: deutschsprachige Wikipedia) is the German-language edition of Wikipedia, a free and publicly editable online encyclopedia.\nFounded in March 2001, it is the second-oldest, after the English Wikipedia, and with 2,248,670 articles, at present (2017) the fourth-largest edition of Wikipedia by number of articles, behind the English Wikipedia and the heavy bot-generated Swedish Wikipedia and Cebuano Wikipedia. It has the second-largest number of edits and over 260,000 disambiguation pages. On 7 November 2011, it became the second edition of Wikipedia, after the English edition, to exceed 100 million page edits.",
        "summary_1s": "The German Wikipedia (German: deutschsprachige Wikipedia) is the German-language edition of Wikipedia, a free and publicly editable online encyclopedia.",
        "attributes": {
            "Type of site": "Internet encyclopedia project",
            "Available in": "German",
            "Owner": "Wikimedia Foundation",
            "Editor": "German Wikipedia community",
            "Website": "de.wikipedia.org",
            "Commercial": "No",
            "Registration": "Optional",
            "Launched": "March 16, 2001; 17 years ago (2001-03-16)"
        }
    },
    {
        "query": "Japanese Wikipedia",
        "title": "Japanese Wikipedia",
        "pageid": "18935639",
        "summary": "The Japanese Wikipedia (ウィキペディア日本語版, Wikipedia Nihongo-ban, literally \"Wikipedia: Japanese-language version\") is the Japanese-language edition of Wikipedia, a free, open-content encyclopedia. Started on 11 May 2001, the edition attained the 200,000 article mark in April 2006 and the 500,000 article mark in June 2008. As of December 2018, it has over 1,132,000 articles. In April 2016, the project had 4,192 active editors who made at least five edits in that month, ranking fourth behind the English, Spanish and Russian editions.",
        "summary_1s": "The Japanese Wikipedia (ウィキペディア日本語版, Wikipedia Nihongo-ban, literally \"Wikipedia: Japanese-language version\") is the Japanese-language edition of Wikipedia, a free, open-content encyclopedia.",
        "attributes": {
            "Type of site": "Internet encyclopedia project",
            "Available in": "Japanese",
            "Owner": "Wikimedia Foundation",
            "Website": "ja.wikipedia.org",
            "Commercial": "No",
            "Registration": "Optional",
            "Launched": "May 11, 2001; 17 years ago (2001-05-11)"
        }
    },
    {
        "query": "Russian Wikipedia",
        "title": "Russian Wikipedia",
        "pageid": "2036528",
        "summary": "The Russian Wikipedia (Russian: Русская Википедия, 'Russkaya Vikipediya') is the Russian-language edition of Wikipedia. As of December, 2018, it has 1,515,548 articles. It was started on 11 May 2001. In October 2015 it became the sixth-largest Wikipedia by the number of articles. It has the fifth-largest number of edits (96.6 million). Since 2016, Alexa Internet rankings tend to show it as the world's most visited language Wikipedia after English Wikipedia.It is the largest Wikipedia written in any Slavic language, surpassing its nearest rival, the Polish Wikipedia, eightfold by the parameter of depth. In addition, the Russian Wikipedia is the largest Wikipedia written in Cyrillic or in a script other than Latin script. In April 2016, the project had 3,377 active editors who made at least five edits in that month, ranking third behind the English and Spanish versions.",
        "summary_1s": "The Russian Wikipedia (Russian: Русская Википедия, 'Russkaya Vikipediya') is the Russian-language edition of Wikipedia.",
        "attributes": {
            "Type of site": "Internet encyclopedia project",
            "Available in": "Russian",
            "Headquarters": "Miami, Florida",
            "Owner": "Wikimedia Foundation",
            "Website": "ru.wikipedia.org",
            "Commercial": "Charitable",
            "Registration": "Optional",
            "Launched": "May 20, 2001; 17 years ago (2001-05-20)",
            "Content license": "Creative Commons ShareAlike License 3.0"
        }
    },
    {
        "query": "Chinese Wikipedia",
        "title": "Chinese Wikipedia",
        "pageid": "1197992",
        "summary": "The Chinese Wikipedia (traditional Chinese: 中文維基百科; simplified Chinese: 中文维基百科; pinyin: Zhōngwén Wéijī Bǎikē) is the (Standard) Chinese language edition of Wikipedia. It is run by the Wikimedia Foundation. Started on 11 May 2001, the Chinese Wikipedia currently has about 1,036,000 articles and about 2,643,000 registered users, of which 78 have administrative privileges. The Chinese Wikipedia has been blocked in Mainland China since May 2015.The Chinese Wikipedia is the fourth largest online Chinese encyclopedia after Hudong Baike (互动百科), Baidu Baike (百度百科) and Soso Baike (搜搜百科).",
        "summary_1s": "The Chinese Wikipedia (traditional Chinese: 中文維基百科; simplified Chinese: 中文维基百科; pinyin: Zhōngwén Wéijī Bǎikē) is the (Standard) Chinese language edition of Wikipedia.",
        "attributes": {
            "Type of site": "Internet encyclopedia project",
            "Available in": "Written vernacular Chinese",
            "Owner": "Wikimedia Foundation",
            "Website": "zh.wikipedia.org",
            "Commercial": "No",
            "Registration": "Optional",
            "Launched": "May 11, 2001; 17 years ago (2001-05-11)",
            "Current status": "Banned in Mainland China."
        }
    },
    {
        "query": "Czech Wikipedia",
        "title": "Czech Wikipedia",
        "pageid": "3349006",
        "summary": "The Czech Wikipedia (Czech: Česká Wikipedie) is the Czech language edition of Wikipedia.This Wikipedia contains 418,243 articles, 2,284 active users, and 31 administrators.\nIt was created on May 3, 2002 on a request of a Czech editor of the Esperanto Wikipedia. However, at that time, Wikipedia ran on UseMod software. The three pages the Czech version had at the time were lost during the switch to MediaWiki. The oldest currently available edit is from when the Main Page was recopied on November 14, 2002.  It reached 1,000 articles, many about Esperanto topics, on October 20, 2003.  An April 2004 report noted that it had 180 registered users at that time.In June 2005, the Czech Wikipedia reached 10,000 articles and it reached 20,000 in December of the same year.  The Main Page was re-designed with more details after reaching this milestone.  By November 2006, it exceeded 30,000 articles, and became the 21st language version to exceed 100,000 articles in June 2008.  As of April 10, 2015 there are more than 319,100 articles, 29 administrators, almost 293,000 registered users, and dozens of very active contributors.  In December 2009, contributors to the Czech Wikipedia held a conference in Prague.In 2008, the Czech NGO Wikimedia Česká republika (Wikimedia Czech Republic) was founded to support the Czech Wikipedia by organizing events, helping communication with authors of free content, and promoting the Czech Wikipedia to the public.On February 10, 2018 the Czech Wikipedia reached 400,000 articles.",
        "summary_1s": "The Czech Wikipedia (Czech: Česká Wikipedie) is the Czech language edition of Wikipedia.This Wikipedia contains 418,243 articles, 2,284 active users, and 31 administrators.",
        "attributes": {
            "Type of site": "Internet encyclopedia project",
            "Available in": "Czech",
            "Headquarters": "Miami, Florida",
            "Owner": "Wikimedia Foundation",
            "Website": "cs.wikipedia.org",
            "Commercial": "No",
            "Registration": "Optional",
            "Launched": "May 3, 2002"
        }
    },
    {
        "query": "Polish Wikipedia",
        "title": "Polish Wikipedia",
        "pageid": "1313740",
        "summary": "The Polish Wikipedia (Polish: Polskojęzyczna Wikipedia) is the Polish-language edition of Wikipedia, a free online encyclopedia. Founded on September 26, 2001, it now has around 1,312,000 articles, making it the 10th-largest Wikipedia edition overall. It is also the second-largest edition in a Slavic language, after the Russian Wikipedia.",
        "summary_1s": "The Polish Wikipedia (Polish: Polskojęzyczna Wikipedia) is the Polish-language edition of Wikipedia, a free online encyclopedia.",
        "attributes": {
            "Type of site": "Internet encyclopedia project",
            "Available in": "Polish",
            "Owner": "Wikimedia Foundation",
            "Website": "pl.wikipedia.org",
            "Commercial": "No",
            "Registration": "Optional",
            "Launched": "September 26, 2001; 17 years ago (2001-09-26)"
        }
    },
    {
        "query": "Spanish Wikipedia",
        "title": "Spanish Wikipedia",
        "pageid": "18935041",
        "summary": "The Spanish Wikipedia (Spanish: Wikipedia en español) is a Spanish-language edition of Wikipedia, a free, online encyclopedia. It has 1,494,169 articles. Started in May 2001, it reached 100,000 articles on March 8, 2006 and 1,000,000 articles on May 16, 2013. It is the 9th-largest Wikipedia as measured by the number of articles and has the 4th-largest number of edits.",
        "summary_1s": "The Spanish Wikipedia (Spanish: Wikipedia en español) is a Spanish-language edition of Wikipedia, a free, online encyclopedia.",
        "attributes": {
            "Type of site": "Internet encyclopedia project",
            "Available in": "Spanish",
            "Headquarters": "Miami, Florida",
            "Owner": "Wikimedia Foundation",
            "Website": "es.wikipedia.org",
            "Commercial": "No",
            "Registration": "Optional",
            "Launched": "May 11, 2001; 17 years ago (2001-05-11)"
        }
    },
    {
        "query": "Portuguese Wikipedia",
        "title": "Portuguese Wikipedia",
        "pageid": "1246304",
        "summary": "The Portuguese Wikipedia (Portuguese: Wikipédia em português) is the Portuguese language edition of Wikipedia (written Wikipédia, in Portuguese), the free encyclopedia. It was started on 11 May 2001. It is currently (October 2017) the fourteenth largest Wikipedia by article count, containing 1,012,343 articles.",
        "summary_1s": "The Portuguese Wikipedia (Portuguese: Wikipédia em português) is the Portuguese language edition of Wikipedia (written Wikipédia, in Portuguese), the free encyclopedia.",
        "attributes": {
            "Type of site": "Internet encyclopedia project",
            "Available in": "Portuguese",
            "Owner": "Wikimedia Foundation",
            "Website": "pt.wikipedia.org",
            "Commercial": "No",
            "Registration": "Optional",
            "Launched": "May 11, 2001; 17 years ago (2001-05-11)"
        }
    },
    {
        "query": "Serbian Wikipedia",
        "title": "Serbian Wikipedia",
        "pageid": "3503045",
        "summary": "The Serbian Wikipedia (Serbian: Википедија на српском језику / Vikipedija na srpskom jeziku) is the Serbian-language version of the free online encyclopedia Wikipedia. Created on 16 February 2003, it reached its 100,000th article on 20 November 2009 before getting to another milestone with the 200,000th article on 6 July 2013, and then another milestone with the 500,000th article on 13 January 2018.\nIt currently has 223,604 registered users (1,145 active ones) and about 613,000 articles, making it the largest Wikipedia written in a South Slavic language and the 18th largest Wikipedia overall.The Serbian Wikipedia uses ZhengZhu's character mapping program to convert between Cyrillic and Latin scripts.",
        "summary_1s": "The Serbian Wikipedia (Serbian: Википедија на српском језику / Vikipedija na srpskom jeziku) is the Serbian-language version of the free online encyclopedia Wikipedia.",
        "attributes": {
            "Type of site": "Internet encyclopedia project",
            "Available in": "Serbian",
            "Headquarters": "Miami, Florida",
            "Owner": "Wikimedia Foundation",
            "Website": "sr.wikipedia.org",
            "Commercial": "No",
            "Registration": "Optional",
            "Launched": "16 February 2003; 15 years ago (2003-02-16)",
            "Content license": "Creative Commons Attribution/Share-Alike 3.0 (most text also dual-licensed under GFDL)Media licensing varies"
        }
    },
    {
        "query": "Croatian Wikipedia",
        "title": "Croatian Wikipedia",
        "pageid": "3502875",
        "summary": "The Croatian Wikipedia (Croatian: Wikipedija na hrvatskome jeziku) is the Croatian version of Wikipedia, the free encyclopedia, started on February 16, 2003.\nThis version has 201,027 articles and a total of 5.17 million edits have been made (live count). It has 210,557 registered user accounts, out of which 558 are active (defined as having performed an action on Wikipedia in the last 30 days), and the number of administrators is 19.\nIn late 2013, the Croatian Wikipedia received attention from international media for promoting a fascist worldview as well as bias against Serbs of Croatia and anti-LGBT propaganda by the means of historical revisionism and by negating or diluting the severity of crimes committed by the Ustaše regime.\nThroughout 2014, fewer than two dozen editors made more than 100 edits a month; around 150 made more than 5 edits a month. Over 600 articles are ranked as featured (Croatian: Izabrani članci).",
        "summary_1s": "The Croatian Wikipedia (Croatian: Wikipedija na hrvatskome jeziku) is the Croatian version of Wikipedia, the free encyclopedia, started on February 16, 2003.",
        "attributes": {
            "Type of site": "Internet encyclopedia project",
            "Available in": "Croatian",
            "Owner": "Wikimedia Foundation",
            "Website": "hr.wikipedia.org",
            "Commercial": "No",
            "Registration": "Optional",
            "Launched": "February 16, 2003"
        }
    },
    {
        "query": "Slovenian Wikipedia",
        "title": "Slovene Wikipedia",
        "pageid": "2677236",
        "summary": "The Slovene Wikipedia (Slovene: Slovenska Wikipedija) is the Slovene-language edition of the free online encyclopedia Wikipedia. It has been active since 26 February 2002. In July 2007, it has reached 50,000 articles. As of December 2018, it has about 163,000 articles.\nWikipedia is a widely used reference work and one of the most visited social networking services by users from Slovenia, but official internet usage statistics don't distinguish between Wikipedia editions, analyzing only the base domain wikipedia.org. In most cases, the Slovene-language edition gets a passing note of its existence in media reports about Wikipedia in general. However, as a relatively large and freely accessible body of structured knowledge, Slovene Wikipedia has been used, as an example, for building text corpora for the purpose of training linguistic software and analyzing Slovene literary authors' web presence. There are several successful collaboration projects with professors at the University of Ljubljana, using content creation by students as a teaching method.Active Wikipedians from Slovenia have also been featured in discussions about Wikipedia (both general and Slovene-language specific) in national media.",
        "summary_1s": "The Slovene Wikipedia (Slovene: Slovenska Wikipedija) is the Slovene-language edition of the free online encyclopedia Wikipedia.",
        "attributes": {
            "Type of site": "Internet encyclopedia project",
            "Available in": "Slovene",
            "Headquarters": "Miami, Florida",
            "Owner": "Wikimedia Foundation",
            "Website": "http://sl.wikipedia.org/",
            "Commercial": "No",
            "Registration": "Optional"
        }
    },
    {
        "query": "Danish Wikipedia",
        "title": "Danish Wikipedia",
        "pageid": "1706469",
        "summary": "The Danish Wikipedia (Danish: Dansk Wikipedia)  started on 1 February 2002 and is the Danish language edition of Wikipedia.  As of 16 December 2018, it has 241,654 articles. Its article depth is 66.44 (as of October 2017), a bit below the median value, but the best of Wikis in Scandinavia and Finland.",
        "summary_1s": "The Danish Wikipedia (Danish: Dansk Wikipedia)  started on 1 February 2002 and is the Danish language edition of Wikipedia.",
        "attributes": {
            "Type of site": "Internet encyclopedia project",
            "Available in": "Danish",
            "Headquarters": "Miami, Florida",
            "Owner": "Wikimedia Foundation",
            "Website": "da.wikipedia.org",
            "Commercial": "No",
            "Registration": "Optional"
        }
    },
    {
        "query": "Italian Wikipedia",
        "title": "Italian Wikipedia",
        "pageid": "1313726",
        "summary": "The Italian Wikipedia (Italian: Wikipedia in italiano) is the Italian-language edition of Wikipedia. This edition was created on May 11, 2001 and first edited on June 11, 2001. As of 16 December 2018 it has 1,485,107 articles and more than 1,755,473 registered accounts. It is the 8th-largest Wikipedia by the number of articles (after the English, Swedish, German, Dutch, French, Cebuano, and Russian editions).",
        "summary_1s": "The Italian Wikipedia (Italian: Wikipedia in italiano) is the Italian-language edition of Wikipedia.",
        "attributes": {
            "Type of site": "Internet encyclopedia project",
            "Available in": "Italian",
            "Headquarters": "Miami, Florida",
            "Owner": "Wikimedia Foundation",
            "Created by": "Italian wiki community",
            "Website": "it.wikipedia.org",
            "Commercial": "No",
            "Registration": "Optional",
            "Launched": "May 11, 2001; 17 years ago (2001-05-11)"
        }
    },
    {
        "query": "Korean Wikipedia",
        "title": "Korean Wikipedia",
        "pageid": "3244019",
        "summary": "The Korean Wikipedia (Korean: 한국어 위키백과, translit. Han-gugeo Wikibaekgwa) is the Korean language edition of the Wikipedia. It was founded in October 2002 and reached ten thousand articles on 4 June 2005. As of 10 April 2015, it has 310,600 articles and is the 26th largest Wikipedia. In April 2016, the project had 847 active editors who made at least five edits in that month.",
        "summary_1s": "The Korean Wikipedia (Korean: 한국어 위키백과, translit.",
        "attributes": {
            "Type of site": "Internet encyclopedia project",
            "Available in": "Korean",
            "Headquarters": "Miami, Florida",
            "Owner": "Wikimedia Foundation",
            "Website": "ko.wikipedia.org",
            "Commercial": "No",
            "Registration": "Optional"
        }
    }
]