[
    {
        "query": "Morrison",
        "title": "Morrison (surname)",
        "pageid": "12742650",
        "summary": "The surname Morrison is commonly found throughout Scotland, England and Ireland. It is most likely of Anglo-Norman origin, traditionally believed to be a patronymic of Maurice/Morris. [1]\nIn Scotland there is strong evidence that surnames such as Moir, Muir and More were equally influential as potential multiple origin points for the derivative of the modern spelling of Morrison, particularly in the light of evidence that suggests many early surnames in Scotland were nuanced and altered by such simple devices as phonetic interpretations by scribes or rebranding inventions for convenience, for example, McCoinnich describes the adoption of the name Morrison on the Isle of Lewis around 1640 by families formerly know as “McBrief” or “mac a’ Bhritheimh”.[2] \nThe spelling of surnames, including Morrison, Morison and Muirson, became more regular after 1854 when Lord Elcho (Francis Richard Charteris, 10th Earl of Wemyss) finally succeeded in framing An Act to Provide for the Better Registration of Births, Deaths, and Marriages in Scotland, 31 May 1854.[3]\nScottish records from the fourteenth to sixteenth centuries, including The Register of the Great Seal of Scotland, Birth and Marriage records, Burgh records for Edinburgh, Aberdeen and Glasgow and records of the Cistercian Monks in the Cupar Angus area all reference various spellings of Morrison including Mauricius, Maurieson, Marrson, Maryson, Merson, Mirryson, Mirrison, Molleson, Monson, Morrison, Morison, Morisson, Morissone, Morcion, Morisone, Morsion, Moryson, Morrieson, Morriceson, Morishon, Morason, Morzon, Moorison, Morisoun, Moresoun, Moressoune, Morrowson, Murrion, Murison, Muirison, Murieson, Murrison, Muresoun, Muirsoun, Murson, Murescun, Murysone, Mwryson, Makmurisoun, M’Mursoun, and MacMaurice.\nThe argument for multiple surname origins is supported by the association of Moor or Saracen head(s) on some Moor, Moore, More, Mores, Morrison, Mure and Muir family crests [4],[5]. The Clan Morrison Society of Scotland registered arms featuring three Moor heads in 1919.\nPerhaps the earliest recording of the surname Morrison is found in the English Yorkshire Poll Tax records in 1379 for “Ricardus Morisson”.[6] Later in Scotland the another Morrison is recorded as “Arthuro Morison domino de Darleith” being a witness to the “Resignation by John MacRoger of Gleane MacKerne, in favour of John of Culquoune of Luss, of Gleane Mackecherne, etc. 7th February 1429”.[7] Morrison families today are widely distributed across Scotland, England and Ireland with little or no common genetic or family ancestry. \nThe name Morrison is associated with a number of Scottish myths and legends which are inventions. At the time of King George IV state visit to Scotland in 1822 Sir Walter Scott encouraged Scottish clans and families to once again wear tartan, and along with this fervour of Scottish romanticism came the invention of many myths to add glamour to family origins.\nTwo prominent falsehoods have become popular to Morrison clan followers. One relates to the Gaelic translation of Morrison and the other concerns Viking origins. Firstly, the commonly quoted proposition that the Gaelic spelling of Morrison is a translation of MacGilliemhuire is “baseless”. Black makes the observation that “Equally baseless is the modern idea that “Morison” interpreted as “Mary’s son,” represents Gaelic Mac Gille Mhuire”.[8] \nSecondly, there is the commercially promoted myth that the origin of the name Morrison in Scotland somehow involves Vikings. The myth suggests the Morrisons came from the Isle of Lewis and are of Viking origin.[9] This myth joins other Scottish fabrications such as Hector Boece’s (c1465-c1536) Historia Gentis Scotorum (History of the Scottish People), James Macpherson’s (1736-1796) Ossian “discovery” and the imposter Sobieski brothers (really John and Charles Allen) Vestiarium Scoticum who passed themselves off as grandsons of Bonnie Prince Charlie.[10]. Not only is the viking association an invention, so also is the proposition the name originated in Lewis.[11] The name Morrison as shown in the historical records was already in northern England and the Scottish lowlands two hundred years before some families on Lewis saw the opportunity to adopt a new name.\n\n",
        "summary_1s": "The surname Morrison is commonly found throughout Scotland, England and Ireland.",
        "attributes": null
    },
    {
        "query": "Fargo",
        "title": "Fargo, North Dakota",
        "pageid": "128485",
        "summary": "Fargo is the most populous city in the state of North Dakota, accounting for nearly 17% of the state population. Fargo is also the county seat of Cass County. According to the 2017 United States Census estimates, its population was 122,359, making it the 225th-most populous city in the United States. Fargo, along with its twin city of Moorhead, Minnesota, as well as the adjacent cities of West Fargo, North Dakota and Dilworth, Minnesota, form the core of the Fargo-Moorhead, ND-MN Metropolitan Statistical Area, which in 2017 contained a population of 241,356.Founded in 1871 on the Red River of the North floodplain, Fargo is a cultural, retail, health care, educational, and industrial center for eastern North Dakota and northwestern Minnesota. The city is also home to North Dakota State University.",
        "summary_1s": "Fargo is the most populous city in the state of North Dakota, accounting for nearly 17% of the state population.",
        "attributes": {
            "Country": " United States",
            "State": "  North Dakota",
            "County": "Cass",
            "Founded": "1871",
            "Government  • Mayor": "Tim Mahoney",
            "Area  • City": "48.82 sq mi (126.44 km)",
            "Area  • Land": "48.82 sq mi (126.44 km)",
            "Area  • Water": "0 sq mi (0 km)",
            "Elevation": "904 ft (274 m)",
            "Population (2010)  • City": "105,549",
            "Population (2010)  • Estimate (2017)": "122,359",
            "Population (2010)  • Rank": "US: 225th",
            "Population (2010)  • Density": "2,200/sq mi (830/km)",
            "Population (2010)  • Urban": "205,161",
            "Population (2010)  • Metro": "238,124",
            "Population (2010)  • Demonym": "Fargoan",
            "Time zone": "UTC-6 (CST)",
            "Time zone  • Summer (DST)": "UTC-5 (CDT)",
            "ZIP Codes": "58102-58109, 58121-58122, 58124-58126",
            "Area code": "701",
            "FIPS code": "38-25700",
            "GNIS feature ID": "1028945",
            "Highways": "I-29, I-94, I-94 Bus., US 10, US 52, US 81, US 81 Bus., ND 294",
            "Website": "City of Fargo"
        }
    },
    {
        "query": "Billings",
        "title": "Billings, Montana",
        "pageid": "123654",
        "summary": "Billings is the largest city in the U.S. state of Montana, and the principal city of the Billings Metropolitan Area with a population of 170,498. It has a trade area of over 500,000.Billings is located in the south-central portion of the state and is the seat of Yellowstone County, which had a 2017 population of 158,980. The 2017 Census estimates put the Billings population at 109,642, making it the only city in Montana with over 100,000 people. The city is experiencing rapid growth and a strong economy; it has had and is continuing to have the largest growth of any city in Montana. Parts of the metro area are seeing hyper growth. From 2000 to 2010 Lockwood, an eastern suburb of the city, saw growth of 57.8%, the largest growth rate of any community in Montana. Billings has avoided the economic downturn that affected most of the nation 2008–2012 as well as avoiding the housing bust. With the Bakken oil development in eastern Montana and western North Dakota, the largest oil discovery in U.S. history, as well as the Heath shale oil discovery just north of Billings, the city's growth rate stayed high during the shale oil boom. Although the city is still growing, the rate of increase has diminished markedly with oil price declines in recent years.Billings was nicknamed the \"Magic City\" because of its rapid growth from its founding as a railroad town in March 1882. The city is named for Frederick H. Billings, a former president of the Northern Pacific Railroad. With one of the largest trade areas in the United States, Billings is the trade and distribution center for much of Montana east of the Continental Divide, Northern Wyoming, and western portions of North Dakota and South Dakota. Billings is also the retail destination for much of the same area. With more hotel accommodations than any area within a five-state region, the city hosts a variety of conventions, concerts, sporting events, and other rallies.Area attractions include Pompey's Pillar, Pictograph Cave, Chief Plenty Coups State Park, Zoo Montana, and Yellowstone Art Museum. Within 100 miles are Little Bighorn Battlefield National Monument, Bighorn Canyon National Recreation Area, Red Lodge Mountain Resort, and the Beartooth Highway, which links Red Lodge to Yellowstone National Park.",
        "summary_1s": "Billings is the largest city in the U.S. state of Montana, and the principal city of the Billings Metropolitan Area with a population of 170,498.",
        "attributes": {
            "Country": "United States",
            "State": "Montana",
            "County": "Yellowstone",
            "Founded": "1877",
            "Incorporated": "1882",
            "Named for": "Frederick H. Billings",
            "Government  • Type": "Mayor-Council",
            "Government  • Mayor": "Bill Cole",
            "Government  • City Admin.": "Chris Kukulski",
            "Government  • Governing body": "City Council",
            "Area  • City": "43.52 sq mi (112.72 km)",
            "Area  • Land": "43.41 sq mi (112.43 km)",
            "Area  • Water": "0.11 sq mi (0.28 km)",
            "Elevation": "3,123 ft (952 m)",
            "Population (2010)  • City": "104,170",
            "Population (2010)  • Estimate (2017)": "109,642",
            "Population (2010)  • Rank": "US: 275th",
            "Population (2010)  • Density": "2,400/sq mi (920/km)",
            "Population (2010)  • Urban": "114,773 (US: 273th)",
            "Population (2010)  • Metro": "170,498 (US: 245th)",
            "Time zone": "UTC−7 (Mountain)",
            "Time zone  • Summer (DST)": "UTC−6 (Mountain)",
            "ZIP codes": "59101-59117",
            "Area code(s)": "406",
            "FIPS code": "30-06550",
            "GNIS feature ID": "0802034",
            "Highways": "  ",
            "Website": "www.cityofbillings.net"
        }
    },
    {
        "query": "West Hollywood",
        "title": "West Hollywood, California",
        "pageid": "107702",
        "summary": "West Hollywood, commonly referred to as WeHo (), is a city in Los Angeles County, California, United States. Incorporated in 1984, it is home to the Sunset Strip. As of the 2010 U.S. Census, its population was 34,399. It is considered one of the most prominent gay villages in the United States.",
        "summary_1s": "West Hollywood, commonly referred to as WeHo (), is a city in Los Angeles County, California, United States.",
        "attributes": {
            "Country": " United States",
            "State": " California",
            "County": " Los Angeles",
            "Incorporated": "November 29, 1984 (1984-11-29)",
            "Government  • Type": "City Council/City Manager",
            "Government  • Mayor": "John Duran",
            "Government  • Councilmembers": "Lauren Meister   Lindsey Horvath  John D'Amico (Mayor Pro Tempore)  John Heilman",
            "Government  • City manager": "Paul Arevalo",
            "Area  • City": "1.89 sq mi (4.89 km)",
            "Area  • Land": "1.89 sq mi (4.89 km)",
            "Area  • Water": "0.00 sq mi (0.00 km)  0%",
            "Elevation": "282 ft (86 m)",
            "Population (2010)  • City": "34,399",
            "Population (2010)  • Estimate (2016)": "36,698",
            "Population (2010)  • Density": "19,447.80/sq mi (7,507.24/km)",
            "Time zone": "UTC−8 (Pacific)",
            "Time zone  • Summer (DST)": "UTC−7 (PDT)",
            "ZIP codes": "90038, 90046, 90048, 90069",
            "Area codes": "310/424, 213/323",
            "FIPS code": "06-84410",
            "GNIS feature IDs": "1652810, 2412221",
            "State Routes": "",
            "Website": "www.weho.org"
        }
    },
    {
        "query": "Santa Ana",
        "title": "Saint Anne",
        "pageid": "143102",
        "summary": "Saint Anne, of David's house and line, was the mother of Mary and grandmother of Jesus according to apocryphal Christian and Islamic tradition. Mary's mother is not named in the canonical gospels, but is mentioned  as the daughter of Faqud in Quran. In writing, Anne's name and that of her husband Joachim come only from New Testament apocrypha, of which the Gospel of James (written perhaps around 150) seems to be the earliest that mentions them.",
        "summary_1s": "Saint Anne, of David's house and line, was the mother of Mary and grandmother of Jesus according to apocryphal Christian and Islamic tradition.",
        "attributes": {
            "Born": "c. 50 BC",
            "Died": "12 AD (aged circa 62)",
            "Venerated in": "Christianity",
            "Canonized": "pre-congregation",
            "Feast": "26 July (Roman Catholic)",
            "Attributes": "Book, door, with Mary, Jesus or Joachim",
            "Patronage": "Brittany, Canada, Detroit, Fasnia (Tenerife); Mainar; carpenters; child care providers; childless people; children; equestrians; grandparents; homemakers/housewives; lace makers; lost articles; miners; mothers; moving house; old-clothes dealers; poverty; pregnancy; seamstresses; stablemen; sterility; teachers"
        }
    },
    {
        "query": "Tucson",
        "title": "Tucson, Arizona",
        "pageid": "57180",
        "summary": "Tucson () is a city and the county seat of Pima County, Arizona, United States, and home to the University of Arizona. The 2010 United States Census put the population at 520,116, while the 2015 estimated population of the entire Tucson metropolitan statistical area (MSA) was 980,263. The Tucson MSA forms part of the larger Tucson-Nogales combined statistical area (CSA), with a total population of 1,010,025 as of the 2010 Census. Tucson is the second-largest populated city in Arizona behind Phoenix, both of which anchor the Arizona Sun Corridor. The city is located 108 miles (174 km) southeast of Phoenix and 60 mi (97 km) north of the U.S.–Mexico border. Tucson is the 33rd largest city and the 58th largest metropolitan area in the United States (2014).\nMajor incorporated suburbs of Tucson include Oro Valley and Marana northwest of the city, Sahuarita south of the city, and South Tucson in an enclave south of downtown. Communities in the vicinity of Tucson (some within or overlapping the city limits) include Casas Adobes, Catalina Foothills, Flowing Wells, Midvale Park, Tanque Verde, Tortolita, and Vail. Towns outside the Tucson metro area include Benson to the southeast, Catalina and Oracle to the north, and Green Valley to the south.\nThe Spanish name of the city, Tucsón [tukˈson], is derived from the O'odham Cuk Ṣon [tʃʊk ʂɔːn], meaning \"(at the) base of the black [hill]\", a reference to a basalt-covered hill now known as Sentinel Peak, also known as \"A\" Mountain. Tucson is sometimes referred to as \"The Old Pueblo\".",
        "summary_1s": "Tucson () is a city and the county seat of Pima County, Arizona, United States, and home to the University of Arizona.",
        "attributes": {
            "Country": "United States",
            "State": "Arizona",
            "County": "Pima",
            "Incorporated": "February 7, 1877",
            "Government  • Type": "Council-manager government",
            "Government  • Mayor": "Jonathan Rothschild (D)",
            "Area  • City": "236.50 sq mi (612.55 km)",
            "Area  • Land": "236.19 sq mi (611.73 km)",
            "Area  • Water": "0.32 sq mi (0.82 km)",
            "Elevation": "2,389 ft (728 m)",
            "Population (2010)  • City": "520,116",
            "Population (2010)  • Estimate (2017)": "535,677",
            "Population (2010)  • Rank": "US: 33rd",
            "Population (2010)  • Density": "2,246.95/sq mi (867.55/km)",
            "Population (2010)  • Urban": "843,168 (52nd)",
            "Population (2010)  • Metro": "1,010,025 (58th)",
            "Population (2010)  • Demonym": "Tucsonan",
            "Time zone": "UTC−7 (MST (no DST)",
            "ZIP codes": "85701-85775",
            "Area code": "520",
            "FIPS code": "04-77000",
            "GNIS feature ID": "43534",
            "Website": "www.tucsonaz.gov"
        }
    },
    {
        "query": "Scottsdale",
        "title": "Scottsdale, Arizona",
        "pageid": "106659",
        "summary": "Scottsdale (O'odham: Vaṣai S-vaṣonĭ; Yaqui: Eskatel) is a city in the eastern part of Maricopa County, Arizona, United States, part of the Greater Phoenix Area. Named Scottsdale in 1894 after founder Winfield Scott and incorporated in 1951 with a population of 2,000, the 2015 population of the city is estimated to be 236,839 according to the U.S. Census Bureau. The New York Times described downtown Scottsdale as \"a desert version of Miami's South Beach\" and as having \"plenty of late night partying and a buzzing hotel scene.\" Its slogan is \"The West's Most Western Town.\"Scottsdale, 31 miles long and 11.4 miles wide at its widest point, shares boundaries with many other municipalities and entities. On the west, Scottsdale is bordered by Phoenix, Paradise Valley and unincorporated Maricopa County land. Carefree is located along the western boundary, as well as sharing Scottsdale's northern boundary with the Tonto National Forest. To the south Scottsdale is bordered by Tempe. The southern boundary is also occupied by the Salt River Pima-Maricopa Indian Community, which extends along the eastern boundary, which also borders Fountain Hills, the McDowell Mountain Regional Park and more unincorporated Maricopa County land.",
        "summary_1s": "Scottsdale (O'odham: Vaṣai S-vaṣonĭ; Yaqui: Eskatel) is a city in the eastern part of Maricopa County, Arizona, United States, part of the Greater Phoenix Area.",
        "attributes": {
            "Country": "United States",
            "State": "Arizona",
            "County": "Maricopa",
            "Incorporated": "1951",
            "Named for": "Winfield Scott",
            "Government  • Type": "Council-Manager",
            "Government  • Mayor": "Jim Lane (R)",
            "Area  • Total": "184.41 sq mi (477.63 km)",
            "Area  • Land": "183.94 sq mi (476.41 km)",
            "Area  • Water": "0.47 sq mi (1.22 km)",
            "Elevation": "1,257 ft (380 m)",
            "Population (2010)  • Total": "217,385",
            "Population (2010)  • Estimate (2016)": "246,645",
            "Population (2010)  • Rank": "US: 92nd",
            "Population (2010)  • Density": "1,340.88/sq mi (517.72/km)",
            "Time zone": "UTC−7 (MST (no DST))",
            "ZIP codes": "85250–85271",
            "Area code(s)": "480",
            "FIPS code": "04-65000",
            "GNIS ID": "11029",
            "Website": "www.scottsdaleaz.gov"
        }
    },
    {
        "query": "Albuquerque",
        "title": "Albuquerque, New Mexico",
        "pageid": "51278",
        "summary": "Albuquerque ( (listen) AL-bə-kur-kee; Navajo: Beeʼeldííl Dahsinil [pèːʔèltíːl tɑ̀xsɪ̀nɪ̀l]; Eastern Keres: Arawageeki; Jemez: Vakêêke; Zuni: Alo:ke:k'ya ;Jicarilla Apache: Gołgéeki'yé) is the most populous city in the U.S. state of New Mexico and the 32nd-most populous city in the United States, with a census-estimated population of 558,545 in 2017. Albuquerque is the principal city of the Albuquerque metropolitan area which has 910,726 residents as of July 2017. Albuquerque's MSA is the 60th-largest metropolitan area in the United States. The Albuquerque MSA population includes the cities of Rio Rancho, Bernalillo, Placitas, Corrales, Los Lunas, Belen, Bosque Farms, and forms part of the larger Albuquerque–Santa Fe–Las Vegas combined statistical area, with a total population of 1,171,991 in 2016.\nThe city was named in honor of Francisco Fernández de la Cueva, 10th Duke of Alburquerque who was Viceroy of New Spain from 1702 to 1711. The growing village was named by provincial governor, Francisco Cuervo y Valdés. The Duke's title referred to the Spanish town of Alburquerque, in the province of Badajoz, near the border with Portugal.\nAlbuquerque serves as the county seat of Bernalillo County, and is situated in the north central part of the state. The Sandia Mountains run along the eastern side of Albuquerque, and the Rio Grande flows through the city. Albuquerque has one of the highest elevations of any major city in the U.S. with ranges from 4,900 feet (1,490 m) above sea level near the Rio Grande to over 6,700 feet (1,950 m) in the foothill areas of Sandia Heights and Glenwood Hills.\nAlbuquerque is home to institutions and monuments such as Kirtland Air Force Base, Sandia National Laboratories, the National Museum of Nuclear Science & History, Lovelace Respiratory Research Institute, the University of New Mexico, Central New Mexico Community College, Presbyterian Medical Services, Presbyterian Health Services, the New Mexico Museum of Natural History and Science, Albuquerque Biological Park, and the Petroglyph National Monument. The city is the location of the New Mexico Technology Corridor, a concentration of high-tech private companies and government institutions. Albuquerque is also the home of the International Balloon Fiesta, the world's largest such gathering of hot-air balloons from around the globe, taking place every October.",
        "summary_1s": "Albuquerque ( (listen) AL-bə-kur-kee; Navajo: Beeʼeldííl Dahsinil [pèːʔèltíːl tɑ̀xsɪ̀nɪ̀l]; Eastern Keres: Arawageeki; Jemez: Vakêêke; Zuni: Alo:ke:k'ya ;Jicarilla Apache: Gołgéeki'yé) is the most populous city in the U.S. state of New Mexico and the 32nd-most populous city in the United States, with a census-estimated population of 558,545 in 2017.",
        "attributes": {
            "Country": " United States",
            "State": " New Mexico",
            "County": " Bernalillo",
            "Founded": "1706 (as Alburquerque)",
            "Incorporated": "1891 (as Albuquerque)",
            "Named for": "Francisco Fernández de la Cueva, Duke of Alburquerque",
            "Government  • Type": "Mayor-council government",
            "Government  • Mayor": "Tim Keller (D)",
            "Government  • City Council": "\nCouncilors\n5 Democrats,4 RepublicansKen Sanchez (D)Diane G. Gibson (D)Isaac Benton (D)Cynthia Borrego (I)Bradley Winter (R)Patrick Davis (D)Klarissa J. Peña (D)Trudy Jones (R)Don Harris (R)\n",
            "Government  • State House": "\nRepresentatives\n13 Democrats,11 RepublicansG. Andres Romero (D)Javier Martínez (D)Patricio Ruiloba (D)Eleanor Chavez (D)Patricia Roybal Caballero (D)Miguel Garcia (D)Sarah Maestas Barnes (R)Antonio Maestas (D)Deborah Armstrong (D)Gail Chasey (D)Sheryl M. Williams-Stapleton (D)Jim Dines (R)Stephanie Maez (D)James Smith (R)Paul Pacheco (R)Conrad James (R)Christine Trujillo (D)Georgene Louis (D)Larry Larranaga (R)Jimmie C. Hall (R)David Adkins (R)Nathaniel Gentry (R)William Rehm (R)Monica Youngblood (R)\n",
            "Government  • State Senate": "\nState senators\n7 Republicans,6 DemocratsJohn Ryan (R)Linda Lopez (D)Jerry Ortiz y Pino (D)Dede Feldman (D)Eric Griego (D)H. Diane Snyder (R)Cisco McSorley (D)Mark Boitano (R)Sue Wilson Beffort (R)William H. Payne (R)Kent L. Cravens (R)Joseph J. Carraro (R)Bernadette Sanchez (D)\n",
            "Government  • U.S. House": "\nRepresentative\nMichelle Lujan Grisham (D)\n",
            "Area  • City": "189.5 sq mi (490.9 km)",
            "Area  • Land": "187.7 sq mi (486.2 km)",
            "Area  • Water": "1.8 sq mi (4.7 km)",
            "Elevation": "5,312 ft (1,619.1 m)",
            "Population (2010)  • City": "545,852",
            "Population (2010)  • Estimate (2017)": "558,545",
            "Population (2010)  • Rank": "US: 32nd",
            "Population (2010)  • Density": "2,900/sq mi (1,100/km)",
            "Population (2010)  • Metro": "909,906 (60th)1,171,991 (Albuquerque–Santa Fe–Las Vegas CSA)",
            "Population (2010)  • Ethnicities": "69.7% White4.6% Multiracial4.6% American Indian3.3% Black2.6% Asian46.7% Hispanic",
            "Demonyms": "Albuquerquean,Burqueño",
            "Time zone": "UTC−7 (MST)",
            "Time zone  • Summer (DST)": "UTC−6 (MDT)",
            "ZIP Codes": "87101–87125, 87131,87151, 87153, 87154,87158, 87174, 87176,87181, 87184, 87185,87187, 87190–87199",
            "Area codes": "505, 575",
            "FIPS code": "35-02000",
            "GNIS feature ID": "0928679",
            "Primary Airport": "Albuquerque International SunportABQ (Major/International)",
            "Secondary Airport": "Double Eagle II Airport-KAEG (Public)",
            "Website": "www.cabq.gov"
        }
    },
    {
        "query": "Denver",
        "title": "Denver",
        "pageid": "8522",
        "summary": "Denver (), officially the City and County of Denver, is the capital and most populous municipality of the U.S. state of Colorado. Denver is located in the South Platte River Valley on the western edge of the High Plains just east of the Front Range of the Rocky Mountains. The Denver downtown district is immediately east of the confluence of Cherry Creek with the South Platte River, approximately 12 mi (19 km) east of the foothills of the Rocky Mountains. Denver is nicknamed the Mile High City because its official elevation is exactly one mile (5280 feet or 1609.3 meters) above sea level. The 105th meridian west of Greenwich, the longitudinal reference for the Mountain Time Zone, passes directly through Denver Union Station.\nDenver is ranked as a Beta- world city by the Globalization and World Cities Research Network. With an estimated population of 704,621 in 2017, Denver is the 19th-most populous U.S. city, and with a 17.41% increase since the 2010 United States Census, it has been one of the fastest-growing major cities in the United States. The 10-county Denver-Aurora-Lakewood, CO Metropolitan Statistical Area had an estimated 2017 population of 2,888,227 and is the 19th most populous U.S. metropolitan statistical area. The 12-city Denver-Aurora, CO Combined Statistical Area had an estimated 2017 population of 3,515,374 and is the 15th most populous U.S. metropolitan area. Denver is the most populous city of the 18-county Front Range Urban Corridor, an oblong urban region stretching across two states with an estimated 2017 population of 4,895,589. Denver is the most populous city within a 500-mile (800 km) radius and the second-most populous city in the Mountain West after Phoenix, Arizona. In 2016, Denver was named the best place to live in the United States by U.S. News & World Report.",
        "summary_1s": "Denver (), officially the City and County of Denver, is the capital and most populous municipality of the U.S. state of Colorado.",
        "attributes": {
            "Country": "United States",
            "State": "Colorado",
            "City and County": "Denver",
            "Founded": "November 17, 1858, as Denver City, K.T.",
            "Incorporated": "November 7, 1861, as Denver City, C.T.",
            "Consolidated": "November 15, 1902, as the City and County of Denver",
            "Named for": "James W. Denver",
            "Government  • Type": "Consolidated City and County",
            "Government  • Body": "Denver City Council",
            "Government  • Mayor": "Michael Hancock (D)",
            "Area  • State capital and consolidated city-county": "154.97 sq mi (401.36 km)",
            "Area  • Land": "153.33 sq mi (397.13 km)",
            "Area  • Water": "1.63 sq mi (4.23 km)  1.1%",
            "Area  • Metro": "8,414.4 sq mi (21,793 km)",
            "Elevation": "5,130–5,690 ft (1,564–1,734 m)",
            "Population (2010)  • State capital and consolidated city-county": "600,158",
            "Population (2010)  • Estimate (2017)": "704,621",
            "Population (2010)  • Rank": "US: 19th",
            "Population (2010)  • Density": "4,519.94/sq mi (1,745.15/km)",
            "Population (2010)  • Urban": "2,374,203 (US: 18th)",
            "Population (2010)  • Metro": "2,888,227 (US: 19th)",
            "Population (2010)  • CSA": "3,515,374 (US: 15th)",
            "Demonym(s)": "Denverite",
            "Time zone": "UTC−7 (MST)",
            "Time zone  • Summer (DST)": "UTC−6 (MDT)",
            "ZIP codes": "80201–80212, 80214–80239, 80241, 80243–80244, 80246–80252, 80256–80266, 80271, 80273–80274, 80279–80281, 80290–80291, 80293–80295, 80299, 80012, 80014, 80022, 80033, 80123, 80127",
            "Area code(s)": "303 and 720",
            "FIPS code": "08-20000",
            "GNIS feature ID": "0201738",
            "Major airport": "Denver International Airport",
            "Interstates": "    ",
            "Commuter rail": " A   B ",
            "Rapid transit": " C   D   E   F   H   L   R   W ",
            "Website": "denvergov.org"
        }
    },
    {
        "query": "Minneapolis",
        "title": "Minneapolis",
        "pageid": "6097240",
        "summary": "Minneapolis ( (listen)) is the county seat of Hennepin County and the larger of the Twin Cities, the 16th-largest metropolitan area in the United States. As of 2017, Minneapolis is the largest city in the state of Minnesota and 45th-largest in the United States, with an estimated population of 422,331. The Twin Cities metropolitan area consists of Minneapolis, its neighbor Saint Paul, and suburbs which altogether contain about 3.6 million people, and is the third-largest economic center in the Midwest.Minneapolis lies on both banks of the Mississippi River, just north of the river's confluence with the Minnesota River, and adjoins Saint Paul, the state's capital. The city is abundantly rich in water, with 13 lakes, wetlands, the Mississippi River, creeks and waterfalls; many connected by parkways in the Chain of Lakes and the Grand Rounds National Scenic Byway. It was once the world's flour milling capital and a hub for timber. The city and surrounding region is the primary business center between Chicago and Seattle. In 2011, Minneapolis proper was home to the fifth-highest number of Fortune 500 headquarters in the United States. As an integral link to the global economy, Minneapolis is categorized as a global city.Minneapolis has one of the largest LGBT populations in the U.S. proportional to its overall population. Noted for its strong music and performing arts scenes, Minneapolis is home to both the award-winning Guthrie Theater and the historic First Avenue nightclub. Reflecting the region's status as an epicenter of folk, funk, and alternative rock music, the city served as the launching pad for several of the 20th century's most influential musicians, including Bob Dylan and Prince. More recently, Minneapolis has become noted for its underground and independent hip-hop and rap scenes, producing artists such as Brother Ali, Atmosphere, and Dessa.The name Minneapolis is attributed to Charles Hoag, the city's first schoolmaster, who combined mni, a Dakota Sioux word for water, and polis, the Greek word for city.",
        "summary_1s": "Minneapolis ( (listen)) is the county seat of Hennepin County and the larger of the Twin Cities, the 16th-largest metropolitan area in the United States.",
        "attributes": {
            "Country": "United States",
            "State": "Minnesota",
            "County": "Hennepin",
            "Incorporated": "1867",
            "Founded by": "John H. Stevens and Franklin Steele",
            "Government  • Type": "Weak mayor–council",
            "Government  • Body": "Minneapolis City Council",
            "Government  • Mayor": "Jacob Frey",
            "Government  • Council President": "Lisa Bender",
            "Area  • City": "58.4 sq mi (151.3 km)",
            "Area  • Land": "54.9 sq mi (142.2 km)",
            "Area  • Water": "3.5 sq mi (9.1 km)",
            "Elevation": "830 ft (264 m)",
            "Population (2010)  • City": "382,578",
            "Population (2010)  • Estimate (2017)": "422,331",
            "Population (2010)  • Rank": "US: 46th \nMN: 1st",
            "Population (2010)  • Density": "7,693/sq mi (2,959/km)",
            "Population (2010)  • Metro": "3,600,618 (US: 16th)",
            "Population (2010)  • CSA": "4,197,883 (US: 14th)",
            "Demonym(s)": "Minneapolitan",
            "Time zone": "UTC–6 (CST)",
            "Time zone  • Summer (DST)": "UTC–5 (CDT)",
            "ZIP Codes": "55401–55488 (range includes some ZIP Codes for Minneapolis suburbs)",
            "Area code(s)": "612",
            "FIPS code": "27-43000",
            "GNIS feature ID": "0655030",
            "Major airport": "Minneapolis–Saint Paul International Airport",
            "Public transportation": "Metro Transit",
            "Website": "www.minneapolismn.gov"
        }
    }
]