[
    {
        "query": "Granville, Kyle",
        "title": "Harley Granville-Barker",
        "pageid": "1203880",
        "summary": "Harley Granville-Barker (25 November 1877 – 31 August 1946) was an English actor, director, playwright, manager, critic, and theorist. After early success as an actor in the plays of George Bernard Shaw he increasingly turned to directing and was a major figure in British theatre in the Edwardian and inter-war periods. As a writer his plays, which tackled difficult and controversial subject matter, met with a mixed reception during his lifetime but have continued to receive attention.",
        "summary_1s": "Harley Granville-Barker (25 November 1877 – 31 August 1946) was an English actor, director, playwright, manager, critic, and theorist.",
        "attributes": {
            "Born": "Harley Granville-Barker(1877-11-25)25 November 1877London, England, UK",
            "Died": "31 August 1946(1946-08-31) (aged 68)Paris, French Fourth Republic",
            "Occupation": "Actor, director, playwright",
            "Language": "English",
            "Nationality": "English",
            "Period": "Edwardian era",
            "Genre": "Drama",
            "Notable works": "The Voysey Inheritance, Waste, The Madras House",
            "Spouse": "Lillah McCarthyHelen Huntington"
        }
    },
    {
        "query": "Rhodes, Brian",
        "title": "Brian Rhodes",
        "pageid": "22749771",
        "summary": "Brian Rhodes (23 October 1937 – 1993) was an English football player who played as a goalkeeper.Born in Marylebone, Rhodes played professional football for West Ham United, joining the club as a junior before playing 61 league matches. After leaving West Ham Rhodes joined Southend United where he played 11 matches in 1963 and 1964.\nIn 1964 Rhodes emigrated to Australia where he played for South Coast United and represented the state of New South Wales.\n\n",
        "summary_1s": "Brian Rhodes (23 October 1937 – 1993) was an English football player who played as a goalkeeper.Born in Marylebone, Rhodes played professional football for West Ham United, joining the club as a junior before playing 61 league matches.",
        "attributes": {
            "Date of birth": "\n(1937-10-23)23 October 1937",
            "Place of birth": "\nMarylebone, England",
            "Date of death": "\n1993",
            "Playing position": "\nGoalkeeper",
            "1954–1957": "\nWest Ham United"
        }
    },
    {
        "query": "Fabiny, Mack",
        "title": null,
        "pageid": null,
        "summary": null,
        "summary_1s": null,
        "attributes": null
    },
    {
        "query": "Granville, Brenton",
        "title": "Saint John's Health Center",
        "pageid": "10072475",
        "summary": "Providence Saint John's Health Center, formerly St. Johns Hospital and Health Center, is a private not-for-profit, Roman Catholic hospital in Santa Monica, California, United States.  The hospital was founded in 1942 by the Sisters of Charity of Leavenworth. Providence Saint John’s Health Center has been serving the Santa Monica and Westside communities and has earned a reputation for clinical excellence and award-winning care in a compassionate and tranquil healing environment. In 2014, the hospital was transferred to Providence Health & Services.",
        "summary_1s": "Providence Saint John's Health Center, formerly St.",
        "attributes": {
            "Location": "2121 Santa Monica Boulevard, Santa Monica, California, United States",
            "Care system": "Private",
            "Hospital type": "Community",
            "Affiliated university": "Providence Health & Services",
            "Beds": "234",
            "Founded": "1942",
            "Website": "http://california.providence.org/saint-johns",
            "Lists": "Hospitals in California"
        }
    },
    {
        "query": "Adornetto, Tony",
        "title": "Philadelphia crime family",
        "pageid": "14874526",
        "summary": "The Philadelphia crime family, (pronounced [filaˈdɛlfja]) also known as the Philadelphia Mafia, the Philly Mob/Mafia, or the Philadelphia-South Jersey Mafia, is an Italian-American Mafia family based in Philadelphia, Pennsylvania. Formed and based in South Philadelphia, the criminal organization primarily operates in various areas and neighborhoods in the Greater Philadelphia Metropolitan Area (Delaware Valley) and New Jersey, especially South Jersey. The family is notorious for its violence, due in particular to its succession of violent bosses and multiple mob wars.\nAs the Bruno crime family, under the twenty years reign of boss Angelo Bruno (1959–1980) the family enjoyed an era of peace and prosperity Bruno became known for his cool-headed and deliberate approach to handling business disputes and preferring traditional rackets such as bookmaking, labor racketeering, and loansharking. A complex dispute involving disgruntled subordinates and territory claims by New York's Genovese crime family led to Bruno's murder in 1980. The killing triggered an internal war for control of the Philadelphia family, leading to a gradual decline in the family's power and a rise in mob violence in Philadelphia.\nBruno's death led to an internal war for control of the crime family. Bruno was immediately succeeded by his loyal friend, Philip \"The Chicken Man\" Testa; however, within a year of Bruno's murder, Testa was also assassinated, killed in a nail bomb explosion in 1981. When the dust settled from Bruno's death, Nicodemo \"Little Nicky\" Scarfo became the boss of the crime family. During Scarfo's reign the family was known as the Scarfo crime family. Scarfo's 10-year reign saw the family grow in power, but also become highly dysfunctional. Unlike Bruno, Scarfo was infamous for his short temper and penchant for violence. Scarfo increasingly involved the family in narcotics trafficking and demanded that all criminals pay a street tax for operating in his territory. Scarfo also did not hesitate to order people murdered over moderate disputes. The dramatic rise in violence attracted increased attention from the FBI, Pennsylvania State Police and New Jersey State Police. Increased violence and law enforcement prosecutions also convinced several mobsters to cooperate with the government in order to escape death or prison. Scarfo's downfall came in 1988 when he and most of his top allies were arrested and sentenced to long prison terms.\nScarfo's imprisonment eventually led to another internal mob war. With the backing of the Gambino crime family in New York, John Stanfa was named boss of the Philadelphia family in 1991. However, a faction of young mobsters led by Joey Merlino disputed Stanfa's ascension, and by 1992 yet another war within the family was underway. The war ended in 1994 when Stanfa and most of his supporters were arrested by the FBI. Merlino subsequently took control of the family and has allegedly been running the family to varying degrees ever since. Unlike most of his Mafia contemporaries, Merlino was extremely prolific and never camera-shy, and was frequently seen at local social events. Inevitably, the Philadelphia family has been weakened over the past thirty years due to violence, government turncoats, and law enforcement action following the passage of the RICO Act. Despite this, the family still remains one of the most active Mafia groups in the country.",
        "summary_1s": "The Philadelphia crime family, (pronounced [filaˈdɛlfja]) also known as the Philadelphia Mafia, the Philly Mob/Mafia, or the Philadelphia-South Jersey Mafia, is an Italian-American Mafia family based in Philadelphia, Pennsylvania.",
        "attributes": {
            "Founded by": "Salvatore Sabella",
            "Founding location": "South Philadelphia, Philadelphia, Pennsylvania",
            "Years active": "1911–present",
            "Territory": "Various neighborhoods in Philadelphia, the Greater Philadelphia Area, and New Jersey, including Atlantic City, Wilmington, Trenton, and Delaware County",
            "Ethnicity": "Men of Italian descent. Other ethnicities employed as \"associates\"",
            "Membership .mw-parser-output .nobold{font-weight:normal}(est.)": "40-50 made members approx, 100 associates approx. (2017 estimates)",
            "Criminal activities": "Racketeering Extortion, bookmaking, loan-sharking, gambling and sports betting, fraud, corruption, conspiracy, drug trafficking, money laundering, and murder.",
            "Allies": "Five FamiliesPatriarca crime familyDeCavalcante crime familyK&A GangDetroit PartnershipWarlocks Motorcycle ClubPhiladelphia Greek Mobthe Italian-American 10th and Oregon Crew/GangPagan's Motorcycle ClubBlack MafiaJunior Black Mafia",
            "Rivals": "Hells Angels, various other gangs throughout Philadelphia area, including their allies, occasionally 10th and Oregon Crew/Gang and The Pagans."
        }
    },
    {
        "query": "Caruso, Jon",
        "title": "Caruso (song)",
        "pageid": "2386161",
        "summary": "\"Caruso\" is a song written by Italian singer-songwriter Lucio Dalla in 1986. It is dedicated to Enrico Caruso, an Italian tenor. Following Lucio Dalla's death, the song entered the Italian Singles Chart, peaking at number two for two consecutive weeks. The single was also certified platinum by the Federation of the Italian Music Industry.",
        "summary_1s": "\"Caruso\" is a song written by Italian singer-songwriter Lucio Dalla in 1986.",
        "attributes": null
    },
    {
        "query": "Gleason, Marc",
        "title": "Down to Earth (1947 film)",
        "pageid": "4340003",
        "summary": "Down to Earth (1947) is a musical comedy starring Rita Hayworth, Larry Parks, and Marc Platt, and directed by Alexander Hall. The film is a sequel to the film Here Comes Mr. Jordan (1941), also directed by Hall. While Edward Everett Horton and James Gleason reprise their roles from the earlier film, Roland Culver replaces Claude Rains as Mr. Jordan.",
        "summary_1s": "Down to Earth (1947) is a musical comedy starring Rita Hayworth, Larry Parks, and Marc Platt, and directed by Alexander Hall.",
        "attributes": {
            "Directed by": "Alexander Hall",
            "Produced by": "Don Hartman",
            "Written by": "Harry SegallEdwin Blum",
            "Starring": "Rita HayworthRoland CulverLarry ParksJames GleasonMarc Platt",
            "Music by": "George DuningHeinz RoemheldDoris Fisher (songs)Mario Castelnuovo-Tedesco (Greek ballet)",
            "Cinematography": "Rudolph Mate",
            "Edited by": "Viola Lawrence",
            "Distributed by": "Columbia Pictures",
            "Release date": "August 21, 1947",
            "Running time": "101 minutes",
            "Country": "United States",
            "Language": "English",
            "Box office": "$2.5 million (US rentals)"
        }
    },
    {
        "query": "Klimek, Will",
        "title": "Klimek",
        "pageid": "34300646",
        "summary": "Klimek is a Czech, Polish, and Sorbian surname. Notable people with the surname include:\n\nAlf Klimek (born 1956), American musician\nAntonín Klimek (1937–2005), Czech historian\nArkadiusz Klimek (born 1975), Polish footballer\nIstván Klimek (1913–1988), Hungarian-Romanian footballer\nJan Klimek (born 1953), Polish politician\nJayney Klimek (born 1962), Australian singer\nJohnny Klimek (born 1962), Australian film composer\nLukáš Klimek (born 1986), Czech ice hockey player\nTillie Klimek (1876–1936), American serial killer",
        "summary_1s": "Klimek is a Czech, Polish, and Sorbian surname.",
        "attributes": null
    },
    {
        "query": "Hosking, Jacob",
        "title": "An Evening with Beverly Luff Linn",
        "pageid": "54025193",
        "summary": "An Evening with Beverly Luff Linn is an American-British crime comedy film directed by Jim Hosking. It stars Aubrey Plaza, Emile Hirsch, Jemaine Clement, Matt Berry, and Craig Robinson. \nIt had its world premiere at the Sundance Film Festival on January 20, 2018. It was released in the United States on October 19, 2018, by Universal Pictures, before being released in the United Kingdom on October 23, 2018, by Picturehouse Entertainment.",
        "summary_1s": "An Evening with Beverly Luff Linn is an American-British crime comedy film directed by Jim Hosking.",
        "attributes": {
            "Directed by": "Jim Hosking",
            "Produced by": "\nSam Bisbee\nTheodora Dunlap\nEmily Leo\nOliver Roskill\nLucas Toh\n",
            "Screenplay by": "\nJim Hosking\nDavid Wike\n",
            "Starring": "\nAubrey Plaza\nEmile Hirsch\nJemaine Clement\nMatt Berry\nCraig Robinson\n",
            "Music by": "Andrew Hung",
            "Cinematography": "Nanu Segal",
            "Edited by": "Mark Burnett",
            "Productioncompany ": "\nPark Pictures\nWigwam Films\nRook Films\nFilm4 Productions\nBritish Film Institute\nGPS Film Partners\n ",
            "Distributed by": "\nUniversal Pictures\nPicturehouse Entertainment\n",
            "Release date": "\nJanuary 20, 2018 (2018-01-20) (Sundance)\nOctober 19, 2018 (2018-10-19) (United States)\nOctober 23, 2018 (2018-10-23) (United Kingdom)\n\n\n",
            "Country": "\nUnited States\nUnited Kingdom\n",
            "Language": "English",
            "Box office": "$16,808"
        }
    },
    {
        "query": "Points, Unaccounted",
        "title": null,
        "pageid": null,
        "summary": null,
        "summary_1s": null,
        "attributes": null
    }
]