[
    {
        "query": "New York Cosmos",
        "title": "New York Cosmos (2010)",
        "pageid": "28262005",
        "summary": "The New York Cosmos is an American professional soccer club based in the New York City borough of Brooklyn that played in the North American Soccer League (NASL) from 2013 through 2017. The present formation of the team and organization, established since August 2010, is a rebirth of the original New York Cosmos (1970–1985) that played in the previous North American Soccer League (1968–1984), the former first division of North American soccer. The Cosmos play at MCU Park on the Coney Island boardwalk.\nThe Cosmos' ownership group is headed by chairman Rocco B. Commisso.\nThe team won the Soccer Bowl Trophy in 2013, 2015, and 2016. After a hiatus due to the cancellation of the NASL's 2018 season, the club announced they, along with ten other clubs, would launch a new professional league \"in association with the  National Premier Soccer League\" to begin in 2019.",
        "summary_1s": "The New York Cosmos is an American professional soccer club based in the New York City borough of Brooklyn that played in the North American Soccer League (NASL) from 2013 through 2017.",
        "attributes": {
            "Full name": "New York Cosmos",
            "Short name": "Cosmos",
            "Founded": "August 1, 2010; 8 years ago (2010-08-01)",
            "Stadium": "MCU ParkBrooklyn, New York",
            "Capacity": "7,000",
            "Owner": "New York Cosmos LLC",
            "Chairman": "Rocco B. Commisso",
            "Head Coach": "vacant",
            "League": "New professional league in association with the National Premier Soccer League, to begin in 2019",
            "2017": "Spring: 3rd  Fall: 4th  Combined: 4th  Playoffs: Finals",
            "Website": "Club website"
        }
    },
    {
        "query": "Tampa Bay Rowdies",
        "title": "Tampa Bay Rowdies",
        "pageid": "18199183",
        "summary": "The Tampa Bay Rowdies are an American professional soccer team based in St. Petersburg, Florida, U.S. The club was founded in 2008 and first took the pitch in 2010. Since 2017, the Rowdies have been members of the USL Championship in the second tier of the American soccer pyramid. They formerly played in the North American Soccer League (NASL) (from 2011 to 2016) and USSF Division 2 (in 2010), which were also second-tier leagues. The Rowdies play their home games at Al Lang Stadium on St. Petersburg's downtown waterfront.\nThe current club shares its name, logo, and some of its club culture with the original Tampa Bay Rowdies, who were active from 1975 until 1993, most notably in the original North American Soccer League. The owners of the current club announced their intention to use the old Rowdies' trademarks at its introductory press conference in 2008. However, licensing issues forced the club to use the name FC Tampa Bay until December 2011, when it gained full rights to the Rowdies name and other intellectual property. The current Rowdies have always used the same green and yellow color scheme and \"hoops\" as the original team, even when they could not yet use the Rowdies name.The Rowdies captured the NASL championship in Soccer Bowl 2012, and their team shield includes two stars: one for their 2012 win and one for the 1975 Soccer Bowl championship won by the original Rowdies. The club has had a long-standing rivalry with the Fort Lauderdale Strikers, with whom they have contested the Florida Derby since the original Rowdies and Strikers first met in 1977.\nIn October 2018, the Tampa Bay Rays, the area's Major League Baseball franchise, announced plans to purchase the Rowdies and assume control of Al Lang Stadium.",
        "summary_1s": "The Tampa Bay Rowdies are an American professional soccer team based in St.",
        "attributes": {
            "Full name": "Tampa Bay Rowdies",
            "Nickname(s)": "Rowdies",
            "Founded": "June 18, 2008; 10 years ago (2008-06-18)",
            "Stadium": "Al Lang StadiumSt. Petersburg, Florida",
            "Capacity": "7,500",
            "Owners": "Tampa Bay Rays(Stuart Sternberg)",
            "Head coach": "Neill Collins",
            "League": "USL Championship",
            "2018": "12th, Eastern ConferencePlayoffs: DNQ",
            "Website": "Club website"
        }
    },
    {
        "query": "Carolina RailHawks",
        "title": "North Carolina FC",
        "pageid": "6268056",
        "summary": "North Carolina Football Club (formerly the Carolina RailHawks) is an American professional soccer team in Cary, North Carolina, a suburb of Raleigh. Founded in 2006, the team plays in the USL Championship, the second tier of the American Soccer Pyramid.\nThe team has played its home games at the 10,000-seat WakeMed Soccer Park since 2007. The team's colors are Atlantic blue, cardinal red, and Southern gold. \nOn December 6, 2016, the Carolina RailHawks announced a name change to North Carolina Football Club in pursuit of becoming a Major League Soccer franchise. The club's record home attendance had been broken earlier that year when 10,125 attended a match between against West Ham United of the English Premier League.",
        "summary_1s": "North Carolina Football Club (formerly the Carolina RailHawks) is an American professional soccer team in Cary, North Carolina, a suburb of Raleigh.",
        "attributes": {
            "Full name": "North Carolina Football Club",
            "Founded": "January 26, 2006; 12 years ago (2006-01-26) as Carolina RailHawks",
            "Stadium": "Sahlen's Stadium at WakeMed Soccer ParkCary, North Carolina",
            "Capacity": "10,000",
            "Owner": "Stephen Malik",
            "General manager": "Curt Johnson",
            "Head coach": "vacant",
            "League": "USL Championship",
            "2018": "9th, Eastern ConferencePlayoffs: DNQ",
            "Website": "Club website"
        }
    },
    {
        "query": "Minnesota United FC",
        "title": "Minnesota United FC",
        "pageid": "9114759",
        "summary": "Minnesota United FC is an American professional soccer club based in the Minneapolis–Saint Paul area that plays in the Western Conference of Major League Soccer. The club began play in 2017 as the league's 22nd club, and replaced the North American Soccer League (NASL) franchise of the same name.\nThe club currently plays its home games at TCF Bank Stadium, on the campus of the University of Minnesota in Minneapolis. The club eventually plans to play in Saint Paul (becoming the city's third professional sports team after the Minnesota Wild and Minnesota Whitecaps), at Allianz Field in the Midway neighborhood.Minnesota United FC's ownership is led by Bill McGuire, former CEO of UnitedHealth Group, and includes other Minnesota sports owners: the Pohlad family, owners of the Twins; Timberwolves owner Glen Taylor; former Wild investor Glen Nelson, and his daughter Wendy Carlson Nelson of the Carlson hospitality company.",
        "summary_1s": "Minnesota United FC is an American professional soccer club based in the Minneapolis–Saint Paul area that plays in the Western Conference of Major League Soccer.",
        "attributes": {
            "Full name": "Minnesota United FC",
            "Nickname(s)": "The Loons",
            "Founded": "March 25, 2015; 3 years ago (2015-03-25)",
            "Stadium": "TCF Bank Stadium (2017–2018)Minneapolis, Minnesota\nAllianz Field (2019–)Saint Paul, Minnesota",
            "Capacity": "50,805",
            "Owner": "Bill McGuire",
            "Head coach": "Adrian Heath",
            "League": "Major League Soccer",
            "2018": "Western Conference: 10thOverall: 18thPlayoffs: Did not qualify",
            "Website": "Club website"
        }
    },
    {
        "query": "Indy Eleven",
        "title": "Indy Eleven",
        "pageid": "38251469",
        "summary": "Indy Eleven is an American professional soccer team based in Indianapolis, Indiana. Founded in 2013, the team made its debut in the North American Soccer League in 2014, before moving to the United Soccer League in 2018. The franchise plays its home games at Lucas Oil Stadium, with long-term plans of a new stadium in the city's downtown district.",
        "summary_1s": "Indy Eleven is an American professional soccer team based in Indianapolis, Indiana.",
        "attributes": {
            "Full name": "Indy Eleven",
            "Nickname(s)": "The Boys in Blue",
            "Founded": "2013; 5 years ago (2013)",
            "Stadium": "Lucas Oil StadiumIndianapolis, Indiana",
            "Capacity": "62,421",
            "Owner": "Ersal Ozdemir",
            "President": "Jeff Belskus",
            "Head Coach": "Martin Rennie",
            "League": "USL Championship",
            "2018": "7th, Eastern ConferencePlayoffs: Conference Quarterfinals",
            "Website": "Club website"
        }
    },
    {
        "query": "Jacksonville Armada",
        "title": "Jacksonville Armada FC",
        "pageid": "40071004",
        "summary": "The Jacksonville Armada FC are a professional soccer team based in Jacksonville, Florida. They play in the National Premier Soccer League (NPSL), the fourth tier of the American soccer pyramid, while also retaining their membership in the North American Soccer League (NASL), a league that was in the second tier but postponed its 2018 season. The Armada play their home games at Hodges Stadium on the campus of the University of North Florida.",
        "summary_1s": "The Jacksonville Armada FC are a professional soccer team based in Jacksonville, Florida.",
        "attributes": {
            "Full name": "Jacksonville Armada Football Club",
            "Nickname(s)": "Boys in Blue",
            "Founded": "May 2013; 5 years ago (2013-05)",
            "Stadium": "Hodges Stadium",
            "Capacity": "12,000",
            "Owner": "Robert Palmer",
            "Head coach": "Vacant",
            "League": "\nNorth American Soccer League (on hiatus)\nNational Premier Soccer League\n",
            "Website": "Club website"
        }
    },
    {
        "query": "San Antonio Scorpions",
        "title": "San Antonio Scorpions",
        "pageid": "29080740",
        "summary": "The San Antonio Scorpions were an American professional soccer team based in San Antonio, Texas, United States. Founded in 2010, the team made its debut in the North American Soccer League in 2012. The Scorpions played at Toyota Field, a soccer specific stadium that was completed in 2013.\nThe club operated differently from most professional sports clubs in terms of its operating profit. As part of owner Gordon Hartman's Soccer for a Cause, all net profits from Scorpions operations went towards funding Morgan's Wonderland, a special needs park located in the Longhorn Quarry, next to STAR Soccer Complex and Toyota Field.On December 22, 2015, it was announced that Toyota Field and S.T.A.R. Soccer Complex were sold to the City of San Antonio and Bexar County, a deal which was accompanied by an agreement for Spurs Sports and Entertainment to operate the facilities and field San Antonio FC, which plays in the USL.",
        "summary_1s": "The San Antonio Scorpions were an American professional soccer team based in San Antonio, Texas, United States.",
        "attributes": {
            "Full name": "San Antonio Scorpions Football Club",
            "Nickname(s)": "Scorpions",
            "Founded": "October 4, 2010; 8 years ago (2010-10-04)",
            "Dissolved": "December 22, 2015; 2 years ago (2015-12-22)",
            "Stadium": "Toyota FieldSan Antonio, Texas",
            "Capacity": "8,296",
            "Owner": "Gordon Hartman",
            "League": "North American Soccer League",
            "2015": "Spring: 7th  Fall: 10thCombined: 10th  Playoffs: Did Not Qualify"
        }
    },
    {
        "query": "Fort Lauderdale Strikers",
        "title": "Fort Lauderdale Strikers",
        "pageid": "3098497",
        "summary": "The Fort Lauderdale Strikers were an American professional soccer team based in Fort Lauderdale, Florida founded in 2006, that last played in the North American Soccer League (NASL), the second tier of the American soccer pyramid in 2016. They mostly played their home games in Central Broward Stadium. The Strikers were named after the original Strikers, who played in the old North American Soccer League from 1977 to 1983.\nThe team was known as Miami FC from 2006 until 2011 before re-branding as the Strikers in 2011. They had a fierce in-state rivalry with the Tampa Bay Rowdies.",
        "summary_1s": "The Fort Lauderdale Strikers were an American professional soccer team based in Fort Lauderdale, Florida founded in 2006, that last played in the North American Soccer League (NASL), the second tier of the American soccer pyramid in 2016.",
        "attributes": {
            "Full name": "Fort Lauderdale Strikers",
            "Nickname(s)": "Strikers",
            "Founded": "2006",
            "Dissolved": "2016; 2 years ago (2016)",
            "Owner": "Bill Edwards",
            "League": "North American Soccer League",
            "Website": "Club website"
        }
    },
    {
        "query": "Ottawa Fury FC",
        "title": "Ottawa Fury FC",
        "pageid": "32150986",
        "summary": "Ottawa Fury Football Club is a Canadian professional soccer club based in Ottawa, Ontario. The club competes in the USL Championship and plays its home games at TD Place Stadium.",
        "summary_1s": "Ottawa Fury Football Club is a Canadian professional soccer club based in Ottawa, Ontario.",
        "attributes": {
            "Full name": "Ottawa Fury Football Club",
            "Founded": "June 20, 2011; 7 years ago (2011-06-20)",
            "Stadium": "TD Place Stadium",
            "Capacity": "24,000",
            "Owner": "Ottawa Sports and Entertainment Group",
            "President": "John Pugh",
            "Coach": "Nikola Popovic",
            "League": "USL Championship",
            "2018": "10th, Eastern ConferencePlayoffs: DNQ",
            "Website": "Club website"
        }
    },
    {
        "query": "FC Edmonton",
        "title": "FC Edmonton",
        "pageid": "26139813",
        "summary": "FC Edmonton is a Canadian professional soccer club based in Edmonton, Alberta. The club will compete in the Canadian Premier League in the inaugural 2019 season and play its home games at Clarke Stadium.",
        "summary_1s": "FC Edmonton is a Canadian professional soccer club based in Edmonton, Alberta.",
        "attributes": {
            "Full name": "FC Edmonton",
            "Nickname(s)": "The Eddies",
            "Founded": "November 10, 2009; 9 years ago (2009-11-10)June 8, 2018; 6 months ago (2018-06-08) (refounded)",
            "Stadium": "Clarke Stadium",
            "Capacity": "5,100",
            "Owners": "The Fath Group(Tom and Dave Fath)",
            "General manager": "Jay Ball",
            "Coach": "Jeff Paulus",
            "League": "Canadian Premier League",
            "2017": "NASL, 7th of 8 (combined)",
            "Website": "Club website"
        }
    },
    {
        "query": "Atlanta Silverbacks",
        "title": "Atlanta Silverbacks FC",
        "pageid": "1032084",
        "summary": "The Atlanta Silverbacks FC are an American professional soccer club based in Atlanta, Georgia. Founded in 1998 as Atlanta Ruckus, the club has played in many leagues over the years. The team plays its home games at Atlanta Silverbacks Park, a large soccer complex featuring a 5,000-seat soccer-specific stadium in Atlanta, 15 miles northeast of downtown. The team's colors are red, black, grey, and white.\nThe team's Women's Premier Soccer League counterpart is the Atlanta Silverbacks Women, founded in 2005.",
        "summary_1s": "The Atlanta Silverbacks FC are an American professional soccer club based in Atlanta, Georgia.",
        "attributes": {
            "Full name": "Atlanta Silverbacks Football Club",
            "Nickname(s)": "Silverbacks",
            "Founded": "1998; 20 years ago (1998)",
            "Stadium": "Atlanta Silverbacks ParkAtlanta",
            "Capacity": "5,000",
            "Chairman": "Phoday Dolleh",
            "Manager": "Roberto Neves",
            "League": "National Premier Soccer League"
        }
    }
]