[
    {
        "query": "Rocky Atkinson",
        "title": "Rocky Anderson",
        "pageid": "1068165",
        "summary": "Ross Carl \"Rocky\" Anderson (born September 9, 1951) is an American attorney and politician. He served two terms as the 33rd mayor of Salt Lake City, Utah from 2000–08. He is the Executive Director of High Road for Human Rights and a founding member of the Justice Party.Prior to serving as Mayor, he practiced law for 21 years in Salt Lake City, during which time he was listed in Best Lawyers in America, was rated A-V (highest rating) by Martindale-Hubbell, served as Chair of the Utah State Bar Litigation Section and was Editor-in-Chief of, and a contributor to, Voir Dire legal journal.As mayor, Anderson rose to nationwide prominence as a champion of several national and international causes, including climate protection, immigration reform, restorative criminal justice, LGBT rights, and an end to the \"War on Drugs\". Before and after the invasion by the U.S. of Iraq in 2003, Anderson was a leading opponent of the invasion and occupation of Iraq. Anderson was the only mayor of a major U.S. city who advocated for the impeachment of President George W. Bush, which he did in many venues throughout the United States.Anderson's work and advocacy led to local, national, and international recognition in numerous spheres, including being named by Business Week as one of the top twenty activists in the world on climate change, serving on the Newsweek Global Environmental Leadership Advisory Board, and being recognised by the Human Rights Campaign as one of the top ten straight advocates in the United States for LGBT equality. He has received numerous awards for his work, including the EPA Climate Protection Award, the Sierra Club Distinguished Service Award, the Respect the Earth Planet Defender Award, the National Association of Hispanic Publications Presidential Award, The Drug Policy Alliance Richard J. Dennis Drugpeace Award, the Progressive Democrats of America Spine Award, the League of United Latin American Citizens Profile in Courage Award,  the Bill of Rights Defense Committee Patriot Award, the Code Pink (Salt Lake City) Pink Star honor, the Morehouse College Gandhi, King, Ikeda Award, and the World Leadership Award for environmental programs.Formerly a member of the Democratic Party, Anderson expressed his disappointment with that party in 2011, stating, \"The Constitution has been eviscerated while Democrats have stood by with nary a whimper. It is a gutless, unprincipled party, bought and paid for by the same interests that buy and pay for the Republican Party.\"Anderson announced his intention to run for president in 2012 as a candidate for the newly formed Justice Party. He announced on December 14, 2012, that he would not be running for U.S. Representative in 2014, or for U.S. President again in 2016 after choosing to endorse Bernie Sanders in the Democratic primary.",
        "summary_1s": "Ross Carl \"Rocky\" Anderson (born September 9, 1951) is an American attorney and politician.",
        "attributes": {
            "Preceded by": "Deedee Corradini",
            "Succeeded by": "Ralph Becker",
            "Born": "Ross Carl Anderson (1951-09-09) September 9, 1951 (age 67)Logan, Utah, U.S.",
            "Political party": "Justice (2011–present)",
            "Other politicalaffiliations": "Democratic (1999–2011)",
            "Alma mater": "University of Utah (B.A.)George Washington University Law School (J.D.)",
            "Profession": "Attorney and politician",
            "Website": "www.rockyandersonjustice.com"
        }
    },
    {
        "query": "Tony George",
        "title": "Tony George",
        "pageid": "743662",
        "summary": "Anton Hulman \"Tony\" George (born December 30, 1959) is the chairman and former President and CEO of the Indianapolis Motor Speedway and Hulman & Company, serving from 1989 to 2009. He was also formerly on the Board of Directors of both entities. He founded the Indy Racing League and co-owned Vision Racing.\nTony George's grandfather, Tony Hulman purchased the Indianapolis Motor Speedway at the end of World War II. George is a former driver, having competed in the 1989 Indy Lights championship, finishing 12th in points and capturing 5 top-tens. His mother (Tony Hulman's daughter), Mari Hulman George (1934-2018), formerly served as the speedway's Chairman and delivers its famed \"ladies and gentlemen, start your engines\" public address before every Indianapolis 500 from 1997-2015 and the Brickyard 400 from 1997, 1999-2015. He delivered the command for the 2017 Indy 500 using the \"drivers, start your engines\" command.",
        "summary_1s": "Anton Hulman \"Tony\" George (born December 30, 1959) is the chairman and former President and CEO of the Indianapolis Motor Speedway and Hulman & Company, serving from 1989 to 2009.",
        "attributes": null
    },
    {
        "query": "Joseph D'Amico",
        "title": "Joseph D'Amico",
        "pageid": "11591973",
        "summary": "Joseph D'Amico (born 1955 in Little Italy, Manhattan), also known as \"Joey The Mook,\" was a made man in the Bonanno crime family who later turned government informant. \"Mook\" is Italian-American slang for knucklehead or idiot. D'Amico was a long-time street soldier who worked under his cousin, Richard Cantarella.",
        "summary_1s": "Joseph D'Amico (born 1955 in Little Italy, Manhattan), also known as \"Joey The Mook,\" was a made man in the Bonanno crime family who later turned government informant.",
        "attributes": null
    },
    {
        "query": "Sean Higgs",
        "title": null,
        "pageid": null,
        "summary": null,
        "summary_1s": null,
        "attributes": null
    },
    {
        "query": "Kyle Hunter",
        "title": "Kyle Hunter",
        "pageid": "21061824",
        "summary": "Kyle Hunter (born May 31, 1973) is a male badminton player from Canada who won a bronze medal in the 2003 Pan American Games in Men's Doubles with Mike Beres and in Men's Singles. He was born in Brantford, Ontario and grew up in the town of Paris, Ontario.Kyle was also won the 2003 Canadian National Badminton Championships in Men's Doubles with Mike Beres.\nSince 2007, Kyle has been the Executive Director for Badminton Canada.\n\n",
        "summary_1s": "Kyle Hunter (born May 31, 1973) is a male badminton player from Canada who won a bronze medal in the 2003 Pan American Games in Men's Doubles with Mike Beres and in Men's Singles.",
        "attributes": {
            "Country": "Canada",
            "Born": " (1973-05-31) May 31, 1973 (age 45)Brantford, Ontario"
        }
    }
]