{
    "relation": [
        [
            "Citing Patent",
            "US6561809 *",
            "US6579097 *",
            "US6755653 *",
            "US6945782 *",
            "US6973865",
            "US7052276 *",
            "US7121464",
            "US7275691 *",
            "US7470125 *",
            "US7507089",
            "US7704119 *",
            "US7844183 *",
            "US7922491",
            "US7927102",
            "US8006427",
            "US8046203",
            "US8145382",
            "US8303308",
            "US8459996 *",
            "US8986010 *",
            "US20020010021 *",
            "US20040096806 *",
            "US20040241622 *",
            "US20090305197 *",
            "US20100130097 *",
            "US20120183929 *",
            "US20140065578 *",
            "EP1580517A1 *",
            "EP1643206A1",
            "EP1696198A1 *",
            "EP1737146A1",
            "EP1890104A1 *",
            "WO2005065078A2 *",
            "WO2005093363A1 *",
            "WO2006089947A1 *",
            "WO2008019975A1 *"
        ],
        [
            "Filing date",
            "Jul 17, 2001",
            "Nov 22, 2000",
            "Oct 25, 2001",
            "Mar 22, 2002",
            "Dec 12, 2003",
            "Jan 3, 2002",
            "May 29, 2003",
            "Nov 23, 2004",
            "Feb 15, 2005",
            "Jul 15, 2005",
            "Feb 18, 2005",
            "Jun 22, 2006",
            "Sep 27, 2006",
            "Jan 12, 2006",
            "Jul 29, 2008",
            "Jul 11, 2008",
            "Nov 3, 2008",
            "Feb 24, 2006",
            "Aug 17, 2010",
            "Dec 5, 2012",
            "Sep 6, 2001",
            "Jan 3, 2002",
            "May 29, 2003",
            "Jun 21, 2007",
            "Nov 24, 2009",
            "Aug 17, 2010",
            "Dec 5, 2012",
            "Mar 26, 2004",
            "Oct 2, 2004",
            "Feb 28, 2005",
            "Jun 22, 2005",
            "Aug 18, 2006",
            "Nov 24, 2004",
            "Mar 15, 2005",
            "Feb 24, 2006",
            "Aug 8, 2007"
        ],
        [
            "Publication date",
            "May 13, 2003",
            "Jun 17, 2003",
            "Jun 29, 2004",
            "Sep 20, 2005",
            "Dec 13, 2005",
            "May 30, 2006",
            "Oct 17, 2006",
            "Oct 2, 2007",
            "Dec 30, 2008",
            "Mar 24, 2009",
            "Apr 27, 2010",
            "Nov 30, 2010",
            "Apr 12, 2011",
            "Apr 19, 2011",
            "Aug 30, 2011",
            "Oct 25, 2011",
            "Mar 27, 2012",
            "Nov 6, 2012",
            "Jun 11, 2013",
            "Mar 24, 2015",
            "Jan 24, 2002",
            "May 20, 2004",
            "Dec 2, 2004",
            "Dec 10, 2009",
            "May 27, 2010",
            "Jul 19, 2012",
            "Mar 6, 2014",
            "Sep 28, 2005",
            "Apr 5, 2006",
            "Aug 30, 2006",
            "Dec 27, 2006",
            "Feb 20, 2008",
            "Jul 21, 2005",
            "Oct 6, 2005",
            "Aug 31, 2006",
            "Feb 21, 2008"
        ],
        [
            "Applicant",
            "Battlepaint, Inc.",
            "Cubic Defense Systems, Inc.",
            "Cubic Defense Systems, Inc.",
            "Saab Ab",
            "Raytheon Company",
            "Saab Ab",
            "White Thompkins W",
            "Curtis Wright",
            "The United States Of America As Represented By The Secretary Of The Army",
            "Raytheon Company",
            "Evans Janet E",
            "Saab Ab",
            "Raytheon Company",
            "Raytheon Company",
            "Honeywell International Inc.",
            "Honeywell International Inc.",
            "Greycell, Llc",
            "Saab Ab",
            "Kms Consulting, Llc",
            "Agency For Defense Development",
            "Mccauley Jack Jean",
            "Stefan Davidsson",
            "White Thompkins W.",
            "Korea Elecom",
            "Brandon Giraldez",
            "Kms Consulting Llc",
            "Joon-Ho Lee",
            "Saab Ab",
            "Saab Ab",
            "Saab Ab",
            "Saab Ab",
            "Saab Ab",
            "Tansel Kendir",
            "Ulf Bjoerkman",
            "Saab Ab",
            "Saab Ab"
        ],
        [
            "Title",
            "Virtual battlefield simulator system and method",
            "System and method for training in military operations in urban terrain",
            "System and method for preventing cheating in a simulated combat exercise",
            "Method and arrangement for indicating hits",
            "Dynamic pointing accuracy evaluation system and method used with a gun that fires a projectile under control of an automated fire control system",
            "System and method for combat simulation",
            "Automated projectile delivery system",
            "Artillery fire control system",
            "System and method for training and evaluating crewmembers of a weapon system in a gunnery training range",
            "Methods and apparatus to provide training against improvised explosive devices",
            "Remote control game system with selective component disablement",
            "System and a method for transmission of information",
            "Methods and apparatus to provide training against improvised explosive devices",
            "Simulation devices and systems for rocket propelled grenades and other weapons",
            "Boresighting and pointing accuracy determination of gun systems",
            "Method and apparatus for analysis of errors, accuracy, and precision of guns and direct and indirect fire control mechanisms",
            "Entertainment system including a vehicle",
            "Method and system for fire simulation",
            "Training device for grenade launchers",
            "Airburst simulation system and method of simulation for airburst",
            "Method and device for optical gun interaction with a computer game system",
            "Combat simulation wherein target objects are associated to protecting object by means of a local co-operation between the target objects and the relevant protecting objects",
            "Automated projectile delivery system",
            "Apparatus and System For Simulating of Shooting a Grenade Launcher",
            "Method and apparatus for interactive toy vehicles",
            "Training device for grenade launchers",
            "Airburst simulation system and method of simulation for airburst",
            "System and method for weapon effect simulation",
            "Simulation system, method and computer program",
            "Method and system for fire simulation",
            "A system and a method for transmission of information",
            "A device arranged to illuminate an area",
            "Firearm laser training system and method employing various targets to simulate training scenarios",
            "System and method for weapon effect simulation",
            "Method and system for fire simulation",
            "A device arranged to illuminate an area"
        ]
    ],
    "pageTitle": "Patent US6386879 - Precision gunnery simulator system and method - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6386879?dq=645576",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00331-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483295791,
    "recordOffset": 483270649,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{41485=At trigger pull the shooter/target geometry is determined by a combination of direct optical measurements via the shooter laser scanner transmitter 28, DGPS and optical/RF data links. At trigger pull (TP),the laser scanner transmitter 28 is used to measure the target azimuth (AZ) and super elevation (EL) with respect to the shooter's boresight. Scan duration is much faster than the shot fly-out time (fast enough to prevent overall accuracy degradation). Further details of scanning techniques are disclosed in U.S. Pat. No. 4,218,834 of Hans R. Robertson granted Aug. 26, 1980, the entire disclosure of which is hereby incorporated by reference. The shooter laser scanner transmitter 28 transmits full shooter data in on-target beam dwell time including the TP time, shooter ID, weapon type, ammo type, gun tilt and twist angles, GPS (x,y,z) data, GPS (Vx, Vy, Vz) data, Met data (optional), etc. The data that is optically transmitted is decoded by the electronics in the target tank 14 which are the same as those in the shooter tank 10 and illustrated in FIG. 2. The target tank 14 determines the target AZ and target super EL with resect to the shooter's boresight, either by 1) knowing the trigger pull time and scan rate or 2) decoding the transmitted scan angular position data. Range to the target is determined by comparing the shooter and target GPS coordinates. The orientation of the entire shooter/target geometry with respect to gravity is determined from the DGPS or tilt and twist sensors 72, 74 and 76.}",
    "textBeforeTable": "Patent Citations While we have described preferred embodiments of our system and method, it should be understood that our invention can be modified in both arrangement and detail. Therefore, the protection afforded our invention should only be limited in accordance with the scope of the following claims. In our system, no retro-reflectors are required for measuring target range, AZ and EL with a respect to boresight. No high precision inertial measurement unit is required in order to predict the fall of the shot, i.e. for correcting projectile trajectory. In our system, the ballistic simulation is run at the target tank 14 and DGPS is used for target tracking. The use of an RF data link and GPS leads to much lower cost than prior art gunnery simulator systems. Our system can be used in either in fire and forget or tracking modes. Its hit/miss accuracy is improved over that of prior gunnery simulation systems because of a faster scan rate and because DGPS tracking of the target tank 14 is independent of shot fly-out time. Our system can be used to train in normal, degraded, manual and emergency modes. The user follows the same operational steps involved in firing on a tank with a live round in a combat situation. Our system and method accommodate multiple shooters and multiple targets. The range to target generates gun super EL offset. The target is tracked to generate gun lead offset.",
    "textAfterTable": "US8986010 * Dec 5, 2012 Mar 24, 2015 Agency For Defense Development Airburst simulation system and method of simulation for airburst US20020010021 * Sep 6, 2001 Jan 24, 2002 Mccauley Jack Jean Method and device for optical gun interaction with a computer game system US20040096806 * Jan 3, 2002 May 20, 2004 Stefan Davidsson Combat simulation wherein target objects are associated to protecting object by means of a local co-operation between the target objects and the relevant protecting objects US20040241622 * May 29, 2003 Dec 2, 2004 White Thompkins W. Automated projectile delivery system US20090305197 * Jun 21, 2007 Dec 10, 2009 Korea Elecom Apparatus and System For Simulating of Shooting a Grenade Launcher US20100130097 * Nov 24, 2009 May 27, 2010 Brandon Giraldez Method and apparatus for interactive toy vehicles US20120183929 * Aug 17, 2010",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}