{
    "relation": [
        [
            "Date",
            "Apr 26, 1999",
            "Sep 24, 2002",
            "Jul 13, 2005",
            "Jul 8, 2009",
            "Mar 13, 2013"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: CANON KABUSHIKI KAISHA, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:SUGITA, MITSURO;SUZUKI, AKIYOSHI;MATSUMOTO, TAKAHIRO;REEL/FRAME:009918/0081;SIGNING DATES FROM 19990402 TO 19990405",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6344892 - Exposure apparatus and device manufacturing method using same - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6344892?dq=6,243,373",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00244-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471742811,
    "recordOffset": 471712213,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{82926=FIG. 16 shows an example, wherein the masking blade filter 904′ and a transmission factor control filter are provided, the case of n=2. The masking blade filter 904′ is inserted in place of the masking blade 904 (and the shutter 908) in FIG. 10(A). In the pattern exposure portion 904 a′, a 50% filter is disposed, and the mark exposure portion 904 b′ has a substantially 100% opening, by which the exposure amount ratio is adjusted to be 1:2., 52553=(F) When the next exposure is a projection exposure and not the final exposure, the alignment mark formed in the previous projection exposure and alignment mar exposure stay is used, and the alignment mar latent image detection step and the alignment control step are carried out, and then, the operation returns to the projection exposure alignment mark exposure step, and the exposure is carried out at the exposure position after the alignment control.}",
    "textBeforeTable": "Patent Citations While the invention has been described with reference to the structures disclosed herein, it is not confined to the details set forth and this application is intended to cover such modifications or changes as may come within the purposes of the improvements or the scope of the following claims. By the use of the device manufacturing method according to the present invention, devices can be manufactured with high density and with high precision. When the use is made for the alignment with the latent image of the alignment mark formed with the previous pattern exposure, further improvement in the accuracy is accomplished. Thus, by the use of the exposure device and the mask, the exposure formation of the fine pattern can be accomplished at all times with high precision irrespective of the state of the wafer. As an alternative, the alignment using the latent image detection may be carried out in some of the plurality of exposures, and in the remaining exposure steps, another alignment detection method, for example, that using the alignment mark manufactured beforehand. With such an alignment, a high accuracy alignment not influenced by the state of the wafer is accomplished corresponding to the latent image detection. By the alignment using the detection of the latent image mark formed with the previous exposure pattern, the formation accuracy of the pattern is improved corresponding to the executed steps. For example, the exposure method may",
    "textAfterTable": "JPH06204105A Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6635549 * Sep 25, 2001 Oct 21, 2003 Kabushiki Kaisha Toshiba Method of producing exposure mask US6697698 * Jul 17, 2002 Feb 24, 2004 Hitachi, Ltd. Overlay inspection apparatus for semiconductor substrate and method thereof US6785583 Apr 28, 2003 Aug 31, 2004 Canon Kabushiki Kaisha Management system and apparatus, method therefor, and device manufacturing method US6801827 * Oct 9, 2002 Oct 5, 2004 Hitachi, Ltd. Overlay inspection apparatus for semiconductor substrate and method thereof US6992767 Apr 28, 2003 Jan 31, 2006 Canon Kabushiki Kaisha Management system, apparatus, and method, exposure apparatus, and control method therefor US7010380 Apr 28, 2003 Mar 7, 2006",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}