{
    "relation": [
        [
            "Date",
            "Sep 1, 2011",
            "Dec 17, 2012",
            "Aug 13, 2013",
            "Jun 13, 2014",
            "Jun 25, 2014",
            "Jul 15, 2014",
            "Jul 24, 2014",
            "Jul 30, 2014",
            "Apr 27, 2015"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: CANON INC., JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MOLECULAR IMPRINTS, INC.;REEL/FRAME:026842/0929 Effective date: 20110901",
            "Year of fee payment: 4",
            "Owner name: CANON INC., JAPAN Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE NATURE OF CONVEYANCE FROM AN \"ASSIGNMENT\" TO \"SECURITY AGREEMENT\" PREVIOUSLY RECORDED ON REEL 026842 FRAME 0929. ASSIGNOR(S) HEREBY CONFIRMS THE THE ORIGINAL DOCUMENT SUBMITTED WAS A \"SECURITY AGREEMENT\";ASSIGNOR:MOLECULAR IMPRINTS, INC.;REEL/FRAME:031003/0031 Effective date: 20110901",
            "Owner name: CANON INC., JAPAN Free format text: RELEASE OF SECURITY INTEREST;ASSIGNOR:MOLECULAR IMPRINTS, INC.;REEL/FRAME:033161/0705 Effective date: 20140613",
            "Owner name: MOLECULAR IMPRINTS, INC., TEXAS Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE ASSIGNOR AND ASSIGNEE PREVIOUSLY RECORDED ON REEL 033161 FRAME0705. ASSIGNOR(S) HEREBY CONFIRMS THE ASSIGNMENT;ASSIGNOR:CANON INC.;REEL/FRAME:033227/0398 Effective date: 20140613",
            "Owner name: MII NEWCO, INC., TEXAS Free format text: ASSIGNMENT OF JOINT OWNERSHIP;ASSIGNOR:MOLECULAR IMPRINTS, INC.;REEL/FRAME:033329/0280 Effective date: 20140710",
            "Owner name: CANON NANOTECHNOLOGIES, INC., TEXAS Free format text: CHANGE OF NAME;ASSIGNOR:MOLECULAR IMPRINTS, INC.;REEL/FRAME:033400/0184 Effective date: 20140417",
            "Owner name: MOLECULAR IMPRINTS, INC., TEXAS Free format text: CHANGE OF NAME;ASSIGNOR:MII NEWCO, INC.;REEL/FRAME:033449/0684 Effective date: 20140423",
            "Owner name: MOLECULAR IMPRINTS, INC., TEXAS Free format text: CONFIRMATORY ASSIGNMENT OF JOINT PATENT OWNERSHIP;ASSIGNOR:CANON NANOTECHNOLOGIES, INC.;REEL/FRAME:035507/0559 Effective date: 20150427"
        ]
    ],
    "pageTitle": "Patent US7547398 - Self-aligned process for fabricating imprint templates containing variously ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7547398?dq=7565338",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00177-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475690163,
    "recordOffset": 475657092,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{25527=The above-mentioned may be further employed in imprint lithography processes and systems referred to in U.S. Pat. No. 6,932,934 entitled “Formation of Discontinuous Films During an Imprint Lithography Process;” United States patent application publication 2004/0124566, filed as U.S. patent application Ser. No. 10/194,991 entitled “Step and Repeat Imprint Lithography Processes;” and United States patent application publication 2004/0188381, filed as U.S. patent application Ser. No. 10/396,615, entitled “Positive Tone Bi-Layer Imprint Lithography Method”; and United States patent application publication 2004/0211754, filed as U.S. patent application Ser. No. 10/432,642, entitled “Method of Forming Stepped Structures Employing Imprint Lithography,” all of which are incorporated by reference herein., 17819=An exemplary nano-fabrication technique is commonly referred to as imprint lithography. Exemplary imprint lithography processes are described in detail in numerous publications, such as United States patent application publication 2004/0065976 filed as U.S. patent application Ser. No. 10/264,960, entitled, “Method and a Mold to Arrange Features on a Substrate to Replicate Features having Minimal Dimensional Variability”; United States patent application publication 2004/0065252 filed as U.S. patent application Ser. No. 10/264,926, entitled “Method of Forming a Layer on a Substrate to Facilitate Fabrication of Metrology Standards”; and U.S. Pat. No. 6,936,194, entitled “Functional Patterning Material for Imprint Lithography Processes,” all of which are assigned to the assignee of the present invention and all of which are incorporated by reference herein.}",
    "textBeforeTable": "Patent Citations Embodiments of the present invention described above are exemplary. Many changes and modifications may be made to the disclosure recited above, while remaining within the scope of the invention. Therefore, the scope of the invention should not be limited by the above description, but instead should be determined with reference to the appended claims along with their full scope of equivalent. n, the chromium 409 is removed to yield the final structure. FIG. 4 Referring to m, the exposed structures at the higher plane 406 of elevation may be anisotropically etched downward to a lower plane of elevation (e.g., plane 407) which might be substantially coplanar with other structures. FIG. 4 Referring to l, the resist 410 is removed at this point to improve the performance of the subsequent etch process, as needed. FIG. 4 Referring to k, the chromium 409 is etched from the unmasked portion of the substrate 401. FIG. 4 Referring to j, the substrate 401 may be coated with another thin layer of chromium 409, and the structures that exist at a lower plane 407 of elevation may be masked, e.g., with resist 410. FIG. 4 Referring to i, the resist 404 and chromium 402 may be removed as needed. At this point, the template 401 contains desired local structures,",
    "textAfterTable": "US4921778 Jul 29, 1988 May 1, 1990 Shipley Company Inc. Photoresist pattern fabrication employing chemically amplified metalized material US4932358 May 18, 1989 Jun 12, 1990 Genus, Inc. Perimeter wafer seal US4936465 Sep 15, 1989 Jun 26, 1990 Zoeld Tibor Method and apparatus for fast, reliable, and environmentally safe dispensing of fluids, gases and individual particles of a suspension through pressure control at well defined parts of a closed flow-through system US4957663 Mar 2, 1989 Sep 18, 1990 U.S. Philips Corp. Method of manufacturing optical components US4959252 Oct 10, 1989 Sep 25, 1990 Rhone-Poulenc Chimie Highly oriented thermotropic optical disc member US4964945 Dec 9, 1988 Oct 23, 1990 Minnesota Mining And Manufacturing Company Lift off patterning process on a flexible substrate US4980316 Jul 26, 1989 Dec 25, 1990 Siemens Aktiengesellschaft Method for producing a resist structure on a semiconductor US5003062 Apr 19, 1990 Mar 26, 1991 Taiwan Semiconductor Manufacturing Co.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}