{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,182 topics 2,127,236 replies",
            "85,567 topics 1,154,302 replies",
            "1,071 topics 11,084 replies",
            "4,218 topics 64,773 replies",
            "5,997 topics 75,837 replies",
            "50,560 topics 466,386 replies",
            "22,767 topics 196,359 replies",
            "4,275 topics 60,593 replies",
            "1,127 topics 8,223 replies",
            "3,615 topics 116,103 replies"
        ],
        [
            "Last Post Info",
            "Franklin giving orders in c... By Xing of Virtue 3 minutes ago",
            "Phil Bell appreciation thread By Xing of Virtue A minute ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "Which Vehicle Do You Prefer? By EekhoornSWAG 12 hours ago",
            "Things that can be done at... By Militia 2 hours ago",
            "Your Best Character In Gta... By Phoenix_Poop 23 minutes ago",
            "Reasons why Vice City is be... By Xing of Virtue An hour ago",
            "Grand Theft Auto III Chain... By GTAKid667 An hour ago",
            "What do you hate of GTA 2? By Cerium A day ago",
            "Deadliest Grand Theft Auto... By RandomStunt 8 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=53&t=547993&p=1062294310",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044271733.81/warc/CC-MAIN-20150728004431-00172-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 111070843,
    "recordOffset": 111044530,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9444=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 16662=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 18828=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 20977=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 47849=Google, Bing, MeatSafeMurderer, Khumaro, Stoney0503, Shooter Hex, Google Mobile, Black_MiD, MarshallRawR, Frantz Fuchs, Charmlessrogue, Xing of Virtue, Mrgrandis_HKG, Smooth Longsack, HipsterHillbilly, Pockr001, Yahoo, JRC99, Pavle, GeneralSteve93, Ukeman5, Chao§pawN, hanumana, Pyroshox, HaythamKenway, _CP_, Mr. Fahrenheit, Zorvaine, xTrendSs, The Yokel, Ivan1997GTA, esmittystud101, Captain Sensib1e, LuizLopezIV, s2n vaniish, TalkingPear, Los Santos citizen, CrysisAverted, Insincere, DeucesR, The_Biggest_Ego, Extreme_Wrestler, A-Lonely-Dragon, AsiaAssault, HellCattX, lord tammerlain, gil62291, Stormingz, Slasherr, LeopardGecko, jp9865, Teezo, Warliss, emelen, FrikkenZz, RandomStunt, mrtommygunwhite, DrunkGamer, SilverRST, missanthropy, Tekno_Gecko, SneakyPenguin91, Xenome13, Verstappen, gavin-xx, HexagoN, Jinx., TomVDC, Turan, kadajacs, Sentinel Driver, m8son, Ganton, Spadge007, Bishie, Coleco, icecoldkilla1467, Fox2Quick, Laguezmer, Foppezão, IvanBraginsky, Wombater, Cameron Star, Cico555, SSKYZX, Ezekeil2Ofive17, DaGengster, TG_Stig, BengeyBoy, Epic., Ray, gtaszk, Tacts_21, scaldy78, Markhosdangerous, lunchxbles, shivii, MM4477KK, Lubas, aleex96, Razed-, Gridl0k, size_m, r.lorenzo13, hesselgren, DavidCore89, Dr. Sadler, Fonshway, hoopz71, GTAV112, JoeyDeacan, ReRo, ProSniperLSV, Arazern, cj2000, RayB_ThrowaStack, natetheguitarkid, longhurstgb, JaegerPilot1, VeraVanderpump, kBlaise, RedDagger, TCMike, T.V. Eye, krle2003, Tossin Salad, Darrel, catmandoza, Weazel__03, Fenton, Harry_S_Plinkett, ScarySKRILLEX, senator cashed, CaptainMarvel, Kampret, Icantthinkofonew, niekdbgc, erkwang, PreciousWall, CaptSpalding, Facebook, darkmajesty06, Artful., Dr. MAR!O, CousinBenson65, v1p3r_eddy, bigjpc777, menny, TIMSTER777, Sky_Light12, Dutchboy.., LordRaijin, Huraldo, Azrul_Hafiy, EL_FAPiTaNo_FCB, ol_dirty_b101, Days Are Gone, SuperHolySheep, jollythecat, chrome_24, FutoLover, SupaBrovs, slipstream87, CoCkPuNcH, Harrypug, DavidTheThird, Kippers, indopride, Verdant, slappa-da-bass, Maikou, AztecaEh, tails_prower_2040, doubleg213, alex3, Holo fenix, nodtomc, Sariska, Doktor Gott, m3tal z_DKI, RideEmOut2, Mirage Las Vegas, concolt, qiangqiang101, polivin emil, marhex, SouthfieldGaming, EDDS, a1dopeman, rlr149, Legomanarthur, AboveAndBeyoncé, Lennie., HulioG, Ck Officer, G{}{}@ngsTer, o0eVe0o, nordi, djbel, GerryM, PeppersGhost08, gtamoder1234, NikoB08, GrandMaster Smith, Terroryaki, shadowoperative, thewhitehammer99, Vaymasters, RealGroovyMotion, gizz01, robban, Nerfgoth, Yus, teagle, ClaudeSpeed1911, timason, TreFacTor, MKKJ, -Jacking-, MGT86, Carbonox, nargris, toxluv, Zoolock, waters, NicoC, H52VERGR52VER, dkluin, bama764, guard3, BlackHeartedGovernor, CptAngel, Laz_meister, dbthesuperstar, cohletrain, fastman92, Loc14, PieRGud, StancevD, AndrewDeSanta, evh5150vanhalen, RadioActiveLobster, DOCTOR USS875, The Made Man, Marpmarp, Retired Mafia, iNero, YngDady, lexustt, ire1987, oleg_aka_djmeg, Officer Vic, k2x, 114692=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 12704=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 14250=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 12 minutes ago By Jinx. Facade Corporation 614,726 replies 15,220 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By DeucesR ♥ MISS LOS SANTOS 201... 2,293,156 replies 113,770 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,518 topics 416,596 replies place ped on ground By GeorgeZhang 9 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}