{
    "relation": [
        [
            "Citing Patent",
            "US6961774 *",
            "US7106710",
            "US7280508",
            "US7292558 *",
            "US7372810 *",
            "US7406069",
            "US7864736",
            "US7885232 *",
            "US7903636 *",
            "US7925762 *",
            "US7934088 *",
            "US7953052 *",
            "US7965694",
            "US7983280 *",
            "US20040240452 *"
        ],
        [
            "Filing date",
            "Aug 2, 2001",
            "Dec 28, 2000",
            "Sep 12, 2006",
            "Aug 27, 2002",
            "Jun 14, 2002",
            "Mar 9, 2005",
            "Sep 24, 2007",
            "Feb 9, 2007",
            "Sep 16, 2002",
            "Aug 10, 2000",
            "Mar 31, 2005",
            "Nov 22, 2004",
            "May 14, 2008",
            "Jan 3, 2007",
            "Sep 16, 2002"
        ],
        [
            "Publication date",
            "Nov 1, 2005",
            "Sep 12, 2006",
            "Oct 9, 2007",
            "Nov 6, 2007",
            "May 13, 2008",
            "Jul 29, 2008",
            "Jan 4, 2011",
            "Feb 8, 2011",
            "Mar 8, 2011",
            "Apr 12, 2011",
            "Apr 26, 2011",
            "May 31, 2011",
            "Jun 21, 2011",
            "Jul 19, 2011",
            "Dec 2, 2004"
        ],
        [
            "Applicant",
            "Cisco Technology, Inc.",
            "Cisco Technology, Inc.",
            "Cisco Technology, Inc.",
            "Intel Corporation",
            "Siemens Communications, Inc.",
            "Tcm Mobile Llc",
            "Tcm Mobile Llc",
            "Lg Electronics Inc.",
            "Siemens Aktiengesellschaft",
            "Nokia Corporation",
            "Huawei Technologies Co., Ltd.",
            "Samsung Electronics Co., Ltd.",
            "Tcm Mobile Llc",
            "Huawei Technologies Co., Ltd.",
            "Karl Klaghofer"
        ],
        [
            "Title",
            "System and method for performing hand-offs between internet protocol (IP) core networks in the wireless domain",
            "Separation of packet registration from mobile devices",
            "Separation of packet registration from mobile devices",
            "Method and apparatus for a centralized home agent function",
            "Self managing directory service for voice over IP networks",
            "Wireless packet communications system and method",
            "Packet communication roaming method and system",
            "Mobile communication terminal, method of operating the same in handover rejection and method of rejecting handover in portable internet system",
            "Method for controlling power characteristics in packet-oriented communication networks",
            "Roaming support method and systems in UMTS",
            "Method of secure communication between endpoints",
            "Inter-technology handoff method in an IP-based wireless communication system",
            "Wireless packet communications system and method",
            "Method and system for distributing session key across gatekeeper zones in a direct-routing mode",
            "Method for controllinig power characteristics in packet-oriented communication networks"
        ]
    ],
    "pageTitle": "Patent US6775253 - Adaptive signaling for wireless packet telephony - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6775253?dq=6,263,507",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 15,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00018-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480021687,
    "recordOffset": 479975433,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{103121=Also note that all source hosts connecting to the fixed (shown as encompassed by dashed box 1105 in FIGS. 11A-D), and wireless networks know the new location of MT 1102. There is no need to reroute the path for each individual source node. The triangle routing of the conventional Mobile IP is eliminated and route optimization is done automatically. In addition, the new forwarding address is updated by the first arriving packet, which means the new path may be the one with least congestion or shortest path. The new route pointed to by the forwarding address is the fastest path in the current network condition., 65691=Steps 200-7 and 200-8 of FIG. 3 function in the same manner that steps 200-1 and 2004, respectively, function for FIG. 3. Thus, if activeStation is “true” in the ACF of step 200-8, terminal 302 sends the message of step 200-9 with the H.245 address set to the GK 330-2's address. Therefore, agent 306 in GK 330-2 will be contacted for the H.245 negotiation. If the activeStation is false in the ACF step 200-8, or terminal 302 receives an original ACF without an activeStation field, terminal 302's address will be used in step 200-9. When terminal 301 receives the message of step 200-9 and agent 304 is instantiated, terminal 301 sends an active packet to (i) fill data to agent 304, and (ii) inform agent 304 to perform H.245 procedures; this is a new step for the illustrative embodiment, and is referred to as step 300-9.5. The make-up of this latter active packet, shown in FIG. 4C, has a program portion 410-2 and a data portion 420-2. Program portion 410-2 contains instructions: (i) so that GK 330-1 initiates a program to fill data into the agent; and (ii) triggers agent 304 to commence the H.245 protocol using the priorly defined steps 200-10 through 200-17; data portion 420-2 has data for the H.245 protocol and the address sent in the message of step 200-9. The address informs agent 304 whether agent 306 or the actual mobile terminal 302 should be connected. (It is noted that if only one mobile terminal is active-capable, only one agent is running to communicate with the other actual mobile terminal to perform H.245 negotiation so as to preserve downward compatibility). Similarly, when terminal 302 sends the message of step 200-9 and agent 306 is instantiated, terminal 302 sends an active to (i) fill data to agent 306, and (ii) inform agent 306 to perform H.245 procedures. Assuming both the agents perform handshaking and negotiation on behalf of the mobile terminals, each gatekeeper informs its corresponding mobile terminal of the RTP/RTCP addresses via new step 300-18. The channel is now open for transmission., 108282=Flow diagram 1500 of FIG. 15 illustrates the processing performed by a first-tier device, such as BS 1150 of FIGS. 11A-D, to determine if communications should be re-directed from an original base station (e.g., BS 1155) to a new base station (e.g., BS 1150) as mobile terminal 1102 roams within the subnet. After the ‘start” step of processing block 1505, the first-tier device determines, via decision block 1510, if there is a request from the mobile terminal (MT) to utilize the first-tier device for direct communications. If not, the first-tier device continues to monitor for a MT request. If so, the decisions block 1515 is entered to determine if the first-tier device will/can accept the MT for direct communication—it may not accept the MT due, for instance, to capacity limitations. If this MT cannot be accepted, processing stops via block 1520. If the MT is accepted, the next step in the processing is evidenced by decision block 1525 wherein the first-tier device awaits an active packet (AP) from the mobile terminal. Once the AP is received, an acknowledgement (ACK) is returned to the mobile terminal via processing invoked by block 1530. The AP conveys the time stamp as originated by the MT, and decision block 1535 determines if the time stamp is the same as the time stamp already stored in the Forwarding Table of the first-tier device. If the time stamp is the same (e.g., as determined by the program conveyed in the AP by program part 1210 of FIG. 12 with data contained in data part 1220), the AP undergoes no further processing, as evidenced by “destroy” processing block 1540, and the processing by the first-tier device ends in block 1520., 111197=Flow diagram 1600 of FIG. 16 illustrates the processing performed by a second-tier device, such as BSC 1140 of FIGS. 11A-D, to determine if communications should be re-directed as result of mobile terminal 1102 roaming within the subnet. The processing effected by flow diagram 1600 is a reduced version of that effected by flow diagram 1500 in that there is no “acceptance” phase of the processing, as evidenced by processing blocks 1510 and 1515 of FIG. 15. Accordingly, after the ‘start” step of processing block 1605, the next step in the processing is evidenced by decision block 1610 wherein the second-tier device awaits an active packet (AP) from its associated nodes. Once the AP is received, an acknowledgement (ACK) is returned to the mobile terminal via processing invoked by block 1615. The AP conveys the time stamp as originated by the MT requesting a change of base station, and decision block 1620 determines if the time stamp is the same as the time stamp already stored in the Forwarding Table of the second-tier device. If the time stamp is the same (e.g., as determined by the program conveyed in the AP by program part 1210 of FIG. 12 with data contained in data part 1220), the AP undergoes no further processing, as evidenced by “destroy” processing block 1625, and the processing by the second-tier device ends in block 1655., 47459=One standard, referred to as the H.323 standard, has recently emerged for the signaling and control of VoIP; H.323 is widely deployed in existing corporate, government, and commercial networks. For example, NetMeeting, an H.323-compliant product, was released by Microsoft in 1996. However, although the focus of the illustrative embodiments of the present invention is on H.323, it is clear that the description of the illustrative embodiments provide a framework for other standards/protocols as well., 112679=If the time stamp is to be updated, then the processing path commencing with processing block 1630 is entered. The time stamp is updated in the Forwarding Table (FT), along with the Forwarding Address (i.e., MAC address), in processing block 1635. Next, the AP is duplicated and sent to all adjacent nodes (other second-tier devices) that are directly connected to the second-tier device (e.g., router 1130 of FIGS. 11A-D). Since a second-tier device stores network connectivity information, the second-tier device awaits an acknowledgement (ACK) from each of the other second-tier devices, as evidenced by decision block 1645. If not all ACKs are received, a re-transmission is sent to the other second-tier devices not responding via block 1650. Once all ACKs are received, processing by the second-tier device stops via block 1655., 118824=However, if the GK of new BS is not same as the GK of old BS, then decision block 1820 is entered. This block is necessary for completeness, from the point of view of a GK, to handle a MT that is newly turned-on—if a new MT is energized, then the registration process for the new MT must be completed via processing block 1825. For the MT that is on and migrating, as is the presumed case for the on-going description, the new GK determines if it will accept the MT associated with the new BS, as per processing block of 1835 (e.g., for network loading purposes, the GK may decide to reject the MT). If rejected, a GK Reject (GRJ) must be sent to the MT (processing block 1836) and then the old GK must be informed, via processing block 1840, to stop the “agent” that is carrying out the signaling process. If the MT is accepted, then the following sequence of processing takes place: processing block 1837 sends a GK confirm; processing block 1838 awaits a registration request (RRQ) from the MT; processing block 1839 sends a registration confirmation to the MT; and the MT continues the signaling with new GK and the new GK forwards the signaling message to old GK, as depicted by block 1845. The old GK continues its signaling with the instantiated agent. The signaling messages sent by the old GK are routed to the new location of the MT because of the lower layer handling of mobility. Implicit in the foregoing discussion is the case that if the new BS homes on the old GK, the signaling messages sent by the MT will be routed to the old GK—also because the lower layer protocol(s) takes care of the mobility issue., 100921=The depiction of FIG. 12 shows the program and data parts of an active packet which is emitted by first and second tier devices to mitigate network “flooding” of packets. In particular, program part 1210 conveys instructions to destroy the active packet if the time stamp in the table is the same as the time stamp arriving in the data part 1220. If the time stamps are different, the time stamp in the table is updated and the active packet is then sent to adjacent nodes carrying the information in data part 1220., 116539=With reference to flow diagram 1700, upon “startup” depicted by block 1705, the MT first determines if mobility “handoff” is complete via decision block 1710, that is, the MT determines if it has completed its migration from an old BS to a new BS. If not, the MT awaits completion of handoff. If migration is completed, then the MT sends a GK request (GRQ) associated with the BS upon which the MT now homes, as evidence by processing block 1715—this could be either the old GK or a new GK whereby the MT sends a GRQ to the GK associated with the new BS; in this GRQ, the MT indicates the identifier of the old GK in the nonStandardData field of the GRQ (Appendix D lists the GRQ format). The GK issues either a GK confirm or a GK reject to the MT, which the MT detects via decision block 1720. If the GK accepts the request, then it must be determined if this is the old GK or if a new GK is involved in the process, as per decision block 1725; this is accomplished via a GK identifier passed as part of the “GK confirm” data If the MT homes on the old or “same” GK, then signaling may continue uninterrupted, as depicted by processing block 1730. On the other hand, if the MT now homes on a new GK, then processing block 1735 is invoked to have the MT send a registration request (RRQ) to register with the new GK, 106372=Flow diagram 1400 of FIG. 14 illustrates the processing performed by a mobile terminal, such as terminal 1102 of FIGS. 11A-D, to determine if and when communications should be re-directed from an original base station (e.g., BS 1155) to a new base station (e.g., BS 1150) as mobile terminal 1102 roams within the subnet. After the ‘start” step of processing block 1405, terminal 1102 continues to monitor the received SNR to determine if the SNR is below the predetermined threshold, as evidenced by decision block 1410. If the SNR remains above the threshold, the process of monitoring continues. If the SNR drops below the threshold, then processing block 1415 is entered to effect the “scanning algorith” at the “link layer”, as already discussed earlier. If the scan is not immediately successful in locating a new base station upon which terminal 1102 is to directly communicate, as carried out by decision block 1420, the processes returns to block 1415 wherein scanning for another base station continues. If a new base station has been located, then processing by block 1425 is invoked. Block 1425 sends an active packet (AP) to the new base station so that the new base station may update its forwarding table with the correct MT IP address—MAC address entries, along with the time stamp of this active packet. To ensure that the new base station has received the updated information, decision block 1430 awaits an acknowledgement (ACK) from the new base station. If the ACK is not received within a pre-set time interval, the AP is retransmitted. Once the ACK is received, block 1435 terminates the processing for this phase of operation of terminal 1102., 87799=Besides the MT MAC Address, a MT is also assigned a unique IP address which is utilized by the “IP” layer. Other devices of FIG. 11A also have unique IP addresses; for instance, each BS of FIG. 11A has a specified IP address, as well as each BSC and R. As outlined above, it is supposed that the IP address of MT 1102 is 129.3.2.10, BS 1150 has IP address 129.3.2.2, BS 1155 has IP address 129.3.2.1, BSC 1145 has IP address 129.3.2.3, and BSC 1140 has IP address 129.3.2.4., 99207=The program portion of the active packet then instructs BS 1150 to replicate the active packet and forward the duplicated active packets to all adjacent BSs, BSCs and routers (so-called “first tier” devices) in the same subnet. In FIG. 11B, the only first tier device is BSC 1140. These active packets also carry the original packet generation time, which indicates when the original packet was generated in MT 1102 (as shown in Table 3). These first tier BSs, BSCs or routers will also replicate and forward the active packets to their adjacent BSs, BSCs, and routers (so-called “second tier” devices) in the same subnet. When the replicated active packets arrive at a BS, BSC, or router, the program instructions carried in the replicated active packet also instructs the BS/BSC/router to check the time stamp already stored in the BS, BSC, or router. If the time stamp field of the forwarding table is different with the one in the active packet, the time stamp in each BS, BSC or router is updated. If the time stamp is the same as the one in the active packet, this active packet instructs the BS/BSC/router that no update is necessary and no more packets will be forwarded from this BS, BSC, or router because it has already been visited by an active packet and the forwarding address accurately reflects the current position of MT 1102. This process eliminates excessive packet duplication and forwarding, but still ensures that all BSs, BSCs, and routers in the network have the current forwarding address of MT 1102. Thus new routes (as depicted by the forwarding arrows of FIGS. 11A-D) through the network can be established to reach MT 1102., 101478=The sequence of FIGS. 11A-D shows an example of how this “active address propagation” technique operates. FIG. 11A indicates the routes from MT 1101, wired static host 1106, and wired static host 1107 to MT 1102 before handoff The routes are pointed to by the forwarding address stored in each BS, BSC, and router. FIG. 11B shows the case when MT 1102 just enters the overlap region of BSs 1150 and 1155. Since the active packet may not have propagated to all routers, BSCs and BSs yet, it is possible that only a few of the forwarding addresses have been updated. Therefore, only some routes have been recreated. In FIG. 11B, only BSC 1140 and router 1130 have been reached by an active packet emitted by BS 1150 in response to MT 1102 now homing on BS 1150. Wired static host 1107 routes through BS 1150 to reach MT 1102; the other devices still follow the old forwarding addresses. FIG. 11C indicates that all forwarding addresses have been updated except the old BS, namely, BS 1155. Finally, FIG. 11D shows that all forwarding addresses are updated, and all communication paths are rerouted. Depending on the coverage of the overlap region, the moving speed of a mobile terminal, and the propagation delay, it is possible that the updates are done partially, as those in FIGS. 11B and C, but MT 1102 has already reached the new serving cell. This may require the retransmission of information-bearing packets. However with today's high-speed routers and backbone networks, this is a rare occurrence., 110084=If the time stamp is to be updated, then the processing path commencing with processing block 1545 is entered. The time stamp is updated in the Forwarding Table (FT), along with the Forwarding Address (i.e., MAC address), in processing block 1550. Next, the AP is duplicated and sent to all adjacent nodes (second-tier devices) that are directly connected to the first-tier device (e.g., BSC 1140 of FIGS. 11A-D); here the term “node” is a generic term referring devices such as a base station (BS), a base station controller (BSC), or a router (R). Since a first-tier device stores network connectivity information, the first-tier device awaits an acknowledgement (ACK) from each second-tier device, as evidenced by decision block 1560. If not all ACKs are received, a re-transmission is sent to the second-tier devices not responding via block 1565. Once all ACKs are-received, processing by the first-tier device stops via block 1570., 117930=To complete the description of combined signaling and mobility, reference is now made to flow diagram 1800 of FIG. 18, which depicts the operational steps carried out by a GK when communicating with the roving MT. Upon “startup” per block 1805, the GK monitors for a GK request as per decision block 1810. Since the MT sends the GK identifier in the GRQ request, once a request is received, it is possible via decision block 1815 to determine whether or not the MT is already registered with this GK. If the GK of new BS is same as the GK of old BS (i.e. the MT has already registered with the GK), there is nothing further to be done because the agent represents the MT is still in the same GK The GK just issues GK confirmation via processing block 1850 to the MT, and the unfinished signaling continues via processing block 1855., 95326=The tables are used to translate MT IP Addresses into MAC addresses; thus, with reference to Table 1, any communication received by BS 1155 destined for MT 1102 is directly forwarded to MT 1102 because of the correlation of its IP and MAC addresses. On the other hand, any communication received by BSC 1145 destined for MT 1102 via its IP address is, as set forth in Table 2, first forwarded to BS 1155 (MAC address 20:10:05:E8:A1:B1). When the communication reaches BS 1155, the communication is forwarded directly to MT 1102, as above, with reference to the Table 1 entries. Table 3 illustrates that any communication received by BS 1150 is forwarded to BSC 1140 via its MAC address. By way of notation, the “arrows” in the various devices/components of FIG. 11A show the “forwarding direction” for a communication received by the device/component which is destined for MT 1102. Accordingly, the “down” arrow in BSC 1145 indicates that an incoming message for MT 1102 is passed to BS 1155. Similarly, for example, the “up” arrow in BS 1150 points to BSC 1140 as a forwarding device which will handle a communication destined for MT 1102., 81841=Flow diagram 1000 of FIG. 10 illustrates the processing performed by gatekeeper 330-2 communicating with remote gatekeeper 330-1 as well as associated terminal 302. After the ‘start’ step of processing block 1005, gatekeeper 330-2 awaits the message of step 200-2, as indicated by processing block 1010. Next, processing block 1015 is initiated to send the message of step 200-3. Then processing block 1020 is entered to await the message of step 200-7. Decision block 1025 determines if gatekeeper 330-2 and/or terminal 302 is an activeStation. If not, only the message of step 200-8 is sent via processing block 1030 before processing ends with block 1055. On the other hand, if gatekeeper 330-2 is active, the following sequence of five processing blocks is completed: block 1035 instantiates agent 306; block 1040 sends the message of step 200-8; block 1041 awaits the message of step 300-9.5; block 1045 performs H.245 via steps 200-10 through 200-17; and block 1050 sends the message of step 300-18., 86227=If the search is successful, MT 1102 has roamed to new BS 1150, and now communicates with BS 1150. Otherwise, MT 1102 continues to scan for another BS. Typically, MT 1102 accepts the new BS when the SNR to BS 1150 is a prescribed amount above the pre-determined threshold (e.g., 50%)., 96605=Continuing now with the discussion of roaming whereby MT 1102 homes on BS 1150 rather than BS 1155, after MT 1102 roams successfully to the BS 1150 (MT 1102 may still in the overlap area as exemplified by FIG. 11B), MT 1102 sends an active packet to BS 1150. The instructions carried by the active packet instruct BS 1150 to update its forwarding table stored in BS 1150; an exemplary forwarding table is Table 4 below (the updated counterpart to Table 3)., 85054=To make the discussion more specific (but without loss of generality), as shown in FIG. 11A, two base stations (BSs) 1150 and 1155 usually have overlapping areas (each area is shown as a dashed circle encompassing a corresponding BS) in which mobile terminal (MT) 1102 can transmit and receive signals from both BSs 1150 and 1155. Generally, as MT 1102 moves about, the SNR (signal-to-noise ratio) for each BS as measured by MT 1102 varies. Suppose initially that MT 1102 is communicating with BS 1155. When MT 1102 moves away from BS 1155, the SNR pertaining to BS 1155 decreases. At a certain point in its movement, MT 1102 decides, based upon a pre-determined threshold, that the over-the-air link to its current BS 1155 is poor when the SNR is below the threshold (e.g., 40% of the original SNR ratio). MT 1102 then uses a so-called “scanning algorithm” to search for another BS, which for FIG. 11A is BS 1150. (The scanning algorithm is conventional to a mobile service environment, and it is carried out at the “physical” layer level.), 105137=The high level block diagram of device 1311 is composed of: data and program separator 1312; data memory 1313; processor 1314; program memory 1315; and stored programs memory 1316. Again with reference to FIG. 6, it is clear that device 1311 is another version of components that implement gatekeeper 330-1 for mobility purposes (note that processor 1314 is not illustrated with an ‘agent’). Device 1311 delivers the incoming active packet received over-the-air to separator 1312. The program part of the active packet is stored in program memory 1315; in turn, program part, being directly coupled to stored programs memory 1316, can select the appropriate stored programs for execution in processor 1314. Any data required by the execution of the stored programs can be obtained from data memory 1313, which stores data for each corresponding program part. Active packetizer 1317 generates an active packet in proper format for transmission to other devices connected to device 1311., 75602=Flow diagram 700 of FIG. 7 illustrates the processing performed by terminal 301 of FIG. 3, as the originator, to setup an open channel connection to terminal 302. After the ‘start’ step of processing block 705, terminal 301 sends a message via step 200-1, as exemplified by processing block 710, to gatekeeper 330-1, and awaits a response from gatekeeper 330-1 via the message of step 2004, as depicted by processing block 715. Next, processing block 720 is invoked to determine if gatekeeper 330-1 is an activeStation, and if so, processing by block 745 is then invoked to send a message via step 200-5. A response to this message is expected via step 200-6 of processing block 750, and terminal 301 awaits the response. In the meantime, terminal 302 is determining if it can proceed by interacting with its associated gatekeeper 330-2, so terminal 301 must also await a message via step 200-9, as exhibited by processing block 755, to confirm terminal 302 active status before proceeding. After confirmation of the status of terminal 302 as well as receipt of an H.245 address (namely, gatekeeper 330-2's H.245 address), terminal 301 sends a trigger message to gatekeeper 330-1 via step 300-9.5, as invoked by processing block 760, to inform agent 304 to complete the H.245 protocol on behalf of terminal 301. Finally, terminal 301 awaits the message conveyed by step 300-18, as shown by processing block 765, with the RTP/RTCP information indicative of an opened logical channel. If gatekeeper 330-1 is not an activeStation, then the processing blocks 725 (send of step 200-5), 730 (wait of step 200-6), 735(wait of step 200-9) and 740 (perform H.245 of steps 200-10 through 200-17) are completed in series to arrive at the opened logical channel state. Block 770 ends the processing by terminal 301., 115541=To this end, consider flow diagram 1700 of FIG. 17 which depicts the operational steps carried out by an MT as it moves between subnets. First, recall in the illustrative embodiment for signaling alone, it was presumed for concreteness that each GK had “base station” functionality. For mobility alone, the discussion was couched in terms of base stations and base station controllers rather than gatekeepers. For the discussion of the present section, signaling and mobility principles may be unified since it is readily visualized that more than one BS may now home on a single GK, that is, the GK now has “base station controller” functionality; the agent processes are still carried out in the GK Accordingly, two MT migration situations are possible, namely, (a) the MT moves from an old BS to a new BS served by the original GK; or (b) the MT moves from an old BS served by an old GK to a new BS served by a new GK This terminology is used in the description below., 103981=With reference to FIG. 13, there is shown a high-level block diagram of mobile terminal 1301 (being representative of either mobile terminal 1101 or 1102 of FIGS. 11A-11D) for generating and conveying an active packet from terminal 1301 to base station 1311 (being representative of either BS 1150 or 1155 of FIGS. 11A-11D). In particular, terminal 1301 is composed of processor 1302; program memory 1303; data memory 1304; and active packetizer 1305. The structure and operation of the active packet generation and transmission functions of terminal 1301 is yet another version of terminal 301 of FIG. 6. Whereas terminal 301 is also composed explicitly of packet encoder 601, terminal 1301 does not show such an encoder explicitly (recall the purpose of encoder 601 was that of placing an active packet in a format for the network protocol under consideration, as was exemplified in Appendix C). Active packetizer 1305 effects the proper “protocol packaging” of the active packet., 88328=The MT MAC address (MT link-layer address) and IP address (MT network layer address) of each device (MT, BS, BSC, R) are then used to fill-in tables (called Forwarding Tables) in, for example, BS 1155 and BSC 1145 as exemplified by Table 1 below for BS 1155, Table 2 below for BSC 1145, and Table 3 for BS 1150, presuming that MT 1102 initially homes on BS 1155:, 35736=This application is a non-provisional application of provisional application Ser. No. 60/121,552, filed Feb. 25, 1999. It is also related to Agrawal-Chen applications Ser. Nos. 09/512,514 (now U.S. Pat. No. 6,490,259, Dec. 3, 2002), Ser. No. 09/512,645, and Ser. No. 09/512,646, all filed Feb. 24, 2000., 86573=To explain the next phase of the operation, certain notation must be covered. A wireless network interface card (NIC) of a MT is assigned a unique address by the manufacturer of the particular NIC—this address is called the “MT MAC address” or, equivalently, the “MT MAC identifier” (MT MAC ID), where MAC is the acronym for Medium Access Control; the MAC Address is utilized at the “link” layer. Each MT MAC address usually has 48 bits which can be formatted as follows: “B1:B2:B3:B4:B5:B6”, where B1, B2 . . . is each one byte. Also, since each byte can be treated as containing two 4-bit nibbles, the MT MAC address is such that each nibble can be expressed in hexadecimal. Thus, a typical MT MAC address might be: “18:00:20:E8:42:F6”. Other devices of FIG. 11A also have a unique MAC address or identifier (ID); for instance, each BS of FIG. 11A has a unique MAC address, as well as each Base Station Controller (BSC) and Router (R). It is supposed for later discussion that the MAC address of BS 1150 is 15:15:07:F6:B2:C2;BS 1155 is 20:10:05:E8:A1:B1; BSC 1140 is 35:17:18:19:A2:E4; and BSC 1145 is 05:07:09:F1:D2:D3.}",
    "textBeforeTable": "Patent Citations message. computed integrity check value in the integrityCheckValue field and transmits the field shall be ignored and shall be empty. After computation, the sender puts the secret key upon the entire message. Prior to integrityCheckValue computation, this value is computed by the sender applying a negotiated integrity algorithm and the authentication of the RAS messages. The cryptographically based integrity check integrityCheckValue — Provides improved message integrity/message the RAS messages. integrity — Indicates to the recipient which integrity mechanism is to be applied on algorithmOIDs — supported by the endpoint. authenticationCapability — This indicates the authentication mechanisms cryptoTokens — Encrypted tokens. shall be inserted into the message if available. tokens — This is some data which may be required to allow the operation. The data rasAddress, endpointType, or endpointAlias. alternateEndpoints — A sequence of prioritized endpoint alternatives for terminal. endpointAlias — A list of alias addresses, by which other",
    "textAfterTable": "US6594484 * Dec 17, 1998 Jul 15, 2003 Openwave Systems Inc. Automated access by mobile device to automated telephone information services * Cited by examiner Non-Patent Citations Reference 1 \"A Cellular IP Testbed Demonstrator\", A.T. Campbell, J. Gomez, S. Kim, B. Paul, T. Sawada, C-Y. Wan, A.G. Valko, Turanyi; IEEE, 0-7803-590 4-6/99 1999, pp. 145-148. 2 \"Fast And Scalable Wirless Handoffs in Support of Mobile Internet Audio\", R. Caceres and V.N. Padmanabhan; Mobil Networks and Applications 3 (1998) pp. 351-363. 3 \"IP Mobility Support\", Memo to Network Working Group, Standards Track Category, from C. Perkins, Editor, IBM Oct. 1996; 79 pages. Referenced by Citing Patent Filing date Publication date Applicant Title US6961774 * Aug 2, 2001 Nov 1, 2005 Cisco Technology, Inc. System and method for performing hand-offs between internet protocol (IP) core networks",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}