{
    "relation": [
        [
            "Citing Patent",
            "US6178195 *",
            "US6297767 *",
            "US6456941",
            "US6545631 *",
            "US6658349",
            "US6681158",
            "US6757612 *",
            "US6774869 *",
            "US6853935 *",
            "US6952631",
            "US7053797",
            "US7113107",
            "US7161605 *",
            "US7343165",
            "US7414567 *",
            "US7804981 *",
            "US7898409",
            "US7911379",
            "US7946974",
            "US8054181",
            "US8081108",
            "US8103438",
            "US8126960",
            "US8144000",
            "US8224518",
            "US8239125",
            "US8340836",
            "US8407000 *",
            "US8493206",
            "US8502659",
            "US8514058",
            "US8519844",
            "US8610619 *",
            "US8686851",
            "US8892117",
            "US9075136",
            "US20020015018 *",
            "US20040148067 *",
            "US20040193367 *",
            "US20040254728 *",
            "US20060258420 *",
            "US20110163908 *",
            "WO2003025884A1 *",
            "WO2009078740A2 *",
            "WO2009078740A3 *"
        ],
        [
            "Filing date",
            "May 14, 1998",
            "May 25, 2000",
            "Nov 14, 2001",
            "Oct 17, 2001",
            "May 14, 2002",
            "Sep 19, 2002",
            "Jul 8, 2002",
            "Dec 22, 2000",
            "Mar 28, 2001",
            "Jan 20, 2004",
            "Mar 5, 2003",
            "Mar 5, 2003",
            "Jul 26, 2001",
            "Apr 11, 2001",
            "Dec 22, 2006",
            "Jan 21, 2005",
            "Apr 9, 2008",
            "Aug 18, 2008",
            "Nov 10, 2006",
            "Oct 14, 2010",
            "Jan 7, 2008",
            "Jun 9, 2008",
            "Jul 19, 2001",
            "Sep 26, 2007",
            "Mar 25, 2009",
            "Aug 10, 2011",
            "Nov 22, 2010",
            "May 24, 2010",
            "Jul 30, 2010",
            "Jul 30, 2010",
            "Aug 18, 2008",
            "Jul 30, 2010",
            "Jun 10, 2009",
            "Jun 8, 2011",
            "Mar 10, 2008",
            "Mar 1, 1999",
            "Jul 26, 2001",
            "Jan 20, 2004",
            "Oct 29, 2003",
            "Oct 25, 2002",
            "Jul 14, 2006",
            "Jun 10, 2009",
            "Sep 20, 2002",
            "Dec 17, 2008",
            "Dec 17, 2008"
        ],
        [
            "Publication date",
            "Jan 23, 2001",
            "Oct 2, 2001",
            "Sep 24, 2002",
            "Apr 8, 2003",
            "Dec 2, 2003",
            "Jan 20, 2004",
            "Jun 29, 2004",
            "Aug 10, 2004",
            "Feb 8, 2005",
            "Oct 4, 2005",
            "May 30, 2006",
            "Sep 26, 2006",
            "Jan 9, 2007",
            "Mar 11, 2008",
            "Aug 19, 2008",
            "Sep 28, 2010",
            "Mar 1, 2011",
            "Mar 22, 2011",
            "May 24, 2011",
            "Nov 8, 2011",
            "Dec 20, 2011",
            "Jan 24, 2012",
            "Feb 28, 2012",
            "Mar 27, 2012",
            "Jul 17, 2012",
            "Aug 7, 2012",
            "Dec 25, 2012",
            "Mar 26, 2013",
            "Jul 23, 2013",
            "Aug 6, 2013",
            "Aug 20, 2013",
            "Aug 27, 2013",
            "Dec 17, 2013",
            "Apr 1, 2014",
            "Nov 18, 2014",
            "Jul 7, 2015",
            "Feb 7, 2002",
            "Jul 29, 2004",
            "Sep 30, 2004",
            "Dec 16, 2004",
            "Nov 16, 2006",
            "Jul 7, 2011",
            "Mar 27, 2003",
            "Jun 25, 2009",
            "Aug 20, 2009"
        ],
        [
            "Applicant",
            "Motorola, Inc.",
            "Shimadzu Corporation",
            "William Gutierrez",
            "United Parcel Service Of America, Inc.",
            "James Douglas Cline",
            "Garmin At, Inc.",
            "Oceanit Laboratories, Inc.",
            "Board Of Trustees Operating Michigan State University",
            "Canon Kabushiki Kaisha",
            "Garmin At, Inc.",
            "Taylor Lance G",
            "Taylor Lance G",
            "Komatsu Ltd.",
            "American Calcar Inc.",
            "Intelligent Automation, Inc.",
            "Sensis Corporation",
            "Trimble Navigation Limited",
            "Trimble Navigation Limited",
            "Olivier Lordereau",
            "Trimble Navigation Limited",
            "Trimble Navigation Limited",
            "Trimble Navigation Limited",
            "Silver State Intellectual Technologies, Inc.",
            "Trimble Navigation Limited",
            "Trimble Navigation Limited",
            "Trimble Navigation Limited",
            "Samsung Electronics Co., Ltd.",
            "Rockwell Collins Control Technologies, Inc.",
            "Gravity Jack, Inc.",
            "Gravity Jack, Inc.",
            "Trimble Navigation Limited",
            "Gravity Jack, Inc.",
            "Saab Ab",
            "General Electric Company",
            "Silver State Intellectual Technologies, Inc.",
            "Gtj Ventures, Llc",
            "Mitsuhiro Shimazu",
            "Garmin At, Inc., An Oregon Corporation",
            "Cline James Douglas",
            "Poropat George Vladimir",
            "Mullen Jeffrey D",
            "Saab Ab",
            "United Parcel Service Inc",
            "Air Sports Ltd",
            "Air Sports Ltd"
        ],
        [
            "Title",
            "Method and apparatus for detecting spread spectrum signals using a signal from a secondary source",
            "Rescue target position indicating apparatus",
            "System and method for aircraft and watercraft control and collision prevention",
            "Integrated datalinks in a surveillance receiver",
            "Method and system for marine vessel tracking system",
            "Uninterruptable ADS-B system for aircraft tracking",
            "Phenomenological orbital debris impact risk assessment model and software",
            "Teleportal face-to-face system",
            "Information processing apparatus, mixed reality presentation apparatus, method thereof, and storage medium",
            "Uninterruptable ADS-B system for aircraft tracking",
            "Intelligent selectively-targeted communications systems and methods for aircraft",
            "Intelligent selectively-targeted communications systems and methods",
            "Display device for construction machine",
            "GPS publication application server",
            "ADS-B radar system",
            "Method and system for tracking position of an object using imaging and non-imaging surveillance devices",
            "Circuit for exclusion zone compliance",
            "Construction equipment component location tracking",
            "Biomedical device for treating by virtual immersion",
            "Terrestial-signal based exclusion zone compliance",
            "Autonomous projection of global navigation satellite orbits",
            "Method and system for automatically directing traffic on a site",
            "Technique for effective organization and communication of information",
            "Collision avoidance",
            "Automated recordation of crane inspection activity",
            "Method and system for automatically directing traffic on a site",
            "Intelligent selectively-targeted communications methods",
            "Image augmented inertial navigation system (IAINS) and method",
            "Augmented reality and location determination methods and apparatus",
            "Augmented reality and location determination methods and apparatus",
            "Construction equipment component location tracking",
            "Augmented reality and location determination methods and apparatus",
            "Validity check of vehicle position information",
            "System and method for rapid location of an alarm condition",
            "GPS publication application server",
            "Vehicle operator and/or occupant information apparatus and method",
            "Display device for construction machine",
            "Uninterruptable ADS-B system for aircraft tracking",
            "Method and system for marine vessel tracking system",
            "Collision warning system and method",
            "Systems and methods for location based games and employment of the same on location enabled devices",
            "Validity check of vehicle position information",
            "Uninterruptable ads-b system for aircraft tracking",
            "Vehicle competition implementation system",
            "Vehicle competition implementation system"
        ]
    ],
    "pageTitle": "Patent US6124825 - GPS based augmented reality collision avoidance system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6124825?dq=7,117,286",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00064-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 469118347,
    "recordOffset": 469088059,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{56917=With reference now to FIG. 3, a GPS receiver 304 in accordance with one embodiment of the present invention is shown. GPS receiver 304 receives GPS signals from GPS constellation 206 via antenna 306. The GPS signals are down converted then de-spread and demodulated by the digital signal processor (DSP) and passed to an internal processor which computes the correct pseudo ranges and determines the GPS based 3D position. Information can be communicated to the user via an optional display coupled to the processor and built into GPS receiver 304. The GPS receiver can be configured via an optional user input (e.g., a keyboard or joystick). The GPS based 3D position is communicated to processor unit 303 via communications port 305. Additionally, communications port 305 can be one of many well known interface standards in use in the electronics field (e.g., RS-232, ARINC 429, ARINC 629, Milstd 1553, and the like)., 33769=Radar system 102 sweeps the surrounding airspace with a wide \"surveillance beam\" of radar energy. The radar beam 103 is emitted from a rotating radar antenna, typically at either 1300 or 2800 MHz, and reflects off of the metal skin of the aircraft within its beam width (e.g., aircraft 105). The various radar reflections and the corresponding azimuths of the radar antenna, as is well known, together provide the range, azimuth, and elevation of the various aircraft within the area swept by the radar beam (i.e., the surveillance volume). By observing the locations of aircraft 105-108 over successive sweeps, the various headings and speeds of aircraft 105-108 can be determined., 55027=GPS position determination is based upon a concept referred to as time of arrival (TAO) ranging. The orbiting GPS satellites 201 each broadcast spread spectrum microwave signals encoded with positioning data. The signals are broadcast on two frequencies, L1 at 1575.42 MHz and L2 at 1227.60 MHz, with the satellite ephemeris (positioning data in an earth centered, earth fixed, coordinate system) modulated using bi-phase shift keying techniques. Essentially, the signals are broadcast at precisely known times and at precisely known intervals. The signals are encoded with their precise time of transmission. A user receives the signals with a GPS receiver. The GPS receiver (e.g., GPS receiver 304 of FIG. 3) is designed to time the signals and to demodulate the satellite orbital data contained in the signals. Using the orbital data, the GPS receiver determines the time between transmission by the satellite and reception. Multiplying this by the speed of light gives what is termed the pseudo range measurement of that satellite. If the GPS receiver clock were perfect, this would be the range measurement for that satellite, but the imperfection of the clock causes them to differ by the time offset between actual time and receiver time. Thus, the measurement is called a pseudo range, rather than a range. However, the time offset is common to the pseudo range measurements of all the satellites. By determining the pseudo ranges of four or more satellites, the GPS receiver is able to determine its 3D location, as well the time offset. In this manner, the system of the present invention determines the 3D location of the user with great accuracy. Each neighboring aircraft equipped with GPS squitter avionics similarly determines their respective 3D locations and broadcasts them, in the manner described above, enabling the process of the present invention., 30288=This is a continuation of copending application Ser. No. 08/897,663 filed on Jul. 21, 1997 which is hereby incorporated by reference to this specification., 30899=Air travel and air commerce have become virtually indispensable to the economies of the industrialized nations. Many different facets of business, industry, government, and the overall public depend upon goods and services delivered via aircraft. Air transportation has become as common and ubiquitous to the modern world as the rail roads of many decades past. Reflecting their importance to modern commerce, the Federal Aviation Administration (FAA) recently estimated that by the year 1990, there were approximately 265,000 registered general aviation aircraft in the United States alone. In addition to general aviation aircraft, there were approximately 6000 commercial carrier aircraft in use as well. These aircraft made use of 17,500 airports, of which 5200 were in public use. The aviation industry plays an enormous and indispensable role in the national economy and interstate commerce. As such, the safe and efficient use of the national airspace plays an equally important role., 77016=In accordance with the present embodiment, aircraft 550 uses GPS receiver 304 to determine its instantaneous present position with respect to the ECEF coordinate system. The velocity and direction of flight is determined through successive GPS position fixes. Since GPS positions are determined via received GPS signals, the resulting positions are actually the positions of GPS antenna 306. The orientation of aircraft 550 with respect to the x, y, and z axis is determined through differential phase measurements of GPS signals received via GPS antenna 306. Differential phase measurement technology functions by accurately determining the attitude of aircraft 550 with respect to the x, y, and z axis of the ECEF coordinate system. Those desiring additional details regarding GPS differential phase measurement for attitude determination are referred to U.S. Pat. No. 5,268,695 \"DIFFERENTIAL PHASE MEASUREMENT THROUGH ANTENNA MULTIPLEXING\" issued Dec. 7, 1993 to Dentinger, et al., U.S. Pat. No. 5,296,861 \"METHOD AND APPARATUS FOR MAXIMUM LIKELIHOOD ESTIMATION DIRECT INTEGER SEARCH IN DIFFERENTIAL CARRIER PHASE ATTITUDE DETERMINATION SYSTEMS\" issued Mar. 22, 1994 to Knight, and U.S. Pat. No. 5,561,432 \"OUT OF PLANE ANTENNA VECTOR SYSTEM AND METHOD\" issued Oct. 1, 1996 to Knight, which are each incorporated herein as background material. Once the position and attitude of aircraft 550 is known, the present invention can determine the position and attitude of user 402.}",
    "textBeforeTable": "Patent Citations The foregoing descriptions of specific embodiments of the present invention have been presented for purposes of illustration and description. They are not intended to be exhaustive or to limit the invention to the precise forms disclosed, and obviously many modifications and variations are possible in light of the above teaching. The embodiments were chosen and described in order to best explain the principles of the invention and its practical application, to thereby enable others skilled in the art to best utilize the invention and various embodiments with various modifications as are suited to the particular use contemplated. It is intended that the scope of the invention be defined by the Claims appended hereto and their equivalents. Thus, the GPS based AR aircraft collision avoidance system of the present invention provides an air traffic alert and collision avoidance system which has the accuracy and reliability of GPS and is compatible with current flight regimes, such as, for example, flying VFR, flying IFR, and the like. The system of the present invention provides a properly equipped aircrew with a visual and intuitive means of insuring aircraft safe separation. The system of the present invention allows the aircrew to visually cross check air traffic alerts from either GPS squitter avionics or air traffic controller communications. The system of the present invention is fully functional in differing weather conditions, even in flight in full IMC. The system of the present",
    "textAfterTable": "US8892117 Mar 10, 2008 Nov 18, 2014 Silver State Intellectual Technologies, Inc. GPS publication application server US9075136 Mar 1, 1999 Jul 7, 2015 Gtj Ventures, Llc Vehicle operator and/or occupant information apparatus and method US20020015018 * Jul 26, 2001 Feb 7, 2002 Mitsuhiro Shimazu Display device for construction machine US20040148067 * Jan 20, 2004 Jul 29, 2004 Garmin At, Inc., An Oregon Corporation Uninterruptable ADS-B system for aircraft tracking US20040193367 * Oct 29, 2003 Sep 30, 2004 Cline James Douglas Method and system for marine vessel tracking system US20040254728 * Oct 25, 2002 Dec 16, 2004 Poropat George Vladimir Collision warning system and method US20060258420 * Jul 14, 2006 Nov 16, 2006 Mullen Jeffrey D Systems and methods for location based games and employment of the same on location enabled devices US20110163908",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}