{
    "relation": [
        [
            "Citing Patent",
            "US7012384 *",
            "US7187301 *",
            "US7375650 *",
            "US7443315 *",
            "US7667617",
            "US7796053 *",
            "US7855660 *",
            "US9064411 *",
            "CN1745403B",
            "WO2005093684A1 *",
            "WO2006000097A1 *",
            "WO2007108613A1 *"
        ],
        [
            "Filing date",
            "Jan 23, 2003",
            "Jul 20, 2004",
            "Aug 26, 2005",
            "Feb 27, 2004",
            "Aug 25, 2006",
            "Jun 27, 2005",
            "Jun 12, 2006",
            "Feb 27, 2013",
            "Feb 27, 2004",
            "Feb 27, 2004",
            "Jun 27, 2005",
            "Mar 16, 2007"
        ],
        [
            "Publication date",
            "Mar 14, 2006",
            "Mar 6, 2007",
            "May 20, 2008",
            "Oct 28, 2008",
            "Feb 23, 2010",
            "Sep 14, 2010",
            "Dec 21, 2010",
            "Jun 23, 2015",
            "Jan 19, 2011",
            "Oct 6, 2005",
            "Jan 5, 2006",
            "Sep 27, 2007"
        ],
        [
            "Applicant",
            "Toyoda Gosei Co., Ltd.",
            "Guixian Lu",
            "Teddy Yeung Man Lo",
            "Teddy Yeung Man Lo",
            "Teddy Yeung Man Lo",
            "Persio Walter Bortolono",
            "Jong Hae Kim",
            "Hezekiah Patton, Jr.",
            "罗扬文",
            "Teddy Yeung Man Lo",
            "Persio Walter Bortolotto",
            "Jin-Gu Park"
        ],
        [
            "Title",
            "Illumination device for vehicle compartment",
            "Traffic light prediction system",
            "LED traffic light",
            "LED traffic light",
            "Interactive bulletin board system and method",
            "Traffic light with timer information",
            "Multipurpose LED signal system for pedestrian and traffic control",
            "Traffic light illumination duration indicator",
            "LED traffic lamp",
            "Led traffic light",
            "Traffic light with timer information",
            "Display control system of traffic light and display method"
        ]
    ],
    "pageTitle": "Patent US6552668 - Attachment to traffic light apparatus for visual indication of traffic light ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6552668?dq=6519629",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00309-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478580119,
    "recordOffset": 478560308,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22731=U.S. Pat. No. 5,726,648 issued in 1998 to M. Soon describes a time indicating traffic light that includes a vertically-oriented and rectangular-parallelepiped-shaped housing, a circular-shaped “stop” indicator light, a circular-shaped “caution” indicator light, seven rectangular-shaped “go” indicator lights, and a time indicating display. The circular-shaped “stop” indicator light, the circular-shaped “caution” indicator light, and the seven rectangular-shaped “go” indicator lights are disposed in the vertically-oriented and rectangular-parallelepiped-shaped housing. The seven rectangular-shaped “go” indicator lights have a pair of parallel, elongated, spaced-apart, vertically-oriented, and rectangular-shaped “go” indicator lights, and five adjacent, slightly vertically spaced-apart, horizontally-oriented, and rectangular-shaped “go” lights. The five adjacent, slightly vertically spaced-apart, horizontally-oriented, and rectangular-shaped “go” lights extinguish progressively upwardly towards the circular-shaped “caution” indicator light at a predetermined rate determined by a timer while the pair of parallel, elongated, spaced-apart, vertically-oriented, and rectangular-shaped “go” indicator lights remain illuminated when at least one light of the five adjacent, slightly vertically spaced-apart, horizontally-oriented, and rectangular-shaped “go” lights is illuminated. The time indicating display is disposed on the vertically-oriented and rectangular-parallelepiped-shaped housing and provides a visible display of the time of illumination of the seven rectangular-shaped “go” indicator lights, so that an approaching vehicle can determine when the circular-shaped “caution” indicator light will be illuminated by dividing the time of illumination on the time indicating display by the number of lights of the five adjacent, slightly vertically spaced-apart, horizontally-oriented, and rectangular-shaped “go” lights extinguished and thereby prevent sudden acceleration followed by a sudden stop., 21580=U.S. Pat. No. 4,590,455 issued in 1986 to G. Fritzinger teaches a traffic control system that has green and/or red signal lights blinked momentarily at a predetermined interval before the direction of traffic is changed. A marker is placed along the roadway at a normal distance of travel within the timing of the blink signal to enable motorists to gauge their driving to save gasoline and achieve greater safety solely by noting their location relative to the marker when the blink signal occurs. Further taught is the use of the traffic signaling system in connection with a semi-actuated controller that has a synchronizer providing a background cycle. The timing of the blink signal and the yellow caution signal is obtained from the synchronizer. A disadvantage of this device is that blinking of the green signal may cause confusion, whereas blinking of the red signal is already equivalent to a stop signal and may not be understood as an indicator of the approaching switch in the traffic direction. Furthermore, an addition of a marker on the road at the approach to the traffic light may distract the driver's attention., 25639=U.S. Pat. No. 6,087,962 issued in July 2000 to Hector R. Rojas describes an electric traffic light, with acoustic signs and with an indication of backward counting which includes lights prepared in three sectors with signaling screens that are controlled by a processor electrically linked to an optic and numeric counter. The circuit of optic formation is programmed in sequence and time to emit activation signals to certain sections of the lights to provide the brightness of the light on each screen. The circuit of the numeric formation is programmed to send signals of interruption of the power supply, simultaneously with the optic circuit, to certain sectors of the lights to provide visualization of numbers. Further, simultaneously with the optic and numeric circuit, a sound emitter emits a sound with each color., 26838=The applicant of the present patent application has invented an attachment to a traffic light apparatus for visual indication of traffic light duration, which is disclosed in pending U.S. patent application Ser. No. 09/300,875 filed on Apr. 28, 1999 and for which a notice of allowance has been received., 19394=For example, U.S. Pat. No. 4,255,737 issued in 1981 to R. Casteel teaches a traffic light apparatus, that has a four-sided housing, each side of which contains red and green areas that can be illuminated. Furthermore, each side contains a rotating semicircular mask which simultaneously and progressively covers one portion of one of the colored areas and uncovers a portion of the other colored area until the illumination of the traffic light is changed, thereby causing a change in traffic flow. The rotation of the masks together with the actuation of the various lights is controlled from a common ring gear disposed within the housing and driven by a single motor. A disadvantage of this device is that it incorporates the traffic light covering/uncovering means directly into the traffic light apparatus. In other words, for introducing such a device into practice, it would be required to replace all existing conventional traffic lights, which is not only expensive but may increase the occurrence of accidents because of confusion caused by new appearance of the traffic lights. Another disadvantage of the aforementioned traffic light apparatus is that it has a complicated mechanical construction with a plurality of interconnected moving parts. These parts operate synchronously and simultaneously in four opposite directions. Traffic light apparatuses of this type have to be suspended from a console or another type support above the center of the intersection. However, in a majority of cases, traffic lights of such type have been replaced by apparatuses installed on the corners of the street crossings and having signals facing only the oncoming traffic. Therefore the aforementioned device of U.S. Pat. No. 4,255,737 may find only an extremely limited practical application. Furthermore, this apparatus is not applicable to intersections, which require different traffic signals for vehicles going in mutually opposite directions, e.g., a red light in one direction and a left turn/green light for the vehicle going in the opposite direction. It would be very difficult to adjust and change the mode of operation in the above-described apparatus.}",
    "textBeforeTable": "Patent Citations Although the invention has been described and illustrated with reference to specific embodiments, it is understood that these embodiments should be construed as limiting the scope of application of the invention and that any modifications and changes are possible, provided they do not depart from the scope of patent claims. For example, the lamps can be arranged in a pattern different from those described in this patent application. Lamps of different types can be used, as well as two or more lamps can be installed in each cell. The device itself can be installed in any location convenient for observation. The rows of lamps can be switched off from right to the left, from bottom to the top, on in a diagonal direction. The cells may have a round or any other cross section. The colored cells can be arranged not only in a regular pattern, but in irregular pattern as well. Thus it has been shown that the invention provides an attachment to traffic light apparatus for visual indication of traffic light duration, which is simple in construction, is free of moving parts, ensures sequential indication of traffic light duration signs of different colors over the entire length of the indication panel an therefore can be made with large dimensions, and can be installed in any convenient location irrespective of the position of the traffic light apparatus. In the embodiment of FIG. 9, the cells",
    "textAfterTable": "Filing date Publication date Applicant Title US7012384 * Jan 23, 2003 Mar 14, 2006 Toyoda Gosei Co., Ltd. Illumination device for vehicle compartment US7187301 * Jul 20, 2004 Mar 6, 2007 Guixian Lu Traffic light prediction system US7375650 * Aug 26, 2005 May 20, 2008 Teddy Yeung Man Lo LED traffic light US7443315 * Feb 27, 2004 Oct 28, 2008 Teddy Yeung Man Lo LED traffic light US7667617 Aug 25, 2006 Feb 23, 2010 Teddy Yeung Man Lo Interactive bulletin board system and method US7796053 * Jun 27, 2005 Sep 14, 2010 Persio Walter Bortolono Traffic light with timer information US7855660 * Jun 12, 2006 Dec 21, 2010 Jong Hae Kim Multipurpose LED signal system for pedestrian and traffic control US9064411",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}