{
    "relation": [
        [
            "Cited Patent",
            "US3698075 *",
            "US3709424 *",
            "US3761675 *",
            "US3793714 *",
            "US3903363 *",
            "US4209355 *",
            "US4396457 *",
            "JPS56118345A *"
        ],
        [
            "Filing date",
            "Nov 5, 1969",
            "Feb 19, 1971",
            "Jan 19, 1972",
            "May 27, 1971",
            "May 31, 1974",
            "Jul 26, 1978",
            "Mar 17, 1982",
            ""
        ],
        [
            "Publication date",
            "Oct 17, 1972",
            "Jan 9, 1973",
            "Sep 25, 1973",
            "Feb 26, 1974",
            "Sep 2, 1975",
            "Jun 24, 1980",
            "Aug 2, 1983",
            ""
        ],
        [
            "Applicant",
            "Motorola Inc",
            "Signetics Corp",
            "Hughes Aircraft Co",
            "Texas Instruments Inc",
            "Western Electric Co",
            "National Semiconductor Corporation",
            "E. I. Du Pont De Nemours And Company",
            ""
        ],
        [
            "Title",
            "Ultrasonic metallic sheet-frame bonding",
            "Integrated circuit bonder",
            "Material cutting and printing system",
            "Integrated circuit assembly using etched metal patterns of flexible insulating film",
            "Automatic positioning system and method",
            "Manufacture of bumped composite tape for automatic gang bonding of semiconductor devices",
            "Method of making bumped-beam tape",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US4551912 - Highly integrated universal tape bonding - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4551912?dq=6,263,507",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00324-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481996703,
    "recordOffset": 481975981,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While this invention has been described relative to its preferred embodiment, it is apparent that modifications of this subject matter can be practiced without departing from the essential scope of this invention. For example, using multiple heads in addition to processing one assembly, parallel bonding of different patterns can be accomplished under common computer control. Similarly multiple patterns may be cut in parallel from a width of foil using multiple laser cutters. Multiple cuts may also be made in stacked foils. The present invention therefore offers important advantages over conventional T.A.B. or wire bonding techniques. It allows the integration of bumped chips utilizing personalized tape of aluminum or other adaptable clad structure cut from a blank metal. By utilizing a laser system, personalization on a computer controlled basis is immediately tailored to the bump configuration on the chip. Thus, the laser cutter is a generic tool which can be adapted under computer control to cut any desired pattern. Similarly, the step spot ultrasonic bonder is also a generic tool for accomplishing a step-by-step bonding more expeditiously than used in previous wire bonding techniques. The use of a single probe offers important economic advantages since the probe can be used to step bond any personalized tape finger configuration under appropriate computer command. FIG. 4 illustrates in plan view a clad metal tape 14 having an aluminum inlay 42 disposed at the finger area. This aluminum inlay is",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4707418 * Jun 26, 1985 Nov 17, 1987 National Semiconductor Corporation Nickel plated copper tape US4980219 * Mar 31, 1989 Dec 25, 1990 Casio Computer Co., Ltd. Carrier tape for bonding IC devices and method of using the same US5019209 * Sep 10, 1990 May 28, 1991 Casio Computer Co., Ltd. Method of manufacturing and using a carrier tape for bonding IC devices US5034591 * Dec 21, 1989 Jul 23, 1991 Amdahl Corporation Tape automated bonding leads having a stiffener and a method of bonding with same US5134460 * Nov 2, 1990 Jul 28, 1992 International Business Machines Corporation Aluminum bump, reworkable bump, and titanium nitride structure for tab bonding US5153707 * Nov",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}