{
    "relation": [
        [
            "Citing Patent",
            "US7834864 *",
            "US7922899 *",
            "US8021045 *",
            "US8228347",
            "US8286079 *",
            "US8396188",
            "US8432417",
            "US8500645",
            "US8576986",
            "US8600299 *",
            "US8768035",
            "US8937630",
            "US9021358 *",
            "US9032292",
            "US20080110261 *",
            "US20080114250 *",
            "US20090312638 *",
            "US20090318808 *",
            "US20110118562 *",
            "US20120123227 *",
            "US20120179039 *",
            "US20130237811 *",
            "US20140282018 *",
            "WO2009135255A1 *",
            "WO2011156815A1 *",
            "WO2014165662A2 *"
        ],
        [
            "Filing date",
            "Feb 16, 2007",
            "Jun 9, 2005",
            "Oct 20, 2009",
            "May 8, 2007",
            "Sep 19, 2006",
            "Jan 21, 2011",
            "Jul 11, 2012",
            "Apr 10, 2008",
            "Jan 21, 2011",
            "Nov 10, 2006",
            "Apr 27, 2011",
            "Apr 26, 2013",
            "Mar 14, 2014",
            "Jan 19, 2012",
            "Nov 10, 2006",
            "Nov 10, 2006",
            "Jul 16, 2007",
            "May 18, 2009",
            "",
            "Nov 11, 2010",
            "",
            "Mar 7, 2013",
            "Mar 14, 2014",
            "May 5, 2009",
            "Jun 13, 2011",
            "Apr 3, 2014"
        ],
        [
            "Publication date",
            "Nov 16, 2010",
            "Apr 12, 2011",
            "Sep 20, 2011",
            "Jul 24, 2012",
            "Oct 9, 2012",
            "Mar 12, 2013",
            "Apr 30, 2013",
            "Aug 6, 2013",
            "Nov 5, 2013",
            "Dec 3, 2013",
            "Jul 1, 2014",
            "Jan 20, 2015",
            "Apr 28, 2015",
            "May 12, 2015",
            "May 15, 2008",
            "May 15, 2008",
            "Dec 17, 2009",
            "Dec 24, 2009",
            "May 19, 2011",
            "May 17, 2012",
            "Jul 12, 2012",
            "Sep 12, 2013",
            "Sep 18, 2014",
            "Nov 12, 2009",
            "Dec 15, 2011",
            "Oct 9, 2014"
        ],
        [
            "Applicant",
            "Photon Technology International, Inc.",
            "Gambro Lundia Ab",
            "Carestream Health, Inc.",
            "C. R. Bard, Inc.",
            "Siemens Medical Solutions Usa, Inc.",
            "General Electric Company",
            "C. R. Bard, Inc.",
            "C. R. Bard, Inc.",
            "General Electric Company",
            "Siemens Medical Solutions Usa, Inc.",
            "General Electric Company",
            "C. R. Bard, Inc.",
            "eagleyemed, Inc.",
            "Blackberry Limited",
            "Penrith Corporation",
            "Penrith Corporation",
            "Signostics Pty Ltd",
            "Brader Eric William",
            "B-K Medical Aps",
            "Bayer Healthcare Llc",
            "Laurent Pelissier",
            "Speir Technologies Inc.",
            "Eagleyemed",
            "Signostics Pty Ltd",
            "The Methodist Hospital Research Institute",
            "Butterfly Network, Inc."
        ],
        [
            "Title",
            "System and method comprising a user interface for control of scientific image acquisition",
            "Medical apparatus and method for setting up a medical apparatus",
            "Integrated portable digital X-ray imaging system",
            "User interface and methods for sonographic display device",
            "Context aware user interface for medical diagnostic imaging, such as ultrasound imaging",
            "X-ray system and method for producing X-ray image data",
            "User interface and methods for sonographic display device",
            "Low power ultrasound system",
            "X-ray system and method for sampling image data",
            "Transducer array imaging system",
            "X-ray system and method for processing image data",
            "User interface and methods for sonographic display device",
            "Multi-site video based computer aided diagnostic and analytical platform",
            "Simultaneous display of multiple maximized applications on touch screen electronic devices",
            "Transducer array imaging system",
            "Transducer array imaging system",
            "medical diagnostic device",
            "Ultrasound device and system including same",
            "Portable ultrasound scanner",
            "Apparatus, Systems, and Methods Adapted to Transmit Analyte Data Having Common Electronic Architecture",
            "Methods and apparatus for producing video records of use of medical ultrasound imaging systems",
            "Methods and systems for tracking and guiding sensors and instruments",
            "Multi-site video based computer aided diagnostic and analytical platform",
            "Docking system for medical diagnostic scanning using a handheld device",
            "Integrated, hand-held apparatus and associated method for acquiring diagnostic and prognostic information from a patient at the bedside or at some other patient location",
            "Portable electronic devices with integrated imaging capabilities"
        ]
    ],
    "pageTitle": "Patent US7549961 - System and method supporting imaging and monitoring applications - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7549961?ie=ISO-8859-1&dq=6978253",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 497855151,
    "recordOffset": 497821181,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{59251=Depending on the type of PDA/MDA in communication with external controller 102, space may be available for specialized circuitry specifically adapted for ultrasound signal processing such that a controller or portions thereof may be embedded into the PDA/MDA. This preferably permits scan head 103 to be directly connected to a port on the PDA/MDA using a thin wire connector. A thin wire connector is preferably a pair of Low Voltage Differentiating Signal (LVDS) lines and is preferably used when beamforming is to be performed in the scan head as opposed to the external controller. Alternatively, a universal serial bus (USB), a USB2 or an IEEE1394-type interface, or other suitable interface, may be used. Alternative embodiments provide for using a PDA/MDA wireless interface, such as an infrared (IR) port or radio frequency (RF), such as Bluetooth or wireless LAN, to communicate directly, for example, to a corresponding IR port which may be built into the scan head., 71774=Interconnect 104 from external controller 102 to ultrasound scan head 103 preferably may be wired or wireless. In a hardwire mode, a thin wire cable or an optical fiber link may be used. When interconnect 104 of embodiments is wired, the interconnect may be a thin wire or a wide broadband serial interface. In another embodiment, interconnect 104 may be a general, low voltage differential signaling cable. Further embodiments may provide for an interconnect that may include, but is not limited to, USB, broadband, or high speed USB. High speed USB includes the broadband 1394 as well as other wide media networks available for some other applications. In a wireless configuration, an IR or RF signal may be used. Other wireless interconnect options also are available including, but not limited to, ultra wide band (UWB), wireless USB, and UWB wireless 1394. Accordingly, as wireless options develop, it may be possible to substitute wired options with other wireless options. Although interconnect 104 has been described with respect to hardwire and wireless configurations, this does not limit the means for communication available., 40577=The present application claims priority to U.S. Provisional Patent Application No. 60/491,919, entitled “Ultrasound Conversion Kit for a PDA/MDA,” filed Jul. 31, 2003, the disclosure of which is hereby incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations Although the present invention and its advantages have been described in detail, it should be understood that various changes, substitutions and alterations can be made herein without departing from the invention as defined by the appended claims. Moreover, the scope of the present application is not intended to be limited to the particular embodiments of the process, machine, manufacture, composition of matter, means, methods and steps described in the specification. As one will readily appreciate from the disclosure, processes, machines, manufacture, compositions of matter, means, methods, or steps, presently existing or later to be developed that perform substantially the same function or achieve substantially the same result as the corresponding embodiments described herein may be utilized. Accordingly, the appended claims are intended to include within their scope such processes, machines, manufacture, compositions of matter, means, methods, or steps. Although the interconnects have been described as being wireline or wireless radios of various types, it should be appreciated that a single super broad band wireless radio may be implemented to replace these interconnects. Accordingly, the system architecture may be simplified, for example, into acquisition sensor/radio, user interface/radio, processing server/radio, and display/radio or different combination of modules/radio. It should be appreciated that as PDA/MDA technology changes, such as when a PDA manufacturer designs an upgrade, typically no change in the interface of external controller 102 is required. Accordingly, an upgraded PDA/MDA 101 may be incorporated",
    "textAfterTable": "US20040100376 * Nov 26, 2002 May 27, 2004 Kimberly-Clark Worldwide, Inc. Healthcare monitoring system JP2002152314A Title not available WO2000070366A1 May 17, 2000 Nov 23, 2000 Pie Medical Equipment B V Portable ultrasound diagnostic system with handsfree display * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US7834864 * Feb 16, 2007 Nov 16, 2010 Photon Technology International, Inc. System and method comprising a user interface for control of scientific image acquisition US7922899 * Jun 9, 2005 Apr 12, 2011 Gambro Lundia Ab Medical apparatus and method for setting up a medical apparatus US8021045 * Oct 20, 2009 Sep 20, 2011 Carestream Health, Inc. Integrated portable digital X-ray imaging system US8228347 May 8, 2007",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}