{
    "relation": [
        [
            "Date",
            "Oct 12, 2000",
            "Mar 13, 2002",
            "Mar 24, 2003",
            "Jan 8, 2007",
            "Dec 28, 2010",
            "Dec 17, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6589241 - Bone clamp - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6589241?dq=oakley+D523,461&ei=qiI4T-CjGqXf0QHz_PSUCA",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00310-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472286603,
    "recordOffset": 472269668,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While this invention has been described as having an exemplary design, the present invention can be further modified within the spirit and scope of this disclosure. This application is therefore intended to cover any variations, uses, or adaptations of the invention using its general principals. Further, this application is intended to cover such departures from the present disclosure as come within known or customary practice in the art to which this invention pertains and which fall within the limits of the appended claims. Once the bone clamp is operatively positioned and placed in clamped position, lock nut 48 may be rotated so that threaded lock nut aperture 68 (FIG. 3) interacts with threads 86 of pawl connecting screw 62 to axially displace lock nut 48 and lock pawl 44 in position as illustrated in FIG. 5. Spring 54 biases pawl 44 toward rows of ratchet teeth 56, 58 and encourages contact of pawl 44 with valleys 84. Pawl 44 includes spring contact surface 76 against which an end of spring 54 rests. As illustrated in FIGS. 6 and 7, pawl 44 includes spring retaining surfaces 80 to assist in positioning spring 54 (FIG. 4A) against spring contact surface 76. The opposing end of spring 54 rests against spring recess 64 of lock nut 48. Lock nut 48 further includes screw head recess 74 (FIGS. 8 and 9) which, in one embodiment, will receive the head of",
    "textAfterTable": "US5797919 Jul 16, 1996 Aug 25, 1998 Brinson; Keith Anthony Surgical bone clamp US6117158 * Jul 7, 1999 Sep 12, 2000 Ethicon Endo-Surgery, Inc. Ratchet release mechanism for hand held instruments * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US7722625 Jun 30, 2004 May 25, 2010 Depuy Products, Inc. Modular bone clamp instrument US8080045 * Apr 8, 2008 Dec 20, 2011 Wotton Iii Harold M Bone clamp US20130345762 * May 14, 2013 Dec 26, 2013 DePuy Synthes Products, LLC Soft tissue bone reduction forceps * Cited by examiner Classifications U.S. Classification 606/54, 606/205, 606/207,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}