{
    "relation": [
        [
            "Cited Patent",
            "US2788390 *",
            "US3329074 *",
            "US3599630 *",
            "US4085742 *",
            "US4171897 *",
            "FR1482481A *"
        ],
        [
            "Filing date",
            "Oct 16, 1952",
            "Jul 1, 1963",
            "Sep 15, 1969",
            "Jul 23, 1976",
            "Jan 27, 1977",
            ""
        ],
        [
            "Publication date",
            "Apr 9, 1957",
            "Jul 4, 1967",
            "Aug 17, 1971",
            "Apr 25, 1978",
            "Oct 23, 1979",
            ""
        ],
        [
            "Applicant",
            "Emanuel Sheldon Edward",
            "Iota Cam Corp",
            "Olympus Optical Co",
            "Takeshi Okada",
            "Fuji Photo Film Co., Ltd.",
            ""
        ],
        [
            "Title",
            "Device for examination of inaccessible parts",
            "Instrument for visual inspection",
            "Automatic exposure control device in an endoscope",
            "Endoscope equipped with a film cassette",
            "Electromagnetically operated shutter mechanism",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US4278077 - Medical camera system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4278077?dq=6666377",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00313-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478769119,
    "recordOffset": 478735168,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations As mentioned above, according to this invention, an induction coil provided in a capsule-shaped miniature camera which has been swallowed into a body cavity induces a voltage when a magnetic field generated by electromagnets outside the patient acts on the induction coil. The voltage thus induced turns on a lamp disposed within the camera and operates a shutter disposed within the camera, whereby the interior of the body cavity is photographed. Such a medical camera system rarely makes the patient feel sick with an impulse to vomit and thus facilitates an easy photographing of a body cavity interior. The camera shown in FIG. 7 comprises an envelope 34 and a permanent magnet 35. The permanent magnet 35 extends in the lengthwise direction of the envelope 34 and is secured to the envelope 34. That portion of the envelope 34 which is diametrically opposite to the magnet 35 has a pinhole 36 and a window both covered with transparent panes. Within the envelope 34, a film box 19 is disposed to face the pinhole 36, and a lamp 15 to face the window. Every time the lamp 15 is turned on, an image of the interior of the body cavity is focused on a film 18 in the film box 19. The amount of light emitted by the lamp 15 can be controlled. The cameras of FIGS. 5 and 6 are operated in the same manner as",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5604531 * Jan 17, 1995 Feb 18, 1997 State Of Israel, Ministry Of Defense, Armament Development Authority In vivo video camera system US5681260 * Dec 9, 1994 Oct 28, 1997 Olympus Optical Co., Ltd. Guiding apparatus for guiding an insertable body within an inspected object US6240312 * Oct 23, 1998 May 29, 2001 Robert R. Alfano Remote-controllable, micro-scale device for use in in vivo medical diagnosis and/or treatment US6428469 Dec 15, 1998 Aug 6, 2002 Given Imaging Ltd Energy management of a video capsule US6584348 Aug 14, 2002 Jun 24, 2003 Given Imaging Ltd. Method for measurement of electrical characteristics of tissue US6607301 Aug 3, 2000 Aug 19, 2003 Given Imaging Ltd. Device and method for dark current noise",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}