{
    "relation": [
        [
            "Citing Patent",
            "US8385477 *",
            "US8422938 *",
            "US8488477",
            "US8520567",
            "US9025680",
            "US20080014861 *",
            "US20110150059 *"
        ],
        [
            "Filing date",
            "Dec 23, 2009",
            "Jun 15, 2007",
            "Jun 15, 2007",
            "Jun 15, 2007",
            "Jun 15, 2007",
            "Jun 15, 2007",
            "Dec 23, 2009"
        ],
        [
            "Publication date",
            "Feb 26, 2013",
            "Apr 16, 2013",
            "Jul 16, 2013",
            "Aug 27, 2013",
            "May 5, 2015",
            "Jan 17, 2008",
            "Jun 23, 2011"
        ],
        [
            "Applicant",
            "Telefonaktiebolaget Lm Ericsson (Publ)",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Andreas Cedergren"
        ],
        [
            "Title",
            "Decision boundary estimation for MIMO wireless receivers",
            "Progressively broadcasting information in beacon signals",
            "Encoding information in beacon signals",
            "Encoding information in beacon signals",
            "Encoding information in beacon signals",
            "Progressively broadcasting information in beacon signals",
            "Decision Boundary Estimation for MIMO Wireless Receivers"
        ]
    ],
    "pageTitle": "Patent US7889800 - Memory-saving method for generating soft bit values from an OFDM signal - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7889800?dq=2040248",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00002-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477997007,
    "recordOffset": 477964868,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations With these and other variations and extensions in mind, those skilled in the art will appreciate that the foregoing description and the accompanying drawings represent non-limiting examples of the methods and apparatus taught herein for determining soft bit values for QAM-modulated symbols in an OFDM signal. As such, the present invention is not limited by the foregoing description and accompanying drawings. Instead, the present invention is limited only by the following claims and their legal equivalents. As will be readily understood, receiver circuit 900 and accompanying circuits may be implemented using digital hardware, microprocessors running software, or a combination of both. The circuits may comprise specialized or general-purpose processors, or digital signal processors (DSP), or one or more of each. Receiver circuit 900 may further be combined with transmitter circuitry to provide a complete transceiver device. This transceiver device may be configured as a portable, end-user terminal, such as a cellular radiotelephone, or as a fixed communications device. will also include or be combined with additional baseband processing circuits (not shown), providing functions such as supervising the previously discussed circuits, managing memory, interfacing with other operating circuitry, performing higher level communications functions, etc. In particular, receiver circuit may comprise or be combined with a propagation channel estimation circuit and a SIR estimator, the latter configured to estimate a signal-to-interference ratio corresponding to one or more OFDM tones. FIG. 9 In",
    "textAfterTable": "US7154966 * Jun 30, 2003 Dec 26, 2006 Telefonaktiebolaget L M Ericsson (Publ) Method and system for M-QAM detection in communication systems US7190747 * Apr 25, 2003 Mar 13, 2007 Bae Systems Information And Electronic Systems Integration Inc. Frequency mismatch compensation for multiuser detection US7197090 * Jan 29, 1999 Mar 27, 2007 Northrop Grumman Corporation Adaptive decision regions and metrics US7349470 * Jun 3, 2004 Mar 25, 2008 Zenith Electronics Corporation Decision feedback equalizers with constrained feedback taps for reduced error propagation US7352832 * Feb 24, 2003 Apr 1, 2008 Cisco Technology, Inc. Method and implementation for adaptive symbol decision mapping US7376195 * Jan 23, 2004 May 20, 2008 Telefonaktiebolaget L M Ericsson (Publ) Digital communication systems having decreased memory US7418240 * Sep 18, 2002 Aug 26, 2008 Broadcom Corporation Dynamic adaptation of",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}