{
    "relation": [
        [
            "Work",
            "Biuraliści (The Bureaucrats)",
            "Nocleg w Apeninach (A Night in the Apennines)",
            "Cudowna woda (The Miraculous Water)",
            "Ideał, czyli Nowe Precjoza (Perfection, or The New Preciosa)",
            "Karmaniol, czyli Francuzi lubią żartować (Carmagnole, or The French Like Joking)",
            "Nowy Don Kichot, czyl Sto szaleństw (The New Don Quixote, or 100 Follies)",
            "Żółta szlafmyca (The Yellow Nightcap)",
            "Loteria (The Lottery)",
            "Cyganie (The Gypsies) (revised as Jawnuta 1860)",
            "Beata",
            "Pobór rekrutów (Conscription)"
        ],
        [
            "Form",
            "operetta in one act",
            "operetta in one act",
            "operetta in two acts, lost except overture",
            "operetta in two acts",
            "operetta",
            "operetta in three acts",
            "operetta",
            "operetta in one act",
            "operetta",
            "operetta in one act",
            "operetta"
        ],
        [
            "Composed",
            "c. 1835",
            "c. 1837-9",
            "1840-1",
            "c. 1841",
            "c. 1840-1",
            "1841",
            "c. 1841",
            "c. 1842-3",
            "c. 1852",
            "c. 1870-1",
            "1842"
        ],
        [
            "Libretto",
            "I F Skarbeck",
            "A Fredro",
            "",
            "O Milewski",
            "O Milewski (after Théaulon de Torges and E Jaime)",
            "A Fredro (after M de Cervantes)",
            "F Zablocki",
            "O Milewski",
            "F D Kniaźnin",
            "Jan Chęciński",
            "Vintsent Dunin-Martsinkyevich"
        ],
        [
            "Première",
            "unperformed",
            "Vilnius, 1839",
            "",
            "Vilnius, 1840",
            "unperformed",
            "Lwów 1849 Warsaw, 1923",
            "lost",
            "Minsk, 1843",
            "Vilnius, 20 May 1852",
            "Warsaw, 2 February 1872",
            "lost"
        ]
    ],
    "pageTitle": "Stanisław Moniuszko - Simple English Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://simple.wikipedia.org/wiki/Stanis%C5%82aw_Moniuszko",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00027-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894404559,
    "recordOffset": 894382504,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2793=On 1 August 1858 he was made conductor of the Polish Opera in the Grand Theatre in Warsaw. In 1864, Moniuszko started lecturing at the Music Institute in Warsaw, where he also directed a choir. His disciples included, among others, Zygmunt Noskowski and Henryk Jarecki.[4], 3625=In 1848 in Vilnius, he staged and conducted the first performance of his opera Halka. After the triumph of his new four-act version of Halka at Warsaw on 1 January 1858, he toured France. It was soon later staged in Prague, Moscow and St. Petersburg,[3] where it met with great success.[7], 12555=Stanisław Moniuszko (May 5, 1819 in Ubiel, near Minsk – June 4, 1872 in Warsaw, Congress Poland) was a Polish composer, conductor and teacher. He is generally called the father of Polish national opera., 6959=Moniuszko was born in Ubiel (Minsk district in modern Belarus) to a Polish-Armenian [1] noble family of landowners.[2] He showed an early ability in music, and began private piano lessons with August Freyer[3] in 1827. Moniuszko began to formally study composition in Berlin with Karl Friedrich Rungenhagen, [4] who also taught him in choral conducting. While in Berlin, he had an unexpected early success when he set three songs to the words of the Polish national poet, Adam Mickiewicz.[5], 5371=After three years in Berlin, he returned to Poland in 1840 to marry Aleksandra Müller. He got a job as an organist in Vilnius and also worked as a private piano tutor.[4] The Moniuszkos had ten children., 4956=Around 1840, he began to compose strongly, writing his first operas and several other stage works, as well as sacred music and secular cantatas.[6], 2013=Stanisław Moniuszko died on 4 June 1872 in Warsaw of a sudden heart attack. He was buried in Powązki Cemetery.}",
    "lastModified": "Thu, 02 Jul 2015 08:27:24 GMT",
    "textBeforeTable": "Operettas[change | change source] Stage works[change | change source] Works[change | change source] Stanisław Moniuszko died on 4 June 1872 in Warsaw of a sudden heart attack. He was buried in Powązki Cemetery. On 1 August 1858 he was made conductor of the Polish Opera in the Grand Theatre in Warsaw. In 1864, Moniuszko started lecturing at the Music Institute in Warsaw, where he also directed a choir. His disciples included, among others, Zygmunt Noskowski and Henryk Jarecki.[4] In 1848 in Vilnius, he staged and conducted the first performance of his opera Halka. After the triumph of his new four-act version of Halka at Warsaw on 1 January 1858, he toured France. It was soon later staged in Prague, Moscow and St. Petersburg,[3] where it met with great success.[7] Maturity[change |",
    "textAfterTable": "Operas[change | change source] Work Form Composed Libretto Première Halka (Helen) opera in two acts, later enlarged to four acts c. 1847-8 & 1857 Włodzimierz Wolski (after Kazimierz Władysław Wójcicki) Vilnius, 1 January 1848 Sielanka (Idyll) opera in two acts c. 1848? Vintsent Dunin-Martsinkyevich lost Betty comic opera in two acts c. 1852 F Schober (after Scribe and Melesville) Vilnius, 20 May 1852 Flis (The Raftsman) opera in one act c. 1858 S Boguslawski Warsaw, 24 September 1858 Rokiczana (The King of Peasants) incomplete c. 1859 J Korzeniowski unperformed Hrabina (The Countess) opera in three acts c. 1869 Włodzimierz Wolski Warsaw, 7 February 1860 Jawnuta opera in two acts c. 1860 Warsaw 5 June 1860 Verbum nobile opera in one act c. 1860 Jan Chęciński Warsaw, 1 January 1861 Straszny Dwór (The Haunted Manor) opera in four acts c. 1861-4 Jan Chęciński (after Kazimierz Władysław Wójcicki) Warsaw, 28 September",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}