{
    "relation": [
        [
            "Year",
            "1979[18]",
            "1979[19]",
            "1979–1981[20]",
            "1978-1985[21]",
            "1985-1986[22]",
            "1979-1986[23]",
            "1987-1990[24]",
            "1989–1991[25][26]",
            "1991–1996[27]"
        ],
        [
            "Survey Area",
            "Wuhan-Chenglingji",
            "Nanjing-Taiyangzhou",
            "Nanjing-Guichi",
            "Yichang-Nantong",
            "Yichang-Jiangyin",
            "Fujiangsha-Hukou",
            "Yichang-Shanghai",
            "Hukou-Zhenjian",
            "Xinchang-Wuhan"
        ],
        [
            "No. of km surveyed",
            "230",
            "170",
            "250",
            "1600",
            "1510",
            "630",
            "1669",
            "500",
            "413"
        ],
        [
            "No. of baiji sighted",
            "19",
            "10",
            "3–6 groups",
            ">20 groups",
            "42 groups",
            "78-79",
            "108",
            "29",
            "42"
        ],
        [
            "No. of baiji estimated",
            "-",
            "–",
            "400",
            "156",
            "300",
            "100*",
            "200",
            "120",
            "< 100"
        ]
    ],
    "pageTitle": "Baiji from Wikipedia - Encyclopedia of Life",
    "title": "Results of Yangtze River baiji surveys between 1979 and 1996 ( * Lower reaches only)[12]",
    "url": "http://eol.org/data_objects/22402204",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00112-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 84847779,
    "recordOffset": 84810247,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{46316=The lives of Finless porpoise are also at risk. On October 11, 2007, Chinese state media announced that under a development plan an additional 4,000,000 people will be relocated from their homes near the dam by the year 2020 due to ecological concerns, while a forum of officials and experts warned of a possible “environmental catastrophe” if preventive measures are not taken.[39][40][41] Currently, the quality of water in the Yangtze is falling rapidly, due to the dam's preventing dispersal of pollutants; algae blooms have risen progressively since the dam’s construction; and soil erosion has increased, causing riverbank collapses and landslides.[42] The report detailing this was officially released in September 2007.[43] Senior Chinese government officials and scholars said the dam could cause a “huge disaster ... if steps are not taken promptly.”[42] The same scholars and officials previously had defended the Three Gorges Dam project.[44] Xinhua also reported that tens of billions of yuan had been spent to prevent pollution and geological disasters by tree planting, measures to maintain species diversification, shutting down 1,500 polluting industrial and mining enterprises and building 70 sewage and waste treatment plants, all of which are \"progressing well.\" [44], 25945=In 1978, the Chinese Academy of Sciences established the Freshwater Dolphin Research Centre (淡水海豚研究中心) as a branch of the Wuhan Institute of Hydrobiology. In the 1980s and 1990s, several attempts were made to capture dolphins and relocate them to a reserve. A breeding program would then allow the species to recover and be reintroduced to the Yangtze after conditions improve. However, capturing the rare, quick dolphins proved to be difficult, and few captives survived more than a few months.[15], 95261=\"Baiji.\" Wikipedia, The Free Encyclopedia. 17 Aug 2012, 02:28 UTC. 11 Sep 2012 <http://en.wikipedia.org/w/index.php?title=Baiji&oldid=511632195>., 9260=Baiji were thought to breed in the first half of the year, the peak calving season being from February to April.[7] A 30% pregnancy rate was observed.[8] Gestation would last 10–11 months, delivering one calf at a time; the interbirth interval was 2 years. Calves measured around 80-90 centimetres (32–35 in) at birth, and nursed for 8–20 months.[9] Males reached sexual maturity at age four, females at age six.[9] Mature males were about 2.3 metres (7.5 ft) long, females 2.5 metres (8 ft), the longest specimen 2.7 metres.[9] The animal weighed 135–230 kilograms (300-510 lb),[9] with a lifespan estimated at 24 years in the wild.[10], 44006=\"Witness to Extinction: How We Failed To Save The Yangtze River Dolphin\", an account of the 2006 baiji survey by Samuel Turvey, the lead author of the Biology Letters paper, was published by Oxford University Press in autumn 2008. This book investigated the baiji's probable extinction within the wider-scale context of how and why international efforts to conserve the species had failed, and whether conservation recovery programmes for other threatened species were likely to face similar potentially disastrous administrative hurdles., 39394=The Xinhua News Agency announced on 4 December 2006 that no Chinese River Dolphins were detected in a six-week survey of the Yangtze River conducted by 30 researchers. The failure of the Yangtze Freshwater Dolphin Expedition (simplified Chinese: 长江淡水豚类考察; traditional Chinese: 長江淡水豚類考察; pinyin: Chāng Jiāng dànshuǐ tún lèikǎochá) raised suspicions of the first unequivocal extinction of a cetacean species due to human action[31] (some extinct baleen whale populations might not have been distinct species). Poor water and weather conditions may have prevented sightings,[2] but expedition leaders declared it \"functionally extinct\" on 13 December 2006 as fewer are likely to be alive than are needed to propagate the species.[2] However, footage believed to be a baiji from August 2007 was released to the public.[32], 45373=In August 2007, Zeng Yujiang reportedly videotaped a large white animal swimming in the Yangtze in Anhui Province.[5][37] Wang Kexiong of the Institute of Hydrobiology of the Chinese Academy of Sciences has tentatively confirmed that the animal on the video is a baiji., 30208=In 2001 the Chinese government approved a Conservation Action Plan for Cetaceans of the Yangtze River. This plan re-emphasised the three measures identified at the 1986 workshop and was adopted as the national policy for the conservation of the Baiji. Despite all of these workshops and conventions little money was available in China to aid the conservation efforts. It has been estimated that US$1 million was needed to begin the project and maintain it for a further 3 years.[28], 14875=In the 1950s, the population was estimated at 6,000 animals,[14] but declined rapidly over the subsequent five decades. Only a few hundred were left by 1970. Then the number dropped down to 400 by the 1980s and then to 13 in 1997 when a full-fledged search was conducted. Now the most endangered cetacean in the world, according to the Guinness Book of World Records,[2] the baiji was last sighted in August 2004, though there was a possible sighting in 2007.[5] It is listed as an endangered species by the U.S. government under the Endangered Species Act., 26837=The first Chinese aquatic species protection organisation, the Baiji Dolphin Conservation Foundation of Wuhan (武汉白鱀豚保护基金), was founded in December 1996. It has raised 1,383,924.35 CNY (about 100,000 USD) and used the funds for in vitro cell preservation and to maintain the baiji facilities, including the Shishou Sanctuary that was flooded in 1998., 30821=Efforts to save the mammals proved to be too little and too late. August Pfluger, chief executive of the Baiji.org Foundation, said, \"The strategy of the Chinese government was a good one, but we didn't have time to put it into action.\"[29], 28505=Since 1992 five protected areas of the Yangtze have been designated as baiji reserves. Four were built in the main Yangtze channel where baiji are actively protected and fishing is banned: two national reserves (Shishou City and Xin-Luo) and two provincial (Tongling and Zhenjiang). A fifth protected area is an isolated oxbow lake located off of the north bank of the river near to Shishou City: the Tian-e-Zhou Oxbow Semi-natural Reserve. Combined, these five reserves cover just over 350 kilometres (220 mi), about 1/3 of the baijis range, leaving two-thirds of the species' habitat unprotected.[12], 34320=A baiji conservation dolphinarium was established at the Institute of Hydrobiology (IHB) in Wuhan in 1992. This was planned as a backup to any other conservation efforts by producing an area completely protected from any threats, and where the baiji could be easily observed. The site includes an indoor and outdoor holding pool, a water filtration system, food storage and preparation facilities, research labs and a small museum. The aim is to also generate income from tourism which can be put towards the baiji plight. The pools are not very large (25 m arc [kidney shaped] x 7 m wide x 3.5 m deep, 10 m diameter, 2 m deep and 12 m diameter, 3.5 m deep) and so are not capable of holding many baijis at one time., 45953=On October, 3, 2011 the sighting of almost 20 porpoises was reported in Chinese media. The sighting was done from a bridge in Nanjing city. It should be noted however, that the sighting has not been confirmed by independent media sources.[38], 4085=The baiji population declined drastically in decades as China industrialized and made heavy use of the river for fishing, transportation, and hydroelectricity. Efforts were made to conserve the species, but a late 2006 expedition failed to find any baiji in the river. Organizers declared the baiji functionally extinct,[2] which would make it the first aquatic mammal species to become extinct since the demise of the Japanese sea lion and the Caribbean monk seal in the 1950s. It would also be the first recorded extinction of a well-studied cetacean species (it is unclear if some previously extinct varieties were species or subspecies) to be directly attributable to human influence., 32054=The Shishou Tian-e-Zhou is a 21-kilometre (13 mi) long, 2-kilometre (1.2 mi) wide oxbow lake located near Shishou City in Hubei Province. Shishou has been described as being \"like a miniature Yangtze … possessing all of the requirements for a semi-natural reserve\". From the designation as a national reserve in 1992 it has been intended to be used for not only the baiji but also the Yangtze finless porpoise. In 1990 the first Finless Porpoises were relocated to the reserve and since then have been surviving and reproducing well. As of April 2005 26 Finless Porpoises were known to live in the reserve. A baiji was introduced in December 1995, but died during the summer flood of 1996. To deal with these annual floods a dyke was constructed between the Yangtze and Shishou. Now water is controlled from a sluice gate located at the downstream mouth of the oxbow lake. It has been reported that since the installation of this sluice gate, water quality has declined since no annual transfer of nutrients can occur. Roughly 6,700 people live on the ‘island’ within the oxbow lake and so some limited fishing is permitted.[12], 5582=In August 2007, a Chinese man reportedly videotaped a large white animal swimming in the Yangtze.[5] Although it was tentatively confirmed that the animal on the video is probably a baiji,[6] the presence of only one or a few animals, particularly of advanced age, is not enough to save a functionally extinct species from true extinction. The last known living baiji was Qi Qi (淇淇), which died in 2002., 35188=Douglas Adams and Mark Carwardine documented their encounters with the endangered animals on their conservation travels for the BBC programme Last Chance to See. The book by the same name, published in 1990, included pictures of a captive specimen, a male named Qi Qi (淇淇) that lived in the Wuhan Institute of Hydrobiology dolphinarium from 1980 to July 14, 2002. Discovered by a fisherman in Dongting Lake, he became the sole resident of the Baiji Dolphinarium (白鱀豚水族馆) beside East Lake. A sexually mature female was captured in late 1995, but died after half a year in 1996 when the Shishou Tian-e-Zhou Baiji Semi-natural Reserve (石首半自然白鱀豚保护区), which had contained only Finless Porpoises since 1990, was flooded., 43512=A report of the expedition was published online in the journal Biology Letters on August 7, 2007, in which the authors conclude \"We are forced to conclude that the baiji is now likely to be extinct, probably due to unsustainable by-catch in local fisheries\"[34]}",
    "textBeforeTable": "Surveys 2007: Results of survey published in the journal Biology Letters.[3] 2006: None found in survey, declared \"extinct\" 2004: Last confirmed sighting 2003: Three Gorges Dam begins filling reservoir 1998: 7 found in survey 1997: Population estimated to be less than 50 (13 found in survey); a dead baiji was found with 103 open wounds[13] 1996: IUCN lists the species as critically endangered 1994: Construction of the Three Gorges Dam begins 1990: Population estimated to be 200 1989: Gezhouba Dam complete 1986: Population estimated to be 300 1984: The plight of the baiji draws headlines in China[17] 1983: National law declares hunting the Chinese river dolphin illegal 1979: The People's Republic of China declares the Chinese river dolphin endangered 1970: The Gezhouba Project begins 1958–1962: The Great Leap Forward denounces the animal's traditional venerated status 1950s: population was estimated at 6,000 animals circa 3rd century BC: population estimated at 5,000 animals Timeline In the 1970s and 1980s, an estimated half of baiji deaths were attributed to entanglement in fishing gear. By the early 2000s, electric fishing was considered \"the most important and immediate direct threat to the baiji's survival.\"[15] Though outlawed,",
    "textAfterTable": "Conservation efforts During the 1970s, China recognized the precarious state of the river dolphin. The government outlawed deliberate killing, restricted fishing, and established nature reserves. In 1978, the Chinese Academy of Sciences established the Freshwater Dolphin Research Centre (淡水海豚研究中心) as a branch of the Wuhan Institute of Hydrobiology. In the 1980s and 1990s, several attempts were made to capture dolphins and relocate them to a reserve. A breeding program would then allow the species to recover and be reintroduced to the Yangtze after conditions improve. However, capturing the rare, quick dolphins proved to be difficult, and few captives survived more than a few months.[15] The first Chinese aquatic species protection organisation, the Baiji Dolphin Conservation Foundation of Wuhan (武汉白鱀豚保护基金), was founded in December 1996. It has raised 1,383,924.35 CNY (about 100,000 USD) and used the funds for in vitro cell preservation and to maintain the baiji facilities, including the Shishou Sanctuary that was flooded in 1998. Conservation efforts of the baiji along the Yangtze River Since 1992 five protected areas of the Yangtze have been designated as baiji reserves. Four were built in",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}