{
    "relation": [
        [
            "Channel",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Frequency",
            "27.60125 MHz",
            "27.61125 MHz",
            "27.62125 MHz",
            "27.63125 MHz",
            "27.64125 MHz",
            "27.65125 MHz",
            "27.66125 MHz",
            "27.67125 MHz",
            "27.68125 MHz",
            "27.69125 MHz"
        ],
        [
            "Channel",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20"
        ],
        [
            "Frequency",
            "27.70125 MHz",
            "27.71125 MHz",
            "27.72125 MHz",
            "27.73125 MHz",
            "27.74125 MHz",
            "27.75125 MHz",
            "27.76125 MHz",
            "27.77125 MHz",
            "27.78125 MHz",
            "27.79125 MHz"
        ],
        [
            "Channel",
            "21",
            "22",
            "23",
            "24",
            "25",
            "26",
            "27",
            "28",
            "29",
            "30"
        ],
        [
            "Frequency",
            "27.80125 MHz",
            "27.81125 MHz",
            "27.82125 MHz",
            "27.83125 MHz",
            "27.84125 MHz",
            "27.85125 MHz",
            "27.86125 MHz",
            "27.87125 MHz",
            "27.88125 MHz",
            "27.89125 MHz"
        ],
        [
            "Channel",
            "31",
            "32",
            "33",
            "34",
            "35",
            "36",
            "37",
            "38",
            "39",
            "40"
        ],
        [
            "Frequency",
            "27.90125 MHz",
            "27.91125 MHz",
            "27.92125 MHz",
            "27.93125 MHz",
            "27.94125 MHz",
            "27.95125 MHz",
            "27.96125 MHz",
            "27.97125 MHz",
            "27.98125 MHz",
            "27.99125 MHz"
        ]
    ],
    "pageTitle": "CB radio in the United Kingdom - Wikipedia, the free encyclopedia",
    "title": "UK C.B. Radio Channels (Ofcom)[5]",
    "url": "http://en.wikipedia.org/wiki/CB_radio_in_the_United_Kingdom",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00177-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 83620327,
    "recordOffset": 83591566,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{32047=In June 2011, the EU announced another change in technical specifications for C.B. use which, if implemented, would introduce a type approval for both AM and SSB operation. The introduction was originally delayed by the 2012 Olympics, and was scheduled to take effect in 2014.[18], 18421=A perceived heavy-handed attitude by the bigger organisations caused a number of smaller groups to be formed in response. In 1983 the majority of THAMES in Greater London was reformed into the Association of Independent Monitors (AIM). After 2 years AIM was reformed., 25157=The new system was taken up enthusiastically by all those who had held back using an illegal system, and it was one of the biggest selling gifts for Christmas in 1981. The system suffered from many nuisance users who denied the use of the recognised calling channels to other users by transmitting a blank carrier and/or music. With the fight won, albeit with a considerable compromise and particularly with the many nuisance users, interest rapidly waned, the C.B. clubs gradually dwindled in membership, many disappearing altogether within a year or so.[1], 33085=Following most other European countries, Ofcom proposed to adopt European Communication Committee Decision (11)031 in October 2013.[19] This would permit the use of Single Sideband and AM operation on the CEPT CB radio band,[20] and Ofcom proceeded with legislation to this effect on 27 June 2014.[21], 5193=C.B. Radio was first introduced into the United Kingdom around 1972. Early use was known around the airports in the UK, particularly Stansted in 1973. As citizens band radio has been advertised in the U.S. since before 1962,[3] it is possible that a number of these radios were brought into the U.K. and used illegally.[4] In 1978, C.B. radio in Britain was much popularized by its use in the film Convoy and the usage of illegal C.B. radio peaked in 1980. Companies in Britain sold U.S. equipment quite openly, and equipment was readily available in car accessory shops. During this time, a great many C.B. clubs emerged in the UK and they became centres of protest in the march towards legalisation, in the hope that existing equipment could be used legally. In response to this, the government commissioned a white paper proposing a C.B. service called \"Open Channel\" around 860 MHz. The U.K. Government eventually legalised C.B. Radio, and on 2 November 1981 a C.B. service was introduced on a frequency band and offset that is incompatible with the imported American radios. At the same time the ownership of non-UK approved 27 MHz transceivers was made illegal except for those obtained by UK radio amateurs holding a UK \"A\" (HF) licence, for conversion to the 28 MHz (10 metre) amateur allocation. Given that virtually all illegal C.B. radios were contraband, this concession required the licensed amateur to pay outstanding import duty and VAT. A licence to operate these new radios became compulsory, and this could be purchased from most Post Office counters for £15. Unlike that required to qualify for a radio amateur licence, no proof of technical competence was needed. As of 8 December 2006, a licence is no longer required to own or operate a C.B. Radio providing it complies with one of the 3 type approval conditions currently permitted by Ofcom:[5] FM only, 4 watts power output and operating on either or both UK and CEPT (EU) 27 MHz bands only., 17006=The national committee of REACT UK was beset by scandals and arguments from about 1986, and the National Communications secretary was arrested and charged with financial irregularities with regards to receipts from PMR licences. REACT UK members decided to split following much in-fighting in the national committee, and in 1986 many became affiliated directly with REACT International.[11] Some REACT units provided search volunteers to assist the police with searching for missing persons (something that still occurs today with ALSAR and RAYNET albeit without C.B. radios)., 1846=In December 2006, C.B. radio was deregulated by Ofcom and it is now licence free. Although the use of C.B. radios in the UK has declined from its peak,[1] it is still popular, especially with the farming community, Land Rover owners and Mini-Cab services. It is also fitted as standard to 'Street Glide' and 'Electra Glide' models of Harley Davidson touring motorcycles sold in the UK.[2], 13312=An additional frequency band was introduced on 1 September 1987 giving a further 40 channels in the CEPT Band,(26.965 MHz to 27.405 MHz) also some antenna restrictions were lifted, over the past few years all antenna restrictions have been removed and planning constraints now restrict antenna size rather than regulatory compliance. It is not permitted to add the CEPT channels to existing 27/81 equipment, the only radios permitted to operate on this band are purpose made 80 channel or CEPT only sets., 12572=In addition 20 channels in the 934 MHz band were also legalised, but equipment was considerably more expensive than the well established 27 MHz sets. At first the range was limited, but as antenna restrictions were lifted and better equipment started to appear, the number of UHF C.B. operators grew. In 1988, it was announced that the manufacture of 934 MHz equipment would be prohibited, though the use of existing equipment would remain legal. Its use largely confined to enthusiasts and amateur radio operators, the type approval specification for this band was finally withdrawn on 1 January 1999 and it is now illegal to use this equipment in the UK., 1359=Citizens Band radio (often shortened to CB radio) is a system of short-distance radio communications between individuals on a selection of 40 channels within the 27-MHz (11 m) band. In the United Kingdom, C.B. radio was first legally introduced in 1981, but had been used illegally for some years prior., 17857=From 2007 there was only one REACT International team based in Britain, operating under the name of REACT UK Dundee.[12] Some teams became overseas members of REACT International whilst others chose to join splinter group REVCOM (Radio Emergency Volunteer Communications)., 31735=As of 8 December 2006, C.B. Radio now joins PMR446, LPD433 and SRD860 under the category of licence-free personal communications., 16444=REACT UK was formed in 1982,[11] under licence from REACT INTERNATIONAL in the United States, its teams were located across the UK. It was noted for its members signing on and off monitoring on Channel 9. REACT UK also provided members equipped with mobiles and handheld to provide radio coverage for marathons, fun runs, county shows - it also obtained a Private Mobile Radio (PMR) licence so its members had a secure private radio channel., 19660=The UK channels that were legalised on 2 November 1981 were on two blocks of frequencies: 40 channels on the 27 MHz band and 20 channels on the 934 MHz band, both of which used FM (frequency modulation) and both unique to the UK. The 27 MHz band frequency allocation and related information is shown here. In 1987 40 additional frequencies were added, which were ironically the same as the U.S. allocation - but again using FM. This additional band is often referred to as the CEPT or EU band. As with the original 40 channels, this band is affected by the same atmospheric characteristics, especially towards the maxima of the 11-year sunspot cycle., 34242=Over the first weekend of legal AM/SSB (27th, 28, 29 June 2014) a 'Big Multimode Net' event was organised by the UK CB radio community starting at midnight on the morning of 27 June 2014. CB radio operators up and down the UK stayed up late to be part of the event. Many contacts were made and the event was seen as a great success. Some operators made videos and posted them to video sharing sites such as YouTube.[citation needed]}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "The (formerly) illegal SSB mode has its enthusiasts and adopted a different style of call-sign (instead of a 'handle') in the manner of radio amateurs. The unofficial 'band' centred around 26.6 MHz[citation needed] The UK channels that were legalised on 2 November 1981 were on two blocks of frequencies: 40 channels on the 27 MHz band and 20 channels on the 934 MHz band, both of which used FM (frequency modulation) and both unique to the UK. The 27 MHz band frequency allocation and related information is shown here. In 1987 40 additional frequencies were added, which were ironically the same as the U.S. allocation - but again using FM. This additional band is often referred to as the CEPT or EU band. As with the original 40 channels, this band is affected by the same atmospheric characteristics, especially towards the maxima of the 11-year sunspot cycle. The originally imported equipment used AM amplitude modulation and SSB single sideband modulation modes of transmission. Methods of transmission[edit] Another group originally formed with the use of C.B. radio in mind are REVCOM, though this group no longer uses the C.B. service.[13] REVCOM A perceived heavy-handed attitude by the bigger organisations caused a number of smaller groups to be formed in",
    "textAfterTable": "Three channels have been unofficially recognised for specific uses within the U.K., though the arrangement has no legal standing: Channel 9: The emergency calling channel Channel 14: Calling channel Channel 19: Truckers' channel and secondary calling channel C.B. users may use the phonetic alphabet and ten-codes. The C.B. craze and legalisation[edit] The new system was taken up enthusiastically by all those who had held back using an illegal system, and it was one of the biggest selling gifts for Christmas in 1981. The system suffered from many nuisance users who denied the use of the recognised calling channels to other users by transmitting a blank carrier and/or music. With the fight won, albeit with a considerable compromise and particularly with the many nuisance users, interest rapidly waned, the C.B. clubs gradually dwindled in membership, many disappearing altogether within a year or so.[1] Nuisance[edit] There are some notable anti-social aspects to the hobby. It is possible to increase power output to very high levels using power amplifiers, and in some cases this can cause interference to and affect the operation of other equipment such as television and radio, and also to other CB radio users.[7] The band used for C.B. was already allocated in the UK to radio",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}