{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,124 topics 2,125,018 replies",
            "85,557 topics 1,153,868 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,761 replies",
            "5,996 topics 75,814 replies",
            "50,548 topics 466,232 replies",
            "22,766 topics 196,305 replies",
            "4,272 topics 60,462 replies",
            "1,127 topics 8,216 replies",
            "3,604 topics 115,485 replies"
        ],
        [
            "Last Post Info",
            "Story Mode DLC discussion t... By Vinewood Villain 12 minutes ago",
            "Where is Roman's Cab De... By Mr. Fahrenheit 17 minutes ago",
            "Why does this game receive... By Sayuri 13 hours ago",
            "Whats your favourite radio... By Ivan1997GTA 4 hours ago",
            "Favorite Gang By crashrock2 An hour ago",
            "Favorite gym fighting style? By Mr. Fahrenheit 7 minutes ago",
            "Reasons why Vice City is be... By lolznc 2 hours ago",
            "How Did Miguel and Catalina... By Pikas_PK 6 minutes ago",
            "What do you hate of GTA 2? By Cerium 5 hours ago",
            "Lets play a game of \"Wo... By NightSpectre A minute ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=239&t=548686&p=1062312726",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00101-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 106716139,
    "recordOffset": 106690532,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9376=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 16261=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 111374=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 47491=Bing, Google, stickboy, Yahoo, p-s-3x, monkb4skunk, Latemodelchild, XxWhiteoutxX12, HunterGatherer, Pikas_PK, magluts02, GTA_stu, REXX93, Captain Sensib1e, Flawless_mike, Faultierspy79, paperbagdude, Google Mobile, ~TKP~, CaptainMarvel, Deadman1996, missanthropy, Kromix, toxluv, Phnx., MagellanFall, RideEmOut2, Jahgee, VikDarkbomb, xAxWilliams, TheUnholy, Pavle, KyloW13, lydianduck, A Maned Wolf, LilSean, Shadowfennekin, fac316, ledzep71, Axe_Gaijin, alex8b, Shenmue18, Godset-97, Anotic, SilentSeasons, Corndog93, Mr. Fahrenheit, Wikstr3, _Klebitz_, Crubbiestimp42, Input, ghoraaa, Vega LVI, TheBigH7709, tr28999, Majestic81, hoopz71, Killerman78, Claptrap NL, gtuned, frodzet, DragonSpade, 11john11, PhillBellic, xoutlaww, Reid505, The Made Man, Miss Malevolent, Beckerbrasil, Total Failure, don_pedro, Angel Bryan, Hyperglide, diget2000, top dog, NightSpectre, BisP, chase623hiltz, WhosYu, Ray, _Douglas_, Edward Nashton, YaDoesntHaveToCallMeRay, Black Terminator, xTrendSs, Alphapug, Tre-Von, Thompson98, whiteskin, kBlaise, Junko Enoshima, Rented, Dirtbag, JaegerPilot1, GrandMaster Smith, Fresh Milk, blacknambala, Vandous, A.O.D.88, ErMerGerd, CCPD, Thousand Accent, BewareoftheBears, Sentinel Driver, TimmyM56, skit.mofo, Kirkor, Kirsty, S1M0N410, Zello, hezus123, Prodigy_Rocks_, Midnight Hitman, Lil Kenzo, Vinewood Villain, GeneralSteve93, Jvaz615, Progen, Daemian, rlr149, jeremy81385, jakematos2, Stoney0503, Chloroform, Bender.ㅤ, scottmacdougall, Astoroth211, xman40100, AaronMcG95, //XP//, Warablo, GamesBoy316, aterikasedi, TJGM, Tranquiliti, epoxi, Smale45, topkek, GTA_Matt24, Richgang, psymin, -Z31N-, PS3KillsThe360, lester622, PsychoGamer, Jon Snow, spaceeinstein, Heists, frontrunner91, NightTrainCaine, GVJLIMA, Fox2Quick, Nameless Foot Soldier, deadx23, CrysisAverted, Niobium, BlackZmith10, -Velox, jerryinohio78, wayne1482, Cudwieser, R4Yn1zzl3, HellCattX, Atlantic Tuna, PoeticWhisper, blackindia, ap4321, Synshade, Skip_Chizzlenuts, ExplosiveEnergy386, Cyberzone2, southparkmayor, ClaudX, shadowski, =T.A=, Tony_Florence, El Chubito, Quarthon, Spaghetti Cat, RedDagger, MyName'sJeff, ExParrot, StangOne50, Frantz Fuchs, WhitTe_MamBa, 78 lil red express, gizmo, Stolas, DustyRider, Neopolitan, 018361, fkikokikogta, SonofUgly, The Squirrel, Winning001, Jon3s, CrossPT, smokingndriving, fullxthrottle94, SuperHolySheep, silverharbinger, NikkoCharger, ApexReclaimer, BadKarma1699, Ezekeil2Ofive17, PS-GTAIVplayer, Neutrinobeam, Progeekzy, ringtone7, xtrakill101, mrtommygunwhite, D- Ice, Molster, Ganton, r.lorenzo13, LFC484, Mr. Jago, Katabasis, Dabzilla, Choco Taco, JimmyFantastic, SchoolOfHardKnocks, Alan0x1, TheUnbalanced, jgarehart, dairyworker, Pyroshox, No_Flex_zone, wootwoots, Opakl45, Zaldrex, Silent, Fearx--, Saddler, justinlynch3, Expozing, M.K.N., longhurstgb, Ezuu, Trippyegreatest123, jrl51592, Fozzie_420, Jesse.yancey320, r0eladn, 12490=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 20528=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 14056=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 18396=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 5 minutes ago By S1M0N410 Xbox One crew recritment 613,498 replies 15,207 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By A Maned Wolf what was your first car? 2,284,100 replies 113,423 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,469 topics 416,631 replies Is there a good Ragdoll phy... By Aquilus 25 minutes ago Mod Showroom Scripts & Plugins, Maps, Total",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}