{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,129 topics 2,125,048 replies",
            "85,557 topics 1,153,876 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,761 replies",
            "5,996 topics 75,815 replies",
            "50,548 topics 466,232 replies",
            "22,766 topics 196,306 replies",
            "4,272 topics 60,463 replies",
            "1,127 topics 8,216 replies",
            "3,604 topics 115,490 replies"
        ],
        [
            "Last Post Info",
            "Use Modified Car in Online By Maxxi 6 minutes ago",
            "It`s 2015 and GTA IV+ DLC i... By Official General 43 minutes ago",
            "Why does this game receive... By Sayuri 15 hours ago",
            "Whats your favourite radio... By Ivan1997GTA 5 hours ago",
            "Favorite Gang By Mr. Fahrenheit An hour ago",
            "Favorite gym fighting style? By Mr. Fahrenheit An hour ago",
            "Reasons why Vice City is be... By Mr. Fahrenheit 36 minutes ago",
            "Grand Theft Auto III Pre-Re... By super_slav 14 minutes ago",
            "What do you hate of GTA 2? By Cerium 7 hours ago",
            "Mary-Beth Williams in the f... By Mr. Fahrenheit 27 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=68&t=138029&p=2492422",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00198-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 107380095,
    "recordOffset": 107354173,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12475=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 16254=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 47568=Google, Yahoo, Sylent01, Bing, Captain Sensib1e, UNH1NG3D, Forty-Five-Auto, kk9fan97, ClaudX, Street Mix, Foreverpast, MrSaucyZ, alfscooby98, Google Mobile, HokusaiXL, RJSanModder, BlackHeartedGovernor, Jaxite, KingVee, Synshade, Chloroform, ChickenAndBeer, NBAKingzFan10, Claude Liberty, Jon Snow, SouthLand, Pavle, Daniel MCH, Slasherr, Mr. Jago, Sandi1987, Smale45, Jason Frost, Daemian, marlon, STLthugg, Mona Sax, MagellanFall, Russi4nW4rrior, JoeFury1997, Twin Turbo, FlacidJack, Kirsty, A.O.D.88, Cancerslug, Mr. Fahrenheit, JohnnyCallisto, Dan McChill, HKM87, chinagreenelvis, Nicinator16, OFlame, pep legal, CarnageRacing00, Geralt of Rivia, A Maned Wolf, lol232, SARDYNA108, Xenome13, drift501, IKNOWICANFLY, REXX93, HumanRacehorse, dairyworker, the_sniper_29, LilSean, wayne1482, rapidwiz, Ss4gogeta0, JamesBucket, Blind and Mute, Kommye, Elite_Task_Force, AeroAviation, Keyan, YngDady, Rangerlump, adamaineiac, slayso, Shooter Hex, Garbear38, DJ_Jiggles, psymin, Mantiger308, Ksurvivor, jakematos2, quadro09, Cripto136, Daequil, Stoney0503, GrandMaster Smith, shadowkill98, Cool Username, NytePiper, ErMerGerd, Xpert.K, Starpaul20, Black_MiD, GTA_Matt24, TexasRocks, mikestb123, Apodiense, Corndog93, joe1606, Kurt370, TheTechPoTaToCHIP, Royal22, Staypuft, TJGM, Cudwieser, Fozzie_420, Input, joe grizzly, TheUnholy, jam_1989, Bubbles_Shed, _Douglas_, Dillono, GTA3Rockstar, JackIrish, Benny164, Roadrage158, TitaniumSphinx, Vinewood Villain, temi4328, swirler, Groper17nz, Holmls, qzance88, RussianCommie, M.K.N., DemonicMoustache, fSpiral, Fisciletti, lester622, Cypster, Dern Sure, dewtech_2008, This Guy Is Here, Shadowfennekin, Reyks, VaughnR, TheFoxRiverFugitive, GradientDruid, Player360, Hello7734, Hoosierdaddy76, MGCrash, Arms Dealer, CaptianBackwoods, Exo 401, SchoolOfHardKnocks, Pyro_Indigo, Between3and20chars, Flicksy, undeadrwby911, wowsux133, goldadderXD, GTA_The_Series, Bob_Dole, ItsOnlyMac, Ieech, gfen, Progeekzy, spaceeinstein, ApexReclaimer, AstroStormz, jdude1969, blackroseMD1, uNi, _OGX_, Semaj 2JZ♢, toxluv, Smooth Longsack, flyer2359, CamxxCore, Beto2O, FlexPiTo, X12-1992, The_Lost_MC, Vicarious Mind, Scuba 21, smiffy84, ScarySKRILLEX, Spectacus, TwisterVictor1, Choco Taco, hellfire_cthulhu, ashbashbluesfan, s2n vaniish, Flawless_mike, Alexa, RM76, souldisposal, DaGengster, VeraVanderpump, Niobium, RARusk, adit999, X Reaper X, Stoned Hillbilly, Judicious 7, WinkingSkeever6, AndrewDeSanta, the nameless, funmw2, Nameless Foot Soldier, oreank582894, Tony_Florence, Zaldrex, maliksusanto, Pary daPlatapus, statistic, deegrand323, StangOne50, laskaland, scalliano, shivii, Cyberzone2, GipsyDanger MK2, Rekia87, xxxsoulxxx996, lowriderlife63, Ethenal, SSKYZX, TallMarcos, NikoB08, Im Ricky I Win, ZayTrapz, MrForz, Gtaultimatefanboy, feedthefishy, xInfamousRYANx, S1N0D3UTSCHT3K, Sigurd, Weedell, RideEmOut2, Village Idiot, Alfred Packer, Fireman, NotAHipster, ShenLong Kazama, Kal74, pedinhuh, Zhaxi, stonusbabus, hornedturtle, Officer Garza, lebongjames187, koztop, super_slav, 18387=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 114034=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 14041=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 20538=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 9280=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 3 minutes ago By Jim Facade Corporation 613,512 replies 15,207 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Hoosierdaddy76 Why do people get upset whe... 2,284,296 replies 113,436 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,468 topics 416,633 replies Adding contacts to iFruit (... By CamxxCore 14 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}