{
    "relation": [
        [
            "Type",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question",
            "Question"
        ],
        [
            "Title",
            "I am getting ntldr is missing error",
            "Deleted some users by mistake in Active",
            "Hide all shared folders other than those",
            "Excel: How to trim space before each cell in",
            "Excel or Macro Script: Which way is better",
            "Problem Uninstalling Ubuntu 9.04 on Win XP",
            "Questions on Multilayer Perceptron or MLP",
            "Tips on avoiding lockups, blue screen and",
            "Problem with slow POST Help?",
            "What are the causes of Websphere CPU",
            "Missing Stackrace in Exception on Java",
            "Defragmentation of hard disk loading issues",
            "Compact disk broken in CD rom",
            "VPN keeps disconnecting automatically. Why?",
            "What is the meaning of Digital Jewellery?",
            "How to stop program from starting",
            "Windows Media Player error 8004022F ?",
            "Apple OS V/s Microsoft Windows OS",
            "Powercolor 4850: Overheating issue while",
            "Cannot remain logged in on website",
            "How to reset firefox 4?",
            "QuickBooks Pro 2011 install Problems",
            "Help! Bingbot is crawling sectors of my site",
            "I want the bing images as my wallpaper!",
            "How can i recover data on my iPhone?"
        ],
        [
            "Body",
            "I am using an HP Pavilion laptop with Windows XP on it. Last night, I was working on some projects and shut down my computer after working. This",
            "Hi, Deleted some user accounts by mistake in Active directory. Can you help retrieving them. I have another question posted in this site about a",
            "Hi Experts, This is my 2nd question here and the first was an awesome solution. So trying to put across my issues to you guys. I have a file",
            "Hi Experts, How can i remove a single space from the front of each cell in a Column. I want a formula that i can use to remove one empty space",
            "Excel macro or script that can make all data into caps in a excel sheet Some easy way which I can use to make all words CAPS. Thanks.",
            "I have installed Ubuntu 9.04 with Wubi inside Windows XP (like regular app) and when I start my PC there is a option menu which is asking what I",
            "What is Multilayer Perceptron? How we can train Multilayer Perceptrons?",
            "How do we avoid lockups, blue screen and frozen screen? I have once experienced the 'blue screen of death' on my laptop before and it was",
            "I bought new video card before couple of days, and I have a problem. When I installed the video board in my MoBo and rebooted the system the POST (",
            "I see CPU starvation messages on my Websphere server logs but there has been no impact on our application. Is this something I should be worried",
            "Hi, sometimes when I run my Java code, I get some exceptions but no stacktrace. I have encountered these even in debug mode. Does anyone know what",
            "I am facing issue in opening of various applications install on my system. It is taking more time to load. My system disk is almost full. Is",
            "My CD ROM is stuck because of the broken CD in it. Please tell me how to open it with without opening the computer cover because it is locked too",
            "When I am using my VPN at home, I am unable to get a steady connection. When at work, I use the same laptop to connect to the same VPN. It",
            "Hello, May I know about the term Digital Jewellery. Its an interesting subject when i heard by a few of my friends but even they did not know it",
            "Can anyone here help me? I installed a program recently, and since then, every time I start my computer, that program comes up as well. This",
            "I have a problem with my Windows Media Player, whenever I try to play a video of . avi format or .mkv format then there come an error 8004022F",
            "Hi, I have posted my problem or I can say, I need all your advice to buy a new laptop. I have been using Microsoft Windows OS, for the",
            "My power color is running hot on idle, it's currently reading 72c, and all I am doing is browsing the web. I am not sure how it was before but",
            "I cannot remain logged in a website such as gmail or facebook, the website kicks me off and keeps prompting me to log in. What do I do?",
            "I recently installed an add-on with my Firefox 4. Since then, Firefox 4 crashes. Sometimes, it would freeze. I am forced to use Chrome ( don",
            "I'm installing Quickbooks Pro 2011 on a Windows XP desktop. Each time I start the install I get an error: \"NETWORK ERROR OCCURRED WHEN",
            "Hi guys, I'm new to this kind of stuff so I need your help. I have published website and manage to get it indexed in Google and Bing. However",
            "I want those Bing images appear as my wallpaper. I also want them to change when the Bing wallpaper changes. I've seen it on a friend's",
            "Hello, I have an iPhone 3G. Suddenly I have lost my all data in my iPhone. I don't know what the reason is and I am worried."
        ],
        [
            "Nid",
            "72962",
            "589",
            "593",
            "627",
            "629",
            "662",
            "691",
            "672",
            "700",
            "722",
            "721",
            "714",
            "701",
            "712",
            "738",
            "740",
            "732",
            "713",
            "742",
            "741",
            "754",
            "763",
            "765",
            "772",
            "767"
        ],
        [
            "Author",
            "Kristen75",
            "Mahesh",
            "Deshpandeboy",
            "Srinivas",
            "Anonymous",
            "Rootkit",
            "Piyushh",
            "Kjlasal",
            "Jonib",
            "Radesh",
            "Deepa",
            "Saroj",
            "Baba sain",
            "Lencaster",
            "Priya",
            "User900",
            "Prachit chandran",
            "Ashish chauhan",
            "Xiaob",
            "John_",
            "Jciconte",
            "Mitchie",
            "Boompy",
            "Tilaps",
            "Nixway"
        ],
        [
            "Replies",
            "1",
            "4",
            "2",
            "2",
            "3",
            "3",
            "6",
            "3",
            "4",
            "2",
            "4",
            "2",
            "2",
            "6",
            "6",
            "4",
            "3",
            "3",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "6"
        ],
        [
            "Last Post",
            "2011-03-03 19:47",
            "2011-04-05 11:46",
            "2011-04-06 13:47",
            "2011-04-15 15:14",
            "2011-04-19 11:12",
            "2011-04-20 00:45",
            "2011-04-20 17:32",
            "2011-04-20 21:17",
            "2011-04-21 02:29",
            "2011-04-21 05:59",
            "2011-04-21 06:37",
            "2011-04-21 09:48",
            "2011-04-21 11:55",
            "2011-04-21 12:21",
            "2011-04-21 14:17",
            "2011-04-21 15:17",
            "2011-04-21 15:22",
            "2011-04-21 15:33",
            "2011-04-21 15:51",
            "2011-04-21 15:55",
            "2011-04-21 16:10",
            "2011-04-21 16:36",
            "2011-04-21 17:00",
            "2011-04-21 17:05",
            "2011-04-21 17:11"
        ],
        [
            "Reads",
            "884",
            "951",
            "718",
            "823",
            "685",
            "794",
            "1,124",
            "611",
            "603",
            "2,646",
            "1,191",
            "538",
            "868",
            "3,331",
            "1,851",
            "584",
            "976",
            "613",
            "987",
            "538",
            "1,173",
            "1,661",
            "2,594",
            "854",
            "808"
        ],
        [
            "Category",
            "Others",
            "Active Directory",
            "Windows 2003",
            "MS Excel",
            "MS Excel",
            "Windows XP",
            "Others",
            "Windows XP",
            "Hardware Components",
            "Java",
            "Java",
            "Windows XP",
            "Hardware Components",
            "Misc Networking",
            "Others",
            "Windows 7",
            "MultiMedia Applications",
            "Appletalk",
            "Video Cards",
            "Web",
            "Firefox",
            "Misc Software",
            "Web Marketing",
            "Web Graphics",
            "iPhone"
        ]
    ],
    "pageTitle": "Recent posts | Techyv",
    "title": "",
    "url": "http://www.techyv.com/tracker?order=last_comment_timestamp&sort=asc&quicktabs_top_posts=0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00098-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 746443527,
    "recordOffset": 746423826,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "ArticleBlogQuestionTips Filter Recent posts (adsbygoogle = window.adsbygoogle || []).push({}); Home > Recent posts How to solve Windows Activation Give me example of application How to create php press release Error appears when tries to login Help about websites powered by",
    "textAfterTable": "‹‹ 1 of 3016 ›› Blogs (269) Articles (772) Questions (74090) Tips (269) Members (47920) Home |  About Us |  Site Map |  FAQ |  Contact Us |  Terms and Conditions  |  Privacy Policy © Copyright 2010-2015 by Techyv. All Rights Reserved.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}