{
    "relation": [
        [
            "",
            "2002",
            "2003",
            "2004",
            "2005",
            "2006",
            "2007",
            "2008",
            "2009",
            "2010",
            "2011",
            "2012",
            "2013*",
            ""
        ],
        [
            "Number of First-Time Buyers",
            "531,800",
            "369,600",
            "358,100",
            "363,800",
            "402,800",
            "359,900",
            "192,300",
            "196,600",
            "198,600",
            "193,000",
            "217,900",
            "265,000",
            ""
        ],
        [
            "Annual % change",
            "6",
            "-31",
            "-3",
            "2",
            "11",
            "-11",
            "-47",
            "2",
            "1",
            "-3",
            "13",
            "22",
            ""
        ],
        [
            "",
            "%",
            "%",
            "%",
            "%",
            "%",
            "%",
            "%",
            "%",
            "%",
            "%",
            "%",
            "%",
            ""
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "FTBs as % of all House Purchase Loans",
            "38",
            "30",
            "29",
            "37",
            "36",
            "36",
            "37",
            "38",
            "37",
            "38",
            "40",
            "45",
            ""
        ],
        [
            "",
            "%",
            "%",
            "%",
            "%",
            "%",
            "%",
            "%",
            "%",
            "%",
            "%",
            "%",
            "%",
            ""
        ]
    ],
    "pageTitle": "Largest Annual Increase in First-Time Buyers Since 2001 - Yahoo Finance",
    "title": "",
    "url": "http://finance.yahoo.com/news/largest-annual-increase-first-time-173031565.html?soc_src=mediacontentsharebuttons",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043058631.99/warc/CC-MAIN-20150728002418-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 101237331,
    "recordOffset": 101117115,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33343=LONDON, ENGLAND--(Marketwired - Jan 8, 2014) - The number of first-time buyers (FTBs) continued to increase in 2013, according to the annual Halifax First Time Buyer Review., 112837=The multiple of 4.0 is in line with the average house price to income ratio for a FTB over the period from 1991 to 2013. (Source:Halifax), 34541=There has also been an increase in the proportion of areas that are affordable for FTBs since 2007. In a third (31%) all of local authority districts (LADs) in the UK the average house price paid by a first-time buyer in November 2013 was affordable for someone on average earnings - based on the ratio of the average house price to earnings being below the long-term average of 4.0. This compares to the peak of the market in 2007 when just 5% of LADs were affordable. The average price paid by FTBs in 2013 was 10% lower than it was in 2007 (see Table 2)., 92726=Table 4: First-Time Buyers: Average Price, Loan and Deposit by Region, 2013, 33766=There were an estimated 265,000 FTBs in 2013, up from 218,000 in 2012. While this was the highest annual total since 2007, it was still nearly 30% lower than the annual average between 2003 and 2007 (370,800). FTB numbers increased their share of all house purchases made with a mortgage, now accounting for 45%, up from 40% in 2012 (see Table 1)., 35562=Martin Ellis, housing economist at Halifax, commented: \"The number of first-time buyers is estimated to have grown by a fifth in 2013, the largest annual increase in more than a decade. Low interest rates, improvements in consumer confidence and Government schemes, such as Help to Buy, all appear to have contributed to the rise in the number of first time buyers., 35140=Close to half (45%) of all FTB purchases in 2013 were below the £125,000 Stamp Duty threshold. A similar proportion (46%) of properties bought by FTBs were priced between £125,000 and £250,000. The overwhelming majority (98%) of FTBs in London bought homes above the £125,000 threshold, followed by the South East (87%), and South West (74%) (see Table 3)., 51388=Table 2: % of affordable LADs for First-Time Buyers by Region, 2007 and 2013*, 33568=Last year the number of first-time buyers grew by an estimated 22%; the largest annual rise since 2001. This was the second consecutive annual increase following a 13% rise in 2012., 34138=Mortgage affordability has improved significantly in recent years. The proportion of disposable earnings devoted to mortgage payments by a first-time buyer stood at 30%1 in 2013 Quarter 4. This is a substantial improvement since summer 2007 when this figure reached a peak of 50%. Record low mortgage rates have been a major contributing factor driving this improvement.}",
    "textBeforeTable": "Table 1: Number of First-Time Buyers - UK There has been a significant increase in the proportion of FTBs receiving financial help in recent years. The CML estimates 65% of FTBs had financial assistance in mid 2012 compared with 31% in mid-2005. The average age of a FTB is 30 years; up from 29 in 2011. The average age of a FTB is highest in London, at 31 years old. Age The average price paid by a FTB is highest in Greater London (£280,915); almost two and a half times that in the North East (£105,748) where the average price paid by a FTB is the lowest (see Table 4). Prices FTBs in Greater London put down the largest average deposit, at £56,183. FTBs in the North East put down the smallest average deposit, at £15,862. The average FTB deposit in 2013 stood at £30,943; 11% higher than in 2012 (£28,001) and £13,444 (77%) higher than in 2007 (£17,499) (see Table 4). Deposits ADDITIONAL KEY FINDINGS \"However, many potential first-time buyers continue to find raising the necessary deposit a problem. The Help to Buy mortgage guarantee scheme should enable more buyers to get on to the property ladder with smaller deposits. Continuing pressure on household finances during the next 12 months will no doubt remain a constraint.\" Martin Ellis, housing economist at Halifax, commented: \"The number of",
    "textAfterTable": "Source: CML *Halifax estimate Table 2: % of affordable LADs for First-Time Buyers by Region, 2007 and 2013* 2007 2013 Affordable Unaffordable Affordable Unaffordable",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}