{
    "relation": [
        [
            "Fall",
            "Civil Procedure",
            "Criminal Law",
            "Torts",
            "Legal Analysis, Research & Writing I",
            "Professional Development",
            ""
        ],
        [
            "",
            "4 cr",
            "4 cr",
            "4 cr",
            "2.5 cr",
            "1 cr",
            ""
        ],
        [
            "Spring",
            "Contracts (practicum)*",
            "Constitutional Law I",
            "Property (practicum)*",
            "Legal Analysis, Research & Writing II",
            "Elective",
            ""
        ],
        [
            "",
            "4-5 cr",
            "3 cr",
            "4-5 cr",
            "2.5 cr",
            "3 cr",
            ""
        ],
        [
            "Winter",
            "1L Module",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "1cr",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "JD",
    "title": "",
    "url": "http://www1.villanova.edu/villanova/law/academics/degreeprograms/jd.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043058631.99/warc/CC-MAIN-20150728002418-00169-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 848094725,
    "recordOffset": 848079084,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38296=©1990 - 2015 Villanova University. All rights reserved.}",
    "lastModified": "Wed, 05 Aug 2015 02:14:19 GMT",
    "textBeforeTable": "You will also develop the core practice skills of oral advocacy and legal analysis, writing, and research. Legal Analysis, Research and Writing is a hands-on course offered in small sections to ensure that your writing will be closely supervised by your Legal Writing Professor. You will learn legal research skills and strategy from our team of lawyer librarians, who work in collaboration with the legal writing faculty. In addition you will take a transactional practicum in either Contracts or Property, taught in a small section.  In the practicum sections, you will apply Contract or Property legal theory and draft the actual documents a client would need in real-world applications. You will draft documents based on simulated fact patterns, and your professors will give you detailed feedback. In your first year at Villanova Law, you will acquire a thorough grounding in the five foundation courses: Civil Procedure, Contracts, Criminal Law, Property and Torts.  These courses are taught in one semester modules to allow you and your professors to focus intensively on each subject. The First Year Practical Education Second and Third Years The First Year     Villanova's curriculum",
    "textAfterTable": "* In each section, either Property or Contracts will be offered in the Practicum and will carry 5 credits.    In the spring semester, you will take Constitutional Law I and select one of the four elective courses. The elective course you choose will enrich your first year education by providing a different perspective or offering a different paradigm.  Current elective choices are: Justice and Rights Criminal Procedure The Regulatory State Public International Law Second and Third Years In your second and third years, you will shape your own course of study.  Core courses such as Business Organizations, Evidence, Intellectual Property, International Law, and Sentenciing and Punishment provide the foundation you will need for any area of practice.     More specialized courses such as International Environmental Law, Bioethics, Police Conduct, International Human Rights, Poverty Law, Natural Resources Law, and Mergers and Acquisitions allow you to pursue your interests and career goals.     Simulation courses such as Trial Practice, Interviewing and Counseling, and Mediation will help you develop the skills of a lawyer. The school supports a wide range of externship opportunities at government, profit, and nonprofit organizations which provide the opportunity to learn in a real-world setting.  In our award winning clinics, you can represent real clients in real cases working with full-time clinic faculty.    ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}