{
    "relation": [
        [
            "Category",
            "Software",
            "Preset",
            "Manual",
            "Manual",
            "Software",
            "Manual",
            "Software"
        ],
        [
            "Name",
            "Sub 37 Firmware Version 1.1.0",
            "Factory Presets v1_1",
            "Sub 37 Quickstart",
            "Sub 37 Manual v1.1.0",
            "Phatty Tuner - Alternate Scales Editor",
            "MF Chorus Manual",
            "Theremini Firmware Update v1.1.1"
        ],
        [
            "Added",
            "2015-05-22",
            "2015-05-01",
            "2015-04-30",
            "2015-04-30",
            "2015-04-06",
            "2015-03-13",
            "2015-02-16"
        ],
        [
            "Format",
            "ZIP",
            "ZIP",
            "PDF",
            "PDF",
            "ZIP",
            "PDF",
            "ZIP"
        ],
        [
            "Description",
            "New in 1.1.0 • Sequencer Step Edit Mode • Quick mapping of programmable Mod Destinations • Sequences can now include Skipped Steps and Ratchet • Swing for the Arpeggiator, Sequencer, & Synced LFOs. • Sequencer Mod Destination • Sequencer Mod Only • CV Mapping • Variance parameter for detuning of oscillators • Fixed sequencer MIDI output now sends MIDI notes for both Pitch 2 & Pitch 1 when in Duo Mode. • Fixed when LATCH is on, playing a key, changing KB OCTAVE and then playing the same key now updates the played octave correctly. • Fixed Amp EG Latch ON no longer affects Filter EG. • Fixed Preset Name now updates when you INIT the preset. • Fixed Pitch Bend Up/Down changes now take effect when Local Control is OFF. • Refer to Sub 37 Manual for complete list of changes in v1.1.0",
            "",
            "Updated for Firmware v1.1.0",
            "Sub 37 Manual updated for Firmware v1.1.0",
            "For decades, Moog instruments have been used by adventurous musicians to map the sonic universe. Now they can be used to explore the more exotic reaches of our own planet. With Moog's Phatty Tuner software, musicians can retune each note of the octave and compose in scales once available only to players of hard-to-find world instruments. Indian, Chinese and Turkish scales are now easily accessible along with Meantone, Pythagorean, Just and other historic and experimental temperaments.",
            "",
            "• On a few units, LCD could \"jump\"; problem reduced. • Fixed occasional \"thump\" at end of pitch range when automute turned on. • CV out pitch correction now off by default."
        ],
        [
            "Download Link",
            "Sub_37_v_1_1.zip",
            "Factory_Presets_v1_1.zip",
            "Sub_37_Quick_Start_v1.1.pdf",
            "SUB_37_MANUAL_v1.1.pdf",
            "Phatty_Tuner_Alterate_Scales_Editor.zip",
            "MF_Chorus.pdf",
            "Theremini_Firmware_v1.1.1.zip"
        ]
    ],
    "pageTitle": "Moog Music Inc",
    "title": "",
    "url": "http://www.moogmusic.com/downloads?amp=",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00154-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 579916644,
    "recordOffset": 579900673,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 28 Jul 2015 08:26:57 +0000",
    "textBeforeTable": "<Any>500 Series Analog Delay500 Series Ladder FilterAluminium Minimoog VoyagerAnimoogAnimoog for iPhoneCP-251 Moogerfooger Control ProcessorEmerson Moog Modular SystemEtherwave PlusEtherwave Plus KitEtherwave Standard Exploration KitEtherwave Theremin KitEtherwave Theremin StandardFiltatron Little Phatty Stage ILittle Phatty Stage II Little Phatty Tribute EditionMF BoostMF ChorusMF DelayMF DriveMF FlangeMF RingMF TremMF-101 Lowpass FilterMF-102 Ring ModulatorMF-103 12-Stage PhaserMF-104M Analog DelayMF-104M Super DelayMF-105M MIDI MuRFMF-107 FreqBoxMF-108M Cluster FluxMinimoog Voyager Electric Blue EditionMinimoog Voyager Old SchoolMinimoog Voyager Performer EditionMinimoog Voyager Rack Mount EditionMinimoog Voyager Select SeriesMinimoog Voyager Signature EditionMinimoog Voyager XLMINITAURModel 15MP-201 Multi-PedalSlim PhattySUB 37SUB PHATTYSystem 35System 55Taurus 3 Bass PedalsThereminiVX-351 CV Output Expander for the Minimoog VoyagerVX-352 CV Input Expander for Minimoog Voyager RMEWerkstatt CV ExpanderWerkstatt-01 Moogfest 2014 Kit Product <Any>ManualPresetSoftware Category",
    "textAfterTable": "1 2 3 4 Next Last PRODUCTS NEWS LEGACY SIGHT & SOUND DEALERS SUPPORT LOGIN CREATE ACCOUNT FORUM CONTACT Mailing List Email Address: *",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}