{
    "relation": [
        [
            "Series",
            "1996 NLCS",
            "1985 WS",
            "1934 WS",
            "2012 NLCS",
            "2007 ALCS",
            "1956 WS",
            "1909 WS",
            "2004 ALCS",
            "1986 ALCS",
            "1912 WS",
            "1988 NLCS",
            "1987 NLCS",
            "1945 WS"
        ],
        [
            "Winner",
            "Braves",
            "Royals",
            "Cardinals",
            "Giants",
            "Red Sox",
            "Yankees",
            "Pirates",
            "Red Sox",
            "Red Sox",
            "Giants",
            "Dodgers",
            "Cardinals",
            "Tigers"
        ],
        [
            "Loser",
            "Cardinals",
            "Cardinals",
            "Tigers",
            "Cardinals",
            "Indians",
            "Dodgers",
            "Tigers",
            "Yankees",
            "Angels",
            "Red Sox",
            "Mets",
            "Giants",
            "Cubs"
        ],
        [
            "Margin",
            "15",
            "11",
            "11",
            "9",
            "9",
            "9",
            "8",
            "7",
            "7",
            "7",
            "6",
            "6",
            "6"
        ],
        [
            "Score",
            "15-0",
            "11-0",
            "11-0",
            "9-0",
            "11-2",
            "9-0",
            "8-0",
            "10-3",
            "8-1",
            "11-4",
            "6-0",
            "6-0",
            "9-3"
        ]
    ],
    "pageTitle": "Giants break game open in 'magical' third inning | sfgiants.com",
    "title": "Largest margin of victory in a Game 7",
    "url": "http://m.giants.mlb.com/news/article/39986282",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00211-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 146919811,
    "recordOffset": 146897011,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "One-sided deciders And every time it seemed like the Cardinals might be able to stop the bleeding, something happened to keep it going. A walk or an error or a misplay. \"That was the key for us in the ballgame. Put some early runs on the board,\" said center fielder Angel Pagan. \"That's what we wanted. Put some early runs up. We never thought we'd win it like this. They're a tough team with great pitching. But we were able to put together some good at-bats against them and get the victory.\" And a big part of the 9-0 shellacking was the bottom of the third inning, when the Giants sent 11 hitters to the plate against three different Cards pitchers. They mixed good hitting and a few breaks and scored five times to take control of decisive Game 7. It turned out to be the knockout punch that floored a lineup that had earned a reputation for its uncanny ability to rally in the postseason. Crawford was talking about another three straight elimination-game wins, which catapulted San Francisco past St. Louis in the National League Championship Series and into the World Series against the Detroit Tigers, beginning Wednesday night at AT&T Park. SAN FRANCISCO",
    "textAfterTable": "Cardinals starter Kyle Lohse had already allowed a run in each of the first two innings when red-hot Marco Scutaro led off the third with a single. Pablo Sandoval followed by ripping a double into left, clapping his hands and exhorting the sellout crowd when he pulled into the bag. Joe Kelly started warming up in the bullpen and Cards pitching coach Derek Lilliquist visited the mound to give him a little extra time. But when Lohse walked Buster Posey to load the bases, manager Mike Matheny couldn't wait any longer and brought Kelly in from the bullpen in an attempt to keep the game from getting out of hand early. It didn't work out the way he hoped. Hunter Pence hit one of the strangest balls in postseason history. Super slow motion showed that it broke his bat and also hit it three different times. The ball started toward shortstop Pete Kozma and then bounced to his left and into center field. Making a bad situation worse, Jon Jay bobbled the ball momentarily, allowing Posey to score all the way from first. Pence ended up on second with a double. \"Right there, we needed a ground ball, exactly what Joe Kelly got us,\" Matheny said. \"[But] they were swinging the bat well and capitalizing on the mistakes that we made. And you have to acknowledge the fact that when a team gets rolling, sometimes it's hard to stop them. It's",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}