{
    "relation": [
        [
            "S#",
            "1",
            "2",
            "3",
            "4",
            "5"
        ],
        [
            "Districts",
            "Swabi",
            "Kohat",
            "Killa Abdullah, Chaman",
            "Mirpur, AJK",
            "Hyderabad"
        ],
        [
            "Region",
            "Abbottabad",
            "Abbottabad",
            "Quetta",
            "Islamabad",
            "Hyderabad"
        ],
        [
            "Dates",
            "1-4 June 2012",
            "1-4 June 2012",
            "1-4 June 2012",
            "1-4 June 2012",
            "1-4 June 2012"
        ],
        [
            "Venue",
            "Gohati Cricket ground",
            "Kohat sports ground",
            "Sadiq Cricket ground, Chaman",
            "Muncipal Stadium, Mirpur(AJK)",
            "Niaz Stadium, Hyderabad"
        ]
    ],
    "pageTitle": "Third Edition of U-16 PCB- PEPSI Cricket Stars Program | Cricket News | PCB",
    "title": "",
    "url": "http://www.pcb.com.pk/news-detail/third-edition-of-u-16-pcb-pepsi-cricket-stars-program.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043058631.99/warc/CC-MAIN-20150728002418-00120-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 651032138,
    "recordOffset": 651023936,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1328=Lahore May 30, 2012: First Phase of PCB-PEPSI Cricket Stars talent hunt Program for U-16 players will start from June 1, 2012 across the country. This is the third Edition of the program which is being conducted by PCB in collaboration with PEPSI International., 1026=The Trials for the year 2012 PCB-Pepsi cricket stars program of this nationwide talent hunt program for young and upcoming players will be held in 5 districts of Punjab, Baluchistan, Sindh and Khyber Pakhtunkhwa simultaneously., 780=Players born on or after September 1, 1996 are eligible to appear for trials. Original Form B of NADRA is required for age verification and no other document in this regard would be accepted.}",
    "textBeforeTable": "PEPSI-PCB STARS PROGRAM FOR U-16s The Schedule of trails for the First Phase is attached: Players clearing the age verification process will be shortlisted for final trials to be held at a later date at respective regional headquarters. 2 days open trials at each of the below mentioned districts would be held under the supervision of regional Head Coaches and NCA Talent Hunt Officers, which will be followed by the age verification process to be conducted by NCA medical panel. Players born on or after September 1, 1996 are eligible to appear for trials. Original Form B of NADRA is required for age verification and no other document in this regard would be accepted. The Trials for the year 2012 PCB-Pepsi cricket stars program of this nationwide talent hunt program for young and upcoming players will be held in 5 districts of Punjab, Baluchistan, Sindh and Khyber Pakhtunkhwa simultaneously. Lahore May 30, 2012: First Phase of PCB-PEPSI Cricket Stars talent hunt Program for U-16 players will start from June 1, 2012 across the country. This is the third Edition of the program which is being conducted by PCB in collaboration with PEPSI International. Press Release May 30, 2012 -->",
    "textAfterTable": "Tag Latest Press Release view all Aug 02, 2015 'Congratulations on winning series in all formats against Sri Lanka' Jul 31, 2015 LG - Super Speed Stars Program 2015 Jul 29, 2015 LG - Super Speed Stars Program 2015",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}