{
    "relation": [
        [
            "Res.",
            "Win",
            "Win",
            "Win",
            "Win",
            "Win",
            "Win",
            "Win",
            "Win",
            "Draw",
            "Win",
            "Win",
            "Win",
            "Win",
            "Win",
            "Win",
            "Win",
            "Win",
            "Win",
            "Win",
            "Win",
            "Win",
            "Win",
            "Loss",
            "Win",
            "Loss",
            "Win",
            "Loss",
            "Win",
            "Win",
            "Win",
            "Loss",
            "Win",
            "Win"
        ],
        [
            "Record",
            "28–4–1",
            "27–4–1",
            "26–4–1",
            "25–4–1",
            "24–4–1",
            "23–4–1",
            "22–4–1",
            "21–4–1",
            "20–4–1",
            "20–4",
            "19–4",
            "18–4",
            "17–4",
            "16–4",
            "15–4",
            "14–4",
            "13–4",
            "12–4",
            "11–4",
            "10–4",
            "9–4",
            "8–4",
            "7–4",
            "7–3",
            "6–3",
            "6–2",
            "5–2",
            "5–1",
            "4–1",
            "3–1",
            "2–1",
            "2–0",
            "1–0"
        ],
        [
            "Opponent",
            "Ruben Villareal",
            "Kevin Randleman",
            "Tsuyoshi Kohsaka",
            "Kengo Watanabe",
            "Keiichiro Yamamiya",
            "Osami Shibuya",
            "Takaku Fuke",
            "Kiuma Kunioku",
            "Osami Shibuya",
            "Manabu Yamada",
            "Masakatsu Funaki",
            "Jason DeLucia",
            "Frank Shamrock",
            "Katsuomi Inagaki",
            "Guy Mezger",
            "Ryushi Yanagisawa",
            "Maurice Smith",
            "Minoru Suzuki",
            "Frank Shamrock",
            "Jason DeLucia",
            "Maurice Smith",
            "Takaku Fuke",
            "Ken Shamrock",
            "Manabu Yamada",
            "Frank Shamrock",
            "Jason DeLucia",
            "Ken Shamrock",
            "Minoru Suzuki",
            "Kazuo Takahashi",
            "Vernon White",
            "Masakatsu Funaki",
            "Takaku Fuke",
            "Ryushi Yanagisawa"
        ],
        [
            "Method",
            "TKO (leg kicks)",
            "Decision (split)",
            "TKO (punches)",
            "TKO (palm strikes)",
            "Submission (rear-naked choke)",
            "Submission (bas rutten neck crank)[29]",
            "Submission (armbar)",
            "Decision (lost points)",
            "Draw",
            "Submission (toe hold)",
            "KO (knee)",
            "TKO (liver shot)[4]",
            "TKO (cut)",
            "TKO (knee to the body)",
            "Submission (heel hook)",
            "Submission (rear-naked choke)",
            "Submission (rear-naked choke)",
            "Submission (guillotine choke)",
            "Decision (split)",
            "Submission (toe hold)",
            "Submission (kneebar)",
            "Submission (heel hook)",
            "Submission (kneebar)",
            "Technical Submission (arm-triangle choke)",
            "Decision (majority)",
            "Submission (guillotine choke)",
            "Submission (rear-naked choke)",
            "KO (knee to the liver)",
            "Technical Submission (heel hook)",
            "Submission (guillotine choke)",
            "Submission (toe hold)",
            "TKO (knee to the liver)",
            "KO (Palm strike & Knee)"
        ],
        [
            "Event",
            "WFA: King of the Streets",
            "UFC 20",
            "UFC 18",
            "Pancrase: 1998 Anniversary Show",
            "Pancrase: Alive 11",
            "Pancrase: 1997 Anniversary Show",
            "Pancrase: Alive 7",
            "Pancrase: Alive 4",
            "Pancrase: Alive 3",
            "Pancrase: Truth 7",
            "Pancrase: 1996 Anniversary Show",
            "Pancrase: Truth 6",
            "Pancrase: Truth 5",
            "Pancrase: Truth 4",
            "Pancrase: Truth 2",
            "Pancrase: Eyes of Beast 7",
            "Pancrase: Eyes of Beast 6",
            "Pancrase: 1995 Anniversary Show",
            "Pancrase: 1995 Neo-Blood Tournament Second Round",
            "Pancrase: Eyes of Beast 5",
            "Pancrase: Eyes of Beast 4",
            "Pancrase: Eyes of Beast 3",
            "Pancrase: Eyes of Beast 2",
            "Pancrase: Eyes of Beast 1",
            "Pancrase: King of Pancrase Tournament Opening Round",
            "Pancrase: Road to the Championship 5",
            "Pancrase: Road to the Championship 3",
            "Pancrase: Road to the Championship 2",
            "Pancrase: Road to the Championship 1",
            "Pancrase: Pancrash! 3",
            "Pancrase: Pancrash! 1",
            "Pancrase: Yes, We Are Hybrid Wrestlers 2",
            "Pancrase: Yes, We Are Hybrid Wrestlers 1"
        ],
        [
            "Date",
            "000000002006-07-22-0000July 22, 2006",
            "000000001999-05-07-0000May 7, 1999",
            "000000001999-01-08-0000January 8, 1999",
            "000000001998-09-14-0000September 14, 1998",
            "000000001997-12-20-0000December 20, 1997",
            "000000001997-09-06-0000September 6, 1997",
            "000000001997-06-30-0000June 30, 1997",
            "000000001997-04-27-0000April 27, 1997",
            "000000001997-03-22-0000March 22, 1997",
            "000000001996-10-08-0000October 8, 1996",
            "000000001996-09-07-0000September 7, 1996",
            "000000001996-06-25-0000June 25, 1996",
            "000000001996-05-16-0000May 16, 1996",
            "000000001996-04-08-0000April 8, 1996",
            "000000001996-03-02-0000March 2, 1996",
            "000000001995-12-14-0000December 14, 1995",
            "000000001995-11-04-0000November 4, 1995",
            "000000001995-09-01-0000September 1, 1995",
            "000000001995-07-23-0000July 23, 1995",
            "000000001995-06-13-0000June 13, 1995",
            "000000001995-05-13-0000May 13, 1995",
            "000000001995-04-08-0000April 8, 1995",
            "000000001995-03-10-0000March 10, 1995",
            "000000001995-01-26-0000January 26, 1995",
            "000000001994-12-16-0000December 16, 1994",
            "000000001994-10-15-0000October 15, 1994",
            "000000001994-07-26-0000July 26, 1994",
            "000000001994-07-06-0000July 6, 1994",
            "000000001994-05-31-0000May 31, 1994",
            "000000001994-04-21-0000April 21, 1994",
            "000000001994-01-19-0000January 19, 1994",
            "000000001993-10-14-0000October 14, 1993",
            "000000001993-09-21-0000September 21, 1993"
        ],
        [
            "Round",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Time",
            "3:24",
            "21:00",
            "14:15",
            "2:58",
            "4:58",
            "3:15",
            "4:28",
            "15:00",
            "15:00",
            "0:54",
            "17:05",
            "8:48",
            "11:11",
            "14:07",
            "19:36",
            "27:35",
            "4:34",
            "15:35",
            "15:00",
            "1:32",
            "2:10",
            "1:52",
            "1:01",
            "1:05",
            "10:00",
            "1:43",
            "16:42",
            "3:43",
            "1:37",
            "1:16",
            "2:58",
            "2:03",
            "0:43"
        ],
        [
            "Location",
            "Los Angeles, California, United States",
            "Birmingham, Alabama, United States",
            "Kenner, Louisiana, United States",
            "Tokyo, Japan",
            "Yokohama, Kanagawa, Japan",
            "Urayasu, Chiba, Japan",
            "Hakata, Fukuoka, Japan",
            "Urayasu, Chiba, Japan",
            "Nagoya, Aichi, Japan",
            "Nagoya, Aichi, Japan",
            "Urayasu, Chiba, Japan",
            "Fukuoka, Fukuoka, Japan",
            "Tokyo, Japan",
            "Tokyo, Japan",
            "Kobe, Hyogo, Japan",
            "Sapporo, Hokkaido, Japan",
            "Yokohama, Kanagawa, Japan",
            "Tokyo, Japan",
            "Tokyo, Japan",
            "Sapporo, Hokkaido, Japan",
            "Urayasu, Chiba, Japan",
            "Nagoya, Aichi, Japan",
            "Yokohama, Kanagawa, Japan",
            "Nagoya, Aichi, Japan",
            "Tokyo, Japan",
            "Tokyo, Japan",
            "Tokyo, Japan",
            "Amagasaki, Hyogo, Japan",
            "Tokyo, Japan",
            "Osaka, Osaka, Japan",
            "Yokohama, Kanagawa, Japan",
            "Nagoya, Aichi, Japan",
            "Urayasu, Chiba, Japan"
        ],
        [
            "Notes",
            "",
            "Won UFC Heavyweight Championship; Later vacated title to drop to lower weight class.",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "Defended King of Pancrase title",
            "",
            "Unified and defended King of Pancrase title",
            "",
            "",
            "",
            "",
            "Won King of Pancrase title",
            "",
            "",
            "",
            "",
            "For King of Pancrase title",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Bas Rutten - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Bas_Rutten",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00049-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 868423631,
    "recordOffset": 868392238,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33627=On October 23, 2013, The World Series of Fighting announced Rutten as a member of the broadcast team for WSOF events on NBCSN along with Todd Harris.[14], 41487=In 2006 Rutten was tapped to coach a team for the International Fight League, an MMA organization that focused on team combat. His team, the Anacondas, defeated the Silverbacks 3–2., 18649=Rutten began his professional mixed martial arts career with the Pancrase organization in Japan. In 1993, Japanese pro wrestlers Masakatsu Funaki and Minoru Suzuki traveled to the Netherlands to scout fighters for their new \"hybrid wrestling\" (Bushido wrestling) organization, featuring submission fighting, but with no closed fisted strikes to the face. A precursor to modern mixed martial arts, the organization was the first of its kind, and featured early MMA names Frank Shamrock, Vernon White, Maurice Smith, Ken Shamrock, and Guy Mezger., 37815=In 2009, he appeared in the music video for Listen to Your Friends by the rock band New Found Glory, \"fighting\" lead vocalist Jordan Pundik., 27186=Rutten then defended his title against both Frank Shamrock and the last one was against Masakatsu Funaki which he talked about above, and in so doing became a three-time King of Pancrase. In 1996, he relinquished his title to be present for the birth of his second daughter.[6] Rutten returned to Pancrase, taking 8 more victories, bringing his unbeaten streak up to 19 straight fights., 43129=On May 2006, Rutten announced his return to MMA competition. Cleared by doctors to fight again, Rutten was slated to face Kimo Leopoldo in the now defunct World Fighting Alliance on July 22, 2006, at The Forum in Los Angeles. Two days before the event, Kimo tested positive for Stanozolol, an anabolic steroid. In place of Kimo, Rutten fought Ruben \"Warpath\" Villareal. Rutten took a first-round victory by way of technical knockout after low kicks left his opponent unable to stand. With that he brought up his professional record to 28 wins 4 losses and 1 draw., 9534=As a professional fighter, one of his favorite tactics was the liver shot (both punch and kick), and he popularized its use in MMA.[4][5] Rutten is known for his charisma and has capitalized on his celebrity status since retiring from fighting in 1999. He has worked as a color commentator in several MMA organizations, including Pride, and has appeared in numerous television shows, movies, and video games. He also coaches MMA and has authored several instructional materials., 37329=On January 23, 2008, he was announced as the new Vice President, Fighter Operations reporting directly to IFL CEO Jay Larkin. His role was to build relations between the IFL and its fighters as well as work on potential match-ups between fighters. He also hosted the weekly shows \"Battleground\" and \"International Fight League\" with Kenny Rice. This all ended when IFL went out of business in late 2008., 31477=While training for his next UFC fight in 1999, Rutten suffered multiple serious injuries, including blowing out his knee (a long running injury), tearing his biceps, and suffering a neck injury. He was forced to retire from MMA competition for the time being, by doctors orders.[6], 35311=Rutten competed in Japanese professional wrestling a few times for NJPW from 2000 to 2002, including an IWGP title match against Yuji Nagata., 24493=Rutten then avenged his loss to MMA legend Masakatsu Funaki in 1996 in what is considered to be one of the greatest fights in Pancrase history. Rutten described the war with Funaki in an interview:, 27693=Rutten left Pancrase as one of the most dominant fighters in the history of the organization. MMA legend Ken Shamrock was the only fighter Rutten did not avenge a loss to. In 2000, when Rutten was PRIDE FC's color commentator, a third fight with Shamrock was entertained. Rutten agreed to come out of retirement to fight Shamrock in PRIDE FC. However, Shamrock stated that he already beat Rutten twice and that a third time wasn't necessary. Later, in 2002, Rutten said that he would not fight Shamrock again even if it was offered to him because of the friendship they developed over the years, and that he could not put his mind and heart into fighting Ken.[11], 44337=On May 22, 2015 UFC President Dana White appeared on Inside MMA to announce that Rutten would be inducted into the UFC Hall of Fame during International Fight Week in July. Rutten is the first European to be inducted, taking his place in the \"Pioneers\" wing of the UFC's new look Hall of Fame.[21][22], 39319=Rutten featured in 2012 American sports comedy movie Here Comes the Boom alongside Kevin James and Henry Winkler. Rutten played the role of a former MMA fighter and Dutch immigrant Niko trying to gain US citizenship. In return for his help in gaining citizenship Niko helps train 42 year old biology teacher Scott (Kevin James) to become a MMA/UFC fighter. The film also features former UFC fighter Krzysztof Soszynski, former Muay Thai kickboxer Mark DellaGrotte along with cameo roles for Bruce Buffer, Chael Sonnen, Jason Miller, Satoshi Ishii, Mark Muñoz, Herb Dean, Wanderlei Silva, and Joe Rogan amongst others., 28759=In 1998, Rutten signed with the UFC, the biggest MMA promotion in the United States. Rutten entered the UFC with a massive amount of hype; he was undefeated in his last 19 fights and was touted by the organization as the greatest martial artist on the planet., 17867=In perhaps the biggest fight of his kickboxing career, Rutten faced Frank Lobman for the European Muay Thai title on February 12, 1991. Lobman won by TKO in the first round.[8], 34395=After his retirement from fighting in 1999, Rutten focused on becoming an actor, getting small parts on TV shows such as Martial Law, 18 Wheels of Justice, The King of Queens, \"Lights Out\" and the Canadian series Freedom, as well as appearing in low budget movies such as Shadow Fury, The Eliminator, and the comedy short The Kingdom of Ultimate Power which was featured in the 2005 L.A. Film Festival. It also won the first prize at the short film festival in NY for \"best comedy\"., 29887=On May 7, 1999, at UFC 20, Rutten faced Kevin Randleman for the UFC Heavyweight Championship. The first four minutes consisted of Rutten taking a lot of punishment from his guard. However, after the fight was stood up to check Rutten's cut, Rutten landed a devastating liver kick to Randleman's body to turn the tide of the fight. Randleman's pace slowed down considerably after the liver kick, which ultimately helped Rutten score judges' points by being the more active fighter. Rutten pounded away at Randleman from inside his guard, using elbow strikes to open up cuts on top of Randleman's head and punching Randleman to the face. The fight went into overtime, with Rutten taking a very close split decision victory to become the UFC Heavyweight Champion. Judging at that point was not based on the current 10-point must system, but who the judges felt won the fight overall., 35639=Rutten was also the color commentator for the English productions of Pride Fighting Championships events, calling nearly every event from Pride 1 through the 2005 Grand Prix. Known for his sense of humor and first hand knowledge of the sport, Rutten quickly became a fan favorite commentator. In April 2006 he announced that he would not continue to announce for Pride, due to the constant flying to Japan, and being away from his family every month.[15], 6970=Sebastiaan \"Bas\" Rutten (Dutch pronunciation: [ˈbɑs ˈrʏtə(n)]; born February 24, 1965) is a Dutch retired mixed martial artist (MMA), Karate and Taekwondo blackbelt, and Muay Thai kickboxer. He was a UFC Heavyweight Champion, a three-time King of Pancrase world champion, and finished his career on a 22 fight unbeaten streak (21 wins, 1 draw). Fight Matrix lists Rutten as the third MMA heavyweight lineal champion with the second longest reign in MMA history.[2] FightMextrix also wrote this when Rutten got inducted into the UFC Hall Of Fame: FightMetric, the official statistics provider for the UFC, ran the numbers on Rutten’s career. They back up the Dutchman’s inclusion into the UFC Hall of Fame and then some. In the 4-hours, 27-minutes and 8-seconds he spent as a pro fighter, Rutten scored 13 knockdowns without getting dropped himself, his significant strike accuracy was 70.6%, the highest FightMetric has ever recorded, attempted a record 53 submissions and successfully swept his opponents a record 46 times.}",
    "lastModified": "Sun, 02 Aug 2015 08:11:11 GMT",
    "textBeforeTable": "1 Draws 1 3 By decision 3 13 By submission 0 12 By knockout 4 losses 28 wins 33 matches Professional record breakdown Mixed martial arts record[edit] Mixed Martial Arts Hall of Fame[28] Sherdog Two successful title defenses Unified the King of Pancrase Championship King of Pancrase Openweight Championship (Three times) Pancrase Hybrid Wrestling UFC World Heavyweight Championship (One time) UFC Hall of Fame Ultimate Fighting Championship Mixed Martial Arts[edit] Championships and accomplishments[edit] Bas Rutten is known for his legendary bar fights around",
    "textAfterTable": "Filmography[edit] Year Title Role Notes 1992 Shadow of the Dragon Kismet Film 1999 Martial Law Roman Van Reit TV Episode: \"Nitro Man\" 2000 Freedom The Bad Guy TV Episode: \"Lonewolf\" 2000 The King of Queens Emil TV Episode: \"Party Favors\" 2001 Shadow Fury Kismet (Adult) Film 2002 The Smashing Machine Himself Documentary 2002 Modern Warriors Himself Documentary 2002 NJPW Samurai TV Himself TV series 2004 The Eliminator Dakota Varley Film 2005 The Vault General Matos Film 2005 The King of Queens Niles TV Episode: \"Deconstructing Carrie\" 2005 The Kingdom of Ultimate Power Vlad Rifka Short 2006 IFL: International Fight League Announcer TV series 2006 Backlash Grazer Film 2007 Fight Science Himself TV Documentary 2007 The Modern Warrior Himself TV Documentary 2008 Grand Theft Auto IV Himself (voice)/Niko Bellic (motion-capture fighting double) Video Game 2008 Fight Science Himself TV Episode: \"Fighting Back\"",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}