{
    "relation": [
        [
            "Batsman",
            "Ricky Ponting",
            "Jacques Kallis",
            "Rahul Dravid*",
            "Mahela Jayawardene",
            "Sachin Tendulkar",
            "Matthew Hayden",
            "Kumar Sangakkara",
            "Graeme Smith*",
            "Virender Sehwag*",
            "VVS Laxman",
            "Shivnarine Chanderpaul",
            "Mohammad Yousuf",
            "Brian Lara*",
            "Chris Gayle"
        ],
        [
            "Aus(h)",
            "-",
            "1.0493",
            "0.9357",
            "1.0799",
            "0.9183",
            "-",
            "1.0799",
            "1.0679",
            "0.9356",
            "0.9584",
            "0.9517",
            "-",
            "1.0891",
            "0.8670"
        ],
        [
            "Aus(a/n)",
            "-",
            "0.9353",
            "0.8458",
            "1.0310",
            "0.8893",
            "-",
            "1.0465",
            "0.9171",
            "0.8076",
            "0.8530",
            "1.1543",
            "1.1473",
            "1.2303",
            "0.9263"
        ],
        [
            "Eng(h)",
            "0.7602",
            "0.9367",
            "0.9295",
            "0.9034",
            "0.8808",
            "0.7555",
            "0.9034",
            "0.9308",
            "0.9390",
            "0.8513",
            "0.9722",
            "0.8558",
            "1.0850",
            "0.8804"
        ],
        [
            "Eng(a/n)",
            "0.8975",
            "0.9295",
            "0.8048",
            "0.9935",
            "0.8072",
            "0.9176",
            "0.99135",
            "0.8195",
            "0.7216",
            "0.7994",
            "1.0476",
            "0.9556",
            "1.2345",
            "1.0749"
        ],
        [
            "Ind(h)",
            "0.7362",
            "0.9824",
            "-",
            "0.7756",
            "-",
            "0.7055",
            "0.7756",
            "1.1856",
            "-",
            "-",
            "0.9237",
            "0.6944",
            "0.9250",
            "0.9250"
        ],
        [
            "Ind(a/n)",
            "0.9803",
            "0.8805",
            "-",
            "0.8823",
            "-",
            "0.9833",
            "0.8823",
            "0.8141",
            "-",
            "-",
            "1.0987",
            "0.7859",
            "",
            "1.1637"
        ],
        [
            "NZ(h)",
            "0.7495",
            "0.9599",
            "0.5993",
            "0.7634",
            "0.7478",
            "0.7476",
            "0.7645",
            "0.9921",
            "0.5994",
            "0.5994",
            "0.9347",
            "0.7107",
            "1.0804",
            "1.0804"
        ],
        [
            "NZ(a/n)",
            "0.6821",
            "0.7748",
            "0.9980",
            "1.1236",
            "0.8450",
            "0.7841",
            "1.1236",
            "0.7748",
            "0.9980",
            "0.9980",
            "1.0011",
            "0.9887",
            "1.1582",
            "1.0527"
        ],
        [
            "Pak(h)",
            "0.8298",
            "0.9757",
            "0.7167",
            "1.0553",
            "0.8148",
            "0.7949",
            "1.0657",
            "0.9756",
            "0.7741",
            "0.7899",
            "1.0465",
            "-",
            "1.0622",
            "1.1037"
        ],
        [
            "Pak(a/n)",
            "1.2303",
            "0.8589",
            "0.6545",
            "0.8867",
            "0.6840",
            "1.1382",
            "0.7290",
            "0.8589",
            "0.6545",
            "0.6545",
            "1.0459",
            "-",
            "0.9080",
            "0.9351"
        ]
    ],
    "pageTitle": "Measuring batting averages effectively | Cricket | ESPN Cricinfo",
    "title": "Quality measure (bowling average of opposition and runs/wicket in match)- base value: 31.44",
    "url": "http://www.espncricinfo.com/blogs/content/story/618395.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00014-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 433174875,
    "recordOffset": 433134465,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{746=VVS Laxman and Virender Sehwag have eased much of the burden on Tendulkar in this decade with some exceptional performances. Shivanrine Chanderpaul and Brian Lara were the best batsmen for the West Indies in an otherwise forgettable decade. Lara retired on a high scoring 21 centuries in the 2000s. Mohammad Yousuf had a brilliant first half of the decade including a record breaking 2006 when he went past Viv Richards' aggregate runs in a calendar year., 1564=Ricky Ponting has had a wonderful decade as can be seen from his position at the top of the tree. After his horror run in India in 2000-01, he was unstoppable for the next six years, but has shown signs of decline over the last two years. Jacques Kallis and Rahul Dravid have been the rocks of the middle order for their respective teams. Dravid though has been slightly on the wane over the last three years which has seen his average drop from almost 59 to around 54. Mahela Jayawardene and Kumar Sangakkara have contributed immensely to Sri Lanka's rise as a competitive Test team, especially at home. Sachin Tendulkar's recent resurgence has stunned everybody and the early years of the 2000s when his injuries led to some poor performances have now been forgotten completely., 2470=The base value to measure the quality of an innings is calculated as the geometric mean (square root of the product) of the batting average (30.61) and bowling average (32.31) since Jan 1 1940. The quality index value obtained is 31.44. For each batsman, the similar values are calculated and measured with respect to the base value to obtain the accurate or effective average. For example if the batting and bowling average are 30 and 32 respectively , then the geometric mean is 30.98 and the quality factor is obtained by dividing the base value by the mean which yields 1.0147.}",
    "TableContextTimeStampAfterTable": "{72634=That Tendulkar is so low on the effective averages was a bit of a surprise. I think it might be because of the relatively bad patch of his from 2004 till 2007. Since 2008 he has been phenomenal., 79472=Two questions: 1) Is the runs/wicket value for both teams in the match or only the team of the batsman in question? 2) Why did you pick the date of Jan 1 1940 as the cut-off to calculate the base value?, 29649=A similar approach yields an average of 85.23 for Bradman (three weak teams played considered minnows) and 51.45 for Gavaskar. The approach can be further modified to calculate period wise averages to understand the batting quality better. Gavaskar for example averages almost 83 with 10 centuries against the West Indies prior to 1980 when the bowling attack was not at its best, but only 41 after 1980 with just three hundreds in dull draws, in between falling seven times to Malcolm Marshall before crossing 20., 60991=@Jason At around end 2006, my sentiments were similar to yours- Just reverse the names Lara and Tendulkar. By end 2002 Tendulkar was widely acknowledged as the Best batsman of the generation (http://www.cricinfo.com/southafrica/content/story/122437.html ). This was based on mostly a decade of dominance over his peers since ’93 - surpassed only by unsurpassable Bradman., 58530=But yes, Lara's standing in the batting pantheon will remain pretty safe given his home series vs. Aus in the late '90s (which included THAT 153*) and the 2001 series in SL., 56419=Just for a while,forget about the figures which are easily noticeable,what remains out of the figure is getting those runs under pressure.Laxman's epic 281,sachin's classy 241 in sydney,ponting's brilliant run vs india recently,though in a losing cause,lara's colossal scores in sri lanka in early 2000 were all undder pressure situation worth more than hayden's 380 vs zimbabwe.imagine the weight of expectation on shoulders of sachin ,a billion of those.and longetivity might divert u away from focus,bowlers know your weaknesses.and then to go and score shows your calibre. Is there such a mechanism to measure that pressure?I wonder!, 11305=The fact that Ponting played in a top class team meant that victories were assured more often than not and also meant he faced weaker attacks for much of the 2000s. He struggled in the subcontinent, but was very successful at home and in South Africa. The Pakistani attacks were far less potent away in the 2000s after the retirement of Wasim Akram and Waqar Younis. All this pointed to Ponting facing comparatively weaker attacks in fairly easy conditions which is quite clearly a blot on an otherwise superb decade. Kallis has faced fairly consistent attacks throughout. His run glut against the minnows does pull his average down. Rahul Dravid's best performances usually came when the chips were down and he has been very prolific in almost all away conditions. A considerable proportion of his runs though, have been made against the weakened West Indies and the minnows. Jayawardene and Sangakkara have scored tons of tuns against Bangladesh home and away boosting their averages. They have hardly played and succeeded in Australia and South Africa though Sangakkara's 192 at Hobart was one of the best innings of the decade. Sri Lanka's awesome home record and ordinary away record is very evident from the less impressive showing of these two batsmen in away matches. Matthew Hayden resurrected his career on the 2000-01 tour of India and proceeded to amass 30 centuries at a rate only next to Bradman. He, like Ponting, played in a top team and faced ordinary attacks throughout. His away performance was definitely under par when compared to his home batting., 87864=good analysis ananth...... I m not much surprised to see Brain Charles Lara at the top as i always considered him the best among his generation player simply based on important innings he played when no one else even could stay at the cresae to give him a bit od support..... sri lanka 2001 is the best example..... And as i noted, sachin's avg dips to 36in matches involving GD McGrath and is also much lower than his already lesser avg aginst RSa..... Can u tell me Sach's n lara's effective avg in 90s........ but Mahela above Ricky, found a bit shocking considering mahela's poor away record but how is this batting n bowling avg calculated.... is this total no. of runs scored by all the batsman divded by total innings played by them all??..... if it is so, i think bowling avg of current aussie team wud b just too high........ as their strike bowlers haven't taken too many wickets but likes of clarke n kattich might have given huge runs over the course of their career...., 63833=As we know it is relatively easier to maintain standards over shorter periods of time. When Lara retired in Nov.2006- Ponting avg. 66 from Jan 2000. Dravid 64. Their stats have since taken a pounding. This would have surely happened to Lara as well- he avg.41 in his last year. So- as of Lara's retirement Ponting,Dravid etc would have actually had a much higher \"effective\" average., 55818=It is interesting to note that the only batsman who has crossed 1000 runs against an opponent both in home and away test matches is none other than VVS Laxman(1082 in 22 home test matches and 1034 in 17 tests in australia against australia).With slight modifications in the parameters used,this might put him at the top of the list., 71063=Those thinking SRT failed against McGrath in tests should note that SRT played only 7 tests vs McGrath when healthy (1996-2001) and averaged 48 with 2 100's, 4 50's, 2 freak dismissals, and 3 terrible decisions. Notice how well he has done vs Steyn., 61372=Then as Tendulkar stumbled mainly due to a string of serious injuries- all his contemporaries embarked on the most prolific batting period in the history of cricket. By 2006 (in a span of 3 /4 years), apparently just about everyone was “actually” better than Tendulkar. We had to put up with so-called “analyses” and “debates” stating that Tendulkar was not even the best batsman in his own team. Needless, to say this was through the careless (or ignorant) use of “overall” stats..So, in 3 /4 yrs of run feasting just about everyone was now “better” than someone who had outperformed all his peers for a decade., 65734=I know you will not publish my comment cos it argues against ur analysis ... but somehow, this is very very subjective .. not rating sehwag's 300s and 293 very highly are blasphemous according to me ... 309 was against akhtar and sawi in pakistan ... 319 was against steyn and morkel chasing 500+ target ... 293 was in a day against murali chasing 400+ ... of these knocks are not great .. nothing is great in cricket ... these are right among the top of my best test innings .. but u moght disagree .. for that matter, sachin recent run of form is against the weakest overall bowling standard in the world for the last 20 years ... same applies to dravid .. 270 in pak against the same attack sehwag hit 309 .. 232 in sus against a weak aussie attack... 217 in eng in 2002 against 2nd test harmison etc ... the question is .. where do u draw a line ..., 83555=E.g. Lara toured Australia in 2006 and Tendulkar in 2008, both instances when Australia were ranked #1., 13769=Brian Lara played in a team accustomed to losing in the 2000s. Right from the remarkable 2001 tour of Sri Lanka where he scored 688 runs in 3 Tests only to lose 3-0, he has made runs home and away against all opponents. His average against Australia is 47 in matches involving McGrath. His otherwise ordinary showing against England is boosted by the unbeaten 400 in Antigua. His consistency was exceptional in the last 3-4 years as he scored hundreds against Pakistan and South Africa home and away. Chanderpaul's case is similar as he has been part of a very weak outfit for much of this decade and has done brilliantly in losing causes., 35228=On Gavaskar's failure against WI, it is made to seem as if he failed against WI with a 41 average when their attack was at its most potent. However, one must place the average in the context of his career. In his first 50 matches, ending in 1979 at the Oval, he averaged 57, with 20 centuries. In the next 75 matches, he averaged 43, with 14 centuries. This contrast is hardly brought about because of WI since his average against them in this period is not significantly below his overall stats for this period, and WI were hardly the life threatening force they have been in the period 1977 to 1981 when India did not play them at all. The plain fact is that Gavaskar went through a prolonged 5 year slump from 1980 to 1985, and was roused out of this slump in 1-2 series against Pak in Pak and WI in India. After 1985 he gave captaincy up and his stats started improving. Generally, since his career is associated with WI, any failure is also attributed in a shallow manner to WI. Hardly so., 37462=@Boll: I simply responded to Mark James in the manner he wrote that comment. India has won >40% tests vs Eng/SA/Aus over 2008-10, and SRT/VVS/Sehwag/Gambhir have struck gold over this period. These guys are *really* batting as well as their numbers indicate., 25684=** The quality value for Ponting and Hayden in the ICC World XI match is 1.2964.}",
    "textBeforeTable": "** The tables are in two parts for sake of clarity ***Ricky Ponting and Matthew Hayden played one Test against ICC W XI scoring 54 and 188 runs in two innings respectively. The calculations for these are done separately and included. VVS Laxman and Virender Sehwag have eased much of the burden on Tendulkar in this decade with some exceptional performances. Shivanrine Chanderpaul and Brian Lara were the best batsmen for the West Indies in an otherwise forgettable decade. Lara retired on a high scoring 21 centuries in the 2000s. Mohammad Yousuf had a brilliant first half of the decade including a record breaking 2006 when he went past Viv Richards' aggregate runs in a calendar year. Ricky Ponting has had a wonderful decade as can be seen from his position at the top of the tree. After his horror run in India in 2000-01, he was unstoppable for the next six years, but has shown signs of decline over the last two years. Jacques Kallis and Rahul Dravid have been the rocks of the middle order for their respective teams. Dravid though has been slightly on the wane over the last three years which has seen his average drop from almost 59 to around 54. Mahela Jayawardene and Kumar Sangakkara have contributed immensely to Sri Lanka's rise as a competitive Test team, especially at home. Sachin Tendulkar's recent resurgence has stunned everybody and the early years of the 2000s when",
    "textAfterTable": "Top run-getters in the 2000s (minimum qualification 6000 runs) Batsman SA(h) SA(a/n) SL(h) SL(a/n) WI(h) WI(a/n) Bang(h) Bang(a/n) Zim(h) Zim(a/n) Ricky Ponting 915(17) 867(17) 207(5) 198(6) 707(19) 846(11) 69(2) 191(3) 259(3) - Jacques Kallis - - 257(7) 318(10 929(11) 942(22) 254(4) 63(3) 112(2) 388(3) Rahul Dravid 453(12) 504(16) 542(7) 662(21) 148(5) 1260(22) - 560(10) 504(6) 475(7) Mahela Jayawardene 1158(12) 314(10) - - 335(8) 294(7) 556(7) 304(7) 167(4) 137(2) Sachin Tendulkar 414(11) 392(10) 386(9) 485(11) 306(5) 331(8) - 820(9) 616(6) 199(4) Matthew Hayden 862(18) 540(11) 381(7) 283(6) 681(14) 379(8) 61(2) 107(3) 501(3) - Kumar Sangakkara 790(12) 392(10) - - 452(8) 238(7) 592(7) 284(7) 255(4) 281(2) Graeme Smith - - 88(3) 179(4) 717(12) 876(13) 408(4) 335(5) 162(2) - Virender Sehwag 924(11) 238(9) 547(7) 692(11) 286(5) 357(7) - 176(6) 74(1) 102(3) VVS Laxman 333(9) 330(9) 370(9) 494(11) 271(4) 731(15) - 117(4) 31(2) 249(6) Shivnarine Chanderpaul 820(15) 533(11) 130(4) 154(4) - - 108(2) 39(3) 73(3) 186(6) Mohamamad Yousuf 96(3) 255(8) 285(12) 338(11) 665(5) 549(9) 227(4) 276(2) - 222(3) Brian Lara 793(15) 531(8) 299(3) 688(6) - - 173(2) - - 222(4) Chris Gayle 814(20) 545(10) 164(7) 54(6) - - 221(3) 126(3) 46(3) 307(7) The fact that Ponting played in a top class team meant that victories were assured more",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}