{
    "relation": [
        [
            "Pin#",
            "1",
            "3",
            "5",
            "7",
            "9",
            "11",
            "13",
            "15",
            "17",
            "19",
            "21",
            "23",
            "25",
            "27",
            "29",
            "31",
            "33"
        ],
        [
            "Name",
            "unknown",
            "A16",
            "A15",
            "A12",
            "A7",
            "A6",
            "A5",
            "A4",
            "A3",
            "A2",
            "A1",
            "A0",
            "D0",
            "D1",
            "D2",
            "IOW#",
            "GND"
        ],
        [
            "Description",
            "?",
            "Address line A16",
            "Address line A15",
            "Address line A12",
            "Address line A7",
            "Address line A6",
            "Address line A5",
            "Address line A4",
            "Address line A3",
            "Address line A2",
            "Address line A1",
            "Address line A0",
            "Data line A0",
            "Data line D1",
            "Data line D2",
            "Control line IOW#",
            "Ground"
        ],
        [
            "Pin#",
            "2",
            "4",
            "6",
            "8",
            "10",
            "12",
            "14",
            "16",
            "18",
            "20",
            "22",
            "24",
            "26",
            "28",
            "30",
            "32",
            "34"
        ],
        [
            "Name",
            "VCC +5 Volt",
            "A18",
            "A17",
            "A14",
            "A13",
            "A8",
            "A9",
            "A11",
            "OE#",
            "A10",
            "JP800.1",
            "D7",
            "D6",
            "D5",
            "D4",
            "D3",
            "IOR#"
        ],
        [
            "Description",
            "n/a",
            "Address line A18",
            "Address line A17",
            "Address line A14",
            "Address line A13",
            "Address line A8",
            "Address line A9",
            "Address line A11",
            "Chip Enable Line OE#",
            "Address line A10",
            "BIOSCS#",
            "Data line D7",
            "Data line D6",
            "Data line D5",
            "Data line D4",
            "Data line D3",
            "Control line IOR#"
        ]
    ],
    "pageTitle": "Difference between revisions of \"Board:nokia/ip530\" - coreboot",
    "title": "JDEBUG connector",
    "url": "http://www.coreboot.org/index.php?title=Nokia_IP530&diff=10436&oldid=10430",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00305-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 375272047,
    "recordOffset": 375254279,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{36720=Put the mainboard upside down, and the power connector facing you. Find the footprint of the 82371 southbridge. Locate the two pads; i directly above (about 1.5 mm) the F1 pin of the SB, and 1 to left (about 15mm) of the A5 pin of the SB., 40454=OSes tested: Linux 2.6.32 and freeBSD 8.1 (unknown if all devices work as they work under Linux), 9627=The current development status is; Coreboot runs with seaBIOS. Linux 2.6.32 runs on the system, and most devices are supported. But there are still things to findout. Currently one IP530 runs as a server with Ubuntu 10.10.}",
    "textBeforeTable": "The JDEBUG connector can be used for attaching an external ROM (flash chip) to the board for BIOS development. J-DEBUG Below the description is given for the connectors on the mainboard of the Nokia IP530, due missing documentation of the manufacturer. 4 SD-RAM sockets. Texas instruments PCI1225 PCMCIA/Cardbus controller with TPS22061 slot controller. 4 intel 21143PD ethernet controllers with KS8716 PHY interface. LM78 power controller. SMSC FDC37B787 superio. 28F400, 512 Kbyte flashrom. intel 21150 PCI to PCI bridge. 82371 southbridge. I440BX northbridge. Pentium III. On board of the IP530 can be found the following: System Setup Supported flashrom revision 1010 or higher. OK Flashrom N/A Wake on mouse N/A Wake on keyboard N/A Wake on LAN N/A Wake on modem ring N/A Random number generator (RNG) N/A High precision event timers (HPET) Special-purpose LEDs available on the board, Alert and Fault are controlled by the superio OK",
    "textAfterTable": "For recovery there can be placed an flashrom board on the J-DEBUG connector. Belowe here the schematic in PDF can be used. Schematic ROM option board As wel the PCB layout in PDF, for this print it on a transparant paper in the highest quality (so it will be very black). From this a PCB can be made. Printed Circuit Board (PCB) layout The 34 pin connector shoud be female 90 degres, so that the board is upright when attached to the IP530. you can select a 32 DIL socket, 32 PLCC socket, but not both flashroms inserted only one at the time. The overview can be used to place the components and solder them in. The red lines in the overview are wires that need to be soldered in. Components overview PCB When ready flash the rom in a programmer and inserted it into a socket. Attach the board to the main board of the IP530 (notice the PIN 1 of both boards, when you put it wrong the flashrom on the option board will be blown-up. Jumper JP800 - BIOSCS select This jumper selected the on-board flash or the J-DEBUG connector where the BIOSCS# line is routed. J800 Jumper Pin# Name Description 1 JDEBUG.P22 This is connected to PIN 22 of",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}