{
    "relation": [
        [
            "",
            "Chest",
            "Waist",
            "Hip",
            "Torso"
        ],
        [
            "XS",
            "30 - 31.5in (76.2 - 80cm)",
            "24 - 25in (61 - 63.5cm)",
            "33 - 34.5in (83.8 - 87.6cm)",
            "57 - 58.5in (144.8 - 148.6cm)"
        ],
        [
            "S",
            "32 - 33.5in (81.3 - 85.1cm)",
            "25.5 - 27in (64.8 - 68.6cm)",
            "35 - 36.5in (88.9 - 92.7cm)",
            "59 - 60in (149.9 - 152.4cm)"
        ],
        [
            "M",
            "34 - 35.5in (86.4 - 90.2cm)",
            "27.5 - 29in (69.8 - 73.7cm)",
            "37 - 38.5in (94 - 97.8cm)",
            "60.5 - 61.5in (153.7 - 156.2cm)"
        ],
        [
            "L",
            "36 - 37.5in (91.4 - 95.2cm)",
            "29.5 - 31in (74.9 - 78.7cm)",
            "39 - 40.5in (99.1 - 102.9cm)",
            "62 - 63in (157.5 - 160cm)"
        ],
        [
            "XL",
            "38 - 39.5in (96.5 - 100.3cm)",
            "31.5 - 32.5in (80 - 82.5cm)",
            "41 - 42in (104.1 - 106.7cm)",
            "63.5 - 64.5in (161.3 - 163.8cm)"
        ]
    ],
    "pageTitle": "TYR Carbon VLO Women's Shorts | Competitive Cyclist",
    "title": "Women's Triathlon Apparel",
    "url": "http://www.competitivecyclist.com/tyr-carbon-vlo-womens-shorts?ti=UExQIENhdDpXb21lbidzIFRyaSBCb3R0b21zOjE6MjA6Y2NDYXQxMDAzNzE",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00218-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 375110775,
    "recordOffset": 375072465,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "TYR Size chart 1 year Manufacturer Warranty: triathlon Recommended Use: 50 SPF Rating: no Removable Chamois: variable Chamois Thickness: yes, Carbon VLO Chamois: 9 in Inseam: anatomic Fit: [shorts] 80% nylon, 20% spandex Material: Tech Specs The TYR Carbon VLO Women's Shorts are available in five sizes from X-Small to X-Large and in the color Black/red. Furthering this level of comfort, TYR included its new Carbon VLO chamois. This insert features a fully-elastic construction in order to support and follow all of your movements in the saddle. And in addition to this, TYR has also constructed the VLO from three different densities of foam. So, the insert supports your body where",
    "textAfterTable": "NOTE: To cater to different needs and budgets, TYR engineers two triathlon lines. Competitor garments offer a compressive fit, while carbon garments offer a super compressive fit for a second-skin feel. You should select your same, standard size for both carbon and competitor garments but expect slightly different fits. How to Measure: For best results take measurements over your underwear, keeping the tape a bit loose. Chest: Measure under your arms, around the fullest part of your chest. Waist: Bend to the side and measure around the place where your waist bends, keeping the tape a bit loose. Hip: Stand with feet together and measure around the fullest part of the hip. Torso: With someone's help, run a tape measure full circle from your shoulder at the neck, over the fullest part of your chest, down through the center of your crotch and back up to the starting point. We recommend together Add to cart 100% Guaranteed Returns",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}