{
    "relation": [
        [
            "Year",
            "1950",
            "",
            "",
            "1951",
            "",
            "",
            "",
            "1952",
            "",
            "1953",
            "1954",
            "1955",
            "1956",
            "1957",
            "1958",
            "1959",
            "1960",
            "Total"
        ],
        [
            "Engine",
            "Maserati",
            "Milano",
            "Offenhauser",
            "Maserati",
            "Milano",
            "Offenhauser",
            "Osca",
            "Maserati",
            "Plate",
            "Maserati",
            "Maserati",
            "Maserati",
            "Maserati",
            "Maserati",
            "Maserati",
            "Maserati",
            "Maserati",
            ""
        ],
        [
            "Driver",
            "Prince Bira, F Bonetto, A Branca, AL Chiron, JG Fry, F González, E de Graffenried, DA Hampshire, D Murray, C Pagani, R Parnell, A Pian, P Pietsch, F Rol, B Shawe-Taylor",
            "F Bonetto, G Comotti",
            "FL Agabashian, HE Banks, T Webb",
            "A Branca, AL Chiron, P Fotheringham-Parker, F Godia, E de Graffenried, J James, J Jover, D Murray, P Pietsch, H Schell",
            "OA Marimón",
            "J McDowell",
            "Prince Bira",
            "LERB Bianco, F Bonetto, ED Cantoni, P Etancelin, J Flinterman, F González, FS Landi, F Rol",
            "AA Crespo, E de Graffenried, H Schell",
            "Prince Bira, F Bonetto, OJ Claes, JM Fangio, OA Galvez, F González, E de Graffenried, FS Landi, H Lang, S Mantovani, OA Marimón, L Musso",
            "A Ascari, Prince Bira, J Daponte, JM Fangio, R Flockhart, F Godia, E de Graffenried, S Mantovani, OA Marimón, CA Menditeguy, R Mieres, SC Moss, L Musso, G de Riu, L Rosier, R Salvadori, H Schell, L Villoresi, O Volonterio, K Wharton",
            "JM Behra, C Bucci, OJ Claes, P Collins, J Fitch, HH Gould, L Macklin, S Mantovani, CA Menditeguy, R Mieres, L Musso, C Perdisa, L Rosier, R Salvadori, H Schell, A Simon, A Uria, P Walker",
            "JM Behra, J Bonnier, JA Brabham, AL Chiron, G Gerini, F Godia, F González, OM Gonzalez, HH Gould, E de Graffenried, BH Halford, M Hawthorn, FS Landi, U Maglioli, CA Menditeguy, SC Moss, C Perdisa, L Piotti, L Rosier, R Salvadori, H Schell, A Simon, P Taruffi, A Uria, L Villoresi, O Volonterio",
            "JM Behra, J Bonnier, ILJ Bueb, JM Fangio, F Godia, HH Gould, M Gregory, BH Halford, H Herrmann, CA Menditeguy, SC Moss, L Piotti, G Scarlatti, H Schell, A Simon, O Volonterio",
            "H Allison, JM Behra, J Bonnier, G Cabianca, AL Chiron, MT de Filippis, JM Fangio, G Gerini, F Godia, HH Gould, M Gregory, H Herrmann, P Hill, TK Kavanagh, CA Menditeguy, T Ruttman, G Scarlatti, H Schell, W Seidel, C Shelby, L Taramazzo, A Testut, M Trintignant",
            "G Cabianca, PJ Cade, A Fontes, JCPAJH Godin de Beaufort, FJCT d'Orey, G Scarlatti, A Testut",
            "EM Chimeri, A Creus, R Drake, NM Estéfano, HH Gould, G Munaron, G Scarlatti",
            ""
        ],
        [
            "Race",
            "6",
            "2",
            "1",
            "5",
            "1",
            "1",
            "1",
            "5",
            "3",
            "8",
            "8",
            "6",
            "7",
            "7",
            "10",
            "4",
            "2",
            "71"
        ],
        [
            "Start",
            "29",
            "2",
            "2",
            "10",
            "1",
            "1",
            "1",
            "15",
            "6",
            "40",
            "57",
            "39",
            "60",
            "54",
            "43",
            "5",
            "6",
            "371"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Won",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "0",
            "2",
            "4",
            "0",
            "0",
            "0",
            "9"
        ],
        [
            "Pod",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "8",
            "5",
            "2",
            "10",
            "10",
            "0",
            "0",
            "0",
            "37"
        ],
        [
            "Class",
            "12",
            "0",
            "1",
            "3",
            "0",
            "0",
            "0",
            "7",
            "3",
            "21",
            "29",
            "18",
            "31",
            "29",
            "20",
            "4",
            "3",
            "181"
        ],
        [
            "Best",
            "3",
            "-",
            "20",
            "7",
            "-",
            "-",
            "-",
            "2",
            "6",
            "1",
            "1",
            "3",
            "1",
            "1",
            "4",
            "8",
            "13",
            "1"
        ],
        [
            "1+2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Pole",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "0",
            "1",
            "5",
            "1",
            "0",
            "0",
            "10"
        ],
        [
            "Front",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "10",
            "8",
            "2",
            "5",
            "11",
            "2",
            "0",
            "0",
            "39"
        ],
        [
            "Best",
            "3",
            "10",
            "14",
            "15",
            "15",
            "26",
            "19",
            "5",
            "8",
            "1",
            "1",
            "3",
            "1",
            "1",
            "1",
            "18",
            "18",
            "1"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Lap",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "4",
            "2",
            "1",
            "3",
            "3",
            "1",
            "0",
            "0",
            "15"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Pts",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "6",
            "0",
            "0",
            ""
        ],
        [
            "Pos",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "5",
            "-",
            "-",
            ""
        ]
    ],
    "pageTitle": "Maserati f1 News | Formula 1 Team Profile | Statistics | ESPN.co.uk",
    "title": "",
    "url": "http://en.espn.co.uk/f1/motorsport/team/293.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00177-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 88056999,
    "recordOffset": 88036251,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21501=The Maserati 4CLT was a competitive proposition just after the Second World War, if a little underpowered. The brothers then began work on a sports car before leaving to found the Osca marque. The engine from this car was the basis of a Formula Two car which became eligible for the World Championship when Formula One fell by the wayside in 1952-53. This was a time of Ferrari domination, but Fangio won for Maserati at the Italian Grand Prix at Monza., 27189=Jul 7, 1958, 20059=When hostilities ended, Alfieri Maserati raced his own special and then the brothers embarked on building a straight-eight engine for the Diatto Grand Prix car. They bought it and modified it to conform to the 1926 regulations, with Alfieri taking a class win in that year's Targa Florio., 21973=Maserati looked good for the newly introduced 2.5-litre formula of 1954, but once again Mercedes was to launch a major onslaught and spoil the Italian party. Fangio won the first two grands prix for Maserati in 1954, while he waited for the Mercedes programme to come on-stream. He was driving the 250F, which was destined to become the best-known Maserati ever., 23200=Maserati also gave Fangio his last grand prix, at Reims in 1958, although by that time the factory team was no more. Despite a successful 1957, Maserati was in big financial trouble and the 250F continued to race only in private hands until it became outmoded by mid-engined development., 28435=Juan Manuel Fangio finished second at the 1957 Italian GP, 22354=The 250F proved a very popular car among privateers and was progressively improved, with various weight-saving exercises being carried out. With Mercedes withdrawing, Stirling Moss won two races for Maserati in 1956, while Fangio took his fourth world title for Ferrari. The next year, Fangio, disgruntled with the politicking at Ferrari, returned to Maserati. He won four races to collect his fifth title., 26719=Mar 13, 2010, 27680=Sep 8, 1957, 20366=Maserati then did some twin-engined experimentation before building the 8C-2500 and 2800 chassis. The 8CM was built to take the fight to rival Alfa Romeo's P3 and was the start of a rivalry between the two marques that would continue until after the Second World War. Baconin Borzacchini was an early Maserati faithful, and was joined in an 8CM by Tazio Nuvolari in 1933.}",
    "textBeforeTable": "World Championship Career Latest Photos Latest Articles | Profile | --> [team_entrants] Joe Fry, Scuderia Ambrosiana, Officine Alfieri Maserati, Enrico Plate, Scuderia Achille Varzi, Indianapolis Race Cars Inc, R A Cott, Scuderia Milano, Antonio Branca, Paul Pietsch, Maserati Race Cars, John James, Philip Fotheringham-Parker, B Bira, Escuderia Bandeirantes, Emmanuel de Graffenried, Harry Schell, Jorge Daponte, Onofre Marimon, Roberto Mieres, Prince Bira, Equipe Moss, Owen Racing Organisation, Gilby Engineering, A E Moss, Giovanni de Riu, Ecurie Rosier, A Uria, Stirling Moss Ltd, Goulds' Garage, Scuderia Centro Sud, H H Gould, A Simon, L Piotti, Scuderia Guastalla, J A Brabham, B Halford, Ottorino Volonterio, Jo Bonnier, Francisco Godia Sales, Ken Kavanagh, Scuderia Sud Americana, Maria Teresa de Filippis, Giorgio Scarlatti, Andre Testut, Juan Manuel Fangio, Temple Buell, Monte Carlo Auto Sport, Scuderia Ugolini, Phil Cade, Nasif Estefano, Gino Munaron, Ettore Chimeri, Antonio Creus, Joe Lubin, Maserati,",
    "textAfterTable": "Race Circuit Date First race British Grand Prix Silverstone May 13, 1950 Race results Last race United States Grand Prix Riverside November 20, 1960 Race results Profile The Maserati brothers were involved in early Italian motor sport before setting up their first manufacturing business, making sparking plugs, before the First World War. When hostilities ended, Alfieri Maserati raced his own special and then the brothers embarked on building a straight-eight engine for the Diatto Grand Prix car. They bought it and modified it to conform to the 1926 regulations, with Alfieri taking a class win in that year's Targa Florio. Maserati then did some twin-engined experimentation before building the 8C-2500 and 2800 chassis. The 8CM was built to take the fight to rival Alfa Romeo's P3 and was the start of a rivalry between the two marques that would continue until after the Second World War. Baconin Borzacchini was an early Maserati faithful, and was joined in an 8CM by Tazio Nuvolari in 1933. One of Alfa Romeo's greats was Giuseppe Campari, who had joined Alfa Romeo in his teens as a test driver. He was a great music and opera lover",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}