{
    "relation": [
        [
            "Station",
            "WGTV",
            "WXGA-TV",
            "WVAN-TV",
            "WABW-TV",
            "WNGH-TV3",
            "WCES-TV",
            "WACS-TV 1",
            "WJSP-TV",
            "WMUM-TV 2"
        ],
        [
            "City of license / City served",
            "Athens / Atlanta",
            "Waycross / Valdosta",
            "Savannah / Pembroke",
            "Pelham / Albany",
            "Chatsworth / Dalton",
            "Wrens / Augusta",
            "Dawson / Americus",
            "Columbus / Warm Springs",
            "Cochran / Macon"
        ],
        [
            "Channels TV / RF",
            "8 (PSIP) 8 (VHF)",
            "8 (PSIP) 8 (VHF)",
            "9 (PSIP) 9 (VHF)",
            "14 (PSIP) 6 (VHF)",
            "18 (PSIP) 33 (UHF)",
            "20 (PSIP) 6 (VHF)",
            "25 (PSIP) 8 (VHF)",
            "28 (PSIP) 23 (UHF)",
            "29 (PSIP) 7 (VHF)"
        ],
        [
            "Founded",
            "May 23, 1960",
            "December 4, 1961",
            "September 16, 1963",
            "January 2, 1967",
            "January 30, 1967",
            "September 12, 1966",
            "March 6, 1967",
            "August 10, 1964",
            "January 1, 1968"
        ],
        [
            "ERP",
            "21 kW",
            "20 kW",
            "20 kW",
            "3.8 kW",
            "426 kW",
            "30 kW",
            "6 kW",
            "250 kW",
            "22 kW"
        ],
        [
            "HAAT",
            "326 m",
            "286 m",
            "293 m",
            "474 m",
            "537 m",
            "436 m",
            "313 m",
            "462 m",
            "369 m"
        ],
        [
            "Transmitter coordinates",
            "33°48′18″N 84°8′40″W﻿ / ﻿33.80500°N 84.14444°W﻿ / 33.80500; -84.14444",
            "31°13′22.7″N 82°34′40.4″W﻿ / ﻿31.222972°N 82.577889°W﻿ / 31.222972; -82.577889",
            "32°8′49.2″N 81°37′4.3″W﻿ / ﻿32.147000°N 81.617861°W﻿ / 32.147000; -81.617861",
            "31°8′8.7″N 84°6′15.6″W﻿ / ﻿31.135750°N 84.104333°W﻿ / 31.135750; -84.104333",
            "34°45′2.3″N 84°42′52.7″W﻿ / ﻿34.750639°N 84.714639°W﻿ / 34.750639; -84.714639",
            "33°15′32.9″N 82°17′7.5″W﻿ / ﻿33.259139°N 82.285417°W﻿ / 33.259139; -82.285417",
            "31°56′12.3″N 84°33′13″W﻿ / ﻿31.936750°N 84.55361°W﻿ / 31.936750; -84.55361",
            "32°51′6.9″N 84°42′5.6″W﻿ / ﻿32.851917°N 84.701556°W﻿ / 32.851917; -84.701556",
            "32°28′12.2″N 83°15′18″W﻿ / ﻿32.470056°N 83.25500°W﻿ / 32.470056; -83.25500"
        ],
        [
            "FCC facility ID",
            "23948",
            "23929",
            "23947",
            "23917",
            "23942",
            "23937",
            "23930",
            "23918",
            "23935"
        ],
        [
            "Public license information",
            "Profile CDBS",
            "Profile CDBS",
            "Profile CDBS",
            "Profile CDBS",
            "Profile CDBS",
            "Profile CDBS",
            "Profile CDBS",
            "Profile CDBS",
            "Profile CDBS"
        ]
    ],
    "pageTitle": "Georgia Public Broadcasting - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Georgia_Public_Broadcasting",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00181-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 866225151,
    "recordOffset": 866187645,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{58781=GPB Radio broadcasts 24 hours a day on several FM radio stations across the state, except in the Atlanta metropolitan area. The network had previously operated a translator station in Atlanta, W264AE (100.7 FM), which broadcast from a transmission tower located in the city's downtown district. However, it (and WGHR) was forced to go silent when full-power station WWWQ (100.5 FM, now WNNX) moved from Anniston, Alabama (where it operated under the WHMA-FM call letters) into the Atlanta market on an adjacent channel. Despite having almost no presence in metropolitan Atlanta prior to 2014, the network reaches nearly all the rest of Georgia, plus parts of Alabama, Florida, South Carolina and Tennessee. Atlanta-area listeners heard NPR programming on locally-licensed stations WABE and WCLK instead., 12767=In 1984, the GPTC entered into public radio, launching stations in Macon and Columbus. These formed the nuclei of Peach State Public Radio, which was eventually renamed Georgia Public Radio in 2001. During the 1980s and 1990s, stations that had been operated by other educational institutions and community groups became affiliated with the network., 13275=In 1995, the GPTC began using \"Georgia Public Broadcasting\" as its corporate name. This would eventually become the umbrella title for all GPB operations in early 2004, when GPTV and Georgia Public Radio simultaneously rebranded under the Georgia Public Broadcasting name., 38164=On December 23, 2010, the University of Georgia announced that it would enter into a programming partnership with GPB, which would provide all programming for the university-owned WNEG-TV (channel 32) in Toccoa, with most of the content coming from its GPB Knowledge subchannel.[1] The station filed with the FCC to convert WNEG's station license to non-commercial status.[2][3] The new partnership between UGA and GPB is due to a reduction of advertising dollars, resulting from the economic downturn and the loss of WNEG's CBS affiliation (the station had been with CBS since August 1995, receiving affiliation as a by-product of the CBS programming moving in the adjacent Atlanta market from WAGA-TV to WGCL-TV in December 1994).[4] At 5:30 a.m. on May 1, 2011, the station began carrying GPB Knowledge programming; the following day, its call letters were changed to WUGA-TV.[5] UGA sold WUGA-TV to Marquee Broadcasting in 2015; at 12:01 a.m. on July 1, 2015, the new owners dropped all GPB Knowledge programming, changed the station's call letters to WGTA, and returned the station to commercial operation with programming from the Heroes & Icons, Decades, and Movies! networks.[6], 36775=1 WACS-TV was off-air from March 1, 2007 to April or May 2008, due to a radio tower collapse caused by a tornado. 2 At the time of its sign-on in 1968, WMUM-TV was known as WDCO-TV and broadcast on UHF channel 15. WDCO-TV moved to channel 29 in 1990, and adopted its current call letters in 2006. 3 At the time of its sign-on in 1967, WNGH-TV was known as WCLP, which changed from WCLP-TV (1979) to its current call letters in 2008 to match the new GPB FM station., 43031=The GPB Television stations shut down their analog signals on February 17, 2009, the original target date for full-power television stations in the United States to transition from analog to digital broadcasts under federal mandate (which Congress had moved the previous month to June 12).[7][8][9], 11617=On May 23, 1960, the University of Georgia signed on WGTV, the second public television station in Georgia (after WETV, now WPBA). From 1960 to 1964, in a separate initiative, the Georgia Board of Education launched four educational television stations across the state, aimed at providing in-school instruction. In 1965, the university and the board merged their efforts as Georgia Educational Television (GETV). The state network was renamed Georgia Public Television (GPTV) in 1970, one year after the state legislature transferred authority for the stations to the Georgia Public Telecommunications Commission, the board that oversees GPB., 65740=Previously, GPB Radio was transmitter over the second audio program feed of GPB's television stations at most times prior to the 2009 digital television transition. GPB Radio is still audible through this function on DirecTV, but not GPB's digital television stations or on cable for unknown reasons., 19354=GPB Television also operates two digital subchannels that are carried on most of its stations: GPB Kids launched in January 2009 as the second digital subchannel of the GPBTV stations, replacing the standard-definition feed (which mirrored each station's analog feed) of GPB's main channel. During December 2008, the subchannel carried only a static station identification for all nine stations (including the GPB/PBS Kids logo), and the electronic program guide for the channel continued to show main channel information for the GPBTV stations. GPB Knowledge, carried as a third digital subchannel, debuted in September 2008, but officially launched on October 1 of that year. GPB Knowledge carries programming from the World network during prime time hours, and GPB documentary and news programming (including BBC World News) at other times. It replaced GPB Education, which is still available to schools statewide on demand over the Internet., 63231=Despite these threats, though, the network has announced plans to increase news and talk programming later in 2014 to cater to WRAS listeners,[29][30][31] who would presumably be turning away from WABE, which, despite criticisms from devotees of NPR news, talk, and feature programs, has resisted pressure to reduce daytime classical music for years. Indeed, many NPR staples weren't heard at all in Atlanta until WABE launched an all-news station on one of its HD Radio channels. As of June 2014, WABE has not announced major scheduling alterations in response to GPB's return to the Atlanta market.[32] In fact, former U.S. Department of Health and Human Services secretary Louis W. Sullivan, an Atlanta native and chair of the Board of Directors of WABE's parent organization, Public Broadcasting Atlanta, issued a letter to GPB and the Georgia Board of Regents sharply criticizing the WRAS deal, calling it a waste of taxpayer funds on programming that essentially duplicates much of WABE's schedule.[33], 16745=GPB Television broadcasts PBS programming and statewide programs produced specifically for the GPB network 24 hours a day on a network of nine full-power stations as well as numerous low-power translator stations (especially in the state's mountainous northeastern counties). Certain programs broadcast by GPB Television (mainly those provided by PBS) feature a Descriptive Video Service track that is audible over the second audio program (SAP) channel of each station; GPB Radio feeds could previously be heard during times when DVS-transcribed programs were not airing, prior to the 2009 digital television transition. All stations within the GPB Television network act as rebroadcasters, simulcasting the network's programming at all times. GPB-produced programs include Gardening in Georgia, Georgia Backroads, Georgia's Business, Georgia Outdoors and Georgia Traveler, as well as annual coverage of the Georgia General Assembly when it is in legislative session early in the year., 60609=On May 6, 2014, Georgia State University announced an arrangement allowing Georgia Public Broadcasting to program the University's station WRAS (\"Album 88\") from 5 a.m. to 7 p.m. daily, leaving 7 p.m. to 5 a.m. as the only remaining student airtime.[19] This took effect on June 29.[20] In exchange, GPB promises to provide internships at GPB for GSU students and other media collaborations between the two institutions.,[21] with WRAS broadcasting a separate feed from the main statewide network.[22] The announcement immediately prompted intense opposition and denunciations from WRAS listeners, staffers, and GSU alumni, going so far as evoking a protest at GSU's commencement ceremony,[23] a social media campaign with the tag #savewras,[24] and a petition with more than 10,000 signatories on Change.org. Some of them have made accusations of secrecy and even illegality surrounding the transaction,[25] as they protested that the alternative rock format was unique to the Atlanta market (despite the presence of another college station in the area, WREK, licensed to the Georgia Institute of Technology) and that it was being displaced by programming that largely duplicated offerings on WABE.[26] This has led to a public effort to boycott GPB [27] and its underwriters.[28], 13570=GPB's 14th Street office/production facility in Midtown Atlanta (located north of the Georgia Institute of Technology and south of the city's Atlantic Station neighborhood) caused some controversy when, because of its inherently educational nature, GPB was allowed to use Georgia Lottery funds for construction of the mid-rise building. The studio facilities were used for the production of the first season of the CBS Television Distribution-syndicated program Swift Justice With Nancy Grace, via a subsidy by the Georgia Film, Music and Digital Entertainment Office, and received an on-screen credit at the end of each episode (production of that series was moved to Los Angeles for its second and final season). As of the summer of 2014, another syndicated court program, Lauren Lake's Paternity Court, now uses the GPD facilities under the same arrangement., 40919=WGTV, WXGA-TV, and WVAN-TV were the first GPB stations to begin operating their own digital television signals. The other six stations signed on their digital signals in July 2008. The ERP/HAAT figures listed within the table for those stations are based on those listed in the stations' individual Wikipedia articles, though some of the stations were operating at low power, and only upgraded to full-power when the digital transition occurred., 77929=GPB News is the news department of Georgia Public Broadcasting. It is responsible for providing news updates to both GPB Radio and GPB Television, and collaborates with the Atlanta Business Chronicle to produce the program Georgia Business News. The legislative discussion program Prime Time Lawmakers (formerly known as Lawmakers) provided coverage and commentary on the Georgia General Assembly throughout each session; it aired from 1971 to 2014, when it was replaced by \"On the Story\"., 74195=Except for W250AC in Athens and the former W264AE in Atlanta, none of the translator stations are owned by GPB/GPTC, but rather by Radio Assist Ministry and Edgewater Broadcasting, two related companies that speculatively apply for such stations during FCC filing windows, assign them to non-commercial educational \"parent\" stations to avoid broadcast license fees, then rent or sell them to other stations for a profit. While many more RAM/EB stations are assigned to rebroadcast GPB stations in the FCC database, only these five are listed by GPB.}",
    "lastModified": "Tue, 04 Aug 2015 03:43:18 GMT",
    "textBeforeTable": "The GPB television stations are: This rule only applies to the television stations, not to those on radio, which, except for two, bear only the location of the transmitter. Each of GPB's television stations identify themselves with two locations – usually, the smaller community where the station is licensed by the Federal Communications Commission (almost always the station's transmitter location) and the larger city that it serves. The exceptions are WVAN-TV and WJSP-TV, which are actually licensed in major Georgia cities: WVAN-TV is licensed to Savannah, while WJSP-TV is licensed to Columbus. However, in order to conform to the pattern, GPB lists the locations for the stations' transmitters as the second city. Television stations[edit] GPB Television also operates two digital subchannels that are carried on most of its stations: GPB Kids launched in January 2009 as the second digital subchannel of the GPBTV stations, replacing the standard-definition feed (which mirrored each station's analog feed) of GPB's main channel. During December 2008, the subchannel carried only a static station identification for all nine stations (including the GPB/PBS Kids logo), and the electronic program guide for the channel continued to show main channel information for the GPBTV stations. GPB Knowledge, carried as a third digital subchannel, debuted in September 2008, but officially launched on",
    "textAfterTable": "Footnotes 1 WACS-TV was off-air from March 1, 2007 to April or May 2008, due to a radio tower collapse caused by a tornado. 2 At the time of its sign-on in 1968, WMUM-TV was known as WDCO-TV and broadcast on UHF channel 15. WDCO-TV moved to channel 29 in 1990, and adopted its current call letters in 2006. 3 At the time of its sign-on in 1967, WNGH-TV was known as WCLP, which changed from WCLP-TV (1979) to its current call letters in 2008 to match the new GPB FM station. WUGA-TV[edit] Main article: WGTA (TV) On December 23, 2010, the University of Georgia announced that it would enter into a programming partnership with GPB, which would provide all programming for the university-owned WNEG-TV (channel 32) in Toccoa, with most of the content coming from its GPB Knowledge subchannel.[1] The station filed with the FCC to convert WNEG's station license to non-commercial status.[2][3] The new partnership between UGA and GPB is due to a reduction of advertising dollars, resulting from the economic downturn and the loss of WNEG's CBS affiliation (the station had been with CBS",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}