{
    "relation": [
        [
            "Fly species",
            "Lucilia sericata",
            "Lucilia cuprina",
            "Calliphora stygia",
            "Calliphora augur",
            "Chrysomya rufifacies",
            "Hydrotaea rostrata"
        ],
        [
            "Egg",
            "21",
            "26",
            "24",
            "no eggs",
            "24",
            "48*"
        ],
        [
            "1st instar",
            "31",
            "33*",
            "48",
            "24",
            "36",
            "60*"
        ],
        [
            "2nd instar",
            "26",
            "33*",
            "24",
            "24",
            "36",
            "60*"
        ],
        [
            "3rd instar",
            "50",
            "24",
            "48",
            "60",
            "72?",
            "36*"
        ],
        [
            "Prepupa",
            "118",
            "114",
            "96",
            "96",
            "72?",
            "144"
        ],
        [
            "Pupa",
            "240",
            "324",
            "324",
            "336",
            "168",
            "324"
        ],
        [
            "Total time (days)",
            "20",
            "23",
            "23",
            "23",
            "17**",
            "28"
        ]
    ],
    "pageTitle": "Decomposition: fly life cycle and development times - Australian Museum",
    "title": "",
    "url": "http://australianmuseum.net.au/decomposition-fly-life-cycles",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00049-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 20972960,
    "recordOffset": 20964758,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11786=Last Updated: 12 November 2009}",
    "textBeforeTable": "This table shows the approximate development times of some Australian fly species (in hours) at 20°C. The life cycles of Australian flies are poorly known - a great area for further research. Development times of particular fly species - in hours A female blowfly lays up to 300 eggs at one time, and with numerous females visiting a corpse, the number of maggots can be immense. For example, 48,562 maggots were found on a 156 g piece of meat after 24 hours exposure. However, because this was insufficient food to sustain them, only 231 flies finally emerged. In warm weather, conducive to fly growth, maggots can consume 60 per cent of a human body in less than a week. Maggots moult twice during their development and can grow from 2 mm to 20 mm in length in four days. Having acquired the necessary nutrients to make a fly, they retire into their puparia where the transformation occurs. Maggots are gregarious animals and travel around in 'maggot masses'. Their digestive activities are so intense that the corpse heats up in the vicinity of a maggot mass, sometimes reaching 53 celsius. It can get so hot inside a maggot mass, that centrally located maggots have to migrate to the edge to cool down. However, the heat is a bonus, because it increases the rate of putrefaction, and the rate of digestion. Between their heads and their tails is a muscular, segmented body, a simple intestine and a pair of very large",
    "textAfterTable": "* Data extrapolated from values for combined larval stages ** Approximations only Data from: Anderson, G.S. (2000). Minimum and maximum development rates of some forensically important Calliphoridae (Diptera). Journal of Forensic Sciences. 45: 824-832 O'Flynn, M.A. (1983). The succession and rate of development of blowflies in carrion in southern Queensland and the application of these data to forensic entomology. Journal of the Australian Entomological Society. 22: 137-148. Development times of the Sheep Blowfly, Lucilia sericata, at different temperatures Development rate of the Sheep Blowfly, Lucilia sericata, (in hours) at three different temperatures. Temp(°C) Egg 1st instar 2nd instar 3rd instar Pre-pupa Pupa Total time (days) 16 41 53 42 98 148 393 32 21 21 31 26 50 118 240 20 27 18 20 12 40 90 168 14 Data from: Anderson, G.S. (2000). Minimum and maximum development rates of some forensically important Calliphoridae (Diptera). Journal of Forensic Sciences. 45: 824-832 Kamal, A.S. (1958). Comparative study of thirteen species of sarcosaprophagous Calliphoridae and Sarcophagidae (Diptera) I. Bionomics. Annals of the Entomological Society of America. 51: 261-270.   Last Updated: 12 November 2009 Tags decomposition, death, decay, fly life cycle, development,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}