{
    "relation": [
        [
            "Company",
            "NetEase",
            "Electronic Arts",
            "Activision Blizzard",
            "SINA",
            "Perfect World"
        ],
        [
            "Price/Book",
            "3.7",
            "1.7",
            "1.2",
            "3.3",
            "0.8"
        ],
        [
            "Price/Cash Flow",
            "12.0",
            "16.3",
            "13.9",
            "54.7",
            "2.7"
        ],
        [
            "Forward P/E",
            "12.3",
            "10.4",
            "10.9",
            "42.3",
            "2.7"
        ],
        [
            "5-Year Revenue CAGR",
            "27.5%",
            "6%",
            "25.7%",
            "17.8%",
            "97.2%"
        ]
    ],
    "pageTitle": "How High Can NetEase Fly? (NTES)",
    "title": "",
    "url": "http://www.fool.com/investing/general/2012/06/08/how-high-can-netease-fly.aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00304-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 448329267,
    "recordOffset": 448304453,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1778=Also favoring NetEase shareholders was China's decision yesterday to ease its lending rate for the first time since 2008. The move, which was undertaken to stimulate China's economy, could spur business growth, which, in turn, could add to NetEase's already robust profits., 30781=By Sean Williams | More Articles June 8, 2012 | Comments (0)}",
    "TableContextTimeStampAfterTable": "{23641=A Fool since 2010, and a graduate from UC San Diego with a B.A. in Economics, Sean specializes in the healthcare sector and in investment planning topics. You'll usually find him writing about Obamacare, marijuana, developing drugs, diagnostics, and medical devices, Social Security, taxes, or any number of other macroeconomic issues. Follow @TMFUltraLong, 1971=Activision Blizzard's figures also come with an asterisk as they greatly benefited from the merger of Activision and Blizzard in 2008. The company has benefited from owning the online sensation World of Warcraft franchise., 21843=DocumentId: 1907139, ~/Articles/ArticleHandler.aspx, 8/2/2015 2:31:24 AM, 1558=Perfect World, if we can trust management's ever-changing guidance, was only getting off the ground in 2006 and thus averaged a near-doubling in revenue since then. In recent years, growth has slowed and its recent earnings history has been wildly erratic, but it is nonetheless very inexpensive.}",
    "textBeforeTable": "As you can see, NetEase has dramatically outperformed traditional gaming platforms, the erratic Perfect World, and even the more diverse SINA over the past five years. NTES data by YCharts How it stacks up Let's see how NetEase stacks up next to its peers. NetEase won't, however, be without its own challenges. Cranking out one hit after another is very difficult. There's also a significant level of competition internationally from EA and Activision, as well as domestically from SINA (Nasdaq: SINA  ) and Perfect World (Nasdaq: PWRD  ) . Also favoring NetEase shareholders was China's decision yesterday to ease its lending rate for the first time since 2008. The move, which was undertaken to stimulate China's economy, could spur business growth, which, in turn, could add to NetEase's already robust profits. But it's great news for NetEase, which offers online multiplayer role-playing games that are all the rage among China's youth. In NetEase's latest quarter, online game revenue grew by 31.4%, handily outpacing ad revenue growth of 13.1%. That simply means word-of-mouth and the company's core line of games is doing most of the work of bringing new customers in. How it got here The global gaming industry is going through a major shift as content is being moved online from traditional gaming platforms. That's got",
    "textAfterTable": "Source: Morningstar, author's calculations. Now before you get giddy and go buy the entire sector because of the huge five-year sales gain, let me do some explaining. Perfect World, if we can trust management's ever-changing guidance, was only getting off the ground in 2006 and thus averaged a near-doubling in revenue since then. In recent years, growth has slowed and its recent earnings history has been wildly erratic, but it is nonetheless very inexpensive. Activision Blizzard's figures also come with an asterisk as they greatly benefited from the merger of Activision and Blizzard in 2008. The company has benefited from owning the online sensation World of Warcraft franchise. Electronic Arts has had some trouble with its packaged games. Its latest quarterly results fell short of the Street's estimates, causing the company to join Activision Blizzard in announcing job cuts to cut expenses. SINA, as previously mentioned, offers online gaming in China, but is primarily driven by its advertising revenue and its Facebook/Twitter hybrid, Weibo.com. Recent quarters have shown a rapid rise in operating expenses associated with Weibo, so that would be why its valuation is much higher than its peers'. Finally, NetEase has been growing with regularity and is as close as you'll get to an online-only gaming pure-play. If there was one concern, it'd be that gross margin, though up in its latest quarter, has tapered off in recent years as expenses have risen. What's next Now for the $64,000 question: What's next for",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}