{
    "relation": [
        [
            "Rank",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Airport",
            "Chicago",
            "Las Vegas",
            "Baltimore",
            "Phoenix",
            "Denver",
            "Houston (Hobby)",
            "Dallas (Love Field)",
            "Los Angeles (LAX)",
            "Oakland",
            "St. Louis"
        ],
        [
            "Departures",
            "231",
            "219",
            "176",
            "173",
            "166",
            "138",
            "124",
            "109",
            "104",
            "92"
        ],
        [
            "Gates",
            "29",
            "19",
            "26",
            "24",
            "19",
            "17",
            "15",
            "11",
            "13",
            "10"
        ],
        [
            "Non-stop cities",
            "58",
            "54",
            "47",
            "47",
            "54",
            "36",
            "15",
            "23",
            "19",
            "35"
        ]
    ],
    "pageTitle": "Carl Brewer | | Dallas Morning News",
    "title": "",
    "url": "http://aviationblog.dallasnews.com/tag/carl-brewer/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00274-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 19616905,
    "recordOffset": 19601259,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{25207=The 1997 Shelby amendment to the Wright amendment added three states – Kansas, Alabama and Mississippi – to the list of states to which an airline could reach nonstop from Dallas Love Field., 13357=On May 2, 2011, Southwest merged with AirTran Airways, which did fly to Wichita from Atlanta. On Sunday, Southwest replaced AirTran’s Atlanta flights with its own to Dallas, Chicago and Las Vegas., 12984=The Wright amendment, which limits flights out of Dallas Love Field, didn’t allow connecting or nonstop service between Love Field and Kansas, including Wichita. A 1997 law authored by Sen. Richard Shelby, R-Ala., added Kansas, Mississippi and Alabama to the states that could get Dallas flights, but Southwest didn’t jump in as Wichita officials had hoped., 26016=Southwest said Monday that AirTran on June 1, 2013, will operate its last flights from Wichita to Atlanta. On June 2, Southwest begins its service from Wichita with two flights to Dallas, two flights to Chicago and one flight to Las Vegas., 25698=In May 2011, Southwest bought AirTran Airways, which did serve Wichita. That raised the hopes of the Wichita people. In fact, Southwest announced this year that it would initiate service at Wichita as AirTran pulls down its service and is absorbed into Southwest., 24683=Southwest Airlines announced Monday that it will begin nonstop service from Wichita to Dallas Love Field, Chicago Midway and Las Vegas on June 2.}",
    "textBeforeTable": "So, at a minimum, three flights at 117 seats = 351 seats each direction, replaced by at least 685 seats each direction, or a 95 percent increase. It’ll also take Wichitans to three busy points on Southwest’s system: No. 1 Las Vegas, No. 2 Chicago and No. 7 Dallas in terms of daily departures. We’ll note that that’ll be a substantial increase in capacity as AirTran’s three flights with 117-seat Boeing 717s will be replaced with five flights provided by Boeing 737, which have 137 seats, 143 seats if converted to the new seating or 175 seats if it’s a Boeing 737-800. “Today’s announcement is fantastic news for Wichita and the state of Kansas,” Kansas Gov. Sam Brownback said.  “Southwest Airlines will contribute significantly to our quality of life in Kansas and to our economy statewide.  Affordable flights and flight choices are essential for keeping the cost of business competitive and having Southwest at Mid-Continent Airport makes south central Kansas more accessible to the rest of the country.  We can’t wait to book our flight!” “We’re thrilled that they’ll be continuing our history of providing low air fares in this region. The presence of Southwest Airlines will benefit both business and leisure travelers and will support our collaborative efforts to retain and create jobs. It’s going to be great to have the Southwest Airlines reputation and brand at our airport, especially when our new terminal opens!” the mayor said. “I’m",
    "textAfterTable": "Post navigation ← Older posts Ad:TopLeftBlog Ad: Position1 Archives Title Archives Archives Select Month July 2015 June 2015 May 2015 April 2015 March 2015 February 2015 January 2015 December 2014 November 2014 October 2014 September 2014 August 2014 July 2014 June 2014 May 2014 April 2014 March 2014 February 2014 January 2014 December 2013 November 2013 October 2013 September 2013 August 2013 July 2013 June 2013 May 2013",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}