{
    "relation": [
        [
            "Equipos",
            "Leones",
            "Gigantes",
            "Aguilas",
            "Tigres",
            ""
        ],
        [
            "G",
            "6",
            "3",
            "3",
            "2",
            ""
        ],
        [
            "P",
            "1",
            "3",
            "4",
            "6",
            ""
        ],
        [
            "PCT",
            ".857",
            ".500",
            ".429",
            ".250",
            ""
        ],
        [
            "DIF",
            "--",
            "2½",
            "3",
            "4½",
            ""
        ]
    ],
    "pageTitle": "Play Ball!; Hoy inicia el beisbol Dominicano seis campeones van al terreno a \"romper corozos\" ~ wWw.ElControlDeportivo.Tk",
    "title": "",
    "url": "http://elcontroldeportivo.blogspot.com/2011/10/play-ball-hoy-inicia-el-beisbol.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00333-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 82843007,
    "recordOffset": 82810318,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21358=Los Tigres del Licey y los Leones del Escogido, los dos rivales más viejos de la pelota dominicana, se verán la cara nuevamente esta noche, al filo de las 7:30, en la apertura del campeonato número 60. Para ponerle un poco más de pimienta al choque, Jorge Sosa, quien vistió toda su vida el uniforme azul hasta ser dejado libre en septiembre luego de compilar 1-2 y efectividad de 7.57 en el anterior torneo, subirá al box por el Escogido esta noche. Willy Lebrón, un veterano de 32 años, segunda selección del club en el Sorteo de Novatos y que tiene como principal carta de presentación dos notables presentaciones ante Cuba con la selección dominicana de béisbol, tendrá un debut de lujo en el torneo. Un remozado estadio Quisqueya servirá nuevamente de escenario al enfrentamiento número 853 en series regulares de las dos fieras capitaleñas. De por vida, los escarlatas dominan 430-422 a los bengalíes. Los Leones finaliaron empatados en primero con las Estrellas y los Toros, los tres con foja de 27-22, en la primera fase del torneo pasado, pero se quedaron en el camino en el Round Robin. Los Tigres, en tanto, vienen de una temporada para olvidar tras quedar en el sótano con 17- 32, lo que de alguna manera influyó en el remenón de la mata que dieron. Landestoy regresa como el dirigente de los Tigres Rafael Landestoy está de vuelta como dirigente de “el equipito” y Fernando Ravelo Álvarez reemplazó a Pepe Busto en la presidencia. Además hicieron el principal cambio de la temporada muerta al adquirir a Juan Francisco en un movimiento que llevó a los Gigantes al receptor Robinson Díaz, al prometedor jardinero Carlos Peguero y al lanzador Johnny Núñez. Otro canje de importancia lo hicieron justamente contra su eterno rival al enviar al antesalista Andy Marte por Irving Yoel Guzmán. Los Leones, que también tienen nuevo manager en la persona de Tony De Francesco, también consiguieron los servicios de Julio Borbón, el novato sensación Starlin Marte y Santo Rodríguez procedente de las Águilas en un cambio por Carlos Gómez, Joaquín Arias y Audy Ciriaco. En otro canje menor adquirieron al lanzador zurdo Jordan Norberto y mandaron a las Estrellas a Jerry Gil y Marlon Arias. Los precios de los tickets para presenciar los partidos entre ellos hoy y contra las Águilas en el parque Quisqueya son de 650 pesos palcos A, 400 los AA del Grand Stand, 300 preferencias C, 250 palcos AA ampliaciones y 100 bleachers, ahora con butacas. Contra Estrellas, Toros y Gigantes son 550 pesos (palcos A), 300 (AA GS), 250 (preferencias C) y 200 palcos AA ampliaciones.}",
    "lastModified": "Sat, 11 Apr 2015 07:42:09 GMT",
    "textBeforeTable": "Posiciones Lidom You need Javascript enabled to view these blessings. Bendición Diaria Chat } color: #333333; #uds-searchControl .gsc-cursor-current-page { } color: #5588aa; #uds-searchControl .gsc-cursor-page { } border-color: #cc6600; #uds-searchClearResults:hover { } border-color: #cccccc; #uds-searchClearResults { } color: #5588aa; background-color: transparent; border-color: #cccccc; #uds-searchControl .gsc-tabhInactive { } color: #333333; background-color: #ffffff; border-top-color: #cc6600; border-color: #cccccc; #uds-searchControl .gsc-tabhActive { } background-color: #ffffff; border-color: #cccccc; #uds-searchControl .gsc-results { } color: #cc6600; #uds-searchControl .gs-result .gs-visibleUrl { #uds-searchControl .gs-result a.gs-visibleUrl, } color: #999999; #uds-searchControl .gs-publishedDate { #uds-searchControl .gs-relativePublishedDate, } color:#999999; #uds-searchControl .gs-result .gs-title a:visited * { #uds-searchControl .gs-result .gs-title a:visited, } color:#5588aa; #uds-searchControl .gsc-results .gsc-trailing-more-results * { #uds-searchControl .gsc-results .gsc-trailing-more-results, #uds-searchControl .gs-result .gs-title *, #uds-searchControl .gs-result .gs-title,",
    "textAfterTable": "Dominicanos NBA Recibe las Noticias Por Email Introduce tu email: Trafico Feedjit Live Blog Stats",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}