{
    "relation": [
        [
            "Provider",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Plan Details",
            "Only $9.99/mo. + tax for quality you can count on Unlimited U.S. calling, Crystal-clear quality No hidden fees, No annual contract No cost to keep your number",
            "Home Phone Service Unlimited calling to US & Canada Includes 60 international minutes 40+ features",
            "VoIP Phone Service 2 months free for voip-info.org users Free VoIP phone adapter Scalable unlimited calling plans",
            "Freedom 24-month Virtually unlimited calls Two lines 60 international minutes",
            "Home Phone Service Unlimited calling: US and Canada No activation fee. Free hardware. Money back guarantee."
        ],
        [
            "Long Distance Rate",
            "$0.000/min",
            "$0.000/min",
            "$0.000/min",
            "$0.000/min",
            "$0.000/min"
        ],
        [
            "Set Up Rate",
            "$0.00",
            "$0.00",
            "$0.00",
            "$0.00",
            "$0.00"
        ],
        [
            "Monthly Rate*",
            "$9.99",
            "$6.21",
            "$8.32",
            "$5.99",
            "$6.25"
        ],
        [
            "",
            "Details 5 Reviews",
            "Details 37 Reviews",
            "Details 102 Reviews",
            "Details 156 Reviews",
            "Details 35 Reviews"
        ]
    ],
    "pageTitle": "Hosted PBX - voip-info.org",
    "title": "",
    "url": "http://www.voip-info.org/wiki/view/Hosted+PBX",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00336-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 813243619,
    "recordOffset": 813148725,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{209777=© 2003-2015 VOIP-Info.org LLC}",
    "textBeforeTable": "Business VOIP Providers Business Hosted PBX Providers A business hosted PBX phone system can reduce your monthly phone bill tremendously compared to a traditional business phone system. As is characteristic of a hosted PBX system, the PBX is hosted offsite at the provider's facilities. Below is a list of hosted PBX for business providers. Hosted PBX is a service where the call platform and PBX features are hosted at the service provider location. The business end users connect via IP to the provider for voice service. Hosted & On-site IP PBX whitepaper Cloud Communications Cloud Computing Unified Communications Cloud PBX Virtual PBX Managed PBX IP Centrex IP PBX Hosted PBX vs Virtual PBX Hosted PABX Database Systems Corp. - Hosted IVR Asterisk - Open Source PBX See also FAX to Email/Web to FAX DISA Dial By Name / Directory Conference Rooms Caller ID",
    "textAfterTable": "$17.50 Details 23 Reviews Cloud PBX Business Phone System Unlimited Calling (US and Canada) US Based Support 7-Days-a-Week 30-day money back guarantee $0.000/min $0.00 $17.95 Details 9 Reviews Premium Business Phone System 50+ Advanced Cloud Features Carrier-Grade Network Quality of Service (QoS) & Support SLAs $0.000/min $0.00",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}