{
    "relation": [
        [
            "POS",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18"
        ],
        [
            "No",
            "16",
            "2",
            "10",
            "19",
            "24",
            "21",
            "15",
            "14",
            "69",
            "22",
            "5",
            "4",
            "18",
            "7",
            "9",
            "17",
            "3",
            "8"
        ],
        [
            "RACING TEAM",
            "Porto FC SF Racing Team",
            "Sporting Clube de Portugal SF Racing Team",
            "FC Basel SF Racing Team",
            "Tottenham Hotspur SF Racing Team",
            "FC Midtjylland SF Racing Team",
            "Liverpool FC SF Racing Team",
            "Atlético de Madrid SF Racing Team",
            "Corinthians SF Racing Team",
            "Olympique Lyonnais SF Racing Team",
            "AS Roma SF Racing Team",
            "PSV Eindhoven SF Racing Team",
            "Galatasaray SF Racing Team",
            "Sevilla FC SF Racing Team",
            "Flamengo SF Racing Team",
            "Olympiacos SF Racing Team",
            "Rangers FC SF Racing Team",
            "AC Milan SF Racing Team",
            "RSC Anderlecht SF Racing Team"
        ],
        [
            "DRIVER",
            "T. Gommendy",
            "P. Petiz",
            "M. Wissel",
            "C. Dolby",
            "K. Andersen",
            "A. Vallés",
            "H. P. Tung",
            "A. Pizzonia",
            "N. Panciatici",
            "J. Kennard",
            "D. Muermans",
            "S. Mansell",
            "E. Guerrieri",
            "E. Bernoldi",
            "D. Rigon",
            "J. Martin",
            "G. Pantano",
            "Y. Buurman"
        ],
        [
            "TIME",
            "45:36.002",
            "45:40.693",
            "45:42.625",
            "45:43.778",
            "45:46.189",
            "45:47.542",
            "45:53.470",
            "45:53.470",
            "45:53.909",
            "46:16.364",
            "46:17.004",
            "46:30.948",
            "46:32.636",
            "18:23.142",
            "17:02.665",
            "5:22.601",
            "1:41.393",
            "-"
        ],
        [
            "GAP",
            "30 laps",
            "4.691",
            "6.623",
            "7.776",
            "10.187",
            "11.540",
            "17.468",
            "17.907",
            "40.632",
            "41.002",
            "54.946",
            "56.634",
            "20 laps",
            "21 laps",
            "27 laps",
            "29 laps",
            "-",
            "-"
        ]
    ],
    "pageTitle": "AutoRacing1.com - Hot News Page",
    "title": "",
    "url": "http://www.autoracing1.com/hotnews.asp?dbegin=08/04/09&dend=08/08/09",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 15,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00045-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 308200935,
    "recordOffset": 308126718,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{233026=Of the 726 drivers who have competed in the Indianapolis 500 Mile Race since the inaugural running in 1911, only nine have won \"The Greatest Spectacle in Racing\" three or more times. Castroneves joined that group - containing names such as Unser, Shaw, Rutherford, Mears and Foyt - on May 24 when he beat 2005 \"500\" winner Dan Wheldon to the finish line by 1.9 seconds., 300402=The pairing has won three straight American Le Mans Series races dating back to April in Long Beach. They also are within 13 points of LMP1 championship leaders David Brabham and Scott Sharp of Patr¢n Highcroft Racing., 245815=\"Oriol did a fabulous job when he drove for the team in 2005 and I am confident he will do as well now,” said Carl Haas, co-owner of Newman/Haas/Lanigan Racing with Michael Lanigan.  “The combination of Oriol’s talent, energy and personality and the team’s excitement in having him back is as good as it gets.”, 197093=\"I promise we will be in Montreal in 2010,\" the F1 chief executive told Switzerland's Motorsport Aktuell., 281267=Brabham and Sharp won the Acura Sports Car Challenge of St. Petersburg in April. They hold a 13-point championship lead over Pagenaud and de Ferran, who was the overall pole winner here last year as well as during the 2000 and 2001 CART seasons., 321557=Last July, the FIA president filed a $2.35m case against the publisher Axel Springer AG, who he alleged paid money for the News of the World's video and photos and falsely claimed his sadomasochistic session with prostitutes had a Nazi theme., 224834=The seven time world champion hurt his neck while testing a German Superbike in Spain in February, and Ferrari cautioned last Wednesday that Schumacher's return will only be confirmed after a round of intense training and medical checks., 246351=Servia returns to the team after having served as the replacement driver for Bruno Junqueira, who was injured in the 2005 Indianapolis 500.  He finished third in his debut with the team at the Milwaukee Mile and went on to finish on the podium a total of seven times in 11 races including his win at the Circuit Gilles-Villeneuve in Montreal.  He earned his first series pole in Australia and made a total of four front row starts en route to a career-best second place rank in the 2005 season-ending standings. , 138983=After his return at the wheel of a Ferrari at Valencia later this month, the circus will move on one week later to Spa, where Schumacher made his F1 debut in 1991, recorded his first win a year later, and subsequently won six more times at the famous circuit., 189563=Schumacher, replacing the injured Felipe Massa at Ferrari probably for the remainder of the 2009 season, ran nearly 70 laps in a two-year old F2007 last Friday at Mugello and it is believed he will be back in action in the car this week., 138716=According to the Belga news agency, organizers of the 2009 race on August 30 have already sold 35,000 tickets, following a sharp spike in the wake of the Schumacher announcement last Wednesday., 217434=In his first interview since his son’s death, given to the BBC , the 1964 World Champion said that he hoped progress would be made in improving driver safety., 232629=Castroneves won the race for the first time in 2001 - one of only eight drivers to win in his rookie year - and joined yet another elite club by repeating in 2002. Only five drivers have won the \"500\" in consecutive years., 317195=The Edmonton ratings were slightly higher than the previous race aired on Versus. The Richmond race June 27 earned an even worse 0.22 national rating and 0.67 in the Indianapolis market., 185977=Later, Red Bull's two teams Red Bull and Toro Rosso indicated they too would not be voting for the request for a dispensation, meaning that Schumacher's next test this week is likely to again be at the wheel of a two-year-old F2007 instead., 313546=Honda Indy Toronto was the IRL’s last of five races on ABC. The remaining seven races will be broadcast on cable channel Versus, starting with the Edmonton race July 26. The green flag drops at 5 p.m., 224328=After his nearly 70 laps in a 2007 Ferrari last Friday, Schumacher said on his official website michael-schumacher.de this week that \"my neck pinches a bit\"., 308367=PEAK Performance Pole Qualifying for the Honda Indy 200 at Mid-Ohio presented by Westfield Insurance and practice and qualifying for the Firestone Indy Lights' Mid-Ohio 100 is scheduled for Aug. 8., 224452=When he attended a F1 test in early March, moreover, observers said the German was not able to move his neck freely., 209188=On Oct. 10 at Homestead-Miami Speedway, Castroneves will be seeking both his first home-track win and his first IndyCar Championship. A victory would make him the first South Floridian to win at Homestead- Miami; Castroneves has recorded three Top 3 finishes but never has taken a Miami checkered flag., 308835=Dixon recorded a lap of 1:08.2298 (119.139 mph) in his No. 9 Target Chip Ganassi Racing car. Justin Wilson, the winner at Watkins Glen International, was second (1:08.6425) in the No. 18 Z-Line Designs car for Dale Coyne Racing and Dario Franchitti (1:08.6760) was third in the No. 10 Target Chip Ganassi Racing entry., 300171=Brabham, part of the overall winning team at the 24 Hours of Le Mans this year with Peugeot, was second overall with a lap of 1:11.570 in their Acura P1. The two were winners in the season’s first Acura-sponsored race – the Acura Sports Car Challenge of St. Petersburg., 308509=Tony Kanaan was fourth (1:08.8390) and Graham Rahal (1:08.9932) was fifth in the No. 02 McDonald's car for Newman/Haas/Lanigan Racing., 176976=And he knew something about the 25-year-old racer who now lives in Indianapolis in the summer.  Pagenaud had proven himself in Formula Atlantic, beating Graham Rahal for the 2006 title.  And made some impressive runs in his rookie year of ChampCar.  But teaming with de Ferran?, 314313=The Toronto race also beat the national ratings for the IRL’s races in Milwaukee (.6) on May 31 and Iowa (0.8) on June 21 (which both aired on ABC), making the Honda Indy Toronto the most watched race of the year, not including the Indianapolis 500., 189721=He has done some testing and motorcycle racing and plenty of karting since retiring from F1, but his last grand prix was in Brazil at the end of 2006., 239643=The commercial and regulatory agreement also guarantees \"the teams' participation until the end of the 2012 season\", read the statement., 249396=The 27-year-old Doornbos drove for HVM Racing in 2007 when the team competed in Champ Car under the name Team Minardi USA.  He celebrated victories at Mont-Tremblant and San Jose, finished the season third in the championship standings and captured Rookie of the Year honors., 317906=It was said that the Indy Racing League promos aired during the Tour de France would help the open-wheel racing series’ TV ratings.  Think again.  On the heels of the most watched Tour in four years, the Nielsen ratings for the IRL race July 26 in Edmonton were dismal....again. Versus pumped its IRL coverage early and often during its hours-long daily Tour de France coverage in the month of July, sometimes once every 15 minutes or so., 285764=There was a lot to celebrate for Pickett and Klaus Graf, who set the second-quickest LMP2 time Thursday at 1:13.549, a little more than a second behind Adrian Fernandez’s Acura ARX-01b. Support from Porsche Motorsport and Michelin never hurts, and the assistance from Dyson Racing (which campaigned the RS Spyder in 2007 and 2008) is chief among them., 355921=Lowe’s Fernandez Racing’s Adrian Fernandez, who won in CART at Mid-Ohio in 1998, turned in a lap of 1:37.885 (83.044 mph) to place second overall and first in P2. Fernandez, who watched teammate Luis Diaz claim the LMP2 pole in qualifying Friday, leads the P2 championship with Diaz over Dyson Racing. , 310890=Jonathan Summerton answered that question resoundingly with a blistering lap at 1:12.970 (111.399 mph) in the No. 34 Nuclear Clean Air Energy/Entergy/NEI machine for Newman Wachs Racing to obliterate the previous Atlantic track record held by 2003 series champion A.J. Allmendinger and take the $1,000 Cooper Tire Pole Award for Saturday’s eighth round of the 12-race championship. Summerton’s lap was nearly three seconds faster than Allmendinger’s previous record of 1:15.668, giving him his third pole of the season and the fourth of his Atlantic career.}",
    "textBeforeTable": "Weekend Donington Superleague results FC Basel claimed its maiden Superleague Formula by Sonangol victory by winning the opening race at Donington Park today. The Swiss club’s Max Wissel (D) finished 2.18-secs ahead of the Glasgow Rangers machine of John Martin (AUS) in the 44 minute plus one-lap race around the 2.5 miles (4.02 km) parkland track in the Midlands area of Britain. The heavy rain of yesterday which had caused qualifying to be abandoned; and cause minor damage to a section of the track; was thankfully replaced by sunny intervals encouraging a healthy crowd to attend. Wissel took the opportunity to overtake Martin on lap 12 lap when the backmarker PSV Eindhoven car delayed Martin as the Australian attempted to lap the Dutch car. SLF championship leader Adrián Vallés (SP), who started from his worst proper qualifying position of the season in 10th place, finished sixth – just a second behind the Tottenham Hotspur machine of Craig Dolby (GB). The pole-starting Corinthians car of Antônio Pizzonia (BRA) finished third having led until pitting on lap nine but a slow compulsory pit-stop lost the Brazilian valuable time. A second race, followed immediately by a Super Final, will be staged at the British venue later today with Flamingo’s Enrique Bernoldi (BRA) starting from pole-position after spinning out on the opening lap of race one which caused a brief Safety Car period which also saw the front-row starting Olympiacos machine of Davide Rigon (IT)",
    "textAfterTable": "Race 2 - SF Round 3 UK - Classification POS No RACING TEAM DRIVER TIME GAP 1 16 Porto FC SF Racing Team T. Gommendy 45:36.002 30 laps 2 2 Sporting Clube de Portugal SF Racing Team P. Petiz 45:40.693 4.691 3 10 FC Basel SF Racing Team M. Wissel 45:42.625 6.623 4 19 Tottenham Hotspur SF Racing Team C. Dolby 45:43.778 7.776 5 24 FC Midtjylland SF Racing Team K. Andersen 45:46.189 10.187 6 21 Liverpool FC SF Racing Team A. Vallés 45:47.542 11.540 7 15",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}