{
    "relation": [
        [
            "Category and scholarship name",
            "Australian Postgraduate Award",
            "University of Sydney Postgraduate Award",
            "International Postgraduate Research Scholarship",
            "University of Sydney International Research Scholarship",
            "Ethel M Chettle Postgraduate Research Scholarship in Architecture",
            "David Noel Murray Postgraduate Scholarship",
            "Faculty of Architecture, Design and Planning Indigenous Student Research Fellowship",
            "Urban and Regional Planning Research Scholarship",
            "Ian Fell Postgraduate Research Scholarship",
            "HJ Cowan Architectural Science Scholarship"
        ],
        [
            "Description",
            "Awarded annually to Master or Doctor of Philosophy students. Applications to the University of Sydney Research Office close 30 October each year.",
            "Awarded biannually to Master or Docotr of Philosophy students. Applications to the University of Sydney Reserach Office close 30 October and mid June each year.",
            "Awarded annually to Master or Doctor of Philosophy students. Applications to the University of Sydney International Office close mid September each year.",
            "Awarded annually to an international student applying to undertake a Master or Doctor of Philosophy commencing mid year. Scholarship provides tuition fees and a living allowance. Applications to the University of Sydney International Office close late March each year.",
            "Awarded as funds are available to a student commencing a full-time Master or Doctor of Philosophy in the discipline of Architecture. The applicant must be a recent graduate in architecture from a faculty or school in Australia. Applications should be directed to the Faculty of Architecture, Design and Planning.",
            "Awarded as funds are available to a graduate of the Master of Architecture at the University of Sydney who intends to commence a Master or Doctor of Philosophy. Applications should be directed to the Faculty of Architecture, Design and Planning.",
            "Awarded to an Aboriginal or Torres Strait Island Master or Doctor of Philosophy student of exceptional research promise. Applications to the Faculty of Architecture, Design and Planning as advised on the application form.",
            "Awarded to a commencing Master or Doctor of Philosophy student of exceptional research promise, with a focus on City Form and Urban Infrastructure. Applications to the Faculty of Architecture, Design and Planning as advised on the application form.",
            "Awarded as funds are available to a graduate of the University of Sydney undertaking a full-time Doctor of Philosophy. The research project requires overseas travel as an essential part of its inquiry. Applications should be directed to the Faculty of Architecture, Design and Planning. Download the Application form",
            "Awarded to a Research candidate in the area of Architectural Science who currently holds a University or Federally funded scholarship. To be held for the duration of the degree provided the awardee successfully meets satisfactory annual progress reviews. Only one person may hold this scholarship at any time."
        ],
        [
            "Approx value p.a.",
            "Approx $23,728",
            "Same as APA",
            "Same as APA",
            "Stipend equivalent to UPA + tuition fees",
            "Same as APA",
            "Same as APA",
            "Same as APA",
            "$35,000 pa (Approx)",
            "Same as APA",
            "Approx $2500"
        ],
        [
            "Max tenure (yrs)",
            "3",
            "3",
            "3",
            "2 or 3",
            "3",
            "2 or 3",
            "3 years PhD, 2 years MPhil",
            "3 years",
            "3 years",
            "3 years"
        ],
        [
            "Number",
            "varies",
            "varies",
            "varies",
            "varies",
            "Varies",
            "Varies",
            "1",
            "1",
            "1",
            "1"
        ]
    ],
    "pageTitle": "Scholarships - Faculty of Architecture, Design and Planning - The University of Sydney",
    "title": "",
    "url": "http://sydney.edu.au/architecture/current_students/scholarships.shtml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00300-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 233806015,
    "recordOffset": 233790883,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2254=Bates Smart Prize Applications for 2015 are now closed. Application form, 3345=Student Administration Centre Faculty of Architecture, Design and Planning Wilkinson Building (G04) University of Sydney NSW 2006 Australia, 2807=Cox Richardson Architecture Scholarship Applications for 2015 are now closed. Application form, 1013=Prizes and Scholarships night 2014 was held in McLauren Hall on the 7th of May 2014. To download the catalogue of prize winners, please click here., 2546=JW & BK Elkins Architectural Scholarship Diana Inglis Carment Scholarship Applications for 2015 are now closed. For information, please contact: arch.sac@sydney.edu.au, 2013=Ian Fell Postgraduate Research Scholarship Closing date: 26 June 2015 Application form}",
    "TableContextTimeStampAfterTable": "{34246=ABN: 15 211 513 464. CRICOS Number: 00026A. Phone: +61 2 9351 2222., 7137=Awarded on the basis of merit to citizens and permanent residents enrolling in a full year honours program at the University of Sydney. International students may also apply if undergraduate studies were undertaken at the University of Sydney. Applications to the Scholarships Office close early January each year., 34136=© 2002-2015 The University of Sydney. Last Updated: 30-Jul-2015, 5173=Offered by the NSW Architects Registration Board, this award is open to students enrolled in a recognised architecture program of a NSW university school of architecture, including the Bachelor of Design in Architecture at the University of Sydney. All nominees must be Australian citizens. Applications close 31 August each year and must be made directly to the NSW Architects Registration Board. Please check the NSW Architects Registration Board website www.architects.nsw.gov.au/ for full terms, closing dates and application form.}",
    "textBeforeTable": "Undergraduate Disclaimer The terms, conditions, values and availability of all prizes and scholarships listed are subject to change without notice. Research scholarships Postgraduate coursework prizes Postgraduate coursework scholarships Postgraduate travelling scholarships Undergraduate prizes Undergraduate scholarships Scholarships List Prizes and Scholarships night 2014 was held in McLauren Hall on the 7th of May 2014. To download the catalogue of prize winners, please click here. 2014 Scholarships International students For more information on scholarships for International students, please see the Scholarships for International Students page. Research Scholarships For more information on scholarships for local Research students, please see the Postgraduate Research Scholarships website. University-wide Scholarships For more information on University-wide scholarships, please see the Scholarships Office website. Ian Fell Postgraduate Research Scholarship Closing date: 26 June 2015 Application form Postgraduate Research Bates Smart Prize Applications for 2015 are now closed. Application form Postgraduate JW & BK Elkins Architectural Scholarship Diana Inglis Carment Scholarship Applications for 2015 are now closed. For information, please contact: arch.sac@sydney.edu.au Undergraduate Honours Cox Richardson Architecture Scholarship Applications for 2015 are now closed. Application form Undergraduate Scholarships/Application Forms arch.sac@sydney.edu.au Fax:",
    "textAfterTable": "Offered by the NSW Architects Registration Board, this award is open to students enrolled in a recognised architecture program of a NSW university school of architecture, including the Bachelor of Design in Architecture at the University of Sydney. All nominees must be Australian citizens. Applications close 31 August each year and must be made directly to the NSW Architects Registration Board. Please check the NSW Architects Registration Board website www.architects.nsw.gov.au/ for full terms, closing dates and application form. up to $10,000 1 varies Undergraduate Scholarships - Honours Diana Inglis Carment Scholarship Awarded to the student with the highest Weighted Average Mark (WAM) from the first three years of the BDesArch degree who enrols in the Bachelor of Design in Architecture (Honours) year. Considered in conjuction with the JW and BK Elkins Architectural Scholarship. $5,000 1 1 JW and BK Elkins Architectural Scholarship To the best student entering the Bachelor of Design in Architecture (Honours) year, based on application and past academic perfomance. Applications to the Faculty of Architecture, Design and Planning as advised on the applicaiton form. Considered in conjuction with the Diana Inglis Carment Scholarship. $1,500 1 1 University of Sydney Honours Scholarship Awarded on the basis of merit to citizens and permanent residents enrolling in a full year honours program at the University of Sydney. International students may also apply if undergraduate studies were undertaken at the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}