{
    "relation": [
        [
            "Opponent",
            "Auburn",
            "LSU",
            "Georgia",
            "Florida",
            "UAB",
            "Kentucky",
            "Alabama",
            "Arkansas",
            "Ole Miss"
        ],
        [
            "Att",
            "44",
            "38",
            "33",
            "32",
            "31",
            "39",
            "34",
            "33",
            "32"
        ],
        [
            "Total",
            "209",
            "169",
            "119",
            "169",
            "126",
            "116",
            "186",
            "194",
            "84"
        ],
        [
            "TD",
            "0",
            "2",
            "0",
            "1",
            "2",
            "0",
            "1",
            "2",
            "2"
        ],
        [
            "Avg",
            "4.8",
            "4.4",
            "3.6",
            "5.3",
            "4.1",
            "3.0",
            "5.5",
            "5.9",
            "2.6"
        ]
    ],
    "pageTitle": "mississippi state | mgoblog",
    "title": "",
    "url": "http://mgoblog.com/category/tags/mississippi-state-0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989443.69/warc/CC-MAIN-20150728002309-00258-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 154020187,
    "recordOffset": 153977159,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{44101=Etc.: Harmon Of Michigan's theme song is a \"Hollywood-style rendition of the Victors,\" and MVictors has it. Michigan Hockey Net posts the famous 2002 Denver-Michigan West Regional Final at Yost. Michigan players on the O'Bannon case., 48919=“Having an official visit date in June would help football,” Hoke stated. “I know some of our friends in the Pac 12 and the SEC probably don’t want the young man and his family coming up to Michigan during the first two weeks in June, because they’re hoping it’s 10 below zero when those official visits take place.”, 53030=Le'Veon Bell gained 921 yards after contact in 2012, most among players from AQ schools. Bell gained more than 50 percent of his yards after contact and averaged 2.4 yards after contact per rush., 51556=Michigan Football First Practice Fall 2013 by mgovideo, 24160=Desperate need to win level: 8 (Baseline 5; +1 8-5 Is Undeniable Progress, –1 for That Might Not Matter One Whit Anyway, +1 for The Faint Memory Of January Happy Events Is Like Motes Of Dust In A Room Half-Remembered, +1 for The Slight Chance It Might Impact Our Ability To Watch Denard Finish His Career Here, +1 for I Just Want To Win A Damn Game, –1 for I Know It's Over And Oh It Never Really Began But In My Heart It Was So Real, +1 for Seriously, Win.)}",
    "TableContextTimeStampAfterTable": "{2957=This begins to be old hat but the numbers above indicate a certain difficulty with spread systems—Florida, Auburn, and Arkansas had three of the top four rushing days against the Ole Miss defense. As you can see above and Georgia found out in their loss to MSU early in the year, the question you're asking when you line up under center and run pro-style at this thing is \"do you know how much I like second and long?\" Michigan's spread will pull linebackers outside and ask questions of the safeties, who I liked in the Georgia game but Alcorn State (and everything else) analyst Blue Seoul has consistently dogged for things like that still above, wherein #5 is in the midst of pulling a Random Michigan Safety Since Marcus Ray With The Exception Of Jamar Adams-level boner.}",
    "lastModified": "Mon, 03 Aug 2015 03:21:22 GMT",
    "textBeforeTable": "This has been highly effective no matter what metric you grab. MSU is 19th in rushing defense against a fairly tough schedule—they didn't play anyone in the nonconference but got stuck in a brutal SEC West (or \"Legends,\" whatever)—and obliterated a few actual teams along the way: Blitz, blitz, blitz from everywhere. Eight guys on the LOS on first down run blitzing like nuts. On passing downs heavy doses of zone blitz, and on third and two there's a specific rollout contain blitz from a linebacker. MSU doesn't blitz like Michigan blitzes: as the changeup. The basic philosophy of the MSU defense is evident in their first drive against LSU. It's evident everywhere all the time but this is a particularly emblematic bit: Can the Bulldogs do this? They've got a shot. Diaz points out they won't  be intimidated since their scheduled was littered with Heisman finalists, including the 6-6 controversy robot that won the thing. MSU held him to 70 yards rushing on 18 attempts and 136 yards passing in a 17-14 loss; if they do the same to Michigan and give up 17 points they won't be losing. \"With such a small margin of error, it might be our death.” “It’s all about gap control,” Diaz said. “They do some pretty good things with their run game. They’re going to ask you the questions and you have to have",
    "textAfterTable": "The problems usually came in the form of big gains, like a 56-yard Julio Jones run by Alabama, a 64-yard Knile Davis run by Arkansas, and even the aforementioned long touchdown by the Alcorn State Acorns. The ruthless math of blitzing is that when you're wrong, you're really wrong. Mississippi State has not found a way to defy this, but they're good enough that you're going to be in second and long lots and unless you rip off a long one you're not cracking 5 YPC even if you've got Cam Newton. They also managed to give up 24 points to a 4-8 Conference USA team a week after holding Florida to seven—unpredictability is inherent in the system. This begins to be old hat but the numbers above indicate a certain difficulty with spread systems—Florida, Auburn, and Arkansas had three of the top four rushing days against the Ole Miss defense. As you can see above and Georgia found out in their loss to MSU early in the year, the question you're asking when you line up under center and run pro-style at this thing is \"do you know how much I like second and long?\" Michigan's spread will pull linebackers outside and ask questions of the safeties, who I liked in the Georgia game but Alcorn State (and everything else) analyst Blue Seoul",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}