{
    "relation": [
        [
            "Player, Team",
            "David Price, Rays",
            "Justin Verlander, Tigers",
            "Jered Weaver, Angels",
            "Felix Hernandez, Mariners",
            "Fernando Rodney, Rays",
            "Chris Sale, White Sox",
            "Jim Johnson, Orioles",
            "Matt Harrison, Rangers",
            "Yu Darvish, Rangers"
        ],
        [
            "1st",
            "14",
            "13",
            "",
            "",
            "1",
            "",
            "",
            "",
            ""
        ],
        [
            "2nd",
            "13",
            "13",
            "2",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "3rd",
            "1",
            "2",
            "14",
            "5",
            "5",
            "1",
            "",
            "",
            ""
        ],
        [
            "4th",
            "",
            "",
            "9",
            "10",
            "4",
            "4",
            "1",
            "",
            ""
        ],
        [
            "5th",
            "",
            "",
            "2",
            "6",
            "8",
            "6",
            "3",
            "2",
            "1"
        ],
        [
            "Points",
            "153",
            "149",
            "70",
            "41",
            "38",
            "17",
            "5",
            "2",
            "1"
        ]
    ],
    "pageTitle": "Angels ace Jered Weaver finished third in AL Cy Young voting. | angels.com",
    "title": "",
    "url": "http://m.angels.mlb.com/news/article/40282484",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989443.69/warc/CC-MAIN-20150728002309-00015-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 154024923,
    "recordOffset": 153999753,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1388=As a result of a lower back strain that put him on the shelf for most of June, Weaver ranked 20th in the AL in innings (188 2/3) and tied for 24th in strikeouts (142), which ultimately cost him in this race. But he came up big when healthy, and when the star-studded rotation went bad for about a six-week stretch around the All-Star break, Weaver was the one constant., 3573=Weaver finished fifth in 2010, second in 2011 and third in 2012, leaving Bartolo Colon (2005) and Dean Chance (1964) as the only Cy Young winners in Angels history., 3386=In the latest ballot, Price (14 first-place votes) got 153 points and Verlander (13) got 149, making up the closest AL Cy Young vote besides the 1969 tie between the Orioles' Mike Cuellar and the Tigers' Denny McLain., 2802=Weaver is also nominated for two of MLB.com's Greatness in Baseball Yearly Awards, for best starting pitcher and top pitching moment (the May 2 no-hitter against the Twins). The GIBBYs are voted on by fans and a panel of experts and will be revealed during the Winter Meetings in Nashville, Tenn., on Dec. 4., 4220=In 2012, it was Rays lefty David Price who was instead given the American League's Cy Young Award by the Baseball Writers' Association of America, beating out the Tigers' Justin Verlander and Weaver -- the two other finalists -- in a Wednesday announcement on MLB Network., 2471=In some ways, Weaver's 2012 season paled in comparison to the previous one, when he posted a career-low 2.41 ERA in a career-high 235 2/3 innings and finished second to Verlander in Cy Young voting.}",
    "textBeforeTable": "But the BBWAA felt differently -- again. \"I think if you break down our team, and especially the circumstances of carrying us for really what was six weeks, we're not in playoff contention, we're not in a pennant race, if it wasn't for what Jered did, just taking the ball every fifth day, coming in and saying, 'Hey, I'll pitch in three days if I have to,' doing whatever,\" Scioscia said after the regular-season finale. \"This guy wants to win. He's a pitcher in the true sense of the word, and in my mind he's the Cy Young winner.\" That, in manager Mike Scioscia's eyes, made him the Cy Young favorite. As a result of a lower back strain that put him on the shelf for most of June, Weaver ranked 20th in the AL in innings (188 2/3) and tied for 24th in strikeouts (142), which ultimately cost him in this race. But he came up big when healthy, and when the star-studded rotation went bad for about a six-week stretch around the All-Star break, Weaver was the one constant. Weaver's 20-5 record put him tied with Price for first in wins and winning percentage (.800). His 2.81 ERA was third-best in the AL, trailing only Price (2.56) and Verlander (2.64), and his 1.02 WHIP (walks plus hits per inning pitched) was tied with Kershaw for the lowest",
    "textAfterTable": "Alden Gonzalez is a reporter for MLB.com. Read his blog, Gonzo and \"The Show\", and follow him on Twitter @Alden_Gonzalez. This story was not subject to the approval of Major League Baseball or its clubs. Share This Email Print + Hide Comments 0 COMMENTS Weaver finishes third for AL Cy Young",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}