{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "",
            "",
            "16",
            "17"
        ],
        [
            "Date",
            "March 28, 2009",
            "April 10, 2009",
            "April 10, 2009",
            "April 10, 2009",
            "April 10, 2009",
            "April 10, 2009",
            "April 10, 2009",
            "April 10, 2009",
            "April 10, 2009",
            "April 10, 2009",
            "April 10, 2009",
            "April 10, 2009",
            "April 11, 2009",
            "May 4, 2009",
            "May 4, 2009",
            "",
            "",
            "June 27, 2009",
            "August 12, 2009"
        ],
        [
            "County",
            "Clarendon",
            "Oconee",
            "Anderson",
            "Anderson",
            "Abbeville",
            "Abbeville",
            "Union",
            "Greenwood",
            "Greenwood",
            "Aiken",
            "Barnwell",
            "Allendale",
            "Allendale",
            "Laurens",
            "Fairfield",
            "",
            "",
            "Berkeley",
            "Horry"
        ],
        [
            "Description",
            "(EF1) Two veteran spotters photographed and video taped the tornado as it touched down in the woods off of Bill Davis road and traveled northeast just east of Davis Station. Numerous trees were down but there was no structural damage as no homes or buildings were in its path. A cold front moved through the area during the evening and produced severe thunderstorms in Orangeburg and Clarendon counties. One tornado was confirmed.",
            "(EF0)A brief tornado touchdown was reported near the Georgia state line one mile west of Long Creek. Width not reported (NR).",
            "(EF1) NWS survey found an area of tornado damage that began on Dry Rock Rd near its intersection with Andersonville Rd six miles south of Townville. (It is possible that the tornado began over Lake Hartwell.) Damage was mainly confined to uprooted or snapped trees at this point, although two mobile homes were shifted off their foundation at this location.. The most significant damage occurred just east of this location, in the Snyder Rd area. A storage shelter was destroyed in this area and a travel trailer blown off concretet blocks. Other storage shelters received signifiumerous trees were snapped off or uprooted along Snyder Rd, with trees falling on several homes. The tornado traveled east from Snyder Rd, crossing an inlet of Lake Hartwell before re-emerging in the Sandy Shores Dr area. The tornado continued east, moving back over Lake Hartwell, where some trees were blown down on islands. The tornado apparently dissipated over the lake seven miles west-northwest of the Anderson County airport. East of Snyder Rd, damage was almost exclusively confined to snapped and uprooted trees, although some boat shelters and docks on Lake Hartwell were lifted and tossed as much as 100 feet. Property damage: $300,000.",
            "(EF0) This tornado began along Old Williamston Rd near its intersection with Brooks Rd four miles northwest of Campbell. The tornado traveled northeast, paralleling Old Williamston Rd before crossing Boggs Rd and Opp Rd, then lifting near the intersection of Brown Rd and highway 29 three miles west-northwest of Cheddar. Damage was confined to uprooted trees along the path, with a few smaller trees snapped off. The tornado was produced by a supercell thunderstorm as it was being overtaken by a line of storms.",
            "(EF1) Numerous trees were blown down along Old Calhoun Falls Rd. Part of the roof of a home was also severely damaged, and some siding was torn off. A tree fell through the roof of another home. The tornado touched down initially three miles northwest of Watts. Property damage: $50,000.",
            "(EF2) NWS survey found an extensive area of damage in the city of Abbeville consistent with a strong EF2 tornado. The tornado began four miles north of Watts, near the intersection of highway 71 and Rock Hill Rd before moving east/southeast through the city of Abbeville. The main areas affected in the city were Church Street, McGowan, Ave, Main St, and especially Secession Ave. The roofs were blown off about a half dozen frame homes in the city, while numerous mobile homes were heavily damaged or destroyed. A few other office buildings and businesses received major roof damage in this area. Numerous trees were snapped off or uprooted along the path. One tree fell through a home, injuring the man inside. Another man caught outside received head injuries from flying debris. The tornado lifted about a mile east-southeast of the city, one mile north-northwest of the Abbeville Davis airport. Property damage: $1.0 million.",
            "(EF1) NWS survey found an area of tornado damage that began about two mileseaast of Mean Crossroads in the Proctor/Zig Zag Rd area. Several trees were snapped off or uprooted in this area and some outdoor objects blown around. The tornado moved almost due east to T Bishop Rd, where a mobile home was destroyed and another heavily damaged. Dozens of trees were also uprooted and snapped off in this area. The tornado continued along an intermittent path to the east before uprooting numerous pine and cedar trees on Jonesville Highway about 3 miles southeast of Jonesville. A 3-ton trailer was moved about 100 feet, and a home received minor roof damage at this location. The tornado continued on to Bob Little Rd, where a plant building received major roof damage. The tornado then damaged two mobile homes before lifting 3.5 SE of Jonesville, one mile southeast of Lockhart Junction. Property damage: $400,000.",
            "(EF1) NWS survey identified a tornado path that began near the intersection of Hunters Creek Bvd and Woodlawn Rd two miles south-southwest of Harris. The tornado continued east-southeast across the south side of Greenwood, uprooting or snapping off numerous trees along the path. The hardest hit area was around Edgefield St, where numerous trees were damaged. Some trees fell on and seriously damaged homes. Other homes received significant roof damage. Property damage: $200,000.",
            "(EF1) A second tornado path was found a couple of miles north of the main tornado track through Greenwood. This tornado began on Karlie Ct just off Laurel Rd. one mile east-southeast of Grendel Mills. Once again, numerous trees were uprooted or snapped off. However, more structural damage was observed along this path. Several homes received minor to moderate roof damage. Siding and gutters were blown off a few homes as well. A home near the end of the path received the most significant, damage, with part of the roof completely blown off and and the collapse of an adjacent exterior wall. The tornado lifted two miles west-southwest of Saluca. A storage trailer was also blown over in this area. Also, a tree fell across a train track on Emerald Rd, causing a train to derail. Property damage: $300,000.",
            "(EF3) The supercell coming out of Richmond County GA spawned another tornado in Aiken county that did widespread damage. The tornado touched down two miles east-southeast of Beech Island Many homes and business were severely damaged. Numerous trees and powerlines were down and there were around a dozen minor injuries. The tornado tracked along hwy 278 and lifted five miles east-southeast of Talatha. There was one indirect death of a man who crashed trying to avoid trees on the highway and was killed. 14 injuries. Property damage: $5.0 million.",
            "(EF0) A tornado that tracked across Burke County GA, jumped the Savannah River and briefly touched down four miles south-southeast of Robbins in Barnwell county near the DOE Savannah River Site taking down trees. Width not reported (NR).",
            "(EF1) The first of two tornadoes touched down 2.1 miles north-northwest of Martin at 1226 AM. The tornado traveled approximately 1.2 miles before lifting 1.8 miles north-northeast of Martin at approximately 1228 AM. There was significant tree damage throughout the path of the tornado, but no structures were damaged. Property damage: $1.0 million.",
            "(EF2) The second tornado touched down along Roberts Road 3.5 miles northeast of Martin at 1230 AM,and traveled 5.6 miles before lifting. Initially the tornado uprooted or snapped numerous trees with one tree falling on a mobile home and damaging the roof of the structure. The under-skirting of the mobile home was peeled back by the winds and a couple of windows were blown out. Additionally, several cars sustained damage by falling trees outside of the mobile home. Other homes along Roberts Road received minor roof damage, and several carports were slightly damaged as well. The tornado continued nearly parallel Miller Creek Road, downing numerous trees and power lines. The maximum width of the tornado was approximately 500 yards near the intersection of Camp Jackson Road and Miller Creek Road. The tornado lifted 2.3 miles south- southeast of Kline, just past the intersection of Appleton Road and Bamberg Highway-US highway 278 at 1239 AM, but not before damaging the roof and cinder-block walls of a home, downing numerous trees,and completely destroying the historic Cave Methodist Church. The church was wiped completely off its foundation...and several grave stones surrounding the church were overturned or knocked down. An 18 wheel truck was overturned a couple hundred feet from Cave Methodist Church, with a tree falling on it and causing further damage. In total 4 homes, 1 mobile home, 1 church,and 5 vehicles received damage as a result of this tornado. Hundreds of acres of timber were damaged or destroyed. Fortunately the tornado did not result in any injuries or fatalities. The National Weather Service damage survey team estimated the tornadic winds between 120 and 130 mph. Property damage: $1.0 million.",
            "(EF0) A tornado path begin near the intersection of Amber Hill Circlr and Watts Bridge Rd three miles south of Cross Hill, where a few small trees were snapped off. The tornado moved east northeast to an RV park near the intersection of Watts Bridge and Morse Landing Rd. Two travel trailers were blown over and rolled 20-30 yards at this location. An outbuilding was destroyed and a mobile home received minor roof damage just south of the park. A few trees were snapped off in this area as well. The tornado appeared to lift as it crossed a hollow just east of Morse Landing Rd. However, additional damage to trees was observed on Barnett Rd. The tornado lifted near the intersection of Skippers Lodge Rd just north of Barnett Rd, where two large pine trees were uprooted. Property damage: 20,000.",
            "(EF0) NWS storm survey and Fairfield Electric COOP found trees and some powerlines down from a small tornado. It was associated with the supercell that originated over Laurens County that went across Newberry and into Fairfield County. Property damage $4000.",
            "",
            "",
            "(EF0) A National Weather Service storm survey team has confirmed an EF0 tornado in Hanahan South Carolina. Based on eyewitness reports and a survey of the damage,a tornado developed over Turkey Creek and tracked south-southwest for about 0.25 miles along the marsh just east of East Recess Road and west of Dennis Drive before dissipating. Straight-line winds produced extensive tree damage adjacent to the short path of the tornado,along a 0.75 mile wide area extending from east recess road to steward street and along a length of approximately 0.70 miles extending from Turkey Creek to Meadowcliff Avenue. Numerous large trees were knocked down, tops of many trees were sheared off, and tops of some power poles were broken off. There was minor damage to several homes and other structures,mainly a result of the fallen trees and/or tree limbs. SCE&G reported nearly 3500 without power after the storm as a result of downed power lines.",
            "(EF0) a tornado initially touched down near the intersection of Highway 378 and Marigold Road six miles west of Conway causing damage to some trees. The tornado knocked a tree onto a single wide home and ripped part of the roof off a single residence home along Marigold Road. the tornado caused sporadic tree damage before causing significant damage to an abandoned barn along Marigold Road. The top section of the barn was sheared back into a small field opposing the movement of the tornado. There were also about a dozen snapped pine trees in the general area the barn was located.The tornado moved across Hampton Road near the intersection of Marigold Road and dissipated."
        ],
        [
            "Length (miles)",
            "4",
            "<1",
            "3",
            "2",
            "1",
            "7",
            "4",
            "5",
            "3",
            "15",
            "<1",
            "1",
            "6",
            "2",
            "2",
            "",
            "",
            "<1",
            "1"
        ],
        [
            "Width (yards)",
            "330",
            "NR",
            "400",
            "100",
            "200",
            "300",
            "350",
            "200",
            "200",
            "880",
            "NR",
            "300",
            "500",
            "50",
            "50",
            "",
            "",
            "40",
            "40"
        ]
    ],
    "pageTitle": "South Carolina State Climatology Office",
    "title": "",
    "url": "http://www.dnr.sc.gov/climate/sco/ClimateData/2009_tornado_stats.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989443.69/warc/CC-MAIN-20150728002309-00215-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 411162103,
    "recordOffset": 411153901,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16838=1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013}",
    "textBeforeTable": "2009 --> Summary of Tornado Statistics by County - 1950-2001 Summary of Injuries caused by Tornadoes - 1950-2001 - 1950-2001 Summary of Deaths caused by Tornadoes --> startLeftCol(); rightColInfo(mywidth); centerColInfo(); var mywidth='wide'; headerInfo(mywidth); E-mail Us Contact Information Navigation Welcome South Carolina State Climatology Office Download latest FREE Java\u0099 Download latest FREE Adobe® Reader® Site Map 2011 South Carolina Drought Pictures",
    "textAfterTable": "1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 State Climatology Office Welcome ¦ Contact Info ¦  Site Map Columbia, SC 29202",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}