{
    "relation": [
        [
            "Container",
            "Oracle WebLogic Server",
            "Oracle OC4J",
            "GlassFish",
            "GlassFish",
            "SUN Application Server",
            "SAP NetWeaver Application Server",
            "JBoss",
            "IBM WebSphere",
            "IBM WebSphere",
            "TMAX Jues"
        ],
        [
            "Version",
            "10.3.6.0 / 12c",
            "10.1.3.5",
            "V3",
            "V2.1.1",
            "9.1",
            "7.2",
            "6.0.0M1",
            "7.0.0.5",
            "6.1.0.0",
            "6"
        ],
        [
            "Java EE Spec.",
            "5 + (JPA 2.0, JSF 2, JAX-RS 1.1)",
            "1.4 (with EJB 3.0)",
            "6",
            "5",
            "5",
            "5",
            "6",
            "5",
            "1.4/5",
            "5"
        ],
        [
            "Source DDL-gen JPA Entities JAR",
            "EAREJBWAR",
            "EAREJBWAR",
            "-",
            "-",
            "-",
            "",
            "EAREJBWAR",
            "309201 CM EAR",
            "-",
            ""
        ],
        [
            "Issues",
            "- See application-scoped datasource workaround. - TODO 20100115: Update for WebLogic 10.3.6 and JPA 2.0 - Verify weaving works in container and application managed EM modes (the current data model only uses @OneToOne and @ManyToMany) Oracle WebLogic Tutorials",
            "- Updated for version 10.1.3.5",
            "- Use V3 prelude - not TP2 - Use the 1.0.9+ snapshot plugin (with fixed library references) against a prelude server - currently at b73 which runs EclipseLink 2.0 with JPA 2.0 support out of the box",
            "- Requires GlassFish V2.1 build 32 - Current Production Release - migrating from TopLink Essentials to EclipseLink",
            "- See GlassFish V2 which is included in Sun AS 9",
            "",
            "- Updated for JBoss 6.0.0M1 - Dynamic weaving is disabled due to (JIRA-572) - see static weaving workaround using the JBoss JSFEJB3 example TODO: >rework tutorial for JBoss 6.0.0 M1",
            "- Updated for Container Managed and Application Managed scenarios as of 20100419 - There is no WAS 7.0 Eclipse WTP Server plugin yet - you can attach the Eclipse IDE to a WebSphere 7 server in debug mode on port 7777",
            "- Supports JPA1/EJB3 with optional feature pack on Java SE 1.5 - The WAS 6.1 Eclipse WTP Server plugin (ehr 160221) should be in the next release of Ganymede 3.4 in Dec08 - or use manual or python deployment",
            "- 331717 - A wrapper around GlassFish server"
        ]
    ],
    "pageTitle": "Difference between revisions of \"EclipseLink/Examples/JPA\" - Eclipsepedia",
    "title": "",
    "url": "http://wiki.eclipse.org/index.php?title=EclipseLink/Examples/JPA&diff=330619&oldid=327654",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988598.68/warc/CC-MAIN-20150728002308-00227-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 259908423,
    "recordOffset": 259892029,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{50087=Copyright © 2014 The Eclipse Foundation. All Rights Reserved.}",
    "textBeforeTable": "These tutorials need to be finished and/or expanded - vote for EclipseLink bug# 308477 if you would like this work to be fast tracked. We use a standard container managed @PersistenceContext(..TransactionType dependency injected EntityManager) that is injected on a @Stateless session bean so that the container can provide a thread safe proxy wrapper around the @NotThreadSafe EntityManager and provide us with instrumented transaction management and change tracking. The client servlet gets injected with the @EJB SSB by the web container and is completely separated from the JPA persistence concern. Step by step instructions by container for a quick-start Java EE EclipseLink JPA container-managed Application using a single JPA Entity on the major subset of all application servers Java EE 5 Compliant Application Servers Enterprise Application Servers See the Distributed JPA Application case study on how a Service/Workers parallel pattern based application uses JPA to deal with Optimistic lock exception scenarios using Java EE 6 API elements - specifically as a single persistence unit used by the distributed application as an alternative to using a shared L2 cache. The following tutorials are for enterprise developers interested in container or application managed persistence using the JPA 1.0 or 2.0 API. Application Server Tutorials Tutorials",
    "textAfterTable": "Lightweight Application Servers Tutorial: Build a Web Application (JSF) Using JPA on Tomcat Container Version Java EE Spec. Source DDL-gen JPA Entities JAR Issues Eclipse Virgo (was SpringSource dm) 2.1 6 (WAR only) - Virgo is an OSGI enabled web container based on the recently contributed VMWare Springsource dm server and the Gemini OSGI web container (which was aimed at Springsource OSGI users. SpringSource tc 6.0.20 5 (WAR only) - - see STS 2.3.0 as in TomCat server based IBM WebSphere CE 2.1.0.1 5 - - WebSphere CE 2.1 is only certified on Java SE 1.5 (SUN JRE 1.6 runtime support is available) Apache Geronimo 2.0.2 5 - - see WebSphere CE which wraps Geronimo, Derby and OpenJPA Jetty 7  ?",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}