{
    "relation": [
        [
            "Hotel Picture",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Hotel Name",
            "Sonesta Hotel Barranquilla",
            "Howard Johnson Hotel Versalles Barranquilla",
            "Hotel Atlantis Suites",
            "NH Collection Royal Smartsuites",
            "Dann Carlton Barranquilla",
            "Hampton BY Hilton Barranquilla",
            "Hotel EL Prado",
            "Country International Hotel",
            "Hotel Puerta Del Sol Barranquilla"
        ],
        [
            "Hotel Type",
            "Midrange",
            "Upscale",
            "Midrange",
            "Midrange",
            "Midrange",
            "Upscale",
            "Midrange",
            "Midrange",
            "Midrange"
        ],
        [
            "Rating",
            "Not Rated",
            "Not Rated",
            "Not Rated",
            "Not Rated",
            "Not Rated",
            "Not Rated",
            "",
            "Not Rated",
            ""
        ],
        [
            "Best Price*",
            "$110.00",
            "$80.76",
            "$119.92",
            "$89.00",
            "$221.00",
            "$78.79",
            "$113.00",
            "$114.50",
            "$74.77"
        ],
        [
            "High Price*",
            "$310.00",
            "$102.01",
            "$202.52",
            "$130.00",
            "$340.00",
            "$115.80",
            "$224.00",
            "$162.50",
            "$87.98"
        ],
        [
            "Description",
            "The Sonesta Hotel Barranquilla is located an exclusive neighborhood in Barranquilla and just a few miles from Ernesto Cortissoz International Airport.",
            "Howard Johnson Hotel Versalles is eight miles from Ernesto Cortissoz (BAQ) Airport.",
            "Modern Hotel With a Warm Comfortable and Safe Enviorment. It Has 24-Hour Reception Car Rental Service If Required Room Service Wireless Internet Conference",
            "El Hotel Es El Mejor Ubicado De La Ciudad Y Que Brinda Un Servicio Amigable Y Exclusivo. Entre Los Servicios Que Ofrece Están Un Lobby Imponente Una",
            "THIS PROPERTY WAS BUILT IN 2005",
            "Home of the Carnaval de Barranquilla the Hampton by Hilton Barranquilla is located in one of the most exclusive neighborhoods in the city. World-class",
            "To be a guest at Hotel El Prado is to feel and enjoy the true image of Barranquilla. The hotel has 200 rooms luxuriously furnished suites and cabanas.",
            "COUNTRY INTERNATIONAL HOTEL IS A MODERN HOTEL RECENTLY RENOVATED TO SATISFY THE NEEDS OF OUR BUSINESS AND LEISURE GUESTS WITH THE HIGHEST QUALITY STANDARDS",
            "Hotel Puerta del Sol is located in north of the city of Barranquilla it is accessible and near to the banking and commercial area."
        ],
        [
            "Check Availability",
            "Check Availability",
            "Check Availability",
            "Check Availability",
            "Check Availability",
            "Check Availability",
            "Check Availability",
            "Check Availability",
            "Check Availability",
            "Check Availability"
        ]
    ],
    "pageTitle": "Colombia Breakfast Hotels - Hotel Rooms",
    "title": "",
    "url": "http://www.whenwetravel.com/travel_destination_hotel/south_america/colombia/4_150/breakfast_hotels.jsp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00208-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 826157039,
    "recordOffset": 826148837,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "",
    "textAfterTable": "Colombia Breakfast Hotels and Hotel Destinations The Colombia Breakfast hotels listed on this page and in the following destinations are hotels that offer breakfast as a part of their hotel room rate. The list includes bed and breafast hotels and hotels that offer a full breakfast or a continental breakfast with the hotel room rate. Below you'll find Colombia Breakfast hotel travel and vacation destinations. Click the links to drill into a specific destination or use our Hotel Vacation Destination Search to find your next vacation destination fast. Our Hotel Search offers the most sophisticated way to find hotel rooms from over 70,000 hotels around the world. Search by hotel, price range, rating, and even amenities. Give it a try and make your next hotel reservation with WhenWeTravel!",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}