{
    "relation": [
        [
            "Name",
            "American Pet Diner Timmy Rabbit",
            "Kaytee Forti-Diet Pro Health Rabbit Food (Adult)",
            "Kaytee Supreme Rabbit Food",
            "Kaytee Timothy Complete Rabbit Food",
            "Marshall Peter's Premium Rabbit Diet - Maintenance Formula",
            "Martin Mills little friends Timothy Adult Rabbit Food",
            "Mazuri Rabbit Diet",
            "Oxbow Essentials Bunny Basics - Adult Rabbit Food",
            "Oxbow Natural Science - Adult Rabbit Food",
            "Oxbow BeneTerra Organic Rabbit",
            "Purina Rabbit Chow Complete",
            "Sweet Meadow Timothy Pellets",
            "Walmart Small World Complete Rabbit Feed",
            "ZuPreem Nature's Promise Premium Rabbit Food",
            "ZuPreem Nature's Promise Timothy Naturals Premium Rabbit Food",
            "Supreme Petfoods Science Selective Rabbit",
            "Supreme Petfoods Science Selective Rabbit Mature, 4 years+"
        ],
        [
            "Ingredients",
            "Sun Cured Timothy Meal, Dried Beet Pulp, Whole Pressed Safflower Seed Meal, Dehulled soybean Meal, Canola Meal, Yeast Culture (Diamond V “XP”), Salt, Sodium Lignosulfonate, Mono-Sodium Phosphate, Mold Inhibitor (Propionic Acid, Acetic Acid, Sorbic Acid, Benzoic Acid, Ammonium Hydroxide), Yeast Cell Wall Extract, Vitamin E Supplement, Flavoring, Magnesium Oxide, Yucca Schidigera Extract, Mixed tocopherils, Rosemary Extract, Ascorbic Acid, Citric Acid, Lecithin, Silicon Dioxide (carrier for liquid antioxidants), Vitamin A Supplement, Vitamin D3 Supplement, Choline Chloride, Niacin Supplement, Calcium Pantothenate, Menadione Sodium Bisulfite (source of Vitamin K activity), Riboflavin Supplement, Thiamine Mononitrate, Pyidoxine Hydrochloride, K-Biotin, Folic Acid, Vitamin B-12 Supplement, Zinc Oxide, Manganous Oxide, Ferrous Sulfate, Copper Sulfate, Ethylene Diamine Dihydroiodide, Cobalt Sulfate, Sodium Selenite.",
            "Sun-cured Timothy Grass Hay, Sun-cured Alfalfa Meal, Ground Oats, Ground Oat Hulls, Dried Cane Molasses, Ground Flax Seed, Dehulled Soybean Meal, Ground Rice, Salt, Algae Meal (source of Omega-3 DHA), Fructooligosaccharide, Dicalcium Phosphate, DL-Methionine, Yeast Extract, Yucca Schidigera Extract, Vitamin A Supplement, Choline Chloride, Mixed Tocopherols (a preservative), Copper Sulfate, Ferrous Sulfate, Manganous Oxide, Zinc Oxide, Riboflavin Supplement, Vitamin B12 Supplement, Vitamin E Supplement, Niacin, Menadione Sodium Bisulfite Complex (source of vitamin K activity), Rosemary Extract, Citric Acid, Cholecalciferol (source of vitamin D3), Calcium Pantothenate, Pyridoxine Hydrochloride, Thiamine Mononitrate, Calcium Iodate, Biotin, Folic Acid, Dried A. oryzae Fermentation Extract (source of protease), Dried Bacillus licheniformis Fermentation Product, Dried Bacillus subtilis Fermentation Product, Cobalt Carbonate, Sodium Selenite, Artificial Color. Allergen information: Manufactured in a facility that processes peanuts and other tree nuts.",
            "Sun-cured Alfalfa Meal, Wheat Middlings, Ground Grain Products, Plant Protein Products, Cane Molasses, Salt, Lignin Sulfonate, Dicalcium Phosphate, DL-Methionine, Vitamin A Supplement, Choline Chloride, Mixed Tocopherols (a preservative), Ferrous Sulfate, Manganous Oxide, Zinc Oxide, Riboflavin Supplement, Vitamin B12 Supplement, Vitamin E Supplement, Copper Sulfate, Niacin, Menadione Sodium Bisulfite Complex (source of vitamin K activity), Rosemary Extract, Citric Acid, Cholecalciferol (source of vitamin D3), Calcium Pantothenate, Pyridoxine Hydrochloride, Thiamine Mononitrate, Calcium Iodate, Biotin, Folic Acid, Cobalt Carbonate, Sodium Selenite. Allergen information: Manufactured in a facility that processes peanuts and other tree nuts.",
            "Sun-cured Timothy Grass Hay, Oat Hulls, Wheat Middlings, Dehulled Soybean Meal, Ground Wheat, Ground Oats, Ground Flax Seed, Dried Cane Molasses, Salt, Dicalcium Phosphate, DL-Methionine, Yucca Schidigera Extract, Vitamin A Supplement, Choline Chloride, Mixed Tocopherols (a preservative), Ferrous Sulfate, Manganous Oxide, Zinc Oxide, Riboflavin Supplement, Vitamin B12 Supplement, Vitamin E Supplement, Copper Sulfate, Niacin, Menadione Sodium Bisulfite Complex (source of vitamin K activity), Rosemary Extract, Citric Acid, Cholecalciferol (source of vitamin D3), Calcium Pantothenate, Pyridoxine Hydrochloride, Thiamine Mononitrate, Calcium Iodate, Biotin, Folic Acid, Dried A. oryzae Fermentation Extract (source of protease), Dried Bacillus licheniformis Fermentation Product, Dried Bacillus subtilis Fermentation Product, Cobalt Carbonate, Sodium Selenite.",
            "Dehydrated Alfalfa Meal, Wheat Shorts, Oat Hulls, Sun-cured Meadow Fescue Hay, Dehydrated Corn Distiller's Grains, Sun-cured Alaska Brome Hay, Dried Beet Pulp, Sun-cured Perennial Ryegrass Hay, Sun-cured Timothy Hay, Sun-cured Birdsfoot Trefoil Hay, Dried Cane Molasses, Sun-cured Red Clover Hay, Sun-cured Bluegrass Hay, Sun-cured White Clover Hay, Dandelion, DL-Methionine, Dried Yeast Extract, Magnesium Oxide, Salt, Dicalcium Phosphate, Calcium Carbonate, Vitamin A Supplement, Vitmain D Supplement, and Vitamin E Supplement.",
            "Timothy Meal, Soybean Hulls, Wheat Middlings, Soybeans, Barley, Soya Oil (preserved with Rosemary Extract, Mixed Tocopherols and Citric Acid), Wheat Germ, Brewers Yeast, Dicalcium Phosphate, Lignin Sulfonate , Salt, Calcium Carbonate, Rice Hulls, DL-Methionine, Mannan OligoSaccharide, Ascorbic Acid (a source of Vitamin C), Choline Chloride, Iron Sulphate, Yucca Schidigera Extract, Vitamin E, Zinc Oxide, Manganese Sulfate, Niacin, Mineral Oil, Copper Sulphate, Folic Acid, Calcium Pantothenate, Vitamin B12, Vitamin A, Biotin, Selenium, Vitamin K, Riboflavin, Vitamin D3, Pyridoxine Hydrochloride, Thiamine Mononitrate, Calcium Iodate, Cobalt Sulphate.",
            "Dehydrated Timothy, Ground Soybean Hulls, Wheat Middlings, Dehulled Soybean Meal, Ground Oat Hulls, Cane Molasses, Ground Beet Pulp, Flaxseed, Lignin Sulfonate, Soybean Oil, Salt, Calcium Carbonate, Dicalcium Phosphate, Choline Chloride, Dl-methionine, Brewers Dried Yeast, Dried Yucca Shidigera Extract, Magnesium Oxide, Vitamin a Acetate, Folic Acid, Cholecalciferol, Pyridoxine Hydrochloride, D-alpha Tocopheryl Acetate, Calcium Pantothenate, Nicotinic Acid, Riboflavin, Dried Lactobacillus Acidophilus Fermenation Product, Dried Enterococcus Faecium Fermentation Product, Vitamin B-12 Supplement, Manganous Oxide, Zinc Oxide, Ferrous Carbonate, Copper Sulfate, Zinc Sulfate, Calcium Iodate, Cobalt Carbonate, Sodium Selenite.",
            "Timothy Grass Meal, Soybean Hulls, Wheat Middlings, Soybean Meal, Cane Molasses, Sodium Bentonite, Soybean Oil, Salt, Lignin Sulfonate, Limestone, Yeast Culture (dehydrated), Vitamin E Supplement, Choline Chloride, Zinc Proteinate, Zinc Sulfate, Ferrous Sulfate, Niacin, Copper Sulfate, Selenium Yeast, Vitamin A Supplement, Folic Acid, d-Calcium Pantothenate, Copper Proteinate, Riboflavin Supplement, Manganese Proteinate, Biotin, Manganous Oxide, Thiamine Mononitrate, Magnesium Sulfate, Vitamin B12 Supplement, Sodium Selenite, Pyridoxine Hydrochloride, Cobalt Carbonate, Vitamin D3 Supplement, Calcium Iodate",
            "Timothy Grass, Orchard Grass, Oat Grass, Oat Hulls, Canola Meal, Whole Yellow Pea, Whole Barley, Tomato Pomace (dehydrated), Cane Molasses, Flax Seed, Yeast Culture (dehydrated), Sodium Bentonite, Salt, Lignin Sulfonate, Calcium Carbonate, Dried Rosemary, Dried Thyme, L-Ascorbyl-2-Monophosphate (Vitamin C), Inulin, Vitamin E Supplement, Choline Chloride, Zinc Proteinate, Zinc Sulfate, Ferrous Sulfate, Niacin, Copper Sulfate, Selenium Yeast, Vitamin A Supplement, Folic Acid, d-Calcium Pantothenate, Copper Proteinate, Riboflavin Supplement, Manganese Proteinate, Biotin, Manganous Oxide, Thiamine Mononitrate, Magnesium Sulfate, Vitamin B12 Supplement, Sodium Selenite, Pyridoxine Hydrochloride, Cobalt Carbonate, Vitamin D3 Supplement, Calcium Iodate",
            "Organic Grass Hay, Organic Canola Meal, Organic Wheat Straw, Organic Sunflower Meal, Organic Barley, Organic Flax Seed, Sodium Bentonite, Limestone, Sea Salt, L-Ascorbyl-2-Monophosphate (Source of Vitamin C), Organic Dandelion Leaf, Organic Ground Rosemary, Inulin, Organic Cranberry, Organic Blueberry, Dried Yucca Schidigera, Yeast Culture Dehydrated, Vitamin E Supplement, Choline Chloride, Zinc Proteinate, Zinc Sulfate, Ferrous Sulfate, Niacin, Copper Sulfate, Selenium Yeast, Vitamin A Supplement, Folic Acid, d-Calcium Pantothenate, Copper Proteinate, Riboflavin Supplement, Manganese Proteinate, Biotin, Manganous Oxide, Thiamine Mononitrate, Magnesium Sulfate, Vitamin B12 Supplement, Sodium Selenite, Pyridoxine Hydrochloride, Cobalt Carbonate, Vitamin D3 Supplement, Calcium Iodate.",
            "Dehydrated Alfalfa Meal, Wheat Middlings, Ground Soybean Hulls, Dehulled Soybean Meal, Ground Corn, Wheat Flour, Cane Molasses, Ground Oat Hulls, Lignin Sulfonate, Salt, Monocalcium Phosphate, Calcium Carbonate, DL-Methionine, Choline Chloride, Iron Oxide, L-Lysine, Sodium Selenite, Vitamin E Supplement, Niacin Supplement, Riboflavin, Vitamin A Supplement, Dried Aspergillus Niger Fermentation Extract, Vitamin B12 Supplement, Dried Yeast, Dried Enterococcus Faecium Fermentation Product, Dried Lactobacillus Acidophilus Ferment Product, Vitamin D3 Supplement, Cobalt Carbonate, Manganese Sulfate, Ethylenediamine Dihydriodide, Zinc Sulfate, Dried Yucca Shidigera Extract, Copper Chloride, Dicalcium Phosphate, Monocalcium Phosphate.",
            "Timothy Grass Meal, Soybean Hulls, Wheat Middlings, Soybean Meal, Cane Molasses, Salt, Vitamin E, Calcium Carbonate, Dicalcium Phosphate, Monocalcium Phosphate, Yeast Culter (Sacchromyces cerevisiae), Lacto Sacc, Vitamin A Supplement, Vitamin D Supplement, Vitamin B Supplement, Riboflavin Supplement, Niacin Supplement, Calcium Pantothenate, Choline Chloride, Biotin, Menadione Sodium Bisulfate Complex (Source of Vitamin K activity), Magnesium Oxide, Manganese Sulfate, Copper Sulfate, Ferrous Sulfate, Cobalt Sulfate, Polysaccaride Complexes of Zinc And Iron, Dehydrated Kelp, Ethylenediamine Dihydroide, Methlonine Supplement, Folic Acid, Sodium Selenite, Ascorbic Aced (source of Vitamin C) and Yucca Schidigera Extract",
            "Dehydrated Alfalfa Meal, Wheat Middlings, Roughage Products, Soybean Meal, Feeding Oatmeal, Dl-Methionine, Yucca Schidigera, Calcium Carbonate, Salt, Ferrous Carbonate, Ferrous Sulfate, Copper Sulfate, Manganous Oxide, Manganese Sulfate, Zinc Oxide, Zinc Sulfate, Cobalt Carbonate, Calcium Iodate, Sodium Selenite, Vitamin A Supplement, Vitamin D3 Supplement, Vitamin E Supplement, Thiamine Mononitrate, Riboflavin Supplement, Niacin Supplement, Choline Chloride, Calcium Pantothenate, Pyridoxine Hydrochloride, Folic Acid, Biotin, Vitamin B12 Supplement. Note: This Product Was Made In A Facility That Handles Peanuts.",
            "Sun-cured timothy grass hay, Corn gluten meal, Ground corn, Dried beet pulp, Dicalcium phosphate, Dextrose, Salt, Calcium carbonate, Flaxseed meal, Brewers dried yeast, Ground vegetables (carrots, celery, beets, parsley, lettuce, watercress and spinach), Ascorbic acid, Choline chloride, DL-Mehtionine, L-Lysine, Natural mixed tocopherols, Zinc sulfate, Ferrous sulfate, Moanganese sulfate, Copper sulfate, Zinc proteinate, Calcium iodate, Copper proteinate, Manganese proteinate, Cobalt carbonate, Sodium selenite, Vitamin A Supplement, Vitamin D3 Supplement, Vitamin E Supplement, Niacin, Calcium pantothenate, Riboflavin, Pyridoxine hydrochloride, Thiamine mononitrate, Folic acid, Biotin, Vitamin B12 Supplement.",
            "Sun-cured timothy hay, Soybean hulls, Dried alfalfa meal, Soybean meal, Wheat middlings, Dried molasses, Sodium bentonite, Flaxseeds, Salt, Calcium propionate, Zinc propionate, preserved with Mixed tocopherols and Citric acid, Choline chloride, DL-Methionine, Zinc sulfate, Vitamin E supplement, Dried Yucca schidigera extract, Copper sulfate, Ferrous sulfate, Manganese sulfate, Niacin, Calcium pantothenate, Vitamin A supplement, Ribo?avin, Pyridoxine hydrochloride, Thiamine mononitrate, Sodium selenite, Biotin, Vitamin B12 supplement, Calcium iodate, Vitamin D3 supplement, Cobalt carbonate, Folic acid, Dried Bacillus lichenformis fermentation product, Dried Bacillus subtilis fermentation product, Copper amino acid complex, Manganese amino acid complex, Rosemary extract.",
            "Dehydrated alfalfa meal, soybean hulls, whole wheat, wheat middlings, flaked peas, flaxseed, dried beet pulp, soybean meal, soybean oil, monocalcium phosphate, salt, ground limestone, L-lysine, DL- methionine, choline chloride, vitamin A supplement, vitamin E supplement, cholecalciferol (source of vitamin D3), manganese oxide, zinc oxide, iron sulfate, niacin supplement, d-calcium pantothenate, menadione sodium bisulfite complex (source of vitamin K activity), thiamine hydrochloride (source of vitamin B1), riboflavin supplement (source of vitamin B2), copper sulfate, folic acid, pyridoxine hydrochloride (source of vitamin B6), calcium iodate, biotin, sodium selenite, vitamin B12 supplement.",
            "Dehydrated alfalfa meal, soybean hulls, timothy hay, whole wheat, wheat middlings, flaxseed, flaked peas, thyme, monocalcium phosphate, soybean oil, ground limestone, salt, L-lysine, dried spinach, bilberries, milk thistle seeds, dried mayflower berries, green tea extract, grape seed extract, ginkgo extract, DL-methionine, choline chloride, L-ascorbyl-2-polyphosphate (source of vitamin C), vitamin A supplement, vitamin E supplement, cholecalciferol (source of vitamin D3), manganese oxide, zinc oxide, iron sulfate, niacin supplement, d-calcium pantothenate, menadione sodium bisulfite complex (source of vitamin K activity), thiamine hydrochloride (source of vitamin B1), riboflavin supplement (source of vitamin B2), copper sulfate, folic acid, pyridoxine hydrochloride (source of vitamin B6), calcium iodate, biotin, sodium selenite, vitamin B12 supplement."
        ],
        [
            "Crude Fiber (min)",
            "22.00%",
            "20.00%",
            "13.00%",
            "18.00%",
            "16.00%",
            "20.00%",
            "",
            "25.00%",
            "22.00%",
            "23.00%",
            "17.00%",
            "24.00%",
            "15.00%",
            "",
            "20.00%",
            "21.00%",
            "19.00%"
        ],
        [
            "Crude Fiber (max)",
            "30.00%",
            "25.00%",
            "18.00%",
            "23.00%",
            "21.00%",
            "24.00%",
            "22.00%",
            "29.00%",
            "26.00%",
            "25.00%",
            "20.00%",
            "29.00%",
            "20.00%",
            "28.00%",
            "25.00%",
            "26.00%",
            "24.00%"
        ],
        [
            "Crude Protein (min)",
            "14.50%",
            "12.00%",
            "16.00%",
            "13.00%",
            "14.00%",
            "12.50%",
            "14.00%",
            "14.00%",
            "12.00%",
            "12.00%",
            "16.00%",
            "14.00%",
            "16.00%",
            "14.00%",
            "14.00%",
            "12.00%",
            "10.00%"
        ],
        [
            "Crude Fat (min)",
            "2.00%",
            "2.00%",
            "2.00%",
            "1.5%",
            "2.00%",
            "2.50%",
            "1.50%",
            "2.00%",
            "3.00%",
            "2.00%",
            "1.50%",
            "1.40%",
            "2.50%",
            "1.00%",
            "1.50%",
            "2.50%",
            "3.0%"
        ],
        [
            "Calcium (min)",
            "0.50%",
            "0.30%",
            "0.50%",
            "0.30%",
            "0.50%",
            "0.60%",
            "0.65%",
            "0.35%",
            "0.40%",
            "0.60%",
            "0.60%",
            "0.35%",
            "0.75%",
            "",
            "0.30%",
            "0.6%",
            "0.4%"
        ],
        [
            "Calcium (max)",
            "1.00%",
            "0.80%",
            "1.00%",
            "0.80%",
            "1.00%",
            "0.60%",
            "1.15%",
            "0.85%",
            "0.80%",
            "0.90%",
            "1.10%",
            "0.85%",
            "1.25%",
            "",
            "0.80%",
            "1.0%",
            "0.9%"
        ],
        [
            "Product Page",
            "link",
            "link",
            "link",
            "link",
            "link",
            "link",
            "link",
            "link",
            "link",
            "link",
            "link",
            "link",
            "link",
            "link",
            "link",
            "link",
            "link"
        ]
    ],
    "pageTitle": "Rabbit Pellets Comparison Chart - WabbitWiki",
    "title": "",
    "url": "http://wabbitwiki.com/wiki/Rabbit_Pellets_Comparison_Chart",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989443.69/warc/CC-MAIN-20150728002309-00052-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 246047743,
    "recordOffset": 246029799,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sun, 19 Jul 2015 20:39:57 GMT",
    "textBeforeTable": "The pellets in this section are appropriate for rabbits over the age of 7 months. Rabbits younger than 7 months are more suited to pellets from the other table with higher protein and fat, but eating pellets from the following table will not harm them. Adult Rabbit Pellets 4 See Also 3 Additional Resources 2 Young Rabbit Pellets 1 Adult Rabbit Pellets Contents Lastly, do realize that this is by no means a comprehensive comparison chart. Use your best judgement if you find pellets not on this list that could be acceptable for rabbits. Remember, for a typical house rabbit, the lower the protein, fat, and calcium level and the higher the fiber of pellets, the better. See our Pellets article for more information on proper feeding amounts and pellet ingredients and nutrition. Here we attempt to list all ingredients and nutrition information of acceptable rabbit pellet options for the maintenance of house rabbits. Breeding and show rabbits may require different nutrients; this chart will not cover pellets targeted towards them unless they can be adapted to be fed to young rabbits. Pellets with excessive percentages of fat (>3.0%) and protein (>16%), not enough fiber (<15% avg), and whole nuts, seeds, and fruits have not been included. Some exceptions have been",
    "textAfterTable": "Young Rabbit Pellets The following pellets are appropriate for rabbits under 7 months of age. After that, rabbits should be transitioned to pellets from the table above. Name Ingredients Crude Fiber (min) Crude Fiber (max) Crude Protein (min) Crude Fat (min) Calcium (min) Calcium (max) Product Page American Pet Diner Alffy Rabbit Sun Cured Alfalfa Meal, Molasses Dried Beet Pulp, Canola Meal, Wheat Mill Run, Whole Pressed Safflower Seed Meal, Ground Wheat, Dehulled Soybean Meal, Cane Molasses, Salt, Calcium Carbonate, yeast Culture (Diamond V “XP”), sodium Lignosulfonate, Mono-Dicalcium Phosphate, Mold Inhibitor (Propionic Acid, Acetic Acid, Sorbic Acid, Benzioc Acid, Ammonium Hydroxide), Yeast Cell Wall Extract, Flavoring, D-L Methionine, Vitamin E Supplement, Yucca Schidigera Extract, Mixed Tocopherols, Rosemary Extract, Ascorbic Acid, Citric Acid, Lecithin, Silicon Dioxide (carrier for liquid antioxidants), Vitamin A Supplement, Viatmin D3 Supplement, Choline Chloride, Niacin Supplement, Calcium Pantothenate, Menadione Sodium Bisulfite (source of Vitamin K activity), Riboflavin Supplement, Thiamine Mononitrate, Pyridoxine Hydrochloride, D-Biotin, Folic Acid, Viatamin B-12 Supplement, Zinc Oxide, Manganous Oxide, Ferrous Sulfate, Copper Sulfate, Ethylene Diamine Dihydroiodide, Cobalt Sulfate, Sodium Selenite.? 17.00% 16.00% 3.5% 0.50%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}