{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18"
        ],
        [
            "Rider",
            "Casey Stoner",
            "Jorge Lorenzo",
            "Dani Pedrosa",
            "Marco Simoncelli",
            "Ben Spies",
            "Alvaro Bautista",
            "Hiroshi Aoyama",
            "Andrea Dovizioso",
            "Colin Edwards",
            "Randy De Puniet",
            "Kousuke Akiyoshi",
            "Valentino Rossi",
            "Nicky Hayden",
            "Loris Capirossi",
            "Hector Barbera",
            "Cal Crutchlow",
            "Toni Elias",
            "Karel Abraham"
        ],
        [
            "Team",
            "Repsol Honda Team",
            "Yamaha Factory Racing",
            "Repsol Honda Team",
            "San Carlo Honda Gresini",
            "Yamaha Factory Racing",
            "Rizla Suzuki MotoGP",
            "San Carlo Honda Gresini",
            "Repsol Honda Team",
            "Monster Yamaha Tech 3",
            "Pramac Racing Team",
            "HRC Test Team",
            "Ducati Marlboro Team",
            "Ducati Marlboro Team",
            "Pramac Racing Team",
            "Aspar Team",
            "Monster Yamaha Tech 3",
            "LCR Honda MotoGP",
            "Cardion AB Motoracing"
        ],
        [
            "Fastest lap",
            "2:01.574",
            "2:01.977",
            "2:02.024",
            "2:02.295",
            "2:02.332",
            "2:02.422",
            "2:02.483",
            "2:02.507",
            "2:02.514",
            "2:03.152",
            "2:03.224",
            "2:03.365",
            "2:03.508",
            "2:03.695",
            "2:03.767",
            "2:04.009",
            "2:04.238",
            "2:04.470"
        ],
        [
            "Lead. Gap",
            "–",
            "+0.403",
            "+0.450",
            "+0.721",
            "+0.758",
            "+0.848",
            "+0.909",
            "+0.933",
            "+0.940",
            "+1.578",
            "+1.650",
            "+1.791",
            "+1.934",
            "+2.121",
            "+2.193",
            "+2.435",
            "+2.664",
            "+2.896"
        ]
    ],
    "pageTitle": "01 | February | 2011 | Competition Accessories | Page 2",
    "title": "",
    "url": "http://blog.compacc.com/2011/02/01/page/2/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00219-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 27641163,
    "recordOffset": 27619025,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{35942=You can check out The Official 2010 FIM Superbike World Championship Review and other DVDs from Duke Video here., 26567=Nicky Hayden and Valentino Rossi are reunited again; the Titans are back together, with team Ducati in MotoGP. This pairing of riders with the winning team is ready to storm the 2011 MotoGP race season. The riders have just completed attending Wrooom and the gathering went off great., 19388=Stoner, who rode a Ducati in 2010, was more than comfortable on his new RC212V Repsol Honda motorcycle. Stoner set his best lap of 2’01.574 today at the very end of the session, claiming the top spot from the 2010 Champion who is now using the number one plate. Behind Lorenzo came the other Repsol Honda rider, Dani Pedrosa., 43681=“Yamaha Motor Company began participating in races from the year of our company’s founding in 1955. Our history of competition in the World GP began in 1961, when we entered a team with riders Taneharu Noguchi and Fumio Ito in that year’s French GP. In these 50 years of competition, Yamaha has tasted sweet victories as well as bitter defeats, but through it all we have never lost the “spirit of challenge” that we started out with., 35829=“The 2010 World Superbike Championship was a thrill-ride you’ll want to relive again and again.”, 43020=A special Yamaha 50th anniversary livery design will also be sported by Ben Spies and Jorge Lorenzo throughout the 2011 season. Yamaha will also be launching a new website on February 1st, which will archive Yamaha’s racing history. Ben Spies and Jorge Lorenzo, 38947=Rossi hopped on the Ducati 1198 just 73 days after his shoulder surgery. After the test he said that his shoulder was “painful” and “not very strong.”, 35562=The 2010 World Superbike season had a fantastic field of competition, and 7 different riders found themselves on top of the podium. This video gives you all the racing action, but also great commentary and interviews from the World Superbike paddock., 28298=The Titans and team Ducati will be the team to watch in the upcoming 2011 MotoGP season., 42704=Yamaha will be displaying some of its classic machines during the 2011 season. At the Motegi and Assen events this year, Yamaha will be displaying the 1974 YZR-500, Yamaha’s first 500cc factory bike, as well as the1978 YZR-500, which earned Yamaha three championships with the help of Kenny Roberts., 39114=Rossi and the Ducati team will get a chance to test out the GP11 tomorrow, when they join the rest of the MotoGP riders at Sepang for the first official test of the 2011 season., 39473=Here’s the video of Valentino Rossi riding the Ducati 1198 at Misano.}",
    "textBeforeTable": "MotoGP Day 1 Testing Session at Sepang Results The MotoGP riders will have two more testing days at Sepang. Valentino Rossi took it easy around the track today, deciding to work on his riding position while he continues to nurse his injured shoulder. Rossi finished in 12th today, 1.7 seconds behind Stoner. His teammate Nicky Hayden finished right behind the former World Champion in 13th. It was a good day for the Repsol Honda team. The third rider on the squad, Andrea Dovizio, finished the day in 8th place, less than a second behind Stoner. Lorenzo and his Fiat Yamaha teammate Ben Spies were also happy with their results, having both riders in the top 5. Marco Simoncelli, who is embarking on his second season in the premier class, finished in fourth ahead of Spies. Stoner, who rode a Ducati in 2010, was more than comfortable on his new RC212V Repsol Honda motorcycle. Stoner set his best lap of 2’01.574 today at the very end of the session, claiming the top spot from the 2010 Champion who is now using the number one plate. Behind Lorenzo came the other Repsol Honda rider, Dani Pedrosa. The 2011 MotoGP pre-season has officially begun. The MotoGP riders took to the Sepang track today for the first testing session of the 2011 season. Casey Stoner led the session with the Repsol Honda team, beating out 2010 champion Jorge Lorenzo",
    "textAfterTable": "Courtesy of AllAboutBikes.com Posted in News Tagged casey stoner, Dani Pedrosa, jorge lorenzo, motogp, sepang, valentino rossi Leave a comment Titans Reunited in 2011 with MotoGP Team Ducati Posted on February 1, 2011 by CompAcc Staff Nicky Hayden and Valentino Rossi are reunited again; the Titans are back together, with team Ducati in MotoGP. This pairing of riders with the winning team is ready to storm the 2011 MotoGP race season. The riders have just completed attending Wrooom and the gathering went off great. Rider Nicky Hayden commented at the Vroom news conference “This my third year with Ducati,” Nicky continued “The start was a little bit difficult, but it’s gotten better and better since I’ve been on this team and on this bike. We’ve grown a lot, the bike has improved, and my relationship with the team has improved. We made a big step from the first year to the second, and I’d like to do the same this",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}