{
    "relation": [
        [
            "Commercial clothes washer TSL",
            "1",
            "2",
            "3",
            "4",
            "5"
        ],
        [
            "Estimated cumulative NO X emission reductions (kt)",
            "1.43",
            "1.45",
            "3.04",
            "3.39",
            "3.66"
        ],
        [
            "Value of estimated NO X emission reductions (million 2008$)",
            "0.19 to 1.96",
            "0.19 to 1.99",
            "0.41 to 4.17",
            "0.45 to 4.64",
            "0.49 to 5.01"
        ],
        [
            "Estimated cumulative Hg emission reductions (t)",
            "0 to 0.013",
            "0 to 0.013",
            "0 to 0.029",
            "0 to 0.032",
            "0 to 0.035"
        ],
        [
            "Value of estimated Hg emission reductions (million 2008$)",
            "0 to 0.12.",
            "0 to 0.12.",
            "0 to 0.27.",
            "0 to 0.30.",
            "0 to 0.33."
        ]
    ],
    "pageTitle": "Federal Register | Energy Conservation Program: Energy Conservation Standards for Certain Consumer Products (Dishwashers, Dehumidifiers, Microwave Ovens, and Electric and Gas Kitchen Ranges and Ovens) and for Certain Commercial and Industrial Equipment (Commercial Clothes Washers)",
    "title": "Table V.22—Estimates of Value of Reductions of Hg and NO X Under Trial Standard Levels at a 7-Percent Discount Rate Back to Top",
    "url": "https://www.federalregister.gov/articles/2009/11/09/E9-26544/energy-conservation-program-energy-conservation-standards-for-certain-consumer-products-dishwashers",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 27,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00114-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903212655,
    "recordOffset": 903067071,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{27194=A Notice by the Reclamation Bureau on 07/31/2015, 8537=The Draft Environmental Impact Statement implementing the 2008 U.S. Fish and Wildlife Service Biological Opinion and the 2009 National Marine Fisheries Service Biological Opinion is ready for public review and comment.}",
    "TableContextTimeStampAfterTable": "{165239=EPCA directs DOE to consider any lessening of competition that is likely to result from standards. It directs the Attorney General to determine the impact, if any, of any lessening of competition likely to result from a proposed standard and to transmit such determination to the Secretary, not later than 60 days after the publication of a proposed rule, together with an analysis of the nature and extent of such impact. (42 U.S.C. 6295(o)(2)(B)(i)(V) and (B)(ii)). DOE received the Attorney General's determination dated December 16, 2008. It is discussed in section V.B.5 below, and is reprinted at the end of this SNOPR. Impacts on manufacturers are also discussed in section III.G below., 103543=G. Review Under the Unfunded Mandates Reform Act of 1995, 161712=In this rulemaking, DOE calculated both LCC and LCC savings for various CCW efficiency levels. DOE established the variability and uncertainty in energy and water use by defining the uncertainty and variability in the use (cycles per day) of the equipment. The variability in energy and water pricing were characterized by regional differences in energy and water prices. To account for uncertainty and variability in other inputs, such as equipment lifetime and discount rate, DOE used a distribution of values with probabilities attached to each value. For each consumer with a CCW, DOE sampled the values of these inputs from the probability distributions. As a result, the analysis produced a range of LCCs. This approach permits DOE to identify the percentage of consumers achieving LCC savings or attaining certain payback values due to an increased energy conservation standard, in addition to the average LCC savings or average payback for that standard. DOE presents the LCC savings as a distribution, with a mean value and a range. In the analysis prepared for the October 2008 NOPR, DOE assumed that the consumer will purchase the equipment in 2012. For today's SNOPR, that assumption has been changed to 2013 due to the expected effective date of any amended standards. See section III.D for more details on the analysis., 257809=DOE received comments regarding the impacts of impending amended energy conservation standards for CCWs on unit sales. Alliance suggested that impacts to the CCW market would encourage customers to stock up on less efficient top-loading CCWs before the implementation date, and keep older machines in operation longer. These effects would undermine the effectiveness of the standards proposed in the October 2008 NOPR. (Alliance, No. 45 at Attachment 2, p. 10) As discussed below in section III.E.2.c, DOE's shipments model uses a “relative” purchase price elasticity to determine the drop in shipments as a function of increased purchase price and operating cost savings. The model does forecast a drop in new shipments due to a high standard on top-loading CCWs, which is expected to result in purchase of used CCWs. DOE did not have sufficient information to account for possible stocking up on less efficient top-loading CCWs before the implementation date., 414165=Domestic SCC values are also presented. The development of a domestic SCC is greatly complicated by the relatively few region- or country-specific estimates of the SCC in the literature. One potential estimate comes from the DICE (Dynamic Integrated Climate Economy, William Nordhaus) model. In an unpublished paper, Nordhaus (2007) produced disaggregated SCC estimates using a regional version of the DICE model. He reported a U.S. estimate of $1/tCO 2 (2007 value, 2007$), which is roughly 11 percent of the global value., 487809=Today's regulatory action has been determined to be a “significant regulatory action” under section 3(f)(1) of Executive Order 12866, “Regulatory Planning and Review.” 58 FR 51735 (Oct. 4, 1993). Accordingly, this action was subject to review under the Executive Order by the Office of Information and Regulatory Affairs (OIRA) in the Office of Management and Budget., 221040=To estimate the trends in electricity and natural gas prices for the October 2008 NOPR, DOE used the price forecasts in the AEO 2008. [23] To arrive at prices in future years, DOE multiplied the average prices described above by the forecast of annual average price changes in AEO 2008. For today's supplemental notice, DOE updated its energy price forecasts using those in the AEO 2009 April Release. Because the AEO forecasts prices only to 2030, DOE followed past guidelines provided to the Federal Energy Management Program by EIA and used the average rate of change during 2020-2030 to estimate the price trends beyond 2030., 405766=DOE's high estimate, which assumed that standards would displace only coal-fired power plants, was based on a nationwide Hg emission rate from AEO 2008 for the October 2008 NOPR. (Under this scenario, gas-fired power plant generation would remain unaffected and that no future reductions in the rate of Hg emissions from such sources would occur.) Because power plant emission rates are a function of local regulation, scrubbers, and the Hg content of coal, it is extremely difficult to identify a precise high-end emission rate. Therefore, the most reasonable estimate is based on the assumption that all displaced coal generation would have been emitting at the average emission rate for coal generation as specified by the April update to AEO 2009. As noted previously, because virtually all Hg emitted from electricity generation is from coal-fired power plants, DOE based the emission rate on the tons of Hg emitted per TWh of coal-generated electricity. Based on the emission rate for 2006, DOE derived a high-end emission rate of 0.0255 tons per TWh. To estimate the reduction in Hg emissions, DOE multiplied the emission rate by the reduction in coal-generated electricity due to the standards considered in the utility impact analysis. These changes in Hg emissions are extremely small, ranging from 0.03 to 0.27 percent of the national base-case emissions forecast by NEMS-BT, depending on the TSL., 526349=Executive Order 13132, “Federalism,” 64 FR 43255 (Aug. 4, 1999) imposes certain requirements on agencies formulating and implementing policies or regulations that preempt State law or that have Federalism implications. The Executive Order requires agencies to examine the constitutional and statutory authority supporting any action that would limit the policymaking discretion of the States and to carefully assess the necessity for such actions. The Executive Order also requires agencies to have an accountable process to ensure meaningful and timely input by State and local officials in the development of regulatory policies that have Federalism implications. On March 14, 2000, DOE published a statement of policy describing the intergovernmental consultation process it will follow in the development of such regulations. 65 FR 13735. DOE has examined today's supplemental notice and has determined that it would not have a substantial direct effect on the States, on the relationship between the national government and the States, or on the distribution of power and responsibilities among the various levels of government. EPCA governs and prescribes Federal preemption of State regulations as to energy conservation for the equipment that is the subject of today's supplemental notice. States can petition DOE for exemption from such preemption to the extent, and based on criteria, set forth in EPCA. (42 U.S.C. 6297(d) and 6316(b)(2)(D)) No further action is required by Executive Order 13132., 102912=A. Review Under Executive Order 12866, 352390=Table V.2 and Table V.3 show the LCC and PBP results for both CCW equipment applications for the top-loading class while Table V.4 and Table V.5 show the LCC and PPB results for the front-loading equipment class. For example, in the case of the multi-family application for front-loading washers (Table V.4), TSL 2 (2.00 MEF/5.50 WF) shows an average LCC savings of $19. Note that for TSL 2, 96.3 percent of consumers in 2013 are assumed to already be using a front-loading CCW in the base case at TSL 2 and, thus, have zero savings due to the standard. If one compares the LCC of the baseline at 1.72 MEF/8.00 WF ($4220) to TSL 2 ($3690), then the difference in the LCCs is $530. However, since the base case includes a significant number of consumers that are not impacted by the standard, the average savings over all of the consumers is actually $19, not $530. DOE determined the median and average values of the PBPs shown below by excluding the percentage of households not impacted by the standard. For example, in the case of TSL 2 for front-loading washers in a multi-family application, 96.3 percent of the consumers did not factor into the calculation of the median and average PBP., 52574=Posted by Ben Jordi on June 22, 2015, 292331=DOE performed an MIA to estimate the financial impact of amended energy conservation standards on CCW manufacturers, and to calculate the impact of such standards on domestic manufacturing employment and capacity. The MIA has both quantitative and qualitative aspects. The quantitative part of the MIA primarily relies on the GRIM—an industry-cash-flow model customized for this rulemaking. The GRIM inputs are data characterizing the industry cost structure, shipments, and revenues. The key output is the INPV. Different sets of assumptions (scenarios) will produce different results. The qualitative part of the MIA addresses factors such as equipment characteristics, characteristics of particular firms, and market and equipment trends, and it also includes an assessment of the impacts of standards on subgroups of manufacturers. DOE outlined its methodology for the MIA in the October 2008 NOPR. 73 FR 62034, 62075-81 (Oct. 17, 2008). The complete MIA for the October 2008 NOPR is presented in chapter 13 of the NOPR TSD., 384061=To estimate the energy savings through 2043 that would be expected to result from amended energy conservation standards, DOE compared the energy consumption of equipment under the base case to energy consumption of this equipment under the TSLs. Table V.14 shows the forecasted national energy savings at each TSL for CCWs. Summing the energy savings for all equipment classes across each TSL considered in this rulemaking would result in significant energy and water savings, with the amount of savings increasing with higher efficiency standards. Chapter 11 of the TSD accompanying this supplemental notice provides additional details on the NES values reported below, as well as discounted NES results (and discounted national water savings results) based on discount rates of 3 and 7 percent. DOE reports both undiscounted and discounted values of energy savings. Discounted energy savings represent a policy perspective wherein energy savings farther in the future are less significant than energy savings closer to the present. [39], 318481=In developing the October 2008 NOPR and today's SNOPR, DOE estimated indirect national employment impacts using an input/output model of the U.S. economy called Impact of Sector Energy Technologies (ImSET). [33] ImSET is a special-purpose version of the “U.S. Benchmark National Input-Output” (I-O) model designed to estimate the national employment and income effects of energy-saving technologies. The ImSET software includes a computer-based I-O model with structural coefficients to characterize economic flows among 188 sectors most relevant to industrial, commercial, and residential building energy use. The Joint Comment stated that DOE must consider its projections that an increase in employment will result from the adoption of standards in weighing the economic costs and benefits of strong efficiency standards. (Joint Comment, No. 44 at p. 13) As described in section V.B.3 below, DOE takes into consideration the indirect employment impacts estimated using ImSET when evaluating alternative standard levels. Direct employment impacts on the manufacturers that produce CCWs are analyzed in the MIA, as discussed in section III.G. For today's SNOPR, DOE has made no change to its method for estimating employment impacts. For further details, see chapter 15 of the SNOPR TSD., 279247=In the October 2008 NOPR, DOE did not include the energy required for water treatment and delivery. It stated that EPCA defines “energy use” to be “the quantity of energy directly consumed by a consumer product at point of use, determined in accordance with test procedures under section 6293 of [42 U.S.C.].” (42 U.S.C. 6291(4)) Based on the definition of “energy use,” DOE does not believe it has the authority to consider embedded energy (i.e., the energy required for water treatment and delivery) in the analysis. Furthermore, even if DOE had the authority, it does not believe adequate analytical tools exist to conduct such an evaluation. [29], 289309=In the October 2008 NOPR, DOE analyzed the potential effects of CCW standards on two subgroups: (1) Consumers not served by municipal water and sewer providers, and (2) small businesses. For consumers not served by water and sewer, DOE analyzed the potential impacts of standards by conducting the analysis with well and septic system prices, rather than water and wastewater prices based on RFC/AWWA data. For small CCW businesses, DOE analyzed the potential impacts of standards by conducting the analysis with different discount rates, because small businesses do not have the same access to capital as larger businesses. DOE estimated that for businesses purchasing CCWs, the average discount rate for small companies is 3.5 percent higher than the industry average. Due to the higher costs of conducting business, as evidenced by their higher discount rates, the benefits of CCW standards for small businesses will be lower than for the general population of CCW owners. For today's SNOPR DOE has made no changes to its assumptions about benefits of CCW standards to small businesses., 280212=The Joint Comment stated that DOE's purported legal justification ignores that EPCA not only provides ample authority for DOE to consider this impact, but actually commands its consideration in weighing the economic justification for efficiency standards. (Joint Comment, No. 44, pp. 12-13) It said that DOE's position that it lacks the authority to consider the energy embedded in water is untenable in light of 42 U.S.C. 6295(o)(2)(B)(i)(VII), which provides that in assessing the economic justification for a standard, DOE may consider any factors it concludes are relevant. It added that 42 U.S.C. 6295(o)(2)(B)(i)(III) directs DOE to consider, to the greatest extent practicable, “the total projected amount of energy * * * savings likely to result directly from the imposition of such standard.” It also stated that the plain language of EPCA thus commands that DOE assess the “energy saving” resulting from the standard, not simply the “energy use” of the covered products or equipment. Moreover, though the statute concerns those energy savings likely to “result directly” from the standard, that language merely requires DOE to isolate the standard's impact from other energy saving initiatives for purposes of the economic justification analysis. (Joint Comment, No. 44 at p. 12-13) Pacific Gas Electric Company (PGE) stated that because of the preciousness of water in California and the embodied energy in it, a higher standard for CCWs is merited. (PGE, Public Meeting Transcript, No. 40.5 at pp. 136-137 and p. 181) Furthermore, PGE commented that failing to consider energy in water due to the lack of an analytical tool is not acceptable. (PGE, Public Meeting Transcript, No. 40.5 at pp. 178-179 and p. 183) Additional comments submitted by EJ, ASAP, and ACEEE, suggested that the energy embedded in the delivery and treatment of water and wastewater should be included in the determination of national energy savings from the standards proposed in the October 2008 NOPR. (EJ, Public Meeting Transcript, No. 40.5 at pp. 140-141 and p. 180; ASAP, Public Meeting Transcript, No. 40.5 at pp. 180-181; ACEEE, Public Meeting Transcript, No. 40.5 at p. 182), 285013=DOE multiplies monetary values in future years by the discount factor to determine the present value. DOE estimated national impacts using both a 3-percent and a 7-percent real discount rate, in accordance with guidance provided by the Office of Management and Budget (OMB) to Federal agencies on the development of regulatory analysis (OMB Circular A-4 (Sept.17, 2003), section E, “Identifying and Measuring Benefits and Costs”). [30] The Joint Comment stated that DOE should use a 2 to 3 percent real discount rate for national impact analyses. (Joint Comment, No. 44 at p. 11) It noted that societal discount rates are the subject of extensive academic research, and the weight of academic opinion is that the appropriate societal discount rate is 3 percent or less. It urged DOE to give primary weight to results based on the lower of the discount rates recommended by OMB. OMB Circular A-4 references an earlier Circular A-94, which states that a real discount rate of 7 percent should be used as a base case for regulatory analysis. The 7 percent rate is an estimate of the average before-tax rate of return to private capital in the U.S. economy. It approximates the opportunity cost of capital, and, according to Circular A-94, it is the appropriate discount rate whenever the main effect of a regulation is to displace or alter the use of capital in the private sector. OMB later found that the average rate of return to capital remains near the 7-percent rate estimated in 1992. Circular A-4 also states that when regulation primarily and directly affects private consumption, a lower discount rate is appropriate. “The alternative most often used is sometimes called the social rate of time preference * * * the rate at which “society” discounts future consumption flows to their present value.” It suggests that the real rate of return on long-term government debt may provide a fair approximation of the social rate of time preference, and states that over the last 30 years, this rate has averaged around 3 percent in real terms on a pre-tax basis. It concludes that “for regulatory analysis, [agencies] should provide estimates of net benefits using both 3 percent and 7 percent.” Consistent with OMB's guidance, DOE did not give primary weight to results derived using a 3-percent discount rate., 448619=As noted above, standards would not produce an economic impact in the form of lower prices for NO X emissions allowance credits in the 28 eastern States and D.C. covered by the CAIR cap. However, new or amended energy conservation standards would reduce NO X emissions in those 22 States that are not affected by CAIR. DOE estimated the monetized value of NO X emissions reductions resulting from each of the TSLs considered for today's SNOPR based on environmental damage estimates from the literature. Available estimates suggest a very wide range of monetary values for NO X emissions, ranging from $370 per ton to $3,800 per ton of NO X from stationary sources, measured in 2001$ (equivalent to a range of $432 per ton to $4,441 per ton in 2007$). Refer to the OMB, Office of Information and Regulatory Affairs, “2006 Report to Congress on the Costs and Benefits of Federal Regulations and Unfunded Mandates on State, Local, and Tribal Entities,” Washington, DC, for additional information., 337474=In its October 2008 NOPR, DOE conducted a separate analysis of wastewater discharge impacts as part of the environmental assessment for commercial clothes washers. 73 FR 62034, 62112-3 (Oct. 17, 2008). For today's supplemental proposed rule, DOE retained the same analysis method for estimating wastewater discharge impacts. The results are presented below in section V.B.6., 273028=To estimate the national energy savings expected from appliance standards, DOE uses a multiplicative factor to convert site energy consumption (energy use at the location where the appliance is operated) into primary or source energy consumption (the energy required to deliver the site energy). For the October 2008 NOPR, DOE used annual site-to-source conversion factors based on the version of NEMS that corresponds to AEO 2008. For today's SNOPR, DOE updated these conversion factors based on the AEO 2009 March Release version of NEMS. These conversion factors account for natural gas losses from pipeline leakage and natural gas used for pumping energy and transportation fuel. For electricity, the conversion factors vary over time due to projected changes in generation sources (i.e., the power plant types projected to provide electricity to the country). Since the AEO does not provide energy forecasts that go beyond 2030, DOE used conversion factors that remain constant at the 2030 values throughout the remainder of the forecast., 163146=While significant conservation of energy is a separate statutory requirement for imposing an energy conservation standard, EPCA requires DOE, in determining the economic justification of a proposed standard, to consider the total projected energy savings that are expected to result directly from the standard. (42 U.S.C. 6295(o)(2)(B)(i)(III)) As in the October 2008 NOPR, DOE used the NIA spreadsheet results in its consideration of total projected savings expected to be directly attributable to the considered standard levels. See section III.E for more details on this analysis., 321870=Pursuant to the National Environmental Policy Act of 1969 (NEPA) (42 U.S.C. 4321 et seq.) 42 U.S.C. 6295(o)(2)(B)(i)(VI), DOE prepared a draft environmental assessment (EA) of the potential impacts of the proposed standards for CCWs it considered for today's supplemental notice which it has included as chapter 16 of the TSD for the SNOPR. DOE found the environmental effects associated with the standards for CCWs to be insignificant. Therefore, DOE is issuing a Finding of No Significant Impact (FONSI), pursuant to NEPA, the regulations of the Council on Environmental Quality (40 CFR parts 1500-1508), and DOE's regulations for compliance with NEPA (10 CFR part 1021). The FONSI is available in the docket for this rulemaking., 332544=Several parties provided comments regarding the economic valuation of CO 2 for the October 2008 NOPR. Whirlpool does not support an attempt to value those emissions as part of this rulemaking. (Whirlpool, No. 50 at p. 8) EEI stated that utilities have embedded the cost of complying with existing environmental legislation in their price for electricity, and a similar approach may be reasonable for valuing reduced CO 2 emissions. (EEI, Public Meeting Transcript, No. 40.5 at pp. 194-195) The Joint Comment stated that DOE's valuation of avoided CO 2 emissions should utilize EIA's analysis of the Climate Security Act. The core scenario of this analysis yields a $17 price per ton of CO 2, with an annual 7.4 percent increase. (Joint Comment, No. 44 at p. 12) As discussed in section V.B.6, DOE has updated the approach described in the October 2008 NOPR (73 FR 62034, 62107 (Oct. 17, 2008)) for its monetization of environmental emissions reductions for today's SNOPR., 535098=DOE determined, under Executive Order 12630, “Governmental Actions and Interference with Constitutionally Protected Property Rights,” 53 FR 8859 (March 18, 1988), that the October 2008 NOPR would not result in any takings which might require compensation under the Fifth Amendment to the U.S. Constitution. 73 FR 62034, 62131 (Oct. 17, 2008). DOE received no comments concerning Executive Order 12630 in response to the October 2008 NOPR, and, today's supplemental notice, which adopts no new requirements, also would not result in any takings which might require compensation under the Fifth Amendment. Therefore, DOE takes no further action in today's supplemental notice with respect to this Executive Order., 476413=Next, DOE considered TSL 4. TSL 4 would likely save 0.11 quads of energy and 0.16 trillion gallons of water through 2043, an amount DOE considers significant. For the Nation as a whole, DOE projects that TSL 4 would result in a net increase of $0.41 billion in NPV, using a discount rate of 7 percent. The emissions reductions at TSL 4 are 5.66 Mt of CO 2, 3.39 kt of NO X, and 0 t to 0.03 t of Hg. At TSL 4, the estimated benefits of reducing CO 2 emissions based on global estimates of the value of CO 2 ranges from $14 million to $156 million at a 7-percent discount rate and $31 million to $337 million at a 3-percent discount rate. Total generating capacity in 2043 is estimated to decrease compared to the reference case by 0.011 GW under TSL 4., 520414=DOE reviewed today's supplemental notice under the provisions of the Regulatory Flexibility Act and the procedures and policies published on February 19, 2003. 68 FR 7990. A regulatory flexibility analysis examines the impact of the rule on small entities and considers alternative ways of reducing negative impacts. DOE identified producers of all equipment covered by this rulemaking that have manufacturing facilities located within the United States. DOE then looked at publicly available data and contacted manufacturers, where needed, to determine if they meet the SBA's definition of a small manufacturing facility., 489820=DOE believes that there is a lack of consumer information and/or information processing capability about energy efficiency opportunities in the home appliance market. If this is the case, DOE would expect the energy efficiency for CCWs to be randomly distributed across key variables such as energy prices and usage levels. DOE has estimated the percentage of consumers that already purchase more efficient CCWs. However, DOE does not correlate the consumer's usage pattern and energy price with the efficiency of the purchased equipment. In the October 2008 NOPR, DOE sought data on the efficiency levels of existing CCWs by how often they are used (e.g., how many times or hours the equipment is used) and their associated energy prices (and/or geographic regions of the country). Id. DOE received no such data from interested parties in response to the October 2008 NOPR. Therefore, DOE was unable to test for today's supplemental rule the extent to which purchasers of CCWs behave as if they are unaware of the costs associated with their energy consumption., 329858=After CAMR was vacated, DOE was unable to use the NEMS-BT model to estimate any changes in the physical quantity of Hg emissions (anywhere in the country) that would result from standard levels it considered in the October 2008 NOPR. Instead, DOE used an Hg emission rate (in metric tons of Hg per energy produced) based on the AEO 2008. Because virtually all Hg emitted from electricity generation is from coal-fired power plants, DOE based the emission rate on the metric tons of Hg emitted per TWh of coal-generated electricity. To estimate the reduction in Hg emissions, DOE multiplied the emission rate by the reduction in coal-generated electricity associated with standards considered. Because the CAMR is still vacated, DOE continued to use the approach utilized for the October 2008 NOPR, updated for the AEO 2009 April Release to estimate the Hg emission reductions due to standards for today's SNOPR., 416015=2. Filtering existing analyses. There are numerous SCC estimates in the existing literature, and it is legitimate to make use of those estimates to produce a figure for current use. A reasonable starting point is provided by the meta-analysis in Richard Tol, “The Social Cost of Carbon: Trends, Outliers, and Catastrophes, Economics: The Open-Access, Open-Assessment E-Journal,” Vol. 2, 2008-25. http://www.economics-ejournal.org/economics/journalarticles/2008-25 (2008). With that starting point, it is proposed to “filter” existing SCC estimates by using those that (1) are derived from peer-reviewed studies; (2) do not weight the monetized damages to one country more than those in other countries; (3) use a “business as usual” climate scenario; and (4) are based on the most recent published version of each of the three major integrated assessment models (IAMs): FUND, DICE and PAGE (Policy Analysis of the Greenhouse Effect)., 470197=First, DOE considered TSL 5, the max-tech level. TSL 5 would likely save 0.12 quads of energy and 0.21 trillion gallons of water through 2043, an amount DOE considers significant. For the Nation as a whole, DOE projects that TSL 5 would result in a net increase of $0.51 billion in NPV, using a discount rate of 7 percent. The emissions reductions at TSL 5 are 6.11 Mt of CO 2, 3.66 kt of NO X, and 0 t to 0.03 t of Hg. At TSL 5, the estimated benefit of reducing CO 2 emissions based on global estimates of the value of CO 2 ranges from $15 million to $168 million at a 7-percent discount rate and $33 million to $364 million at a 3-percent discount rate. Total generating capacity in 2043 is estimated to decrease compared to the reference case by 0.012 GW under TSL 5., 271387=The annual energy consumption per unit depends directly on equipment efficiency. For the October 2008 NOPR and today's SNOPR, DOE used the SWEFs associated with the base case and each standards case, in combination with the annual energy data, to estimate the shipment-weighted average annual per-unit energy consumption under the base case and standards cases. The national energy consumption is the product of the annual energy consumption per unit and the number of units of each vintage, which depends on shipments., 319950=The utility impact analysis estimates the change in the forecasted power generation capacity for the Nation, which would be expected to result from adoption of new standards. This analysis separately determines the changes to supply and demand as a result of natural gas, fuel oil, liquefied petroleum gas, or electricity residential consumption savings due to the standard. For the October 2008 NOPR and today's SNOPR, DOE calculated this change using the NEMS-BT computer model. NEMS-BT models certain policy scenarios such as the effect of reduced energy consumption per TSL by fuel type. The analysis output provides a forecast for the needed generation capacities at each TSL. The estimated net benefit of the standard for today's SNOPR is the difference between the forecasted generation capacities by NEMS-BT and the AEO 2009 April Release Reference Case. DOE obtained the energy savings inputs associated with electricity and natural gas consumption savings from the NIA. These inputs reflect the effects of efficiency improvement on CCW energy consumption, both fuel (natural gas) and electricity. Chapter 14 of the SNOPR TSD presents results of the utility impact analysis., 144707=The October 2008 NOPR also included background information, in addition to that set forth above, on the history and conduct of this rulemaking. 73 FR 62034, 62040-62041 (Oct. 17, 2008). DOE presented the methodologies and results for the October 2008 NOPR analyses at the November 2008 public meeting. Comments presented by interested parties during this meeting and submitted in response to the October 2008 NOPR concerning the accuracy of the stated max-tech CCW efficiency level led to a thorough investigation of CCW efficiencies and today's SNOPR. DOE subsequently tested the max-tech unit at an independent test facility, revised the max-tech level, updated the analysis, and is publishing the SNOPR to allow interested parties to comment on the revised efficiency level proposals., 402010=In the October 2008 NOPR, however, DOE provided a different estimate of NO X reductions because DOE assumed that the CAIR rule had been vacated. This is because the CAIR rule was vacated by the D.C. Circuit in its July 11, 2008 decision in North Carolina v. Environmental Protection Agency. 531 F.3d 896 (D.C. Cir. 2008). As noted above, the D.C. Circuit, in a December 23, 2008, opinion, decided to allow the CAIR rule to remain in effect until it is replaced by a rule consistent with the court's earlier opinion, but this decision came well after the publish date of the October 2008 NOPR..Thus, for the October 2008 NOPR, DOE established a range of NO X reductions based on low and high emission rates (in kt of NO X emitted per TWh of electricity generated) derived from the AEO 2008. DOE anticipated that, in the absence of the CAIR's trading program, the new or amended conservation standards would reduce NO X emissions nationwide, not just in 22 States., 409743=To date, regulations have used a range of values for the SCC. For example, a regulation proposed by the U.S. Department of Transportation (DOT) in 2008 assumed a value of $7 per ton CO 2 (2006$) for 2011 emission reductions (with a range of $0-14 for sensitivity analysis). Regulation finalized by DOE used a range of $0-$20 (2007$). Both of these ranges were designed to reflect the value of damages to the United States resulting from carbon emissions, or the “domestic” SCC. In the final Model Year 2011 Corporate Average Fuel Economy rule, DOT used both a domestic SCC value of $2/t CO 2 and a global SCC value of $33/t CO 2 (with sensitivity analysis at $80/tCO 2), increasing at 2.4 percent per year thereafter., 94599=Ms. Francine Pinto, Esq. or Ms. Betsy Kohl, Esq., U.S. Department of Energy, Office of General Counsel, GC-71/72, 1000 Independence Avenue, SW., Washington, DC 20585-0121. Telephone: (202) 586-5000. E-mail: Francine.Pinto@hq.doe.gov, Elizabeth.Kohl@hq.doe.gov., 181245=For the technology assessment in the October 2008 NOPR analyses, DOE considered all RCW and CCW technology options that it is aware are or have been incorporated into working prototypes or commercially available clothes washers at the time of the analysis. ASAP stated that DOE should give more serious consideration to innovations currently in production on the RCW market. (ASAP, Public Meeting Transcript, No. 40.5 at pp. 33-34) DOE did not receive information on specific technologies for RCWs that it did not consider. Further, DOE notes that it considered as design options many technologies that are found in both RCWs and CCWs. Of the technology options screened out, only suds saving [11] has appeared previously as a feature in commercially available RCWs. DOE research suggests that clothes washers incorporating a suds-saving feature have not been available on the market since 2005, and further DOE research suggests that suds saving would be impractical to install in a commercial setting for reasons such as space limitations, questionable energy savings, incompatibility with CCW usage patterns, and lack of consumer acceptance. Therefore, DOE concludes that suds-savings is an RCW feature that was appropriately screened out for the CCW SNOPR analysis., 342484=Whirlpool commented that it supports both the proposed top-loading and front-loading standards in the October 2008 NOPR, though it acknowledged industry support is not consistent. Both standards, it said, are technologically feasible and enable substantial water and energy savings, although it agreed with DOE that front-loading CCWs can reach efficiency levels generally not attainable by top-loaders. Whirlpool stated that it has yet to field a top-loading CCW that can meet the proposed October 2008 NOPR standard, but that it believes technology exists to develop such equipment by early 2012 without violating intellectual property, provided that engineering and capital resources are available. (Whirlpool, Public Meeting Transcript, No. 40.5 at p. 28; Whirlpool, No. 50 at pp. 2-3) Whirlpool identified risks associated with the standards proposed in the October 2008 NOPR, including higher unit, capital, and development costs; lower reliability or perceived reliability due to the complexity of the technology needed to meet the standard; lack of market acceptance for lid locks on top-loading CCWs using spray rinse technology to meet the standard; and durability and resistance to breakage under overloading conditions. (Whirlpool, No. 50 at p. 3), 110615=In addition, today's proposed standards would have environmental benefits, which would be estimated to result in cumulative (undiscounted) greenhouse gas emission reductions of 5.1 million tons (Mt) of carbon dioxide (CO 2) from 2013 to 2043. DOE estimates that the range of the monetized value of CO 2 emission reductions based on global estimates of the value of CO 2 is $13 million to $140 million at a 7-percent discount rate and $28 million to $303 million at a 3-percent discount rate. The standards for CCWs would also result in 3.04 kilotons (kt) of nitrogen oxides (NO X) emissions reductions from 2013 to 2043. The standards for CCWs would also possibly result in power plant mercury (Hg) emissions reductions of up to 0.03 t from 2013 to 2043., 504400=Consumer Tax Credits. Consumer tax credits cover a percentage of the incremental installed cost difference between equipment meeting baseline efficiency levels and those with higher efficiencies. Consumer tax credits are considered a viable non-regulatory market transformation program as evidenced by the inclusion of Federal consumer tax credits in EPACT 2005 for various residential appliances. (Section 1333 of EPACT 2005; codified at 26 U.S.C. 25C) DOE reviewed the market impact of tax credits offered by the Oregon Department of Energy (ODOE) (ODOE, No. 35 at p. 1) and Montana Department of Revenue (MDR) (MDR, No. 36 at p. 1) to estimate the effect of a national tax credit program. To help estimate the impacts from such a program, DOE also reviewed analyses prepared for the California Public Utilities Commission, [43] the Northwest Energy Efficiency Alliance, [44] and the Energy Foundation/Hewlett Foundation. [45] For each the equipment considered for this rulemaking, DOE estimated that the market effect of a tax credit program would gradually increase over a time period until it reached its maximum impact. Once the tax credit program attained its maximum effect, DOE assumed the impact of the policy would be to permanently transform the market at this level., 221867=The spreadsheet tools used to conduct the LCC and PBP analysis allow users to select either the AEO' s high-growth case or low-growth case price forecasts to estimate the sensitivity of the LCC and PBP to different energy price forecasts. The AEO 2009 April Release provides only forecasts for the Reference Case. Therefore, for today's supplemental notice, DOE used the AEO 2009 March Release high-growth case or low-growth forecasts to estimate high-growth and low-growth price trends., 495049=DOE conducted a regulatory impact analysis (RIA) for review by the Office of Information and Regulatory Affairs (OIRA) at OMB. DOE presented to OIRA the draft supplemental notice and other documents prepared for this rulemaking, including the RIA, and has included these documents in the rulemaking record. They are available for public review in the Resource Room of the Building Technologies Program, 950 L'Enfant Plaza, SW., 6th Floor, Washington, DC 20024, (202) 586-9127, between 9:00 a.m. and 4:00 p.m., Monday through Friday, except Federal holidays., 220452=For the October 2008 NOPR, DOE estimated average commercial natural gas prices in each of the 13 geographic areas based on 2006 data from the EIA publication Natural Gas Monthly. [22] DOE calculated an average natural gas price for each area by first calculating the average prices for each State, and then calculating a regional price by weighting each State in a region by its population. For today's SNOPR, DOE used 2007 data from the same source., 287441=DOE also received comments regarding the discounting of emissions. The Joint Comment stated that DOE should not apply a discount rate to physical units of measure, such as tons of emissions or quads of energy. (Joint Comment, No. 44 at p. 11) Consistent with Executive Order 12866, “Regulatory Planning and Review,” 58 FR 51737 (Oct. 4, 1993), DOE follows the guidance of OMB regarding methodologies and procedures for regulatory impact analysis that affect more than one agency. Regarding energy and environmental benefits from energy conservation standards, DOE reported both discounted and undiscounted values. DOE retained the approach used in the October 2008 NOPR for today's SNOPR., 536973=Executive Order 13211, “Actions Concerning Regulations That Significantly Affect Energy Supply, Distribution, or Use,” 66 FR 28355 (May 22, 2001) requires Federal agencies to prepare and submit to the OIRA a Statement of Energy Effects for any significant energy action. For the October 2008 NOPR, DOE determined that the proposed rule, which set energy conservation standards for commercial clothes washers, was not a “significant energy action” within the meaning of Executive Order 13211. 73 FR 62034, 62132 (Oct. 17, 2008). The rule was also not designated as such by OIRA. Accordingly, it did not prepare a Statement of Energy Effects on that proposed rule. DOE received no comments on this issue in response to the October 2008 NOPR. As with the October 2008 NOPR, DOE has concluded that today's supplemental notice is not a significant energy action within the meaning of Executive Order 13211, and OIRA has not designated the rule as such. As a result, DOE has not prepared a Statement of Energy Effects on the rule., 268131=For the October 2008 NOPR, DOE first determined the distribution of equipment efficiencies currently in the marketplace to develop a SWEF for each equipment class for 2005. Using the SWEF as a starting point, DOE developed base-case efficiencies based on estimates of future efficiency increase. From 2005 to 2013 (2013 being the estimated effective date of a new standard), DOE estimated that there would be no change in the SWEF (i.e., no change in the distribution of equipment efficiencies). Because there are no historical data to indicate how equipment efficiencies have changed over time, DOE estimated that forecasted efficiencies would remain at the 2013 level until the end of the forecast period. DOE recognizes the possibility that equipment efficiencies may change over time (e.g., due to voluntary efficiency programs such as ENERGY STAR). But without historical information, DOE had no basis for estimating how much the equipment efficiencies may change. For today's supplemental notice, DOE maintained its estimate that the SWEF would remain constant from 2005 through the end of the forecast period., 237844=The PBP is the amount of time (expressed in years) it takes the consumer to recover the additional installed cost of more efficient equipment through operating cost savings, compared to baseline equipment. The simple PBP does not account for changes in operating expense over time or the time value of money. The inputs to the PBP calculation are the total installed cost of the equipment to the customer for each efficiency level and the annual (first-year) operating expenditures for each efficiency level. For the October 2008 NOPR and today's SNOPR, the PBP calculation uses the same inputs as the LCC analysis, except that energy price trends and discount rates are not needed., 461869=Although comparing the value of consumer savings to the values of emission reductions provides a valuable perspective, please note the following: (1) The national consumer savings are domestic U.S. consumer monetary savings found in market transactions while the values of emission reductions are based on ranges of estimates of imputed marginal social costs, which, in the case of CO 2, are meant to reflect global benefits; and (2) the assessments of consumer savings and emission-related benefits are performed with different computer models, leading to different time frames for the analyses. The present value of national consumer savings is measured for the period 2015-2065 (31 years from 2015 to 2045 inclusive, plus the longest lifetime of the equipment shipped in the 31st year). However, the timeframes of the benefits associated with the emission reductions differ. For example, the value of CO 2 emission reductions is meant to reflect the present value of all future climate related impacts, even those beyond 2065., 224899=DOE obtained commercial water and wastewater price data from the Water and Wastewater Rate Survey conducted by Raftelis Financial Consultants (RFC) and the American Water Works Association (AWWA). For the October 2008 NOPR and today's SNOPR, DOE used the 2006 Water and Wastewater Rate Survey. [24] The survey covers approximately 300 water utilities and 200 wastewater utilities, with each industry analyzed separately. DOE calculated values at the Census region level (Northeast, South, Midwest, and West). Edison Electric Institute (EEI) questioned why water and wastewater prices were not developed at the Census division level. (EEI, Public Meeting Transcript, No. 40.5, p. 103 and p. 178) The samples that DOE obtained of 200-300 utilities are not large enough to calculate regional prices for all U.S. Census divisions and large States. Hence, DOE was only able to capture the variability of water and wastewater prices at the Census region level., 243785=DOE's NIA assesses the national energy savings, as well as the national NPV of total consumer costs and savings, expected to result from new standards at specific efficiency levels. DOE applied the NIA spreadsheet to perform calculations of energy savings and NPV, using the annual energy consumption and total installed cost data from the LCC analysis. DOE forecasted the energy savings, energy cost savings, equipment costs, and NPV for each equipment class from 2013 to 2043. The forecasts provide annual and cumulative values for all four parameters. In addition, DOE incorporated into its NIA spreadsheet the capability to analyze sensitivity of the results to forecasted energy prices and equipment efficiency trends. Table III.6 summarizes the approach and data DOE used to derive the inputs to the NES and NPV analyses for the October 2008 NOPR and the changes made in the analyses for today's SNOPR. A discussion of the inputs and the changes follows below. (See chapter 11 of the SNOPR TSD for further details.), 573850=41. Ted Gayer and Robert Hahn, “Designing Environmental Policy: Lessons from the Regulation of Mercury Emissions,” Regulatory Analysis 05-01, AEI-Brookings Joint Center for Regulatory Studies, Washington, DC (2004). A version of this paper was published in the Journal of Regulatory Economics in 2006. The estimate was derived by back-calculating the annual benefits per ton from the net present value of benefits reported in the study., 301170=For the October 2008 NOPR, DOE calculated the direct employment impacts using the GRIM and information gathered from interviews with manufacturers. In the October 2008 NOPR, DOE estimated that there would be positive employment impacts among domestic commercial clothes washer manufacturers for TSL 1 through TSL 5. Because production labor expenditures are assumed to be a fixed percentage of the Cost of Goods Sold (COGS) and the Manufacturing Product Costs (MPCs) increase with more efficient equipment, labor tracks the increased prices in the GRIM. The GRIM predicts a steady level of domestic employment after standards at a level based on the increase in relative price. Because the LVM had previously stated it would be eliminated from the commercial market, DOE also specifically investigated the LVM employment using its commercial washer revenues and additional employment estimates. DOE's scenarios included one in which the LVM ceased to produce soft-mount washers or standard dryers and a scenario with a complete closure of the LVM's domestic manufacturing plant. DOE estimated that the LVM's ceasing to produce soft-mount dryers and CCWs would result in 292 lost production jobs and that a complete closure of the facility would result in the dismissal of approximately 600 factory employees. 73 FR 60234, 62102-3 (Oct. 17, 2008). DOE believes that the energy conservation standard proposed in today's notice will allow the LVM to continue to produce top-loading CCWs, mitigating any potential closure of its domestic manufacturing facility. Further discussion of the LVM and the potential impacts on direct employment for the CCW industry is presented in chapter 13 of the TSD., 338474=For the October 2008 NOPR, DOE based the TSLs on efficiency levels explored in the November 2007 ANOPR, and selected the TSLs on consideration of economic factors and current market conditions. ASAP suggested that DOE set TSLs based upon industry benchmarks such as current and forthcoming ENERGY STAR qualification levels and pending Federal tax incentive performance levels. (ASAP, Public Meeting Transcript, No. 40.5 at p. 33 and pp. 148-149) EIEA 2008 provided an Energy Efficient Appliance Credit to manufacturers for any RCW or CCW (front-loading or top-loading) produced domestically through 2010 with an efficiency level of at least 2.0 MEF/6.0 WF, or a larger credit for one that achieves 2.2 MEF/4.5 WF. The legislation also provides a separate tax credit for any top-loading RCW that achieves an efficiency level of at least 1.72 MEF/8.0 WF or a larger credit for one that exceeds 1.8 MEF/7.5 WF. DOE considered the impacts of these tax credits on the CCW industry in detail as part of the MIA. DOE accounts for the Federal tax credit as a direct cash benefit in the base and standards cases that increases the INPV. See section III.G of today's supplemental notice and appendix 13C of the SNOPR TSD for further discussion of this issue., 97231=III. Methodology and Revisions to the Analyses Employed in the October 2008 Proposed Rule, 202743=Alliance commented that front-loading CCWs with electric heaters have an MEF of 1.96, which would not meet the front-loading standards proposed in the October 2008 NOPR. According to Alliance, customers in some parts of the northern United States need such heaters to supplement their hot water supply in order to maintain proper wash temperatures despite very cold water supply temperatures. (Alliance, Public Meeting Transcript, No. 40.5 at p. 22) DOE has received no data on the extent or size of this impact or of the affected population. Hence, DOE invites comment, including population and efficiency impact data, to describe this issue., 298804=In the October 2008 NOPR, DOE noted the concerns regarding the proposed conservation standards for top-loading CCWs in particular. 73 FR 62034, 62103-104 (Oct. 17, 2008). DOE also included a section in chapter 13 of the TSD that estimated likely financial impacts for the LVM to meet the efficiency standards proposed in the 2008 NOPR. DOE continues to offer a sub-group assessment of the differential impacts on the LVM in chapter 13., 256487=DOE based its Shipments Model on the following three assumptions: (1) All equipment shipments for new construction are driven by the new multi-family housing market, (2) the relative market shares of the two equipment applications, laundromats and common-area laundry facilities in multi-family housing, are constant over time at 15 and 85 percent, respectively, and (3) the U.S. Census Bureau's quantity index data can be used to validate the shipments trend observed in the historical data. The Joint Comment stated that DOE's assumed 85 percent to 15 percent split between sales for multi-family applications and sales for laundromat applications is not based on robust or current data. (Joint Comment, No. 44 at p. 5) It cited information from Alliance Laundry that suggests that the ratio of multi-family to laundromat shipments is about 36 percent to 64 percent. DOE based its market information on a report from the CEE, [27] which gathered information from several sources. Therefore, DOE concluded that this source is more reliable than information from a single manufacturer, and it continued to apply the same multi-family/laundromat sales split used in the October 2008 NOPR for today's SNOPR., 92917=4. Hand Delivery/Courier: Ms. Brenda Edwards, U.S. Department of Energy, Building Technologies Program, Room 1J-018, 1000 Independence Avenue, SW., Washington, DC 20585-0121. Telephone: (202) 586-2945. Please submit one signed original paper copy., 154007=The max-tech top-loading CCW efficiency rating in the October 2008 NOPR was questioned by Alliance at the November 2008 NOPR meeting. (Alliance, Public Meeting Transcript, No. 40.5 at pp. 90-92) In response, DOE contracted an independent testing laboratory to verify the performance ratings for the max-tech top-loading CCW. The laboratory results (based on a 3-unit sample) suggest that the unit achieves 1.63 MEF/8.4 WF. Based on this information, for the SNOPR analysis, DOE revised the max-tech top-loading CCW level downward to 1.60 MEF/8.5 WF, a level proposed in the October 2008 NOPR as a “gap-fill” level and one which DOE concludes is attainable by the max-tech CCW model. For more details on this selection of max-tech levels for the SNOPR, see section III.C.1 of today's supplemental notice., 530248=DOE reviewed this regulatory action under title II of the Unfunded Mandates Reform Act of 1995 (Pub. L. 104-4) (UMRA), which requires each Federal agency to assess the effects of Federal regulatory actions on State, local and Tribal governments and the private sector. For a proposed regulatory action likely to result in a rule that may cause the expenditure by State, local, and Tribal governments, in the aggregate, or by the private sector of $100 million or more in any one year (adjusted for inflation), section 202 of UMRA requires an agency to publish a written statement assessing the costs, benefits, and other effects of the rule on the national economy. (2 U.S.C. 1532(a), (b)) The UMRA also requires a Federal agency to develop an effective process to permit timely input by elected officers of State, local, and Tribal governments on a proposed “significant intergovernmental mandate,” and requires an agency plan for giving notice and opportunity for timely input to potentially affected small governments before establishing any requirements that might significantly or uniquely affect small governments. On March 18, 1997, DOE published a statement of policy on its process for intergovernmental consultation under UMRA (62 FR 12820) (also available at http://www.gc.doe.gov). Although today's supplemental notice does not contain a Federal intergovernmental mandate, it may impose expenditures of $100 million or more on the private sector, although DOE believes such expenditures are likely to be less than $50 million., 396327=Improving the energy efficiency of CCWs, where economically justified, would likely improve the security of the Nation's energy system by reducing overall demand for energy. Reduced electricity demand may also improve the reliability of the electricity system. As a measure of this reduced demand, DOE expects the energy savings from the adopted standards to eliminate the need for approximately 0.010 gigawatts (GW) of generating capacity by 2043., 177303=As discussed in the October 2008 NOPR, DOE concluded that the method of “loading” clothes (i.e., the axis of access) is a “feature” of RCWs within the meaning of 42 U.S.C. 6295(o)(4). Due to similarities in technologies and in design and operating characteristics between RCWs and CCWs, the axis of access may also be considered a feature in the context of this CCW rulemaking. Therefore, DOE tentatively concludes that top-loading, vertical-axis CCWs provide unique utility, and that, as determined in the October 2008 NOPR, axis of access is a feature pursuant to EPCA. Thus, DOE is retaining the two proposed equipment classes from the October 2008 NOPR in today's SNOPR., 157912=EPCA, as amended, prohibits DOE from adopting a standard for a product if that standard would not result in “significant” energy savings. (42 U.S.C. 6295(o)(3)(B)) While the Act does not define the term “significant,” the U.S. Court of Appeals for the District of Columbia, in Natural Resources Defense Council v. Herrington, 768 F.2d 1355, 1373 (D.C. Cir. 1985), indicated that Congress intended “significant” energy savings in this context to be savings that were not “genuinely trivial.” The energy savings for energy conservation standards at each of the TSLs considered in this rulemaking are nontrivial, and, therefore, DOE considers them “significant” within the meaning of 42 U.S.C. 6295(o)(3)(B)., 90710=DOE will accept comments, data, and information regarding the supplemental notice of proposed rulemaking (SNOPR) received not later than December 9, 2009. See section VII, “Public Participation,” of today's supplemental notice for details., 570925=35. 531 F.3d 896 (D.C. Cir. 2008); see also North Carolina v. EPA, 550 F.3d 1176 (D.C. Cir. 2008)., 403174=As noted in section III.J, DOE was able to estimate the changes in Hg emissions associated with an energy conservation standard as follows. DOE notes that the NEMS-BT model used as an integral part of today's rulemaking does not estimate Hg emissions reductions due to new energy conservation standards, as it assumed that Hg emissions would be subject to EPA's CAMR. 70 FR 28606 (May 18, 2005). CAMR would have permanently capped emissions of mercury for new and existing coal-fired plants in all States by 2010. As with SO 2 and NO X, DOE assumed that under such a system, energy conservation standards would have resulted in no physical effect on these emissions, but might have resulted in an environmentally related economic benefit in the form of a lower price for emissions allowance credits if those credits were large enough. DOE estimated that the change in the Hg emissions from energy conservation standards would not be large enough to influence allowance prices under CAMR., 146242=EPCA directs DOE to use the same test procedures for CCWs as those established by DOE for residential clothes washers (RCWs). (42 U.S.C. 6314(a)(8)) 73 FR 62034, 62043-62044 (Oct. 17, 2008). While DOE believes commercial laundry practices likely differ from residential practices, [7] DOE concluded in the October 2008 NOPR that the existing clothes washer test procedure (at 10 CFR part 430, subpart B, appendix J1) adequately accounts for the efficiency rating of CCWs, and that DOE's methods for characterizing energy and water use in the October 2008 NOPR analyses adequately accounted for the consumer usage patterns specific to CCWs., 103646=H. Review Under the Treasury and General Government Appropriations Act, 1999, 140963=On October 17, 2008, DOE published a NOPR (October 2008 NOPR) in the Federal Register, in which it proposed amended energy conservation standards for certain products and equipment, including CCWs. 73 FR 62034. The energy conservation standards proposed in the October 2008 NOPR for CCWs are shown in Table II.1., 156257=DOE used its NIA spreadsheet tool to estimate energy savings from amended standards for CCWs. (Section III.E of today's supplemental notice and chapter 11 of the SNOPR TSD describe the NIA spreadsheet model.) DOE forecasted energy savings over the period of analysis (beginning in 2013, the year that amended standards would go into effect, and ending in 2043) for each TSL, relative to the base case, which represents the forecast of energy consumption in the absence of amended energy conservation standards. DOE quantified the energy savings attributable to amended energy conservation standards as the difference in energy consumption between the standards case and the base case. The base case represents the forecast of energy consumption in the absence of amended energy conservation standards. The base case considers market demand for more efficient equipment., 480550=Next, DOE considered TSL 3. TSL 3 would likely save 0.10 quads of energy and 0.14 trillion gallons of water through 2043, an amount DOE considers significant. For the Nation as a whole, DOE projects that TSL 3 would result in a net increase of $0.36 billion in NPV, using a discount rate of 7 percent. The emissions reductions at TSL 3 are 5.07 Mt of CO 2, 3.04 kt of NO X, and 0 t to 0.03 t of Hg. The estimated benefits of reducing CO 2 emissions based on global estimates of the value of CO 2 ranges from $13 million to $140 million at a 7-percent discount rate and $28 million to $303 million at a 3-percent discount rate. Total generating capacity in 2043 is estimated to decrease compared to the reference case by 0.010 GW under TSL 3., 577664=51. Sanchez, M. and A. Fanara, “New Product Development: The Pipeline for Future ENERGY STAR Growth,”Proceedings of the 2000 ACEEE Summer Study on Energy Efficiency in Buildings (2000) Vol 6, pp 343-354., 545725=Pursuant to 10 CFR 1004.11, any person submitting information that he or she believes to be confidential and exempt by law from public disclosure should submit two copies: One copy of the document including all the information believed to be confidential, and one copy of the document with the information believed to be confidential deleted. DOE will make its own determination about the confidential status of the information and treat it according to its determination., 142346=In the October 2008 NOPR, DOE described and sought further comment on the analytical framework, models, and tools (e.g., LCC and NIA spreadsheets) it was using to analyze the impacts of energy conservation standards for this equipment. In conjunction with the October 2008 NOPR, DOE also posted on its Web site the complete technical support document (TSD), which along with the October 2008 NOPR, is available at http://www1.eere.energy.gov/buildings/appliance_standards/. The TSD included the results of a number of DOE's analyses, including: (1) The market and technology assessment; (2) screening analysis; (3) engineering analysis; (4) energy and water use determination; (5) markups analysis to determine equipment price; (6) LCC and PBP analyses; (7) shipments analysis; (8) NES and national impact analyses; and (9) MIA. In the October 2008 NOPR and at the public meeting held on November 13, 2008 (referred to as the “November 2008 public meeting”), DOE invited comment in particular on the following issues concerning CCWs: (1) The efficiency levels; (2) DOE's determination of the maximum technologically feasible (max-tech) efficiency levels for top-loading and front-loading CCWs; (3) the magnitude of possible equipment class shifting to front-loading CCWs; (4) the analysis and data relevant to the price elasticity of demand for calculating the anticipated energy and water savings at different TSLs; (5) the analysis of consumer knowledge of the Federal ENERGY STAR program and its potential as a resource for increasing knowledge of the availability and benefits of energy efficient appliances in the home appliance consumer market; (6) discount rates other than 7 percent and 3 percent real to discount future emissions reductions; (7) data that might enable DOE to test for market failures or other specific problems for CCWs; and (8) the determination of anticipated environmental impacts of the standards proposed in the October 2008 NOPR, particularly with respect to the methods for valuing the expected CO 2 and NO X emissions savings. 73 FR 62034, 62133 (Oct. 17, 2008)., 486077=DOE also calculated the annualized values for certain benefits and costs at the various TSLs. Table V.29 shows the annualized values. DOE used a two-step calculation process to convert the time-series of costs and benefits into annualized values. First, DOE calculated a present value for the time-series of costs and benefits using a discount rate of either three or seven percent. From the present value, DOE then calculated the fixed annual payment over the analysis time period (2013 to 2043) that yielded the same present value. The fixed annual payment is the annualized value. Although DOE calculated annualized values, this does not imply that the time-series of cost and benefits from which the annualized values were determined are a steady stream of payments., 53213=Posted by Ben Jordi on June 4, 2015, 259589=DOE estimated replacements using equipment retirement functions developed from equipment lifetimes. For the October 2008 NOPR and today's SNOPR, DOE used retirement functions based on Weibull distributions. For the October 2008 NOPR, DOE determined that the growth of in-unit washer saturations in the multi-family stock over the last 10 years was likely caused by conversions of rental property to condominiums, resulting in the gradual phase-out or non-replacement of failed CCWs in common-area laundry facilities. As a result, DOE used the average percent of non-replacements over the period between 1999 and 2005 (18 percent) and maintained it over the entire forecast period (2006 to 2042 for the October 2008 NOPR and 2007 to 2043 for today's SNOPR). The effect of maintaining non-replacements at 18 percent results in forecasted CCW shipments staying relatively flat during the forecast period., 53273=On June 2, 2015, the Office of the Federal Register (OFR) hosted its 3rd Annual Federal Register Liaison Conference in the National Archives’ McGowan Theater. What exactly is a Federal... Continue reading →, 125890=Section 136(a) and (e) of the Energy Policy Act of 2005 (EPACT 2005; Pub. L. 109-058) added CCWs as equipment covered under EPCA and established standards for such equipment that is manufactured on or after January 1, 2007. [3] (42 U.S.C. 6311(1) and 6313(e)) These amendments to EPCA also require that DOE issue a final rule by January 1, 2010, to determine whether these standards should be amended. (EPACT 2005, section 136(e); 42 U.S.C. 6313(e)) If amended standards are justified, they would become effective no later than January 1, 2013. (Id.), 488222=The Executive Order requires each agency to identify the problem the agency intends to address that warrants new agency action (including, where applicable, the failures of private markets or public institutions), as well as to assess the significance of that problem in evaluating whether any new regulation is warranted. E.O. 12866, section 1(b)(1)., 232282=For the LCC and PBP analysis, DOE analyzes higher efficiency levels relative to a baseline efficiency level. However, some consumers may already purchase equipment with efficiencies greater than the baseline equipment levels. Thus, to accurately estimate the percentage of consumers that would be affected by a particular standard level, DOE estimates the distribution of equipment efficiencies that consumers are expected to purchase under the base case (i.e., the case without new energy efficiency standards). DOE refers to this distribution of equipment energy efficiencies as a base-case efficiency distribution. As discussed previously in section III.A, DOE decided to analyze CCWs with two equipment classes—top-loading CCWs and front-loading CCWs. For the October 2008 NOPR and today's SNOPR, DOE used the number of available models within each equipment class to establish the base-case efficiency distributions. Table III.5 presents the market shares of the efficiency levels in the base case for CCWs. See chapter 8 of the TSD accompanying this notice for further details on the development of CCW base-case market shares., 572058=38. The 2006 ASM provides the following definition: “The `production workers' number includes workers (up through the line-supervisor level) engaged in fabricating, processing, assembling, inspecting, receiving, storing, handling, packing, warehousing, shipping (but not delivering), maintenance, repair, janitorial and guard services, product development, auxiliary production for plant's own use (e.g., power plant), recordkeeping, and other services closely associated with these production operations at the establishment covered by the report. Employees above the working-supervisor level are excluded from this item.”, 218376=Installation costs include labor, overhead, and any miscellaneous materials and parts. For the October 2008 NOPR and today's SNOPR, DOE used data from the RS Means Mechanical Cost Data, 2008 on labor requirements to estimate installation costs for CCWs. [20] DOE estimates that installation costs do not increase with equipment efficiency., 150704=When DOE considers an amended or new standard for a type (or class) of equipment such as front-loading or top-loading CCWs, it must “determine the maximum improvement in energy efficiency or maximum reduction in energy use that is technologically feasible” for such equipment. (42 U.S.C. 6295(p)(2) and 6316(a)) For the October 2008 NOPR, DOE determined the max-tech efficiency levels for front-loading and top-loading CCWs in the engineering analysis, based on published MEF and WF values of commercially available equipment. (See chapter 5 in the NOPR TSD.) In proposing these max-tech levels, DOE noted that some CCWs exceed the max-tech MEF or WF levels, but not both. For example, two front-loading models exceed the max-tech MEF—they are rated at 2.45 and 2.68 MEF, respectively, in the Consortium for Energy Efficiency (CEE) qualifying product list for its Commercial, Family-Sized Washer Initiative—but don't achieve a max-tech WF level—they are rated at 5.69 and 5.47 WF, respectively. In the California Energy Commission (CEC) equipment database for CCWs, DOE found one top-loading model that exceeds the max-tech WF—it is rated at 7.3 WF—but not the max-tech MEF level—it is rated at 1.32 WF. This model has been discontinued, as discussed in the November 2007 ANOPR and the October 2008 NOPR TSD. The max-tech efficiency levels proposed in the October 2008 NOPR were selected to represent the best available combinations of high MEF and low WF for each equipment class., 261859=To estimate the combined effects on CCW shipments from increases in equipment purchase price and decreases in equipment operating costs due to amended efficiency standards, DOE conducted a literature review and a statistical analysis on a limited set of appliance price, efficiency, and shipments data for the October 2008 NOPR. DOE used purchase price and efficiency data specific to residential refrigerators, clothes washers, and dishwashers between 1980 and 2002 to conduct regression analyses. DOE's analysis suggests that the “relative” short-run price elasticity of demand, averaged over the three appliances, is −0.34. Because DOE's forecast of shipments and national impacts due to standards spans over 30 years, DOE also considered how the relative price elasticity is affected once a new standard takes effect. Past analyses of consumer purchase decisions for automobiles suggest that after the initial purchase price change, price elasticity becomes more inelastic over the years until it reaches a terminal value. See appendix 10A of the SNOPR TSD for more details on the development of the short-run price elasticity of demand and the long-run effects on the elasticity., 218918=DOE determined the annual energy and water consumption of CCWs by multiplying the per-cycle energy and water use by the estimated number of cycles per year. In the October 2008 NOPR, DOE concluded that the use of the existing RCW test procedure provides a representative basis for rating and estimating the per-cycle energy use of CCWs. For today's SNOPR, DOE maintained the above approach., 307438=Because only the LVM produces qualifying CCWs, DOE based its estimates of the potential benefits to the CCW industry by estimating the potential Federal production tax credits that the LVM could receive. Using publically available information, recent SEC filings, and the information published in chapter 13 and appendix 13A of the October 2008 NOPR, DOE estimated the LVM's front-loading CCW shipment projections to 2010. These estimates suggest that the LVM could collect $2.8 million in Federal production tax credits from 2008-2010 from the provisions updated by EIEA 2008 and $4.1 million from the program from 2007 to 2010. Based on its calculations, the LVM received the biggest benefit from the tax credit in 2008. According to the ENERGY STAR database, [31] the LVM released a model that qualified for the $250 Federal production tax credit on September 26, 2008, shortly before EIEA 2008 was enacted. Because the higher tax credits were retroactive for all of 2008, the LVM received a $2.4 million Federal tax credit in 2008 because it had substantially increased production of qualifying front-loading CCWs. Using the LVM's SEC Form 10-Q for the quarter ending March 31, 2009, [32] DOE estimates that in 2009 the LVM will receive $385,000 in Federal production tax credits. DOE estimates that the LVM is unlikely to qualify for any additional Federal production tax credit in 2010 even if the volume of qualifying washers increases. DOE has a more extensive explanation of its calculations of the Federal production tax credits in appendix 13C of the SNOPR TSD., 532352=Section 202 of UMRA authorizes an agency to respond to the content requirements of UMRA in any other statement or analysis that accompanies the supplemental notice. 2 U.S.C. 1532(c). The content requirements of section 202(b) of UMRA relevant to a private sector mandate substantially overlap the economic analysis requirements that apply under section 325(o) of EPCA and Executive Order 12866. The Supplementary Information section of this supplemental notice and the “Regulatory Impact Analysis” section of the SNOPR TSD respond to those requirements., 171011=Additionally, DOE estimated the impacts of energy conservation standards due to equipment on utilities and the environment. DOE used a version of EIA's National Energy Modeling System (NEMS) for the utility and environmental analyses. The NEMS model simulates the energy economy of the United States and has been developed over several years by the EIA primarily for the purpose of preparing the AEO. The NEMS produces forecasts for the United States that are available in the public domain. The version of NEMS used for appliance standards analysis is called NEMS-BT and is primarily based on the AEO 2009 April Release with minor modifications. [9] The NEMS-BT offers a sophisticated picture of the effect of standards, since it accounts for the interactions between the various energy supply and demand sectors and the economy as a whole., 91210=The public meeting will be held at the U.S. Department of Energy, Forrestal Building, 1E-245, 1000 Independence Avenue, SW., Washington, DC 20585. (Please note that foreign nationals visiting DOE Headquarters are subject to advanced security screening procedures. If you are a foreign national and wish to participate in the workshop, please inform DOE of this fact as soon as possible by contacting Ms. Brenda Edwards at (202) 586-2945 so that the necessary procedures can be completed.), 92317=2. E-mail: home_appliance.rulemaking@ee.doe.gov. Include docket number EE-2006-STD-0127 and/or RIN number 1904-AB93 in the subject line of the message., 550104=Issued in Washington, DC, on October 27, 2009., 227722=Repair costs are associated with repairing or replacing components that have failed in the appliance, whereas maintenance costs are associated with maintaining the operation of the equipment. For the October 2008 NOPR, DOE included increased repair costs based on an algorithm developed by DOE for central air conditioners and heat pumps and which was also used for residential furnaces and boilers. [25] This algorithm calculates annualized repair costs by dividing half of the equipment retail price over the equipment lifetime. Whirlpool agreed with the assumptions DOE used to estimate CCW repair costs in the October 2008 NOPR. (Whirlpool, No. 50 at p. 3) MLA stated that more efficient CCWs incur higher maintenance costs. (MLA, No. 49 at p. 4) ASAP asked whether DOE had gathered empirical data to estimate CCW repair and maintenance costs. (ASAP, Public Meeting Transcript, No. 40.5 at pp. 110-111) DOE was unable to gather any empirical data specific to CCWs to estimate repair and maintenance cost. In the absence of better data, DOE retained its approach from the October 2008 NOPR for today's SNOPR., 294326=DOE also received a number of comments from interested parties in response to the MIA analysis presented in the October 2008 NOPR. Alliance stated that the top-loading CCW energy conservation standard proposed in the October 2008 NOPR would eliminate Alliance from the CCW market, and eliminate top-loading CCWs from the market as well. (Alliance, No. 45 at Attachment 2, p. 3) Alliance stated that, if it were to exit the CCW market, the CCW market would suffer significant competitive harm. Alliance also stated that more than 20 route operators and the MLA are opposed to the standard proposed in the October 2008 NOPR because it would result in a loss of competition. (Alliance, No. 45 at p. 1 and Attachment 2, pp. 6-12) Alliance stated that the lower CCW market competition could lead to price increases from Alliance's competitors, such as the combined Whirlpool and Maytag entities, which currently control 72 percent of the RCW market. Alliance predicted that these manufacturers would control about 90 percent of the CCW market if Alliance were to stop making CCWs. Alliance sees this outcome as a monopoly for Whirlpool. (Alliance, Public Meeting Transcript, No. 40.5 at p. 24), 544298=DOE will make the entire record of this proposed rulemaking, including the transcript from the public meeting, available for inspection at the U.S. Department of Energy, Resource Room of the Building Technologies Program, 950 L'Enfant Plaza, SW., Suite 600, Washington, DC, 20024, (202) 586-2945, between 9 a.m. and 4 p.m., Monday through Friday, except Federal holidays. Any person may buy a copy of the transcript from the transcribing reporter., 576786=48. Lawrence Berkeley National Laboratory, End-Use Forecasting Group. Analysis of Tax Credits for Efficient Equipment (1997). Available at http://enduse.lbl.gov/Projects/TaxCredits.html. (Last accessed April 24, 2008.), 91742=Any comments submitted must identify the SNOPR for Energy Conservation Standards for Home Appliance Products, and provide docket number EERE-2006-STD-0127 and/or regulatory information number (RIN) 1904-AB93. Comments may be submitted using any of the following methods:, 554460=2. DOE anticipates publishing a final rule for commercial clothes washer energy conservation standards by January 1, 2010, pursuant to the requirements of the Energy Policy Act of 2005 (EPACT 2005; Pub. L. 109-058), which would make any amended standards effective on January 1, 2013., 235625=Under a split incentive situation, the party purchasing more efficient and presumably more expensive equipment (referred to as “consumers” in this notice) may not realize the operating cost savings from that equipment, because another party may pay the utility bill. For the October 2008 NOPR, DOE evaluated the ability of CCW owners to pass on the higher purchase costs of more expensive CCWs in return for lower operational costs. DOE concluded that few route operators would allow themselves to be held to a lease agreement which would prevent them from recovering the cost of more efficient CCW equipment. The Joint Comment stated that contracts between route operators are multi-housing property owners are subject to revision and renewal, and that the division of coin-box revenue may be negotiated as a result of cost-effective efficiency improvements in CCWs. (Joint Comment, No. 44 at p. 6) Because DOE received only supportive comments regarding its assessment of the potential of a split incentive in the CCW market, DOE continues to conclude for today's SNOPR that new CCW efficiency standards are unlikely to lead to split incentives in the CCW market., 511445=To estimate the impacts from a voluntary energy efficiency program targeting the adoption of top-loading CCWs meeting TSL 3, DOE evaluated the potential impacts of expanding the Federal government's existing ENERGY STAR program for CCWs. DOE modeled the voluntary efficiency program based on the ENERGY STAR program's experience with RCWs. [49] [50] Over the period spanning 2007-2025, ENERGY STAR projected that the market share of RCWs meeting target efficiency levels due to ENERGY STAR will increase to a maximum of 28 percent. DOE estimated that an expanded voluntary program would increase their market share by half of these projected annual amounts for the existing ENERGY STAR program, reaching a maximum of 14 percent increased market share. For CCWs, DOE assumed that the impacts of the existing ENERGY STAR program were already incorporated in the base case, and applied the same pattern of market share increase from an expanded voluntary program to CCWs beginning in 2013. After attaining its maximum market share of 14 percent in the year 2030, DOE's analysis maintained that market share throughout the remainder of the forecast period. DOE estimated that an expanded program of voluntary energy efficiency targets would be expected to provide 0.02 quads of national energy savings, 24 billion gallons of national water savings, and an NPV of $0.06 billion (at a 7-percent discount rate). Although this program would provide national benefits, they were estimated to be smaller than the benefits resulting from today's proposed national performance standards. Thus, DOE rejected the use of voluntary energy efficiency targets as a policy alternative to national performance standards., 72031=5 actions from October 17th, 2008 to January 8th, 2010, 524869=DOE has prepared a draft environmental assessment (EA) of the impacts of the supplemental notice pursuant to the National Environmental Policy Act of 1969 (42 U.S.C. 4321 et seq.), the regulations of the Council on Environmental Quality (40 CFR Parts 1500-1508), and DOE's regulations for compliance with the National Environmental Policy Act (10 CFR part 1021). This assessment includes an examination of the potential effects of emission reductions likely to result from the rule in the context of global climate change, as well as other types of environmental impacts. The draft EA has been incorporated into the TSD; the environmental impact analyses are contained primarily in chapter 16 of that document. Before issuing a final rule for CCWs, DOE will consider public comments and, as appropriate, determine whether to issue a finding of no significant impact as part of a final EA or to prepare an environmental impact statement (EIS) for this rulemaking., 330855=In addition to electricity, the operation of gas-fired CCWs results in emissions of CO 2 and NO X at the sites where the appliances are used. NEMS-BT provides no means for estimating such emissions. Therefore, DOE calculated separate estimates of the effect of the potential standards on site emissions of CO 2 and NO X based on emissions factors derived from the literature. Because natural gas combustion does not yield SO 2 emissions, DOE did not report in either the October 2008 NOPR or today's SNOPR the effect of the proposed standards on site emissions of SO 2., 152408=For the October 2008 NOPR, DOE proposed the max-tech levels shown in Table II.2. 73 FR 62034, 62036 (Oct. 17, 2008)., 265332=Although DOE retained its approach from the October 2008 NOPR to estimate the impacts from changes in purchase price and operating cost, DOE has concerns over specific aspects of its analysis. First, because purchase price and efficiency data for residential appliances were used to develop the “relative” short-run price elasticity of demand, DOE is uncertain how applicable the price elasticity is to the commercial clothes washing market. Second, because estimates of the long-run price elasticity of demand were derived from consumer automobile purchase decisions, DOE is uncertain whether it can be inferred that the initial CCW price elasticity of demand would become more inelastic over time. Third, although a cross price elasticity of demand between top-loading and front-loading CCWs could not be developed due to the lack of specific data, DOE still has concern over the price interactions between the two types of CCWs, especially under those circumstances where the purchase price increase for one CCW equipment class is more significant than for the other. Finally, DOE is concerned over its assumption that consumers forgoing a top-loader CCW purchase due to a price increase caused by standards would instead acquire used top-loading washers. For example, those consumers forgoing a top-loading CCW purchase may instead purchase a new front-loading CCW. To understand the interactions between the used CCW market and the new front-loading CCW market, the development of a cross price elasticity between these two markets would be ideal., 187079=In the October 2008 NOPR, DOE proposed the following efficiency levels for CCWs., 574883=43. Itron and KEMA, 2004/2005 Statewide Residential Retrofit Single-Family Energy Efficiency Rebate Evaluation (prepared for the California Public Utilities Commission, Pacific Gas And Electric Company, San Diego Gas and Electric Company, Southern California Edison, Southern California Gas Company, CPUC-ID# 1115-04) (2007)., 53881=Posted by Ben Jordi on June 1, 2015, 360882=For the October 2008 NOPR, DOE used the INPV in the MIA to compare the financial impacts of different TSLs on CCW manufacturers. 73 FR 62034, 62099-104 (Oct. 17, 2008). The INPV is the sum of all net cash flows discounted by the industry's cost of capital (discount rate). DOE used the GRIM to compare the INPV of the base case (no new energy conservation standards) to that of each TSL for the CCW industry. To evaluate the range of cash-flow impacts on the CCW industry, DOE constructed different scenarios using different assumptions for shipments that correspond to the range of anticipated market responses. Each scenario results in a unique set of cash flows and corresponding industry value at each TSL. These steps allowed DOE to compare the potential impacts on the industry as a function of TSLs in the GRIM. The difference in INPV between the base case and the standards case is an estimate of the economic impacts that implementing that standard level would have on the entire industry. For today's supplemental notice, DOE continues to use the above methodology and presents the results in the subsequent sections. See chapter 13 for additional information on MIA methodology and results., 139035=DOE published the advance notice of proposed rulemaking (ANOPR) for this rulemaking on November 15, 2007 (November 2007 ANOPR) (72 FR 64432), and held a public meeting on December 13, 2007, to present and seek comment on the November 2007 ANOPR analytical methodology and results. The November 2007 ANOPR included background information on the history and conduct of this rulemaking. 72 FR 64432, 64438-39 (Nov. 15, 2007) In the November 2007 ANOPR, DOE described and sought further comment on the analytical framework, models, and tools (e.g., LCC and NIA spreadsheets) it was using to analyze the impacts of energy conservation standards for these products. In conjunction with the November 2007 ANOPR, DOE also posted on its Web site the complete November 2007 ANOPR technical support document (TSD). The TSD included the results of a number of DOE's preliminary analyses, including: (1) The market and technology assessment; (2) screening analysis; (3) engineering analysis; (4) energy and water use determination; (5) markups analysis to determine equipment price; (6) LCC and PBP analyses; (7) shipments analysis; (8) NIA; and (9) manufacturer impact analysis (MIA). In the November 2007 ANOPR and at the public meeting, DOE invited comment in particular on the following issues concerning CCWs: (1) Product classes; (2) horizontal-axis designs; (3) technologies unable to be analyzed and exempted product classes, including potential limitations of existing test procedures; (4) per-cycle energy consumption; (5) consumer prices; (6) repair and maintenance costs; (7) efficiency distributions in the base case; (8) shipments forecasts; (9) base-case and standards-case forecasted efficiencies; and (10) TSLs. 72 FR 64432, 64512-14 (Nov. 15, 2007)., 147283=In response to the October 2008 NOPR, Alliance Laundry Systems (Alliance), GE Consumer Industrial (GE), and AHAM agreed with DOE's conclusion that the DOE clothes washer test procedure is adequate for rating CCWs. (Alliance, Public Meeting Transcript, No. 40.5 at p. 22; Alliance, No. 45 at p. 1; GE, No. 48 at p. 4; AHAM, Public Meeting Transcript, No. 40.5 at pp. 26-27; AHAM, No. 47 at p.4) [8] DOE did not receive any comments objecting to the use of the DOE clothes washer test procedure for CCWs. Therefore DOE continues to consider the existing DOE test procedure adequate to measure energy and water consumption of CCWs., 501683=No New Regulatory Action. The case in which no regulatory action is taken with regard to CCWs constitutes the “base case” (or “No Action”) scenario. In this case, between 2013 and 2043, CCWs are expected to use 0.97 quads of primary energy along with 2.2 trillion gallons of water. Since this is the base case, energy savings and NPV are zero by definition., 290444=DOE received comments regarding the economic impacts of higher initial clothes washer costs. Alliance and MLA stated that the standards proposed in the October 2008 NOPR would result in substantial price increases for customers of central area laundry rooms, especially for elderly, low-income, college students, and disabled end-users. MLA stated that a majority of the 35-50 million CCW customers are low- or low-to-middle income people, many of whom are elderly or who suffer disabilities. (Alliance, No. 45 at p. 1 and Attachment 2, p. 12; MLA, No. 49 at pp. 1-4) PGE commented that lower-income consumers may pay higher energy costs in laundry rooms using older machines than those who have access to new machines. (PGE, Public Meeting Transcript, No. 40.5 at p. 25) DOE research suggests that the end-users of CCWs are unlikely to be the owners of the equipment. Although low-income end-users do utilize CCWs, it is unknown to what affect more efficient CCWs will impact their cost of using the equipment. If the price of operating a CCW to an end-user does increase, DOE estimates that such an increase would occur only if the CCW owner needed to increase the price of operation to recover or capture its increased costs of providing more efficient equipment while not benefitting from the lower utility consumption. Although DOE does recognize that this could occur, it is equally likely that the price of operation to end-users would not increase as the increased expense to the CCW owner of providing more efficient CCWs is more than offset by lifetime utility bill savings from the more-efficient CCW. More details on the consumer subgroup analysis can be found in chapter 12 of the SNOPR TSD., 211151=Table III.4 summarizes the approaches and data DOE used to derive the inputs to the LCC and PBP calculations for the October 2008 NOPR, and the changes it made for today's SNOPR. DOE did not introduce changes to the LCC and PBP analyses methodology described in the October 2008 NOPR. However, as the following sections discuss in more detail, DOE revised some of the inputs to the analysis. Chapter 8 of the TSD accompanying this notice contains detailed discussion of the methodology utilized for the LCC and PBP analyses as well as the inputs developed for the analyses., 238651=As noted above, EPCA, as amended (42 U.S.C. 6295(o)(2)(B)(iii) and 6316(a)), establishes a rebuttable presumption that a standard is economically justified if the Secretary finds that “the additional cost to the consumer of purchasing a product complying with an energy conservation standard level will be less than three times the value of the energy (and as applicable, water) savings during the first year that the consumer will receive as a result of the standard,” as calculated under the test procedure in place for that standard. For each TSL, DOE determined the value of the first year's energy savings by calculating the quantity of those savings in accordance with DOE's test procedure, and multiplying that amount by the average energy price forecast for the year in which a new standard would be first effective—in this case, 2013., 93461=Docket: For access to the docket to read background documents or comments received, visit the U.S. Department of Energy, Resource Room of the Building Technologies Program, 950 L'Enfant Plaza, SW., Suite 600, Washington, DC 20585-0121, (202) 586-2945, between 9 a.m. and 4 p.m., Monday through Friday, except Federal holidays. Please call Ms. Brenda Edwards at the above telephone number for additional information regarding visiting the Resource Room., 188648=In response to the October 2008 NOPR, Alliance disputed DOE's finding that the proposed max-tech level for top-loading CCWs is technically feasible, based on Alliance's internal testing of one max-tech unit. Alliance stated that there were numerous inconsistencies related to the stated efficiencies of the max-tech top-loading CCW, the GE WNRD2050G, in databases such as those published by the CEC and ENERGY STAR. (Alliance, Public Meeting Transcript, No. 40.5 at pp. 22-24 and 90-92) According to Alliance, its own tests for the same model did not achieve the published efficiency levels of 1.76 MEF/8.3 WF. Alliance suggested that DOE should test and confirm the max-tech model's efficiency before continuing to use it as the basis for the max-tech efficiency levels proposed in the October 2008 NOPR. (Alliance, No. 45 at Attachment 2, pp. 4-5), 223127=Interested parties also recommended DOE consider pending legislation that could influence future energy prices. The Joint Comment stated that to realistically depict energy prices in the future, DOE must consider the impact of carbon control legislation, since such legislation is very likely. It also noted that there are regional cap and trade programs that are in effect in the Northeast (Regional Greenhouse Gas Initiative (RGG)) and the West (Western Climate Initiative (WCI)) that will impact the price of electricity and are not reflected in the AEO energy price forecasts. (Joint Comment, No. 44 at p. 12) EJ stated that caps will likely be in place by the time new standards become effective, so DOE should increase its electricity prices to reflect the cost of complying with emission caps. (EJ, Public Meeting Transcript, No. 40.5 at pp. 105-106) The shape of Federal carbon control legislation, and the ensuing cost of carbon mitigation to electricity generators, is as yet too uncertain to incorporate into the energy price forecasts that DOE uses. The costs of carbon mitigation to electricity generators resulting from the regional programs are also very uncertain over the forecast period for this rulemaking. Even so, EIA did include the effect of the RGGI in its AEO 2009 April Release energy price forecasts. (WCI did not provide sufficient detail to EIA in order for them to model the impact of the WCI on energy price forecasts.) Therefore, the energy price forecasts used in today's supplemental notice do include the impact of one of the two regional cap and trade programs in the United States., 509103=As described earlier in section III.E.2 on the NIA, DOE analyzed the impact of recent Federal manufacturer tax credits on increased sales of high efficiency CCWs. DOE determined that the tax credits have increased the market share of front-loading washers from approximately 20 percent in the year 2005 to its current market share of 30 percent. For purposes of conducting the NIA, DOE estimated that the tax credits would permanently transform the market so that front-loading washers would continue to comprise 30 percent of the market over the entire forecast period, even though the tax credits are set to expire after 2010. For purposes of analyzing the impact of manufacturer tax credits for the RIA, DOE estimated the percentage of consumers purchasing equipment at TSL 3 would be expected to increase by 2.9 percent for both top-loading and front-loading washers. This additional increase of 2.9 percent is relative to the base case (i.e., the case without new efficiency standards) which is comprised of a 30 percent market share of front-loading washers and a 70 percent market share of top-loading washers. DOE assumed that the impact of the manufacturer tax credit policy would be to permanently transform the market so that the increased market share seen in the first year of the program would be maintained throughout the forecast period., 483762=After considering the analysis and weighing the benefits and the burdens, DOE has tentatively concluded that the benefits of a TSL 3 standard outweigh the burdens. In particular, the Secretary has tentatively concluded that TSL 3 saves a significant amount of energy and is technologically feasible and economically justified. Therefore, DOE today proposes to adopt the energy conservation standards for CCWs at TSL 3. Table V.28 lists today's proposed energy conservation standards for CCWs. DOE's proposal to amend energy conservation standards for CCWs at TSL 3 reflects its tentative conclusion that this standard level would minimize the potential adverse impacts on the LVM and, therefore, would also minimize the adverse impacts on CCW market competition. However, DOE will carefully consider DOJ's review of today's proposed standards for CCWs and any public comment received on these impacts before issuing its final rule for this equipment. It is DOE's intent to set a standard that will not produce significant adverse impacts on competition in this market. In proposing the standards in today's notice, DOE has also taken into consideration DOJ's determination on the standards proposed in the October 2008 NOPR., 553554=[FR Doc. E9-26544 Filed 11-2-09; 4:15 pm], 325901=NO X emissions from 28 eastern States and the District of Columbia (D.C.) are limited under the Clean Air Interstate Rule (CAIR), published in the Federal Register on May 12, 2005. [34] Although CAIR has been remanded to EPA by the U.S. Court of Appeals for the District of Columbia Circuit (D.C. Circuit), it will remain in effect until it is replaced by a rule consistent with the Court's July 11, 2008 opinion in North Carolina v. EPA. [35] Because all States covered by CAIR opted to reduce NO X emissions through participation in cap and trade programs for electric generating units, emissions from these sources are capped across the CAIR region., 226011=To estimate the future trend for water and wastewater prices, DOE used data on the historic trend in the national water price index (U.S. city average) provided by the Bureau of Labor Statistics (BLS). For the October 2008 NOPR, DOE extrapolated a future trend based on the linear growth from 1970 to 2007. The Joint Comment stated that (1) the trend line for water and wastewater prices developed by DOE begins with an anomalous dip of over seven percent in costs for 2008, rather than the likely increase of 2 percent or more; and (2) DOE's trend forecast understates the future cost of water and wastewater service by some ten percent. (Joint Comment, No. 44 at pp. 3-4) For today's SNOPR, DOE modified its future trends of water and wastewater prices based on some of the Joint Comment's suggestions. DOE continued to the use the BLS historical data, which now provides data for the year 2008, and extrapolated the future trend based on the linear growth from 1970 to 2008. But rather than use the extrapolated trend to forecast the prices for the four years after 2008, DOE pinned the annual price to the value in 2008. Otherwise, forecasted prices for this 4-year time period would have been up to 8 percent lower than the price in 2008. Estimating prices in this manner is appropriate because it is consistent with the historical trend that demonstrates that prices do not decrease over time. Estimating prices in this manner also prevents the anomalous dip noted by the Joint Comment. Beyond the 4-year time period, DOE used the extrapolated trend to forecast prices out to the year 2043., 343789=PGE and EJ stated that adopting a single standard for all CCW classes would result in the largest potential savings for consumers. (EJ, Public Meeting Transcript, No. 40.5 at p. 200; PGE, Public Meeting Transcript, No. 40.5 at p. 201) The Joint Comment suggested that a single standard based on efficiency achieved by front loaders available in the market today would achieve 32 percent more energy savings, 192 percent more water savings, and 78 percent more consumer savings in present value terms than the standards proposed in the October 2008 NOPR that treat top-loading and front-loading CCWs separately. (Joint Comment, No. 44 at p. 1), 516799=For CCWs, this program would encourage the government sector to shift its purchases to top-loading units that meet the efficiency levels in TSL 3. DOE estimated that this policy would apply to multi-family buildings that are government-owned. Based on a technology review prepared for FEMP by Pacific Northwest National Laboratory (PNNL), approximately 7000 CCWs (representing a 3.2 percent market share) were purchased in the year 2000 for Federal buildings. [53] Based on research of the effectiveness of bulk government purchasing programs, DOE estimated that the market share of more efficient CCWs in Federally owned multi-family buildings would increase at a rate of 8 percent per year over a 10-year period (2013-2022) and remain at the 2022 level for the remainder of the forecast period. DOE estimated that bulk government purchases would be expected to provide 0.003 quads of national energy savings, 7 billion gallons of national water savings, and an NPV of $0.02 billion (at a 7-percent discount rate), benefits which would be much smaller than those estimated for today's proposed national performance standards. Thus, DOE rejected bulk government purchases as a policy alternative to national performance standards., 288253=For the October 2008 NOPR, DOE conducted an analysis of the impact of reduced energy demand associated with possible standards on CCWs on prices of natural gas and electricity. The Joint Comment stated that the electricity price mitigation effects of the standard proposed in the October 2008 NOPR should be documented and the value of reduced electricity bills to all consumers quantified as a benefit. (Joint Comment, No. 44 at p. 11) The DOE analysis found that gas and electric demand reductions resulting from max-tech standards for CCWs would have no detectable change on the U.S. average wellhead natural gas price or the average user price of electricity. DOE concluded that CCW standards will not provide additional economic benefits resulting from lower energy prices. Thus, for today's SNOPR DOE has made no change to its assumptions about the effects of standards on energy prices. See chapter 11 of the SNOPR TSD for more details., 190540=In response to comments about the validity of published CCW data, the DOE rulemaking team purchased three nominally identical max-tech top-loading CCWs, and hired an independent test facility to determine their average efficiency rating per the DOE test procedure. [13] The test results suggest that the max-tech CCW achieves a 1.63 MEF/8.4 WF efficiency rating instead of 1.76 MEF/8.3 WF as stated. Even at this lower max-tech level, the unit identified as the max-tech top-loading CCW model for the October 2008 NOPR continues to be the max- tech top-loading CCW for the SNOPR analyses. However, as the tested values do not agree with the MEF and WF ratings in the CEC database on which the October 2008 NOPR analyses were based, and because this model was the only top-loading CCW stated to meet the (1.76 MEF/8.3 WF) max-tech level defined in the October 2008 NOPR, DOE elected to eliminate that efficiency level from the top-loading CCW analysis in the SNOPR., 534404=DOE determined that, for this rulemaking, it need not prepare a Family Policymaking Assessment under section 654 of the Treasury and General Government Appropriations Act, 1999 (Pub. L. 105-277). Id. DOE received no comments concerning section 654 in response to the October 2008 NOPR, and, therefore, takes no further action in today's supplemental notice with respect to this provision., 521117=For the manufacturers of equipment covered by this rulemaking, the SBA has set two size thresholds that define which entities are “small businesses” for the purposes of the statute. See http://www.sba.gov/idc/groups/public/documents/sba_homepage/serv_sstd_tablepdf. Because all CCW manufacturers also produce RCWs, limits for both categories are presented in Table VI.2. DOE used these small business definitions to determine whether any small entities would be required to comply with the rule. (65 FR 30836, 30848 (May 15, 2000), as amended at 65 FR 53533, 53544 (September 5, 2000) and codified at 13 CFR part 121.) The size standards are listed by NAICS code and industry description., 103769=I. Review Under Executive Order 12630, 208850=In response to the requirements of section 325(o)(2)(B)(i) of the Act, DOE conducted LCC and PBP analyses to evaluate the economic impacts of possible amended energy conservation standards for owners of CCWs. This section of the notice describes these analyses. DOE conducted the analysis using a spreadsheet model developed in Microsoft (MS) Excel for Windows 2007. (See the SNOPR TSD, chapter 8)., 557261=8. A notation in the form “Alliance, No. 45 at p. 1” identifies a written comment (1) made by Alliance Laundry Systems (Alliance), (2) recorded in document number 45 that is filed in the docket of this rulemaking (Docket No. EE-2006-STD-0127), maintained in the Resource Room of the Building Technologies Program, and (3) which appears on page 1 of document number 45., 321199=In its October 2008 NOPR, DOE did not estimate impacts on water and wastewater utilities because the water and wastewater utility sector is more complicated than either the electric utility or gas utility sectors, with a high degree of geographic variability produced by a large diversity of water resource availability, institutional history, and regulatory context. 73 FR 62034, 62082 (Oct. 17, 2008). For today's SNOPR, for the reasons cited above, DOE did not estimate impacts to the water and wastewater utility sector., 157172=The NIA spreadsheet tool calculates the electricity savings in “site energy” expressed in kWh. Site energy is the energy directly consumed on location by an individual equipment. DOE reports national energy savings on an annual basis in terms of the aggregated source energy savings, which is the savings of energy that is used to generate and transmit the energy consumed at the site. To convert site energy to source energy, DOE derived conversion factors, which change with time, from the March 2009 release of the AEO 2009. (See TSD chapter 11 accompanying today's supplemental notice for further details.), 539153=As more fully set forth in the October 2008 NOPR, DOE held formal in-progress peer reviews of the types of analyses and processes that DOE has used to develop the energy conservation standards in today's supplemental notice, and issued a report on these peer reviews. Id., 71187=On October 17, 2008, the U.S. Department of Energy (DOE) issued a notice of proposed rulemaking (NOPR) in which DOE proposed amendments to the energy conservation standards for several residential products and commercial equipment, including commercial clothes washers (CCWs). DOE decided to conduct additional, supplemental rulemaking analyses for CCWs to address certain alleged data problems. Today's document details these supplemental analyses and proposes revised CCW standard levels for consideration., 199153=DOE research also suggests that commercial acceptance depends on wash performance. Multiple comments from interested parties were received concerning wash performance of high-efficiency clothes washers. The Multi-Housing Laundry Association (MLA) and Alliance commented that the top-loading CCW standard proposed in the October 2008 NOPR could result in reduced equipment quality and clothes washing and rinsing performance. Alliance stated that the required reductions in water consumption and and/or low wash temperature to meet the standard proposed in the October 2008 NOPR would negatively affect consumer utility. Alliance stated that the max-tech vertical-axis CCW, when used with common clothes washing detergents, may not provide adequate clothes washing performance. (Alliance, Public Meeting Transcript, No. 40.5 at pp. 23-24 and p. 202; Alliance No. 45 at p. 1 and Attachment 2, p. 14; MLA No. 49 at pp. 3-4) DOE recognizes that any amended energy efficiency standard could result in a lessening of certain equipment utility and hence interviews interested parties to better understand the potential impacts of energy efficiency strategies that manufacturers might employ in their equipment. Although interested parties have suggested that the max-tech model does not provide acceptable washing and rinsing performance targets, especially when overloaded, they have yet to submit evidence of such performance degradation. Furthermore, DOE is not aware of any widely accepted, quantitative measures associated with clothes washing performance. While DOE research uncovered a rinse-performance standard that was developed by Australian clothes washer manufacturers, this rinse test has yet to find acceptance in the U.S. market., 573518=40. Trasande, L., et al.,“Applying Cost Analyses to Drive Policy that Protects Children,” 1076 Ann. N.Y. Acad. Sci. 911 (2006)., 565381=24. Raftelis Financial Consultants, Inc., 2006 RFC/AWWA Water and Wastewater Rate Survey, 2006, (2006). This document is available at: http://www.raftelis.com/ratessurvey.html., 293441=For today's supplemental notice, DOE updated the MIA results based on several changes to other analyses that impact the MIA. The total shipments and efficiency distributions were updated using the new estimates outlined in the SNOPR NIA. The MIA also uses the new analysis period in the NIA (2013-2043) and has updated the base year to 2009. As discussed in section III.C.2, DOE updated the manufacturer production costs and the capital and equipment conversion costs to 2008$ using the producer price index for commercial laundry equipment manufacturing (NAICS 333312). DOE updated the GRIM to allow the inclusion of Federal production tax credits. DOE discusses the assumptions and methodology used to calculate the Federal production tax in appendix 13C and in the section below. For details of the MIA, see chapter 13 of the SNOPR TSD., 329055=Similar to SO 2 and NO X, future emissions of Hg would have been subject to emissions caps under Clean Air Mercury Rule (CAMR) [70 FR 28606 (May 18, 2005)], which would have permanently capped emissions of Hg for new and existing coal-fired plants in all States by 2010, but the CAMR was vacated by the D.C. Circuit in its decision in New Jersey v. Environmental Protection Agency prior to the publication of the October 2008 NOPR. 517 F.3d 574 (D.C. Cir. 2008). However, the NEMS-BT model DOE initially used to estimate the changes in emissions for the proposed rule assumed that Hg emissions would be subject to CAMR emission caps., 195927=DOE also received numerous comments regarding the viability in commercial settings of the max-tech top-loading CCW evaluated in the October 2008 NOPR. Alliance and GE commented that the commercial acceptance of the technology behind the max-tech vertical-axis CCW is as yet unknown because the GE model was introduced only recently and because the max-tech unit is currently only sold into the on-premise laundry market segment, where the frequency of user abuse such as overloading is lower than in other commercial segments (laundromats, multi-family housing, etc.). (Alliance, Public Meeting Transcript, No. 40.5 at p. 23; GE, Public Meeting Transcript, No. 40.5 at pp. 173-174; GE, No. 48 at p.4;) Whirlpool suggested that the practice of overloading impairs top-loading CCWs more than front-loading machines, and, thus, inherently limits the efficiency levels that top-loading CCWs can achieve. Whirlpool also stated that CCWs are more prone to user abuse, such as extreme overloading, than RCWs. Whirlpool noted that certain residential platforms are not able to achieve proper clothes roll-over and, hence, cleaning when overfilled. (Whirlpool, No. 50 at pp. 2-3) The Joint Comment stated that on-premise laundry is served primarily by larger capacity equipment than is covered by this rulemaking. (Joint Comment, No. 44 at pp. 4-5) Conversely, Alliance stated that the max-tech vertical-axis CCW is based on a lightweight RCW platform that is poorly suited to commercial usage. (Alliance, No. 45 at Attachment 2, p. 7), 344477=ASAP commented that the previous analyses leading up to the October 2008 NOPR [the analyses in the November 2007 ANOPR] clearly indicated that there are tremendous life-cycle cost savings presented by high-efficiency CCWs, and those are available to all sectors of the market. ASAP believes that, for what appears to be a lack of a relatively small amount of capital, recognizing that amount of capital is significant for one manufacturer, hundreds of millions of dollars of consumer savings are going to be foregone. ASAP also commented that DOE did not substantiate its concerns about potential recapture of market share by less efficient top-loaders when reducing the proposed standard for front-loading CCWs from the level that would maximize life-cycle cost savings to the standards proposed in the October 2008 NOPR. (ASAP, Public Meeting Transcript, No. 40.5 at pp. 34-35), 400034=NO X emissions from 28 eastern States and D.C. are limited under CAIR, Although CAIR has been remanded to EPA by the D.C. Circuit, it will remain in effect until it is replaced by a rule consistent with the Court's December 23, 2008, opinion in North Carolina v. EPA. North Carolina v. EPA, 550 F.3d 1176 (D.C. Cir. 2008). Because all States covered by CAIR opted to reduce NO X emissions through participation in cap and trade programs for electric generating units, emissions from these sources are capped across the CAIR region., 557812=9. The EIA approves the use of the name NEMS to describe only an AEO version of the model without any modification to code or data. Because the present analysis entails some minor code modifications and runs the model under various policy scenarios that deviate from AEO assumptions, the name NEMS-BT refers to the model as used here. (“BT” stands for DOE's Building Technologies Program.) For more information on NEMS, refer to The National Energy Modeling System: An Overview, DOE/EIA-0581 (98) (Feb. 1998)(available at: http://tonto.eia.doe.gov/ FTPROOT/forecasting/058198.pdf)., 339858=For the October 2008 NOPR, DOE made the preliminary determination that the standards for top-loading and front-loading CCWs listed in Table II.1 are technologically feasible and economically justified, and invited comment on these proposed standard levels., 300369=Alliance and GE commented that the top-loading standard proposed in the October 2008 NOPR would have a detrimental impact on the CCW industry and labor force. (Alliance, Public Meeting Transcript, No. 40.5 at pp. 23-24; Alliance, No. 45 at Attachment 2, p. 3; GE, Public Meeting Transcript, No. 40.5 at pp. 31-32) Furthermore, Alliance stated that no manufacturer will be willing to use an unproven non-traditional design in the commercial market, resulting in the elimination of top-loading CCW production. With manufacturers like Alliance exiting the business, over 1,000 jobs would be lost. Alliance also stated that there could be spillover harm because Alliance could also exit other laundry market segments. (Alliance, No. 45 at Attachment 2, p. 17), 571654=37. The 2006 Current Industry Report is available online at: http://www.census.gov/cir/www/alpha.html., 370179=To quantitatively assess the impacts of energy conservation standards on CCW manufacturing employment, DOE used the GRIM to estimate the domestic labor expenditures and number of employees in the base case and at each TSL from 2009 through 2043 for the CCW industry. DOE used statistical data from the U.S. Census Bureau's 2006 Annual Survey of Manufactures [36] (2006 ASM) and 2006 Current Industry Report [37] (2006 CIR), the results of the engineering analysis, and interviews with manufacturers to estimate the inputs necessary to calculate industry-wide labor expenditures and domestic employment levels. Labor expenditures are a function of the labor intensity of the equipment, the sales volume, and an implicit assumption that wages remain fixed in real terms over time. DOE notes that the MIA's analysis detailing impacts on employment focuses specifically on the production workers manufacturing the covered products or equipment, rather than a manufacturer's broader operations. Thus, the estimated number of impacted employees in the MIA is separate and distinct from the total number of employees used to determine whether a manufacturer is a small business for purposes of analysis under the Regulatory Flexibility Act., 519185=The Regulatory Flexibility Act (5 U.S.C. 601 et seq.) requires preparation of an initial regulatory flexibility analysis for any rule that by law must be proposed for public comment, unless the agency certifies that the rule, if promulgated, will not have a significant economic impact on a substantial number of small entities. As required by Executive Order 13272, Proper Consideration of Small Entities in Agency Rulemaking, 67 FR 53461 (Aug. 16, 2002), DOE published procedures and policies on February 19, 2003, to ensure that the potential impacts of its rules on small entities are properly considered during the rulemaking process. 68 FR 7990. DOE has made its procedures and policies available on the Office of General Counsel's Web site: http://www.gc.doe.gov., 145576=DOE expects to issue a final rule in this rulemaking no later than January 1, 2010, as required by EPCA, as amended by EPACT 2005 (42 U.S.C. 6313(e)). Based on this schedule, the estimated effective date of any amended energy conservation standards for this equipment would be January 1, 2013, 3 years after the final rule is published in the Federal Register., 538362=On December 16, 2004, the OMB, in consultation with the Office of Science and Technology, issued its Final Information Quality Bulletin for Peer Review (the Bulletin). 70 FR 2664 (Jan. 14, 2005). The purpose of the Bulletin is to enhance the quality and credibility of the Government's scientific information. The Bulletin establishes that certain scientific information shall be peer reviewed by qualified specialists before it is disseminated by the Federal Government. As indicated in the October 2008 NOPR, this includes influential scientific information related to agency regulatory actions, such as the analyses in this rulemaking. 73 FR 62034, 62132 (Oct. 17, 2008)., 219728=DOE estimated commercial electricity prices for each of the 13 geographic areas based on data from EIA Form 861, Annual Electric Power Industry Report. [21] DOE calculated an average commercial electricity price by first estimating an average commercial price for each utility, and then calculated a regional average price by weighting each utility with customers in a region by the number of commercial customers served in that region. The calculations for today's SNOPR used the most recent available data from 2007., 524033=DOE stated in the October 2008 NOPR that this rulemaking would impose no new information and recordkeeping requirements, and that OMB clearance is not required under the Paperwork Reduction Act (44 U.S.C. 3501 et seq.). 73 FR 62034, 62130 (Oct. 17, 2008). DOE received no comments on this in response to the October 2008 NOPR. Therefore, for today's supplemental notice DOE has concluded that Office of Management and Budget clearance is not required under the PRA., 336245=In response, DOE incorporated current trends in its analysis, but expressly did not include possible future legislation in this rulemaking. The current NEMS-BT model used in projecting the environmental impacts includes the CAIR rule, as described above, which is projected to reduce SO 2 and NO X emissions. NEMS-BT also takes into account the current set of State-level renewable portfolio standards, the effect of the RGGI, and utility investor reactions to the possibility of future CO 2 cap and trade programs, all of which impact electricity prices and reduce the projected carbon intensity of generation. The most recent Reference Case, AEO 2009, is available at http://www.eia.doe.gov/oiaf/servicerpt/stimulus/index.html, and documentation of the AEO 2009 assumptions is available at http://www.eia.doe.gov/oiaf/aeo/assumption/index.html., 488619=The October 2008 NOPR evaluated the market failure that the proposed rule would address. 73 FR 62034, 62122-23 (Oct. 17, 2008). DOE's analysis for CCWs explicitly quantifies and accounts for the percentage of consumers that already purchase more efficient equipment and takes these consumers into account when determining the national energy savings associated with various TSLs. The analysis suggests that accounting for the market value of energy savings alone (i.e., excluding any possible additional “externality” benefits such as those noted below) would produce enough benefits to yield net benefits across a wide array of equipment and circumstances. In the October 2008 NOPR, DOE requested additional data (including the percentage of consumers purchasing more efficient CCWs and the extent to which consumers will continue to purchase more efficient equipment), in order to test the existence and extent of these consumer actions. 73 FR 62034, 62123 (Oct. 17, 2008). DOE received no such data from interested parties in response to the October 2008 NOPR., 544855=DOE will accept comments, data, and information regarding the proposed rule before or after the public meeting, but no later than the date provided at the beginning of this SNOPR. Information submitted should be identified by docket number EE-2006-STD-0127 and/or RIN 1904-AB93. Comments, data, and information submitted to DOE's e-mail address for this rulemaking should be provided in WordPerfect, Microsoft Word, PDF, or text (ASCII) file format. Interested parties should avoid the use of special characters or any form of encryption and, wherever possible, comments should carry the electronic signature of the author. Comments, data, and information submitted to DOE via mail or hand delivery/courier should include one signed original paper copy. No telefacsimiles (faxes) will be accepted., 324043=NEMS-BT is run similarly to the AEO 2009 April Release NEMS, except that CCW energy use is reduced by the amount of energy saved (by fuel type) due to the TSLs. The inputs of national energy savings come from the NIA analysis. For the EA, the output is the forecasted physical emissions. The net benefit of a standard is the difference between emissions estimated by NEMS-BT and the AEO 2009 April Release Reference Case. The NEMS-BT tracks CO 2 emissions using a detailed module that provides results with broad coverage of all sectors and inclusion of interactive effects., 217792=To calculate the equipment prices faced by CCW purchasers, DOE multiplied the manufacturing costs developed from the engineering analysis by the supply chain markups it developed (along with sales taxes). DOE used the same supply chain markups for today's SNOPR that were developed for the October 2008 NOPR. See chapter 7 of the TSD accompanying this notice for additional information. To calculate the final installed prices, DOE added installation cost to the equipment prices., 565860=25. U.S. Department of Energy, Technical Support Document: Energy Efficiency Standards for Consumer Products: Residential Central Air Conditioners and Heat Pumps (May 2002) chapter 5. This document is available at: http://www.eere.energy.gov/buildings/appliance_standards/residential/ac_central_1000_r.html., 92639=3. Postal Mail: Ms. Brenda Edwards, U.S. Department of Energy, Building Technologies Program, Mailstop EE-2J, 1000 Independence Avenue, SW., Washington, DC 20585-0121. Please submit one signed original paper copy., 204385=As described in the October 2008 NOPR, DOE found that a low-volume manufacturer (LVM) operates in both the residential and CCW markets. DOE considers this manufacturer to be low-volume because its annual shipments in the combined RCW and CCW market are significantly lower than those of its larger competitors. However, unlike its larger rivals, most of the LVM's unit shipments are in the CCW market, where the LVM has significant market share. Also unlike its diversified competitors, this company exclusively manufactures laundry equipment. A review of the Securities and Exchange Commission (SEC) 10-K documents filed by the LVM revealed that, as of 2005, this company derived 22 percent of its total revenue from the sale of front- and top-loading clothes washers and 87 percent of that income was from the commercial market. [14] As a result, the LVM could be affected disproportionately by any rulemaking concerning CCWs compared to its competitors, for whom CCWs represent less than 2 percent of total clothes washer sales. Alliance stated that it is the LVM and that it has neither the purchasing power nor the funding to support wide-ranging research and development programs like those of its larger, more diverse rivals. (Alliance, No. 45 at Attachment 2, p. 8) As a result, the manufacturing costs for Alliance are inherently higher compared to those of its rivals. Alliance believes that the cost of compliance with the top-loading CCW standard proposed in the October 2008 NOPR would be especially high if Alliance were required to introduce non-traditional agitator designs to meet it. (Alliance, Public Meeting Transcript, No. 40.5 at p. 23 and p. 202) DOE research suggests that this efficiency level for vertical-axis clothes washers can be met with conventional, non-proprietary technology that is on the market today. Since the October 17, 2008 NOPR meeting, DOE has received no further comments on the manufacturing cost curves. Thus, for today's SNOPR, DOE has retained all cost estimates presented in the October 2008 NOPR at the retained efficiency levels, though each value was scaled by the Producer Price Index (PPI) multiplier for the commercial laundry equipment industry (NAICS 333312), 506134=For CCWs, DOE estimated that consumer tax credits would induce an increase of 1.3 percent in 2013 in the purchase of equipment meeting TSL 3 and eventually increase to a maximum of 5.8 percent in 2020 for both top-loading and front-loading washers. [46] At the estimated participation rates, consumer tax credits would be expected to provide 0.01 quads of national energy savings, 13 billion gallons of national water savings, and an NPV of $0.03 billion (at a 7-percent discount rate)., 231459=The compliance date is the future date when parties subject to the requirements of a new standard must begin compliance. For the October 2008 NOPR, DOE assumed that any new energy efficiency standards adopted in this rulemaking would require compliance in March 2012, 3 years after the final rule was expected to be published in the Federal Register. For today's SNOPR, DOE expects that the final rule will be published by January 1, 2010, as required by EPACT 2005, with compliance with new standards required by January 1, 2013. DOE calculated the LCC for the appliance consumers as if they would purchase new equipment in the year after the standard takes effect., 570673=34. 70 FR 25162 (May 12, 2005)., 149334=DOE published a list of evaluated CCW technologies in the November 2007 ANOPR. 72 FR 64432, 64458 (Nov. 15, 2007). For the reasons described in the November 2007 ANOPR and in chapter 4 of the SNOPR TSD, DOE is not considering the following design options, as they do not meet one or more of the screening criteria: bubble action, electrolytic disassociation of water, ozonated laundering, reduced thermal mass, suds saving, and ultrasonic washing. In this supplemental notice, DOE has not screened out any additional technology options that were retained in the October 2008 NOPR analyses. No comments were received objecting to the technology options which were screened out in the October 2008 NOPR. 73 FR 62034, 62052 (Oct. 17, 2008)., 174676=Alliance, GE, Whirlpool Corporation (Whirlpool), and AHAM supported the two equipment classes as proposed in the October 2008 NOPR. (Alliance, Public Meeting Transcript, No. 40.5 at p. 22; Alliance, No. 45 at p. 1; GE, Public Meeting Transcript, No. 40.5 at p. 31; GE, No. 48 at p. 4; Whirlpool, Public Meeting Transcript, No. 40.5 at p. 28; Whirlpool, No. 50 at pp. 2-3, AHAM, Public Meeting Transcript, No. 40.5 at p. 26; AHAM, No. 47 at p. 4), 309198=The Joint Comment bases its analysis on manufacturers completely shifting production to front-loading washers. However, DOE believes that it is unlikely all manufacturers would shift production to exclusively front-loading washers in response to the Federal production tax credits or the energy conservation standards proposed in today's rule. As discussed in section III.E, in response to the Federal production tax credit, DOE estimates that the tax credits would permanently transform the market so that front-loading washers would continue to comprise 30 percent of the market over the entire forecast period. This shift towards front-loading washers has mitigating effects on the impacts on manufacturers due to energy conservation standards. However, the shift is not great enough to significantly decrease the impacts as the Joint Comment suggests. Using the same assumptions used for calculations found in appendix 13A, DOE estimates that the LVM increased the production of front-loading washers by approximately 10,000 washers in 2007 and 2008. Though the estimates show that there were significant increases in front-loading shipments for the LVM in 2007 and 2008, shipments for fiscal year 2009 are projected to decrease and hence reduce the Federal production tax credits., 395139=DOE carefully considered the determination received from DOJ in response to the October 2008 NOPR, and accordingly chose efficiency levels for this SNOPR that appear achievable by all CCW manufacturers using existing equipment platforms and technologies. As such, there should be minimal impact on the CCW market and hence its manufacturers. To assist the Attorney General in making a determination for this SNOPR, DOE has provided DOJ with copies of this notice and the TSD for review. DOE will consider DOJ's comments on today's SNOPR in preparing the final rule., 203868=In the October 2008 NOPR, DOE presented manufacturing cost estimates based on the November 2007 ANOPR analysis, revised in response to detailed CCW manufacturer feedback obtained at the NOPR stage for equipment at each efficiency level. 73 FR 62034, 62055-62056 (Oct. 17, 2008). These manufacturing costs were the basis of inputs for a number of other analyses in this rulemaking, including the LCC, national impact, and GRIM analyses., 109585=DOE's analyses indicate that the energy savings resulting from today's proposed standards would have benefits to utilities and to the environment. The energy saved is in the form of electricity and natural gas, and DOE expects the energy savings from today's proposed standards to eliminate the need for approximately 18 megawatts (MW) of generating capacity by 2043. This result reflects DOE's use of energy price projections from the U.S. Energy Information Administration (EIA)'s April 2009 release of the Annual Energy Outlook 2009 (AEO 2009) reflecting provisions of the American Recovery and Reinvestment Act of 2009 (ARRA 2009; Pub. L. 111-5). DOE intends to use the most recently available version of EIA's AEO to generate the results for the final rule., 297572=EPCA directs DOE to consider any lessening of competition that is likely to result from standards. It directs the Attorney General to determine the impact, if any, of any lessening of competition likely to result from a proposed standard and to transmit such determination to the Secretary, not later than 60 days after the publication of a proposed rule, together with an analysis of the nature and extent of such impact. (42 U.S.C. 6295(o)(2)(B)(i)(V) and (B)(ii)). DOE received a response from the Acting Assistant Attorney General on December 16, 2008. The letter stated that the Department of Justice (DOJ) is not in a position to judge whether CCW manufacturers will be able to meet the standards proposed in the October 2008 NOPR. Nevertheless, DOJ found a “real risk that one or more of these manufacturers cannot meet the proposed standard” for top-loading CCWs published in the October 2008 NOPR. (Attorney General, No. 53 at p. 2), 108198=The cumulative national net present value (NPV) of total consumer costs and savings of today's proposed standards from 2013 to 2043, in 2008 dollars (2008$), ranges from $0.4 billion (7-percent discount rate) to $0.9 billion (3-percent discount rate). This is the estimated total value of future operating-cost savings minus the estimated increased equipment costs, discounted to the present year (2009). DOE estimates the CCW industry net present value (INPV) to be approximately $62 million in 2008$. If DOE adopts today's proposed standards, manufacturers expect a decline of between 7.8 percent and 11.4 percent of the INPV, which is approximately $5 to $7 million. However, the NPV for consumers (at the 7-percent discount rate) would exceed industry losses due to energy efficiency standards by at least 80 times., 305157=According to the Joint Comment, the Federal production tax credit could be used by the industry to offset the conversion costs necessary to comply with the energy conservation standards proposed in the October 2008 NOPR. (Joint Comment, No. 44 at p. 7) In its analysis, the Joint Comment does not account for any conversion costs associated with a complete production transfer of top-load to front-load washers. The equipment conversion and capital conversion cost shown in the GRIM and chapter 13 take all existing front-loading washers into consideration, including those that qualify for the Federal production tax credit. In its calculation of the equipment and capital conversion costs, DOE considered that the LVM already had qualifying washers at both 2.0 MEF/6.0 WF and 2.2 MEF/4.5 WF levels; hence, no additional product development appeared necessary to achieve these efficiency levels. Therefore, DOE did not include any capital or product conversion costs in the GRIM for the LVM at a 2.0 MEF level. However, DOE research suggested that the LVM would have some capital conversion costs if the front-loading efficiency level were raised to 2.2 MEF, because the production levels of such washers would have to dramatically increase from present shipment levels., 111579=The benefits and costs of today's proposed standards can also be expressed in terms of annualized (2008$) values from 2013-2043. Estimates of annualized values are shown in Table I.2. The annualized monetary values are the sum of the annualized national economic value of operating savings benefits (energy, maintenance and repair), expressed in 2008$, plus the monetary values of the benefits of carbon dioxide emission reductions, otherwise known as the Social Cost of Carbon (SCC) expressed as $19 per metric ton of carbon dioxide, in 2007$. The $19 value is a central interim value from a recent interagency process. Although this $19 value represents emissions that are valued in 2007$, the monetary benefits of cumulative emissions reductions are reported in 2008$ so that they can be compared with the other costs and benefits in the same dollar units. The derivation of this value is discussed in section V.B.6. Although summing the value of operating savings to the values of CO 2 reductions provides a valuable perspective, please note the following: 1) the national operating savings are domestic U.S. consumer monetary savings found in market transactions while the CO 2 value is based on a range of estimates of imputed marginal social cost of carbon from $5 to $55 per metric ton (2007$), which are meant to reflect the global benefits of carbon dioxide reductions; and 2) the assessments of operating savings and CO 2 savings are performed with different computer models, leading to different time frames for analysis. The present value of national operating savings is measured for the period 2013-2065 (31 years from 2013 to 2043 inclusive, plus the lifetime of the longest-lived equipment shipped in the 31st year), then converted the annualized equivalent for the 31 years. The value of CO 2, on the other hand is meant to reflect the present value of all future climate related impacts, even those beyond 2065., 528372=With respect to the review of existing regulations and the promulgation of new regulations, section 3(a) of Executive Order 12988, “Civil Justice Reform” (61 FR 4729 (Feb. 7, 1996)) imposes on Federal agencies the general duty to adhere to the following requirements: (1) Eliminate drafting errors and ambiguity; (2) write regulations to minimize litigation; and (3) provide a clear legal standard for affected conduct rather than a general standard and promote simplification and burden reduction. Section 3(b) of Executive Order 12988 specifically requires that Executive agencies make every reasonable effort to ensure that the regulation: (1) Clearly specifies the preemptive effect, if any; (2) clearly specifies any effect on existing Federal law or regulation; (3) provides a clear legal standard for affected conduct while promoting simplification and burden reduction; (4) specifies the retroactive effect, if any; (5) adequately defines key terms; and (6) addresses other important issues affecting clarity and general draftsmanship under any guidelines issued by the Attorney General. Section 3(c) of Executive Order 12988 requires Executive agencies to review regulations in light of applicable standards in section 3(a) and section 3(b) to determine whether they are met or it is unreasonable to meet one or more of them. DOE has completed the required review and determined that, to the extent permitted by law, today's supplemental notice meets the relevant standards of Executive Order 12988., 297031=MLA commented that the top-loading CCW standard proposed in the October 2008 NOPR would most likely result in the elimination of all but one manufacturer of top-loading CCWs (Whirlpool) as well as the elimination of many route operators due to higher equipment costs resulting from reduced competition. (MLA, No. 49 at pp. 1-3) Finally, EEI suggested that DOE create a standard that will save energy and be market neutral, such that multiple manufacturers could meet it. (EEI, No. 56 at pp. 2-3), 193847=Thus, for today's SNOPR, DOE has proposed revised top-loading CCW efficiency levels shown in Table III.2, in which the max-tech top-loading level is now efficiency level 2 (1.60 MEF/8.5 WF). No changes have been made to the efficiency levels proposed in the October 2008 NOPR for front-loading CCWs in today's supplemental notice., 138360=On December 4, 2006, DOE posted two spreadsheet tools for this rulemaking on its Web site. [6] The first tool calculates LCC and payback periods (PBPs) and included spreadsheets for: (1) Dishwashers; (2) dehumidifiers; (3) cooktops; (4) ovens; (5) microwave ovens; and (6) CCWs. The second tool—the national impact analysis (NIA) spreadsheets—calculate the impacts on shipments and the national energy savings (NES) and NPV at various candidate standard levels for: (1) Dishwashers; (2) dehumidifiers; (3) cooktops and ovens; (4) microwave ovens; and (5) CCWs., 346613=DOE analyzed the benefits and burdens of a number of TSLs for the CCWs that are the subject of today's supplemental proposed rule. As discussed in section IV.A, for the October 2008 NOPR, DOE based the TSLs on efficiency levels explored in the November 2007 ANOPR, and selected the TSLs on consideration of economic factors and current market conditions. As also discussed previously in section III.C.1.a, DOE eliminated the maximum technologically efficiency level of 1.76 MEF/8.3 WF for the top-loading equipment class. Accordingly, for today's supplemental proposed rule, DOE modified the TSLs it considered for the October 2008 NOPR., 258883=To determine new construction shipments, DOE used a forecast of new housing coupled with equipment market saturation data for new housing. For new housing completions and mobile home placements, DOE adopted the projections from EIA's AEO 2008 through 2030 for the October 2008 NOPR. For today's SNOPR, DOE used the projections from EIA's AEO 2009 April Release Reference Case. For CCWs, DOE relied on new construction market saturation data from the above-mentioned CEE report., 303757=For the October 2008 NOPR, DOE did not fully account for the impacts of the Federal production tax credits updated by The Energy Improvement and Extension Act of 2008 (Pub. L. 110-343; EIEA 2008). However, DOE research suggests that the Joint Comment overstates the potential benefits that CCW manufacturers would accumulate through the tax credits found in EIEA 2008. A key assumption in the Joint Comment analysis is that all major CCW manufacturers indentified for this rulemaking would be able to benefit from the tax credit (Joint Comment, No. 44 at pp. 8-9). According to the title III, section 305 (b)(2) from EIEA 2008, and title I section 1334 (c)(1)(B) from EPACT 2005, the tax credit is only awarded for equipment produced in the United States. Using market research and interviews with manufacturers, DOE believes that only the LVM produces qualifying CCWs. Other manufacturers offer washers that meet the MEFs and WF requirements, but these washers are either made outside the United States or are sourced from other domestic manufacturers, or are not sold in the commercial market. See appendix 13C of the SNOPR TSD for further discussion of the Federal production tax credit., 345402=In considering standards for today's supplemental notice, DOE first notes that it has retained separate equipment classes for top-loading and front-loading CCWs, for reasons discussed in section III.A. For top-loading CCW standards, DOE has revised its analysis due to a re-evaluation of the max-tech efficiency level, which resulted in the max-tech level from the October 2008 NOPR being eliminated from consideration as an efficiency level for today's supplemental notice (see section III.C.1.a.) DOE did not change the engineering analysis for front-loading CCWs from those presented in the October 2008 NOPR. DOE has thus evaluated standards for both equipment classes, including impacts to the consumer, manufacturer, and Nation, based on the analyses outlined in section III, and presents the approach and results for proposed standard levels for today's SNOPR in section V., 567534=28. The National Academies, Board on Energy and Environmental Systems, Letter to Dr. John Mizroch, Acting Assistant Secretary, U.S. DOE, Office of EERE from James W. Dally, Chair, Committee on Point-of-Use and Full-Fuel-Cycle Measurement Approaches to Energy Efficiency Standards, May 15, 2009., 539789=DOE will hold a public meeting on November 16, 2009 from 9 a.m. until 5 p.m., in Washington, DC. The public meeting will be held at Room 1E-245. To attend the public meeting, please notify Ms. Brenda Edwards at (202) 586-2945 or Brenda.Edwards@ee.doe.gov. As explained in the ADDRESSES section, foreign nationals visiting DOE Headquarters are subject to advance security screening procedures. Any foreign national wishing to participate in the meeting should advise DOE of this fact as soon as possible by contacting Ms. Brenda Edwards to initiate the necessary procedures., 229508=To establish discount rates for CCWs for the October 2008 NOPR and today's SNOPR, DOE estimated the cost of capital of publicly traded firms in the sectors that purchase CCWs as the weighted average of the cost of equity financing and the cost of debt financing. DOE identified the following sectors purchasing CCWs: (1) Educational services; (2) hotels; (3) real estate investment trusts; and (4) personal services. DOE estimated the weighted-average cost of capital (WACC) using the respective shares of equity and debt financing for each sector that purchases CCWs. It calculated the real WACC by adjusting the cost of capital by the expected rate of inflation. To obtain an average discount rate value, DOE used additional data on the number of CCWs in use in various sectors. DOE estimated the average discount rate for companies that purchase CCWs at 5.7 percent. DOE received comment on the discount rates from Alliance, who suggested that the discount rates used in LCC and PBP analyses should be updated to reflect current financial market conditions. (Alliance, Public Meeting Transcript, No. 40.5 at pp. 115-116) DOE used the most recent available data (from 2006) from Damodaran Online and Ibbotson Associates to estimate its discount rates for CCWs. Damodaran Online is a widely used source of information about company debt and equity financing for most types of firms. Ibbotson Associates is a leading authority on asset allocation with expertise in capital market expectations and portfolio implementation. DOE believes that the data it used are representative of conditions that may apply when the first purchases impacted by standards would be made. Therefore, DOE continued to use these sources for today's SNOPR and will determine if the data used from both sources needs to be updated for the final rule., 568013=29. An analytical tool equivalent to EIA's NEMS would be needed to properly account for embedded energy impacts on a national scale, including the embedded energy due to water and wastewater savings. This new version of NEMS would need to analyze spending and energy use in dozens, if not hundreds, of economic sectors. This version of NEMS also would need to account for shifts in spending in these various sectors to account for the marginal embedded energy differences among these sectors. 72 FR 64432, 64498-99 (Nov. 15, 2007). DOE does not have access to such a tool or other means to accurately estimate the source energy savings impacts of decreased water or wastewater consumption and expenditures., 381822=The LVM indicated that it could not manufacture top-loading CCWs above an MEF of 1.42 (TSL 1). If DOE sets a standard above TSL 1, the LVM would be forced to design a new top-loading washer, offer only front-loading washers, or choose to exit the CCW market altogether. Due to its small size, the investment required for the LVM to design a more efficient top-loading washer would put the company at a competitive disadvantage. If the LVM no longer were to offer a top-loading washer and would have to expand its front-loading production lines, it would likely cease CCW production altogether, resulting in significant impacts to the industry. Currently, the LVM's top-loading washers account for 70 percent of its CCW shipments. Shifting all top-loading CCWs to front-loading washers at current production volumes would require substantial investments that the company may not be able to justify. In addition, the LVM historically derived over 85 percent of its total clothes washer revenue from CCWs, so its sales in the RCW market would be too low to justify continuing any top-loading clothes washer manufacturing. While the LVM currently manufactures a front-loading clothes washer, it does so at a cost disadvantage compared to its competitors. The potential investment and risk required to develop a cost-competitive clothes washer that deviates significantly from its traditional top-loader agitator design could be too great for the LVM's current owners. The LVM could decide to exit the market rather than take this risk, which could cause employment impacts in the CCW industry. As stated in section III.G, DOE reevaluated the CCW energy conservation standards proposed in the October 2008 NOPR in response to comments received from interested parties. DOE believes that the energy conservation standards proposed in today' supplemental notice greatly lessens the potential disadvantages faced by the LVM. Further details of the separate analysis of the impacts on the LVM are found in chapter 13 of the TSD accompanying this supplemental notice., 154856=In sum, Table II.3 lists the max-tech levels that DOE is proposing for today's SNOPR. Today's proposed front-loading max-tech level is the same as in the October 2008 NOPR, whereas today's proposed top-loading max-tech level has been revised based on the independent test results., 407260=In the October 2008 NOPR, DOE proposed accounting for the monetary value of CO 2 emission reductions associated with standards. DOE proposed to use the range $0 to $20 per ton for reductions in the year 2007 in 2007$. 73 FR 62034, 62110 (Oct. 17, 2008). These estimates were intended to represent the lower and upper bounds of the costs and benefits likely to be experienced in the United States. The lower bound was based on an assumption of no benefit and the upper bound was based on an estimate of the mean value of worldwide impacts due to climate change that was reported by the Intergovernmental Panel on Climate Change (IPCC) in its “Fourth Assessment Report.”, 137261=To initiate the current rulemaking to consider energy conservation standards, on March 15, 2006, DOE published on its Web site a document titled, Rulemaking Framework for Commercial Clothes Washers and Residential Dishwashers, Dehumidifiers, and Cooking Products (Framework Document). [5] 71 FR 15059 (March 27, 2006). The Framework Document described the procedural and analytical approaches that DOE anticipated using to evaluate energy conservation standards for these products, and identified various issues to be resolved in conducting the rulemaking. DOE held a public meeting on April 27, 2006, to present the Framework Document, to describe the analyses it planned to conduct during the rulemaking, to receive comments from interested parties, and to inform and facilitate interested parties' involvement in the rulemaking. DOE received 11 written comments in response to the Framework Document after the public meeting., 103853=J. Review Under the Treasury and General Government Appropriations Act, 2001, 189543=GE responded in its written comments that there was indeed a transposition error, which led to the inconsistencies noted by Alliance. GE stated that the equipment label indicated an energy rating of 472 kWh per year, equaling 1.204 kWh per cycle, meaning that consumers were getting a more efficient product than the energy rating contained on the label. GE stated that it takes any labeling error very seriously, and corrected the issue immediately upon its discovery. (GE, No. 48 at pp. 4-5). DOE review of present and past ENERGY STAR databases for CCWs failed to find an entry for the WNRD2050G. Based on market research and the CEC addition of the unit in December 2007, it appears that the WNRD2050G was released into production in December 2007. Thus, because the model's stated WF (8.3) was above the cutoff for ENERGY STAR eligibility (8.0) at that time, DOE concludes that the WNRD2050G was never listed in the ENERGY STAR database for CCWs., 404291=On February 8, 2008, the D.C. Circuit issued its decision in New Jersey v. Environmental Protection Agency to vacate CAMR. 517 F.3d 574 (D.C. Cir. 2008). In light of this development and because the NEMS-BT model could not be used to directly calculate Hg emissions reductions, DOE used the Hg emission rates discussed below to calculate emissions reductions in the October 2008 NOPR. This same methodology is used for today's SNOPR as well due to the continued fluid environment “* * * with many States planning to enact new laws or make existing laws more stringent.” EIA AEO 2009 (March 2009), p. 18. The NEMS-BT has only rough estimates of Hg emissions, and it was felt that the range of emissions used in the NOPR remain appropriate given these circumstances., 206788=between 2007 and 2008to update the costs in the October 2008 NOPR to 2008$. [15] These are shown in Table III.3., 507153=Manufacturer Tax Credits. Manufacturer tax credits are considered a viable non-regulatory market transformation program as evidenced by the inclusion of Federal tax credits in EPACT 2005 for manufacturers of residential appliances. (Section 1334 of EPACT 2005; codified at 26 U.S.C. 45M) Similar to consumer tax credits, manufacturer tax credits would effectively result in lower equipment prices to consumers by an amount that covered part of the incremental price difference between equipment meeting baseline efficiency levels and those meeting higher efficiency levels. Because these tax credits go to manufacturers instead of consumers, research indicates that fewer consumers would be affected by a manufacturer tax credit program than by consumer tax credits. [47] [48] Although consumers would benefit from price reductions passed through to them by the manufacturers, research demonstrates that approximately half the consumers who would benefit from a consumer tax credit program would be aware of the economic benefits of more efficient technologies included in an appliance manufacturer tax credit program. In other words, research estimates that half of the effect from a consumer tax credit program is due to publicly available information or promotions announcing the benefits of the program. This effect, referred to as the “announcement effect,” is not part of a manufacturer tax credit program. Therefore, DOE estimated that the effect of a manufacturer tax credit program would be only half of the maximum impact of a consumer tax credit program., 172675=In the October 2008 NOPR, DOE proposed separate equipment classes and accompanying standards for top-loading and front-loading CCWs with separate standards for each class. 73 FR 62034, 62036 (Oct. 17, 2008). Thus the October 2008 NOPR represented a change from the November 2007 ANOPR and from EPACT 2005 [10] , which placed all CCWs into a single equipment class with a single energy efficiency and water efficiency standard. The October 2008 NOPR stated that DOE believes it has the authority to establish additional equipment classes within an equipment category, if warranted. DOE determined in the October 2008 NOPR that two equipment classes are warranted because an amended standard would set MEF for all CCWs at a level significantly higher than what the max-tech for top-loading machines can attain today, and effectively eliminate top-loading CCWs from the market. Id., 251148=The Joint Comment suggested that DOE update its equipment class market shares to reflect the impacts of the 2006 Federal tax incentives for CCWs. (Joint Comment, No. 44 at p. 5) The Joint Comment noted that the increased production of front-loading washers in the base-case would in turn lead to lower conversion costs for manufacturers and, therefore, make it less costly to meet higher CCW efficiency standards. For today's supplemental notice, DOE reviewed the SEC 10K report of the LVM of CCWs and determined that manufacturer tax credits in recent Federal legislation have resulted in significantly increased sales of the front-loading washers for the LVM. When accounting for the LVM's market share, the increase in front-loading sales results in a current market share of 30 percent for front-loading washers. Although tax credits are set to expire after 2010, DOE believes that the tax credits are impacting production costs and manufacturing infrastructure such that front-loading washers would continue to comprise 30 percent of the market over the entire forecast period., 263089=For the October 2008 NOPR, DOE incorporated a relative price elasticity change that resulted in a terminal value of approximately one-third of the short-run elasticity. In other words, DOE estimated that consumer purchase decisions, in time, become less sensitive to the initial change in the equipment's relative price. MLA commented that if the standards result in a substantial increase in the use of front-loading CCWs and a reduction or elimination in that of top-loading CCWs, consumers would see resulting price increases driven by higher purchase price and higher maintenance, service, and operating cost for front-loading CCWs compared to top-loaders. (MLA, No. 49 at pp. 3-4) In addition, ASAP questioned DOE's conclusion that standards more aggressive than the ones proposed in the October 2008 NOPR for front-loading CCWs could lead to significant recapture of the CCW market by top-loading machines. (ASAP, Public Meeting Transcript, No. 40.5 at pp. 34-35 and pp. 160-161) For its October 2008 NOPR as well as today's SNOPR, DOE estimated that price increases would lead to reductions in unit shipments for both top-loading and front-loading CCWs. DOE analyzed the impacts of increased purchase prices for each equipment class independently of the other. DOE was not able to estimate the cross price elasticity of demand between the two equipment classes to determine whether consumers would switch from one type of CCW to the other. But because the price impacts for more efficient top-loaders are higher than those for more efficient front-loaders, DOE estimated that top-loading CCW sales would decrease more rapidly than for front-loaders. As a result, DOE estimated that front-loading CCWs would gain an additional market share of only about 2 percent. In addition, DOE estimated that those consumers forgoing the purchase of new top-loading CCWs would instead purchase used top-loading CCWs with efficiencies equal to baseline top-loader levels. DOE received no additional comments on its analysis to estimate the combined effects of increases in equipment purchase price and decreases in operating costs on CCW shipments and, therefore, retained the approach for today's SNOPR., 90380=DOE will hold a public meeting on November 16, 2009, from 9 a.m. to 5 p.m., in Washington, DC. DOE must receive requests to speak at the public meeting and receive a signed original and an electronic copy of statements to be given at the public meeting before 4 p.m., November 13, 2009., 328071=In the October 2008 NOPR, however, DOE provided a different estimate of NO X reductions, because DOE assumed that the CAIR had been vacated. 74 FR 16920, 17009-14 (April 13, 2009). This is because the CAIR was vacated by the D.C. Circuit in its July 11, 2008 decision in North Carolina v. Environmental Protection Agency. 531 F.3d 896 (D.C. Cir. 2008). Thus, for the October 2008 NOPR, DOE established a range of NO X reductions based on low and high emissions rates (in kt of NO X emitted per terawatt-hour (TWh) of electricity generated) derived from the AEO 2008. DOE anticipated that, in the absence of the CAIR's trading program, the new or amended energy conservation standards would reduce NO X emissions nationwide, not just in 22 States., 536006=Section 515 of the Treasury and General Government Appropriations Act, 2001 (44 U.S.C. 3516 note) provides for agencies to review most disseminations of information to the public under guidelines established by each agency pursuant to general guidelines issued by OMB. The OMB guidelines were published at 67 FR 8452 (Feb. 22, 2002), and DOE's guidelines were published at 67 FR 62446 (Oct. 7, 2002). DOE has reviewed this notice under the OMB and DOE guidelines and has concluded that it is consistent with applicable policies in those guidelines., 363597=As discussed in section III.G of today's supplemental notice, DOE also considered the impact of Federal production tax credits on the CCW industry. DOE does not include the benefit of these tax credits in its results shown below. DOE includes these results in appendix 13C of the TSD. DOE estimated that the total benefit of these Federal production tax credits to the CCW industry from 2007 through 2010 would be approximately $4.1 million. Because DOE discounts the industry cash flows to the 2009 base year, in this scenario the base case INPV increases by approximately $400,000 if the benefit from the Federal production tax credits are included. As previously stated, although the base-case and standards-case INPV increase as a result of Federal production tax credits, the benefits do not significantly mitigate possible impacts due to standards. For additional information on the assumptions and calculations of Federal production tax credits for CCWs, see appendix 13C of the TSD., 572906=39. Consistent with Executive Order 12866, “Regulatory Planning and Review,” 58 FR 51735 (Oct. 4, 1993), DOE follows the guidance of OMB regarding methodologies and procedures for regulatory impact analysis that affect more than one agency. In reporting energy and environmental benefits from energy conservation standards, DOE will report both discounted and undiscounted (i.e., zero discount-rate) values., 178976=As noted above, in the October 2008 NOPR, DOE took the position that EPCA does not permit adoption of a standard that would eliminate top-loading CCWs because the method of loading is a “feature.” 73 FR 62034, 62049-50. Furthermore, in DOE's denial of the CEC's petition for waiver from Federal preemption (71 FR 78157 (December 28, 2006)) and the ensuing litigation, California Energy Commission v. DOE, Case. No. 07-71576 (9th Cir.), DOE took the position that it could not waive Federal preemption, in part because the proposed California regulation of residential clothes washer water usage would result in the unavailability of top-loading residential clothes washers in the California market, based on DOE's evaluation of the clothes washer market in 2006., 341153=GE opposed the top-loading standard proposed in the October 2008 NOPR due to small market size (1.3 percent) for coin-operated, top-loading CCWs and the potential 31-percent decrease in industry cash flows due to the proposed standards. GE commented that adoption of the standards would essentially regulate the top-loading equipment class out of the marketplace. GE also stated that the max-tech level for top-loading CCWs is not yet justified as being sustainable in the harsher consumer environment of laundromats, where units are subject to much tougher conditions such as overloading. GE agreed with Alliance's proposed standards for top-loaders of TSL 1 from the October 2008 NOPR (1.42 MEF/9.5 WF), which would also make the CCW WF consistent with the EISA 2007 standards for RCWs. (GE, Public Meeting Transcript, No. 40.5 at pp. 31-32; GE, No. 48 at pp. 4-5) MLA opposed the proposed October 2008 NOPR standard for top-loading CCWs, because there is currently no commercially acceptable top-loading CCW that can meet it. MLA believes the only way to comply with the top-loading CCW standard proposed in the October 2008 NOPR is to produce machines with poor washing and rinsing performance, high maintenance costs, and increased manufacturing costs. (MLA, No. 49 at pp.1 and 4), 284241=The increase in total annual installed cost is equal to the difference in the per-unit total installed cost between the base case and standards case, multiplied by the shipments forecasted in the standards case. The annual operating cost savings per unit includes changes in energy, water, repair, and maintenance costs. DOE forecasted energy prices for the October 2008 NOPR based on AEO 2008; it updated the forecasts for today's SNOPR using data from AEO 2009 April Release. For today's SNOPR, DOE maintained the accounting system it used to develop repair and maintenance costs for more efficient CCWs in the October 2008 NOPR., 107719=DOE estimates that the energy conservation standards proposed in today's SNOPR would save a significant amount of energy—an estimated 0.10 quadrillion British thermal units (Btu), or quads, of cumulative energy over 30 years (2013-2043). This amount is equivalent to 2 days of U.S. gasoline use. In addition, today's proposed standards for CCWs save over 143 billion gallons of cumulative water consumption over 30 years (2013-2043)., 269412=For its determination of each of the cases with alternative standard levels (“standards cases”), DOE used a “roll-up” scenario in the October 2008 NOPR to establish the SWEF for 2013. In a roll-up scenario, equipment efficiencies in the base case which do not meet the standard level under consideration are projected to roll-up to meet the new standard level. Further, all equipment efficiencies in the base case that are above the standard level under consideration are not affected by the standard. The same scenario is used for the forecasted standards-case efficiencies as for the base-case efficiencies, namely, that forecasted efficiencies remained at the 2013 efficiency level until the end of the forecast period, as DOE has no data to reasonably estimate how such efficiency levels might change over the next 30 years. By maintaining the same rate of increase for forecasted efficiencies in the standards case as in the base case (i.e., no change), DOE retained a constant efficiency difference between the two cases over the forecast period. Although the no-change trends may not reflect what would happen to base-case and standards-case equipment efficiencies in the future, DOE believes that maintaining a constant efficiency difference between the base case and standards case provides a reasonable estimate of the impact that standards have on equipment efficiency. It is more important to accurately estimate the efficiency difference between the standards case and base case, than to accurately estimate the actual equipment efficiencies in the standards and base cases. DOE retained the approach used in the October 2008 NOPR for today's SNOPR. But because the effective date of the standard is now assumed to be 2013, DOE applied the “roll-up” scenario in the year 2013 to establish the SWEF for each of the standards cases., 310529=The Joint Comment acknowledges but does not account for factors that would offset the benefits from the Federal production tax credit that would accrue to CCW manufacturers. In its LVM analysis for the October 2008 NOPR, DOE examined the capital costs that would be required to create a front-loading washer facility for 100,000 annual unit shipments. DOE estimated that a green-field facility with all production equipment would cost the LVM approximately $54 million. In that same analysis, DOE estimated that the total tooling required would cost approximately $18 million. If the LVM had to invest to exclusively offer front-loading washers, these investments would more than offset the benefit calculated in the Joint Comment for all CCW manufacturers. In fact, the tooling alone would more than eliminate the benefit calculated for the entire CCW industry in the Joint Comment. The Joint Comment states that the LVM is in a position to disproportionately benefit from the Federal production tax credit. (Joint Comment, No. 44 at p. 8) While DOE acknowledges that the LVM is the only manufacturer eligible to receive a Federal production tax credit in the CCW market, DOE research suggests that the LVM would not disproportionately benefit because the costs to upgrade its production facilities for higher-volume front-loading washer manufacturing, in addition to necessary redesigns of its existing front-loading washers, are estimated to be multiples of the tax credit. For further information, see appendix 13C of the SNOPR TSD. The Joint Comment also states that part of the Federal production tax credit will need to be shared with distributors and customers to stimulate growth. (Joint Comment, No. 44 at p. 9) However, the Joint Comment does not reduce the benefit to the CCW industry that would occur if manufacturers did not keep all of the tax credit., 272743=DOE retained the use of the base-case shipments to determine the annual energy consumption in the base case and the approach used in the October 2008 NOPR for today's SNOPR., 302946=DOE received comments on the likely benefits of Federal producer tax credits for which some CCW manufacturers could be eligible. Such credits accrue to manufacturers on the basis of appliance or equipment efficiencies as well as other eligibility requirements. The Joint Comment stated that DOE did not account for Federal production tax credits for efficient appliances produced after 2007 in the MIA and that the LVM is likely to disproportionately benefit from these Federal production tax incentives. According to the Joint Comment, the Federal production tax credits should substantially off-set conversion capital requirements and equipment conversion expenses, mitigating the financial impacts of higher efficiency levels. (Joint Comment, No. 44 at pp. 7-10), 295560=Alliance stated that it cannot justify the investment necessary to develop the technology required to reach the top-loading energy conservation standard proposed in the October 2008 NOPR. Alliance cited a lack of resources as the LVM to justify an investment in a “non-traditional” top-loader with unknown market acceptance (Alliance, No. 45 at Attachment 2, p. 8). Alliance stated that the top-loading standard proposed in the October 2008 NOPR would likely result in significant, detrimental impacts to the LVM, as Alliance does not have the resources for research and development, re-configuring production lines, or licensing the advanced technology required to meet the standard. (Alliance, Public Meeting Transcript, pp. 23-24) Alliance believes that a top-loading energy conservation standard set at 1.42 MEF/9.5 WF would lessen these impacts. Alliance suggested that the top-loading CCW energy conservation standard proposed in the October 2008 NOPR would force Alliance to cease production of CCWs due to the high investment costs required to design and manufacture the technology to meet the standard. (Alliance, Public Meeting Transcript, No. 40.5 at pp. 22-24 and p. 202; Alliance, No. 45 at Attachment 2, pp. 7-8) Alliance estimates these costs based on its belief that non-traditional technology will be required to meet the standard with wash performance that would be acceptable for commercial laundromat use., 493303=The above issues pertaining to asymmetric information and/or high transaction costs seem to be less relevant to the CCW market. For example, as discussed in section III.D.10, DOE concluded that a split incentive is unlikely between route operators and multi-family property owners. Because split incentives are likely not applicable to the CCW market, the probability that asymmetric information exists where one party (e.g., a route operator) has more and better information than the other (e.g., a multi-family property owner) is low. Further, because DOE received no data from interested parties in response to the October 2008 NOPR on the issue of asymmetric information and/or high transactions costs, DOE was unable to conclusively determine for today's supplemental notice the extent to which asymmetric information and/or high transaction costs are a market failure in the CCW market., 571248=36. The 2006 Annual Survey of Manufactures is available online at: http://www.census.gov/mcd/asmhome.html., 260536=Multiple interested parties commented on the shipment forecasts used by DOE in the October 2008 NOPR. Alliance agreed with the relatively flat shipment forecast. (Alliance, Public Meeting Transcript, No. 40.5 at p. 22; Alliance, No. 45 at p. 1) AHAM and Whirlpool stated that the October 2008 NOPR estimates of future shipments for CCWs were much more realistic than those used in the November 2007 ANOPR. (AHAM, Public Meeting Transcript, No. 40.5 at p. 27; AHAM, No. 47 at p. 4; Whirlpool, Public Meeting Transcript, No 40.5 at p. 28; Whirlpool, No. 50 at p. 3) The Joint Comment questioned DOE's forecast of reduced shipments for new and replacement CCWs, citing Alliance's SEC filing which projected “modest growth” in the installed base of commercial laundry equipment, estimated by Alliance to have grown at 0.9 percent annually since 1997. (Joint Comment, No. 44 at p. 5) DOE believes that the information it used to forecast CCW shipments for the October 2008 NOPR is more reliable than the limited information provided by the Joint Comment on one manufacturer's statement in a single SEC filing; thus DOE maintained the approach used in the October 2008 NOPR for today's SNOPR., 164041=In establishing classes of equipment, DOE considered whether the evaluated design options would likely lessen the utility or performance of CCWs. (42 U.S.C. 6295(o)(2)(B)(i)(IV)) In the October 2008 NOPR, DOE determined that none of the considered TSLs would reduce the utility or performance of the equipment under consideration in the rulemaking. Specifically, the standards proposed in the October 2008 NOPR would maintain the consumer utility of washing clothes in a washer with either top or front access. 73 FR 62034, 62047 (Oct. 17, 2008). This conclusion remains the same for the proposed standards in today's SNOPR. As in the October 2008 NOPR, the efficiency levels considered in today's SNOPR for both equipment classes require no changes in equipment design or unusual installation requirements that could reduce the utility or performance of CCWs., 191689=Accordingly, DOE is proposing (1.60 MEF/8.5 WF) for today's max-tech level. Originally included based upon the CEE's Tier 2 qualifying criteria for CCWs effective between January 1, 2004, and January 1, 2007, 1.6 MEF/8.5 WF is an efficiency level for which DOE had previously solicited feedback from interested parties and which is also very close to the tested results for the max-tech CCW. The max-tech model uses many standard top-loader components and materials; hence, DOE research suggests that no CCW manufacturer would suffer material harm since they all should be able to produce top-loading machines that meet the max-tech efficiency level without technical difficulty., 229078=For the October 2008 NOPR and today's SNOPR, DOE used a variety of sources to establish low, average, and high estimates for equipment lifetime. The average CCW lifetime was 11.3 years for multi-family applications, and 7.1 years in laundromat applications. DOE characterized CCW lifetimes with Weibull probability distributions., 94212=Mr. Stephen Witkowski, U.S. Department of Energy, Energy Efficiency and Renewable Energy, Building Technologies Program, EE-2J, 1000 Independence Avenue, SW., Washington, DC 20585-0121. Telephone: (202) 586-7463. E-mail: Stephen.Witkowski@ee.doe.gov., 103411=F. Review Under Executive Order 12988, 200937=DOE also received comments on whether the max-tech vertical-axis efficiency level could be achieved by multiple CCW models. Alliance stated that it would be unwise to set a standard close to the max-tech level, since it could eliminate all but the max-tech model from the market. (Alliance, No. 45 at Attachment 2, p. 13) Alliance believes a properly functioning top-loading CCW market requires a range of models to serve all users. (Alliance, No. 45 at Attachment 2, p. 13) DOE notes that the MEF/WF combination for vertical-axis CCWs proposed in the October 2008 NOPR as TSL 2 and currently proposed in today's SNOPR as the max-tech level is not based on either the stated or the tested max-tech vertical-axis unit. Rather, the combination of MEF and WF proposed is set at a level slightly below the measured max-tech values, and is a level for which DOE had previously collected manufacturing, capital expenditure, product development, and other costs. For today's supplemental notice, DOE revised the max-tech level to the values at TSL 2 proposed in the October 2008 NOPR—1.60 MEF/8.5 WF —based on its independent testing. Compared to the top-loading max-tech level and proposed standard of 1.76 MEF/8.3 WF published in the October 2008 NOPR, the revised level is slightly less stringent (see section III.C.1 for a complete discussion of this change) and may allow manufacturers to field units with higher tested efficiencies in the future. For example, the max-tech unit may be revised to achieve its stated efficiency level. DOE believes that this revision of the proposed max-tech level for today's SNOPR should help alleviate some manufacturers' concerns regarding the technological feasibility and commercial acceptance of a max-tech top-loading CCW., 250224=Table III.7 summarizes the approach and data DOE used to derive the inputs to the shipments analysis for the October 2008 NOPR, and the changes it made for today's SNOPR. The general approach for forecasting CCW shipments for today's SNOPR remains unchanged from the October 2008 NOPR. That is, all CCW shipments (for both equipment classes) were estimated for the new construction, replacement and non-replacement markets. DOE then allocated shipments to each of the two equipment classes based on the market share of each class. Based on data provided by AHAM for the November 2007 ANOPR, DOE estimated that top-loading washers comprise 80 percent of the market while front-loading washers comprise 20 percent. DOE estimated that the equipment class market shares would remain unchanged over the time period 2005-2042. A discussion of the inputs and the changes follows below., 340160=In response, Alliance stated that it would likely exit the clothes washer market if standards based on a single CCW equipment class were enacted, which would result in domestic job losses, a CCW market disruption, and/or loss of competition in the CCW market. (Alliance, No. 45 at Attachment 2, pp. 6-12) Alliance and GE urged DOE to consider TSL 1 from the October 2008 NOPR (1.42 MEF/9.5 WF) as the appropriate standard for top-loading CCWs. (Alliance, Public Meeting Transcript, No. 40.5 at pp. 23-24; GE No. 48 at p. 5) Alliance believes that TSL 1 would result in energy savings while being technically feasible and economically justified. Alliance also stated standards at TSL 1 would avoid or lessen harm to Alliance and, hence, reduce significant consumer impacts that would be associated with Alliance likely ceasing production. (Alliance, No. 45 at Attachment 2, p. 18), 136381=EPCA, as amended by EPACT 2005, prescribes energy conservation standards for CCWs manufactured on or after January 1, 2007. (42 U.S.C. 6313(e)) These standards require that CCWs have an MEF of at least 1.26 cubic feet of capacity (ft [3] ) per kilowatt-hour (kWh) and a WF of not more than 9.5 gallons of water (gal) per ft [3] . (Id.; 10 CFR 431.156), 274197=In response to a request from the DOE, Office of Energy Efficiency and Renewable Energy (EERE), the National Research Council (NRC) appointed a committee on “Point-of-Use and Full-Fuel-Cycle Measurement Approaches to Energy Efficiency Standards” to conduct a study called for in Section 1802 of EPACT 2005. [28] The fundamental task before the committee was to evaluate the methodology used for setting energy efficiency standards and to comment on whether site (point-of-use) or source (full-fuel-cycle) measures of energy efficiency better support rulemaking to achieve energy conservation goals. The NRC committee defined site (point-of-use) energy consumption as reflecting the use of electricity, natural gas, propane, and/or fuel oil by an appliance at the site where the appliance is operated, based on specified test procedures. Full-fuel-cycle energy consumption was defined as including, in addition to site energy use, the energy consumed in the extraction, processing, and transport of primary fuels such as coal, oil, and natural gas; energy losses in thermal combustion in power-generation plants; and energy losses in transmission and distribution to homes and commercial buildings., 312441=DOE received comment regarding its characterization of CCW manufacturers and the LVM in particular. The Joint Comment argued that DOE should not characterize Alliance as an LVM, as the LVM reported revenues equivalent to approximately half of the total CCW revenue and claims to be the leading manufacturer of stand-alone commercial laundry equipment in North America. (Joint Comment, No. 44 at p. 7) For the October 2008 NOPR, DOE presented a separate analysis of the LVM. 73 FR 62034, 62103-104 (Oct. 17, 2008). Although DOE agrees with the Joint Comment that the LVM has a significant share of the CCW industry based on revenues in reports filed with the SEC, DOE believes that the LVM does not have the same overall clothes washer manufacturing scale as its competitors (for both residential products and commercial equipment) and should be characterized as an LVM.}",
    "textBeforeTable": "The Energy Policy and Conservation Act [1] (EPCA), as amended, provides that any amended energy conservation standard DOE prescribes, including those for CCWs, shall be designed to “achieve the maximum improvement in energy efficiency * * * which the Secretary determines is technologically feasible and economically justified.” (42 U.S.C. 6295(o)(2)(A) and 6316(a)) Furthermore, any new or amended standard must “result in significant conservation of energy.” (42 U.S.C. 6295(o)(3)(B) and 6316(a)) In accordance with these and other statutory criteria discussed in this notice, DOE proposes in today's SNOPR to amend the energy conservation standards for CCWs and raise efficiency levels as shown in Table I.1. The standards would apply to all CCWs manufactured in, or imported into, the United States 3 years after the publication of the final rule in the Federal Register. I. Summary of the Proposed Rule Back to Top VIII. Approval of the Office of the Secretary E. Issues on Which DOE Seeks Comment D. Submission of Comments C. Conduct of Public Meeting B. Procedure for Submitting Requests to Speak A. Attendance at Public Meeting VII. Public Participation L. Review Under the Information Quality Bulletin for Peer Review K. Review Under Executive Order 13211 J. Review",
    "textAfterTable": "Units Year dollars Disc (in percent) Period covered *Per the above discussion, this represents a simplified estimate that includes both 2007$ and 2008$. Benefits             Annualized Monetized 60.6 54.9 66.6 2008 7 31 (millions$/year) 72.8 65.3 80.4 2008 3 31 Annualized Quantified 0.14 CO 2 (Mt) 0.14 CO 2 (Mt) 0.14 CO 2 (Mt) NA 7 31 0.087 NO X (kt) 0.087 NO X (kt) 0.087 NO X (kt) NA 7 31 0.001 Hg (t) 0.001 Hg (t) 0.001 Hg (t) NA 7 31 0.16 CO 2 (Mt) 0.16 CO 2 (Mt) 0.16 CO 2 (Mt) NA 3 31 0.094 NO X (kt) 0.094 NO X (kt) 0.094 NO X (kt) NA 3 31 0.001 Hg (t) 0.001 Hg (t) 0.001 Hg (t) NA 3 31 CO 2 Monetized Value (at $19/Metric Ton, millions$/year) 5.1 5.1 5.1 2008 7 31 5.9 5.9 5.9 2008 3 31 Total Monetary Benefits 65.7 59.9 71.6 2008 7 31 (millions$/year)* 78.7 71.2 86.3 2008 3 31",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}