{
    "relation": [
        [
            "#",
            "30",
            "31",
            "32",
            "33",
            "34",
            "35",
            "36",
            "37",
            "38",
            "39",
            "40",
            "41",
            "42",
            "43",
            "44",
            "45",
            "46",
            "47",
            "48",
            "49",
            "50",
            "51",
            "52",
            "53",
            "54",
            "55",
            "56",
            "57"
        ],
        [
            "Date",
            "May 2",
            "May 3",
            "May 4",
            "May 5",
            "May 6",
            "May 7",
            "May 8",
            "May 9",
            "May 10",
            "May 11",
            "May 12",
            "May 13",
            "May 14",
            "May 15",
            "May 16",
            "May 17",
            "May 18",
            "May 19",
            "May 20",
            "May 21",
            "May 23",
            "May 24",
            "May 25",
            "May 27",
            "May 28",
            "May 29",
            "May 30",
            "May 31"
        ],
        [
            "Opponent",
            "Cubs",
            "Cubs (FOX)",
            "Cubs (ESPN)",
            "@ Rockies",
            "@ Rockies",
            "@ Rockies",
            "@ Rockies",
            "@ Brewers",
            "@ Brewers",
            "@ Brewers",
            "@ Brewers",
            "Pirates",
            "Pirates",
            "Pirates",
            "Rays",
            "Rays",
            "Rays",
            "@ Padres",
            "@ Padres",
            "@ Padres",
            "@ Dodgers",
            "@ Dodgers",
            "@ Dodgers",
            "Astros",
            "Astros",
            "Astros",
            "Pirates",
            "Pirates"
        ],
        [
            "Score",
            "5 - 3 (11)",
            "9 - 3",
            "5 - 3",
            "6 - 5",
            "6 - 5",
            "4 - 3",
            "9 - 3",
            "4 - 3",
            "5 - 3",
            "5 - 3",
            "8 - 3",
            "8 - 4 (10)",
            "5 - 1",
            "11-5",
            "3 - 1",
            "9 - 8 (10)",
            "5 - 4",
            "8 - 2",
            "3 - 2",
            "11 - 3",
            "2 - 1",
            "4 - 0",
            "4 - 3 (10)",
            "8 - 2",
            "6 - 1",
            "3 - 2",
            "5 - 4",
            "14 - 4"
        ],
        [
            "Win",
            "Villone (1-0)",
            "Lilly (2-4)",
            "Wellemeyer (3-1)",
            "Flores (1-0)",
            "Looper (5-1)",
            "Speier (1-1)",
            "de la Rosa (1-1)",
            "Shouse (3-0)",
            "Springer (1-0)",
            "Suppan (2-2)",
            "Bush (1-4)",
            "Salas (1-0)",
            "Wellemeyer (4-1)",
            "Grabow (3-1)",
            "Sonnanstine (6-1)",
            "Franklin (2-1)",
            "Perez (1-0)",
            "Wellemeyer (5-1)",
            "Corey (1-0)",
            "Looper (6-3)",
            "Wainwright (4-2)",
            "Lohse (4-2)",
            "Saito (3-1)",
            "Chacón (2-0)",
            "Wainwright (5-2)",
            "Lohse (5-2)",
            "Wellemeyer (6-1)",
            "Maholm (3-5)"
        ],
        [
            "Loss",
            "Fox (0-1)",
            "Lohse (3-1)",
            "Marquis (1-2)",
            "Fuentes (0-2)",
            "Redman (2-3)",
            "Isringhausen (1-3)",
            "Lohse (3-2)",
            "Isringhausen (1-4)",
            "Gagné (1-2)",
            "Looper (5-2)",
            "Wainwright (3-2)",
            "Villone (1-1)",
            "Maholm (2-4)",
            "Isringhausen (1-5)",
            "Looper (5-3)",
            "Wheeler (0-3)",
            "Glover (0-2)",
            "Ledezma (0-1)",
            "Piñeiro (2-3)",
            "Young (4-4)",
            "Lowe (2-5)",
            "Penny (5-5)",
            "Parisi (0-1)",
            "Looper (6-4)",
            "Rodríguez (1-1)",
            "Oswalt (4-5)",
            "Duke (2-4)",
            "Parisi (0-2)"
        ],
        [
            "Save",
            "",
            "",
            "Isringhausen (10)",
            "Isringhausen (11)",
            "Franklin (1)",
            "Fuentes (3)",
            "",
            "",
            "Franklin (2)",
            "Shouse (1)",
            "Mota (1)",
            "",
            "",
            "",
            "Percival (11)",
            "",
            "",
            "",
            "Hoffman (9)",
            "",
            "Franklin (3)",
            "",
            "",
            "",
            "",
            "Franklin (4)",
            "Franklin (5)",
            ""
        ],
        [
            "Attendance",
            "45,077",
            "46,792",
            "44,969",
            "28,183",
            "25,460",
            "25.432",
            "25,376",
            "42,705",
            "43,382",
            "41,197",
            "25,757",
            "38,800",
            "38,720",
            "41,244",
            "43,136",
            "43,907",
            "46,392",
            "22,638",
            "27,181",
            "21,011",
            "52,281",
            "44,785",
            "46,566",
            "41,104",
            "41,115",
            "41,786",
            "42,791",
            "44,302"
        ],
        [
            "Record",
            "19-11",
            "19-12",
            "20-12",
            "21-12",
            "22-12",
            "22-13",
            "22-14",
            "22-15",
            "23-15",
            "23-16",
            "23-17",
            "23-18",
            "24-18",
            "24-19",
            "24-20",
            "25-20",
            "26-20",
            "27-20",
            "27-21",
            "28-21",
            "29-21",
            "30-21",
            "30-22",
            "30-23",
            "31-23",
            "32-23",
            "33-23",
            "33-24"
        ]
    ],
    "pageTitle": "2008 St. Louis Cardinals season - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/2008_St._Louis_Cardinals_season",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00050-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 874441255,
    "recordOffset": 874383179,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40669=Rick Ankiel was limited to pinch-hitting for 14 games at the end of July and the beginning of August due to an abdominal strain.[67] Chris Carpenter suffered a physical setback with a strain in his right triceps and had to be removed after only 5.1 innings, trailing 1-0 against the Cubs on August 10. The Cardinals lost the game and two of three in the series.[68][69] On August 15 Carpenter returned to the DL, diagnosed with a strained muscle in his shoulder.[70] Brad Thompson started in Carpenter's place and won, while Chris Perez picked up his fourth save in four chances. August ended with the Astros sweeping the Cardinals in three at Houston, dropping them to 13-13 for the month and 74-63 for the season and leaving St. Louis a full six games behind Milwaukee in the loss column., 211223=2006–2008 Index (3-yr. composite), 41988=Jason Isringhausen's frustrating season came to a disappointing finish when he was diagnosed on August 19 with elbow tendinitis and a partially torn tendon.[71] Meanwhile, staff ace Adam Wainwright, out since June 7 with a right middle finger sprain, made a triumphant return for the Cardinals on August 22, giving up only one run and five hits in six innings - and going 3-for-5 at the plate with an RBI, as St. Louis thrashed Atlanta 18-3 with 26 hits - 21 of them singles (5 doubles)., 39028=On August 5, Brendan Ryan was optioned to (AAA) Memphis and the Cardinals signed free agent infielder Felipe López, who was released by the Washington Nationals on July 31.[64], 22589=May opened with St. Louis' first series of the year against their arch-rival and the preseason NL Central favorite Chicago Cubs, with the Cardinals winning two of three games to stay atop the NL Central standings. Pujols continued to get on base: on May 6 he reached base safely for the 34th consecutive game since the start of the season, the longest such streak in MLB since 1999.[31], 37513=The Cardinals made no trades at the July 31 non-waiver trading deadline. They went 13-14 in July, their first losing month of the season. They ended July (61-50), a fraction of a percentage point behind the Milwaukee Brewers for the NL Wild card spot., 26959=On June 1, pitcher Mark Worrell got called up; he became the seventh rookie to make his MLB debut with the Cardinals in 2008.[42] On June 5, Worrell hit a home run in his first big-league at-bat, the eight Cardinal in franchise history to do so.[43] On June 6, Mitchell Boggs followed Worrell to the big leagues as the eighth rookie to make his debut with the 2008 Cardinals; fellow rookie Parisi was sent down to make room.[44], 34686=In their first series after the break, the Cardinals swept the Padres in four games to reach a season-high 14 games over .500 (57-43). They promptly were then swept by the Milwaukee Brewers in four games (Jul. 21–24) to return to only 10 games over .500 (57-47). Cardinal relief pitchers took the losses in all four games against Milwaukee, part of a season-long trend of ineffective to disastrous performances by the bullpen, then leading all of MLB in 23 games lost by the bullpen and 24 blown saves., 34345=St. Louis entered the All-Star break with a 53-43 record, in second place in the NL Central and one-half game ahead of Milwaukee for the NL Wild Card. This was the second-best record in the National League, but it was also the product of St. Louis playing .500 baseball after reaching ten games over .500 in early May, at 22-12., 43477=September opened on a particularly unpleasant note as the Cardinals blew a 5-1 lead against the Diamondbacks on September 1, losing 8-6. Stephen Drew of the D-backs hit for the cycle. The next day St. Louis promoted six players from Memphis as part of September call-ups. Included in the call-ups was Jason Motte, the 11th player to make his debut with the 2008 Cardinals.[72], 211997=St. Louis' picks at the 2008 Major League Baseball Draft in Lake Buena Vista, Florida on June 5, 2008.[75][76], 32917=On July 6, Albert Pujols and Ryan Ludwick were named as the Cardinal representatives to the National League All-Star Team.[56] Ludwick, who had never hit more than 14 home runs in a season before 2008, entered the break with 21 homers, leading the team., 13248=Center fielder Jim Edmonds, the most senior member of the Cardinals' roster, having been with the team since the 2000 season, was traded to the San Diego Padres for single-A third baseman David Freese and cash considerations on December 14, 2007.[11], 10976=On March 13, it was announced that Mark Lamping, president of the Cardinals for 13 years, resigned to become the CEO of the New Meadowlands Stadium Company. Bill DeWitt III, son of Cardinals chairman William DeWitt, Jr. and formerly the team's vice-president of business development, took Lamping's place as president.[4], 17075=On January 3, St. Louis signed starting pitcher Matt Clement, a former All-Star who missed the entire 2007 season after undergoing shoulder surgery.[21] However, Clement's rehab went slowly and he was not ready for Opening Day., 31428=The Fourth of July weekend brought a showdown series in St. Louis between the Cardinals (49-38) and Cubs (51-35) with the Cardinals 2.5 games behind Chicago. It was the first meeting between the teams since the first week of May. On July 4, Albert Pujols (aged 28 years, 170 days), became the fifth-youngest player to hit his 300th home run, but the Cardinals lost 2-1.[53] On July 5, a crowd of 46,865, the biggest ever in the short history of the new Busch Stadium, saw St. Louis score three in the bottom of the 9th against ace closer Kerry Wood to beat Chicago 5-4.[54] It was the first time in 33 games in 2008 where the Cardinals had won a game when trailing after eight innings.[55] The Cubs won the rubber game 7-1 to take a 3½ game lead in the Central Division. The three-game series set a new attendance record of 140,067 at the new Busch Stadium., 33393=Mark Mulder's comeback ended when, in his first start since September 2007, he suffered pain in his throwing shoulder on July 9 and had to leave the game after only 16 pitches against the Philadelphia Phillies.[57] He was replaced on the roster by Jaime Garcia, who debuted against the Pittsburgh Pirates on July 11, and became the 10th rookie to make his big-league debut with the 2008 Cardinals,[58] the most since 13 rookies made their debut in 1997., 15868=In spring training, LaRussa confirmed that he would continue to bat the pitcher eighth after the Cardinals adopted the unconventional lineup for the last two months of the 2007 season.[18][19], 29745=Albert Pujols was activated from the disabled list on June 26. The Cardinals went 6-7 in his absence. In Pujols' first game back he got four hits, but the Cardinals lost 3-2 to the Tigers after closer Franklin blew the save in the bottom of the 9th and Mike Parisi issued a bases-loaded walk in the bottom of the 10th.[50] The loss was part of a season-long trend of bullpen failures and blowups. It was the 19th blown save and 18th loss for Cardinal relievers, as opposed to 11 blown saves and 12 losses for the bullpen in all of 2007.[51], 25570=In late May, Piñeiro went to the DL and rookie Mike Parisi took his spot in the rotation.[39] Chris Duncan, slumping all year after offseason hernia surgery, followed him to the DL, with Joe Mather getting the callup.[40] Parisi and Mather were the fifth and sixth players to make their big-league debut with the 2008 Cardinals, following Brian Barton, Kyle McClellan, Rico Washington and Chris Perez. After slumping in the middle of the month, the Cardinals got hot at the end of May, going 15-13 for the month. They remained in second place behind the Cubs. Todd Wellemeyer was named NL Pitcher of the Month after going 4-0 with a 2.19 ERA in May.[41], 15399=Utility player Scott Spiezio was released by the Cardinals on February 27 after California authorities issued a warrant for his arrest on charges that included hit-and-run, drunk driving and assault. Spiezio had previously missed a month of the 2007 season to go on rehab for drug abuse problems.[17], 16599=Starting pitcher Kip Wells, who posted a 5.70 ERA in 2007, departed via free agency. Starting pitcher Joel Piñeiro, effective for the Cardinals in 2007 after a late-season trade from Boston, signed a two-year deal to remain with the team.[20], 38250=On August 1, Isringhausen got his first save since May 5, as the Cardinals beat the Phillies, 6-3. On August 2, Matt Clement, signed in the offseason to fill out the rotation but unable to complete a comeback from injury, was released by the Cardinals without ever pitching for them.[63], 23224=Jason Isringhausen struggled mightily as Cardinal closer in late April and early May, blowing four saves and taking three losses between April 25 and May 9. His ERA rose from 4.50 to 7.47 during that span.[32] After Isringhausen's fifth blown save of the season on May 9, LaRussa announced that Isringhausen would no longer be closing games and instead the Cardinals would be adopting a closer-by-committee approach.[33] Ryan Franklin received the first save opportunity after LaRussa's decision.[34] On May 16, Isringhausen was placed on the 15-day disabled list with a right hand laceration. Josh Kinney was transferred to the 60-day disabled list (from the 15-day list) to make room for highly touted prospect Chris Perez, who was called up from Memphis.[35] Finally, on May 17, Manager La Russa officially designated Ryan Franklin as his closer.[36], 38704=Ryan Ludwick was named 'NL Player of the Week' for the week ending August 3, as he led the league with a .538 batting average, 14 hits, a .613 on-base percentage, 8 RBI and 27 total bases. He also hit four home runs and recorded a 1.038 slugging percentage., 39670=Bullpen issues continued to dog St. Louis. On August 5, the Cardinals took a 4-0 lead into the top of ninth inning, only to have Villone, Isringhausen and Franklin combine to give up four runs to the Dodgers. It was the 27th blown save of the season for the Cardinal bullpen, worst in MLB. (The Cardinals eventually salvaged a 6-4 win when Ryan Ludwick hit a walk-off homer in extra innings.) After the game, the Cardinals announced that Isringhausen was again being removed from the closer's role.[65] Chris Perez returned from the minor leagues and got the first save of his career; a five-out save as the Cardinals beat L.A. 9-6 on August 6.[66], 44144=A loss to the Cubs on September 10 dropped them into fourth place behind the surging Astros. That loss was the start of a season-high seven-game losing streak that saw the Cardinals officially eliminated in the NL Central race and fall out of wild-card contention. The losing streak was finally snapped on September 18 versus Cincinnati with the first save of Jason Motte's career. Rick Ankiel, slowed by a sports hernia, was shut down for the year on September 13.[73], 13779=So Taguchi, backup outfielder and the only Japanese player in franchise history, was released by the Cardinals in December after six seasons with the organization.[12] The Cardinals declined to offer arbitration to shortstop David Eckstein[13] and acquired César Izturis as his replacement.[14] St. Louis acquired Jason LaRue to be the backup catcher, replacing Gary Bennett.[15] The Cardinals took outfielder Brian Barton from Cleveland on December 6 in the Rule 5 draft.[16], 30978=Despite Pujols (June 11–25) and Wainwright (June 9-?) both going on the DL in June, the Cardinals went 15-12 for the month., 36743=On July 30, 2005 Cy Young Award winner Chris Carpenter was re-activated from the 60-day disabled list, and started versus the Atlanta Braves, his first start since April 1, 2007.[61] Operating on a pitch count not to exceed 80, Carpenter threw 67 pitches (36 for strikes) in four innings, and gave up one run and five hits (all singles), while walking two and striking out two.[62], 11997=A major offseason story for the Cardinals was the hostile relationship between manager Tony La Russa and third baseman Scott Rolen. LaRussa publicly criticized Rolen on December 5,[5] and Rolen requested a trade, but the team was unable to find a suitable offer at the winter meetings.[6][7][8] On January 12, the Cardinals reached a tentative agreement with the Toronto Blue Jays to trade Rolen for their third baseman, Troy Glaus, and the trade was finalized on January 14.[9][10], 42714=A crucial two-game series with Milwaukee August 26–27 ended in a split and with the Cardinals still four losses behind the Brewers in the race for the NL Wild Card. It ended the season series with the Brewers, which Milwaukee won 10 games to 5. August ended with the Astros sweeping the Cardinals in three in Houston. The Cardinals went 13-13 for the month and ended August six games behind Milwaukee in the loss column., 27812=Troy Glaus began to find his power stroke, hitting four home runs between May 31 and June 5 after hitting only two in the first two months of the season. Ryan Ludwick, who never hit more than 14 home runs in a season prior to 2008, hit his 15th home run on June 10., 17469=Concerned over health issues in the rotation, with Clement not ready and Piñeiro suffering from shoulder pain, St. Louis signed another free agent, starting pitcher Kyle Lohse, to a one-year contract on March 14.[22], 210837=2008   (100 = Neutral Park, > 100 Ballpark favors, < 100 Ballpark inhibits   81 G; Cardinals: 2,731 AB;   Opponents: 2,847 AB), 4253=The St. Louis Cardinals' 2008 season was the 127th season for the franchise in St. Louis, Missouri and the 117th season in the National League. The Cardinals, coming off a 78-84 season that was their worst since 1999, improved by eight games, going 86-76 in 2008. However, this was only good for fourth place in the National League Central, 11.5 games behind the division champion Chicago Cubs., 20874=Opening Day, scheduled for March 31, was postponed to April 1 due to rain after the Cards and Rockies had played 2½ innings. The rain wiped out an Albert Pujols home run.[28] In the make-up game, St. Louis lost 2-1, with a Yadier Molina home run the only offense.[29] After the opening loss the Cardinals won the other five games on their home stand; the 5-1 start marked the first time since 2006 that the Cardinals had been more than one game above .500. St. Louis finished the month of April with an 18-11 record and in sole possession of first place in the NL Central. Albert Pujols reached base safely in all 29 games for the month. Staff ace Adam Wainwright finished the month 3-1 with a 2.79 ERA.[30] Jason Isringhausen had nine saves in April. However, new third baseman Troy Glaus ended April hitting only .260 and had only one home run for the month., 18249=The Cardinals were 17-10-2 in Grapefruit League play with a .286 team batting average (5th in NL) and a 4.01 ERA (4th in NL). Attendance at Roger Dean Stadium was 92,465 in 16 home games (9-5-2) for an average home attendance of 5,779. In 13 road games (8-5-0), attendance 85,655; road average 6,589.[23] Their overall Spring training record was 19-11-2.[24] St. Louis started the season with three players--Brian Barton, Kyle McClellan, and Rico Washington - who were making their big-league debuts. Only nine players on the Opening Day roster - Yadier Molina, Albert Pujols, Chris Duncan, Aaron Miles, Randy Flores, Anthony Reyes, Adam Wainwright, Braden Looper and Brad Thompson - were on the roster of the 2006 World Series champion Cardinals. With a pitching rotation in flux and many long-time Cardinals off to other teams, and coming off a losing season, most experts picked St. Louis to play poorly again in 2008.[25][26][27], 29120=On June 20 the Cardinals traveled to Boston for a three-game set with the Red Sox; it was St. Louis' first trip to Fenway since the 2004 World Series. They won two of three in Boston. Nick Stavinoha, called up on June 22 after Izturis went on the DL, became the ninth player to make his big-league debut with the 2008 Cardinals.[49], 30498=Mark Mulder, who had pitched only sporadically for the Cardinals since undergoing shoulder surgery in 2006, was activated on June 27 and sent to the bullpen.[52] In his first appearance, on June 30, he threw a scoreless ninth inning against the New York Mets., 35325=In a game against the NY Mets on July 26, the Cardinals snapped a five-game losing streak by winning 10-8 in 14 innings. Albert Pujols' game-winning home run was his first since he hit his 300th on July 4. Skip Schumaker had six singles in seven at-bats; he became the first Cardinal since Terry Moore in 1935 to have six base hits in one game. Pujols and Schumaker, meanwhile, were the first Cardinals' teammates with five or more hits apiece in a game since Charley Gelbert and Taylor Douthit each had five against the Cubs on May 16, 1930.[59] The extra-inning affair was made necessary by Ryan Franklin's blown save, his second blown save in a row and third consecutive appearance with a home run allowed. On July 28, LaRussa gave the closer's job back to Isringhausen, who lost it to Franklin earlier in the year.[60], 28090=The Cardinals suffered a serious setback on June 9, when staff ace Adam Wainwright went to the DL with a sprained finger.[45] The injury situation became even worse on June 10, when Albert Pujols strained his left calf muscle running from home on a ground ball, sending him to the disabled list for only the second time in his eight-year career.[46][47] Meanwhile, former closer Jason Isringhausen made his return from the disabled list on June 14, with the club intending to use him in middle relief.[48], 163606=* June 17, originally 43,793 reported. ** July 5, largest ever at Busch Stadium., 24940=Albert Pujols' on-base streak was snapped at 42 games when he failed to reach safely in a 3-1 loss to the Tampa Bay Rays on May 16. It was six games shy of his career-best 48 games in a row on base, set in his rookie season of 2001.[37][38] The loss was the eighth in ten games for the Cardinals, a stretch that dropped them into second place behind the Cubs.}",
    "lastModified": "Fri, 31 Jul 2015 12:05:31 GMT",
    "textBeforeTable": "March 2008 Game Log Game log[edit] 8–10 – 1–5 0–7 1–5 4–3 6–12 6–12 2–6 3–3 2–4 3–14 3–4 3–4 3–3 12–6 2–4 Washington 7–8 5–1 – 3–4 6–1 7–10 4–5 3–4 5–10 4–2 8–7 5–2 4–3 10–5 6–9 5–2 4–3 St. Louis 6–12 7–0 4–3 – 13–5 2–4 3–3 1–5 0–6 9–9 1–7 3–3 7–11 1–5 3–4 5–2 7–11 San Francisco 3–15 5–1 1–6 5–13 – 4–3 2–4 5–2 3–4 7–11 3–3 2–4 9–9 3–4 2–5 1–5 8–10 San Diego 6–9 3–4 10–7 4–2 3–4 – 2–4 3–4 1–14 2–5 8–8 2–3 2–5 9–6 4–14 5–2 3–4 Pittsburgh 4–11 12–6 5–4 3–3 4–2 4–2 – 7–11 5–1 4–4 4–3 8–10 5–0 5–3 4–3 14–4 4–3 Philadelphia 9–6 12–6 4–3 5–1 2–5 4–3 11–7 – 4–2 4–3 2–5 10–8 6–3 4–3 2–4 7–11 3–3 New York 7–8 6–2 10–5 6–0 4–3 14–1 1–5 2–4 – 2–4 8–7 1–5 3–4 8–10 7–9 6–3 5–2",
    "textAfterTable": "April 27 Astros 5 - 1 Lohse (3-0) Backe (1-3) McClellan (1) 44,222 16-10 27 April 28 Reds 4 - 3 Arroyo (1-3) Wellemeyer (2-1) Cordero (4) 37,229 16-11 28 April 29 Reds 7 - 2 Piñeiro (2-2) Cueto (1-3) 35,356 17-11 29 April 30 Reds 5 - 2 Looper (4-1) Harang (1-4) Isringhausen (9) 40,629 18-11 May   ( 15-13) # Date Opponent Score Win Loss Save Attendance Record 30 May 2 Cubs 5 - 3 (11) Villone (1-0) Fox (0-1) 45,077 19-11 31 May 3 Cubs (FOX) 9 - 3 Lilly (2-4) Lohse (3-1) 46,792 19-12 32 May 4 Cubs",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}