{
    "relation": [
        [
            "n",
            "106",
            "107",
            "108",
            "109",
            "1010",
            "1011",
            "1012",
            "1013",
            "1014",
            "1015",
            "1016"
        ],
        [
            "no wheel",
            "2.122/1.102/1.075",
            "2.2863/1.077/1.059",
            "2.4276/1.062/1.048",
            "2.5514/1.051/1.04",
            "2.6615/1.043/1.035",
            "2.7608/1.037/1.03",
            "2.8511/1.033/1.027",
            "2.9339/1.029/1.024",
            "3.0104/1.026/1.022",
            "3.0815/1.024/1.02",
            "3.1478/1.022/1.018"
        ],
        [
            "odds",
            "0.811/1.137/1.075",
            "0.8932/1.101/1.059",
            "0.9638/1.079/1.048",
            "1.0257/1.064/1.04",
            "1.0808/1.054/1.035",
            "1.1304/1.046/1.03",
            "1.1755/1.04/1.027",
            "1.217/1.035/1.024",
            "1.2552/1.031/1.022",
            "1.2907/1.028/1.02",
            "1.3239/1.026/1.018"
        ],
        [
            "2/3/5 wheel",
            "0.2903/1.22/1.075",
            "0.3341/1.151/1.059",
            "0.3718/1.113/1.048",
            "0.4048/1.089/1.04",
            "0.4342/1.073/1.035",
            "0.4607/1.061/1.03",
            "0.4847/1.052/1.027",
            "0.5068/1.046/1.024",
            "0.5272/1.04/1.022",
            "0.5462/1.036/1.02",
            "0.5639/1.032/1.018"
        ],
        [
            "2/3/5/7 wheel",
            "0.2162/1.261/1.075",
            "0.2537/1.174/1.059",
            "0.286/1.127/1.048",
            "0.3143/1.099/1.04",
            "0.3395/1.08/1.035",
            "0.3622/1.067/1.03",
            "0.3828/1.057/1.027",
            "0.4018/1.049/1.024",
            "0.4193/1.044/1.022",
            "0.4355/1.039/1.02",
            "0.4507/1.035/1.018"
        ],
        [
            "combo wheel",
            "0.1524/1.416/1.075",
            "0.1899/1.246/1.059",
            "0.2222/1.17/1.048",
            "0.2505/1.127/1.04",
            "0.2757/1.101/1.035",
            "0.2984/1.082/1.03",
            "0.319/1.069/1.027",
            "0.3379/1.059/1.024",
            "0.3554/1.052/1.022",
            "0.3717/1.046/1.02",
            "0.3868/1.041/1.018"
        ],
        [
            "2/3/5/7/11/13/17/19 wheel",
            "0.114/1.416/1.075",
            "0.1421/1.246/1.059",
            "0.1662/1.17/1.048",
            "0.1874/1.127/1.04",
            "0.2063/1.101/1.035",
            "0.2232/1.082/1.03",
            "0.2387/1.069/1.027",
            "0.2528/1.059/1.024",
            "0.2659/1.052/1.022",
            "0.2781/1.046/1.02",
            "0.2894/1.041/1.018"
        ]
    ],
    "pageTitle": "Sieve of Eratosthenes - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Sieve_of_eratosthenes",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00091-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 865490207,
    "recordOffset": 865457049,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3236=When testing each candidate number, the optimal trial division algorithm uses just those prime numbers not exceeding its square root. The widely known 1975 functional code by David Turner[12] is often presented as an example of the sieve of Eratosthenes[6] but is actually a sub-optimal trial division algorithm.[2]}",
    "TableContextTimeStampAfterTable": "{18774=One should also note that in using the calculated operation ratios to the sieve range, it must be less than about 0.2587 in order to be faster than the often compared sieve of Atkin if the operations take approximately the same time each in CPU clock cycles, which is a reasonable assumption for the one huge bit array algorithm. Using that assumption, the sieve of Atkin is only faster than the maximally wheel factorized sieve of Eratosthenes for ranges of over 1013 at which point the huge sieve buffer array would need about a quarter Terabyte (about 250 Gigabytes) of RAM memory even if bit packing were used - i.e., not very practical! An analysis of the page segmented versions will show that the assumption that the time per operation stays the same between the two algorithms does not hold for page segmentation and that the sieve of Atkin operations get slower much faster than the sieve of Eratosthenes with increasing range. Thus for practical purposes, the maximally wheel factorized Sieve of Eratosthenes is faster than the Sieve of Atkin although the Sieve of Atkin is faster for lesser amounts of wheel factorization., 17834=The above shows that the log log n estimate is not very accurate even for maximum practical ranges of about 1016. One can see why it does not match by looking at the computational analysis above and seeing that within these practical sieving range limits, there are very significant constant offset terms such that the very slowly growing log log n term doesn't get large enough so as to make these terms insignificant until the sieving range approaches infinity - well beyond any practical sieving range. Within these practical ranges, these significant constant offsets mean that the performance of the Sieve of Eratosthenes is much better than one would expect just using the asymptotic time complexity estimates by a significant amount. bit that also means that the slope of the performance with increasing range is steeper than predicted as the benefit of the constant offsets becomes slightly less significant.}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "To show that the above expression is a good approximation to the number of composite number cull operations performed by the algorithm, following is a table showing the actually measured number of operations for a practical implementation of the sieve of Eratosthenes as compared to the number of operations predicted from the above expression with both expressed as a fraction of the range (rounded to four decimal places) for different sieve ranges and wheel factorizations (Note that the last column is a maximum practical wheel as to the size of the wheel gaps Look Up Table - almost 10 million values): Combining all of the above analysis, the total number of operations for a sieving range up to n including wheel factorization for primes up to x is approximately: For the wheel factorization cases, there is a further offset of the operations not done of where x is the highest wheel prime and a constant factor of the whole expression is applied which is the fraction of remaining prime candidates as compared to the repeating wheel circumference. The wheel circumference is and it can easily be determined that this wheel factor is as is the fraction of remaining candidates for the highest wheel prime, x, and",
    "textAfterTable": "2.5514/1.051/1.04 1.0257/1.064/1.04 0.4048/1.089/1.04 0.3143/1.099/1.04 0.2505/1.127/1.04 0.1874/1.127/1.04 1010 2.6615/1.043/1.035 1.0808/1.054/1.035 0.4342/1.073/1.035 0.3395/1.08/1.035 0.2757/1.101/1.035 0.2063/1.101/1.035 1011 2.7608/1.037/1.03 1.1304/1.046/1.03 0.4607/1.061/1.03 0.3622/1.067/1.03 0.2984/1.082/1.03 0.2232/1.082/1.03 1012 2.8511/1.033/1.027 1.1755/1.04/1.027 0.4847/1.052/1.027 0.3828/1.057/1.027 0.319/1.069/1.027 0.2387/1.069/1.027 1013 2.9339/1.029/1.024 1.217/1.035/1.024 0.5068/1.046/1.024 0.4018/1.049/1.024 0.3379/1.059/1.024 0.2528/1.059/1.024 1014 3.0104/1.026/1.022 1.2552/1.031/1.022 0.5272/1.04/1.022 0.4193/1.044/1.022 0.3554/1.052/1.022 0.2659/1.052/1.022 1015 3.0815/1.024/1.02 1.2907/1.028/1.02 0.5462/1.036/1.02 0.4355/1.039/1.02 0.3717/1.046/1.02 0.2781/1.046/1.02 1016 3.1478/1.022/1.018 1.3239/1.026/1.018 0.5639/1.032/1.018 0.4507/1.035/1.018 0.3868/1.041/1.018 0.2894/1.041/1.018 The above shows that the log log n estimate is not very accurate even for maximum practical ranges of about 1016. One can see why it does not match by looking at the computational analysis above and seeing that within these practical sieving range limits, there are very significant constant offset terms such that the very slowly growing log log n term doesn't get large enough so as to make these terms insignificant until the sieving range approaches infinity - well beyond any practical sieving range. Within these practical ranges, these significant constant offsets mean that the performance of the Sieve of Eratosthenes is much better than one would expect just using the asymptotic time complexity estimates by a significant amount. bit that also means that the slope of the performance with increasing range is steeper than predicted as the benefit of the constant offsets becomes slightly less significant. One should also note that in using the calculated operation ratios to the sieve range, it must be less than about 0.2587 in order to be faster",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}