{
    "relation": [
        [
            "Local Authority",
            "Isles of Scilly",
            "Eden",
            "West Somerset",
            "Purbeck",
            "Gosport",
            "Stevenage",
            "Torbay",
            "Teignbridge",
            "East Lindsey",
            "Fareham",
            "",
            "Waltham Forest",
            "Bradford",
            "Southwark",
            "Sheffield",
            "Middlesbrough",
            "Newham",
            "City of London",
            "Newcastle upon Tyne",
            "Barking and Dagenham",
            "Tower Hamlets"
        ],
        [
            "2011 (%)",
            "10.0",
            "11.3",
            "12.7",
            "12.7",
            "9.9",
            "10.2",
            "12.3",
            "12.1",
            "13.0",
            "10.6",
            "",
            "8.2",
            "9.8",
            "7.2",
            "10.4",
            "10.2",
            "8.0",
            "7.8",
            "9.2",
            "8.7",
            "7.6"
        ],
        [
            "2001 (%)",
            "8.0",
            "9.7",
            "10.9",
            "10.9",
            "8.6",
            "8.8",
            "10.7",
            "10.6",
            "11.4",
            "9.3",
            "",
            "8.6",
            "10.3",
            "7.6",
            "10.9",
            "10.8",
            "8.5",
            "8.3",
            "10.1",
            "9.7",
            "8.6"
        ],
        [
            "2011 (Rank)",
            "224",
            "84",
            "7",
            "9",
            "230",
            "198",
            "20",
            "29",
            "2",
            "146",
            "",
            "308",
            "242",
            "322",
            "179",
            "196",
            "311",
            "316",
            "273",
            "295",
            "318"
        ],
        [
            "2001 (Rank)",
            "310",
            "202",
            "64",
            "65",
            "293",
            "277",
            "88",
            "104",
            "28",
            "240",
            "",
            "289",
            "138",
            "319",
            "59",
            "74",
            "297",
            "304",
            "152",
            "197",
            "292"
        ],
        [
            "Change 2001-2011 (%)2",
            "25.0",
            "17.2",
            "16.4",
            "16.3",
            "15.5",
            "15.4",
            "14.9",
            "14.4",
            "14.0",
            "14.0",
            "",
            "-4.4",
            "-4.8",
            "-4.9",
            "-5.0",
            "-5.5",
            "-5.7",
            "-6.2",
            "-9.0",
            "-10.3",
            "-11.1"
        ],
        [
            "Change in carer number",
            "48",
            "1,144",
            "574",
            "857",
            "1,631",
            "1,518",
            "2,226",
            "2,234",
            "2,858",
            "1,798",
            "",
            "2,450",
            "3,046",
            "2,210",
            "1,315",
            "-445",
            "3,941",
            "-22",
            "-457",
            "281",
            "2,559"
        ]
    ],
    "pageTitle": "2011 Census Analysis: Unpaid care in England and Wales, 2011 and comparison with 2001 - ONS",
    "title": "Per cent1, Rank",
    "url": "http://www.ons.gov.uk/ons/rel/census/2011-census-analysis/provision-of-unpaid-care-in-england-and-wales--2011/art-provision-of-unpaid-care.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00341-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 638203423,
    "recordOffset": 638175590,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{62700=In terms of the change in those providing 50 hours or more unpaid care between 2001 and 2011, Table 3 ranks authorities on the percentages of their respective usual resident populations which provide 50 hours or more unpaid care in 2011, including the highest and lowest ten. All authorities, other than the City of London, had a growth in absolute numbers. In East Lindsey, the highest authority in 2011 for 50 hours or more unpaid care, the absolute number of carers increased by almost 1,400. Of the top ten authorities, eight were concentrated in the northern regions or the East Midlands., 63314=Conversely, those authorities with the smallest percentages in 2011 were located in London, the university centres of Oxford and Cambridge and the affluent authorities of Elmbridge and Hart. All these authorities had smaller increases in 50 hours or more unpaid care compared with 2001, but all other than the City of London experienced a growth in absolute numbers ranging from 336 unpaid carers in Hart to 822 in Lambeth., 16030=Since 2001, there has been an increase of approximately 600,000 people providing unpaid care in England and Wales, 30,000 of whom are in Wales, representing a percentage increase of 3.2 per cent. The growth in unpaid care was highest in the 50 hours or more category, where an additional 271,649 carers were providing this extent of care compared with 2001; in the 1-19 hours category the number of additional carers was 109,250, and in the 20-49 hours category there was an additional 201,542., 9559=This short story presents a picture of the provision of unpaid care in England and Wales in 2011, with an overview of key findings at regional and local authority level and by area deprivation groupings. This story is also accompanied by interactive maps and video podcast., 13962=The 2011 Census shows there are approximately 5.8 million people providing unpaid care in England and Wales, representing just over one tenth of the population (10.3 per cent); in 2001 it was 10.0 per cent). Of these, around 3.7 million provide 1-19 hours per week, 775,000 provide 20-49 hours and 1.4 million provide 50 hours or more unpaid care., 53621=The maps show a general increase in care provided across most English authorities, with the exception of London boroughs which are largely unchanged. Those areas with higher levels of unpaid care in 2001 were largely similar in 2011, but the extent of care increased. The coastal areas in the East of England, the South West and North West, and the central belt across the East Midlands have the highest concentrations of unpaid care in 2011 which is partly explained by higher concentrations of retired people in these authorities., 30000=Rother has the highest medical and care enumeration rate (Table 1) and is ranked 18th highest on percentage of all care durations. However, North East Derbyshire had the highest percentage of unpaid carers, but its medical and care enumeration rank is 181st. The 2011 Census suggests that local authorities with the lowest medical and care establishment enumeration rate also have lower levels of unpaid care; however, among those with the highest rates, their unpaid care ranking is more contrasting., 88593=The highest percentage increase in all levels of unpaid care between 2001 and 2011 occurred in Monmouthshire (Table 4); while levels reduced slightly in Cardiff and Wrexham. In general Wales’s unitary authorities experienced a smaller increase than authorities in England, The more rural authorities saw the greatest gains, while the traditional industrial heartlands of the valleys remained largely static with an eighth to a seventh of their populations providing some level of unpaid care., 94993=In Wales there were 1,909 LSOAs enumerated in the 2011 Census; the use of the ONS lookup file enables the total number of census LSOAs to be assigned a WIMD 2011 rank so that nine deciles in Wales consisted of 191 areas, and one decile 190 areas., 12472=The importance of unpaid care was reflected by its inclusion as an item in both the 2001 Census and 2011 Census2. The questions asked were the same in each census, therefore direct comparison over time on the number of unpaid carers and the extent of care they provide is possible at national, regional and local level, and by level of area disadvantage., 94516=In England there were 32,844 LSOAs with enumerated populations in 2011; use of the ONS Census Geography lookup file enables the total number of census LSOAs to be assigned an Indices of Deprivation 2010 score. LSOAs were then ranked according to their level of deprivation and grouped into tenths (deciles), with each decile consisting of approximately 3,284 LSOAs., 39888=Table 2 ranks the 10 authorities with the highest percentage increases and decreases in the provision of all durations of care between 2001 and 2011., 27929=Differences in care provision are also present by a measure of area deprivation2. Although Liverpool, the most deprived local authority in England based on the Indices of Deprivation 2010 average summary score, has a younger age structure than Hart, the least deprived, Liverpool has a higher percentage of unpaid carers. Disability-free life expectancy 3 was 10 years higher for men in Hart than Liverpool (249.5 Kb Excel sheet) in 2007-09 suggesting care needs are likely to be manifesting at earlier ages in Liverpool which may explain the higher level of unpaid care in Liverpool despite its younger age structure. An interactive map which enables information on the extent of unpaid care to be accessed for each local authority in England and Wales in 2001 and 2011 is available., 105178=All key terms used in this publication are explained in the 2011 Census glossary. Information on the 2011 Census Geography Products for England and Wales is also available., 71981=For example, North East Derbyshire has the highest proportion of people providing unpaid care in England and this local authority’s ranking on the percentage of its population in either ‘Very good’ or ‘Good’ general health was low in 2011, 293rd out of 326. East Lindsey had the highest proportion providing 50 hours or more unpaid care and it was ranked the lowest (326th) on general health. Whether this suggests care is affecting health or whether care is higher because levels of either ‘Very good’ or ‘Good’ general health are lower, and therefore there is greater need for care, is uncertain; Future data releases from the 2011 Census will enable the general health of carers by duration category to be measured, taking account of other contributing factors such as household structure, the distribution by age, gender, participation in the labour market and socio-economic position, and in the context of statutory care provision across administrative areas., 29454=Another interesting question to ask is whether there is an unmet need for care, which could be related to the supply of care home facilities. The 2011 Census enumerated residents of medical and care establishments, which enables an assessment of how equally these facilities are distributed across local authorities. If there is an unmet need for care, it might be expected that the rate of medical and care establishment enumerations per 1000 population would be lower in those authorities where unpaid care levels are high., 75239=An interactive map which enables information on the extent of unpaid care to be accessed for each unitary authority in Wales in 2001 and 2011 is available., 53263=A comparison of unpaid care across all authorities in England in both 2011 and 2001 is shown in Map 1 and Map 2 respectively. The darker colours signify higher percentages and the lighter colours lower percentages with the ranges kept constant between 2001 and 2011. The key shows the number of authorities within each range in brackets., 95260=In England, the difference in the percentage of unpaid care between the most and least deprived areas is modest, with levels of care lower in the more deprived areas at both time points. Between 2001 and 2011, the level of care has remained largely flat among the three most deprived area deciles, but increases have occurred in the least deprived deciles (Figure 9)., 100735=Further analysis will be needed to support this provisional finding by comparing decile age structures and taking account of any future revisions to the English Indices of Deprivation, 2010 and the Welsh Index of Multiple Deprivation, 2011 using 2011 Census data., 26515=Of the top ten authorities providing the least care overall, nine are London boroughs, eight of which are inner London boroughs. Those authorities whose usual residents provide the most unpaid care are more mixed in their regional make-up; the majority have significant rural based populations and only St. Helens and Sefton in the North West region are major urban settlements in the Department for the Environment, Food and Rural Affairs urban – rural classification. (Disability in England and Wales, 2011 and Comparison with 2001 provides more information)., 39481=Compared with 2001, only four of the ten local authorities providing the highest percentages of unpaid care (1-50+ hours) in 2011 were in the top ten in 2001; these were North East Derbyshire, Staffordshire Moorlands, St Helens and Bolsover. The smallest change has been in North East Derbyshire where it has remained constant as the local authority which provides the most unpaid care., 52285=Authorities experiencing the largest falls were urban conurbations. However, as can be seen in table 2, although all experienced a percentage fall, in all but three cases, the absolute number of carers increased, because of increases in population size over the ten years. The northern cities of Newcastle-upon-Tyne, Sheffield and Bradford, and the town of Middlesbrough had the greatest fall in their ranking between 2001 and 2011 for the amount of care provided, but of these only Newcastle-upon-Tyne and Middlesbrough actually saw the absolute number of carers fall., 103815=ONS has ensured that the data collected meet users' needs via an extensive 2011 Census outputs consultation process in order to ensure that the 2011 Census outputs will be of increased use in the planning of housing, education, health and transport services in future years., 16545=If people, on average, are providing towards the mid-range of hours per week in the 1-19 or 20-49 hour categories, and 50 hours in the 50 hours or more category, then this amounts to approximately 3.4 million working weeks of care provided based on a standard 37 hours working week and 17 million working days in a given week in 2011., 106487=The 2011 Census achieved its overall target response rate of 94 per cent of the usually resident population of England and Wales, and over 80 per cent in all local and unitary authorities. The population estimate for England and Wales of 56.1 million is estimated with 95 per cent confidence to be accurate to within +/- 85,000 (0.15 per cent)., 71274=There is evidence in the literature to suggest that people providing unpaid care are at increased risk of psychological stress depending on their age and place in the labour market which has a negative effect on their mental and emotional well-being. The general health question asked in the 2011 Census encompasses mental as well as physical aspects of health. Therefore the general health status of local authority populations is likely to be influenced by the level of unpaid care its population provides., 73456=In Wales in 2011 Neath Port Talbot was the authority with the largest percentage of its population providing unpaid care at 14.6 per cent, higher than any authority in England; Cardiff had the lowest at 10.1 per cent, representing a difference of 4.5 percentage points. The gap between authorities providing unpaid care in Wales is somewhat smaller than that in England., 106929=Chris White Head of Health Analysis Public Policy Analysis Division Office for National Statistics Cardiff Road Newport Wales NP10 8XG Tel: +44 (0) 1633 455925 E-mail: hle@ons.gsi.gov.uk, 22141=The increase in the South West may be affected by a growth in the population aged 60-69 and a fall in those aged 30-39 since 2001. Figure 4 shows the change in population structure since 2001 in both the South West and London. Comparisons of age structures between other regions and local authorities can be visualised using the animated population pyramids, selecting the regions or local authorities to compare and clicking the overlay button., 103344=Future releases from the 2011 Census will include more detail in cross tabulations, and tabulations at other geographies. These include wards, health areas, parliamentary constituencies, postcode sectors and national parks. Further information on future releases is available online in the 2011 Census Prospectus., 21771=Unpaid care has been growing since 2001 in all regions, with the exception of London and Yorkshire and the Humber. The largest increase occurred in the South West, with an additional 109,602 unpaid carers, and the smallest in the North East, with 9,758 additional carers; however, the absolute number of carers increased in all regions and in Wales., 51513=When ranking authorities on the basis of the percentage change in care provision, 271 authorities experienced increases and only 55 authorities experienced decreases. The Isles of Scilly had the highest percentage increase in unpaid care, but its population is small and therefore had only a modest change in absolute numbers. All 10 of the top providers of care in 2011 (Figure 5) have seen increases in the percentage of carers over the decade. Of these top 10 providers of care in 2011 the largest increase was in West Somerset, which saw a percentage increase of 16.4 per cent. East Lindsey, the authority with the highest percentage of people with activity limitations was among the top 10 authorities with the highest increases in care provided., 105629=All census population estimates were extensively quality assured, using other national and local sources of information for comparison and review by a series of quality assurance panels. An extensive range of quality assurance, evaluation and methodology papers were published alongside the first release in July 2012 and have been updated in this release, including a Quality and Methodology Information (QMI) document (152.8 Kb Pdf) ., 55496=An interactive map which enables information on the extent of unpaid care to be accessed for each local authority in England and Wales in 2001 and 2011 is available., 102811=2001 Census data are available via the Neighbourhood Statistics website. Relevant table numbers are provided in all download files within this publication., 93239=In order to present a picture of unpaid care and the scale of inequality that exists between population groupings, these small areas are amalgamated, on the basis of their relative level of disadvantage. The Index of Multiple Deprivation 2004 and 2010 in England, and the Welsh Index of Multiple Deprivation 2005 and 2011 in Wales, are used to group areas into tenths (deciles). Percentages of unpaid care are then calculated for these deciles., 97299=In Wales percentages of unpaid care for each decile were higher than those in England (Figure 10). As with England, unpaid care was slightly lower in the more deprived deciles in both 2001 and 2011. Only decile 3 experienced a slight fall in unpaid care between 2001 and 2011, with the greatest increases occurring from the middle to the least deprived deciles., 89550=A comparison of unpaid care across all authorities in Wales both in 2011 and 2001 is shown in Map 3 and Map 4 respectively. The darker colours signify higher percentages and the lighter colours lower percentages with the ranges kept constant in 2001 and 2011. The key shows the number of authorities within each range in brackets. Different ranges are used in the Welsh maps so the shadings are not comparable with the English maps., 102100=This publication follows the 2011 Census Population and Household Estimates for England & Wales. The census provides estimates of the characteristics of all people and households in England and Wales on census day. These are produced for a variety of users including government, local and unitary authorities, business and communities. The census provides population statistics from a national to local level. This short story discusses the results at national, regional, local and small area level., 89106=As in England, population growth partly explains the increase in the absolute number of carers between 2001 and 2011; in Cardiff, although there was a slight fall in the percentage of the population providing unpaid care, absolute numbers increased the most, with an additional 3,833 people providing unpaid care. In fact all unitary authorities in Wales had an increase in the absolute number of carers compared with 2001.}",
    "textBeforeTable": "England Table 1: Local authorities ranked by Medical and Care enumeration rate in 2011, with percentage of unpaid care provision Rother has the highest medical and care enumeration rate (Table 1) and is ranked 18th highest on percentage of all care durations. However, North East Derbyshire had the highest percentage of unpaid carers, but its medical and care enumeration rank is 181st. The 2011 Census suggests that local authorities with the lowest medical and care establishment enumeration rate also have lower levels of unpaid care; however, among those with the highest rates, their unpaid care ranking is more contrasting. Another interesting question to ask is whether there is an unmet need for care, which could be related to the supply of care home facilities. The 2011 Census enumerated residents of medical and care establishments, which enables an assessment of how equally these facilities are distributed across local authorities. If there is an unmet need for care, it might be expected that the rate of medical and care establishment enumerations per 1000 population would be lower in those authorities where unpaid care levels are high. Differences in care provision are also present by a measure of area deprivation2. Although Liverpool, the most deprived local authority in England based on the Indices of Deprivation 2010 average summary score, has a younger age structure than Hart, the least deprived, Liverpool has a higher percentage of unpaid carers.",
    "textAfterTable": "10.0 8.0 224 310 25.0 48 Eden 11.3 9.7 84 202 17.2 1,144 West Somerset 12.7 10.9 7 64 16.4 574 Purbeck 12.7 10.9 9 65 16.3 857 Gosport 9.9 8.6 230 293 15.5 1,631 Stevenage 10.2 8.8 198 277 15.4 1,518 Torbay 12.3 10.7 20 88 14.9 2,226 Teignbridge 12.1 10.6 29 104 14.4 2,234 East Lindsey 13.0 11.4 2 28 14.0 2,858 Fareham 10.6 9.3 146 240 14.0 1,798              ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}