{
    "relation": [
        [
            "Year",
            "2002",
            "2008",
            "2012",
            "1996",
            "2008",
            "2008"
        ],
        [
            "Team",
            "San Francisco Giants",
            "San Francisco Giants",
            "St. Louis Cardinals",
            "San Francisco Giants",
            "Cincinnati Reds",
            "San Diego Padres"
        ],
        [
            "Closer",
            "Robb Nen",
            "Brian Wilson",
            "Jason Motte",
            "Rod Beck",
            "Francisco Cordero",
            "Trevor Hoffman"
        ],
        [
            "Sv",
            "43",
            "41",
            "40",
            "35",
            "34",
            "30"
        ],
        [
            "BS",
            "8",
            "6",
            "7",
            "7",
            "6",
            "4"
        ],
        [
            "Save percent",
            "84.3%",
            "87.2%",
            "85.1%",
            "83.3%",
            "85.0%",
            "88.2%"
        ],
        [
            "Saves rest of team",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Playoffs",
            "yes",
            "no",
            "TBD",
            "no",
            "no",
            "no"
        ]
    ],
    "pageTitle": "Jason Motte nearing a very unusual record | The Cardinal Nation blog",
    "title": "",
    "url": "http://thecardinalnationblog.com/2012/09/24/motte-nearing-a-very-unusual-record/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00295-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 242608228,
    "recordOffset": 242592286,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11807=Interestingly, all are National Leaguers, including three San Francisco Giants. Three of the five accomplished it in the same year, 2008, also the last time it occurred., 12404=Closers with all of their team’s saves, season, MLB, since 1969, 10954=It is the sixth occurrence overall and first since Jason Isringhausen tied Lee Smith in 2004 for the team record of 47.  Smith had three consecutive 40-save seasons (1991-93) and Bruce Sutter had one (1984)., 29457=It just happened on Friday. With Salas trying to get the save with a 4-3 lead against the cubs in the 9th. http://sports.yahoo.com/mlb/boxscore;_ylt=AkH_7VYOsEp1AAbu4sNZpd.FCLcF?gid=320921116, 26723=Yes. For example, Scrabble blew a save in the ninth at Chicago on April 24. Allowed a game-tying HR to LaHair. Then Salas lost the game in the 10th., 11385=Even more unusual is that as a team, the 2012 Cardinals have exactly 40 saves. In other words, no one other than Motte has recorded even one save for St. Louis this season., 11990=Motte needs just three more saves (and no Cardinals teammate to get his first) to move into a share of the all-time lead with Robb Nen, who collected all 43 of the 2002 Giants’ saves. That San Francisco club was the only one of the prior five to reach the post-season., 11571=I enlisted the help of researcher Tom Orf to determine just how unique this is. Since the save became an official MLB statistic in 1969, only five closers went an entire season collecting 100 percent of their team’s saves., 9799=September 24th, 2012 • Category: St. Louis Cardinals}",
    "textBeforeTable": "Closers with all of their team’s saves, season, MLB, since 1969 Motte’s current conversion rate of 85.1 percent is right in the middle of this elite and unique pack. Motte needs just three more saves (and no Cardinals teammate to get his first) to move into a share of the all-time lead with Robb Nen, who collected all 43 of the 2002 Giants’ saves. That San Francisco club was the only one of the prior five to reach the post-season. Interestingly, all are National Leaguers, including three San Francisco Giants. Three of the five accomplished it in the same year, 2008, also the last time it occurred. I enlisted the help of researcher Tom Orf to determine just how unique this is. Since the save became an official MLB statistic in 1969, only five closers went an entire season collecting 100 percent of their team’s saves. Even more unusual is that as a team, the 2012 Cardinals have exactly 40 saves. In other words, no one other than Motte has recorded even one save for St. Louis this season. It is the sixth occurrence overall and first since Jason Isringhausen tied Lee Smith in 2004 for the team record of 47.  Smith had three consecutive 40-save seasons (1991-93) and Bruce Sutter had one (1984). It isn’t just a recent phenomenon, however. With his 40th save of the season on Sunday, Motte became only the fourth",
    "textAfterTable": "Follow me on Twitter. Follow The Cardinal Nation Blog on Facebook. Tweet This Post 11 Responses to “Jason Motte nearing a very unusual record” Nutlaw says: September 24, 2012 at 6:15 pm That’s pretty wild! Motte certainly is pitching great. Log in to Reply Brian Walton says: September 24, 2012 at 6:17 pm He was named NL Player of the Week this afternoon. Only very rarely are relievers recognized. Log in to Reply blingboy says: September 24, 2012 at 6:22 pm",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}