{
    "relation": [
        [
            "Map",
            "G5",
            "C4",
            "",
            "D2",
            "B3",
            "F7",
            "F2",
            "C1"
        ],
        [
            "County",
            "Adams",
            "Ashland",
            "Bad Axe",
            "Barron",
            "Bayfield",
            "Brown",
            "Buffalo",
            "Burnett"
        ],
        [
            "County Address",
            "402 Main/P.O. Box 278, Friendship 53934",
            "201 W. Main St., Ashland 54806",
            "",
            "330 E. LaSalle Ave., Barron 54812",
            "117 E. Fifth St., Washburn 54891",
            "305 E. Walnut St., Green Bay 54305",
            "407 S. Second St., Alma 54610",
            "7410 County Road K, Siren 54872"
        ],
        [
            "Date Formed- Parent County(ies)",
            "1848 Portage",
            "1860 La Pointe",
            "1851 Crawford (renamed Vernon, 1862)",
            "1859 (as Dallas) Polk",
            "1845 (as La Pointe) St. Croix",
            "1818 unorganized territory",
            "1853 Jackson",
            "1856 Polk"
        ],
        [
            "Jurisdictional Purposes",
            "(c/j-Sauk, 1848–53)",
            "(j-Bayfield, 1866–73)",
            "",
            "(c/j-Polk, 1859–60; Dunn, 1860–68;j-Dunn, 1868–74) renamed Barron, 1869",
            "(j-Crawford, 1845; St. Croix, 1849–50) renamed Bayfield, 1866",
            "",
            "",
            "(j-Polk, 1856–59; c/j-Polk, 1859–64; j-Polk, 1866–71)"
        ],
        [
            "Birth",
            "1857",
            "1876",
            "",
            "1877",
            "1879",
            "1814",
            "1855",
            "1853?"
        ],
        [
            "Marriage",
            "1854",
            "1871",
            "",
            "1868",
            "1869",
            "1823",
            "1856",
            "1869?"
        ],
        [
            "Death",
            "1876",
            "1877",
            "",
            "1877",
            "1870",
            "1834",
            "1873",
            "1846?"
        ],
        [
            "Land",
            "1853",
            "1856",
            "",
            "1870",
            "1850",
            "1820",
            "1854",
            "1866"
        ],
        [
            "Probate",
            "1855",
            "1878",
            "",
            "1880",
            "1857",
            "1824",
            "1854",
            "1868"
        ],
        [
            "Court",
            "1854",
            "1873",
            "",
            "1874",
            "1859",
            "1823",
            "1853",
            "1870"
        ]
    ],
    "pageTitle": "All about genealogy and family history - Wisconsin County Resources - Ancestry.com Wiki",
    "title": "",
    "url": "http://www.ancestry.com/wiki/index.php?title=Wisconsin_County_Resources&diff=4912&oldid=2505",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00131-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 287519410,
    "recordOffset": 287511208,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18770=The date listed for each category of record is usually the earliest registration filed. The earliest date does not indicate that there are numerous records for that year and does not mean that all such events were actually registered. It has been estimated that less than 50 percent of the vital records, for example, were prepared and submitted for permanent filing prior to 1907. Land deeds, probate, and court records generally begin in Wisconsin with the organization of the county. Prior to that date, check the “Parent County.” Some counties formed from other counties transcribed their portion of property deeds to be kept with the new county deed records., 17950=For example, when Ashland County was attached for judicial purposes to Bayfield County in 1866, the courthouse in Ashland County did not close. The county board still met, land transactions and marriages were still recorded by the register of deeds, and taxes were still collected in and for Ashland County. Only the courts and law enforcement were affected, and for those records between 1866 and 1873, the researcher would have to check in Bayfield County.}",
    "textBeforeTable": "Information on county formation and earliest record dates was provided by James L. Hansen, Reference Librarian, Wisconsin Historical Society. Addresses were obtained from the Wisconsin Counties Association website at www.wicounties.org or the relevant county’s website. The date listed for each category of record is usually the earliest registration filed. The earliest date does not indicate that there are numerous records for that year and does not mean that all such events were actually registered. It has been estimated that less than 50 percent of the vital records, for example, were prepared and submitted for permanent filing prior to 1907. Land deeds, probate, and court records generally begin in Wisconsin with the organization of the county. Prior to that date, check the “Parent County.” Some counties formed from other counties transcribed their portion of property deeds to be kept with the new county deed records. The year given in the county charts for “Date Formed” is the year that passage of the law created the county. With that date is the name of the parent county or counties. Additional lines identify the purposes (c-county purposes; j-judicial purposes), the county or counties to which it was attached, and the dates of that attachment. For example, when Ashland County was attached for judicial purposes to Bayfield County in 1866, the courthouse in Ashland County did not close. The county board still met, land transactions and marriages were still recorded by the register",
    "textAfterTable": "Retrieved from \" http://www.ancestry.com/wiki/index.php?title=Wisconsin_County_Resources\" Views Page Discussion View source History Personal tools Log in / Register Navigation Main Page Community portal Current events Recent changes Random page Help Search  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}