{
    "relation": [
        [
            "Session",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14"
        ],
        [
            "Date",
            "13 Jan.",
            "20 Jan.",
            "27 Jan.",
            "3 Feb.",
            "10 Feb.",
            "17 Feb.",
            "24 Feb. 26 Feb.",
            "3 March",
            "10 March",
            "17 March",
            "24 March",
            "31 March",
            "7 April",
            "14 April"
        ],
        [
            "Topic",
            "Introduction, Overview",
            "S1: History of Memory Corruption, S2: ibid",
            "S1: Chukuka talk, S2: Heap Feng Shui",
            "S1: Laing talk, S2: Exploitation and State Machines PDF slides",
            "S1: Navabisohi talk, S2: SSL And the Future of Authenticity",
            "no class: reading week",
            "S1: Rougeau talk, S2: ScapyHunt exercise",
            "S1: EDURange exercise",
            "S1: Laing talk, S2: Chukuka talk, S3: Vanilla Skype",
            "S1: Navabisohi talk, S2: Science of Insecurity",
            "S1: Rougeau talk, S2: Pwned By the owner",
            "S1: Chukuka talk, S2: Writing a Thumbdrive from Scratch",
            "S1: Laing talk, S2: TBD",
            "S1: Navabisohi (paper20), S2: Rougeau (paper21)"
        ],
        [
            "Primary Readings",
            "Hacking the Abacus: Chapter 2",
            "1 2 3 4 5",
            "paper1",
            "[paper2]",
            "[paper4]",
            "no class",
            "[paper7]",
            "[paper10]",
            "[paper12]",
            "[paper16]",
            "paper17",
            "[paper18]",
            "[paper19]",
            "[paper20], [paper21]"
        ],
        [
            "Background Readings",
            "1 2 3",
            "slides",
            "(s1, s4, s5)",
            "(paper3, s10, s11)",
            "(paper5)",
            "catch up on readings",
            "(paper6, paper8, paper9)",
            "(paper11, s18, s32)",
            "(paper13, paper14, s12)",
            "(paper15, s22, s23)",
            "(s7, s9)",
            "(s25, s26, s27)",
            "(s13, s24)",
            "(s30, s31), (s28, s29)"
        ],
        [
            "Presenter",
            "Locasto",
            "Locasto",
            "Chukuka",
            "Laing",
            "Navabisohi",
            "(none)",
            "Rougeau",
            "Chukuka",
            "Laing",
            "Navabisohi",
            "Rougeau",
            "Chukuka",
            "Laing",
            "Navabisohi, Rougeau"
        ]
    ],
    "pageTitle": "Courses/Computer Science/CPSC 601.29.ISSA.W2014 - wiki.ucalgary.ca",
    "title": "Sessions",
    "url": "http://wiki.ucalgary.ca/page/Courses/Computer_Science/CPSC_601.29.ISSA.W2014",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00217-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 266405714,
    "recordOffset": 266389774,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 30 Oct 2014 21:23:08 GMT",
    "textBeforeTable": "This is the schedule of papers to read and presentations. Everyone is responsible for reading the \"primary reading\" each week (1 or 2 papers). Presenters are responsible for reading both the background readings and the primary readings. Session List and Schedule This is a graduate seminar. Your grade is based on your ability to critically assess and present research work in the field of systems security. You will have the opportunity to make three presentations. Policies The course is held once per week from 4pm to 6:45pm in ICT 616. There will be a short break around 5:15pm. Logistics A graduate seminar on systems security. Information Systems Security Analysis 2.2 News 2.1 Ethics and OPSEC 2 Miscellaneous Links 1.7 Supplemental Papers (Categorized) 1.6 Supplemental Papers 1.5 Papers (Primary Readings) 1.4 High--Level Syllabus / Topics 1.3 Session List and Schedule 1.2 Policies 1.1 Logistics 1 Information Systems Security Analysis Contents search navigation, Jump to: <",
    "textAfterTable": "High--Level Syllabus / Topics Ethics Code Injection (Attacks and Countermeasures) stack heap return-to-libc, ROP countermeasures Artificial Diversity Defensive Weird Machines Isolation, Approaches to System Instrumentation Virtualization and Security IDS Confusion, Parsing Filtering and Reverse Engineering Network Protocols and File Formats Papers (Primary Readings) (TOPIC: Sandboxing) \"Improving Host Security with System Call Policies\" by Niels Provos, 12th USENIX Security Symposium, Washington, DC, August 2003. PDF (TOPIC: Sandboxing/Policy Enforcement) Watson, R. N. M., Anderson, J., Laurie, B., and Kennaway, K. Capsicum: practical capabilities for UNIX. In Proceedings of the 19th USENIX Security Symposium, Washington, DC, August 2010 (TOPIC: Virtualization) SecVisor: A Tiny Hypervisor to Provide Lifetime Kernel Code Integrity for Commodity OSes (SOSP 2007) (TOPIC: NIDS/LangSec) Network Intrusion Detection: Evasion, Traffic Normalization, and End-to-End Protocol Semantics. Mark Handley and Vern Paxson and Christian Kreibich USENIX paper [http://www.icir.org/vern/papers/norm-usenix-sec-01-html/ html (TOPIC: NIDS/LangSec) Insertion, Evasion, and Denial of Service: Eluding Network Intrusion Detection by Thomas H Ptacek and Timothy M. Newsham Automatic Network Protocol Analysis by Wondracek et al. (NDSS 2008) Automatic Protocol Format Reverse Engineering through Context-Aware Monitored Execution by Lin et al., NDSS 2008 Tupni: Automatic Reverse Engineering of",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}