{
    "relation": [
        [
            "",
            "Xinyuan Real Estate (NYSE: XIN )",
            "Veolia Environnement (NYSE: VE )",
            "Waste Management (NYSE: WM )",
            "Lockheed Martin (NYSE: LMT )",
            "Raytheon (NYSE: RTN )",
            "Northrop Grumman (NYSE: NOC )",
            "General Electric (NYSE: GE )"
        ],
        [
            "Dividend Yield",
            "14.9%",
            "8.8%",
            "4.4%",
            "4.3%",
            "4.2%",
            "3.9%",
            "3.8%"
        ],
        [
            "P/E Ratio",
            "2.6",
            "10.3",
            "15.5",
            "8.7",
            "7.4",
            "7.9",
            "12.4"
        ],
        [
            "% Below 12-Month High",
            "28.1%",
            "50.6%",
            "22.4%",
            "16.1%",
            "23.3%",
            "26.5%",
            "26.7%"
        ],
        [
            "CAPS Rating (out of 5)",
            "****",
            "*****",
            "*****",
            "****",
            "****",
            "****",
            "****"
        ]
    ],
    "pageTitle": "7 Cheap Industrial Stocks Paying Cold, Hard Cash (GE, LMT, NOC, RTN, VEOEY, WM, XIN)",
    "title": "",
    "url": "http://www.fool.com/investing/dividends-income/2011/08/16/7-cheap-industrial-stocks-paying-cold-hard-cash.aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00277-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 444895411,
    "recordOffset": 444865623,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{19582=I realize Yahoo Finance lists XIN's dividend at 14.9%, however XIN has only paid a one time .10 dividend back in june of 2011. Xin has alluded to maintaining some sort of dividend going forward in their conference calls, but they have not released any information regarding the amount or frequency of future dividends, if any (at least not in the information I am privy to). They seem to be weighing out using the cash reserves for regular dividends be it on a quarterly or yearly schedule, or using that cash to buy land at depressed levels for future development... Most likely, a combination of both will occur, but the dividend rate is not set in stone quite yet., 59809=By Jordan DiPietro | More Articles August 16, 2011 | Comments (3), 8943=DocumentId: 1539689, ~/Articles/ArticleHandler.aspx, 8/3/2015 3:23:02 PM, 18319=VE pays a dividend annually in May, except in 2010 Yahoo does show them paying one. And they are 'restructuring', so chances are when May 2012 rolls around, it may be like 2010. Need to be doing a bit more than simple stock screening to find true bargains in this market., 27328=Source: CAPS data as of Aug. 15.}",
    "textBeforeTable": "To help you on your quest, I ran a screen for industrial companies paying dividends above 2%, with P/E ratio's less than 17, that are trading at least 20% below their 12-month high, and that have garnered the respect of our CAPS investing community with at least a four- or five-star rating. I've ranked and ordered the results below by the top seven highest dividend payers. However, if you have some cash to invest, now is a great time to pick up some really awesome dividend stocks at dirt cheap prices. Companies that pay dividends have illustrated that over time, they have outperformed their nonpaying brethren. In addition, these same companies tend to be more conservative and more focused on rewarding their shareholders by consistently shelling out those lucrative dividend payments. So if you can take advantage of a time like right now, when the market is already down 10% over the last three months, you might be able to find that hidden gem you've been looking for. As the markets whipsawed up and down last week, investors panicked about what to do with their investments. Should they sell before things get worse or take advantage of opportunities that might be out there? It's a tough call to make sometimes. The best advice I can give is to stay the course of your investing strategy, whatever that may be. | More Articles August 16,",
    "textAfterTable": "Source: CAPS data as of Aug. 15. Granted, there are probably some good reasons why some of these stocks are trading so cheaply and have fallen from grace. Many of the defense companies have taken a beating as belt-tightening in Washington has forced investors to realize that some lucrative defense contracts may not be as prevalent moving forward as they once have been. However, some of these companies are actually Fool favorites. Read here about why I chose to buy Veolia for my Rising Star portfolio, and here to read about why my Foolish colleague Alyce Lomax recently bought shares of Waste Management for her portfolio. Nonetheless, these stocks are paying absolutely phenomenal dividends, and they are trading extremely cheap, so if you're interested in them, it would pay to do your own due diligence and look into them further. Seeking out other dividend stocks that could help boost your portfolio? Check out my colleague's brand new free article, \"The Downgrade Be Damned: Here's What I'm Buying Now.\"",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}