{
    "relation": [
        [
            "Citing Patent",
            "US7412444 *",
            "US7499945 *",
            "US7644083 *",
            "US7716211 *",
            "US8418055 *",
            "US8489619 *",
            "US8531710",
            "US8600196",
            "US8970596 *",
            "US9075779",
            "US9081799",
            "US20110035656 *",
            "US20130215141 *"
        ],
        [
            "Filing date",
            "Feb 10, 2005",
            "Jun 21, 2006",
            "Sep 30, 2004",
            "Feb 10, 2004",
            "Feb 18, 2010",
            "May 30, 2012",
            "Aug 1, 2011",
            "Jul 6, 2010",
            "Feb 17, 2012",
            "Apr 22, 2013",
            "Dec 6, 2010",
            "",
            "Feb 17, 2012"
        ],
        [
            "Publication date",
            "Aug 12, 2008",
            "Mar 3, 2009",
            "Jan 5, 2010",
            "May 11, 2010",
            "Apr 9, 2013",
            "Jul 16, 2013",
            "Sep 10, 2013",
            "Dec 3, 2013",
            "Mar 3, 2015",
            "Jul 7, 2015",
            "Jul 14, 2015",
            "Feb 10, 2011",
            "Aug 22, 2013"
        ],
        [
            "Applicant",
            "Idx Systems Corporation",
            "Blackrock Financial Management, Inc.",
            "Teradata Us, Inc.",
            "Microsoft Corporation",
            "Google Inc.",
            "Aggregate Knowledge, Inc.",
            "Google Inc.",
            "Google Inc.",
            "Apple Inc.",
            "Google Inc.",
            "Google Inc.",
            "King Martin T",
            "Apple Inc."
        ],
        [
            "Title",
            "Efficient indexing of hierarchical relational database records",
            "System and method for implementing dynamic set operations on data stored in a sorted array",
            "Efficiently performing inequality joins",
            "System and method for facilitating full text searching utilizing inverted keyword indices",
            "Identifying a document by performing spectral analysis on the contents of the document",
            "System and method for the dynamic generation of correlation scores between arbitrary objects",
            "Association of a portable scanner with input/output and storage devices",
            "Optical scanners, such as hand-held optical scanners",
            "Using render-graph characteristics to optimize the rendering of an adjusted image",
            "Performing actions based on capturing information from rendered documents, such as documents under copyright",
            "Using gestalt information to identify locations in printed information",
            "Identifying a document by performing spectral analysis on the contents of the document",
            "Using Render-Graph Characteristics to Optimize the Rendering of an Adjusted Image"
        ]
    ],
    "pageTitle": "Patent US7069272 - System and method for implementing dynamic set operations on data stored in ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7069272?dq=5,815,488",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 17,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986444.39/warc/CC-MAIN-20150728002306-00193-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 487616203,
    "recordOffset": 487588438,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6492=Continuing on with the example of FIGS. 2 and 3, the key values stored at the root and each internal node of the tree represent the trade date set forth in table 10. For instance, the key value of the root is 414 which corresponds to the trade date of Apr. 14, 2002, located at row six of data table 10. Similarly the red node to the left of the root contains the key value 321 representing the trade date of Mar. 21, 2002 located at row 4 of data table 10, while the red node to the right of the root node contains the key value 714 corresponding to the trade date of Jul. 14, 2002, which is located at the tenth row of data table 10.}",
    "textBeforeTable": "Patent Citations Although the system and method of the subject invention has been described with respect to preferred embodiments, those skilled in the art will readily appreciate that changes and modifications may be made thereto without departing from the spirit and scope of the present invention as defined by the appended claims. } x.color = black; } } } x = root; rightRotate(x.parent); w.left.color = black; x.parent.color = black; w.color = x.parent.color; } w = x.parent.left; leftRotate(w); w.color = red; w.right.color = black; if (w.left.color == black) { } else {",
    "textAfterTable": "US8418055 * Feb 18, 2010 Apr 9, 2013 Google Inc. Identifying a document by performing spectral analysis on the contents of the document US8489619 * May 30, 2012 Jul 16, 2013 Aggregate Knowledge, Inc. System and method for the dynamic generation of correlation scores between arbitrary objects US8531710 Aug 1, 2011 Sep 10, 2013 Google Inc. Association of a portable scanner with input/output and storage devices US8600196 Jul 6, 2010 Dec 3, 2013 Google Inc. Optical scanners, such as hand-held optical scanners US8970596 * Feb 17, 2012 Mar 3, 2015 Apple Inc. Using render-graph characteristics to optimize the rendering of an adjusted image US9075779 Apr 22, 2013 Jul 7, 2015 Google Inc. Performing actions based on capturing information from rendered documents, such as documents under copyright US9081799 Dec 6, 2010 Jul 14, 2015 Google Inc. Using gestalt information to identify locations in printed information",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}