{
    "relation": [
        [
            "Citing Patent",
            "US5955960 *",
            "US6104591 *",
            "US6362967",
            "US6370000 *",
            "US6385030",
            "US6980647",
            "US7965479 *",
            "US8179655"
        ],
        [
            "Filing date",
            "Mar 24, 1997",
            "Mar 9, 1998",
            "Apr 20, 2000",
            "Apr 11, 2000",
            "Sep 2, 1999",
            "Jan 11, 2000",
            "Sep 19, 2007",
            "Mar 28, 2008"
        ],
        [
            "Publication date",
            "Sep 21, 1999",
            "Aug 15, 2000",
            "Mar 26, 2002",
            "Apr 9, 2002",
            "May 7, 2002",
            "Dec 27, 2005",
            "Jun 21, 2011",
            "May 15, 2012"
        ],
        [
            "Applicant",
            "Jean-Luc Monnier",
            "Teccor Electronics, Inc.",
            "Teccor Electronics, Lp",
            "Teccor Electronics, Lp",
            "Marconi Communications, Inc.",
            "Teccor Electronics, Lp",
            "Polytronics Technology Corporation",
            "Pulse Electronics, Inc."
        ],
        [
            "Title",
            "Tamper resistant electronic lock and method of using same",
            "Telephone line protection element",
            "Telephone line surge protector",
            "Primary telephone line protector with fail safe",
            "Reduced signal loss surge protection circuit",
            "Primary telephone line protector with failsafe",
            "Over-current and over-voltage protection assembly apparatus",
            "Surge protection apparatus and methods"
        ]
    ],
    "pageTitle": "Patent US5327318 - Telecommunication equipment protector - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5327318?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00251-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470845991,
    "recordOffset": 470827997,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It should be understood that although particular embodiments of the invention have been described by way of illustrating the invention, the invention includes all modifications and equivalents of the disclosed embodiments falling within the scope of the appended claims. Devices made in accordance with the invention provide a desired first level of surge protection in a reliable and efficient way and are adapted to provide the second level of surge protection with improved speed and reliability by failing in a closed or short circuit condition without any moving parts to provide proper protection for circuit components and telecommunication equipment in the novel surge protection system of the invention. FIGS. 13 and 14 show an embodiment also shown in FIG. 1, in which protection is provided between tip and common and ring and common by using first and second semiconducting elements 40 mounted on heat sink plate 42. Pad 32 of fingers 28 are soldered to the top electrode of a respective semiconducting element after a force is applied to ensure that the pad is essentially engaged with the top electrode as in the previous embodiment. Pad 34, lying in the plane of lead frame 20 is soldered at the same time to heat sink plate 42. The device is then encapsulated and severed from the lead frame in the same manner as in the previously described embodiment. The protective device made as described above provides balanced",
    "textAfterTable": "US6370000 * Apr 11, 2000 Apr 9, 2002 Teccor Electronics, Lp Primary telephone line protector with fail safe US6385030 Sep 2, 1999 May 7, 2002 Marconi Communications, Inc. Reduced signal loss surge protection circuit US6980647 Jan 11, 2000 Dec 27, 2005 Teccor Electronics, Lp Primary telephone line protector with failsafe US7965479 * Sep 19, 2007 Jun 21, 2011 Polytronics Technology Corporation Over-current and over-voltage protection assembly apparatus US8179655 Mar 28, 2008 May 15, 2012 Pulse Electronics, Inc. Surge protection apparatus and methods * Cited by examiner Classifications U.S. Classification 361/55, 361/103, 361/111 International Classification B23Q17/22, H02H9/02, H02H3/22, H02H7/20, H01T4/08 Cooperative Classification B23Q17/22, Y10T29/49121, H01T4/08",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}