{
    "relation": [
        [
            "Date",
            "Jan 5, 2010",
            "Mar 9, 2010",
            "Sep 3, 2010",
            "Nov 4, 2010",
            "May 25, 2012"
        ],
        [
            "Code",
            "AS",
            "CC",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: ICON HEALTH & FITNESS, INC., UTAH Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:WATTERSON, SCOTT R.;DALEBOUT, WILLIAM T.;ASHBY, DARREN C.;REEL/FRAME:023731/0448;SIGNING DATES FROM 20091222 TO 20091229 Owner name: ICON HEALTH & FITNESS, INC.,UTAH Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:WATTERSON, SCOTT R.;DALEBOUT, WILLIAM T.;ASHBY, DARREN C.;SIGNING DATES FROM 20091222 TO 20091229;REEL/FRAME:023731/0448",
            "",
            "Owner name: BANK OF AMERICA, N.A., AS ADMINISTRATIVE AGENT, MA Free format text: SECURITY INTEREST;ASSIGNORS:ICON HEALTH & FITNESS, INC., A DELAWARE CORPORATION;HF HOLDINGS, INC., A DELAWARE CORPORATION;ICON INTERNATIONAL HOLDINGS, INC., A DELAWARE CORPORATION;AND OTHERS;REEL/FRAME:024953/0310 Effective date: 20100729",
            "Owner name: WILMINGTON TRUST FSB, AS COLLATERAL AGENT, MINNESO Free format text: SECURITY AGREEMENT;ASSIGNORS:ICON HEALTH & FITNESS, INC., A DELAWARE CORPORATION;ICON INTERNATIONALHOLDINGS, INC., A DELAWARE CORPORATION;UNIVERSAL TECHNICAL SERVICES, A UTAH CORPORATION;AND OTHERS;REEL/FRAME:025309/0683 Effective date: 20101008",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7455622 - Systems for interaction with exercise device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7455622?dq=5,742,768",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00160-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 494482395,
    "recordOffset": 494408732,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6353=With reference to FIG. 17D, for ease of explanation, let us assume that three individuals, one on the east coast, one in the Mountain Time zone, and one on the west coast wish to race against each other at 5:00 pm local time. Each competitor accesses communication module 254 and selects each other as competitors, block 430, in a time-adjusted race, as depicted in decision block 422. Each competitor defines the particular time period or adjusted time at which each individual is to race, as depicted by block 432. The selections and adjusted times for each competitor are stored in one or more databases or other storage modules associated with an identification number given to the time-adjusted race or directly to each competitor. Once the information is entered and stored, the competitor on the east coast may perform their race on their own or with the aid of a pace setter generated by the computer at the appointed time, as depicted by block 434. Once the east coast competitor finishes their race, the statistical information and a real-time representation of the race is stored, as represented by block 436. Upon the arrival of the adjusted time for the Mountain Time zone competitor to race, communication module 254 will rebroadcast the particular race performed by the east coast competitor to the Mountain Time zone competitor. Similarly, upon the time for the west coast competitor to race, communication module 254 will rebroadcast the particular race performed by the east coast competitor and optionally the Mountain Time zone competitor to the west coast competitor. It may be appreciated by one skilled in the art that the live on live and time-adjusted races may be performed in a variety of different manners. For example, the number of competitors is not limited to any specific number. Additionally, the time adjustments may allow for competitors throughout the world to race one against another.}",
    "TableContextTimeStampAfterTable": "{206606=It may be appreciated by one skilled in the art that various other configurations of the race around the world type race are applicable and known to one skilled in the art. For example, in another configuration of the race around the world type race, a user may select a particular time period, say from January 1 to February 1, and race against others to see who travels the furthest distance within the given time period. Again, communication module 254 tracks the distance traveled of each competitor and may provide graphical representations of the position of one competitor against the other competitors. In still yet another configuration, the race around the world may include racing over various types of terrain ranging from deserts, mountains, and the like. As such, each competitor follows a similar overall exercise profile and communication module 254 tracks the time that a user takes to complete the race, for example, when a user slows down the treadmill based upon the terrain traversed., 32618=This is a divisional application of U.S. patent application Ser. No. 09/641,627, filed Aug. 18, 2000, now U.S. Pat. No. 7,166,062 entitled “Systems for Interaction with Exercise Device,” which is a continuation-in-part application of both U.S. patent application Ser. No. 09/349,608, filed Jul. 8, 1999, now U.S. Pat. No.6,312,363 entitled “Systems and Methods for Providing an Improved Exercise Device with Motivational Programming,” and U.S. patent application Ser. No. 09/496,560, filed Feb. 2, 2000, now U.S. Pat. No. 6,447,424 entitled “System and Method for Selective Adjustment of Exercise Apparatus,” each of which is incorporated herein by reference., 242183=Embodiments of the present invention are also disclosed in copending U.S. patent applications entitled (i) Computer Systems and Methods for Interaction with Exercise Device, to Scott R. Watterson, William T. Dalebout and Darren C. Ashby, filed Aug. 18, 2000, which is incorporated herein in its entirety by reference; and (ii) Systems and Methods for Interaction with Exercise Device, to Scott R. Watterson, William T. Dalebout and Darren C. Ashby, filed Aug. 18, 2000, which is incorporated herein in its entirety by reference., 211016=As suggested above, the user may select a time-adjusted race. The time-adjusted race allows two or more competitors to conveniently race against each other. For example, the time-adjusted race allows an individual on the east coast to race against individuals in the Mountain Time zone and the west coast at the same local time, for example 5:00 p.m. The time-adjusted race, therefore, stores the race of one individual, say the individual on the east coast who races at 5:00 p.m. and then rebroadcasts the stored exercise race to those other individuals in various other time zones upon reaching the designated time period, such as 5:00 p.m. Mountain Standard Time, pacific time, and the like.}",
    "textBeforeTable": "Patent Citations The present invention may be embodied in other specific forms without departing from its spirit or essential characteristics. The described embodiments are to be considered in all respects only as illustrative and not restrictive. The scope of the invention is, therefore, indicated by the appended claims rather than by the foregoing description. All changes which come within the meaning and range of equivalency of the claims are to be embraced within their scope. As used in this specification and the appended claims, the phrases “communicating with,” and “in communication with” and similar phrases shall mean any type of applicable communication known to one skilled in the art in light of the disclosure herein, such as electrical communication, optical communication, physical communication, magnetic communication, software communication, hardware communication, data communication, and the like. Embodiments of the present invention are also disclosed in copending U.S. patent applications entitled (i) Computer Systems and Methods for Interaction with Exercise Device, to Scott R. Watterson, William T. Dalebout and Darren C. Ashby, filed Aug. 18, 2000, which is incorporated herein in its entirety by reference; and (ii) Systems and Methods for Interaction with Exercise Device, to Scott R. Watterson, William T. Dalebout and Darren C. Ashby, filed Aug. 18, 2000, which is incorporated herein in its entirety by reference. As mentioned, the presently described systems, methods, and devices may be used in a master-slave system. In such",
    "textAfterTable": "Aerobitronics, Inc. Interactive exercise device US4542897 Oct 11, 1983 Sep 24, 1985 Melton Donald L Exercise cycle with interactive amusement device US4544152 Jul 25, 1983 Oct 1, 1985 Taitel Charles M Passive-type treadmill US4549044 Oct 6, 1983 Oct 22, 1985 Cermetek Microelectronics, Inc. Remote telemetry unit US4556216 Aug 15, 1983 Dec 3, 1985 Pitkanen Alan R Computer directed exercising apparatus US4571682 Aug 22, 1983 Feb 18, 1986 Computerized Sports Equipment, Inc. System and method for skill enhancement and behavior modification US4642769 Apr 11, 1985 Feb 10, 1987 Wright State University Method and apparatus for providing stimulated exercise of paralyzed limbs US4659074 Mar 14, 1985 Apr 21, 1987 Landice Products, Inc. Passive-type treadmill having an improved governor assembly and an electromagnetic speedometer integrated into the flywheel assembly US4687195 Feb 6, 1984 Aug 18, 1987 Tri-Tech, Inc. Treadmill exerciser",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}