{
    "relation": [
        [
            "Citing Patent",
            "US7301543",
            "US7307646",
            "US7592996",
            "US7598961",
            "US7619637",
            "US7742205",
            "US7864188",
            "US8013867",
            "US8023074",
            "US8259127",
            "US8350940 *",
            "US8519925",
            "US8810613",
            "US8860642 *",
            "US20040080479 *",
            "US20040140983 *",
            "US20040174380 *",
            "US20040196297 *",
            "US20040232844 *",
            "US20040246265 *",
            "US20040246278 *",
            "US20040246279 *",
            "US20040246381 *",
            "US20040246404 *",
            "US20090167779 *",
            "US20110279493 *",
            "WO2004109456A2 *"
        ],
        [
            "Filing date",
            "9 Apr 2004",
            "14 Jan 2002",
            "18 May 2007",
            "21 Oct 2003",
            "9 Apr 2004",
            "16 Dec 2005",
            "16 Oct 2007",
            "4 Apr 2006",
            "10 Jan 2006",
            "25 Sep 2007",
            "8 Jun 2009",
            "30 Nov 2006",
            "14 Jan 2011",
            "5 Jul 2011",
            "16 Jan 2003",
            "22 Jan 2003",
            "4 Mar 2003",
            "7 Apr 2003",
            "20 May 2003",
            "6 Jun 2003",
            "6 Jun 2003",
            "6 Jun 2003",
            "6 Jun 2003",
            "6 Jun 2003",
            "24 Dec 2008",
            "",
            "2 Jun 2004"
        ],
        [
            "Publication date",
            "27 Nov 2007",
            "11 Dec 2007",
            "22 Sep 2009",
            "6 Oct 2009",
            "17 Nov 2009",
            "22 Jun 2010",
            "4 Jan 2011",
            "6 Sep 2011",
            "20 Sep 2011",
            "4 Sep 2012",
            "8 Jan 2013",
            "27 Aug 2013",
            "19 Aug 2014",
            "14 Oct 2014",
            "29 Apr 2004",
            "22 Jul 2004",
            "9 Sep 2004",
            "7 Oct 2004",
            "25 Nov 2004",
            "9 Dec 2004",
            "9 Dec 2004",
            "9 Dec 2004",
            "9 Dec 2004",
            "9 Dec 2004",
            "2 Jul 2009",
            "17 Nov 2011",
            "16 Dec 2004"
        ],
        [
            "Applicant",
            "Clairvoyante, Inc.",
            "Clairvoyante, Inc",
            "Samsung Electronics Co., Ltd.",
            "Samsung Electronics Co., Ltd.",
            "Samsung Electronics Co., Ltd.",
            "Vp Assets Limited Registered In British Virgin Islands",
            "Samsung Electronics Co., Ltd.",
            "Samsung Electronics Co., Ltd.",
            "Sharp Kabushiki Kaisha",
            "Samsung Electronics Co., Ltd.",
            "Aptina Imaging Corporation",
            "Vp Assets Limited",
            "Japan Display West Inc.",
            "Vp Assets Limited",
            "Credelle Thomas Lioyd",
            "Credelle Thomas Lloyd",
            "Credelle Thomas Lloyd",
            "Elliott Candice Hellen Brown",
            "Brown Elliott Candice Hellen",
            "Starkweather Gary K.",
            "Elliott Candice Hellen Brown",
            "Credelle Thomas Lloyd",
            "Credelle Thomas Lloyd",
            "Elliott Candice Hellen Brown",
            "Tatsuki Inuzuka",
            "Gia Chuong Phan",
            "Microsoft Corp"
        ],
        [
            "Title",
            "Systems and methods for selecting a white point for image displays",
            "Color display pixel arrangements and addressing means",
            "Multiprimary color display with dynamic gamut mapping",
            "method and apparatus for converting from a source color space to a target color space",
            "Systems and methods for improved gamut mapping from one image data set to another",
            "Perceptual color matching method between two different polychromatic displays",
            "Systems and methods for selecting a white point for image displays",
            "Systems and methods for implementing improved gamut mapping algorithms",
            "Liquid crystal display unit",
            "Systems and methods for reducing desaturation of images rendered on high brightness displays",
            "Image sensors and color filter arrays for charge summing and interlaced readout modes",
            "Multi-resolution display system",
            "Driving method for image display apparatus and driving method for image display apparatus assembly",
            "Display and weighted dot rendering method",
            "Sub-pixel arrangements for striped displays and methods and systems for sub-pixel rendering same",
            "System and methods of subpixel rendering implemented on display panels",
            "Systems and methods for motion adaptive filtering",
            "Image data set with embedded pre-subpixel rendered image",
            "Subpixel rendering for cathode ray tube devices",
            "Four-color display",
            "System and method for compensating for visual effects upon panels having fixed pattern noise with reduced quantization error",
            "Dot inversion on novel display panel layouts with extra drivers",
            "System and method of performing dot inversion with standard drivers and backplane on novel display panel layouts",
            "Liquid crystal display backplane layouts and addressing for non-standard subpixel arrangements",
            "Color signal generating device",
            "Display and weighted dot rendering method",
            "Four-color display"
        ]
    ],
    "pageTitle": "Patent US20040114046 - Method and apparatus for rendering image signal - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US20040114046",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00215-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486805115,
    "recordOffset": 486779033,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{37259=[0001] This application claims the priority of Korean Patent Application No. 2002-80879, filed on Dec. 17, 2002, in the Korean Intellectual Property Office, the disclosure of which is incorporated herein in its entirety by reference.}",
    "textBeforeTable": "Patent Citations [0075] While this invention has been particularly shown and described with reference to preferred embodiments thereof, it will be understood by those skilled in the art that various changes in form and details may be made therein without departing from the spirit and scope of the invention as defined by the appended claims. [0074] In the method and apparatus for rendering an image signal according to the present invention, the number of driver ICs is the same as the number of driver ICs of a conventional RGB rendering apparatus, and one primary color is added to three RGB primary colors such that a color rendering range can be enlarged or luminance can be improved while a color distortion does not occur. [0073] As described above, in a method and apparatus for rendering an image signal, the unbalance of colors outputted from each pixel is prevented using sub-pixel values of a peripheral pixel when a pixel is composed of three sub-pixels so that two primary colors among the four primary colors alternate with each other in the apparatus for rendering an image signal having four sub-pixels that can render four primary colors. [0072] A method for rendering an image signal according to the present invention can also be embodied on computer readable recording media. The computer readable recording media include all types of recording devices in",
    "textAfterTable": "US20040246279 * 6 Jun 2003 9 Dec 2004 Credelle Thomas Lloyd Dot inversion on novel display panel layouts with extra drivers US20040246381 * 6 Jun 2003 9 Dec 2004 Credelle Thomas Lloyd System and method of performing dot inversion with standard drivers and backplane on novel display panel layouts US20040246404 * 6 Jun 2003 9 Dec 2004 Elliott Candice Hellen Brown Liquid crystal display backplane layouts and addressing for non-standard subpixel arrangements US20090167779 * 24 Dec 2008 2 Jul 2009 Tatsuki Inuzuka Color signal generating device US20110279493 * 17 Nov 2011 Gia Chuong Phan Display and weighted dot rendering method WO2004109456A2 * 2 Jun 2004 16 Dec 2004 Microsoft Corp Four-color display * Cited by examiner Classifications",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}