{
    "relation": [
        [
            "Citing Patent",
            "US6222862 *",
            "US6327295 *",
            "US6526355 *",
            "US6661820 *",
            "US7356580",
            "US7501601 *",
            "US7565220",
            "US7672747",
            "US7759606 *",
            "US7804041 *",
            "US7814046",
            "US7820936 *",
            "US7888621 *",
            "US8010483",
            "US8030595 *",
            "US8222562 *",
            "US8295963",
            "US8503497",
            "US8759713 *",
            "US8837543 *",
            "US8881735",
            "US9067278 *",
            "US9067281 *",
            "US20100126974 *",
            "US20100314365 *",
            "US20100314734 *",
            "US20110011837 *",
            "US20110024401 *",
            "US20110216794 *",
            "US20110220623 *",
            "US20120156875 *",
            "US20130058366 *",
            "US20130272332 *",
            "US20140291304 *",
            "WO2012091910A2 *"
        ],
        [
            "Filing date",
            "Jul 21, 1998",
            "Oct 19, 2000",
            "Mar 30, 2000",
            "Aug 9, 2000",
            "Mar 30, 2000",
            "Oct 24, 2006",
            "Sep 28, 2006",
            "Mar 29, 2007",
            "Jul 18, 2006",
            "Mar 9, 2004",
            "Sep 29, 2006",
            "Jul 2, 2004",
            "Sep 29, 2006",
            "Aug 26, 2010",
            "Sep 26, 2006",
            "Sep 28, 2010",
            "Jan 25, 2010",
            "Dec 12, 2011",
            "Jun 14, 2009",
            "Jan 4, 2012",
            "Apr 22, 2011",
            "Mar 29, 2013",
            "Sep 9, 2009",
            "Nov 17, 2009",
            "Jun 12, 2009",
            "Jun 14, 2009",
            "",
            "",
            "",
            "Sep 9, 2009",
            "",
            "Apr 8, 2011",
            "Jan 4, 2012",
            "Mar 29, 2013",
            "Dec 12, 2011"
        ],
        [
            "Publication date",
            "Apr 24, 2001",
            "Dec 4, 2001",
            "Feb 25, 2003",
            "Dec 9, 2003",
            "Apr 8, 2008",
            "Mar 10, 2009",
            "Jul 21, 2009",
            "Mar 2, 2010",
            "Jul 20, 2010",
            "Sep 28, 2010",
            "Oct 12, 2010",
            "Oct 26, 2010",
            "Feb 15, 2011",
            "Aug 30, 2011",
            "Oct 4, 2011",
            "Jul 17, 2012",
            "Oct 23, 2012",
            "Aug 6, 2013",
            "Jun 24, 2014",
            "Sep 16, 2014",
            "Nov 11, 2014",
            "Jun 30, 2015",
            "Jun 30, 2015",
            "May 27, 2010",
            "Dec 16, 2010",
            "Dec 16, 2010",
            "Jan 20, 2011",
            "Feb 3, 2011",
            "Sep 8, 2011",
            "Sep 15, 2011",
            "Jun 21, 2012",
            "Mar 7, 2013",
            "Oct 17, 2013",
            "Oct 2, 2014",
            "Jul 5, 2012"
        ],
        [
            "Applicant",
            "Mitsubishi Denki Kabushiki Kaisha",
            "Matsushita Electric Industrial Co., Ltd.",
            "Lam Research Corporation",
            "Perceptron, Inc.",
            "Lam Research Corporation",
            "Xenetech U.S.A., Inc.",
            "Lam Research Corporation",
            "Lam Research Corporation",
            "International Business Machines Corporation",
            "Lasag Ag",
            "Lam Research Corporation",
            "Boston Scientific Scimed, Inc.",
            "International Paper Co.",
            "Lam Research Corporation",
            "Nissan Motor Co., Ltd.",
            "Sabic Innovative Plastics Ip B.V.",
            "Lam Research Corporation",
            "Applied Materials, Inc.",
            "Terepac Corporation",
            "Koninklijke Philips N.V.",
            "Precise Light Surgical, Inc.",
            "Photon Automation, Inc.",
            "Bystronic Laser Ag",
            "The Thomas Machines S.A.",
            "Frey Jr Jeffrey D",
            "Terepac",
            "Sabic Innovative Plastics Ip B.V.",
            "Trumpf Werkzeugmaschinen Gmbh + Co. Kg",
            "Gk Techcom Llc",
            "Bystronic Laser Ag",
            "Srinivas Ramanujapuram A",
            "Universite De Limoges",
            "Koninklijke Philips N.V.",
            "Photon Automation, Inc.",
            "Applied Materials, Inc."
        ],
        [
            "Title",
            "Control method of exciting a pulse laser and power supply unit for exciting a pulse laser",
            "Gas laser oscillator",
            "Integrated full wavelength spectrometer for wafer processing",
            "Method and system for maximizing safe laser power of structured laser light projectors used with imaging sensors",
            "Plug and play sensor integration for a process module",
            "Automated laser engraver",
            "Targeted data collection architecture",
            "Recipe-and-component control module and methods thereof",
            "Method and apparatus for repair of reflective photomasks",
            "Laser device for drilling holes in components of a fluid injection device",
            "Dynamic component-tracking system and methods therefor",
            "Method and apparatus for controlling and adjusting the intensity profile of a laser beam employed in a laser welder for welding polymeric and metallic components",
            "Systems and methods for automatically adjusting the operational parameters of a laser cutter in a package processing environment",
            "Component-tracking system and methods therefor",
            "Display method for laser irradiations state and display system of laser irradiation state",
            "Systems for forming a plurality of cells on the mastering tools",
            "Methods for performing data management for a recipe-and-component control module",
            "Protection device for solid state laser",
            "Methods for interconnecting bonding pads between components",
            "Inhibiting unauthorized access to a laser source",
            "Flash vaporization surgical systems and method",
            "Pulse spread laser",
            "Laser cutting system for cutting a workpiece with a laser beam at a variable cutting speed",
            "Method of producing drip irrigation tubes",
            "Method and Apparatus for Using a Laser to Both Score and Emblazon a Wrapping Sheet",
            "Processes and structures for IC fabrication",
            "Systems for forming a plurality of cells on the mastering tools",
            "Recovery of Energy from a Laser Machining System",
            "Pseudo-CW Quantum Cascade Laser System",
            "Laser cutting system for cutting a workpiece with a laser beam at a variable cutting speed",
            "Laser based processing of layered materials",
            "Pulsed supercontinuum source of variable pulse duration",
            "Inhibiting unauthorized access to a laser source",
            "Pulse spread laser",
            "Protection device for solid state laser"
        ]
    ],
    "pageTitle": "Patent US6091749 - Laser system controller - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6091749?dq=456322",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986444.39/warc/CC-MAIN-20150728002306-00038-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474410487,
    "recordOffset": 474388373,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26055=High-power, solid state lasers, such as diode slab lasers, that are used for many purposes, such as cutting, drilling and welding of various materials for precision laser machining (PLM), electronics manufacture, medical treatment, nuclear fusion, laser weapons, etc., are known in the art. A solid state slab laser will include one or more gain modules each having a solid state laser gain medium, such as a crystal of neodymium yttrium aluminum garnet (Nd:YAG), Yb:YAG, Ti:Sapphire or neodymium glass (Nd:Glass), and an optical pumping source to produce a population inversion in the gain medium. The gain medium typically has a slab configuration with a rectangular cross-section and optically polished major side and end faces. The optical pumping source generally is one or more diode arrays positioned adjacent to the side faces of the slab. The laser gain medium absorbs light radiation from the diode arrays to create a population inversion within the medium to produce a laser beam output. The end faces of the slab are preferably formed at a non-perpendicular angle to the side faces so that light travels longitudinally in a zig-zag pattern through the laser gain medium as it is reflected off of the side faces. A high power solid state slab laser of this type is disclosed in U.S. Pat. No. 5,555,254 issued to Injeyan et al., Sep. 10, 1996 and U.S. patent application Ser. No. 08/683,585, filed Jul. 15, 1996, now U.S. Pat. No. 5,790,575, titled Diode Laser Pumped Solid State Laser Gain Module, and assigned to the assignee of the instant invention., 28619=Depending on the particular application of the laser beam, it may be desirable to modulate the laser beam to provide high peak power pulses for cutting and drilling applications. The modulator modulates the relatively long pulses from the gain modules to provide short duration beam pulses (such as on the order of 100 nanoseconds) having a relatively high peak power, for example, on the order of 500 kilowatts, that provides greater precision and control for certain applications. In one example, the laser beam pulses generated by the high power solid state laser gain module are modulated by an acoustical optical (AO) modulator that provides the modulation wave for modulating the beam pulses from the gain module. The modulated wave is also capable of being varied in frequency and pulse width to give even greater variability for different applications and materials. U.S. patent application Ser. No. 08/593,961, filed Jan. 30, 1996, titled \"Laser Pulse Profile Control By Modulating Relaxation Oscillations\", assigned to the Assignee of this application, provides a more detailed discussion of a modulator for a solid state diode slab laser.}",
    "textBeforeTable": "Patent Citations The foregoing discussion discloses and describes merely exemplary embodiments of the present invention. One skilled in the art will readily recognize from such discussion, and from the accompanying drawings and claims, that various changes, modifications and variations can be made therein without departing from the spirit and scope of the invention as defined in the following claims. The controller 12 discussed above provides controlled ramping of the beam output intensity and modulation from one output setting to a next output setting during actual operation of a PLM operation. Additionally, the various features of the controller 12 discussed above provide increased operator convenience and accuracy over known laser controllers in the art. System shut down electronics 70 provides an interface from user interlocks 72 to the computer 14. The user interlocks 72 are those safety switches and locks that the user of the system 10 can selectively connect depending on the location and application of the system. For example, the actual laser is typically located in a separate room, where the doors to the room include door interlocks such that if the door is opened during operation, the laser will shut off. The system shut down electronics 70 bypass the computer 14 and directly shuts down the primary power supplies 60 through the isolation system 58. Additionally, the system shut down electronics 70 gates off the pulses to block them so they are prevented from being outputted",
    "textAfterTable": "US20110011837 * Jan 20, 2011 Sabic Innovative Plastics Ip B.V. Systems for forming a plurality of cells on the mastering tools US20110024401 * Feb 3, 2011 Trumpf Werkzeugmaschinen Gmbh + Co. Kg Recovery of Energy from a Laser Machining System US20110216794 * Sep 8, 2011 Gk Techcom Llc Pseudo-CW Quantum Cascade Laser System US20110220623 * Sep 9, 2009 Sep 15, 2011 Bystronic Laser Ag Laser cutting system for cutting a workpiece with a laser beam at a variable cutting speed US20120156875 * Jun 21, 2012 Srinivas Ramanujapuram A Laser based processing of layered materials US20130058366 * Apr 8, 2011 Mar 7, 2013 Universite De Limoges Pulsed supercontinuum source of variable pulse duration US20130272332 * Jan 4, 2012 Oct 17, 2013 Koninklijke Philips N.V. Inhibiting unauthorized access to a",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}