{
    "relation": [
        [
            "Citing Patent",
            "US5204625 *",
            "US5529068 *",
            "US5739691 *",
            "US5759797 *",
            "US6825658 *",
            "US7324842",
            "US7604594 *",
            "US8140144",
            "US8497678",
            "US8917092",
            "US20120155732 *",
            "WO2003061458A2 *",
            "WO2011014456A1 *"
        ],
        [
            "Filing date",
            "Dec 20, 1990",
            "Jun 16, 1994",
            "Nov 28, 1995",
            "Jun 28, 1995",
            "Apr 2, 2002",
            "Jan 22, 2002",
            "Aug 4, 2004",
            "Dec 7, 2007",
            "Jul 23, 2010",
            "Jun 28, 2013",
            "",
            "Jan 6, 2003",
            "Jul 26, 2010"
        ],
        [
            "Publication date",
            "Apr 20, 1993",
            "Jun 25, 1996",
            "Apr 14, 1998",
            "Jun 2, 1998",
            "Nov 30, 2004",
            "Jan 29, 2008",
            "Oct 20, 2009",
            "Mar 20, 2012",
            "Jul 30, 2013",
            "Dec 23, 2014",
            "Jun 21, 2012",
            "Jul 31, 2003",
            "Feb 3, 2011"
        ],
        [
            "Applicant",
            "General Electric Company",
            "The Regents Of The University Of California",
            "The Regents Of The University Of California",
            "Director General Of National Agriculture Research Center, Ministry Of Agriculture, Forestry And Fisheries",
            "George Richard Coates",
            "Cortechs Labs, Inc.",
            "General Electric Company",
            "Cortechs Labs, Inc.",
            "Lynxrail Corporation",
            "Lynxrail Corporation",
            "University Of South Florida",
            "Cortechs Labs Inc",
            "Lynxrail Corporation"
        ],
        [
            "Title",
            "Segmentation of stationary and vascular surfaces in magnetic resonance imaging",
            "Synchronized digital signal processor for MRI reception",
            "Multi-frequency digital low pass filter for magnetic resonance imaging",
            "Apparatus and method for analyzing physiological state of organism",
            "NMR logging apparatus and methods for fluid typing",
            "Atlas and methods for segmentation and alignment of anatomical data",
            "Method and system of controlling ultrasound systems",
            "Atlas and methods for segmentation and alignment of anatomical data",
            "Method and apparatus usable for mining and mineral exploration",
            "Method and apparatus usable for mining and mineral exploration",
            "CT Atlas of Musculoskeletal Anatomy to Guide Treatment of Sarcoma",
            "Segmentation and alignment of anatomical data",
            "Method and apparatus usable for mining and mineral exploration"
        ]
    ],
    "pageTitle": "Patent USRE33259 - Method and apparatus for rapid NMR imaging of nuclear parameters with an object - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/USRE33259?dq=6377161",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00061-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 469257851,
    "recordOffset": 469216432,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{105225=With respect to observed differences in image contrast between tissues having differing T1/T2 ratios even though having equal proton densities, reference is also made to Hawkes et al, \"Nuclear Magnetic Resonance (NMR) Tomography of the Brain: A Preliminary Clinical Assessment With Demonstration of Pathology\", Journal of Computer Assisted Tomography, Volume 4, No. 5, Oct. 1980, pages 577-586. Here again, Hawkes suggests that the dependence of the NMR response to the T1/T2 ratio in individual scans can be varied by varying the degree of nutation (e.g., the transmitted RF pulse length and/or power). Hawkes also indicates that while there is great latitude to alter the contrast parameters in NMR imaging, these are at present chosen empirically, and the ideal setting for different pathological tissues will be determined with the feedback obtained during clinical use of the machine. Without specifically identifying them, Hawkes et al note that \"at least four separate variables contribute to the NMR signal\" and that \"it is likely that future machines will allow the operator several choices of imaging parameters to alter tissue contrast and also include some method of abstracting numerical information from the raw scan data\",, 74230=This application is a continuation-in-part of our earlier copending, commonly assigned application Ser. No. 926,571, filed July 20, 1978 (now U.S. Pat. No. 4,297,637) and Ser. No. 120,875, filed Feb. 12, 1980 (now U.S. Pat. No. 4,318,043). The entire specification and drawings of each of these earlier related copending applications is hereby expressly incorporated by reference., 89366=In 1973 Lauterbur first proposed and demonstrated the use of NMR as a method of obtaining images of hydrogen density spanning whole objects. His technique uses the same type of reconstructions as computed tomography and thus is subject to similar artifact problems in image reconstruction. The use of electronic scanning eliminates moving parts and, as with all NMR techniques, there is no exposure to ionizing radiation., 106512=Ling et al in a May 12, 1980 letter to the Editor (\"Comparison of NMR Water Proton's T1 Relaxation Times of Rabbit Tissues at 24 MHz and 2.5 MHz\", pages 748-756 of Physics in Medicine and Biology), note that the measured T1 NMR value can change as a function of NMR frequency and that T1 images may display more interesting detail than an actual image of measured proton density., 102083=In \"Medical Imaging By NMR\" by P. Mansfield et al, British Journal of Radiology, Volume 50, pages 188-194, 1977, some of the variations possible with the FID measurement of the T1 NMR parameter are discussed. In particular, at page 190 thereof, it was particularly recognized that the effective measured spin density at a given location depends upon the time delay between successive excitation pulses in accordance with the exponential relationship [1-exp(-τ/T1)] where τ equals the elapsed time delay. Making this observation, Mansfield et al noted that it would be possible for localized regions of the specimen to give an apparent picture brightness less than the actual localized spin density would suggest. They referred to this effect as spin-lattice relaxation time discrimination and alleged that most of the observed intensity variations between tissue types seemed to be attributable to this effect rather than to any real density variations, though if present, these two were said to \"aid picture contrast\". Continuing, Mansfield et al noted that measured variations in T1 within a given specimen are a reflection of variations in both the mobility of the free water, fat or oil and the concentration of dissolved minerals, nutrients, etc., etc., characteristic of the various tissues. Later on in the same publication, Mansfield et al noted that although no noticeable image discrimination was available between some specimens (e.g., normal and malignant tissues) at certain elapsed time delays between measurement cycles, clear differentiation between those same tissues could be obtained by changing the delay times. However, it should be noted that in this particular article, Mansfield et al are discussing an NMR measurement technique wherein each measurement cycle produces but a single FID (free induction decay) NMR response. There is no discussion of any imaging technique which relies upon spin echo NMR response which provide two simultaneously controllable machine timing parameters as in our presently described technique., 104800=Tanaka et al in \"Non-Invasive Measurement of Biological Information by Nuclear Magnetic Resonance: Measurement of Relaxation Time of a Particular Target by Magnetic Focusing Method\", Proceedings of the IEEE, Volume 66, No. 11, Nov. 1978, pages 1582-1583, also recognize that in measuring the T1 parameter, the resulting measured value is a function of the elapsed time between excitation pulses.}",
    "textBeforeTable": "Patent Citations While only one specific exemplary embodiment of this invention has been described in detail, those skilled in the art will appreciate that many modifications and variations of this embodiment may be made without departing from the novel and advantageous features of this invention. Accordingly, all such variations and modifications are intended to be included within the scope of the appended claims. Preferably the time delays embedded within the measurement sequence of FIGS. 6A-6E are operator selected via a keyboard from a continuously or discretely variable spectrum of possibilities. For example, in the exemplary embodiment the a parameter may be varied over a desired range by permitting the operator to key in changes in the various time delay constants employed in the FIG. 6A-6E sequence, using an executive program routine of the type shown in FIG. 7. Alternatively, several different fixed measurement sequences of the type shown in FIG. 6A-6E may be prepared for different timing parameters and selectively entered under operator control as shown in FIG. 8. As should also be apparent, a single measurement sequence provides spin echo data for each measured volume having two different \"a\" machine parameters (T2-related) associated therewith. Accordingly, a best fit to an exponential curve can be achieved using these two data points for each measured volume thus determining the T2 NMR parameter actually associated with that measured volume. By executing another complete measurement sequence utilizing a different \"b\" machine",
    "textAfterTable": "WO1981002788A1 * Mar 13, 1981 Oct 1, 1981 Nat Res Dev Methods of producing image information from objects WO1981002789A1 * Mar 13, 1981 Oct 1, 1981 Nat Res Dev Methods of producing image information from objects * Cited by examiner Non-Patent Citations Reference 1 \"Biological and Medical Imaging by NMR\" by Mansfield et al, Journal of Magnetic Resonance 29 (1978), pp. 355-373 (particularly pp. 363-367). 2 \"Effects of Diffusion on Free Precession in Nuclear Magnetic Resonance Experiments\" by Carr et al, Physical Review 94, vol. 94, No. 3, May 1, 1954, pp. 630-638 (see FIG. 6). 3 * Biological and Medical Imaging by NMR by Mansfield et al, Journal of Magnetic Resonance 29 (1978), pp. 355 373 (particularly pp. 363 367). 4 * Effects of Diffusion on Free Precession in Nuclear Magnetic Resonance Experiments by Carr et al, Physical Review 94, vol. 94, No. 3, May",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}