{
    "relation": [
        [
            "Citing Patent",
            "US5821127 *",
            "US6271035",
            "US6368864",
            "US6551831",
            "US6633368 *",
            "US6633369 *",
            "US6673568",
            "US6787302",
            "US6813017 *",
            "US7527924",
            "US7625712",
            "US7674598",
            "US7709653",
            "US7906295",
            "US7943320",
            "US8067602",
            "US8071326",
            "US8137975",
            "US8367358",
            "US8685661",
            "US8748159",
            "US8940499",
            "EP2267453A2",
            "WO2001029538A1 *",
            "WO2005114191A2"
        ],
        [
            "Filing date",
            "Oct 7, 1996",
            "Oct 20, 1998",
            "May 5, 2000",
            "May 4, 2001",
            "Jan 2, 2001",
            "Jan 3, 2001",
            "Oct 24, 2000",
            "Mar 1, 2002",
            "Oct 19, 2000",
            "Jun 2, 2005",
            "May 17, 2005",
            "Jun 27, 2006",
            "Jun 10, 2009",
            "Dec 19, 2008",
            "Dec 30, 2008",
            "Dec 12, 2008",
            "Feb 11, 2011",
            "Oct 29, 2008",
            "Sep 28, 2009",
            "Jul 26, 2010",
            "Oct 28, 2011",
            "Oct 16, 2009",
            "May 18, 2005",
            "Oct 19, 2000",
            "May 18, 2005"
        ],
        [
            "Publication date",
            "Oct 13, 1998",
            "Aug 7, 2001",
            "Apr 9, 2002",
            "Apr 22, 2003",
            "Oct 14, 2003",
            "Oct 14, 2003",
            "Jan 6, 2004",
            "Sep 7, 2004",
            "Nov 2, 2004",
            "May 5, 2009",
            "Dec 1, 2009",
            "Mar 9, 2010",
            "May 4, 2010",
            "Mar 15, 2011",
            "May 17, 2011",
            "Nov 29, 2011",
            "Dec 6, 2011",
            "Mar 20, 2012",
            "Feb 5, 2013",
            "Apr 1, 2014",
            "Jun 10, 2014",
            "Jan 27, 2015",
            "Dec 29, 2010",
            "Apr 26, 2001",
            "Dec 1, 2005"
        ],
        [
            "Applicant",
            "Toa Medical Electronics Co., Ltd.",
            "Coulter International Corp.",
            "Coulter International Corp.",
            "Coulter International Corp.",
            "Becton, Dickinson And Company",
            "Becton, Dickinson And Company",
            "Genprime, Inc.",
            "Genprime, Inc.",
            "Becton, Dickinson And Company",
            "Genprime, Inc.",
            "Beckman Coulter, Inc.",
            "Beckman Coulter, Inc.",
            "Shenzhen Mindray Bio-Medical Electronics Co. Ltd.",
            "Genprime, Inc.",
            "Canon U.S. Life Sciences, Inc.",
            "Shenzhen Mindray Bio-Medical Electronics Co., Ltd.",
            "Genprime, Inc.",
            "Beckman Coulter, Inc.",
            "Shenzhen Mindray Bio-Medical Electronics Co., Ltd.",
            "Shenzhen Mindray Bio-Medical Electronics Co., Ltd.",
            "Genprime, Inc.",
            "Shenzhen Mindray Bio-Medical Electronics Co., Ltd.",
            "Beckman Coulter, Inc.",
            "Becton Dickinson Co",
            "Beckman Coulter Inc"
        ],
        [
            "Title",
            "Fluorescent compounds and their use for measuring reticulocytes",
            "Methods and compositions for rapid staining of nucleic acids in whole cells",
            "Dyes and methods of reticulocyte enumeration",
            "Dyes and methods of detection of nucleic acid in immature red blood cells",
            "Method for determining the volume of single red blood cells",
            "Method for measuring the volume of individual red blood cells",
            "Method and apparatus for prokaryotic and eukaryotic cell quantitation",
            "Method and apparatus for prokaryotic and eukaryotic cell quantitation",
            "Apparatus and method employing incoherent light emitting semiconductor devices as particle detection light sources in a flow cytometer",
            "Method and apparatus for viable and nonviable prokaryotic and eukaryotic cell quantitation",
            "Method for a fully automated monoclonal antibody-based extended differential",
            "Method for a fully automated monoclonal antibody-based extended differential",
            "Asymmetric cyanine compounds, their preparation methods and their uses",
            "Method and apparatus for viable and nonviable prokaryotic and eukaryotic cell quantitation",
            "Unsymmetrical cyanine dyes for high resolution nucleic acid melting analysis",
            "Asymmetric cyanine fluorescent dyes, compositions and their use in staining biological samples",
            "Method and apparatus for viable and nonviable prokaryotic and eukaryotic cell quantitation",
            "Method for a rapid antibody-based analysis of platelet populations",
            "Reagent, kit and method for differentiating and counting leukocytes",
            "Reagent and kit for classifying and counting leukocytes, the preparation thereof, and process for classifying and counting leukocytes",
            "Method and apparatus for viable and nonviable prokaryotic and eukaryotic cell quantitation",
            "Reagent for blood analysis and method of use thereof",
            "Method for a fully automated monoclonal antibody-based extended differential",
            "An apparatus and method employing incoherent light emitting semiconductor devices as particle detection light sources in a flow cytometer",
            "Method for a fully automated monoclonal antibody-based extended differential"
        ]
    ],
    "pageTitle": "Patent US5563070 - Method of counting reticulocytes - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5563070?dq=FRAIOLI",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00297-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478485531,
    "recordOffset": 478460874,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{36658=A 1 mM stock fluorescent dye solution (TOTO-3 or TO-PRO-3/DMSO) is prepared. This stock solution is diluted 1:20 with isotonic phosphate buffer at pH 7.4 and 5 μl of whole blood is added to 1 ml of the diluted fluorescent dye composition. The mixture is incubated at room temperature for about 30 minutes to prepare a blood sample and using a helium-neon laser having an excitation wavelength of 633 nm, the blood sample is subjected to flow cytometric determination., 25390=Thioflavin T is disclosed in Japanese Patent Application Kokai S-59-142465 as a reticulocyte stain but since it requires sufficient washing for reducing the noise of nonspecific fluorescence, determination with this dye has the disadvantage that it requires a complicated and time-consuming procedure.}",
    "textBeforeTable": "Patent Citations Furthermore, the light source corresponding to the excitation wavelength of the fluorescent dye composition, viz. a red helium-neon laser, a red super bright LED or a red laser diode can be utilized for TOTO-3 or TO-PRO-3, a green helium-neon laser, a green super bright LED or a green laser diode for POPO-3 or PO-PRO-3, a blue argon ion laser, a blue super bright LED or a blue laser diode for YOYO-1 or YO-PRO-1, or an orange helium-neon laser, an orange super bright laser or an orange laser diode for YOYO-3 or YO-PRO-3, so that compared with flow cytometry using a discharge type laser as the light source, the equipment necessary for determination may be reduced in size, loss costly and simple in construction. Furthermore, the flow cytometry according to this invention, employing a blood sample stained with the above fluorescent dye composition, offers the advantage of expedient reticulocyte quantitation with good sensitivity with a minimum of fluorescent background. Moreover, because the staining is performed with a composition containing the above-mentioned fluorescent dye, the intracellular RNA of reticulocytes is not precipitated and a first-order relation can be obtained between RNA content and fluorescence intensity, thus offering the advantage of providing clinically useful information. As described above, the method of quantitating reticulocytes according to this invention comprises exposing a blood sample stained with a fluorescent dye composition containing TOTO-3 or TO-PRO-3, POPO-3 or PO-PRO-3, YOYO-1 or YO-PRO-1, or",
    "textAfterTable": "US5821127 * Oct 7, 1996 Oct 13, 1998 Toa Medical Electronics Co., Ltd. Fluorescent compounds and their use for measuring reticulocytes US6271035 Oct 20, 1998 Aug 7, 2001 Coulter International Corp. Methods and compositions for rapid staining of nucleic acids in whole cells US6368864 May 5, 2000 Apr 9, 2002 Coulter International Corp. Dyes and methods of reticulocyte enumeration US6551831 May 4, 2001 Apr 22, 2003 Coulter International Corp. Dyes and methods of detection of nucleic acid in immature red blood cells US6633368 * Jan 2, 2001 Oct 14, 2003 Becton, Dickinson And Company Method for determining the volume of single red blood cells US6633369 * Jan 3, 2001 Oct 14, 2003 Becton, Dickinson And Company Method for measuring the volume of individual red blood cells US6673568 Oct 24, 2000 Jan 6, 2004 Genprime, Inc. Method and apparatus for prokaryotic and eukaryotic cell quantitation",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}