{
    "relation": [
        [
            "Date",
            "Mar 21, 2000",
            "Mar 5, 2004",
            "Mar 24, 2004",
            "Mar 5, 2008",
            "Mar 5, 2012"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6113102 - Modified black jack card game (side bet 21™) - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6113102?dq=7,129,317",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00328-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479283531,
    "recordOffset": 479251474,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{49302=This application is a continuation-in-part application from U.S. application Ser. No. 08/859,394, filed May 20, 1997, now U.S. Pat. No. 5,836,586, which claims priority from U.S. provisional patent application Ser. No. 60/034,058, filed on Jan. 8, 1997, all incorporated herein by reference., 109039=Alternatively, the player may be required to make a separate wager to be eligible for the jackpot/progressive bet that provides enhanced payoffs. FIG. 32 is an illustration of another progressive or jackpot aspect of the modified game of twenty-one designed for table play. For example, for separate wagers are available for the 17 bet. The player wins 5:1 if the dealer attains a 17 without an ace card dealt as the first card and the player made a wager on the main area of 17. The player wins 19:1 if the dealer attains a 17 with an ace card dealt as the first card, and the player made a wager on the ace area of 17. In addition, the player also wins enhanced odds if the dealer attains a 17 with a predetermined number/kind of cards, and the payer made a wager on the jackpot area of 17. For example, enhanced odds are provided, as described above, if the dealer attains a 17 with 5 or more cards (i.e., 5 card charley, and above), with cards of the same suit, and the like. Note that placement of separate wagers on separate areas (e.g., 17, 18 and/or the like) allows the player to be eligible for all enhanced payoffs with a single wager., 84880=FIG. 13 is an illustration of a seventh embodiment of the modified game of twenty-one designed for table play. In accordance with this seventh embodiment, the combined modified black jack wagers are placed in positions 17-18-20, and/or 19-21-bust that are disposed in the player position in a triangular orientation. Suitable odds may also be provided for this option of the modified black jack wager. Importantly, while this seventh embodiment combined different dealer outcomes, the player is still permitted to bet on one, a plurality or all possible dealer outcomes., 49613=This application is related to, and incorporates by reference, the following applications: provisional patent application Ser. No. 60/019,747, filed Jun. 14, 1996 entitled \"PICK 'EM POKER TOURNAMENT GAME AND INTERACTIVE NETWORK COMPUTER SYSTEM FOR IMPLEMENTING SAME\" and U.S. patent application Ser. No. 08/716,114, filed Sep. 19, 1996 entitled \"PICK 'EM POKER CARD/TOURNAMENT GAME AND INTERACTIVE NETWORK COMPUTER SYSTEM FOR IMPLEMENTING SAME,\" provisional patent application Ser. No. 60/011,574, filed Feb. 13, 1996 entitled \"INTERACTIVE NETWORK GAMBLING CASINO SYSTEM,\" and U.S. patent application Ser. No. 08/747,800, filed Nov. 8, 1996 entitled \"VIDEO POKER GOLD CARD GAME AND COMPUTER SYSTEM FOR IMPLEMENTING SAME.\", 108211=FIG. 31 is an illustration of the progressive or jackpot aspect of the modified game of twenty-one designed for table play. For example, for the single 17 bet, the player wins 5:1 if the dealer attains a 17 without an ace card dealt as the first card, and the player wins 19:1 if the dealer attains a 17 with an ace card dealt as the first card. In addition, the player also wins enhanced odds if the dealer attains a 17 with a predetermined number/kind of cards. For example, enhanced odds are provided, as described above, if the dealer attains a 17 with 5 or more cards (i.e., 5 card charley, and above), with cards of the same suit, and the like. Note that placement of a wager on a single area (e.g., 17, 18 and/or the like) allows the player to be eligible for all enhanced payoffs with a single wager.}",
    "textBeforeTable": "Patent Citations The many features and advantages of the invention are apparent from the detailed specification, and thus, it is intended by the appended claims to cover all such features and advantages of the invention which fall within the true spirit and scope of the invention. Further, since numerous modifications and variations will readily occur to those skilled in the art, it is not desired to limit the invention to the exact construction and operation illustrated and described, and accordingly, all suitable modifications and equivalents may be resorted to, falling within the scope of the invention. The above described modified black jack game may also be used in a tournament, where players either compete against each other with the same dealer set of cards, same player set of cards, both, or neither. Bridge scoring rules can be used to accumulate points, or credits accumulated in the video slot machine, as an example. See, for example, one or more of the above incorporated by reference patent applications for exemplary network architecture, processes, and point scoring designs. Alternatively, the player may be required to make a separate wager to be eligible for the jackpot/progressive bet that provides enhanced payoffs. FIG. 32 is an illustration of another progressive or jackpot aspect of the modified game of twenty-one designed for table play. For example, for separate wagers are available for the 17 bet. The player wins 5:1 if the dealer attains a",
    "textAfterTable": "US5395119 * Apr 8, 1994 Mar 7, 1995 Jacob; Douglas P. Wagering methods for baccarat US5454570 * Sep 1, 1994 Oct 3, 1995 Karal; Michael Method of playing blackjack game US5494296 * Feb 6, 1995 Feb 27, 1996 Grassa; Louis J. Multiple position play twenty one game US5542669 * Sep 23, 1994 Aug 6, 1996 Universal Distributing Of Nevada, Inc. Method and apparatus for randomly increasing the payback in a video gaming apparatus US5584485 * Oct 25, 1994 Dec 17, 1996 Progressive Games, Inc. Methods of progressive jackpot gaming US5586766 * May 12, 1995 Dec 24, 1996 Casinovations, Inc. Blackjack game system and methods US5611730 * Apr 25, 1995 Mar 18, 1997 Casino Data Systems Progressive gaming system tailored for use in multiple remote sites: apparatus and method",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}