{
    "relation": [
        [
            "Citing Patent",
            "US7981150 *",
            "US8057535",
            "US8128689 *",
            "US8163002 *",
            "US8176630 *",
            "US8266791 *",
            "US8637109",
            "US8685424",
            "US8795577",
            "US9034031",
            "US20070203564 *",
            "US20110301696 *",
            "US20130004386 *"
        ],
        [
            "Filing date",
            "Sep 24, 2007",
            "Mar 22, 2011",
            "Sep 14, 2007",
            "Sep 8, 2006",
            "Jun 15, 2010",
            "Sep 19, 2008",
            "Dec 2, 2010",
            "Oct 13, 2011",
            "Jan 23, 2012",
            "Aug 2, 2012",
            "Feb 28, 2006",
            "",
            ""
        ],
        [
            "Publication date",
            "Jul 19, 2011",
            "Nov 15, 2011",
            "Mar 6, 2012",
            "Apr 24, 2012",
            "May 15, 2012",
            "Sep 18, 2012",
            "Jan 28, 2014",
            "Apr 1, 2014",
            "Aug 5, 2014",
            "May 19, 2015",
            "Aug 30, 2007",
            "Dec 8, 2011",
            "Jan 3, 2013"
        ],
        [
            "Applicant",
            "Boston Scientific Scimed, Inc.",
            "Nano Vasc, Inc.",
            "Boston Scientific Scimed, Inc.",
            "Vascular Devices Llc",
            "Fuji Xerox Co., Ltd.",
            "The Charles Stark Draper Laboratory, Inc.",
            "Cook Medical Technologies Llc",
            "Zeus Industrial Products, Inc.",
            "Cook Medical Technologies Llc",
            "Zeus Industrial Products, Inc.",
            "Boston Scientific Scimed, Inc.",
            "Mangiardi Eric K",
            "Borenstein Jeffrey T"
        ],
        [
            "Title",
            "Endoprosthesis with coatings",
            "Implantable medical device",
            "Bioerodible endoprosthesis with biostable inorganic layers",
            "Self-sealing vascular graft",
            "Method of producing liquid droplet ejection head",
            "Method of fabricating microfluidic structures for biomedical applications",
            "Manufacturing methods for covering endoluminal prostheses",
            "Antimicrobial substrate",
            "Needle-to-needle electrospinning",
            "Prosthetic device including electrostatically spun fibrous layer and method for making the same",
            "Biodegradable implants having accelerated biodegradation properties in vivo",
            "Device and method for management of aneurism, perforation and other vascular abnormalities",
            "Fabricating microfluidic structures for biomedical applications"
        ]
    ],
    "pageTitle": "Patent US7244272 - Vascular prosthesis and method for production thereof - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7244272?dq=5,884,272",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00239-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 466814103,
    "recordOffset": 466779680,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6329=According to a preferred embodiment of the present invention second layer 14 provides requisite mechanical properties of the vascular prosthesis, specifically high compliance and high breaking strength, hence the thickness of second layer is preferably larger than the thickness of first layer 12. A typical thickness, of second layer 14 is ranging from about 50 μm to about 1000 μm. In addition, the predetermined porosity of second layer 14 is preferably larger than the predetermined porosity of first layer 12. A porous structure is known to promote ingrowth of surrounding tissues, which is extremely important for fast integration and long-term patency of the vascular prosthesis. An example of the porous structure of second layer 14 is shown in FIG. 2.}",
    "TableContextTimeStampAfterTable": "{24690=Attempts have also been made to provide grafts characterized by both high compliance and high porosity, by the utilization of fiber polyurethanes. However, many polyurethanes, including those based on polycarbonate soft segments, have insufficient long-term biostability. Recently, siloxane-based aromatic polyurethanes have been developed, which have acceptable biostability even for thin fibers [In Vivo Degradation of Polyurethanes: Transmission FTIR Microscopic Characterization of Polyurethanes Sectioned by Cryomicroscopy. MaCarthy S. J. at al., Biomaterials 18, 1387 (1997); Polydimethylsiloxane (polyether-mixed macrodiol-based polymethane elastomers) biostability, Martin D. J. et al., Biomaterials, 21, 1021-1029 (2000); PCTAU 91/00270; PCT/AU 99/00236; PCTAU 98/00497; PP 9917]., 73269=A silicon polycarbonate urethane copolymer CarboSil 20 was purchased from Polymer Technology Group Incorporated, and was used for graft manufacturing. This polymer has satisfactory fiber-generation abilities, it is biocompatibilty and is capable of lipophilic drug incorporation. A mixture of dimethylformamide and toluene of ratio ranging from 1:1 to 1:2 was used as a solvent in all experiments. For the formation of adhesive sublayers, polycarbonate urethane Chronoflex 80A was used., 19068=This is a continuation of U.S. patent application Ser. No. 10/433,622, filed Jun. 18, 2003 now U.S. Pat. No. 7,115,220, which is a national phase application of PCT/IL01/01172, filed Dec. 17, 2001, now expired, which claims priority of U.S. provisional patent application No. 60/256,323, filed Dec. 19, 2000 and 60/276,956, filed Mar. 20, 2001, both now expired, and of U.S. patent application Ser. No. 09/982,017, filed Oct. 19, 2001, now abandoned., 78383=The heating of the mandrel after the formation of the inner layer resulted in a residual solvent drop from approximately 1200 ppm to 20 ppm. Low mass gain during the process ensured equal temperature of the mandrel- and the outer layer. The heating process increased the porosity, the dynamic compliance and the antikinking resistance. The mechanical parameters of the graft according to the ISO were: general porosity of 78%, kinking diameter of 16 mm and dynamic compliance of 14%., 80506=CarboSil 20 polyuurethane solution was used to form the inner layer, the thickness of which was 80 μm. The viscosity of the solution was 450 cP and conductivity was 0.45 μS. Once the inner layer was formed, a 16 μm first intermediate layer of low hardness, highly elastic polyurethane Chronoflex 80A was applied. Then, a 0.3 mm polypropylene surgical thread was passed through a bath of Chronoflex 80A solution of 1500 cP viscosity, thereby forming a semi-solid polyurethane filament with a thickness of about 1 mm. Subsequently, the coated filament was wound around the intermediate layer, at a winding rate of 4.4 m/min, winding tension of 2 N and winding pitch of 1.1 mm., 21861=In a natural arterial tissue, the diameter of the blood vessel may vary up to 15% as a function of blood pressure. This characteristic of natural blood vessels, named compliance, is of crucial importance when manufacturing an artificial blood vessel. A compliant wall should act as an elastic reservoir, absorbing energy during systole and releasing energy during diastole. A rigid vessel wall diminishes the pulsatile component of the diastolic recoil, thereby reducing the energy available for distal perfusion. It has been demonstrated experimentally that incompatible compliance of a vascular graft and the host artery is detrimental to graft performance [Baird R. N., Abbott W. M. “Pulsatile blood-flow in arterial grafts”, The Lancet, 1976; 30; 948-9; Abbott W. M., Megerman J. M. et al. “Effect of compliance mismatch upon vascular graft patency”, J. Vasc. Surg. 1987, 5; 376-82]., 75805=The mechanical parameters of the graft according to ISO 7198:1998 (E), were: general porosity of 68%, kinking diameter of 30 mm and dynamic compliance of 9%.}",
    "textBeforeTable": "Patent Citations Although the invention has been described in conjunction with specific embodiments thereof, it is evident that many alternatives, modifications and variations will be apparent to those skilled in the art. Accordingly, it is intended to embrace all such alternatives, modifications and variations that, fall within the spirit and broad scope of the appended claims. All publications, patents and patent applications mentioned in this specification are herein incorporated in their entirety by reference into the specification, to the same extent as if each individual publication, patent or patent application was specifically and individually indicated to be incorporated herein by reference. In addition, citation or identification of any reference in this application shall not be construed as an admission that such reference is available as prior art to the present invention. a-b, four IVUS images are shown at the lumen of each graft from the proximal connection to the distal connection. These images are marked R1 to R4 for the graft of the present invention, and L to L4 for the εPTFE graft. A narrowing of the lumen is vivid at the εPTFE graft, whereas the lumen of the graft, manufactured according to the present invention, is open. FIGS. 13 Referring to b, at the proximal connection of the εPTFE graft, a narrowing of the graft and/or thrombus occlusion of approximately 30-50% is shown. FIG. 12 a, no narrowing",
    "textAfterTable": "US4524036 Apr 9, 1984 Jun 18, 1985 University Of Liverpool Process for the manufacture of polyurethane resin for electrostatic spinning US4657793 Feb 25, 1986 Apr 14, 1987 Ethicon, Inc. Fibrous structures US4689186 Dec 5, 1985 Aug 25, 1987 Imperial Chemical Industries Plc Production of electrostatically spun products US4738740 * Nov 21, 1985 Apr 19, 1988 Corvita Corporation Method of forming implantable vascular grafts US4739013 May 4, 1987 Apr 19, 1988 Corvita Corporation Polyurethanes US4743252 Jan 13, 1986 May 10, 1988 Corvita Corporation Composite grafts US4759757 Jan 23, 1987 Jul 26, 1988 Corvita Corporation Cardiovascular graft and method of forming same US4769030 Apr 28, 1987 Sep 6, 1988 Corvita Corporation Monomer and use thereof in crack prevention of implanted prostheses US4798606 Aug 27, 1986 Jan 17, 1989 Corvita Corporation Reinforcing structure for",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}