{
    "relation": [
        [
            "Funding",
            "About Per Pupil Expenditure (K-12) State average Per-Pupil Expenditure: Average per-pupil expenditure equals the total amount of revenue paid out by school systems divided by their K-12 enrollment. It includes funds from federal, state, and local sources spent on day to day operating expenses, such as teacher salaries. It does not include capital expenses, such as school construction. From the Common Core of Data at the National Center for Education Statistics. Read morein depth background and analysis about Per Pupil Expenditure (K-12) Compare Vidor Independent School Districtto other districts based on Per Pupil Expenditure (K-12)",
            "About Federal Revenue Per Pupil Federal Revenue Per Pupil: Federal revenues per student are federal revenues divided by the fall enrollment as reported in the state finance file. These data are from the CCD National Public Education Financial Survey. From the Common Core of Data at the National Center for Education Statistics. Read morein depth background and analysis about Federal Revenue Per Pupil Compare Vidor Independent School Districtto other districts based on Federal Revenue Per Pupil",
            "About District Operating Budget District Operating Budget: Total district operating budget not including capital expenses. From the U.S. Census Bureau. Read morein depth background and analysis about District Operating Budget Compare Vidor Independent School Districtto other districts based on District Operating Budget",
            "About Title I Title I: Title I of the No Child Left Behind Act authorizes direct aid from the federal government to states and school districts to support the additional education needs of children from low-income families. From Thompson Publishing. Read morein depth background and analysis about Title I Compare Vidor Independent School Districtto other districts based on Title I",
            "About Title I Stimulus Estimated Title I: Title I of the No Child Left Behind Act authorizes direct aid from the federal government to states and school districts to support the additional education needs of children from low-income families. From the House Appropriations Committee. Read morein depth background and analysis about Title I Stimulus Estimated Compare Vidor Independent School Districtto other districts based on Title I Stimulus Estimated",
            "About IDEA PART B IDEA: The Individuals with Disabilities Education Act (IDEA) authorizes direct aid from the federal government to states and school districts to support the additional education needs of children with disabilities. Collected from state Departments of Education or Public Instruction. Read morein depth background and analysis about IDEA PART B Compare Vidor Independent School Districtto other districts based on IDEA PART B",
            "About IDEA PART B Stimulus Estimated IDEA: The Individuals with Disabilities Education Act (IDEA) authorizes direct aid from the federal government to states and school districts to support the additional education needs of children with disabilities. From the House Appropriations Committee. Read morein depth background and analysis about IDEA PART B Stimulus Estimated Compare Vidor Independent School Districtto other districts based on IDEA PART B Stimulus Estimated",
            "About Federal School Meal Funding Federal School Meal Funding: The National School Lunch Act authorizes the distribution of federal funds to states and school districts to provide nutritious lunches, breakfasts and snacks to low income students free or at reduced prices. This number represents the amount of money each district received for school meals. From state Departments of Education or Agriculture. Read morein depth background and analysis about Federal School Meal Funding Compare Vidor Independent School Districtto other districts based on Federal School Meal Funding",
            "About Federal School Commodities Funding Federal School Commodities Funding: The Department of Agriculture provides funds for states to distribute commodity foods to students eligible for free or reduced priced lunch. This number represents the amount of money each district received for commodities. From state Departments of Education or Agriculture. Read morein depth background and analysis about Federal School Commodities Funding Compare Vidor Independent School Districtto other districts based on Federal School Commodities Funding"
        ],
        [
            "2008 - 2012",
            "84039076930596000 8350856211100103070",
            "9131154185817160 9781055160616140",
            "4100900044107000475120004223300041648000 00000",
            "11623881162598104610710156950",
            "0383270000",
            "11345061130146104706310419700",
            "01027000000",
            "11580641395990155799900",
            "15407717780815332300"
        ],
        [
            "2008",
            "$8,403 $8,350",
            "$913 $978",
            "$41,009,000",
            "$1,162,388",
            "",
            "$1,134,506",
            "",
            "$1,158,064",
            "$154,077"
        ],
        [
            "2009",
            "$9,076 $8,562",
            "$1,154 $1,055",
            "$44,107,000",
            "$1,162,598",
            "$383,270",
            "$1,130,146",
            "$1,027,000",
            "$1,395,990",
            "$177,808"
        ],
        [
            "2010",
            "$9,305 $11,100",
            "$1,858 $1,606",
            "$47,512,000",
            "$1,046,107",
            "",
            "$1,047,063",
            "",
            "$1,557,999",
            "$153,323"
        ],
        [
            "2011",
            "$9,600 $10,307",
            "$1,716 $1,614",
            "$42,233,000",
            "$1,015,695",
            "",
            "$1,041,970",
            "",
            "",
            ""
        ],
        [
            "2012",
            "",
            "",
            "$41,648,000",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Vidor Independent School District",
    "title": "",
    "url": "http://febp.newamerica.net/k12/TX/4844160",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00259-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 94856775,
    "recordOffset": 94844209,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29098=Total state funding for state-funded pre-K programs run by school districts (except in Florida, which administers its pre-K program via entities whose jurisdictions mirror school-district boundaries but include both community-based organizations (CBOs) and school districts). May include federal Temporary Assistance to Needy Families (TANF) funding and other federal social services funding in states that use this funding to support pre-K. Does not include funding for programs operated by CBOs unless they receive funding from local school districts or use teachers paid by the districts. Depending on state regulations, funding may support children at age 3 in addition to age 4 and may reflect either full-day or half-day programming. From state Departments of Education or Human Services.}",
    "textBeforeTable": "Print Download Achievement Demographics Pre-Kindergarten Funding Locale Type Suburban Grade Level Unified Census Poverty Rate NCLB 4th Grade Math NCLB 4th Grade Reading 13,776 districts. Search over Comparative analysis of funding, student demographics and achievement data. Vidor Independent School District / Texas / PreK-12 Home Background & Analysis Higher Education K-12 Publications News Blog About Federal Education Budget Project Feedback New America Foundation",
    "textAfterTable": "Pre-Kindergarten 2008 - 2012 2008 2009 2010 2011 2012 About District-Based State-Funded Pre-K Enrollment Total enrollment in state-funded pre-K programs run by school districts (except in Florida, which administers its pre-K program via entities whose jurisdictions mirror school-district boundaries but include both community-based organizations (CBOs) and school districts). Does not include enrollment in programs operated by CBOs unless they receive funding from local school districts or use teachers paid by the districts. Depending on state regulations, enrollment may include children at age 3 in addition to age 4 and may reflect either full-day or half-day programming. From state Departments of Education or Human Services. Read morein depth background and analysis about District-Based State-Funded Pre-K Enrollment Compare Vidor Independent School Districtto other districts based on District-Based State-Funded Pre-K Enrollment 176 187 186 212 209 176 187 186 212",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}