{
    "relation": [
        [
            "Position",
            "Catcher",
            "First Base",
            "Second Base",
            "Third Base",
            "Shortstop",
            "Outfield",
            "Outfield",
            "Outfield",
            "D.H."
        ],
        [
            "Player",
            "Jason Varitek",
            "Mark Teixeira",
            "Brian Roberts",
            "Alex Rodriguez",
            "Miguel Tejada",
            "Johnny Damon",
            "Vladimir Guerrero",
            "Manny Ramirez",
            "David Ortiz"
        ],
        [
            "Club",
            "Red Sox",
            "Rangers",
            "Orioles",
            "Yankees",
            "Orioles",
            "Red Sox",
            "Angels",
            "Red Sox",
            "Red Sox"
        ],
        [
            "Votes",
            "2,939,648",
            "2,187,115",
            "2,629,521",
            "3,553,235",
            "3,224,908",
            "2,800,610",
            "3,006,512",
            "3,117,157",
            "4,138,141"
        ],
        [
            "All-Star Selection",
            "2 (2003, 2005)",
            "1 (2005)",
            "1 (2005)",
            "9 (1996-98, 2000-05)",
            "3 (2002, 2004-05)",
            "2 (2002, 2005)",
            "6 (1999-2002, 2004-05)",
            "9 (1995, 1998-2000, 2001-05)",
            "2 (2004-05)"
        ],
        [
            "All-Star Elections",
            "1 (2005)",
            "1 (2005)",
            "1 (2005)",
            "8 (1997-98, 2000-05)",
            "1 (2005)",
            "1 (2005)",
            "3 (2002, 2004-05)",
            "7 (1999-2005)",
            "1 (2005)"
        ]
    ],
    "pageTitle": "Major League Baseball's 2005 All-Star starters announced | MLB.com",
    "title": "",
    "url": "http://m.mlb.com/news/article/1114469",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00100-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 151686159,
    "recordOffset": 151663000,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{509=The 76th All-Star Game will be televised nationally by FOX Sports and around the world by Major League Baseball International, with pre-game ceremonies beginning at 8:00 p.m. (EDT). ESPN Radio will provide exclusive, national radio coverage, while MLB.com will provide extensive online coverage and MLB Radio will provide exclusive play-by-play coverage of the Midsummer Classic on the Internet., 3536=For the third consecutive year, the outcome of the Major League Baseball All-Star Game will have an impact on postseason play, as the team that represents the winning League in this year's All-Star Game will have home field advantage in the 2005 World Series., 90=2005 American League All-Star Balloting Winners by Position}",
    "TableContextTimeStampAfterTable": "{8043=National League Mike Piazza - Second consecutive All-Star selection. He adds to his total as the all-time leading vote-getter at catcher. With his 11th start, he has the most elected starts of any catcher in history, passing Johnny Bench and Ivan Rodriguez (both with 10). He was elected to the NL All-Star team 10 consecutive years (1993-2002). This will be his 11th appearance as the starting catcher. He was voted the MVP of the 1996 All-Star Game after he went 2-for-3 with a double, a home run and two RBI at Veterans Stadium in his hometown of Philadelphia. Derrek Lee - This is Lee's first All-Star game appearance. He becomes the first Chicago Cub first baseman to be elected to start an All-Star Game. The last Cubs first baseman to make an All-Star appearance was Mark Grace in 1997. Jeff Kent - Second consecutive All-Star game start. This is Kent's fourth appearance as the starting second baseman for the NL team and his fifth All-Star appearance overall. Over his five appearances he has played for three different teams (San Francisco, Houston, Los Angeles). Other NL second basemen who have been elected to start four All-Star Games or more include Joe Morgan, Ryne Sandberg and Craig Biggio. Scott Rolen - Making his fourth consecutive appearance as the starting third baseman for the NL All-Star team. He becomes the first third baseman to start four consecutive All-Star Games since Hall of Famer Mike Schmidt started six straight All-Star Games (1979-1984). David Eckstein - Making the first All-Star appearance of his career. It marks the third consecutive year that the left side of the infield has been started by St. Louis Cardinals. In 2002 and 2003 Edgar Renteria and Scott Rolen have patrolled the left side of the diamond. Jim Edmonds - This is Jim Edmonds fourth All-Star appearance and his first as a starter. He is the first Cardinals outfielder to start an All-Star game since Albert Pujols started as an outfielder in 2003. Bobby Abreu - His second consecutive All-Star appearance and the first time he has been elected as a starter. He is the first Phillies player to be elected as a starting outfielder since Lenny Dykstra in 1995. Carlos Beltran - His second consecutive appearance as an NL All-Star and his first as a starter. He is the first Mets outfielder to be elected as a starter since Darryl Strawberry in 1989. He is only the third Met outfielder to ever be elected to start the All-Star game (Dave Kingman, Daryl Strawberry)., 5602=Player Election Notes American League Jason Varitek - His first elected start as a catcher for the AL All-Star team. It is the second time in his career that he has been selected as an All-Star. He is also the first Boston Red Sox catcher to be voted as a starter since Carlton Fisk in 1980. Mark Teixeira - This is his first career All-Star appearance. Is the first Texas Ranger first baseman to have ever been elected to start an All-Star game. The last Ranger first baseman to play in All-Star game was Rafael Palmeiro in 1999. Brian Roberts - Is making his first All-Star appearance. Is the first Orioles second baseman to start an All-Star game since Roberto Alomar in 1998. It also marks the first time two Orioles have started the middle of the infield since Alomar and Cal Ripken, Jr. did so in 1996. Alex Rodriguez - His sixth consecutive All-Star game as an elected starter and his ninth overall. This will be his second straight year starting at third base for the AL team; he previously made four consecutive starts at shortstop. Miguel Tejada - His second consecutive All-Star appearance, his third overall and his first as an elected starter. Last Orioles shortstop to start an All-Star game was Cal Ripken, Jr. in 1996. Manny Ramirez - Making his seventh consecutive appearance as a starter for the AL. It is the second longest consecutive start streak in the AL behind Ken Griffey, Jr., who started 10 straight seasons in the AL outfield. Vladimir Guerrero - Making his second consecutive start as an AL outfielder and his third as an elected starter. He started as a member of the Montreal Expos in 2002 on the NL All-Star team. Overall it is his sixth All-Star game appearance. Johnny Damon - This is his second All-Star selection and his first as an elected starter. It's the first time two Red Sox have been elected to start the All-Star Game since Fred Lynn and Jim Rice started in 1979. It is the first time two outfield teammates have started the All-Star game for the AL since Kenny Lofton and Manny Ramirez did as members of the Cleveland Indians in 1999. David Ortiz - His second consecutive All-Star appearance and his first as a starter. Ortiz was the leading vote-getter in all of baseball, the first member of the Red Sox ever to garner such honors., 10727=July 3, 2892=2005 National League All-Star Balloting Winners by Position}",
    "textBeforeTable": "2005 American League All-Star Balloting Winners by Position The 76th All-Star Game will be televised nationally by FOX Sports and around the world by Major League Baseball International, with pre-game ceremonies beginning at 8:00 p.m. (EDT). ESPN Radio will provide exclusive, national radio coverage, while MLB.com will provide extensive online coverage and MLB Radio will provide exclusive play-by-play coverage of the Midsummer Classic on the Internet. Throughout the voting process, baseball fans cast a record 16 million ballots, including a record 11.5 million online at MLB.com. The Major League Baseball All-Star Balloting Program, the largest in professional sports, encompasses Ameriquest In-Stadium Balloting at all 29 U.S.-based Major League ballparks and 115 participating Minor League clubs; Ameriquest Online All-Star Balloting at MLB.com, the official website of Major League Baseball; Pepsi/Frito-Lay Retail Balloting at over 3,100 Wal-Mart stores; and International Balloting, including at Toronto's Rogers Centre and Retail Balloting throughout Canada, the Dominican Republic, Panama, Curacao, Venezuela, Japan and Puerto Rico. Online balloting on MLB.com was available in English, Spanish and Japanese. Major League Baseball's fan balloting program determined the American League's nine starting players and the National League's eight, while 45 of the 47 remaining pitchers and reserves were determined by the Player Ballot and the two All-Star managers, Tony La Russa of the St. Louis Cardinals and Terry Francona of the Boston Red Sox, and Major League Baseball. Ortiz drew the most online votes of any player with 3,629,492, while Lee",
    "textAfterTable": "2005 National League All-Star Balloting Winners by Position Position Player Club Votes All-Star Selection All-Star Elections Catcher Mike Piazza Mets 1,966,074 12 (1993-2002, 2004-05) 11 (1994-2002, 2004-05) First Base Derrek Lee Cubs 3,560,316 1 (2005) 1 (2005) Second Base Jeff Kent Dodgers 2,253,271 5 (1999-2001, 2004-05) 4 (2000-01, 2004-05) Third Base Scott Rolen Cardinals 2,742,864 4 (2002-05) 4 (2002-05) Shortstop David Eckstein Cardinals 2,231,246 1 (2005) 1 (2005) Outfield Bobby Abreu Phillies 2,532,742 2 (2004-05) 1 (2005) Outfield Carlos Beltran Mets 2,049,779 2 (2004-05) 1 (2005) Outfield Jim Edmonds Cardinals 2,826,306 4 (1995, 2000, 2003, 2005) 1 (2005) Player Election Notes American League Jason Varitek - His first elected start as a catcher for the AL All-Star team. It is the second time in his career that he has been selected as an All-Star. He is also the first Boston Red Sox catcher to be voted as a starter since Carlton Fisk in 1980. Mark Teixeira - This is his first career All-Star appearance. Is the first Texas Ranger first baseman to have ever been elected to start an All-Star game. The last Ranger first baseman to play in All-Star game was Rafael Palmeiro in 1999. Brian Roberts - Is making his first",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}