{
    "relation": [
        [
            "Series",
            "ALDS, Game 1",
            "ALDS, Game 2",
            "ALDS, Game 3",
            "ALCS, Game 2",
            "ALCS, Game 3",
            "ALCS, Game 5"
        ],
        [
            "IP",
            "2/3",
            "2/3",
            "2/3",
            "2/3",
            "1 2/3",
            "1/3"
        ],
        [
            "H",
            "1",
            "2",
            "2",
            "1",
            "1",
            "2"
        ],
        [
            "R",
            "0",
            "2",
            "0",
            "0",
            "0",
            "1"
        ],
        [
            "BB",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1"
        ],
        [
            "Ks",
            "2",
            "1",
            "0",
            "1",
            "1",
            "1"
        ],
        [
            "ERA",
            "0.00",
            "13.50",
            "9.00",
            "6.75",
            "4.15",
            "5.79"
        ]
    ],
    "pageTitle": "Girardi's Game 5 pitching moves backfire | MLB.com",
    "title": "After turning in a solid regular season in the Yankees' bullpen, Phil Hughes isn't finding the same success in the postseason.",
    "url": "http://m.mlb.com/news/article/7530526",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00037-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 149712559,
    "recordOffset": 149687719,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "ROUGH POSTSEASON It wasn't only the Burnett decision that put Girardi in the spotlight again. There was also the summoning of the 23-year-old Hughes with two on and two out, despite the fact that Joba Chamberlain had been warming up. The hurt was reflected in New York's morning newspapers. The Post, for example, featured a backpage headline that read \"MONKEY BUSINESS,\" and a column headline read \"Girardi gaffes let Angels rally back into ALCS.\" \"I gave all I had until the skip took me out, so the seventh hurts a little more,\" Burnett said, comparing that inning to the four-run first. \"The fact that these guys never gave up behind me, it hurts a little more.\" The result was a three-run rally, as Vladimir Guerrero tied it and Kendry Morales put the Angels ahead on singles off Phil Hughes. By that point, with the Angels leading again and eventually winning 7-6 to avoid elimination and force a Game 6 on Saturday, all Burnett could do was watch. \"We talked about it, but he was throwing the ball so well,\" Girardi said. \"He put up five shutout innings. He had only thrown 80 pitches. We just liked what we saw from him, and we stuck with him.\" Video Wrap NYY 5, LAA 2",
    "textAfterTable": "Nevertheless, with a 1-and-2 count, Hughes said there was no debating about what to do against Guerrero. He had found success in the past pounding Guerrero with fastballs, so once he put two strikes on him with nothing short of a World Series berth on the line, Hughes knew exactly what he wanted to throw. Fastball, up. Way up. The result, however, was not quite what Hughes or Girardi envisioned. The fastball darted straight into the middle of the zone. Guerrero smacked it up the middle for the critical game-tying single. \"I've had success busting him with fastballs in the past,\" Hughes said, well aware of Guerrero's almost legendary free-swinging nature. \"Obviously, a breaking ball down in the dirt would have been a good option as well. But right there, I wanted to go with my fastball, and he was able to get the bat on it.\" It was a physical error, not a mental one. Hughes had confidence in his mid-90s fastball, and for good reason -- it's been kind to him all year. And had Hughes thrown a good one, up and out of the strike zone, he likely would have achieved his intended result. \"It was supposed to be up and in,\" Hughes said. \"And it was basically belt high over the middle of the plate.\" It was Hughes' call to throw the fastball, his hand",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}