{
    "relation": [
        [
            "Team",
            "Packers",
            "Lions",
            "Packers",
            "Lions",
            "Packers",
            "Packers",
            "Lions",
            "Packers",
            "Lions"
        ],
        [
            "Qtr",
            "1",
            "1",
            "1",
            "1",
            "2",
            "3",
            "3",
            "4",
            "4"
        ],
        [
            "Time",
            "7:03",
            "3:51",
            "2:05",
            "0:00",
            "7:51",
            "6:44",
            "3:24",
            "12:19",
            "5:24"
        ],
        [
            "Play Description (Extra Point)",
            "G.Jennings 75 yd. pass from B.Favre (D.Rayner kick)",
            "S.Bryson 37 yd. pass from J.Kitna (J.Hanson kick)",
            "M.Manuel 29 yd. interception return (D.Rayner kick)",
            "R.Williams 42 yd. pass from J.Kitna (J.Hanson kick)",
            "D.Rayner 24 yd. Field Goal",
            "D.Driver 5 yd. pass from B.Favre (D.Rayner kick)",
            "K.Jones 5 yd. run (J.Hanson kick)",
            "A.Green 10 yd. pass from B.Favre (D.Rayner kick)",
            "J.Hanson 40 yd. Field Goal"
        ],
        [
            "Drive Info",
            "3 plays, 80 yards in 1:37",
            "6–79, 3:12",
            "N/A",
            "4–76, 2:05",
            "13–69, 7:09",
            "10–80, 4:51",
            "7–58, 3:20",
            "4–43, 1:48",
            "7–58, 2:45"
        ]
    ],
    "pageTitle": "2006 Green Bay Packers season - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/2006_Green_Bay_Packers_season",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 12,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00126-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 885422247,
    "recordOffset": 885375325,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{79782=Coming off their bye week, Green Bay defeated the Miami Dolphins on the road as the Packers defense intercepted quarterback Joey Harrington three times, with Charles Woodson returning one for a touchdown. Ahman Green carried the ball 18 times for 118 yards, including a 70 yard touchdown run. Brett Favre completed 19 of 35 passes, recording 206 yards and 2 touchdown passes. This was the first victory for the Packers in Miami since winning Super Bowl II in 1968 as the team improved to 2–4.[20], 142363=The Packers played at Lambeau Field for the second time in five days, a Thursday night game versus their divisional rivals, the Minnesota Vikings. The game was played on the third-year anniversary of the passing of Irv Favre, Brett Favre's father. In the first quarter, the Packers entered the red zone on each of their drives, but only scored once on a 38-yard field goal from kicker Dave Rayner. Rayner would miss his next two field goals. The Packers defence forced the Vikings to punt on all their possessions in the first half. The Packers scored on the final play of the half with a 44-yard field goal from Dave Rayner. In the third quarter cornerback Charles Woodson intercepted Vikings quarterback Tarvaris Jackson, marking his seventh interception of the season extending a career high. Later in the third quarter, Brett Favre was intercepted by cornerback Fred Smoot. Smoot returned the interception into the end zone, gaining the first lead of the game for the Vikings. In the fourth quarter the Packers drove the ball into Vikings territory, but tight end Bubba Franks fumbled the ball at the two-yard line, turning possession over to the Vikings. The Packers drove the ball 41 yards on their next possession to set Dave Rayner in position to attempt a field goal. Rayner made a 44 yard field goal with 1:34 left in the game to give the packers a 9–7 lead. The Vikings were unable to score on their last possession which granted the Packers their seventh win of the season., 157779=In 2006 Packer great Reggie White was inducted to the Pro Football Hall of Fame and was the lone inductee to the Green Bay Packers Hall of Fame, 51622=The Packers opened the regular season on September 10 with a 26–0 loss to the Chicago Bears, the Packers' first scoreless game since October 17, 1991.[8], 56714=The Packers hosted the New Orleans Saints on September 17, losing 34–27. The Packers jumped out to a 13–0 lead after forcing 3 Saints turnovers, but were not able to hold the lead in the second half. With the loss, the Packers fell to 0–2.[11], 3358=The 2006 Green Bay Packers season resulted in an 8–8 record. After the firing of Mike Sherman,[1] the Packers hired Mike McCarthy as their head coach.[2] McCarthy helped improved the Packers from 4–12 the previous year to a .500 win average in 2006. The Packers failed to make the playoffs for the second straight year after the New York Giants gained the tie-breaker over the Packers in the last week of the 2006 NFL season., 28775=The Packers picked up notable undrafted free agent Tramon Williams during the 2006 offseason, who later became the starting corner for the Super Bowl Champion 2010 Green Bay Packers. He was also selected but did not participate in the 2010 Pro Bowl., 15781=After some uncertainty, quarterback Brett Favre announced on April 26, 2006 that he would indeed return for the 2006–2007 season.[3][4] The Packers also acquired Oakland Raiders three-time Pro Bowl Defensive Back Charles Woodson through free agency later that day.[5] He officially signed with the team on May 9., 150212=Starting the second half, Brian Griese replaced Rex Grossman at quarterback. The Bears scored their first and only points of the game with a 75-yard touchdown pass to receiver Mark Bradley from Brian Griese in the third quarter. In the fourth quarter, the Packers increased their lead with a 46-yard field goal by Dave Rayner. The Bears had the ball only once in the fourth quarter. The drive ended in an interception by Nick Collins, recording his second of the game. Late in the game, Favre was replaced by quarterback Ingle Martin. Favre was carried off the field by Donald Driver, receiving many hugs by players and coaches. In an interview after the game, Favre broke down in tears. It was still at the time unclear whether Favre will retire or return to the Packers,[44] but Favre announced in February that he would return to play with the Packers.[45], 16696=The Packers drafted Ohio State linebacker A.J. Hawk with the fifth overall pick in the 2006 NFL Draft on April 29, 2006. The Packers also traded star wide receiver (and potential holdout) Javon Walker to the Denver Broncos for a second round pick, which they then traded for multiple picks., 29574=The Packers signed two notable free agents, CB Charles Woodson from the Oakland Raiders and DT Ryan Pickett from the St Louis Rams. Woodson would later be named the 2009 NFC Defensive Player of the Year and both players were integral parts of the 2010 Green Bay Packers Super Bowl Championship team.}",
    "lastModified": "Sat, 01 Aug 2015 18:58:30 GMT",
    "textBeforeTable": "Undrafted free agents[edit]       Made roster    †   Pro Football Hall of Fame    *   Made at least one Pro Bowl during career Compensatory Northwest Missouri State DE Dave Tollefson  253 7 Pick from PHI Fresno State S Tyrone Culver  185 6 Pick from STL Texas A&M DT Johnny Jolly  183 6 Compensatory Nevada OT",
    "textAfterTable": "Strength and Conditioning Coordinator – Rock Gullickson Assistant Strength and Conditioning – Mark Lovat Strength and Conditioning Assistant – Brandon Johnson [6] Schedule[edit] Week Date Opponent Time/Time Zone Result Game site TV Record 1 September 10, 2006 Chicago Bears L 26–0 Lambeau Field FOX 0–1 2 September 17, 2006 New Orleans Saints L 34–27 Lambeau Field FOX 0–2 3 September 24, 2006 Detroit Lions W 31–24 Ford Field FOX 1–2 4 October 2, 2006 Philadelphia Eagles L 31–9 Lincoln Financial Field ESPN 1–3 5 October 8, 2006 St. Louis Rams 12 Noon CST L 23–20 Lambeau Field FOX 1–4 6 Bye 7 October 22, 2006 Miami Dolphins W 34–24 Dolphin Stadium FOX 2–4",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}