{
    "relation": [
        [
            "Vehicle",
            "Vento",
            "C4",
            "Fluence",
            "408",
            "Cruze",
            "Corolla LN"
        ],
        [
            "Luggage",
            "3 small / 2 big bags",
            "4 small / 2 big bags",
            "3 small bags",
            "4 small bags",
            "2 big bags",
            "4 small bags"
        ],
        [
            "Leather seats",
            "Yes",
            "No",
            "No",
            "No",
            "Yes",
            "No"
        ],
        [
            "ABS",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes"
        ],
        [
            "Airbag",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes"
        ]
    ],
    "pageTitle": "Executive sedan Buenos aires | Private corporate cars - Traslada",
    "title": "",
    "url": "http://www.traslada.com.ar/en/sedan-executive-buenos-aires.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00046-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 782642035,
    "recordOffset": 782633833,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{19879=2013 - Traslada - All rights reserved}",
    "lastModified": "Thu, 30 Oct 2014 18:50:48 GMT",
    "textBeforeTable": "Specifications per vehicle › ‹ Peugeot 408 Renault Fluence Citroen C4 Volkswagen Vento Chevrolet Cruze Toyota Corolla You may rest assured: the most demanding clients choose TRASLADA. Executive private car Find the finest models for corporate transfers. Executive sedans High-style vehicles, no more than three years old. Corporate services Executive private cars SEDAN EXECUTIVE SEDAN SERVICE > TRASLADA > You are here:",
    "textAfterTable": "Please do not hesitate to contact us: we are happy to help. Operational bases Our operational bases are set Downtown and in Vicente Lopez, Barracas, Ezeiza International Airport and Jorge Newbery Airfield. Why choosing Traslada? We offer... The possibility to book online, in a few simple steps An exclusive online platform that allows our agents, chauffeurs and clients to interact dynamically at all times. Constant auditing of our chauffeurs. We listen to our clients to improve constantly. Cost-minimization methodology that prevents losses and fraud. Bank accounts Reports and summaries of the services provided Customer Loyalty Programs Modern and fully-equipped fleet of vehicles Safety is our priority Airbags All of our vehicles are fully equipped with airbags and adjustable seatbelts. ABS brakes ABS brakes on all four wheels",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}