{
    "relation": [
        [
            "S",
            "1",
            "8",
            "15",
            "22",
            "29"
        ],
        [
            "M",
            "2",
            "9",
            "16",
            "23",
            "30"
        ],
        [
            "T",
            "3",
            "10",
            "17",
            "24",
            "31"
        ],
        [
            "W",
            "4",
            "11",
            "18",
            "25",
            ""
        ],
        [
            "T",
            "5",
            "12",
            "19",
            "26",
            ""
        ],
        [
            "F",
            "6",
            "13",
            "20",
            "27",
            ""
        ],
        [
            "S",
            "7",
            "14",
            "21",
            "28",
            ""
        ]
    ],
    "pageTitle": "ECE",
    "title": "",
    "url": "http://www.ece.rutgers.edu/?page=9&mini=calendar%2F2013-12",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 406002871,
    "recordOffset": 405986565,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{25958=This is the second year in a row that an ECE Faculty received this award; Dr. Wade Trappe was recipient of the   2013 Outstanding Engineering Faculty Award.}",
    "TableContextTimeStampAfterTable": "{34792=The team's capstone project had won first prize at the 2013 ECE Capstone competition., 37695=ECE faculty member, Dr. Kristin Dana, was the computer vision task leader on the RABIT bridge deck assessment tool developed by CAIT (Rutgers Center for Advanced Infrastructure and Transportation) and the Federal Highway Administration. The project received the 2014 Charles Pankow Award for Innovation at the ASCE Opal Awards ceremony in Arlington, VA on March 20, 2014. The computer vision group included ECE graduate students Parneet Kaur and Prateek Prasanna., 34391=ECE alumnus Todd Katz' startup company, ThermoVolt, was one of seven start-up companies from around the country this year selected in renewable energy to compete for the MIT Clean Energy Prize. ThermoVolt is a direct result of Todd's Capstone project at ECE Rutgers in 2013., 33059=The Hazard Inventory was conducted in the fall of 2013 to:, 36051=Prof. Dipankar Raychaudhuri, Distinguished Professor and Director of  WINLAB received the 2014 Innovative Program Award by the ECE Department Heads Association (ECEDHA). The awards ceremony took place at the ECEDHA Annual Conference and ECExpo, in Napa, CA, on March 24.}",
    "lastModified": "Sat, 01 Aug 2015 20:17:17 GMT",
    "textBeforeTable": "»   December «   Upcoming Events Capstone Design Information - Information on the Capstone Design classes is located here. ECE Department Still Accepting Applications for Graduate Study Announcements more Prof. Pompili was invited as IEEE DCOSS 2014 Workshops Keynote Speaker to deliver a talk on May 28, 2014 titled \"Context- and Uncertainty-aware Computing for Ubiquitous Internet-of-Things-based Application\" Prof. J. Lindqvist selected participate in the 2nd Heidelberg Laureate Forum Prof. Wade Trappe elected SPS Regional Director-at-Large (1-6), IEEE Signal Processing Society Board of Governors",
    "textAfterTable": "ECE Blogs ODNI/NSA-Sponsored Cybersecurity Meeting in the Rockies What a Year! more Colloquia ECE Colloquia will resume in the Fall September 23, 2015 - 10:00am more FAQ How do I go about taking summer courses outside of RU, and who pays for the tuition? You may take certain courses at another institution over the summer or winter sessions (not during the spring or fall terms) and transfer the credit (not the grade) to be applied towards your Engineering degree at Rutgers. Tuition is paid for by the student. Click http://soe.rutgers.edu/oas_transfer_external   for more information on",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}