{
    "relation": [
        [
            "",
            "2011-12",
            "2012-13",
            "2013-14",
            "2014-15",
            "Total"
        ],
        [
            "gp",
            "-",
            "2",
            "1",
            "-",
            "3"
        ],
        [
            "gs",
            "-",
            "1",
            "0",
            "-",
            "1"
        ],
        [
            "min",
            "0:00",
            "93:10",
            "12:59",
            "0:00",
            "106:09"
        ],
        [
            "ga",
            "-",
            "0",
            "0",
            "-",
            "0"
        ],
        [
            "gaa",
            "-",
            "0.00",
            "0.00",
            "-",
            "0.00"
        ],
        [
            "sv",
            "-",
            "2",
            "2",
            "-",
            "4"
        ],
        [
            "sv%",
            "-",
            "1.000",
            "1.000",
            "-",
            "1.000"
        ],
        [
            "wins",
            "-",
            "1",
            "0",
            "-",
            "1"
        ],
        [
            "losses",
            "-",
            "0",
            "0",
            "-",
            "0"
        ],
        [
            "ties",
            "-",
            "0",
            "0",
            "-",
            "0"
        ],
        [
            "shutouts",
            "-",
            "1",
            "0",
            "-",
            "1"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.gomatadors.com/sports/m-soccer/2012-13/bios/ayala-padilla_luis_29vk?dec=/printer-decorator",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00170-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 459847142,
    "recordOffset": 459838940,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{6538=Ayala-Padilla played three seasons of varsity soccer for the Crusaders as a goalkeeper, starting and captaining in his junior and senior seasons. He was a part of the 2009 CIF and State Championship team and was named that year to the All-Mesa League Second Team. As a junior, he was named goalkeeper of the year, put on the Top 25 to Watch list and was named to the All-CIF First Team and a All-League Scholar Athlete. He duplicated those honors as a senior, adding an MVP and player of the month award to his collection. Ayala-Padilla was a member of CSF at Mater Dei and graduated with a 3.8 GPA in 2011., 6401=Ayala-Padilla was a redshirt during the 2011 season., 6361=2011, 6060=2012}",
    "textBeforeTable": "Luis Ayala-Padilla 19 19 Related Bios Kevin Marquez Alberto Rosas Joe Franco Steven Belecazar Mynor Giron Carlos Benavides Yarden Azulay Edwin Rivas Brian Behrad Rene Anguiano Beto Velasquez Jose Luis Garcia Armando Gutierrez Chris Smith Christian Gonzalez Diaz Sagi Lev-Ari Trevor Morley Shane Steffes Tanner Snedigar Yuval Barak Michael Coles Carlos Gonzalez Pol Schonhofer Bartra Patrick Hickman David Turcios Michael Abalos Nicolas Camacho",
    "textAfterTable": "2011 Ayala-Padilla was a redshirt during the 2011 season. MATER DEI CATHOLIC HIGH SCHOOL Ayala-Padilla played three seasons of varsity soccer for the Crusaders as a goalkeeper, starting and captaining in his junior and senior seasons. He was a part of the 2009 CIF and State Championship team and was named that year to the All-Mesa League Second Team. As a junior, he was named goalkeeper of the year, put on the Top 25 to Watch list and was named to the All-CIF First Team and a All-League Scholar Athlete. He duplicated those honors as a senior, adding an MVP and player of the month award to his collection. Ayala-Padilla was a member of CSF at Mater Dei and graduated with a 3.8 GPA in 2011. Recent Games Oct 27 at UC Riverside W, 2-1 Oct 31 Cal State Fullerton W, 1-0 Nov 3 UC Irvine L, 1-0 Nov 7 Cal Poly W, 2-0 Nov 10 at UC Davis W, 1-0 Nov 15 San Diego L, 2-1",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}