{
    "relation": [
        [
            "Statement",
            "Control of hypertension is a significant health problem.",
            "I do a good job of treating my patients' hypertension.",
            "Clinical practice guidelines are important to follow when treating patients.",
            "I believe that a significant barrier to blood pressure control is patient non-compliance.",
            "I believe that a significant barrier to blood pressure control is physician inaction.",
            "I am familiar with the content of JNC 7"
        ],
        [
            "SD",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "D",
            "0",
            "0",
            "0",
            "0",
            "13",
            "1"
        ],
        [
            "UN",
            "0",
            "0",
            "1",
            "2",
            "5",
            "0"
        ],
        [
            "A",
            "5",
            "25",
            "15",
            "18",
            "9",
            "16"
        ],
        [
            "SA",
            "23",
            "3",
            "12",
            "8",
            "1",
            "11"
        ]
    ],
    "pageTitle": "Physician reported perception in the treatment of high blood pressure does not correspond to practice.",
    "title": "",
    "url": "http://www.biomedsearch.com/nih/Physician-reported-perception-in-treatment/19341474.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 330755574,
    "recordOffset": 330739180,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{51391=© 2009-2015 BioMedSearch.com. All rights reserved}",
    "textBeforeTable": "Physician Response to General Questions Regarding Hypertension Table 1  ] [TableWrap ID: T1 Tables Ajzen I,Fishbein M. Understanding Attitudes and Predicting Social Behavior. 1980Englewood Cliffs, NJ: Prentice-Hall, Inc; Ajzen I,Timko C,White JB. Self-monitoring and the attitude-behavior relationJournal of Personality and Social Psychology 1982;42:426–435. [doi: 10.1037/0022-3514.42.3.426] Conner M,Norman P. Predicting Health Behavior Search and Practice with Social Cognition Models. 1996Open University Press, Ballmore: Buckingham; Rosenstock IM. Historical origins of the health belief modelHealth Education Monographs 1974;2:328–325. Bogart LM,Delhanty DL. Boll TJ, Frank RG, Baum A, Wallander JLPsychosocial ModelsHandbook of Clinical Health Psychology. 2004Sheridan Books, Ann Arbor Michigan; Witte K,Meyer G,Martell D. Effective Health Risk Messages: A step by step guide. 2001Sage Publications, Thousand Oaks California; Bandura A. Self-eficacy: toward a unifying theory of behavioral changePsychological Review 1977;84:191–215. [pmid: 847061] [doi: 10.1037/0033-295X.84.2.191] Solomon DH,Van Houten L,Glynn RJ,Baden L,Curtis K,Schrager H,et al. Academic detailing to improve use of broad spectrum antibiotics at an academic medical centerArchives of Internal Medicine 2001;161:1897–1902. [pmid: 11493132] [doi: 10.1001/archinte.161.15.1897] Majumdar SR,Guirguis LM,Toth EL,Lewanczuk RZ,Lee TK. Controlled trial of a multifaceted intervention for",
    "textAfterTable": "SD = Strongly Disagree; D = Disagree; UN = Undecided; A = Agree; SA = Strongly Agree JNC7 = the Seventh Report of the Joint National Committee on the Evaluation, Detection, and Treatment of Hypertension [TableWrap ID: T2 ] Table 2  Physician Response to Intensification of Hypertension Treatment Blood Pressure Estimates MIN MAX MED MEAN SD Level of SBP at which to intensify treatment in patients with essential hypertension 120 145 140 137.59 5.071 Level of DBP at which to intensify treatment in patients with essential hypertension 80 95 90 88.7 3.561 Level of SBP at which to intensify treatment in patients with heart disease 120 160 130 134 7.022 Level of DBP at which to intensify treatment in patients with heart disease 70 100 85 85.15 5.580 Level of SBP at which to intensify treatment in patients with diabetes 120 140 130 130.41",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}