{
    "relation": [
        [
            "Έτος",
            "1983",
            "1984",
            "1986",
            "1988",
            "1991",
            "1993",
            "1996",
            "1997",
            "1998",
            "1999",
            "2003",
            "2008"
        ],
        [
            "Άλμπουμ",
            "Kill 'em All",
            "Ride the Lightning",
            "Master of Puppets",
            "...And Justice for All",
            "Metallica (Black Album)",
            "Live Shit: Binge & Purge (Live)",
            "Load",
            "ReLoad",
            "Garage Inc. (Comp)",
            "S&M (Live)",
            "St. Anger",
            "Death Magnetic"
        ],
        [
            "Η.Π.Α. [59]",
            "120",
            "100",
            "29",
            "6",
            "1",
            "26",
            "1",
            "1",
            "2",
            "2",
            "1",
            "1"
        ],
        [
            "Αγγλία [60]",
            "142",
            "87",
            "41",
            "4",
            "1",
            "-",
            "1",
            "4",
            "29",
            "33",
            "3",
            "1"
        ],
        [
            "Γερμανία [61]",
            "-",
            "-",
            "31",
            "5",
            "1",
            "68",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Νορβηγία [62]",
            "-",
            "40",
            "34",
            "8",
            "1",
            "32",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Φινλανδία [63]",
            "12",
            "9",
            "7",
            "8",
            "4",
            "-",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1"
        ],
        [
            "Σουηδία [64]",
            "28",
            "22",
            "14",
            "5",
            "1",
            "-",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Ολλανδία [65]",
            "-",
            "-",
            "-",
            "39",
            "1",
            "81",
            "1",
            "1",
            "8",
            "2",
            "2",
            "1"
        ],
        [
            "Αυστρία [66]",
            "129",
            "126",
            "111",
            "12",
            "5",
            "-",
            "1",
            "1",
            "3",
            "7",
            "1",
            "1"
        ],
        [
            "Αυστραλία [67]",
            "55",
            "37",
            "33",
            "16",
            "1",
            "18",
            "1",
            "2",
            "2",
            "1",
            "1",
            "1"
        ],
        [
            "Καναδάς [68]",
            "-",
            "-",
            "54",
            "13",
            "1",
            "40",
            "1",
            "2",
            "3",
            "4",
            "1",
            "1"
        ],
        [
            "Επίπεδο βράβευσης ΗΠΑ [69]",
            "3 x Πλατινένιος",
            "6 x Πλατινένιος",
            "6 x Πλατινένιος",
            "8 x Πλατινένιος",
            "16 x Πλατινένιος",
            "15 x Πλατινένιος",
            "5 x Πλατινένιος",
            "4 x Πλατινένιος",
            "5 x Πλατινένιος",
            "6 x Πλατινένιος",
            "2 x Πλατινένιος",
            "2 x Πλατινένιος"
        ]
    ],
    "pageTitle": "Metallica - Βικιπαίδεια",
    "title": "",
    "url": "https://el.wikipedia.org/wiki/Metallica",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00136-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 852119815,
    "recordOffset": 852068168,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20093=Ο Ούλριχ ήταν αυτός που έδωσε το όνομα \"Metallica\" στο συγκρότημα του. Αργότερα έβαλε άλλη μια αγγελία, πάλι στην εφημερίδα \"The Recycler\", για μια θέση lead κιθαρίστα. Ο σολίστας Ντέιβ Μαστέιν απάντησε και όταν ο Χέτφιλντ και ο Ούλριχ είδαν τον ακριβό εξοπλισμό του, τον έβαλαν αμέσως στο συγκρότημα. Στις αρχές του 1982 κυκλοφόρησαν το πρώτου τους τραγούδι, με τίτλο \"Hit the Lights\" για την συλλογή της Metal Blade Records, \"Metal Massacre Ι\",[2] ενώ έπαιξαν το κομμάτι και στην πρώτη τους ζωντανή παράσταση, στις 14 Μαρτίου 1982, στο \"Radio City\" στο Άναχαϊμ της Καλιφόρνια.[4] Την εποχή αυτή το συγκρότημα αποτελούνταν από τον Χέτφιλντ, τον Ούλριχ, τον Μαστέιν και τον Ρον ΜακΓκόβνεϊ (Ron McGovney) που είχε αναλάβει ρόλο μπασίστα. Το χειμώνα του 1982, ο Χέτφιλντ και ο Ούλριχ πήγαν στο νυχτερινό κέντρο \"Whiskey\" όπου έπαιζαν διάφορα συγκροτήματα και γνώρισαν τον Κλιφ Μπάρτον ο οποίος έκανε σόλο ζωντανή εμφάνιση με το μπάσο του, και στον οποίο πρόσφεραν την αντίστοιχη θέση στους Metallica. Αυτός τους απάντησε πως τον ενδιαφέρει το πόστο αλλά θα πρέπει να μετακομίσουν στο Σαν Φρανσίσκο. Επειδή η μουσική σκηνή του Λος Άντζελες αποτελούταν κυρίως από glam metal συγκροτήματα αποφάσισαν πως στο Σαν Φρανσίσκο θα ήταν καλύτερα κι έτσι μετακόμισαν. Η πρώτη ζωντανή εμφάνιση των Metallica με τον Μπάρτον ήταν στο κλαμπ \"The Stone\", τον Μάρτιο του 1983, ενώ η πρώτη ηχογράφηση με τον Βurton ήταν στο ντέμο τους \"Megaforce\".[5] Αργότερα, τα μέλη του συγκροτήματος αποφάσισαν να διώξουν τον Μαστέιν λόγω χρήσης ναρκωτικών και αλκοόλ τα οποία τον οδηγούσαν σε βίαιη και αλλοπρόσαλλη συμπεριφορά απέναντι στους ίδιους αλλά και σε φίλους του συγκροτήματος.[6] Ο κιθαρίστας των Exodus, Κερκ Χάμμετ, ανέλαβε τη θέση του Μαστέιν στους Metallica. Μετά την έξοδό του από τους Metallica, ο Μαστέιν δημιούργησε το συγκρότημα Megadeth. Σε διάφορες συνεντεύξεις του τα επόμενα χρόνια είχε εκφράσει αρνητικά σχόλια για τα μέλη των Metallica και κυρίως του αντικαταστάτη του, Χάμμετ.[7][8][9] Κάτι που το σταμάτησε στις αρχές της δεκαετίας του 2000 αφού εμφανίζεται και στο video \"Some Kind Of Monster\" μαζί με τον Λαρς Ούλριχ., 72192=Στις 4 Απριλίου 2009, οι Metallica εντάχθηκαν στο Rock and Roll Hall of Fame, με τον αποχωρήσαντα Τζέισον Νιούστεντ να παίζει κατά την τελετή βράβευσης μαζί με το συγκρότημα.[47] Στις 16 Ιουνίου 2010, οι Metallica, οι Slayer, οι Megadeth και οι Anthrax έπαιξαν στο αεροδρόμιο Bemowo της Βαρσοβίας, ως μέρος του φεστιβάλ \"Sonisphere\". Έξι ημέρες αργότερα, τα ίδια συγκροτήματα εμφανίστηκαν στην Σόφια της Βουλγαρίας, για να ακολουθήσουν συναυλίες στο Βουκουρέστι και την Κωνσταντινούπολη, την ίδια περίοδο που το \"Death Magnetic\" βραβεύθηκε ως διπλά πλατινένιο.[48] Η περιοδεία \"World Magnetic Tour\" ολοκληρώθηκε στις 21 Νοεμβρίου 2010 και το καλοκαίρι του 2011 οι Metallica εμφανίστηκαν με τους \"The Big Four\" στο \"Sonisphere Festival\", συνεχίζοντας στην Γαλλία και σε Ευρώπη και Βόρεια Αμερική κατά το 2011.[49], 24849=Οι Metallica ταξίδεψαν στο Ρότσεστερ της Νέας Υόρκης για να ηχογραφήσουν το πρώτο τους άλμπουμ, με τίτλο \"Metal up your Ass\", έχοντας ως παραγωγό τον Πολ Κούρσιο (Paul Curcio). Εξαιτίας μιας διαφωνίας μεταξύ της δισκογραφικής εταιρείας και του συγκροτήματος, το άλμπουμ μετονομάστηκε σε \"Kill 'em All\". Το \"Kill 'em All\" εκδόθηκε από την Megaforce Records στις ΗΠΑ το 1983 και ήταν το πρώτο speed metal άλμπουμ που γνώρισε επιτυχία. Μπήκε στην 120η θέση των τσαρτ του Billboard και αν και δεν ήταν μεγάλη επιτυχία, έχτισε τα θεμέλια για την άνοδο των Metallica. Το συγκρότημα για να γιορτάσει την έκδοση του έκανε μια περιοδεία με τους Raven με όνομα \"Kill 'em All for One tour\". Τον Φεβρουάριο του 1984, το συγκρότημα περιόδευσε με τους Venom στο \"Seven Dates of Hell tour\", όπου έπαιξαν μπροστά σε 7.000 θεατές.[10] Τα σίνγκλ του δίσκου ήταν τα \"Whiplash\" και \"Jump in the Fire\". Το άλμπουμ τους \"Ride the Lightning\" εκδόθηκε το 1984. Η ηχογράφηση του έγινε στα \"Sweet Silence Studios\" στην Κοπεγχάγη της Δανίας και έφτασε στην 100η θέση του Billboard. Ένα γαλλικό τυπογραφείο εκτύπωσε κατά λάθος τα εξώφυλλα του άλμπουμ με πράσινο χρώμα, κάτι που τώρα υπάρχει μέσα σε πολλές συλλογές θαυμαστών τους. Το άλμπουμ περιείχε το σινγκλ \"Creeping Death\" και τα πολύ γνωστά κομμάτια \"For Whom the Bell Tolls\", \"Fade to black\", και το ορχηστρικό \"The Call of Kthulu\". Ο Μαστέιν πήρε την πνευματική ιδιοκτησία των \"Ride the Lightning\" και \"The Call of Kthulu\".[11], 5526=Οι Metallica είναι ένα heavy metal συγκρότημα από τις Ηνωμένες Πολιτείες. Ιδρύθηκαν στις 28 Οκτωβρίου 1981, όταν ο τότε νεαρός Λαρς Ούλριχ (Lars Ulrich) έβαλε σε περιοδικό αγγελία, στην οποία ζητούσε άτομα για δημιουργία συγκροτήματος. Πιο συγκεκριμένα, ζητούσε δύο κιθαρίστες και έναν μπασίστα με τους οποίους θα έφτιαχνε συγκρότημα. Στην αγγελία απάντησε ο Τζέιμς Χέτφιλντ (James Hetfield) ο οποίος έπαιζε ρυθμική κιθάρα. Οι δυο τους έκαναν μια πρόβα αλλά ο Χέτφιλντ δεν ενθουσιάστηκε τόσο και δεν τον ξαναπήρε τηλέφωνο. Ο Ούλριχ άρχισε πάλι να ψάχνει άτομα και τότε ο Χέτφιλντ τον πήρε τηλέφωνο ζητώντας να κάνουν άλλη μια πρόβα. Αργότερα, γνώρισαν τον σολίστα Ντέιβ Μαστέιν (Dave Mustaine), ο οποίος μπήκε στο συγκρότημα αλλά αργότερα απολύθηκε λόγω χρήσης ουσιών και κακής συμπεριφοράς. Ύστερα γνώρισαν τον μπασίστα Κλιφ Μπάρτον (Cliff Burton), και τον, Φιλιππινέζικης καταγωγής, Κερκ Χάμμετ (Kirk Hammet) και έφτιαξαν ένα ολοκληρωμένο συγκρότημα. Με πωλήσεις 57 εκατομμυρίων άλμπουμ στις ΗΠΑ (RIAA Total Sales) και 40 εκατομμύρια άλμπουμ εκτός αυτών, το τελικό νούμερο των πωλήσεων φτάνει περίπου τα 100 εκατομμύρια δίσκους. Το συγκρότημα είναι ένα απ' τα πιο επιτυχημένα heavy metal συγκροτήματα στην ιστορία του είδους, ενώ γενικά κατατάσσεται έβδομο, με βάση τις πωλήσεις, στην ως τώρα Αμερικάνικη μουσική ιστορία.Ο μέγιστος αριθμός της πώλησης εισιτηρίων έφτασε τα 120.000 εισιτήρια. (sold out in 45 sec, California, 1983) Με δεδομένο ότι έπαιξαν σημαντικό ρόλο στην εξέλιξη της σκληρής μουσικής, ειδικά του thrash metal, (οι Μetallica θεωρούνται οι επικεφαλής των \"τεσσάρων μεγάλων\" του Αμερικάνικου Thrash Metal της σκηνής του Bay Area, περιοχή του Κόλπου του Σαν Φρανσίσκο, στους οποίους συγκαταλέγονται και οι Megadeth, οι Slayer και οι Anthrax)[1] στα μέσα της δεκαετίας του 1980, το συγκρότημα απευθύνθηκε σε ένα πιο πλατύ κοινό από τις αρχές της δεκαετίας του 1990 και έπειτα, αλλάζοντας τη μουσική του νοοτροπία, στρεφόμενο προς πιο Hard Rock ήχους. Επίσης, θεωρήθηκαν πρωτοπόροι του speed metal με την κυκλοφορία του παρθενικού τους άλμπουμ, \"Kill 'em All\"., 43817=Οι κριτικές αυτές οδήγησαν την επιτροπή των Βραβείων στον διαχωρισμό της κατηγορίας σε \"Best Hard Rock Performance\" και \"Best Metal Performance\", από την επόμενη κιόλας χρονιά. Το 1990, οι Metallica κατέκτησαν το πρώτο τους βραβείο Γκράμι στην καινούρια κατηγορία (Best Metal Performance) για το \"One\", ενώ και τα επόμενα δύο χρόνια ήταν οι νικητές της κατηγορίας (το 1991 για την διασκευή του τραγουδιού \"Stone Cold Crazy\" των Queen και το 1992 για το άλμπουμ \"Metallica\"). Μετά την κυκλοφορία του \"...And Justice for All\", οι Metallica έβγαλαν το πρώτο τους βίντεο κλιπ, για το τραγούδι \"One\". Το βίντεο τραβήχτηκε σε ένα εγκαταλελειμμένο εργοστάσιο και αναμείχθηκε με σκηνές από την ταινία αντιπολεμικού χαρακτήρα \"Johnny got his Gun\". Οι Metallica πήραν τα πνευματικά δικαιώματα για την ταινία. Το αναμειγμένο βίντεο δόθηκε στο MTV, αν και στο MTV είχαν απαγορεύσει τις αναμεμειγμένες εκδόσεις. Τελικά το κανάλι αποδέχτηκε την αναμειγμένη έκδοση και το βίντεο προβλήθηκε στην εκπομπή \"Headbangers Ball\" στις 3:00 τα ξημερώματα. Στις επόμενες 2 ώρες το κανάλι δέχτηκε πάνω από 5.000 τηλεφωνήματα για να ξαναπροβάλουν το βίντεο το οποίο πήρε την 38η θέση στα «100 Καλύτερα βίντεο όλων των εποχών» του MTV, το 1999.[23] Τα σινγκλ του άλμπουμ ήταν τα \"Eye of the Beholder\", \"Harvester of Sorrow\" και \"One\"., 75585=Αφού συμμετείχαν στις συναυλίες των «Τεσσάρων Μεγάλων» στην Ευρώπη και την Αμερική το 2010 και το 2011, στις 15 Ιουνίου 2011 οι Metallica ανακοίνωσαν ότι ολοκλήρωσαν τις ηχογραφήσεις κατά την συνεργασία τους με τον Λου Ριντ των The Velvet Underground.[50] Η συνεργασία αυτή κυκλοφόρησε σε διπλό άλμπουμ στις 1 Νοεμβρίου του 2011 με τίτλο \"Lulu\", με το νέο άλμπουμ να περιλαμβάνει δέκα τραγούδια, οι στίχοι των οποίων είναι γραμμένοι από τον Ριντ, ενώ η μουσική από τον Ριντ και τους Metallica.[51] Στις 9 Ιουνίου 2012, το συγκρότημα εμφανίστηκε ως πρώτο όνομα στο φεστιβάλ \"Download\" της Αγγλίας, παίζοντας ολόκληρο το \"Black Album\".[52] Τον Δεκέμβριο του 2011, είχε κυκλοφορήσει το ΕΡ \"Beyond Magnetic\" με τέσσερα τραγούδια τα οποία δεν συμπεριλήφθηκαν στο \"Death Magnetic\", κυρίως λόγω περιορισμών της χωρητικότητας του CD.[53] Τα τραγούδια του ΕΡ ήταν τα \"Hell And Back\", \"Hate Train\", \"Just A Bullet Away\" και \"Rebel of Babylon\" και έπαιξαν ζωντανά ένα τραγούδι εξ αυτών ανά ημέρα κατά τις συναυλίες για τα τριάντα χρόνια των Metallica. Οι συγκεκριμένες εμφανίσεις πραγματοποιήθηκαν στο \"The Fillmore\" του Σαν Φρανσίσκο, με γκεστ εμφανίσεις από τον Ντέιβ Μαστέιν, τον Τζέισον Νιούστεντ, τον Γκλεν Ντάντσιχ, τον Ozzy Osbourne, τον Τζέρι Καντρέλ, τους Apocalyptica, μέλη των Diamond Head και τον King Diamond.[54] Το Νοέμβριο του 2012, το συγκρότημα έληξε την συνεργασία του με την Warner Bros. και ανακοίνσε την δημιουργία της Blackened Recordings.[55] Ένα μήνα αργότερα, κυκλοφόρησαν το DVD \"Quebec Magnetic\" και μέσα στο 2013 κυκλοφόρησαν την ταινία \"Metallica: Through the Never\" σε σκηνοθεσία του Νίμροουντ Άνταλ, με πρωταγωνιστή τον Ντέιν ΝτεΧάαν.[56] Το καλοκαίρι του 2013, ο Ούλριχ δήλωσε ότι το 2014 οι Metallica θα ηχογραφούσαν τον επόμενο τους δίσκο, με πιθανή κυκλοφορία το 2015.[57], 28686=O πρόεδρος της Elektra Records A&R, Μάικλ Άλαγκο (Michael Alago) και ο συν-ιδρυτής της Q-Prime Management Cliff πήγαν σε μια συναυλία των Metallica τον Σεπτέμβριο του 1984. Αφού εντυπωσιάστηκαν από αυτό που είδαν, έγραψαν τους Metallica στην Elektra Records και τους έκαναν πελάτες της Q-Prime Management.[12] Η μεγάλη επιτυχία οδήγησε τους Metallica στην δημιουργία του \"Creeping Death EP\" το οποίο πούλησε περισσότερα από 40.000 αντίτυπα στις Ηνωμένες Πολιτείες. Οι Metallica έκαναν την πρώτη τους μεγάλη περιοδεία στην Ευρώπη με τους Tank σε μέγιστο αριθμό θεατών τους 1.300. Γυρνώντας στις ΗΠΑ έκαναν μια περιοδεία με τους W.A.S.P. και τους Armored Saint ως support συγκρότημα. Οι Metallica έπαιξαν την μεγαλύτερη συναυλία τους στο φεστιβάλ \"Monsters of Rock\" στις 17 Αυγούστου 1985, με τους Bon Jovi και τους Ratt στο πάρκο Ντόνιγκτον της Αγγλίας, μπροστά σε 70.000 θεατές. Σε μια συναυλία στο Όκλαντ της Καλιφόρνια για το φεστιβάλ \"Day on the Green\" οι Metallica έπαιξαν μπροστά σε 60.000 οπαδούς τους.[12] Το άλμπουμ \"Master of Puppets\" ηχογραφήθηκε στα \"Sweet Silence studios\" και εκδόθηκε τον Μάρτιο του 1986 ανεβαίνοντας στην 29η θέση του Billboard και παραμένοντας εκεί για 72 εβδομάδες.[13] Το άλμπουμ αυτό ήταν το πρώτο του συγκροτήματος που έγινε χρυσό, στις 4 Νοεμβρίου 1986 και έξι φορές πλατινένιο το 2003.[14] Ο Στιβ Χιούι του \"Allmusic\" θεώρησε το άλμπουμ \"το καλύτερο εγχείρημα τους\". Μετά την έκδοση του άλμπουμ οι Metallica έκαναν μια περιοδεία με τον Ozzy Osbourne στις Ηνωμένες Πολιτείες. Το σινγκλ του άλμπουμ ήταν το \"Master of Puppets\", ενώ στον δίσκο περιλαμβάνονταν τα \"Battery\", \"Disposable Heroes\" και \"Welcome Home (Sanitarium)\"., 52706=Το Νοέμβριο του 1993, κυκλοφόρησε το πρώτο ζωντανά ηχογραφημένο άλμπουμ των Metallica, με τίτλο \"Live Shit: Binge & Purge\", το οποίο εκδόθηκε με 3 CD αλλά και τρεις κασέτες VHS.[31] Η συγκεκριμένη κυκλοφορία ανέβηκε στην 26η θέση του Billboard και έχει βραβευθεί ως 15 φορές πλατινένια., 40200=Το \"...And Justice for All\" ήταν το πρώτο στούντιο άλμπουμ των Metallica μετά τον θάνατο Μπάρτον και εκδόθηκε το 1988. Το άλμπουμ ήταν μια εμπορική επιτυχία παίρνοντας την έκτη θέση στα τσαρτ του Billboard και έγινε πλατινένιο μετά από εννέα εβδομάδες. Το μπάσο του Νιούστεντ είχε χαμηλωθεί, ως ένα κομμάτι πειράγματος που δεχόταν και οι μουσικές του ιδέες αγνοούνταν (αν και συμμετείχε στη σύνθεση του \"Blackened\").[20] Υπήρχαν παράπονα για την παραγωγή του άλμπουμ με τον Στιβ Χιούι του \"Allmusic\" να γράφει ότι τα τύμπανα και οι κιθάρες είχαν πολύ τρέμουλο και βάθος. Η περιοδεία \"Damaged Justice\" ακολούθησε αυξάνοντας την δημοτικότητα του συγκροτήματος και των μέχρι τότε κυκλοφοριών του.[21] Το 1989, οι Metallica πήραν την πρώτη τους υποψηφιότητα για Βραβείο Γκράμι, στην κατηγορία \"Best Hard Rock/Metal Performance Vocal or Instrument\". Αν και οι Metallica ήταν το φαβορί, το βραβείο δόθηκε στους Jethro Tull για το άλμπουμ \"Crest of a Knave\". Το αποτέλεσμα οδήγησε σε αντιπαράθεση μεταξύ του κοινού και των ΜΜΕ, ενώ οι Metallica καθόταν πίσω από την σκηνή περιμένοντας να πάρουν βραβείο για την εκτέλεση του τραγουδιού \"One\". Οι Jethro Tull είχαν συμβουλευτεί από τον μάνατζερ τους να μην παραβρεθούν στην εκδήλωση, καθώς όλος ο κόσμος περίμενε τους Metallica να νικήσουν. Τα βραβεία αναφέρονται από την εφημερίδα \"Entertainment Weekly\" ως ένα από τα «δέκα μεγαλύτερα προβλήματα των Γκράμι».[22] Τρία χρόνια αργότερα, Ο Ούλριχ αναφέρθηκε στα βραβεία του 1989 όταν παραλάμβανε το βραβείο Γκράμι λέγοντας «Πρέπει να ευχαριστήσουμε τους Jethro Tull που δεν έβγαλαν άλμπουμ φέτος»., 61268=Το 2000, το ντέμο του τραγουδιού \"I Disappear\", το οποίο ήταν προγραμματισμένο να κυκλοφορήσει παράλληλα με την ταινία \"Mission: Impossible II\" διέρρευσε στο διαδίκτυο μέσω της μηχανής αναζήτησης \"Napster\", με ολόκληρη την δισκογραφία των Metallica να είναι διαθέσιμη.[36] Το συγκρότημα κατέθεσε μήνυση κατά των υπευθύνων της σελίδας χωρίς να αναφέρει ονόματα. Πάνω από 300.000 λογαριασμοί χρηστών της ιστοσελίδας διαγράφηκαν, όπως και 230.000 μετά από μήνυση του ράπερ Dr. Dre.[37] Κατά την κατάθεση του στο δικαστήριο, ο Ούλριχ αναφέρθηκε σε παραβίαση πνευματικών δικαιωμάτων και τελικά η ιστοσελίδα δέχτηκε να μην μοιράζεται μουσική από καλλιτέχνες οι οποίοι δεν συμφωνούσαν.[38], 47487=Τον Οκτώβριο του 1990 οι Metallica ξεκίνησαν τις ηχογραφήσεις του επόμενου τους δίσκου στο \"One on One studio\" του Χόλιγουντ, με παραγωγό τον Μπομπ Ροκ. Με κόστος ενός εκατομμυρίου δολαρίων και μετά από μίξη η οποία πραγματοποιήθηκε τρεις φορές, το \"Black Album\" εκδόθηκε στις 12 Αυγούστου 1991 και πούλησε 650.000 αντίτυπα την πρώτη εβδομάδα κυκλοφορίας του.[24] Πήρε την πρώτη θέση στα τσαρτ του Billboard και είναι το 25ο πιο επιτυχημένο άλμπουμ στην Βόρεια Αμερική.[25] Τα σινγκλ του δίσκου ήταν τα \"\"Enter Sandman\", \"The Unforgiven\", \"Nothing Else Matters\", \"Wherever I May Roam\" και \"Sad but True\". Οι ηχογραφήσεις του άλμπουμ, όπως και η περιοδεία για την προώθηση του αποτυπώθηκαν στο ντοκιμαντέρ \"A Year and a Half in the Life of Metallica\".[26] Η περιοδεία με την ονομασία \"Wherever We May Roam Tour\" διήρκεσε 14 μήνες και πέρασε από την Βόρεια Αμερική, την Ιαπωνία και την Μεγάλη Βρετανία.[27] Τον Φεβρουάριο του 1991, το συγκρότημα είχε κερδίσει το βραβείο Γκράμι για την καλύτερη χέβι μέταλ εκτέλεση με την διασκευή τους στο \"Stone Cold Crazy\" των Queen.[28] Στις 8 Αυγούστου 1992, κατά την διάρκεια της ζωντανής εμφάνισης των Metallica στο Ολυμπιακό Στάδιο του Μόντρεαλ, ο Χέτφιλντ υπέφερε εγκαύματα δευτέρου βαθμού μετά από ατύχημα επί σκηνής με τα πυροτεχνήματα του σόου την ώρα που έπαιζαν το Fade To Black.[29] Ο Τζον Μάρσαλ των Metal Church τον αντικατέστησε για το υπόλοιπο της περιοδείας στην κιθάρα, ενώ ο Χέτφιλντ έβγαινε στην σκηνή τραγουδώντας με δεμένο το χέρι.Η περιοδεία πραγματοποιήθηκε μαζί με τους Guns N' Roses.[30], 17219=Οι Metallica δημιουργήθηκαν στο Λος Άντζελες της Καλιφόρνια, στις αρχές του 1981 όταν ο ντράμερ Λαρς Ούλριχ έβαλε μια αγγελία στην εφημερίδα \"The Recycler\" που έλεγε: «Ντράμερ αναζητά άλλους metal μουσικούς για να τζαμάρουν μαζί, στο ύφος των Tygers of Pan Tang, Diamond Head και Iron Maiden».[2] Οι κιθαρίστες Τζέιμς Χέτφιλντ και Χιούγκ Τάννερ (Hugh Tanner) απάντησαν στην αγγελία. Αν και δεν είχε φτιάξει ακόμα συγκρότημα, ο Ούλριχ ρώτησε τον Μπράιαν Σλάγκελ (Brian Slagel), ιδρυτή της Metal Blade Records, αν μπορούσε να ηχογραφήσει ένα τραγούδι το οποίο θα έμπαινε στο επερχόμενο CD της εταιρείας, το \"Metal Massacre\". Ο Σλάγκελ αποδέχτηκε, και ο Ούλριχ έβαλε τον Χέρφιλντ στην θέση του τραγουδιστή και ρυθμικού κιθαρίστα.[2] Το συγκρότημα επίσημα δημιουργήθηκε τον Οκτώβριο του 1981, έξι μήνες μετά από αυτή την πρώτη συνάντηση.[3], 64047=Στις 17 Ιανουαρίου 2001, ο Τζέισον Νιούστεντ αποχώρησε από το συγκρότημα, προβάλλοντας ως δικαιολογία προσωπικούς λόγους και προβλήματα υγείας.[39] Τον Απρίλιο του 2001, ξεκίνησαν τα γυρίσματα ενός ντοκιμαντέρ που θα αποτύπωνε την δημιουργία του επόμενου τους δίσκου, τα οποία διήρκεσαν δύο χρόνια. Σε αυτό το διάστημα, ο Χέτφιλντ εισήχθη σε κέντρο αποτοξίνωσης λόγω του εθισμού του στο αλκοόλ. Στις 4 Δεκεμβρίου 2001 η θεραπεία του ολοκληρώθηκε και οι Metallica επέστρεψαν στο στούντιο τον Απρίλιο της επόμενης χρονιάς.[40] Το προαναφερθέν ντοκιμαντέρ ήταν το \"Some Kind of Monster\", όπου παρουσιάζεται η εικόνα ενός συγκροτήματος με σοβαρά προβλήματα και αβέβαιο μέλλον. Για τις ηχογραφήσεις του νέου δίσκου, το μπάσο ανέλαβε ο παραγωγός Μπομπ Ροκ. Η ηχογράφηση του δίσκου ολοκληρώθηκε στις αρχές του 2003 και οι Metallica δοκίμασαν μπασίστες για να ολοκληρώσουν και πάλι την σύνθεση τους. Στις 24 Φεβρουαρίου 2003, οι Metallica ανακοίνωσαν ως νέο τους μπασίστα τον Ρόμπερτ Τρουτζίλο (Robert Trujillo), γνωστό για την συμμετοχή του στο προσωπικό σχήμα του Ozzy Osbourne προσφέροντας του μάλιστα και ένα εκατομμύριο δολάρια για να δεχτεί. Τον Ιούνιο του 2003, κυκλοφόρησε το όγδοο στούντιο άλμπουμ των Metallica με τίτλο \"St. Anger\". Το άλμπουμ ανέβηκε στην πρώτη θέση των τσαρτ σε τριάντα χώρες και δέχτηκε σκληρή κριτική από τους μουσικοκριτικούς. Τα σινγκλ του δίσκου ήταν τα \"St. Anger\", \"Frantic\", \"The Unnamed Feeling\" και \"Some Kind of Monster\". To ομώνυμο κομμάτι κέρδισε το βραβείο Γκράμι στην κατηγορία \"Best Metal Performance\", το 2004.[41] Η περιοδεία για την προώθηση του δίσκου ονομάστηκε \"Madly in Anger with the World Tour\". Πριν την εμφάνιση του συγκροτήματος στο φεστιβάλ \"Download\" του 2004, ο Ούλριχ μεταφέρθηκε στο νοσοκομείο με κρίση πανικού.[42] Για την συγκεκριμένη συναυλία, την θέση του πήρε ο Τζόι Τζόρντισον των Slipknot, ενώ σε δύο τραγούδια έπαιξε ο Ντέιβ Λομπάρντο των Slayer και στο \"Fade to Black\" ο τεχνικός για τα τύμπανα του συγκροτήματος, Φλέμινγκ Λάρσεν.[43] Την επόμενη χρονιά, τα μέλη του συγκροτήματος έκαναν διάλειμμα από τις ηχογραφήσεις και τις περιοδείες περνώντας χρόνο με τις οικογένειες και τους φίλους τους, με εξαίρεση δύο συναυλίες στο \"AT&T Park\" του Σαν Φρανσίσκο, όπου άνοιξαν τις εμφανίσεις των Rolling Stones, το Νοέμβριο του 2005.[44], 54218=Μετά από τρία χρόνια περιοδειών για την προώθηση του ιδιαίτερα επιτυχημένου \"Metallica\", το συγκρότημα πραγματοποίησε την περιοδεία \"Shit Hits the Sheds Tour\" το καλοκαίρι του 1994, παίζοντας ως πρώτο όνομα στο φεστιβάλ \"Woodstock '94\".[32] Την επόμενη χρονιά παρουσίασαν μικρή δραστηριότητα, δίνοντας τρεις συναυλίες στο Ντόνινγκτον της Μεγάλης Βρετανίας με τους Slayer, Slash's Snakepit, Therapy? και Corrosion of Conformity να ανοίγουν τις εμφανίσεις τους.[33] Το 1996 κυκλοφόρησε το \"Load\" μετά από ηχογραφήσεις εννέα μηνών, το οποίο κατέλαβε την πρώτη θέση στα τσαρτ του Billboard. Έχει γίνει χρυσό στην Μεγάλη Βρετανία και μέχρι σήμερα έχει πουλήσει πάνω από πέντε εκατομμύρια αντίτυπα. Η συγκεκριμένη ηχογράφηση παρουσίασε αλλαγή σε σχέση με τον μέχρι τότε ήχο των Metallica, οι οποίοι απέβαλαν τα thrash metal στοιχεία από την μουσική τους. Η περιοδεία για την προώθηση του δίσκου ονομάστηκε \"Poor Touring Me\", με το συγκρότημα να εμφανίζεται στο εναλλακτικό φεστιβάλ \"Lollapalooza\" το καλοκαίρι του 1996.[34] Το 1997, κυκλοφόρησαν το άλμπουμ \"ReLoad\" με τραγούδια που ηχογραφήθηκαν για το \"Load\", αλλά λόγω άρνησης της δισκογραφικής εταιρείας να τα κυκλοφορήσει ως διπλό άλμπουμ, συμπεριλήφθηκαν σε αυτήν την κυκλοφορία. Για την προώθηση του δίσκου, οι Metallica πραγματοποίησαν την περιοδεία \"Poor Re-Touring Me Tour\" και εμφανίστηκαν στην εκπομπή \"Saturday Night Live\" του τηλεοπτικού δικτύου NBC παίζοντας τα \"Fuel\" και \"The Memory Remains\" με την Μάριαν Φέιθφουλ.[35] Το 1998, κυκλοφόρησε το διπλό άλμπουμ διασκευών \"Garage.Inc\", σκαρφαλώνοντας στην δεύτερη θέση των αμερικάνικων τσαρτ. Η συγκεκριμένη κυκλοφορία περιελάμβανε ολόκληρο το \"Garage Days Re-revisited\" και τραγούδια καλλιτεχνών όπως οι Diamond Head, Black Sabbath, Thin Lizzy, Lynyrd Skynyrd, The Misfits, Motörhead, κ.α. ηχογραφημένα από τους Metallica. Το 1999 εκδόθηκε το δεύτερο ζωντανά ηχογραφημένο άλμπουμ των Metallica, με τίτλο \"S&M\", το οποίο ήταν το τελευταίο άλμπουμ του Τζέισον Νιούστεντ με τους Metallica. Πρόκειται για μια ηχογράφηση των Metallica από το θέατρο \"Berkeley Community Theatre\" με την συμμετοχή της Συμφωνικής Ορχήστρας του Σαν Φρανσίσκο, υπό την διεύθυνση του Μάικλ Κέιμεν (Michael Kamen). Η ηχογράφηση έγινε σε δύο παραστάσεις, στις 21 και 22 Απριλίου του 1999. Κατά κύριο λόγο περιέχει παλαιότερα τραγούδια του συγκροτήματος, αλλά και δύο νέα τραγούδια, το \"No Leaf Clover\" και το \"Human\", καθώς και μια εκτέλεση του \"The Ecstasy of Gold\" του Ένιο Μορικόνε. Το άλμπουμ έφθασε στην δεύτερη θέση στα τσαρτ του Billboard και πούλησε πάνω από έξι εκατομμύρια αντίτυπα για να βραβευθεί ως εξαπλά πλατινένιο. Τα σινγκλ του δίσκου ήταν το \"No Leaf Clover\" και το \"Nothing Else Matters '99\"., 35016=Στις 27 Σεπτεμβρίου 1986, κατά τη διάρκεια της περιοδείας \"Damage Inc.\", τα μέλη του συγκροτήματος τράβηξαν κάρτες για το που θα κοιμηθεί ο καθένας μέσα στο λεωφορείο. Ο Μπάρτον νίκησε και διάλεξε να κοιμηθεί στο κρεβάτι του Χάμμετ. Τα ξημερώματα κοντά στο Ντεράρπ της Σουηδίας, ο οδηγός του λεωφορείου έχασε τον έλεγχο και το λεωφορείο γλίστρησε, κάνοντας το να αναποδογυρίσει πολλές φορές. Ο Ούλριχ, o Χάμμετ και ο Χέτφιλντ δεν είχαν σοβαρά τραύματα όμως ο Μπάρτον καταπλακώθηκε από το λεωφορείο και πέθανε. Ο Χέτφιλντ θυμάται ότι είπε: «Είδα το λεωφορείο να στέκεται πάνω του και τα πόδια του να φαίνονται μόνο. Φρίκαρα. Ο οδηγός προσπαθούσε να βγάλει το λεωφορείο από την θέση του. Πήγα και του είπα, \"Μην το κάνεις αυτό!\". Ήθελα να τον σκοτώσω εκείνη την μέρα».[15] Ο θάνατος του Μπάρτον έκανε αβέβαιο το μέλλον των Metallica. Τελικά, τα τρία μέλη αποφάσισαν ότι ο Μπάρτον θα ήθελε να συνεχίσουν και με τις ευλογίες της οικογένειας του, το συγκρότημα συνέχισε.[16][17] Περίπου σαράντα άτομα πήγαν στις οντισιόν των Metallica, ανάμεσά τους οι παιδικοί φίλοι του Χάμμετ, Λες Κλέιπουλ (Les Claypool) των Primus, Τρόυ Γκρέγκορυ (Troy Gregory) των Prong και ο Τζέισον Νιούστεντ (Jason Newsted) των Flotsam and Jetsam. Ο Νιούστεντ έμαθε όλα τα τραγούδια των Metallica και μετά από την οντισιόν οι Metallica τον κάλεσαν στο \"Tommy's Joynt\" του Σαν Φρανσίσκο. Οι Χέτφιλντ, Ούλριχ και Χάμμετ αποφάσισαν ότι ο Νιούστεντ μπορούσε να αντικαταστήσει τον Μπάρτον και η πρώτη του ζωντανή εμφάνιση με τους Metallica ήταν στο \"Country club\" στην Ρισέντα της Καλιφόρνια. Λέγεται πως οι Metallica για να τον εντάξουν στην σύνθεση τους, του έδωσαν να φάει μια μπάλα από γουασάμπι.[16] Οι Metallica τέλειωσαν την περιοδεία τους στους πρώτους μήνες του 1987 και τον Αύγουστο του ίδιου έτους κυκλοφόρησαν ένα EP με όνομα \"The $5.98 E.P.: Garage Days Re-Revisited\".[18] Το ΕΡ περιείχε 5 κομμάτια με διασκευές τραγουδιών άλλων καλλιτεχνών και ηχογραφήθηκε για να δοκιμάσουν τον ήχο του νέου τους στούντιο, το ταλέντο του Νιούστεντ και να ανακουφιστεί το στρες και η θλίψη από τον θάνατο του Μπάρτον. Ένα βίντεο με τίτλο \"Cliff 'Em All\" εκδόθηκε το 1987 που έδειχνε την ζωή του Μπάρτον στα τρία του χρόνια με τους Metallica.[19] Το βίντεο περιέχει τραγούδια από ζωντανές εμφανίσεις των Metallica από την εποχή του Μπάρτον, σκηνές από την καθημερινή ζωή τους και κάποια ακυκλοφόρητα σόλο του Μπάρτον από συναυλίες., 69827=Το 2006, οι Metallica ανακοίνωσαν ότι δεν θα συνεργαστούν στον επόμενο τους δίσκο με τον Μπομπ Ροκ, για πρώτη φορά μετά από δεκαπέντε χρόνια, αλλά την παραγωγή θα αναλάμβανε ο Ρικ Ρούμπιν. Στις 12 Σεπτεμβρίου 2008, κυκλοφόρησε το ένατο άλμπουμ των Metallica με τίτλο \"Death Magnetic\", το οποίο σκαρφάλωσε στην κορυφή του Billboard και οδήγησε τους Metallica να βραβευτούν ως το μόνο συγκρότημα που έχει πέντε συνεχόμενα # 1 άλμπουμ.[45] Το συγκρότημα γύρισε και ένα βίντεο κλιπ για το τραγούδι \"The Day That Never Comes\", το οποίο αποτέλεσε το πρώτο σινγκλ του δίσκου. Ο δίσκος πούλησε 490.000 αντίτυπα στις Ηνωμένες Πολιτείες κατά την πρώτη εβδομάδα κυκλοφορίας του και παρέμεινε στην κορυφή για τρεις εβδομάδες, ενώ έφθασε στο # 1 σε 32 χώρες.[46]}",
    "lastModified": "Wed, 29 Jul 2015 17:17:46 GMT",
    "textBeforeTable": "Δισκογραφία[Επεξεργασία | επεξεργασία κώδικα] 2009: Best Album – Death Magnetic (άλμπουμ) 2008: Inspiration Award Winner – Metallica 2004: Best Band on the Planet – Metallica 2003: Best International Band – Metallica 2003: Hall of Fame – Metallica Kerrang! Awards: 1999: Catalogue Album of the Year – Metallica (άλμπουμ) 1999: Catalogue Artist of the Year – Metallica 1997: Billboard Rock and Roll Artist of the Year – Metallica (RIAA Diamond Award) Billboard Music Awards: 1996: Favorite Metal/Hard Rock Song – «Until It Sleeps» 1996: Favorite Artist: Heavy Metal/Hard Rock: Metallica – Load (άλμπουμ) American Music Awards: 1996: Best Metal Video – «Until It Sleeps» 1992: Best Metal Video – «Enter Sandman» MTV Video Music Awards: 2009: Best Recording Package - Death Magnetic (άλμπουμ) 2009: Best Metal Performance – «My Apocalypse» 2004: Best Metal Performance – «St. Anger» 2001: Best Rock Instrumental Performance – «The Call of Ktulu» με τον Michael Kamen και την συμφωνική ορχίστρα του Σαν Φρανσισκο. 2000: Best Hard Rock Performance – «Whiskey in the Jar» 1999: Best Metal Performance – «Better than You» 1992: Best Metal Performance – Metallica (άλμπουμ) 1991: Best Metal Performance – «Stone Cold Crazy»",
    "textAfterTable": "Σχετική βιβλιογραφία[Επεξεργασία | επεξεργασία κώδικα] Christe, Ian (2003). Sound of the Beast: The Complete Headbanging History of Heavy Metal. HarperCollins. ISBN 0-380-81127-8  Steffan Chirazi and Metallica (2004). So What!: The Good, The Mad, and The Ugly. Broadway. ISBN 0767918819.  Glenn T. Pillsbury (2006). Damage Incorporated: Metallica and the Production of Musical Identity. Routledge. ISBN 9780415973748.  Παραπομπές[Επεξεργασία | επεξεργασία κώδικα] ↑ Lee, Cosmo (7 Μαΐου 2007). «Get Thrashed: The Story of Thrash Metal». '\"Stylus Magazine. http://www.stylusmagazine.com/articles/movie_review/get-thrashed-the-story-of-thrash-metal.htm. Ανακτήθηκε στις 26 Νοεμβρίου 2010.  ↑ 2,0 2,1 2,2 «Metallica Timeline Early 1981 – Early 1982». MTV.com. MTV Networks. Αρχειοθετήθηκε από το πρωτότυπο στις May 28, 2009. http://www.webcitation.org/5h73iF8Ol. Ανακτήθηκε στις 28 Νοεμβρίου 2010.  ↑",
    "hasKeyColumn": true,
    "keyColumnIndex": 12,
    "headerRowIndex": 0
}