{
    "relation": [
        [
            "",
            "Trent Cole",
            "Cullen Jenkins",
            "Fletcher Cox",
            "Brandon Graham",
            "Derek Landri",
            "Darryl Tapp",
            "Cedric Thornton",
            "Vinny Curry",
            "Phillip Hunt"
        ],
        [
            "Pass-Rushing Opportunities",
            "33",
            "28",
            "27",
            "27",
            "13",
            "9",
            "8",
            "4",
            "3"
        ],
        [
            "Sacks",
            "1",
            "1",
            "1.5",
            "2.5",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Hurries",
            "2",
            "0",
            "2",
            "3",
            "N/A",
            "0",
            "1",
            "0",
            "0"
        ],
        [
            "Pressure Percentage",
            "9.1%",
            "3.6%",
            "14.8%",
            "22.2%",
            "N/A",
            "0%",
            "12.5%",
            "0%",
            "0%"
        ]
    ],
    "pageTitle": "Darryl Tapp Archives - Philadelphia Magazine",
    "title": "",
    "url": "http://www.phillymag.com/tag/darryl-tapp/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00098-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 643298423,
    "recordOffset": 643265467,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5621=Sheil Kapadia   |   December 23, 2012 at 11:44 am   |   2 Comments, 12730=Jake Scott – He was out of the league until the Eagles’ ninth game of the season in 2012. But Scott got seven starts at right guard, taking over for Danny Watkins. While he wouldn’t be a bad option for depth/competition, my guess is the Eagles will go with a younger option. Scott turns 32 next month., 3945=Despite being healthy, Vick is inactive. He has not dressed since suffering a concussion against the Cowboys on Nov. 11. Trent Edwards will serve as Nick Foles’ backup., 2019=Sheil Kapadia   |   December 16, 2012 at 12:10 pm   |   12 Comments, 10500=Darryl Tapp – I think we can safely say the Seahawks got the better of this trade. The Eagles sent Chris Clemons and a fourth-round pick to Seattle for Tapp back in 2010. Tapp has had six sacks in 39 games with the Eagles as a rotational defensive end. Clemons has 33.5 sacks in 48 games as a key member of the Seahawks’ defense. Tapp played 28.5 percent of the Eagles’ snaps, per PFF, but managed just half-a-sack and eight hurries. At 28, he’ll try to catch on elsewhere., 8503=Sheil Kapadia   |   December 30, 2012 at 11:40 am   |   1 Comment, 3710=LeSean McCoy returns to the lineup for the first time since Nov. 18 when he sustained a concussion in the final two minutes of the first meeting with the Redskins. He’ll start but will likely be eased back in, Andy Reid said during the week. Bryce Brown figures to see a fair share of playing time., 11904=King Dunlap – I’ve seen arguments by people who think he deserves a legitimate shot to start somewhere, and I have to disagree. Dunlap, a seventh-round pick in 2008, deserves credit for having stayed in the league this long. He’s a complete non-factor as a run blocker and had nine penalties, tied for the most among Eagles offensive players. Dunlap demonstrated competency as a pass blocker on occasion, but it’s highly unlikely that his body could hold up as a 16-game starter. The 27-year-old will look to find a roster spot elsewhere., 9977=Jon Dorenbos – I’ll admit to not knowing the intricacies of the long-snapper market these days. Dorenbos turns 33 in July and has appeared in 101 games in seven years for the Eagles., 14927=Sheil Kapadia   |   March 5, 2013 at 10:02 am   |   23 Comments, 12379=Derek Landri - He was really good in 2011, but that production did not carry over to last season. Landri was part of the defensive tackle rotation (46.1 percent of the snaps, per Pro Football Focus), but didn’t have a sack all year. Even though he had seven tackles for loss, Landri struggled against the run also. I would be surprised if the Eagles brought the 29-year-old back., 7205=With Nick Foles out, Michael Vick will get his first start since suffering a concussion against the Cowboys on Nov. 11. Trent Edwards will back him up. If Vick suffers a serious injury, the Eagles could be on the hook for a $3 million guarantee (details here).}",
    "TableContextTimeStampAfterTable": "{33402=Sheil Kapadia   |   November 14, 2012 at 9:06 am   |   6 Comments, 44169=Sheil Kapadia   |   November 13, 2012 at 6:09 pm   |   5 Comments, 26595=Sheil Kapadia   |   November 20, 2012 at 6:58 pm   |   7 Comments, 18911=Sheil Kapadia   |   December 7, 2012 at 11:12 am   |   9 Comments, 72820=Copyright © 2015 Metro Corp. All rights reserved. Member, American Society of Magazine Editors and City and Regional Magazine Association., 72614=Established 1908 Philadelphia Magazine, 5311=Trent Cole – He had seven solo tackles, a season-high. To put that into perspective, Cole had seven solo tackles in the previous five games combined. In the second, he looped inside and sacked Dalton. It helped that the left guard slipped on the play. Excellent job of shedding the tight end and tackling Green-Ellis after a 2-yard run in the third. Cole pressured Dalton and forced him to scramble in the third. He fought through a trap block and tackled Green-Ellis after a 3-yard run in the third. Nice job setting the edge and then making the tackle on Green-Ellis after a 1-yard run in the third. Cole tackled Green-Ellis after a 4-yard gain in the third. And he hit Dalton as he threw the ball away in the fourth. If you’re wondering about Cole’s future, given the way his contract’s set up, he’s definitely coming back in 2013. He turned 30 in October. While Cole’s best days may be behind him, he provided reason to believe he can still be a productive player with his performance on Thursday., 72743=1818 Market Street, Philadelphia PA 19103, 58015=Be sure to join me and Tim for a live chat during the game. Kickoff is set for 8:30., 41747=Brandon Graham – Strange snap breakdown for Graham. Overall, he was on the field for 24 plays, just four fewer than Babin. But 17 of those 24 were running plays. He only got seven chances to rush the passer. Graham got blocked by Jason Witten on the toss to the right that picked up 5 yards in the first. Good hustle, but missed the tackle on Felix Jones’ touchdown. He was pretty much unblocked, but still got to Romo quickly, helping lead to the Mychal Kendricks sack in the second. If the Eagles are going to start looking ahead to 2013 at some point, Graham should be playing more than Babin., 55314=Sheil Kapadia   |   November 5, 2012 at 7:31 pm   |   2 Comments, 9406=Sheil Kapadia   |   December 11, 2012 at 11:35 am   |   11 Comments}",
    "lastModified": "Wed, 29 Jul 2015 22:20:54 GMT",
    "textBeforeTable": "Sacks are tracked by the NFL. Hurries are tracked by Eagles coaches. And pass-rushing chances by Pro Football Focus. Pressure percentage measures the frequency with which each player notched a sack or hurry. In a future post, we’ll break out the All-22 and look at why the Eagles defensive line was successful. But first, the player-by-player breakdown. In all, the defensive line combined for six sacks and eight hurries. Andy Dalton was under constant pressure and completed just 13 of 27 passes for 127 yards. Brandon Graham had a career game. Trent Cole looked like the old Trent Cole. Fletcher Cox continued an impressive rookie campaign. And guys like Cullen Jenkins and Cedric Thornton contributed as well. The Eagles’ defensive line turned in its best performance of the season Thursday night against the Bengals. Sheil Kapadia   |   December 16, 2012 at 12:10 pm   |   12 Comments Eagles DL Production: Cox, Cole And Graham In 2013? Follow Sheil Kapadia on Twitter and e-mail him at skapadia@phillymag.com. Become a fan of Birds 24/7 on Facebook. Don’t forget to join us for a live chat during",
    "textAfterTable": "As you can see with the numbers, Graham added a team-high three hurries to his 2.5 sacks. He notched either a sack or hurry once every 4.5 chances. Cox had 1.5 sacks and two hurries for the second-highest pressure percentage among linemen – impressive, considering he’s rushing from the tackle spot. There appears to have been an error with Derek Landri’s stats. That’s why you see an N/A next to his name. Vinny Curry only had four chances to rush the passer. Those came from the right defensive end spot. Below is the player-by-player review, after having re-watched the game. Brandon Graham – I feel confident in saying he turned in the most productive game of any of the team’s defensive linemen this season. Graham had 2.5 sacks, three hurries and 10 tackles – the best single-game mark for an Eagles DE this season. Graham and Colt Anderson stopped BenJarvus Green-Ellis for no gain in the red zone in the first. He went around right around right tackle Andre Smith for his first sack. Graham and Jenkins forced Dalton to escape the pocket and throw incomplete on third down in the first. He and DeMeco Ryans brought Green-Ellis down after a 4-yard gain in the second. Great bull-rush vs. Smith, causing Dalton to throw high on a second-quarter incompletion. Graham used his speed and hands to get around Smith in the second, sacking and stripping Dalton. He drew a holding penalty on a run",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}