{
    "relation": [
        [
            "",
            "ABAT'10",
            "ABAT'09",
            "Wuxi'08",
            "VLNC",
            "AONE",
            "ENS",
            "TSLA",
            "BYDDY"
        ],
        [
            "Gross Margin",
            "52.7%",
            "44.6%",
            "9.4%",
            "12.7%",
            "-17.9%",
            "22.9%",
            "25.9%",
            "21.6%"
        ],
        [
            "Op Margin",
            "38.9%",
            "28.5%",
            "-25.9%",
            "-113.4%",
            "-153.4%",
            "7.0%",
            "-125.9%",
            "11.9%"
        ],
        [
            "Net Margin",
            "37.8%",
            "34.3%",
            "-39.9%",
            "-146.5%",
            "-156.7%",
            "3.9%",
            "-132.8%",
            "9.4%"
        ],
        [
            "R&D %",
            "0.2%",
            "0.6%",
            "4.4%",
            "27.5%",
            "62.4%",
            "undisclosed",
            "79.3%",
            "3.2%"
        ],
        [
            "R&D $m",
            "$0.2",
            "$0.3",
            "$0.4",
            "$4.4",
            "$60.7",
            "undisclosed",
            "$37.6",
            "$195.6"
        ]
    ],
    "pageTitle": "Advanced Battery Technologies: An Egregious Chinese RTO - Advanced Battery Technologies, Inc. (OTCMKTS:ABAT) | Seeking Alpha",
    "title": "",
    "url": "http://seekingalpha.com/article/260883-advanced-battery-technologies-an-egregious-chinese-rto",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00247-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 220105207,
    "recordOffset": 220070346,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{23613=[Author's correction: Our reason for believing that the $4.8 million loan had not been disclosed prior to the 2006 10-K was that the disclosure was not explicitly listed under the 2005 10-K, footnote 17, \"Related Party Transactions\" or in the 2005 balance sheets. Our research had also shown that there was no explicit disclosure in the 2004 10-K, under footnote 19, \"Related Party Transactions\", or in the 2004 balance sheets. However, the company did in fact disclose the transaction in other sections of its 10-K filings. We regret and apologize for our oversight., 28581=In December 2008 Advanced Battery Technologies purchased a 49% equity interest in Beyond E-Tech, Inc. (BET), a corporation located in Texas that distributes cellular telephones manufactured in China to its order by Flying Technology Development Co. and Lenovo China. The purchase price for the shares was $1.5 million cash., 61119=I searched every SEC filing by the company between the 2008 10-K and the 2009 10-K. As late as the 10-Q filed on August 11, 2009, the company continued to claim ownership of HLJ ZQPT without ever mentioning Harbin ZQ., 64933=Advanced Battery Technologies (OTCPK:ABAT) is a $250 million market cap company listed on the Nasdaq. The company originally went public through a reverse merger transaction with a shell company called Buy It Cheap.com in 2004. The company claims to have increased its revenues from $11 thousand to $97 million from 2003 to 2010., 14030=The addition of 1.3 million shares in 2009 is explained by a 1 million share purchase that was part of the Wuxi transaction, and the balance (I believe) by options., 19850=January 2006: Fu sells a patent on “a nano material lithium ion battery and its production process” to the company for 4.4 million shares., 53554=2005, 62964=Cashtech Investment Limited is also a holding company with only one subsidiary: Heilongjiang ZhongQiang Power-Tech Co., Ltd., a China limited liability company (“ZQ Power-Tech”). Prior to January 2006, Cashtech Investment Limited owned 70% of the capital stock of ZQ Power-Tech. In January 2006 our Chairman, Fu Zhiguo, transferred the remaining capital stock of ZQ Power Tech to Cashtech Investment Limited, so that it now owns 100% of ZQ Power-Tech., 35286=In January 2011, the company acquired Shenzhen Zhongqiang New Energy Science & Technology Co., Ltd. (“Shenzhen ZQ”) for 135 million RMB (about $20 million)., 22899=However, we still believe that the company's disclosures were inadequate. $4.8 million is larger than the total reported liabilities of the company at the end of 2004. Our understanding is that such a loan must be disclosed as a liability under GAAP. By omitting the loan from the balance sheet, the company misrepresented its true financial condition. Furthermore, it was a large enough transaction that it should have been explicitly disclosed under the Related Party Transactions footnotes (No. 17 and No. 19 in 2005 and 2004 respectively)., 13729=Prior to 2006, ABAT was audited by PKF CPA in Hong Kong. HLJ ZQPT was audited by Rosenberg Rich Baker Berman & Company. For the fiscal years 2006-2008, ABAT was audited by Bagell, Josephs, Levine & Co (which later merged with Friedman). ABAT’s 2009’s audit was done by Friedman and 2010 audit by EFP Rotenberg. Auditor changes are a red flag, as they may be a sign of “opinion shopping.”, 51397=Note: The company claimed a 2005 R&D expense of $32 in the 2005 10-K, but changed this number without explanation to $143 in the 2006 10-K. In the table, I gave them the benefit of the doubt and used $143, but I think that $32 is more likely to be the correct figure., 52835=2007, 51757=2010, 53912=2004, 20478=January 2006: Fu sells 30% of HLJ ZQPT to ABAT for 11 million shares. The company admits that Fu structured the transaction and the Board did not get a fairness opinion., 13130=(a) a lack of expertise in identifying and addressing complex accounting issues under U.S. Generally Accepted Accounting Principles among the personnel in the Company’s accounting department, which has resulted in errors in accounting that necessitated a restatement of the financial statements for 2008 and 2009 and (b) inadequate review by management personnel of the Company’s reports prior to filing, which resulted in errors in prior filings that necessitated the filing of amendments to the 2009 Annual Report and the Quarterly Reports through the quarter ended September 30, 2010. [emphasis added], 21206=The 2004 10-K risk factors include this gem:, 45242=ABAT claims to have increased revenue from $4.2 million to $97.1 million from 2005 to 2010 while DECREASING its employee count, 32393=Wuxi had a book value of $9.6 million at March 2009; a net loss of $3.7 million in 2008, and a net loss of $1.1 million in 2007. Its gross profit actually declined by 35% from 2007 to 2008. Revenue was rapidly contracting: 2009 Q1 revenue was $0.75 million, or down 63% year over year., 60886=The first mention of Harbin ZQ is in an S-3 filing dated August 17, 2009. However, this filing contains no disclosure of the VIE arrangement or Chairman Fu’s ownership., 39980=In May 2010 Wuxi ZQ signed an agreement with All-Power America to serve as the first U.S.-based distributor for Wuxi ZQ since the May 2009 acquisition., 51110=2010 R&D expense was 0.2% of its claimed revenues. So one would not expect ABAT to have significant technology to enable better margins than its competitors. Yet, looking at its public comps (I am being generous with the word “comp”), no one is even in ABAT’s ballpark:, 19459=July 2009: The company agrees to lease a house from the Chairman for $4,000 per month., 36992=How likely is it that in 2011 a legitimate company would not have a website or any search results at all? What are the odds of a “coincidence” involving several of Wuxi’s purported distributors having no websites or search results?, 52475=2008, 24242=Strangely, this contract had never been disclosed prior; in fact, no long-term liabilities whatsoever are listed in the 2005 10-K balance sheet. The 10-K does list $4.1 million of “Short Term Bank and Other Borrowings”, but Note 8 to the financial statements clearly describes that these borrowings are bank loans, car loans, and other non related party loans. There was no disclosure in the 2005 10-K under related party transactions. This so-called “contract” appears to be entirely fabricated., 33412=I think it is quite likely that the Shenzhen ZQ acquisition is a sham transaction that enabled the Chairman to funnel $20 million of proceeds from the December equity raise into his own pockets., 32809=In 2009, ABAT paid $3.64 million, 70 million RMB, and 3 million common shares to acquire Wuxi Angell (later renamed Wuxi ZQ), the producer of electric scooters and bicycles. Previously, ABAT had advanced Wuxi $3.81 million. Note that the purchase agreement does not mention the advance, and the consideration amounts do not appear to include it. So the total acquisition cost may be over $25 million., 57778=Since 2002, Wuxi ZQ has been engaged in the design, development, manufacture and marketing of electric- and hybrid-powered two wheel vehicles, as well as electric-powered agricultural transport vehicles and sport utility e-vehicles. [emphasis added], 53195=2006, 40564=Also note that the 2009 and 2010 employee counts include employees of Wuxi ZQ. It is amazing that the consolidated employee count decreased even as ABAT acquired a new subsidiary that accounts for almost all of its 100% revenue growth from 2008 to 2010., 24880=In the company’s 2006 10-K, filed April of 2007, ABAT disclosed for the first time that it had entered into a contract in January 2005 with Chairman Fu and two other individuals. This purported contract “acknowledged” [ABAT’s wording] that these three individuals had loaned $4.8 million to ABAT and that this contract “provided” that ABAT would issue 11.2 million shares to satisfy $3.3 million of the loan ($0.33 per share). At the time that the disclosure was made, the stock was trading at $0.60 per share., 60175=The 10-Q does say that they are now consolidating the results of both Harbin ZQ and HLJ ZQPT, and they refer to the change of accounting standards under topic ASC 810, consolidation. Specifically, they are referring to SFAS 166 and 167 (June 2009)., 30171=In other words, after eliminating the battery revenue that ABAT was previously getting from Wuxi, ABAT was paying 7x FY08 revenue for a business that was about to go bust. If we estimate SAAR from the 2009 Q1 revenue number, and use the same intercompany elimination percentage, we get an absurd price of 18x sales., 45607=The main difference between ABAT in 2009 and 2010 is the addition of Wuxi. Since consolidated margins improved significantly YoY, Wuxi’s implied post-acquisition gross margin was about 60% and op/net margins about 40%. These are absolutely ridiculous claims given that Wuxi had pre-acquisition gross, op, and net margins of 9.4%, -25.9%, and -39.9%., 39311=I also questioned a manager at Kuralkan, the sole manufacturer, distributor and exporter of Kanuni motorcycles since 1995, which Wuxi claims a relationship with. This manager stated, “We do not know this company [Wuxi ZQ].” He also confirmed to me that Kuralkan is the only manufacturer of Kanuni motorcycles. (“Kanuni” is the name of the Kuralkan boss’s son)., 30712=2008 Rev, 60589=The only other mention is in the 10-Q filing dated November 9, 2009. Here, we are finally told of the VIE arrangement, but the filing fails to mention that the VIE structure is different than the previously disclosed structure, nor are we told that Chairman Fu owns Heilongjiang ZQPT., 22315=Our analysis regarding the legitimacy of this transaction are unchanged. We still believe that had it been a \"real\" loan, it would have been disclosed in the 2004 balance sheet, and depending on timing, in the 2005 balance sheet as well.], 20698=2004-2005: The company sold goods to related parties. At the end of 2005, the company had a large account receivable from one of these parties. I believe this was, in effect, a kind of interest-free loan., 32092=Working capital position was negative $15 million. Cashflow from operations in the first quarter was negative $4.1 million. Wuxi had been sued five times and brought to arbitration over bad debts. The company lost all six cases and had not repaid any of the debts at year-end 2008., 54838=In other words, the company admits that LiPoly batteries are a commodity. This should come as no surprise: LiPoly batteries have been available in consumer electronics since 1996. An examination of ABAT’s patent portfolio does not reveal any IP that would give it any substantial advantage., 62132=Yet, in the 2009 10-K, we suddenly learn that HLJ ZQPT is actually owned by Chairman Fu again, without any explanation of how he reacquired ownership:, 52117=2009, 29840=Subsequent revenue growth numbers seem impossible. As a standalone company, Wuxi generated an estimated $1 million revenue in the first four months of 2009. Yet, ABAT claimed $20 million of “electric vehicle” revenue in 2009, which means that average monthly sales grew by 9.5x from the first four months of the year to the last eight months of the year. Meanwhile, the combined companies had fewer employees at year-end 2009 than legacy ABAT alone at year-end 2008., 63222=In the 2007 10-K and 2008 10-K, HLJ ZQPT is described as the 100%-owned subsidiary of Cashtech:}",
    "lastModified": "Wed, 29 Jul 2015 23:12:25 GMT",
    "textBeforeTable": "2010 R&D expense was 0.2% of its claimed revenues. So one would not expect ABAT to have significant technology to enable better margins than its competitors. Yet, looking at its public comps (I am being generous with the word “comp”), no one is even in ABAT’s ballpark: Note: The company claimed a 2005 R&D expense of $32 in the 2005 10-K, but changed this number without explanation to $143 in the 2006 10-K. In the table, I gave them the benefit of the doubt and used $143, but I think that $32 is more likely to be the correct figure. 0.21% $97,128 $204 2010 0.55% $63,561 $348 2009 0.01% $45,172 $4 2008 1.20% $31,897 $383 2007 1.13% $16,329 $185 2006 3.39% $4,222 $143 2005 5.46% $1,191 $65 2004 R&D %Rev Revenue R&D ($'000)",
    "textAfterTable": "This doesn’t make much sense: ABAT manufactures commodity products with expensive ingredients. The rest of the industry is having trouble turning a profit. Yet, ABAT claims margins that would make Google jealous. Now, before you say that ABAT has a lower cost structure because it is in China, of course this cannot be the explanation because its competitors also manufacture in China or other low cost countries, and regardless, ABAT has a number of domestic competitors who should have compressed industry margins. Manufacturing in China is a notoriously low margin business. The main difference between ABAT in 2009 and 2010 is the addition of Wuxi. Since consolidated margins improved significantly YoY, Wuxi’s implied post-acquisition gross margin was about 60% and op/net margins about 40%. These are absolutely ridiculous claims given that Wuxi had pre-acquisition gross, op, and net margins of 9.4%, -25.9%, and -39.9%. ABAT claims to have increased revenue from $4.2 million to $97.1 million from 2005 to 2010 while DECREASING its employee count ($'000) Revenue SG&A Employees Rev/Emp SG&A/Emp 2004 $1,191 $2,811 362 $3.29 $7.77 2005 $4,222 $1,221 1,261 $3.35",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}