{
    "relation": [
        [
            "Accrediting Agency",
            "Contact hours for the Course/Program",
            "Syllabus",
            "Evidence of Assessment/Grading",
            "Evidence of Consistent Quality",
            "Defined Outcomes/Objectives",
            "Controlled Environment (Class time)",
            "Textbook Used",
            "Sample Assignment",
            "Instructor Qualifications"
        ],
        [
            "ACE",
            "X",
            "X",
            "",
            "X",
            "",
            "",
            "X",
            "X",
            "X"
        ],
        [
            "PONSI",
            "",
            "X",
            "",
            "X",
            "",
            "",
            "X",
            "X",
            "X"
        ],
        [
            "USDE N/A",
            "X",
            "X",
            "X",
            "*",
            "*",
            "",
            "*",
            "X",
            "X"
        ],
        [
            "Franklin X",
            "X",
            "X",
            "X",
            "X",
            "X",
            "X",
            "X",
            "X",
            "X"
        ]
    ],
    "pageTitle": "Transfer Credit Information",
    "title": "",
    "url": "http://www.franklin.edu/getting-started/transferring-credit/policy-and-procedures/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00324-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440556203,
    "recordOffset": 440525072,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20180=As of Fall 2005, Ohio public institutions of higher education accept and apply all transfer coursework with a letter grade of D or higher as the institution would for a native student under the business rules and academic policies of the receiving institution. This policy was adopted to ensure the equitable treatment of transfer students with native students across Ohio’s public institutions. The 1990 Ohio Articulation and Transfer Policy section which requires the acceptance of all college level courses which students have passed (“D”) remains in effect for all students. This policy does not override institutional admissions standards and/or requirements of entrance into a specific academic program. Consistent with the spirit of the policy, there is no universal minimum grade or quality points for the acceptance of credit and thresholds for this are set by institutional policy., 112376=Lamar Community College, 112464=Lamar, 154224=  Ohio Board of Regents.  (n.d.)  Appendix C.  Ohio Articulation and Transfer Policy.  Retrieved April 2, 2008, from http://regents.ohio.gov/transfer/policy/appendixC.php Ohio Board of Regents.  (n.d.)  Appendix D.  Ohio Articulation and Transfer Policy.  Retrieved April 2, 2008, from http://regents.ohio.gov/transfer/policy/appendixD.php Ohio Board of Regents.  (n.d.)  Appendix E.  Ohio Articulation and Transfer Policy.  Retrieved April 2, 2008, from http://regents.ohio.gov/transfer/policy/appendixE.php Ohio Board of Regents.  (n.d.)  Background.  Ohio Career-Technical Credit Transfer.  http://regents.ohio.gov/careertechtransfer/, 168342=© 2015 Franklin University, 43514=The university launched CCA in 1998 as a partnership between two-year technical and community colleges and Franklin. In this program, students complete their associate’s degrees and approximately 24 additional hours (bridge courses) at the community college. Students then complete a minimum of 40 hours at Franklin in one of the undergraduate majors. , 13561=The Review Committee is responsible for requesting and reviewing research studies from the office of Institutional Effectiveness to assess the extent to which transfer and non-transfer students are successful in Franklin coursework and in achieving program-specific and general education outcomes. The Review Committee will meet twice a year, in November and May, with additional meetings called as needed., 27025=Courses evaluated by faculty for comparability are added to the Transfer Credit comparability database which, in 2007, had course comparability determinations from more than 5,000 sources. The database continues to be revised and expanded as determinations are made. For students in the Community College Alliance (CCA) program, many course comparabilities have been systematically determined as described in Section 5 of this transfer manual. Course comparabilities are listed on the CCA Transfer Guides and are a tool for Franklin advisors working with students., 60105=The Ohio Board of Regents Articulation and Transfer Advisory Council issued a policy on the Transfer of D Grades in 2005. That policy states that \"as of Fall 2005, Ohio public institutions of higher education are to accept and apply all transfer coursework with a letter grade of D or higher as the institution would for a native student under the business rules an academic policies of the receiving institution. These business rules and policies may include, but are not limited to, such areas as effective course dates, age of coursework, requirements of a particular major or program, and eligibility\" (Ohio Board of Regents, Appendix D).  In May and December 2005, the advisory council provided ten points of clarification for this policy. Some of these points are relevant to Franklin's transfer policies and are noted below:, 155311=Ohio Board of Regents.  (n.d.)  Preamble. Ohio Articulation and Transfer Policy.  Retrieved April 2, 2008, from http://regents.ohio.gov/transfer/policy/index.php Ohio Board of Regents.  (n.d.)  Transfer Policy.  Ohio Articulation and Transfer Policy.  Retrieved April 2, 2008, from http://regents.ohio.gov/transfer/policy/transfer_policy_d2.php U. S. Department of Education. (n.d.) 602.16 Accreditation and Preaccreditation Standards.   Financial Aid for Postsecondary Students. Retrieved April 2, 2008, from http://www.ed.gov/admins/finaid/accred/accreditation_pg14.html}",
    "textBeforeTable": "Credit Hours Required for the Bachelor's Degree (Hours Vary) The information in the tables below reflects the fact that students must complete 40 semester hours of residency at Franklin, but the transfer student may transfer in as many as 84 semester hours of coursework. Bilateral agreements for colleges participating in the Community College Alliance, GoArmyU agreements, and transfer and articulation agreements for local technical and vocational training programs identify the credits which transfer and their application to the Bachelor's degree programs. If an individual student seeks transfer credit outside the bilateral agreements, the Credit Review Form is used to evaluate prior learning. Transfer credit from regionally accredited institutions and organizations may apply to any area of the degree requirements as determined by a comparison of course outcomes. Relevant credit from nationally accredited and vocational institutions and organizations is applied to the Franklin degree as technical credit and may apply for specific credit. In order to award technical and specific credit, the institution's curriculum must meet our standards and the course or courses must meet Franklin requirements for depth and rigor.   Franklin University has developed completion majors that build on prior technical education at the associate's or vocational/technical level and complement this background with management education. The first table below shows the number of credits required in each of the five components of the undergraduate degree. The second table shows how credit is transferred into the five components. Illustrated are",
    "textAfterTable": "\"This policy does not override institutional admission standards and/or requirements of entrance into a specific academic program.\" Franklin does not have any institutional or program-specific admissions requirements to which this policy override would apply.  \"Consistent with the spirit of the policy and clarification 2, there is no universal minimum grade or quality points for the acceptance of credit and thresholds for this are set by institutional grading policy at the D or D- level.\" Franklin applies this point of clarification to transfer of D grades.  (Ohio Board of Regents, Appendix D)   Franklin University Articulation and Transfer Policy and Procedures Manual Appendix 3: Criteria for Comparability Consideration Franklin University accepts transfer credit from 1) institutions that are regionally accredited as defined by OBR and 2) institutions that are accredited by national or professional agencies accredited by CHEA. In addition, Franklin accepts technical/vocational credit from institutions that are accredited by agencies recognized by the US Department of Education. This technical credit may fulfill degree requirements of Franklin's completion degrees. Recognition by USDE is based on a number of criteria for evaluation, as described below. Franklin considers that due diligence has been done and that the criteria for evaluation have been met by institutions accredited by an agency recognized by USDE. USDE criteria exceed those required by the American Council on Education (ACE) and the National Program on Non-collegiate Sponsored Instruction (PONSI). Criteria for Evaluation According to the US Department of Education, the Secretary recognizes accrediting agencies",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}