{
    "relation": [
        [
            "Village Area (acres)",
            "Jalpigarapalli",
            "Tanda",
            "Natlacheruve",
            "Somanathpur",
            "Sugnarampalli",
            "Pichalvarapalli",
            "Yellampalli"
        ],
        [
            "Total Households",
            "",
            "1422",
            "1006",
            "2678",
            "3461",
            "1 272",
            "3091"
        ],
        [
            "Total",
            "",
            "141",
            "98",
            "235",
            "228",
            "80",
            "384"
        ],
        [
            "Population Area for Cultivation (acres)",
            "",
            "744",
            "526",
            "1312",
            "118",
            "436",
            "2082"
        ],
        [
            "Rainfed to the Nearest Town (km)",
            "",
            "478",
            "273",
            "808",
            "852",
            "341",
            "1396"
        ],
        [
            "Distance",
            "",
            "36",
            "22",
            "27",
            "27",
            "27",
            "8"
        ]
    ],
    "pageTitle": "Ecology and the Politics of Survival: Conflicts over Natural Resources in India (UNU, 1991, 353 pages): Bibliography",
    "title": "",
    "url": "http://www.nzdl.org/gsdlmod?e=d-00000-00---off-0ccgi--00-0----0-10-0---0---0direct-10---4-------0-1l--11-en-50---20-about---00-0-1-00-0-0-11-1-0utfZz-8-00-0-0-11-10-0utfZz-8-10&cl=CL1.1&d=HASH6ccc0a0a15a70add372609.6&hl=0&gc=0&gt=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00173-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 611087219,
    "recordOffset": 610927408,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{494549=Stebbing, E.P. The Forests of India. Delhi, A.J. Reprints Agency. 1982., 484599=Faster L, Lecture delivered at the Faculty of Forestry Science, University of Freiburg, 28 April 1986., 411264=Between 1953 and 1983 the actual marine harvest of these four countries has increased threefold from 0.71 million to 2.11 million tonnes thereby increasing the share of harvest of sustainable resource potential from 18 per cent in 1953-54 to 47 per cent in 197-77 and further to 54 per cent in 1982-83., 137601=In March 1978 a new auction was planned in Narendranagar. A large popular demonstration was organised against it and the police arrested twenty-three Chipko volunteers, including women. In December 1978 a massive felling programme was planned by the public sector Uttar Pradesh Forest Development Corporation in the Badiyargarh region. 'the local people instantly informed Bahuguna who started a fast unto death at the felling site, on 9 January 1979. On the eleventh day of his fast Bahuguna was arrested in the middle of the night. This act only served to further strengthen the commitment of the people. Folk poet Ghanashyam Raturi and priest Khima Shastri led the movement as thousands of men and women from the neighbouring villages joined them in the Badiyargarh forests. The people remained in the forests and guarded the trees for eleven days, when the contractors finally withdrew. Bahuguna was released from jail on 31 January 1979., 481198=Al-Mousawi, A.N. and F.A.G. Al-Maib. Allelopathic Effect of Eucalyptus Microtheca. Journal of the University of Kuwait Science, Vol. 2. 1975., 491872=Reisner, M. Cadillace Desert: The American West and its Disappearing Water. New York, Penguin, 1986., 122447=The policy of the Forest Department can be summed up in two words, namely, encroachment and exploitation. The Government has gone on pushing forward, extending its own sphere and scope and simultaneously narrowing down the orbit of the rights of the people.... The memory of the 'San assi' boundaries (1880 predemarcation) is green and fresh in the mind of every villager and he cherishes it with a feeling bordering on reverence; he is simply unable to see his way to accepting the claim of the Government to the benap lands comprised within his village boundaries and regards every advance in that line as nothing short of encroachment and intrusion. Let the san assi boundaries be vested with their real character instead of being looked upon as merely nominal, and, to remove misgivings, let the areas enclosed within these boundaries be declared as the property of the villagers and all the benap lands included within these areas be restored to the village community, subject to such conditions to impartibility, etc., as may be desirable in the public interest. It is a matter of common knowledge that a large number of memorials were sent by the villagers at their own instance, about the year 1906, asking the Government to restore the areas within the san assi boundaries to them: the unsophisticated villager spontaneously reiterates the same demand today. This is the minimum demand of the people and there seems to be no other rational and final solution. The simple fact should not be forgotten that man is more precious in this earth than everything else, the forests not excepted, and, also, that coercion is no substitute for reason, and, however stringent and rigid the laws may be, the forests cannot be preserved in the midst of seething discontent against the unanimous wishes and sentiments of the people.... The collective intelligence of a people cannot be treated with contempt, and even if it be erratic, it can come round only by being allowed an opportunity of realising its mistake. If the village areas are restored to the villagers, the causes of conflict and antagonism between the forest policy and the villagers will take the place of the present distrust, and the villager will begin to protect the forests even if such protection involves some sacrifice or physical discomfort., 482168=Bandyopadbyay, J. and Vandana Shiva. The Political Economy of Technological Polarisation. Economic and Political Weekly, Vol. XVII, No. 45, 6 November 1982., 270227=The Sambhar Lake in Rajasthan was a major inland source of salt for the whole of Central India. The manufacture and trade of this essential commodity and the possibility of a high margin of profits in case of monopoly in production, led to the East India Company securing the entire lake. In 1870 the British government forced a treaty on the States of Jodhpur and Jaipur through which it acquired the right of not only manufacturing and selling salt but also levying a duty on it. The peculiarity of the Sambhar Lake is that there is no rock salt bed in the geological formation of the area. The salt granules in the great salt marsh of Kutch are carried north-east by the trade winds in the summer and deposited in the catchment of the Sambhar Lake. In the monsoons the salt granules are dissolved and the solution is carried into the lake by a large number of streams. the largest of which is Rupnagar. Through the quick evaporation of water from the lake. millions of tons of salt get deposited in the Sambhar Lake. According to the British estimates of that period. 46 million people in India depended on supplied from this lake. This made the control of this 9( sq miles lake economically valuable for the growth of the salt industry, 491368=Raturl, K. Working Plan for Tehri Garhwal. 1932., 108997=That this system of management of resource: ensured the sustainable utilization of forests is reflected by the fact that while this tenure system continued. village forests around taluks like Dwara and Malkot were in a very good condition as reported in accounts of the last century. The sustainable utilization of forests near the villages ensured their health and limited the exploitation of forests in the rest of the valley, which remained virgin till the British entry in 1914., 482569=Bano, K. and R.V. Krlshnamurthy. Consummatory Responses of the Milliped Jonespettis Splendidus in Relation to Soil Organic Matter. Proceedings of the Indian Academy of Science (Animal Science), Vol. 90, 1981., 488917=Mira Behn. Something Wrong in the Himalaya. 1952 (mimeo)., 111651=The new inequalities imposed on the region by the British administration through the introduction of the zamindari system became a source of degradation of village forests, which under community control had been maintained on a sustainable basis. In this process village forests were declared to be the property of zamindars of the villages to which they appertained. These zamindars, as new centres of economic and political power, completely destroyed the community organization its control over village forests. Thus, 'in Malkot iliqua (region) containing 31 villages the cultivating proprietors had lost their power.... a disability due to the aggression of the superior sayana, Surjan Negi, a man of capital and influence'. Surjan Negi's capital and influence was, in turn, derived from the fact that in 1822 forests in the valley were farmed to him. This economic power of a contractor coupled with the power of a zamindar completely destroyed the role and responsibility of the sayanas in the management of common resources for common use. As the control of the community was substituted by the control of the zamindars, the zamindars were only 'too anxious to make money as fast as possible out of their new acquisitions. In pursuance of this policy they prohibited the tenants from grazing and cutting wood in the village forests and sold the latter-to charcoal burners who completely denuded the hillsides'., 487837=Krishnamurthy, B.V.K. Ecosystem of Southern Mysore. New Delhi, Environment Services Group, 1984., 335755=Under this programme a sum of Rs. 2.80 crores was spent between April 1981 and March 1985, i.e., ever since the forcible evictions took place. This works out to an average of Rs. 70 lakhs per annum for four years. For the eighty-two displaced villages this works out to a pittance. In addition a sum of Rs. 3 crores was allotted for shifting sixty-two of the several temples and other religious monuments likely to be submerged., 494061=Singh, Chattarpati. Common Property and Common Poverty: India's Forest Dwellers and the Law. Delhi, Oxford University Press, 1986., 493345=Shiva, V. How Green was My Valley. The Illustrated Weekly of India (Bombay), 12 October 1986., 454505=The third mechanism by which the MDBs affect the utilization of natural resources is through the links between foreign aid and export financing. In 1978, Johnston J., Deputy Assistant Secretary of State, Bureau of Economic and Business Affairs, testified to the US Congress that 'every dollar we pay into the MDB's generates about $3 business for U.S. firms'.' Bushnell, Deputy Director for Developing Nations of the US Department of Treasury, told the Subcommittee on Foreign Operations of the House Appropriations Committee on 16 March 1976:, 125782=The chipko movement is historically, philosophically and organi sationally an extension of the traditional Gandhian satyagraha. Its special significance lies in the fact that it took place in post independent India. The continuity between the pre-independence and post-independence forms of this satyagraha has beer provided by Gandhians, including Sri Dev Suman, Mira Behn and Sarala Behn. Sri Dev Suman was initiated into Gandhian satyagraha at the time of the Salt Satyagraha. He died as a martyr for the cause of the Garhwali people's right to survive with dignity and freedom. Both Mira Behn and Sarala Behn were close associates of Gandhiji. They settled in the interior of the Himalayas and established ashrams. Sarala Behn settled in Kumaon, and Mira Behn lived in Garhwal till the time she left for Vienna due to ill health. Equipped with the Gandhian world view of development based on justice and ecological stability, they contributed silently to the growth of women power and ecological conscciousness in the hill areas o Uttar Pradesh. The influence of these two European disciples of Gandhiji on the heritage of struggle for social justice and ecological stability in the hills of Uttar Pradesh has been immense and they generated a new brand of Gandhian activists who provided the foundation for the Chipko movement. Sundarlal Bahuguna is prominent among the new generation of workers deeply inspired by these Gandhians. Influenced by Sri Dev Suman, he joined the independence movement at the age of 13. Later, he worked with Mira Behn in Bhilangana Valley and was trained in her ecological vision. In an article written in 1952, Mira Behn had stated that there was 'Something Wrong in the Himalaya., 485112=Gadgil M., S. Narendra Prasad and Raul AII. Fores, Management in India: A Critical Review. Bombay, CMID, 1982., 492808=Schnalberg, Alan. The Environment: From Surplus to Scarcity. Oxford University Press, 1980., 486467=Himalaya, Man and Nature, Special Issue on Forestry, 1981., 94662=By 1823 the growing discontent of the forest proprietors and timber merchants, chafing under the restrictions of the timber monopoly, and the outcry of the peasants. indignant at the fuel cutting restrictions, came to a head. On the recommendation of the Governor of Madras, Sir Thomas Munro, and with the consent of the Supreme Government, the conservator ship, on which Captain Watson had been followed by several successors during the seventeen years of its existence, was abolished., 104035=The requirement of the military for Indian teak led to an immediate proclamation declaring that the royalty right in teak trees claimed by the former government in the south of the continent was vested in the East India Company. Under increased pressure from the Home government to ensure the maintenance of the future strength of the King's navy, the decision was taken to appoint a special officer to superintend the forest work; someone who was conversant with the language and habits of the people in addition to having a knowledge of forests. His duties were to preserve and improve the production of teak and other timber suitable for shipbuilding. A police officer, Captain Watson was appointed the first Conservator of Forests in India on 10 November 1806 Under the proclamation of April 1807, he wielded great powers, which unfortunately were somewhat vague in both scope and in the extent of interference he was permitted in the established order., 409081=The progress of unilateral extension of territorial/economic rights by developing nations did not spread rapidly after this initial spurt. Following the debate in the UN General Assembly in 1967, prompted by Dr. Arvid Pardo, and the framing of the UN Law of the Sea Conference saw a renewed interest in the matter. Even before the adoption of the Convention, due to the clear consensus seen in the early sessions, many nations extended their jurisdiction over fisheries beyond the hitherto accepted 12 nautical miles. By the end of 1980 this number increased to ninety-eight, seventy four had taken action after 1975. Of the latter, fifty-seven were developing countries., 483458=Chalurvedi, M.C.Land Management in U.P Government of India, 1946., 489436=Nicholson, A.P. Scraps of Paper: India's Broken Treaties. London, Erust Benn. 1930., 487028=Kabadi Waman, P. (Ed.). India's Case for Swaraj by Gandhi. Bombay. Yeshanand and Co., 1932., 184514=Source: Himalaya Man and Nature, Special Issues on Forestry, 1981., 485478=Ghandhi, A, and A. Kurnar. Economic and Political Weekly, Vol. XXI, No. 22, 31 May 1986., 152982=These conceptual issues assume tremendous importance in view of the fact that we are entering into an era in which large amounts of financial resources are being handed over to Non-Government Organisations (NGOs) who are rapidly becoming the new managers of old development projects. The self-reliance, decentralisation and sacrifice intrinsic to voluntary action is being threatened by treating NGOs as the new delivery system. It is in this context that the debate on these two philosophies of nature and political action becomes central to the debate on development. The urgency of establishing a new economy of permanence, based on ecological principles, is felt with each new environmental disaster in the Himalayan region which spells destruction for the Gangetic basin. Chipko's search for a strategy for survival has global implications. Chipko's demand is conservation of not merely local forest resources but the entire life-support system, and with it the option for human survival. Gandhi's mobilisation for a new society in which neither man nor nature is exploited and destroyed, marked the beginning of this civilisational response to the threat to human survival. Chipko's agenda includes carrying that vision against the heavier odds of contemporary crises. Its contemporary relevance as well as its significance for the future world, is clearly indicated in the rapid spread of the ecological world view throughout the vast stretch of the Himalayan region, following the historical 5,000 km trans-Himalaya Chipko foot march led by Bahuguna, and subsequently through other vulnerable mountain systems such as the Western Ghats, Central India and the Aravallis., 315556=It may be mentioned here, that the moneylender-landlords collected their dues (of old debts at exorbitant interests) as soon as the compensation money was sanctioned for the dwellings of the poor even before they could lay their hands on it. Second, as most of the poor people (predominantly belonging to Harijan caste) were cultivating government lands or government assigned lands they were not paid any compensation for the loss of these lands., 131658=While the fight against alcohol consumption provided the platform for the organisation of women, the increasing conflict over forest produce between the local and non-local industries provided the rallying point for popular protest during the sixties. In 1968 the people of Garhwal renewed their resolve to fight for their forests in a memorial meeting held at Tilari on 30 May., 495637=Willcocks, William. Ancient Irrigation System of Bengal. Calcutta, University of Calcutta, 1930., 339633=It is seen that from 1950 to 1960 the development of groundwater was about 2.5 p. c. on linear basis, based on the area irrigated from groundwater resources during the year 1950-51. The growth rates from 1960 61 to 1964 65 was 3.7 p. c. It suddenly rose up to 19 p. c. from 1964-65 to 1968 69. This sudden and high increase in growth rate has been due to the advent of high yielding crop varieties, mobilization of institutional resources for financing the programmes and stepping up of rural electrification., 495564=Water Shortage Hits Ranipokhri. Himachal Times. 23 May 1984., 490337=Project for Social Forestry with World Bank Assistance. Bangalore, Karnalaka Government Secretariat, 1980., 344202=Olsen shows that in fact there is hardly any meteorological change in terms total annual rainfall in Rayalseema over the forty year period from 1946 to 1985 (Table 9.2)., 494466=Speth, G.A. Luddite Recants. Amicus Journal (Washington), Spring 1989., 492912=Sen, Amartya K. Economics, Ecology and Public Action. personal communication, 1986., 134307=Bureaucratisation, however, cannot replace a civilisational response to the forest crisis. The ecological limits of forest extraction was hardly recognised and estimated. Ecological problems were accentuated leading to increased suffering of women who were responsible for bringing water, collecting fodder, etc. During the next five years Chipko resistance for forest protection spread to various parts of the Garhwal Himalayas. It is important to note that it was no longer the old demand for a supply of forest products for local small industries but the new demand for ecological control on forest resource extraction to ensure a supply of water and fodder that was being aired. In May 1977 Chipko activists in Henwal Valley organised themselves for future action. In June of the same year, Sarala Behn organised a meeting of all the activists in the hill areas of Uttar Pradesh which further strengthened the movement and consolidated the resistance to commercial fellings as well as excessive tapping of resin from the Chir pine trees. In Gotars forests in the Tehri range the forest ranger was transferred because of his inability to curb illegal over-tapping of resin. Consciousness was so high that in the Jogidanda area of the Saklana range, the public sector corporation, Garhwal Mandal Vikas Nigam, was asked to regulate its resin-tapping activity., 493989=Sierra Club. Bankrolling Disasters. Washington, D.C., 1986., 492315=Report on the Impact of Social Forestry Programme on Land Use in Kolar and Bangalore Districts. Government of Karnataka, Bureau of Economics and Statistics, 1984., 484513=Engels, F. Anti-Duhring. Moscow, Foreign Language Publishing House, 1947., 484992=Fitter, R. Foreword. In W. Dieren and M.G. Mummelinch, The Price of Nature. Amsterdam: Marion Boyers, 1977., 388365=Direct and major human interference in the limestone deposits began in 1900, when the railway line was brought to Dehradun and the forest department started selling quarrying rights to the limestone deposits at a royalty of Rs. 5 per 100 cubic feet (ca 2,832 dm3). An attempt by the government to assume full control of all limestone deposits was challenged in the court by the local landlords. They argued that the boulders on the surface of the earth and river beds were not mines, and their objections were upheld. As a result, surface boulders were declared as not to be quarried, until the settlement of 1904 which declared all quarries as government property., 491297=Rai Usha The Times of India (New Delhi), 28 December 1986., 213209=As Baxi notes, 'development of wastelands or policies addressed to it do no more than reverse social and public policy and action which hail the result of wasting lands in earlier times.' However, this is not what the government wasteland development policy has turned out to be. This policy was given a boost in 1985 when the National Wasteland Development Board was set up. Wasteland development generated conflicts because it concentrated on the afforestation of the revenue category of wastelands (i.e., commons) and threatened the customary rights of villagers to use forest produce., 427888=Following three decades of planned fisheries development in the region, by 1976-83, the rate of growth of marine fish harvest had dropped to 2 per cent per annum. It was also during this period that the conflicts at sea were most rampant. Interestingly during this period of overall stagnation, the exports of prawns-all destined for the Japanese and American markets in frozen form-increased dramatically. The experience of Kerala is valuable in illustrating the trend of fisheries development and destruction in the region., 481588=Bahaguna, S. Bagi Tehri. In Utter ke Shikharo Mein Chetna ke Ankur. New Delhi. Himalaya Seva Sangh, 1975., 483536=Chaturvedl, M.C. Water-The Second India Series. New Delhi, Ford Foundation, 1974., 428426=This export-oriented approach to fisheries development was first seen in the early sixties. Attention was focused on prawns. From an export turnover of a little under 500 tonnes of frozen prawns by the end of the fifties, by 1961 the figure had reached 1,462 tonnes with an export value of over Rs. 4,000 per tonne compared to the internal fresh fish shore price of Rs. 150 per tonne. In 1962, the Japanese were scouting for prawn supplies as they had lost access lights to Mexican waters., 489829=Pant, G.B. The Forest Problem in Kumaon. Gyanodaya Prakashan, 1922., 488408=Mahashweta Devi Remarks at the Workshop on Eucalyptus. Planning Commission, New Delhi, 21 May 1984., 489365=Myers, N. The Primary Sourer. New York. W.W. Norton, 1984., 95161=The Forest Act of 1927 aroused a new response against the denial of traditional rights of local people. During 1933-31 forest satyagrahas were organised throughout India as a protest against the reservation of forests for exclusive exploitation by British commercial interests and the transformation of a common resource into a commodity. Villagers ceremonially collected forest produce from the reserved forests to assert their right to satisfy their basic needs of forest products. The forest satyagrahas were particularly successful in regions where survival of the local population was intimately linked with the access to forests as in the Himalayas, the Western Ghats and Central India. These non-violent protests were suppressed by the armed intervention of the British rulers. In Central India, Gond tribals were shot down for participating in the satyagraha. On 30 May 1930 several unarmed villagers were killed and hundreds injured in Tilari village of Tehri Garhwal when they gathered to protest against the reservation of forests. Following the loss of many lives, the satyagrahas were finally successful in reviving some of the traditional rights of the village communities to forest produce as recognized privileges., 435461=The effect of this overpowering demand-pull for prawns had its repercussions in Kerala's fish economy as a whole. A sector which was relatively outside the mainstream of the economic and social processes in Kerala society was suddenly transformed into a respectable avenue for investment and involvement. The possibilities of a modernised fishery sector emerged quickly, breaking down traditional barriers to entry into the sector. The export-oriented thrust that began to get ingrained in the sector was blessed by the country's own attempt to boost foreign exchange earnings. The devaluation of the rupee in mid-1966 gave a further boost to the exports of prawns from Kerala. The implications of the changing emphasis of fisheries development policy on the fish economy and in particular the fishermen is known to us in detail from primary survey data., 391257=In 1911, four quarries were being worked in the Doon Valley, and by 1982 there were nearly 100 quarry leaseholders holding about 1,250 hectares of leased area. Out of these, nearly 50 per cent are in operation. The limestone of the Doon Valley, being of high purity, has a ready market in the steel, chemicals, sugar, textile, and other industries. The amount of extraction of limestone and marble in the vicinity of Dehradun for the period 1977-82 is given in Table 10.1., 115665=The reserved forests managed by the forest department continued to be guided by the objective of revenue maximization through commercial exploitation of forests. The only difference between the earlier free felling system and the present system of scientific management through the working plans was that the same objective was achieved in a more systematic and regular manner. This conservancy was thus made an equivalent to maintaining revenues. Neither ecological considerations nor considerations of the basic needs of villagers were an intrinsic part of this scientific management. Forest reservation denied the local people access to the free use of forests. Village forests which were not reserved were declared to be the property of zamindars to which they pertained. While villagers thus lost their traditional resource bases, their requirements were not systematically included in the management of reserved forests. According to the 1911 Gazetteer:, 300666='the Srisailam project began in 1960, initially as a power project, across the Krishna, near Srisailam in Andhra Pradesh. After several delays, the main dam was finally completed twenty years later in 1981. In the meantime the project was converted into a multipurpose one with a generating capacity of 770 MWs by its second stage which was expected to be completed in 1987. The dam is to provide water for an estimated 4,95,000 acres with its catchment area of 79,553 sq miles and water spread of 238 sq miles. Under the right branch canal 1,95,000 acres in Kurnool and Cuddapah districts will have assured irrigation. From the initial modest estimate of Rs. 38.47 crores for a power project the total cost of the multipurpose project was estimated to cross Rs. 1,000 crores in its enlarged form. The 470 feet high and 1,680 feet wide dam has alone cost Rs. 404 crores together with the installation of four generating sets of 110 MWs each. The right branch canal is estimated to cost Rs. 449 crores and the initial investment of Rs. 140 crores has been provided by the World Bank. The projected cost-benefit ratio of the project has been worked out at 1:1.91 at 10 per cent interest on capital outlay., 437000=During the decade, fish production averaged 304,700 tonnes. As of 1969-70 the modern sector in fish production activity accounted for landings of 40,000 tonnes of fish/prawns (12 per cent), valued at Rs. 41.5 million. It gave direct employment to about 7,800 fishermen. The output per worker in the sector (accounting for 8 per cent of the active fishermen in the state) was 5,150 kg and his per capita income (current prices) was Rs. 1,600. At the same time the 90,600 fishermen operating non-mechanised crafts accounted for 88 per cent of the total fish landing in 1969-70 (303,000 tonnes) valued at Rs. 165.5 million. The output per fisherman in this sector was 3,340 kg or 35 per cent below his counterpart on the mechanised boats and his per capita income (current prices) was Rs. 1,095 (see Table 11.2)., 493451=Shiva, V. and J. Bandyopadhyay. Participatory Research and Technology Assessment by the People. In W. Fernandes and R. Tandon, Participatory Research and Evaluation, Experiments in Research as a Process of Liberation. Delhi, ISI, 1981., 111321=The forest department instituted in 1855 concentrated its energies on the collection of revenue without making any attempt at systematic conservancy. It was in fact nothing but a forest revenue collecting agency. The effect of this neglect became apparent in 1867 when the revenue reached the low figure of Rs 23.333., 492490=Rich, B. The Multilateral Development Banks, Envitonmental Policy, and the U.S. Ecology. Law Quarterly, Vol. 12, No. 4, 1985., 285657=The Congress, which had also joined the agitation, set up its own inquiry committee. The report of the committee established that the Damodar Canal had not to any appreciable extent increased the productivity of the area served by it. The yield per acre prior to the construction of the canal was about 24 maunds and it remained at the same level after the canal had started functioning. The report also highlighted the fact that the 'Damodar Carnal project was never meant for irrigation purposes alone. It was intended \"inter alia\" that the canal should protect the railways, the G T Road, the Burdwan town, the port of Calcutta, etc. by modulating the strength of the Damodar flood. It recommended reduction of the tax on cultivators to reflect better the benefits against drought provided by the canal. As a result, the government reduced the levy to Rs. 2-9-0) per acre. But even this amount was too high. In 1939, the government started attaching movable properties of the defaulters in the canal area. The local cultivators were determined to launch a satyagraha movement till the tax was further reduced to Rs. 1-8 O. per acre. The government on the other hand, sent a large contingent of Gorkha soldiers to bring the situation under control. Section 144 was promulgated, prohibiting public meetings. The 'policy of terrorisation' forced the peasantry to give up their agitation for a reduction in the canal tax. The people subsequently accepted the government rate of Rs. 2-9) per acre and paid the arrears., 483365=Chandler, W.D. Worldwatch Paper 72. Washington D.C., Worldwatch Institute. 1986., 400660=At times the torrent is so :powerful and the load of silt is so heavy that it is physically impossible to remove the silt quickly. In mid August 1983, Dehradun city went without water for several days because the Rajpur Canal was entirely silted up. It is expected that within a period of ten years the entire canal works will be threatened by rising torrents and the concomitant destruction of flood protection works. Unfortunately, the cost associated with the destruction of this vital water conservation and distribution system has so far not been recognised as a negative externality of quarrying, because the processes by which quarrying threatens water resources have not been recognised. Through water, the impact of quarrying is carried to the human settlements, which depend on these water resources for survival., 427431=It is interesting to note that in the South Asian region, until the end of the fifties, marine fish harvest increased at a rate of 5 per cent per annum in spite of the lack of new harvesting technologies. During this period, between 5,000-6,000 tons of prawns from India were exported to Burma, Thailand and Malaya every year in dry form and accounted for 25 to 30 per cent of the annual export value of around US $11 million (1958-59 average)., 494404=Solow, R. The American Economic Review, May 1974., 487132=Kalkini, K. Proceedings of the Eleventh Silvicultural Conference. Dehradun, Forest Research Institute, 1967., 488251=Lovins, E. World Energy Strategies. London, 1975., 238564=In the face of a serious controversy over the conversion of food growing land to industrial wood fibre plantation in the state, the Government of Karnataka has launched a number of schemes of 'Wasteland Development' under its social forestry project which are in effect the conversion of 120,000 acres of village common lands to Eucalyptus plantations to feed a local rayon factory. 'Wastelands' are category 'C' and 'D' lands which were not a source of revenue for the state but were a source of fuel and fodder for the villages. The conversion of these village commons to feed stocks for the wood fibre industry is in direct conflict with the basic biomass needs of the local villages. The diversion of these village commons to industrial plantations through the project for 'Wasteland Development' has led to a major popular resistance movement for the protection of the commons called 'Mannu Rakshna Koota' or 'Movement for saving the soil'. Lands of 'C' and 'D' class which are categorized as wastelands are meant for fulfilling the basic needs of villagers in agriculture, animal husbandry etc. In Shimop and Chiklcamagalur areas, 'C' and 'D' class of lands are being transferred to the forest department with a view to planting Eucalyptus for a joint venture-the Kamatalta Pulpwood Ltd.- floated in November 1984 by the Kamatalra Forest Plantations Development Corporation and Harihar Polyfibres Ltd., 483217=Buchanan, F. A Journey from Madras Through the Countries of Mysore, Canara and Malabar. Vol. 11. Madras, Higginbothams & Co., 1870., 360935=The document (Annexure with the draft water policy) gives the figure of 41.9 million hectare metres as the utilisable groundwater resources and shows a net positive balance groundwater potential of 31.4 million hectare metres after deducting 10.5 million hectare metres as net draft. This would have been a very comfortable situation if these figures did not totally contradict scientific evaluations of the groundwater situation. Dakshinamurti e' al. points out in clear terms that the working group of the Planning Commission on the Task Force on Ground Water Resources estimated that the total usable ground water potential would be only 75 to 80 per cent of the net ground water recharge available and recommended a figure of 20.36 million hectare metres per year as the long term potential for ground water development in India.... The total utilization of ground water, inclusive of irrigation, industry. domestic, and livestock has been estimated at 11.61 million hectare metres in 1988 89 as against 20.36 million hectare metres of the estimated total usable ground water available in the country. It is thus visualised that the entire potential is likely to be tapped even before the end of the Seventh Five-Year Plan (19~89) unless the recharge rate is increased by suitable ground water recharging techniques., 117181=When Mr. Ross's report became the basis of notification No. 702 of 1880, specifying the list of villages entitled to special grazing facilities, the forest department was successful in the battle of words, so that 'rights' were not admitted, but villages included in Mr. Ross's list were permitted to exercise certain privileges. A systematic management for satisfying the basic needs of the local population thus never became an intrinsic part of the management of reserved forests. The direction in which the systematic approach did evolve was largely in the area of quantifying growing stock to guide felling to ensure steady revenue returns., 487724=Krishaunurthy, B.V.K. Ecodevelopment in Southern Mysore. New Delhi, Department of Environment, 1983., 489909=Parandare, B.M. The Times of India (New Delhi), 17 September 1986., 489284=Mukerjee, J.N. Forward with Nature. Bombay, Popular Prakashan, 1979., 486602=Jain, S. The Hindustan Times (New Delhi), 1I December 1986:, 488829=Manur, G.R. Forest Grievances in North Kanara. Pamphlet No. 1, Kumta, 1927., 491985=Report of Krishna Water Disputes Tribunal. New Delhi, Government of India. 1973., 130203=Inheriting these early lessons in ecology, Bahuguna was later able to transfer this ecological perspective to Chipko. The rapid spread of resistance in the hills of Uttar Pradesh and its success in enforcing changes in forest management was also largely due to the awareness created by folk poets like Ghanshyam Raturi, and grassroots organisational efforts of a number of people including Man Singh Rawat, Chandi Prasad Bhatt and Dhoom Singh Negi. Bhatt, who later became well known for his work, became an activist at the behest of Bahuguna in 1959 when they met at a bus station in Gopeshwar where Bhatt was working as a booking clerk and Bahuguna, along with Rawat and Raturi, was waiting for a bus during an organisational trip through Gopeshwar. Having found Bhatt a promising activist, Bahuguna invited him to join them., 495846=Wittfogel, K. Oriental Despotism: A Comparative Study of Total Power. New Haven, Yale University Press. 1957., 139089=The moratorium on green felling gave the Chipko movement breathing time to expand the base of the movement and Bahuguna undertook a 4,780 km long arduous Chipko foot march from Kashmir to Kohima to contact villagers in the long Himalayan range and to spread the message of Chipko. At the same time, activists found it opportune to spread the movement to other mountain regions of the country., 486066=Hattapa G.S. History of Freedom Movement in Karnataka. Vol. II. Bangalore, Government of Mysore, 1969., 490984=Rahnema. Separating the Wheat from the Chaff. Paper presented at the SID Conference, Rome, 1985., 321981=A second survey by the Lokayan team in November 1984, three years after the evictions, found the people to be worse off., 273438=In 1906 the villages of Kishengarh faced a severe drought. In sheer desperation to ensure a minimum supply of water for the biological survival of human and animal life, the people built an earthen dam which the British promptly destroyed. In the same year the rulers of Kishengarh pleaded for permission to construct low masonry weirs across Rupnagar and to sink some wells. The Salt Commissioner made sure that these projects could not be undertaken., 124773=The contradictions between people's basic needs and the state's revenue requirements, however, remained unresolved, and in due course these contradictions intensified. In 1930 the people of Garhwal launched the non cooperation movement to draw attention to the issue of forest resources. Forest satyagrahas to resist the new oppressive forest laws were most intense in the Rawain region The King of Tehri was in Europe at that time. In his absence, Dewan Chakradhar Jayal resorted to armed intervention to crush a peaceful satyagraha at Tilari. A large number of unarmed satyagrahis were killed and wounded, while others lost their lives in a desperate attempt to cross the rapids of the Yamuna river. Years later, the martyrs of the Tilari massacre provided inspiration for the Chipko movement when people pledged themselves to protect their forests., 33235=No amount of threat to survival in India from environmental hazards can be complete without a reference to the Bhopal tragedy on 2 December 1984, in which several thousand people died and several lakhs faced serious health hazards following the leakage of poisonous Methyl Iso Cyanate from a pesticide plant of Union Carbide (India) Limited. People's movements for clean air and water are growing in ail parts of the country just as ecologically irresponsible industrialization is moving deeper into the hinterland in search of new resources., 493880=Shyamsundar, S. Some Aspects of Eucalyptus Hybrid. Bangalore, Karoataka Forest Department. 1983., 101652=In 1805 a despatch was received from the court of Directors enquiring to what extent the King's navy might, in view of the growing shortage of oak in England, depend on a permanent supply of teak timber from Malabar. This despatch led to the immediate formation of a forest committee charged with a comprehensive programme of enquiry both into the capacity of the forests themselves,` and the status of proprietary rights on them. Thus the first real interest expressed in the forests of India and the subsequent study of those accessible at the time originated from England, and the reason was the same which had kept forestry in the forefront in England for a period of three centuries-the safety of the empire, which depended upon its 'wooden walls'. The planting of oak owing to the supineness of successive governments had fallen into abeyance for nearly a century, and the country was faced with a shortage in timber supplies which, in view of the bid of the French for sea supremacy, might well spell the doom of England. When the British started exploiting Indian timber for military purposes, they did it rapaciously, because the great continent appeared to hold inexhaustible tracts covered with dense jungles, but there was no apparent necessity for their detailed exploration even had this been a possibility. In the early years of our occupation the botany of the forests, the species of trees they contained and their respective values was an unopened book., 110781=Initially, the forests were leased against fixed revenues to individuals who farmed the dues from the actual extractors. For the period 1819-21 the average revenue for Dehradun was Rs. 4,000. In 1839 the forests were leased for Rs. 6,500 a year. However, when Mr. Vansitartt, the Superintendent of Dehradun, discovered that the actual amount collected was Rs. 80,000 a year, he discontinued the lease and took charge of the collection. Subsequently, the Forest Department was established in 1855. As the 1911 Gazetteer reports:, 491429=Ray, Rothindra Nath. Alternate Energy and Technology for Small Fishermen. Monograph Series on Engineering of Photosynthetic Systems, Vol. 12. Madras, AMM Murugappa Cheltiar Research Centre, 1981., 268228=On 5 April 1930 Mahatma Gandhi launched the national noncooperation movement with the campaign for the production and distribution of salt at Dandi beach in Gujarat, violating the Salt Law of the British that had guaranteed their monopoly in the production and distribution of salt. Salt is a vital resource for the survival of both human and animal life specially in tropical countries like India. It remained a common resource till the British monopolised its production and distribution to transform it into a source of revenue. The growth imperative compelled the expansion of the salt industry, as monopolised by the British, at the cost of diversion of resources from essential economic activities like food production. Further, in order to increase revenue the British government raised the salt tax in 1923 through the Indian Finance Bill of the Viceroy. This triggered off strong protests all over the country since a basic resource like salt was being denied to the people in order to increase revenue. The anguish of Gandhi on this appropriation of a common resource was clear when he said,, 403091=The national movement of these fishing communities, the National Fisherman's Forum, assumed the status of a major ecological movement related to water resources when the month long campaign along the belt of India converged at Kanyakumari on May Day in 1989, to stress the intimate links of water movements on land and in sea through the slogan 'protect waters, protect life'. Approximately 15,000 people, nearly three-quarters of them women, gathered 'for a celebration of life and at the same time a desperate outcry against the threat to survival of ordinary people and of nature'. The protest was, however, disrupted and the police fired indiscriminately- injuring six people and beating up many more-an indication of the conflict between the survival of fish and fishermen on the one hand, and the forces that control fisheries on the other., 495746=Willams, G.R.C. Memoirs of Dehra Dun. Roorkee. Thomson Civil Engineering College, 1874., 488313=Luxemberg, R. The Accumulation of Capital. London, Routledge and Kegan Paul, 1951., 494952=Tewari, K.M. and R.S. Mathur. Water Consumption and Nutrient Uptake by Eucalyptus. Indian Forester, Vol. 109, No. 12, 1983., 483955=Del Moral, R. and C.N. Muller. Fog Deep: A Mechanism of Toxin Transport from Eucalyptus. Globules Rulletin of Torreo Botanical Club, Vol. 96, 1964., 490456=Proceedings of Seminar on Problems of Waterlogging and Salinity in Irrigated Areas. Government of India, November 1984., 484924=Fife Daniel Killing the Goose. Environment, April 1971., 401615=In april 1989, the national fisherman's forum organised the kanyakumari march with the avowed aim-'protect waters, protect life'. For people who depend on the ecology of the coastal region for their livelihood, the relation between water use on land and the sustenance of living resources of the sea is clear. Irreparable damage has been caused to the biological productivity^of the sea by the use of inappropriate technologies on land and in the oceans. Dams and barrages across rivers have taken their toll by disturbing the ecosystem and altering the natural flow of water and nutrients. Rivers which once used to carry food for marine life now carry mud and chemicals, leading to the gradual transformation of our waters into aquatic deserts., 485579=Godsmith, E. The World Bank: Global Financing of Impoverishment and Famine. Yhe Ecologist, Vol. 15 No. 1/2, 1985., 486538=Ibon. Facts and Figures. Manila, 15 September 1982., 105057=In the Garhwal Himalayas. an Englishman, Mr. Wilson' obtained a lease in 1850 to exploit all the forests of the Bhagirathi Valley for a low annual rental of Rs. 400. Under his axe several valuable Deodar and Chir forests were clear felled and completely destroyed.\" In 1864 inspired by Mr. Wilson's flourishing timber bussiness the British rulers of the Northwestern provinces obtained a lease for twenty years and engaged Wilson to exploit these forests for them. European settlements, such as Mussoorie, created new pressures for the cultivation of food crops, leading to largescale felling of oak forests. The conservation of forests was not considered. In his report on the forests of the state, E.A. Courthope; IFS, remarked: 'It seems possible that it was not mainly with the idea of preserving the forests that government entered into this contract'.'' Inspired by the economic success of Mr. Wilson and the government, in 1895 the Tehri state took over the management of forests. Between 1897 and 1899 forest areas were reserved and restrictions were imposed on village use. These restrictions were resented and completely disregarded by the villagers, and led to incidents of organised resistance against the authorities.'' On 31 March 1905 a Durbar Circular (No. 11) from the Tehri King announced modifications to these restrictions in response to the resistance., 484371=Eckholm, E. Planning for the Future: Forestry for Human Needs. World watch Paper 26. Washington D.C., Worldwatch Institute, 1979., 495483=Walton, H.G. Dehra Dun Gazetteer. Allahabad, Government Press, 1911., 481706=Buhuguna, S. My Experiences of Eucalyptus. Paper presented at the Workshop on Social and Economic Impact of Eucalyptus, Planning 'Commission, New Delhi, 21 May 1984., 482790=Barnett, S.R. The Lean Years: Politics in the Age of Scarcity. London, Abacus, 1980., 445364=The fate of the forests was similar to the pastures. The Crown possessed the forests, while the peasants had common rights to forest produce. With the increasing resource demand for capitalist growth, the Crown adopted a policy of deforestation. As a result, the peasants lost their common rights, and the Crown and the lords of manors, enclosed their deforested land and parcelled.them into large farms for lease at competitive rents. The policy of deforestation and the enclosure of the forest commons led to 'perhaps the largest single out-break of popular discontent in the thirty-five years which preceded the start of the civil war In the period 1628 to 131 large crowds attacked and broke down the enclosures and large areas of England were in a state of rebellion., 185873=The first systematic study of the impact of the official social forestry programme was undertaken by Shiva e' al. in 1981. Social forestry had been undertaken by the Karnataka Forest Department since 1975-76 much before the World Bank aided programme was launched. The official social forestry programme had gained considerable momentum by 1979-80, when the evaluation was undertaken. This is apparent from the growth of the project during that year:, 300240=The krishna, like other rivers of india has been reversed by the people srisailam is the most sacred pilgrim spot on the Krishna. It is named alter the Srisailam temple situated amidst rich forests on the banks of the river. The Krishna flows 3 km below the Srisailam temple which is dedicated to LOrd Shiva. In 1960. this ancient temple gave way to a temple of modern India Srisailam Dam., 493008=Sen, N.N. Working Plan. Dehradun, Dehradun Forest Divison, 1940., 94010=Forest struggles have been a sustained response to commercial forestry introduced by the British. The earliest records of commercial exploitation are of a syndicate formed in 1796 by Mr. Mackonchie of the Medical Service for the extraction of teak in Malabar to meet the demand for shipbuilding and military purposes. In 1806, a police officer, Captain Watson was appointed the first Conservator of Forests in India incharge of Malabar and Travancore. to extract teak for the King's navy, indicating that policing not science, was needed in the colonial forestry of that period. Indigenous trade was sealed and peasants were denied rights., 484835=Feyerabad P Paul d. Science in a Free Society. London, New Left Books, 1978., 121141=The violation of people's ancient rights to forest resources through the colonial forest policy led to popular opposition to the forest policy. Their resentment was first manifested in 1906 in the state of Tehri Garhwal. On 27 December 1906, the forest surrounding the Chandrabadin temple about 14 miles from Tehri town was earmarked for reservation. The next day 200 villagers gathered to protest against state interference in their forests over which they claimed full and extensive rights., 373505=Miles away from the Doon Valley, in Orissa, adivasi women of the 'Save Gandhamardan' movement embraced the earth singing Mati Devata, Dharam Devata (the earth is our God) to blockade the movement of vehicles of the Bharat Aluminium Company. BALCO had come in search of bauxite deposits in Gandhamardan after having destroyed the hydrological stability and sanctity of another important mountain-Amar Kantak-the source of the waters of the Narmada. the Sone and the Mahanadi rivers. The destruction of Amar Kantak was a high cost to pay for reserves which were much smaller than the original estimate. To feed its one lakh tonne aluminium plant at Korba in Madhya Pradesh., 177435=According to the national commission of agriculture (government of india, 1976), the scope of social forestry should include 'farm forestry, extension forestry, reforestation in degraded forests and recreation forestry.' Farm forestry in particular was defined by the Commission as '(the) practice of forestry in all its aspects on farms or village lands, generally integrated with other farm operation.' The same policy was reiterated in the Recommendations of the Second Forestry Conference held in 1980. The Conference stated that:, 494284=Singh, R.P. Nutrient Cyole in Eucalyptus Tereticornis Plantations. Indian Forester, Vol. 11 0, No. 1, 1984., 106448=These modifications, however, failed to diffuse the tension. Struggles took place throughout the kingdom, but the most significant one occurred in 1907 when a forest officer, Sadanand Gairola, was manhandled in Khandogi. When King Kirti Shah heard about the revolt he rushed to the spot to pacify the citizen, 491637=Recommendations of the Second Forestry Conference. Bombay, Centre for Monitoring the Indian Economy. 1980., 117839=Subsequent to notification No. 702 of 1880 based on Ross's report of the villagers' rights to forest produce, notification No. 889F of 1893 very clearly spelt out the management framework for meeting local needs of grazing, fodder, fuelwood. poles and thatching grass for housing. According to this notification, the Divisional Forest Officer (DFO) was to prepare an annual list of forest areas which would be open to grazing. The list would specify which areas, in which block of the forest, would be open for grazing in that year. The grazing of cattle in the said reserve blocks was to he regulated in either of the following ways:, 481352=Alvares, Claude. Deadly Development. Development Forum, Vol. XI, No. 7, 1973., 487253=Kale R.V. and R.V. Krishnamurthy. Litter Preferences in the Earthworm, Lanipito Mauriti. Proceedings of the Indian Academy of Science (Animal Science), Vol. 90, 1981 I., 493085=Sengupta, Nirmal. The Indigenous Irrigation of South Bihar. The Indian Economic and Social History Review, Vol. XVI. No. 2, April-June 1980., 274423=This was the general pattern of destruction of the survival base of the people in all regions of the country where the salt monopoly led to economic growth for British interests. This monopoly forced the people to give up the production of a basic resource like salt, which was being produced by them with simple technologies that required no capital input. The control made people totally dependent on the British supply, to be bought at a price determined by British interests. It was this exploitation by the British through the denial of a basic need as well as the associated destruction of other related resources that led to non-violent violation of the Salt Law as an assertion of the people's right to vital natural resources for survival. As a mode of protest it spread throughout the country with people breaking the Salt Law in large numbers. Its impact, both immediate and long-term was immense. By 5 March 1931 the British government was compelled to retrace its steps and issued a notification that people could produce salt for their own use., 320735=The research team which visited the villages soon after the evictions in July-August found the life of the villagers in the new settlements pathetic. Those who possessed stone houses earlier were forced to live in huts. Of course, there were a few stone houses. People were either building houses or were idle. Drinking water continued to be a problem. No bore wells had been dug in several settlements and in many cases there was no water source near by. The team observed that groups of people would discuss their future work prospects and livelihood, looking morose and depressed. Their clothing was inadequate and invariably unwashed. People cursed the government for driving them to destitution. An angry young man told the team that he would like to see the Srisailam Dam bombed., 490588=Pryor, L.D. The Biology of Eucalyptus. London, Edward Arnold. 1976., 272237=In 1900, a famine year, Kishengarh wanted to store some water by constructing an embankment tank on Rupnagar. The salt authorities strongly opposed this use of water for drinking and irrigation by the people. The Finance and Commerce Department of the then Government of India promptly accorded higher priority to the interest of the salt industry as opposed to the water needs for the survival of the people of Kishengarh. In a note dated 13 July 1901 the Department issued the following statement:, 488099=Kurien, J. Technical Assistant Projects and Socio-economic Change. Economic and Political Weekly, Vol. XX, Nos. 25 and 26, 22-29 June 1985., 489988=Patkar, Medha. The Times of India (New Delhi), 11 December 1986., 487614=Kothari, R. Dossier of International Foundation for Development Alternatives. Nyon, No. 52, 1986., 484264=Dletrich, G. Kanyakamari March. Economic and Political Weekly, Vol. XXIV, No. 20, 20 May 1989., 135680=Among the numerous instances of Chipko's successes throughout the Garhwal Himalayas in the years to follow, are those in Adwani, Amarsar and Badiyargarh. The auction of Adwani forests took place in October 1977 in Narendernagar, the district headquarters. Bahuguna undertook a fast against the auction and appealed to the forest contractors as well as the district authorities to refrain from auctioning the forests. The auction was undertaken despite the expression of popular discontent. In the first week of December 1977, the Adwani forests were scheduled to be felled. Large groups of women led by Bachhni Devi came forward to save the forests. Interestingly, Bachhni Devi was the wife of the local village head, who was himself a contractor. Chicks activist Dhoom Singh Negi supported the women s struggle by undertaking a fast in the forest itself. Women tied sacred threads to the trees as a symbol of a vow of protection. Between 13 and 20 December a large number of women from fifteen villages guarded the forests while discourses on the role of forests in Indian life from ancient texts continued non-stop. It was here in Adwani that the ecological slogan: 'What do the forests bear? Soil, water and pure air' was born., 488703=Manor, G.R. Representation to the Collector of Kanara on Behalf of Agricultural Association Kumta. 12 March 1918., 482337=Bandyopadbyay, J. and Vandana Shiva. Conflicts over Limestone Quarrying in Doon Valley. Environmental) Conservation, Vol. 12, No. 2, 1985., 495968=World Bank. Maharashtra Agricultural Credit Project, August 1972., 273903=It is this undisclosed destruction of agricultural ecosystems in the catchment of the Sambhar Lake that made possible and visible the growth of the salt industry there. By 1922 the prosperous and populated Kishengarh was desolate. Large areas of cultivable land became waste and wells could no longer be used. Another desperate attempt by the kingdom of Kishengarh to construct four irrigation tanks was postponed for twenty-four years, thus ensuring the total destruction of the local agricultural economy., 486181=Halsworth, E.C. The Human Ecology of the Tropical Forest. In E.G. Hallsworth (Ed.), Socio economic Effects and Constraints in Tropical Forest Management. New York, John Wiley & Sons. 1982., 485361=Georgescu-Roegen, N. The Entroy Law and the Economic Process. Cambridge, Harvard University Press. 1974., 309093=Keeping in view some of the problems encountered in trying to rehabilitate people displaced by developmental projects, the g,overnment of Andhra. Pradesh decided to pay compensation in cash, a policy initiated with the Pochampad project in the late sixties. Compensation was assessed for lands, wells and houses. Acquisition began in July 1969 and 1,829 acres of land was acquired. But this process was stopped almost immediately due to non-availability of funds and the areas notified for acquisition were once again denotified. Acquisition was resumed in 1974 and completed by 1980, in accordance with the Land Acquisition Act, 1894 (and several resolutions adopted and recommendations made at meetings of the Srisailam Control Board and the government). Compensation was paid for 84,772.55 acres out of a total of 107,348 acres submerged. The rest of the land was either government wasteland, or government land assigned to the poor or forest land constituting 20 per cent of the total submerged area which was not compensated for., 145642=In the final analysis, the dichotomy between 'development' and environment can be reduced to what is 'development' and how scientific knowledge is generated and used to achieve it. This dichotomy is clearly enunciated in the two slogans on the utility of the Himalayan forests-one emanating from the ecological concepts of Garhwali women, the other from the sectoral concepts of those associated with trade in forest products. When the Chipko movement evolved into an ecological movement in Adwani in 1977, the spirit of public interest ecological science was captured in the slogan: 'What do the forests bear? Soil water and pure air'. This was a response to the commonly accepted, partisan science based slogan: 'What do the forests bear? Profit on resin and timber'., 121646=In 1907, a mass meeting was held in Almora to protest against the forest policy which authorised the government to declare all forests and 'wastelands' ('benap'or unmeasured land) as reserved forests. As people's agitation increased because they were unable to get a response, they set fire to government forests and resin depots in 1916. The Kumaon Association was also established in that year to look into the forest problems of Kumaon, with G.B. Pant as its general secretary. Increasing people's protests forced the government to set up a 'Forest Grievances Corranittee' to enquire into forest protests in Kumaon and Garhwal. Though the committee reclassified forests to pacify the villagers, yet people's rights were not protected. As Pant concluded in The Forest Problem in Kumaon,, 398388=This description remained applicable to the Doon Valley until recently, when the impact of three decades of quarrying became painfully evident through the deposition of materials carried down by the mountain torrents during each monsoon. As a result. the boulder strewn beds of the rivers were transformed into ever rising depositories of debris Rispana river bed, boulders disappeared about ten years ago, while in the Tons river bed a major inflow of debris about 6 feet (nearly 2 metres) in height was recorded after the 1982 monsoon. The Baldi river's bed has been rising constantly, threatening roads and bridges in the area of Sahastradhara, which lies about 1 km upstream of its confluence with the Song river. Buildings near the only bridge over the Baldi river have already been washed away, and the cumulative piling up of 'bajri' will, in the near future, pose a serious threat of floods in large parts of the Valley., 491093=Raghava Rao, et al. An Estimation of Ground Water Potential of India. Hissar. Soil and Water Management Symposium, 1969., 489532=Odum, E.P. Ecology. New York, Holt, Rinehart and Winston, 1975., 481884=Baker, F. Land Revenue Settlement of the Dehra Dun Distinct. Allahabad, Government Press. 1886., 157655=The Appiko movement has created awareness among villagers throughout the Western Ghats about the ecological destruction of their forest wealth. People now closely monitor the exploitation of forests by the forest department, and have been able to show the discrepancy between professed and actual practice of forest management. In December 1984, villagers of Gerasoppo range of Honavar forest division were able to record the felling practices and damage to forests due to timber exploitation. Their observations were as follows:, 374532=Since 1985 the tribals have obstructed the work of BALCO and have refused to be tempted by the company's offer of employment. Even police help has failed to weaken their determined protest., 284731=The Canal tax agitation emphasised that since there had been no development and no increased amount of land situated in the Damodar Canal area, no improvement levy could be imposed under the Bengal Development Act 1935. The levy was linked to the government's extravagant capital expenditure, not to the paying capacity of the agriculturists or benefits, if any, derived by them. The improvement levy was thus totally illegal, unjust. unreasonable and contrary to the facts and opposed to justice. The peasants insisted that the cost of the works be recovered from the East Indian Railways, the Grand Trunk Road, Burdwan-Kawa Railway, Bengal-Nagpur Railway, the city of Calcutta and other vested interests who had really benefited from the canal. Further, they also clarified that since they derived benefits from the canal only once in seven or eight years when drought occurred, they should bear only that cost., 132884=While the concept of saving trees from felling by embracing them is old in Indian culture, as was the case of Bishnois, in the context of the current phase of the movement for forest rights in Uttarakhand this popular poem written in 1972 is the earliest source of the now famous name 'Chipko'. In 1973 the tempo of the movement in the two centres-Uttarkashi and Gopeshwar-reached new heights. Raturi and Bhatt were the main organisers in these two places. While a meeting of the Sarvodaya Mandal was in progress in Gopeshwar in April 1973, the first popular action to chase contractors away erupted spontaneously in the region, when the villagers demonstrated against the felling of ash trees in Mandal forest. Bahuguna immediately asked his colleagues to proceed on a foot march in Chamoli district following the axemen and encouraging people to oppose them wherever they went. Later in December 1973, there was a militant non-violent demonstration in Uttarkashi in which thousands of people participated. In March 1974, twenty-seven women under the leadership of Goura Devi saved a large number of trees from a contractor's axe in Reni. Following this, the government was forced to abolish the private contract system of felling and in 1975 the Uttar Pradesh Forest Corporation was set up to perform this function. This was the first major achievement of the movement and marks the end of a phase in itself., 483814=Darwin, C. The Formation of Vegetable Mould Throught the Action of Worms with Observations of their Habits London, Murray, 1881., 113081=To encourage colonization of the valley, in 1838 the British government offered grants on very liberal terms to Europeans. The Gazetteer of 1911 records that: the grantees were bound to clear the whole of their grants within 20 years with the exception of the irremediably barren land. The land was to be subject to a progressive rental until the tenth year when it reached its maximum of 12 annas with which may be compared the universal rate of 14 annas proposed by Maj Young in his settlements, 311437=Despite such gross injustice few people approached the courts since majority of them were illiterate and without any means. Further, the Land Acquisition Act, 1894 deals with people on an individual basis, fixing a time limit of 6 weeks from the date of receipt of notice or 6 months from the date of award, whichever expires earlier, for filing objections, and only if the amount of compensation has been accepted under protest in writing., 98381=The growth of commercial economic activity through the manipulation of nature generates second order conflicts over natural resources which arise not merely from issues of how a particular resource is distributed, but also how it is utilised and how it affects related resources. Thus, in the case of forest resources, contemporary conflicts are being generated by silvicultural systems aimed at maximising the production of commercially and industrially valuable species like eucalyptus, pine and teak, through the destruction of natural indigenous mixed forests which have a high use value for basic needs and for ecological stability. In Bihar, the conversion of sat forests into teak plantations has been resisted by the tribals. In 1980, a violent confrontation between tribals and the forest officials and police in Gua resulted in the death of thirteen tribals and three policemen. This clash was the outcome of the conflict between two types of silviculture, one based on trees for.the people and the other based on trees for commerce. Movements arising from conflicts over natural resources at this level are ecologically rooted since they do not merely emerge from an unfair distribution of a single resource, but from the unjust and unsustainable use of an ecosystem as a complex of interrelated resources. In ecologically sensitive regions, the destruction of forest ecosystems has in turn threatened the survival of the forest dwelling communities. The people's response to this deepening ecological and economic crisis induced by the commercial exploitation of resources has been the emergence of movements for the conservation of forest resources throughout the country. The most well known and successful among these is non-violent Gandhian movement called the Chipko (hug the tree) movement. Beginning in the early seventies in the Garkwal region of Uttar Pradesh, the methodology and philosophy of Chipko has now spread to Himachal in the north, Karnataka in the south, Rajasthan in the west and Bihar in the east. Chipko as a national campaign for forest conservation is a response to the multidimensional conflicts over forest resources at the scientific, technical, ecological and economic levels., 211097=Chota Nagpur and Assam, the vast trail of forest lands near the mouth and delta of the Hooghly and other rivers, known as Sunderban. These lands were taken over by the British government and leased to cultivators to turn them into revenue generating lands. In the Gangetic plains, 'wastelands' were allotted to an adjacent village, but in the dense forest regions of Dehradun, Mirzapur, etc., the forest tracts were retained as 'Government Waste'. In Punjab, 200 per cent of the cultivated area of a village was categorised as village waste. These lands were maintained partly as forest and grazing lands and partly for the extension of cultivation. In the Raiyatwari areas of Bombay there were local forms of landholding, and local methods of cultivation which always involved a patch of wood and grass bearing land being attached to each cultivated landholding. In 1861, under the vice royalty of Lord Canning, wasteland rules were formulated. As Baden Powell records 'The value of state forests-to be made out of the best and most usefully situated wooded and grass lands-was not even recognised, and the occupation of the waste by capitalists and settlers was alone discussed. It was only after the late nineteenth century when forests also became a source of revenue that state forests were no longer called waste. Village forests and grazing lands however continued to be categorized as wastelands because they were not sources of revenue for the state, even though they were vital fuel and fodder resources for the agricultural economy., 495326=Ummaya, Pandurang and Bharai Dogra. Planting Trees: Indian Villages take the Decision into Their Own Hands. The Ecologist, Vol. 13, No. 5, 1983., 367489=The Pani Panchayat movement launched by the Gram Gourav Pratisthan (GOP) in Pune district in Maharashtra is an example of a people centred effort to create an ecological and equitable system of water use in a drought prone area.- It was launched in 1972 when Maharashtra was facing a severe drought. The government focused on relief schemes and rapid exploitation of water resources. Salunke, who established the GGP, realised that the focus had to be soil and water conservation as well as strict water control., 175819=Source: Government of Karnataka, 1980 p. 9., 119763=In the Kumaon region there is evidence that the needs of the empire and not of the local people led to rapid forest denudation. According to Atkinson's Gazetteer, the forests were denuded of good trees in all places. The destruction of trees of all species appears to have continued steadily and reached its climax between 1855 and 1861 when the demands of the Railway authorities induced numerous speculators to enter into contracts for sleepers, and these men were allowed, unchecked, to cut down old trees far in excess of what they could possibly export, so that for some years after the regular forest operations commenced, the department was chiefly busy cutting up and bringing to the depot the timber left behind by the contractors., 139558=Both the earlier forest satyagrahas and their contemporary form, the chipko movement, are rooted in conflicts over forest resources and are similar cultural responses to forest destruction. What differentiates Chipko from the earlier struggles is its ecological basis. The new concern to save and protect forests through Chipko satyagraha did not arise from a resentment against further encroachment on people's access to forest resources. It was a response to the alarming signals of rapid ecological destabilization in the hills. Villages that were once self-sufficient in food were forced to import food as a result of declining food productivity. This, in turn, was related to the decrease in soil fertility in the forests. Water sources began to dry up as forests disappeared. The so-called Natural disasters', such as floods and landslides, began to occur in river systems which had hitherto been stable. The Alaknanda disaster of July 1970 inundated 1,000 km of land in the hills and washed away many bridges and roads. In 1977 the Tawaghat tragedy took an even heavier toll. In 1978 the Bhagirathi blockade resulting from a big landslide above Uttarkashi led to massive floods across the entire Gangetic plains., 280857=To compensate the people of Burdwan the government constructed the Eden Canal in 1881 and the Damodar Canal in 1933. The latter was intended to irrigate 20,000 acres of rice lands of 379 villages at the cost of Rs. 1.25 crores. After the inauguration of the canal, the government planned to realise a part of the capital expenditure by imposing a canal tax on the ryots. As the tax was heavy, the peasants refused to execute any lease in order to use the canal water. As a result the government introduced a legislation to impose a compulsory levy. The Bengal Development Bill 1935 was introduced by Khwaja Nazamuddin on 18 February 1935 which provided for the improvement of land in Bengal and the imposition of a levy in respect of increased profit resulting from the improvement works constructed by the government. The aim was to induce people to use canal water and to convert this consumption into a source of revenue. The Bill, it was argued, would not only compel the ryots to pay up to half of their increased profits, but would also enable them to make increased profits by taking advantage of the improvements. The Minister stated that peasants did not use canal water in a normal rainfall year but viewed irrigation as an insurance against the failure of monsoon. The Bill was aimed at 'not allowing any man to indulge in the luxury of not consuming canal water during normal rainfall years by making every man pay an improvement levy of Rs. 5.80 per acre per annum irrespective of the benefits derived or likely to be derived from the irrigation facilities of the canal., 354632=The expansion of intensive irrigation for increasing sugarcane cultivation was a planned development activity. In 1972, the World Bank gave a credit of US $30 million to finance farmers' investments to expand the irrigation potential. During the three year period of the Maharashtra Agricultural Credit project, it was planned that 300 new tube-wells would be dug at the cost of US $2.5 million to irrigate 6,000 hectares, 11,000 new dug-wells would be energised costing US $27.5 million to irrigate 60,000 hectares, and 175 lift irrigation schemes would be installed costing US $11.5 million to irrigate 40,000 hectares. It was the policy of the World Bank project to finance the expansion of sugarcane. Estimations of changes in the cropped area due to the Agricultural Credit project of the World Bank indicated that the project would lead to a decline in staple foodgrain production, and an expansion of commercial crops like sugarcane. The area under jowar was expected to decrease from 101,450 hectares to 98,900 hectares, i.e., a decrease of 2,550 hectares. Pulses cultivation was expected to come down from 31,550 to 22,200 hectares. a decline of 9,350 hectares. On the other hand, the area under sugarcane was expected to more than double, from 3,600 hectares to 8,200 hectares. Given that a hectare of sugarcane uses 300 hectare cm of water, while a hectare of jowar uses 21, and a hectare of pulses uses only 15 in terms of water use, the planned increase in sugarcane cultivation in a drought prone area was a prescription for desertification. Ironically, the World Bank project to expand intensive irrigation was launched in one of the worst drought years in Maharashtra. Its guiding principle was that there was adequate water for irrigation., 113590=These grants covered large areas with the original nine grants amounting to nearly 200 sq km. The best sites among these had been appropriated by the officers of the district or persons associated with them. The extent of clear felling of forests through a single administrative decision was the most significant factor contributing to the depletion of forest cover in the Doon Valley. This deforestation altered the face of the valley and reduced the stability of the river banks. Indicating this impact the Gazetteer of 1911 reported that 'near Debra Dun the scenery has been somewhat spoilt by the rapid spread of cultivation and the cutting down of the sal trees that used to lie in the high banks of the numerous ravines in the neighborhood'., 493699=Shiva, V., H.C. Sharatchandra and J. Bandyopadhyay. Social, Economic and Ecological Impact of Social Forestry in Kolar. Bangalore. Indian Institute of Management, 1981., 492628=Rostow, W.E. The Stages of Economic Growth. Cambridge, Cambridge University Press, 1979., 486674=Jain S.N., Alice Jacob and Subhash C. Jain. Interstate Water Conflicts. Bombay. N.M. Tripathi, 1971., 154672=The history of Uttara Kannada has been the history of people's struggle against commercial forest policy. The destruction of tropical natural forests and the raising of monoculture plantations of teak and Eucalyptus caused irreversible changes in the forest ecosystem. The destruction of mixed species denied people access to biomass for fodder, fertiliser, etc. The clear felling of natural forests has led to severe soil erosion and drying up of perennial water resources. Moved by the destruction of essential ecological processes, the youth of Salkani village in Sirsi launched a Chipko movement which was locally known as 'Appiko Chaluvali'. They embraced the trees to be felled by contractors of the forest department. The protest within the forest continued for thirty eight days and finally the felling orders were withdrawn. The success of this agitation spread to other places and the movement has now been launched in eight areas covering the entire Sirsi forest division in Uttara Kannada and Shimoga districts. These areas included Mathghatta, Salkani, Balegadde, Husei, Nedgod, Kelgin Jaddi, Vanalli and Andagi, The rapid spread of the movement was based on evidence provided by villagers that the forest department was over-exploiting the forests. Villagers' complaints were later confirmed by official visits by scientists and politicians. In the forest of Kalase, with an area of 151.75 hectares earmarked for selection-cum-improvement felling for the year 198 3 84, a total of 590 trees above the girth limit of 2 metres was earmarked for felling. The Indian Plywood Mills had extracted a total of 125 trees belonging to eight species in the 1982-83 season. Thus a total of 715 trees spread over 151.75 hectares, or 4.05 trees per hectare were to be extracted. With an additional 5 per cent added for damage, the total number expected to be felled was 4.25 trees per hectare., 452688=First, a high percentage of the loans and credits from these banks is allocated to environmentally sensitive areas such as agriculture, forestry, dams and irrigation. In 1983, half the project loans totalling US $22 billion were directed to these sectors globally. Thus, although as a percentage of total economic investment these loans account for only a small fraction, in terms of the impact on natural resource systems they are very significant.' As the case studies in this volume indicate, World Bank financing has in general played a catalytic role in generating conflicts over natural resources. Whether it is forestry, dams, or irrigation projects, World Bank funding has created the context for diversion of natural resources from the maintenance of ecological balance and sustenance of human survival to the generation of short-term profits., 482887=Bethel J.A. Sometimes the Word is 'Weed'. Forest Management, 17-22 June 1984., 485290=Candid, M.K. Hind Swaraj. Ahmedabad, Navjivan Press, 1938., 490065=Perez, Garcia. Peru Wants a Historic Re-encounter with the Land. IFDA Dossier, No. 52. 1986., 335060=After forcibly driving people out of their homes and making them destitutes in May-June 1981, pressure exerted by the evictees, and witnessing the enormous difficulties of the people themselves prompted the government to ameliorate their condition to some extent:, 488614=Manahar, Rajnikant. Farmers' Agitation of Malaprabha. Bangalore. CIEDS, 1980, 492078=Report of the Expert Committee on Utilisation of River Walers. Andhra Pradesh. Government of Andhra Pradesh, 1985., 344497=Table 9.2 Avenge Annual Rainfall in Rayalseema 1946-85, 156578=Representatives of the Lalkhminarasimba Yuvak Mandali who launched the Appiko movement in September 1983 maintained that (a) there was an excessive concentration of trees earmarked for felling in easily accessible areas, and (b) there was excessive damage to trees during the course of felling. In 1 hectare plot sampled it was found that eleven trees had been marked for cutting, out of which eight had been felled. In the process of felling these eight trees, as many as five trees had been damaged. This rapacious destruction of forest resources was undermining the ecological survival of local communities, who finally stopped felling through non-violent direct action- as seen in the case of Chipko., 485705=Golley, F.B.. Productivity and Mineral Cycling in Tropical Forests. In Productivity of World Ecosystems. Washington D.C., National Academy of Sciences, 1975., 282453=The Bengal Development ' Bill was obviously resented by the Burdwan peasantry for whom it became yet another source of colonial exploitation. In the later thirties the popular discontent gathered momentum in the command of the Damodar Canal over the Bengal Development Act and the improvement levy. A movement crystallized as the Damodar Canal Tax movement. An association called the Burdwan District Raiyats Association was formed with D.P. Choudhury and Balai Chand Mukhopadhyay as President and Secretary, respectively to oppose the Act and the canal tax. On 20 December 1935, peasants from 500 villages of the Damodar Canal area held a mass meeting under the auspicious of the Raiyats Association. The meeting adopted a number of resolutions challenging the estimates of produce of land in the precanal and post-canal days and the Development Act. By the beginning of February the agriculturists of the canal areas were seriously affected, due to the enforcement of the Development Act. The government began harrassing poor cultivators for the realisation of the canal tax and made an effort to recover the arrears of taxes. On 10 February the cultivators' grievances were brought to the notice of the Burdwan Maharaja who suggested a public protest meeting be held to air the grievances of the ryots. On 14 February 1937, about 1,000 representatives of the cultivators of the Damodar Canal area attended a conference and resolved,, 486901=Jodha, N.S. Common Property Resources and Rural Power. Economic and Political Weekly, Vol. 21, No. 7, 5 July 1986., 356401=While experience in many districts indicates the relation between over-exploitation of groundwater and a serious decline in the water table, the current thinking in international agencies and government seems to be based on an intentionally created picture of groundwaterabundance in all parts of the country. In fact according to a recent document of the Water Resources Ministry, even the districts marked as negative balance districts in the 1982 report of the Central Groundwater Board have been shown as positive balance districts (Table 9.5)., 489608=Olsen, K.W. Manmade Drought in Rayalseema. Economic and Political Weekly, Vol. XXII, No. 11, 14 March., 374734=The conflict is totally unnecessary because aluminium production has turned out to be a losing enterprise in India in market terms. BALCO incurred a loss of Rs. 77 crores in 1985 86 alone. Its cumulative net loss up to March 1986 stood at Rs. 317 crores. Future prospects of the company to make profits also seem dismal. The irrationality of destroying precious water resources for the mining of bauxite when we already have a surplus of aluminium is evident. The mining activity is not dictated by the needs of the people but by the demands of industrialised countries which are closing down their own aluminium plants and are encouraging imports from countries like India. Japan has reduced its aluminium smelting capacity from 12 lakh tonnes to 1.04 lakh tonnes and is importing 90 per cent of its aluminium requirements. Several Japanese companies have expressed a desire to set up joint ventures in India's export processing zones to manufacture aluminium products with buy-back arrangements. The survival of the tribals of Gandhamardan is thus threatened because the wealthy countries want to preserve their environment and their luxurious lifestyle., 492729=Rothman, H. Murderous Providence. London, Rupert Hall-Davis, 1972., 482977=Bharat Bhushan. Wastelands Project. The Times of India, 5 March 1987., 344384=The rise in the number of electric pumpsets in the same region during 1968 84 is shown in Table 9.3., 484714=Fedoseev, P.N. In Philosophy and the Ecological Problems of Civilisation. Moscow, Progress Publishers, 1983., 494633=Supreme Cour Order. 12 March 1985., 483630=Commoner B. The Closing Circle. London, Jonathan Cape, 1972., 489066=Moench, N. and J. Bandyopadhyay. Local Needs and Forest Resource Management in the Himalayan in J. Bandyopadbyay et al.. India's Environment: Crisis and Responses. Dehradun, Natraj Publishers, 1985., 490170=Phadke, A.R. A People's Dam. Economic and Political Weekly, Vol. XXIV, No. 16, 22 April 1989., 488520=Manning, B. The English People and the English Revolution. London. Penguin, 1976., 484115=Deshpande V.D. S.P. Salunke and D.C. Korten. Water for People. In D.C. Korten (Ed.), Community Management. London, Kumarian Press. 1986., 180765=Table 5.2 Social Forestry Projects with Foreign Assistance in 1981 (Rs. crores), 89338=Conflicts over forest resources in India can be demarcated into four phases. The first phase began when the British 'reserved' large tracts of forests for commercial exploitation to meet the military and other needs of the British empire. These conflicts led to forest struggles and forest satyagrahas during the late nineteenth and early twentieth centuries. The second phase was the post-colonial phase when the 1952 forest policy led to the rapid expansion of forest based industry, large-scale clear felling of natural forests, and their conversion to monocultures of commercial species. Conflicts generated by this intensification of forest use led to movements like Chipko. In the third phase, spurred partly as a response to growing public criticism of the commercial exploitation of forests, and partly as a response to the crisis in the supply of raw materials for wood based industry, industrial plantations expanded on farm lands and village commons under 'Social Forestry' and 'Wasteland Development Programmes'. These afforestation programmes have become a new source of conflicts during the eighties. The fourth phase is expected to emerge in the future as international finance, changes in biotechnologies and biomass conversion into chemical and energy substitutes for petroleum based products, supported by major investments in forestry, are expected to lead to a new level of transnationalisation of forest use and forest conflicts., 487983=Kurien, J. Marine Fish Production in Kerala, Past Trends and Perspectives for the Future. 1984 (mimeo)., 487434=Kamath, Suryanath. Karnataka State Gazetteer. Part 1. Government of Karnataka, 1982., 491756=Reddy, S.T.S. Indigenous Tank System of South India. Research Foundation for Science and Ecology, 1985., 297566=The first large-scale intervention in the natural flow of water in the Krishna river basin was seen in the late nineteenth century. It was motivated both by the irrigation needs of export crops like cotton and groundnut, as well as for transporting these products easily to major ports like Madras. The Krishna delta canal system based on the Vijayawada barrage was constructed in 1855 The Nira Canal in Maharashtra was constructed in 1835 to irrigate about 150,000 acres and the Kurnool Cuddapah Canal was constructed in 1886 to irrigate 100,000 acres. With the passage of time. an increasing number of government aided large and medium projects came up and today the Krishna river has numerous dams including the Dhom Dam which is at a distance of 5 km from its source. Midstream, we find the Alamatti and Narayanpur Dams of the Upper Krishna Project while further downstream Srisailam and Nagarjunsugar Dams generate electricity and divert water for irrigation.The tributaries have also been used extensively in this respect., 316689=The people were rudely shaken out of their complacence soon after the completion of the dam in the summer of 1981. When repeated warnings failed to dislodge the villagers the government realised that until and unless the houses and huts were demolished, the people would not vacate the villages. The officers and staff of the Departments of Revenue and Irrigation and Power along with hired labourers from the towns and a large contingent of police undertook the demolition work. They completely demolished the houses by knocking down ceilings and walls, and removing door and window frames. Demolition of huts was carried on with much more vigour and zeal. Utensils and other belongings were thrown out, cattle were let loose and people were driven out-hounded out of their own homes like stray cattle in one big swoop. People had never seen anything like this. The authorities used simple tools like crow bars and pick axes and bulldozers in the operation. The ruthless actions of the authorities shocked the people who were already distressed at the thought of having to leave their homes. The officials did not show any regard and respect for people. People complained to the research team that the officials were very repressive in their actions. An old woman in Relampadu village bitterly weeping, reported to the committee that her ankle and her right hand were fractured when she was dragged out from her hut by the police. The government brutality created panic among the people. Strong resentment against the behaviour of the officials was vocalised by people in every village that the research team visited. Very few families were provided with the promised free transport to the new sites chosen by the villagers. People complained that they had to pay money even for this facility. As a result, majority of the evictees had to carry their belongings on their heads. Without transport, almost all the evicted families had to leave a part of their belongings in the villages. This traumatic experience was repeated in most of the eighty-two villages facing full or partial submersion., 481992=Bandyopadbyay, J. In E. Goldsmith and N. Hildyard (Eds.), The Social and Environmental Effects of Large Dams. Vol. 2. Cornwall, Wadebridge Ecological Centre, 1984., 493238=Sengupta, N. Irrigahon: Traditional vs. Modern. Delhi, Institute of Development Studies. 1985., 494204=Singh, K.N. Working Plan. Dehradun: Dehradun Forest Division, 1980., 495152=Tripathi, Inter-State River Conflicts. Law Institute, 1971., 490743=Quereshi I.M. The Concept of Fast Growth in Forestry and Place of Indigenous Fast Growing Broad Leaved Species. Proceedings of the Eleventh Silvicultural Conference, Vol. 2. Dehradun, Forest Research Institute and College, 1967., 93135=Forest resources, like other resources needed for survival, have traditionally been common resources, collectively managed and utilised by village communities. They could not consistently with the principle of Hindu law and the customs of the country belong to any individual. To transform these common forest resources into commodities from which revenues and profits could be derived. it was therefore necessary to change property relationships. Through the Indian Forest Acts of 1865 and 1878, the British acquired a monopoly right over all valuable tracts of forests by converting them into reserved forests'. The traditional free access to forests of the forest communities was therefore curtailed. British forest legislation aroused resistance from village communities which were thus deprived. Local revolts broke out in all forest regions of the country., 302352=In the summer of 1981, shocked by the brutal and inhuman manner in which people were thrown out of their homes by the government with the assistance of police, bulldozers and workers from the town, a Lokayan team in Andhra Pradesh carried out a survey of the problem of the evictees in July-August 1981. The survey aimed at:, 136923=The axemen withdrew only to return on 1 February 1978 with two truckloads of armed police. The plan was to encircle the forests with the help of the police in order to keep the people away during the felling operation. Even before the police could reach the area volunteers of the movement entered the forests and explained their case to the forest labourers who had been brought in from distant places. By the time the contractors arrived with the police each tree was being guarded by three volunteers who embraced the trees. The police, having been defeated in their own plan and seeing the level of awareness among the people, hastily withdrew before nightfall., 482488=Bandyopadhyay, J. and Vandana Shiva Ecologist, Vol. 17, No. 1, 1987., 491226=Rai Usha The Times of India (New Delhi), 9 September 1986., 481526=Bahro, R. From Red to Green. London, Verso, 1984., 485235=Gandhi M.K. Young India, 20 December 1928., 140790=The over-exploitation of forest resources and the resulting threat to communities living in the forests have thus evolved from concerns for distribution of material benefits to concerns for distribution of ecologically generated material costs. During the first stage, the growth of commercial interests resulted in efforts to exclude competing demands. The beginning of large-scale commercial exploitation of India's forest resources led to the need for a forest legislation which denied village communities' access to forest resources. The forest satyagrahas of the thirties were an outcome of the Forest Act of 1927 which denied people access to biomass for survival while increasing biomass production for industrial and commercial growth. The growth imperative, however, drove production for commercial purposes into the second stage of conflict which is at the ecological level. Scientific and technical knowledge of forestry included in the existing model of forest management, is limited to viewing forests only as sources of commercial timber. This gives rise to prescriptions for forest management which are basically manipulations to maximise immediate growth of commercial wood. This is achieved initially by the destruction of other biomass forms that have lower commercial value but may be very important to the people, or have tremendous ecological significance. The silvicultural system of modern forestry includes prescriptions for the destruction of noncommercial biomass forms to ensure the increased production of commercial biomass forms. The encouragement to substitute ecologically valuable oak forests by commercially valuable conifers is an example of this shift. Ultimately, this increase in production may be described as mining of the ecological capital of forest ecosystems which have evolved over thousands of years., 303296=A second survey was carried out in 1984-85 covering nine of the villages included in the earlier sample survey as part of the UN University project on Conflicts over Natural Resources. The questions that prompted the second survey were:, 353536=The shift from rainfed coarse grain crops to irrigated cash crops, in this case sugarcane, has meant higher incomes. But the costs have been heavy. Manerajree village of Tasgaon taluk is among those that have benefited financially but have lost materially because of sugarcane production and the related increase in groundwater exploitation. A new water scheme with a potential supply of 50,000 litres was commissioned in November 1981 at the cost of Rs.6.93 lakhs. The source well yield lasted only a year, it was dry by November 1982. For increasing yields, three bores each 60 metros deep were made near the well. Together they yielded (with power pumps) 50,000 litres a day in 1982, however all the wells had gone dry by November 1983. In 1984 one borewell of 60 metres depth was dug in the village but this too was found to be dry. Another bore of 200 metres depth provided water for a short time before running dry. More than 2,000 privately owned wells in this sugarcane region have also dried up. At present, water is being brought by tankers from a distance of 15 km., 132049=The platform for the organisation of women was thus ready by the seventies and this decade saw the beginning of more frequent and more vocal popular protests on the rights of the people to protect and utilise local forests. In 1971 Swami Chidanandji of Rishikesh undertook a month-long march to bless the people in their struggle. The year 1972 witnessed the most widespread organised protests against commercial exploitation of Himalayan forests by outside contractors in Uttarkashi on 12 December, and in Gopeshwar on 15 December. It was during these two protest meetings that Raturi composed his famous poem describing the method of embracing the trees to save them from felling:, 485875=Gupta , A. Drought and Deprivation: Socio-Ecology of Stress, Survival and Surrender Paper presented at the seminar on Control of Drought, Desertification and Famine, Delhi, 1986., 483059=Bhattacharyya, B., et. al. Damodar Canal Tax Movement. In A.R. Desai (Ed.), Peasant Struggles in India. New Delhi, Oxford University Press, 1979., 483703=Dakshinamurtl, C., et al. Waler Resources of India. New Delhi, IARI Water Technology Centre, 1977., 221490=Source: society for Promotion of Wasteland Development 1984., 115300=These ecological considerations were not, however, the central objectives of the reservation of forests through the notification of the Forest Act of 1878. The reservation of forests was guided largely by the fact that: 'Forests in themselves constituted a property of great value and might be made to yield an annual revenue equally with cultivation'., 462980=The ideology of this development is, however, confined within the limits of the market economy. It views conflicts over natural resources and ecological destruction as distinct from the economic crisis, and proposes solutions to the ecological crisis in the expansion of the market system. As a result, instead of programmes of gradual ecological regeneration of nature's economy and the survival economy, immediate and enhanced exploitation of natural resources with higher capital investment is prescribed as a solution to the crisis of survival. Clausen, the President of the World Bank, recommended that 'a better environment, more often than not, depends on continued growth. In a more recent publication Chandlers further renews the argument in favour of a market-oriented solution to ecological problems and believes that concern for conservation can only come through the market. Solow, who was awarded the Nobel Prize for his contribution to economics in 1987, states that production and growth can completely do away with exhaustible natural resources and exhaustion of resources is not a problem. It is alleged that 'the ancient concern about the depletion of natural resources no longer rests on any firm theoretical basis'. This belief of modem economics is based on its unquestionable faith in modern Western science. As Solow states: If it is very easy to substitute other factors for natural resources, then there is, in principle, no problem. The world can, in effect, get along without natural resources, so exhaustion is just an event, not a catastrophe., 446149=The policy of deforestation and the enclosure of commons was later replicated in the colonies. In India, the first Indian Forest Act was passed in 1865 by the Supreme Legislative Council, which authorised the government to declare forests and wastelands ('benap' or unmeasured lands) as reserved forests. The introduction of this legislation marks the beginning of what is called the 'scientific management' of forests; it amounted basically to the formalisation of the erosion both of forests and of the rights of local people to forest produce., 189508=Information from individual households was collected with the help of a questionnaire. The important information sought through the questionnaire was related to the socio-economic background of the household, landownership status, land use pattern, domestic energy consumption, future land use programrnes, etc. Besides the data collected through the questionnaire, oral historical information on the type of land use in the past few decades, types of species of trees people need, the relationship of the village organisation with the forest department, etc., was also collected. The fieldwork for the study was carried out between December 1980-February 1981. This information was used to analyse the impact of social forestry in more efficient land utilisation from the point of view of satisfying the basic requirements of the village communities for forest products and the increased stabilisation of the village ecology and life-support systems. The study made certain observations that led to a national debate on the social desirability of the official social forestry programmes as practiced in Kolar. It was observed that official funds were being used by the social forestry programme to transform the excess land belonging to big and absentee landlords into Eucalyptus plantations for pulp industries. Landless labour was most severely affected by this shift in land use from traditional rotation and intercropping to longterm ratoon cropping of Eucalyptus (mainly tereticornis). While the study was used by rural people and many voluntary organisations to revise the social forestry programme, the donor World Bank and the recipient State Forest Department found in the social forestry programme to transform the excess land belonging to big and absentee landlords into Eucalyptus plantations for pulp industries. Landless labour was most severely affected by this shift in land use from traditional rotation and intercropping to longterm ratoon cropping of Eucalyptus (mainly tereticornis). While the study was used by rural people and many voluntary organisations to revise the social forestry programme, the donor World Bank and the recipient State Forest Department found in the social forestry programme to transform the excess land belonging to big and absentee landlords into Eucalyptus plantations for pulp industries. Landless labour was most severely affected by this shift in land use from traditional rotation and intercropping to longterm ratoon cropping of Eucalyptus (mainly tereticornis). While the study was used by rural people and many voluntary organisations to revise the social forestry programme, the donor World Bank and the recipient State Forest Department found in the market forces. Thus, the World Bank aided social forestry programme had clearly nothing to do with society right from the start., 455518=The massive involvement of international finance in the economic development of Third World countries changes the natural resource management strategies in drastic ways. Rapid growth of export-oriented resource utilisation has led countries into the debt trap, with its concomitant ecological degradation. The link between borrowing and ecological degradation can be exemplified in the case of Brazil. In 1984-82 Brazil had borrowed nearly US $300 million which rose to about US $950 million in 1983 and 1984. When the disbursements were used up Brazil was not able to generate the counterpart funds to complete the projects and loan repayment started on incomplete projects. The burden is on farming for export, leading to increasing deforestation and human displacement in the Amazon. The story of Africa, the continent with the most serious ecological crises, is no different. In 1983 there were no African countries among the large debtors. Today, the external debt of forty-two sub-Saharan economies is in the order of US $130 135 billion. The case of Sudan is illustrative of what is happening in Africa. A few years ago, agencies like the FAO viewed Sudan as having the greatest agriculture potential, especially for export crops. Sudan did 'develop' its agriculture with heavy borrowing. Today, Sudan has a US $78 million proposal for emergency aid and US $213 million In interest due after rescheduling on US $10 billion external debt. Thousands of Africans are dying because development first destroyed their sustenance base and paying the debts for that development is further depriving them of their entitlement to survival. When the whole economy has virtually collapsed, Africa's ecological regeneration is surely a far cry. The state of anarchy of development and its after-effects are summarised in the following words of the Peruvian President Garcia Perez:, 488987=Mishra, A. Mitti Bachao. New Delhi, Gandhi Peace Foundation, 1981., 496046=Worster, D. Thinking like a River. In W. Jackson et al. (Eds:), Meeting the Expectations of the Land. San Francisco, Northpoint Press, 1984., 486386=Hardin G. The Tragedy of the Commons. Science 162, 13 December 1968., 481442=Baden-Powell, B.H. Land Revenue in British India. London, Oxford, 1907., 490668=Pyarel. Towards New Horizons. Ahmedabad, Navijvan Press, 1959., 486787=Jodha, N.S. Market Forces and Erosion of Common Property Resources. Hyderabad, ICRISAT, 1986 (mimeo)., 310140=Drawing upon the registered value of sale/purchase of land which is normally much lower than the actual price (to avoid higher stamp duty) and the fact that the acquisition and payment of money were long drawn out affairs, they had the net effect of offering very low prices for the properties acquired. The average price paid for dry lands was Rs. 1,820 per acre, whereas the prevailing market rate for reasonably good dry land was Rs. 10,000 per acre in 1981. Similarly, compensation paid for wet land was on an average Rs. 3,547.05 per acre while the market value was around Rs. 20,000 per acre, i.e., the compensation paid between 1974 and 1980 was only one-fifth of the market value of land at the time of eviction., 356962=Table 9.5 Dangerous Inconsistency in Groundwater Availability between 1982 Data of CGWB and 1987 Data of a Recent Document of the Ministry of Water Resources (all units in million cubic metres), 489723=Omvedl, G. Anti-Drought Movement. Economic and Political Weekly, Vol. XXI, No. 18.3 May 1986., 308619=One important factor that needs to be noted here is that for one generation, i.e., twenty years (1960 to 1980, i.e., till their eviction) no significant developmental activities were undertaken in the submergible areas since logically the whole area would be under water 'very soon'. The people of this region therefore had to do without electricity, proper roads, school buildings and other government asset building activities., 495224=Troupe' R.S. The Indian Forest Records. Vol. 5. Part 2. Calcutta, Government Press. 1913., 131043=The Chipko movement is the contemporary expression of a continuing heritage of peaceful resistance by the people of Uttarakhand. In the post-independence period, under the coordination of Sarala Behn, the Gandhians organised themselves into the Uttarakhand Sarvodaya Mandal in 1961. The Sarvodaya movement in the sixties was organised around four major issues:, 487531=Kothari, R. Footsteps into the Future. New York, The Free Press, 1974., 492205=Report of the National Commission of Agriculture, Part IV. New Delhi, Govern ment of India, 1976.}",
    "textBeforeTable": "Table - 5.5 Basic Information about the Sampled Villages Bagepalli Taluk 5.5 Baghepalh Taluk Figure 5.4 Kolar Taluk Figure 5.3 Baghepalh Taluk Figure 5.2 Malur Taluk Figure 5.1 Karnataka and Kolar District Information from individual households was collected with the help of a questionnaire. The important information sought through the questionnaire was related to the socio-economic background of the household, landownership status, land use pattern, domestic energy consumption, future land use programrnes, etc. Besides the data collected through the questionnaire, oral historical information on the type of land use in the past few decades, types of species of trees people need, the relationship of the village organisation with the forest department, etc., was also collected. The fieldwork for the study was carried out between December 1980-February 1981. This information was used to analyse the impact of social forestry in more efficient land utilisation from the point of view of satisfying the basic requirements of the village communities for forest products and the increased stabilisation of the village ecology and life-support systems. The study made certain observations that led to a national debate on the social desirability of the official social forestry programmes as practiced in Kolar. It was",
    "textAfterTable": "Table 5.4 Bask Information about the Samlped - Villages - Bangarpet Village Area (acres) Total Households Total Population Area for Cultivation (acres) Rainfed to the Nearest Town (km) Distance Balamande 3277 208 1263 916 19 Buchepalli 648 58 319 232 8 Gorvanahalli 217 11 79 206 4 Kadrenahalli 447 45 216 174 21 Nallur 445 82 522 248 14 Palmadgu 1526 187 746 438 22 Sunderpalya 683 242 1393 293 22 Table 5.5 Basic Information about the Sample Villages - Kolar Taluk Village Area (acres) Total Households Total Population Area for Cultivation (acres) Rainfed to the Nearest Town (km) Distance Abbani 964 128 348 205 13 Bennagur 1196",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}