{
    "relation": [
        [
            "PP",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Horse",
            "Fed Biz (KY)",
            "Jimmy Creed (KY)",
            "Drill (KY)",
            "The Lumber Guy (NY)",
            "Politicallycorrect (KY)",
            "Basmati (KY)",
            "Castaway (KY)",
            "Private Zone (ON)",
            "Guilt Trip (KY)",
            "Unbridled's Note (KY)"
        ],
        [
            "Jockey",
            "M E Smith",
            "G K Gomez",
            "M Garcia",
            "J R Velazquez",
            "J Rosario",
            "M Gutierrez",
            "J Talamo",
            "M A Pedroza",
            "R Bejarano",
            "C S Nakatani"
        ],
        [
            "Weight",
            "118",
            "118",
            "118",
            "123",
            "118",
            "118",
            "118",
            "120",
            "118",
            "118"
        ],
        [
            "Trainer",
            "B Baffert",
            "R E Mandella",
            "B Baffert",
            "N D Drysdale",
            "W A Ward",
            "D F O'Neill",
            "B Baffert",
            "D F O'Neill",
            "B Baffert",
            "S M Asmussen"
        ]
    ],
    "pageTitle": "Tough Test for The Lumber Guy in Malibu - America's Best Racing. The Jockey Club",
    "title": "",
    "url": "http://www.americasbestracing.net/en/the-latest/news-stories/2012/12/22/tough-test-for-the-lumber-guy-in-malibu/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00224-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 285205991,
    "recordOffset": 285190240,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14695=Jimmy Creed, hoping to rebound from his ninth-place finish in the BC Sprint, seems to be coming into the Malibu in good form with some strong works at Santa Anita. Trained by Hall of Famer Richard Mandella for Spendthrift Farm, the Distorted Humor   colt worked seven furlongs in an eye-catching 1:24 4/5 Dec. 19. Jimmy Creed was a close third in the Santa Anita Sprint Championship (gr. I) prior to the Breeder's Cup., 11183=The Lumber Guy, whose big effort in the Xpressbet Breeders' Cup Sprint (gr. I) last month produced a runner-up finish, heads a field of 10 sophomores for the $300,000 Malibu Stakes (gr. I) on opening day of the Santa Anita Park winter meet Dec. 26., 11764=The probable post time for the Malibu is 3:37 p.m. PST. The race is the first leg of Santa Anita's unique three-race Strub series for 3-year-olds turning 4., 15777=Kaleem Shah's Fed Biz, winner of the El Cajon at Del Mar Aug. 31, was a distant eighth in the Dirt MIle (gr. I). Though it wasn't evident last time, the Giant's Causeway   colt has shown plenty of speed in the past and may need to gun early from his rail post for Mike Smith., 15140=Drill, owned by Karl Watson, Mike Pegram, and Paul Weitman, is the most accomplished of the Baffert quartet though the Lawyer Ron colt has not been out since capturing the Laz Barrera Memorial (gr. III) over seven furlongs at Hollywood May 12. Drill is 3-for-3 at the Malibu distance, including his neck victory in the 2011 Del Mar Futurity (gr. I). The dark bay also won the San Vicente (gr. II) at seven panels in February at Santa Anita. Martin Garcia rides from post 3., 11937=The Lumber Guy is part of a field that includes Politicallycorrect, winner of the Damascus Stakes on the Breeders' Cup World Championships undercard Nov. 3, and Unbridled's Note, runner-up in the Breeders' Cup Turf Sprint (gr. IT). Hall of Fame trainer Bob Baffert has entered four, including grade I winner Drill., 16419=Gary and Mary West's Guilt Trip has won two of four starts since debuting in August and cuts back after a fifth in the 1 1/8-mile Discovery (gr. III) at Aqueduct Racetrack in his stakes debut Nov. 17., 17308=Dec. 26, Santa Anita Park, Race 8, 3:37 p.m. PST, 13126=The Lumber Guy entered the Sprint off a clear 1 1/4-length victory in the six-furlong Vosburgh Invitational Stakes (gr. I) as the slight favorite Sept. 29 at Belmont Park. In the only seven-furlong start of his career, The Lumber Guy rolled to a 4 1/4-length victory in the Miracle Wood Stakes in February at Laurel Park., 12627=Previously in the barn of Mike Hushion, the gray/roan son of Grand Slam has remained in Southern California since that start and is under the tutelage of Hall of Fame conditioner Neil Drysdale. The Lumber Guy has recorded five workouts on the Cushion Track at Betfair Hollywood Park since the Breeders' Cup, most recently posting a six-furlong move in 1:14 flat, handily, Dec. 20., 11448=The seven-furlong Malibu, race 8 on the card, follows the $300,000 La Brea Stakes (gr. I) for 3-year-old fillies, which is race 4 on the program, making the Malibu the final grade I event of 2012. Also on the program is the $150,000 Sir Beaufort Stakes (gr. III) for 3-year-olds at one mile on turf., 36833=Copyright © 2015 TJCMedia Ventures. Privacy | Terms and Conditions, 16735=Zillah Reddam's Basmati won his only start since the 2011 CashCall Futurity (gr. I), taking a seven-furlong allowance over the Santa Anita main track Nov. 2. Private Zone, owned by Good Friends Stable, nearly pirated the Vernon O. Underwood (gr. III) Dec. 2 before finishing second by one length to grade I winner Smiling Tiger. The former Panama-based Macho Uno   gelding was second to Politicallycorrect in the Damascus before that., 16079=Castaway, winner of the Southwest Stakes (gr. III) at Oaklawn Park last winter, has been away since a distant ninth-place finish in the Lexington Stakes (gr. III) at Keeneland in April. The Street Sense   colt, owned by Mrs. John Magnier, Michael Tabor, and Derrick Smith, makes his first start at seven furlongs.}",
    "textBeforeTable": "3-year-olds, 7 Furlongs Dec. 26, Santa Anita Park, Race 8, 3:37 p.m. PST $300,000 Malibu Stakes (G1)   Zillah Reddam's Basmati won his only start since the 2011 CashCall Futurity (gr. I), taking a seven-furlong allowance over the Santa Anita main track Nov. 2. Private Zone, owned by Good Friends Stable, nearly pirated the Vernon O. Underwood (gr. III) Dec. 2 before finishing second by one length to grade I winner Smiling Tiger. The former Panama-based Macho Uno   gelding was second to Politicallycorrect in the Damascus before that. Trainer Doug O'Neill has a pair in the Malibu and neither should be taken lightly. Gary and Mary West's Guilt Trip has won two of four starts since debuting in August and cuts back after a fifth in the 1 1/8-mile Discovery (gr. III) at Aqueduct Racetrack in his stakes debut Nov. 17. Castaway, winner of the Southwest Stakes (gr. III) at Oaklawn Park last winter, has been away since a distant ninth-place finish in the Lexington Stakes (gr. III) at Keeneland in April. The Street Sense   colt, owned by Mrs. John Magnier, Michael Tabor, and Derrick Smith, makes his first start at seven furlongs. Kaleem Shah's Fed Biz, winner of the El Cajon at Del Mar Aug. 31, was a distant eighth in the Dirt MIle (gr. I). Though it wasn't evident last time, the Giant's Causeway   colt has shown plenty of speed in the past and may need to gun early from his rail",
    "textAfterTable": "  Recent Stories more stories 07.29.2015 Del Mar: A Party for the Modern Sports Fan 07.29.2015 Getting to Know Talco 07.29.2015 Being Justin Zayat: American Pharoah's Biggest Fan 07.28.2015 Being Justin Zayat: American Pharoah Time in My Life 07.28.2015 Dance Smartly: Canada’s Champion Filly 07.28.2015 Breaking the Bank: Sizzling Start at Saratoga",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}