{
    "relation": [
        [
            "Citing Patent",
            "US7751254 *",
            "US7791945 *",
            "US7800946 *",
            "US7986561",
            "US8289777",
            "US8514638 *",
            "US20120213014 *",
            "CN101673327B"
        ],
        [
            "Filing date",
            "Jun 19, 2008",
            "Dec 31, 2007",
            "May 30, 2008",
            "Feb 19, 2009",
            "May 24, 2011",
            "Dec 11, 2011",
            "",
            "Jun 12, 2009"
        ],
        [
            "Publication date",
            "Jul 6, 2010",
            "Sep 7, 2010",
            "Sep 21, 2010",
            "Jul 26, 2011",
            "Oct 16, 2012",
            "Aug 20, 2013",
            "Aug 23, 2012",
            "Mar 27, 2013"
        ],
        [
            "Applicant",
            "Samsung Electronic Co., Ltd.",
            "Hynix Semiconductor Inc.",
            "Hynix Semiconductor Inc.",
            "Fujitsu Semiconductor Limited",
            "Fujitsu Semiconductor Limited",
            "Fujitsu Semiconductor Limited",
            "Fujitsu Semiconductor Limited",
            "上海宏力半导体制造有限公司"
        ],
        [
            "Title",
            "Method of programming non-volatile memory device",
            "Semiconductor memory device including apparatus for detecting threshold voltage",
            "Flash memory device and operating method thereof",
            "Semiconductor memory device",
            "Semiconductor memory device",
            "Write control circuit and semiconductor device",
            "Write control circuit and semiconductor device",
            "Electronic device"
        ]
    ],
    "pageTitle": "Patent US7002846 - Non-volatile semiconductor memory device with memory transistor - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7002846?dq=patent:6161142",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00268-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470406527,
    "recordOffset": 470380992,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although the present invention has been described and illustrated in detail, it is clearly understood that the same is by way of illustration and example only and is not to be taken by way of limitation, the spirit and scope of the present invention being limited only by the terms of the appended claims. In the third embodiment the memory transistor 1 control gate potential VG is increased by step voltage ΔV stepwise and the memory transistor 1 drain current ID is detected and when VG attains a reference potential and drain current ID also attains a reference current, drain current ID is responsively interrupted. A smaller peak value of drain current ID and a smaller current consumption can be achieved than when a fixed potential is applied to memory transistor 1 at a control gate, as conventional. Furthermore, memory transistor 1 can be prevented from having threshold voltage VT excessively increased. A reduced variation in threshold voltage VT can thus be achieved. When level shifter 56 outputs potential VPW having a level set higher by step voltage ΔV, the memory transistor 1 drain current ID again increases. Thereafter, this cycle is repeated. When the counter 50 count value C attains reference count value CR (or at time t1) comparator 57 outputs signal φ57 pulled from high to low and p channel MOS transistor 52 does not conduct and the write ends.",
    "textAfterTable": "Non-Patent Citations Reference 1 U.S. Appl. No. 10/660,789, filed Sep. 12, 2004, Nitta, et al., \"Nonvolatile Semiconductor Memory Device\". 2 U.S. Appl. No. 10/940,812, filed Sep. 15, 2004, Mitanl, et al., \"Non-Volatile Semiconductor Memory Device Allowing Efficient Programming Operation and Erasing Operation in Short Period of Time\". Referenced by Citing Patent Filing date Publication date Applicant Title US7751254 * Jun 19, 2008 Jul 6, 2010 Samsung Electronic Co., Ltd. Method of programming non-volatile memory device US7791945 * Dec 31, 2007 Sep 7, 2010 Hynix Semiconductor Inc. Semiconductor memory device including apparatus for detecting threshold voltage US7800946 * May 30, 2008 Sep 21, 2010 Hynix Semiconductor Inc. Flash memory device and operating method thereof US7986561 Feb 19, 2009 Jul 26, 2011 Fujitsu Semiconductor Limited Semiconductor",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}