{
    "relation": [
        [
            "Citing Patent",
            "US7561323",
            "US7719747",
            "US7733439",
            "US7848001",
            "US7933475",
            "US8004504",
            "US8045256",
            "US8054532",
            "US8072402 *",
            "US8416154",
            "US8422108",
            "US8670171"
        ],
        [
            "Filing date",
            "Jun 17, 2005",
            "Feb 25, 2008",
            "Apr 30, 2007",
            "May 11, 2006",
            "Aug 19, 2009",
            "Jun 17, 2005",
            "Dec 4, 2009",
            "Jun 14, 2010",
            "Aug 29, 2007",
            "Apr 8, 2011",
            "Dec 18, 2009",
            "Oct 18, 2010"
        ],
        [
            "Publication date",
            "Jul 14, 2009",
            "May 18, 2010",
            "Jun 8, 2010",
            "Dec 7, 2010",
            "Apr 26, 2011",
            "Aug 23, 2011",
            "Oct 25, 2011",
            "Nov 8, 2011",
            "Dec 6, 2011",
            "Apr 9, 2013",
            "Apr 16, 2013",
            "Mar 11, 2014"
        ],
        [
            "Applicant",
            "Idc, Llc",
            "Qualcomm Mems Technologies, Inc.",
            "Qualcomm Mems Technologies, Inc.",
            "Qualcomm Mems Technologies, Inc.",
            "Qualcomm Mems Technologies, Inc.",
            "Qualcomm Mems Technologies, Inc.",
            "Qualcomm Mems Technologies, Inc.",
            "Qualcomm Mems Technologies, Inc.",
            "Qualcomm Mems Technologies, Inc.",
            "Qualcomm Mems Technologies, Inc.",
            "Qualcomm Mems Technologies, Inc.",
            "Qualcomm Mems Technologies, Inc."
        ],
        [
            "Title",
            "Optical films for directing light towards active areas of displays",
            "Method and post structures for interferometric modulation",
            "Dual film light guide for illuminating displays",
            "Method and system for interferometric modulation in projection or peripheral devices",
            "Method and apparatus for providing back-lighting in a display device",
            "Reduced capacitance display element",
            "Method and device for compensating for color shift as a function of angle of view",
            "Method and device for providing illumination to interferometric modulators",
            "Interferometric optical modulator with broadband reflection characteristics",
            "Apparatus and method for reducing perceived color shift",
            "Method and device for modulating light with optical compensation",
            "Display having an embedded microlens array"
        ]
    ],
    "pageTitle": "Patent US7342705 - Spatial light modulator with integrated optical compensation structure - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7342705?dq=6188988",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00200-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471170823,
    "recordOffset": 471143285,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6407=The process illustrated in FIG. 8 continues at step 54 with the deposition of a planarization layer. The planarization layer or layers are typically polymers, e.g., polyimide, and may be deposited using known deposition and masking techniques. The deposition of a planarization layer is an optional, but is often preferred because it results in a suitable substrate for subsequent processing steps. The process illustrated in FIG. 8 continues at step 56 with the fabrication of individually addressable light-modulating elements (e.g., interferometric modulator elements) over the optical compensation structure and, if present, the planarization layer. Interferometric modulators are generally fabricated using thin film deposition processes, e.g., as described in U.S. Pat. Nos. 5,835,255 and 6,055,090, and in U.S. Patent Publication No. 2002/0126364 A1. A variation of this process, also illustrated in FIG. 8, involves the fabrication of an additional planarization layer at step 58, followed by the fabrication of an additional optical compensation structure at step 59. After fabrication at step 59, the fabrication process may return to steps 58, 59 for the fabrication of additional planarization layer(s) and optical compensation structure(s), or may proceed to steps 54, 56 for the fabrication of the planarization layer and individually addressable light-modulating elements. Those skilled in the art will understand that the process illustrated in FIG. 8 or variations thereof may be used to fabricate the spatial light modulators described herein, including without limitation the spatial light modulators illustrated in FIGS. 5-7. Means for modulating light transmitted through the transparent substrate include interferometric modulators and liquid crystal displays.}",
    "TableContextTimeStampAfterTable": "{34145=This application claims priority to U.S. Provisional Patent Application Ser. No. 60/541,607, filed Feb. 3, 2004; U.S. Provisional Patent Application Ser. No. 60/613,482, filed Sep. 27, 2004; U.S. Provisional Patent Application Ser. No. 60/613,536, filed Sep. 27, 2004; and U.S. Provisional Patent Application Ser. No. 60/613,542, filed Sep. 27, 2004; all of which are hereby incorporated by reference in their entireties., 47240=In general, an interferometric modulator which has either no voltage applied or some relatively steady state voltage, or bias voltage, applied is considered to be in a quiescent state and will reflect a particular color, a quiescent color. As referenced in U.S. Patent Publication No. 2002/0126364 A1, the quiescent color is determined by the thickness of the sacrificial spacer upon which the secondary mirror is fabricated.}",
    "textBeforeTable": "Patent Citations While the above detailed description has shown, described, and pointed out novel features of the invention as applied to various embodiments, it will be understood that various omissions, substitutions, and changes in the form and details of the device or process illustrated may be made by those skilled in the art without departing from the spirit of the invention. As will be recognized, the present invention may be embodied within a form that does not provide all of the features and benefits set forth herein, as some features may be used or practiced separately from others. is conducted after step 50 and prior to step 52). Optionally, a planarization layer may be fabricated over the over the individually addressable light-modulating elements, followed by fabrication of the optical compensation structure(s) over the planarization layer. FIG. 8 , except that the individually addressable light-modulating elements are fabricated over the substrate, followed by fabrication of the optical compensation structure(s) over the individually addressable light-modulating elements (e.g., step 56 in FIG. 8 ) may be fabricated by a process similar to that illustrated in FIG. 9 A spatial light modulator in which a light modulating element is arranged between a substrate and an optical compensation structure (such as that illustrated in , the light-modulating element 205 comprises an interferometric modulator, but other spatial light modulators may also be used. FIG. 9",
    "textAfterTable": "1 International Search Report of PCT Application No.: PCT/US2005/002986. Referenced by Citing Patent Filing date Publication date Applicant Title US7561323 Jun 17, 2005 Jul 14, 2009 Idc, Llc Optical films for directing light towards active areas of displays US7719747 Feb 25, 2008 May 18, 2010 Qualcomm Mems Technologies, Inc. Method and post structures for interferometric modulation US7733439 Apr 30, 2007 Jun 8, 2010 Qualcomm Mems Technologies, Inc. Dual film light guide for illuminating displays US7848001 May 11, 2006 Dec 7, 2010 Qualcomm Mems Technologies, Inc. Method and system for interferometric modulation in projection or peripheral devices US7933475 Aug 19, 2009 Apr 26, 2011 Qualcomm Mems Technologies, Inc. Method and apparatus for providing back-lighting in a display device US8004504 Jun 17, 2005 Aug 23, 2011 Qualcomm Mems Technologies, Inc. Reduced capacitance display element",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}