{
    "relation": [
        [
            "Date",
            "Sep 23, 1991",
            "Nov 2, 1995",
            "Nov 30, 1999",
            "May 7, 2000",
            "Jul 18, 2000"
        ],
        [
            "Code",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20000510"
        ]
    ],
    "pageTitle": "Patent US4743046 - Active vehicle suspension unit - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4743046?dq=5,987,610",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00096-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475757079,
    "recordOffset": 475734523,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28531=In the U.S. Pat. No. 4,154,461, May 15, 1979, a concept of a dual state shock absorber for a vehicle wheel is introduced.}",
    "textBeforeTable": "Patent Citations  TABLE IV______________________________________Modes related to COUNT.Counter below Counter abovecritical nc critical nc Remark______________________________________No action Transfer to The transfer to Mode 3 Mode 3, both may be optional. C1 and C2 Thus the driver may locked overrule the transfer by a manual command.______________________________________ The microprocessor unit would allow a large number of different combinations to connect road holding with ride comfort, braking or steering actions. Therefore the electronic unit may have several extra input ports relating the suspension to the braking or steering systems. The following Table IV demonstrates the basic scheme for the transfer from Mode 0, 1 or 2 to Mode 3: This flutter would occur typically at a natural frequency five times that of the car on its springs. The suppression of the wheel flutter is of course desirable in order to improve the road holding of the car. We may thus introduce still another Mode 3, with both check valves C1, C2 in a locked position. Mode 3 is equal to Mode 0 for Embodiment II, but it is convenient to consider Mode 3 as a separate mode depending on the number nc of pulses counted in a given short time interval, \"COUNT\", which is tuned individually for any given vehicle model. The acceleration sensor of Embodiment II or the pulse counter of Embodiment I would either one enable the electronic unit to recognize the occurrence of wheel flutter.",
    "textAfterTable": "GB1450441A * Title not available GB1485003A * Title not available GB2135020A * Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4909536 * Oct 24, 1988 Mar 20, 1990 Monroe Auto Equipment Electronic height sensor US4962946 * Apr 7, 1989 Oct 16, 1990 Group Lotus P/C Suspension unit for active suspension system US5007659 * Mar 7, 1990 Apr 16, 1991 Monroe Auto Equipment Company Internal damping force sensor US5016908 * Mar 13, 1989 May 21, 1991 Monroe Auto Equipment Company Method and apparatus",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}