{
    "relation": [
        [
            "Cited Patent",
            "US4380798 *",
            "US4393459 *",
            "US4574350 *",
            "US4594657 *",
            "US4665484 *",
            "US4780822 *",
            "US4847754 *",
            "US4903218 *",
            "US4928222 *",
            "US4928247 *",
            "US4949248 *",
            "US4965718 *",
            "US4975833 *",
            "US5081702 *",
            "US5129085 *",
            "US5129089 *",
            "US5142676 *",
            "US5155499 *",
            "US5167028 *",
            "US5265203 *",
            "US5291608 *",
            "EP0049158A2 *",
            "EP0442717A2 *"
        ],
        [
            "Filing date",
            "Sep 15, 1980",
            "Jul 17, 1980",
            "May 19, 1982",
            "Apr 22, 1983",
            "Nov 14, 1984",
            "Sep 17, 1986",
            "Oct 15, 1985",
            "Aug 13, 1987",
            "Oct 31, 1988",
            "Apr 20, 1988",
            "Jul 15, 1988",
            "Sep 29, 1988",
            "Nov 8, 1989",
            "Mar 9, 1989",
            "Mar 3, 1989",
            "Oct 3, 1991",
            "Dec 28, 1988",
            "May 7, 1990",
            "Nov 13, 1989",
            "Sep 14, 1990",
            "Nov 10, 1992",
            "Sep 29, 1981",
            "Feb 13, 1991"
        ],
        [
            "Publication date",
            "Apr 19, 1983",
            "Jul 12, 1983",
            "Mar 4, 1986",
            "Jun 10, 1986",
            "May 12, 1987",
            "Oct 25, 1988",
            "Jul 11, 1989",
            "Feb 20, 1990",
            "May 22, 1990",
            "May 22, 1990",
            "Aug 14, 1990",
            "Oct 23, 1990",
            "Dec 4, 1990",
            "Jan 14, 1992",
            "Jul 7, 1992",
            "Jul 7, 1992",
            "Aug 25, 1992",
            "Oct 13, 1992",
            "Nov 24, 1992",
            "Nov 23, 1993",
            "Mar 1, 1994",
            "Apr 7, 1982",
            "Aug 21, 1991"
        ],
        [
            "Applicant",
            "Motorola, Inc.",
            "International Business Machines Corp.",
            "At&T Bell Laboratories",
            "Motorola, Inc.",
            "Nec Corporation",
            "Integrated Device Technology, Inc.",
            "International Business Machines Corporation",
            "Digital Equipment Corporation",
            "International Business Machines Corporation",
            "Digital Equipment Corporation",
            "Caro Marshall A",
            "International Business Machines Corporation",
            "Fujitsu Limited",
            "Allied-Signal Inc.",
            "Mitsubishi Denki Kabushiki Kaisha",
            "Digital Equipment Corporation",
            "Gte Laboratories Incorporated",
            "Tektronix, Inc.",
            "Lucid Corporation",
            "Hughes Aircraft Company",
            "International Business Machines Corporation",
            "Honeywell Bull Inc.",
            "International Business Machines Corporation"
        ],
        [
            "Title",
            "Semaphore register including ownership bits",
            "Status reporting with ancillary data",
            "Shared resource locking apparatus",
            "Semaphore for memory shared by two asynchronous microcomputers",
            "Shared memory multiprocessing system & method",
            "Semaphore circuit for shared memory cells",
            "Extended atomic operations",
            "Console emulation for a graphics workstation",
            "Enhanced semaphore architecture",
            "Method and apparatus for the continuous and asynchronous traversal and processing of graphics data structures",
            "System for shared remote access of multiple application programs executing in one or more computers",
            "Data processing system incorporating a memory resident directive for synchronizing multiple tasks among plurality of processing elements by monitoring alternation of semaphore data",
            "Multiprocessor system which only allows alternately accessing to shared memory upon receiving read and write request signals",
            "Method and apparatus for processing more than one high speed signal through a single high speed input terminal of a microcontroller",
            "Computer network with shared memory using bit maps including flags to indicate reserved memory areas and task status",
            "Distributed interlock apparatus and distributed interlock management method",
            "Separate content addressable memories for storing locked segment addresses and locking processor identifications for controlling access to shared memory",
            "Image-edge-printing controller",
            "System for controlling task operation of slave processor by switching access to shared memory banks by master processor",
            "Hardware multiprocess scheduler in a graphics rendering processor",
            "Display adapter event handler with rendering context manager",
            "I/O data processing system",
            "Control of peripherals in a multitasking system"
        ]
    ],
    "pageTitle": "Patent US5440746 - System and method for synchronizing processors in a parallel processing ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5440746?dq=5,781,788",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473313903,
    "recordOffset": 473286772,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While various embodiments of the present invention have been described above, it should be understood that they have been presented by way of example only, and not limitation. Thus, the breadth and scope of the present invention should not be limited by any of the above-described exemplary embodiments, but should be defined only in accordance with the following claims and their equivalents. 3. Conclusion Additionally, since host processor only has to read signal location 316 (once initialized) and slave peripheral processor 308 only has to write to signal location 316, both processors can continue to handle interrupts throughout execution. According to the invention, neither continuous polling nor uninterrupted read-modify-write capabilities are required. Since host processor 306 does not begin polling until after the two conditions of step 410 are met, host processor 306 does not waste valuable time polling signal location 316 needlessly. In a step 416, in the next polling operation, host processor 306 determines that pixmap 310 is free for other uses. In a step 414, slave peripheral processor 308 completes its operation and loads signal location 316 with the specified value. In a step 412, after step 410, host processor 306 begins polling signal location 316. The polling is done at regular periodic intervals. Host processor 306 is polling to determine whether signal location 316 contains the specified value (i.e. to determine whether slave peripheral processor 308 no longer needs pixmap 310). Note",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5526524 * Dec 23, 1993 Jun 11, 1996 International Business Machines Corporation Method and system for management of locked objects in a computer supported cooperative work environment US5560018 * Dec 16, 1994 Sep 24, 1996 International Business Machines Corporation Providing external interrupt serialization compatibility in a multiprocessing environment for software written to run in a uniprocessor environment US5623659 * Jun 7, 1995 Apr 22, 1997 International Business Machines Corporation Parent/child subset locking scheme for versioned objects US5623670 * Feb 17, 1995 Apr 22, 1997 Lucent Technologies Inc. Method and apparatus for crash safe enforcement of mutually exclusive access to shared resources in a multitasking computer system US5673380 * Sep 3, 1996 Sep 30, 1997 Fujitsu Limited Parallel processing of calculation processor and display processor",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}