{
    "relation": [
        [
            "Date",
            "Oct 4, 2001",
            "Jul 31, 2003",
            "Sep 18, 2006",
            "Sep 20, 2010",
            "Sep 17, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6535132 - Targeted information display - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6535132?dq=4052565",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00004-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480669227,
    "recordOffset": 480646952,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{37756=It is known to display on an HTML display terminal a user's display page when the user approaches the terminal—see the paper “Location Aware Mobile Computing”, H. W. Peter Beadle, B. Harper, G. Q. Maguire, J. Judge; Proc. IEEE/IEE International Conference on Telecommunications, (ICT'97), Melbourne, April, 1997. It is also known to push promotions concerning particular shops to the mobile devices of users who are detected as being near the shops and have a profile indicating that they are likely to be interested.}",
    "textBeforeTable": "Patent Citations the display is a cinema or stadium screen, the presence zone being inside the cinema or stadium (for example, in the entry areas). the display is located in a transport vehicle or craft, the presence zone being located at a transportation terminal from where the transport vehicle or craft is to leave—in this case, the terminal informs the transport vehicle or craft as to what content is appropriate; the display is located at a transportation terminal, the presence zone being located in a transport vehicle (including a train) or craft (including an aircraft) destined for the transportation terminal—in this case, the display would display relevant content for the arriving passengers, the display being informed by the transportation vehicle or craft as to what content was appropriate; The examples given in the foregoing paragraph relate to persons that belong to less dynamically changing groups than the passers-by transiting the presence zone 15 of FIG. 1. Where the composition of a group remains static for a substantial period, then the processes for detecting group members can be simplified and can, for example, simply note joiners to a particular group rather than having to add and remove persons on an on-going basis. Examples of application of the embodiments of the invention to such static groups include the following situations: Further examples include having a presence zone at a fixed location such as a busy street corner and the display",
    "textAfterTable": "US6283377 * Feb 4, 1998 Sep 4, 2001 Toshinori Takuma IC card for accumulating degree of interest and system for accumulating degree of interest using such card EP0848564A2 Jul 2, 1997 Jun 17, 1998 Robert Bosch Gmbh Method for transmitting local informations to a mobile transceiver EP0971303A2 Feb 5, 1999 Jan 12, 2000 Fujitsu Limited Electronic information display and electronic shopping system GB971303A * Title not available JPH1013961A Title not available * Cited by examiner Non-Patent Citations Reference 1 Beadle, H.W.P., Harper, BB., Maquire Jr., G.Q. and Judge, J., \"Location Aware Mobile Computing,\" Proc. IEEE/IEE Internat'l Conference on Telecommunications (ICT'97), Melbourne (Apr. 1997). Referenced by Citing Patent Filing date Publication",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}