{
    "relation": [
        [
            "Date",
            "Jan 4, 1995",
            "Jun 19, 2002",
            "Jul 9, 2002",
            "May 17, 2006",
            "Sep 15, 2006",
            "Sep 21, 2006",
            "Mar 29, 2010",
            "Nov 16, 2012"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "FPAY",
            "AS",
            "AS",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: RADIO SYSTEMS CORPORATION, TENNESSEE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:BOARDMAN, ALLEN H.;REEL/FRAME:007316/0276 Effective date: 19950104",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "Owner name: RADIO SYSTEMS CORPORATION,TENNESSEE Free format text: MERGER;ASSIGNOR:RADIO SYSTEMS CORPORATION;REEL/FRAME:018247/0993 Effective date: 20060914",
            "Owner name: FIFTH THIRD BANK, AS ADMINISTRATIVE AGENT,OHIO Free format text: SECURITY INTEREST;ASSIGNOR:RADIO SYSTEMS CORPORATION;REEL/FRAME:018296/0038 Effective date: 20060915",
            "Year of fee payment: 12",
            "Owner name: THE BANK OF NEW YORK MELLON TRUST COMPANY, N.A., F Free format text: SECURITY AGREEMENT;ASSIGNORS:RADIO SYSTEMS CORPORATION;INNOTEK, INC.;INVISIBLE FENCE, INC.;REEL/FRAME:029308/0434 Effective date: 20121023 Owner name: THE BANK OF NEW YORK MELLON TRUST COMPANY, N.A., F Free format text: SECURITY AGREEMENT;ASSIGNORS:RADIO SYSTEMS CORPORATION;INNOTEK, INC.;INVISIBLE FENCE, INC.;REEL/FRAME:029308/0001 Effective date: 20121023"
        ]
    ],
    "pageTitle": "Patent US5852403 - Wireless pet containment system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5852403?dq=amazon.com",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00045-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 488968875,
    "recordOffset": 488945584,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33171=The present application is a continuation-in-part of U.S. Ser. No. 216,691, filed Mar. 23, 1994, now U.S. Pat. No. 5,381,129 issued Jan. 10, 1995, which is incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations Having thus described various preferred embodiments of the invention and several of its benefits and advantages, it will be understood by those of ordinary skill that the foregoing description is merely for the purpose of illustration and that numerous substitutions, rearrangements and modifications may be made in the invention without departing from the scope and spirit of the appended claims. Thus, it can be seen from the foregoing, that the present invention provides a pet containment system which restrains the pet to a particular area without the necessity of wires being buried or being left exposed. In addition, the present system requires little power on the part of the receiver and thus can utilize standard batteries for power. If the pet goes further, into the shock area 22, the signal detected signal 98 will have degraded to the point where it will no longer be discernible. Therefore, the phase detector 104 will generate a logical false value to the decision circuitry 112. In addition, the signal strength comparator 118 will still produce an indication that the strength detected signal 100 is below that of the comparator reference 120. Therefore, the decision circuitry 112 will generate a signal to the control device 124 which will produce a control signal such as a shock from electrodes in the collar/receiver 16. Thus, a pet 14 will be signaled that it is in a shock area 22 no matter how",
    "textAfterTable": "US6431122 Nov 21, 2000 Aug 13, 2002 Innotek, Inc. Wireless confinement and training system for an animal US6445774 * Nov 17, 1997 Sep 3, 2002 Mci Communications Corporation System for automated workflow in a network management and operations system US6456668 Dec 31, 1996 Sep 24, 2002 Lucent Technologies Inc. QPSK modulated backscatter system US6575120 * Sep 11, 2000 Jun 10, 2003 Dogwatch Inc. Animal control system US6825768 * Jun 12, 2002 Nov 30, 2004 Dogwatch, Inc. Adaptive pet containment system and method US7656291 Feb 1, 2007 Feb 2, 2010 Radio Systems Corporation System and method for determining proximity to a wireless boundary of programmable shape used in animal containment US7918190 * Jan 17, 2007 Apr 5, 2011 Radio Systems Corporation Electronic animal containment system with direction of approach determination US8438999 Sep 10, 2010 May 14,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}