{
    "relation": [
        [
            "Date",
            "Jul 8, 1998",
            "Apr 26, 2006",
            "Apr 22, 2010",
            "Dec 13, 2010",
            "Oct 2, 2012",
            "Apr 24, 2014",
            "Nov 27, 2014"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: MOTOROLA, INC., ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:GUTMAN, JOSE;BRAXTON, THOMAS RAY;REEL/FRAME:009307/0908 Effective date: 19980702",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: MOTOROLA MOBILITY, INC, ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MOTOROLA, INC;REEL/FRAME:025673/0558 Effective date: 20100731",
            "Owner name: MOTOROLA MOBILITY LLC, ILLINOIS Free format text: CHANGE OF NAME;ASSIGNOR:MOTOROLA MOBILITY, INC.;REEL/FRAME:029216/0282 Effective date: 20120622",
            "Year of fee payment: 12",
            "Owner name: GOOGLE TECHNOLOGY HOLDINGS LLC, CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MOTOROLA MOBILITY LLC;REEL/FRAME:034489/0001 Effective date: 20141028"
        ]
    ],
    "pageTitle": "Patent US6480096 - Method and apparatus for theft deterrence and secure data retrieval in a ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6480096?dq=oakley+5,387,949&ei=4yI4T8nkLYa80QG0xqnWAg",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00332-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474206339,
    "recordOffset": 474178532,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The above description is intended by way of example only and is not intended to limit the present invention in any way except as set forth in the following claims. Referring to FIG. 4, a method 80 of remotely recovering existing data from a host data device coupled to a two-way wireless communication device is shown. The method preferably comprises the steps of operating the host data device and the two-way wireless communication device in a secure mode at step 84 upon detection of unauthorized use by an unauthorized user at step 82, wherein the secure mode operates transparent to the unauthorized user allowing the unauthorized user to use portions of the host device and the two-way wireless device in a normal fashion at step 88 while locking out portions of the host data device and the two-way wireless device at step 86. Optionally, received message data is stored to secure memory at step 87. Then, at step 90, a stealth code is transmitted followed by at least a portion of the existing data to a central station. The data is preferably transmitted securely such as by encrypting the data before transmission. This can be achieved during a normal transmission initiated by the unauthorized user or alternatively the two-way wireless device can initiate these transmissions at the earliest opportunity while avoiding being detected by the unauthorized user. The method 80 may also include the step 92",
    "textAfterTable": "Apr 11, 2006 Diebold, Incorporated Automated banking machine system and method US7150393 Jul 14, 2004 Dec 19, 2006 Diebold, Incorporated Automated banking machine system and method US7152072 * Jan 8, 2003 Dec 19, 2006 Fisher-Rosemount Systems Inc. Methods and apparatus for importing device data into a database system used in a process plant US7182254 * Sep 25, 2003 Feb 27, 2007 Mquay Inc. Virtual card service system and method US7200220 * Mar 16, 2000 Apr 3, 2007 Fujitsu Limited Portable telephone maintenance service system and maintenance service method US7205882 * Nov 10, 2004 Apr 17, 2007 Corestreet, Ltd. Actuating a security system using a wireless device US7310734 * Feb 1, 2001 Dec 18, 2007 3M Innovative Properties Company Method and system for securing a computer network and personal identification device used therein for controlling access to network components US7445146",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}