{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,138 topics 2,125,470 replies",
            "85,560 topics 1,153,986 replies",
            "1,071 topics 11,072 replies",
            "4,218 topics 64,766 replies",
            "5,996 topics 75,818 replies",
            "50,552 topics 466,256 replies",
            "22,767 topics 196,320 replies",
            "4,274 topics 60,497 replies",
            "1,127 topics 8,220 replies",
            "3,606 topics 115,594 replies"
        ],
        [
            "Last Post Info",
            "Story Mode DLC discussion t... By Choco Taco 2 minutes ago",
            "Reasons why GTA IV is bette... By Militia 19 minutes ago",
            "6 Star Wanted Level Survival? By Militia 2 hours ago",
            "The Ultimate 100% Save File... By Militia An hour ago",
            "Things that can be done at... By Militia 2 hours ago",
            "PS2 vs PC car handling diff... By OG Viking A minute ago",
            "Reasons why Vice City is be... By Twin Turbo An hour ago",
            "Grand Theft Auto III Chain... By TubewayArmy 6 minutes ago",
            "What are the cops actually... By Jeansowaty 6 hours ago",
            "Official GTA Wishlist Topic By freaklore1 A minute ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=95&t=506585&p=1061237550",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00288-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 113418099,
    "recordOffset": 113393778,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16740=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 9288=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 12610=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 118636=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 18896=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 14328=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 47836=Loves GTA, GTAKid667, Bing, fabio3, Nick1020, Phoenix_Poop, Nightmare3883, Google, Yahoo, s2n vaniish, VikDarkbomb, TexasRocks, OG Viking, DeucesR, Xing of Virtue, conopida, Edmachine, m3tal z_DKI, Twin Turbo, freaklore1, nmk111, Fozzie_420, Pavle, Omoplataha, D.A., Electrogypsy, Mister P, Captain Sensib1e, Pyro_Indigo, deegrand323, kulomet333, epoxi, Invalid BigRoN, Skeve613, Hjaere, GunTotinHippie, Jebfive, Jaanus949, Bender.ㅤ, Ryan_Codebreaker, LONEW3LF, BeckermannDewitt, Cnosi, The Lone Wanderer, Nuclearsniper, HorrA1985, H0WITZER, Epic., Icantthinkofonew, Kingorion88, FiS!!HeR, TheAcidicModder, AlphaSierra-1196, GoodTimesAhead, TheMcSame, HeavyDuke, Eram, ErMerGerd, Braulioaej, Officer Vic, Crypain, Sea Bear, JASONBRODYSONOFRAMBO, Mr. Jago, uncaged, jimmy8309, marshallbslayer, Nez Man, -jr-, Retired Mafia, ten-a-penny, saintsrow, shivix, iLikeDrivinInMyTruck, SirBurka_, Google Mobile, Slasherr, YaDoesntHaveToCallMeRay, ermaccer, doubleg213, Steelad77, trevorjc2511, SomeDBKid, GTAandStuff, Bane X01, Midnight Hitman, gavin-xx, Quarthon, stretchx9, TDWP_Adam, universetwisters, MarshalMoo, Econobrick, Warablo, Rookie1996, Lil Kenzo, marhex, Heisenberg_GR, MGgames100, HarveyVercetti, dice, jakematos2, nikk_ho, MaazS, H4rdPwn3r1337, Peiva's Laahdin, JCX1992, GTA@ddict13, QuietStates, deadx23, gtasadude, hornedturtle, josephene123, Tycek, Sneakerhead., Crackhead_Ben, Scuba 21, svanderman, That1oneguy, AtomicSoviet, FicZGB, Netman005, SuperGTFan, Claptrap NL, gelou307, Pyroshox, manitouscott, TBONE1138, Googlebot-Mobile, evinaz, CrysisAverted, RockstarsPlayer, GeneralSteve93, CaptainMarvel, SpreeMurder, Smooth Longsack, Triton460, muffintopers, RayB_ThrowaStack, Yus, rubenscpu, Shadowfennekin, MrKush, Thousand Accent, Leonazix, Jon3s, TwisterVictor1, SteveNYC, Major Seven, Summertime, ChickenAndBeer, Nem Wan, Day Reaper, FlexPiTo, ShockwaveKSP, theminted, del__cielo, Beckerbrasil, MikeyDLuffy, gpcguy1, hannerfall, gizz01, Daequil, GipsyDanger MK2, Foreverpast, Flight180Victm, Cognoscenti, abrandnewheart, cswood, Jinx., silentkiller44, xInfamousRYANx, TheBaronOfHell, Kromix, wh1t31v3y, gtafan26, TubewayArmy, SchoolOfHardKnocks, Beastly40, josehatesyou, Voit Turyv, Vinewood Villain, Sonsalt, NightTrainCaine, AUScowboy, olegfadeev, Don Johan, Respect2, CartmanKusanagi, Total Failure, Lewisb36, keegan44582, Xenome13, r.lorenzo13, funmw2, joe grizzly, Nattyiyaman, iKarimster, A.O.D.88, HM128, ice_phoenix_66, 7 day survivor, slowburn29, Lc gta, whywontyoulisten, WinkingSkeever6, Grizzly322, SeekingAsylum, Gantons Most Wanted, thepolishpackage, dkluin, DaveGrimes96, flcon02, MitchMaljers, Halal Cyborg, GVJLIMA, robban, zSaintX, longhurstgb, Kal74, BoDuken, SuperHydracid, Starpaul20, BLACK DYNAM1TE, Choco Taco, MrBossFTW, fkikokikogta, TheSteppinRazor, Sveittjpong, Tossin Salad, Jestic, EF2000, marmoo, Alexa, Vega LVI, WhyDoINeedAName, Yan22, BlackMilk, thebrianmo, Blind and Mute, Marcus101RR, Imhotep1337, *MURDOC*, AK47IZI, CaptianBackwoods, Kajjy, zzClockwerkzz, Nenzo, tdavies457, mobe, HunterGatherer, LeopardGecko, xBoomZx, Jahgee, Wheatley, drr26, Opzeker, LukeyDukey1988, TI4G8, pat_worboys, iamcornholio, Turan, Daemian, brownbmxar, killstreakmx, Ermacs, Cripto136, Hickey1995, Luke juh, Cyper, NSXv6, 21036=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By H0WITZER Andolini Mafia Family 613,734 replies 15,207 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By ten-a-penny Would You Rather : GTA Onli... 2,285,894 replies 113,504 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,474 topics 416,676 replies GTA5 withSIX is coming! By Sonsalt 26 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}