{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,166 topics 2,126,479 replies",
            "85,563 topics 1,154,157 replies",
            "1,071 topics 11,074 replies",
            "4,218 topics 64,769 replies",
            "5,996 topics 75,831 replies",
            "50,554 topics 466,327 replies",
            "22,767 topics 196,342 replies",
            "4,275 topics 60,533 replies",
            "1,127 topics 8,222 replies",
            "3,611 topics 115,822 replies"
        ],
        [
            "Last Post Info",
            "How to make Steam not show... By SlaveZer0 2 minutes ago",
            "The Liberty City appreciati... By Militia An hour ago",
            "6 Star Wanted Level Survival? By Militia An hour ago",
            "Which Vehicle Do You Prefer? By PhillBellic 7 hours ago",
            "Was LCS as good as other GTAs? By Militia 12 minutes ago",
            "The Chain Game V2 110th Rou... By DREVIL919 24 minutes ago",
            "Reasons why Vice City is be... By skyfamster 4 hours ago",
            "How to pronounce his name. By Legomanarthur 6 minutes ago",
            "The incredible Arachnid By Cerium A day ago",
            "Lets play a game of \"Wo... By svanderman A minute ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=62&t=562142&p=1062678249",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00296-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 108024795,
    "recordOffset": 108003074,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{59632=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 20850=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12614=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9304=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 16550=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 18716=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 14165=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 19 minutes ago By NikkoCharger The Duping Crew 614,223 replies 15,207 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By ten-a-penny [GTAO] The Official B*tch... 2,289,369 replies 113,611 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,498 topics 416,776 replies Call Police/Fire Department... By leftas 11 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}