{
    "relation": [
        [
            "Allied power",
            "Australia",
            "Belgium",
            "Canada",
            "France",
            "Greece",
            "India",
            "Italy",
            "Japan",
            "Monaco",
            "Montenegro",
            "Nepal",
            "New Zealand",
            "Portugal",
            "Romania",
            "Russia",
            "Serbia",
            "Siam",
            "South Africa",
            "United Kingdom",
            "United States",
            "Total"
        ],
        [
            "Mobilized personnel",
            "412,9531",
            "267,0003",
            "628,9641",
            "8,410,0003",
            "230,0003",
            "1,440,4371",
            "5,615,0003",
            "800,0003",
            "80[34]",
            "50,0003",
            "200,000[35]",
            "128,5251",
            "100,0003",
            "750,0003",
            "12,000,0003",
            "707,3433",
            "1,2842",
            "136,0701",
            "6,211,9222",
            "4,355,0003",
            "42,244,409"
        ],
        [
            "Killed in action",
            "61,928[26]",
            "38,172[27]",
            "64,944[28]",
            "1,397,800[29]",
            "26,000[30]",
            "74,187[31]",
            "651,010[32]",
            "415[33]",
            "8[34]",
            "3,000",
            "30,670",
            "18,050[36]",
            "7,222[37]",
            "250,000[38]",
            "1,811,000[39]",
            "275,000[40]",
            "19",
            "9,463[41]",
            "886,342[42]",
            "116,708[43]",
            "5,741,389"
        ],
        [
            "Wounded in action",
            "152,171",
            "44,686",
            "149,732",
            "4,266,000",
            "21,000",
            "69,214",
            "953,886",
            "907",
            "0",
            "10,000",
            "21,009",
            "41,317",
            "13,751",
            "120,000",
            "4,950,000",
            "133,148",
            "0",
            "12,029",
            "1,665,749",
            "205,690",
            "12,925,833"
        ],
        [
            "Total casualties",
            "214,099",
            "82,858",
            "214,676",
            "5,663,800",
            "47,000",
            "143,401",
            "1,604,896",
            "1,322",
            "8[34]",
            "13,000",
            "49,823",
            "59,367",
            "20,973",
            "370,000",
            "6,761,000",
            "408,148",
            "19",
            "21,492",
            "2,552,091",
            "322,398",
            "18,744,547"
        ],
        [
            "Casualties as % of total mobilized",
            "52%",
            "31%",
            "34%",
            "67%",
            "20%",
            "10%",
            "29%",
            "<1%",
            "10%",
            "26%",
            "25%",
            "46%",
            "21%",
            "49%",
            "56%",
            "58%",
            "2%",
            "16%",
            "41%",
            "7%",
            "49%"
        ]
    ],
    "pageTitle": "Allies of World War I - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Allies_(World_War_I)",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00208-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 859645047,
    "recordOffset": 859584036,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5366=On 23 May 1915, Italy entered the war on the Entente side and declared war on Austria; previously, Italy had been a member of the Triple Alliance but had remained neutral since the beginning of the conflict. In 1916, Montenegro capitulated and left the Entente, and two nations joined, Portugal and Romania.[citation needed], 22925=The United States of America declared war on Germany in 1917 on the grounds that Germany had violated U.S. neutrality by attacking international shipping and because of the Zimmermann Telegram sent to Mexico.[4] The U.S. entered the war as an \"associated power\", rather than as a formal ally of France and the United Kingdom, in order to avoid \"foreign entanglements\".[5] Although the Ottoman Empire and Bulgaria severed relations with the United States, neither declared war on her.[6], 7410=The war began with the Austrian attack invasion of Serbia on 28 July 1914, in response to the assassination of Archduke Franz Ferdinand. The Austrian Empire followed with an attack on the Serbian ally Montenegro on 8 August.[citation needed] On the Western Front, the two neutral States of Belgium and Luxembourg were immediately occupied by German troops as part of the German Schlieffen Plan., 25069=The members of the Triple Entente were the French Republic, the British Empire and the Russian Empire; Italy ended its alliance with the Central Powers and entered the war on the side of the Entente in 1915. Japan was another important member. Belgium, Serbia, Greece, Montenegro, and Romania[1] were secondary members of the Entente.[2], 23729=The 1920 Treaty of Sèvres defines as the Principal Allied Powers: British Empire, French, Italy and Japan. The Allied Powers comprised - together with the Principal Allied Powers - Armenia, Belgium, Greece, Hejaz, Poland, Portugal, Romania, Serb-Croat-Slovene state and Czechoslovakia.[3], 20766=From early 1917 the BWC was superseded by the Imperial War Cabinet, which had Dominion representation. The Australian Corps and Canadian Corps were placed for the first time under the command of Australian and Canadian Lieutenant Generals John Monash and Arthur Currie,[7] respectively, who reported in turn to British generals.[citation needed] In April 1918 operational control of all Entente forces on the Western Front passed to the new supreme commander, Ferdinand Foch., 6456=Of the two Low Countries involved in the war, Luxembourg chose to capitulate, and was viewed as a collaborationist state by the Entente powers: Luxembourg never became part of the Allies, and only narrowly avoided Belgium's efforts of annexation, at the conclusion of hostilities in 1919. On 23 August Japan joined the Entente, which then counted seven members.[citation needed]. The entrance of the British Empire brought Nepal into the war., 19397=The only countries represented in the 1918 armistice which ended combat on the Western Front[8] were Britain, France and Germany., 4306=On 6 April 1917 the United States and its American allies entered the war. Liberia, Siam and Greece also became allies. After the October Revolution, Russia left the alliance and ended formal involvement in the war, by the signing of the treaty of Brest Litovsk in November effectively creating a separate peace with the Central Powers. This was followed by Romanian cessation of hostilities, however the Balkan State declared war on Central Powers again on 10 November 1918. The Russian withdrawal allowed for the final structure of the alliance, which was based on five Great Powers:}",
    "TableContextTimeStampAfterTable": "{22582=Australia and New Zealand were two autonomous dominions of the UK in Oceania during the war. Australia had become an independent nation state in 1901. Having strong cultural ties with the United Kingdom, declared war on Germany on 4 August 1914., 32350=Italy had been a member of the Triple Alliance alongside Germany and Austria-Hungary since the 1880s, however the Triple Alliance stipulated that all parties must be consulted in the event of one country engaging in war and Italy was not informed of this.[21] As such Italy claimed that it was not obligated to join their war effort.[21] Italy's relations with Germany and Austria-Hungary in contrast to the Allies were additionally affected by the fact that in 1913, Britain supplied Italy with 90 percent of its annual imports of coal.[21] The war effort of the Central Powers meant that Germany and Austria-Hungary were using their coal supplies for the war, and little was available to be exported to Italy.[21] Italy initially attempted to pursue neutrality from 1914 to 1915.[21], 38024=Montenegro had very close cultural and political connections with Serbia and had cooperated with Serbia in the Balkan Wars of 1912–1913. Montenegro joined the war against Austria-Hungary., 44002=The United States declared war on Germany in 1917 on the grounds that Germany violated U.S. neutrality by attacking international shipping with its unrestricted submarine warfare campaign.[4] The remotely connected Zimmermann Telegram of the same period, within which the Germans promised to help Mexico regain some of its territory lost to the U.S nearly eight decades before, was also a contributing factor. The U.S. entered the war as an \"associated power,\" rather than a formal ally of France and the United Kingdom, in order to avoid \"foreign entanglements.\"[5] Although the Ottoman Empire and Bulgaria severed relations with the United States, neither declared war.[6], 25916=Following a raid by Ottoman warships on the Russian port of Odessa, Russia declared war on the Ottoman Empire in November 1914.[18], 115323=These are estimates of the cumulative number of different personnel in uniform 1914–1918, including army, navy and auxiliary forces. At any one time, the various forces were much smaller. Only a fraction of them were frontline combat troops. The numbers do not reflect the length of time each country was involved. (See also: World War I casualties.), 16488=In response to Germany's invasion of neutral Belgium, the United Kingdom declared war on Germany on 4 August 1914.[16] The British Empire held several semi-autonomous dominions that were automatically brought into the war effort as a result of the British declaration of war, including Australia, Canada, New Zealand, Newfoundland, and South Africa., 41058=During the war, Serbia justified the war as being the result of Austro-Hungarian imperialism towards Serbs and South Slavs, Serbia cooperated with Yugoslavists including the Yugoslav Committee who sought pan-South-Slav unification, particularly through liberating South Slavs from Austria-Hungary. In the Corfu Declaration in 1917, the Serbian government officially declared its intention to form a state of Yugoslavia., 24419=In response to Austria-Hungary's invasion of Serbia in 1914, Russian government officials denounced the Austro-Hungarian invasion as an \"ignoble war\" on a \"weak country\".[17] Russian government official Nikolaĭ N. Shebeko stated: \"the attack on Serbia by a powerful empire such as Austria, supposedly in order to defend its existence, cannot be understood by anyone in my country; it has been considered simply as a means of delivering a death-blow to Serbia.\"[17] Russia held close diplomatic relations with Serbia, and Russian foreign minister Sergey Sazonov suspected the events were a conspiracy between Austria-Hungary and Germany to expel Russian influence in the Balkans.[17] On 30 July 1914, Russia enacted a general mobilization. The day after general mobilization was enacted, Austria-Hungary's ally Germany declared war on Russia prior to expected Russian intervention against Austria-Hungary., 41774=The first two allied victories in the war were won by the Serbian army, on the mountains of Cer and Kolubara, in western Serbia. The Austro-Hungarian army was expelled from the country, suffering heavy losses. Serbia suffered great losses during the war, almost 50% of all men and around 30% of its entire population were killed. On July 28, 1918, the Serbian flag was raised at American public buildings, including the White House, on the order of President Woodrow Wilson as a sign of recognition for Serbia's resistance against the Central Powers.[24], 38556=The Emirate of Nejd and Hasa agreed to enter the war as an ally of Britain in the Treaty of Darin on December 26, 1915.[23], 42925=The Idrisid Emirate of Asir participated in the Arab revolt. Its Emir, Muhammad ibn Ali al-Idrisi, signed an agreement with the British and joined the Allies in May 1915., 40655=Serbia had the diplomatic support of Russia, and both Serbia and Russia resented Austria-Hungary's absorption of Bosnia and Herzegovina that held a substantial Serb population. Serbia had expanded in size through its actions in the Balkan Wars of 1912–1913 when the Ottoman Empire's control in the Balkans collapsed., 37256=Brazil entered the war in 1917 after the United States intervened on the basis of Germany's unrestricted submarine warfare sinking its merchant ships, which Brazil also cited as a reason to enter the war fighting against Germany and the Central Powers., 34062=After diplomatic negotiations, Britain and France convinced Italy to join the war effort with promises that Italy would gain favourable territorial concessions from the Central Powers, including Italian-populated territories of Austria-Hungary.[22] Italy ordered mobilization on 22 May 1915, and issued an ultimatum to Austria-Hungary, and then declared war on Austria-Hungary, though it did not declare war on Germany.[22], 27786=After Germany declared war on Russia, France with its alliance with Russia prepared a general mobilization in expectation of war. On 3 August 1914, Germany declared war on France.[19]}",
    "lastModified": "Wed, 29 Jul 2015 15:05:56 GMT",
    "textBeforeTable": "These are estimates of the cumulative number of different personnel in uniform 1914–1918, including army, navy and auxiliary forces. At any one time, the various forces were much smaller. Only a fraction of them were frontline combat troops. The numbers do not reflect the length of time each country was involved. (See also: World War I casualties.) A pie-chart showing the military deaths of the Allied Powers. Personnel and casualties[edit] M.D. Nabuco Gouveia – Chief of Brazilian Military Medical Commission General Napoleão Felipe Aché, Chief of Brazilian Military Mission in France (1918–1919) Admiral Pedro Frontin, Chief of DNOG (Brazilian Expeditionary Fleet) Venceslau Brás – President of Brazil See main Article: Brazil during World War I Brazil[edit] General Phya Pijaijarnrit – Supreme Commander Siamese Force in World War I Chakrabongse Bhuvanath – Commander",
    "textAfterTable": "Summary of Declarations of War[edit] The following table shows the timeline of the several declarations of war among the belligerent powers. Entries on a yellow background show severed diplomatic relations only, not actual declarations of war. Unless stated otherwise, declarations of war by and on the United Kingdom include de facto declarations by and on other members of the British Empire. Date Declarer On 1914 28 July Austria-Hungary Serbia 30 July Russia Austria-Hungary 1 August Germany Russia 3 August Germany France",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}