{
    "relation": [
        [
            "Bill Name",
            "S.3709",
            "S.Res.618",
            "S.Res.624",
            "S.Res.621",
            "S.Res.613",
            "S.Res.612",
            "S.Con.Res.62",
            "S.Res.609",
            "S.Res.607",
            "S.Res.604",
            "S.Res.599",
            "S.3628",
            "S.Res.596",
            "S.3624",
            "S.Res.582",
            "S.Res.579",
            "S.3623",
            "S.Res.588",
            "S.J.Res.41",
            "S.3617",
            "S.Res.574",
            "S.3588",
            "S.Res.516",
            "S.3391",
            "S.2215",
            "S.Res.565",
            "S.3560",
            "S.645",
            "S.Res.401",
            "S.3547",
            "S.2241",
            "S.Res.551",
            "S.2259",
            "S.Con.Res.17",
            "S.1335",
            "S.3511",
            "S.Res.402",
            "S.3479",
            "S.Res.519",
            "S.Res.537",
            "S.3463",
            "S.Res.533",
            "S.2165",
            "S.1299",
            "S.3453",
            "S.810",
            "S.Con.Res.53",
            "S.3421",
            "S.3419",
            "S.3364",
            "S.3402",
            "S.3394",
            "S.3369",
            "S.3387",
            "S.3381",
            "S.3372",
            "S.3355",
            "S.Res.473",
            "S.1039",
            "S.Res.504",
            "S.3317",
            "S.Res.502",
            "S.Res.500",
            "S.3318",
            "S.J.Res.45",
            "S.Res.496",
            "S.Con.Res.48",
            "S.3274",
            "S.Res.484",
            "S.3220",
            "S.3252",
            "S.2343",
            "S.Res.475",
            "S.414",
            "S.3237",
            "S.3203",
            "S.3204",
            "S.1910",
            "S.3183",
            "S.3179",
            "S.Res.461",
            "S.418",
            "S.2884",
            "S.1925",
            "S.2374",
            "S.Res.435",
            "S.2369",
            "S.2325",
            "S.2317",
            "S.2295",
            "S.Res.425",
            "S.2280",
            "S.Res.417",
            "S.2270",
            "S.2263",
            "S.2250",
            "S.Res.412",
            "S.Res.416",
            "S.Res.80",
            "S.Res.409",
            "S.Res.410",
            "S.2240",
            "S.2231",
            "S.J.Res.39",
            "S.2219",
            "S.2217",
            "S.2222",
            "S.2192",
            "S.Res.398",
            "S.Res.396",
            "S.Res.310",
            "S.1002",
            "S.2162",
            "S.2155",
            "S.2153",
            "S.Res.386",
            "S.2145",
            "S.2149",
            "S.Res.387",
            "S.Res.325",
            "S.2120",
            "S.2117",
            "S.Res.380",
            "S.1023",
            "S.1945",
            "S.2099",
            "S.2051",
            "S.2046",
            "S.2036",
            "S.2034",
            "S.384",
            "S.Res.349",
            "S.2010",
            "S.2011",
            "S.1993",
            "S.1990",
            "S.1989",
            "S.1961",
            "S.1935",
            "S.1929",
            "S.1926",
            "S.1917",
            "S.1280",
            "S.1903",
            "S.Res.326",
            "S.Res.251",
            "S.1882",
            "S.Res.302",
            "S.1862",
            "S.1872",
            "S.1868",
            "S.598",
            "S.1850",
            "S.1853",
            "S.894",
            "S.Res.132",
            "S.1829",
            "S.1787",
            "S.J.Res.29",
            "S.1769",
            "S.1767",
            "S.Res.291",
            "S.1756",
            "S.1723",
            "S.Res.298",
            "S.1301",
            "S.Res.293",
            "S.Res.292",
            "S.Con.Res.29",
            "S.Res.274",
            "S.1593",
            "S.1591",
            "S.1584",
            "S.1585",
            "S.Res.271",
            "S.Res.268",
            "S.1561",
            "S.Res.269",
            "S.Res.267",
            "S.1526",
            "S.1527",
            "S.657",
            "S.1534",
            "S.1094",
            "S.1522",
            "S.958",
            "S.Res.257",
            "S.1471",
            "S.1497",
            "S.1464",
            "S.Res.244",
            "S.Res.242",
            "S.409",
            "S.Res.240",
            "S.1415",
            "S.Res.237",
            "S.27",
            "S.1397",
            "S.1231",
            "S.Res.87",
            "S.1375",
            "S.1360",
            "S.Res.233",
            "S.1358",
            "S.Res.230",
            "S.Res.231",
            "S.Res.228",
            "S.1333",
            "S.951",
            "S.Res.221",
            "S.1286",
            "S.Res.185",
            "S.1279",
            "S.1270",
            "S.Res.212",
            "S.Res.211",
            "S.1214",
            "S.1206",
            "S.1181",
            "S.1161",
            "S.1175",
            "S.1173",
            "S.1166",
            "S.1171",
            "S.76",
            "S.1147",
            "S.1117",
            "S.1088",
            "S.Res.204",
            "S.1133",
            "S.Con.Res.4",
            "S.1131",
            "S.968",
            "S.Res.172",
            "S.J.Res.17",
            "S.Con.Res.13",
            "S.1053",
            "S.1048",
            "S.1025",
            "S.1019",
            "S.996",
            "S.987",
            "S.969",
            "S.984",
            "S.940",
            "S.946",
            "S.929",
            "S.922",
            "S.913",
            "S.Res.168",
            "S.Res.164",
            "S.Res.159",
            "S.834",
            "S.845",
            "S.831",
            "S.830",
            "S.833",
            "S.821",
            "S.851",
            "S.812",
            "S.811",
            "S.788",
            "S.797",
            "S.394",
            "S.738",
            "S.724",
            "S.722",
            "S.705",
            "S.Res.125",
            "S.690",
            "S.687",
            "S.Res.117",
            "S.Res.114",
            "S.634",
            "S.604",
            "S.606",
            "S.613",
            "S.Res.51",
            "S.616",
            "S.596",
            "S.595",
            "S.578",
            "S.585",
            "S.584",
            "S.582",
            "S.576",
            "S.581",
            "S.Res.101",
            "S.571",
            "S.558",
            "S.539",
            "S.Res.98",
            "S.557",
            "S.547",
            "S.555",
            "S.560",
            "S.534",
            "S.510",
            "S.509",
            "S.506",
            "S.497",
            "S.489",
            "S.471",
            "S.Res.89",
            "S.Con.Res.10",
            "S.431",
            "S.464",
            "S.462",
            "S.465",
            "S.388",
            "S.Res.84",
            "S.426",
            "S.Res.78",
            "S.390",
            "S.387",
            "S.393",
            "S.386",
            "S.412",
            "S.Con.Res.6",
            "S.368",
            "S.362",
            "S.Res.49",
            "S.339",
            "S.344",
            "S.319",
            "S.308",
            "S.306",
            "S.296",
            "S.294",
            "S.274",
            "S.260",
            "S.Con.Res.5",
            "S.227",
            "S.219",
            "S.Res.28",
            "S.195",
            "S.Res.14",
            "S.5",
            "S.Res.21",
            "S.1",
            "S.154",
            "S.22",
            "S.4",
            "S.6",
            "S.72",
            "S.10",
            "S.9",
            "S.8",
            "S.2",
            "S.3",
            "S.7",
            "S.186",
            "S.133",
            "S.45",
            "S.Res.4",
            "S.Res.10",
            "S.Res.11"
        ],
        [
            "Title",
            "A bill to require a Government Accountability Office examination of transactions between large financial institutions and the Federal Government, and for other purposes.",
            "A resolution observing the 100th birthday of civil rights icon Rosa Parks and commemorating her legacy.",
            "A resolution relative to the death of the Honorable Daniel Ken Inouye, Senator from the State of Hawaii.",
            "A resolution condemning the horrific attacks in Newtown, Connecticut, and expressing support and prayers for all those impacted by that tragedy.",
            "A resolution urging the governments of Europe and the European Union to designate Hizballah as a terrorist organization and impose sanctions, and urging the President to provide information about Hizballah to the European allies of the United States and to support to the Government of Bulgaria in investigating the July 18, 2012, terrorist attack in Burgas.",
            "A resolution honoring the life and legacy of the Honorable Arlen Specter, distinguished former Senator for the Commonwealth of Pennsylvania.",
            "A concurrent resolution expressing the sense of the Congress that our current tax incentives for retirement savings provide important benefits to Americans to help plan for a financially secure retirement.",
            "A resolution calling for the immediate and unconditional release of United States citizen Alan Phillip Gross from detention in Cuba and urging the Government of Cuba to address his medical issues.",
            "A resolution relative to the death of the Honorable George McGovern, former United States Senator and Congressman from the State of South Dakota.",
            "A resolution relative to the death of the Honorable Warren B. Rudman, former United States Senator for the State of New Hampshire.",
            "A resolution expressing vigorous support and unwavering commitment to the welfare, security, and survival of the State of Israel as a Jewish and democratic state with secure borders, and recognizing and strongly supporting its right to act in self-defense to protect its citizens against acts of terrorism.",
            "Breast Cancer Patient Education Act of 2012",
            "A resolution permitting the solicitation of donations in Senate buildings for the relief of victims of Superstorm Sandy.",
            "Military Commercial Driver's License Act of 2012",
            "A resolution recognizing Hispanic Heritage Month and celebrating the heritage and culture of Latinos in the United States and the immense contributions of Latinos to the United States.",
            "A resolution designating the week of September 24 through September 28, 2012, as \"\"National Historically Black Colleges and Universities Week\"\".",
            "National Heritage Area Authorizations Extension Act of 2012",
            "A resolution commending the 4 American public servants who died in Benghazi, Libya, United States Ambassador to Libya John Christopher Stevens, Sean Smith, Tyrone Woods, and Glen Doherty, for their tireless efforts on behalf of the American people, and condemning the violent attack on the United States consulate in Benghazi.",
            "A joint resolution expressing the sense of Congress regarding the nuclear program of the Government of the Islamic Republic of Iran.",
            "A bill to ensure sufficient sizing of the civilian and contract services workforces of the Department of Defense.",
            "A resolution calling on the United Nations to take concerted actions against leaders in Iran for their statements calling for the destruction of another United Nations Member State, Israel.",
            "Great Lakes Ecosystem Protection Act of 2012",
            "A resolution expressing the sense of the Senate on the restitution of or compensation for property seized during the Nazi and Communist eras.",
            "Taking Essential Steps for Testing Act",
            "Increasing American Jobs Through Greater Exports to Africa Act of 2012",
            "A resolution expressing support for the designation of October 20, 2012, as the \"\"National Day on Writing\"\".",
            "Recalcitrant Cancer Research Act of 2012",
            "Child Protection Improvements Act of 2012",
            "A resolution expressing appreciation for Foreign Service and Civil Service professionals who represent the United States around the globe.",
            "Big Cats and Public Safety Protection Act",
            "GI Bill Consumer Awareness Act of 2012",
            "A resolution commending the 4 American public servants who died in Benghazi, Libya, including Ambassador J. Christopher Stevens, for their tireless efforts on behalf of the American people and condemning the violent attack on the United States consulate in Benghazi.",
            "Veterans' Compensation Cost-of-Living Adjustment Act of 2012",
            "A concurrent resolution expressing the sense of Congress that Taiwan should be accorded observer status in the International Civil Aviation Organization (ICAO).",
            "Pilot's Bill of Rights",
            "A bill to amend title 38, United States Code, to authorize the Secretary of Veterans Affairs to transport individuals to and from facilities of the Department of Veterans Affairs in connection with rehabilitation, counseling, examination, treatment, and care, and for other purposes.",
            "A resolution condemning Joseph Kony and the Lord's Resistance Army for committing crimes against humanity and mass atrocities, and supporting ongoing efforts by the United States Government and governments in central Africa to remove Joseph Kony and Lord's Resistance Army commanders from the battlefield.",
            "Building a Stronger America Act of 2012",
            "A resolution designating October 30, 2012, as a national day of remembrance for nuclear weapons program workers.",
            "A resolution supporting the goals and ideals of National Ovarian Cancer Awareness Month.",
            "Medicare Diabetes Prevention Act of 2012",
            "A resolution designating October 2012 as \"\"National Work and Family Month\"\".",
            "United States-Israel Enhanced Security Cooperation Act of 2012",
            "Lions Clubs International Century of Service Commemorative Coin Act",
            "Fair Minimum Wage Act of 2012",
            "Great Ape Protection and Cost Savings Act of 2011",
            "A concurrent resolution honoring the victims of the Aurora, Colorado, movie theater shooting and condemning the atrocities that occurred in Aurora, Colorado.",
            "WORK Act",
            "United States Employee Ownership Bank Act",
            "Bring Jobs Home Act",
            "United States Call Center Worker and Consumer Protection Act of 2012",
            "A bill to address fee disclosure requirements under the Electronic Fund Transfer Act, to amend the Federal Deposit Insurance Act with respect to information provided to the Bureau of Consumer Financial Protection, and for other purposes.",
            "Democracy Is Strengthened by Casting Light On Spending in Elections Act of 2012",
            "Team USA Made in America Act of 2012",
            "Protecting Employees and Retirees in Business Bankruptcies Act of 2012",
            "Military Service Integrity Act of 2012",
            "Taxpayer Bill of Rights Act of 2012",
            "A resolution commending Rotary International and others for their efforts to prevent and eradicate polio.",
            "Sergei Magnitsky Rule of Law Accountability Act of 2012",
            "A resolution expressing support for the International Olympic Committee to recognize with a minute of silence at the 2012 Olympics Opening Ceremony the athletes and others killed at the 1972 Munich Olympics.",
            "Equal Employment Opportunity Restoration Act of 2012",
            "A resolution celebrating the 150th anniversary of the signing of the First Morrill Act.",
            "A resolution celebrating the accomplishments of title IX of the Education Amendments of 1972, also known as the Patsy Takemoto Mink Equal Opportunity in Education Act, and recognizing the need to continue pursuing the goal of equal educational opportunities for all women and girls.",
            "GI Bill Protection Act of 2012",
            "A joint resolution amending title 36, United States Code, to designate June 19 as \"\"Juneteenth Independence Day\"\".",
            "A resolution observing the historical significance of Juneteenth Independence Day.",
            "A concurrent resolution recognizing 375 years of service of the National Guard and affirming congressional support for a permanent Operational Reserve as a component of the Armed Forces.",
            "Global Investment in American Jobs Act of 2012",
            "A resolution designating June 7, 2012, as \"\"National Hunger Awareness Day\"\".",
            "Paycheck Fairness Act",
            "A bill to provide for the award of a gold medal on behalf of Congress to Jack Nicklaus, in recognition of his service to the Nation in promoting excellence, good sportsmanship, and philanthropy.",
            "Stop the Student Loan Interest Rate Hike Act of\\r2012",
            "A resolution relating to the death of the Honorable E. James Abdnor, former United States Senator and Congressman from the State of South Dakota.",
            "International Protecting Girls by Preventing Child Marriage Act of 2011",
            "Accelerating the End of Breast Cancer Act of 2012",
            "Military Health Care Protection Act of 2012",
            "A bill to address fee disclosure requirements under the Electronic Fund Transfer Act, and for other purposes.",
            "Domestic Partnership Benefits and Obligations Act of 2012",
            "A bill to amend the Internal Revenue Code of 1986 to require the use of domestic property to be eligible for certain tax incentives for solar energy.",
            "Servicemember Housing Protection Act of 2012",
            "A resolution recognizing the teachers of the United States for their contributions to the development and progress of our Nation.",
            "A bill to award a Congressional Gold Medal to the World War II members of the Civil Air Patrol.",
            "Bring Jobs Home Act",
            "Violence Against Women Reauthorization Act of 2012",
            "Helium Stewardship Act of 2012",
            "A resolution calling for democratic change in Syria, and for other purposes.",
            "America Innovates Act of 2012",
            "Iron Dome Support Act",
            "Stop Invasive Species Act",
            "Patient Safety and Generic Labeling Improvement Act",
            "A resolution designating April 23, 2012, as \"\"National Adopt a Library Day\"\".",
            "Know Before You Owe Private Student Loan Act of 2012",
            "A resolution supporting the goals and ideals of National Public Health Week.",
            "Rural Energy Investment Act of 2012",
            "National Program for Arts and Technology Act of 2012",
            "Mortgage Forgiveness Tax Relief Act",
            "A resolution commending the African Union for committing to a coordinated military response, comprised of 5,000 troops from Uganda, the Central African Republic, the Democratic Republic of Congo, and South Sudan, in order to fortify ongoing efforts to arrest Joseph Kony and senior commanders of the Lord's Resistance Army and to stop the crimes against humanity and mass atrocities committed by them.",
            "A resolution supporting the designation of April as Parkinson's Awareness Month.",
            "A resolution condemning the Government of Iran for its state-sponsored persecution of its Baha'i minority and its continued violation of the International Covenants on Human Rights.",
            "A resolution designating April 2012 as \"\"Financial Literacy Month\"\".",
            "A resolution honoring the accomplishments and legacy of Cesar Estrada Chavez.",
            "A bill to amend the Internal Revenue Code of 1986 to extend the allowance for bonus depreciation for certain business assets.",
            "A bill to amend the Federal Credit Union Act, to advance the ability of credit unions to promote small business growth and economic development opportunities, and for other purposes.",
            "A joint resolution removing the deadline for the ratification of the equal rights amendment.",
            "Democracy is Strengthened by Casting Light On Spending in Elections Act of 2012",
            "Rural America Preservation Act of 2012",
            "A bill to require the Commodity Futures Trading Commission to take certain actions to reduce excessive speculation in energy markets.",
            "National Health Service Corps Improvement Act of 2012",
            "A resolution recognizing the 191st anniversary of the independence of Greece and celebrating Greek and American democracy.",
            "A resolution supporting the goals and ideals of Multiple Sclerosis Awareness Week.",
            "A resolution designating 2012 as the \"\"Year of the Girl\"\" and congratulating Girl Scouts of the USA on its 100th anniversary.",
            "Safe Doses Act",
            "Project Rebuild Act",
            "A bill to amend the Farm Security and Rural Investment Act of 2002 to promote biobased manufacturing.",
            "A bill to apply the countervailing duty provisions of the Tariff Act of 1930 to nonmarket economy countries, and for other purposes.",
            "A resolution calling for free and fair elections in Iran, and for other purposes.",
            "Fair Playing Field Act of 2012",
            "Medical Debt Responsibility Act of 2012",
            "A resolution celebrating Black History Month.",
            "A resolution recognizing the 2012 World Choir Games in Cincinnati, Ohio, as a global event of cultural significance to the United States and expressing support for designation of July 2012 as World Choir Games Month in the United States.",
            "Prompt Notification of Short Sales Act",
            "Adult Education and Economic Growth Act of 2012",
            "A resolution to express the sense of the Senate regarding the importance of preventing the Government of Iran from acquiring nuclear weapons capability.",
            "Haiti Reforestation Act of 2011",
            "A bill to permit the televising of Supreme Court proceedings.",
            "A bill to amend the Federal Deposit Insurance Act with respect to information provided to the Bureau of Consumer Financial Protection.",
            "A bill to amend the Higher Education Act of 1965 to extend the reduced interest rate for Federal Direct Stafford Loans.",
            "Visa Waiver Program Enhanced Security and Reform Act",
            "National Baseball Hall of Fame Commemorative Coin Act",
            "Syria Human Rights Accountability Act of 2012",
            "A bill to amend title 39, United States Code, to extend the authority of the United States Postal Service to issue a semipostal to raise funds for breast cancer research.",
            "A resolution commemorating and honoring the service and sacrifice of members of the United States Armed Forces and their families as the official combat mission in Iraq draws to a close.",
            "Social Security Fairness Act of 2011",
            "Clean Ports Act of 2011",
            "Lena Horne Recognition Act",
            "A bill to require the Transportation Security Administration to comply with the Uniformed Services Employment and Reemployment Rights Act.",
            "A bill to amend the Internal Revenue Code of 1986 to make permanent the minimum low-income housing tax credit rate for unsubsidized buildings and to provide a minimum 4 percent credit rate for existing buildings.",
            "LIHEAP Protection Act",
            "March of Dimes Commemorative Coin Act of 2011",
            "Mark Twain Commemorative Coin Act",
            "Healthy Food Financing Initiative",
            "Middle Class Tax Cut Act of 2011",
            "Kate Puzey Peace Corps Volunteer Protection Act of 2011",
            "Stop Trading on Congressional Knowledge Act",
            "A resolution designating Thursday, November 17, 2011, as \"\"Feed America Day\"\".",
            "A resolution expressing support for improvement in the collection, processing, and consumption of recyclable materials throughout the United States.",
            "Fair And Immediate Release of Generic Drugs Act",
            "A resolution expressing support for the goals of National Adoption Day and National Adoption Month by promoting national awareness of adoption and the children awaiting families, celebrating children and families involved in adoption, and encouraging the people of the United States to secure safety, permanency, and well-being for all children.",
            "Stillbirth and SUID Prevention, Education, and Awareness Act of 2011",
            "ABLE Act of 2011",
            "Smithsonian American Latino Museum Act",
            "Respect for Marriage Act of 2011",
            "Beginning Farmer and Rancher Opportunity Act of 2011",
            "Postal Service Protection Act of 2011",
            "Veterans' Compensation Cost-of-Living Adjustment Act of 2011",
            "A resolution recognizing and honoring the zoos and aquariums of the United States.",
            "Empowering States' Rights To Protect Consumers Act",
            "Wall Street Trading and Speculators Tax Act",
            "A joint resolution proposing an amendment to the Constitution of the United States relating to contributions and expenditures intended to affect elections.",
            "Rebuild America Jobs Act",
            "Deceptive Loan Check Elimination Act",
            "A resolution recognizing the religious and historical significance of the festival of Diwali.",
            "HUBZone Protection Act of 2011",
            "Teachers and First Responders Back to Work Act of 2011",
            "A resolution expressing support for the designation of October 20, 2011, as the \"\"National Day on Writing\"\".",
            "Trafficking Victims Protection Reauthorization Act of 2011",
            "A resolution celebrating the 10-year commemoration of the Underground Railroad Memorial, comprised of the Gateway to Freedom Monument in Detroit, Michigan, and the Tower of Freedom Monument in Windsor, Ontario, Canada.",
            "A resolution designating the week beginning October 16, 2011, as \"\"National Character Counts Week\"\".",
            "A concurrent resolution authorizing the use of the rotunda of the United States Capitol for an event to present the Congressional Gold Medal, collectively, to Neil A. Armstrong, Edwin E. \"\"Buzz\"\" Aldrin, Jr., Michael Collins, and John Herschel Glenn, Jr., in recognition of their significant contributions to society.",
            "A resolution expressing the sense of the Senate that funding for the Federal Pell Grant program should not be cut in any deficit reduction program.",
            "A bill to amend the Food and Nutrition Act of 2008 to require State electronic benefit transfer contracts to treat wireless program retail food stores in the same manner as wired program retail food stores.",
            "Raoul Wallenberg Centennial Celebration Act",
            "Drug Safety and Accountability Act of 2011",
            "Global Democracy Promotion Act",
            "A resolution honoring the life and legacy of the Honorable Charles H. Percy, former Senator for the State of Illinois.",
            "A resolution relative to the death of the Honorable Malcolm Wallop, former Senator for the State of Wyoming.",
            "Charitable Agricultural Research Act",
            "A resolution designating the week beginning September 19, 2011, as \"\"National Historically Black Colleges and Universities Week\"\".",
            "A resolution recognizing the Hispanic Heritage Month and celebrating the heritage and culture of Latinos in the United States and the immense contributions of Latinos to the United States.",
            "Mechanical Insulation Installation Incentive Act of 2011",
            "A bill to authorize the award of a Congressional gold medal to the Montford Point Marines of World War II.",
            "National Blue Alert Act of 2011",
            "Identify Theft and Tax Fraud Prevention Act",
            "Combating Autism Reauthorization Act",
            "Joint Select Committee on Job Creation Act of 2011",
            "Children's Hospital GME Support Reauthorization Act of 2011",
            "A resolution relative to the death of the Honorable Mark O. Hatfield, former United States Senator for the State of Oregon.",
            "Fair Employment Opportunity Act of 2011",
            "Medicare Cost Contract Extension Act of 2011",
            "Measuring and Evaluating Trends for Reliability, Integrity, and Continued Success (METRICS) Act of 2011",
            "A resolution congratulating Omega Psi Phi Fraternity, Inc. for 100 years of service to communities throughout the United States and the world, and commending Omega Psi Phi for upholding its cardinal principles of manhood, scholarship, perseverance, and uplift.",
            "A resolution supporting the goals and ideals of National Ovarian Cancer Awareness Month.",
            "Combating Dangerous Synthetic Stimulants Act of 2011",
            "A resolution condemning the horrific attacks on government buildings in Oslo, Norway, and a youth camp on Utoya Island, Norway, on July 22, 2011, and for other purposes.",
            "Access to Birth Control Act",
            "A resolution expressing the sense of the Senate regarding coming together as a Nation and ceasing all work or other activity for a moment of remembrance beginning at 1:00 PM Eastern Daylight Time on September 11, 2011, in honor of the 10th anniversary of the terrorist attacks committed against the United States on September 11, 2001.",
            "Preserve Access to Affordable Generics Act",
            "Incentivizing Offshore Wind Power Act",
            "Second Chance Reauthorization Act of 2011",
            "A resolution designating the year of 2012 as the \"\"International Year of Cooperatives\"\".",
            "Ending Excessive Corporate Deductions for Stock Options Act",
            "Shareholder Protection Act of 2011",
            "A resolution honoring the men and women of the National Aeronautics and Space Administration Space Shuttle Program on reaching the historic milestone of the 135th and final flight of the Space Transportation System.",
            "Parental Bereavement Act of 2011",
            "A resolution expressing the sense of the Senate that any agreement to reduce the budget deficit should not include cuts to Social Security benefits or Medicare benefits.",
            "A resolution designating September 2011 as \"\"National Child Awareness Month\"\" to promote awareness of charities benefitting children and youth-serving organizations throughout the United States and recognizing efforts made by those charities and organizations on behalf of children and youth as critical contributions to the future of the United States.",
            "A resolution expressing the sense of the Senate regarding coming together as a Nation and ceasing all work or other activity for a moment of remembrance beginning at 1:00 PM Eastern Daylight Time on September 11, 2011, in honor of the 10th anniversary of the terrorist attacks committed against the United States on September 11, 2001.",
            "Layoff Prevention Act of 2011",
            "Hiring Heroes Act of 2011",
            "A resolution congratulating Kappa Alpha Psi Fraternity, Inc., on reaching the historic milestone of 100 years of serving local and international communities, maintaining a commitment to the betterment of mankind, and enriching the lives of collegiate men throughout the United States.",
            "Trade Adjustment Assistance Extension Act of 2011",
            "A resolution reaffirming the commitment of the United States to a negotiated settlement of the Israeli-Palestinian conflict through direct Israeli-Palestinian negotiations, reaffirming opposition to the inclusion of Hamas in a unity government unless it is willing to accept peace with Israel and renounce violence, and declaring that Palestinian efforts to gain recognition of a state outside direct negotiations demonstrates absence of a good faith commitment to peace negotiations, and will have i",
            "Reengaging Americans in Serious Education by Uniting Programs Act",
            "Responsible Electronics Recycling Act",
            "A resolution congratulating the people and Government of the Republic of Slovenia on the twentieth anniversary of the country's independence.",
            "A resolution observing the historical significance of Juneteenth Independence Day.",
            "MARCH for Military Women Act",
            "Medicare Drug Savings Act of 2011",
            "National Future Farmers of America Commemorative Coin Act of 2011",
            "Rural America Preservation Act of 2011",
            "21st Century Readiness Act",
            "Ambulatory Surgical Center Quality and Access Act of 2011",
            "Protecting America's Workers Act",
            "Tax Parity for Health Plan Beneficiaries Act of 2011",
            "Strengthening Protections for Children and Communities From Disease Clusters Act",
            "Chiropractic Care Available to All Veterans Act of 2011",
            "TAA Health Coverage Improvement Act of 2011",
            "Retiree Health Coverage Protection Act",
            "A resolution designating June 7, 2011, as \"\"National Hunger Awareness Day\"\".",
            "Enforcing Orders and Reducing Customs Evasion Act of 2011",
            "A concurrent resolution expressing the sense of Congress that an appropriate site on Chaplains Hill in Arlington National Cemetery should be provided for a memorial marker to honor the memory of the Jewish chaplains who died while on active duty in the Armed Forces of the United States.",
            "Birth Defects Prevention, Risk Reduction, and Awareness Act of 2011",
            "Preventing Real Online Threats to Economic Creativity and Theft of Intellectual Property Act of 2011",
            "A resolution recognizing the importance of cancer research and the contributions made by scientists and clinicians across the United States who are dedicated to finding a cure for cancer, and designating May 2011, as \"\"National Cancer Research Month\"\".",
            "A joint resolution approving the renewal of import restrictions contained in the Burmese Freedom and Democracy Act of 2003.",
            "A concurrent resolution honoring the service and sacrifice of members of the United States Armed Forces who are serving in, or have served in, Operation Enduring Freedom, Operation Iraqi Freedom, and Operation New Dawn.",
            "Veterinary Services Investment Act",
            "Iran, North Korea, and Syria Sanctions Consolidation Act of 2011",
            "National Guard Empowerment and State-National Defense Integration Act of 2011",
            "Secondary School Reentry Act of 2011",
            "New Markets Tax Credit Extension Act of 2011",
            "Arbitration Fairness Act of 2011",
            "E 2 for Innovation Act",
            "Healthy Families Act",
            "Close Big Oil Tax Loopholes Act",
            "Office of Rural Education Policy Act",
            "LEARN Act",
            "Urban Jobs Act of 2011",
            "Do-Not-Track Online Act of 2011",
            "A resolution commemorating and acknowledging the dedication and sacrifice made by the Federal, State, and local law enforcement officers who have been killed or injured in the line of duty.",
            "A resolution recognizing the teachers of the United States for their contributions to the development and progress of our Nation.",
            "A resolution honoring the members of the military and intelligence community who carried out the mission that killed Osama bin Laden, and for other purposes.",
            "Campus SaVE Act",
            "Tax Return Due Date Simplification and Modernization Act of 2011",
            "Dairy COOL Act of 2011",
            "Promoting Innovations to 21st Century Careers Act",
            "Success in the Middle Act of 2011",
            "Uniting American Families Act of 2011",
            "Time for Innovation Matters in Education Act of 2011",
            "Lead Act",
            "Employment Non-Discrimination Act of 2011",
            "Fair Pay Act of 2011",
            "Paycheck Fairness Act",
            "No Oil Producing and Exporting Cartels Act of 2011",
            "Health Outcomes, Planning, and Education for Alzheimer's Act",
            "Ensuring Pay for Our Military Act of 2011",
            "Hospice Evaluation and Legitimate Payment Act",
            "Collegiate Housing and Infrastructure Act of 2011",
            "A resolution supporting the goals and ideals of National Public Health Week.",
            "Homeowner Advocate Act of 2011",
            "A bill to amend the Internal Revenue Code of 1986 to permanently extend the 15-year recovery period for qualified leasehold improvement property, qualified restaurant property, and qualified retail improvement property.",
            "A resolution supporting the goals and ideals of Professional Social Work Month and World Social Work Day.",
            "A resolution honoring Congresswoman Geraldine A. Ferraro, the first woman selected by a major political party as its candidate for Vice President of the United States, and extending the condolences of the Senate on her death.",
            "Holocaust Rail Justice Act",
            "Seniors Mental Health Access Improvement Act of 2011",
            "Creating Hope Act of 2011",
            "IDEA Fairness Restoration Act",
            "A resolution recognizing the 190th anniversary of the independence of Greece and celebrating Greek and American democracy.",
            "Supporting Community Schools Act of 2011",
            "Domestic Minor Sex Trafficking Deterrence and Victims Support Act of 2011",
            "Impact Aid Timely Repayment Act of 2011",
            "Repealing Ineffective and Incomplete Abstinence-Only Program Funding Act of 2011",
            "Full-Service Community Schools Act of 2011",
            "Dorothy I. Height and Whitney M. Young, Jr. Social Work Reinvestment Act",
            "Social Security Protection Act of 2011",
            "FIT Kids Act",
            "Child Care Protection Act of 2011",
            "A resolution expressing the sense of the Senate relating to the March 11, 2011, earthquake and tsunami in Japan.",
            "Educational Success for Children and Youth Without Homes Act of 2011",
            "Cluster Munitions Civilian Protection Act of 2011",
            "Behavioral Health Information Technology Act of 2011",
            "A resolution to express the sense of the Senate regarding the school breakfast program.",
            "Public Good IRA Rollover Act of 2011",
            "Annual National Classified School Employee of the Year Award Act",
            "Student Non-Discrimination Act of 2011",
            "Medicare Prescription Drug Savings and Choice Act of 2011",
            "Brewer's Employment and Excise Relief Act of 2011",
            "Research of Alcohol Detection Systems for Stopping Alcohol-related Fatalities Everywhere Act of 2011",
            "Small Business Lending Enhancement Act of 2011",
            "Safe Schools Improvement Act of 2011",
            "Secure Travel and Counterterrorism Partnership Program Act of 2011",
            "Preserving Homes and Communities Act of 2011",
            "Stop Asian Carp Act of 2011",
            "A resolution relating to the death of Frank W. Buckles, the longest surviving United States veteran of the First World War.",
            "A concurrent resolution authorizing the remains of Frank W. Buckles, the last surviving United States veteran of the First World War, to lie in honor in the rotunda of the Capitol.",
            "United States Marshals Service 225th Anniversary Commemorative Coin Act",
            "End Abuse in Later Life Act of 2011",
            "Elder Abuse Victims Act of 2011",
            "Senior Financial Empowerment Act of 2011",
            "A bill to prohibit Members of Congress and the President from receiving pay during Government shutdowns.",
            "A resolution expressing support for internal rebuilding, resettlement, and reconciliation within Sri Lanka that are necessary to ensure a lasting peace.",
            "Developing Innovative Partnerships and Learning Opportunities that Motivate Achievement Act",
            "A resolution relative to the death of James Albertus McClure, former United States Senator for the State of Idaho.",
            "Blue Star/Gold Star Flag Act of 2011",
            "A bill to amend title 37, United States Code, to provide flexible spending arrangements for members of uniformed services, and for other purposes.",
            "Prescribe A Book Act",
            "Unemployment Insurance Solvency Act of 2011",
            "Harbor Maintenance Act of 2011",
            "A concurrent resolution commending the National Association for the Advancement of Colored People on the occasion of its 102nd anniversary.",
            "A bill to amend the Consolidated Farm and Rural Development Act to suspend a limitation on the period for which certain borrowers are eligible for guaranteed assistance.",
            "Pancreatic Cancer Research and Education Act",
            "A resolution celebrating Black History Month.",
            "Rural Heritage Conservation Extension Act of 2011",
            "Retired Pay Restoration Act of 2011",
            "Pharmaceutical Market Access and Drug Safety Act of 2011",
            "Trade Extenders Act of 2011",
            "National Criminal Justice Commission Act of 2011",
            "Preserving Access to Life-Saving Medications Act",
            "Foundations for Success Act of 2011",
            "Medication Therapy Management Empowerment Act of 2011",
            "A bill to amend title 10, United States Code, to repeal the requirement for reduction of survivor annuities under the Survivor Benefit Plan by veterans' dependency and indemnity compensation.",
            "A concurrent resolution authorizing the use of the rotunda of the Capitol to honor Frank W. Buckles, the longest surviving United States veteran of the First World War.",
            "Home Health Care Planning Improvement Act of 2011",
            "Senate Campaign Disclosure Parity Act",
            "A resolution to establish as a standing order of the Senate that a Senator publicly disclose a notice of intent to objecting to any measure or matter.",
            "Child Support Protection Act of 2011",
            "A resolution honoring the victims and heroes of the shooting on January 8, 2011 in Tucson, Arizona.",
            "Reform America's Schools to Educate the Leaders of the Future Act",
            "A resolution to amend the Standing Rules of the Senate to provide procedures for extended debate.",
            "American Competitiveness Act",
            "Fast Track to College Act of 2011",
            "Homeowner Tax Fairness Act of 2011",
            "Make America the World's Leader in Clean Energy Act",
            "Reform America's Broken Immigration System Act",
            "Small Business Paperwork Mandate Elimination Act of 2011",
            "Family Economic Success Act",
            "Political Reform and Gridlock Elimination Act",
            "Tough and Smart National Security Act",
            "Middle Class Success Act",
            "Fiscal Responsibility and Spending Control Act",
            "Comprehensive and Fair Tax Reform Act",
            "Safe and Responsible Redeployment of United States Combat Forces from Afghanistan Act of 2011",
            "A bill to repeal the provision of law that provides automatic pay adjustments for Members of Congress.",
            "Offshoring Prevention Act",
            "A resolution honoring Senator Barbara Mikulski for becoming the longest-serving female Senator in history.",
            "A resolution to improve the debate and consideration of legislative matters and nominations in the Senate.",
            "A resolution to establish as a standing order of the Senate that a Senator publicly disclose a notice of intent to objecting to any measure or matter."
        ],
        [
            "Related Bill",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Date",
            "12/21/12",
            "12/19/12",
            "12/18/12",
            "12/17/12",
            "12/11/12",
            "12/10/12",
            "12/06/12",
            "12/05/12",
            "11/30/12",
            "11/29/12",
            "11/15/12",
            "11/14/12",
            "11/14/12",
            "10/19/12",
            "09/22/12",
            "09/22/12",
            "09/22/12",
            "09/22/12",
            "09/22/12",
            "09/21/12",
            "09/20/12",
            "09/20/12",
            "09/19/12",
            "09/19/12",
            "09/19/12",
            "09/19/12",
            "09/19/12",
            "09/13/12",
            "09/13/12",
            "09/13/12",
            "09/12/12",
            "09/12/12",
            "09/12/12",
            "09/11/12",
            "08/03/12",
            "08/02/12",
            "08/02/12",
            "08/01/12",
            "08/01/12",
            "08/01/12",
            "07/31/12",
            "07/30/12",
            "07/27/12",
            "07/26/12",
            "07/26/12",
            "07/25/12",
            "07/24/12",
            "07/23/12",
            "07/23/12",
            "07/19/12",
            "07/18/12",
            "07/17/12",
            "07/17/12",
            "07/16/12",
            "07/12/12",
            "07/11/12",
            "06/28/12",
            "06/26/12",
            "06/26/12",
            "06/25/12",
            "06/20/12",
            "06/20/12",
            "06/20/12",
            "06/20/12",
            "06/19/12",
            "06/19/12",
            "06/12/12",
            "06/07/12",
            "06/06/12",
            "06/05/12",
            "05/24/12",
            "05/24/12",
            "05/24/12",
            "05/24/12",
            "05/24/12",
            "05/17/12",
            "05/17/12",
            "05/16/12",
            "05/15/12",
            "05/15/12",
            "05/15/12",
            "05/10/12",
            "05/08/12",
            "04/26/12",
            "04/26/12",
            "04/26/12",
            "04/25/12",
            "04/19/12",
            "04/19/12",
            "04/18/12",
            "04/18/12",
            "03/29/12",
            "03/29/12",
            "03/29/12",
            "03/29/12",
            "03/29/12",
            "03/29/12",
            "03/29/12",
            "03/29/12",
            "03/28/12",
            "03/28/12",
            "03/27/12",
            "03/26/12",
            "03/22/12",
            "03/21/12",
            "03/21/12",
            "03/21/12",
            "03/15/12",
            "03/15/12",
            "03/14/12",
            "03/12/12",
            "03/08/12",
            "03/06/12",
            "03/05/12",
            "03/05/12",
            "03/05/12",
            "03/01/12",
            "03/01/12",
            "03/01/12",
            "02/17/12",
            "02/16/12",
            "02/16/12",
            "02/16/12",
            "02/14/12",
            "02/09/12",
            "02/09/12",
            "01/31/12",
            "01/31/12",
            "01/26/12",
            "01/24/12",
            "12/23/11",
            "12/17/11",
            "12/16/11",
            "12/16/11",
            "12/14/11",
            "12/14/11",
            "12/14/11",
            "12/07/11",
            "12/01/11",
            "11/30/11",
            "11/30/11",
            "11/29/11",
            "11/21/11",
            "11/17/11",
            "11/16/11",
            "11/16/11",
            "11/16/11",
            "11/16/11",
            "11/15/11",
            "11/15/11",
            "11/15/11",
            "11/10/11",
            "11/10/11",
            "11/10/11",
            "11/09/11",
            "11/08/11",
            "11/08/11",
            "11/02/11",
            "11/01/11",
            "11/01/11",
            "10/31/11",
            "10/21/11",
            "10/20/11",
            "10/20/11",
            "10/18/11",
            "10/13/11",
            "10/13/11",
            "10/12/11",
            "10/03/11",
            "09/22/11",
            "09/21/11",
            "09/21/11",
            "09/20/11",
            "09/20/11",
            "09/19/11",
            "09/15/11",
            "09/15/11",
            "09/15/11",
            "09/14/11",
            "09/08/11",
            "09/08/11",
            "09/08/11",
            "09/08/11",
            "09/07/11",
            "09/07/11",
            "09/07/11",
            "09/06/11",
            "08/02/11",
            "08/02/11",
            "08/01/11",
            "07/29/11",
            "07/29/11",
            "07/28/11",
            "07/27/11",
            "07/26/11",
            "07/22/11",
            "07/21/11",
            "07/21/11",
            "07/21/11",
            "07/21/11",
            "07/14/11",
            "07/13/11",
            "07/13/11",
            "07/13/11",
            "07/11/11",
            "07/11/11",
            "07/07/11",
            "07/06/11",
            "06/29/11",
            "06/29/11",
            "06/28/11",
            "06/28/11",
            "06/27/11",
            "06/23/11",
            "06/21/11",
            "06/20/11",
            "06/16/11",
            "06/15/11",
            "06/13/11",
            "06/09/11",
            "06/09/11",
            "06/09/11",
            "06/09/11",
            "06/09/11",
            "06/09/11",
            "06/06/11",
            "05/26/11",
            "05/26/11",
            "05/26/11",
            "05/26/11",
            "05/26/11",
            "05/26/11",
            "05/26/11",
            "05/26/11",
            "05/26/11",
            "05/25/11",
            "05/24/11",
            "05/23/11",
            "05/19/11",
            "05/18/11",
            "05/12/11",
            "05/12/11",
            "05/12/11",
            "05/12/11",
            "05/11/11",
            "05/11/11",
            "05/10/11",
            "05/09/11",
            "05/09/11",
            "05/05/11",
            "05/04/11",
            "05/03/11",
            "04/14/11",
            "04/14/11",
            "04/14/11",
            "04/14/11",
            "04/14/11",
            "04/14/11",
            "04/14/11",
            "04/13/11",
            "04/13/11",
            "04/12/11",
            "04/12/11",
            "04/07/11",
            "04/06/11",
            "04/05/11",
            "04/04/11",
            "03/31/11",
            "03/31/11",
            "03/30/11",
            "03/30/11",
            "03/30/11",
            "03/29/11",
            "03/17/11",
            "03/17/11",
            "03/17/11",
            "03/17/11",
            "03/17/11",
            "03/17/11",
            "03/16/11",
            "03/16/11",
            "03/15/11",
            "03/15/11",
            "03/15/11",
            "03/15/11",
            "03/15/11",
            "03/15/11",
            "03/14/11",
            "03/14/11",
            "03/10/11",
            "03/10/11",
            "03/10/11",
            "03/10/11",
            "03/10/11",
            "03/10/11",
            "03/10/11",
            "03/09/11",
            "03/08/11",
            "03/08/11",
            "03/08/11",
            "03/07/11",
            "03/03/11",
            "03/03/11",
            "03/03/11",
            "03/03/11",
            "03/02/11",
            "03/02/11",
            "03/02/11",
            "03/02/11",
            "03/01/11",
            "03/01/11",
            "03/01/11",
            "02/28/11",
            "02/17/11",
            "02/17/11",
            "02/17/11",
            "02/17/11",
            "02/17/11",
            "02/16/11",
            "02/16/11",
            "02/16/11",
            "02/14/11",
            "02/14/11",
            "02/14/11",
            "02/10/11",
            "02/08/11",
            "02/08/11",
            "02/07/11",
            "02/07/11",
            "02/03/11",
            "02/02/11",
            "02/01/11",
            "01/31/11",
            "01/27/11",
            "01/27/11",
            "01/26/11",
            "01/26/11",
            "01/25/11",
            "01/25/11",
            "01/25/11",
            "01/25/11",
            "01/25/11",
            "01/25/11",
            "01/25/11",
            "01/25/11",
            "01/25/11",
            "01/25/11",
            "01/25/11",
            "01/25/11",
            "01/25/11",
            "01/25/11",
            "01/25/11",
            "01/25/11",
            "01/25/11",
            "01/05/11",
            "01/05/11",
            "01/05/11"
        ],
        [
            "Orgs Lobbying",
            "6",
            "0",
            "0",
            "0",
            "1",
            "0",
            "12",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "4",
            "0",
            "1",
            "1",
            "1",
            "6",
            "7",
            "0",
            "2",
            "11",
            "0",
            "2",
            "37",
            "0",
            "7",
            "0",
            "10",
            "1",
            "0",
            "3",
            "0",
            "0",
            "7",
            "1",
            "8",
            "1",
            "3",
            "53",
            "0",
            "1",
            "1",
            "11",
            "8",
            "16",
            "16",
            "2",
            "0",
            "4",
            "2",
            "1",
            "15",
            "3",
            "8",
            "3",
            "0",
            "2",
            "0",
            "0",
            "0",
            "17",
            "0",
            "28",
            "0",
            "45",
            "0",
            "11",
            "2",
            "4",
            "26",
            "8",
            "2",
            "14",
            "0",
            "2",
            "8",
            "76",
            "31",
            "0",
            "4",
            "3",
            "0",
            "13",
            "1",
            "15",
            "0",
            "7",
            "2",
            "4",
            "0",
            "0",
            "1",
            "0",
            "0",
            "42",
            "19",
            "0",
            "26",
            "4",
            "4",
            "2",
            "0",
            "0",
            "0",
            "25",
            "1",
            "7",
            "9",
            "0",
            "17",
            "11",
            "0",
            "0",
            "5",
            "0",
            "8",
            "8",
            "3",
            "42",
            "11",
            "12",
            "0",
            "1",
            "5",
            "0",
            "17",
            "51",
            "7",
            "6",
            "17",
            "23",
            "2",
            "0",
            "8",
            "53",
            "5",
            "5",
            "0",
            "4",
            "23",
            "0",
            "4",
            "13",
            "1",
            "33",
            "2",
            "20",
            "6",
            "1",
            "2",
            "38",
            "7",
            "50",
            "0",
            "0",
            "2",
            "20",
            "0",
            "14",
            "0",
            "0",
            "0",
            "0",
            "2",
            "4",
            "33",
            "12",
            "0",
            "0",
            "10",
            "0",
            "0",
            "4",
            "0",
            "6",
            "17",
            "14",
            "0",
            "60",
            "0",
            "6",
            "10",
            "1",
            "0",
            "0",
            "11",
            "0",
            "5",
            "0",
            "68",
            "24",
            "20",
            "6",
            "5",
            "13",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "35",
            "0",
            "5",
            "6",
            "1",
            "23",
            "0",
            "1",
            "12",
            "35",
            "1",
            "2",
            "4",
            "17",
            "12",
            "16",
            "10",
            "9",
            "3",
            "10",
            "0",
            "22",
            "2",
            "7",
            "284",
            "1",
            "7",
            "4",
            "8",
            "11",
            "4",
            "7",
            "22",
            "33",
            "12",
            "21",
            "36",
            "7",
            "34",
            "11",
            "141",
            "0",
            "1",
            "0",
            "5",
            "4",
            "13",
            "0",
            "8",
            "17",
            "2",
            "2",
            "43",
            "6",
            "32",
            "4",
            "4",
            "7",
            "15",
            "4",
            "0",
            "3",
            "28",
            "0",
            "0",
            "7",
            "11",
            "20",
            "7",
            "0",
            "1",
            "5",
            "2",
            "11",
            "4",
            "3",
            "14",
            "26",
            "6",
            "0",
            "5",
            "9",
            "31",
            "0",
            "34",
            "4",
            "32",
            "30",
            "18",
            "76",
            "38",
            "33",
            "21",
            "18",
            "11",
            "0",
            "0",
            "0",
            "4",
            "12",
            "5",
            "1",
            "2",
            "8",
            "0",
            "1",
            "13",
            "3",
            "7",
            "57",
            "0",
            "5",
            "11",
            "0",
            "13",
            "11",
            "38",
            "22",
            "40",
            "145",
            "2",
            "21",
            "11",
            "0",
            "26",
            "6",
            "0",
            "18",
            "0",
            "42",
            "0",
            "49",
            "6",
            "6",
            "79",
            "20",
            "60",
            "11",
            "24",
            "28",
            "102",
            "76",
            "44",
            "2",
            "0",
            "22",
            "0",
            "2",
            "1"
        ]
    ],
    "pageTitle": "Sen. Sherrod Brown: Campaign Finance/Money - Legislation - Senator 2012 | OpenSecrets",
    "title": "",
    "url": "https://www.opensecrets.org/politicians/bills.php?cycle=2012&cid=N00003535&type=I&spon_type=co-sponsor&cong=112",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00298-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904460775,
    "recordOffset": 904435856,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "112th Congress Bills Co-Sponsored by Sherrod Brown 236 4 co-sponsor 357 34 5 sponsor 119 Median Rank of 102 Members Type # of Bills 201420122010200820062004200220001998 Select cycle: 112th Congress Legislation Other Data In the News Legislation Expenditures Geography Donors PACs Industries Elections Summary Sen. Sherrod Brown Tweet Home / Politicians & Elections / Congress / Sen. Sherrod Brown: Top Donors Take Action Community Create Learn Resources Resources Newsletter Sign-up",
    "textAfterTable": "Find Your Representatives Count Cash & Make Change. OpenSecrets.org is your nonpartisan guide to money's influence on U.S. elections and public policy. Whether you're a voter, journalist, activist, student or interested citizen, use our free site to shine light on your government. Join our mailing list and get our weekly money-in-politics newsletter. Sign Me Up About Us Mission About the Site Board Staff Awards & Accolades Funders Financial Information Employment Internships Training Opportunities Testimonials Contact Us",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}