{
    "relation": [
        [
            "ASSET MANAGEMENT RATIOS:",
            "Collection Period (Period Average) COLLECTION PERIOD (Period Average) COLLECTION PERIOD (Period Average) is used to appraise accounts receivable (AR). This ratio measures the length of time it takes to convert your average sales into cash. This measurement defines the relationship between accounts receivable and cash flow. A longer average collection period requires a higher investment in accounts receivable. A higher investment in accounts receivable means less cash is available to cover cash outflows, such as paying bills. NOTE: Comparing the two COLLECTION PERIOD ratios (Period Average and Period End) suggests the direction in which AR collections are moving, thereby giving an indication as to potential impacts to cash flow. Formula: ((AR (current) + AR (period ago)/2) / (Net Revenue / 365)",
            "Collection Period (Period End) COLLECTION PERIOD (Period End) COLLECTION PERIOD (Period End) is used to appraise accounts receivable (AR). This ratio measures the length of time it takes to convert your average sales into cash. This measurement defines the relationship between accounts receivable and cash flow. A longer average collection period requires a higher investment in accounts receivable. A higher investment in accounts receivable means less cash is available to cover cash outflows, such as paying bills. NOTE: Comparing the two COLLECTION PERIOD ratios (Period Average and Period End) suggests the direction in which AR collections are moving, thereby giving an indication as to potential impacts to cash flow. Formula: AR (current) / (Net Revenue / 365)",
            "Inventory Turns (Period Average) INVENTORY TURNS (Period Average)INVENTORY TURNS (Period Average) measures the average efficiency of the firm in managing and selling inventories during the last period, i.e., how many inventory turns the company has per period and whether that is getting better or worse. It is imperative to compare a companys inventory turns to the industry average. A company turning their inventory much slower than the industry average might be an indication that there is excessive old inventory on hand which would tie up their cash. The faster the inventory turns, the more efficiently the company manages their assets. However, if the company is in financial trouble, on the verge of bankruptcy, a sudden increase in inventory turns might indicate they are not able to get product from their suppliers, i.e., they are not carrying the correct level of inventory and may not have the product on hand to make their sales. If looking at a quarterly statement, there probably are more or less turns than an annual statement due to seasonality, i.e., their inventory levels will be higher just before the busy season than just after the busy season. This does not mean they are managing their inventory any differently; the ratio is just skewed because of seasonality. NOTE: Comparing the two INVENTORY TURNS (Period Average and Period End) suggests the direction in which inventories are moving, thereby allowing an analysis of efficiency improvements and/or potential burgeoning inventory problems. Formula:COGS---------------------------------------------(Inventory (current) + Inventory (last period) / 2)",
            "Inventory Turns (Period End) INVENTORY TURNS (Period End)INVENTORY TURNS (Period End) measures the ending efficiency of the firm in managing and selling inventories during the last period, i.e., how many inventory turns the company has per period and whether that is getting better or worse. It is imperative to compare a companys inventory turns to the industry average. A company turning their inventory much slower than the industry average might be an indication that there is excessive old inventory on hand which would tie up their cash. The faster the inventory turns, the more efficiently the company manages their assets. However, if the company is in financial trouble, on the verge of bankruptcy, a sudden increase in inventory turns might indicate they are not able to get product from their suppliers, i.e., they are not carrying the correct level of inventory and may not have the product on hand to make their sales. If looking at a quarterly statement, there probably are more or less turns than an annual statement due to seasonality, i.e., their inventory levels will be higher just before the busy season than just after the busy season. This does not mean they are managing their inventory any differently; the ratio is just skewed because of seasonality. NOTE: Comparing the two INVENTORY TURNS (Period Average and Period End) suggests the direction in which inventories are moving, thereby allowing an analysis of efficiency improvements and/or potential burgeoning inventory problems. Formula: COGS / Inventory (current)",
            "Days Inventory DAYS INVENTORYDAYS INVENTORY shows the average length of time items are in inventory, i.e., how many days a business could continue selling using only its existing inventory. The goal, in most cases, is to demonstrate efficiency through having a high turnover rate and therefore a low days inventory. However, realize that this ratio can be unfavorable if either too high or too low. A company must balance the cost of carrying inventory with its unit and acquisition costs. The cost of carrying inventory can be 25% to 35%. These costs include warehousing, material handling, taxes, insurance, depreciation, interest and obsolescence. Formula: Inventory / (Net Revenue / 365).",
            "Working Capital Turnover WORKING CAPITAL TURNOVERWORKING CAPITAL TURNOVER (WCT) shows how efficiently Working Capital (WC) is employed, i.e., it measures how efficiently the business is using its available assets. WCT measures the amount of Net Revenue generated per monetary unit of Working Capital. It varies widely by industry; therefore it is best to compare WCT to industry averages. Formula: Net Revenue / (Current Assets - Current Liabilities).",
            "Fixed Asset Turnover FIXED ASSET TURNOVERFIXED ASSET TURNOVER measures managements ability to generate revenues from investments in fixed assets. FAT considers only the firms investment in property, plant and equipment and is extremely important in high asset firms such as manufactures and telecommunications companies. Generally, the higher this ratio:the smaller the investment required to generate sales, thus the more profitable the firm.indicates the firm has less money tied up in fixed assets for each dollar of sales revenue. A declining ratio may indicate that the firm has over-invested in plant, equipment, or other fixed assets. Formula: Net Revenues / Fixed Assets",
            "Total Asset Turnover TOTAL ASSET TURNOVERTOTAL ASSET TURNOVER measures managements efficiency in managing all of a firms assets - specifically the generation of revenues from the firms total investments in assets. This ratio is extremely important in high asset firms such as manufactures and telecommunications companies. Generally, the higher this ratio as compared to like companies or the industry (Formula: Net Revenue / Total Assets): the smaller the investment required to generate sales, thus the more profitable the firm. indicates the firm has less money tied up in fixed assets for each dollar of sales revenue."
        ],
        [
            "Period 1",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample"
        ],
        [
            "Period 2",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample"
        ],
        [
            "Period 3",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample"
        ],
        [
            "Period 4",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample"
        ],
        [
            "Period 5",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample"
        ],
        [
            "Year End 06/29/2014",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample"
        ]
    ],
    "pageTitle": "Private vs Public Company Ratio Analysis - Ratio Analysis - Accounting Ratios",
    "title": "",
    "url": "https://www.ventureline.com/ratio-analysis-accounting-ratios/sample/private_company_vs_publicly_traded_company/BGG/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00065-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 941551145,
    "recordOffset": 941534751,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{330=My Company SIC Code: 1521 GENERAL CONTRACTORS-SINGLE-FAMILY HOUSES Briggs & Stratton Corporation http://www.briggsandstratton.com/ 3519 INTERNAL COMBUSTION ENGINES, NOT ELSEWHERE CLASSIFIED}",
    "textBeforeTable": "My Company SIC Code: 1521 GENERAL CONTRACTORS-SINGLE-FAMILY HOUSES Briggs & Stratton Corporation http://www.briggsandstratton.com/ 3519 INTERNAL COMBUSTION ENGINES, NOT ELSEWHERE CLASSIFIED This online report is prepared by VentureLine NYSE, AMEX, NASDAQ, or OTC Symbol Look-Up at nasdaq.com VS My Company Financials Select a Private Company from the drop down & Enter stock symbol from NYSE, AMEX, NASDAQ, or OTC: CREATE YOUR OWN SAMPLE: Enter stock ticker below and click 'Submit' GREAT FEATURE: To find the meaning or usage of any term, just click on the term to enter the Glossary. Accounting ratios driven ratio analysis allow comparison of one industry/firm to another. Since ratios look at relationships inside the industry/firm, an industry/firm of one size can be directly compared to a second industry/firm (or a collection of industries/firms) which may be larger or smaller or even in a different business. Financial ratio analysis is a method of comparison not dependent on the size of either industry/firm. Financial ratios provide a broader basis for comparison than do raw numbers. However, ratios on their own, without",
    "textAfterTable": "Sample Sample Sample Sample Net Profit Margin (Pre-tax) NET PROFIT MARGIN (NPM Pre-Tax)NET PROFIT MARGIN (NPM Pre-Tax) incorporates all of the expenses associated with ordinary business (excluding taxes) thus is a measure of the overall operating efficiency of the firm prior to any tax considerations which may mask performance. For a business to be viable in the long term profits must be generated; making the net profit margin ratio one of the key performance indicators for any business. It is important to analyze the ratio over time. A variation in the ratio from year-to-year may be due to abnormal conditions or expenses which need to be addressed. A decline in the ratio over time may indicate a margin squeeze suggesting that productivity improvements may need to be initiated. In some cases, the costs of such improvements may lead to a further drop in the ratio or even losses before increased profitability is achieved. Formula: Net Earnings / Net Revenue Sample Sample Sample Sample Sample Sample Net Profit Margin (After-tax) NET PROFIT MARGIN (NPM After Tax) NET PROFIT MARGIN (NPM After Tax) measures profitability as a percentage of revenues after consideration of all revenue and expense, including interest expenses, non-operating items, and income taxes. For a business to be viable in the long term profits must be generated; making the net profit margin ratio one of the key performance indicators for",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}