{
    "relation": [
        [
            "",
            "Terminal",
            "PIM",
            "Phonebook",
            "Dialer",
            "Web Browser",
            "Mail Client",
            "XMPP Client",
            "Media Player"
        ],
        [
            "Om 2008.9",
            "??",
            "??",
            "??",
            "??",
            "??",
            "??",
            "??",
            "??"
        ],
        [
            "Om2008.8",
            "yes (1)",
            "yes",
            "yes",
            "yes",
            "yes (1)",
            "yes",
            "yes (1)",
            "yes (1)"
        ],
        [
            "2007.2",
            "Basic (2)",
            "yes",
            "yes",
            "yes",
            "yes (1)",
            "?",
            "yes (1)",
            "yes"
        ],
        [
            "FSO",
            "yes",
            "no",
            "yes",
            "yes",
            "?",
            "?",
            "?",
            "?"
        ],
        [
            "SHR",
            "yes",
            "N/A",
            "yes",
            "yes",
            "yes",
            "?",
            "?",
            "yes"
        ],
        [
            "FDOM",
            "yes",
            "??",
            "??",
            "yes",
            "yes",
            "??",
            "??",
            "yes"
        ],
        [
            "Qt Extended",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes"
        ],
        [
            "Debian",
            "yes",
            "yes (1)",
            "yes (1)",
            "yes (1)",
            "yes (1)",
            "yes (1)",
            "yes (1)",
            "yes (1)"
        ],
        [
            "Gento",
            "??",
            "??",
            "??",
            "??",
            "??",
            "??",
            "",
            "??"
        ],
        [
            "Android",
            "??",
            "??",
            "yes",
            "yes",
            "yes",
            "yes",
            "??",
            "yes"
        ]
    ],
    "pageTitle": "Distributions - Openmoko",
    "title": "",
    "url": "http://wiki.openmoko.org/index.php?title=Distributions&oldid=60939",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 12,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 256447071,
    "recordOffset": 256421583,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{15812=SHR is a community driven distribution. It contains some basic GTK+ based applications which make use of the FSO. There currently is a EFL (with elementary) dialer, messages and contacts application programmed in C. As of November 9th, 2008, there is no stable release of this distribution yet, as the SHR team doesn't feel it to be good enough. You can find images though on the SHR buildhost., 12229=Om 2008.8 was released on August 8, 2008, to replace 2007.2. Prior to that, its codename was ASU (April/August Software Update). This is still the name of the branch in the version control system. This distribution integrates the Qtopia phone stack with a set of new Openmoko applications based on the Enlightenment Foundation Libraries. Qtopia being a more mature product than the GNOME Mobile stack, the standard phone applications (dialer, contacts, calculator, calendar) work better than in 2007.2. The Qtopia used in 2008.8 was ported to run on X11, contrary to standard Qtopia which uses the framebuffer. This allows non-Qt applications to safely share the screen with Qt applications. This is a .0 release, many unresolved issues remain in the lower layers (kernel power management, sound, wifi drivers...)., 14326=FSO is an abbreviation for FreeSmartphone.Org. Openmoko is working on a stable system services back-end. Focus is on stable highlevel services that you can access from whatever language or UI that supports dbus. The framework will be used in forthcoming Openmoko distributions. FSO is all about middleware, but if one stacks a bootloader+kernel under it and telephony applications on top, one gets a functional distribution. These are made available as FSO-image milestones. Openmoko Framework Image milestone IV was released on November 11th, 2008 and named 'Homework'. People report that despite its infancy, the phone server part in FSO is already more solid than anywhere else. The kernel under it is a Linux 2.6.24 with modules packaged separately. The telephony application on top of it is Zhone. This is a basic Python dialer/homescreen designed as scaffolding to test the FSO functionalities (even if Zhone is pretty, code path coverage is more critical to it than user-friendliness)., 13400=Om 2007.2 is the base-system which is installed on FreeRunner when it leaves the factory. The interface was totally finger-oriented, optimized for 285ppi, and very orange. It used the GTK+ stack, which is part of the GNOME Mobile platform. This distribution is now considered obsolete and not being worked on by Openmoko Inc or by OpenedHand. There is a community effort (see SHR) to port the GTK based telephony applications to the future middleware from FSO., 11500=The Om 2008.9 Update is the first point release after the initial Om 2008.8 release. Openmoko recommends that all existing installations of Om 2008.8 should be updated to that version. Quality-wise, we are still far from the goal, but this version includes general stability enhancing operating system improvements and a new splash screen. No applications were added or removed. Users with basic telephony needs will find it tolerable as an everyday phone., 1638=Openmoko distributions are designed to run on various mobile devices, with the primary aim of supporting Openmoko Inc.'s Neo 1973 and Neo FreeRunner phones. They are GNU/Linux distributions -- complete operating systems with more or less user applications. You can install any of them on your phone or even have a multiboot system with two distributions installed.}",
    "textBeforeTable": "Connectivity Open source applications: more games, scientific, you name it... Smartphone applications: GPS, media player, simple games, web browser... Basic telephony applications: voice calls, SMS, alarm clock... Libraries and application framework (widget toolkit and and graphical environment) : EFL, Qt, Gtk+ or Java ? Display driver. The original Qt Extended uses the framebuffer, most other distributions today use X11. Middleware: daemons to handle GSM calls or GPS, sound system, personal information storage and so on. Qt and Android have their own subsystems, FreeSmartphone.Org (FSO) is working towards a standard-based Free Software one. The kernel. GNU/Linux kernels versions 2.6.24, 2.6.26 or 2.6.28 can be found. Some have modules compiled in, others have modules compiled separately. If compiled separately, modules can be distributed in the same package file as the kernel or separately. The bootloader. Theoretically, any version of uboot could be used with any distribution. In the future Qi will replace uboot. The bootsplash screen image. This is purely decorative. Generally, distributions can differ on one or more of the following components: Features by distribution/release target PyNeo lead dev writes that Mickey Lauer gave the whole pyneo stack and his work to build a flashable image the name \"moko underground\". This was an alias for pyneo at that moment. He then started his own stack using",
    "textAfterTable": "Debian Gentoo Android Stylus friendly  ?? yes yes yes yes yes yes yes  ?? yes Finger friendly  ?? Partially Partially Partially yes yes yes no  ?? yes Accelerometer  ?? yes (1) no no no yes no yes  ?? yes Applications Om 2008.9 Om2008.8 2007.2 FSO SHR FDOM Qt Extended Debian Gento Android Terminal  ?? yes (1) Basic (2) yes yes yes yes yes  ??  ?? PIM  ?? yes yes no N/A  ?? yes yes (1)  ??  ?? Phonebook",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}