{
    "relation": [
        [
            "Diagnosis",
            "Neuroblastoma",
            "Brain tumours",
            "Lymphoma",
            "Ewing sarcoma",
            "Germ cell tumours",
            "Osteosarcoma",
            "Soft tissue sarcoma",
            "Nephroblastoma",
            "Other malignant tumours",
            "All"
        ],
        [
            "No. of pat.",
            "33",
            "27",
            "24",
            "20",
            "14",
            "12",
            "12",
            "7",
            "23",
            "172"
        ],
        [
            "Median age",
            "1 y 8 m",
            "9 y 2 m",
            "15 y 10 m",
            "12 y 7 m",
            "16 y 4 m",
            "13 y 1 m",
            "10 y 8 m",
            "1 y 9 m",
            "16 y 4 m",
            "9 y 11 m"
        ],
        [
            "Minimum age",
            "1 m",
            "8 m",
            "9 m",
            "1 y 5 m",
            "6 m",
            "6 y 5 m",
            "1 y 8 m",
            "9 m",
            "6 m",
            "1 m"
        ],
        [
            "Maximum age",
            "15 y",
            "15 y 4 m",
            "18 y 4 m",
            "18 y 3 m",
            "19 y 6 m",
            "16 y 11 m",
            "16 y 6 m",
            "6 y 10 m",
            "19 y 6 m",
            "19 y 6 m"
        ],
        [
            "Recurrence",
            "3",
            "3",
            "2",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "12"
        ],
        [
            "Metastatic",
            "24",
            "3 *",
            "/",
            "3",
            "10",
            "3",
            "1",
            "3",
            "9",
            "56"
        ],
        [
            "Chemotherapy/Pt cytostaic **",
            "30/24",
            "27/16",
            "24/0",
            "20/0",
            "14/14",
            "12/12",
            "12/0",
            "7/2",
            "16/2",
            "162/70"
        ]
    ],
    "pageTitle": "1. Introduction",
    "title": "",
    "url": "http://www.mdpi.com/1422-0067/14/6/12170/xml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00051-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 575247431,
    "recordOffset": 575222916,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{148280=Metallothioneins (MT) are low molecular weight, cysteine-rich proteins maintaining metal ions homeostasis. They play a role in carcinogenesis and may also cause chemoresistance. The aim of the study was to explore the importance of MT serum levels in children suffering from malignant tumours. This prospective study involves examination of 865 samples from 172 patients with malignant tumours treated from 2008 to 2011 at University Hospital Motol. MT serum levels were determined using differential pulse voltammetry–Brdicka reaction. Mean MT level was 2.7 ± 0.5 μM. There was no statistically significant difference between MT levels in different tumours. We also did not find any correlation between MT levels and response to therapy or clinical stages. However, we found a positive correlation between MT levels and age (p = 0.009) and a negative correlation with absolute lymphocyte number (p = 0.001). The fact that patients who had early disease recurrence had lower MT levels during the treatment (complete remission 2.67 vs. recurring 2.34, p = 0.001) seems to be important for clinical practice. Accordingly we believe that there is benefit in further studies of serum MT levels in tumours.}",
    "lastModified": "Wed, 13 May 2015 23:34:24 GMT",
    "textBeforeTable": "Correlations between laboratory parameters. Table 1 0.02: statistically significant on the level of 2%. The only significant difference was found between levels in patients with active tumour (before therapy, partial remission, progressive disease) with and without chemotherapy. There was no relationship to chemotherapy with platinum cytostatics. p = MT levels in relation to chemotherapy. N.S.: not significant. Figure 4 0.001]. p = = 3.53, df = 75) t -test ( T MT levels/mean ± s.d./in group of patients <2 months after finishing chemotherapy compared to patients ≥2 months after finishing chemotherapy [paired Figure 3 0.001: statistically significant on the level of 0.1%. There were no statistically significant differences between MT levels in patients with active disease and in remission or in patients with generalized disease and with cancers without metastasis. p = Relation of MT level/mean ± s.d./to clinical parameters. N.S.: not significant. Figure 2 MT level/mean ± s.d./in different childhood malignant tumours. Hatched column: all tumours; doted columns: healthy adult volunteers. There were no statistically significant differences between different tumours, difference between MT levels in all malignant tumours and in healthy volunteers was significant. MMT: Soft tissue sarcoma (Malignant mesenchymal tumours). Figure 1 Figures and Tables 10.3390/s8053106 3122",
    "textAfterTable": "Sig. (2-tailed) 0.085 0.599 0.635 - N 171 174 154 174 Crea Pearson r 0.273 −0.381 0.170 0.445 Sig. (2-tailed) 0.003 0.000002 0.036 0.000001 N 170 173 153 173 ANL: absolute lymphocyte number; CRP: C-reactive protein, Hgb: haemoglobin, Crea: creatinine. ** p < 0.01, # near the level of statistical significance. Table 2 Clinical characteristics of patients group. Diagnosis No. of pat. Median age Minimum age Maximum age Recurrence Metastatic Chemotherapy/Pt cytostaic ** Neuroblastoma 33 1 y 8 m 1 m 15 y 3 24 30/24 Brain tumours 27 9 y 2 m 8",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}