{
    "relation": [
        [
            "Release Reason",
            "Deported/Removed",
            "Voluntary departure",
            "Released with Proceedings Ongoing",
            "U.S. Marshals or Other Agency",
            "Paroled",
            "Outstanding Detention Hanging Closure",
            "Proceedings Terminated",
            "Withdrawal"
        ],
        [
            "Never Transferred",
            "910,818",
            "274,685",
            "270,074",
            "87,832",
            "64,748",
            "39,365",
            "25,241",
            "11,443"
        ],
        [
            "% of Never Transferred",
            "54%",
            "16%",
            "16%",
            "5%",
            "4%",
            "2%",
            "1%",
            "1%"
        ],
        [
            "Experienced One or More Transfers",
            "840,254",
            "68,872",
            "151,464",
            "25,580",
            "17,144",
            "12,469",
            "18,869",
            "747"
        ],
        [
            "% of Transferred",
            "74%",
            "6%",
            "14%",
            "2%",
            "2%",
            "1%",
            "2%",
            "0%"
        ]
    ],
    "pageTitle": "A Costly Move | Human Rights Watch",
    "title": "",
    "url": "https://www.hrw.org/report/2011/06/14/costly-move/far-and-frequent-transfers-impede-hearings-immigrant-detainees-united",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 14,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00075-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 917012707,
    "recordOffset": 916961997,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{73200=1576, 99115=[11] Letter from Human Rights Watch to ICE Director John Morton and American Federation of Government Employees National President John Gage, November 3, 2010, http://www.hrw.org/en/news/2010/11/03/us-immigration-system-should-meet-international-human-rights-obligations., 50643=As shown in Figure 1, below, transfers have increased steadily over time. Cumulatively, between the beginning of fiscal year 1999 and April 2010, 41 percent of all detention episodes included at least one transfer between facilities. In fiscal year 1999, 23 percent of detention episodes included one or more transfers between facilities, but in fiscal year 2009, 52 percent of detention episodes included one or more transfers. Figure 2 illustrates the percentage of detention episodes experiencing transfer between 1998 and 2010. Table 1 shows the total number of transfer movements for each year between 1998 and 2010., 94136=[1]US Immigration and Customs Enforcement, “Operations Manual ICE Performance Based National Detention Standards,” part 7, chapter 41, December 2, 2008, http://www.ice.gov/detention-standards/2008 (accessed May 11, 2011), p. 2., 95903=[4] US Immigration and Customs Enforcement, Northeast Detention Briefing, Stakeholders Meeting, December 20, 2010 (on file with Human Rights Watch)., 98706=[10]“ICE Announces Launch of Online Detainee Locator System,” Detention Watch Network news release, July 23, 2010, http://www.detentionwatchnetwork.org/node/2703 (accessed May 11, 2011)., 105830=[27]Human Rights Watch, US: Forced Apart (By the Numbers): Non-Citizens Deported Mostly for Nonviolent Offenses, April 15, 2009, http://www.hrw.org/en/node/82159/section/6., 94583=[2]For example, ICE circulated information at the Northeast Detention Briefing, Stakeholders Meeting, indicating objectives to “consolidat[e] and realign detention resources to keep detainees closer to families and legal resources,” to “reduce or eliminate the transfer of detainees from one geographic area to another due to the lack of detention resources,” and proposed a plan to increase bedspace in Essex County, New Jersey. US Immigration and Customs Enforcement, Northeast Detention Briefing, Stakeholders Meeting, December 20, 2010 (on file with Human Rights Watch)., 110141=[36]Even if one accepts the notion that transfers for medical care provide cost savings to the agency, it is also true that transfers for medical care are not adequately addressing detainee medical needs, since ICE’s failure to care for the medical needs of non-citizen detainees (resulting in deaths in several cases) has been the subject of numerous lawsuits, press investigations, and congressional action. See, e.g., “ACLU Sues U.S. Immigration Officials and For-Profit Corrections Corporation Over Dangerous and Inhumane Housing of Detainees,” ACLU press release, January 24, 2007, http://www.aclu.org/prison/conditions/28127prs20070124.html (accessed May 11, 2011); “ACLU Sues Over Lack of Medical Treatment at San Diego Detention Facility,” ACLU press release, June 13, 2007, http://aclu.org/immigrants/detention/30095res20070613.html (accessed May 11, 2011); Dana Priest and Amy Goldstein, “Careless Detention: System of Neglect,” Washington Post, May 11, 2008, http://www.washingtonpost.com/wp-srv/nation/specials/immigration/cwc_d1p1.html (accessed May 11, 2011); “In Custody Deaths,” New York Times, http://topics.nytimes.com/top/reference/timestopics/subjects/i/immigration_detention_us/incustody_deaths/index.html (accessed May 11, 2011) (collecting articles published by the New York Times about immigrant detainee deaths and failure to provide medical care from 2005 to 2009); U.S. House of Representatives, Committee on the Judiciary, Subcommittee on Immigration, Citizenship, Refugees, Border Security, and International Law, “Hearing on Problems with Immigration Detainee Medical Care,” June 4, 2008, http://judiciary.house.gov/hearings/hear_060408.html (accessed May 11, 2011)., 33707=As we commenced analyzing data, we continued to press ICE to change its policies on detainee transfers. In November 2010 we wrote to ICE and to the labor union representing government workers in detention centers, after ICE alleged that contract bargaining issues with the union were delaying improvements to ICE’s detainee transfer policies.[11], 13989=Even so, starting in October 2009, ICE has announced several reforms intended to alleviate some causes and manifestations of immigrant detainee transfers, including moving towards a more “civil” detention system that decreases reliance on subcontracting with state jails and prisons, locating facilities in regions where they are needed, and reducing transfers.[2], 85583=According to our estimates, the over two million transfers that occurred between October 1998 and April 2010 cost approximately $366,832,842 in total. We believe that these transport costs only represent a fraction of the total costs of transfers: since transferred detainees spend on average more than three times longer in detention than those who are not transferred, the most significant financial costs may come from court delays and unnecessarily long periods of detention., 35956=Immigrant detainees, unlike criminal defendants, have no right to a court-appointed attorney. In 2010, 57 percent of non-citizens appeared in immigration court without counsel.[13]In some urban areas, immigrants can benefit from an active cadre of attorneys willing to represent them at low or no cost, in other words on a pro bonobasis. While it is beyond this report’s scope to draw a direct causal relationship between transfers of detainees and their inability to secure counsel to represent them in immigration court, it is clear that detainees are often transferred hundreds or thousands of miles from families and home communities before they have been able to secure legal representation., 29281=In August 2009 ICE announced a range of policy reforms intended to shift away from the punitive model for immigration detention towards a more “civil” system. The agency indicated its intention to:, 95377=[3]For a more detailed discussion of the way that subcontracting detention space can increase transfers, see Human Rights Watch, Locked Up Far Away: The Transfer of Immigrants to Remote Detention Centers in the US, December 2, 2009, http://www.hrw.org/en/reports/2009/12/02/locked-far-away-0, p. 21, 31714=On February 22, 2010, three months after publication of Locked Up Far Away, ICE wrote to Human Rights Watch announcing the agency’s intention to “minimize the number of detainee transfers to the greatest extent possible.”[9] The agency made similar announcements in various meetings with advocates around the country, suggesting that it would reduce its reliance on transfers. Subsequently, in July 2010, ICE implemented an important reform for transferred detainees: it established an online detainee locator system.[10]This reform was recommended in our previous report and had been a chief goal of immigrants’ rights advocates around the country for years. Before, attorneys and family members would spend stressful hours and days searching for clients and loved ones after a transfer. This online system now allows detainees to be located relatively quickly, and is an important rights-protective achievement for ICE. However, while detainees can now be located more readily, we remain concerned that the agency has still not made any formal internal policy changes aimed at reducing detainee transfers, other than repeatedly announcing its intention to do so., 8173=This report updates Human Rights Watch’s 2009 report, Locked Up Far Away, with recent data analysis that tracks the beginning and ending points of each immigrant’s detention odyssey from 1998-2010. It shows that over 46 percent of transferred detainees were moved at least two times, with 3,400 people transferred 10 times or more. One egregious case involved a detainee who was transferred 66 times. On average, each transferred detainee traveled 370 miles, and one frequent transfer route (between Pennsylvania and Texas) covered 1,642 miles. Such long-distance and repetitive transfers have dire consequences for immigrants’ rights to fair immigration proceedings. They can render attorney-client relationships unworkable, separate immigrants from the evidence they need to present in court, and make family visits so costly that they rarely—if ever—occur., 97127=[7]Dr. Dora Schriro, special advisor on ICE Detention and Removal, US Immigration and Customs Enforcement, “Immigration Detention Overview and Recommendations,” October 6, 2009, http://www.ice.gov/doclib/about/offices/odpp/pdf/ice-detention-rpt.pdf (accessed May 11, 2011)., 71544=1242, 116289=[38]The formula is a rough estimate based on the following assumptions. A transfer requires the presence of at least two guards. In 2007 guards were compensated at a rate of $16 per hour. See Amendment of Solicitation/Modification of Contract between ICE and Lincoln County, Troy, Missouri, “The purpose of this modification is to add Article XVIII (Guard/Transportation Services) to this agreement,” August 23, 2007 (“At least two (2) qualified law enforcement or correctional officer personnel employed by the Service Provider under their policies, procedures and practices will perform services.”). In addition, billing for transportation costs is based on the IRS standard mileage rate for automobiles of $0.50 per mile in FY 2010 (http://www.irs.gov/newsroom/article/0,,id=216048,00.html). Depending on the number of detainees transported in a transfer, more than two guards may be required. In addition, hourly rates for guards may have increased since 2007. Therefore, we believe that these estimates for ground transportation costs are conservative., 89007=ICE did not provide a data key or code book for deciphering the data. After exploring the database, researchers determined that of the 18 included variables, five variables were either completely empty or contained major data entry flaws. For example, the variable “Apprehension Date” has a large percentage of entries (over 120,000 people) with the same date of apprehension: 1/1/2001. This is clearly a result of a data management error such as a wrongly labeled bulk import., 30092=A report issued in October 2009 amplified the rationales for ICE detention reform. In that report, Special Advisor to ICE Dora Schriro recommended that “[d]etainees who are represented by counsel should not be transferred outside the area unless there are exigent health or safety reasons, and when this occurs, the attorney should be notified promptly.”[7], 102096=[18]Dr. Dora Schriro, special advisor on ICE Detention and Removal, US Immigration and Customs Enforcement, “Immigration Detention Overview and Recommendations,” October 6, 2009, http://www.ice.gov/doclib/about/offices/odpp/pdf/ice-detention-rpt.pdf, p. 24 (accessed May 11, 2011)., 141386=© 2015 Human Rights Watch, 73620=Source for AILA membership numbers: email from Amanda Walkins, Member Outreach Associate, American Immigration Lawyers Association to Human Rights Watch, May 2, 2011., 52925=In February 2009 ICE wrote to Human Rights Watch to state its intention to minimize detainee transfers. As shown in Figure 3, below, other than a peak in March 2010, which also saw an overall increase in detention episodes, the number and rate of detention episodes utilizing transfers has decreased slightly since ICE stated its intention to reduce transfers in February 2009. While this may show an informal commitment to reducing the practice, there have been no official policy reforms aimed at reducing transfers. This very slight decrease is therefore unlikely to indicate a continuing trend., 40355=Even when an attorney is willing to attempt long distance representation, the issue is entirely subject to the discretion of immigration judges, whose varying rules about phone or video appearances can make it impossible for attorneys to represent their clients. In other cases, detainees must struggle to pay for their attorneys to fly to their new locations for court dates, or search, usually in vain, for local counsel to represent them. Transfers create such significant obstacles to existing attorney-client relationships that ICE’s special advisor, Dora Schriro, recommended in her October 2009 report that detainees who have retained counsel should not be transferred unless there are exigent health or safety reasons.[18], 100966=[15]Human Rights Watch telephone interview with Kevin H. (pseudonym), Otero County Processing Center, Chaparral, New Mexico, February 11, 2009., 100136=[13]Executive Office of Immigration Review, “FY 2010 Statistical Year Book,” http://www.justice.gov/eoir/statspub/fy10syb.pdf (accessed May 11, 2011), p. 23., 70710=2674, 33240=Therefore, with the assistance of the Transactional Records Access Clearinghouse at Syracuse University (TRAC), we filed a follow-up request for data about detainee transfers under the Freedom of Information Act (FOIA) in February 2010. We specifically requested data that would allow us to determine the starting and ending location for each transferred detainee. In November 2010 we received data from ICE in response to our request., 106265=[28]Human Rights Watch, Deportation by Default: Mental Disability, Unfair Hearings, and Indefinite Detention in the US Immigration System, July 25, 2010, http://www.hrw.org/en/reports/2010/07/26/deportation-default-0., 115718=$373.88 = price per flight hour per seat charged by Justice Prisoner and Alien Transportation Service (JPATS) of the US Marshals Service to ICE, on average between fiscal years 2006 and 2011 and among all types of aircraft frame. Letter from William E. Bordley, Associate General Counsel/FOIPA Officer, US Department of Justice, United States Marshals Service, to Human Rights Watch, regarding freedom of information/privacy act request no. 2011USMS17132, March 3, 2011., 48630=The data represent all 2,271,911 non-citizens held in ICE detention between October 1, 1998 and April 30, 2010. These non-citizens account for 2,869,323 episodes of detention, as some individuals were detained by ICE multiple times. The data show that 1,159,568, or 40 percent of all detainees, experienced at least one transfer during their detention (they are referred to here as “transferred detainees”). Over 46 percent of transferred detainees (505,787 detainees) were transferred two or more times. We found that 16.7 percent of transferred detainees experienced three or more transfers, with over 3,400 detainees experiencing 10 or more transfers. One detainee was transferred between facilities 66 times., 90667=The last date included in the database was May 25, 2010, which corresponds to 64 percent of fiscal year 2010. Therefore, we developed estimates for the remainder of FY2010.  Estimated FY2010 will be labeled “Estimated.” Because the volume of ICE actions follows an annual pattern, with drops in enforcement actions around the fiscal year changeover, we did not use a linear rate for estimates. Rather, estimates were developed by using rate ratios determined using data from 2007 through 2009 in an attempt to improve accuracy. These ratios compared the volume of ICE detentions, transfers, and deportations from October through April to May through September. A ratio of 1:1 would mean that the volume from October to April would equal the volume from May to September. The averaged ratio of the previous three fiscal years was applied to the October through April 2010 data to estimate the aggregate sums for the remainder of 2010., 103465=[21]Human Rights Watch interview with Miguel A. (pseudonym), Port Isabel Service Processing Center, Los Fresnos, Texas, April 23, 2008., 112320=C = distance (over 475 miles) traveled by each detainee. The 475-mile cut off is based on a comparison between the Internal Revenue Service (IRS) standard mileage rate for automobiles in FY 2010, which was $0.50 per mile (http://www.irs.gov/newsroom/article/0,,id=216048,00.html), and flights on commercial carriers between a variety of destinations, to determine at what distance a prudent decision-maker might choose to transport detainees by plane as opposed to over land (see table below). Some of the flight costs were based on rates that included one stop-over, since the US Marshalls described using stopovers while transporting immigrant detainees. Email from Steve Blando, US Marshals Service Headquarters, to Human Rights Watch, May 30, 2008 (“On average an alien may move 1.4 times before reaching final destination”)., 97633=[8]Letter from Jane Holl Lute, deputy secretary of the Department of Homeland Security, to Michael Wishnie and Paromita Shah, July 24, 2009, http://www.nationalimmigrationproject.org/legalresources/Immigration%20Enforcement%20and%20Raids/Detention%20Standards%20Litigation/DHS%20denial%20-%207-09.pdf (accessed May 11, 2011) (denying the “Petition for Rulemaking to Promulgate Regulations Governing Detention Standards for Immigration Detainees”)., 87730=As noted above, our conservative estimate of $366 million dollars for detainee transfers between 1998 and 2010 does not include other costs that may be associated with transfers, such as flights made by carriers more costly than the Justice Prisoner and Alien Transportation System (JPATS); personnel time spent on paperwork or other administrative tasks; costs of additional court time, court delays, or lengthened detention caused by transfers; costs associated with needless transfers of persons who are found to be eligible for bond and therefore are unnecessarily detained; or costs associated with duplicative medical screenings or tests. Therefore, without better public information on ICE’s operational budget related to transfers, it is impossible to conclude whether transfers result in net costs or savings for the agency., 34234=Subsequently, in February 2011, we wrote to Secretary of Homeland Security Janet Napolitano to ask for an improved policy on transfers. While ICE continues to signal that improvements to its internal transfer policies are forthcoming, almost two years after the initial promise of reform, no significant policy changes have been made., 105477=[26]Human Rights Watch telephone interview with Georgina V. (pseudonym), sister of detainee, Brooklyn, New York, January 23, 2008., 101332=[16]Human Rights Watch interview with Michael M. (pseudonym), Pearsall Detention Center, Pearsall, Texas, April 25, 2008., 96661=[6] US Department of Homeland Security, Office of Public Affairs, “2009 Immigration Detention Reforms,” Fact Sheet, August 6, 2009, http://www.aila.org/content/default.aspx?bc=1016%7C6715%7C12053%7C26286%7C31038%7C29726 (accessed April 29, 2011)., 98300=[9]“Update: ICE Agrees to Reduce Detainee Transfers,” Human Rights Watch news release, March 29, 2010, http://www.hrw.org/en/news/2010/03/29/update-ice-agrees-reduce-detainee-transfers., 30867=In December 2009 Human Rights Watch published Locked Up Far Away, which documented 1.6 million transfer movements of immigrant detainees. We intensified advocacy efforts with ICE, asking it to impose some reasonable limits on the transfers of immigrant detainees by changing the agency’s internal policies on transfers. While enforceable regulatory or legislative checks on the use of transfers would be the most protective solutions to this problem, ICE has refused to promulgate enforceable regulations on detention conditions and operations.[8]Congress has not acted either. We therefore pressed ICE to make internal policy reforms to its PBNDS., 7728=As a result, most detainees will be loaded at some point during their detention onto a government-contracted car, bus, or airplane and transferred from one detention center to another: 52 percent of detainees experienced at least one such transfer in 2009. And numbers are growing: between 2004 and 2009, the number of transfers tripled. In total, some 2 million detainee transfers occurred between 1998 and 2010., 6049=Detained Immigrants Moved Repeatedly, Impeding Hearings, New 1998-2010 Data Reveal, 103836=[22]Shoba Sivaprasad Wadhia, “Under Arrest: Immigrants’ Rights and the Rule of Law,” University of Memphis Law Review, vol. 38, Summer 2008, p. 853., 115405=525 = number of miles traveled per flight hour. (The “typical cruise speed” of a Boeing 737 at 35,000 feet is about 525 mph). The Boeing Company, “Commercial Airplanes: 737 Family,” http://www.boeing.com/commercial/737family/pf/pf_800tech.html (accessed May 11, 2011)., 69825=Received Transfers 1998 – 2010, 101676=[17] Human Rights Watch telephone interview with Holly Cooper, immigration attorney and clinical professor of law, University of California Davis School of Law, Davis, California, January 27, 2009., 84332=For example, although none of the detainees interviewed for our 2009 report Locked Up Far Away had been transferred for medical reasons, it is certainly the case that some percentage of transfers are completed in order to provide immigrant detainees with necessary medical care, and that providing such care prevents illness, loss of life, and costly lawsuits. However, there is no way to estimate these savings since the agency does not make public, or even record in a centralized database, the reasons for detainee transfers.[36]  , 69976=AILA Members as of May 2011}",
    "lastModified": "Sat, 01 Aug 2015 04:30:58 GMT",
    "textBeforeTable": "As shown in Figure 1, below, transfers have increased steadily over time. Cumulatively, between the beginning of fiscal year 1999 and April 2010, 41 percent of all detention episodes included at least one transfer between facilities. In fiscal year 1999, 23 percent of detention episodes included one or more transfers between facilities, but in fiscal year 2009, 52 percent of detention episodes included one or more transfers. Figure 2 illustrates the percentage of detention episodes experiencing transfer between 1998 and 2010. Table 1 shows the total number of transfer movements for each year between 1998 and 2010. Transfers over Time Most (1,045,620) transferred detainees were male, 113,814 were female, and 134 were listed as unknown gender. Most transferred detainees were from Mexico (511,945), Honduras (133,062), and Guatemala (131,691). Shockingly, 38 were from the United States (2 females, 36 males). Why so many of those transferred were listed as being United States nationals is beyond the scope of our analysis. However, we note that previous analysis performed by Human Rights Watch on ICE datasets has revealed serious problems with ICE data management.[27]Moreover, our recent research into the experiences of detainees with mental disabilities revealed several troubling cases of US citizens who were kept in immigration detention for years, and experienced multiple transfers during their time in detention, despite the fact that their US citizenship should have negated any ICE involvement.[28]  The data represent all 2,271,911 non-citizens held in ICE detention between",
    "textAfterTable": "Table 3 – Top 10 Facilities Utilizing Transfers   Originating Facility     State     Circuit   Total Transfer Actions # of Facilities Transferring To Total Outbound Transfers # of Facilities Receiving From Total Inbound Transfers Los Custody Case Holding Facility, SAN PEDRO CA 9th Cir. 283,218 301 150,200 251 133,018 FLORENCE STAGING FACILITY AZ 9th Cir. 205,673 212 120,744 271 84,929 HARLINGEN STAGING FACILITY TX 9th Cir. 179,190 181 112,890 197 66,300 MIRA LOMA DET. CENTER CA 9th Cir. 119,118 97 56,433 94 62,685 FLORENCE SPC AZ 9th Cir. 111,553 141 28,508 150 83,045 YORK COUNTY JAIL PA 3rd Cir. 100,776 184 42,869 225 57,907 WILLACY COUNTY DETENTION CENTER TX 5th Cir. 97,040 66 29,585 102 67,455 LAREDO CONTRACT DET. FACILITY TX 5th Cir. 76,069 126 59,627 165 16,442 SOUTH TEXAS DETENTION COMPLEX TX 5th Cir. 74,023 92 17,780 194 56,243 HOUSTON CONTRACT DET. FACILITY TX 5th Cir. 71,456 141 25,507 314 45,949 Table 4 shows the variation between the states that received transfers and those from which transfers originated. Only Pennsylvania, Texas, New York, and Alabama were in the top ten states for both receiving and sending transfers. Louisiana received 19 percent while California sent 12 percent of interstate transfers. Table 4 – Top Ten Originating/Receiving States for Detainee Transfers Originating",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}