{
    "relation": [
        [
            "Year",
            "1999",
            "2000",
            "2001",
            "2002",
            "2003",
            "2004",
            "2005",
            "2006",
            "2007",
            "2008",
            "2009",
            "2010",
            "Totals",
            "Playoffs"
        ],
        [
            "Team",
            "PHI",
            "PHI",
            "PHI",
            "PHI",
            "PHI",
            "PHI",
            "PHI",
            "PHI",
            "PHI",
            "PHI",
            "PHI",
            "WAS",
            "",
            ""
        ],
        [
            "Games",
            "12",
            "16",
            "16",
            "10",
            "16",
            "15",
            "9",
            "10",
            "14",
            "16",
            "14",
            "12",
            "154",
            "12"
        ],
        [
            "Games Started",
            "6",
            "16",
            "16",
            "10",
            "16",
            "15",
            "9",
            "10",
            "14",
            "16",
            "14",
            "12",
            "<b>148</b>",
            "12"
        ],
        [
            "Attempts",
            "216",
            "569",
            "493",
            "361",
            "478",
            "469",
            "357",
            "316",
            "473",
            "571",
            "443",
            "437",
            "<b>5,054</b>",
            "419"
        ],
        [
            "Completions",
            "106",
            "330",
            "285",
            "211",
            "275",
            "300",
            "211",
            "180",
            "291",
            "345",
            "267",
            "253",
            "<b>2,977</b>",
            "249"
        ],
        [
            "Completion %",
            "49.1",
            "58.0",
            "57.8",
            "58.4",
            "57.5",
            "64.0",
            "59.1",
            "57.0",
            "61.5",
            "60.4",
            "60.3",
            "57.9",
            "<b>58.9</b>",
            "59.4"
        ],
        [
            "Yards",
            "948",
            "3,365",
            "3,233",
            "2,289",
            "3,216",
            "3,875",
            "2,507",
            "2,647",
            "3,324",
            "3,916",
            "3,553",
            "3,377",
            "<b>35,139</b>",
            "2,630"
        ],
        [
            "Yards/Attempt",
            "4.9",
            "5.91",
            "6.56",
            "6.34",
            "6.73",
            "8.26",
            "7.00",
            "8.36",
            "7.00",
            "6.90",
            "8.00",
            "7.2",
            "<b>7.0</b>",
            "6.26"
        ],
        [
            "Touchdowns",
            "8",
            "21",
            "25",
            "17",
            "16",
            "31",
            "16",
            "18",
            "19",
            "23",
            "22",
            "14",
            "<b>225</b>",
            "18"
        ],
        [
            "Interceptions",
            "7",
            "13",
            "12",
            "6",
            "11",
            "8",
            "9",
            "6",
            "7",
            "11",
            "10",
            "15",
            "<b>111</b>",
            "12"
        ],
        [
            "Rating",
            "60.1",
            "77.8",
            "84.3",
            "86.0",
            "79.6",
            "104.7",
            "85.0",
            "95.5",
            "89.9",
            "86.4",
            "92.9",
            "77.1",
            "<b>85.8</b>",
            "80.1"
        ]
    ],
    "pageTitle": "Donovan McNabb - American Football Wiki",
    "title": "",
    "url": "http://americanfootball.wikia.com/wiki/Donovan_McNabb",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00201-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 6217859,
    "recordOffset": 6169984,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27494=In his first full season as a NFL starter in 2000, McNabb finished second in the Associated Press MVP voting (24-11) to St. Louis Rams running back Marshall Faulk, who set the NFL record for most touchdowns scored in a season.[18] McNabb made his prime time debut on ESPN against Atlanta at home on October 1, with his first 300-yard passing game in a 38-10 victory and the Eagles' first 300-yard passer since Bobby Hoying against the Cincinnati Bengals at home on November 30, 1997. McNabb's 55 pass attempts at Pittsburgh in a come-from-behind 26-23 overtime victory on November 12 were a career high and the fourth-highest total in team history. He was named the NFC Offensive Player of the Week after accounting for 90.7% of the offense in a 23–20 victory at Washington on November 26. His 125 rushing yards were the most by an NFL quarterback since the Chicago Bears' Bobby Douglass (127 on December 17, 1972) and was the sixth-best rushing effort by a quarterback since 1940 when the T formation was introduced. He threw for a career-high 390 passing yards and four touchdowns in a 35-24 victory at Cleveland on December 10 en route to NFC Offensive Player of the Week honors. McNabb led the Eagles to their first playoff appearance since 1996, where they defeated the favored Tampa Bay Buccaneers 21–3 before losing to the New York Giants 20–10., 33996=In week 11 of the 2002 season, McNabb suffered a broken ankle. On the third play of the game against the Arizona Cardinals, he was sacked by the Cardinals' Adrian Wilson and LeVar Woods. He fumbled the ball, fell to the ground, and held his right leg. He went to the locker room to have his ankle taped, but returned for the Eagles' second drive. His injury was reported to be a sprained ankle, but X-rays after the game revealed that McNabb had broken his fibula in three places. During the game, however, he was 20-of-25 passing, with 255 yards and four touchdowns. McNabb was out for the last six weeks of the regular season. A dominant defense helped A. J. Feeley and Koy Detmer go a combined 5-1 to finish the season. McNabb returned to face the Atlanta Falcons in the playoffs, but he recovered slowly. The Eagles defeated the Falcons 20–6, but were upset at home by the Tampa Bay Buccaneers 27–10 in the NFC championship game., 76249=On October 18, it was announced that McNabb would no longer be the starting quarterback for the Vikings as the job was given to rookie Christian Ponder for the remainder of the season.[41] McNabb went 1-5 as a starter for the 3-13 Vikings, throwing 4 touchdowns to 2 interceptions, completing 60.3 percent of his passes and posting a respectable 82.9 quarterback rating. The McNabb-led Vikings were able to defeat the Arizona Cardinals, who were led by McNabb's successor in Philadelphia, Kevin Kolb in a 34-10 blowout.[42], 60503=On January 18, McNabb and his Eagles were defeated by the Arizona Cardinals 32–25 in the NFC Conference Championship, ending their season. McNabb threw for 375 yards on 47 attempts, with three touchdowns, and one interception off a deflected pass, most of this in the second half after his Eagles only managed 6 points to the Cardinals' 24 in the first half. McNabb also ran for 31 yards on two carries. Despite his excellent second-half performance, McNabb was criticized by the television broadcast commentators and other media sources for accuracy problems during downs and series of consequence.[30], 90262=McNabb also played basketball at Syracuse University as a reserve guard. In the 1996 NCAA Men's Division I Basketball Tournament national championship game against the University of Kentucky Wildcats, McNabb played against his former high school teammate Antoine Walker.[56], 73628=On December 17, 2010, head coach Mike Shanahan relegated McNabb to the 3rd quarterback position for the rest of this season, stating that he wanted to evaluate backup Rex Grossman in game play., 48735=McNabb and the Eagles began the 2006 season at 4-1 before stumbling to 5-4 heading into a week 11 game with Tennessee Titans on November 19. At that point, McNabb had been having an up-and-down season. His weekly passing ratings ranged from a lofty 113 all the way down to 65. Overall, the team was struggling. During the game, McNabb tore the anterior cruciate ligament (ACL) and meniscus in his right knee while jumping out of bounds, ending his season, the third time in five years McNabb had gone down with six or more games remaining in the regular season.[23] Eagles officials stated that his rehabilitation would likely last eight to twelve months, which completely ended his 2006 season and even raised questions as to whether he would be ready to begin playing by the beginning of the 2007 season. In the meantime, veteran backup quarterback Jeff Garcia took McNabb's place as the Eagles' starting quarterback. Garcia had success, leading the Eagles from 5-5 after the Tennessee game to 10-6 and winners of the NFC East Division. The Eagles went on to win their home playoff game in the Wild Card round of the playoffs against the New York Giants, 23-20, with Garcia under center. However, in the following divisional round they were beaten by the New Orleans Saints in the Superdome, 27-24., 85197=Through the 2010-11 NFL season, McNabb ranks fourth best all-time in career interception percentage (2.20%) among NFL quarterbacks. Among quarterbacks with at least 1,500 pass attempts, only Aaron Rodgers (1.99%), Neil O'Donnell (2.11%), and Tom Brady (2.19%) have a lower career interception percentage than McNabb.[24], 35580=In late September 2003, McNabb was the subject of very controversial comments made by Rush Limbaugh, who worked as a commentator for ESPN at the time, stating that McNabb was overrated and that, \"I think what we’ve had here is a little social concern in the NFL. The media has been very desirous that a black quarterback do well\".[19] The comments came after the Eagles began the season 0–2, losing to defending Super Bowl champion Buccaneers and eventual champion New England, both losses coming in their newly opened stadium, Lincoln Financial Field. There had been much discussion about the merit of these comments, which resulted in Limbaugh's resignation from ESPN. Football writer Allen Barra argued that Limbaugh's comments were in line with McNabb's statistical performance at the time.[20], 29867=McNabb was selected as a first alternate to the NFC Pro Bowl squad in 2000 (behind Daunte Culpepper, Jeff Garcia, and Kurt Warner). When Warner was unable to participate due to injury, McNabb took his spot and led the NFC on a touchdown scoring drive in his first series. He accounted for 74.6% of the team's total net yards in 2000. Only Carolina's Steve Beuerlein (75.3%) and San Francisco's Garcia (75.1%) had a higher percentage. His 629 rushing yards in 2000 were the highest among NFL quarterbacks and, at the time, the fourth-highest total ever (968 by Bobby Douglass in 1972; 942 by Randall Cunningham in 1990; and 674 by Steve McNair in 1997. Michael Vick has since eclipsed that total three times). His six rushing touchdowns in 2000 were the most by an Eagles quarterback since Randall Cunningham, who also had six in 1988. McNabb broke the club's single season record for most attempts (569) and completions (330) in 2000, marks previously set by Cunningham (560 and 301 respectively) in 1988. He was named 2000 NFL Player of the Year by CBS Radio and the Terry (Bradshaw) Awards on Fox Sports and was named to the All-Madden team., 84049=McNabb holds the record for most consecutive pass attempts completed with 24 over two games in 2004 against the New York Giants (his final 10 passes on November 28, 2004) and Green Bay Packers (his first 14 passes on December 5, 2004).[24] Mark Brunell and David Carr hold the record for most consecutive completed passes in a single game with 22.[46] McNabb also completed 25 consecutive passes against the San Diego Chargers on October 23, 2005, but this record is not counted by the NFL as it included a spiking of the ball to stop the clock at the end of the half. The 2005 game was also noteworthy for Coach Reid calling for McNabb to have 25 pass attempts in a row, without interruption by a running play.[47], 59862=On January 11, 2009, McNabb led the Eagles past the Giants in the divisional round of the playoffs. The Eagles won 23–11 (it was the first ever NFL game to finish with the score of 23-11) and advanced to the NFC Championship game against the Arizona Cardinals, whom they had beaten earlier in the season. In the game, McNabb was penalized for unsportsmanlike conduct when, after being tackled into the Giants' sideline after a lengthy run, he picked up the Giants' coaching phone in jest., 87825=McNabb and his college sweetheart, Raquel Ann Sarah \"Roxie\" Nurse, were married in June 2003.[48] They have four children: daughter Alexis, who was born in 2004,[49] twins Sariah and Donovan Jr. who were born in 2008[50] and Devin James who was born in 2009.[51][52] The family splits its time between homes in Moorestown Township, New Jersey,[53] an affluent suburb of Philadelphia, and Chandler, Arizona.[54], 41526=In the playoffs, McNabb led the Eagles to their second Super Bowl trip ever, with victories over the Minnesota Vikings 27-14 and Atlanta Falcons 27-10. Owens was not in the lineup during the two playoff victories, and was recovering from a broken ankle. McNabb became only the third African-American quarterback to start in a Super Bowl after Doug Williams in the 1987 season and Steve McNair in 1999., 45111=McNabb's 2005 season began with turmoil and ended on the injured reserve list. Terrell Owens had called out McNabb repeatedly since the Super Bowl XXXIX loss and refused to speak with McNabb. Despite not speaking with his main target and all the distractions that came with the Owens controversy, McNabb managed to be named the NFC's Player of the Month for September. That month, McNabb threw for 964 yards, eight touchdowns and only two interceptions in three games, leading the Eagles to a 2-1 record. McNabb carried that momentum into October as he went 33-for-48 (68.8 completion percentage), threw for 369 yards and three touchdowns en route to leading the Eagles to a memorable come-from-behind victory at an unfriendly Arrowhead Stadium against the Kansas City Chiefs. McNabb could not keep the momentum rolling, however, as the Eagles lost four straight games. Over that span, McNabb posted a quarterback rating higher than 72 only once, on November 6, at the Washington Redskins. After playing with a sports hernia and sore thumb, McNabb's season was finally over after a disastrous effort at home on November 14 on Monday night against the rival Dallas Cowboys. McNabb was intercepted by Roy Williams towards the end of the game, and tried to tackle the defender when Scott Shanle came in and tackled McNabb to the ground. McNabb had injured his groin on the play and was placed on the injured reserve list later that week.[22] Mike McMahon replaced him at quarterback, and went 2–5 as a starter, with the Eagles finishing the season with a 6–10 record overall. Though low for his standards, McNabb put up respectable numbers in 2005. In nine games, he threw for 2,507 yards, 16 touchdowns and nine interceptions. To go along with that, he completed 59.1% (211-357) of his passes. Prior to his season-ending injury, McNabb was on pace to throw for 4,457 yards, which would have easily eclipsed his career high of 3,875, set in 2004., 23533=McNabb saw his first NFL regular season action in the second half against the Tampa Bay Buccaneers in a 19-5 home loss on September 19. He made his first career start at home against Washington on November 14, completing 8 of 21 passes for 60 yards in a 35-28 win. He also had nine carries for 49 rushing yards and led the team to a pair of successful two-point conversions (one rush and one pass). He was the first Eagles rookie to start at quarterback since Brad Goebel, and the first Eagles rookie draft pick to start since John Reaves in 1972. With the win, McNabb became the first Eagles rookie quarterback to win his first NFL start since Mike Boryla (December 1, 1974 against Green Bay) and the first Eagle quarterback to win his first start since Ty Detmer (October 13, 1996 against New York Giants).[16], 58875=On December 7, McNabb went 19-for-30 with 191 yards and one touchdown and also rushed for 20 yards in a 20–14 win over the New York Giants., 36815=Despite the slow beginning in the 2003 season, McNabb again led his team to the NFC Championship game. Although the slow start hindered his overall statistics for 2003, McNabb had the highest quarterback rating (97.5) in the NFL for the second half of the season and also completed over 62% of his passes for over eight yards per attempt. With Philadelphia's 14–3 home loss to the underdog Carolina Panthers in the 2003 NFC championship game, McNabb became the first NFL quarterback since Danny White of the Dallas Cowboys (1980–1982) to lead a team to three consecutive defeats in conference title games, prompting some observers to conclude that McNabb \"chokes\" in big games (his cumulative passer rating in the three conference championship games was 50.5 - a figure that is approximately 10 points lower than what the worst quarterback in the league earns over the course of a typical year). McNabb was knocked out of the NFC title game after being hit on the ground by Panthers' linebacker Will Witherspoon after he had been tripped up on a broken play., 50831=Having played nearly up to full speed in the preseason games, it was decided that McNabb would return to the field several months short of the full year-long recovery expected of an ACL injury. In the season-opener at Green Bay, the Eagles and McNabb suffered a 16-13 loss. McNabb had his share of problems, completing less than half of his passes for 184 yards and one touchdown. The Eagles lost their first home game of the season to the rival Washington Redskins, 20-12, though his numbers improved. As week 3 approached, skeptics had already wondered whether McNabb still had his skill that propelled him to success in the past. The Eagles defeated the Detroit Lions in a 56-21 win in week 3. McNabb completed 21 out of his 26 attempted passes for 381 yards. Four of those passes went for touchdowns (three of them went to Kevin Curtis). His brilliant performance against the Lions was highlighted by his first perfect (158.3) quarterback rating game. However, week 4 did not prove to be as good as the Eagles thought it would be. The Eagles endured yet another loss, this time to the New York Giants. The Giants' defense, led by defensive end Osi Umenyiora, sacked McNabb a record-tying 12 times.[24] McNabb completed 15 out of 31 attempted passes for 138 yards and no touchdowns. In the week 6 game against the Jets, McNabb completed 22 out of 36 attempted passes for 278 yards total. McNabb also had a touchdown pass to Curtis, plus one interception. With the help of placekicker David Akers, the Eagles went on to win, 16–9. McNabb had stated before the Dallas Cowboys game that the NFC East title went through Philadelphia, so Dallas responded with a 38-17 win on Sunday Night Football. Against the Redskins, McNabb completed a high percentage of passes and ended with a quarterback rating of 138.5 in a tough win. In the week 11 game against the Miami Dolphins, McNabb sprained his ankle and injured his right (throwing side) thumb. As a result, McNabb had been ruled out for the game against the New England Patriots, and was replaced by A. J. Feeley, who, although gave a valiant effort through two games, came up short. Feeley threw seven interceptions in two games (four coming in the opening and closing drives of both games). During a win against the Cowboys, sideline reporter Pam Oliver reported during the game that McNabb indicated that he did not expect to be back in Philadelphia for the 2008 season. McNabb later indicated that this was not true, and stated that although he believed rookie Kevin Kolb's time would come, he would be an Eagle the next season.[25], 42496=McNabb led his team against the New England Patriots in Super Bowl XXXIX. McNabb struggled at times, throwing three crucial interceptions. Two of these were thrown in New England territory, and one of those two was inside the twenty-yard line. The final interception was during a last-gasp Hail Mary at the end of the game. He was also sacked four times. Controversy surrounded the end of the game, as center Hank Fraley claimed that McNabb was seriously ill. Wide receiver Freddie Mitchell claimed that he had to call a few plays due to McNabb's illness. However, in an interview with NBC, McNabb said he was not sick and did not throw up. He just said he was tired. Some reports claim that McNabb had the wind knocked out of him by an earlier hit while others assert that he was unduly fatigued (interestingly, McNabb also suffered from a bout of nausea at the conclusion of a 2002 regular-season game played at Alltel Stadium, where Super Bowl XXXIX was contested). An article written by a staff member of the Philadelphia Inquirer refuted allegations of McNabb throwing up during the Super Bowl and even labeled the alleged incident \"a myth\". Both head coach Andy Reid and McNabb have denied any physical problems that led to the puzzlingly slow pace of play, but they did not address mental problems. McNabb finished the game with 30 completions for 357 yards, the third highest total for both categories in Super Bowl history, and three touchdowns. The Eagles lost 24–21., 61516=In the 2009 NFL Draft, the Eagles picked Missouri Tigers star wide receiver Jeremy Maclin to add to McNabb's receiving corps, with Kevin Curtis and DeSean Jackson., 9659=McNabb was born and raised in Chicago, Illinois, and he attended Mount Carmel High School where, as a sophomore he was a teammate of future NFL Players Simeon Rice and Matt Cushing, as they helped Mount Carmel win the 1991 State Championship over Wheaton Central.[2][3] As a senior, he led the team to a Chicago Prep Bowl championship. McNabb also excelled in track and field during his high school years, and played on the school basketball team with Antoine Walker. In a controversial move, McNabb played volleyball his junior year, helping to establish the program in its first year at the school., 25010=McNabb threw the first touchdown pass of his career (six yards to tight end Chad Lewis) vs. Indianapolis in a 44-17 home loss on November 21, 1999.[17] McNabb went on to start six of the Eagles' final seven contests (missing the December 19 home game against New England, a 24-9 victory, due to injury)., 55923=McNabb caused another mild stir in camp when he suggested that the Eagles should not have lost a game to any of their NFC East opponents the previous season. He felt that they were just a few plays away from being a playoff team. He even went on to say, \"I still put us at the top of the NFC.\"[28] In week 1 of the 2008 NFL season, McNabb threw for 361 yards (the most of any quarterback that week) and three touchdowns which included a 90-yard toss to Hank Baskett at the end of the second quarter. This performance led to him receiving the FedEx Air Player of the Week award. In week 3 against the Steelers, McNabb threw his 176th career touchdown, passing Ron Jaworski and becoming the Eagles' all-time touchdown pass leader., 33416=McNabb earned his second trip to the Pro Bowl (was originally elected as an alternate) following the 2001 season after combining for 3,715 yards of total offense and establishing career highs in touchdown passes (25) and quarterback rating (84.3). Including playoffs, he threw touchdown passes in 15 of 18 games and two-or-more in 12 of those games. He was named by his teammates as the club's offensive MVP in 2000 and 2001. During the off-season, McNabb signed a new contract with the Eagles worth $115 million over 12 years, with a $20.5 million signing bonus., 5322=Donovan Jamal McNabb (born November 25, 1976) is a former American football quarterback. He was the Philadelphia Eagles' quarterback from 1999 to 2009 and spent the 2010 season with the Washington Redskins and a portion of the 2011 season with the Minnesota Vikings. In college, McNabb played football and basketball for Syracuse University. The Eagles selected him as the second overall pick of the 1999 NFL Draft., 13786=After redshirting in 1994, his first year at Syracuse, McNabb went on to start every game during his college career, compiling a 35–14 record.[6] As a freshman, he completed the longest touchdown pass in Syracuse's history—a 96-yard throw against West Virginia University—in a game where he accounted for 354 total yards of offense;[7] he was named the Big East Conference's rookie of the year at the end of the season.[8] McNabb amassed 2,892 yards of total offense in his junior season to set a school record.[9] As a senior, he led Syracuse to a berth in the Orange Bowl against Florida as he completed 157 of 251 passes (62.5%) for 2,134 yards; he also pushed the eventual champions, the 1998 Tennessee Volunteers, to the limit in a very close game. His 22 touchdown passes tied the school's single season record, set by former Eagle Don McPherson in 1987. McNabb also rushed 135 times for 438 yards and 8 touchdowns. He ranked sixth in the nation with a 158.9 passing efficiency rating and 22nd in total offense, with 233.8 yards per game. He tied a school record with 4 touchdown passes against Cincinnati, and scored 5 touchdowns against Miami (3 rushing and 2 passing)., 41016=McNabb's finest moment of the season and of his career came that year in a week 13 game with fellow Super Bowl contenders the Green Bay Packers. After starting the game completing his first 14 passes (an NFL record), he led the Eagles to a 47-17 blowout victory. McNabb passed for an Eagles record 464 yards and 5 touchdowns, which all came in the first half. In 2010, it was ranked #1 by Eagles fans as the 'game of the decade.', 70378=In the first week of the 2010 season, McNabb and head coach Mike Shanahan led the Redskins to victory over the Dallas Cowboys. In week 2, McNabb nearly engineered a victory over the Houston Texans, passing for 426 yards (second most of his career), but came up just short of a victory when the Texans prevailed 30-27 in overtime. In week 4, on October 3, McNabb played against the Eagles for the first time, returning with the Redskins to Lincoln Financial Field in Philadelphia. Although McNabb posted only pedestrian statistics, the Redskins won 17-12. During pre-game introductions, McNabb received a standing ovation from Eagles fans, then hugged former coach Andy Reid at their post-game handshake.[33], 69571=In the press conference following the Eagles' loss to Dallas, and even up to April 1, Andy Reid stated that McNabb would remain the starting quarterback in Philadelphia for the 2010 season.[31] However, on April 4, the Eagles traded McNabb to the Washington Redskins in return for a second-round (37th overall) pick in the 2010 NFL Draft and a conditional third- or fourth-round pick in the 2011 NFL Draft.[32], 74983=On July 27, 2011 the Washington Redskins and the Minnesota Vikings came to an agreement on terms for a trade.[37] After restructuring his contract, Washington traded McNabb to Minnesota in exchange for a sixth-round draft pick in 2012 and a conditional sixth-round draft pick in 2013.[38] McNabb had been rumored as a possible addition to the Vikings for the past three years, in part due to his relationship with then-coach Brad Childress, the former Eagles Offensive Coordinator.[39] Vikings punter Chris Kluwe agreed to give McNabb his no. 5 jersey, in exchange for a $5,000 donation to Kick for a Cure, McNabb to promote Kluwe's band \"Tripping Icarus\" during a press conference, and an ice cream cone.[40], 38450=McNabb's defenders, however, argue that Philadelphia had the worst contingent of wide receivers in the NFL throughout McNabb's tenure with the team up to that point,[21] and perhaps in modern professional football history.Template:Citation needed In 2003, for example, Philadelphia's wide receivers caught only five touchdown passes - tying the record for fewest in a season since the regular-season schedule was lengthened to its present 16 games in 1978 and that, by going the entire months of September and October without having a wide receiver catch a touchdown pass, the 2003 Eagles became the first NFL team since 1945 not to have gotten a touchdown pass from any of its wide receivers in the first two months of a season., 6690=McNabb led the Eagles to four consecutive NFC East division championships (2001, 2002, 2003, and 2004), five NFC Championship Games (2001, 2002, 2003, 2004, and 2008), and one Super Bowl (Super Bowl XXXIX, in which the Eagles were defeated by the New England Patriots). Perhaps his most memorable play has become known as \"4th and 26\", which took place against the Green Bay Packers in the final minutes of a 2003 NFC Divisional playoff game., 15764=McNabb was named the Big East's offensive player of the decade for the 1990s,[10] and Big East Offensive Player of the Year an unprecedented three times from 1996–98,[8] as well as the first-team all-conference vote earner in each of his four seasons. Later, he was named to the Syracuse All-Century Football team.[11] He also spent two years as a reserve on the school's nationally ranked basketball team, including the 1996 squad that lost to Kentucky in the National Championship game., 67472=However, the wild-card rematch with Dallas would prove to be just as disastrous, if not worse. McNabb struggled early on and was unable to get the offense into a rhythm until it was too late. His lone score came in the second half off a meaningless touchdown to DeSean Jackson. Philadelphia would fall 34-14 to Dallas, marking the first time McNabb had ever lost a first-round playoff game. Despite there being many factors in Philadelphia's loss, such as the horrible play of the defense, lack of sufficient protection along the offensive line, and costly turnovers by Michael Vick and Leonard Weaver, McNabb was heavily criticized for the loss for failure to rally the team early and holding onto the ball for too long. Despite having had arguably one of his best seasons statistically in 2009, McNabb began to face criticism and speculation about his future with the Eagles. Many also criticized a scene of him emerging from the Cowboys stadium tunnel, dancing and playing air-guitar and concluded that he was not a serious leader and contender and called for his replacement by the seemingly more serious Kevin Kolb., 63328=McNabb reached 200 career touchdowns and 30,000 career yards passed in a win against the Washington Redskins on October 26, 2009 with a 45-yard touchdown pass to DeSean Jackson., 31811=McNabb led the Eagles in fourth-quarter comebacks in two wins vs. the Giants in 2001. At the Meadowlands on October 22, his 18-yard pass to James Thrash with 1:52 remaining gave the Eagles a 10-9 victory. He wiped out a 21-14 deficit on December 30, engineering two fourth-quarter scores as the Eagles clinched the NFC East title with a 24-21 over archrival New York Giants. His eight career playoff touchdowns trails only Ron Jaworski (9). He was named NFL Offensive Player of the Week after the NFC Divisional Playoff game at Chicago on January 19, 2002, completing 26-of-40 for 262 yards and two touchdowns passing and adding 37 yards and a touchdown on the ground, which was also the final touchdown at the old Soldier Field. He became only the fourth quarterback in Eagles history to pass for 3,000 yards in consecutive seasons - Sonny Jurgensen (1961–62), Ron Jaworski (1980–81), and Randall Cunningham (1988–90) were the others. McNabb's Eagles advanced to the NFC championship game for the first time since 1980, losing to the heavily favored St. Louis Rams., 55497=At the conclusion of the 2007 season, McNabb faced criticism for asking for \"playmakers\" on his yardbarker blog.[26] He did, however, deny he was taking a shot at anyone in particular, saying \"We were 8–8. There is room for improvement.\"[27], 21660=McNabb was drafted second overall by the Eagles, behind first pick Tim Couch, in the 1999 NFL Draft, a choice which was famously booed by Philadelphia fans present at the draft, most of whom were pushing for their team to draft University of Texas running back Ricky Williams.[15] McNabb was the second of five quarterbacks selected in the first 12 picks of a quarterback-rich class that was at that point considered the best quarterback draft since the famous Class of 1983. However, only McNabb and Daunte Culpepper would go on to have successful careers in the NFL; Tim Couch struggled with the Cleveland Browns and officially retired in 2007 after being cut by the Jacksonville Jaguars in a failed comeback bid, while Akili Smith and Cade McNown were out of the NFL by 2002. By 2006, only McNabb was still with the team that originally drafted him., 72375=In week 8, the Redskins played against the Detroit Lions. When the Redskins were losing 30-25 in the fourth quarter with 3:12 left, Shanahan benched McNabb for the two-minute drill in favor of backup quarterback Rex Grossman. On his first play Grossman fumbled the ball, which was recovered for a touchdown by Lions defensive tackle Ndamukong Suh, sealing the Lions' victory of 37-25. Shanahan stated in a press conference that McNabb would remain the Redskins' starting quarterback. On November 15, 2010 McNabb signed a five-year extension worth $78 million ($3.5 million guaranteed) with a chance to make it $88 million by completing incentives. The deal stated that if McNabb were not cut or traded at the conclusion of the 2010 season, he would receive a $10 million bonus.[35] The same day his Redskins suffered a 59-28 defeat by his former team, the Eagles, at home on Monday Night Football. McNabb finished the game going 17 of 31 for 295 yards with two touchdowns and three interceptions., 73838=McNabb had perhaps one of his worst years of his career since 1999, going down in touchdowns and up in interceptions. However, at the time McNabb was demoted to third string, he was on pace to total 4,156 passing yards for the season, which would have broken the Redskins' all-time franchise record, and been the first time he had exceeded the 4,000 yard mark in his career.[36], 77049=On December 1, 2011, McNabb requested and was granted his release from the team,[43] with a reported interest in joining the Houston Texans, Kansas City Chiefs or his hometown Chicago Bears, all three who had lost their starting quarterbacks for the season to injury, and were still making playoff pushes.[44] While the Texans and Chiefs had signed Jake Delhomme and Kyle Orton respectively prior to McNabb becoming a free agent, the Bears had not signed anyone and expressed interest in adding McNabb. It was ultimately decided that it was too late to add a free agent quarterback for the playoff hunt, as it would be tough to grasp their offense in the short amount of time.[45] The Bears wound up losing five straight games, and out of the playoffs., 89056=In 2002, McNabb, who holds a Bachelor of Science degree in speech communication from Syracuse University, was named to the institution's Board of Trustees; he is one of the youngest trustees to have served there.[55] It is stated on his website that he plans to use his speech communication degree when his playing days are over to become a broadcaster., 132656=Template:1999 NFL Draft Template:EaglesFirstPick Template:Eagles1999DraftPicks Template:Philadelphia Eagles starting quarterback navbox Template:Washington Redskins starting quarterback navbox Template:Minnesota Vikings starting quarterback navbox Template:NFL Quarterbacks with a Perfect Passer Rating Template:2005 Pro Bowl NFC starters Template:MaddenNFL-Athlete Template:Eagles75 Template:Wanamaker Athletic Award}",
    "lastModified": "Fri, 17 Apr 2015 06:10:16 GMT",
    "textBeforeTable": "NFL year-by-year statisticsEdit On December 1, 2011, McNabb requested and was granted his release from the team,[43] with a reported interest in joining the Houston Texans, Kansas City Chiefs or his hometown Chicago Bears, all three who had lost their starting quarterbacks for the season to injury, and were still making playoff pushes.[44] While the Texans and Chiefs had signed Jake Delhomme and Kyle Orton respectively prior to McNabb becoming a free agent, the Bears had not signed anyone and expressed interest in adding McNabb. It was ultimately decided that it was too late to add a free agent quarterback for the playoff hunt, as it would be tough to grasp their offense in the short amount of time.[45] The Bears wound up losing five straight games, and out of the playoffs. On October 18, it was announced that McNabb would no longer be the starting quarterback for the Vikings as the job was given to rookie Christian Ponder for the remainder of the season.[41] McNabb went 1-5 as a starter for the 3-13 Vikings, throwing 4 touchdowns to 2 interceptions, completing 60.3 percent of his passes and posting a respectable 82.9 quarterback rating. The McNabb-led Vikings were able to defeat the Arizona Cardinals, who",
    "textAfterTable": "McNabb has totaled 3,341 yards on 587 carries and 28 touchdowns rushing in his career, along with 362 yards on 63 attempts and three touchdowns in the playoffs. McNabb holds the record for most consecutive pass attempts completed with 24 over two games in 2004 against the New York Giants (his final 10 passes on November 28, 2004) and Green Bay Packers (his first 14 passes on December 5, 2004).[24] Mark Brunell and David Carr hold the record for most consecutive completed passes in a single game with 22.[46] McNabb also completed 25 consecutive passes against the San Diego Chargers on October 23, 2005, but this record is not counted by the NFL as it included a spiking of the ball to stop the clock at the end of the half. The 2005 game was also noteworthy for Coach Reid calling for McNabb to have 25 pass attempts in a row, without interruption by a running play.[47] Through the 2010-11 NFL season, McNabb ranks fourth best all-time in career interception percentage (2.20%) among NFL quarterbacks. Among quarterbacks with at least 1,500 pass attempts, only Aaron Rodgers (1.99%), Neil O'Donnell (2.11%), and Tom Brady (2.19%) have a lower career interception percentage than McNabb.[24] NFL records",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}