{
    "relation": [
        [
            "Date",
            "Aug 31",
            "Sep 7",
            "Sep 14",
            "Sep 28",
            "Oct 5",
            "Oct 12",
            "Oct 19",
            "Oct 26",
            "Nov 2",
            "Nov 9",
            "Nov 16",
            "Nov 23",
            "Dec 7",
            "Dec 14",
            "Dec 21"
        ],
        [
            "Opponent",
            "at Oregon St.",
            "Western Ore.",
            "at Toledo",
            "at Sam Houston St.",
            "Weber State",
            "at North Dakota",
            "Southern Utah",
            "at Montana",
            "at Idaho State",
            "Montana State",
            "at Cal Poly",
            "Portland State",
            "South Dakota St.",
            "Jacksonville St.",
            "Towson"
        ],
        [
            "Score",
            "W, 49-46",
            "W, 43-14",
            "L, 33-21",
            "L, 49-34",
            "W, 41-19",
            "W, 35-14",
            "W, 34-10",
            "W, 42-37",
            "W, 55-34",
            "W, 54-29",
            "W, 35-22",
            "W, 42-41",
            "W, 41-17",
            "W, 35-24",
            "L, 35-31"
        ],
        [
            "comp",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "att",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "pct",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "yds",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "y/a",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "td",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "int",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "sac",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "yds",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ]
    ],
    "pageTitle": "Jake Miller - Eastern Washington University Athletics",
    "title": "",
    "url": "http://www.goeags.com/sports/m-footbl/2013-14/Bios/Jake_Miller",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00296-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480714551,
    "recordOffset": 480693157,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{35981=1726, 35799=2011, 31677=2011: Miller, after nearly setting a school record with a 44.2 average per punt, was named to the College Sports Journal All-Freshman All-America Team. Earned honorable mention All-Big Sky Conference honors and was named to the Big Sky Conference All-Academic team. Miller was one of 20 players on the voting list for the inaugural Jerry Rice Award given by The Sports Network to the outstanding freshman in the FCS. Miller did not meet the minimum of 3.6 punts per game to qualify and be ranked in NCAA statistics. But if he did, his 44.26 average would have ranked third nationally in FCS. He had 39 attempts and would have needed 40 to qualify. The highest-ranked freshman in NCAA statistics was 15th and had a 41.91 average. Miller’s season average came just .16 from the school record of 44.42 yards per punt set by Jesse Nicassio in 2003. Miller had 10 punts of at least 50 yards, with a long of 59. His 59-yarder ranked 23rd in school history (now 24th), and he had three of 57 yards to rank 32nd (now 33rd). Ten of his 39 punts were downed inside the opponent 20-yard line. Against Cal Poly (11/12/11), Miller had all four of his punts travel at least 51 yards in EWU’s 53-51 triple-overtime victory. He had a pair of punts of 57 yards, another of 55 and one of 51. That effort earned him College Football Performance Awards National Punter of the Week honors and EWU’s special teams player of the week honor. He also earned honorable mention nationally by the College Football Performance Awards when he averaged 52.0 yards on two punts against Weber State (10/1/11), with both downed inside the 20. In his last 23 punts of the season, he averaged 46.6 yards per punt and had all 10 of his boots of 50 yards or longer., 36385=2012, 221856=Fax: (509) 359-2828, 221769=Cheney, WA 99004-2476, 221819=Phone: (509) 359-2463, 30366=2012: Was named to the Big Sky Conference All-Academic team. Miller had a school-record 74-yard punt versus Washington State (9/8/12), breaking the previous record of 71 set in 2006 by Ryan Donckers. Miller’s average of 43.3 yards per punt in 2012 ranks third all-time in EWU history, just behind his No. 2 ranking with a 44.2 average in 2011 (the school record is 44.4). Of his 40 punts, six were for at least 50 yards and 15 were downed inside the opponent 20-yard line. His average was third in the Big Sky. He averaged 46.0 yards on four punts with a long of 53 versus Montana (9/29/12) to earn honorable mention Performer of the Week accolades in FCS by College Football Performance Awards. Just two games earlier, Miller received the same honor for his performance at his former school, Washington State (9/8/12). Miller averaged 46.3 yards on seven punts, including a school-record 74-yard punt on his first effort of the day against the Cougars. Entering the 2012 season, he was ranked No. 3 among all FCS punters by Phil Steele’s FCS College Football Preview, and College Football Performance Awards selected him as one of the top 38 returning punters in FCS in 2012. Phil Steele listed him as a first team preseason All-Big Sky selection., 29604=Career: Miller’s 43.8 career punting average currently ranks as a school record, placing him ahead of the 42.3 average of Jesse Nicassio (2002-03). He has had 16 punts of 50 yards or more in his career, including a school-record 74-yarder. He owns five of the top 33 punts in school history, with boots of 74, 59 and 57 (three times)., 33605=HS: Graduated from Central Valley HS in 2010. Earned first team All-State honors from the Associated Press as well as the Tacoma News Tribune as a kicker, and from the Seattle Times as a punter. He was selected to play in the 4A/3A East-West All-State Game and made all four of his team’s extra points in a 28-9 win for the East. He was a first team All-Greater Spokane League selection as both a kicker and punter. He averaged 41.3 yards per punt and made 8-of-10 field goals. He had field goals of 45 and 50 yards, and also recovered his own onside kick, in a 34-31 win over Ferris, which would go on to play in the State 4A Championship Game. His Eagle teammates J.C. a (’09), Branson Schmidt (’11) and Gaven Deyarmin (’12) also attended Central Valley. They were coached at Central Valley by Rick Giampietri, a 1970 graduate of Eastern and letterman for the football team in 1968 and 1969. Miller had a 3.8 grade point average in high school and also competed in track and field., 36567=1731}",
    "textBeforeTable": "Jake Miller 48 48 Related Bios Vernon Adams Jr. J.C. Agen Cory Alcantar Isaac Anderson Cameron Babcock Ronald Baines T.J. Boatright Blair Bomber Ashton Boothroyd Will Boule Kendrick Bourne Demitrius Bronson Allen Brown Mario Brown Zach Bruce Jase Butorac Frank Aaron Clark Ashton Clark Cassidy Curtis Evan Day Clay DeBord Jay Deines David Delgado Gaven Deyarmin Joe Douglas Samson Ebukam Christian Fanning Steven Forgette Quincy Forte Victor Gamboa Zack Gehring John Goldwire Thomas Gomez Cedric Gonzalez Ronnie Hamlin Albert Havili Cody Hecker Shaquille Hill Jake Hoffman Christian Hudnell Cody Humphrey Terry Jackson II Isaiah Jenkins Daniel Johnson Zackary Johnson Jerrod Jones Will Katoa John Kreifels Cooper Kupp Anthony Larry T.J. Lee III Andre Lino William Lopez Cody McCarthy Tevin McDonald Joe Miles Ashton Miller Kevin Miller Cory Mitchell Jalen Moore Marcel Morris Brandon Murphy McKenzie Murphy Aaron Neary Alex Pond Jakob Pugsley Andru Pulu Jordan Pulu Todd Raynes Drew",
    "textAfterTable": "0 0 Passing Rushing Receiving Kicking Punting Returns All-Purpose Scoring Defense Date Opponent Score comp att pct yds y/a td int sac yds Aug 31 at Oregon St. W, 49-46 - - - - - - - - - Sep 7 Western Ore. W, 43-14 - - - - - - - - - Sep 14 at Toledo L, 33-21 - - - - - - - - - Sep 28 at Sam Houston St. L, 49-34 - - - - - - - - - Oct 5 Weber State W, 41-19 - - - - - - - - - Oct 12 at North Dakota W, 35-14 - - - - - - - - - Oct 19",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}