{
    "relation": [
        [
            "Device Name",
            "AR5001",
            "AR9285",
            "Belkin 54G (F5D7050)",
            "Broadcom Corporation Dell Wireless 1390 WLAN Mini-PCI Card (BCM4311)",
            "Broadcom 802.11b/g (BCM4318)",
            "Intel 5100AGN",
            "Intel 6205a",
            "Intel Centrino Advanced-N 6230",
            "RLT8187B"
        ],
        [
            "Driver",
            "ath",
            "ath",
            "rum",
            "bwn",
            "bwn",
            "iwn",
            "iwn",
            "iwn",
            "urtw"
        ],
        [
            "i386",
            "YES",
            "YES",
            "YES",
            "YES",
            "YES",
            "",
            "",
            "",
            ""
        ],
        [
            "amd64",
            "",
            "YES",
            "",
            "YES",
            "YES",
            "",
            "",
            "",
            ""
        ],
        [
            "Comments",
            "",
            "works in 9.1",
            "external USB",
            "Works in 8.1 or later, only station, adhoc-demo and monitor mode is currently supported. Must install net/bwn-firmware-kmod port. Not the bwi-firmware-kmod. 8.1 users may need to modify /usr/src/sys/kern/subr_firmware.c to read FIRMWARE_MAX 50 and recompile their kernel; this is not necessary in 8.2 or higher.",
            "Same as above",
            "Should work in 8.1 or later",
            "Works in 9.0. Instructions for 8.2 at http://blog.cochard.me/2011/08/backporting-intel-prowireless-6205a.html",
            "Should work in 8.3 and later",
            "Should work in 8.0 or later"
        ]
    ],
    "pageTitle": "Difference between revisions of \"Wireless Testing\" - PC-BSD Wiki",
    "title": "",
    "url": "http://wiki.pcbsd.org/index.php?title=Wireless_Testing&diff=31605&oldid=15302",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00116-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 257350255,
    "recordOffset": 257329990,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{72319=Note: ndisgen currently does not support the NDIS 6.X API. In practical terms, this means that you should only try it on XP and 2003 drivers. Make sure you download and try to convert the correct driver for your architecture (32 or 64 bit). If you would like to help test the most recent version of ndisgen, follow these instructions[2].}",
    "textBeforeTable": "Table 1: Wireless Devices Needing Drivers: Does ndisgen Work for this Device? Note to iwi(4) users: work is ongoing to improve this driver. Please see Bernhard Schmidt's iwi wiki[4] if you are interested in testing these changes. Note: report of ndisgen process causing a faulty situation. Description: Wireless is active, but when trying to connect to the network, the screen goes dark and the system stops responding. The black screen can be removed by restarting, but after reboot PC-BSD® does not enter the boot loader section. The system shows a prompt FreeBSD (Amnesia mode). Likely solution: FreeBSD problem report and patch[3] for \"Unregistered use of FPU in kernel\" panic caused by miniport driver adapted via ndisgen. Note: ndisgen currently does not support the NDIS 6.X API. In practical terms, this means that you should only try it on XP and 2003 drivers. Make sure you download and try to convert the correct driver for your architecture (32 or 64 bit). If you would like to help test the most recent version of ndisgen, follow these instructions[2]. If a FreeBSD driver does not exist, download a Windows driver for the device, run the interactive script ndisgen as the superuser, and see if you can successfully use the generated driver module. Add the results for your architecture (i386",
    "textAfterTable": "Known issue in 8.2 (http://www.freebsd.org/cgi/query-pr.cgi?pr=143874). Updating src and rebuilding kernel as per that link or upgrading to 9.0 fixes issue. Table 3 provides a handy resource for checking to see if your wireless driver is known to work on FreeBSD and PC-BSD®. Devices should be added alphabetically (then numerically). Only add devices that you have successfully used (e.g. do not add devices that \"should\" work according to the driver man page). Table 3: Wireless Devices Known to Work Device Name Driver i386 amd64 Comments AR5001 ath YES AR9285 ath YES YES works in 9.1 Belkin 54G (F5D7050) rum YES external USB Broadcom Corporation Dell Wireless 1390 WLAN Mini-PCI Card (BCM4311) bwn YES YES Works in 8.1 or later, only station, adhoc-demo and monitor mode is currently supported. Must install net/bwn-firmware-kmod port. Not the bwi-firmware-kmod. 8.1 users may need to modify /usr/src/sys/kern/subr_firmware.c to read FIRMWARE_MAX 50 and recompile their kernel; this is not necessary in 8.2 or higher. Broadcom 802.11b/g (BCM4318) bwn YES YES Same as above Intel 5100AGN iwn",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}