{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Many people are walking all over the streets without using the crosswalks and as a driver is it scary! They could work on making sure that there are more defined crosswalks for students or posts that are displayed to let pedestrians know where to go or not.",
            "If you can do some networking and get to know the professors. Then yes definitely can get somewhere easier. Teachers like to take the whole class period so you are not wasting your money on education.",
            "Science labs, library, ride your bike throughout the campus and see the beautiful scenery.",
            "I bring my own food to school to eat. Need to save money!",
            "I live off campus in my own home",
            "Make sure you know what you want to do. Check with the academic advisors regularly to make sure you are on the right track.",
            "A lot of opportunity. Awful parking and parking passes are expensive. Very nice people and they are not afraid to talk to you."
        ]
    ],
    "pageTitle": "University of Utah (U of U) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Utah/reviews?_escaped_fragment_=/show/28671",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 79,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00031-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909465063,
    "recordOffset": 909316196,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{802053=I don't live on the dorms but I wouldn't recommend it. It's overly priced for what you get. Even if you have a scholarship that covers living on campus you have to cough up the money for the food plan, which is like $1500. The food is edible but some people find it to be rather questionable., 702389=Outdoor activities abound! Hiking, skiing (both water and snow), swimming, tennis, canoeing, you name it, you can do it at the U and around in the nearby mountains. Plenty of open space for almost any activity. The U has great recreational facilities. The 2002 Winter Olympics were held in Sale Lake and the facilities are still in use to the public. Lots of outdoor concerts are held all through the valley and many sporting activities, outdoor fairs and festivals are held all year long. Southern Utah is beautiful year round and great for hiking., 34028=The U may overall be a tiny bit more expensive than Utah State but not by much. I am living at home (resident) and taking public transportation so all I had to pay for this semester was tuition which was around $3,000 for 14 credit hours. This amount is easy to take care of with scholarships and Financial Aid which the U offers a lot of. Just make sure to check the deadlines! They may be earlier like in February. Those are on the web and they also have departmental scholarships if you've already decided on a major; you just have to talk to your Advisor for more info. Also, as a student I get tons of free resources such as the gym/field-house use, FREE public transportation services, and academic resources such as career services (clean up your resume) or the writing center (edit a paper). Plus on top of that the U is always giving out freebies at events and discounts to restaurants and such. As a college kid free is my favorite word and the U understand that., 206576=it is a fairly diverse college with students from all over the world. it also has a good reputation in being a research university and is in the pac12. not to forget also that it has good professors, one recent one had won the 2007 nobel prize., 392750=I didn't stay in the dorms, however, I did have friends that did. I was up at the dorms quite a bit. The dorms were built for the 2000 Olympic guests and it shows. Unlike most dorms where four people share one bathroom the dorms here are spacious and have two separate bathrooms. Because the dorms were built in 2000 they are newer and pretty clean. My friends really loved being in the dorms., 892831=Dorm life is so much fun! RHA is the on-campus resident association and they constantly have things going on, like movie nights, ice cream socials, and last year we even held our own Hunger Games! The dorms are also incredibly nice since they rebuilt everything for the Olympics in 2002., 627793=The Olympic torch is outside the stadium, where the 2002 Opening Ceremony took place., 237760=my goodness, they are always having friday night events and wednesday nights there are movies at the post theater and every friday at 12:30 the spanish department puts on a foreign language film (but they keep that on the down-low)., 126517=This year I am living off campus at home. The Olympics were here in Salt Lake back in 2002 so dormitories were built for the Olympians which are now used by students., 926448=© 2015, Cappex.com, LLC, 296813=The dorms on the University of Utah's campus are extremely nice considering they were built to house the participants of the 2002 Olympics. There is plenty of space for both your roommate and you., 242795=There's pretty much a club for everyone. and if you can't find one, you can get six random people together and start your own! Personally, I joined the marching band because they get to perform at all the football games, including bowl games! It's amazing feeling when a huuuge crowd of people cheer as you march onto the field!, 54518=The school is generally well priced, especially for in-state tuition. Housing is a bit pricey but the buildings were all just re-done for the athletes competing in the 2002 olympics. The personal rooms are spacious and the closets are pretty big, every floor has a laundry room and some kind of hang-out or study room.}",
    "textBeforeTable": "07/29/2009 Reviewer is A current student here. 29 out of 31 people found this review useful. 1 of 222 Katie from Sandy, UT Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students This school has a lot to offer students with outdoor interests (like hiking, mountain biking, skiing, and snowboarding, just to name a few). If you plan on going to the University of Utah, or are looking at applying there, I would definitely take your outdoor interests into account. The U is also a an amazing school for students interested in medicine. Tips for prospective students It would be a brilliant idea to look at the clubs and organizations offered at the University of Utah. There are tons of outdoor oriented groups (if that's your thing) that are always looking for new members, but there are lots of other groups to join as well. Also be sure to check out the dorms at the U (and apply for on campus housing as soon as you can... it fills up quickly) because they are really nice (you don't have to share a bathroom with your entire floor), plus you can meet a lot of people. Bang for the buck I live in-state so I was able to get the in-state tuition rate, which is pretty good. I would say if you live in-state and decide to stay in your state, you definitely get a big bang for the buck.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}