{
    "relation": [
        [
            "Date",
            "Jul 31, 2000",
            "Feb 1, 2006",
            "Jun 12, 2006",
            "Jun 10, 2010",
            "Jun 12, 2012",
            "Jun 29, 2012",
            "Jun 30, 2012",
            "May 14, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "Owner name: TYCO ELECTRONICS CORPORATION, PENNSYLVANIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ELO TOUCHSYSTEMS, INC.;REEL/FRAME:017105/0022 Effective date: 20051221",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: ELO TOUCH SOLUTIONS, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:TYCO ELECTRONICS CORPORATION;REEL/FRAME:028357/0655 Effective date: 20120601",
            "Owner name: CREDIT SUISSE AG, NEW YORK Free format text: PATENT SECURITY AGREEMENT (FIRST LIEN);ASSIGNOR:ELO TOUCH SOLUTIONS, INC.;REEL/FRAME:028486/0917 Effective date: 20120601",
            "Owner name: CREDIT SUISSE AG, NEW YORK Free format text: PATENT SECURITY AGREEMENT (SECOND LIEN);ASSIGNOR:ELO TOUCH SOLUTIONS, INC.;REEL/FRAME:028486/0941 Effective date: 20120601",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6492979 - Dual sensor touchscreen utilizing projective-capacitive and force touch sensors - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6492979?ie=ISO-8859-1&dq=7751826",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987775.70/warc/CC-MAIN-20150728002307-00133-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471533687,
    "recordOffset": 471496918,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{67977=FIG. 12 is an illustration of a generic block circuit diagram for a sensor element readout circuit 1200. Negative feedback assures that the voltage on a feedback line 1201 is the same as the oscillating voltage V0 produced by a reference 1203. The output from a sensor element 1205 is the signal voltage ΔV superposed on the reference voltage V0. The output line plus a reference voltage line provide a differential signal output voltage ΔV., 68488=FIG. 13 illustrates a projective-capacitive sensor element for use with the circuit of FIG. 12. A variable capacitor 1301 represents the projective-capacitive sensor electrode. In use, a user's finger or other grounded object causes the capacitance to ground to be increased. A resistor 1303 supports the readout scheme. Resistor 1303 can either be built directly into the sensor or located with the readout electrodes., 68948=The feedback circuit illustrated in FIG. 12 can also be used with the alternating current readout of a force sensor. Some force sensors, for example those manufactured by C-Cubed Limited, are read out via a Wheatstone bridge. Thus, as shown in FIG. 14, one or more of the four resistors 1401-1404 may correspond to piezoresistive elements in the force sensor. In the embodiment shown, the bridge is connected to ground via a capacitor 1405. Although capacitor 1405 is not required, it may useful for reducing the differences between the excitation and feedback voltages, thereby making the ratio of ΔV to V0 more similar to signals from the projective-capacitive electrodes.}",
    "textBeforeTable": "Patent Citations As will be understood by those familiar with the art, the present invention may be embodied in other specific forms without departing from the spirit or essential characteristics thereof. Accordingly, the disclosures and descriptions herein are intended to be illustrative, but not limiting, of the scope of the invention which is set forth in the following claims. The feedback circuit illustrated in FIG. 12 can also be used with the alternating current readout of a force sensor. Some force sensors, for example those manufactured by C-Cubed Limited, are read out via a Wheatstone bridge. Thus, as shown in FIG. 14, one or more of the four resistors 1401-1404 may correspond to piezoresistive elements in the force sensor. In the embodiment shown, the bridge is connected to ground via a capacitor 1405. Although capacitor 1405 is not required, it may useful for reducing the differences between the excitation and feedback voltages, thereby making the ratio of ΔV to V0 more similar to signals from the projective-capacitive electrodes. FIG. 13 illustrates a projective-capacitive sensor element for use with the circuit of FIG. 12. A variable capacitor 1301 represents the projective-capacitive sensor electrode. In use, a user's finger or other grounded object causes the capacitance to ground to be increased. A resistor 1303 supports the readout scheme. Resistor 1303 can either be built directly into the sensor or located with the readout electrodes. FIG. 12 is an illustration of",
    "textAfterTable": "Jul 22, 1997 Dynapro Systems, Inc. Capacitive touch sensor US5670755 Apr 12, 1995 Sep 23, 1997 Samsung Display Devices Co., Ltd. Information input apparatus having functions of both touch panel and digitizer, and driving method thereof US5708461 Jan 24, 1995 Jan 13, 1998 Elo Touchsystems, Inc. Acoustic touch position sensor using a low-loss transparent substrate US5742119 Aug 8, 1995 Apr 21, 1998 U.S. Philips Corporation Cathode ray tube comprising a display screen having an electroconductive coating US5777607 Feb 20, 1996 Jul 7, 1998 U.S. Philips Corporation Low-cost resistive tablet with touch and stylus functionality US5790106 Nov 14, 1995 Aug 4, 1998 Alps Electric Co., Ltd. Coordinate input apparatus with pen and finger input detection US5801682 * Mar 15, 1996 Sep 1, 1998 Sextant Avionique Tactile designation device with high-resolution transparent capacitive surface US5854450 Aug 12, 1996 Dec 29, 1998 Elo Touchsystems, Inc. Acoustic condition sensor employing a plurality of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}