{
    "relation": [
        [
            "Date",
            "Sep 15, 1995",
            "Sep 7, 1999",
            "May 16, 2002",
            "May 12, 2006",
            "May 12, 2010"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: CANON KABUSHIKI KAISHA, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:SUZUKI, YASUMICHI;KURITA, MITSURU;REEL/FRAME:007697/0540 Effective date: 19950912",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US5847848 - Image processing apparatus which previews both input and edited image data - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5847848?dq=6011510",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987775.70/warc/CC-MAIN-20150728002307-00045-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 488971880,
    "recordOffset": 488953280,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Furthermore the preview image can be obtained efficiently in time. Furthermore the image data to be supplied to the display means can be generated with simple calculations. Also a preview image can be obtained efficiently based on the pre-set editing process. As explained in the foregoing embodiments, even in case image editing is conducted, there can be effectively obtained a preview image reflecting the result of such image editing. Furthermore the present invention is applicable to a case in which the present invention is achieved by the supply of a program to a system or an apparatus. The present invention is applicable to a system consisting of plural equipment or to an apparatus consisting of a single equipment. In the configuration shown in FIG. 6, the printer 6; is provided with plural recording units for forming image with different colors, and these recording units form images in succession in one pass of the recording medium, so that a full-color image can be formed at a high speed. In the foregoing embodiments, the image editing circuit 5 is so constructed as to provide frame-sequential outputs such as 50YMC, but the present invention not limited to such embodiments and the Y, M, C signals may be released in parallel manner as shown in FIG. 6. In case of such manual selection, there can be obtained a preview display matching the requirement of the user, such as a preview",
    "textAfterTable": "Image processing apparatus having means for synthesizing binarized image data US5166786 * Jul 26, 1989 Nov 24, 1992 Canon Kabushiki Kaisha Image forming apparatus containing a display showing an adjustable image US5206719 * May 4, 1990 Apr 27, 1993 Canon Kabushiki Kaisha Image processing apparatus including means for extracting an outline US5239383 * May 4, 1990 Aug 24, 1993 Canon Kabushiki Kaisha Image processing apparatus capable of image editing US5257097 * Sep 27, 1991 Oct 26, 1993 Eastman Kodak Company Method and apparatus for selective interception of a graphics rendering operation for effecting image data modification US5267031 * Sep 19, 1990 Nov 30, 1993 Canon Kabushiki Kaisha Color image processing apparatus US5381248 * Sep 8, 1993 Jan 10, 1995 Canon Kabushiki Kaisha Image processing apparatus US5422739 * Jul 7, 1992 Jun 6, 1995",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}