{
    "relation": [
        [
            "Citing Patent",
            "US7364487",
            "US7815485 *",
            "US7892065 *",
            "US8016635 *",
            "US8016636 *",
            "US8038502 *",
            "US8850683 *",
            "US8894459",
            "US20100242250 *",
            "US20130186922 *",
            "WO2007030125A2 *"
        ],
        [
            "Filing date",
            "Oct 13, 2005",
            "Feb 27, 2008",
            "Jan 24, 2005",
            "Mar 17, 2010",
            "Mar 17, 2010",
            "Sep 7, 2005",
            "Mar 26, 2009",
            "Mar 14, 2013",
            "Mar 26, 2009",
            "Jul 30, 2010",
            "Oct 5, 2005"
        ],
        [
            "Publication date",
            "Apr 29, 2008",
            "Oct 19, 2010",
            "Feb 22, 2011",
            "Sep 13, 2011",
            "Sep 13, 2011",
            "Oct 18, 2011",
            "Oct 7, 2014",
            "Nov 25, 2014",
            "Sep 30, 2010",
            "Jul 25, 2013",
            "Mar 15, 2007"
        ],
        [
            "Applicant",
            "Cranium, Inc.",
            "Shoot The Moon Products Ii, Llc",
            "Claudio Vicentelli",
            "Orda Korea Co., Ltd.",
            "Orda Korea Co., Ltd.",
            "Disney Enterprises, Inc.",
            "Tegu",
            "Activision Publishing, Inc.",
            "Tegu",
            "Innovative Moving Displays S. DE R.I., DE C.V.",
            "Disney Entpr Inc"
        ],
        [
            "Title",
            "Structure building toy",
            "Pose and play dolls",
            "Constructional modular system with removable magnetic framework",
            "Joining apparatus with rotatable magnet therein and built-up type toy with the same",
            "Joining apparatus with rotatable magnet therein and built-up type toy with the same",
            "Toy figures, play set, and play set accessories",
            "Magnetic blocks and method of making magnetic blocks",
            "Devices and methods for pairing inductively-coupled devices",
            "Magnetic blocks and method of making magnetic blocks",
            "Articulated mannequin with various assembly mechanisms",
            "Toy figures, play set, and accessories"
        ]
    ],
    "pageTitle": "Patent US6893315 - Toy figure with a magnetized joint - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6893315?dq=6,757,682",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987775.70/warc/CC-MAIN-20150728002307-00251-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472687567,
    "recordOffset": 472666488,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16298=The present application claims priority from U.S. Provisional Patent Application Ser. No. 60/405,133, filed Aug. 21, 2002, incorporated herein by reference in its entirety for all purposes.}",
    "textBeforeTable": "Patent Citations While the present description has been provided with reference to the foregoing embodiments, those skilled in the art will understand that many variations may be made therein without departing from the spirit and scope defined in the following claims. The description should be understood to include all novel and non-obvious combinations of elements described herein, and claims may be presented in this or a later application to any novel and non-obvious combination of these elements. The foregoing embodiments are illustrative, and no single feature or element is essential to all possible combinations that may be claimed in this or a later application. Where the claims recite “a” or “a first” element or the equivalent thereof, such claims should be understood to include incorporation of one or more such elements, neither requiring, nor excluding, two or more such elements. , arm portions 206, 206 a may include detachable upper arm portions 212, 212 a, and detachable forearm portions 214, 214 a, removably attached to body member 202, and/or to each other, with magnetized joints 210. Magnetized joints 210 may be similar in construction to magnetized joints 10 and 110, which have already been described in detail in this disclosure. In particular, each magnetized joint 210 may include a peg, and a socket for coaxially receiving and magnetically engaging the peg. The peg may have a peg magnet disposed at a distal end, and the socket may",
    "textAfterTable": "US4183173 Mar 28, 1978 Jan 15, 1980 Takara Co., Ltd. Toy assembly with interchangeable parts and detachable appendages US4186515 * Dec 22, 1977 Feb 5, 1980 Takara Co., Ltd. Toy horse vehicle US4206564 Jun 26, 1978 Jun 10, 1980 Takara Co., Ltd. Articulated reconfigurable robot doll US4214402 Oct 10, 1978 Jul 29, 1980 Takara Co., Ltd. Toy assembly with reconfigurable parts and removable appendages US4233777 Feb 9, 1979 Nov 18, 1980 Takara Co., Ltd. Floating doll, toy assembly US4342173 Dec 29, 1980 Aug 3, 1982 Takara Co., Ltd. Toy medical office US4575346 Aug 22, 1983 Mar 11, 1986 Takara Co., Ltd. Magnetic top running toy US4767505 Aug 13, 1986 Aug 30, 1988 Takara Co., Ltd. Method of rotationally molding a synthetic resin doll US5024611 Jul 14, 1989 Jun 18, 1991 Eckerle Douglas W",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}