{
    "relation": [
        [
            "Date",
            "Apr 7, 1998",
            "Sep 16, 2004",
            "Sep 24, 2008",
            "Dec 3, 2012",
            "Apr 24, 2013",
            "Jun 11, 2013"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: CANON KABUSHIKI KAISHA, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:YAMANAKA, AKIHIRO;MASUDA, KAZUAKI;YAMAMOTO, HAJIME;AND OTHERS;REEL/FRAME:009094/0901;SIGNING DATES FROM 19971028 TO 19971030",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20130424"
        ]
    ],
    "pageTitle": "Patent US6220697 - Ink jet recording head and ink jet recording apparatus having such head - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6220697?dq=6,998,619",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987775.70/warc/CC-MAIN-20150728002307-00177-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471354763,
    "recordOffset": 471329689,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations (3) By providing the recess (into which the wiping member can penetrated) in the central portion of the top plate having two rows of nozzles, the color mixing and poor cleaning can be prevented, and the number of wiping operations can be minimized, thereby preventing the damage of the face surface and increasing the service life of the wiping member. (2) Since the ink discharge surfaces are not flush with the electrical connection surfaces and the ink supply surfaces but are protruded by 5 mm or more, reliability can be improved, and, by arranging two ink discharge port rows symmetrically at positions rotated by 180 degrees with respect to the rotational center between the rows, “cost-down” can be achieved because common parts can be used. Further, by connecting the ink supply portions to the head along the ink discharge direction, when the ink tank is mounted on and dismounted from the head, load acting on the head is distributed uniformly outside of the rows of the ink discharge ports, thereby preventing positional deviation of the head which would affect a bad influence upon the color recording. In addition, since the groove (recess) having the depth greater than those of the ink discharge portions (ink discharge ports and the ink passages) is formed between the ink discharge port rows of the top plate, the substrates can be closely contacted with the top plate effectively by deforming the",
    "textAfterTable": "US5361087 Feb 22, 1994 Nov 1, 1994 Canon Kabushiki Kaisha Liquid jet unit with orifices and recording apparatus using the same US5381169 * Apr 21, 1992 Jan 10, 1995 Canon Kabushiki Kaisha Ink jet apparatus with recovery mechanism US5389957 Sep 8, 1992 Feb 14, 1995 Canon Kabushiki Kaisha Ink jet head with contoured outlet surface US5485184 May 4, 1995 Jan 16, 1996 Canon Kabushiki Kaisha Ink jet recording head and ink jet apparatus having same US5612722 * Feb 14, 1996 Mar 18, 1997 Lexmark International, Inc. Ink jet printhead wiper having side surfaces intersecting a top surface at acute angles to form wiping edges and a slat centered in a bottom surface US5650807 Nov 18, 1994 Jul 22, 1997 Seiko Epson Corporation Ink jet recording apparatus and method of manufacture US5657539 Sep 22, 1994 Aug 19, 1997 Canon Kabushiki Kaisha Process for producing an ink jet recording head",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}