{
    "relation": [
        [
            "Citing Patent",
            "US6992787 *",
            "US7031035 *",
            "US7092116 *",
            "US7190475 *",
            "US7197071 *",
            "US7372482 *",
            "US7376183",
            "US7379215",
            "US7430003",
            "US7456987 *",
            "US7478895",
            "US7484661 *",
            "US7518743 *",
            "US7634065 *",
            "US7639740",
            "US7692807 *",
            "US7698386",
            "US7715586",
            "US7852495 *",
            "US7905409",
            "US8234414",
            "US8320006 *",
            "US8332281 *",
            "US8411316",
            "US8447828",
            "US8688801",
            "US8788572",
            "US9082137",
            "US20010019422 *",
            "US20010041072 *",
            "US20020012134 *",
            "US20040098664 *",
            "US20040136021 *",
            "US20040189807 *",
            "US20060268375 *",
            "US20080010128 *",
            "US20110055045 *",
            "US20110128568 *",
            "WO2005056296A1 *",
            "WO2007072133A2 *"
        ],
        [
            "Filing date",
            "May 16, 2001",
            "Aug 5, 2002",
            "Jun 29, 2001",
            "Mar 12, 2001",
            "Dec 31, 2002",
            "Mar 28, 2003",
            "Oct 31, 2002",
            "Dec 30, 2002",
            "Feb 28, 2003",
            "Sep 29, 2003",
            "Dec 5, 2003",
            "Jul 27, 2005",
            "Feb 2, 2001",
            "Feb 22, 2005",
            "Feb 22, 2007",
            "Apr 1, 2004",
            "Nov 16, 2004",
            "Aug 11, 2005",
            "Jan 15, 2003",
            "May 20, 2005",
            "Aug 25, 2004",
            "Nov 30, 2009",
            "Sep 2, 2010",
            "Jul 15, 2008",
            "Sep 21, 2005",
            "Jul 25, 2005",
            "Dec 27, 2005",
            "May 10, 2013",
            "Feb 2, 2001",
            "Apr 27, 2001",
            "Jun 29, 2001",
            "Nov 3, 2003",
            "Jan 15, 2003",
            "Mar 28, 2003",
            "May 23, 2006",
            "Jun 14, 2006",
            "",
            "",
            "Dec 3, 2004",
            "Nov 15, 2006"
        ],
        [
            "Publication date",
            "Jan 31, 2006",
            "Apr 18, 2006",
            "Aug 15, 2006",
            "Mar 13, 2007",
            "Mar 27, 2007",
            "May 13, 2008",
            "May 20, 2008",
            "May 27, 2008",
            "Sep 30, 2008",
            "Nov 25, 2008",
            "Jan 20, 2009",
            "Feb 3, 2009",
            "Apr 14, 2009",
            "Dec 15, 2009",
            "Dec 29, 2009",
            "Apr 6, 2010",
            "Apr 13, 2010",
            "May 11, 2010",
            "Dec 14, 2010",
            "Mar 15, 2011",
            "Jul 31, 2012",
            "Nov 27, 2012",
            "Dec 11, 2012",
            "Apr 2, 2013",
            "May 21, 2013",
            "Apr 1, 2014",
            "Jul 22, 2014",
            "Jul 14, 2015",
            "Sep 6, 2001",
            "Nov 15, 2001",
            "Jan 31, 2002",
            "May 20, 2004",
            "Jul 15, 2004",
            "Sep 30, 2004",
            "Nov 30, 2006",
            "Jan 10, 2008",
            "Mar 3, 2011",
            "Jun 2, 2011",
            "Jun 23, 2005",
            "Jun 28, 2007"
        ],
        [
            "Applicant",
            "Eastman Kodak Company",
            "Eastman Kodak Company",
            "Douglas Calaway",
            "Nikon Corporation",
            "Warner Bros. Entertainment Inc.",
            "Hewlett-Packard Development Company, L.P.",
            "Warner Bros. Entertainment, Inc.",
            "Warner Bros. Entertainment, Inc.",
            "Candid Color Systems, Inc.",
            "Ricoh Company, Ltd.",
            "Eastman Kodak Company",
            "Fujifilm Corporation",
            "Fujifilm Corporation",
            "Fujifilm Corporation",
            "Aol Llc",
            "Applied Discovery, Inc.",
            "Qurio Holdings, Inc.",
            "Qurio Holdings, Inc",
            "Xerox Corporation",
            "Senshin Capital, Llc",
            "Qurio Holdings, Inc.",
            "International Business Machines Corporation",
            "Image Holdings",
            "Samsung Electronics Co., Ltd.",
            "Qurio Holdings, Inc.",
            "Qurio Holdings, Inc.",
            "Qurio Holdings, Inc.",
            "Qurio Holdings, Inc.",
            "Makoto Hara",
            "Konica Corporation",
            "Douglas Calaway",
            "Adelman Derek A.",
            "Martin Andrew T.",
            "Smith Greg S.",
            "Canon Kabushiki Kaisha",
            "Lightspeed Studios Inc.",
            "Caine Smith",
            "International Business Machines Corporation",
            "Decook Bradley Charles",
            "G P E Srl"
        ],
        [
            "Title",
            "Method of purchasing image bearing products",
            "System and method for selecting photographic images using index prints",
            "Method and system for processing an annotated digital photograph using a composite image",
            "Method for providing a print and apparatus",
            "Film resource manager",
            "System and method of capturing and providing supplemental data associated with a digital image",
            "Post-production processing",
            "Parallel scanning and processing system",
            "Digital camera/computer synchronization method",
            "Digital image forming apparatus",
            "Backprinting assembly for a photographic printer",
            "Point-of-sales terminal and service server",
            "System, method, and apparatus for printing, and method and apparatus for assigning orders",
            "Service server and voice message collecting method",
            "Film resource manager",
            "System and method for batch printing high-volume electronic documents from a network",
            "Serving content from an off-line peer server in a photosharing peer-to-peer network in response to a guest request",
            "Real-time recommendation of album templates for online photosharing",
            "Systems and methods for generating document distribution confirmation sheets with multi-destination status and/or multi-service status information",
            "Print medium feature encoding and decoding",
            "Proxy caching in a photosharing peer-to-peer network to improve guest image viewing performance",
            "Managing digital images to be printed",
            "Method of displaying, managing and selling images in an event photography environment",
            "Method and apparatus for printing images comprising individual information corresponding to face recognition information on second side of sheet of printing paper",
            "System and method for hosting images embedded in external websites",
            "Syndication feeds for peer computer devices and peer networks",
            "Caching proxy server for a peer-to-peer photosharing system",
            "System and method for hosting images embedded in external websites",
            "System, method, and apparatus for printing, and method and apparatus for assigning orders",
            "Photo-service system and image input apparatus",
            "Method and system for processing an annotated digital photograph using a composite image",
            "Document processing based on a digital document image input with a confirmatory receipt output",
            "Systems and methods for generating document distribution confirmation sheets with multi-destination status and/or multi-service status information",
            "System and method of capturing and providing supplemental data associated with a digital image",
            "Recording apparatus for sorting recording media having recorded image data thereon and method of sorting the recording media",
            "Image-taking system",
            "Method and system of displaying, managing and selling images in an event photography environment",
            "Managing digital images to be printed",
            "Backprinting assembly for a photographic printer",
            "Method and apparatus for the automatic printing of photographs, starting from digital data"
        ]
    ],
    "pageTitle": "Patent US6646754 - Backprinting image prints - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6646754?dq=6317900",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987775.70/warc/CC-MAIN-20150728002307-00237-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 487884751,
    "recordOffset": 487835255,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{189837=FIG. 21 is a state diagram showing states that are maintained by the orders database 602 to track the processing of each image print that is to be generated from an order. After an order is received from a user 2001, all the image prints to be generated from the order enter an “Entered” state 2002 indicating that the images from which the image prints are to be generated are part of an order but have not yet been sent to a print lab for printing. Once the order has been sent to a print lab for printing, the image prints enter a “Processing” state 2004 indicating that the images from which the image prints are to be generated have been sent to a print lab for printing. After an image print has been printed and binned, the image print enters a “Binned” state 2006 indicating that the image print has been printed and binned. After each image print has been shipped, the image print enters a “Shipped” state 2008 indicating that the image print has been shipped. Also, if the image print is stored (e.g., in the storage rack 767) so that the image print can be combined for shipping with other image prints from the same sub-order, the image print enters a “Stored” state 2010 indicating that the image print has been stored. It is to be understood, however, that not all image prints will enter the Stored state 2010., 117122=After the user's images have reached the photo-finisher and have been made available online, the user can place an order with the photo-finisher (step 404). One way to place an order is by having the user view the images online, for example, with a browser and selectively designate which images should be printed. The user also will specify one or more recipients to whom prints should be distributed and, further, print parameters for each of the individual recipients, for example, not only parameters such as the size, number of copies and print finish, but potentially also custom messages to be printed on the back or front of a print. As used herein, the term “print” refers to any physical manifestation, or process for generating a physical manifestation, of graphical information. This includes of course photographic prints, but also any other item to which graphical information can be imparted, for example, greeting or holiday cards, books, calendars, playing cards, T-shirts, coffee mugs, mouse pads, key-chains, or any other type of gift or novelty item. Further details on how to allow a user to place an order are provided in U.S. patent application Ser. No. 09/436,704, filed Nov. 9, 1999, and entitled “Distributing Images to Multiple Recipients,” which is incorporated by reference and from which priority is claimed., 64734=Priority is claimed from U.S. provisional patent applications Ser. No. 60/151,533, filed Aug. 31, 1999, Ser. No. 60/159,372, filed Oct. 14, 1999, and Ser. No. 60/,167,243, filed Nov. 24, 1999, and entitled “Digital Photo Printing Services,” and this application is a continuation-in-part of U.S. patent application Ser. No. 09/436,704, filed Nov. 9, 1999, now U.S. Pat. No. 6,263,139, and entitled “Distributing Images to Multiple Recipients,” which is incorporated by reference., 155149=FIGS. 22-23 shows an alternative embodiment of an inverter 1000 that can be used in place of the chute inverter 700 and the slide 703 to receive an image print 704 from the belt conveyor 701, invert the image print 704, and deliver the image print 704 to the belt conveyor 711. The inverter 1000 has a Y-shaped design that includes a back slide 1002 that is positioned at an oblique angle with respect to the belt conveyor 711. The inverter 1000 also includes a front slide 1004 that is separated from the back slide 1002 by a passage 1006 through which an image print 704 can pass. The front slide 1004 is held in place by a pair of brackets 1008 (which are connected to side walls 1010) at an acute angle with respect to the belt conveyor 711. When an image print 704 reaches the end of the belt conveyor 701 (not shown in FIGS. 22-23), the image print 704 is rotated (e.g., by the arm 709 shown in FIG. 13B) and falls off the end of the belt conveyor 701 and onto front slide 1004 of the inverter 1000. The image print 704 slides though the passage 1006 and into the back slide 1002. The image print 704 slides down the back slide 1002 until the bottom edge of the image print 704 contacts the belt conveyor 711. The belt conveyor 711 pulls the bottom edge of the image print 704 in the direction that the belt conveyor 711 moves, which causes the image print 704 to lay on the belt conveyor face down. As with the inverter 700, it is preferable that the outer surfaces of the back slide 1002 and the front slide 1004 on which image prints slide are constructed from and/or covered with a material (e.g., paper or stainless steel) that reduces or inhibits the build up of a static charge that would cause the image print 704 to stick to the back slide 1002 or the front slide 1004., 191245=The same states 2002-2010 also are maintained by the scheduler 608 for the image prints after the images from which the image prints are to be generated have been received by the scheduler 608; however, the image prints enter the Entered 2002 state after the images from which the image prints are to be generated have been received by the scheduler 608 (shown in parenthesis in FIG. 21). Also, the Processing state 2004 is entered by image print when that image from which that image print is to be generated has been sent to a print line 612 for printing. Each image print in an order enters the Binned, Shipped, and Stored states 2006, 2008, and 2010 when the image print has been binned, shipped, and stored, respectively., 101116=The system 300 has a web front-end computer system 320 that is connected to the network 310. The web front-end computer system 320 receives customer input or requests from the network 310 and communicates the received information to an image archive database 330. The image archive database 330 captures images submitted by the customers 302-304 and archives these images for rapid retrieval when needed. The information stored in the image archive database 330 in turn is provided to a print laboratory system 340 for generating high resolution, high quality photographic prints. The output from the print lab system 340 in turn is provided to a distribution system 350 that delivers the physical prints to the customers 302-304 and/or to their respective designated recipients. Further details on the print generation and distribution system are provided in U.S. patent application Ser. No. 09/428,871, filed Oct. 27, 1999, and entitled “Multi-Tier Data Storage System,” which is incorporated by reference., 192075=The states 2002-2010 shown in FIG. 21 can be used to track the image prints as they are being printed and to recover from errors in the printing process. For example, if an error occurs during the processing of a given batch, all image prints for the print line 612 having the error that are in the Processing state 2004 when the error occurs still need to be printed after the error has been removed from the print line 612; however, any image prints for that batch that are in the Binned state 2006, Shipped state 2008, and Stored state 2010 when the error occurs need not be printed again once the error is removed from the print line.}",
    "textBeforeTable": "Patent Citations A number of embodiments have been described. Nevertheless, it will be understood that various modifications may be made without departing from the spirit and scope of the invention. For example, advantageous results still could be achieved if steps of the disclosed techniques were performed in a different order and/or if components in the disclosed systems were combined in a different manner and/or replaced or supplemented by other components. Accordingly, other embodiments are within the scope of the following claims. These elements also can be found in a conventional desktop or workstation computer as well as other computers suitable for executing computer programs implementing the methods described here, which can be used in conjunction with any content viewing or manipulation software, or any other software capable of displaying portions of a larger body of content. Any of the foregoing may be supplemented by, or implemented in, specially designed ASICs (application specific integrated circuits). Generally, a processor will receive instructions and data from a read-only memory and/or a random access memory. Storage deices suitable for tangibly embodying computer instructions and data include all forms of non-volatile memory, including semiconductor memory devices, such as EPROM, EEPROM, and flash memory devices; magnetic disks such as internal hard disks and removable disks; magneto-optical disks; and CD-ROM disks. Various implementations of the systems and techniques described here may be realized in digital electronic circuitry, or in computer hardware, firmware, software, or in",
    "textAfterTable": "US7852495 * Jan 15, 2003 Dec 14, 2010 Xerox Corporation Systems and methods for generating document distribution confirmation sheets with multi-destination status and/or multi-service status information US7905409 May 20, 2005 Mar 15, 2011 Senshin Capital, Llc Print medium feature encoding and decoding US8234414 Aug 25, 2004 Jul 31, 2012 Qurio Holdings, Inc. Proxy caching in a photosharing peer-to-peer network to improve guest image viewing performance US8320006 * Nov 30, 2009 Nov 27, 2012 International Business Machines Corporation Managing digital images to be printed US8332281 * Sep 2, 2010 Dec 11, 2012 Image Holdings Method of displaying, managing and selling images in an event photography environment US8411316 Jul 15, 2008 Apr 2, 2013 Samsung Electronics Co., Ltd. Method and apparatus for printing images comprising individual information corresponding to face recognition information on second side of sheet of printing paper US8447828 Sep 21, 2005 May 21, 2013 Qurio Holdings, Inc.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}