{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,099 topics 2,124,268 replies",
            "85,555 topics 1,153,742 replies",
            "1,071 topics 11,069 replies",
            "4,219 topics 64,757 replies",
            "5,996 topics 75,810 replies",
            "50,541 topics 466,175 replies",
            "22,766 topics 196,291 replies",
            "4,270 topics 60,441 replies",
            "1,127 topics 8,213 replies",
            "3,599 topics 115,298 replies"
        ],
        [
            "Last Post Info",
            "Annoying AA problem By onslaught1552 A minute ago",
            "Reasons why GTA IV is bette... By Gigs84 A minute ago",
            "The Ultimate 100% Save File... By Militia 2 days ago",
            "Favorite Radio Station By thedriver111 15 minutes ago",
            "Whats your favorite/hated r... By Kristian. A day ago",
            "Favorite gym fighting style? By Militia 6 minutes ago",
            "Beta Vice City By xNCx 18 minutes ago",
            "Grand Theft Auto III Pre-Re... By RWWPL 6 hours ago",
            "Anybody has a 100 % savegame? By Cerium A day ago",
            "Deadliest Grand Theft Auto... By SuperGTFan 7 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=267&t=559601&p=1062609408",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00120-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 103864271,
    "recordOffset": 103836416,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47979=Google, Bing, lecroc69, dice, Yahoo, Mach1bud, Max Payne, ChickenAndBeer, dacatsrule, hoopz71, teagle, GTAKid667, Lester-The-Molester, ChrissyBoi87, marshallbslayer, Bob_Dole, slackman98, Josh, Andreas, SharkySoulja, Phoenix_Poop, vnctmrn, Pookie1986, XenoxX, HipsterHillbilly, lord tammerlain, Fozzie_420, toxluv, TG_Stig, SuperGTFan, SomeDBKid, zz latios, Wolftickets, TJGM, Doran22, U.N.K.N.O.W.N, Google Mobile, wootwoots, jiggaman1, LeopardGecko, Bondergomme, Cyron43, Johnny Playert, Eram, jrl51592, Epic., HallowedGunman, onslaught1552, B Dawg, HoleInTheSky, Progeekzy, TWERKSCOPEZ, Spuds725, SidSid, saintsrow, dyons, Nick1020, progamer1258, lowriderlife63, DentureDynamite, MythAlex, Th3MaN1, Schleemil, ibsmokin, SalvatoreCJ1903, Atrocityl87, MajorVienna, PlatinumSerb, Testeuros, Gabriela_L, SilentSeasons, Ronzilla187, Ritu85, arziben, universetwisters, Red Lynx 23, FourFingersOfFun, Damiazo, Officer Ronson, MenuET, lol232, jennyjesus, Setzaroth, Gigs84, tannedchoccyuk, The Mysterious One, Joekill95, xDatxJunkyx, Dragon_on_my_arm, Wheatley, gtuned, Rockwheels, Dannybrett6, TristanAnderson, Imposssible, US Marshal1911, EarlyLifeFailure, darthYENIK, LittleFamily580, RiseAgainBH, silentkiller44, TrickyTrifecta, GTA_Matt24, alenaloin, ghilliesuit101, Jon Snow, _CP_, Katabasis, BigJoe_1, BXHITMAN01, statistic, Valtiel150, Jinx., Otter, GTAandStuff, GTAOnlineAddict123, FMMZ, jeremy81385, K-ROSE, CH14R1, SkynetOnlineID, Pikas_PK, unknown modder, Knuckle89, CoCkPuNcH, VikDarkbomb, Captain Sensib1e, Archangel0934, vorwort, NDH92, Nicky_Sierra, wstaylor, Stoney0503, qzance88, miclin, Daniel1Plainview, bad_news_21, iBUCKEYE, Cognoscenti, Mokrie Dela, Crubbiestimp42, mrtommygunwhite, RayB_ThrowaStack, Svip, Cico555, funmw2, epoxi, Osho, Los Santos citizen, catcha_rown_brown, Stafish, Heists, Klicksend, s2n vaniish, Daemian, feckyerlife, boppa_, ReRo, SeekiNDestroyin96, zoso80, PinkandGlitter, WiSkiM, M.K.N., spaceeinstein, whywontyoulisten, iKarimster, Videogames888, Reyks, WacoKid614, juarez, shadowkill98, Rudzix123, Holo fenix, ForcedFedSupra, GTA717, Zizy, dragoon371, terabaapkabaap, shivix, Fuzzknuckles, DISTRICT7642, ClaudX, Grimase, Rekia87, Oldsmobile_85, Vassago1988, Ledorus, The_darkest_side, PsychoGamer, DJS, 22Laxer22, Str33tJustus, Haashir911, MadeBrazen, BACEGOD, ghoraaa, smokingndriving, AcidRunner, GamesBoy316, NYPD.ESU.55, meta187, Doomscream, scoobsterinc, Rebel, nordi, Craank_AG, Eggobites90, Hjaere, Lc gta, The Hero, JeepXJFreak98, Bootels, brose_sfr, MF Modding, bama764, BeckermannDewitt, Days Are Gone, Irviding, crashoverride93, HengBoy, Pentalarc, REXX93, SilverRST, Choco Taco, Nightmare3883, GeneralSteve93, psymin, Verlotsky, kBlaise, kensaundm31, elhazard1790000, Nebenezer, Cerberus178, em1b16a2, Gammoudicj, Benefactor69, LittleBlueTroll, Sveittjpong, PerfectNigtmare, Killerman29, Demetri_FTO_1., GandalfInSpace, amar33494, hornedturtle, raburs, Carnageeh, LordRaijin, dewtech_2008, Jon3s, ManassaxMauler, Hello7734, coorslightzombie, Nlwt, Quintenr95, Black_MiD, xTobyyyyyy, CaptainMarvel, Amistrulez, gtaYUHface, LDHalcrow1215, Kahkenbols, WrongAgainNoobs, Avenged Sevenfold, del__cielo, ZAZ, xXMizmerXx, We Are Ninja, TacoSmuggler, cjarvis15, D.A., xTOMMYTROJANx, MaverickF8, RandomCholo, garza337, Loves GTA, JMer23, GTA Master, TwisterVictor1, Argonaut, Claptrap NL, Sea Bear, fac316, Smooth Longsack, Stidge uk, Turbocharger, RamiV2, xNCx, Sigurd, maxx1013, KlIIUMlNATl, vlad polkiujhyt, PATRIOTIC M4A1, R.Rezzrax, Tekno_Gecko, Cripto136, Claude4Catalina, Dns2K, tcfanatic, JRC99, x_FRoe__, LahTigre, Souris, BillySundown, Choppers, Saint_Jackie, Claude Liberty, Supernutz40, Molster, ji.Ruichi, Ac3snip3r12345, Spectacus, Richardbrown30, wowsux133, GTA_stu, GunTotinHippie, Rewdalf, MrSaucyZ, Stolen_X, Indignation, Anachronistic, missanthropy, Mockingbae, King Kontrol, MyName'sJeff, m8son, sebas.Tian, j0ffline, FlacidJack, p-s-3x, emptyplayer, SeekingAsylum, 12731=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 16557=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 132756=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 20905=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 18778=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 9455=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 14251=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 11 minutes ago By statistic The Paleto Bay Mayors Offic... 613,230 replies 15,194 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By DentureDynamite Daily Objectives: tips and... 2,281,575 replies 113,328 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,458 topics 416,598 replies Call Police/Fire Department... By ClareXoBearrx3 25 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}