{
    "relation": [
        [
            "Date",
            "Jun 5, 2001",
            "Oct 11, 2005",
            "Jan 12, 2009",
            "Nov 1, 2011",
            "Jan 2, 2013"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "",
            "Year of fee payment: 4",
            "Owner name: APPLIED MATERIALS INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SEMITOOL INC;REEL/FRAME:027155/0035 Effective date: 20111021",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US6916412 - Adaptable electrochemical processing chamber - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6916412?ie=ISO-8859-1&dq=6101531",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00164-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476804719,
    "recordOffset": 476761182,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39145=This application is a continuation-in-part of U.S. application Ser. No. 09/804,697, entitled “SYSTEM FOR ELECTROCHEMICALLY PROCESSING A WORKPIECE,” filed on Mar. 12, 2001 now U.S. Pat. No. 6,660,137; which is a continuation of International Application No. PCT/US00/10120, filed on Apr. 13, 2000, in the English language and published in the English language as International Publication No. WO00/61498, which claims the benefit of Provisional Application No. 60/129,055, filed on Apr. 13, 1999, all of which are herein incorporated by reference. Additionally, this application is related to the following:}",
    "textBeforeTable": "Patent Citations From the foregoing, it will be appreciated that specific embodiments of the invention have been described herein for purposes of illustration, but that various modifications may be made without deviating from the spirit and scope of the invention. Accordingly, the invention is not limited except as by the appended claims. At least one functional characteristic of the first field shaping unit 500 is identified and at least one functional characteristic of the second field shaping unit 500 is identified. The identified functional characteristic of the first field shaping unit 500 is different from the identified functional characteristic of the second field shaping unit 500. For example, the first field shaping unit 500 may be identified as being adapted for use with a particular size of workpiece, such as a 300 mm semiconductor wafer, and the second field shaping unit may be identified as being adapted for use with a different size of workpiece, such as a 200 mm semiconductor wafer. This identifying information may enable a user to select between the first and second field shaping units to adapt the reaction vessel to treat a selected type of workpiece. ) is provided, with the second field shaping unit 500 also having at least one wall (e.g., wall 510 b) adapted to be received in the wall-receiving space between the electrodes 600. The second field shaping unit 500 has a second virtual electrode unit 540",
    "textAfterTable": "US3716462 Oct 5, 1970 Feb 13, 1973 Jensen D Copper plating on zinc and its alloys US3798003 Feb 14, 1972 Mar 19, 1974 Ensley E Differential microcalorimeter US3878066 Aug 29, 1973 Apr 15, 1975 Dettke Manfred Bath for galvanic deposition of gold and gold alloys US3930963 Feb 11, 1972 Jan 6, 1976 Photocircuits Division Of Kollmorgen Corporation Method for the production of radiant energy imaged printed circuit boards US3968885 Aug 27, 1974 Jul 13, 1976 International Business Machines Corporation Method and apparatus for handling workpieces US4000046 Dec 23, 1974 Dec 28, 1976 P. R. Mallory & Co., Inc. Method of electroplating a conductive layer over an electrolytic capacitor US4022679 Dec 19, 1975 May 10, 1977 C. Conradty Coated titanium anode for amalgam heavy duty cells US4030015 Oct 20, 1975 Jun 14, 1977 International Business Machines Corporation Pulse width modulated voltage regulator-converter/power converter having push-push regulator-converter means",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}