{
    "relation": [
        [
            "Citing Patent",
            "US5317435 *",
            "US5479238 *",
            "US5728324 *",
            "US5751415 *",
            "US5825741 *",
            "US6021106 *",
            "US6028667 *",
            "US6100975 *",
            "US6266473",
            "US6296186",
            "US7675631",
            "US20040109209 *",
            "US20140009670 *"
        ],
        [
            "Filing date",
            "Feb 10, 1993",
            "Jan 27, 1995",
            "Jan 31, 1995",
            "May 13, 1996",
            "Jul 10, 1996",
            "Jun 10, 1998",
            "Jan 14, 1999",
            "Apr 3, 1998",
            "Jan 26, 1998",
            "Nov 19, 1998",
            "Dec 27, 2007",
            "Dec 4, 2003",
            "Mar 13, 2012"
        ],
        [
            "Publication date",
            "May 31, 1994",
            "Dec 26, 1995",
            "Mar 17, 1998",
            "May 12, 1998",
            "Oct 20, 1998",
            "Feb 1, 2000",
            "Feb 22, 2000",
            "Aug 8, 2000",
            "Jul 24, 2001",
            "Oct 2, 2001",
            "Mar 9, 2010",
            "Jun 10, 2004",
            "Jan 9, 2014"
        ],
        [
            "Applicant",
            "Matsushita Electric Industrial Co., Ltd.",
            "Whitney; Theodore R.",
            "Digital Optics Corporation",
            "Process Instruments, Inc.",
            "Digital Optics Corporation",
            "Digital Optics Corporation",
            "Process Instruments, Inc.",
            "Process Instruments, Inc.",
            "Alliedsignal Inc.",
            "Ncr Corporation",
            "Zumbach Electronic Ag",
            "Zumbach Electronic Ag",
            "Koninklijke Philips N.V."
        ],
        [
            "Title",
            "Holographic recording apparatus having a liquid crystal modulator including a diffuser with plural phase shift regions",
            "High resolution imagery systems and methods",
            "Molding diffractive optical elements",
            "Raman spectroscopy apparatus and method for continuous chemical analysis of fluid streams",
            "Optical disc player with molded diffractive optical elements",
            "Molding diffractive optical elements",
            "Compact and robust spectrograph",
            "Raman spectroscopy apparatus and method using external cavity laser for continuous chemical analysis of sample streams",
            "Reflective display",
            "Produce recognition system including a produce shape collector",
            "Holographic optical element",
            "Holographic optical element",
            "Camera system comprising a camera, camera, method of operating a camera and method for deconvoluting a recorded image"
        ]
    ],
    "pageTitle": "Patent US5124815 - Method for forming holographic optical elements free of secondary fringes - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5124815?dq=6,275,983",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00152-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477955099,
    "recordOffset": 477930918,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{55707=This is a divisional of U.S. Pat. Application Ser. No. 277,466 filed Nov. 23, 1988, now U.S. Pat. No. 5,015,049 which is a continuation of U.S. Pat. Application Ser. No. 927,341 filed Nov. 4, 1986 and now abandoned, which is a continuation of U.S. Pat. Application Ser. No. 613,901 filed May 24, 1984 and now abandoned.}",
    "textBeforeTable": "Patent Citations FIG. 6 illustrates essentially the same apparatus used to form a reflection HOE. The emulsion 62 and supporting substrate are supported relative to the two limited coherence beams, of equal path length, so that the beams enter the emulsion from opposite sides. A cover plate 70 of substantially the same constitution as the substrate 64 matches the path length of the two beams to compensate for the refraction that occurs by passage of one of the beams through the substrate 64. A index matching medium 68 interfaces the abutting surface of the cover plate 68 and the emulsion 62. The photosensitive emulsion is then developed by suitable means to provide the desired HOE. The other beam from the splitter 52 is reflected by a mirror 56 through a beam forming optical system 60 and the output beam is incident upon the emulsion 62 at an angle relative to the first beam. The path lengths of the two beams from the beam splitter to the substrate are carefully controlled so as to be substantially identical. Accordingly, when the two beams intersect within the emulsion stationary interference patterns are formed during the period of the exposure despite variations in the input beam that may be produced by the coherence control unit 27. Reflections which occur when the incident beams reach the interface between the substrate 64 and the ambient media 66 are relatively incoherent with respect to the",
    "textAfterTable": "Matsushita Electric Industrial Co., Ltd. Holographic recording apparatus having a liquid crystal modulator including a diffuser with plural phase shift regions US5479238 * Jan 27, 1995 Dec 26, 1995 Whitney; Theodore R. High resolution imagery systems and methods US5728324 * Jan 31, 1995 Mar 17, 1998 Digital Optics Corporation Molding diffractive optical elements US5751415 * May 13, 1996 May 12, 1998 Process Instruments, Inc. Raman spectroscopy apparatus and method for continuous chemical analysis of fluid streams US5825741 * Jul 10, 1996 Oct 20, 1998 Digital Optics Corporation Optical disc player with molded diffractive optical elements US6021106 * Jun 10, 1998 Feb 1, 2000 Digital Optics Corporation Molding diffractive optical elements US6028667 * Jan 14, 1999 Feb 22, 2000 Process Instruments, Inc. Compact and robust spectrograph US6100975 * Apr 3, 1998 Aug",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}