{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,181 topics 2,127,162 replies",
            "85,566 topics 1,154,275 replies",
            "1,071 topics 11,084 replies",
            "4,218 topics 64,773 replies",
            "5,997 topics 75,835 replies",
            "50,560 topics 466,378 replies",
            "22,767 topics 196,356 replies",
            "4,275 topics 60,588 replies",
            "1,127 topics 8,223 replies",
            "3,614 topics 116,075 replies"
        ],
        [
            "Last Post Info",
            "Can you run it = Not trusta... By Nick930930 8 minutes ago",
            "how did Playboy X Obtain Cl... By Girish 11 minutes ago",
            "The Ultimate 100% Save File... By Militia 20 hours ago",
            "Which Vehicle Do You Prefer? By EekhoornSWAG 6 hours ago",
            "Which vehicle suits Toni? By Midnight Hitman 8 hours ago",
            "SAN ANDREAS THEATRE By D418 32 minutes ago",
            "Preffered Platform for VC?... By rob2021 3 hours ago",
            "What if GTA III had new music? By thedriver111 18 minutes ago",
            "What do you hate of GTA 2? By Cerium A day ago",
            "What was the best map of al... By Son of Zeus 5 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Msg&CODE=04&MID=503410",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00158-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 108901235,
    "recordOffset": 108881840,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47842=Bing, Yahoo, Google, Lester-The-Molester, jrl51592, Oxea, Pete4000uk, PoeticWhisper, AgentExeider, Halal Cyborg, AzelfandQuilava, frodzet, CReaper210, xink, Always_A_Medic, EddieLTU, TovarishTony, GTA4LIFE9000, DMK7, Matty, BenStone, x_FRoe__, Tony_Florence, Progen, XCarlSagan865X, Svip, John The Grudge, Ice2045, aksisisdead, Ivan1997GTA, Gifbrah, Benny164, Tchuck, Zook, blakejusticee, LewisVee, K^2, ExplosiveTurkey1, Google Mobile, mgrebel, mrsetiaji, Furry_Monkey, rivaldobox, Real Blood 1, 8gf, Im Ricky I Win, blacknambala, Latemodelchild, Dr WGA Labriskagni, calambos, Neos7, thesnowyguitar, wtf is a madrazo, PS3KillsThe360, HKM87, Trishan99, lh1, aradeth, M.K.N., Awesom-0, DREVIL919, Sariska, ashank975, NightTrainCaine, Sea Bear, Testarossa, Claude Liberty, Furious_Wave, Superfrogger, AndrewDeSanta, JimmyFantastic, Code Haruna, Owl Man, Girish, SpooferJahk, Zizy, Fattypack, A Paradox from 94, Roadkill01, vray, 4sinayousefi, HokusaiXL, Big Wolf, playdafool, Braindawg, A_Glorious_Spoon, craigdyid, Mr. Fahrenheit, xAxWilliams, raburs, Street Mix, UshaB, LAmike1, Slam_Jones, Sky_Light12, highwayking, Receptor, hamxod, scaldy78, Nick930930, Wikstr3, Fozzie_420, Lc gta, ZCAB, This Guy Is Here, Lil_Timmis, ClaudeSpeed1911, Saint_Jackie, PublicIdiotNo1, EvilKin, chrome_24, Russi4nW4rrior, catmandoza, SonofUgly, CarimboHanky, Phnx., Th3MaN1, Vertighost, quadro09, Mistamayja, Malcot, Quarthon, Z i X, swooshboy, Marticus, laskaland, Staypuft, Enzof1993, elhazard1790000, flino, Crunch McThornbody, qzance88, sebbellic01, Tycek, FlexPiTo, MrMadMike, four0nefive, Facebook, Big_Boy_Bmw760Li, gallardo555, timason, MGgames100, The_Biggest_Ego, GamesBoy316, wency1098, Zyo, Masiku, StayTrue, MafiaLuigi, Aqua97, kr0wns, S1N0D3UTSCHT3K, joeyhuab, Hyde Original, 12848=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 18739=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 20887=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 14393=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 9572=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 16666=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 89580=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 21 minutes ago By quadro09 The Paleto Bay Mayors Offic... 614,692 replies 15,220 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By blakejusticee [XOne/PS4] Learn how to mak... 2,292,786 replies 113,760 topics This is a general discussion forum for Grand Theft Auto",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,516 topics 416,587 replies [C#| .Net] How to attach a... By frodzet A minute ago Mod Showroom Scripts & Plugins, Maps, Total",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}