{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,103 topics 2,124,128 replies",
            "85,555 topics 1,153,706 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,757 replies",
            "5,996 topics 75,810 replies",
            "50,540 topics 466,167 replies",
            "22,766 topics 196,288 replies",
            "4,270 topics 60,441 replies",
            "1,128 topics 8,214 replies",
            "3,598 topics 115,228 replies"
        ],
        [
            "Last Post Info",
            "Do you ever just boat aroun... By Jammsbro A minute ago",
            "Did anyone had problem with... By Mr. Fahrenheit A minute ago",
            "The Ultimate 100% Save File... By Militia 2 days ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "Whats your favorite/hated r... By Kristian. 21 hours ago",
            "Which car for CJ? By SalvatoreCJ1903 14 minutes ago",
            "Which Vehicle Do You Prefer? By PhillBellic 4 hours ago",
            "Grand Theft Auto III Pre-Re... By RWWPL 2 hours ago",
            "Anybody has a 100 % savegame? By Cerium A day ago",
            "Deadliest Grand Theft Auto... By A8ul99 5 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=37&t=137910&p=1756734",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00315-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 106607307,
    "recordOffset": 106584078,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21031=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 115563=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 47599=Yahoo, lebongjames187, TalkingPear, CoCkPuNcH, Zetta Slow, Arazern, RedDagger, Mister Pink, Zhaxi, Bing, Google, Neuling2000, r.lorenzo13, Apex., whywontyoulisten, jabloki, tjor24, Ivibezz, ClaudX, Smooth Longsack, Dondara, BeckermannDewitt, Th3MaN1, Willplanb_, Nick1020, Nopheros, Latemodelchild, Cancerslug, IIIINASTYIIII, TXCamber, craigdyid, Lester-The-Molester, CMCSAVAGE, BisP, m2roadwarrior, kBlaise, ivangtaiv, krle2003, longhurstgb, Dirty.Hairy, boppa_, Google Mobile, Bickerstaff, AeroAviation, Riprock, Retired Mafia, toolateaxeincar, GTAKid667, Nutduster, jackmap, gtuned, MapRef41N93W, Zoolock, DumbForum, Im Ricky I Win, unicornace, moostered, Nerfgoth, Semaj 2JZ♢, Hocko1999_fgc, Hunter241, badmoon, ashank975, choc4444, Mr. Fahrenheit, BoeserBengel83, minhto360, DannyMan, blacknambala, Darkraven2, CyberGhost101, JCX1992, JasonStatham, Grizzly322, CptAngel, Zook, MSFT, mobe, Pavle, theaudiobully87, SuperHolySheep, PursuitForceS, iiConTr0v3rSYx, Nlwt, Tylerhasswagz, HulioG, MrManquet, aka_senior_84, Jammsbro, kulomet333, Warlord., NYgangster25, robban, shadowkill98, Captain Sensib1e, Fuzzknuckles, Hypnotic10x, toelias, Icantthinkofonew, Issik, Katabasis, Gonad McDangle, A8ul99, Black_MiD, B Dawg, thehambone, Honker1944, Astoroth211, idonknowhow, StoreytaleFM, DennisStanistan, Lord_Smasherton, Crackhead_Ben, beretta-gt88, REXX93, Mach1bud, m3tal z_DKI, TheTruthIsFree, TreFacTor, Screwe45, frodzet, AllNighter1, FertileFuZZ, sheepy111, NikoB08, Whoop woop, doubleg213, shadowoperative, Jestic, huckmonkey, BrettTheRenegade, MVX11V, CM-Punk, stofegad, adit999, Brabham, ShiviSRT-10, //XP//, Mrs.NormanReedus, GuerrilleroESP, Huraldo, Valtiel150, AzelfandQuilava, Slasherr, mirrorparkradio, U.N.K.N.O.W.N, Doktor Gott, D.A., alexnicnac, CosmoMau5, Fireman, baru94, TwisterVictor1, Tchuck, BlackMilk, Gutslab, CCPD, gtaguy95, DANIEL3GS, Svip, Eqaulo, juarez, scania970, Electrogypsy, NBAKingzFan10, Doomscream, lpgunit, PhillBellic, HaythamKenway, TJGM, saikolemon, AaronMcG95, TG_Stig, Cjs3315, MRSJEIKS, Cyberzone2, svanderman, calambos, 313izzle, esato, slayso, Lay, Luucky, jiggaman1, Bosnian Studios, RiseAgainBH, dAfTpUnK2010, bigjpc777, Fenton, kaasje, TaazR, bulldog385, The Lone Wanderer, athande, Terroryaki, BBHD, SaL_Leone, Turbocharger, Jon3s, Zeynohh, GeneralSteve93, ebidr, Lewis Jephson, GTA_fear, NightSpectre, Los Santos citizen, uncaged, Epic., Fozzie_420, hotline.n.w.refn, meta187, ManularChimera, gelou307, XCalinX, knightsgarage, Mona Sax, Fakeplastictrees, Ocelot., Laguezmer, miclin, kuusko, Pusman, Osho, Officer620, Skorpro, Ritu85, CaptainChandler, RobinVerhulstZ, Xevontheus, missanthropy, YoungPacino, A Maned Wolf, Kai650, dragoon371, Owl Man, ProgramG, kai824, SalvatoreCJ1903, FedoraTheExplora, ndyerger, Gigs84, amar33494, Shooter Hex, 12thmanfirefighter, Tossin Salad, Corndog93, blah265, Mastah, DJS, unikatil, gutsi007, GamingBunny84, frontrunner91, The Odyssey, Schleemil, 9368=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 18917=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 16734=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 12709=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 14425=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 11 minutes ago By Queen The GTAForums Official Crew... 613,668 replies 15,196 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Cancerslug Who bothers to randomly att... 2,281,018 replies 113,312 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,455 topics 416,594 replies Car sound problem By Jeansowaty 2 hours ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}