{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,137 topics 2,125,405 replies",
            "85,560 topics 1,153,970 replies",
            "1,071 topics 11,071 replies",
            "4,218 topics 64,764 replies",
            "5,996 topics 75,816 replies",
            "50,551 topics 466,253 replies",
            "22,767 topics 196,318 replies",
            "4,274 topics 60,493 replies",
            "1,127 topics 8,220 replies",
            "3,605 topics 115,566 replies"
        ],
        [
            "Last Post Info",
            "Story Mode DLC discussion t... By Heists 4 minutes ago",
            "You know when you've pl... By Vega LVI 10 minutes ago",
            "The Ultimate 100% Save File... By Militia 2 hours ago",
            "Which Vehicle Do You Prefer? By svanderman 14 minutes ago",
            "Things that can be done at... By Militia 44 minutes ago",
            "SA-MP is crashing! By Opticork A minute ago",
            "Game won't save By gtafan2u 37 minutes ago",
            "Grand Theft Auto III Chain... By Kristian. 36 minutes ago",
            "What are the cops actually... By Jeansowaty 2 hours ago",
            "Lets play a game of \"Wo... By LeopardGecko 17 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=240&t=424647&p=1059495241",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00062-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 110598003,
    "recordOffset": 110571994,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16619=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 9379=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 18686=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 14204=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 105784=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 20824=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12652=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 47839=Vega LVI, Bing, RedDagger, Google, Aqua97, ninjaontour, slackman98, Pavle, Zed Is Here, Yahoo, TheMcSame, Pidge, Foleydelphia, fp99, Remix1994PL, Kyle17, Cognoscenti, The Mysterious One, 7nvd, 8888, ice_phoenix_66, THE_ENDRMAN_007, STEEZYR, TalkToMyAgent, Non Biased GTA 4 fan, Choppers, HunterGatherer, Captain Sensib1e, CMCSAVAGE, T.V. Eye, dice, GipsyDanger MK2, Zello, Opticork, Abysmal, laskaland, Zibulaatio, IamnotaJedi, LahTigre, Antsaboy, Lester-The-Molester, psymin, Zook, jdwarfer, Sky_Light12, 65536, Facebook, Thousand Accent, Th3MaN1, jp9865, Edmachine, Progen, Jinx., -Velox, A Paradox from 94, ClippedWings, Andreaz1, Gtaultimatefanboy, kj2022, GTAKid667, Godovermoney, Halal Cyborg, gtafan2u, M4k3, BXHITMAN01, Officer Vic, ZAZ, Geralt of Rivia, Arc_Angel, Red Lynx 23, TalkingPear, BlackAce23, Epic., MGgames100, Peiva's Laahdin, Daemian, ringo336, coachcolbert, XB36Hazard, slashjaw26, C10H15N, Chuck Finley, Legomanarthur, Rashkovskys Shiv, MrKush, SRB, Jesse.yancey320, Joekill95, DumbForum, BoDuken, AdusPL, Summertime, s2n vaniish, huckmonkey, Ac3snip3r12345, Junko Enoshima, theGTAking101, Twin Turbo, Ieech, Lebowski_RS, EF2000, svanderman, Luk38644, Fuzzknuckles, The Made Man, Heists, VikDarkbomb, Steffen Habbestad, TitaniumSphinx, OGLuke, nls_whs_2010, stretchx9, Stefanex, MisterMagnifico1, LiangHuBBB, thafablifee46, Sugar Free Nos, Jeansowaty, dimitrirock, aradeth, Nugsy, TovarishTony, ledzep71, doppelblind, fullxthrottle94, Chao§pawN, zakace, gpcguy1, Slam_Jones, Crunch McThornbody, El Chubito, Lonewolvez, CarimboHanky, Fox2Quick, KatyPerry, Alexander Blade, Neos7, Wakeman921, Y_Draig_Bryste, Murdacious Intent, bixlas13, fazedevil, SirDarknight, idonknowhow, DiemessGTA, McH2Oz2, Eram, Fozzie_420, Phoenix_Poop, LeopardGecko, Hades_, gecko_sniper, lord tammerlain, Anachronistic, Sigurd, PoeticWhisper, Bo Gotti, Google Mobile, Screwe45, ZenderAlpha, DayPhantom, IWantDouble, Flesh-n-Bone, DevilfishRAW, Bender.ㅤ, stew5556, Crystal3lf, LordRaijin, slvrcobra, JaySeaThree, slendifiedman, Honch777, Tomasak, Sleepingmonster, Souris, Markuza97, Marty McFly, GrandTheftAddict91, TreFacTor, shaz7770, AztecaEh, *Lola, hoopz71, Foreverpast, xHaviiHx, Kampret, toxluv, SuperGTFan, wigglepuppy, bl00dykill5, BlackHeartedGovernor, Terra_S4, Dbzk1999, kai824, Jehannum, DaemonRider, Daequil, NikoB08, flitcroft101, Irviding, FR_Player-One, L1TTLE-DAVE, handcuff_charlie, Mastah, Gammoudicj, Angel Bryan, Krystofer, Claptrap NL, dewtech_2008, lol232, raburs, Jon Snow, doubleg213, XxKing69XavierxX, Yus, Masny, craigdyid, rakion99}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 2 minutes ago By Tacymist Andolini Mafia Family 613,652 replies 15,212 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By CMCSAVAGE Kill player then switching... 2,285,372 replies 113,474 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,470 topics 416,664 replies Getting the Co-ordinates.... By gtafan2u 4 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}