{
    "relation": [
        [
            "Shipping and handling",
            "Free shipping",
            "US $35.00",
            "US $75.00"
        ],
        [
            "To",
            "United States",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Shipping (UPS Ground)",
            "Expedited Shipping (UPS 3 Day SelectSM)",
            "Express Shipping (UPS Next Day Air Saver®)"
        ],
        [
            "Delivery*",
            "Estimated within 2-7 business days",
            "Estimated within 4-5 business days",
            "Estimated within 2 business days"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/Acer-Aspire-M5-583P-9688-i7-4500U-1-8GHz-8GB-1TB-HDD-Windows-8-15-6-Touchscreen/301191134062?hash=item462063fb6e",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00137-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 418837411,
    "recordOffset": 418783180,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{947=About eritech international eritech a wholesaler of new and refurbished computers, electronics and peripherals, available to the public at the BEST direct prices! Since 1985, eritech has offered a complete line of computer-related memory to the public, and over the years has added new and pre-owned notebooks & desktops, notebook batteries, hard drives, computer accessories, digital cameras, video game machines, flat screen televisions and other electronics based on the needs and requests of our customers. If you have any technical or upgrade questions about this item before you make your eBay purchase you can email or call us today - toll free 1-888-808-6242 (or 818-244-6242), M-F 9:00 AM-5:00 PM PST (California, USA).}",
    "TableContextTimeStampAfterTable": "{100669=eritech CALIFORNIA BUYERS Information California buyers are required to pay sales tax. Also, as of January 1, 2009, the California Electronic Waste Recycling Fee requires an additional fee of between $8-25 per each retail product sold within California with an LCD or monitor, based on size (ex: 4-14\" LCD=$8 fee; 15-35\" LCD=$16 fee; 35” or more LCD=$25 fee). This fee will be added to all applicable California retail sales closing costs; go to http://www.ciwmb.ca.gov/Electronics/Act2003/Retailer/Fee/QandA.htm for more information. This additional fee is not automatically added by eBay's invoice system; if you pay immediately using Paypal, we will invoice you the additional CA LCD fee through your Paypal account (orders will be shipped after this is paid)., 82615=10/100/1000 Gigabit Ethernet, 97983=A Note About PAYPAL Payments International Paypal policies as of April 2008 allow us to accept MOST international Paypal! We accept Paypal payments from all buyers provided Paypal accepts your payment (they may temporarily hold the payment or ask for additional info before releasing the funds to us). Acceptance of your International payment is solely up to Paypal – if they do not accept the payment, then we must cancel the transaction.}",
    "textBeforeTable": "Please enter 6 digits for the Postal Code. Please enter a valid Postal Code. Postal Code: Select a valid country. There are 0 items available. Please enter a number less than or equal to 0. -Select- Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Republic Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Virgin Islands Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Islands Cayman Islands Central African Republic Chad Chile China Colombia Comoros Congo, Democratic Republic of the Congo, Republic of the Cook Islands Costa Rica",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin Postal Code, destination Postal Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Will usually ship within 1 business day of receiving cleared payment - opens in a new window or tab. Return policy Item must be returned within Refund will be given as 14 days after the buyer receives it Money back or item exchange (buyer's choice) The buyer is responsible for return shipping costs.",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}