{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "On campus we celebrated everything, so prepared to have a lot of fun. The most unusual is the Day of the Dead and Halloween, that is when the campus could be a little creepy.",
            "The tuition there us $99 a credit. It is worth it too. They have been building this college to make it comfortable and relaxing for it's students and staff members.",
            "Elgin Community College has a lot of fun activities going on up there, such as: Music from around the world, performances, college night, job searches, etc.",
            "Their food there is great, the have a variety of selections, rather you are a meat eater, or an vegetarian. It's cooked fresh throughout the day so you will be satisfied.",
            "Do not have a dorm there.",
            "The academic rigor is when we are having mid- terms. The facility helps up cope with it well by giving out free breakfast that includes everything, the professors volunteer their time to help in most major subjects.",
            "Make sure you are ready to learn when you get registered because these classes are fast and full of the knowledge you need to make it in the future, therefore, pay close attention to lessons taught.",
            "Elgin Community College was a place where all the professor's did everything beyond their jobs to see us succeed, they help you along the way with smiles; which made learning fun."
        ]
    ],
    "pageTitle": "Elgin Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Elgin-Community-College/reviews?_escaped_fragment_=/show/36161",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00296-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905991195,
    "recordOffset": 905948208,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{225192=© 2015, Cappex.com, LLC, 1639=I will have completed all my general education by May 2011, and I've saved thousands of dollars by attending ECC. The quality of the classes are great as well, I feel I have gotten my money's worth.}",
    "textBeforeTable": "01/29/2011 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 56 Alaina from Elgin, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Great for these types of students Elgin Community College is great for students who have not yet decided what they want to major in. The college offers a wide array of classes to explore and many outside-of-the-classroom opportunities. You will always save a lot of money! Tips for prospective students I would advise you to attend a community college first, even though you may want to move on to a four-year institution. It will prepare you for a smoother transition and you will save so much money on your general education classes. Bang for the buck ECC offers quality education for a very reasonable price. I was a full time student and was able to pay for all my classes as well as books with under $4000. Am enjoying being here The college has more than 40 active clubs and organizations on the campus. With all the constant activities going on, there is never a boring day and you will never want to leave! Am learning a lot Elgin Community College has a great student to teacher ratio and the quality of the education is high. Many of the professors are trained professionals",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}