{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I live off campus",
            "working professionals",
            "It is affordable",
            "I live in Florida, there is the Beaches and camping sites.",
            "Live off campus",
            "Live off campus",
            "Four out of Five",
            "If you are a working professional in the North East Florida area, Vincennes University is the place to go.",
            "It is an affordable and a accommodating school with professional staff that meet the needs of working professional. I have taken five classes at one time with no problem."
        ]
    ],
    "pageTitle": "Vincennes University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Vincennes-University/reviews?_escaped_fragment_=/show/22769",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00153-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902947959,
    "recordOffset": 902892702,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{167339=In late Nov-early Dec. we offer African Culture night. Various Dance troops come from all over the US to perform authentic African tribal dances, while you sit and enjoy authentic African dishes prepared by our chef., 195040=We have a few traditions on campus. One of them is during family weekend in september and you get groups of ten and connects rafts to each other and you race other teams down the wabash river. We also have the Harlem Wizards here every year., 251374=© 2015, Cappex.com, LLC, 217407=I believe vincennes is a good school. It seems like it is slow paced & laid back. I cant wait to start in january., 247358=My stomach regrets every time I walk into the dining center. They quit serving lunch so early that by the time I get there, usually just after 1:30 there's nothing to eat besides burgers and pizza, and that gets old Fast., 144497=Since it is an historic town, The Paranormal Club offers a scary but true look at the past. The Hospitality club takes you places like French Lick and Clabber girl. The Arts clubs are very active as well, music, theatre, art appreciation. The new 4 million dollar art and sculture builking will be done in the fall of 2013.}",
    "textBeforeTable": "12/05/2009 Reviewer is A current student here. 4 out of 5 people found this review useful. 1 of 59 Jelisa from Pendleton, IN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Food and Dining okay i have had much better Dorm Life Good, The noice levels are up some nights but not to bad. friendly RAs and staff willing to help you. Academic Rigor Great Tips for prospective students Study hard, don't slack off, take your work seriously. If you have trouble on anything ask the instructors the are more than willing to help you out. In three sentences Very clean campus, with friendly helpful staff member. The Class sizes are small which makes it a great learning environment. The school has a lot of security which makes for a safe environment. Login to rate or flag the reviews Corinne from Greenfield, IN 05/29/2011 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 2 out of 2 people found this review useful. 3 of 59",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}