{
    "relation": [
        [
            "Finish",
            "1",
            "2",
            "3",
            "3",
            "3",
            "6",
            "7",
            "7",
            "7",
            "7",
            "11",
            "11",
            "11",
            "11",
            "11"
        ],
        [
            "Candidate",
            "Cain",
            "Romney",
            "Gingrich",
            "Pawlenty",
            "Palin",
            "Bachmann",
            "Paul",
            "Giuliani",
            "Huckabee",
            "Trump",
            "Roemer",
            "Santorum",
            "Bolton",
            "Daniels",
            "Christie"
        ],
        [
            "Percent",
            "20.3%",
            "13.6%",
            "11.9%",
            "11.9%",
            "11.9%",
            "6.8%",
            "3.4%",
            "3.4%",
            "3.4%",
            "3.4%",
            "1.7%",
            "1.7%",
            "1.7%",
            "1.7%",
            "1.7%"
        ]
    ],
    "pageTitle": "Straw polls for the Republican Party presidential primaries, 2012 - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Straw_polls_for_the_Republican_Party_presidential_primaries,_2012",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00188-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 870644751,
    "recordOffset": 870595749,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{82000=Republican Liberty Caucus straw poll at the 2011 California Republican convention:[7], 73912=Results from the 2011 Dorchester Conference Straw Poll were as follows:[5], 28462=This is a list of straw polls that have been conducted relating to the Republican presidential primaries, 2012., 67437=Results from the 2011 Tea Party Straw Poll were as follows:, 242871=Results from the 2011 Drake University Straw Poll were as follows:[64][65], 62260=Results from the 2011 CPAC Straw Poll were as follows:[4], 77654=Results from the 2011 National League of Cities Straw Poll were as follows:[6], 133329=^3 In June, two months before the poll, presidential candidate Mitt Romney, who had won the 2007 Ames Straw Poll, announced that he would skip the 2011 Ames Straw Poll.[23], 153936=The Florida Republican Party held a straw poll at the end of September 2011,[31] which was won by Herman Cain. Political analysts attributed Cain's win to Perry's poor debate performances, but others pointed to the fact that Cain won the Florida straw poll after campaigning in-person throughout the state more than Perry.[32], 132340=^1 The day after the poll, on August 14, Tim Pawlenty announced his withdrawal from the race after his third place finish.[21], 146094=A straw poll was held at the September 12 Republican debate, to find out who the debate audience thought were the front runners, both before and after the debate. Before the debate, Ron Paul came first, Rick Perry came second, and Michele Bachmann came third. After the debate, Ron Paul was still first, Michele Bachmann came second, and Herman Cain came third.[28] CNN have not released the full results of this poll, instead holding an online poll which omitted Ron Paul from the choices. The winner of the online poll was Mitt Romney., 150842=The California Republican Party held a straw poll in mid-September 2011, which was won by Ron Paul. The full results were:, 55854=Results from the 2011 New Hampshire Straw Poll were as follows:[3], 246203=The poll was distributed to Drake students via email to coincide with the December 10 Republican presidential debate, held on campus.}",
    "lastModified": "Sun, 02 Aug 2015 09:44:42 GMT",
    "textBeforeTable": "Total Straw Poll Victories is as follows: Total Staw Poll Victories (Updated March 20, 2012)[edit] 72 References 71 External links 70 See also 69.3 City Totals 69.2 Zip Code Totals 69.1 Candidate Totals 69 March 1–3, 2012, Online - Idaho Straw Poll III 68 February 18, 2012, Coweta County Republican Presidential Straw Poll 67 February 10–12, 2012, Washington, D.C. – CPAC Straw Poll 66 February 2–4, 2012, Online – Idaho Straw Poll II 65 January 28, 2012, Arizona Republican Party Presidential Straw Poll 64 January 20, 2012: Connecticut GOP straw poll 63 January 14, 2012: Saddle Up Texas straw poll 62 January 6, 2012, Boise, Idaho – Idaho Republican Party Presidential Straw Poll 61 January 2–4, 2012, Online - Idaho Straw Poll 60 Straw polls taken after voting started 59 December 13, 2011, Cedar Valley, Iowa – Cedar Falls Tea Party Straw Poll",
    "textAfterTable": "Straw polls taken before voting started[edit] This section is empty. You can help by adding to it. (March 2013) January 22, 2011, Derry, New Hampshire – New Hampshire Straw Poll[edit] Results from the 2011 New Hampshire Straw Poll were as follows:[3] Finish Potential candidate Percentage 1 Romney, MittMitt Romney 35% 2 Paul, RonRon Paul 11% 3 Pawlenty, TimTim Pawlenty 8% 4 Palin, SarahSarah Palin 7% 5 Bachmann, MicheleMichele Bachmann 5% 6 DeMint, JimJim DeMint 5% 7 Cain, HermanHerman Cain 4% 8 Christie, ChrisChris Christie 3% 9 Santorum, Rick",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}