{
    "relation": [
        [
            "",
            "Debit",
            "Credit"
        ],
        [
            "Cost Object",
            "DLC U/R Cost Center",
            "DLC Discretionary Cost Object"
        ],
        [
            "Cost Element",
            "420317",
            "420317"
        ],
        [
            "Allocation #",
            "WBS which incurred U/R",
            "WBS which incurred U/R"
        ]
    ],
    "pageTitle": "MIT SAP Help - Archived Content, For Reference Only - Financial Operations",
    "title": "",
    "url": "http://vpf.mit.edu/index.php/site/sap_help_archived_content_for_reference_only/financial_operations/f_a_underrecovery_on_research_wbs_elements",
    "hasHeader": true,
    "headerPosition": "NONE",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00089-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 258042862,
    "recordOffset": 258026468,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Last revised: 08/03/2011}",
    "TableContextTimeStampAfterTable": "{40038=For guidance on preparing final June entries to clear the U/R cost center, send email to ur-issues@mit.edu . Reminder: The F&A U/R cost center must net to zero at the end of each fiscal year. Therefore, funding for June F&A U/R must be processed as a final June entry in period 13 , that is:, 6864=The overhead rates for federal awards and sub-awards are determined in accordance with the provisions of section G-7 of the OMB Circular A-21 (effective May 1996). Federal policy requires fixing rates for the life of the award at rates in effect (including negotiated provisional rates that will be revised when the federal rates are negotiated) at the time of the award. See OSP's policy Implementation of \"Fixed Rate\" Requirements of A-21 . Most non-federal awards are established at MIT billing rates which change each FY to the current FY\u0092s federal negotiated rates. However, both federal and nonfederal sponsors occasionally specify a rate and/or base which differs from those which would normally be applied under federal and/or Institute policies.}",
    "lastModified": "Sun, 02 Aug 2015 22:25:50 GMT",
    "textBeforeTable": "Overview of Responsibilities Monitoring Phase top   OSP administrators are responsible for determining and entering the costing sheets and rates on Coeus input sheets. If the WBS element will incur U/R (other than U/R resulting from Federal A-21 \"Fixed Rate\" requirements or Training Grants), OSP administrators are also responsible for entering by Project Year the U/R amount and source of funding as entered by the DLC on the MIT Proposal Summary Form. See the OSP documentation on Research WBS Elements . Award Phase top   If a funding source other than the above is negotiated, please email CAO at ur-issues@mit.edu to determine the correct journal entries to process funding. A copy of every MIT Proposal Summary Form for proposals incurring U/R, independent of funding source, should be sent to Charlene Placido, VPR\u0092s Office, 3-240; for the School of Humanities, Arts, and Social Sciences, the proposals incurring U/R should also be routed to Charlene. Vice President for Research\u0092s (VPR\u0092s) U/R budget, 1733000 (the proposal summary form requires an approval signature by a representative of the appropriate Dean or Vice President for Research) Sponsor-funded facility costs in lieu of, or in addition to, F&A Released general (The use of released general for F&A U/R requires approval by a",
    "textAfterTable": "The F&A cost elements are used as follows: The SAP costing sheets post the system calculated F&A at MIT billing rates to the following cost elements: 600304 F&A On 600305 F&A Off   Cost Object Cost Element Debit WBS Element see above Credit Institute F&A see above If the wrong costing sheet had been assigned resulting in an error in the posted MIT billing rate amount, a JV must be prepared by CAO to correct the billing rate amount. Since manual JV entries cannot post to 600304 or 600305 (6-series cost elements), the following (4-series) cost elements are used: 490310 Correct Current Yr F&A On 490311 Correct Current Yr F&A Off 490312 Correct Prior Yr F&A On 490313",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}