{
    "relation": [
        [
            "Account Type - Non-Business",
            "",
            "Key Privilege Select Checking",
            "Key Privilege Checking",
            "Sweep Checking",
            "Key Private Bank Personal Checking",
            "Key Private Bank Money Market Checking",
            "Key Advantage Checking",
            "Key Coverage Checking",
            "Key Express Checking",
            "Key Student Checking",
            "KeyBank Hassle-Free Account",
            "Other Non-Business Checking Accounts Not Listed",
            "Any Credit Card issued by KeyBank on or after May 24, 2013, and bearing a plastic number with the first 6 digits of 524924, 519945, 552356, including KeyBank Key2More Rewards MasterCard Credit Card, Key Private Bank MasterCard Credit Card and KeyBank Platinum MasterCard Credit Card",
            "October 2013 Conversion Accounts and October 2014 Conversion Accounts",
            "",
            "Account Type - Business",
            "",
            "Key Business Rewards Checking",
            "KeyBank Basic Business Checking",
            "KeyBank Business Interest Checking",
            "Other Business Checking Accounts Not Listed",
            "Any Credit Card issued by KeyBank on or after May 24, 2013, and bearing a plastic number with the first 6 digits of 519731 including KeyBank Business Rewards MasterCard Credit Card",
            "October 2013 Conversion Accounts and October 2014 Conversion Accounts"
        ],
        [
            "Basic Rewards Annual Fee",
            "",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "$30",
            "$30",
            "$30",
            "$30",
            "N/A",
            "N/A",
            "",
            "Basic Rewards Annual Fee",
            "",
            "N/A",
            "$30",
            "$30",
            "$30",
            "N/A",
            "N/A"
        ],
        [
            "Relationship Rewards Annual Fee",
            "",
            "Fee waived",
            "Fee waived",
            "Fee waived",
            "Fee waived",
            "Fee waived",
            "$30",
            "$40",
            "$40",
            "$40",
            "$40",
            "$40",
            "Fee waived",
            "Fee waived",
            "",
            "Relationship Rewards Annual Fee",
            "",
            "Fee waived",
            "$40",
            "$40",
            "$40",
            "Fee Waived",
            "Fee waived"
        ]
    ],
    "pageTitle": "eDAS Disclosure",
    "title": "",
    "url": "https://online1.keybank.com/dcm/GetEdasDisclosure?action=special&output=html_complete&pa=INST&pg=CCA&sp=WCRB&pd=1&bn=242&name=KeyBank%20Key2More%20Rewards%20MasterCard%20CardMember%20Agreement",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00038-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 887770079,
    "recordOffset": 887726645,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{117113=9. 1099-INT Reporting. The fair market value of points earned for opening a savings account or a Certificate of Deposit, for increasing the balance in your savings account or Certificate of Deposit or renewing your Certificate of Deposit along with interest earned on your Savings account or Certificate of Deposit (further described in Section III above) will be reported to the IRS on Form 1099-INT. The 1099-INT is issued for the Savings Account or the Certificate of Deposit since the award of Rewards Points is for opening or increasing the balance of such account and such an award is considered to be interest earnings. The issuance of the 1099-INT for the Savings Account or Certificate of Deposit occurs even though the Rewards Points will be added to the available point balance for the Enrolled Checking Account., 107362=3. Redemption. Rewards Points must be redeemed by a Signer on an Eligible Product that is enrolled in the Program. Except as specified below, to redeem Rewards Points for rewards, log into www.keybankrewards.com or contact the KeyBank Rewards Center. KeyBank Rewards Center representatives are available Monday through Friday, 7 a.m. to 9 p.m. EST and Saturday through Sunday, 9 a.m. to 6 p.m. EST. For October 2013 Conversion Accounts, only the Primary Signer may redeem through www.keybankrewards.com and all other Signers must call 1-888-333-7780 to redeem Rewards Points., 40389=If you have a question about the arbitration administrators mentioned in this Arbitration Provision or would like to obtain a copy of their Arbitration Rules or fee schedules, you can contact them as follows: American Arbitration Association, 1633 Broadway, 10th Floor, New York, New York 10019, www.adr.org, (800) 778-7879. Commercial or Consumer Rules, J.A.M.S./Endispute, 222 South Riverside Plaza, Suite 1850, Chicago, IL 60606; www.jamsadr.com (800) 352-5267, Financial Services Arbitration Rules and Procedures., 108208=5. Contacting Key. Your available Rewards Points balance is available at www.keybankrewards.com and also can be obtained by calling KeyBank at 1-800-539-2968, or otherwise as determined by KeyBank from time to time. Additionally, the Rewards Points balance for the Eligible Credit Card is available on the credit card billing statement; the Rewards Points balance for the Enrolled Checking Account is available on the checking account statement as well as on branch receipts. If you are enrolled in online banking, you can access your Rewards Points balance through KeyBank Online Banking or through Key Business Online. KeyBank Rewards Center representatives are available Monday through Friday, 7 a.m. to 9 p.m. EST and Saturday through Sunday, 9 a.m. to 6 p.m. EST time. Important information regarding the Relationship Rewards Program (\"KeyBank Rewards Information\") can be found at www.key.com/rewards., 111205=Customers enrolled in Relationship Rewards can transfer all or part of their Rewards Points balance in their Relationship Rewards Account to another Relationship Rewards Account at KeyBank (\"Points Transfer\"). In order to transfer Rewards Points, a Customer can call customer service at 1-888-333-7780. A Customer must know the recipient's Relationship Rewards Account number in order to complete the transfer. If there is more than one Customer associated with a Relationship Rewards Account, each Customer may only transfer Rewards Points that were earned by such Customer. Only Customers with Relationship Rewards Accounts in good standing (as determined by KeyBank in its sole discretion) can participate in Points Transfers, either as a transferor or transferee. Transferred points retain the expiration date assigned at the time the transferred points were originally earned, not the date of transfer. All transfers are final. If Rewards Points subject to 1099 reporting are transferred, the 1099 reporting and associated tax liability remains with the Customer who earned the points., 109208=6. Redemption Allocation and Expiration. If unused, the Rewards Points carry a 4-year expiration limitation based on the date the Rewards Points were earned, and upon expiration all unused Rewards Points shall be forfeited immediately. Rewards Points redeemed and/or expired, if applicable, will be based on a first-in, first-out process. For October 2013 Conversion Accounts and October 2014 Conversion Accounts, converted Rewards Points will retain the same expiration date as they had under your previous rewards program. Points earned after the last full billing cycle prior to conversion for such Conversion Accounts will be treated as Rewards Points earned under the KeyBank Relationship Rewards Program for the purposes of determining an expiration date. Notwithstanding the foregoing, Rewards Points earned with any of the following Eligible Credit Cards will not expire: Key Private Bank MasterCard Credit Card, Key Private Bank World Elite MasterCard Credit Card and KeyBank Select World MasterCard.}",
    "textBeforeTable": "OTHER TERMS OF THE RELATIONSHIP Arbitration Provision. This Arbitration Provision sets forth the circumstances and procedures under which a Claim or Claims (as defined below) may be arbitrated instead of litigated in court. This Arbitration Provision supersedes and replaces any existing arbitration provision between you and us. This Arbitration Provision will apply to the Account(s) unless you notify us in writing that you reject the Arbitration Provision within 60 days of opening the Account(s). Send your rejection notice to KeyBank N.A., PO Box 93752, Cleveland, Ohio 44101-5752. Your notice must be legible and include your name, the names of any joint account holders and the account number(s), the last four digits of your card number, the date of your notice, your address (street, city, state and zip code), your daytime telephone number, and must be signed by at least one of the joint account holders. Your rejection notice should not include any other correspondence. Calling us to reject the Arbitration Provision or providing notice by any other manner or format than as described above will not operate as a rejection of this Arbitration Provision and consequently this Arbitration Provision will become part of this Agreement. Rejection of this Arbitration Provision does not serve as a rejection of any other term or condition of the Agreement with us governing",
    "textAfterTable": "Fees Annual Fee None Transaction Fees: Balance Transfer Fee Cash Advance Fee Convenience Check Advance Fee Cash Equivalent Fee Overdraft Protection Transfer Fee Foreign Transaction Fee Either $10.00 or 4% or of the amount of each transaction, whichever is greater. Either $10.00 or 4% or of the amount of each transaction, whichever is greater. Either $10.00 or 4% or of the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}