{
    "relation": [
        [
            "Sub-Facility ID",
            "995484",
            "995485",
            "1013578",
            "1013579",
            "1013577",
            "995487",
            "1013586",
            "1013581",
            "1013585",
            "1013582",
            "1013583",
            "1047209",
            "995486",
            "995488"
        ],
        [
            "Sub-Facility Name",
            "CATERPILLAR ENGINE G3516 LE (1340 HP)",
            "CATERPILLAR ENGINE G3516 LE (1340 HP)",
            "CATERPILLAR ENGINE G3516 LE (1340 HP)",
            "CATERPILLAR ENGINE G3516 LE (1340 HP)",
            "CATERPILLAR ENGINE G3516 LE (1340 HP)",
            "DEHYDRATOR FLARE",
            "MIRATECH ZHS-30X31-12-H1 OXIDATION CATALYST",
            "MIRATECH ZHS-30X31-12-H1 OXIDATION CATALYST",
            "MIRATECH ZHS-30X31-12-H1 OXIDATION CATALYST",
            "MIRATECH ZHS-30X31-12-H1 OXIDATION CATALYST",
            "MIRATECH ZHS-30X31-12-H1 OXIDATION CATALYST",
            "MISC VOCS; TANKS, LEAKS, BLOWDOWNS, ETC",
            "NATCO DEHYDRATOR",
            "TWO 400 BBL CONDENSATE TANKS"
        ],
        [
            "Description",
            "Process",
            "Process",
            "Process",
            "Process",
            "Process",
            "Air Pollution Control Device",
            "Air Pollution Control Device",
            "Air Pollution Control Device",
            "Air Pollution Control Device",
            "Air Pollution Control Device",
            "Air Pollution Control Device",
            "Process",
            "Process",
            "Process"
        ]
    ],
    "pageTitle": "Marcellus Gas Facilities - Gas Plants and Compressor Stations",
    "title": "",
    "url": "http://www.marcellus-shale.us/Marcellus-gas-facilities.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00114-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 561824379,
    "recordOffset": 561771657,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3884=PENNSYLVANIA BULLETIN VOL. 45, NO. 25 JUNE 20, 2015 Page 3266, 3268=10-00368: MarkWest Liberty Bluestone, LLC—Bluestone Gas Processing Plant (1515 Arapahoe St., Tower 1, Suite 1600, Denver, CO 80202) for its facility located in Jackson Township, Butler County. The de minimis increases are a result of the addition of a temporary mobile flare. The Department has started a list of de minimis increases as prescribed in 25 Pa. Code § 127.449(i)., 9056=10-368D: MarkWest Liberty Bluestone, LLC (1515 Arapahoe St., Suite 1600, Denver, CO 80202) for construction of additional sources at their existing natural gas processing plant in Jackson Township, Butler County., 26018=The report detailing events before and after the blast and fire at the Lathrop compressor station in Springville Twp. on March 29 was submitted to the Department of Environmental Protection on April 7. The incident also raised concerns about the safety and oversight of the natural gas infrastructure which, because it is in a rural area, is not regulated like pipelines and compressors in more populated places., 9841=PENNSYLVANIA BULLETIN VOL. 45, NO. 20 MAY 16, 2015, 26419=April 15, 2012 – A worker who heard gas flowing from an open valve on a Susquehanna County compressor engine pulled an emergency shutdown switch as he evacuated the station, stopping the flow of gas to the building just before it exploded, according to a report by Williams Partners released Friday by state regulators., 21395=By Don Hopey / Pittsburgh Post-Gazette October 20, 2014, 2590=Since the November 6, 2013 State Only Operating Permit issuance date, MarkWest has notified the Department of the following de minimis emission increases:, 11018=PA BULLETIN - JAN. 7, 2012}",
    "TableContextTimeStampAfterTable": "{369984=01/14/2009, 248603=1021800, 243387=1021795, 213525=Enforcement ID: 312786, 315300=621863, 401724=Penalty Amount Assessed: 2000, 67561=SEPTEMBER 17, 2011 PENNSYLVANIA BULLETIN, VOL. 41, NO. 38, 12788=June 6, 2015 - Pennsylvania Bulletin, 30215=44 Pennsylvania Bulletin 2271 Saturday, April 12, 2014, 175760=Date Executed: 04/27/2009, 14457=PENNSYLVANIA BULLETIN, VOL. 45, NO. 16 APRIL 18, 2015, 31931=44 Pennsylvania Bulletin 2645 Saturday, May 3, 2014, 424866=Homepage     Terms of use Copyright ©2009-2015    Marcellus-Shale.us    All rights reserved., 245540=CATERPILLAR G3516LE NAT GAS ENGINE 1 (1340 BHP), 298667=Enforcement ID: 281063, 244889=CATERPILLAR G3516B NAT GAS ENGINE 3 (1380 BHP), 389099=63-00969A: MarkWest Liberty Midstream and Resources, LLC (1515 Arapahoe Street Tower 2, Suite 700, Denver, CO 80202-2126) Extension effective May 2, 2015, to extend the period of temporary operation of new rich burn natural gas-fired compressor engines rated at 1,980 bhps each and controlled by three-way catalysts authorized under PA-63-00969A until November 2, 2015, at the Three Brothers Compressor Station located in Smith Township, Washington County.  , 35492=DOERFLER COMPRESSOR STATION Off Grange Rd, east of Bentleyville, Pa NEAR 84 LOCUST RD COAL CENTER, PA  15423-1315  , 63374=LAND RECYCLING AND ENVIRONMENTAL REMEDIATION UNDER ACT 2, 1995 PREAMBLE 2, 246192=CATERPILLAR G3516LE NAT GAS ENGINE 2 (1340 BHP), 244038=1021796, 295676=01/31/2012, 214595=Date Executed: 06/25/2014, 299748=Date Executed: 03/06/2012, 170886=561142, 244689=1021797, 180355=Date Executed: 07/10/2009, 196492=Issued July 3, 2014, 18617=January 7, 2012 - Pennsylvania Bulletin, 278625=Pennsylvania DEP Permitting Permit issued December 12, 2011, 277959=GP5-63-00960B: MarkWest Liberty Midstream and Resources, LLC (1515 Arapahoe Street Tower 2, Suite 700, Denver, CO 80202-2126) on December 12, 2011, to allow increased throughput up to 60 MMSCF/day for the existing tri ethylene glycol dehydrator and the installation of a larger reboiler rated at 2.0 MMBtu/hr in replacement of the existing reboiler at the Baker Compressor Station, located in Amwell Township, Washington County. A total of five compressor engines are authorized for operation at this site.  , 247950=1021799, 174944=Penalty Final Date: 07/10/2009, 185842=PENNSYLVANIA BULLETIN, VOL. 45, NO. 16 APRIL 18, 2015, 225075=05/06/2010, 243587=CATERPILLAR G3516B NAT GAS ENGINE 1 (1380 BHP), 195531=1074771  130MMSCFD TEG DEHY WITH 2.0MMBTU/HR REBOILER 1074776  CONDENSATE STORAGE TANKS  Process 1074765  JOHNSON MATTHEY NSCR  Air Pollution Control Device 1074766  JOHNSON MATTHEY NSCR  Air Pollution Control Device 1074773  SUPERIOR FABRICATION 2.1MMBTU/HR 48\" ENCLOSED FLARE  Air Pollution Control Device 1074777  VAPOR RECOVER UNIT  Air Pollution Control Device 1074763  WAUKESHA L7042-GSI 1480-BHP (ENGINE 1)  Process 1074764  WAUKESHA L7042-GSI 1480-BHP (ENGINE 2)  Process (2,960 HP - Initial compression horsepower), 65839=October 12, 2011 - A fire that broke out inside a metal building at a MarkWest Energy compressor station on Scenic Drive in Independence, Washington County, but did not spread beyond the building, according to the Washington County Emergency Management Agency. The fire was extinguished without damaging any other part of the natural gas processing facility, emergency officials said., 241774=09/15/2010, 171109=04/20/2009, 405556=681881, 253043=PA Code Legal Citation: P.L. 1987 402, 194940=Issued March 20, 2012, 242161=Issued 10/07/2010, 18739=63-00955A: National Fuel Gas Supply Corp. (1100 State Street, Erie, PA 16512) on December 22, 2011, as a result of equipment startup, to establish the 180-day period of temporary operation of two new lean burn natural gas-fired compressor engines rated at 2,370 bhp each and controlled by oxidation catalysts authorized under plan approval PA-63-00955A, until April 26, 2012, at Buffalo Compressor Station in Buffalo Township, Washington County., 187770=63-00983A: Columbia Gas Transmission Co. (1700 MacCorkle Avenue, Charleston, WV 25314-1518) for construction and temporary operation of two (2) new natural gas-fired compressor turbines at their Redd Farm Compressor Station in Amwell Township, Washington County. In accordance with 25 Pa. Code §§ 127.44, the Pennsylvania Department of Environmental Protection (DEP) is providing notice that it intends to issue a Plan Approval to Columbia Gas Transmission Company (1700 Mac-Corkle Avenue, Charleston, WV 25314-1518) for the construction and temporary operation of two (2) new natural gas-fired compressor turbines at its Redd Farm Compressor Station located in Amwell Township, Washington County. Equipment at this facility includes two (2) natural gas fired Solar Turbines each rated at 4,700 bhp, one (1) natural gas fired emergency generator rated at 440 bhp, one (1) Indirect-fired Heat Exchanger rated at 0.75 MMBtu/hr, and forty (40) Catalytic Space Heaters each rated at 72,000 Btu/hr or Bruest 12-60 each rated at 30,000 Btu/hr., 6544=1061270, 252194=06/23/2009, 4468=08/25/2011, 413635=THREE BROTHERS COMPRESSOR STATION December 30, 2011 - Pa DEP Permitting 2,960 Compression Horsepower  , 207291=06/25/2014, 228146=Enforcement ID: 261567, 200787=63-00968A: MarkWest Liberty Midstream and Resources, LLC (1515 Arapahoe Street Tower 1, Suite 1600, Denver, CO 80202-2137) Extension effective December 24, 2014, to extend the period of temporary operation of eight new rich burn natural gas-fired compressor engines rated at 1,980 bhp each [15,840 HP total] and controlled by three-way catalysts authorized under PA-63-00968A until June 24, 2015, at the Smith Compressor Station located in Smith Township, Washington County., 418783=PA-63-00965A: Rice Poseidon Midstream LLC (400 Woodcliff Drive, Canonsburg, PA 15317-9554) Plan Approval Extension issuance date effective May 20, 2015, to extend the period of temporary operation for 180 days to prepare and submit State Only Operating Permit application for their Twilight Compressor Station located in West Pike Run Township, Washington County., 319561=Pennsylvania Bulletin January 7, 2012, 199987=PENNSYLVANIA BULLETIN, VOL. 45, NO. 2, JANUARY 10, 2015 (Page 257), 187660=Pennsylvania Bulletin January 4, 2014, 405854=10/30/2013, 33222=44 Pennsylvania Bulletin 7444 Saturday, November 29, 2014, 247297=1021798, 232980=Penalty Final Date: 01/10/2011, 233817=Date Executed: 01/10/2011, 249256=1021801, 245992=1021794, 28396=December 10, 2014 - MarkWest will be able to keep its Carpenter compressor station in Donegal Township as it currently stands, but the company must cease construction until it gets a building permit. That was the decision of a three-member appeals board Wednesday, which called a hearing to order after MarkWest appealed the decision by township code officials to deny them a building permit to construct a football field-sized facility for compressing natural gas., 229216=Date Executed: 07/14/2010, 414938=THREE BROTHERS COMPRESSOR STATION October 27, 2014 - Pa DEP Permitting 15,840 Compression Horsepower Bringing total compression horsepower to 18,800  , 15251=63-00955: National Fuel Gas Supply Corporation (1100 State Street, Erie, PA 16512) In accordance with 25 Pa. Code §§ 127.424 and 127.425, notice is hereby given that the Pennsylvania Department of Environmental Protection (DEP) intends to issue an Air Quality State Only Operating Permit (SOOP) to National Fuel Gas Supply Corporation to authorize the operation of a natural gas transmission station known as the Buffalo Compressor Station, located in Buffalo Township, Washington County., 244238=CATERPILLAR G3516B NAT GAS ENGINE 2 (1380 BHP), 397284=Date Executed: 04/09/2013, 402021=Date Executed: 03/31/2014, 32736=63-00987A: Mark West Liberty Midstream & Resources, LLC (1515 Arapahoe Street, Tower 1, Suite 1600, Denver, CO 80202-2137) for two Caterpillar 3612LE TA compressor engines at the Carpenter Compressor Station in Donegal Township, Washington County. This is a minor Plan Approval application submittal., 315526=06/09/2011, 218170=06/15/2014, 378455=PA Code Legal Citation: P.L. 1987 401, 256279=Date Executed: 06/26/2009, 40508=January 25, 2012 Source: Pennsylvania DEP, 392870=04/03/2013, 30747=GP5-63-00987: MarkWest Liberty Midstream and Resources, LLC (1515 Arapahoe Street Tower 1, Suite 1600, Denver, CO 80202-2137) on March 31, 2014, to authorize the installation and operation of a natural gas compressor station consisting of three lean burn natural gas-fired compressor engines rated at 2,370 bhp each and controlled by oxidation catalysts, one lean burn natural gas-fired compressor engine rated at 3,550 bhp and controlled by an oxidation catalyst, one tri ethylene glycol dehydrator (including reboiler) rated for 70 MMSCF/day and controlled by an enclosed flare, and four 400 bbl condensate tanks controlled by a vapor recovery unit. Other miscellaneous sources include two rich burn natural gas-fired generator engines (one primary and one backup) rated at 1,053 bhp each and controlled by non-selective catalytic reduction. The facility will be authorized under GP-5 for natural gas production, named Carpenter Compressor Station, and located in Donegal Township, Washington County., 402840=Total Amount Collected: 2000, 33757=GP5-63-00987A: MarkWest Liberty Midstream & Resources, LLC (1515 Arapahoe Street, Tower 1, Suite 1600, Denver, CO 80202) on November 10, 2014, received authorization under GP-5 for construction and/or operation of sources and controls associated with a natural gas compression facility at its Carpenter Compressor Station located in Donegal Township, Washington County.  , 291865=4/29/2011 - Stream discharge of IW, includes drill cuttings, oil, brine and/or silt., 306345=06/17/2011, 64318=Tetra Tech, Inc., 6715 Tippecanoe Road, Canfield, OH 44408 on behalf of MarkWest Liberty Midstream & Resources, LLC., 4600 J. Barry Court, Suite 500, Canonsburg, PA 15317 has submitted a Final Report concerning the remediation of site soils and groundwater contaminated with benzene, toluene, ethylbenzene, xylene (BTEX) from a release of condensate from compressor skid dump tank. The Final Report is intended to document remediation of the site to meet the residential Statewide Health standard. Notice of the final report was published in the Observer-Reporter on March 23, 2015.  , 303349=08/18/2011, 410712=Date Executed: 11/04/2013, 388273=PENNSYLVANIA BULLETIN VOL. 45, NO. 20 MAY 16, 2015, 291568=Violation Details for Inspection ID: 1972476 Source: Pennsylvania DEP, 246644=1021802, 13396=SOOP-63-00955: National Fuel Gas Supply Corporation (6363 Main Street, Williamsville, NY 14221) SOOP issued on May 21, 2015, for operation the Buffalo Compressor Station located in Buffalo Township, Washington County. The facility consists of two natural gas compressor engines rated at 2,370 bhps each and controlled by oxidation catalysts, two natural gas compressor turbines rated at 10,280 HPs each, and one natural gas-fired emergency generator rated at 803 bhps and controlled by an oxidation catalyst., 7306=1061269, 245340=1021793, 63098=PENNSYLVANIA BULLETIN Page 2179}",
    "lastModified": "Sat, 01 Aug 2015 00:41:18 GMT",
    "textBeforeTable": "Pending Status: 01/25/2012 Date received: FACILITY Authorization is for: New Application type: AQ General Permit Authorization type: MARKWEST LIBERTY MIDSTREAM & RESOURCES LLC Client: FULTON BOOSTER STA Site: GP5-63-00937D Permit number: 911804 Authorization ID: January 25, 2012 Source: Pennsylvania DEP",
    "textAfterTable": "    Violation Details for Inspection ID: 1818972 Source: Pennsylvania DEP Violation ID Date Violation Description 568899 6/23/2009 Failure to obtain an Erosion and Sediment Control Permit. Resolution: Addressed Through Enforcement PA Code Legal Citation: 25 pa. Code 102.5 : PA Code Website Violation Type: Environmental Health & Safety Related Enforcements Please note: the following related enforcement data is accumulated from possibly many different sites/facilities that may be unrelated to the facility for this inspection. Enforcement ID: 248856 Penalty Final Date:   Enforcement Type: Consent Order and Agreement Penalty Amount Assessed: 249900 Date Executed: 06/26/2009 Total Amount Due: 0 Taken Against: MARKWEST LIBERTY MIDSTREAM & RESOURCES LLC Total Amount Collected: 249900 On Appeal? N Penalty",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}