{
    "relation": [
        [
            "Product Code",
            "DS60-R1",
            "DS60-SS1",
            "DS60-B100"
        ],
        [
            "Size",
            "2 cu.ft.",
            "1 cu.yd.",
            ""
        ],
        [
            "Qty",
            "80 Bags/Pallet",
            "24 Bags/Semi",
            "1 Semi Load"
        ],
        [
            "UPC",
            "837654638187",
            "",
            ""
        ]
    ],
    "pageTitle": "Professional Grow Mixes, Soilless grow media, potting soils, garden mixes, organic composts and fertilizers",
    "title": "",
    "url": "http://www.designersoils.com/proproducts.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00314-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 393609119,
    "recordOffset": 393600917,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47911=© Wolf Mountain Products 2009-2010, All Rights Reserved.}",
    "lastModified": "Wed, 29 Dec 2010 23:08:29 GMT",
    "textBeforeTable": "Designer Soils® DS10 Peat/Bark Mix with Vermiculite   Our DS10 is an excellent all purpose general grow mix. Medium textured for a well drained mix. Ideal for potted plants, flowering and vegetable plants, hanging baskets, cuttings and seeds.       Professional Grow Mix     In addition to the various Professional Grow Mixes described below, we also offer a wide range of liquid/fertigation nutrition products (fertilizers) to meet your exacting needs. These include various slow release nitrogen, potassium products, organic humic and fulvic acids and our beneficial microbe products. For information on these premium products please contact us.   At present our professional grow mixes come in 2 cubic foot bags, one yard or two yard SuperSacks and in bulk via a moving floor semi-trailer. Additionally a 2.8 cubic foot clear bag is available for customers who desire them.   If you are a professional grower and would like a sample of one of the mixes below, please email us.   Download our Professional Grow Mix overview sheet   Various liquid nutrition (fertilizer) products Gypsum Dolomitic limestone Long lasting wetting agent Slow release potassium (K) BMI-1™ Beneficial Microbes (pharmacudical grade with over 200 microbial strands) RootShield®",
    "textAfterTable": "Ingredients: Canadian sphagnum peat moss, 3/8\"-minus processed and composted bark, horticultural grade perlite, horticultural grade vermiculite, Dolomitic limestone, wetting agent, starter fertilizer charge with micronutrients (Designer Soils® Balance™, 9-6-8 w/ micros, 33% slow release nitrogen), BMI-1™ (mychorrizae beneficial microbe package), Blue Chip® controlled release fertilizer. Back to Quick Link     Designer Soils® DS20 Profesional Annual and Perennial Peat Mix   Our DS20 is an excellent all purpose general grow mix. Medium textured for a well drained mix. Ideal for bedding plants, flowering and vegetable plants, hanging baskets, interiorscapes, cuttings and seeds. Product Code Size Qty UPC DS20-R1 2 cu.ft. 60 Bags/Pallet 837654638095 DS20-SS1 1 cu.yd. 24 Bags/Semi DS20-B100 1 Semi Load Ingredients: Canadian sphagnum peat moss, 3/8\"-minus processed and composted bark, horticultural grade perlite, Dolomite limestone, wetting agent, starter fertilizer charge with micronutrients (Designer Soils® Balance™, 9-6-8 w/ micros, 33% slow release nitrogen), BMI-1™ (mychorrizae beneficial microbe package), Blue Chip® controlled release fertilizer. Back to Quick Link     Designer Soils® DS21 Poinsettia and Mum Mix   Our",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}