{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I've never felt unsafe walking places alone at night, and there are blue-light phones everywhere.",
            "No experience, and none desired.",
            "Artsy, independent, gay/queer, relaxed, quirky, conscientious, smart, sassy, intense.",
            "Three Man Hill is the site of a lot of traditions and pasttimes--it's this huge hill at the edge of campus with a gigantic metal statue of three humanoid-ish figures on it.",
            "Intense!",
            "Go downtown, go to the Dunkirk Movieplex (commonly known as the Stickyplex), and laugh at kids staggering downtown on Thursday, Friday, and Saturday nights. And don't forget to read the police blotter on Mondays!",
            "Cranston is the best, and Erie is great for some home-cooked, mom-type casseroley things.",
            "Generally quiet and safe.",
            "Depends on the professor, the class, and even the major.",
            "Don't spend your whole meal plan on Starbucks, do familiarize yourself with the library, and don't bother putting money on your Fredonia debit--just be sure to return your library books on time, or be fined to death!",
            "The classes are small, and sure, you could skate by, but who wants that? You will get as much out of this place as you put in, and learning that is what college is all about. A great place to learn and grow."
        ]
    ],
    "pageTitle": "SUNY at Fredonia Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/SUNY-at-Fredonia/reviews?_escaped_fragment_=/show/81431",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00021-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909906087,
    "recordOffset": 909852602,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{214303=© 2015, Cappex.com, LLC, 56273=Three main places on campus. Erie and Cranston are only open until 7:30 and Willy C. is open til midnight. There is also the convenience store and star bucks(on-campus)., 91787=FREDFEST!!! every May to end the year Spectrum hosts Fred Fest and it's a weekend tradition. A well known musical perform comes and it's one of the best weekends on campus, 183109=Don't be afraid to ask teachers for help, they are always willing to give assistance. Buy a big jacket before you come here, because there is snow, in October. Yeah., 205691=Every year on the first weekend of May the school puts on FredFest. This is an amazing event that incorporates many student groups and brings the entire campus together to relax, celebrate the end of the school year, and rid themselves of the stress it has caused for the past 9 months! I won't tell you too much about it, you'll just have to come check it out for yourself!, 2364=Any attempt to discuss my inaugural year at Fredonia feels a bit overwhelming. There are so many things to say and memories to relive that it seems impossible for me to adequately convey how much Fredonia has come to mean to me, and how grateful I feel to have found a place where I am able to learn not only about academic topics and performances skills, but more significantly, about others and myself. Admittedly, my goals upon arriving at Fredonia consisted mainly of learning about my craft of Musical Theatre, and learning how to make my dream of having a long, fulfilling career as a performing artist a reality. I soon discovered, however, that college life would not be exclusively devoted to improving my knowledge and skills within my designated major. In fact, from the beginning of the Convocation ceremony, the freshmen class of 2012 was urged to become observers of the whole world: documentarians of what we saw, felt and explored. We were urged to recognize and become aware of our interrelatedness and connectedness, and told that limitless observation is necessary to facilitate conductive learning and growth not only for the duration of our college years, but for as long as we are productive, active citizens striving for a better comprehension of our society, goals, and personal identities. I knew at that moment, as I listened to these suggestions, that not only was I about to embark on a journey of exciting educational opportunities, but that I was about to uncover new and revolutionary ways to look at myself, my goals, and the people around me.}",
    "textBeforeTable": "07/19/2009 Reviewer is A current student here. 18 out of 20 people found this review useful. 1 of 44 Lisa from Bloomfield Hills, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. SUNY at Fredonia Reviews SUNY at Fredonia › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Danielle from Rensselaer, NY 03/22/2011 Reviewer is A current student here. 6 out of 6 people found this review useful. 3 of 44 Categories Comments Great for these types of students People who like music or are music students. I am a science student and the balance I get here of arts and science is perfect. There's enough of everything. People who like cold and people who like small towns, as Fredonia is very small. Tips for prospective students Make sure you like or can deal with cold weather. Be open, people here are willing to make new friends and you should not doubt that. This school is really friendly and a great place to live. I cannot imagine a better place to go to school. The small campus is also awesome as you don't have to worry about being lost in the crowd, and classes are really close! Bang for the buck A SUNY college is perfect for a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}