{
    "relation": [
        [
            "",
            "Sales",
            "Cost of Sales (Direct Exp)",
            "Other expenses",
            "Taxable income"
        ],
        [
            "Domestic",
            "$1,000",
            "600",
            "100",
            "300"
        ],
        [
            "Export",
            "1,000",
            "600",
            "200",
            "200"
        ]
    ],
    "pageTitle": "IC-DISC Audit Guide",
    "title": "",
    "url": "http://www.irs.gov/Businesses/International-Businesses/IC-DISC-Audit-Guide",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00019-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 523401335,
    "recordOffset": 523324692,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21610=The 1984 modification continued to provide for income deferral through the use of the DISC as a tax favored vehicle but only if the DISC shareholders paid an interest charge for the right to defer the income. This new DISC entity was therefore called an IC-DISC. Most of the IRC and regulations have not been amended to reflect this change, as such references to DISC should be read as IC-DISC., 308114=TD 8805 issued, January 11, 1999, contains final and temporary regulation regarding the “Allocation of Loss With Respect to Stock and Other Personal Property; Application of Section 904 to Income Subject to Separate Limitations”. , 31920=The 1120 IC-DISC return must be filed on or before the 15th day of the ninth month following the close of the DISC taxable year. [1], 166070=1120-IC-DISC Schedule P – Part 1 Section A – CTI calculation, 85056=For taxable years beginning after November 3, 1972, the Export Sales program of the Commodity Credit Corporation authorized by sections 5(d) and (f) of the Commodity Credit Corporation Charter Act, as amended (15 U.S.C. 714c(d) and (f)), other than the GSM-4 program provided under 7 CFR 1488, and section 407 of the Agricultural Act of 1949, as amended (7 U.S.C. 1427), for the purpose of disposing of surplus agricultural commodities and exporting or causing to be exported agricultural commodities., 122358=See also PLR 8436028, 1984 WL 267617 (IRS PLR) and Rev. Rul. 72-581, 1972-2 C.B. 461. , 270221=The consent must be signified by a statement that satisfies the requirement of and is filed in the manner prescribed by Treas. Reg. § 1.1561-3., 328564=[37] The Commissioner acquiesced in result only in the General Electric decision. 2003-49 I.R.B. 1172 (2003)., 29508=If the Form 1120-IC-DISC is received with tax, and/or a payment an account on the ANMF database would be established. Anyone can research the ANMF database once they have received an ANMF Research group password. They also would be able to request transcript, place a history on the account which would include their fax number, and the NMF Team would fax the request directly to the requestor., 16945=This guide was developed to assist International Examiners in the audit of Form 1120 IC-DISC’s., 27101=Requests for the printing & faxing of requested ANMF transcripts should be faxed to 859-669-2959., 44023=Please note, similar to other regulations sections discussed above, proposed regulations were drafted for years after 1984 and will be applicable to the tax years you have under examination. Be sure that you refer to the proposed regulations where ever they are provided., 120671=General Dynamics Corp. v. Commissioner, 108 T.C. 107 (1997).  Petitioners manufactured two specialized vessels that were designed and built for transoceanic transport of liquefied natural gas. The tankers were manufactured under contract for sale to a company for direct use outside the United States. After the completion, but before the tankers could be used for foreign purposes, unforeseen delays caused some domestic use of one of the tankers. The delay also caused both tankers not to be placed in foreign commerce prior to 1 year after their sale.  The court cited Sim-Air, USA, Ltd. v. Commissioner, 98 T.C. 187 (1992), and held that the Treas. Reg. § 1.993-3(d)(2)(i)(b) one year requirement was not met.  The court stated that Treas. Reg. § 1.993-3(d)(2)(i)(b) does not provide any exception for reasonable delay or unforeseen events.  Thus, the taxpayer did not have export property. Sim-Air, USA, Ltd. v. Commissioner, 98 T.C. 187 (1992). In 1981, the taxpayer purchased a helicopter from Bell Helicopter.  The taxpayer intended to use the helicopter in a joint venture in Egypt, but the joint venture never materialized.  In 1985, taxpayer transferred back the helicopter to Bell Helicopter and taxpayer claimed the proceeds on the helicopter transfer as QER.  Bell Helicopter did not export it to the purchaser until later that year.  Tax Court held the helicopter was not export property because Bell Helicopter did not export the helicopter within one year as required under Treas. Reg. § 1.993-3(d)(2)(i)(b). [38], 247283=See Napp Systems, Inc. v. Commissioner, T.C. Memo 1993-196 (1993).  The taxpayer calculated their DISC commissions using a country-by-country grouping.  The court rejected the taxpayer’s grouping because it violated Treas. Reg. § 1.994-1(c)(7), which only allows grouping transactions by product or product line. , 315985=Any combination based solely on its computer program's ability to maximize FTI. The group must be based upon SIC or recognized industry trade and usage. Note: In 1997, the SIC codes were replaced by the North American Industry Classification System (“NAICS”) codes., 306643=In Dresser Industries Inc. v. Commissioner, 911 F.2d 1128 (5th Cir. 1990), the 5th Circuit allowed taxpayer to net interest income and interest expense.  Treas. Reg. § 1.861-8 was later revised in 1977 and supersedes this case as discussed in the later Dresser Industries case below. , 44585=Generally, a DISC is not subject to the tax under subtitle A of the Code (§§ 1-1564) with the exception of taxes imposed under chapter 5 of subtitle A (§§ 1491-1494) dealing with certain transfers to avoid tax.  It will, however, be subject to all taxes imposed under other subtitles of the Code (for example – employment taxes and other taxes under subtitle C, the interest equalization tax and other excise taxes under subtitle D, etc.)., 137988=TRA of 1997 amended IRC § 927(a)(2)(B), which was identical in wording to IRC § 993(c)(2)(B), to explicitly include computer software (whether or not patented) in the definition of export property for receipts attributable to periods after 12/31/97. , 280077=Special rule for after 1984. —For taxable years beginning after December 31, 1984, in the case of a DISC shareholder which is a C corporation, the rules for actual distributions to meet qualifications requirements and any deemed distributions relation to foreign investments attributable to producer’s loans shall apply to 16/17 of the amount of an actual distribution made pursuant to Treas. Reg. §1.992-3 to satisfy the condition of Treas. Reg. §1.992-1(b) (the gross receipts test) and the general rule above shall apply to one-seventeenth (1/17) of such amount. [100], 84890=The section 32 export payment programs authorized by section 32 of the Act of August 24, 1935, as amended (7 U.S.C. 612c), and, 87678=The Foreign Military Sales Act, as amended (22 U.S.C. § 2751 et seq.), or a program under which the U.S. Government purchases property for resale, on commercial terms, to a foreign government or agency or instrumentality thereof, or, 110359=FMV of foreign content is the appraised value as determined under § 402 of the Tariff Act of 1930 (19 U.S.C. 1401a) in connection with their importation., 24545=Once received by the Service Center, all Forms 1120 IC-DISC are first processed in the Covington Service Center’s Document Perfection (“Code & Edit”) section., 28876=For complete instructions for researching NMF, refer to IRM 3.17.46, Automated Non-Master File Accounting, or contact the NMF unit in the Accounting Branch., 26115=The proper procedure to secure these returns is by means of a paper request which generally consists of submitting requests to Accounting via Form 2275, Record Request Charge and Recharge., 335126=The IRS nonacquiesced to the opinion. See AOD-1999-05.  , 276630=In determining the amount of shareholder B's deferred DISC income for B's taxable year ending June 30, 2007, the computation year is the DISC's taxable year ending December 31, 2005, that is, the taxable year of the DISC ending within B's taxable year preceding the taxable year of B for which B's deferred DISC income is being determined., 139732=A product is considered an export controlled product if at a particular time it is prohibited or curtailed under Section 4(b) of the Export Administration Act of 1969 or Section 7(a) of the Export Administration Act of 1979 or any other similar act., 22385=The Service saw relatively few DISC tax returns between 1984 and 2006 because taxpayers preferred the FSC and later the ETI regimes, which generally produced larger tax benefits. Further, the FSC rules and the ETI rules denied double benefits under either provision to taxpayers that also had a DISC., 182248=1120-IC-DISC Schedule P - CTI calculation – Part 1 Section A, 43586=the DISC reports deferred DISC income to you on line 10, Part III of Schedule K (Form 1120-IC-DISC); and, 251471=A corporation which is a DISC for a taxable year is not subject to any tax imposed by subtitle A of the Code for the taxable year, except for the tax imposed by chapter 5 thereof (IRC §§ 1491 through 1494) on certain transfers to avoid tax. [64], 83663=The development loan program, or grants under the technical cooperation and development grants program of the Agency for International Development, or grants under the military assistance program administered by the Department of Defense, pursuant to the Foreign Assistance Act of 1961, as amended (22 U.S.C. 2151), unless the DISC shows to the satisfaction of the Service that, under the conditions existing at the time of the sale, the purchaser had a reasonable opportunity to purchase, on competitive terms and from a seller who was not a U.S. person, goods which were substantially identical to such property and which were not manufactured, produced, grown, or extracted (as described in Treas. Reg. § 1.993-3(c)) in the United States, , 105923=Bausch & Lomb, Inc. v. Commissioner, TCM 1996-57 (1996).  The Tax Court held that taxpayer’s full range of activities necessary to assemble sunglass parts into finished, quality sunglasses were substantial in nature.  Such activities involved the following: 1) leased production facilities to assemble sunglasses, 2) employed management teams to prepare production plans and order parts from their suppliers, 3) hired and trained the necessary personnel to carry out their operations, 4) inspected purchased parts for defects and prepared those parts for assembly, 5) assembled sunglass parts into finished sunglasses, 6) inspected finished sunglasses for cosmetic and functional defects, and 7) cleaned and packaged sunglasses to prepare them for distribution.  The court found that assembly operations required a trained and experienced workforce.  While conceding that the assembly operations did not require a large investment in physical capital, the court noted that they required a large investment in human capital.  The court also rejected government’s assertion that operations require substantial amounts of time to complete to be substantial in nature.  The court also took into consideration that the high-end sunglass industry would consider the operations to constitute the manufacture or production of property.  This case expanded the definition of what constitutes manufacturing and clouded the concept of minor assembly., 274259=Under IRC § 995(f)(2), the shareholder's DISC-related deferred tax liability, with respect to any taxable year of a DISC shareholder ending after 1984, is the excess of —, 61061=The proposed treasury regulations issued in 1984 have not been made final and the regulations have not been updated to reflect the changes brought about by the change in the law.  The term DISC is still used through out the regulations.  Any reference to DISC should be read to mean IC-DISC., 216527=Brown-Forman Corp. v. Commissioner, 94 T.C. 919 (1990), aff’d, on a different issue, 955 F.2d 1037 (6th Cir. 1992), cert. denied, 506 U.S. 827 (1992)., 283261=The DISC return is Form 1120-IC-DISC. It is useful to read the instructions to the Form 1120-IC-DISC., 26341=The forms should be sent to Cincinnati SPC, PO BOX 12267 Covington, KY 41012., 21471=In 1984, Congress modified the statutes and limited the impact of the DISC benefits., 306979=In Dresser Industries, Inc. v. United States, 73 F. Supp 2d 682 (N.D. Tex. 1999), aff'd, 238 F.3d 603 (2001).  Dresser filed a refund claim for the 1981 to 1987 tax years.  One of the issues involved the netting of interest income and expenses for the purposes of calculating CTI.  The District Court held that “Dresser is not entitled to net gross interest income against gross interest expense in computing the combined taxable income of its DISC and related supplier for the 1984 and 1985 tax years,” based upon the 1977 amendments to Treas. Reg. § 1.861-8(e)(2)., 31013=Prop. Treas. Reg. § 1.991-1(a) amended the original DISC regulation by adding the provision that for years after 1984 the shareholders of a DISC are required to pay an annual interest charge on the shareholders “DISC related deferred tax liability.”, 301021=Boeing Co. v. United States abrogates St. Jude Medical, Inc. v. Commissioner, 34 F.3d 1394 (8th Cir. 1994)., 60743=Section 805(b)(1)(A) of the Tax Reform Act of 1984 terminated all DISC and DISC elections as of December 31, 1984. This same provision then provided that a new election must be filed on the Form 4876A for corporations to continue to use the IRC §§ 991-997 rules as a DISC., 246248=Generally, the determination of DISC taxable income under IRC § 994 is to be made on a transaction by transaction basis. However at the annual election of the taxpayer (demonstrated by checking the appropriate box on Form 1120 IC-DISC Schedule P) some or all of the computations of DISC taxable income may be made on the basis of groups consisting of products or product lines. [62], 25940=The 1120 IC-DISC return is processed as a NMF (See IRM section 21.8.3.1.2). They are processed as MFT 23 - tax class 06., 275972=B, a minority shareholder (fiscal year ending June 30 taxpayer)., 117780=General Electric Co. v. Commissioner, T.C. Memo. 1995-306, rev'd in part, vacated in part, and remanded, 245 F.3d 149 (2d Cir. 2001). [37] General Electric (“GE”) manufactured aircraft engines and thrust reversers in the U.S. and sold them through its commission DISC to foreign airline companies as well as to U.S. manufacturers.  Prior to being exported, these products were installed on the airplane sold by U.S. airframe manufacturers to foreign airlines.  The installation process was performed in the U.S.  This process involved 110 to 160 hours of constructing a build-up consisting of over 2,000 parts from more than 40 different vendors and then using four bolts to attach the engine to the plane.  Finally, an additional 60 to 65 hours were required to attach the reversers to the airplane.  The Tax Court held the U.S. airframe manufacturers’ activities to constitute further manufacturing, assembling, or other processing under Treas. Reg. § 1.993-3(d)(2)(iii) disqualifying the aircraft engines and reversers from being export property under Treas. Reg. § 1.993-3. However, on appeal, the Second Circuit reversed the decision of the Tax Court on the engines issue and vacated the Tax Court's judgment on the thrust reversers issue.  Specifically, the Second Circuit held that the attachment of engines to an airframe does not constitute assembly or other processing under Treas. Reg. § 1.993-3(d)(2)(iii).  The Second Circuit reasoned that the airframes and engines were distinct from each other physically (for example, routine removal and replacement); legally (for example, under FAA regulations and Government determinations); and commercially (for example, separate marketing and negotiations between the component-maker and the end user of the final product).  The Second Circuit described the activities as follows:  “when [the airframe manufacturers] installed the engines on the airframes, [they] were not moving the engines along toward completion, or substantially changing them….  Rather, [the airframe manufacturers] were simply affixing a completed export product (an engine that was itself already in the form in which it was to be delivered) to another product (an airframe).”  In addition, the Second Circuit observed that engines and thrust reversers may differ materially.  Because the Tax Court's analysis did not differentiate between the engines and the thrust reversers, the Second Circuit sent the issue back to the Tax Court for further consideration in light of its opinion. , 26477=Form 2275 is used to request income tax returns, information related thereto, and other Service documents. It serves as a charge out and recharge record. If the returns requested are current year returns (in the last 6 months) they will be filed in automated non-master file accounting (“ANMF”) unit, anything prior will be in the files area., 146625= The obvious starting point then would be to compute the CTI before computing the DISC taxable income. This is consistent with the format of the Form 1120 IC DISC - Schedule P., 283394=The Schedule P Form 1120-IC-DISC is used to calculate the intercompany transfer price or commission. You should obtain the audit trail from the taxpayer’s books to the Schedule Ps. In order to accomplish this task, an understanding of what the taxpayer is required to provide on the Schedule Ps is required., 23511=IRC § 6091 and Treas. Reg. § 31.6091-1. Place for filing returns- Treas. Reg. § 31.6091-1(d) provides an exception to the general rule where a corporation return is to be filed. That exception provides that “whenever instructions applicable to such returns provide that a return shall be filed with a service center such returns will be so filed in accordance with such instructions”. The DISC return filing location is an exception since the Form 1120 IC-DISC instructions provides that all 1120 IC-DISC returns are to be filed at the Covington, Kentucky Campus., 276231= In determining the amount of shareholder A's deferred DISC income for A's taxable year ending December 31, 2007, the computation year is the DISC's taxable year ending December 31, 2006, that is, the taxable year of the DISC ending with shareholder A's taxable year preceding the taxable year of A for which A's deferred DISC income is being determined., 22751=The American Jobs Creation Act of 2004 (“2004 Act”) repealed the ETI tax regime., 305278=Bowater v. Commissioner, 108 F.3d. 12 (2d Cir. 1997), rev’g., 101 T.C. 207 (1993), cert. denied, 118 S. Ct. 689 (1998). The Second Circuit reversed a Tax Court decision which had allowed the taxpayer to allocate the net interest expense. The Second Circuit stated that the plain language of Treas. Reg. § 1.861-8(e)(2) controls and that this regulation requires the interest expense be allocated on a gross basis in computing CTI. In other words, the aggregate of deductions for interest must be allocated ratably to interest income on the same basis as if it allocated to all other income producing activities. The Second Circuit also said, “the tax Court had it right the first time [in its 1989 decision in Dresser, which was later reversed by the Fifth Circuit,] and we reverse its decision [in Bowater] for the taxpayer.” Note that Treas. Reg. § 1.861-8(e)(2) was replaced by Treas. Reg. § 1.861-8T(e)(2), which refers you to Treas. Reg. §§ 1.861-9T through 13T. However, since Treas. Reg. § 1.861-9T(a) requires gross interest expense amount be allocated to all sources of income, this holding will still apply., 140215=This refers to the Department of Commerce (“DOC”) regulations regarding products in short supply. Subsequent to 1987, the DOC changed the numbering of its regulations and now the products in short supply are located at 15 CFR 754., 272628=The “IC” in IC-DISC stands for interest charge. The interest charge was instituted in 1984 under IRC § 995(f). This provision requires that each shareholder pay an interest charge on the shareholder’s DISC-related deferred tax liability at a base period T-bill rate., 333845=[103] The old regulations referred to a 2-digit SIC code. Treas. Reg. § 1.861-17 (effective January 1, 1996) allows for the “allocation of research and experimental expenditures to three-digit SIC code product categories of gross income.” See T.D. 8646., 29068=All Form 1120-IC-DISC with no tax to be assessed and no evidence of a payment are processed on the index card system (“ICS”), and an account is not established on the database. A majority of the Form 1120-IC-DISC’s that the NMF unit receives are input to the ICS. Only the NMF unit has access to the ICS. The NMF Team would need to be contacted in order to receive a print of the transcript from the ICS., 103138=Packaging, repackaging, labeling and minor assembly are not manufacturing Treas. Reg. § 1.954-3(a)(4)(iii).  But see Bausch and Lomb v. Commissioner, TCM 1996-57 (1996) below. , 22867=Now some 23+ years later with the repeal of FSC and ETI we are seeing the DISC return back in the audit stream in greater numbers. Starting with the 2007 year tax filing season DISC returns began to show up in our examinations. The latest filing numbers put the DISC filings above 2,000 returns filed for the 2008 tax year., 24762=Code & Edit ensures that the Form 1120-IC-DISC is complete and determines if the corporation is an eligible DISC filer (approved Form 4876-A on file, etc., (IRM 3.11.16))., 151481=1120-IC-DISC Schedule P calculation – Part 1 Section A - CTI:, 308369=Generally, the effective date of the regulations is January 11, 1999.  However, the taxpayer may elect to apply these rules to tax years beginning on or after January 1, 1987.  If a taxpayer allocates a loss, you need to know the applicable regulation(s).  It is suggested you start with the Supplemental Information contained in TD 8805, to find the answer., 84455=The Public Law 480 program authorized under Title I of the Agricultural Trade Development and Assistance Act of 1954, as amended (7 U.S.C. 1691, 1701-1710). }",
    "textBeforeTable": "1120-IC-DISC Schedule P – Part 1 Section A – CTI calculation Facts: Are the same as the previous example except as follows. Example 2 - Buy-sell DISC  - This example illustrates the CTI and 4% QER intercompany pricing methods in regards to a buy-sell DISC. In this case, the DISC and R-S would choose to use the 50% of CTI method because it will result in greater tax-favored treatment.     $55 Income     -95 DISC Comm. Exp.     -200 Expenses of R-S $45 Profit 350 Gross Profit -50 DISC Expenses  -650 Cost of Sales $95 Commission Income $1,000 Sales Tax Return of K (DISC) Tax Return of",
    "textAfterTable": "DISC Line 2d – Other DISC Exp. 0 -  Line 3 – CTI 100 Neither Schedule P - Part B – DISC taxable income under the 50% of CTI Method for a buy-sell DISC – The profit of the DISC is 50% of the $100 CTI plus 10% of the $50 export promotion expenses – ($55 = $50+$5).  Part I -Section B – Schedule P Line 13 - CTI  $100 Line 14 – 50% of CTI $50 Line 15 – 10% of 2c 5 Line 17 - DISC Tax. Inc. $55 The transfer price (instead of a commission) which will give the DISC a profit of $55 is as follows: Part II –Schedule P Line 24 - QER  $1,000",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}