{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I had an incident in the first couple of weeks of college in my freshman year, and i was astonished on how professional, quick and amazing the campus safety was.",
            "NU brings in different things to do; parties with mechanical bulls, comedians, musicians, magicians and there is also a shuttle that takes you to local places like Wegmans and Walmart for students that do not have transportation. Talk about Wegmans, the founder of this huge franchise is a Niagara University graduate.",
            "You definately have to aclimate to the food at college; its so much different than what im used too, so when im gone for a while, and then come back, my stomach needs adjusting to it.",
            "Dorming is a lot of fun; you make little communities on your floors and friendships that last.",
            "College is hard, im not going to lie, but when you put hard work into these rigorous classes, and you get your papers back and that hard work shows, its worth it.",
            "Just be yourself; dont put on a face that isn't yours to get people to like you. Whether you realize it or not, everyone is scared and nervous, some are just better at hiding it than others. And when you are presented with an opportunity to broaden your horizons, especially with friends.",
            "I absolutely love attending Niagara University; the professors are top-notch, students are friendly and the opportunities that they present to their students are unfounded. I was very apprehensive about attending college at first, but those fears were proved wrong."
        ]
    ],
    "pageTitle": "Niagara University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Niagara-University/reviews?_escaped_fragment_=/show/2472",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00097-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894824935,
    "recordOffset": 894782410,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{150736=© 2015, Cappex.com, LLC, 145716=The service running the dining hall in Fall 2015 is new... can't tell you, It'll be new for me too., 70705=Since it is a Catholic and Vincentian university, Mass is held every Sunday at 11am and 10pm. So you have to opportunity to attend Mass if you are Catholic. Not really an unusual tradition, but it's not seen on many campuses. We also do FirstFest in September to welcome all the students back to campus, and this usually includes a barbecue, inflatables, and music and if the weather holds up, and outdoor movie on a 60' screen. We also do something very similar to this during RidgeFest, which is our end of the year celebration in April., 146101=The dorms are... dorms. They get the job done. Kinda hot in Aug/Sept... then in late April/ early May. I recommend a tower fan. Also, just accept that 4am fire alarms WILL HAPPEN. It sucks, but some people just cannot handle the immense responsibility of remembering to add some good old HOH (water) to their Easy Mac., 104384=Niagara has some pretty interesting traditions including Build-an-Eagle day! Every fall semester build-a-bear machines are set up in lower-level Gallagher where stuffed eagles are created and handed out to students for free or a very low cost! It's a really cute tradition that I always look forward to, along with the Winter Ball that takes place in late-November/early-December with horse-drawn carriages.}",
    "textBeforeTable": "08/11/2009 Reviewer is A current student here. 11 out of 11 people found this review useful. 1 of 30 MEG from North Tonawanda, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students Catholics. Tips for prospective students Be prepared to take 9 credits of religion and philosophy. They are mandated. Bang for the buck They just keep taking your money!! But they do give out a lot of scholarships. Am learning a lot It is a smaller University, and very catholic. Due to the small size, people tend to come precliqued. If you are a person who like to be involved in after school activities beware that each activity requires a $10 fee per semester and 3 hours of community service. Niagara is also a party school. The dorms do not have wi-fi. Not all the showers have hot water. And communication sucks! I came to NU with previous credit hours, but they still put me in a class of the same material. When I realized it, it was to late to switch classes. The only good thing about NU is that you may have many majors and minors. Login to rate or flag the reviews Elizabeth from Fredonia, NY 01/05/2011",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}