{
    "relation": [
        [
            "",
            "Method",
            "Ph. Helv. V",
            "Ph. Int. I",
            "Brit. Ph.1958",
            "U.S.P. XV",
            "Svenska F. XI",
            "Eder & Wäckerlin (48)",
            "Knaffl-Lenz (59)",
            "Graf (60)",
            "Mannich (50)",
            "Garratt and collaborators (61)",
            "Modified method according to",
            "Büchi & Huber",
            "",
            ""
        ],
        [
            "",
            "Opium I",
            "10.18",
            "10.15",
            "10.00",
            "9.12",
            "11.56",
            "11.66",
            "10.67",
            "11.11",
            "11.87",
            "11.67",
            "12.08",
            "12.12",
            "12.06",
            "12.09"
        ],
        [
            "",
            "Opium II",
            "14.36",
            "14.16",
            "14.26",
            "13.24",
            "14.60",
            "14.24",
            "",
            "",
            "14.71",
            "14.64",
            "14.60",
            "14.74",
            "14.68",
            "14.74"
        ],
        [
            "",
            "Opium III",
            "10.70",
            "10.98",
            "",
            "",
            "11.22",
            "11.24",
            "10.43",
            "9.90",
            "11.38",
            "11.28",
            "11.90",
            "11.84",
            "11.94",
            "11.89"
        ],
        [
            "",
            "Opium IV",
            "15.58",
            "15.61",
            "",
            "",
            "15.78",
            "15.89",
            "",
            "15.70",
            "16.00",
            "16.01",
            "16.34",
            "16.29",
            "16.40",
            "16.34"
        ]
    ],
    "pageTitle": "UNODC - Bulletin on Narcotics - 1960 Issue 2 - 004",
    "title": "",
    "url": "http://www.unodc.org/unodc/en/data-and-analysis/bulletin/bulletin_1960-01-01_2_page005.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00090-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 779039495,
    "recordOffset": 778992120,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{184664=R. MUNIER & M. MACHEBŒUF, Bulletin de la Société Chimie biologique, 31, 1146 (1949)., 148107=In order to determine the time required for a quantitative reaction between morphine and fluoro- or chloro-dinitro-benzene we carried out first experiments with a solution of pure morphine hydrochloride, whose exact content on water-free morphine base had been established by the opial method of the Ph. Helv. V. To each 10.0 ml of this morphine hydrochloride solution (= 0.1272 g of morphine base) were added 26 ml of water, a solution of 0.25 g of fluoro- or chloro-dinitrobenzene in 30 ml of acetone and 4 ml of 25% ammonia. The mixture was shaken for a minute and the precipitated morphine-dinitrophenylether filtered off after various time, washed four times with 2 ml of acetone each time and dried for an hour at 80°C. When fluoro-dinitrobenzene was used the morphine-dinitrophenylether was precipitated at once, but with chloro-dinitrobenzene this took place only after some minutes. Many authors prescribe a cooling of the reaction mixture. We therefore carried out our experiments in two series, in which we allowed the morphine-dinitrophenylether to crystallize at room temperature (21°C) and in the refrigerator (+ 1°C) respectively. The results are assembled in table 17., 104187=The quantity of morphine remaining in the mother liquor after precipitation has been commonly compensated for by a correction factor obtained in experiments with pure morphine base. But the use of this factor for the determination of morphine in opium is only justified if the purification of the morphine isolated from opium is so complete that it is as pure as the morphine used in establishing the correction factor. That this condition is not fulfilled, and that the correction factor obtained with pure morphine for the determination in opium is too small, results from the fact that the addition of another purifying operation (filtration of the morphine extract with aluminum oxide) in the 1937 method raised the values for morphine by up to 0.5 per cent, although the correction for the losses in the mother liquor remained the same. Our experiments have shown that after the evaporation of the solvent the morphine extract still contains 10%-20% of impurities, and it is therefore to be expected that precipitation will be partly hindered. We determined the quantity of morphine actually retained in the mother liquor in the following way., 182103=A. BETTSCHART, Dissertation No. 2408, ETH, Zurich (1954)., 185986=H. SCHUMACHER, Dissertation No. 2690, ETH, Zurich (1958)., 105943=The results of this determination are given in table 9. While, with a pure morphine base 4.4 mg of morphine remained dissolved in the mother liquor, we found in the mother liquors of morphine determinations in opium (10.4-17.9 mg of morphine) much larger quantities, varying from sample to sample of opium. This result shows once again that the losses in the mother liquor cannot be accounted for by a rigid correction factor. In a further series of experiments we precipitated the morphine not as base but as dinitrophenylether. In this way we found it possible to secure the entire quantity of morphine and to avoid the uncertain factor for losses in the mother liquor. For the detection of any alkaloidal impurities in the morphine subjected to titration, the titrated solution was evaporated in vacuo, the residue dissolved in methanol, and the side alkaloids separated by ion exchange from morphine. By paper chromatography [ 4] we could detect only codeine as an impurity and thus calculate its amount with the aid of the methoxyl content established by Eder & Wäckerlin [ 48] . Compared with the officinal lime methods the codeine content of the morphine to be titrated is relatively low (16% -29%). This underlines the necessity to remove the side alkaloids as completely as possible before the precipitation of morphine as a base., 181214=A.S. CURRY & H. POWELL, Nature (London), 173, 1143 (1954)., 180166=H. ASAHINA & M. ONO, United Nations document, Geneva, June (1955)., 103270=Eder & Wäckerlin method 1940 (Yugoslavia opium pH 3.0), 13642=Author: J. Büchi, R. Huber, H. Schumacher Pages: 25 to 45 Creation Date: 1960/01/01, 117189=0.200 g of opium is digested with 1 ml of water, the mixture alkalized, and ground with kieselguhr. The mass is put into a chromatographic tube and percolated first with dichlorethylene to remove the side alkaloids, and then with chloroform/isopropanol 3:1 in order to obtain morphine. The solvent of the morphine fraction is distilled off, the residue dissolved in methanol and the morphine titrated with 0.1 N hydrochloric acid, using methyl red as indicator, to a \" strong red colour \"., 168878=Titrimetric determination. - The washed morphine-dinitrophenylether can also be determined by titration with 0.1 N perchloric acid in a non-aqueous solvent. In this case it is of advantage to use as filter a Buchner glass funnel 1G3 or an Allihn tube 15a G3. The remaining acetone is removed by drawing air through the funnel; the precipitate is dissolved then on the filter in about 20 ml of anhydrous glacial acetic acid, the solution sucked directly into the titration vessel and the filter washed three times with 5 ml of anhydrous glacial acetic acid. 5 ml of acetic anhydride are added and the solution is titrated with 0.1 N perchloric acid potentiometrically or with crystal violet as indicator. Each ml of 0.1 N perchloric acid is equivalent to 0.02852 g C 17H 19O 3N (morphine)., 177365=R. MUNIER & M. MACHEBŒUF, Bulletin de la Société chimique de France, 852 (1952); Bulletin de la Société de Chimie biologique, 31, 1154 (1949), 32, 209 (1950), 33, 1925 (1951), 34, 213 (1952), 32, 904 (1950)., 188570=L.F. SMALL, Chemistry of the Opium Alcaloids, Washington, 1932.}",
    "lastModified": "Thu, 18 Aug 2005 10:53:00 GMT",
    "textBeforeTable": "but not morphine and codeine with the following Rf-values: narcotine 0.43 to 0.45, papaverine 0.26 to 0.29, morphine 0.68, codeine 0.67 to 0.69, thebaine 0.47, and narceine about 0.4. The experiments carried out by Bettschart [ 31] for the paper chromatographic separation of opium alkaloids were basic to our investigations. Using water-saturated ether on a paper treated with an M/2 citric acid-phosphate buffer of pH 3.8, he separated narcotine (Rf 0.63) and papaverine (Rf 0.18). But he was not successful with this method in separating the other alkaloids. With a buffer of pH 7.4 he separated, by means of water-saturated ethylacetate, narceine (Rf 0.0), morphine (Rf 0.05), codeine (Rf 0.26), thebaine (Rf 0.82), laudanine (Rf 0.76), landanosine (Rf 0.83) and cryptopine (Rf 0.67). With water-saturated n-butanol he obtained, on a similarly buffered paper of pH 6.8 the following Rf-values: morphine 0.38, codeine 0.56, narceine 0.74, laudanine 0.81, cryptopine 0.81, thebaine 0.84, narco-tine and papaverine 0.96. Experiments with other mobile phases, such as benzene, mixtures of butanol and ether or chloroform, gave less successful separations. Graf & List [ 32] , Mariani [ 33] and Burma [ 34] have recently separated narcotine and papaverine by paper electrophoresis. Horhammer & Leue [ 35] tested tinctura opii simplex DAB6 with n-butanol + acetic acid + water (4 + 1 + 5). Under ultraviolet light they could identify five zones: The opium alkaloids",
    "textAfterTable": "Rf-values of opium alkaloids Alkaloid Pure alkaloid Opial Opium extract Morphine 0.03 0.04 0.029 Codeine 0.09 0.10 0.098 Cryptopine 0.15 - 0.15 Thebaine 0.39 0.40 0.39 Narceine 0.47 0.48 - Papaverine 0.76 0.77 0.78 Narcotine 0.86 0.87 0.86 These authors obtained approximately the same Rf-values: for all the alkaloids with the exception of narcotine they were very slightly higher, while that for narcotine was 0.03 units lower. Thus the separation of papaverine and narcotine was not so successfully achieved by them as by us. However, in numerous paper chromatographic analyses we have been able to verify our data. 3. THE SENSITIVITY OF PAPER CHROMATOGRAPHIC",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}