{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No.",
            "Special Conditions No."
        ],
        [
            "regulations.gov",
            "2015-07502",
            "",
            "FAA-2015-0723",
            "23-264-SC"
        ]
    ],
    "pageTitle": "14 CFR Part 23, Subpart G - Operating Limitations and Information | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/14/part-23/subpart-G?quicktabs_7=1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00054-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 926610724,
    "recordOffset": 926595089,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1110=Title 14 published on 2015-01-01.}",
    "TableContextTimeStampAfterTable": "{30419=Title 14 published on 2015-01-01}",
    "lastModified": "Sun, 02 Aug 2015 23:40:16 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 34242 - Special Conditions: Honda Aircraft Company, Model HA-420; Fire Extinguishing for Overwing Pylon Mounted Engines 2015-06-16; vol. 80 # 115 - Tuesday, June 16, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 14. Title 14 published on 2015-01-01. § 23.1589 — Loading information. § 23.1587 — Performance information. § 23.1585 — Operating procedures. § 23.1583 — Operating limitations. § 23.1581 — General. Airplane Flight Manual and Approved Manual Material §",
    "textAfterTable": "DEPARTMENT OF TRANSPORTATION, Federal Aviation Administration Final special conditions; request for comments. The effective date of these special conditions is June 16, 2015. We must receive your comments by July 16, 2015. 14 CFR Part 23 Summary These special conditions are issued for the Honda Aircraft Company model HA-420 airplane. This airplane will have a novel or unusual design feature associated with mounting the engines on the wings in close proximity to the aft fuselage. The applicable airworthiness regulations do not contain adequate or appropriate safety standards for this design feature. These special conditions contain the additional safety standards that the Administrator considers necessary to establish a level of safety equivalent to that established by the existing airworthiness standards. 2015-05-21; vol. 80 # 98 - Thursday, May 21, 2015 80 FR 29205 - Special Conditions: Cirrus Design Corporation Model SF50 airplane; Full Authority Digital Engine Control (FADEC) System; Withdrawal GPO FDSys XML |",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}