{
    "relation": [
        [
            "Postage and packaging",
            "£7.50",
            "£12.00"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Royal Mail International Standard (Small Packets)",
            "Royal Mail International Signed"
        ],
        [
            "Delivery*",
            "Estimated delivery within 6-12 working days Seller ships within 1 day after receiving cleared payment - opens in a new window or tab.",
            "Estimated delivery within 6-12 working days Seller ships within 1 day after receiving cleared payment - opens in a new window or tab."
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/NEW-VOODOO-VIXEN-GREEN-1950S-ROCKABILLY-RETRO-VINTAGE-PENCIL-WIGGLE-DRESS-10-16/121404562168?_trkparms=aid%3D222007%26algo%3DSIC.MBE%26ao%3D1%26asc%3D24197%26meid%3D8b9e9f965d1e42a89b3c771232c00d83%26pid%3D100011%26prg%3D10285%26rk%3D7%26rkt%3D10%26sd%3D390820119407",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00206-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 412574687,
    "recordOffset": 412524154,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter up to 7 characters for the postcode Please enter a valid postcode. Postcode: Select a valid country. There are 0 items available. Please enter a number less than or equal to 0. -Select- Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Republic Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Virgin Islands Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Islands Cayman Islands Central African Republic Chad Chile China Colombia Comoros Congo, Democratic Republic of the Congo, Republic of the Cook Islands Costa Rica",
    "textAfterTable": "* You’ll see an estimated delivery date based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your payment clears - opens in a new window or tab. Domestic dispatch time Will usually dispatch within 1 working day of receiving cleared payment - opens in a new window or tab. Payment details Payment method Preferred/Accepted   PayPal preferred   Immediate payment required for this item. Immediate payment of £34.99 is required. Seller's payment instructions Our preferred payment",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}