{
    "relation": [
        [
            "Payment method",
            "",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Family History Tree Genealogy England Phillimore Marriages Registers Records DVD | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/Family-History-Tree-Genealogy-England-Phillimore-Marriages-Registers-Records-DVD-/190708220880?pt=AU_Genealogy&hash=item2c671883d0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00106-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 420623695,
    "recordOffset": 420577474,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{55237=1457 Parishes!   30 Counties!}",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at All our CDs and DVDs are guaranteed against manufacturer defects. If you have a problem please contact me within 30 days so I may make arrangements for a prompt exchange of the defective item. Return policy details The buyer is responsible for return postage costs. Money Back 30 days after the buyer receives it Refund will be given as Item must be returned within Return policy",
    "textAfterTable": "Seller's payment instructions I'd appreciate contact within 2 days - payment within 5 days (please leave your ID so I can recognise your payment). Your item will be sent as soon as payment appears in my account - please note that internet deposits usually take a couple of business days to appear. Your postage options are at checkout - Regular Parcel Post or Express Post. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}