{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They're are not a lot of presence of security cameras on campus, nonexistent even. Campus security patrol often on golf carts making sure everything is safe on campus. They're often called to settle disputes of loud noises.",
            "Lambda Kappa Kappa is a local service fraternity dedicated to help their community and high school students to achieve a college education. Kappa Alpha Order is a national social fraternity. Several other sororities are on campus to like Lambda Theta Alpha, Lambda Tau Zeta, Alpha Zeta Delta.",
            "Education Majors, Computer Science, Pre-Law, or Nurse Anesthesia.",
            "Texas Wesleyan Endowment program provides alot of scholarships. You can continue getting more as long as your academic are high. More opportunities are available if you join more organizations on campus.",
            "From a student's perspective, the two most enjoyable events were ram camp and the spring carnival. Being that I've never got the chance to attend either, what I did for fun is attending other school events. Some are honestly boring like homecoming after party hosted by SGA others were very enjoyable. I recall the DiaBeatThis event which had live music, food-tasting oppurtunites, and rock climbing. You can have an option to play volley ball, tennis, basketball, pool, table pool, table tennis, and much more on campus.",
            "You're main two options for food and dining will be at Dora's cafeteria or the Sub (Grilled Works). The sub provides a cheaper alternative for food and they offer food you would expect at a typical fast food restaurant ( Burgers, Chicken Tenders, Variety of Drinks ). Dora's cafeteria is very similar to a buffet. You pay to get in, or if you're on a meal plan you just scan your card, and you can choose the variety of food they have there. They would have the usual fast food options ( hot dogs, pizza and nachos ) , breakfast aisle, make your own sandwich section, and your own pasta section, and some fruits. Dora caters a variety of food that changes on a daily from Meat loaf to fish tacos to chicken pot pie. They offer a breakfast food in the morning as well. The downside would be the close around 7 pm and if you're hungry after that time period you would have to go off campus to eat. People often complains the foods are fattening, which is in essence is true, but primarily this is a case of overeating since Dora is a like buffet. They're also often free food opportunites that organizations offer to attend their meetings which would the typical hot dogs and burgers.",
            "Dorm life is different depending on where you live. In an honest perspective, OC Hall is one of the cheapest option to live on campus and they're almost identically similar to Elizabeth hall, the most expensive option on campus. The only thing that is different is the bed sizes and the option to have a room mate or not. Most problems with dorms like getting locked out or noise complaints are handled by your RA (Residential Assistant). OC Hall has been recently renovated and is still be upgraded as of right now. Their kitchen and lobby had recent makeover change improving the look and feel of the place. Stella provides a smaller room size than OC hall and elizabeth however the building feels more new and sanitary compared to OC Hall. Just like OC hall, stella has their own lobby and kitchen with the exception of a computer room and a nicer game room. West Village is the newest addition and stands out as an apartment not as a dorm. West Village looks and feels much better than the other dorms. Each room is housed by 4 people and has 4 enclosed room with a living a room and two bathrooms. Comes with a fridge and electricity bill and utility bills already paid for. Cable and internet is provided throughout the campus. The only downside to West Village is the clubhouse, a place where you cook or relax at, is closed at a certain time. West Village is the only place the offers a place to park your car in electronically closed fence.",
            "Academic difficulty always depend on the professor and how they teach. Some provides a plethora of extra credit opportunity and another would focus all your work online. Self-discipline is and studying is the hardest challenge new college students will face.",
            "For any undergraduate planing to attend the campus for the first time, I advise you try to live on campus. The campus is very small and it would be beneficial both academically and socially if you knew the people around. Join organizations ( Greek Life, Academic Organizations, Sports ) be active on campus!",
            "Texas Wesleyan is a small campus but with big opportunities only if you choose to take them. All your teachers are licensed professors who are they're to help you only you accept their help."
        ]
    ],
    "pageTitle": "Texas Wesleyan University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Texas-Wesleyan-University/reviews?_escaped_fragment_=/show/77970",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00140-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904477387,
    "recordOffset": 904450775,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{103838=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "09/02/2009 Reviewer is A current student here. 13 out of 14 people found this review useful. 1 of 26 Leseana from Fort Worth, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. Texas Wesleyan University Reviews Texas Wesleyan University › Texas › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Irma from Houston, TX 06/11/2009 Reviewer is Researching this school. Reviewer has not been to campus. 4 out of 4 people found this review useful. 3 of 26 Categories Comments Great for these types of students The ones who are very committed to their classes in high school as well as in college. Tips for prospective students To be very exited and enthusiastic! Login to rate or flag the reviews Jacob from Waco, TX 01/28/2010 Reviewer is A current student here. 2 out of 3 people found this review useful. 4 of 26 Categories Comments Great for these types of students If you like Baseball",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}