{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "there is a campus safety escort service available for all students, so if there is ever a time where you are walking to your car or dorm and you are afraid to walk alone you can call the escort service and they will send an escort to walk you to your destination.",
            "there are various fraternities and sororities, both social and educational.",
            "there are a variety of clubs and activities available for all students. due to the fact that the school is very diverse, there is a club out there for everyone.",
            "this university is great for students who would like to meet others from other backgrounds. this school is one of the most diverse universities in the nation.",
            "although the universty's tutition and housing fees are pretty expensive, i can honestly say its an enjoyable experience and well worth your buck.",
            "visit the botanic gardens, go to the university village theatre which is located about 5 minutes walking distance from the school, block party and heat concert, and nooners activities every wednesday held by the bell tower.",
            "the food in the residential restaurants is not that good. let's just say that you will most definitely miss home cooked meals. however there are days where they serve very good food like pasta and tacos. also, you can never go wrong with the multiple options of cereal. the food at the hub is very good. there are multiple locations for different types of food located on the campus.",
            "the oppurtunity to live on campus in the residential halls is an exceptional experience. you are able to make connections that you might not be able to if you commute. also, there are various programs held by housing that allow you to have fun and meet a lot of people.i recommend living in the dorms for all college freshmen. word of advice, do not dorm with your high school best friend because things do change !",
            "depending on the classes you take determines the rigor of the courses. there are some classes easier than others and also some more diffcult than others.",
            "do not dorm with you high school best friend. if you dorm, bring food from home in case they do not serve good food one day, join clubs and get involved.",
            "this unversity is very diverse, you will meet people from a great range of different backgrounds. there are many different oppurtunities for students to become involved with the campus and community. living in the residence halls is an extraordinary experience."
        ]
    ],
    "pageTitle": "University of California-Riverside (UC Riverside) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-California-Riverside/reviews?_escaped_fragment_=/show/24172",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00290-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891885095,
    "recordOffset": 891697558,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{340262=There's not much to do if you don't have a car. Most students just go out to eat because Riverside has some great food places...EVERYWHERE. The city has a diverse selection of foods from American food, to Thai food, Indian food, Vietnamese food, etc and Asahi which is one of the most delicious All-You-Can-Eat restaurants around. May I add that these places are legit and not Americanized. Since it's really hot you can go swimming all the time. Some people hike the C which is a C on the top of a mountain. You can join clubs like Surf Club (they take you surfing) or outdoor excursions (they take you on countless trips). A lot of people also spend time at the gym playing intramurals., 473889=There's not too many unusual traditions I know of besides the school priding itself of its Scottish heritage through an occasional bagpipe practice every now and then, that can be heard from the residence halls. Our concerts held every school quarter have been traditions for many years, welcoming notable artists such as J.Cole, Lupe Fiasco, Nas, Mac Miller, Karmin, The Roots, Common, Kendrick Lamar, Chiddy Bang, Dev & The Cataracs, and more who have blessed UCR with their presence at some point in time. Being that our Botanical Garden is apart of the UCR campus, its not too unusual of a place, but definitely one that's uniquely beautiful., 686211=There has been a string of robberies on and near campus since January of 2013 . Students have been targeted for technology. Lap tops, I-Pads, and Smart Phones have been taken by force. The school has been scrutinized in the local newspaper as well a TV news cast. Escort services are available 24/7. The campus appears to be safe and tranquil, but I would not suggest walking in the surrounding community after dark alone. In all fairness, I would not walk around the part of Riverside I live in after dark alone either., 932456=Taking AP classes in high school and don't get lower than a B and you will have the GPA you need. Assuming of course that you absolutely do not fail any classes. From there, take the SAT or ACT a couple times and try to get above 1750 and you will be good to go., 691643=Admissions office considers the entire package- strength of transcript, SAT and SAT subject exam scores, and extracurriuluars all play a role in the decision making process. UCR had over 40,000 students apply for admission for the fall of 2013. For many students, UCR is a first choice rather than a backup school., 657457=Some days are better than others. Sometimes they have themes such a Cajun night or Thanksgiving Dinner and those nights the food is amazing. I personally liked the Dining Halls and as a student who no longer lives on campus I miss them., 513159=Lothian resident, Nicer than A-I, Pentland Hill is really nice but expensive. People at AI are more down to earth at least when I went there. Lothian people tend to be a bit clicky. Still both are expensive because of meal plan. May find a better deal off campus., 877551=They have limited greek life and the sororities/fraternities they do have are mostly community service based. On the up side, this means they cost only about 40 to 50 dollars a year instead of $2000 a quarter., 518259=2011-2012 school year we burned UC Irvine's mascot, the Anteater. That was really amusing and a great experience. We had fireworks shoot out from the buildings' rooftops to give a spectacular show., 1088951=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/19/2009 Reviewer is A current student here. 31 out of 31 people found this review useful. 1 of 258 Kimberley from Tracy, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. University of California-Riverside Reviews University of California-Riverside › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am enjoying being here Living in the dorms and meeting new people make it a great experience to be in UCR. I like it because you are able to interact with many people and try out different organizations. At the same time, explore new classes and meet new professors. I enjoy being in UCR, because this school has a lot of diversity and school spirit. And it is a great learning environment. And at night you can see the beautiful stars in the sky! Am learning a lot In transitioning from high school to college/university, UCR helps students to be able to learn new subjects as well new skills. At the same time, students would be able to meet new people and become more confident in their environment. You can learn a lot from people's perspectives about different things as well your surroundings. You learn to become independent and responsible over time. Login to rate or flag the reviews Matthew from Pasadena, CA 08/25/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 3 of 258",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}