{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Black Protestant",
            "Mainline Protestant",
            "Catholic",
            "Other",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "50,855",
            "17,209",
            "16,435",
            "6,153",
            "3,006",
            "200",
            "61,689"
        ],
        [
            "Congregations",
            "134",
            "52",
            "34",
            "3",
            "10",
            "2",
            "-"
        ]
    ],
    "pageTitle": "Macon, Georgia (GA) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Macon-Georgia.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00268-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 368612975,
    "recordOffset": 368460039,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{121469=Zip codes: 31201, 31204, 31206, 31207, 31210, 31211, 31213, 31217., 134495=Macon: Macon Little Theatre est. 1934, 6351=According to our research of Georgia and other state lists there were 394 registered sex offenders living in Macon, Georgia as of August 02, 2015. The ratio of number of residents in Macon to the number of sex offenders is 232 to 1., 119256=Recent home sales, real estate maps, and home value estimator for zip codes: 31201, 31204, 31206, 31210, 31211, 31216, 31217, 31220, 31297.}",
    "TableContextTimeStampAfterTable": "{64535=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.17. This is significantly better than average. Closest monitor was 1.4 miles away from the city center., 88918=2008 Presidential Elections Results, 65279=Ozone [ppb] level in 2012 was 27.6. This is about average. Closest monitor was 6.6 miles away from the city center., 21298=Birthplace of: Jason Aldean - Singer, Ben Johnston (composer) - Composer, Ken Shamrock - Kickboxer, Gordon P. Saville - Air Force general, Nancy Grace - Prosecutor, Randy Crawford - Jazz and R&B singer, Jerry Pate - Professional golfer, Sidney Lanier - (1842-1881), novelist, Norm Nixon - Basketball player, Blue Moon Odom - Baseball player., 84849=Educational Attainment (%) in 2013, 54343=Hotels: Econo Lodge Macon (4951 Romeiser Drive) (1), Discovery Inn (4604 Chambers Road) (2), Economy Inn (4717 Chambers Road) (3), Comfort Inn North (2690 Riverside Dr) (4), Days Inn West (6000 Harrison Road) (5), Comfort Inn West (4951 Eisenhower Parkway) (6), Emory Inn (1232 Jeffersonville Road) (7), Days Inn Macon GA (2856 Jeffersonville Road) (8), Four Seasons Landscaping (4149 Arkwright Road) (9). Display/hide their approximate locations on the map, 89488=Graphs represent county-level data. Detailed 2008 Election Results, 17854=On 4/30/1953, a category F4 (max. wind speeds 207-260 mph) tornado 16.5 miles away from the Macon city center killed 18 people and injured 300 people and caused between $5,000,000 and $50,000,000 in damages., 88346=2000 Presidential Elections Results, 223848=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 113751=7.34% of this county's 2010 resident taxpayers moved to other counties in 2011 ($33,056 average adjusted gross income), 67476=Lead (Pb) [µg/m3] level in 2012 was 0.00284. This is significantly better than average. Closest monitor was 1.5 miles away from the city center., 65978=Particulate Matter (PM10) [µg/m3] level in 2012 was 20.3. This is about average. Closest monitor was 4.0 miles away from the city center., 63888=Air Quality Index (AQI) level in 2012 was 81.7. This is about average., 66727=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 10.8. This is about average. Closest monitor was 4.0 miles away from the city center., 222559=Total of 171 patent applications in 2008-2015., 88060=1996 Presidential Elections Results, 18172=On 11/22/1992, a category F4 tornado 26.6 miles away from the city center killed 5 people and injured 86 people and caused between $5,000,000 and $50,000,000 in damages., 88632=2004 Presidential Elections Results, 111549=6.88% of this county's 2011 resident taxpayers lived in other counties in 2010 ($31,991 average adjusted gross income), 85247=School Enrollment by Level of School (%) in 2013, 89204=2012 Presidential Elections Results}",
    "textBeforeTable": "Religion statistics for Macon city (based on Bibb County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Bottled, tank, or LP gas (1%) Utility gas (44%) Electricity (55%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 39 Bibb County: 2.52 / 10,000 pop. Georgia: 1.91 / 10,000 pop. Number of supercenters and club stores: 3 This county: 0.19 / 10,000 pop. State: 0.15 / 10,000 pop. Number of convenience stores (no gas): 23 Bibb County: 1.49 / 10,000 pop. Georgia: 0.86 / 10,000 pop. Number of convenience stores (with gas): 124 Bibb County: 8.01 / 10,000 pop. State: 5.12 / 10,000 pop. Number of full-service restaurants: 121 Here: 7.82 / 10,000 pop. State: 7.41 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}