{
    "relation": [
        [
            "Domain Created On",
            "2010-01-17",
            "5 years, 196 days old"
        ],
        [
            "Last Modified On",
            "2010-01-17",
            "5 years, 196 days ago"
        ],
        [
            "Expires On",
            "2016-01-17",
            "0 years, 168 days from today"
        ]
    ],
    "pageTitle": "phimbook.com Xem phim online, phim bá»\u0099 láº» tvb hongkong | SEOCert",
    "title": "",
    "url": "http://www.seocert.net/analyzer.phimbook.com",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 696788943,
    "recordOffset": 696767918,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3638=IP address of phimbook.com is : 107.182.166.205. The domain phimbook.com was created on 2010-01-17 and it is 5 years, 196 days old. It will expire on 2016-01-17 which is 0 years, 168 days from today. The homepage of website phimbook.com has a size of 147688 bytes, and a text size of 7715 bytes, its Text to Code Ratio is 5.51% Homepage of phimbook.com has 246 links, 246 link to internal pages, while 0 link to pages on other websites. It takes 0.38 s ( 391.72 Kb/s ) to load the website phimbook.com.}",
    "textBeforeTable": "Xem phim online, phim bá»\u0099 láº» tvb hongkong Words count: 8    Unique Words: 7    Length: 50 characters [ To optimize the page title, Use this SEO Title Optimizer ] : Title Content Analysis Register To View All >> the 33 recommended tasks to improve your SEO performance. ... Implement browser caching for your site. Host the site closer to the geo location where most of your site visitors come from. Create blog entries. Reduce number of links to other pages. Configure the server so that your site IP http://107.182.166.205 is redirected to the site domain name phimbook.com. Move the 27 inline css components to an external style sheet file. Add in more high quality text content and make the text to code ration to be within 15%-70%. Create a XML sitemap for your site. Write more in-depth content on the topics of your page. Create one H1 element for your page, put the most important keywords in. Recommended Tasks List",
    "textAfterTable": "Tips: 1. ideally, the title should contain 10 to 70 characters, including spaces. (Google displays up to 70 characters in the title, and takes into account only the first 12 words.) 2. put the most important and relevant keywords in the title, try not to repeat any word. 3. each individual page should have a unique title. Description : Coi phim online moi ngay, coi phim bo hong kong TVB online taiseng, phim viet nam, coi phim online, phim han quoc, coi phim download phim tvb online. Words count: 28    Length: 149 characters [ To optimize the page description, Use this SEO Meta Description Optimizer ] Excellent! Your meta description contains between 70 and 160 characters. Meta Descriptions provide concise explanations of the contents of web pages, that are commonly used by search engines on search result pages to display preview snippets for a given page. Tips: 1. it is best to keep meta descriptions between 70-160 characters. 2. a readable, compelling description using important keywords can draw a much higher click-through rate of searchers to the given web page. 3. avoid keyword stuffing, ensure each page has its own unique description. Google SERP Preview :",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}