{
    "relation": [
        [
            "Code or Value",
            "0 to 56.25",
            "."
        ],
        [
            "Value Description",
            "Range of Values",
            "Missing"
        ],
        [
            "Count",
            "8220",
            "1423"
        ],
        [
            "Cumulative",
            "8220",
            "9643"
        ],
        [
            "Skip to Item",
            "",
            ""
        ]
    ],
    "pageTitle": "NHANES 2003 - 2004: Dietary Interview - Total Nutrients, Second Day Data Documentation, Codebook, and Frequencies",
    "title": "",
    "url": "http://www.cdc.gov/nchs/nhanes/nhanes2003-2004/DR2TOT_C.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00284-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 368782563,
    "recordOffset": 368757581,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{36847=Title: Dietary Interview - Total Nutrients, Second Day (DR2TOT_C ) Contact Number: 1-866-441-NCHS Years of Content: 2003 - 2004 First Published: September, 2006 Revised: November, 2007 Access Constraints: None Use Constraints: None Geographic Coverage: National Subject:What we Eat in America: Individual Foods Files Record Source: NHANES 2003 - 2004 Survey Methodology: NHANES 2003 - 2004 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files, 12746=Number of Intake Days Variable: Because two days of data are included in the 2003-2004 release, a variable has been added to indicate the number of days of intake available for each participant. The variable name is DRDINT., 7591=For the 2003-2004 NHANES, there were 12,761 persons selected; of these 9,643 were considered respondents to the MEC examination and data collection. However, only 9,034 of the MEC respondents provided complete dietary intakes for Day 1. Furthermore, of those providing the Day 1 data, only 8,354 provided complete dietary intakes for Day 2., 23474=The accuracy of the AMPM is currently being assessed in the USDA AMPM Validation Study using biomarker data. The data collection phase of the study, which includes 525 participants, has been completed. The extent of misreporting of energy and protein intakes will be determined by comparing estimated energy intake with total energy expenditure, and estimated protein intake with urinary nitrogen excretion. Total energy expenditure has been measured by the doubly-labeled water method. Preliminary findings show that the use of the AMPM resulted in a mean energy intake for the first cohort of 100 subjects that was within 2 percent of their total energy expenditure, as estimated by the doubly-labeled water technique, and suggest acceptable accuracy of reported intakes (Moshfegh, 2003, Rhodes, 2004)., 26433=The examination protocol and data collection methods are fully documented in the NHANES Dietary Interviewers Procedures Manuals (Centers for Disease Control and Prevention, 2002, Centers for Disease Control and Prevention, 2004)., 9477=Special Diet Variable: This is the first WWEIA NHANES data release to include information on whether the participant is currently on any kind of diet to lose weight or for another health-related reason and, if so, the type of diet. The variable DRQSDIET identifies whether a participant is on a special diet. The variables DRQSDT1 through DRQSDT8 and DRQSDT91 identify the type of diet(s) that the participant is following. This information was also collected in 2002 but was not publicly released because of confidentiality issues concerning single-year data., 28350=This document (NHANES 2003-2004 Data Documentation for Total Nutrient Intakes Files) provides additional details important to understanding the content of the Total Nutrient Intakes Files (DR1TOT_C and DR2TOT_C). The Total Nutrient Intakes Files provide a summary record of total nutrient intakes for each individual. Each total intake record contains the following information: , 22658=For the procedures relevant to this component, please go to Survey Operations Manual, Consent Documents, Brochures at: http://www.cdc.gov/nchs/about/major/nhanes/nhanes2003-2004/current_nhanes_03_04.htm., 34686=What’s New with the 2003-2004 WWEIA Release: A number of additions and changes have occurred since the release of the WWEIA 2001-2002 data. The table below summarizes these changes. One of the most important changes is the release of two days of intake data for each participant. The first day (Day 1) is collected in the Mobile Examination Center (MEC) and the second day (Day 2) is collected by telephone 3 to 10 days later. Most MEC participants (87 percent) have 2 days of complete and reliable intakes. The release of 2 days of data will permit the estimation of usual (long-run average) nutrient intakes in order to assess diets in the U.S. The Institute of Medicine recommends that assessment of the diets of population groups in relation to Dietary Reference Intakes be based on usual intake distributions of nutrients (Institute of Medicine, 2000). A minimum of two nonconsecutive days of dietary intake data for at least a subsample of the individuals is necessary for a more accurate estimation of the usual intake of nutrients., 20948=USDA's Food and Nutrient Database for Dietary Studies, 2.0 (FNDDS 2.0), was used for processing the 2003-2004 intakes (Agricultural Research Service, USDA Food and Nutrient Database for Dietary Studies 2.0). The FNDDS includes comprehensive information that can be used to code individual foods and portion sizes reported by participants and also includes nutrient values for calculating nutrient intakes. The underlying nutrient values for FNDDS 2.0 were based on values in the USDA National Nutrient Database for Standard Reference, release 18, produced by USDA’s Nutrient Data Lab (Agricultural Research Service, USDA National Nutrient Database for Standard Reference, Release 18). The FNDDS may be used in research projects using the NHANES 2003-2004 dietary intake data and also in other food intake studies. Additional information about the FNDDS and related tools is available on the Food Survey Research Group website (Agricultural Research Service, USDA Food and Nutrient Database for Dietary Studies 2.0).}",
    "lastModified": "Fri, 09 May 2014 20:27:40 GMT",
    "textBeforeTable": "Both males and females 0 YEARS - 150 YEARS Target: Dietary day one sample weight English Text: Dietary day one sample weight SAS Label: WTDRD1 Variable Name: WTDRD1 - Dietary day one sample weight Both males and females 0 YEARS - 150 YEARS Target: Respondent sequence number. English Text: Respondent sequence number SAS Label: SEQN Variable Name: SEQN - Respondent sequence number Codebook and Frequencies Rhodes, D.G., Moshfegh, A., Cleveland, L., Murayi, T., Baer, D., Sebastian, R., Perloff, B. 2004. Accuracy of 24 hour dietary recalls: preliminary results from USDA AMPM Validation Study. The FASEB Journal. (abstract) 18(4):A111. Raper, N., Perloff, B., Ingwersen, L., Steinfeldt, L., Anand, J. An overview of USDA’s dietary intake data system. J. Food Compos. Anal. 2004; 17(3-4):545-55. http://hdl.handle.net/10113/20984 [Accessed on: 10/11/11] Moshfegh, A.J., Baer, D., Cleveland, L., Rhodes, D., Sebastian, R., Staples, R., Kuczynski, K., Paul, D., Clemens, J., Rumpler, W., Judd, J. 2003. Validation of reported energy intakes in 24-hour dietary recalls using USDA automated multiple-pass method. The FASEB Journal. (abstract) 17(4):A281. Institute of Medicine. 2000. Dietary Reference Intakes: Applications in dietary assessment. Food and Nutrition Board, Washington, DC: National Academy Press. Centers for Disease Control and Prevention, National Center",
    "textAfterTable": "WTDR2D - Dietary two-day sample weight Variable Name: WTDR2D SAS Label: Dietary two-day sample weight English Text: Dietary two-day sample weight Target: Both males and females 0 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 708.63828227 to 374736.26978 Range of Values 8354 8354 . Missing 1289 9643 DR2DRSTZ - Dietary recall status Variable Name: DR2DRSTZ SAS Label: Dietary recall status English Text: Dietary recall status Target: Both males and females 0 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 1 Reliable and met the minimum criteria 8220 8220 2 Not reliable or not met the minimum criteria 52 8272 4 Reported consuming breast-milk 134 8406 5",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}