{
    "relation": [
        [
            "",
            "Major Customers",
            "Competition",
            "Markets",
            "Natural Gas and Oil Leases",
            "Seasonal Nature of Business",
            "Environmental Matters and Regulation",
            "Other Regulation of the Natural Gas and Oil Industry",
            "Litigation",
            "MANAGEMENT",
            "Our Board of Directors and Executive Officers",
            "Board Committees",
            "Governance Matters",
            "Compensation Committee Interlocks and Insider Participation",
            "Compensation of Directors",
            "Executive Compensation",
            "Employment Agreement",
            "Our Manager",
            "Officers of Our Manager",
            "Other Significant Employees",
            "Compensation of Our Manager’s Directors",
            "Reimbursement of Expenses of Our Manager and its Affiliates",
            "Atlas Energy Resources Long-Term Incentive Plan",
            "CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS",
            "Distributions and Payments to our Manager and Atlas America",
            "Agreements Governing the Transactions",
            "CONFLICTS OF INTEREST AND FIDUCIARY DUTIES",
            "Conflicts of Interest",
            "Fiduciary Duties",
            "SECURITY OWNERSHIP OF PRINCIPAL BENEFICIAL OWNERS AND MANAGEMENT",
            "DESCRIPTION OF THE COMMON UNITS",
            "The Common Units",
            "Transfer Agent and Registrar"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "114",
            "114",
            "115",
            "115",
            "115",
            "116",
            "119",
            "120",
            "121",
            "121",
            "123",
            "124",
            "125",
            "125",
            "125",
            "125",
            "126",
            "127",
            "128",
            "128",
            "128",
            "129",
            "131",
            "131",
            "132",
            "137",
            "137",
            "139",
            "140",
            "141",
            "141",
            "141"
        ]
    ],
    "pageTitle": "SEC Info - Atlas Energy Resources, LLC - IPO: ‘S-1/A’ on 11/1/06",
    "title": "",
    "url": "http://www.secinfo.com/d14D5a.v6N9m.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 695518159,
    "recordOffset": 695400835,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{13198=As filed with the Securities and Exchange Commission on November 1, 2006, 5303=If any of the securities being registered on this Form are to be offered on a delayed or continuous basis pursuant to Rule 415 under the Securities Act of 1933, check the following box.  ¨, 12146=REGISTRATION STATEMENT UNDER THE SECURITIES ACT OF 1933, 9746=(412) 262-2830, 7324=1900 Market Street, 3602=The registrant hereby amends this registration statement on such date or dates as may be necessary to delay its effective date until the registrant shall file a further amendment which specifically states that this registration statement shall thereafter become effective in accordance with Section 8(a) of the Securities Act of 1933 or until this registration statement shall become effective on such date as the Securities and Exchange Commission, acting pursuant to said Section 8(a), may determine.}",
    "TableContextTimeStampAfterTable": "{1137419=Depletion of oil and gas properties as a percentage of oil and gas revenues was 19% in fiscal 2005 compared to 21% in fiscal 2004. Depletion was $1.42 per Mcfe in fiscal 2005, an increase of $.20 per Mcfe (16%) from $1.22 per Mcfe in fiscal 2004. Increases in our depletable basis and production volumes caused depletion expense to increase $2.0 million to $12.2 million in fiscal 2005 compared to $10.2 million in fiscal 2004. The variances from period to period are directly attributable to changes in our oil and gas reserve quantities, product prices and changes in the depletable cost basis of our oil and gas properties., 545903=We have sponsored limited and general partnerships to raise funds from investors to finance our development drilling activities. Accordingly, the amount of development activities we undertake depends in large part upon our ability to obtain investor subscriptions to invest in these partnerships. During the past three fiscal years we have raised successively larger amounts of funds through these investment partnerships, raising $107.7 million in 2004, $148.7 million in 2005 and $199.8 million in 2006. In addition, our forecast of cash available for distribution for the twelve month period ending September 30, 2007 assumes that we will raise $270.0 million from third parties through our investment partnerships. In the future, we may not be successful in raising funds through these investment partnerships at the same levels we have recently experienced, and we also may not be successful in increasing the amount of funds we raise as we have done in recent years. Our ability to raise funds through our investment partnerships depends in large part upon the perception of investors of their potential return on their investment and their tax benefits from investing in them, which perception is influenced significantly by our historical track record of generating returns and tax benefits to the investors in our existing partnerships., 889071=Production volume changes.    For purposes of our estimates set forth above, we have assumed that our net gas production totals 9,328,852 Mcf during the twelve months ending September 30, 2007. If our actual net gas production realized during such twelve-month period is 5% more (or 5% less) than such estimate (that is, if actual net realized production is 9,795,294 Mcf or 8,862,409 Mcf), we estimate that our estimated cash available to pay distributions would change by approximately $3.8 million., 1037864=In addition, at March 31, 2006, the date of our most recent reserve report, we had proved reserves of 170.9 Bcfe, including the reserves net to our equity interest in the investment partnerships and our direct interests in producing wells., 1145411=Our well services revenues were $8.4 million in fiscal 2004, an increase of $795,000 (10%) from $7.6 million in fiscal 2003. The increase resulted from an increase in the number of wells operated due to additional wells drilled in fiscal 2004., 1107902=Our natural gas revenues were $61.8 million in the nine months ended June 30, 2006, an increase of $22.9 million (59%) from $38.9 million in the nine months ended June 30, 2005. The increase was attributable to an increase in the average sales price of natural gas of 43% and an increase of 11% in the volume of natural gas produced in the nine months ended June 30, 2006. The $22.9 million increase in natural gas revenues consisted of $16.6 million attributable to increases in natural gas sales prices and $6.3 million attributable to increased production volumes., 77923=In addition, at March 31, 2006, the date of our most recent reserve report, we had proved reserves of 170.9 Bcfe, including the reserves net to our equity interest in the investment partnerships and our direct interests in producing wells., 72583=We were formed in June 2006 to own and operate substantially all of the natural gas and oil assets and the investment partnership management business of Atlas America, Inc. (Nasdaq: ATLS). Atlas America has been involved in the energy industry since 1968, expanding its operations in 1998 when it acquired The Atlas Group, Inc. and in 1999 when it acquired Viking Resources Corporation, both engaged in the development and production of natural gas and oil and the sponsorship of investment partnerships., 502665=We would not have generated sufficient available cash on a pro forma basis to have paid the IQD on all of our outstanding common units and Class A units for the fiscal year ended September 30, 2005 and the twelve months ended June 30, 2006., 482567=Atlas Energy Resources as of March 31, 2006, 1114899=Our well services revenues were $8.7 million in the nine months ended June 30, 2006, an increase of $1.7 million (24%) from $7.0 million in the nine months ended June 30, 2005. This increase resulted from an increase in the number of wells operated for our investment partnerships due to additional wells drilled in the twelve months ended June 30, 2006., 860820=Twelve months ending September 30, 2007, 233772=Class A units. If we had completed this offering and the related transactions on July 1, 2005, the amount of pro forma available cash generated during the twelve months ended June 30, 2006 would have been insufficient by approximately $39.9 million to pay the full IQD. For a calculation of our ability to make distributions to you based on our pro forma results for the fiscal year ended September 30, 2005 and the twelve months ended June 30, 2006, please read “Cash distribution policy and restrictions on distributions.”, 1129202=Our well construction and completion segment margin was $17.5 million in the year ended September 30, 2005, an increase of $6.2 million (55%) from $11.3 million in the year ended September 30, 2004. During the year ended September 30, 2005, the increase in segment margin was attributable to an increase in the number of wells drilled ($4.7 million) and an increase in the gross profit per well ($1.5 million). The increase in our average cost per well resulted from an increase in the cost of tangible equipment, leases, site preparation and reclamation expenses, as well as increased costs due to drilling into deeper formations., 696130=Our limited liability company agreement requires that, within 45 days after the end of each quarter, beginning with the quarter ending September 30, 2006, we distribute all of our available cash to unitholders of record on the applicable record date., 538279=Under current federal tax laws, there are tax benefits to investing in investment partnerships such as those we sponsor, including deductions for intangible drilling costs and depletion deductions. Changes to federal tax law that reduce or eliminate these benefits may make investment in our investment partnerships less attractive and, thus, reduce our ability to obtain funding from this significant source of capital funds. A recent change to federal tax law that may affect us is the Jobs and Growth Tax Relief Reconciliation Act of 2003, which reduced the maximum federal income tax rate on long-term capital gains and qualifying dividends to 15% through 2008. These changes may make investment in our investment partnerships relatively less attractive than investments in assets likely to yield capital gains or qualifying dividends., 1140633=Our exploration costs were $1.5 million in the year ended September 30, 2004, a decrease of $166,000 (10%) from fiscal 2003. We attribute the decrease in fiscal 2004 as compared to the prior period is principally due to the following:, 568140=beyond June 30, 2007, on favorable terms, we will lose the right to develop the acreage that is covered by an expired lease and our production would decline, which would reduce our cash flows from operations and could impair our ability to make distributions., 799676=Upon completion of this offering, our board of directors will adopt a cash distribution policy pursuant to which we will pay an IQD of $0.40 per common unit and Class A unit for each complete quarter. Beginning with the quarter ending December 31, 2006, we will pay our quarterly distribution within 45 days after the end of each quarter ending March, June, September and December to holders of record on the record date established for the distribution. If the distribution date does not fall on a business day, we will make the distribution on the business day immediately preceding the indicated distribution date. In February 2007, we expect to pay a distribution to our unitholders equal to the IQD prorated for the portion of the quarter ending December 31, 2006 that we are public. These distributions will not be cumulative. Consequently, if we do not pay distributions on our common units and Class A units with respect to any fiscal quarter, our unitholders will not be entitled to receive such payments in the future., 521106=Underground accumulations of natural gas and oil cannot be measured in an exact way. Natural gas and oil reserve engineering requires subjective estimates of underground accumulations of natural gas and oil and assumptions concerning future natural gas prices, production levels, and operating and development costs. As a result, estimated quantities of proved reserves and projections of future production rates and the timing of development expenditures may prove to be inaccurate. Our independent petroleum engineers prepare estimates of our proved reserves. Over time, our internal engineers may make material changes to reserve estimates taking into account the results of actual drilling and production. Some of our reserve estimates are made without the benefit of a lengthy production history, which are less reliable than estimates based on a lengthy production history. Also, we make certain assumptions regarding future natural gas prices, production levels, and operating and development costs that may prove incorrect. Any significant variance from these assumptions by actual figures could greatly affect our estimates of reserves, the economically recoverable quantities of natural gas and oil attributable to any particular group of properties, the classifications of reserves based on risk of recovery and estimates of the future net cash flows. For example, if natural gas prices decline by $1.00 per Mcf, then the PV-10 value of our proved reserves as of March 31, 2006 would decrease from $412.4 million to $348.7 million. Our PV-10 is calculated using natural gas prices that include our physical hedges but not our financial hedges. Numerous changes over time to the assumptions on which our reserve estimates are based, as described above, often result in the actual quantities of natural gas and oil we ultimately recover being different from our reserve estimates., 232352=We believe, based on the assumptions and considerations included under the caption “Cash distribution policy and restrictions on distributions,” that we will have sufficient cash available for distribution to enable us to pay the IQD of $0.40 on all of the common units and Class A units for each quarter for the twelve months ending September 30, 2007. If we had completed this offering and the related transactions on October 1, 2004, the amount of pro forma available cash generated during the fiscal year ended September 30, 2005 would have been insufficient by approximately $45.1 million to pay the IQD on all of our common units and, 1115497=Our well services expenses were $5.3 million in nine months ended June 30, 2006, an increase of $1.5 million (39%) from $3.8 million in the nine months ended June 30, 2005. This increase was attributable to an increase in wages, benefits, and field office expenses associated with an increase in employees due to the increase in the number of wells we operate for our investment partnerships., 785350=For additional information regarding our historical and pro forma results of operations, you should refer to our historical and pro forma consolidated financial statements for the fiscal year ended September 30, 2005 and the nine months ended June 30, 2006, included elsewhere in this prospectus as well as “Management’s discussion and analysis of financial condition and results of operations.”, 822581=In calculating the estimated cash available for distribution for the twelve month period ending September 30, 2007, we have included amounts for estimated maintenance and investment capital expenditures, as well as average borrowings of $25.9 million for the period to fund a portion of investment capital expenditures. If we do not finance such expenditures with borrowings or issuances of additional common units, we would experience a shortfall in the amount of cash generated from our operations to pay both the aggregate cash distributions on our common units and Class A units and, 480424=attributable to our proved reserves before taking into account future corporate income taxes for which we will not liable. Our PV-10 values as of September 30, 2004 and 2005 reflect values for Atlas America E & P Operations, which pay income taxes. Amounts shown for March 31, 2006 reflect values for our reserves on a pro forma basis. Since we are a limited liability company that allocates our taxable income to our unitholders, no provision for federal or state income taxes has been included in the March 31, 2006 calculation of standardized measure, which is, therefore, the same as the PV-10 value. We further believe investors and creditors utilize our PV-10 value as a basis for comparison of the relative size and value of our reserves to other companies. Neither PV-10 value nor standardized measure reflect the impact of financial hedging transactions. The following reconciles the PV-10 value to the standardized measure (in millions):, 1126303=Year ended September 30, 2005 compared to year ended September 30, 2004, 893569=The following table illustrates, on a pro forma basis for fiscal 2005 and the twelve months ended June 30, 2006, cash available to pay distributions, assuming, in each case, that this offering and the related transactions had been consummated at the beginning of the period., 1056661=As of June 30, 2006, we owned interests in 6,884 gross wells, principally in the Appalachian Basin, of which we operated 5,833. On average during the quarter ended June 30, 2006, gross production from our wells was 81.235 MMcfe/d, or approximately 11.8 Mcfe/d per well. Over the past three fiscal years we have drilled 1,463 gross (565 net) wells, 98% of which were successful in producing natural gas in commercial quantities. In September 2004, we expanded our operations into Tennessee through a joint venture with Knox Energy, LLC that gives us an exclusive right to drill up to 300 net wells before June 30, 2007 on approximately 209,000 acres owned by Knox Energy. As of June 30, 2006, we had drilled 103 net wells under this agreement. As of June 30, 2006, we had identified approximately 500 proved undeveloped drilling locations and over 2,400 additional potential drilling locations on our acreage and our Tennessee joint venture acreage., 1144314=Our administration and oversight fees were $9.9 million in fiscal 2004, an increase of $4.8 million (94%) from $5.1 million in fiscal 2003. This increase resulted from an increase in the number of wells drilled and managed for our investment partnerships in fiscal 2004 as compared to the prior year., 811621=We do not as a matter of course make public projections of financial information. Our forecast information below presents, to our best knowledge and belief, our expected results of operations and cash flows for the twelve-month period ending September 30, 2007. Our forecast financial information reflects our judgment as of the date of this prospectus of conditions we expect to exist and the course of action we expect to take during the twelve months ending September 30, 2007. The assumptions disclosed in the footnotes to the table under the caption “—Estimated cash available for distribution—Estimated EBITDA” below are those that we believe are significant to our forecasted information, but we cannot assure you that our forecast results will be achieved. There will likely be differences between our forecast and actual results, and those differences could be material. If we do not achieve the forecast, we may not be able to pay the full IQD or any distribution amount on our outstanding units., 518513=Producing natural gas reservoirs generally are characterized by declining production rates that vary depending upon reservoir characteristics and other factors. Based on our March 31, 2006 reserve report, our average annual decline rate for proved developed producing reserves is approximately 11% during the first five years, approximately 6% in the next five years and less than 7% thereafter. Because total estimated proved reserves include proved undeveloped reserves at March 31, 2006, production will decline at this rate even if those proved undeveloped reserves are developed and the wells produce as expected. This rate of decline will change if production from our existing wells declines in a different manner than we have estimated and can change when we drill additional wells, make acquisitions and under other circumstances. Thus, our future natural gas reserves and production and, therefore, our cash flow and income are highly dependent on our success in efficiently developing and exploiting our current, 808526=In the sections that follow, we present in detail the basis for our belief that we will have sufficient available cash from operating surplus to pay the IQD on all outstanding common units and Class A units for each full calendar quarter through September 30, 2007. In those sections, we present the following two tables:, 189695=General.    We were formed in June 2006 as a Delaware limited liability company to own and operate the natural gas and oil assets and the investment partnership management business of Atlas America. Atlas America is a separate entity from us, and its securities are not being offered in this offering. Our operations will be conducted through, and our operating assets will be owned by, our operating subsidiaries, including Atlas Energy Operating Company, LLC. We will have no significant assets other than our interest in our subsidiaries., 1059212=Our results of operations for our gas and oil production segment are also impacted by the prices we receive and the margins we generate. Because of the volatility of the prices for natural gas, as of June 30, 2006 we had financial hedges and physical hedges in place for approximately 65% of our expected production for the twelve months ending September 30, 2007. Therefore, we have substantially reduced our exposure to commodity price movements with respect to those volumes under these types of contractual arrangements for this period. For additional information regarding our hedging activities, please read “—Quantitative and Qualitative Disclosures about Market Risk.”, 1118809=Our general and administrative expenses were $14.6 million in the nine months ended June 30, 2006, an increase of $7.1 million (95%) from $7.5 million in the nine months ended June 30, 2005. These expenses include, among other things, salaries and benefits not allocated to a specific energy activity, costs of running our energy corporate office, partnership syndication activities and outside services., 13668=The date of this prospectus is             , 2006, 381102=2006, 88678=June 30, 2006, 886002=Our ability to generate sufficient cash from our operations to pay distributions to our unitholders of not less than the IQD per unit for the twelve months ending September 30, 2007 is a function of the following primary variables:, 1112888=It should be noted that “Liabilities associated with drilling contracts” on our balance sheet includes $75.4 million of funds raised in our investment programs that have not been applied to the completion of wells as of June 30, 2006 due to the timing of drilling operations, and thus have not been recognized as well construction and completion revenue. We expect to recognize this amount as revenue in the remainder of 2006. During the fiscal year ended September 30, 2006, we raised $199.8 million. We anticipate oil and gas prices will continue to favorably impact our fundraising and therefore our drilling revenues in the twelve months ending September 30, 2007., 1128603=Our exploration costs were $900,000 in the year ended September 30, 2005, a decrease of $600,000 (42%) from $1.5 million in fiscal 2004. The decrease was primarily due to the dry hole costs of $704,000 incurred in 2004 upon determination that a well drilled in an exploratory area of our operations was not capable of economic production. No dry hole costs were incurred in 2005., 1139609=Our oil revenues were $5.9 million in fiscal 2004, an increase of $1.6 million (38%) from $4.3 million in fiscal 2003. The increase resulted from a 22% increase in the average sales price of oil and a 13% increase in production volumes. The $1.6 million increase in oil revenues consisted of $951,000 attributable to price increases and $689,000 attributable to volume increases., 1139127=Our natural gas revenues were $42.5 million in fiscal 2004, an increase of $8.3 million (24%) from $34.2 million in fiscal 2003. The increase was due to a 19% increase in the average sales price of natural gas and a 4% increase in production volumes. The $8.3 million increase in natural gas revenues consisted of $6.4 million attributable to price increases and $1.9 million attributable to volume increases., 1110958=increase in labor and maintenance costs associated with an increase in the number of wells we own and operate from the prior year period. The decrease in production costs as a percent of production revenues in the nine months ended June 30, 2006 as compared to June 30, 2005 was due to an increase in our average sales price, which more than offset the increase in production costs per Mcfe., 435757=2005, 555140=Our natural gas is sold under contracts with various purchasers. Under a natural gas supply agreement with Hess Corporation, which expires on December 31, 2008, Hess Corporation has a last right of refusal to buy all of the natural gas produced and delivered by us and our affiliates, including our investment partnerships. During fiscal 2005, natural gas sales to Hess Corporation accounted for 13% of our total revenues, and during the nine months ended June 30, 2006, Hess Corporation accounted for 11% of our total revenues. To the extent Hess Corporation and our other key customers reduce the amount of natural gas they purchase from us, our revenues and cash available for distributions to unitholders could temporarily decline in the event we are unable to sell to additional purchasers., 196674=Principal Executive Offices and Internet Address.    Our principal executive offices are located at 311 Rouser Road, Moon Township, Pennsylvania 15108 and our telephone number is (412) 262-2830. Our internet address is www.atlasenergyresources.com., 171452=In September 2004, we expanded our operations into Tennessee through a joint venture with Knox Energy, LLC that gives us an exclusive right to drill up to 300 net wells before June 30, 2007 on approximately 209,000 acres owned by Knox Energy. As of June 30, 2006, we had drilled 103 net wells under this agreement. As of June 30, 2006, we had identified approximately 500 proved undeveloped drilling locations and over 2,400 additional potential drilling locations on our acreage and our Tennessee joint venture acreage., 1130976=Our administration and oversight fees were $13.2 million in fiscal 2005, an increase of $3.3 million (33%) from $9.9 million in fiscal 2004. This increase resulted from an increase in the number of wells drilled and managed for our investment partnerships in fiscal 2005 as compared to the prior year., 1132431=Our well services expenses were $5.2 million in fiscal 2005, an increase of $769,000 (17%) from $4.4 million in fiscal 2004. The increase resulted from an increase in wages, benefits, and field office expenses associated with an increase in employees due to the increase in number of wells operated for our investment partnerships in fiscal 2005 as compared to fiscal 2004., 505051=The estimated EBITDA set forth in “Cash distribution policy and restrictions on distributions” is for the twelve month period ending September 30, 2007. Our management has prepared this information and we have not received an opinion or report on it from any independent accountants. In addition, “Cash distribution policy and restrictions on distributions” includes a calculation of estimated EBITDA. The assumptions underlying this calculation are inherently uncertain and are subject to significant business, economic, regulatory and competitive risks and uncertainties that could cause actual results to differ materially from those expected. If we do not achieve the expected results, we may not be able to pay the full, or any, amount of the IQD, in which event the market price of our common units may decline substantially., 828495=You should read the information in the footnotes under the caption “—Estimated Cash Available for Distribution” for a discussion of the material assumptions underlying our belief that we will be able to generate Estimated EBITDA of approximately $94.9 million necessary for us to have sufficient cash available for distribution to pay distributions at the IQD rate on all outstanding common units and Class A units for each quarter for the twelve-month period ending September 30, 2007. Our belief is based on those assumptions and reflects our judgment, as of the date of this prospectus, regarding the conditions we expect to exist and the course of action we expect to take over the twelve month period ending September 30, 2007. The assumptions we disclose below are those that we believe are significant to our ability to generate the necessary Estimated EBITDA. If our estimates prove to be materially incorrect, we may not be able to pay the IQD or any amount on our outstanding common units and Class A units during the four calendar quarters ending September 30, 2007., 1127118=Our oil revenues were $8.0 million in fiscal 2005, an increase of $2.1 million (35%) from $5.9 million in fiscal 2004. The increase resulted from a 55% increase in the average sales price of oil, partially offset by a 13% decrease in production volumes. The $2.1 million increase in oil revenues consisted of $3.3 million attributable to price increases, partially offset by $1.2 million attributable to volume decreases, as we drill primarily for natural gas rather than oil., 1126633=Our natural gas revenues were $55.4 million in fiscal 2005, an increase of $12.9 million (30%) from $42.5 million in fiscal 2004. The increase was due to a 24% increase in the average sales price of natural gas and a 5% increase in production volumes. The $12.9 million increase in natural gas revenues consisted of $10.4 million attributable to price increases and $2.5 million attributable to volume increases., 1119469=The increase in the nine months ended June 30, 2006 is principally attributed to the following:, 517484=At June 30, 2006, we owned interests in 6,884 gross wells that produced, on average during the quarter ended June 30, 2006, 81.2 MMcfe/d, or approximately 11.8 Mcfe/d per well. Producers with higher rates of production than ours are less sensitive to declining commodity prices due to the relatively fixed nature of well operating costs. Lower natural gas and oil prices may not only decrease our revenues, but also reduce the amount of natural gas and oil that we can produce economically, which would also decrease our revenues and cause us to shut in, and eventually plug and abandon, uneconomic wells., 529517=We will need to make substantial capital expenditures to maintain our capital asset base over the long term. For the twelve months ending September 30, 2007, we estimate these expenditures to be approximately $35.0 million. These maintenance capital expenditures may include the drilling and completion of additional wells to offset the production decline from our producing properties or additions to our inventory of unproved or proved reserves. These expenditures could increase as a result of:, 818299=As a result of the factors described in “—Estimated Cash Available for Distribution” and in the footnotes to the table in that section, we believe we will be able to pay distributions at the IQD rate of $0.40 per unit on all outstanding common units and Class A units for each full calendar quarter in the twelve-month period ending September 30, 2007., 1108713=The increase in our gas production volumes resulted from production associated with new wells drilled for our investment partnerships. We believe that gas volumes will be favorably impacted in the remainder of 2006 as ongoing projects to extend and enhance the gathering systems of Atlas Pipeline in the Appalachian Basin are completed and wells drilled are connected in these areas of expansion., 175138=We seek to provide greater stability in our cash flows through our use of financial hedges and physical hedges. The financial hedges may include purchases of regulated NYMEX futures and options contracts and non-regulated over-the-counter futures contracts with qualified counterparties. The futures contracts are commitments to purchase or sell natural gas at future dates and generally cover one-month periods for up to 36 months in the future. To assure that the financial instruments will be used solely for hedging price risks and not for speculative purposes, we have a management committee to assure that all financial trading is done in compliance with our hedging policies and procedures. We do not intend to contract for positions that we cannot offset with actual production. As of June 30, 2006, we had financial hedges and physical hedges in place for approximately 65% of our expected production for the twelve months ending September 30, 2007., 891129=Funds raised changes.    For purposes of our estimates set forth above, we have assumed funds raised from our investment partnerships will total $270.0 million during the twelve months ending September 30, 2007. If actual funds raised during such period are 5% more or less than our estimate, we estimate that our estimated cash available would change by approximately $2.4 million., 564453=Our management has specifically identified and scheduled drilling locations as an estimation of our future multi-year drilling activities on our existing acreage. As of June 30, 2006, we had identified approximately 500 proved undeveloped drilling locations and over 2,400 additional potential drilling locations. These identified drilling locations represent a significant part of our growth strategy. Our ability to drill and develop these locations depends on a number of factors, including the availability of capital, seasonal conditions, regulatory approvals, natural gas prices, costs and drilling results. In addition, Wright and Company, Inc. has not assigned any proved reserves to the over 2,400 unproved potential drilling locations we have identified and therefore there may exist greater uncertainty with respect to the success of drilling wells at these drilling locations. Our final determination on whether to drill any of these drilling locations will be dependent upon the factors described above as well as, to some degree, the results of our drilling activities with respect to our proved drilling locations. Because of these uncertainties, we do not know if the numerous drilling locations we have identified will be drilled within our expected timeframe or will ever be drilled or if we will be able to produce natural gas and oil from these or any other potential drilling locations. As such, our actual drilling activities may materially differ from our anticipated drilling activities. Our forecast of estimated cash available for distribution to our unitholders is based on an assumption that we will drill 869 gross wells on behalf of investment partnerships during the twelve months ending September 30, 2007, which number of wells exceeds the total number of currently identified proved undeveloped well locations. In the event that we are unable to continue to identify drilling locations that we believe will provide us attractive development opportunities in sufficient quantities to support our growth plans, we may be required to reduce the amount of funds raised through our investment partnerships, which in turn would result in a reduction in the fee-based revenue that we would otherwise realize and therefore would negatively impact our ability to make cash distributions to our unitholders at the initial quarterly distribution rate., 1033181=We were formed in 2006 to own and operate substantially all of the natural gas and oil assets and the investment partnership management business of Atlas America, Inc. (Nasdaq: ATLS). We are managed by Atlas Energy Management, Inc., a wholly-owned subsidiary of Atlas America. Through our manager, the Atlas America personnel currently responsible for managing our assets and capital raising will continue to do so on our behalf upon completion of this offering., 833112=September 30, 2007, 1113986=Administration and oversight represents supervision and administrative fees earned for the drilling and subsequent management of wells for our investment partnerships. Our administration and oversight fees were $8.1 million in the nine months ended June 30, 2006, an increase of $800,000 from $7.3 million in the nine months ended June 30, 2005. This increase resulted from an increase in the number of wells drilled and managed for our investment partnerships in the nine months ended June 30, 2006 as compared to the nine months ended June 30, 2005., 1124429=Our depletion of oil and gas properties as a percentage of oil and gas revenues was 20% in the nine months ended June 30, 2006, compared to 19% in the nine months ended June 30, 2005. Depletion expense per Mcfe was $2.00 in the nine months ended June 30, 2006, an increase of $0.66 (49%) per Mcfe from $1.34 in the nine months ended June 30, 2005. Increases in our depletable basis and production volumes caused depletion expense to increase to $13.7 million in the nine months ended June 30, 2006 compared to $8.4 million in the nine months ended June 30, 2005. The variances from period to period are directly attributable to changes in our oil and gas reserve quantities, production levels, product prices and changes in the depletable cost basis of our oil and gas properties., 243088=We estimate that if you hold the common units that you purchase in this offering through the record date for distributions for the period ending December 31,             , you will be allocated, on a cumulative basis, an amount of federal taxable income for that period that will be less than             % of the cash distributed to you with respect to that period. Please read “Material tax consequences—Tax Consequences of Unit Ownership” for the basis of this estimate., 831484=The following table illustrates (i) our Estimated EBITDA that we expect to generate for the twelve months ending September 30, 2007 based on the assumptions and considerations described in the footnotes to the table and (ii) the estimated cash available to pay distributions for the twelve-month period ending September 30, 2007, assuming that the offering was consummated on October 1, 2006. We explain each of the adjustments presented below in the footnotes to the table. All of the amounts for the twelve-month period ending September 30, 2007 in the table and footnotes are estimates., 1132944=Our gathering fee to Atlas Pipeline was $21.9 million in fiscal 2005, an increase of $4.7 million (27%) from $17.2 million in fiscal 2004. The increase was primarily a result of higher natural gas prices and increased volumes of gas transported due to our increase in the number of wells drilled. We also pay our proportional share of gathering fees based on our percentage interest in the well, which are included in gas and oil production and exploration expense. We also own several small gathering systems; the expenses associated with these are shown as gathering fees on our combined statements of income., 673255=Dilution is the amount by which the offering price paid by the purchasers of common units sold in this offering will exceed the net tangible book value per unit after the offering. Net tangible book value is our total tangible assets less total liabilities. Assuming an initial public offering price of $20.00 per common unit, on a pro forma basis as of June 30, 2006, after giving effect to the formation transactions and this offering and the application of the net proceeds of this offering, and assuming the underwriters’ over-allotment option is not exercised, our net tangible book value would have been approximately $133.9 million or $3.72 per common unit. Purchasers of common units in the offering will experience substantial and immediate dilution in net tangible book value per unit for financial accounting purposes, as illustrated in the following table:, 13255=The underwriters are offering the common units as set forth under “Underwriting.” Delivery of the common units will be made on or about                 , 2006., 78827=According to Rigdata.com, we were the 10th most active operator in the United States based on well starts from January 2006 to August 2006. As of June 30, 2006, we had identified approximately 500 proved undeveloped drilling locations and over 2,400 additional potential drilling locations on our acreage and our Tennessee joint venture acreage., 170522=As of June 30, 2006, we owned interests in 6,884 gross wells, principally in the Appalachian Basin, of which we operated 5,833. On average during the quarter ended June 30, 2006, gross production from our wells was 81.2 MMcfe/d, or approximately 11.8 Mcfe/d per well. Over the past three fiscal years we have drilled 1,463 gross (565 net) wells, 98% of which were successful in producing natural gas in commercial quantities, including 662 gross wells in the fiscal year ended September 30, 2005, 97% of which were successful. In the nine months ended June 30, 2006, we drilled 513 gross (170 net) wells, over 99% of which were successful., 693354=The amount of distributions paid under our cash distribution policy and the decision to make any distribution will be determined by our board of directors, taking into account the terms of our limited liability company agreement. We intend to distribute to the holders of common units and Class A units on a quarterly basis at least the IQD of $0.40 per unit, or $1.60 per unit per year to the extent we have sufficient available cash after we establish appropriate reserves and pay fees and expenses, including payments to our manager in reimbursement of costs and expenses it incurs on our behalf. Our IQD is intended to reflect the level of cash that we expect to be available for distribution per common unit and Class A unit each quarter. There is no guarantee we will pay the IQD in any quarter and we will be prohibited from making any distributions to unitholders if it would cause an event of default or an event of default is existing under our proposed credit agreement. We would not have generated sufficient available cash on a pro forma basis to have paid the IQD on all of our outstanding common units and Class A units for the fiscal year ended September 30, 2005 and the twelve months ended June 30, 2006. Please read “Risk factors—Risks Inherent in Our Business—We would not have generated sufficient available cash on a pro forma basis to have paid the IQD on all of our outstanding common units and Class A units for the fiscal year ended September 30, 2005 and the twelve months ended June 30, 2006,” “Cash distribution policy and restrictions on distributions—Unaudited Pro Forma Available Cash for Distribution” and “Management’s discussion and analysis of financial condition and results of operations.” It is the current policy of our board of directors that we should raise our quarterly cash distribution only when the board believes that (i) we have sufficient reserves and liquidity for the proper conduct of our business, including the maintenance of our capital asset base, and (ii) we can maintain such an increased distribution level for a sustained period. While this is our current policy, our board of directors may alter the policy in the future when and if it determines such alteration to be appropriate., 1060159=We generally fund our drilling activities through sponsorship of tax-advantaged investment partnerships. Accordingly, the amount of development activities we undertake depends in part upon our ability to obtain investor subscriptions to the partnerships. Historically, our fund-raising cycle has been on a calendar year basis. We raised $199.8 million in fiscal 2006. During fiscal 2005, our investment partnerships invested $157.0 million in drilling and completing wells, of which we contributed $57.3 million., 78282=For the twelve month period ended June 30, 2006, we produced 25,110 Mcfe/d net to our interest in the production of our investment partnerships and including our direct interests in producing wells, which resulted in an average proved reserves to production ratio, or average reserve life, of approximately 18 years based on our proved reserves at March 31, 2006., 884858=While we believe that the assumptions we used in preparing the estimates set forth above are reasonable based upon management’s current expectations concerning future events, they are inherently uncertain and are subject to significant business, economic regulatory and competitive risks and uncertainties, including those described in “Risk factors,” that could cause actual results to differ materially from those we anticipate. If our assumptions are not realized, the actual available cash that we generate could be substantially less than the amount we currently estimate and could, therefore, be insufficient to permit us to pay the full IQD or any amount on all our outstanding common units and Class A units with respect to the four calendar quarters ending September 30, 2007 or thereafter, in which event the market price of the common units may decline materially., 855952=Twelve months ended June 30, 2006, 1138797=Year ended September 30, 2004 compared to year ended September 30, 2003, 1038228=For the twelve month period ended June 30, 2006, we produced 25,110 Mcfe/d net to our interest in the production of our investment partnerships and including our direct interests in producing wells, which resulted in an average proved reserves to production ratio, or average reserve life, of approximately 18 years based on our proved reserves at March 31, 2006. As of June 30, 2006, we had identified approximately 500 proved undeveloped drilling locations and over 2,400 additional potential drilling locations on our acreage and our Tennessee joint venture acreage., 1109897=Our production costs were $10.1 million in the nine months ended June 30, 2006, an increase of $3.4 million (52%) from $6.7 million in the nine months ended June 30, 2005. This increase includes an, 536904=borrowings. In particular, our forecast of cash available for distribution for the twelve month period ending September 30, 2007 assumes that we will raise $270.0 million from third parties through our investment partnerships. This amount of capital is significantly more than the $199.8 million we raised during fiscal 2006 and significantly more than the average annual amount of $152.0 million we raised for the three fiscal years ended September 30, 2006. If we are unable to obtain sufficient capital funds on satisfactory terms, we may be unable to increase or maintain our inventory of properties and reserve base, or be forced to curtail drilling or other activities. This would result in a decline in our revenues and our ability to increase cash distributions may be diminished. If we do not make sufficient or effective expansion capital expenditures, including with funds from third-party sources, we will be unable to expand our business operations and will be unable to raise the level of our future cash distributions., 1109177=Our oil revenues were $7.1 million in the nine months ended June 30, 2006, an increase of $1.4 million (24%) from $5.7 million in the nine months ended June 30, 2005, primarily due to an increase in the average sales price of oil of 29% for the nine months ended June 30, 2006 as compared to the prior year similar period. The $1.4 million increase consisted of $1.7 million attributable to increases in sales prices partially offset by $304,000 attributable to decreased production volumes., 1065755=Impact of inflation.    Inflation in the United States did not have a material impact on our results of operations for the three-year period ended September 30, 2005 or the nine-month period ended June 30, 2006. It may in the future, however, increase the cost to acquire or replace property, plant and equipment, and may increase the costs of labor and supplies. To the extent permitted by competition and our existing agreements, we have and will continue to pass along increased costs to our investors and customers in the form of higher fees., 567162=Leases covering approximately 16,500 of our 491,000 net acres, or 3.4%, are scheduled to expire on or before June 30, 2007. If we are unable to renew these leases, or any leases scheduled for expiration, 818948=In order to pay the IQD to our unitholders of $0.40 per unit per quarter for the twelve month period ending September 30, 2007, our available cash for distribution must be at least approximately $57.6 million over that period. We estimate that our EBITDA for the twelve-month period ending September 30, 2007 must be approximately $94.9 million in order to generate cash available for distribution to the holders of our common units and Class A units of approximately $57.6 million over that period. We refer to this amount as “Estimated EBITDA.” Estimated EBITDA is intended to be an indicator or benchmark of the amount management considers to be the amount of EBITDA necessary to generate sufficient available cash for us to make cash distributions to our unitholders at our IQD rate of $0.40 per unit per quarter (or $1.60 per common unit and Class A unit per year)., 73501=As of June 30, 2006, our principal assets consisted of:, 1117208=Our gathering fee to Atlas Pipeline was $23.7 million for the nine months ended June 30, 2006, an increase of $8.0 million (51%) from $15.7 in the nine months ended June 30, 2005. The increase in the nine months ended June 30, 2006 is primarily a result of higher natural gas prices and increased volumes of gas transported due to an increase in the number of wells we drilled. We also pay our proportional share of gathering fees based on our percentage interest in the well, which are included in gas and oil production and exploration expense. We also own several small gathering systems; the expenses associated with these are shown as gathering fees on our combined statements of income., 503089=The amount of available cash we will need to pay the IQD for four quarters on the common units and Class A units to be outstanding immediately after this offering is approximately $57.6 million. If we had completed the transactions contemplated in this prospectus on October 1, 2004, pro forma available cash generated during the fiscal year ended September 30, 2005 would have been approximately $12.5 million, which would have been sufficient to allow us to pay approximately 22% of the IQD on our common units and Class A units during this period. If we had completed the transactions on July 1, 2005, pro forma available cash generated during the twelve months ended June 30, 2006 would have been approximately $17.7 million, which would have been sufficient to allow us to pay approximately 31% of our IQD on our common units and Class A units during this period. For a calculation of our ability to make distributions to you based on our pro forma results for the fiscal year ended September 30, 2005 and the twelve months ended June 30, 2006, please read “Cash distribution policy and restrictions on distributions.”, 1130077=It should be noted that “Liabilities associated with drilling contracts” on our balance sheet as of September 30, 2005 included $49.9 million of funds raised in our investment partnerships in fiscal 2005 that had not been applied to drill wells as of September 30, 2005 due to the timing of drilling operations, and thus had not been recognized as well construction and completion revenues. We will recognize this amount as income in the year ending September 30, 2006., 1133712=Our general and administrative expenses were $15.9 million in fiscal 2005, an increase of $4.3 million (37%) from $11.6 million in fiscal 2004. These expenses include, among other things, salaries and benefits not allocated to a specific energy activity, costs of running our energy corporate office, partnership syndication activities and outside services. The increase in the year ended September 30, 2005 as compared to the prior year period is attributable principally to the following:, 1140061=Our production costs were $7.3 million in fiscal 2004, an increase of $519,000 (8%) from $6.8 million in fiscal 2003. This increase includes normal operating expenses and coincides with the increased production volumes we realized from the increased number of wells we operate. Production costs as a percent of sales decreased from 18% in fiscal 2003 to 15% in fiscal 2004 as a result of an increase in our average sales price which more than offset the slight increase in production costs per Mcfe., 1132079=Our well services revenues were $9.6 million in fiscal 2005, an increase of $1.2 million (13%) from $8.4 million in fiscal 2004. The increase resulted from an increase in the number of wells operated for our investment partnerships due to additional wells drilled in fiscal 2005., 1033711=As of June 30, 2006, our principal assets consisted generally of:, 70117=You should read “Risk factors” beginning on page 24 for information about important factors that you should consider carefully before buying our common units. We include a glossary of some of the industry terms used in this prospectus in Appendix B. Wright and Company, Inc., an independent engineering firm, provided the estimates of our proved natural gas and oil reserves as of March 31, 2006 included in this prospectus. A summary prepared by Wright and Company of its reserve report is located at the back of this prospectus as Appendix C, and is referred to in this prospectus as the reserve report. References in this prospectus to “Atlas Energy Resources,” “we,” “our,” “us,” or like terms, when used in an historical context or in the present tense, refer to the subsidiaries that Atlas America will contribute to Atlas Energy Resources in connection with this offering and, when used prospectively, refer to Atlas Energy Resources, LLC and its subsidiaries. References to fiscal 2005 are to Atlas America E&P Operations’ most recent fiscal year end, which was September 30, 2005. Our first fiscal year will end on December 31, 2006. References to “our manager” or “Atlas Energy Management” are to Atlas Energy Management, Inc., 172201=Because the Appalachian Basin is located near the energy-consuming regions of the mid-Atlantic and northeastern United States, Appalachian producers have historically sold their natural gas at a premium to the benchmark price for natural gas on the NYMEX. For the fiscal year ended September 30, 2005, the average premium over NYMEX for natural gas delivered to our primary delivery points in the Appalachian Basin was $0.37 per MMBtu. In addition, most of our natural gas production has a high Btu content, resulting in an additional premium to NYMEX natural gas prices., 1107578=Nine months ended June 30, 2006 compared to nine months ended June 30, 2005, 892415=If we had completed the transactions contemplated in this prospectus on July 1, 2005, our pro forma available cash for distribution would have been $17.7 million for the twelve months ended June 30, 2006. This amount would have been insufficient by approximately $39.9 million to pay the IQD rate of $0.40 per unit ($1.60 on an annualized basis) on our outstanding common units and Class A units., 1142774=Our well construction and completion segment margin was $11.3 million in the year ended September 30, 2004, an increase of $4.4 million (64%) from $6.9 million in the year ended September 30, 2003. During the year ended September 30, 2004, the increase in segment margin was attributable to an increase in the number of wells drilled ($4.2 million) and an increase in the gross profit per well ($204,000). The increase in our average cost per well resulted from an increase in the cost of tangible equipment, leases and reclamation expenses., 1111622=Our well construction and completion segment margin was $16.5 million in the nine months ended June 30, 2006, an increase of $3.6 million (28%) from $12.9 million in the nine months ended June 30, 2005. During the nine months ended June 30, 2006, the increase of $3.6 million was attributable to an increase in the gross profit per well ($2.7 million) and an increase in the number of wells drilled ($865,000). Since our drilling contracts are on a “cost plus” basis (typically cost plus 15%), an increase in our average cost per well also results in an increase in our average revenue per well. The increase in our average cost per well in the nine months ended June 30, 2006 resulted from an increase in the cost of tangible equipment, leases, site preparation and reclamation expenses, as well as increased costs due to drilling into deeper formations., 1123779=Our net expense reimbursement—affiliate was $859,000 in the nine months ended June 30, 2006, an increase of $257,000 (43%) from $602,000 in the nine months ended June 30, 2005. This increase resulted from an increase in allocations from Resource America for executive management and administrative services, including rent allocations for our offices in Philadelphia, PA and New York City., 1143559=It should be noted that “Liabilities associated with drilling contracts” on our balance sheet includes $26.5 million of funds raised in our investment partnerships in the fourth quarter of fiscal 2004 that had not been applied to drill wells as of September 30, 2004 due to the timing of drilling operations, and thus had not been recognized as well construction and completion revenues. We recognized this amount as income in fiscal 2005., 1127667=Our production costs were $8.2 million in fiscal 2005, an increase of $900,000 (12%) from $7.3 million in fiscal 2004. This increase includes normal operating expenses and coincides with the increased production volumes we realized from the increased number of wells we operate. In addition, there were increases in transportation expense as a result of increased natural gas prices as a portion of our wells are charged transportation based on the sales price of the gas transported. Rates charged to us for transportation vary based upon agreements put in place at the time the wells are drilled; some of these agreements have escalation clauses. Production costs as a percent of sales decreased from 15% in fiscal 2004 to 13% in fiscal 2005 as a result of an increase in our average sales price which more than offset the increase in production costs per Mcfe., 549800=We operate in a highly competitive environment for acquiring properties and other natural gas and oil companies, attracting capital through our investment partnerships, contracting for drilling equipment and securing trained personnel. For example, the Pennsylvania Bureau of Oil and Gas Management estimates that there were 747 well operators bonded in Pennsylvania, one of our core operating areas, in 2005. We will also compete with the exploration and production divisions of public utility companies for natural gas and oil property acquisitions. Our competitors may be able to pay more for natural gas and oil properties and drilling equipment and to evaluate, bid for and purchase a greater number of properties than our financial or personnel resources permit. Moreover, our competitors for investment capital may have better track records in their programs, lower costs or better connections in the securities industry segment that markets oil and gas investment programs than we do. All of these challenges could make it more difficult for us to execute our growth strategy. We may not be able to compete successfully in the future in acquiring leasehold acreage or prospective reserves or in raising additional capital., 658871=The following table sets forth our capitalization as of June 30, 2006 (1) on an historical basis and (2) on a pro forma basis to give effect to the offering and related transactions and the application of the net proceeds of this offering as described in “Use of Proceeds.” In each case, the table assumes an initial public offering price of $20.00 per common unit, the mid-point of the price range set forth on the front cover of this prospectus, and further assumes that the underwriters’ over-allotment option is not exercised. The table is derived from, and should be read in conjunction with, and is qualified in its entirety by reference to, the pro forma and historical financial statements and notes thereto included elsewhere in this prospectus. You should also read this table in conjunction with “Prospectus summary—The Transactions and Our LLC Structure” and “Management’s discussion and analysis of financial condition and results of operations.”, 208760=We will adjust IQD for the period from the closing of this offering through December 31, 2006, based on the actual length of the period., 516969=In the past, the prices of natural gas and oil have been extremely volatile, and we expect this volatility to continue. For example, during the six months ended June 30, 2006, the NYMEX Henry Hub natural gas index price ranged from a high of $9.92 per MMBtu to a low of $5.68 per MMBtu, and West Texas Intermediate oil prices ranged from a high of $74.70 per Bbl to a low of $57.35 per Bbl., 436317=2006, 245317=The following table sets forth summary historical combined financial and operating data for our predecessor, Atlas America E & P Operations, and pro forma financial data for Atlas Energy Resources, LLC, as of and for the periods indicated. Atlas America E & P Operations are the subsidiaries of Atlas America which hold its natural gas and oil development and production assets and liabilities, substantially all of which Atlas America will transfer to us upon the completion of this offering. We derived the historical financial data as of September 30, 2004 and 2005 and for the years ended September 30, 2003, 2004 and 2005 from Atlas America E & P Operations’ financial statements, which were audited by Grant Thornton LLP, independent registered public accounting firm, and are included in this prospectus. We derived the historical financial data for the nine months ended June 30, 2005 and 2006 and the balance sheet information as of June 30, 2006 from Atlas America E & P Operations’ unaudited financial statements included in this prospectus., 891826=If we had completed the transactions contemplated in this prospectus on October 1, 2004, our pro forma available cash for distribution would have been $12.5 million for the fiscal year ended September 30, 2005. This amount would have been insufficient by approximately $45.1 million to pay the IQD rate of $0.40 per unit ($1.60 on an annualized basis) on our outstanding common units and Class A units., 172984=We generally fund our drilling activities through sponsorship of tax-advantaged investment partnerships. Accordingly, the amount of development activities we undertake depends in part upon our ability to obtain investor subscriptions to the partnerships. We raised $199.8 million in fiscal 2006 and $148.7 million in fiscal 2005. During fiscal 2005, our investment partnerships invested $157.0 million in drilling and completing wells, of which we contributed $57.3 million., 856628=Twelve months ending September 30, 2007, 586131=We have agreed to subordinate up to 50% of our share of production revenues to specified returns to the investor partners in our investment partnerships, typically 10% per year for the first five years of distributions. Thus, our revenues from a particular partnership will decrease if it does not achieve the specified minimum return and our ability to make distributions to unitholders may be impaired. We have not subordinated our share of revenues from any of our investment partnerships since March 2005, but did subordinate $91,000 in fiscal 2005, $335,000 in fiscal 2004 and $362,000 in fiscal 2003., 587200=Effective internal controls are necessary for us to provide reliable financial reports, prevent fraud and operate successfully as a public company. If we cannot provide reliable financial reports or prevent fraud, our reputation and operating results would be harmed. We cannot be certain that our efforts to develop and maintain our internal controls will be successful, that we will be able to maintain adequate controls over our financial processes and reporting in the future or that we will be able to comply with our obligations under Section 404 of the Sarbanes-Oxley Act of 2002. Any failure to develop or maintain effective internal controls, or difficulties encountered in implementing or improving our internal controls, could harm our operating results or cause us to fail to meet our reporting obligations. Ineffective internal controls could also cause investors to lose confidence in our reported financial information, which would likely have a negative effect on the trading price of our common units., 1096493=June 30,, 1136846=Our net expense reimbursement—affiliate was $602,000 in fiscal 2005, a decrease of $448,000 (43%) from $1,050,000 in fiscal 2004. This decrease resulted from a decrease in allocations from Resource America for executive management and administrative services as we now directly employ many of the individuals previously being allocated to us and therefore include their compensation in our general and administrative expenses., 409863=as of the date of estimation without future escalation, without giving effect to financial hedging activities (but including our physical hedges), non-property related expenses such as general and administrative expenses, debt service and depreciation, depletion and amortization, and discounted using an annual discount rate of 10%. Standardized measure is the present value of estimated future cash inflows from proved natural gas and oil reserves, less future development and production costs and future income tax expenses, discounted at 10% per annum to reflect timing of future cash flows and using the same pricing assumptions as were used to calculate PV-10. Standardized measure differs from PV-10 because standardized measure includes the effect of future income taxes. Amounts shown for September 30, 2004 and 2005 reflect values for Atlas America E&P Operations, which pay income taxes. Amounts shown for March 31, 2006 reflect values for our reserves on a pro forma basis to reflect the contribution of assets of Atlas America to us at the closing of this offering. Since we are a limited liability company that allocates our taxable income to our unitholders, no provision for federal or state income taxes has been included in the March 31, 2006 calculation of standardized measure, which is, therefore, the same as the PV-10 value. Amounts shown include physical hedges but not financial hedging transactions. We estimate that if natural gas prices decline by $1.00 per Mcf, then the PV-10 value of our proved reserves as of March 31, 2006 would decrease from $412.4 million to $348.7 million. For a description of our hedging transactions, please read “Business—Natural Gas Hedging.”, 247069=The summary pro forma financial data for the year ended September 30, 2005 and nine months ended June 30, 2006 are derived from the unaudited pro forma financial statements of Atlas Energy Resources, LLC included in this prospectus. The pro forma adjustments have been prepared as if the transactions listed below had taken place on June 30, 2006, in the case of the pro forma balance sheet, or as of October 1, 2004, in the case of the pro forma statements of income. These transactions include:, 207958=Our board of directors has adopted a policy that it will raise our quarterly cash distribution only when it believes that we have sufficient reserves and liquidity for the proper conduct of our business, including the maintenance of our asset base, and can maintain the increased distribution level for a sustained period. While this is our current policy, our board of directors may alter the policy in the future. Our limited liability company agreement requires that, within 45 days after the end of each calendar quarter beginning with the quarter ending December 31, 2006, we distribute all of our available cash to holders of record of our units on the applicable record date., 927293=The following table sets forth selected historical combined financial and operating data for our predecessor, Atlas America E & P Operations, as of and for the periods indicated. Atlas America E & P Operations are the subsidiaries of Atlas America which hold its natural gas and oil development and production assets and liabilities, substantially all of which Atlas America will transfer to us upon the completion of this offering. We derived the historical financial data as of September 30, 2004 and 2005 and for the years ended September 30, 2003, 2004 and 2005 from Atlas America E & P Operations’ financial statements, which were audited by Grant Thornton LLP, independent registered public accounting firm, and are included in this prospectus. We derived the historical financial data as of September 30, 2001, 2002 and 2003 and for the years ended September 30, 2001 and 2002 from Atlas America E&P Operations’ unaudited financial statements, which are not included in this prospectus. We derived the historical financial data for the nine months ended June 30, 2005 and 2006 and the balance sheet information as of June 30, 2006 from Atlas America E & P Operations’ unaudited financial statements included in this prospectus., 870086=We estimate that our initial annual estimated maintenance capital expenditures will be approximately $35.0 million per year. Our drilling program assumes that we will drill a total of 869 gross (281 net to our interest in the partnerships) wells during the twelve months ending September 30, 2007, of which 366 gross (123 net) wells will constitute maintenance capital projects required to maintain our current production volumes, which comprises $35.0 million of the $82.9 million projected for total capital expenditures. We also have included estimated maintenance capital expenditures of approximately $350,000 per year for potential costs that we may incur for lease renewals and similar expenditures that will enable us to maintain our capital asset base.}",
    "lastModified": "Thu, 04 Dec 2014 16:32:18 GMT",
    "textBeforeTable": "  (Exact name of registrant as specified in its charter) ATLAS ENERGY RESOURCES, LLC REGISTRATION STATEMENT UNDER THE SECURITIES ACT OF 1933 FORM S-1 No. 2 to AMENDMENT Washington, D.C. 20549 SECURITIES AND EXCHANGE COMMISSION UNITED STATES Registration No. 333-136094 As filed with the Securities and Exchange Commission on November 1, 2006 Table of Contents   Amendment No. 2 to Form S-1 Registration Statement   //-->",
    "textAfterTable": "Ø   Our business depends on gathering and transportation facilities owned by Atlas Pipeline Partners, L.P. Any limitation in the availability of those facilities would interfere with our ability to market the natural gas we produce and could reduce our revenues and cash available for distribution.   Ø   Atlas America, Inc. and its affiliates will own a controlling interest in us upon completion of this offering.   Ø   Members of our board of directors and Atlas America and its affiliates, including our manager, may have conflicts of interest with us.  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}