{
    "relation": [
        [
            "Platform",
            "Microsoft Windows 98",
            "Windows Me",
            "Windows 2000",
            "Windows XP",
            "Windows Server 2003"
        ],
        [
            "Browser",
            "Microsoft Internet Explorer 5.5, Firefox 1.x, Mozilla 1.x, Netscape 7.x or later, AOL 9, Opera 7.11 or later",
            "Microsoft Internet Explorer 5.5, Firefox 1.x, Mozilla 1.x, Netscape 7.x or later, AOL 9, Opera 7.11 or later",
            "Microsoft Internet Explorer 5.5, Firefox 1.x, Mozilla 1.x, Netscape 7.x or later, AOL 9, Opera 7.11 or later",
            "Microsoft Internet Explorer 5.5, Firefox 1.x, Mozilla 1.x, Netscape 7.x or later, AOL 9, Opera 7.11 or later",
            "Microsoft Internet Explorer 5.5, Firefox 1.x, Mozilla 1.x, Netscape 7.x or later, AOL 9, Opera 7.11 or later"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ihs.gov/DentalCDE/index.cfm?fuseaction=catalog.printcatalog&year=2014",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00206-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 519458031,
    "recordOffset": 519409202,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{107130=This course presents an overview of the principles of dental public health. Course developed October 2009. Course updated February 2014., 13475=Activity Overview: This course is an e-learning course that is divided into two parts covering the chemo and the mechanical aspects of endodontic cleaning and shaping. Part 1 covers the selection and use of chemotherapeutic agents in endodontics. Part 2 covers the proper use of conventional stainless steel hand files and nickel titanium rotary files. The hand filing section explains and demonstrates crown down technique, step back technique, negotiating narrow canals, as well as blocked and ledged canals. The rotary section covers basic principles of all rotary files and the detailed use of the analytic K3 nickel titanium file system. Teaching Methods This course is delivered online and includes interactive activities, lecture, and video demonstrations. Course developed July 2007. Course reviewed and updated August 2010. Course updated February 2014., 104157=This course presents an overview of fluoride varnishes. It is appropriate for dental and other health professionals who would like to learn the theory and application of fluoride varnishes. Course developed February 2010. Course updated February 2014., 148987=You want to be effective with every client, but sometimes it feels like you are not only ineffective, you might even be bothersome. This training will help you improve your communication skills. You will learn to listen better, hear what your client is really saying, and therefore know what kind of information will really help them. Plus, you’ll get to test the techniques presented, so the next time you meet with your client, you’ll be ready to listen and be heard. The training consists of two interviews, a coaching session on basic communication skills and a discussion of these skills, a short quiz and a practice session to gain experience. Course developed February 2008. Course reviewed March 2011. Course updated November 2013., 245566=The purpose of this one hour webinar course is to give IHS dental staff a review of nitrous oxide use in the dental setting. The course will include history, mechanism of action, protocols, and an update on recent developments with delivery systems. Course created October 2013., 192717=This course showcases a risk-based approach for the management of dental caries. It includes basic information on caries diagnosis, risk assessment and treatment planning. Supplemental reading is suggested at the end of the course. Course developed January 2001. Course revised January 2004. Course revised January 2010. Course updated February 2014., 9357=Course participants can view and print transcripts through the CDE system. A transcript lists the courses you have completed and the number of CDE credits earned since FY 2002. The transcript will be automatically updated when you complete courses in FY 2011., 89599=This session is a webinar via Adobe Connect for the IHS NOHC. The purpose of this course is to give IHS Dental providers a better understanding of the various oral manifestations and oral diseases commonly seen in HIV/AIDS and how the dental providers can involve in the detection, treatment and prevention of HIV infection. The session is scheduled for 11/20/2013. To join meeting: http://ihs.adobeconnect.com/nohcc-de/ Room Passcode: sunshine, 321667=The purpose of this one-hour call is to provide dental staff in the Navajo Area with an update of the IHS’s performance in the IHS Early Childhood Caries Collaborative and to help prepare them for the fifth and final year of this initiative. Course created March 2014., 4868=The results of the lottery will be available on www.doh.ihs.gov on November 8, 2010., 199800=This online training will discuss the guidelines to address progression and co-morbidities which affect chronic kidney disease [CKD] outcomes. Current adherence to the guidelines, models for improving outcomes and opportunities for intervention will be described. Supporting documentation for this course is contained in CSC File 5554. Renewal of the course is File 5776. File to be replaced by 5849. This course has been planned and implemented in accordance with the ADA CERP Recognition Standards and Procedures. None of the faculty/presenters for this activity has a conflict of interest, and there is no use of unlabeled or investigational pharmaceutical products or medical devices. The educational objectives, content and selection of educational methods and instructors are conducted independent of any commercial entity. Concerns or complaints about this course may be directed to marybeth.kinney@comcast.net or to ADA CERP at http://www.ada.org/goto/cerp. Course created November 2013., 236326=Six programs, two from the Albuquerque Area and four from the Nashville Area, will gather to discuss their oral health promotion/disease prevention proposals, exchange ideas on how to carry out these projects, and share success stories. Course created May 2014., 301567=The purpose of this one-hour course is to give all dental staff an overview of Probiotics and its clinical applications in medicine and possible uses in dentistry. Course created April 2014., 195864=This online training includes a brief review of the functions of the kidneys, discussion of, identification and monitoring of Chronic Kidney Disease [CKD] and describes new tools from the National Kidney Disease Education Program that can be used for patient education. Key concepts in nutrition assessment, management and diet recommendations for dialysis will be reviewed. Supporting documentation for this course is contained in CSC File 5536 and File 5660. This course has been planned and implemented in accordance with the ADA CERP Recognition Standards and Procedures. None of the faculty/presenters for this activity has a conflict of interest, and there is no use of unlabeled or investigational pharmaceutical products or medical devices. The educational objectives, content and selection of educational methods and instructors are conducted independent of any commercial entity. Concerns or complaints about this course may be directed to ADA CERP at http://www.ada.org/goto/cerp. Course created November 2013., 207210=This course showcases a risk-based approach for the management of periodontal diseases. It includes basic information on periodontal detection, diagnosis, risk assessment, treatment planning and prognosis. Course revised November 2013., 330308=The purpose of this one-hour NOHC call is to give all dental staff an overview of Oral Surgery factors to consider when deciding whether to treat a patient or refer to a specialist. Course created February 2014., 405945=All supporting documentation is on file at CSC File 5842. Course created August 2014., 110014=There is no need to \"Register\" for this course. Simply login to the CDE and Click on the link to take the ONLINE COURSE in the Additional Info section on the Course Detail page to receive credit. Activity Overview: Domestic violence is a health care problem of epidemic proportions. Oral health providers are in a pivotal position for identifying head, face, and neck injuries typical of domestic violence or child abuse. To raise awareness about this public health issue, the IHS Division of Oral Health worked with Barbara Gabbert, PhD at the University of California San Francisco's Dental School. Dr. Gabbert developed the AVDR [Ask, Validate, Document, and Refer] program, and IHS Division of Oral Health incorporated the AVDR DVD into this course. Teaching Methods This course is delivered online and includes interactive activities, lecture, and video demonstrations. Course developed January 2007. Course reviewed December 2010. Course updated February 2014., 26398=Activity Overview: Before final restoration and after complete cleaning and shaping, the root canal system must be obturated. This course covers the most common and best supported techniques available today. Various techniques presented include cold lateral obturation [standard and non-standard], as well as warm vertical obturation utilizing the System B heat carrier, and a gutta percha gun. Techniques, tips, and detailed visual examples including demonstrations and 3D animations are used to explain and demonstrated these techniques. Course developed July 2007. Course reviewed and updated August 2011. Course updated February 2014., 203668=This online training will discuss the guidelines for physical activity and cardiometabolic risk reduction in diabetes and prediabetes. The current recommendations for weight loss and managing diabetes and prediabetes will also be discussed. Supporting documentation for this course is contained in CSC File 5504. This course has been planned and implemented in accordance with the ADA CERP Recognition Standards and Procedures. None of the faculty/presenters for this activity has a conflict of interest, and there is no use of unlabeled or investigational pharmaceutical products or medical devices. The educational objectives, content and selection of educational methods and instructors are conducted independent of any commercial entity. Concerns or complaints about this course may be directed to marybeth.kinney@comcast.net or to ADA CERP at http://www.ada.org/goto/cerp. Course created November 2013., 189439=This course provides two basic reasons for evaluating a caries risk program. Learn correct methods to evaluate an effective caries risk program and understand the importance of coding standardization. Supplemental reading is suggested at the end of the course. Course developed January 2001. Course revised January 2004. Course revised January 2010. Course updated February 2014., 75184=Dental assistants must have a core set of knowledge and skills before registering for the Expanded Functions-Basic Restorative course. The core set of knowledge and skills include: Dental terminology; placing and removing a Tofflemire matrix band and wedge, preparing, placing and removing a dental dam; and setting up for Class I, Class II, and Class V amalgams, and Class III and Class V composite restorations. This online course consists of pre-tests, learning activities, post-tests and demonstrations for each lesson in the four modules. To complete this course, dental assistants must earn a score of 80 percent or better on each post-test, and certify competency by demonstrating skills and knowledge to their supervisor. Upon successful completion of all four modules in this course, dental assistants will be able to register for the EF-Basic Restorative Course. Course developed January 2010. Course revised November 2013., 80636=None. Course developed January, 2011., 276480=The purpose of this one-hour NOHC call is to provide dental staff across the IHS with an update of the agency's performance in the IHS Early Childhood Caries Collaborative and to help prepare them for the fifth and final year of this initiative. Course created March 2014., 45381=The course is designed to discuss the current literature review on pit and fissure sealant and the application to Indian Health Services' oral health prevention. The course is open to all IHS Dental Hygienists and recommended team members who place pit and fissure sealants. Course created May 2014., 165739=This course provides an overview of prevention strategies to improve oral health both in the dental clinic and in American Indian/Alaska Native communities. The course discusses the importance of prevention and describes best practices to prevent dental caries and periodontal diseases in all age groups. Course developed February 2010. Course revised November 2013., 185951=This course covers exam and diagnosis, treatment planning and recall. It focuses on the concept of a risk-based medical model to manage dental caries. It is an evidence-based approach to preventive and restorative procedures that considers both the clinician’s judgment and available resources. Recommendations and regimens listed are supported by current professional, refereed literature. The model is a clinical approach which addresses treatment planning and delivery of oral health care services for the individual and family. Supplemental reading is suggested at the end of the course. Course developed July 2009. Course reviewed August 2011. Course updated February 2014., 125766=OSAP is the Organization for Safety and Asepsis Procedures. Founded in 1984, the non-profit association is dentistrys premier resource for infection control and safety information. Through its publications, courses, website, and worldwide collaborations, OSAP and the tax-exempt OSAP Foundation support education, research, service, and policy development to promote safety and the control of infectious diseases in dental healthcare settings worldwide., 220835=Upon completion of this course, the participant will be able to: 1. Define addiction and explain the recovery process. 2. Utilize substance abuse knowledge to encourage and inspire Native American individuals and families. 3. Relate recent healthcare-associated infection investigations related to dental practices. 4. List general and dental specific infection control information and resources available. 5. Explain the basic concepts of blood borne pathogens and how they affect human health. 6. Discuss the OSHA blood borne pathogens regulation 1910.1030 and know why it is Important. 7. Evaluate a dental facility for hazards and determine methods for controlling those hazards., 152982=Conflicts happen. You probably experience them every day. They don’t have to be uncomfortable, and they don’t have to escalate. This training will help you see that in every conflict there is an opportunity to find common ground, and come together to achieve goals. By learning these solid conflict resolution skills, the thought of facing conflict will no longer be anxiety-producing. This training will give you the knowledge and experience so you can deal confidently with conflicts no matter how large or small. The training consists of two phone calls, a discussion of conflict resolution skills, a short quiz and an evaluation. It is the policy of the Indian Health Service [IHS], Division of Oral Health [DOH], that faculty/presenters disclose any significant financial or other relationships with commercial companies whose products may be discussed in the activity. The IHS, DOH also requires faculty disclose any unlabeled or investigational use [not yet approved for any purpose] of pharmaceutical products and medical devices. Course developed February 2008. Course reviewed March 2011. Course revised November 2013., 48484=The course is designed to introduce basic principles of risk management by discussing high-risk patients, high-risk situations, and high-risk clinical procedures. Course created August 2014., 179523=This course reviews the carious process and etiology. It also covers various strategies commonly used for both caries prevention and control. It also presents appropriate combinations of strategies for patients in various risk categories. Supplemental reading is suggested at the end of the course. Course developed July 2009. Course reviewed August 2011. Course updated February 2014., 239428=Six programs, two from the Albuquerque Area and four from the Nashville Area, will gather to discuss their oral health promotion/disease prevention proposals, exchange ideas on how to carry out these projects, and share success stories. Course created June 2014., 42183=This session is part of a series sponsored by NOHC and conducted by Video Teleconference. The course is offered to dental chiefs only. To join the meeting: http://ihs.adobeconnect.com/nohcc-de/ Room Passcode: sunshine - join as a Guest The purpose of this one-hour course is to give dentists a better understanding of oral cancer screening and detection. The course will include pictures of soft tissue lesions and descriptions of symptoms of oral cancer. Course created February 2014., 172071=In the wake of recent disasters such as Hurricanes Katrina and Rita and the terrorist attacks on September 11, 2001, and the Homeland Security Presidential Directive [HSPD-21], emergency preparedness and disaster and crisis response have gained national recognition and significance. This course is designed to equip disaster and crisis volunteers and personnel with the awareness, knowledge, and skills needed to provide culturally and linguistically appropriate services to diverse communities during all phases of disaster. The course is grounded in the Office of Minority Health's [OMH] Culturally and Linguistically-Appropriate Services [CLAS] Standards, which are grouped into three themes: Culturally Competent Care, Language Access Services, and Organizational Supports. Course developed September 2008. Course reviewed August 2011. Course revised February 2014., 223896=Six programs, two from the Albuquerque Area and four from the Nashville Area, will gather to discuss their oral health promotion/disease prevention proposals, exchange ideas on how to carry out these projects, and share success stories. Course created January 2014., 233223=Six programs, two from the Albuquerque Area and four from the Nashville Area, will gather to discuss their oral health promotion/disease prevention proposals, exchange ideas on how to carry out these projects, and share success stories. Course created April 2014., 161633=Whether working with clients or colleagues, having good problem-solving skills enhance collaboration and team work. Working together as a team can enhance work satisfaction, increase productivity, provide support and improve personal connections. Instead of trying to solve problems once they have occurred, problem-solving models provide a framework to tackle problems as they arise. In this training, you will see a problem unfolding and have the opportunity to view and practice problem-solving skills. The training consists of a series of short videos with quiz questions and coaching on problem solving skills, a short quiz and an evaluation. Course developed February 2008. Course reviewed March 2011. Course revised November 2013., 82931=This course will provide basic training for IHS staff who offer continuing dental education courses in a distance education [DE] format. The majority of IHS continuing education courses are taught by clinical staff. Many courses have been taught over long period, and ongoing evaluation and modifications have made most of these courses effective. Therefore IHS has a strong cadre of instructors with excellent content knowledge and willingness to teach courses. However, few of these instructors have experience in distance teaching. The purpose of this course is to give IHS staff the tools needed to teach CDE in distance or blended formats. Course created December 2013., 175965=This online course presents current information regarding alcoholism and fetal alcohol syndrome, as well as the dental management of patients affected by alcoholism. This interactive program includes a presentation of information on specific topics followed by practice in the form of multiple-choice and true/false questions. This format provides you with immediate feedback to reinforce key learning concepts for different topics, and prepare you for the final quiz. Course developed February 2011. Course updated February 2014., 242561=The purpose of the one-hour session is to provide potential solutions regarding broken dental appointments among the Indian Health Service, Tribal and Urban [I/T/U] dental programs. Course created February 2014., 129001=There is no need to \"Register\" for this course. Simply login to the CDE and Click on the link to take the ONLINE COURSE in the Additional Info section on the Course Detail page and then complete the post-test and survey to receive credit. Activity Overview: The Prevent Abuse and Neglect through Dental Awareness [PANDA] is a program to address the lack of child abuse and neglect reporting by dental professionals. The educational program includes the history of family violence in our society, clinical examples of confirmed abuse and neglect, and discussions of legal and liability issues involved in family violence interventions. Teaching Methods This course is delivered online and includes PowerPoint slides with narration. Course developed March 2007. Course reviewed February 2010. Course updated February 2014., 182729=This course covers treatment assumptions made with conventional caries management. It explains the risks of restorative treatment and the impact of examiner variation on patient care. Supplemental reading is suggested at the end of the course. Course developed July 2009. Course reviewed August 2011. Course updated February 2014., 157422=This training presents ways to make your large meetings or conferences and small staff meetings more interesting and effective. Meetings that provide opportunities for participants to interact and network with each other and provide information on the latest developments in areas such as diabetes care can enhance overall patient care. Our goal is to enliven meetings that can too often become routine and boring. Information is included on how to facilitate a variety of techniques during your meetings such as panel discussions; brainstorming, role playing and others. We encourage you to experiment with alternative ways of setting up your meetings. In this way, you will enhance the contributions of everyone and make life a lot more interesting at work. Course developed February 2008. Course reviewed March 2011. Course revised November 2013., 38565=This web-based study group will meet for one hour, six times per year. At each meeting, two articles will be reviewed and the person presenting the article will be responsible for a brief review and leading the discussion. Each specialty will have an opportunity to be represented. The study group will provide an opportunity to present evidence-based research articles that support concepts of dental practice in IHS that may differ from what dentists new [or old] to IHS may have learned or experienced. The session on December 10 will begin with a review of an article regarding nanoleakage with affected and non-affected dentine following placement of glass ionomer material. The second article reviews practice guidelines for Molar-Incisor Hypoplasia. Course created December 2013., 96542=You must be logged in to the CDE site to access this course. This one-hour course, How to Apply fluoride Varnish, was developed as a collaboration between the Indian Health Service [IHS] and the IHS Head Start Program. This course will provide an overview of Early Childhood Caries [ECC] and describe its impact among American Indian and Alaska Native children. Participants will learn how to provide an oral health risk assessment, how to apply fluoride varnish, and key messages for families to prevent ECC. Course developed January 2010. Course revised November 2013., 314492=Dr. Smith's presentation: Discuss the article in JAMA December 18, 2013 “The Effect of Nonsurgical Periodontal Therapy on Hemoglobin A1C levels in persons with Type 2 diabetes and chronic periodontitis”authored by Engebretson, et al. Dr. Schroth's presentation: Discuss the recent article “Prenatal Vitamin D and Dental Caries in Infants” by Schroth, et al, 2014., 20124=Activity Overview: This course is an E-Learning, online based course that covers all aspects of an emergency endodontic visit. It is structured around the SOAP note and will walk you through developing a good patient note, performing diagnostic tests, formulating a pulpal and perapical diagnosis, and providing initial emergency treatment. At the end of the course you will be given a 10-question exam. A score of 80 or higher is needed before the CDE system can print out your course certificate. Teaching Methods This course is delivered online and includes interactive activities, lecture, and video demonstrations. Course developed: July 2007. Course reviewed and updated August 2010. Course updated February 2014., 32371=Caries stabilization can increase treatment options for babies and young children. Caries stabilization involves using fluoride-releasing glass ionomer for interim therapeutic restorations [ITRs], resin and glass ionomer sealants to protect pit and fissures on primary molars, fluoride varnish, and twice daily use of fluoride toothpaste at home. YOU MUST BE LOGGED IN TO TAKE THIS ONLINE COURSE. Course developed: February 2010. Course revised November 2013., 227008=Six programs, two from the Albuquerque Area and four from the Nashville Area, will gather to discuss their oral health promotion/disease prevention proposals, exchange ideas on how to carry out these projects, and share success stories. Course created February 2014., 369225=All supporting documentation is on file at CSC File 5842. Course created July 2014., 230118=Six programs, two from the Albuquerque Area and four from the Nashville Area, will gather to discuss their oral health promotion/disease prevention proposals, exchange ideas on how to carry out these projects, and share success stories. Course created March 2014., 4186=A computerized lottery is used to register participants into courses. This gives everyone an equal opportunity to attend at least one course. The selection period for FY 2012 is October 3, 2011 - October 31, 2011. Please be sure that your CDE supervisor has approved your selections on the website before the end date because the lottery will be run on November 1, 2011., 59909=This course is offered via through Adobe Connect Recordings. Each module will cover a particular aspect of radiology. After you register for the course you'll be able to access the Course Modules through this course page, accessed through your MyCDE area. Course Modules Paralleling Tech. Part 1, [2 hrs.] Paralleling Tech. Part 2, [2 hrs.] The first and second sessions of this course are designed to offer both untrained and experienced dental assistants an opportunity to learn, update and improve their paralleling technique to increase the diagnostic value of radiographs. During these sessions participants will explore paralleling technique; terminology, film and positioning indicator device [PID] placement, troubleshoot and correct errors. Participants can expect pre-course communication and assignments. Bitewing Technique [2 hrs.] The third session is designed to offer both untrained and experienced dental assistants an opportunity to learn, update and improve their technique so bitewings will have diagnostic value. During this session participants will explore bitewing techniques; terminology, criteria for premolar and molar bitewings, head position, use of tabs and film holder, film placement, open contacts. Participants can expect pre-course communication and assignments. Radiological Protection, [2 hrs.] The last session of the course is Radiological Protection and is designed to offer both untrained and experienced dental assistants an opportunity to learn and update their radiological protection knowledge and skills in the clinic. During this session participants will examine their radiological protection practices for staff and patients: compliance with radiology certification, terminology, proper use of lead protective devices, effective use of barriers and distance, dosimeter, report adjustments or repairs of x-ray machines. Participants can expect pre-course communication and assignments. Course developed: January 2013. Course revised November 2013}",
    "textBeforeTable": "Prerequisites:    Hardware/Software Requirements: Learning Objectives: After review of this DVD and completion of the Post-Test the clinician will be able to: 1. Describe the principles and advantages of an ideal tapered endodontic preparation. 2. Perform a Crown Down Step Back endodontic preparation using Gates-Glidden burs, orifice shapers and standard hand files. 3. Negotiate a blocked and ledged canal. 4. Negotiate a narrow “calcified” canal. 5. Explain the basic similarities and differences between the main types of rotary file systems. 6. State the logic behind a crown down preparation using both hand and rotary files. 7. Demonstrate using the K3 rotary file system and how to use it safely and properly. 8. Apply various chemo agents used in endodontics and explain their safe and proper usage. Summary: Activity Overview: This course is an e-learning course that is divided into two parts covering the chemo and the mechanical aspects of endodontic cleaning and shaping. Part 1 covers the selection and use of chemotherapeutic agents in endodontics. Part 2 covers the proper use of conventional stainless steel hand files and nickel titanium rotary files. The hand filing section explains and demonstrates crown down technique, step back technique, negotiating narrow canals, as well as blocked and ledged canals. The",
    "textAfterTable": "Windows Me Microsoft Internet Explorer 5.5, Firefox 1.x, Mozilla 1.x, Netscape 7.x or later, AOL 9, Opera 7.11 or later Windows 2000 Microsoft Internet Explorer 5.5, Firefox 1.x, Mozilla 1.x, Netscape 7.x or later, AOL 9, Opera 7.11 or later Windows XP Microsoft Internet Explorer 5.5, Firefox 1.x, Mozilla 1.x, Netscape 7.x or later, AOL 9, Opera 7.11 or later Windows Server 2003 Microsoft Internet Explorer 5.5, Firefox 1.x, Mozilla 1.x, Netscape 7.x or later, AOL 9, Opera 7.11 or later Macintosh Platform Browser Mac OS X v.10.1.x, 10.2.x, 10.3.x, or 10.4.x Internet Explorer 5.2, Firefox 1.x, Mozilla 1.x, Netscape 7.x or later, AOL for Mac OS X, Opera 6, Safari 1.x or later Audio: This course may contain an audio portion or soundtrack. Please turn on your speakers or use headphones. Travel: Payment Address: 2014 Continuing Dental Education Catalog Dentist Courses DD0044: Endodontic Emergencies Date(s): 11/1/2013 - 10/1/2014 Facility: Online Location: Online",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}