{
    "relation": [
        [
            "Release date",
            "June 28, 2013",
            "June 28, 2013",
            "June 26, 2013",
            "June 26, 2013",
            "June 19, 2013",
            "June 19, 2013",
            "June 19, 2013",
            "June 19, 2013",
            "June 19, 2013",
            "June 17, 2013",
            "June 13, 2013",
            "June 12, 2013",
            "June 12, 2013",
            "June 12, 2013",
            "June 12, 2013",
            "June 12, 2013",
            "June 12, 2013",
            "June 12, 2013",
            "June 6, 2013",
            "June 5, 2013",
            "June 5, 2013",
            "June 5, 2013",
            "June 5, 2013",
            "June 5, 2013",
            "June 5, 2013"
        ],
        [
            "Release",
            "MEDIA ALERT: Gettysburg/Vicksburg Anniversary Commemoration July 1-4 at History Center, James J. Hill House, Minnesota State Capitol",
            "State Civil War Contingent Heads to Gettysburg to Share Minnesota's Story",
            "Lumberjacks and Pies this July at the Forest History Center",
            "Celebrate Lake Superior Day and National Lighthouse Day at Split Rock Lighthouse in July and August",
            "New Exhibit 'Other Realities: The Art of Paul S. Kramer' Opens at James J. Hill House July 13",
            "Journey Back Through Time with Movies, Horses and the Civil War at Historic Forestville this July",
            "Civil War Family Day and an Artist Tour at the Minnesota State Capitol in July",
            "Grandparent's Day and the National Grange Youth Event at the Oliver H. Kelley Farm in July",
            "Walking Tours, Trolley Tours and Children's Camps at Historic Fort Snelling in July",
            "Five Ways To Prevent \"Summer Slide\" From The Minnesota Historical Society",
            "Minnesota Students Win Big at National History Day Competition in Washington, D.C. Today",
            "July History Crawls Feature Mid-Century Modern Architecture, St. Paul's West End and More",
            "Jazz in June, Minnesota's Path to Statehood and Family Art Day at the Sibley House Historic Site this Summer",
            "American Indian Life Featured in July Family Programs at Jeffers Petroglyphs Historic Site",
            "Celebrate Minnesota's Greatest Generation and Watch History Come to Life at the Charles A. Lindbergh Historic Site in July",
            "Learn How to Use Birchbark to Make Houses, Containers and Canoes at the North West Company Fur Post Weekends in July",
            "July Workshops at Mille Lacs Indian Museum Include Applique Beading, Making Cornhusk Dolls",
            "New Minnesota Historical and Cultural Heritage Grants Funding Available",
            "Rondo's Legacy Joins Permanent Exhibit at the Minnesota History Center",
            "Explore Historic Summit Avenue and the James J. Hill House this July",
            "Vibrant Music and Programming Featured at 9 Nights of Music at History Center in July and August",
            "July at the Alexander Ramsey House Explores 1876, Unmentionable Victorian Topics and Vintage Baseball",
            "Explore Minneapolis Through One of Mill City Museum's Many Tours in July",
            "Weeklong Commemoration of Minnesota's Role in the Battle of Gettysburg and Vicksburg July 1-4",
            "Fourth of July Programs Offered at Historic Sites and Museums Statewide"
        ]
    ],
    "pageTitle": "News Releases | Minnesota Historical Society",
    "title": "June 2013",
    "url": "http://www.mnhs.org/media/Kits/hours.cfm?siteID=18",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00079-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 587496999,
    "recordOffset": 587449171,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{314255=Funding provided by the State of Minnesota, the Legacy Amendment through the vote of Minnesotans on Nov. 4, 2008, and our generous donors and members.}",
    "lastModified": "Mon, 03 Aug 2015 19:11:33 GMT",
    "textBeforeTable": "- Any -Alexander Ramsey HouseBirch Coulee BattlefieldCharles A. Lindbergh Historic SiteComstock HouseFolsom HouseForest History CenterFort RidgelyGale Family LibraryHarkin StoreHistoric ForestvilleHistoric Fort SnellingJames J. Hill HouseJeffers PetroglyphsLac qui Parle MissionLower Sioux AgencyMarine MillMill City MuseumMille Lacs Indian Museum and Trading PostMinnehaha DepotMinnesota History CenterMinnesota State CapitolNorth West Company Fur PostOliver Kelley FarmSibley Historic SiteSplit Rock LighthouseTraverse des SiouxW.W. Mayo House Location Search by word or phrase News Releases Jobs Volunteers Fellowships & Residencies Internships Logos",
    "textAfterTable": "JEFFERS PETROGLYPHS: Plan A Visit April 27, 2015 JEFFERS PETROGLYPHS: History of the People April 27, 2015 JEFFERS PETROGLYPHS: History of the Petroglyphs April 27, 2015 JEFFERS PETROGLYPHS: Education Resources April 27, 2015 JEFFERS PETROGLYPHS: Experts to Interview April 27, 2015 JEFFERS PETROGLYPHS: Images April 27, 2015 JEFFERS PETROGLYPHS: Feature Article April 22, 2015 2015 Summer Travel Season Gets Underway April 15, 2015 June 2015 Events, Classes and Exhibits March 2015 Release date Release March 25, 2015 Minnesota Historical Society Earns National",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}