{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Student Athletes. UNR is a Division 1 school but has student population of less than 24,000. Medical and research students; the facilities are amazing.",
            "The Wolf Den is a great place for students to hang out.",
            "There are lots of opportunities for fun at UNR. The school athletics programs are great and lots of fun to attend and support the school and your friends. Reno has lots of opportunity for outdoor activity - year round.",
            "Live on Campus, it keeps you in the school spirit. Get to know people in your dorm to expand your base and not feel so lonely when you first start school. Spread your classes out so you have plenty of time to study.",
            "Living on Campus is a great way to start college. The campus is beaufiul and easy to commute thanks to the shuttle. The buildings and facilities are amazing."
        ]
    ],
    "pageTitle": "University of Nevada-Reno Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Nevada-Reno/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00163-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 884482335,
    "recordOffset": 884295423,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1024966=© 2015, Cappex.com, LLC, 636530=John Mackay is very important to our university. He was one of the big four that in 1873 founded over 400 million dollars in ore and donated a lot of it to the university! One of the funniest traditions we have involves our statue of John Mackay. During finals week, students provide offerings to Mackay as good luck on their exams. You'll see him wearing sunglasses, boxer briefs, a bow tie, and other shenanigans. He was even painted blue during business week!, 145861=unr is a cheap college to begin with, but it also has many scholarships. for example, for incoming freshmen there is a scholarship matrix that awards a range of $1000-$2500 to each student depending on gpa and sat/act scores., 43197=If you are in the WUE program, this is a great school to go to. You save money and earn a degree at the same time. For financial aid such as a free ride for four years, do your research because this university offers that and apply really early whether or not you are sure you want to go to this school. Better safe than sorry. Because after that, financial aid is limited, you can get, a scholarship ranging from 1000 to 5000 base on your SAT, ACT Scores and GPA. If you qualify you can get a states grant and pell grant. Aside from that, you have to come up the rest out of your own pocket. Dont forget to budget some money for books, air fare or gas and personal needs when you move in either the dorms or an apartment. For books they have cheggs, you can rent your books there and the school also offers new and reused books, an option for you to choose from., 773013=There are several different residence halls to choose from and they all have unique features to them. I'm glad to be staying in the newest halls, The Living Learning Communities, they were built in 2012., 820497=The University of Nevada-Reno has been the foundation of my upper level education which has not only motivated me for even more education but also pursuing all opportunities that have been presented to me. It's a wonderful institution with encouraging professors who are academically supportive. I am proud to say I attend this university and it will be a triumphant day, this coming May, that I hold my degree in Biological Sciences from this university., 880868=The University of Nevada, Reno residential life, housing, and food service department has not been fair in its practices. I told the office over the phone that I had a family emergency where my sister had a roommate suddenly leave and she couldn't afford to live there without me moving in since the aforementioned roommate was paying for half of everything. The office informed me that I would not be refunded my $125 deposit and that I would owe 25% of the $2635 charge for the semester in the dorm, which means I'll lose $783.75 even though the move-in date isn't until this Sunday, January 19th. They offered to transfer my license agreement to the 2014-2015 academic year; however, I explained to them that this option wouldn't work since I begin pharmacy school in Colorado in August. Also, I spoke with the student I was assigned to live with, and she decided she no longer wanted a roommate. In other words, she chose to have the room all to herself, which means UNR won't be losing money because she'll be paying much more to be alone. Despite her filling this vacancy, UNR still expects me to pay the above-mentioned amount. I have no choice in paying because any financial aid covers UNR charges before I'm issued a refund check to use for food, gas, and other living expenses. Even if the student I was assigned to live with had still wanted a roommate, I believe this policy is unfair for students and the cancellation fee is ridiculously high. Moreover, this policy is not written on the housing application, but referenced in one sentence on the bottom of the last page in conveniently smaller font. Interestingly, I couldn't find this information anywhere on their website, but succeeded with an Internet search. Additionally, the Parking Services department informed me that there was a waiting list for the dorm garage because the faculty garage was full and some faculty were parking in the dorm garage now. This garage, meant for Sierra Hall dorm students, has 6 people on its wait list thanks to this situation. Finally, I'd like to provide a link that discusses issues students have had with meal plans, which are supervised by the same department that controls the dorms (http://unrforliberty.com/2008/06/lets-talk-about-greed-unr-housing-and_25.html). Please note that the article was written on June 25th, 2008 and demonstrates how long this problem has been around. I think at least hundreds of students, if not more, have been affected because 2440 students lived in the dorms for the 2012-2013 academic year. I wouldn't be surprised if many were forced to stay because they couldn't afford losing almost $800. I have contacted all local news stations with the hope that they will make the public aware of how this university mistreats its students because I don't see any other way for a significant change to manifest itself., 159765=reno is well known for its proximity to lake tahoe and the many ski resorts that are nearby. reno also is great place for hiking, biking, kayaking, and riding motorcycles or quads on our vast amount of public land. there are also numerous festivals and events that are world famous. hot august nights for those that are car fans, burning man for the more free spirit, and so many more. don't forget that we get quite warm in the summer so there are many activities that involve swimming, water sports, and camping. for those that are more into staying indoors there are many art museums, movie theaters, or performing art performances. reno offers so much more than the cliche spirits and gaming. we even have a rock wall that stretches dozens of feet above downtown reno looking over our biggest little city arch. reno also has the great feeling of being in a large city but really have the benefits of not being too big and there are many organized events downtown monthly such as pub crawls and wine walks., 42036=Apply early, especially your admission application process; you can start as early as Nov, second quarter of your senior year. There is also a living learning communities for students who are in nursing, engineering women and much more. If you want to be a part of it, do your research and apply early because spaces are limited. There is a honors programs, as well as a Trio scholars program. For meal plan I recommend Premium C or D, you would not need that many swipes a week. The DC cafe has good variety of food available to choose from. Don't buy your books early, wait until you went to your classes for a week. Student usually will change their minds, whether they like the class or not and would often drop and switch to another class. Some class would not require you to need your book. Look for good deals for books, there is a lot out there, such as amazon., 100621=The best dorms on campus are Argenta Hall, Canada Hall and Sierra Hall. I currently live in Argenta Hall and I love it. The room is spacious and it comes with a full bathroom inside. Argenta Hall is majority for Freshman, while Canada Hall and Sierra are for upperclassman. The best thing about Argenta is how the dining hall on the first floor of the building so you don't even have to leave the building to go get food. UNR is currently building new residence halls for the semester of Fall 2012. Overall, dorm life at UNR is more than what I had expected., 564258=I am part of Greek life on campus and I love it. It is a way for me to get involved and develop relationships with wonderful women in college. It's my home away from home and I love it. Also going to college in the city of Reno is great, there are always events going on and things to go to like the rib cook off, hot august night, street vibrations and so much more., 371453=There are so many cool traditions since the University has been around since 1874. I love providing offerings to the Mackay statue before finals and watching the Wolf pack beat the Rebels each fall for the Freemont cannon., 503204=Every year a group of students march up to the N and re-paint it., 986263=The rigor can vary depending on how many classes you take per semester. I took 5 classes for the past fall 2014 semester and it was definitely too much. Each class really will demand your time and effort to do well and retain the material! I would not suggest doing more than 4 classes (full-time) per semester; with four it is easier to have a balanced schedule and not feel so overwhelmed, especially if you work!}",
    "textBeforeTable": "07/20/2009 Reviewer is A current student here. 42 out of 44 people found this review useful. 1 of 219 Jessica from Reno, NV Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Nevada-Reno Reviews University of Nevada-Reno › Nevada › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "My college experience thus far has taught me to work hard, how to prioritize my time better, and how to enjoy a full college experience. Classes here are lots of work, in order to succeed I had to learn great study habits, become friends with my professors, and know that there is always help somewhere in the university. I never once felt overwhelmed or overworked and I soon realized that the University of Nevada, Reno has helped me learn not only inside the classrooms, but outside of them as well. Login to rate or flag the reviews Anna from Reno, NV 08/22/2009 Reviewer is A current student here. 21 out of 23 people found this review useful. 2 of 219 Categories Comments Great for these types of students Anyone can find his or her niche at the University of Nevada, Reno. Because the student body is diverse and because of the great variety of academic departments, athletics, and student organizations, there is bound to be a group that shares your interests. The campus is small enough to allow you to always",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}