{
    "relation": [
        [
            "",
            "Metro 2033 (2010)",
            "StarCraft 2 (2010)",
            "Mafia 2 (2010)"
        ],
        [
            "low",
            "66.6",
            "",
            ""
        ],
        [
            "med.",
            "33.5",
            "51.8",
            "56.3"
        ],
        [
            "high",
            "19",
            "33.2",
            "50.1"
        ],
        [
            "ultra",
            "",
            "20.2",
            "31.1"
        ],
        [
            "",
            "fps",
            "fps",
            "fps"
        ]
    ],
    "pageTitle": "Review Acer Aspire 5943G Notebook - NotebookCheck.net Reviews",
    "title": "",
    "url": "http://www.notebookcheck.net/Review-Acer-Aspire-5943G-Notebook.36208.0.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00209-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 636073995,
    "recordOffset": 636007828,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{31538=As for graphics card, Acer has chosen the Mobility Radeon HD 5850 from ATI. The DirectX 11-capable 40nm GPU has 1040 million transistors, 800 unified shaders, a core speed of 625 MHz, as well as a memory speed of 800 MHz. The 1024 MByte video memory is meanwhile only 128bit, which theoretically wouldn't be a problem if Acer had used GDDR5 VRAM. The present combination of DDR3 VRAM and 128bit memory interface significantly limits the performance in higher resolutions. Because of this, the Radeon HD 5850 of the Aspire 5943G doesn't line up in the high-end segment, but instead in the upper mid-range. The energy consumption is meanwhile OK considering the offered performance, at 30-39 Watt., 45975=As is by now standard for multimedia laptops, the 15.6-inch display of the Aspire 5943G has an aspect ratio of 16:9. As for resolution, 1366 x 768 pixels come into play, which is typical for a 15-inch device. A corresponding resolution indeed doesn't load the components too strongly in 3D applications, yet the integrated display is barely suited for working comfortably with several opened windows., 39007=In closing, the viewing angle stability also leaves a lot to be desired. Above all at slanted angles from above and below there are colour- and brightness-deviations extremely quickly. If you take all individual aspects together, the built-in display isn't worthy of a multimedia laptop. Indeed most manufacturers use similarly substandard displays, yet at a price of 1500 Euro the customer should definitely expect more., 58262=In the following conditions the three model variants are the same: the 15.6-inch high-gloss display has a resolution of 1366 x 768 pixels, the hard disk capacity of the built-in HDD (5400 RPM) adds up to 640 GB. As for graphics card there's an upper mid-range DirectX 11-capable ATI Mobility Radeon HD 5850 (DDR3-VRAM). Windows 7 Home Premium 64bit provides its services as the operating system, which is less surprising., 41733=When it comes to the results the deployed AUO40EC panel is unfortunately disappointing across the board. Despite LED background-illumination the average brightness only amounts to 152.6 cd/m². Films and games will thus directly lack intensity. The illumination is likewise abysmal at 66%. Whilst the display at least proves to have a luminosity of 178.1 cd/m² in the brightest area (right upper), in the darkest area (left below) we could, meanwhile, measure only 117.6 cd/m². The black value, by way of contrast, is much too high at 0.99 cd/m². In this way dark areas seem greyer than deep black. On the whole there's a contrast of a lowly 174:1. For comparison: top displays often have a contrast ratio of more than 1000:1 (e.g. Deviltech Fragbook DTX). Thanks to the display silvering at least the colours are reasonably OK., 58868=The Aspire 5943G-728G64Wnss that we tested, which is available for around 1500 Euro and is thus more expensive, corresponds to the 1300 Euro model apart from two crucial details. On the one hand the RAM doubles from 4 GB to a staggering 8 GB. On the other hand the optical drive isn't just capable of reading Blu-Ray media, but also writing it. We consider the surcharge of 150 Euro that you have to fork out for the Aspire 5943G-728G64Wnss excessive (8 GB RAM currently offers barely any added value), so we would instead recommend the Aspire 5943G-724G64Bnss., 59696=If you're interested in the Aspire 5943G, you currently have the choice between three different variants. As long as you can do without a Blu-Ray drive and a quad-core processor, you'll be well served with the Aspire 5943G-5454G64Mnss, which is available from 1000 Euro. Alongside Intel's dual-core Core i5-450M processor it additionally has 4 GB of DDR3 RAM. The 1300 Euro Aspire 5943G-724G64Bnss likewise has four gigabytes of RAM, whilst the customer is greeted by a Blu-Ray player as the optical drive. As for processor, there's Intel's extremely high-performance Core i7-720QM.}",
    "TableContextTimeStampAfterTable": "{213555=On the whole the following goes: you shouldn't be deceived by the fine look of the Aspire 5943G. At heart the notebook is on a rather average level. For the price of 1500 Euro, faster and higher-quality systems like the Asus G73 or the Alienware M15x are available., 83345=Metro 2033, 83397=If you want to push a laptop to its performance limits, you'll find the right game in Metro 2033. The first-person shooter namely has such excessive hardware demands that the Aspire 5943G is exhausted not only with (very) high details but also in DirectX 11 mode. With medium details and in DirectX 10 mode Metro 2033 still judders noticeably in places, yet on the whole it's enough at least for 33.5 fps. With a Radeon HD 5650 even these graphics settings are taboo; the Acer Aspire 7740G only reached a meager rate of 25.0 fps (HD 5850: +34%)., 55828=The gangster-epic Mafia 2, eagerly awaited by many, causes no problems for the Radeon HD 5850. In the integrated benchmarks the Aspire 5943G, with high details, 16x AF, and a resolution of 1366 x 768, reached a very good rate of 50.1 fps. This result is 36% more than the Radeon HD 5650 (Acer TravelMate 7740G), which in the same settings only reaches 36.8 fps., 12186=In the graphics benchmarks the Radeon HD 5850 DDR3 had to take on not only its GDDR5 counterpart (MSI GX640) but also the extremely popular mid-range Radeon HD 5650 (Acer Aspire 4820TG). In the GPU score of 3DMark Vantage the Radeon HD 5850 DDR3, with 5056 points, can position itself ahead of the Radeon HD 5650 by around 70% with 2899 points. With GDDR5-VRAM the Radeon HD 5850 would admittedly be once more 40% faster (7089 points)., 125914=If you put together all three gaming benchmarks, the Radeon HD 5650, at a resolution of 1366 x 768, is trumped by the Radeon HD 5850 DDR3 by around 30%. Overall most current games can be played fluidly on the Aspire 5943G in medium to high details. If you connect an external monitor with a higher resolution the Radeon HD 5850 should, however, be brought quickly to its performance maximum. This is because the small 128-bit memory, together with the DDR3 video memory, develops into limiting factors. We would rather recommend demanding gamers a Radeon HD 5870 or a GeForce GTX 280M/GTX 285M for this reason.}",
    "lastModified": "Sat, 01 Aug 2015 17:21:51 GMT",
    "textBeforeTable": "Metro 2033: low details fluid Starcraft 2: high details fluid Mafia 2: high details fluid If you put together all three gaming benchmarks, the Radeon HD 5650, at a resolution of 1366 x 768, is trumped by the Radeon HD 5850 DDR3 by around 30%. Overall most current games can be played fluidly on the Aspire 5943G in medium to high details. If you connect an external monitor with a higher resolution the Radeon HD 5850 should, however, be brought quickly to its performance maximum. This is because the small 128-bit memory, together with the DDR3 video memory, develops into limiting factors. We would rather recommend demanding gamers a Radeon HD 5870 or a",
    "textAfterTable": "Emissions System Noise In contrast to the temperature development, almost no criticism has to be put up with regarding the system noise. When idle and under low load (web, video etc.) the Aspire 5943G is only slightly noticeable, and the case fan aligned on the left side turns pleasingly quietly. The optical drive is indeed somewhat more audible when accessing data, during DVD- or Blu-Ray playback the noise level is, however, OK. On under higher load (3D applications, games etc.) can a clear whooshing be heard, nevertheless at no point is the case fan disturbingly loud. Noise Level Idle 31.4 / 31.9 / 33.6 dB(A)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}