{
    "relation": [
        [
            "Shipping and handling",
            "Free shipping",
            "US $3.00",
            "US $25.00"
        ],
        [
            "To",
            "United States",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Shipping (USPS First Class Package®)",
            "Expedited Shipping (USPS Priority Mail®)",
            "Expedited Shipping (USPS Priority Mail Express®)"
        ],
        [
            "Delivery*",
            "Estimated within 3-7 business days",
            "Estimated within 2-5 business days",
            "Estimated within 2-3 business days"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/Unlocked-AT-T-Novatel-MiFi-2372-3G-Broadband-Wireless-Mobile-Hotspot-WiFi-Router/181391837297?hash=item2a3bcbc871",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00304-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 418017915,
    "recordOffset": 417975899,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{82935=The Novatel MiFi 2372 lets you keep important files backed up and ready with micro SD slot capable up to 16GB. (also support Micro SDHC) Collaborate and play effectively with colleagues and friends, as this device will accommodate up to five simultaneous WiFi connections. The MiFi is a complete wireless network that fits in your pocket!, 82282=The Novatel MiFi 2372 creates a Wireless hot-spot wherever you need it. Get work done on your desktop at home, on your laptop the car or camper, or at the ballgame. This MiFi letting you surf wirelessly on your laptop or WiFi enabled device anywhere a cellular connection is available. With speeds equivalant to a broadband connection available at the touch of a button, with this MiFi you can download files, watch videos, or play any games just as if you were at home or the office., 80038=Unlocked AT&T Novatel MiFi 2372 3G Wireless Mobile Hotspot WiFi Router}",
    "textBeforeTable": "Please enter 6 digits for the Postal Code. Please enter a valid Postal Code. Postal Code: Select a valid country. There are 1 items available. Please enter a number less than or equal to 1. -Select- Australia Austria Bahrain Belgium Brazil Bulgaria Canada Chile China Colombia Costa Rica Croatia, Republic of Cyprus Czech Republic Denmark Dominican Republic El Salvador Estonia Finland France Germany Greece Guatemala Honduras Hong Kong Hungary Indonesia Ireland Israel Italy Jamaica Japan Korea, South Kuwait Latvia Lithuania Malaysia Malta Mexico Netherlands New Zealand Norway Panama Philippines Poland Portugal Qatar Romania Russian Federation Saudi Arabia Singapore Slovakia Slovenia Spain",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin Postal Code, destination Postal Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Estimated sales tax Will usually ship within 1 business day of receiving cleared payment - opens in a new window or tab. Seller charges sales tax for items shipped to: MA (6.25%). Return policy Item must be returned within Refund will be given as 14 days after the buyer receives it Money Back The buyer",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}