{
    "relation": [
        [
            "Part #",
            "DISPLAY",
            "TC7116A",
            "SL9696-LRE",
            "SL4896-CRE",
            "SL9696-CRE"
        ],
        [
            "Distributor",
            "AmericanMicroSemi",
            "Microchip Technology, Inc.",
            "Automationdirect.com",
            "Automationdirect.com",
            "Automationdirect.com"
        ],
        [
            "Manufacturer",
            "AMS",
            "Microchip Technology, Inc.",
            "Not Provided",
            "Not Provided",
            "Not Provided"
        ],
        [
            "Product Category",
            "Digital ICs:Logic Gates:AND-OR:2-2-2-3 Input",
            "Not Provided",
            "Process Control & Measurement / Temperature -z- Process Controllers / 1-z-4 DIN Size (SL9696 Series)",
            "Process Control & Measurement / Temperature -z- Process Controllers / 1-z-8 DIN Size (SL4896 Series)",
            "Process Control & Measurement / Temperature -z- Process Controllers / 1-z-4 DIN Size (SL9696 Series)"
        ],
        [
            "Description",
            "display display pdf display datasheetdisplay is on sale at our online store for 8.855. Call 973-377-9566 100% Satisfaction Gauranteed. American Microsemiconductor Inc.FREE UPS ground shipping or more. Also get special discount on International order",
            "The TC7116A/TC7117A are 3-1/2 digit CMOS analog-to-digital converters (ADCs)containing all the active components necessary to construct a 0.05% resolution measurement system.Seven-segment decoders, polarity and digit drivers, voltage reference, and clock circuit are integrated on-chip.The TC7116A...",
            "SOLO single loop dual-output digital temperature controller, 1/4 DIN, with one 0-10V analog output, one 5A SPDT mechanical relay output (can be used as an alarm) and two 3A SPST alarm relays. Universal inputs include T/C, RTD and analog (0-5V, 0-10V, 0-20mA, 4-20mA, 0-50mV) plus a selectable event...",
            "SOLO single loop dual-output digital temperature controller, 1/8 DIN, with one 4-20mA analog output, one 5A SPDT mechanical relay output (or can be used as an alarm) and two 3A SPST alarm relays. Universal inputs include T/C, RTD and analog (0-5V, 0-10V, 0-20mA, 4-20mA, 0-50mV) plus a selectable...",
            "SOLO single loop dual-output digital temperature controller, 1/4 DIN, with one 4-20mA analog output, one 5A SPDT mechanical relay output (can be used as an alarm) and two 3A SPST alarm relays. Universal inputs include T/C, RTD and analog (0-5V, 0-10V, 0-20mA, 4-20mA, 0-50mV) plus a selectable event..."
        ]
    ],
    "pageTitle": "Digital Input Display | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/digital_input_display",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00268-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472826479,
    "recordOffset": 472788973,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{85550=Description: The HH800 and HH801 handhelds are easy to use Type K input thermocouple thermometers. Both feature a large 31/2 digit LCD with a maximum reading of 1999. The HH800 is a single-input model while the HH801 has two inputs and allows for display of T1, T2 or .T (T1-T2). Both models feature T/C offset, 92571=Description: is a complete rate monitoring system that combines accuracy and reliability in a rugged, compact housing. The AP1000 can take a variety of pulse inputs. The meter translates the input pulses to display RPM, or any specified user unit such as feet-per-minute, parts-per-hour, or gallons-per-minute}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> Conduct Research Top SID - Society For Information Display clarity and vividness. Two 1080p HDMI inputs that are compatible with the latest 1080p source content, provides plug and play connectivity for digital devices. And the black glossy finish and integrated ATSC and NTSC tuner ensure that MediaGauge Digital Pressure Gauges Family Overview , signal conditioning circuitry for temperature and calibration compensation, a stainless steel input pressure port and a LCD back lit display. The MediaGauge TM digital pressures gauges, are made of all laser-welded 304L stainless steel and have a 316L stainless steel convoluted diaphragm (excluding DL9700/DL9500 Series of Digital Mixed Signal Oscilloscope . This series is characterized by high-performance functions of waveform display and analysis with a high sampling rate and long memory in both analog/logic inputs, thus providing the best environment for analog/logic signal harmonized analysis of embedded systems. Implementing Digital Lock-In Amplifiers Using the dsPIC DSC integration of input devices through a messaging inter- and faster time to market, makes this realizable. The face. Applications created using the library will also find free Microchip graphics library makes it very easy to a simple and straightforward process to change display",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}