{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Evangelical Protestant",
            "Other",
            "Mainline Protestant",
            "Orthodox",
            "Black Protestant",
            "None"
        ],
        [
            "Adherents",
            "797,473",
            "345,893",
            "141,815",
            "76,574",
            "13,406",
            "2,424",
            "1,632,647"
        ],
        [
            "Congregations",
            "67",
            "894",
            "329",
            "202",
            "19",
            "8",
            "-"
        ]
    ],
    "pageTitle": "Dana Point, California (CA) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Dana-Point-California.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00166-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 366666903,
    "recordOffset": 366531832,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{120967=Zip codes: 92624, 92629, 92672, 92675., 7108=According to our research of California and other state lists there was 1 registered sex offender living in Dana Point, California as of August 02, 2015. The ratio of number of residents in Dana Point to the number of sex offenders is 34,048 to 1. The number of registered sex offenders compared to the number of residents in this city is a lot smaller than the state average.}",
    "TableContextTimeStampAfterTable": "{56192=1996 Presidential Elections Results, 56478=2000 Presidential Elections Results, 39692=Particulate Matter (PM10) [µg/m3] level in 2012 was 17.3. This is about average. Closest monitor was 10.7 miles away from the city center., 72665=4.82% of this county's 2011 resident taxpayers lived in other counties in 2010 ($56,017 average adjusted gross income), 53327=School Enrollment by Level of School (%) in 2013, 57050=2008 Presidential Elections Results, 36135=Air Quality Index (AQI) level in 2012 was 106. This is significantly worse than average., 74907=4.76% of this county's 2010 resident taxpayers moved to other counties in 2011 ($53,704 average adjusted gross income), 57620=Graphs represent county-level data. Detailed 2008 Election Results, 38992=Ozone [ppb] level in 2012 was 31.1. This is about average. Closest monitor was 10.7 miles away from the city center., 37514=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 7.73. This is about average. Closest monitor was 10.7 miles away from the city center., 36797=Carbon Monoxide (CO) [ppm] level in 2012 was 0.287. This is about average. Closest monitor was 7.2 miles away from the city center., 56764=2004 Presidential Elections Results, 57336=2012 Presidential Elections Results, 165528=Total of 773 patent applications in 2008-2015., 38242=Sulfur Dioxide (SO2) [ppb] level in 2012 was 0.0790. This is significantly better than average. Closest monitor was 10.7 miles away from the city center., 40442=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 10.8. This is about average. Closest monitor was 11.0 miles away from the city center., 52929=Educational Attainment (%) in 2013, 166877=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc.}",
    "textBeforeTable": "Religion statistics for Dana Point city (based on Orange County data) Three Arch Bay neighborhood Monarch Point neighborhood Monarch Beach neighborhood Lantern Village neighborhood Harbor (Dana Point Harbor) neighborhood Del Obispo (Del Obispo Area) neighborhood Dana Hills neighborhood Dana Point, California Neighborhood Map) Neighborhoods in Dana Point:( Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 530 Orange County: 1.78 / 10,000 pop. California: 2.14 / 10,000 pop. Number of supercenters and club stores: 18 This county: 0.06 / 10,000 pop. State: 0.04 / 10,000 pop. Number of convenience stores (no gas): 147 Orange County: 0.49 / 10,000 pop. California: 0.62 / 10,000 pop. Number of convenience stores (with gas): 434 Orange County: 1.46 / 10,000 pop. State: 1.49 / 10,000 pop. Number of full-service restaurants: 2,438 Here: 8.19 / 10,000 pop. State: 7.42 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}