{
    "relation": [
        [
            "Patent application number",
            "20090022635",
            "20130209318"
        ],
        [
            "Description",
            "High-performance cracker - A furnace for thermally cracking hydrocarbon process fluid is provided. The furnace comprises a convection section including a plurality of convection sub-sections, a radiant section comprising a plurality of radiant sub-sections, and an enclosure defining a plurality of discrete sectors. Each discrete sector of the enclosure includes a convection sub-section having at least one convection conduit for carrying hydrocarbon process fluid, at least one radiant sub-section having at least one radiant conduit connected to receive preheated hydrocarbon process fluid from the convection conduit, and a heat source configured to deliver heat into the discrete sector. Adjacent sectors of the furnace are segregated from each other, such that the heat delivered from the heat source is substantially localized in the discrete sector of the enclosure.",
            "STEAM REFORMER TUBE ASSEMBLY AND METHOD OF ASSEMBLING OR RETROFITTING SAME - A steam reformer tube assembly includes a reformer tube including a wall defining an interior space for receiving fluid delivered into the reformer tube, a plug at least partially positioned in an opening in the interior space such that a gap is defined between the plug and the wall of the reformer tube, and a sealing member positioned in the gap to either limit or prevent the passage of fluid toward the opening in the interior space of the reformer tube and along the gap that is defined between the exterior surface of the plug and the interior wall of the reformer tube. A method of assembling a steam reformer tube assembly is also provided."
        ],
        [
            "Published",
            "01-22-2009",
            "08-15-2013"
        ]
    ],
    "pageTitle": "Garland, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/garland-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 431552475,
    "recordOffset": 431520983,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "John R. Garland, Hatfield, PA US 06-17-2010 Method and apparatus for transferring heat to or from an organ or tissue container - An organ perfusion apparatus and method monitor, sustain and/or restore viability of organs and preserve organs for storage and/or transport. Other apparatus include an organ transporter, an organ cassette and an organ diagnostic device. The apparatus and methods include the cassette and transporter with heat transfer surfaces arranged to transfer heat between a cooling source in said transporter and the heat transfer surfaces of the cassette. 20100151559 Published Description Patent application number Jeffrey C. Garland, Littleton, CO US 01-08-2015 SYSTEM FOR MOUNTING CAMERA EQUIPMENT - This disclosure describes a modular bridging structure and a system for using that structure. The bridging structure has a channel configured to receive a portion of an elongate rail, the channel being configured to receive the elongate rail substantially perpendicularly to a longitudinal axis of the modular bridging structure, and a rail fastener securing the received rail within the channel. Additionally, the modular bridging structure has a leg receiver configured to receive an elongate leg section such that the leg section is attached through a bottom side of the modular bridging structure. There is a leg fastener that secures the received leg section to the modular bridging structure such that the securing point of the fastener is adjustable along a plurality of points along each leg section. 20150009476",
    "textAfterTable": "Karry Lee Garland, Bean Station, TN US Patent application number Description Published 20090211607 Compact system and method for cleaning a window or another smooth surface - A cleaning system and method for cleaning window glass or another smooth surface utilizes a first reservoir, a second reservoir, a first battery-operated pump for delivering liquid medium from the first reservoir onto the surface to be cleaned and a second battery-operated pump for drawing spent liquid medium from the surface for transport to the second reservoir. A hand-held wand includes a head having a first face through which the liquid medium is dispensed onto the surface and a second face through which spent liquid medium is drawn from the surface. In addition, a switch is mounted on the wand which permits the user to selectively dispense the liquid medium through the wand or draw the spent liquid medium from the surface, and the reservoirs and pumps are mounted upon a backpack frame enabling these components of the system to be carried upon the back of a user. 08-27-2009 Kent Garland, Salt Lake City, UT US Patent application number Description Published 20100214118 SYSTEM AND METHOD FOR TRACKING A PERSON - A system and method for tracking a person using a deduced reckoning device is disclosed. The method includes the operation of selecting an initial location of the person. The person's movement along a path",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}