{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Pretty good. There are designated smoking areas though.",
            "None.",
            "Many sports except and official football team.",
            "Transfer students. Get your associates degree and transfer to another school.",
            "There is the No Cash Clothing Stash, where you can donate old cloths and pick up 5 items a day for free.",
            "This is the only school I've attended, but I think I'm getting my moneys worth.",
            "Go to baseball games and track meets. Attend dance and arts performances.",
            "Most of their food is pretty expensive. They have a lot of variety.",
            "They don't provide dorms at this school.",
            "It depends on the student. But I've gone full term for 3 terms, and half time for one.",
            "Register for FAFSA and classes as early as possible!",
            "Great financial aid and enrollment servies. Large variety of classes. Helpful and encouraging teachers."
        ]
    ],
    "pageTitle": "Lane Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Lane-Community-College/reviews?_escaped_fragment_=/show/70965",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00272-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890809511,
    "recordOffset": 890743002,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9599=adda – american draft & design assn. apisu asian - pacific island student union aslcc student government meeting bsu – black student union council of clubs returns on april 19th feminists for action club geology green chemistry club jazz club lane student democrats (lsd) lanestock (council sub-committee) lasa – lane arts student association lcc dance club (lccdc) lcc smokers club (clean-up crew) lcc xyz (formerly qsa) learning garden club lsu – latino student union nasa – native american student assn. ospirg phi theta kappa, sigma zeta chapter spa – student productions association sustainable living skills council/club table tennis club veterans club of lcc, 298473=They make amazing sushi to order in the caffeteria, as well as bento boxes. They are doing a $35,000,000 remodel to the center building in 2014 which will include the caffeteria. It will have all sorts of stations like Pan Asia, American Grill, Hispanic food, Indian food etc. I am very impressed with the plans I have seen., 115735=Campus will be 100% smoke free for the 2012/2013 school year., 137002=After going to school in the 80's and not going to college until 2011 everything was new and difficult for me , but with counseling and help I am on track and doing well!, 382215=© 2015, Cappex.com, LLC, 17352=Like most community colleges, LCC is a great value for the price, at an average of right around $1300 per term, including books it feels like a great value. This price covers 4 classes., 145554=The college does not currently offer any form of student housing, but will be opening deluxe student apartments for exorbitant prices at the beginning of the Fall 2012 term.}",
    "textBeforeTable": "12/16/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 93 Alicia from Springfield, OR Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Am learning a lot I have been able to learn how to become a better parent at Lane by taking a few courses on early childhood education. I have also learned how to become a better writer and have been able to win one award for my high school because of the great writing teachers. I got third place and $300 because of it. Login to rate or flag the reviews Julie from Eugene, OR 01/26/2012 Reviewer is A current student here. 4 out of 4 people found this review useful. 3 of 93 Categories Comments Campus Safety great security on campus....watch out for cougars and bears though! we're surrounding by the great outdoors! Clubs and Activities adda – american draft & design assn. apisu asian - pacific island student union aslcc student government meeting bsu – black student union council of clubs returns on april 19th feminists for action club geology",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}