{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2007-06-11T00:00:00",
            "2011-04-01T00:00:00",
            "2011-06-30T00:00:00"
        ],
        [
            "Description",
            "LIDAR data was collected using Merrick's ALS50 Phase 2 sensor. The raw data was verified in MARS software for complete coverage of the project area, and bore sighted to align the flight lines. Raw data files were parsed into manageable client-specific tiles. These tiles were then processed through automated filtering that separates the data into different classification groups: error points, ground points, and canopy/building points. The data was next taken into a graphic environment to reclassify the erroneous points that may remain in the LIDAR point cloud after auto filter.",
            "The NOAA Coastal Services Center (CSC) received the lidar files in las format. The files contained lidar intensity and elevation measurements. CSC performed the following processing for data storage and Digital Coast provisioning purposes: 1. Data converted from UTM coordinates to geographic coordinates. 2. Data converted from NAVD88 heights to ellipsoid heights using GEOID03. 3. The LAS data were sorted by latitude and the headers were updated.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/20071114_NWFWMD_Holmes_m576.xml&view=ISO19115Components-HTMLTable",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00180-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 609053066,
    "recordOffset": 609044864,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:20071114_NWFWMD_Holmes_m576Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Component Title Date Citation Identifier 1 2007 Northwest Florida Water Management District (NWFWMD)Lidar: Holmes County 2011-04-01 1 Ground Control 2007-03-17 2 None 1 North American Datum 1983 2007-01-19 1 none Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 NOAA CSC (originator) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}