{
    "relation": [
        [
            "Lender",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Balance",
            "$ .00",
            "$ .00",
            "$ .00",
            "$ .00",
            "$ .00",
            "$ .00",
            "$ .00",
            "$ .00"
        ],
        [
            "Monthly Payment",
            "$ .00",
            "$ .00",
            "$ .00",
            "$ .00",
            "$ .00",
            "$ .00",
            "$ .00",
            "$ .00"
        ]
    ],
    "pageTitle": "Leatherstocking Region Federal Credit Union -- Secure Mortgage Application",
    "title": "",
    "url": "https://www5.homecu.net/fi/lsrfcu/mrtgappfrm.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00147-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 928487402,
    "recordOffset": 928471008,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Mon, 16 Sep 2013 15:06:51 GMT",
    "textBeforeTable": "Debt Information   Other Asset: Other Asset: Year: Make: Model: Auto: Locations: Value: Real Estate: Savings/Checking balance: $ .00 Other Income: Note: Alimony, child support or separate maintenance income need not be revealed if you do not wish to have it considered as a basis for repaying this obligation. $ .00 Gross monthly pay: Income & Asset Information   $ .00 Monthly Salary: Source of other income: Note: Alimony, child support or separate maintenance income need not be revealed if you do not wish to have it considered as a basis for repaying this obligation. How long employed: $ .00 Monthly Salary:",
    "textAfterTable": "  Property Information Property address? Street: City: State: Zip: Alabama Alaska Arkansas California Colorado Connecticut District of Columbia Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming Annual Property Taxes: Annual condo/PUD fees: Annual Hazard Insurance:   Declarations If you answer \"Yes\" to any questions 1 through",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}