{
    "relation": [
        [
            "Category",
            "Example",
            "Syntax",
            "Default"
        ],
        [
            "Value",
            "SSLCipherSuite ALL:!LOW:!DH In this example, all ciphers are specified except low strength ciphers and those using the Diffie-Hellman key negotiation algorithm.",
            "SSLCipherSuite cipher-spec",
            "ALL:!ADH:!EXPORT56:+HIGH:+MEDIUM:+LOW:+SSLv2:+EXP"
        ]
    ],
    "pageTitle": "OHS Module Directives",
    "title": "",
    "url": "http://docs.oracle.com/cd/E28280_01/web.1111/e10144/directives.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 80298223,
    "recordOffset": 80248819,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{192584=01033 — ORACLE initialization or shutdown in progress, 275146=Sets the type of logging performed for debugging operations. The debugging information is written to the /tmp/wlproxy.log file on UNIX systems and c:\\TEMP\\wlproxy.log on Windows NT/2000 systems., 231742=1000, 180870=PlsqlBindBucketWidths 2000, 193129=01091 — failure during startup force, 181146=32,128,1450,2048,4000, 255035=To define weekly frequency, the days of the week, (Sunday, Monday, Tuesday, Wednesday, Thursday, Friday, Saturday) are used. For example, Wednesday 15:30 causes the cleanup to happen every Wednesday at 3:30 p.m. (local time)., 193547=12570 — TNS: packet reader failure, 254784=To define daily frequency, the keyword Everyday is used. The cleanup starts every day at the time defined. For example, Everyday 2:00 causes the cleanup to happen everyday at 2:00 a.m. (local time)., 192840=01077 — background process initialization failure, 193621=12571 — TNS: packet writer failure, 193205=01092 — ORACLE instance terminated. Disconnection forced, 304456=PathPrepend http://myHost:1234/myPath/myfile;, 266847=PlsqlCacheTotalSize 20971520, 256669=PlsqlCacheCleanupTime Monday 20:00, 256970=Saturday 23:00, 177805=After the higher configured value, mod_plsql starts auto-generating bucket sizes of larger values by doubling the last value, as needed. Therefore, after 400, the next bucket value becomes 800, then 1600, and so on., 193032=01090 — shutdown in progress- connection is not permitted, 192677=01034 — ORACLE not available, 287506=Specifies whether or not file caching is enabled. When set to ON, and the size of the POST data in a request is greater than 2048 bytes, the POST data is first read into a temporary file on disk and then forwarded to the WebLogic Server in chunks of 8192 bytes. This preserves the POST data during failover, allowing all necessary data to be repeated to the secondary if the primary goes down., 316887=WebLogicPort 1234, 288321=When set to OFF and the size of the POST data in a request is greater than 2048 bytes, the reading of the POST data is postponed until a WebLogic Server cluster member is identified to serve the request. Then the plug-in reads and immediately sends the POST data to the WebLogic Server in chunks of 8192 bytes., 192745=01041 — internal error. hostdef extension doesn't exist, 267129=20971520 (bytes), 225077=By default, the mod_plsql module attempts to fetch 200 response lines of output where each line is of 255 bytes. In situations where the response bytes are single-bytes, the response buffer is populated to the maximum and can pack 255*200=51000 bytes for each round trip. For responses containing multi-byte data, the byte packing for each row could be less than ideal resulting in lesser bytes getting transferred for each round trip. If your application generates large pages frequently and the response does not fit in one round trip, then consider setting this parameter higher. The memory usage for the mod_plsql module will increase., 255391=To define monthly frequency, the keyword Everymonth is used. The cleanup starts on the Saturday of the month at the time defined. For example, Saturday Everymonth 23:00 causes the cleanup to happen the first Saturday of every month at 11:00 p.m. (local time)., 192509=01014 — ORACLE shutdown in progress, 101193=The expression must match the following syntax (given as a BNF grammar notation):, 192929=01089 — immediate shutdown in progress- no operations permitted, 288866=Finally, regardless of how FileCaching is set, if the size of the POST data is 2048 bytes or less the plug-in will read the data into memory and use it if needed during failover to repeat to the secondary., 331104=WLLocalIP 1001.1111.1234.4567, 147146=Expires: Thu, 01 Jan 1970 12:00:00 GMT}",
    "lastModified": "Wed, 14 Jan 2015 14:06:47 GMT",
    "textBeforeTable": "Tags are joined together with prefixes to form a cipher specification string. Cipher suite tags are listed in Table E-1 and Table E-2. ! : Remove the cipher from the list permanently - : Remove the cipher from the list (can be added later) + : Adds the cipher to the list and place it in the correct location in the list none: Adds the cipher to the list Specifies the SSL cipher suite that the client can use during the SSL handshake. This directive uses a colon-separated cipher specification string to identify the cipher suite. Table 11–2 shows the tags you can use in the string to describe the cipher suite you want. SSLCipherSuite accepts the following values: E.4.4 SSLCipherSuite None Default SSLCARevocationPath /ORACLE_HOME/Apache/Apache/conf/ssl.crl/ Example SSLCARevocationPath path/to/CRL_directory/ Syntax Value Category Specifies the directory where PEM-encoded Certificate Revocation Lists (CRLs) are stored. These CRLs come from the CAs (Certificate Authorities) that you accept certificates from.",
    "textAfterTable": "Table E-1 SSLCipher Suite Tags Function Tag Meaning Key exchange kRSA RSA key exchange Key exchange kDHr Diffie-Hellman key exchange with RSA key Authentication aNULL No authentication Authentication aRSA RSA authentication Authentication aDH Diffie-Hellman authentication Encryption eNULL No encryption Encryption DES DES encoding Encryption 3DES Triple DES encoding Encryption RC4 RC4",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}