{
    "relation": [
        [
            "Patent application number",
            "20090035876",
            "20090130771",
            "20100015728",
            "20110053289",
            "20130309778",
            "20140017709"
        ],
        [
            "Description",
            "Electrochemical Assay - A method of determining the presence or amount of analyte in a fluid sample, which comprises: contacting a fluid sample with a binding reagent that comprises a plurality of cleavable species and wherein said species, when cleaved, are detectable using electrochemical means; separating any binding reagent-analyte complex that forms from the unbound binding reagent; cleaving the cleavable species from the immobilized binding reagent-analyte complex; and detecting the cleaved species using electrochemical means.",
            "Assay device and method - An assay device includes a first reagent including a magnetic particle and a second reagent including detectable component. The first and second reagent can each independently bind to an analyte in a sample. Applying a magnetic field can selectively concentrate the detectable component in a detection zone, where a detectable change ca be measured and related to the amount of analyte in the sample.",
            "Assay Device and Method - A method for detecting an analyte can include binding an analyte with a first reagent which is associated with a magnetic particle, allowing analyte to interact with an excess amount of a second reagent capable of interacting with the analyte, and magnetically separating a portion of analyte-bound second reagent from excess second reagent. After the magnetic separation, the interaction of the analyte and the second reagent can be disrupted to produce a detectable form of the second reagent, which can be detected. A device and system suited to performing the method are also described.",
            "Assay Device and Method - An assay method and device can perform at least one (e.g., at least two) assays on a single aliquot of a sample liquid. The device can mix a sample liquid with assay reagents including magnetically susceptible particles. The device is configured to create a sample liquid-air interface with the sample liquid. The magnetically susceptible particles can be located (via an applied magnetic field) at the liquid-air interface when a second liquid contacts the interface to form a liquid-liquid interface. The magnetic particles travel across the liquid-liquid interface to the second liquid. The magnetically susceptible particles are configured to trans-port an analyte across the interface into the second liquid. An assay for the analyte is performed in the second liquid. An assay for another analyte can also be performed in the sample liquid.",
            "ASSAY DEVICE AND READER - The present invention relates to a microfluidic based assay system, comprising a disposable assay cartridge and associated reading device, as well as the individual components themselves. The present invention also relates to methods of conducting assays, using the cartridge and device of the invention, as well as kits for conducting assays.",
            "MICROFLUIDICS BASED ASSAY DEVICE - A subtractive corrective assay device and methodology, whereby ail required binding and label detection reagents are initially located within the detection zone. Application of a magnetic field is used to selectively remove bound label from the detection zone by means of paramagnetic particles. The relationship between measured label concentration before and after the application of a magnetic field within the detection zone is used to accurately measure analyte concentration within the sample."
        ],
        [
            "Published",
            "02-05-2009",
            "05-21-2009",
            "01-21-2010",
            "03-03-2011",
            "11-21-2013",
            "01-16-2014"
        ]
    ],
    "pageTitle": "Lowe, GB - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/lowe-gb-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00161-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441789966,
    "recordOffset": 441773572,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Phillip Lowe, Tullibody GB 01-13-2011 ASSAY DEVICE AND METHOD - An assay method and device can perform at least one (e.g., at least two) assays on a single aliquot of a sample liquid. The device can mix a sample liquid with assay reagents including magnetically susceptible particles. The device is configured to create a sample liquid-air interface with the sample liquid. The magnetically susceptible particles can be located (via an applied magnetic field) at the liquid-air interface when a second liquid contacts the interface to form a liquid-liquid interface. The magnetic particles travel across the liquid:liquid interface to the second liquid. The magnetically susceptible particles are configured to transport an analyte across the interface into the second liquid. An assay for the analyte is performed in the second liquid. An assay for another analyte can also be performed in the sample liquid. 20110008813 Published Description Patent application number Phillip Lowe, North Wood GB 02-19-2015 COMPOSITIONS FOR TREATMENT OF SKIN DISORDERS - Compositions are provided comprising: (i) chlorhexidine or a pharmaceutically acceptable salt thereof; (ii) niacinamide or niacin; and (iii) salicylic acid or a pharmaceutically acceptable salt or derivative thereof. The compositions are suitable for use in treating and preventing disorders of the skin. The compositions are also provided in the form of cosmetic products. 20150050342 Published Description Patent application number Philippa Lowe, London GB 04-14-2011",
    "textAfterTable": "Patent applications by Phillip Lowe, Tullibody GB Thomas Lowe, Oxford GB Patent application number Description Published 20100134501 DEFINING AN ANIMATION OF A VIRTUAL OBJECT WITHIN A VIRTUAL WORLD - A method of defining an animation of a virtual object within a virtual world, wherein the animation comprises performing, at each of a series of time points, an update that updates values for object attributes of the virtual object, the method comprising: allowing a user to define the update by specifying, on a user interface, a structure representing the update, wherein the structure comprises a plurality of items and one or more connections between respective items, wherein each item represents a respective operation that may be performed when performing the update and wherein a connection between two items represents that data output by the operation represented by one of those two items is input to the operation represented by the other of those two items; allowing the user to specify that the structure comprises one or more items in a predetermined category, the predetermined category being associated with a predetermined process such that an item belongs to the predetermined category if performing the respective operation represented by that item requires execution of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}