{
    "relation": [
        [
            "Feature Name",
            "BFD Control Channel over VCCV—Support for ATM Pseudowire",
            "BFD Echo Mode",
            "BFD—BFD Hardware Offload Support",
            "BFD IPv6 Encapsulation Support",
            "BFD Multihop",
            "BFD—Static Route Support",
            "BFD Support for IP Tunnel (GRE, with IP address)",
            "BFD Support over Port Channel",
            "BFD—VRF Support",
            "BFD—WAN Interface Support",
            "Bidirectional Forwarding Detection (standard implementation, Version 1)",
            "HSRP Support for BFD",
            "IS-IS Support for BFD over IPv4",
            "OSPF Support for BFD over IPv4",
            "SSO—BFD",
            "SSO—BFD (Admin Down)"
        ],
        [
            "Releases",
            "15.0(1)S",
            "12.2(33)SRB 12.4(9)T 15.0(1)S",
            "15.1(2)S 15.1(1)SG",
            "Cisco IOS XE Release 3.11S",
            "15.1(3)S 15.4(1)S",
            "12.2(33)SRC 15.0(1)M 15.0(1)S 15.0(1)SY 15.1(2)S 15.1(1)SG 15.4(1)S",
            "15.1(1)SY",
            "15.1(1)SY 15.1(2)SY",
            "12.2(33)SRC 15.0(1)M 15.0(1)S 15.1(1)SY",
            "12.2(33)SRC 15.0(1)M 15.0(1)S",
            "12.0(31)S 12.0(32)S 12.2(33)SRB 12.2(33)SRC 12.2(18)SXE 12.2(33)SXH 12.4(9)T 12.4(11)T 12.4(15)T 15.0(1)S 15.4(1)S",
            "12.2(33)SRC 12.4(11)T 12.4(15)T",
            "12.0(31)S 12.2(18)SXE 12.2(33)SRA 12.4(4)T 15.0(1)S 15.4(1)S",
            "12.0(31)S 12.2(18)SXE 12.2(33)SRA 12.4(4)T 15.0(1)S 15.1(1)SG",
            "12.2(33)SRE 12.2(33)SXI2 12.2(33)XNE 15.0(1)S 15.1(1)SG",
            "12.2(33)SRC 15.0(1)S"
        ],
        [
            "Feature Information",
            "VCCV provides a control channel that is associated with an ATM pseudowire to perform operations and management functions over the pseudowire. BFD uses the VCCV control channel to detect dataplane failures for pseudowires. In Cisco IOS Release 15.0(1)S the BFD control channel over VCCV Support for ATM Pseudowire feature is supported for VCCV type-1 (without an IP/UDP header) only. The following commands were introduced or modified by this feature: bfd-template, debug mpls l2transport vc vccv, interval(BFD), vccv, vccv bfd template, vccv bfd status signaling.",
            "BFD echo mode works with asynchronous BFD. Echo packets are sent by the forwarding engine and forwarded back along the same path in order to perform detection--the BFD session at the other end does not participate in the actual forwarding of the echo packets. The echo function and the forwarding engine are responsible for the detection process, therefore the number of BFD control packets that are sent out between two BFD neighbors is reduced. And since the forwarding engine is testing the forwarding path on the remote (neighbor) system without involving the remote system, there is an opportunity to improve the interpacket delay variance, thereby achieving quicker failure detection times than when using BFD Version 0 with BFD control packets for the BFD session.",
            "This feature supports offloading BFD sessions to ES+ line cards on Cisco 7600 series routers. The following command was introduced or modified: show bfd neighbors .",
            "This feature extends IPv6 support for BFD. The following command was introduced or modified: bfd interval",
            "This feature supports multihop BFD for IPv4 and IPv6 addresses. In Cisco IOS Release 15.4(1)S, support was added for the Cisco ASR 901S Series Routers. The following commands were introduced or modified: authentication, bfd map, bfd-template, interval, show bfd neighbors, show bfd neighbor drops.",
            "Unlike dynamic routing protocols, such as OSPF and BGP, static routing has no method of peer discovery. Therefore, when BFD is configured, the reachability of the gateway is completely dependent on the state of the BFD session to the specified neighbor. Unless the BFD session is up, the gateway for the static route is considered unreachable, and therefore the affected routes will not be installed in the appropriate RIB. A single BFD session can be used by an IPv4 static client to track the reachability of next hops through a specific interface. A BFD group can be assigned for a set of BFD-tracked static routes. In Cisco IOS Release 15.4(1)S, support was added for the Cisco ASR 901S Series Routers. The following commands were introduced or modified: ip route static bfd and show ip static route bfd.",
            "This feature supports BFD forwarding on point-to-point IPv4, IPv6, and GRE tunnels. The following commands were introduced or modified: bfd .",
            "This feature supports configuring BFD timers on port channel interface. The following commands were introduced or modified: bfd .",
            "The BFD feature support is extended to be VPN Routing and Forwarding (VRF) aware to provide fast detection of routing protocol failures between provider edge (PE) and customer edge (CE) devices.",
            "The BFD feature is supported on nonbroadcast media interfaces including ATM, POS, serial, and VLAN interfaces. BFD support also extends to ATM, FR, POS, and serial subinterfaces. The bfd interval command must be configured on the interface to initiate BFD monitoring.",
            "This document describes how to enable the Bidirectional Forwarding Detection (BFD) protocol. BFD is a detection protocol designed to provide fast forwarding path failure detection times for all media types, encapsulations, topologies, and routing protocols. In addition to fast forwarding path failure detection, BFD provides a consistent failure detection method for network administrators. Because the network administrator can use BFD to detect forwarding path failures at a uniform rate, rather than the variable rates for different routing protocol hello mechanisms, network profiling and planning will be easier, and reconvergence time will be consistent and predictable. In Release 12.0(31)S, support was added for the Cisco 12000 series Internet router. In Release 12.0(32)S, support was added for the Cisco 10720 Internet router and IP Services Engine (Engine 3) and Engine 5 shared port adapters (SPAs) and SPA interface processors (SIPs) on the Cisco 12000 series Internet router. In Cisco IOS Release 15.4(1)S, support was added for the Cisco ASR 901S Series Routers.",
            "In Release 12.4(11)T, support for HSRP was added. In Release 12.4(15)T, BFD is supported on the Integrated Services Router (ISR) family of Cisco routers, for example, the Cisco 3800 ISR series routers. In Release 12.2(33)SRC, the number of BFD sessions that can be created has been increased, BFD support has been extended to ATM, FR, POS, and serial subinterfaces, the BFD feature has been extended to be VRF-aware, BFD sessions are placed in an “Admin Down” state during a planned switchover, and BFD support has been extended to static routing.",
            "BFD support for OSPF can be configured globally on all interfaces or configured selectively on one or more interfaces. When BFD support is configured with IS-IS as a registered protocol with BFD, IS-IS receives forwarding path detection failure messages from BFD. In Cisco IOS Release 15.4(1)S, support was added for the Cisco ASR 901S Series Routers.",
            "BFD support for OSPF can be configured globally on all interfaces or configured selectively on one or more interfaces. When BFD support is configured with OSPF as a registered protocol with BFD, OSPF receives forwarding path detection failure messages from BFD.",
            "Network deployments that use dual RP routers and switches have a graceful restart mechanism to protect forwarding states across a switchover. This feature enables BFD to maintain sessions in a up state across switchovers.",
            "To support SSO, BFD sessions are placed in an “Admin Down” state during a planned switchover. The BFD configuration is synched from the active to standby processor, and all BFD clients re-register with the BFD process on the standby processor."
        ]
    ],
    "pageTitle": "IP Routing: BFD Configuration Guide, Cisco IOS Release 15M&T - Bidirectional Forwarding Detection [Cisco IOS 15.4M&T] - Cisco",
    "title": "Table 1 Feature Information for Bidirectional Forwarding Detection",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/iproute_bfd/configuration/15-mt/irb-15-mt-book/irb-bi-fwd-det.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 369298279,
    "recordOffset": 369257941,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10056=A maximum 100 sessions per line card are supported for the distributed Cisco 12000 series Internet router. The minimum hello interval is 50 ms with up to three Max retries for a BFD control packet to be received from a remote system before a session with a neighbor is declared down., 10551=On the Cisco 12000 series router, asymmetrical routing between peer devices may cause a BFD control packet to be received on a line card other than the line card that initiated the session. In this special case, the BFD session between the routing peers will not be established., 20660=With CSCts32440, the maximum number of supported VRF-aware IS-IS BFD sessions is 28.}",
    "TableContextTimeStampAfterTable": "{152301=In the following example, a BFD session to 209.165.200.226 through Ethernet interface 0/0.1001 is marked to use the group testgroup. That is, this configuration is a passive static BFD. Though there are static routes to be tracked by the second static BFD configuration, a BFD session is not triggered for 209.165.200.226 through Ethernet interface 0/0.1001. The existence of the prefixes 10.1.1.1/8 and 10.2.2.2/8 is controlled by the active static BFD session (Ethernet interface 0/0 209.165.200.225)., 181303=In Release 12.0(32)S, support was added for the Cisco 10720 Internet router and IP Services Engine (Engine 3) and Engine 5 shared port adapters (SPAs) and SPA interface processors (SIPs) on the Cisco 12000 series Internet router., 92926=Connects you to a specific line card for the purpose of executing monitoring and maintenance commands on the specified line card. Slot numbers range from 0 to 11 for the Cisco 12012 and from 0 to 7 for the Cisco 12008., 166408=Bidirectional Forwarding Detection, February 2009, 85497=In order to see the full output of the show bfd neighbors details command on a Cisco 12000 series router, you must enter the command on the line card. Enter the attach slot-number command to establish a CLI session with a line card. The registered protocols are not shown in the output of the show bfd neighbors details command when it is entered on a line card., 166775=BFD for IPv4 and IPv6 (Single Hop), February 2009, 88396=To monitor or troubleshoot BFD on Cisco 12000 series routers, perform one or more of the steps in this section., 181210=In Release 12.0(31)S, support was added for the Cisco 12000 series Internet router., 93811=In order to display the full output of the show bfd neighbors details command on a Cisco 12000 series router, you must enter the command on the line card. Enter the attach slot-number command to establish a CLI session with a line card.}",
    "textBeforeTable": "Related Documents Additional References encapsulation aal5snap pvc 0/100 no snmp trap link-status ip address 10.25.1.2 255.255.255.0 interface ATM 4/0.2 point-to-point  CE2    ! xconnect 10.0.0.7 102 pw-class vccv-bfd1 pvc 0/100 l2transport no atm enable-ilmi-trap no atm ilmi-keepalive atm asynchronous no ip address interface ATM 2/0 vccv bfd status signaling vccv bfd template nsn raw-bfd encapsulation mpls pseudowire-class vccv-bfd1 ! interval min-tx 500 min-rx 500 multiplier 3 bfd-template single-hop nsn ip address 10.54.0.1 255.255.255.255 interface Loopback 0  T-PE2    xconnect 10.0.0.7 100 pw-class vccv-bfd1 pvc 0/100 l2transport no atm enable-ilmi-trap no atm ilmi-keepalive atm clock INTERNAL atm asynchronous no ip address description connect mfr4 atm0/0 interface ATM 9/0/0 vccv bfd status signaling vccv bfd template nsn raw-bfd encapsulation mpls pseudowire-class vccv-bfd1 interval min-tx 500 min-rx 500 multiplier 3 bfd-template single-hop nsn ip address 10.0.0.6 255.255.255.255 interface Loopback 0  T-PE1    encapsulation aal5snap pvc 0/100 no atm enable-ilmi-trap no ip directed-broadcast ip address 10.25.1.1 255.255.255.0 interface ATM 0/0.2 point-to-point ! no atm ilmi-keepalive no atm enable-ilmi-trap atm sonet stm-1 atm clock INTERNAL no ip directed-broadcast no ip address description connect to mfi6 atm9/0/0 interface ATM 0/0  CE1",
    "textAfterTable": "Bidirectional Forwarding Detection, February 2009 (http://tools.ietf.org/html/draft-ietf-bfd-base-09) IETF Draft BFD for IPv4 and IPv6 (Single Hop), February 2009 (http://tools.ietf.org/html/draft-ietf-bfd-v4v6-1hop-09 Technical Assistance Description Link The Cisco Support and Documentation website provides online resources to download documentation, software, and tools. Use these resources to install and configure the software and to troubleshoot and resolve technical issues with Cisco products and technologies. Access to most tools on the Cisco Support and Documentation website requires a Cisco.com user ID and password. http:/​/​www.cisco.com/​cisco/​web/​support/​index.html Feature Information for Bidirectional Forwarding Detection The following table provides release information about the feature or features described in this module. This table lists only the software release that introduced support for a given feature in a given software release train. Unless noted otherwise, subsequent releases of that software release train also support that",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}