{
    "relation": [
        [
            "Name of Internal Audit",
            "Audit of the Values and Ethics Framework",
            "Audit of the IT Dependency",
            "Audit of the IT Planning and Development",
            "Audit of the Data and Systems Security",
            "Audit of the Monitoring of access to controlled goods pursuant to ITAR enforcement",
            "Audit of the Proactive Disclosure process",
            "Audit of the Management Framework of the Official Languages practices",
            "Audit of the Test Facilities Management",
            "Audit of Records Management",
            "Audit of Contracting and acquisitions practices",
            "Audit of Skills Management",
            "Audit of Personnel Retention Programs",
            "Audit of Business Case for Major Investments",
            "Audit of Real Property Life Cycle Management",
            "Audit of Strategic Planning, Business Plans, Monitoring and Review of Priorities"
        ],
        [
            "Type",
            "Management Framework",
            "Management Framework",
            "Management Framework",
            "Management Framework",
            "Management Framework",
            "Management Framework",
            "Management Framework",
            "Management Framework",
            "Management Framework",
            "Management Framework",
            "Management Framework",
            "Management Framework",
            "Horizontal Audit",
            "Horizontal Audit",
            "Management Framework"
        ],
        [
            "Status",
            "In progress",
            "In progress",
            "In progress",
            "In progress",
            "Projected",
            "In progress",
            "Projected",
            "Projected",
            "Projected",
            "Projected",
            "Projected",
            "Projected",
            "Projected",
            "Projected",
            "Projected"
        ],
        [
            "Completion Date",
            "2010-03-31",
            "2010-03-31",
            "2010-03-31",
            "2010-03-31",
            "2010-03-31",
            "2010-03-31",
            "2010-03-31",
            "2010-03-31",
            "2011-03-31",
            "2011-03-31",
            "2011-03-31",
            "2011-03-31",
            "2011-03-31",
            "2011-03-31",
            "2011-03-31"
        ],
        [
            "Electronic Link to Report",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A"
        ]
    ],
    "pageTitle": "ARCHIVED - 2010-2011 RPPs - Upcoming Internal Audits and Evaluations over the next three fiscal years",
    "title": "Audits",
    "url": "http://www.tbs-sct.gc.ca/rpp/2010-2011/info/ia-vi-eng.asp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00220-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 725577847,
    "recordOffset": 725505039,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{8158=Home  > Expenditure Management  > Reports on Plans and Priorities  > 2010-11}",
    "TableContextTimeStampAfterTable": "{608103=The following audits were included in the Risk-Based Audit Plan 2009\u009612 approved in June 2009. An annual review and update on planned audit engagements may result in modification to audit engagements conducted., 293050=The following table lists all planned upcoming audits for the reporting period 2010-11 that pertain to the Department's work., 352654=HRSDC's annual planning cycle is based on risk. At this time, the Risk-Based Internal Audit Plan for 2010-2013 is being developed, with approval anticipated in early 2010-2011., 121957=Canada's Participation in 2010 Shanghai Program, 605222=Departmental Evaluation Services plans to conduct the following evaluations in 2012-2013:, 620294=Audit and Evaluation Division Evaluation commitments April 1, 2010 to March 31, 2013., 536486=The PSC's Policy on Evaluation, 2009 was approved in June 2009 and reflects the priorities of the PSC and changes made to the TBS Policy on Evaluation, 2009 as it pertains to the PSC. The rolling Risk-based PSC 5-Year Evaluation Plan 2009-2014 was recently updated to take into consideration emerging issues and priorities and to show progress towards increased evaluation coverage. The approved Plan is strategically integrated into the PSC's overall management activities and supports decision-making with the generation of strategically focused, objective and evidence-based information about the performance of the policies, programs and initiatives of the PSC as an organization. We assess risk regularly as part of our annual planning process., 601917=Departmental Evaluation Services plans to conduct the following evaluations in 2011-2012:, 614353=Internal Audit commitments April 1, 2010 to March 31, 2013*, 129263=This evaluation list is based on the present July 2009 approved 2009-2010 to 2013-2014 risk-based, rolling multi-year evaluation plan. The plan is revised annually based on departmental needs and emerging priorities. As such, the content of this list could evolve and be subject to change., 172027=Dec 2010, 126649=2013, 153454=The creation of CanNor raises the requirement for a key part of the Agency's internal audit function to be undertaken jointly with the Office of the Comptroller General (OCG) as part of small departments and agencies arrangements under Treasury Board Secretariat's Policy on Internal Audit. Preliminary contacts have commenced with the OCG to expedite this process with a view to implementation in 2010\u00962011. In parallel, supplementary activities will develop a detailed corporate risk profile for the Agency for assessing where supplementary audit projects should be undertaken by the Agency in-house, outside OCG sector-wide audit activities., 555505=Note: As per the TBS Policy on Evaluation (April 2009), the RCMP is currently in the process of developing a five-year rolling plan designed to cover 100% of direct spending. It is anticipated that this plan will be presented to the Commissioner's Evaluation Committee (CEC) for approval in June 2010 and subsequently to the TBS Centre for Excellence in Evaluation (CEE). An update on the development of this plan will be provided in the 2010-2011 Departmental Performance Report., 269750=Environment Canada is in the process of developing a Three-Year Risk-Based Audit Plan for 2010/11–2012/13 therefore, projects included below may change., 139616=The audits are contained in the Risk Assessment and Five-Year Internal Audit Plan 2007-2012 approved by the CIHR Governing Council in June 2007. In accordance with Treasury Board policy, the CIHR Chief Audit Executive refreshes the Risk Assessment yearly in order to produce the CIHR Annual Internal Audit Plan. The audits listed below may be modified, replaced, or deleted to reflect the updated risk assessment., 292566=2012-13, 161582=Building on work undertaken in 2009-10 (e.g., development of a policy, terms of reference for the evaluation advisory committee, development of the evaluation universe, etc.), the CNSC will continue with the next phase of implementation. This includes staffing, as well as assessing programs to determine the needs and priorities for the development of a three-year evaluation plan., 156967=The following activities are included in the CNSC risk-based Audit Plan for the period 2009-10 to 2011-12. This plan is in the process of being reviewed and updated., 172385=April 2011, 483374=In 2008-09, NSERC and SSHRC completed a merger of their internal audit units. The Internal Audit Team is currently developing a multi-year audit plan., 119436=2010, 539814=Electronic link to the PSC's Five-year Evaluation Plan 2009-2014: www.psc-cfp.gc.ca/index-eng.htm, 271581=Q2 2010-11, 507332=Electronic Link to Internal Audit Plan: http://www.pc.gc.ca/docs/pc/rpts/rve-par/iap-2009-2010_e.asp, 155986=2011\u00962012, 154368=The OCG has yet to finalize its sector-wide audit plans for the next three fiscal years \u0097 an essential base for developing the Agency's audit plans. The OCG has indicated that the work in this area will be completed by March 2010, which is when the Agency's corporate risk profile is also scheduled for completion. Once both information sources are in place, the Agency can finalize its detailed internal audit plan for the next three fiscal years., 271856=2010-11, 118267=This internal audit list is based on the present May 2009 approved 2009-2010 to 2013-2014 risk-based, rolling multi-year audit plan. The plan is revised annually based on departmental needs and emerging priorities. As such, the content of this list could evolve and be subject to change., 161206=In past years, the CNSC oversight focus has been on the internal audit function; however, we are now positioned to undertake the same improvement to the evaluation function. The CNSC began strengthening its evaluation function in Fiscal Year 2009-10, to ensure that it aligns with the new Treasury Board Secretariat Policy on Evaluation, effective April 1, 2009., 549720=The PWGSC Risk-based Multi-year Audit and Evaluation Plan will be tabled at the Audit and Evaluation Committee in 2009-2010 and approved by the Deputy Minister. Approved evaluation reports will be posted on the following PWGSC internet site: www.tpsgc-pwgsc.gc.ca/bve-oae/index-eng.html for the English page and www.tpsgc-pwgsc.gc.ca/bve-oae/index-fra.html for the French page., 352918=Below is a listing of internal audit engagements identified in the 2009-2012 Risk-Based Internal Audit Plan. Please note that the list of projects planned for 2010-2013 may change as a result of the risk-based audit planning process for 2010-2013., 548050=The PWGSC Risk-based Multi-year Audit and Evaluation Plan will be tabled at the Audit and Evaluation Committee in 2009-2010 and approved by the Deputy Minister. Approved audit reports will be posted on the following PWGSC internet site: www.tpsgc-pwgsc.gc.ca/bve-oae/index-eng.html for the English page and www.tpsgc-pwgsc.gc.ca/bve-oae/index-fra.html for the French page., 593752=Audit and Advisory Services has developed an audit plan for 2009-2010 to 2011-2012, which was approved by the Departmental Audit Committee (DAC) in June 2009. The audit plan is reviewed yearly, which may result in revisions, updates or changes as required or requested by the DAC. Potential internal audits are identified based on a detailed assessment of risks and controls and take into account external audits conducted by the Office of the Auditor General, the Office of the Comptroller General, the Public Service Commission, etc. Internal audits examine issues related to governance, risk management and controls in support of the department's strategic objectives, programs, activities and management processes. As per government policy, audit reports are posted on Transport Canada's web-site, subject to the provisions of the Access to Information Act and the Privacy Act., 418466=2000 Policy on Title to Intellectual Property (Crown Procurement Contracts), 442067=2nd Quarter 2010-11, 463213=The table below outlines all current and planned evaluation activities for the next three fiscal years to 2013-14. For any of the recently completed or ongoing evaluations, electronic links are not yet available, due to status of the report (i.e., currently under review, undergoing translation, etc.)., 22263=Electronic Link to Internal Audit Plan: The electronic link to the internal audit plan is not available at this time. The annual audit planning process is completed during the fourth quarter, and the audit plan for 2010-2013 will be available following the President's approval., 194666=2009-2010 Internal Audit Planned Projects, 120011=2010, 438811=The following table lists the internal audit and evaluation work to be completed during fiscal year 2010-11 as well as provides an indication of the internal audit and evaluation work tentatively planned for initiation in fiscal year 2010-11. Completed audit and evaluation reports, which include management action plans to address audit and evaluation recommendations, are posted at the following link: http://www.crs-csex.forces.gc.ca/reports-rapports/index-eng.asp, 440360=1st Quarter 2010-11, 552728=2010 Olympic Games Operational Security Financial Expenditures, 41316=An annual review and update on planned audit engagements may result in modifications to audits to be conducted in 2010-2011, 2011-2012 and 2012-2013., 218693=The Office of the Chief Audit Executive has a three-year risk-based audit plan, which specifies the internal audits to be carried out over this time frame. The plan is refreshed each year to ensure that it continues to address the areas of highest importance. The following table outlines those audits identified for 2010-2011 and 2011-2012. Identified audits, including those identified in the 2009-2010 plan but not completed, will be prioritized in line with available resources., 270996=Q1 2010-11, 445031=3rd Quarter 2010-11, 275894=2011-12, 597504=Future internal audit activities for 2010/11 and 2011/12 including specific audit activities, objectives, scope and issues will be identified in consultation with program and senior management, as well as through a reassessment of risk factors., 34746=*The Canada Border Services Agency has established timelines for audit report delivery up until the first quarter of 2011-12. Timelines for audit report delivery beyond that date will be established in 2010-11., 518024=*As the Agency's Internal Audit Plan is being updated, only internal audits planned for 2010-11 are shown below., 121339=2011, 551853=Directed Audit of the Sensitive Expenditures – Fiscal Year 2008-2009, 116943=Note: The CGC recently appointed a Chief Audit Executive (CAE) who, in addition to Internal Audit, will direct the Evaluation activities. The CGC is currently evaluating its requirements and expectations as a result of the revised Evaluation Policy effective April 1, 2009. The CAE will develop a risk-based Evaluation Plan in accordance with the Policy and the needs of the CGC. Once completed, the Plan will be posted on the CGC's website., 410858=Evaluation and Performance Measurement Plan 2009-2010 to 2013-2014, 280545=2010 Olympics Games, 493399=1 The Office has a rolling three-year Practice Review and Internal Audit Plan. Specific audits for 2011 and 2012 have not yet been approved by the Auditor General. They will be posted on our website after they are approved., 270661=Q3 2010-11, 597762=Electronic Link to Internal Audit and Evaluation Plan: Audit and Advisory Services' three-year risk-based audit plan covering the period for 2009/10 to 2011/12 is available on the department's website at the following link: http://www.tc.gc.ca/eng/corporate-services/aas-audit-62.htm, 83500=The list that follows represent the audit engagements which have begun during fiscal year 2009-10 and will be completed during 2010-11 and the audit engagements which are planned to be performed over the next three fiscal years. These audit engagements are part of the most recent Canada School of Public Service Multi-year Risk-Based Audit Plan 2009-2010 to 2011-2012 (approved in June 2009 by the President of the Canada School on recommendation by the Canada School's Departmental Audit Committee). The next review and update of the Canada School of Public Service Multi-year Risk-Based Audit Plan 2010-2011 to 2012-2013 is planned to be performed during the first quarter of 2010-11 which may result in modifications to the audit engagements to be conducted over the next three fiscal years as listed below., 172564=In progress, the Agency Internal Audit plan is not yet formally approved, as of November 30, 2009., 598192=Departmental Evaluation Services will conduct the following evaluations in 2010-2011:, 301986=The following table lists all planned upcoming evaluations for the reporting period 2010-11 that pertain to the Department's work., 173533=Audits that are currently under way or planned for 2010\u00962011 include the following:, 395284=Risk-Based Audit Plan 2009-2010 to 2011-2012, 171303=June 2010, 115289=Note: The CGC recently appointed a Chief Audit Executive (CAE), whose mandate includes establishing an internal audit function in accordance with Treasury Board's Internal Audit Policy. The CAE is developing a Risk-based Audit Plan to commence activity in fiscal year 2010-2011. Once completed and approved, the Internal Audit Plan will be available on the CGC's website., 455989=The table below outlines all current and planned audit activities for the next three fiscal years to 2013-14. For any of the recently completed or ongoing audits, electronic links are not yet available, due to status of the report (i.e., currently under review, undergoing translation, etc.)., 445772=Peace and Security Vancouver 2010 Olympics, 157146=The updated plan will be submitted to the CNSC's Audit Committee in April 2010 for review and recommendation for approval by the CNSC's President. It is based on the current capacity of the CNSC's audit function, risk assessments of proposed audit projects, and management responses and action plans for prior audits for follow-up. The revised plan will outline the projects planned for the upcoming three years. Projects undertaken depend on factors such as resources available to the audit function, the scope and complexity, of projects, and the CNSC's emerging issues and priorities., 552419=Directed Audit of the Sensitive Expenditures– Fiscal Year 2009-2010, 620158=* Internal Audits based on approved Audit and Evaluation Division Audit Plan 2009-2013, 445356=4th Quarter 2010-11, 143881=CIHR Evaluation Schedule 2009/10 – 2013/14, 156597=2012\u00962013, 280745=Q4 2010-11, 511303=Electronic link to evaluation plan: http://www.pc.gc.ca/docs/pc/rpts/rve-par/ep-2009-2010_e.asp, 171658=Sept 2010, 278334=Great Lakes Action Plan (to be approved in 2010-11), 277634=Environment Canada is in the process of developing a Five-Year Risk-Based Evaluation Plan for 2010/11–2014/15 therefore, projects included below may change., 532001=The PSC has an established internal audit function, working within an environment bounded by professional standards and TBS policies. The function also receives guidance and input from its independent Internal Audit Committee. The PSC posts all completed audits on its Web site at www.psc-cfp.gc.ca/abt-aps/inta-veri/index-eng.htm. The table below gives the status of audits planned for 2009-2010 and those not yet complete. It also shows the outlook for audits to be completed over the next three years. We reassess risks annually as part of our audit planning process. Consequently, the outlook may be revised to reflect changes to overall risks, controls and commitments over this time frame., 120091=Ceremonies and Events, Vancouver 2010, 194257=Below is a list of internal audits identified in the 2009-2012 Risk-based Internal Audit Plan approved by the Departmental Audit Committee in May 2009. Please note that the list of projects planned for 2010/2011 and 2011/2012 may change as a result of the annual update to the risk-based planning process. A list of approved projects and Internal Audit Reports can be found on CSC's web site at:, 124012=2012}",
    "textBeforeTable": "Annexe 2 - Internal Audits and Evaluations Canadian Space Agency Evaluations is available on the CNSC Web site. Additional information on CNSC Building on work undertaken in 2009-10 (e.g., development of a policy, terms of reference for the evaluation advisory committee, development of the evaluation universe, etc.), the CNSC will continue with the next phase of implementation. This includes staffing, as well as assessing programs to determine the needs and priorities for the development of a three-year evaluation plan. In past years, the CNSC oversight focus has been on the internal audit function; however, we are now positioned to undertake the same improvement to the evaluation function. The CNSC began strengthening its evaluation function in Fiscal Year 2009-10, to ensure that it aligns with the new Treasury Board Secretariat Policy on Evaluation, effective April 1, 2009. Evaluations 2010-11 Planned Follow-up Follow-up on past audits, including Procurement Audit 2010-11 Ongoing Monitoring Monitoring of action plans from past audits 2010-11 Planned Governance and management audit Audit of Corporate Governance 2010-11 Planned Compliance and management Audit of Regulatory Document Development 2010-11 Planned Compliance and management audit Audit of Delegated Licensing Authority",
    "textAfterTable": "Evaluations Name of Evaluation Program Activity Type Status Completion Date Electronic Link to Report Evaluation of the RADARSAT-2 Major Crown Project EO Summative Completed 2009-09-30 http://www.asc-csa.gc.ca/pdf/mcp-5702-7823.pdf Evaluation of the 2000-2009 Canada/ESA Cooperation Agreement EO, SE, SC and GTA Summative In Progress 2010-03-31 N/A Evaluation of the Space Technology Development Program (STDP) GTA Summative In Progress 2010-03-31 N/A Canadian Transportation Agency Upcoming Internal Audits and Evaluations over the next three fiscal years All upcoming Internal Audits over the next three fiscal years 1. Name of Internal Audit 2. Internal Audit Type 3. Status 4. Expected Completion Date IT Asset Maintenance Life Cycle Assurance Planned June 2010 Information Security Assurance Planned Sept 2010",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}