{
    "relation": [
        [
            "Impairment Item",
            "Book",
            "Impairment Name",
            "Impairment Date",
            "Status",
            "Impairment Loss Amount (Expense)"
        ],
        [
            "Impairment Value",
            "Asset Book",
            "IAS 36 Impairment",
            "01-May-2009",
            "Preview",
            "1,000"
        ]
    ],
    "pageTitle": "Oracle Assets User Guide",
    "title": "Impairment Transaction",
    "url": "http://docs.oracle.com/cd/E18727_01/doc.121/e13586/T293142T293324.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00222-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 73813459,
    "recordOffset": 73758054,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{108894=Due to the economic changes, the Value in Use and Fair Value of the asset are considered as if the assets have not had a prior impairment. Meaning the values for period AUG-2009 will be 3,888.89 (5,000 - (8 * 138.89)). The same result would also occur if used the Impairment Loss amount of <1,305.55 > with an Impairment Date in the AUG-2009 period., 93196=For Japan Depreciation methods specific calculations and examples, see the FY2007 Japan Tax Reforms - Impairment section ., 307180=Copyright © 1988, 2010, Oracle and/or its affiliates. All rights reserved., 241158=On March 1, 2009, a professional valuation was performed on Building #3 and the building’s value had decreased due to a decline in property values in the area. The buildings value is now 3,500,000 resulting in an impairment of 1,388,889., 120229=Depreciation has been run until MAY- 2009. As of May 01, 2009 the asset’s details are as follows:, 114581=3,305.55 = 5,000 - 694.45 - 1000, 229908=On March 1, 2008, a professional valuation was performed on Building #2 and the building’s value had decreased due to a decline in property values in the area. The building was impaired by 500,000., 119072=On February 1, 2009, a used asset was purchased and recorded into Oracle Assets with the following details:, 300073=You can schedule maintenance events during a particular range of dates. For example, if you want to schedule maintenance yearly, you might enter a Start Date of January 1 and an End Date of December 31., 214930=On April 1, 2009, another professional valuation was performed and the building’s value had increased to 5,500,000. The revaluation is not linked to the prior impairment., 198905=As of April 1, 2008, the accounting and asset details are as follows:, 228986=On April 1, 2007, Building #2 was purchased and recorded into Oracle Assets with the following details:, 209440=On March 1, 2008, a professional valuation was performed on Building #2 and the building’s value had decreased by 500,000. The monthly depreciation after the impairment is 37,037., 37760=In the following example, the From field contains a complete account combination, and the To field contains a partial account combination. Assets with the expense account 01-100-2000-500 will be transferred to the expense account 01-300-2000-600., 242620=When determining the impairment loss amount, the current period’s (March 2008) depreciation is included in the CNBV calculation., 210535=* Excludes depreciation for March 2008., 213304=At the end of the month, the following accounting entry is booked to record the depreciation expense and its corresponding neutralizing entries for the period (March 2008):, 94530=Depreciation has been run until MAY- 2009. As of May 01, 2009 the assets’ details are as follows:, 111701=On February 1, 2009, an asset was purchased and recorded into Oracle Assets with the following details:, 198793=On April 1, 2008, a professional valuation was performed on Building #1 and was revalued to 5,500,000., 198724=Depreciation has been run up to and including March - 2008., 242563=** Revaluation Reserve at end of February 2008., 113535=On May 1, 2009, it was determined the asset was damaged. The following impairment transaction is recorded:, 209629=On March 1, 2008, the accounting and asset details are as follows:, 215110=On April 1, 2009, the accounting for the building is as follows:, 153787=CIPFA/LASAAC Joint Committee produced, in accordance with the Accounting Standards Board’s code of practice, a “Code of Practice on Local Authority Accounting in the United Kingdom 2006” on proper accounting practice. This is also generally referred to as “A Statement of Recommended Accounting Practice (SORP) 2006”. The SORP is required to be adhered to by all local authorities in United Kingdom (UK). The SORP includes recommendations on how fixed assets are to be revalued from April 1, 2007 and onwards, 120910=On May 1, 2009, it was determined the asset was undervalued. The following revaluation transaction is recorded:, 240768=On April 1, 2008, a professional valuation was performed on Building #3 and the building’s value had increased due improvements made. The building was revalued to a net book balance of 5,500,000. With a new monthly depreciation of 50,926, revaluation reserve balance of 1,000,000, and a monthly revaluation reserve amortization amount of 9,259, and a remaining life of 108 months., 24317=Note: The system displays the above fields only if you set the FA: Japan 2007 Tax Reforms Features profile option to Yes., 242502=* Accumulated Depreciation at end of February 2008., 24552=For more information, see: Japan Tax Reforms FY2007 Requirements., 197715=Building #1 was purchased on April 1, 2007 and recorded into Oracle Assets with the following details:, 112854=Depreciation has been run until MAY- 2009. As of May 01, 2009 the assets' details are as follows:, 126720=On September 1, 2009 the asset suffered damage due to flooding in the area. The following impairment transaction is recorded:, 106235=For example, on 01-May-2009 the asset’s Value in Use and Net Selling Price would have been 4,305.55 (5000 - (5*138.89)). In order to reverse the effects of the impairment, a backdated amortized adjustment is performed using the impairment date and the Value in Use / Net Selling Price of 4,305.55 or the Impairment Loss (Expense) amount of <1,305.55>., 239762=Building #3 was purchase on April 1, 2007, and recorded into Oracle Assets with the following details:, 230115=On March 1, 2008, the accounting for the building is as follows:, 241406=On March 1, 2009, the accounting for the building is as follows:, 210633=When determining the impairment loss amount, the current period's (March 2008) depreciation is included in the CNBV calculation. Where:, 23967=The following fields are applicable only to the requirements related to Japan Tax Reforms FY2007 ., 208434=Building #2 was purchased on April 1, 2007 and recorded into Oracle Assets with the following details:}",
    "lastModified": "Tue, 23 Jun 2015 15:20:42 GMT",
    "textBeforeTable": "Choose Preview to run the Mass Change Preview report. Use this report to preview what effects to expect from the Mass Change before you perform it. If necessary, update the definition and run the preview report again. The mass change status determines what action to perform next. The following table defines each mass change status and their next actions available. For more information, see: Japan Tax Reforms FY2007 Requirements. Limit Percent Note: The system displays the above fields only if you set the FA: Japan 2007 Tax Reforms Features profile option to Yes. Limit Amount Depreciation Limit Type Salvage Value Percent Salvage Value Salvage Type The following fields are applicable only to the requirements related to Japan Tax Reforms FY2007 . If you selected the Member value for the Group Association field, you must enter a valid group asset number in the Group Asset field. No Selection: The system will include all assets, regardless of the group association of the assets. For example, the system will include group, member, and standalone assets for the mass change transaction. If you do not select the group asset association in a Before field, you cannot select the Member or Standalone values in the corresponding After field. The default value of the Before and After fields is No Selection. Standalone: The system will select only standalone",
    "textAfterTable": "Mass change currently running None Completed Mass Change completed successfully Review Copy Error Preview report or mass change completed in error Preview or Run, whichever failed To perform the mass change, query the definition and choose Run. Oracle Assets submits a concurrent process to perform the change. If you wish to simultaneously run this program in more than one process to reduce processing time, Oracle Assets can be set up to run this program in parallel. For more information on setting up parallel processing and the FA: Number of Parallel Requests profile option, see: Profile Options and Profile Options Categories Overview. To review a completed mass change, query the definition and choose Review. Oracle Assets runs the Mass Change Review report. Review the log file and report after the request completes. Performing Group Reclassifications Using Mass Change You can also use the Mass Changes window to perform a group reclassification by changing the group asset assignment of a range of assets. However, you cannot change both the depreciation rules and the group asset assignment of the capitalized assets in the same mass change transaction. You must perform the mass group reclassification as a separate mass change transaction. When you use the Mass Changes window to change the group asset assignment of capitalized assets, the system will always use the Calculate transfer type",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}