{
    "relation": [
        [
            "Nome",
            "Julio Iglesias",
            "Thomas Ince",
            "Pedro Infante",
            "Rex Ingram",
            "Jill Ireland",
            "John Ireland",
            "Jose Iturbi"
        ],
        [
            "Categoria",
            "Música",
            "Cinema",
            "Música",
            "Cinema",
            "Cinema",
            "Televisão",
            "Música"
        ],
        [
            "Endereço",
            "7000 Hollywood Blvd.",
            "6727 Hollywood Blvd.",
            "7083 Hollywood Blvd.",
            "1651 Hollywood Blvd.",
            "6751 Hollywood Blvd.",
            "7021 Hollywood Blvd.",
            "6834 Hollywood Blvd."
        ]
    ],
    "pageTitle": "Lista de estrelas na Calçada da Fama – Wikipédia, a enciclopédia livre",
    "title": "",
    "url": "https://pt.wikipedia.org/wiki/Anexo:Lista_de_estrelas_na_Cal%C3%A7ada_da_Fama",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00198-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 880355951,
    "recordOffset": 880267062,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 30 Jul 2015 03:31:01 GMT",
    "textBeforeTable": "E[editar | editar código-fonte] 6263 Hollywood Blvd. Cinema Allan Dwan 6321 Hollywood Blvd. Cinema Ann Dvorak 6801 Hollywood Blvd. Cinema Robert Duvall 6145 Hollywood Blvd. TV Dan Duryea 6504 Hollywood Blvd. Cinema Charles Durning 1724 Vine Street Cinema Deanna Durbin 1648 Vine Street Radio 1600 Vine Street Cinema Jimmy Durante 1770 Vine Street Música Duran Duran 6669 Hollywood Blvd. TV Jerry Dunphy 6613 Hollywood Blvd. Cinema Mildred Dunnock 6725 Hollywood Blvd. Cinema Philip Dunne 6440 Hollywood Blvd. Cinema Irene Dunne 7010 Hollywood Blvd. TV 6555 Hollywood Blvd. Cinema James Dunn 7021 Hollywood Blvd. Cinema Faye Dunaway 7000 Hollywood Blvd. TV Patty Duke",
    "textAfterTable": "Rádio 6512 Hollywood Blvd. Música 1639 Vine Street Barbara Eden Televisão 7003 Hollywood Blvd. Robert Edeson Cinema 1628 Vine Street Ralph Edwards Rádio 6116 Hollywood Blvd. Televisão 6262 Hollywood Blvd. Steve Edwards Televisão 6150 Hollywood Blvd. Michael D. Eisner Cinema 6834 Hollywood Blvd. Duke Ellington Música 6535 Hollywood Blvd. Mischa Elman Música 1560 Vine Street Faye Emerson Cinema 6529 Hollywood Blvd. Televisão 6689 Hollywood Blvd. Nome Categoria Endereço Dick Enberg Televisão 6752 Hollywood Blvd. John Ericson Televisão 1523 Vine Street Leon Errol Cinema 6801 Hollywood Blvd. Stuart Erwin Televisão 6270 Hollywood Blvd. Emilio Estefan, Jr. Música 7021 Hollywood Blvd.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}