{
    "relation": [
        [
            "Location",
            "Moonachie, New Jersey",
            "Paramus, New Jersey",
            "Bienne, Switzerland",
            "Bienne, Switzerland",
            "Hong Kong",
            "Villers le Lac, France",
            "New York, New York",
            "Markham, Canada",
            "Hackensack, New Jersey",
            "ChangAn Dongguan, China",
            "Shanghai, China",
            "Munich, Germany",
            "Coral Gables, Florida",
            "Grenchen, Switzerland",
            "Singapore",
            "Dubai, United Arab Emirates"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Function",
            "Watch distribution and repair",
            "Executive offices",
            "Watch distribution, assembly and repair",
            "Corporate functions and watch sales",
            "Watch sales, distribution and repair",
            "European service and watch distribution",
            "Public relations office, licensed brand showroom",
            "Office, watch distribution and repair",
            "Warehouse",
            "Quality control and engineering",
            "Watch sales and distribution",
            "Watch sales and repair",
            "Caribbean office, watch sales",
            "Watch sales",
            "Watch sales, distribution and repair",
            "Watch sales"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Square Footage",
            "100,000",
            "98,300",
            "35,790",
            "35,500",
            "16,560",
            "12,800",
            "9,900",
            "7,800",
            "6,600",
            "6,460",
            "6,050",
            "4,380",
            "2,880",
            "2,800",
            "970",
            "730"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Lease Expiration",
            "July 2019",
            "June 2018",
            "October 2017",
            "June 2017",
            "March 2016",
            "January 2016",
            "August 2016",
            "August 2019",
            "July 2015",
            "December 2015",
            "January 2017",
            "January 2017",
            "January 2017",
            "July 2015",
            "December 2016",
            "July 2015"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/72573/000156459015002252/mov-10k_20150131.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00303-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 683297403,
    "recordOffset": 683212813,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{738423=Gross profit for fiscal 2014 was $305.3 million or 53.5% of net sales as compared to $277.9 million or 55.0% of net sales in the prior year. The increase in gross profit of $27.4 million was primarily due to higher net sales for the current year partially offset by a lower gross margin percentage. The gross margin percentage for fiscal 2014 decreased by approximately 220 basis points due to a shift in channel and product mix, approximately 60 basis points due to the Company’s decision to reduce the presence of ESQ Movado while expanding the Movado brand offering in certain retail doors and by approximately 10 basis points due to the unfavorable impact of fluctuations in foreign currency exchange rates. These decreases in the gross margin percentage were partially offset by the positive impact of approximately 60 basis points resulting from leverage gained on certain fixed costs due to the increase in sales volume year-over-year, approximately 40 basis points related to a charge for a sales allowance resulting from the repositioning of the Coach watch brand in the prior year, and approximately 40 basis points resulting from a duty refund received relating to payments made by the Company in calendar years 2008 through 2011 for drawback claims filed with U.S. Customs & Border Protection., 58364=On March 28, 2014, the Company entered into an amended and restated license agreement with Lacoste S.A., Sporloisirs S.A. and Lacoste Alligator S.A. that amends and restates the original license agreement which the Company had entered into in March, 2006, and that extends its term from January 1, 2015 through December 31, 2022., 732680=Net sales in fiscal 2014 in the United States location of the wholesale segment were $243.8 million, above the prior year period by $36.5 million or 17.6%, primarily driven by sales increases in the licensed brand and luxury brand categories. Net sales in the luxury category were above the prior year by $16.8 million, or 12.3%. Net sales in the licensed brand category were above the prior year by $19.6 million, or 31.2%, primarily due to higher sales of Coach watches as a result of the repositioning of the Coach watch brand into the fashion watch category. Also contributing to the increase were sales of the Company’s newly introduced Scuderia Ferrari watch line and the strong sell-through of certain other licensed brands.  The increase in sales in the luxury category was primarily due to strong sell-through in the Company’s Movado brand distribution channels, which included higher sales of the Movado BOLD and Museum watch collections and the introduction of Movado TC and SE Pilot watch collections in the current year, all of which were supported by the Company’s continued focus and investment in marketing and advertising. The increase in sales in the luxury category was partially offset by sales decreases of the ESQ Movado brand primarily due to the $7.8 million sales reserve in the current year, for anticipated returns resulting from the Company’s decision to reduce the presence of ESQ Movado while expanding the Movado brand offering in certain retail doors. Net sales increases were also recorded in the luxury category of $1.9 million when compared to the prior year period, primarily due to higher promotional sales., 268054=During each of fiscal 2014 and 2015, the Company declared four quarters of dividends as indicated in the table above. The decision of whether to declare any future cash dividend, including the amount of any such dividend and the establishment of record and payment dates, will be determined, in each quarter, by the Board of Directors, in its sole discretion., 913469=Third Amendment of Lease dated November 6, 2001 between Mack-Cali Realty, L.P., as lessor, and Movado Group, Inc., as lessee, for additional space at Mack-Cali II, One Mack Drive, Paramus, New Jersey. Incorporated herein by reference to Exhibit 10.4 to the Registrant’s Quarterly Report on Form 10-Q filed for the quarter ended October 31, 2001., 757909=Cash provided by investing activities amounted to $21.6 million and cash used in investing activities of $47.9 million for fiscal 2015 and 2014, respectively. The cash provided by investing for fiscal 2015 consisted of proceeds from the maturity of time-deposits of $33.7 million, proceeds from available-for-sale securities of $0.3 million, partially offset by capital expenditures of $11.1 million, primarily related to the construction of shop-in shops at some of the Company’s wholesale customers, expenditures on hardware and software, spending on new store openings, construction of Baselworld Watch and Jewelry Show booths, spending on tooling and design and cash used on a long-term investment of $1.2 million. The cash used in fiscal 2014 consisted of short-term investments of $33.1 million related to the six-month time deposit described above, capital expenditures of $16.7 million, primarily related to the construction of Baselworld Watch and Jewelry Show booths, office improvements, retail store renovations and construction of shop-in-shops at some of the Company’s wholesale customers. These current period expenditures were partially offset by proceeds of $2.2 million received from the sale of a building held for sale., 34136=The Company was incorporated in New York in 1967 under the name North American Watch Corporation to acquire Piaget Watch Corporation and Corum Watch Corporation, which had been, respectively, the exclusive importers and distributors of Piaget and Corum watches in the United States since the 1950’s. The Company sold its Piaget and Corum distribution businesses in 1999 and 2000, respectively, to focus on its own portfolio of brands. Since its incorporation, the Company has developed its brand-building reputation and distinctive image across an expanding number of brands and geographic markets. Strategic acquisitions of watch brands and their subsequent growth, along with license agreements, have played an important role in the expansion of the Company’s brand portfolio., 107792=The Company licenses the trademark COACH® and related trademarks on an exclusive worldwide basis for use in connection with the manufacture, distribution, advertising and sale of watches pursuant to an amended and restated license agreement with Coach, Inc., dated January 30, 2015, which expires on June 30, 2020., 730281=For fiscal 2015 and 2014, the Company recorded net income attributed to Movado Group, Inc. of $51.8 million and $50.9 million, respectively., 588967=Fiscal 2011 effective tax rate of (62.7)% includes a charge for the establishment of a valuation allowance against net deferred tax assets in Switzerland, in addition to continued recording of valuation allowances, most notably the valuation allowance against net U.S. deferred tax assets, and the tax accrued on the repatriation of foreign earnings., 910680=Lease Agreement dated May 22, 2000 between Forsgate Industrial Complex and the Registrant for premises located at 105 State Street, Moonachie, New Jersey. Incorporated herein by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended April 30, 2000., 76540=The Ebel brand was established in La Chaux-de-Fonds, Switzerland in 1911. Since acquiring Ebel, Movado Group has returned Ebel to its roots as the “Architects of Time” through its product development, marketing initiatives and global advertising campaigns. All Ebel watches feature Swiss movements and are made with solid 18 karat yellow or rose gold, stainless steel or a combination of 18 karat yellow or rose gold, ceramic and, or stainless steel. Some are set with diamonds., 748253=Operating income of $12.5 million and $11.3 million was recorded in the retail segment for fiscal 2014 and 2013, respectively. The $1.2 million increase in operating income was the result of an increase in gross profit of $1.8 million, partially offset by an increase in SG&A expenses of $0.6 million. The increase in gross profit of $1.8 million was primarily attributable to higher sales. The increase in SG&A expenses of $0.6 million was primarily due to higher compensation, benefit expenses and occupancy expenses related to the opening of new stores in the current year., 957034=Certification of Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.***, 227661=Since acquiring it in 2004, as part of its acquisition of Ebel, the Company owns an architecturally significant building in La Chaux-de-Fonds., 106857=The Company licenses ESQUIRE®, ESQ® and related trademarks on an exclusive worldwide basis for use in connection with the manufacture, distribution, advertising and sale of watches pursuant to a license agreement with Hearst Magazine, a division of Hearst Communications, Inc., dated as of January 1, 1992 (as amended, the “Hearst License Agreement”). The current term of the Hearst License Agreement expires December 31, 2015, and contains options for renewal at the Company’s discretion through December 31, 2042., 596252=The Company’s business is seasonal. There are two major selling seasons in the Company’s markets: the spring season, which includes school graduations and several holidays and, most importantly, the Christmas and holiday season. Major selling seasons in certain international markets center on significant local holidays that occur in late winter or early spring. The Company’s net sales historically have been higher during the second half of the fiscal year. The second half of each year accounted for 54.9%, 56.5%, and 56.1% of the Company’s net sales for the fiscal years ended January 31, 2015, 2014 and 2013, respectively., 339174=2014, 605465=In calendar years 2010 through 2012, drawback claims were filed with U.S. Customs & Border Protection (“CBP”) to recover duty payments made by the Company in calendar years 2008 through 2011. The drawback claims concerned duty paid on watches that were subsequently exported from the United States. A number of drawback claims filed on behalf of the Company were denied by CBP in calendar year 2012 and an administrative protest was filed requesting reconsideration of the denials. This protest was approved and, as a result, in the fourth quarter of fiscal 2014 the Company recorded and received a net pre-tax refund of $2.5 million. The Company does not anticipate receipt of any additional refunds related to this matter nor does the Company anticipate return of any of these refunds to CBP.  , 97147=The Company’s U.S. sales are traditionally greater during the Christmas and holiday season. Consequently, the Company’s net sales historically have been higher during the second half of a fiscal year. The amount of net sales and operating profit generated during the second half of each fiscal year depends upon the general level of retail sales during the Christmas and holiday season, as well as economic conditions and other factors beyond the Company’s control. Major selling seasons in certain international markets center on significant local holidays that occur in late winter or early spring. The second half of each year accounted for 54.9%, 56.5%, and 56.1% of the Company’s net sales for the fiscal years ended January 31, 2015, 2014, and 2013, respectively., 707493=Net sales in fiscal 2015 were $587.0 million, $16.7 million or 2.9% above the prior year. Net sales in fiscal 2014 included an additional pre-tax charge of $7.8 million to sales, for anticipated returns in fiscal 2015 resulting from the Company’s decision to reduce the presence of ESQ Movado while expanding the Movado brand offering in certain retail doors. For fiscal 2015, fluctuations in foreign currency exchange rates unfavorably impacted net sales by $2.2 million when compared to the prior year., 3777=TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 215070=December 2015, 815365=The Company’s Board of Directors authorized the hedging of the Company’s Swiss franc denominated investment in its wholly-owned Swiss subsidiaries using purchase options under certain limitations. These hedges are treated as net investment hedges under the relevant accounting guidance regarding derivative instruments. As of January 31, 2015 and 2014, the Company did not hold a purchased option hedge portfolio related to net investment hedging., 574222=Fiscal 2012 net sales include a $3.0 million sale of certain proprietary watch movements., 935013=Tenth Amendment to Lease dated March 10, 2011 between Mack-Cali Realty, L.P., as landlord, and the Registrant, as tenant, further amending the lease dated as of December 21, 2000. Incorporated herein by reference to Exhibit 10.36 to the Registrant’s Annual Report on Form 10-K for the year ended January 31, 2011., 847972=The information required by this item is included in the Company’s Proxy Statement for the 2015 annual meeting of shareholders under the caption “Fees Paid to PricewaterhouseCoopers LLP” and is incorporated herein by reference., 203231=June 2017, 827868=Consolidated Balance Sheets at January 31, 2015 and 2014, 577447=Fiscal 2014 includes a $2.0 million donation to the Movado Group Foundation and a $0.8 million pre-tax charge related to the write down of excess displays and point of sale materials, as a result of the Company’s decision to reduce the presence of ESQ Movado while expanding the Movado brand offering in certain retail doors., 25800=Statements in this annual report on Form 10-K, including, without limitation, statements under Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and elsewhere in this report, as well as statements in future filings by the Company with the Securities and Exchange Commission (“SEC”), in the Company’s press releases and oral statements made by or with the approval of an authorized executive officer of the Company, which are not historical in nature, are intended to be, and are hereby identified as, “forward-looking statements” for purposes of the safe harbor provided by the Private Securities Litigation Reform Act of 1995. These statements are based on current expectations, estimates, forecasts and projections about the Company, its future performance, the industry in which the Company operates and management’s assumptions. Words such as “expects”, “anticipates”, “targets”, “goals”, “projects”, “intends”, “plans”, “believes”, “seeks”, “estimates”, “may”, “will”, “should” and variations of such words and similar expressions are also intended to identify such forward-looking statements. The Company cautions readers that forward-looking statements include, without limitation, those relating to the Company’s future business prospects, projected operating or financial results, revenues, working capital, liquidity, capital needs, plans for future operations, expectations regarding capital expenditures and operating expenses, effective tax rates, margins, interest costs, and income as well as assumptions relating to the foregoing. Forward-looking statements are subject to certain risks and uncertainties, some of which cannot be predicted or quantified. Actual results and future events could differ materially from those indicated in the forward-looking statements, due to several important factors herein identified, among others, and other risks and factors identified from time to time in the Company’s reports filed with the SEC including, without limitation, the following: general economic and business conditions, which may impact disposable income of consumers in the United States and the other significant markets (including Europe) where the Company’s products are sold, uncertainty regarding such economic and business conditions, trends in consumer debt levels and bad debt write-offs, general uncertainty related to possible terrorist attacks, natural disasters, the stability of the European Union and defaults on or downgrades of sovereign debt and the impact of any of those events on consumer spending, changes in consumer preferences and popularity of particular designs, new product development and introduction, the ability of the Company to successfully implement its business strategies, competitive products and pricing, the impact of “smart” watches and other wearable tech products on the traditional watch market, seasonality, availability of alternative sources of supply in the case of the loss of any significant supplier or any supplier’s inability to fulfill the Company’s orders, the loss of or curtailed sales to significant customers, the Company’s dependence on key employees and officers, the ability to successfully integrate the operations of acquired businesses without disruption to other business activities, the continuation of the company’s major warehouse and distribution centers, the continuation of licensing arrangements with third parties, losses possible from pending or future litigation, the ability to secure and protect trademarks, patents and other intellectual property rights, the ability to lease new stores on suitable terms in desired markets and to complete construction on a timely basis, the ability of the Company to successfully manage its expenses on a continuing basis, information systems failure or breaches of network security, the continued availability to the Company of financing and credit on favorable terms, business disruptions, disease, general risks associated with doing business outside the United States including, without limitation, import duties, tariffs, quotas, political and economic stability, changes to existing laws or regulations, and success of hedging strategies with respect to currency exchange rate fluctuations., 829346=Consolidated Statements of Cash Flows for the fiscal years ended January 31, 2015, 2014 and 2013, 933680=Second Amendment to License Agreement between L.C. Licensing, Inc., Movado Group, Inc. and Swissam Products Limited dated as of December 6, 2010, further amending the License Agreement dated as of November 15, 2005. Incorporated herein by reference to Exhibit 10.35 to the Registrant’s Annual Report on Form 10-K for the year ended January 31, 2011., 209169=August 2016, 905188=Letter Agreement between the Registrant and The Hearst Corporation dated October 24, 1994 executed October 25, 1995 amending License Agreement dated as of January 1, 1992, as amended. Incorporated herein by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended October 31, 1995., 950202=Security and Pledge Agreement, dated as of January 30, 2015, by and among Movado Group, Inc., Movado Group Delaware Holdings Corporation, Movado Retail Group, Inc. and Movado LLC, as Grantors, and Bank of America, N.A., as administrative agent. Incorporated herein by reference to Exhibit 10.2 to the Registrant’s Current Report on Form 8-K filed February 5, 2015., 727916=For information on the Company’s borrowings for fiscal 2015 and fiscal 2014, see Note 4 to the Consolidated Financial Statements.  , 2796=For fiscal year ended January 31, 2015, 907924=Severance Agreement dated December 15, 1999, and entered into December 16, 1999 between the Registrant and Richard J. Coté. Incorporated herein by reference to Exhibit 10.35 to the Registrant’s Annual Report on Form 10-K for the year ended January 31, 2000. *, 961371=Confidential portions of this Exhibit 10.35 have been omitted and filed separately with the Securities and Exchange Commission pursuant to Rule 24b-2 of the Securities Exchange Act of 1934., 674973=2014 % of net sales, 674007=2015 % of net sales, 707022=Fiscal 2015 Compared to Fiscal 2014, 145235=The Company’s sales are seasonal by nature. The Company’s U.S. sales are traditionally greater during the Christmas and holiday season. Internationally, major selling seasons center on significant local holidays that occur in late winter or early spring. The amount of net sales and operating income generated during these seasons depends upon the general level of retail sales at such times, as well as economic conditions and other factors beyond the Company’s control. The second half of each year accounted for 54.9%, 56.5%, and 56.1% of the Company’s net sales for the fiscal years ended January 31, 2015, 2014, and 2013, respectively. If events or circumstances were to occur that negatively impact consumer spending during such holiday seasons, it could have a material adverse effect on the Company’s sales, profitability and results of operations., 44512=2001, 958029=Certification of Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.***, 839638=There has been no change in the Company’s internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act) during the year ended January 31, 2015, that has materially affected, or is reasonably likely to materially affect, the Company’s internal control over financial reporting., 224888=December 2016, 811006=pronouncement provides alternative methods of retrospective adoption and is effective for fiscal years, and interim periods within those years, beginning after December 15, 2016. Early adoption is not permitted. The Company is evaluating the effect of adopting this pronouncement, but the adoption is not expected to have a material impact on the Company’s consolidated financial statements., 56873=Also, on November 25, 2014, the Board approved the payment of a cash dividend of $0.10 for each share of the Company’s outstanding common stock and class A common stock. The dividend was paid on December 19, 2014 to all shareholders of record as of the close of business on December 5, 2014., 964713=Our internal control over financial reporting as of January 31, 2015 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their report which appears herein., 53466=On March 31, 2015, the Board approved the payment of a cash dividend of $0.11 for each share of the Company’s outstanding common stock and class A common stock. The dividend will be paid on April 24, 2015 to all shareholders of record as of the close of business on April 10, 2015. The decision of whether to declare any future cash dividend, including the amount of any such dividend and the establishment of record and payment dates, will be determined, in each quarter, by the Board of Directors, in its sole discretion., 90273=The Company divides its business into two major geographic locations: United States operations, and International, which includes the results of all other Company operations. The allocation of geographic revenue is based upon the location of the customer. The Company’s International operations in Europe, the Americas (excluding the United States), Asia and the Middle East account for 18.9%, 11.4%, 8.0% and 7.1%, respectively, of the Company’s total net sales for fiscal 2015. Substantially all of the Company’s international assets are located in Switzerland and Asia. For a discussion of the risks associated with the Company’s operations conducted outside the United States see “A significant portion of the Company’s business is conducted outside of the United States. Many factors affecting business activities outside the United States could adversely impact this business” under Item 1A, Risk Factors, below., 915973=Amendment Number 3 to Registrant’s 1996 Stock Incentive Plan approved June 19, 2001. Incorporated herein by reference to Exhibit 10.28 to the Registrant’s Annual Report on Form 10-K for the year ended January 31, 2002.*, 271021=The following table summarizes information about the Company’s purchases of shares of its common stock in the fourth quarter of fiscal 2015., 593098=Net Sales.    The Company operates and manages its business in two principal business segments – Wholesale and Retail. The Company also operates in two geographic locations – United States and International. Since April 30, 2014, the Company has divided its watch business into two principal categories: the luxury category and the licensed brands category. The luxury category consists of the Ebel®, Concord®, Movado® and ESQ® Movado brands.  Previously, the Company classified the Movado and the ESQ Movado brands together as a separate category referred to as accessible luxury. Watches in the licensed brands category include the following brands manufactured and distributed under license agreements with the respective brand owners: Coach®, HUGO BOSS®, Juicy Couture®, Lacoste®, Tommy Hilfiger® and SCUDERIA FERRARI®. These changes to the Company’s watch brand categories did not change the Company’s operating segments., 724197=Operating income of $52.7 million and $56.7 million was recorded in the international location of the Wholesale segment for fiscal 2015 and 2014, respectively, which included $47.1 million and $44.2 million, respectively, of certain profits related to the Company’s supply chain operations. The decrease in operating income of $4.0 million was due to higher SG&A expenses of $3.4 million and lower gross profit of $0.6 million, which was primarily attributable to lower sales. The increase in SG&A expenses of $3.4 million included higher other selling expenses of $2.0 million, the unfavorable effect of fluctuations in foreign currency exchange rates of $1.8 million, higher trade show expenses of $1.0 million, primarily related to the Baselworld Watch and Jewelry Show, higher bad debt expense of $0.7 million and higher compensation and benefit expenses of $0.5 million resulting primarily from a higher headcount and salaries, partially offset by a lower expense for performance-based compensation. These increased SG&A expenses were partially offset by higher marketing expenses of $3.1 million., 576299=Fiscal 2011 includes a non-cash charge of $24.1 million for certain non-core gold and mechanical movement inventory., 578803=Fiscal 2013 and 2012 each includes a $3.0 million donation to the Movado Group Foundation., 924117=License Agreement entered into November 21, 2005 by and between the Registrant, Swissam Products Limited and L.C. Licensing, Inc. Incorporated herein by reference to Exhibit 10.37 to the Registrant’s Annual Report on Form 10-K for the year ended January 31, 2006., 914670=Amendment Number 2 to Registrant’s 1996 Stock Incentive Plan dated March 16, 2001. Incorporated herein by reference to Exhibit 10.27 to the Registrant’s Annual Report on Form 10-K for the year ended January 31, 2002.*, 581185=Fiscal 2011 includes a reversal of a previously recorded liability of $4.3 million for a retirement agreement with the Company’s former Chairman.  , 926785=Third Amendment to License Agreement dated as of January 1, 1992 between the Registrant and Hearst Magazines, a Division of Hearst Communications, Inc., effective February 15, 2007. Incorporated herein by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended April 30, 2007., 769187=On November 25, 2014, the Board approved the payment of a cash dividend of $0.10 for each share of the Company’s outstanding common stock and class A common stock. The dividend was paid on December 19, 2014 to all shareholders of record as of the close of business on December 5, 2014., 741797=Operating income of $55.2 million and $38.0 million, which included $26.5 million and $27.2 million of unallocated corporate expenses, was recorded in the Wholesale segment for fiscal 2014 and 2013, respectively. The $17.2 million increase in operating income was the net result of an increase in gross profit of $25.6 million, partially offset by an increase in SG&A expenses of $8.0 million. The increase in gross profit of $25.6 million was primarily due to higher net sales. Gross profit was impacted by a $7.5 million pre-tax charge related to the anticipated ESQ Movado watch brand returns and the write down of ESQ Movado excess inventory. The increase in SG&A expense included higher marketing expenses of $6.3 million, which included a $0.8 million pre-tax charge related to the write down of unused displays and point of sale materials, as a result of the Company’s decision to reduce the presence of ESQ Movado while expanding the Movado brand offering in certain retail doors. Also contributed to the increase in SG&A expenses were higher trade show expenses of $2.5 million, primarily related to the Baselworld Watch and Jewelry Show, a recovery of bad debt of $1.2 million in fiscal 2013 that did not recur and higher office related expenses of $0.7 million.  These increases in SG&A expenses were partially offset by lower compensation and benefit expense of $1.4 million resulting primarily from a lower accrual for performance-based compensation, the lower performance-based compensation accrual was partially offset by higher headcount and salaries, also partially offsetting the increases in SG&A was a decrease of $1.0 million of charitable contributions made to the Movado Group Foundation., 708459=Net sales in fiscal 2015 in the United States location of the wholesale segment were $255.7 million, above the prior year period by $11.9 million or 4.9%, primarily driven by sales increases in the licensed brand and luxury brand categories. Net sales in the licensed brands category were above the prior year’s net sales by $5.9 million, or 7.1%. The increase in sales in the licensed brands category was primarily due to higher sales of certain licensed brands, as a result of strong sell-through and expansion in the Company’s distribution channels. Net sales in the luxury category were above the prior year by $4.6 million, or 3.0%. The increase in sales in the luxury category was primarily due to higher sales in both Movado and ESQ Movado brand sales. The sales increase in the Movado brand was primarily due to strong sell-through in the Company’s Movado brand distribution channels, which included higher sales of the Movado BOLD and Museum watch collections and the introduction of new products in the current year, all of which were supported by the Company’s continued focus and investment in marketing and advertising. The year on year fluctuation in sales in the ESQ Movado brand was primarily due to the $7.8 million sales charge in the prior year, for anticipated returns resulting from the Company’s strategic decision to reduce the presence of ESQ Movado watches while expanding the Movado brand offering in certain retail doors. The Company believes it did not fully realize all of the anticipated benefits of this strategy which was intended to drive incremental sales of its more productive Movado brand watch families by utilizing the increased case space at the point of sale that otherwise would have been occupied by relatively less productive ESQ Movado SKUs. Although Movado brand sales at retail increased while, at the same time, sales of ESQ Movado watches at retail declined, Movado brand sales at wholesale increased less than expected due to retailers tightly managing their inventory.  It is expected that this trend will continue into next year. Sales increases in the luxury brand category were partially offset by net sales decreases in Ebel and Concord brand watches of $3.2 million when compared to the prior year, primarily due to higher sell-in to retailers of newer product and lower promotional sales in the prior year. Also contributing to the increase in sales was a sales increase of $1.4 million in 2015 from after-sales service and all other category, primarily due to sales from special events in the current year., 23468=The number of shares outstanding of the registrant’s Common Stock and Class A Common Stock as of March 24, 2015, were 17,471,383 and 6,644,105, respectively., 963682=The management of the Company is responsible for establishing and maintaining internal control over financial reporting, as such term is defined in Rule 13a-15(f) under the Exchange Act, for the Company. With the participation of the Chief Executive Officer and the Chief Financial Officer, the Company’s management conducted an evaluation of the effectiveness of the Company’s internal control over financial reporting based on the framework and criteria established in the Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on this evaluation, the Company’s management has concluded that the Company’s internal control over financial reporting was effective as of January 31, 2015., 108421=Under an amended and restated license agreement with Tommy Hilfiger Licensing LLC dated September 16, 2009 (as amended the “Tommy Hilfiger License Agreement”), the Company has the exclusive license to use the trademark TOMMY HILFIGER® and related trademarks in connection with the manufacture of watches and jewelry worldwide and in connection with the marketing, advertising, sale and distribution of watches and jewelry at wholesale (and at retail through its outlet stores) worldwide (excluding certain accounts in Japan). The term of the Tommy Hilfiger License Agreement expires December 31, 2019 and may be extended by the Company for an additional five years ending on December 31, 2024, subject to the satisfaction of minimum sales requirements and approval of a new business plan., 341995=2011 *, 713172=Net sales in fiscal 2015 in the retail segment were $64.7 million, representing a 9.2% increase from the prior year sales of $59.3 million. The increase in sales was primarily attributable to the opening of new stores. Comparable outlet store sales increased 2.5% from the prior year sales. As of January 31, 2015 and 2014, the Company operated 38 and 35 outlet stores, respectively., 75882=Concord was founded in 1908 in Bienne, Switzerland. Concord watches have Swiss movements and are made with solid 18 karat gold, stainless steel or a combination of 18 karat gold and stainless steel. Some are set with diamonds., 268627=On November 25, 2014, the Board approved an increase in the Company’s share repurchase program, from $50.0 million, originally approved on March 21, 2013, to $100.0 million. Under the program, the Company is authorized to purchase shares of its outstanding common stock from time to time, depending on market conditions, share price and other factors. The Company may purchase shares of its common stock through open market purchases, repurchase plans, block trades or otherwise. This authorization expires on January 31, 2016. During the twelve months ended January 31, 2015, the Company repurchased a total of 833,973 shares of its common stock at a total cost of approximately $26.4 million, or an average of $31.63 per share., 597997=In the fourth quarter of fiscal 2014, the Company recorded a pre-tax charge of $7.8 million to net sales, for anticipated returns in fiscal 2015 resulting from the Company’s strategic decision to reduce the presence of ESQ Movado watches in certain retail doors while expanding the Movado brand offering. The Company believes it did not fully realize all of the anticipated benefits of this strategy which was intended to drive incremental sales of its more productive Movado brand watch families by utilizing the increased case space at the point of sale that otherwise would have been occupied by relatively less productive ESQ Movado SKUs. Although Movado brand sales at retail increased while, at the same time, as expected, sales of ESQ Movado watches at retail declined, there was less of an increase than expected in the level of Movado watch sales at wholesale due to retailers tightly managing their inventory.  It is expected that this trend will continue into next year. The Company continues to offer ESQ Movado in select retail locations as well as its direct-to-consumer outlet stores and through e-commerce at Movado.com., 583557=Fiscal 2012 other income consists of a pre-tax gain of $0.7 million on the sale of a building which was completed in the second quarter of fiscal 2012., 759363=The Company expects that annual capital expenditures in fiscal 2016 will be approximately $15.0 million as compared to approximately $11.1 million in fiscal 2015. The capital spending will be primarily for projects in the ordinary course of business including facilities’ and Baselworld Watch and Jewelry Show improvements, shop-in-shops, computer hardware and software and tooling costs. The Company has the ability to manage a portion of its capital expenditures on discretionary projects., 921255=Registrant’s 1996 Stock Incentive Plan, amended and restated as of April 8, 2004. Incorporated herein by reference to Exhibit 10.37 to the Registrant’s Annual Report on Form 10-K for the year ended January 31, 2005.*, 269585=An aggregate of 30,105 shares were repurchased during the twelve months ended January 31, 2015 as a result of the surrender of shares of common stock in connection with the vesting of certain restricted stock awards and stock options. At the election of an employee, upon the vesting of a stock award or the exercise of a stock option, shares of common stock having an aggregate value on the vesting of the award or the exercise date of the option, as the case may be, equal to the employee’s withholding tax obligation may be surrendered to the Company by netting them from the vested shares issued. Similarly, shares having an aggregate value equal to the exercise price of an option may be tendered to the Company in payment of the option exercise price and netted from the shares of common stock issued upon the option exercise., 111748=The Company entered into an exclusive worldwide license agreement with Lacoste S.A., Sporloisirs, S.A. and Lacoste Alligator, S.A. in 2006 to design, produce, market and distribute Lacoste watches under the Lacoste® name and the distinctive “alligator” logo beginning in the first half of 2007. On March 28, 2014, the Company entered into an amended and restated license agreement with Lacoste S.A., Sporloisirs S.A. and Lacoste Alligator S.A. which amends and restates the original license agreement with the Licensor and extends its term from January 1, 2015 through December 31, 2022., 35151=In 1970, the Company acquired the Concord brand and the Swiss company that had been manufacturing Concord watches since 1908. In 1983, the Company acquired the U.S. distributor of Movado watches and substantially all of the assets related to the Movado brand from the Swiss manufacturer of Movado watches. The Company changed its name to Movado Group, Inc. in 1996. In March 2004, the Company completed its acquisition of Ebel, one of the world’s premier luxury watch brands that was established in La Chaux-de-Fonds, Switzerland in 1911., 604597=In the fourth quarter of fiscal 2014, gross margin was impacted by a $7.5 million pre-tax charge related to anticipated ESQ Movado watch brand returns and the write down of ESQ Movado excess inventory. This charge resulted from the Company’s decision to reduce the presence of ESQ Movado while expanding the Movado brand offering in certain retail doors. The Company reallocated certain of the ESQ Movado retail space in the first half of fiscal 2015 to drive incremental sales of its more productive Movado brand watch families, and continues to offer ESQ Movado in select retail locations as well as its direct-to-consumer outlet stores and Movado.com., 109907=On March 5, 2012, the Company entered into an amended and restated license agreement with HUGO BOSS Trade Mark Management GmbH & Co. (the “Hugo Boss License Agreement”), extending the term and making certain other changes to the license agreement originally entered by the parties on December 15, 2004, under which the Company received a worldwide exclusive license to use the trademark HUGO BOSS® and any other trademarks containing the names “HUGO” or “BOSS”, in connection with the production, promotion and sale of watches. The term of the Hugo Boss License Agreement continues through December 31, 2018., 192455=The Company leases various facilities in North America, Europe, the Middle East and Asia for its corporate, watch assembly, distribution and sales operations. As of January 31, 2015, the Company’s leased facilities were as follows:, 762152=As of January 30, 2015, no loans were drawn under the Facility; however approximately $3.9 million in letters of credit which were outstanding under the Borrower’s existing asset-based revolving credit facility, which was concurrently terminated as described below, were deemed to be issued and outstanding under the Facility.  As of January 30, 2015, availability under the Facility was approximately $96.1 million., 746739=Operating income of $56.7 million and $47.2 million was recorded in the international location of the Wholesale segment for fiscal 2014 and 2013, respectively, which included $44.2 million and $40.2 million, respectively, of certain profits related to the Company’s supply chain operations. The increase in income of $9.5 million was due to higher gross profit of $13.2 million, which was primarily attributable to higher sales. The higher gross profit was partially offset by higher SG&A expenses of $3.6 million, which included higher marketing expenses of $2.5 million and higher trade show expenses of $2.5 million, primarily related to the Baselworld Watch and Jewelry Show and the effect of fluctuations in foreign currency exchange rates, which unfavorably impacted SG&A expenses for fiscal 2014 by $0.9 million.  These increased SG&A expenses were partially offset by lower compensation and benefit expenses of $2.9 million resulting primarily from a lower accrual for performance-based compensation and lower expenses related to separation agreements., 860788=Pursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated., 40478=1992, 845211=The information required by this item is included in the Company’s Proxy Statement for the 2015 annual meeting of shareholders under the captions “Executive Compensation” and “Compensation of Directors” and is incorporated herein by reference., 808919=In August 2014, FASB issued 2014-15, “Presentation of Financial Statements-Going Concern.” This pronouncement provides guidance on the Company’s responsibility to perform interim and annual assessments of an entity’s ability to continue as a going concern and to provide related disclosure requirements. This pronouncement applies to all entities and is effective for annual periods ending after December 15, 2016, and interim periods thereafter, with early adoption permitted. This pronouncement will not have a material impact on the Company’s consolidated financial statements., 932301=Amended and Restated License Agreement among Tommy Hilfiger Licensing LLC, Movado Group, Inc. and Swissam Products Limited, dated as of September 16, 2009. Incorporated herein by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended October 31, 2009., 847128=The information required by this item is included in the Company’s Proxy Statement for the 2015 annual meeting of shareholders under the caption “Certain Relationships and Related Transactions” and is incorporated herein by reference., 837906=The Company, under the supervision and with the participation of its management, including the Chief Executive Officer and the Chief Financial Officer, evaluated the effectiveness of the Company’s disclosure controls and procedures, as such terms are defined in Rule 13a-15(e) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”). Based on that evaluation, the Chief Executive Officer and the Chief Financial Officer concluded that the Company’s disclosure controls and procedures are effective at a reasonable assurance level as of the end of the period covered by this report., 900273=8-K filed on July 14, 2014., 755480=At January 31, 2015, the Company had working capital of $419.2 million as compared to $401.7 million in the prior year. The Company defines working capital as the difference between current assets and current liabilities., 817529=In addition, the Company has certain debt obligations with variable interest rates, which are based on LIBOR plus a fixed additional interest rate. The Company does not hedge these interest rate risks. As of January 31, 2015, the Company had no outstanding debt. For additional information concerning potential changes to future interest obligations, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Liquidity and Capital Resources.”, 809752=In May 2014, FASB issued ASU 2014-09, “Revenue from Contracts with Customers.” The pronouncement affects any entity that either enters into contracts with customers to transfer goods or services or enters into contracts for the transfer of nonfinancial assets, unless those contracts are within the scope of other standards (for example, insurance contracts or lease contracts). The core principle of the guidance is that an entity should recognize revenue to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled in exchange for those goods or services. The, 728998=The Company recorded a tax expense of $19.3 million and of $17.4 million for fiscal 2015 and 2014, respectively. The effective tax rate for fiscal 2015 was 27.1%, primarily as a result of foreign profits being taxed in lower taxing jurisdictions and the recognition of a tax benefit related to intercompany transactions in certain jurisdictions. The effective tax rate for fiscal 2014 was 25.2%, primarily as a result of foreign profits being taxed in lower taxing jurisdictions and the release of liabilities for uncertain tax positions as a result of favorable U.S. and foreign audit settlements, which were partially offset by no tax being realized on certain foreign net operating losses.  See Note 7 to the Company’s Consolidated Financial Statements for further information regarding income taxes., 297777=The performance graph set forth below compares the cumulative total shareholder return of the Company’s shares of common stock for the last five fiscal years through the fiscal year ended January 31, 2015 with that of the Broad Market (NYSE Stock Market – U.S. Companies), the S&P SmallCap 600 Index and the Russell 2000 Index. Each index assumes an initial investment of $100.0 on January 31, 2010 and the reinvestment of dividends (where applicable)., 940304=Second Amendment entered into as of September 30, 2012 to Amended and Restated License Agreement dated September 16, 2009 by and between the Registrant, Swissam Products Limited and Tommy Hilfiger Licensing, LLC. Incorporated herein by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended October 31, 2012. , 213096=July 2015, 902619=Specimen Common Stock Certificate. Incorporated herein by reference to Exhibit 4.1 to the Registrant’s Annual Report on Form 10-K for the year ended January 31, 1998., 616465=Accounts receivable are reduced by an allowance for amounts that may be uncollectible in the future. Estimates are used in determining the allowance for doubtful accounts and are based on an analysis of the aging of accounts receivable, assessments of collectability based on historic trends, the financial condition of the Company’s customers and an evaluation of economic conditions. In general, the actual bad debt losses have historically been within the Company’s expectations and the allowances it established. As of January 31, 2015, except for those accounts provided for in the reserve for doubtful accounts, the Company knew of no situations with any of the Company’s major customers which would indicate the customer’s inability to make their required payments., 855254=Pursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized., 197317=July 2019, 830874=Consolidated Statements of Changes in Equity for the fiscal years ended January 31, 2015, 2014 and 2013, 749990=Interest expense was $0.4 million for both fiscal 2014 and 2013, which primarily consisted of the amortization of deferred financing costs. For borrowings data for the fiscal years ended January 31, 2014 and 2013, see Note 4 to the Consolidated Financial Statements., 52654=2013, 618050=The Company previously valued its inventory at the lower of cost or market. Effective February 1, 2011, the Company changed its method of valuing its U.S. inventories to the average cost method. With this change, all of the Company’s inventories are now valued using the average cost method. The Company believes that the average cost method of inventory valuation is preferable because (1) it permits the Company to use a single method of accounting for all of the Company’s U.S. and international inventories, (2) it aligns costs with the Company’s forecasting and procurement decisions, and (3) since a number of the Company’s key competitors use the average cost method, it improves comparability of the Company’s financial statements. The Company reviews its on-hand inventory to determine amounts, if any, of inventory that is deemed discontinued, excess, or unsaleable. Inventory classified as discontinued, together with the related component parts that can be assembled into saleable finished goods, is sold primarily through the Company’s outlet stores. When management determines that finished product is unsaleable or that it is impractical to build the excess components into watches for sale, a charge is recorded to value those products and components at the lower of cost or market value., 918597=Master Credit Agreement dated August 17, 2004 and August 20, 2004 between MGI Luxury Group S.A. and UBS AG. Incorporated herein by reference to Exhibit 10.2 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended July 31, 2004., 727537=Interest expense was $0.5 million and $0.4 million for fiscal 2015 and 2014, respectively, which primarily consisted of the amortization of deferred financing costs., 846177=The information required by this item is included in the Company’s Proxy Statement for the 2015 annual meeting of shareholders under the caption “Security Ownership of Certain Beneficial Owners and Management” and is incorporated herein by reference., 736158=Net sales in fiscal 2014 in the retail segment were $59.3 million, representing a 5.5% increase from the prior year sales of $56.2 million. The increase in sales was primarily attributable to the opening of new stores. Comparable outlet store sales increased 1.5% from the prior year sales. As of January 31, 2014, the Company operated 35 outlet stores, compared to 34 outlet stores at the end of the prior year., 199274=June 2018, 42482=1999, 112644=On March 22, 2012, the Company entered into an exclusive worldwide license agreement with Ferrari S.p.A. to use certain well known trademarks of Ferrari including the S.F. and Prancing Horse device in shield, FERRARI OFFICIAL LICENSED PRODUCT and SCUDERIA FERRARI, in connection with the manufacture, advertising, merchandising, promotion, sale and distribution of watches with a suggested retail price not exceeding €1,500 (the “Ferrari License Agreement”). The current term of the Ferrari License Agreement is through December 31, 2017., 761007=On January 30, 2015, the Company, together with Movado Group Delaware Holdings Corporation, Movado Retail Group, Inc. and Movado LLC (together with the Company, the “Borrowers”), each a wholly-owned domestic subsidiary of the Company, entered into a Credit Agreement (the “Credit Agreement”) with the lenders party thereto and Bank of America, N.A. as administrative agent (in such capacity, the “Agent”).  The Credit Agreement provides for a $100.0 million senior secured revolving credit facility (the “Facility”) including a $15.0 million letter of credit sub-facility that matures on January 30, 2020, with provisions for uncommitted increases of up to $50.0 million in the aggregate subject to customary terms and conditions.  In connection with the Credit Agreement, the Borrowers also entered into a Security and Pledge Agreement dated as of January 30, 2015 in favor of the Agent (“Security Agreement”)., 946660=Third Amendment entered into as of November 13, 2013 to Amended and Restated License Agreement dated September 16, 2009 by and between the Registrant, Swissam Products Limited and Tommy Hilfiger Licensing, LLC. Incorporated herein by reference to Exhibit 10.43 to the Registrant’s Annual Report on Form 10-K for the year ended January 31, 2014., 726806=Other income for fiscal 2014 consisted of a $1.5 million pre-tax gain on the sale of a building. The Company received cash proceeds from the sale of $2.2 million in the first quarter of fiscal year 2014. Prior to the sale, the building had been classified as an asset held for sale in other current assets., 771067=On March 21, 2013, the Board approved a share repurchase program under which the Company was authorized to purchase up to $50.0 million of its outstanding common stock from time to time, depending on market conditions, share price and other factors. The Company may purchase shares of its common stock through open market purchases, repurchase programs, block trades or otherwise. On November 25, 2014, the Board increased the amount of the share repurchase authorization to $100.0 million. This authorization expires on January 31, 2016. During the twelve months ended January 31, 2015, the Company repurchased a total of 833,973 shares of its common stock at a total cost of approximately $26.4 million, or an average of $31.63 per share., 728482=Interest income was $0.2 million and $0.1 million for fiscal 2015 and 2014., 942844=Movado Group, Inc. Amended and Restated Deferred Compensation Plan for Executives, effective January 1, 2013. Incorporated herein by reference to Annex B to the Registrant’s Definitive Proxy Statement on Schedule 14A filed on May 2, 2013. *, 713774=The Company considers comparable store sales to be sales of stores that were open as of February 1st of the prior fiscal year through January 31st of the current fiscal year. The Company had 33 comparable outlet stores for the year ended January 31, 2015. The sales from stores that have been relocated, renovated or refurbished are included in the calculation of comparable store sales. The method of calculating comparable store sales varies across the retail industry. As a result, the Company’s method for the calculation of comparable store sales may not be the same as measures used or reported by other companies., 607555=Selling, General and Administrative (“SG&A”) Expenses.    The Company’s SG&A expenses consist primarily of marketing, selling, distribution, general and administrative expenses. In fiscal 2014, the Company recorded a $2.0 million pre-tax charge related to donations made to the Movado Group Foundation. In fiscal 2014, the Company also recorded a $0.8 million pre-tax charge related to the write down of excess displays and point of sale materials, as a result of the Company’s decision to reduce the presence of ESQ Movado while expanding the Movado brand offering in certain retail doors. In fiscal 2013 the Company recorded a $3.0 million pre-tax charge related to donations made to the Movado Group Foundation.  , 233161=As of March 24, 2015, there were 51 holders of record of the Company’s class A common stock and, the Company estimates, 6,100 beneficial owners of the common stock represented by 414 holders of record. The Company’s common stock is traded on the New York Stock Exchange under the symbol “MOV” and on March 24, 2015, the closing price of the Company’s common stock was $25.37. In connection with the October 7, 1993 public offering, each share of the Company’s then currently existing class A common stock was converted into 10.46 shares of new class A common stock, par value of $0.01 per share (the “class A common stock”). Each share of common stock is entitled to one vote per share and each share of class A common stock is entitled to 10 votes per share on all matters submitted to a vote of the shareholders. Each holder of class A common stock is entitled to convert, at any time, any and all such shares into the same number of shares of common stock. Each share of class A common stock is converted automatically into common stock in the event that the beneficial or record ownership of such shares of class A common stock is transferred to any person, except to certain family members or affiliated persons deemed “permitted transferees” pursuant to the Company’s Restated Certificate of Incorporation as amended. The class A common stock is not publicly traded and consequently, there is currently no established public trading market for these shares. The following table sets forth high and low bid quotations reported for the Company’s common stock for each quarter during fiscal 2015 and 2014 and the dividends declared per share in respect of each such quarter., 731019=Fiscal 2014 Compared to Fiscal 2013, 936416=Third Amendment dated as of June 1, 2011 to the License Agreement dated as of November 15, 2005 by and between L.C. Licensing, Inc., Registrant and Swissam Products Limited. Incorporated herein by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended July 31, 2011., 82848=Movado is a hallmark of some of the most famous timepieces ever created, most notably, the Movado Museum® Watch. Designed in 1947 by Bauhaus-influenced artist Nathan George Horwitt, the watch dial defined by a solitary dot at 12, symbolizing the sun at high noon, has been acclaimed for purity of design unrivaled in the history of time-keeping. When Horwitt’s dial was selected for the permanent design collection of the Museum of Modern Art, New York, in 1960, it became the first watch dial ever awarded this distinction. Known today as the Movado Museum Watch, this legendary dial is regarded as an icon of Modernism. A trademarked and award-winning design, the celebrated single dot dial now distinguishes a wide range of Movado timepieces., 211143=August 2019, 948921=Credit Agreement, dated as of January 30, 2015, by and among Movado Group, Inc., Movado Group Delaware Holdings Corporation, Movado Retail Group, Inc. and Movado LLC, as Borrowers, the lenders party thereto from time to time and Bank of America, N.A., as administrative agent. Incorporated herein by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed February 5, 2015., 587542=Fiscal 2012 effective tax rate of 1.8% includes a release of a valuation allowance against net deferred tax assets in Switzerland, partially offset by the accrual of a Swiss withholding tax settlement, the continued recording of other valuation allowances, most notably the valuation allowance against net U.S. deferred tax assets, and the tax accrued on the repatriation of foreign earnings., 919931=Fifth Amendment of Lease dated October 20, 2003 between Mack-Cali Realty, L.P. as landlord, and the Registrant as tenant further amending the lease dated as of December 21, 2000. Incorporated herein by reference to Exhibit 10.29 to the Registrant’s Annual Report on Form 10-K for the year ended January 31, 2004., 201253=October 2017, 861659=Dated: March 31, 2015, 912056=Second Amendment of Lease dated July 26, 2001 between Mack-Cali Realty, L.P., as landlord, and Movado Group, Inc., as tenant, further amending lease dated as of December 21, 2000. Incorporated herein by reference to Exhibit 10.2 to the Registrant’s Quarterly Report on Form 10-Q filed for the quarter ended October 31, 2001., 760069=Cash used in financing activities amounted to $36.2 million and $16.5 million for fiscal 2015 and 2014, respectively. Cash used in financing activities for both fiscal 2015 and 2014, was primarily due to the repurchase of the Company’s common stock and to pay dividends, partially offset by the result of stock option exercises for the year. In fiscal 2015, cash used in financing activities also included payment of debt issuance costs and distribution of noncontrolling interest earnings. Management believes that the cash on hand in addition to the expected cash flow from operations and the Company’s short-term borrowing capacity will be sufficient to meet its working capital needs for at least the next twelve months., 606489=Since a substantial amount of the Company’s product costs are incurred in Swiss francs, fluctuations in the U.S. dollar/Swiss franc exchange rate can impact the Company’s cost of goods sold and, therefore, its gross margins. The Company reduces its exposure to the Swiss franc exchange rate risk through a hedging program. Under the hedging program, the Company manages most of its foreign currency exposures on a consolidated basis, which allows it to net certain exposures and take advantage of natural offsets. In the event these exposures do not offset, the Company has the ability to hedge its Swiss franc purchases using a combination of forward contracts and purchased currency options. The Company’s hedging program mitigated the impact of the exchange rate fluctuations on product costs and gross margins for fiscal years 2015, 2014 and 2013., 591316=Effective February 1, 2011, the Company changed its method of valuing its U.S. inventory to the average cost method. The consolidated financial statements of fiscal 2011 have been adjusted to apply the new accounting method retroactively., 752785=For fiscal 2014 and 2013, the Company recorded net income attributed to Movado Group, Inc. of $50.9 million and $57.1 million, respectively., 228398=The Company leases retail space averaging 1,700 square feet per store with leases expiring from January 2016 to September 2025 for the operation of the Company’s 38 outlet stores in the United States. The Company believes that its existing facilities are suitable and adequate for its current operations., 929638=Amendment Number 1 to the April 8, 2004 Amendment and Restatement of the Movado Group, Inc. 1996 Stock Incentive Plan. Incorporated herein by reference to Exhibit 10.4 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended July 31, 2008.*, 857236=Dated: March 31, 2015, 586076=Fiscal 2013 effective tax rate of (18.0)% includes a tax benefit of $19.8 million attributable to the reversal of a majority of the valuation allowance on the U.S. net deferred tax assets and a tax benefit of $0.5 million attributable to foreign business restructurings in Japan and the UK., 166586=A significant portion of the Company’s inventory purchases are denominated in Swiss francs. The Company reduces its exposure to the Swiss franc exchange rate risk through a hedging program. Under the hedging program, the Company manages most of its foreign currency exposures on a consolidated basis, which allows it to net certain exposures and take advantage of natural offsets. In the event these exposures do not offset, the Company has the ability under a hedging program to utilize forward exchange contracts and purchased foreign currency options to mitigate foreign currency risk. If these hedge instruments are unsuccessful at minimizing the risk or are deemed ineffective, any fluctuation of the Swiss franc exchange rate could impact the future results of operations. Changes in currency exchange rates may also affect relative prices at which the Company and its foreign competitors sell products in the same market. Additionally, a portion of the Company’s net sales are recorded in its foreign subsidiaries in a currency other than the local currency of that subsidiary. This predominantly occurs in the Company’s Hong Kong and Swiss subsidiaries when they sell to Euro and British Pound based customers. As of January 31, 2015, this exposure was not hedged by the Company. Starting in fiscal 2016 the Company plans to utilize forward exchange contracts to mitigate this exposure. Any fluctuation in the Euro and British Pound exchange rates in relation to the Hong Kong dollar and Swiss franc would have an effect on these sales that are recorded in Euros and British Pounds. The currency effect on these sales has an equal effect on their recorded gross profit since the costs of these sales are recorded in the entities’ respective local currency. As a result of these and other foreign currency sales, certain of the Company’s subsidiaries have outstanding foreign currency receivables. Furthermore, since the Company’s consolidated financial statements are presented in U.S. dollars, revenues, income and expenses, as well as assets and liabilities of foreign currency denominated subsidiaries must be translated into U.S. dollars at exchange rates in effect during or at the end of each reporting period. Fluctuations in foreign currency exchange rates could adversely affect the Company’s reported revenues, earnings, financial position and the comparability of results of operations from period to period., 736789=The Company considers comparable store sales to be sales of stores that were open as of February 1st of the prior fiscal year through January 31st of the current fiscal year. The Company had 32 comparable outlet stores for the year ended January 31, 2014. The sales from stores that have been relocated, renovated or refurbished are included in the calculation of comparable store sales. The method of calculating comparable store sales varies across the retail industry. As a result, the Company’s method for the calculation of comparable store sales may not be the same as measures used or reported by other companies., 56122=On November 25, 2014, the Board approved an increase in the Company’s share repurchase program, from $50.0 million, originally approved on March 21, 2013, to $100.0 million. Under the program, the Company is authorized to purchase shares of its outstanding common stock from time to time, depending on market conditions, share price and other factors. The Company may purchase shares of its common stock through open market purchases, repurchase plans, block trades or otherwise. This authorization expires on January 31, 2016., 615732=In the fourth quarter of fiscal 2013, the Company recorded a pre-tax charge of $4.9 million related to the repositioning of the Coach watch brand from a collection, which was priced for sale in a department store’s fine watch department to one suitable for sale in the fashion watch department., 327542=Russell 2000 Index, 141785=The Company has the right to produce, market and distribute watches under the brand names of ESQ, Coach, Tommy Hilfiger, HUGO BOSS, Juicy Couture, Scuderia Ferrari and Lacoste pursuant to license agreements with the respective owners of those trademarks. There are certain minimum royalty payments as well as other requirements associated with these agreements. Failure to meet any of these requirements could result in the loss of the license. Additionally, after the term of any license agreement has concluded, the licensor may decide not to renew with the Company. For the fiscal year ended January 31, 2015, the above mentioned licensed brands represented approximately 51% of the Company’s net sales. While no individual licensed brand represented net sales greater than 20% of the Company’s total consolidated net sales, the loss of any single licensed brand could have a material adverse effect on the Company’s results of operations and although the Company is not substantially dependent on a particular license brand, the loss of one or more of the Company’s licenses could result in loss of future revenues which could adversely affect its financial condition. In addition, the Company’s revenues and profitability under its various license agreements may change from period to period due to various factors, including the maturity of the Company's relationship with the respective licensor, changes in consumer preferences, brand repositioning activities and other factors, some of which are outside of the Company's control., 98336=At March 24, 2015, the Company had unfilled orders of $54.1 million compared to $30.4 million at March 19, 2014 and $35.7 million at March 14, 2013. Unfilled orders include both confirmed orders and orders that the Company believes will be confirmed based on the historic experience with the customers. It is customary for many of the Company’s customers not to confirm their future orders with formal purchase orders until shortly before their desired delivery dates., 951451=Amended and Restated License Agreement dated January 13, 2015 between the Registrant, Swissam Products Limited and Coach, Inc.**, 575057=Fiscal 2014 includes a $2.5 million pre-tax duty refund received relating to payments made by the Company in calendar years 2008 through 2011 for drawback claims filed with U.S. Customs & Border Protection and a $7.5 million pre-tax charge related to anticipated ESQ Movado product returns and the write down of ESQ Movado excess inventory. This charge resulted from the Company’s decision to reduce the presence of ESQ Movado while expanding the Movado brand offering in certain retail doors., 615251=In the fourth quarter of fiscal 2014, the Company recorded a pre-tax charge of $7.8 million to sales, for anticipated returns resulting from the Company’s decision to reduce the presence of ESQ Movado while expanding the Movado brand offering in certain retail doors., 906605=Registrant’s 1996 Stock Incentive Plan amending and restating the 1993 Employee Stock Option Plan. Incorporated herein by reference to Exhibit 10.5 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended October 31, 1996. *, 725744=Operating income of $13.3 million and $12.5 million was recorded in the retail segment for fiscal 2015 and 2014, respectively. The $0.8 million increase in operating income was the result of an increase in gross profit of $2.6 million, partially offset by an increase in SG&A expenses of $1.8 million. The increase in gross profit of $2.6 million was primarily attributable to higher sales and partially offset by a lower gross margin percentage. The increase in SG&A expenses of $1.8 million was primarily due to higher compensation, benefit expenses and occupancy expenses related to the opening of new stores in the current year., 341054=2012, 731452=Net sales in fiscal 2014 were $570.3 million, $64.8 million or 12.8% above the prior year. Net sales in fiscal 2014 included an additional pre-tax charge of $7.8 million to sales, for anticipated returns in fiscal 2015 resulting from the Company’s decision to reduce the presence of ESQ Movado while expanding the Movado brand offering in certain retail doors.  Net sales in fiscal 2013 included a sales allowance of $4.9 million related to the repositioning of the Coach watch brand from a watch line, which was priced for sale in a department store’s fine watch department to one suitable for sale in the fashion watch department. For fiscal 2014, fluctuations in foreign currency exchange rates favorably impacted net sales by $3.0 million when compared to the prior year., 77813=ESQ watches have been marketed by the Company since fiscal 2013 as a collection within the Movado brand. The watches are priced to compete in the entry level Swiss watch category and are defined by bold sport and fashion designs. All ESQ watches contain Swiss movements and most are made with stainless steel, gold finish or a combination of stainless steel and gold finish, with leather straps, stainless steel bracelets or gold finish bracelets. In the fourth quarter of fiscal 2014, the Company made the strategic decision to reduce the presence of ESQ watches while expanding the Movado brand offering in certain retail doors and the Company recorded a pre-tax charge of $7.8 million to sales in fiscal 2014 for anticipated ESQ watch returns in fiscal 2015. This strategy was intended to drive incremental sales of the Company’s more profitable Movado brand watch families by utilizing the increased case space at the point of sale that otherwise would have been occupied by relatively less productive ESQ Movado SKUs. The Company continues to offer ESQ Movado in select retail locations as well as its direct-to-consumer outlet stores and through e-commerce at Movado.com., 903846=License agreement dated January 1, 1992, between The Hearst Corporation and the Registrant, as amended on January 17, 1992. Incorporated herein by reference to Exhibit 10.8 to the Registrant’s Registration Statement on Form S-1 (Registration No. 33-666000)., 715408=Gross profit for fiscal 2015 was $310.0 million or 52.8% of net sales as compared to $305.3 million or 53.5% of net sales in the prior year. The increase in gross profit of $4.7 million was primarily due to higher net sales for the current year partially offset by a lower gross margin percentage. The gross margin percentage for fiscal 2015 decreased by approximately 70 basis points. The decrease reflects the unfavorable impact of fluctuations in foreign currency exchange rates of approximately 60 basis points, an unfavorable shift in channel and product mix of approximately 40 basis points, and a duty refund received in the prior year relating to payments made by the Company in calendar years 2008 through 2011 for drawback claims filed with U.S. Customs & Border Protection of approximately 40 basis points. These decreases were partially offset by the positive impact of approximately 60 basis points due to the Company’s decision to reduce the presence of ESQ Movado while expanding the Movado brand offering in certain retail doors and the positive impact of approximately 10 basis points resulting from leverage gained on certain fixed costs due to the increase in sales volume year-over-year., 959174=The following materials from the Company’s Form 10-K for the year ended January 31, 2015, formatted in XBRL (eXtensible Business Reporting Language), (i) Consolidated Balance Sheets, (ii) Consolidated Statements of Operations, (iii) the Consolidated Statements of Comprehensive Income, (iv) Consolidated Statements of Cash Flows, (v) Consolidated Statements of Changes in Equity, (vi) Notes to the Consolidated Financial Statements, (vii) Schedule II- Valuation and Qualifying Accounts and Reserves., 717082=SG&A expenses for fiscal 2015 were $238.5 million, representing an increase from the prior year of $1.0 million or 0.4%. The increase in SG&A expenses was attributable to higher compensation and benefit expense of $7.9 million primarily in support of the Company’s brand building and growth initiatives.  Also contributing to the increase in SG&A expenses was the unfavorable effect of fluctuations in foreign currency exchange rates of $1.8 million, which was the result of losses on Euro receivables in entities whose functional currency is not the Euro.  Also contributing to the increase in SG&A expenses were higher other selling expenses of $2.1 million, higher trade show expenses of $1.0 million (primarily related to the Baselworld Watch and Jewelry Show), higher rent related expenses of $0.7 million (primarily related to the opening of new stores and warehousing expansion), higher bad debt expense of $0.6 million and higher depreciation and amortization expense of $0.3 million.  The increases in SG&A expenses were partially offset by a decrease in performance-based compensation of $9.0 million, resulting from the Company not meeting certain financial targets, lower marketing expense of $2.4 million, which included a $0.8 million pre-tax charge in the prior year related to the write down of unused displays and point of sale materials, as a result of the Company’s strategic decision to reduce the presence of ESQ Movado watches while expanding the Movado brand offering in certain retail doors, and a decrease of $2.0 million of charitable contributions, related to the prior year contribution of $2.0 million to the Movado Group Foundation., 750686=Interest income was $0.1 million for both fiscal 2014 and 2013., 814489=As of January 31, 2015, the Company’s entire net forward contracts hedging portfolio consisted of 38.0 million Swiss francs equivalent for various expiry dates ranging through July 15, 2015 compared to a portfolio of 48.0 million Swiss francs equivalent for various expiry dates ranging through July 17, 2014 as of January 31, 2014. If the Company were to settle its Swiss franc forward contracts at January 31, 2015, the net result would be a gain of $0.8 million, net of tax expense of $0.4 million. The Company had no Swiss franc option contracts related to cash flow hedges as of January 31, 2015 or January 31, 2014., 571699=Fiscal 2014 net sales include a pre-tax charge of $7.8 million for anticipated returns in fiscal 2015, as a result of the Company’s decision to reduce the presence of ESQ Movado while expanding the Movado brand offering in certain retail doors., 939091=License Agreement entered into as of March 22, 2012 by and between the Registrant and Ferrari S.p.A. Incorporated herein by reference to Exhibit 10.40 to the Registrant’s Annual Report on Form 10-K for the year ended January 31, 2012., 116829=As of January 31, 2015, the Company had approximately 1,110 full-time employees in its global operations. No employee of the Company is represented by a labor union or is subject to a collective bargaining agreement. The Company has never experienced a work stoppage due to labor difficulties and believes that its employee relations are good., 945585=Movado Group, Inc. 1996 Stock Incentive Plan, Amended and Restated as of April 8, 2013. Incorporated herein by reference to Annex A to the Registrant’s Definitive Proxy Statement on Schedule 14A filed on May 2, 2013. *, 719248=Operating income of $58.2 million and $55.2 million, which included $19.3 million and $26.5 million of unallocated corporate expenses, was recorded in the Wholesale segment for fiscal 2015 and 2014, respectively. The $3.0 million increase in operating income was the net result of an increase in gross profit of $2.1 million and a decrease in SG&A expenses of $0.9 million. The increase in gross profit of $2.1 million was primarily due to higher net sales and partially offset by a lower gross margin percentage. Gross profit in the prior year was negatively impacted by a $7.5 million pre-tax charge related to the anticipated ESQ Movado watch brand returns and the write down of ESQ Movado excess inventory. The decrease in SG&A expense included a decrease in performance-based compensation of $9.0 million, resulting from the Company not meeting certain financial targets. Also contributing to the decrease was lower marketing expense of $2.4 million (which included a $0.8 million pre-tax charge in the prior year related to the write down of unused displays and point of sale materials, as a result of the Company’s strategic decision to reduce the presence of ESQ Movado watches while expanding the Movado brand offering in certain retail doors), and a decrease of $2.0 million of charitable contributions related to the prior year contribution of $2.0 million to the Movado Group Foundation. These decreases in SG&A expenses were partially offset by higher compensation and benefit expense of $7.0 million primarily in support of the Company’s brand building and growth initiatives and the unfavorable effect of fluctuations in foreign currency exchange rates of $1.8 million, which was the result of losses on Euro receivables in entities whose functional currency is not the Euro. Also contributing to the partial offset were higher other selling expenses of $2.0 million, higher trade show expenses of $1.0 million, primarily related to the Baselworld Watch and Jewelry Show, higher bad debt expense of $0.6 million, higher depreciation and amortization expense of $0.2 million, and higher rent related expenses of $0.2 million, primarily related to warehousing expansion., 751190=The Company recorded a tax expense of $17.4 million and a tax benefit of $8.8 million for fiscal 2014 and 2013, respectively.  Fiscal 2013 included a tax benefit of $19.8 million attributable to the reversal of a majority of the valuation allowance on the U.S. net deferred tax assets. The effective tax rate for fiscal 2014 was 25.2%. The effective tax rate for fiscal 2014 was primarily the result of foreign profits being taxed in lower taxing jurisdictions and the release of liabilities for uncertain tax positions as a result of favorable U.S. and foreign audit settlements partially offset by no tax benefit being realized on certain foreign net operating losses.  The effective tax rate for fiscal 2013 was -18.0%.  The effective tax rate for fiscal 2013 was primarily the result of the release of the majority of a valuation allowance against net deferred tax assets in the United States, and the net tax benefit related to foreign business restructurings in Japan and the UK. See Note 7 to the Company’s Consolidated Financial Statements for further information regarding income taxes., 824790=Consolidated Statements of Operations for the fiscal years ended January 31, 2015, 2014 and 2013, 110849=In November 2005, the Company entered into a license agreement with L.C. Licensing, Inc., for the exclusive worldwide license to use the trademarks JUICY COUTURE® and related trademarks in connection with the manufacture, advertising, merchandising, promotion, sale and distribution of timepieces and components (as amended, the “Juicy Couture License Agreement”). In November 2013, L.C. Licensing, Inc. assigned its entire interest in the Juicy Couture License Agreement to ABG Juicy Couture, LLC. The current term of the Juicy Couture License Agreement is through December 31, 2016., 806849=Unrecognized tax benefits at January 31, 2015 of $2.7 million and accrued interest and penalties of $0.8 million (both gross of tax benefit) are not included above. The final outcome of tax uncertainties is dependent upon various matters including tax examinations, interpretation of the applicable tax laws or expiration of statutes of limitations. The Company believes that its tax positions comply with applicable tax law and that it has adequately provided for these matters. However, the audits may result in proposed assessments where the ultimate resolution may result in the Company owing additional taxes. Management anticipates that it is reasonably possible that the total gross amount of unrecognized tax benefits will decrease by approximately $0.3 million in the next 12 months due to the potential expiration of the statute of limitations for certain tax return examinations, a portion of which may affect the effective tax rate; however, management does not currently anticipate a significant effect on net earnings. Future developments may result in a change in this assessment., 675939=2013 % of net sales, 55623=Also, on January 30, 2015, the Company entered into an amended and restated license agreement with Coach, Inc. that amends and restates the original license agreement which the Company had entered into on December 9, 1996, and extends its term from June 30, 2015 through June 30, 2020., 930978=Amendment Number 2 to Movado Group, Inc. 1996 Stock Incentive Plan as Amended and Restated as of April 8, 2004. Incorporated herein by reference to Annex A to the Registrant’s Definitive Proxy Statement filed with the SEC on May 8, 2009.*, 48578=2007, 966668=In our opinion, the consolidated financial statements listed in the index appearing under item 15(a)1 present fairly, in all material respects, the financial position of Movado Group, Inc. and its subsidiaries (the “Company”) at January 31, 2015 and January 31, 2014, and the results of their operations and their cash flows for each of the three years in the period ended January 31, 2015 in conformity with accounting principles generally accepted in the United States of America.  In addition, in our opinion, the financial statement schedule listed in the index appearing under Item 15(a)(2) presents fairly, in all material respects, the information set forth therein when read in conjunction with the related consolidated financial statements.  Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of January 31, 2015, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).  The Company's management is responsible for these financial statements and financial statement schedule, for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in Management's Annual Report on Internal Control Over Financial Reporting appearing in the accompanying index.  Our responsibility is to express opinions on these financial statements, on the financial statement schedule, and on the Company's internal control over financial reporting based on our integrated audits. We conducted our audits in accordance with the standards of the Public Company Accounting Oversight Board (United States).  Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement and whether effective internal control over financial reporting was maintained in all material respects.  Our audits of the financial statements included examining, on a test basis, evidence supporting the amounts and disclosures in the financial statements, assessing the accounting principles used and significant estimates made by management, and evaluating the overall financial statement presentation.  Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk.  Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions., 909280=Lease made December 21, 2000 between the Registrant and Mack-Cali Realty, L.P. for premises in Paramus, New Jersey together with First Amendment thereto made December 21, 2000. Incorporated herein by reference to Exhibit 10.22 to the Registrant’s Annual Report on Form 10-K for the year ended January 31, 2000., 721909=Operating income of $5.5 million and an operating loss of $1.5 million, which included $19.3 million and $26.5 million of unallocated corporate expenses, was recorded in the United States location of the Wholesale segment for fiscal 2015 and 2014, respectively. The increase in income of $7.0 million was due to lower SG&A expenses of $4.2 million and higher gross profit of $2.8 million, which was primarily attributable to higher sales and partially offset by a lower gross margin percentage. The decrease in SG&A expense included lower compensation and benefit expense of $2.5 million (resulting from a decrease in performance-based compensation, partially offset by higher headcount, salaries and stock award expenses) and a decrease of $2.0 million of charitable contributions. These decreases were partially offset by higher marketing expense of $0.7 million, which included a $0.8 million pre-tax charge in the prior year related to the write down of unused displays and point of sale materials, as a result of the Company’s strategic decision to reduce the presence of ESQ Movado watches while expanding the Movado brand offering in certain retail doors. The increase in gross profit of $2.8 million was primarily due to higher sales and the non-recurrence of a $7.5 million pre-tax charge that affected the prior year related to the anticipated ESQ Movado watch brand returns and the write down of ESQ Movado excess inventory.  , 619588=In the fourth quarter of fiscal 2014, the Company recorded inventory reserves of $2.6 million related to the write down of ESQ Movado excess watch inventory as a result of the Company’s decision to reduce the presence of ESQ Movado while expanding the Movado brand offering in certain retail doors., 753364=At January 31, 2015 and January 31, 2014, the Company had $199.9 million and $157.7 million of cash and cash equivalents, $192.4 million and $120.7 million of which consisted of cash and cash equivalents at the Company’s foreign subsidiaries, respectively. At January 31, 2014, one of the Company’s foreign subsidiaries also had invested $33.1 million in a six-month time deposit which matured on July 24, 2014, labeled as Short-term Investments on the Consolidated Balance Sheet.  The majority of the foreign cash balances are associated with earnings that the Company has asserted are permanently reinvested, and which are required to support continued growth outside the U.S. through funding of capital expenditures, operating expenses and similar cash needs of the foreign, 236014=Fiscal Year Ended January 31, 2015, 24096=Portions of the definitive proxy statement relating to registrant’s 2015 annual meeting of shareholders (the “Proxy Statement”) are incorporated by reference in Part III hereof., 804684=The Company had outstanding purchase obligations with suppliers at the end of fiscal 2015 for raw materials, finished watches and packaging in the normal course of business. These purchase obligation amounts do not represent total anticipated purchases but represent only amounts to be paid for items required to be purchased under agreements that are enforceable, legally binding and specify minimum quantity, price and term., 826318=Consolidated Statements of Comprehensive Income for the fiscal years ended January 31, 2015, 2014 and 2013, 890633=Dated: March 31, 2015, 15422=Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days. Yes  x    No  ¨, 925360=Amended and Restated License Agreement between MGI Luxury Group, S.A., a wholly owned Swiss subsidiary of Movado Group, Inc., Lacoste S.A., Sporloisirs S.A. and Lacoste Alligator S.A., dated March 28, 2014 with an effective date as of January 1, 2015.  Incorporated herein by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K/A filed, December 30, 2014., 842568=The information required by this item is included in the Company’s Proxy Statement for the 2015 annual meeting of shareholders under the captions “Election of Directors” and “Management” and is incorporated herein by reference., 582374=Fiscal 2014 other income consists of a pre-tax gain of $1.5 million on the sale of a building which was completed in the first quarter of fiscal 2014., 281574=December 1, 2014 – December 31, 2014, 743995=Operating loss of $1.5 million and $9.2 million, which included $26.5 million and $27.2 million of unallocated corporate expenses, was recorded in the United States location of the Wholesale segment for fiscal 2014 and 2013, respectively. The decrease in loss of $7.7 million was due to higher gross profit of $12.4 million, which was primarily attributable to higher sales.  Gross profit was impacted by a $7.5 million pre-tax charge related to the anticipated ESQ Movado watch brand returns and the write down of ESQ Movado excess inventory. The higher gross profit was partially offset by higher SG&A expenses of $4.7 million, which was primarily attributable to higher marketing expense of $3.8 million resulting from the Company’s decision to continue investment in this area to drive sales growth, and which included a $0.8 million pre-tax charge related to the write down of unused displays and point of sale materials as a result of the Company’s decision to reduce the presence of ESQ Movado while expanding the Movado brand offering in certain retail doors.  Also contributing to the increase in SG&A expenses was a recovery of bad debt of $0.9 million in the prior year period due to settlements with certain customers that did not recur. Additionally, the increase in SG&A expenses included higher compensation and benefit expense of $1.5 million recorded during the current year resulting from higher headcount and salary increases, partially offset by a lower accrual for performance-based compensation. Higher office related expenses of $0.5 million also contributed to the increase in SG&A expenses.  These increases were partially offset by a decrease of $1.0 million in charitable contributions made to the Movado Group Foundation and a smaller foreign currency loss of $0.5 million related to the settlement of certain foreign denominated assets., 217037=January 2017, 768450=On March 31, 2015, the Board approved the payment of a cash dividend of $0.11 for each share of the Company’s outstanding common stock and class A common stock. The dividend will be paid on April 24, 2015 to all shareholders of record as of the close of business on April 10, 2015. The decision of whether to declare any future cash dividend, including the amount of any such dividend and the establishment of record and payment dates, will be determined, in each quarter, by the Board of Directors, in its sole discretion., 843536=Information on the Company’s Audit Committee and Audit Committee Financial Expert is contained in the Company’s Proxy Statement for the 2015 annual meeting of shareholders under the caption “Information Regarding the Board of Directors and Its Committees” and is incorporated herein by reference., 89280=The Company conducts its business primarily in two operating segments: Wholesale and Retail. For operating segment data and geographic segment data for the years ended January 31, 2015, 2014 and 2013, see Note 13 to the Consolidated Financial Statements regarding Segment Information., 87672=The Company’s marketing strategy is to communicate a consistent, brand-specific message to the consumer. Recognizing that advertising is an integral component to the successful marketing of its product offerings, the Company devotes significant resources to advertising and maintains its own in-house advertising department which focuses primarily on the implementation and management of global marketing and advertising strategies for each of the Company’s brands, ensuring consistency of presentation. The Company utilizes outside agencies for the creative development of advertising campaigns which are developed individually for each of the Company’s brands and are directed primarily to the end consumer rather than to trade customers. The Company’s advertising targets consumers with particular demographic characteristics appropriate to the image and price range of each brand. Most Company advertising is placed in magazines and other print media but some is also created for radio and television campaigns, online, catalogs, outdoor and other promotional materials. Marketing expenses totaled 12.3%, 13.0% and 13.5% of net sales in fiscal 2015, 2014 and 2013, respectively., 573358=Fiscal 2013 net sales include a sales allowance of $4.9 million related to the repositioning of the Coach watch brand., 843009=Information on the beneficial ownership reporting for the Company’s directors and executive officers is contained in the Company’s Proxy Statement for the 2015 annual meeting of shareholders under the caption “Section 16(a) Beneficial Ownership Reporting Compliance” and is incorporated herein by reference., 340114=2013, 338234=2015, 117989=The Company’s annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and all amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended, are available free of charge on the Company’s website, located at www.movadogroup.com, as soon as reasonably practicable after the same are electronically filed with, or furnished to, the SEC. The public may read any materials filed by the Company with the SEC at the SEC’s public reference room at 100 F. Street, N.E., Washington, D.C., 20549. The public may obtain information on the operation of the public reference room by calling the SEC at 1-800-SEC-0330. The SEC maintains a website that contains reports, proxy and information statements, and other information regarding the Company at www.sec.gov., 901356=Restated Certificate of Incorporation of the Registrant as amended. Incorporated herein by reference to Exhibit 3(i) to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended July 31, 1999., 770186=On May 22, 2014, the Board approved the payment of a cash dividend of $0.10 for each share of the Company’s outstanding common stock and class A common stock.  The dividend was paid on June 16, 2014 to all shareholders of record as of the close of business on June 2, 2014., 276480=November 1, 2014 – November 30, 2014, 767769=The Company paid cash dividends of $0.40 per share or approximately $10.1 million for fiscal 2015. The Company paid cash dividends of $0.26 per share or approximately $6.6 million for fiscal 2014.  The Company paid cash dividends of $1.45 per share or approximately $36.7 million for fiscal 2013, which included two special cash dividends of $0.50 and $0.75 per share of common stock and class A common stock.  , 584740=Fiscal 2014 provision for income taxes includes a benefit of $1.0 million related to U.S. and foreign tax settlements and the release of uncertain tax positions., 207180=January 2016, 229518=On February 4, 2015, an individual plaintiff filed a complaint against the Company and several of its officers in the United States District Court for the District of New Jersey (the “Complaint”) as a purported class action, alleging that between March 26, 2014 and November 13, 2014, the Company made false and misleading statements about the Company’s financial performance. The Complaint also claims that these alleged false and misleading statements resulted in the Company’s stock trading at an artificially high price until November 14, 2014, when the Company issued a press release preliminarily announcing financial results and reducing its previous projections, after which the Company’s stock price fell. The Company believes that the Complaint is meritless and it intends to vigorously defend this matter., 599358=In the fourth quarter of fiscal 2013, the Company recorded a pre-tax charge of $4.9 million related to the repositioning of the Coach watch brand from a collection that is priced for sale in a department store’s fine watch department to one suitable for sale in the fashion watch department. The charge represented the Company’s estimated cost of the aggregate sales allowance to Coach watch retailers affected by the repositioning., 941681=Fourth Amendment dated as of September 28, 2012 to License Agreement dated as of November 15, 2005 by and between the Registrant and L.C. Licensing LLC. Incorporated herein by reference to Exhibit 10.2 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended October 31, 2012., 917278=Employment Agreement dated August 27, 2004 between the Registrant and Mr. Timothy F. Michno. Incorporated herein by reference to Exhibit 10.4 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended October 31, 2004. *, 754748=operations. The Company has recorded a federal income tax liability of $2.7 million related to $12.8 million of pre-2013 foreign earnings which have been earmarked for future repatriation. A deferred tax liability has not been recorded for the remaining undistributed foreign earnings of approximately $244 million, because the Company intends to permanently reinvest such earnings in its foreign operations. It is not practicable to estimate the amount of tax that may be payable on the eventual distribution of these earnings., 973061=March 31, 2015, 711531=Net sales in fiscal 2015 in the International location of the wholesale segment were $266.6 million, below the prior year by $0.6 million or 0.2%, driven by a sales decrease in the luxury brand category, partially offset by a sales increase in the licensed brand category.  The net sales decrease in the luxury category of $12.2 million was primarily due to lower sales of Movado and the other luxury brand watches.  The decrease in Movado watch sales was primarily due to weaker than expected performance in certain markets, including Asia.  The decrease in sales of all other luxury brands was primarily the result of higher sell-in to retailers of newer product in the prior year. These sales decreases were mostly offset by a sales increase in the licensed brand category of $12.1 million, or 6.2% compared to the prior year, primarily due to higher sales of certain licensed brands as a result of strong sell-through, as well as geographic expansion in the Company’s distribution channels.  In fiscal 2015, fluctuations in foreign currency exchange rates unfavorably impacted net sales by $2.2 million when compared to the prior year., 54585=On January 30, 2015, the Company entered into a Credit Agreement (the \"Credit Agreement\") with the lenders party thereto and Bank of America, N.A. as administrative agent (in such capacity, the \"Agent\"). The Credit Agreement provides for a $100.0 million senior secured revolving credit facility (the \"Facility\") including a $15.0 million letter of credit subfacility, that matures on January 30, 2020, with provisions for uncommitted increases of up to $50.0 million in the aggregate subject to customary terms and conditions. The Credit Agreement replaces the Amended and Restated Loan and Security Agreement dated as of July 17, 2009, which we had amended on September 30, 2014 to, among other things, extend its maturity through 2020 and reflect favorable changes in market rate conditions., 766763=A Swiss subsidiary of the Company maintains unsecured lines of credit with an unspecified length of time with a Swiss bank. As of January 31, 2015 and 2014, these lines of credit totaled 5.0 million Swiss francs with a dollar equivalent of $5.4 million and $5.5 million, respectively. As of January 31, 2015 and 2014, there were no borrowings against these lines., 628030=The following is a discussion of the results of operations for fiscal 2015 compared to fiscal 2014 and fiscal 2014 compared to fiscal 2013 along with a discussion of the changes in financial condition during fiscal 2015., 937815=Amended and Restated License Agreement, effective as of January 1, 2012 by and between MGI Luxury Group, S.A. and Hugo Boss Trademark Management GmbH & Co. KG. Incorporated herein by reference to Exhibit 10.39 to the Registrant’s Annual Report on Form 10-K for the year ended January 31, 2012., 82261=The Movado brand is renowned for its iconic Museum® dial and modern design aesthetic. Since its founding in La Chaux-de-Fonds, Switzerland in 1881, Movado has earned more than 100 patents and 200 international awards for artistry and innovation in watch design and technology, and Movado timepieces have won world renown for their unique beauty and timeless design., 838721=The Company’s Chief Executive Officer and Chief Financial Officer have furnished the Sections 302 and 906 certifications required by the U.S. Securities and Exchange Commission in this annual report on Form 10-K. In addition, the Company’s Chief Executive Officer certified to the NYSE in June 2014 that he was not aware of any violation by the Company of the NYSE’s corporate governance listing standards., 595465=The Company divides its business into two major geographic locations: United States operations, and International, which includes the results of all other Company operations. The allocation of geographic revenue is based upon the location of the customer. The Company’s International operations in Europe, the Americas (excluding the United States), Asia and the Middle East account for 18.9%, 11.4%, 8.0% and 7.1%, respectively, of the Company’s total net sales for fiscal 2015. Substantially all of the Company’s international assets are located in Switzerland and Asia., 94732=In France and Germany, the Company’s licensed brands are marketed and distributed by subsidiaries of a joint venture company owned 51% by the Company and 49% by a French company with established distribution, marketing and sales operations in France and Germany. The terms of the joint venture agreement include financial performance measures which, if not attained, give either party the right to terminate the agreement by the following April 30th after the tenth year (January 31, 2016); restrictions on the transfer of shares in the joint venture company; and a buy out right whereby the Company can purchase all of the shares in the joint venture company as of July 1, 2016 and every fifth anniversary thereafter at a pre-determined price., 767341=As of January 31, 2015, two European banks have guaranteed obligations to third parties on behalf of two of the Company’s foreign subsidiaries in the amount equivalent to $1.3 million in various foreign currencies., 928193=First Amendment dated as of February 27, 2009 to Lease dated May 22, 2000 between Forsgate Industrial Complex as Landlord and Movado Group, Inc. as Tenant for the premises known as 105 State Street, Moonachie, New Jersey. Incorporated herein by reference to Exhibit 10.42 to the Registrant’s Annual Report on Form 10-K for the year ended January 31, 2009., 46555=2006, 205197=March 2016, 816259=The Company considers its exposure to fluctuations in commodity prices to be primarily related to gold used in the manufacturing of the Company’s watches. Under a hedging program, the Company can purchase various commodity derivative instruments, primarily future contracts. These derivatives are documented as qualified cash flow hedges, and gains and losses on these derivative instruments are first reflected in other comprehensive income, and later reclassified into earnings, partially offset by the effects of gold market price changes on the underlying actual gold purchases. The Company did not hold any futures contracts in its gold hedge portfolio related to cash flow hedges as of January 31, 2015 and 2014, thus any changes in the gold price will have an equal effect on the Company’s cost of sales., 57379=On August 26, 2014, the Board approved the payment of a cash dividend of $0.10 for each share of the Company’s outstanding common stock and class A common stock. The dividend was paid on September 19, 2014 to all shareholders of record as of the close of business on September 5, 2014., 22730=The aggregate market value of the voting stock held by non-affiliates of the registrant as of July 31, 2014, was approximately $740,352,000 (based on the closing sale price of the registrant’s Common Stock on that date as reported on the New York Stock Exchange). For purposes of this computation, each share of Class A Common Stock is assumed to have the same market value as one share of Common Stock into which it is convertible and only shares of stock held by directors and executive officers were excluded., 947866=Offer letter to Ricardo Quintero dated May 29, 2014. Incorporated herein by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed July 14, 2014.*, 2419=ANNUAL REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES AND EXCHANGE ACT OF 1934, 579925=Fiscal 2011 includes non-cash charges of $3.1 million and $2.5 million, respectively, for write-downs of certain assets primarily related to intangible assets, tooling costs and trade booths for Baselworld Watch and Jewelry Show., 755926=Cash provided by operating activities was $59.6 million and $54.5 million for fiscal 2015 and 2014, respectively. The $59.6 million of cash provided by operating activities for fiscal 2015 was primarily due to income of $51.9 million and favorable non-cash items of $28.1 million, partially offset by the change in working capital of $20.2 million.  The change in working capital of $20.2 million was primarily due to the payout of the Company’s prior year performance-based compensation and the timing of payments of other liabilities.  Also contributing to the change in working capital was higher accounts receivables primarily due to prior year allowances for returns related to the Company’s strategic decision to reduce the presence of ESQ Movado watches in certain chain and department store retail doors while expanding Movado brand offerings in those same retail doors, partially offset by lower inventory related to the Company’s efforts to manage inventory levels. The $54.5 million of cash provided by operating activities for fiscal 2014 was primarily due to net income of $51.5 million and favorable non-cash items of $24.7 million, partially offset by the change in working capital of $18.9 million. The change in working capital of $18.9 million was primarily due to an increase in inventory primarily to support higher sales and new brand introduction and an increase in accounts receivable primarily due to increased sales. Also contributing to the change in working capital was the pay down of certain liabilities and the increase in certain other current assets primarily related to display inventory, partially offset by an increase in accounts payable related to the build of inventory and an increase in income taxes payable., 740196=SG&A expenses for fiscal 2014 were $237.5 million, representing an increase from the prior year of $9.0 million or 3.9%. The increase in SG&A expense included higher marketing expenses of $6.2 million, which included a $0.8 million pre-tax charge related to the write down of unused displays and point of sale materials, as a result of the Company’s decision to reduce the presence of ESQ Movado while expanding the Movado brand offering in certain retail doors. Also contributing to the increase in SG&A expenses were higher trade show expenses of $2.5 million, primarily related to the Baselworld Watch and Jewelry Show, a recovery of bad debt of $1.2 million in fiscal 2013 that did not recur and higher office related expenses of $0.7 million.  These increases in SG&A expenses were partially offset by lower compensation and benefit expense of $1.1 million resulting primarily from a lower accrual for performance-based compensation that was partially offset by higher headcount and salaries and was also partially offset by a decrease of $1.0 million of charitable contributions made to the Movado Group Foundation., 286440=January 1, 2015 – January 31, 2015, 335477=The selected financial data presented below has been derived from the Consolidated Financial Statements. This information should be read in conjunction with, and is qualified in its entirety by, the Consolidated Financial Statements and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” contained in Item 7 of this report. The Company’s subsidiary, Movado Retail Group, Inc., closed its Movado boutique division during its second quarter ended July 31, 2010. As a result, the financial results of the boutiques were reported as discontinued operations on the face of the Consolidated Statements of Operations for all periods presented. Amounts are in thousands except per share amounts:, 237327=Fiscal Year Ended January 31, 2014, 734796=Net sales in fiscal 2014 in the International location of the wholesale segment were $267.2 million, above the prior year by $25.2 million or 10.4%, primarily driven by a sales increase in the licensed brand category.  Net sales in the licensed brand category were above the prior year period by $30.5 million, or 18.7%, primarily due to the introduction of the Scuderia Ferrari watch line.  Also contributing to the increase were higher sales of Coach watches as a result of the repositioning of the Coach watch brand into the fashion watch category, as well as geographic expansion.  Net sales in the luxury category were below the prior year period by $3.8 million, or 5.3%, primarily due to the sell-in of the newly launched Ebel Onde and X1 in the prior year. In fiscal 2014, fluctuations in foreign currency exchange rates favorably impacted net sales by $3.0 million when compared to the prior year., 57878=On May 22, 2014, the Board approved the payment of a cash dividend of $0.10 for each share of the Company’s outstanding common stock and class A common stock. The dividend was paid on June 16, 2014 to all shareholders of record as of the close of business on June 2, 2014.}",
    "lastModified": "Tue, 31 Mar 2015 18:22:53 GMT",
    "textBeforeTable": "  (Exact name of registrant as specified in its charter) MOVADO GROUP, INC. Commission File Number 1-16497 For the transition period from             to             TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934 ¨ OR For fiscal year ended January 31, 2015 ANNUAL REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES AND EXCHANGE ACT OF 1934 x (Mark one) FORM 10-K Washington, D.C. 20549 SECURITIES AND EXCHANGE COMMISSION UNITED STATES     10-K mov-10k_20150131.htm 1 10-K",
    "textAfterTable": "  HUGO BOSS   HUGO BOSS Trade Mark Management GmbH & Co   2006       Juicy Couture   ABG Juicy Couture, LLC   2007       Lacoste   Lacoste S.A., Sporloisirs S.A. and Lacoste Alligator S.A.   2007       Scuderia Ferrari   Ferrari Brand S.p.A.  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}