{
    "relation": [
        [
            "First Name",
            "Joel",
            "Damon"
        ],
        [
            "Last Name",
            "Brandenberger",
            "Wells"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=560A550D-7517-43B3-8C89-59097B735275&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00104-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 224078169,
    "recordOffset": 224069967,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{15370=Animal Drug Use & Availability Animal Disease Traceability System Preservation of Antibiotics for Medical Treatment Act (PAMTA; H.R. 965, S.1211) USDA APHIS National Poultry Improvement Plan Docket No. FDA-2012-N-0447; Antimicrobial Animal Drug Sales and Distribution Reporting Market Access Program/Foreign Market Development Program, 12227=Preservation of Antibiotics for Medical Treatment Act (PAMTA; H.R. 965, S. 1211) Final GIPSA Rule: Implementation of Regulations Required Under Title XI of the Food, Conservation and Energy Act of 2008 Phosphorus Standard Revision H.R. 6083, the Federal Agriculture and Risk Management Act (FARRM) The Agriculture Reform, Food and Jobs Act of 2012 (S. 3240) H.R. 8, The American Taxpayer Relief Act Market Access Program/Foreign Market Development Program, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 27533=No Bill or Docket # - Implementation of the Supreme Court \"Donning and Doffing\" Decision Final GIPSA Rule: Implementation of Regulations Required Under Title XI of the Food, Conservation and Energy Act of 2008 Docket No. OSHA-2009-0044 - 6/14/11- Occupational Injury and Illness Recording and Reporting Requirements RIN 3142--AA08 8/22/11 - Proposed rules Governing Representation Procedures under the National Labor Relations Act Docket No. OSHA-2010-0019 9/20/11, Occupational Injury and Illness Recording and Reporting Requirements Affirmative Action and Non-Discrimination Obligations of Contractors and Subcontractors Regarding Individuals With Disabilities - RIN (1250-AA02) Docket No. 2011-21924; Child Labor Regulations, Orders and Statements of Interpretation; Child Labor Violations; Civil Money Penalties; Proposed Rule Docket No. FMCSA200419608; Hours of Service of Drivers - (RIN 2126AB26) DOL FMCSA Petition Regarding Definition of Tanker Trucks 48 CFR 422 Proposed Rule Requiring Federal Contractors to Certify Compliance with Labor Laws 29 CFR Part 104 Proposed Rules Governing Notification of Employee Rights Under the National Labor Relations Act, 21886=Renewable Fuel Standard Flexibility Act (H.R. 3097) EPA-HQ-OAR-2009-0211 Clean Air Act Waiver Application to Increase the Allowable Ethanol Content in Gasoline to 15 Percent EPA-HQ-OAR-2005-0161; FRL-8903-1 Changes to the Renewable Fuels Standard Program EPA-HQ-OAR-2012-0632; Seeking a Waiver of the Renewable Fuel Standard, 40383=Poultry Petition: EPA - HQ-SFUND-2005-013 Poultry Exemption Petition: EPA - HQ-SFUND-2007-0469 EPA Feed Mill Rule: EPA - HQ-OAR-2008-0080; FRL-9095-2 H.R. 4153- Chesapeake Bay Program Reauthorization and Improvement Act, 18413=OAR-2004-0237 - Animal Feed Operations Consent Agreement and Final Order Poultry Petition: EPA - HQ-SFUND-2005-013 Poultry Exemption Petition: EPA - HQ-SFUND-2007-0469 Greenhouse Gas Emissions Reporting Rule (EPA-HQ-OAR-2008-0508) EPA TMDL for the Chesapeake Bay H.R. 4153- Chesapeake Bay Program Reauthorization and Improvement Act Final Guidance on Identifying Waters Protected by the Clean Water Act - (RIN: 2040-ZA11) Docket No. EPA-HQ-OW-2011-0188; Request for public review and comment Proposed National Pollutant Discharge Elimination System (NPDES) Concentrated Animal Feeding Operation (CAFO) Reporting Rule Request for Extension of Comment Period- EPA Draft Nonpoint Source Program and Grants Guidelines for States and Territories., 24936=Docket No. 04-026N - \"Salmonella Verification Sample Results Reporting: Agency Policy and Use in Public Protection\" FSIS Performance Standards for Salmonella and Campylobacter Docket No. FSIS-2009-0026; Electronic Export Application and Certification Charge; Flexibility in the Requirements for Export Inspection Marks, Devices, and Certificates; Egg Products Export Certification Docket No. 99-021P; Prior Label Approval System: Generic Label Approval Docket No. FSIS20110012; Modernization of Poultry Slaughter Inspection, 31479=No Bill or Docket # - Possible tax incentives for producing energy from animal by-products User Fees- Food Safety Estate Tax: H.R. 1259, the Death Tax Repeal Permanency Act of 2011; S. 2242, the Death Tax Repeal Permanency Act of 2012 H.R. 8, The American Taxpayer Relief Act, 43296=EPA-HQ-OAR-2009-0211 Clean Air Act Waiver Application to Increase the Allowable Ethanol Content in Gasoline to 15% EPA-HQ-OAR-2005-0161; FRL-8903-1 Changes to the Renewable Fuels Standard Program Renewable Fuel Standard Flexibility Act (H.R. 3097) EPA-HQ-OAR-2012-0632; Waiver of the Renewable Fuel Standard}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  JOEL BRANDENBERGER  2028980100  jbrandenberger@turkeyfed.org 5. Senate ID#  28732-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}