{
    "relation": [
        [
            "Name",
            "Attrs",
            "RetType"
        ],
        [
            "Datatype",
            "ODCINumberList",
            "AnyType"
        ],
        [
            "Purpose",
            "Indicates the attributes that need to be set",
            "For AnyDataSet table functions, indicates the actual return type to be expected in the AnyDataSet collection"
        ]
    ],
    "pageTitle": "Extensibility Constants, Types, and Mappings",
    "title": "",
    "url": "http://docs.oracle.com/cd/B19306_01/appdev.102/b14289/dcicnstnts.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00097-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 71098046,
    "recordOffset": 71082418,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 13 May 2015 05:07:11 GMT",
    "textBeforeTable": "Table 19-26 ODCITabFuncInfo Parameters Object type. Stores information on which attributes of user-defined types in a collection need to be set by a table function. ODCITabFuncInfo VARRAY(32767) OF BFILE Datatype Stores varrays of BFILEs. ODCIBFileList Number of rows in table NUMBER Num_rows Purpose Datatype Name Table 19-25 ODCITabStats - Attributes NUMBER Datatype Stores table statistics for a table function. ODCITabStats Contains the number of rows expected to be returned by the table function NUMBER num_rows Purpose Datatype Parameter Table 19-24 ODCITabFuncStats Parameter Object type. Stores cardinality information for a table function. ODCITabFuncStats",
    "textAfterTable": "ODCIDateList Stores varrays of DATEs. Datatype VARRAY(32767) OF DATE ODCINumberList Stores varrays of NUMBERs. Datatype VARRAY(32767) OF NUMBER ODCIRawList Stores varrays of Raws. Datatype VARRAY(32767) OF Raw(2000) ODCIVarchar2List Stores varrays of VARCHAR2s Datatype VARRAY(32767) OF VARCHAR2(4000) ODCIFuncCallInfo Object type. Stores information about the functional implementation of an operator. Table 19-27 ODCIFuncCallInfo - Attributes Name Datatype Purpose ColInfo ODCIColInfo Information about the column on which the operator is invoked Usage Notes A functional implementation can be defined with this parameter only if the operator binding is declared WITH COLUMN CONTEXT. This is useful if the functional implementation requires information about the column it was invoked on, and there is no domain index defined on the column. This argument is only populated in the function invocation if the first argument of the operator invocation is a column",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}