{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There is always stuff going on around campus. Music, food, etc",
            "Choose your classes very carefully, pay attention to the teachers and where the buildings are located.",
            "This is the best college I could have chosen for my intended major. They have a wonderful education department. The campus is very pretty and all of the students are very friendly."
        ]
    ],
    "pageTitle": "University of North Alabama Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-North-Alabama/reviews?_escaped_fragment_=/show/118127",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00060-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894510783,
    "recordOffset": 894462606,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{78976=Apply early scholarship deadlines are February 1 and they go fast... And I hope that you all are successful in your future endeavors..., 177767=UNA offers an okay buffet style dinning hall, but they also have a student center that offers Chinese, fresh Subs, Pizza Hut, and A&W that is open til 5pm. In 2014 we are getting a Chikfila and a Star Bucks! Florence in general also has really good restaurants., 212139=© 2015, Cappex.com, LLC, 56393=Don't miss the Renaissance Faire in late October every year!! or any of the First Friday festivals that occur downtown every first Friday of the Month. TVA and Wildwood park have great nature trails for those that love the outdoors. Hammocking is a popular pastime., 56059=Don't miss the Renaissance Faire in late October every year!! or any of the First Friday festivals that occur downtown every first Friday of the Month.}",
    "textBeforeTable": "12/08/2009 Reviewer is A current student here. 10 out of 10 people found this review useful. 1 of 50 Madison from Slocomb, AL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Am enjoying being here I am enjoying being a student at the University of North Alabama. I do get homesick some, as I am six hours away from home. Even so, it has been relatively easy to make friends and there is always something to do on campus. You can try your hand at intramural sports of all kinds and of course there are the regular type clubs and Greek life. Am learning a lot I am learning a great deal at the University of North Alabama. The instructors seem to genuinely care about your success in the classroom. I enjoy the fact that they take the extra time needed to make sure each student is reaching their full potential. Login to rate or flag the reviews Monica from Huntsville, AL 11/13/2009 Reviewer is Researching this school. Reviewer has been to campus. 5 out of 5 people found this review useful. 2 of 50 Categories Comments Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}