{
    "relation": [
        [
            "Type of Bet",
            "Red",
            "Black",
            "Even",
            "Odd",
            "Low",
            "High",
            "First Dozen",
            "Second Dozen",
            "Third Dozen",
            "Column Inside Bets",
            "Straight-Up",
            "Split",
            "Street",
            "Corner",
            "Six Line",
            "Zero Section",
            "Zero Corner"
        ],
        [
            "Description",
            "Covers any red number.",
            "Covers any black number.",
            "Covers any even number.",
            "Covers any odd number.",
            "Covers numbers 1-18.",
            "Covers numbers 19-36.",
            "Covers numbers 1-12.",
            "Covers numbers 13-24.",
            "Covers numbers 25-36.",
            "Covers 12 numbers in any of the 3 columns.",
            "Covers any single number including 0.",
            "Covers any 2 adjacent numbers on the table",
            "Covers any 3 numbers in a line across the table",
            "Covers any 4 adjacent numbers on the table.",
            "Covers any block on 6 adjacent numbers on the table.",
            "Covers a bet on one of four particular numbers winning. There is only 1 zero section bet. These numbers are 0,1,2,3.",
            "Covers a bet on one of three particular numbers winning. There are two zero corner bets. These are 0,1,2 and 0,2,3."
        ],
        [
            "Payout Odds",
            "1 to 1",
            "1 to 1",
            "1 to 1",
            "1 to 1",
            "1 to 1",
            "1 to 1",
            "2 to 1",
            "2 to 1",
            "2 to 1",
            "2 to 1",
            "35 to 1",
            "17 to 1",
            "11 to 1",
            "8 to 1",
            "5 to 1",
            "8 to 1",
            "11 to 1"
        ]
    ],
    "pageTitle": "Live Casino Gaming Rules | SBOBET Information Center",
    "title": "",
    "url": "http://info.sbobet.com/article/AA-00363/0/Live-Casino-Gaming-Rules.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00269-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 123417935,
    "recordOffset": 123388587,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{150086=24:1, 147510=5:1, 148865=8:1, 147123=3:1, 148625=12:1, 147905=50:1, 148145=30:1, 150468=150:1, 148385=18:1, 146757=1:1, 149104=6:1, 146938=2:1}",
    "textBeforeTable": "More than three cards can never be drawn for either hand. There are no values greater than nine in the game of baccarat. All card values are recalculated when the combined value of two or more cards is greater than nine. This new card value is determined by subtracting ten from the combined card value every time it reaches a number greater than nine. Below are a few examples of this equation. 4 + 2 + 6 = 2 5 + 6 + 8 = 9 7 + 3 = 0 10 + 10 + 10 = 0 The hand with the highest point value wins. All losing bets will be collected and all winning bets paid. If a bet is a winner, the winnings will be posted to the credit balance and updated in the credits display upon selecting the next game or upon returning to the Lobby. If both hands have the same point value, that game is a tie and neither side wins or loses. In this case, tie bets win, but players and bankers bets do not win or lose so the bet is refunded back to the Player. Some common Baccarat terms are provided below, complete with explanations. Payout",
    "textAfterTable": "1.6 No Burn Card The dealer does not perform burn card between the games. 1.7 Reshuffles The Operator reserves the rights to reshuffle the particular decks of cards if any human or non-human errors occur during cards shuffling. 1.8 Pair Bets All bets are confirmed and taken into Players' account once the CONFIRM button is clicked. Live Baccarat pair bet game rules are almost the same as traditional baccarat, the difference is you can also bet on player pair / banker pair as well as player / banker wins. Player / banker first and second hand have to make a pair in order to win. Payout is 11 to 1. 1.9 Super Six The Super Six bet option is only available on the Super Six (Non-Commission Baccarat) table. This is a side wager placed on the Banker to win with a point count of six, with any other result being a loss. Payout is 12 to 1. 1.10 Electronic Malfunctions The card is scanned by the dealer and the result will be displayed on the Players' computer screen. If any card fails to scan, the dealer will re-scan the card in order to display the result to the Players. Any failure of the Players' equipment including but not limited to network connection or computer problems, will not void the game result. Players can check their own bet history on the Report section. Any Operator system malfunction",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}