{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There was never a moment where I felt unsafe on campus. At any given time, no matter how late it was, I always had a sense of security because the campus police do their job exceptionally well at SFSU.",
            "I didn't join any fraternities but during the club rush there were a bunch of fraternities and sororities looking for people to join them. There is definitely a fraternity or sorority for you.",
            "There are so many clubs and activities to choose from and participate in. The campus green is filled with various different clubs in the first few weeks of both the fall and spring semester. There are so many clubs it is almost overwhelming. The activities on campus are endless. There is always something going on and you will know because of all of the flyers you see around campus. The RAs always have something planned for their floor as well.",
            "Any type of student would enjoy San Francisco State University.",
            "Above the Cesar Chavez Center is an outside theater like area in which students can access any time. There are a bunch of seats in the area and even a cement wall where you could watch movies if you have a projector. I had a great time while I was up there.",
            "For the price you pay to attend SFSU you really get a great education. In my opinion, the tuition and other college costs of SFSU are pretty reasonable and definitely worth the cost. The professors are really dedicated to providing you with the education you pay for.",
            "There are plenty of things to do for fun while attending SFSU. San Francisco is a great city with tons and tons of places to go and enjoy. There are plenty of beaches that are close by, one of which is walking distance. Getting to downtown San Francisco is only a Muni ride away. If you prefer to stay on campus there are a bunch of clubs that meet up weekly and there is also the Cesar Chavez Center which has an arcade, food court, and billiards rooms. There is never a dull moment on campus.",
            "The food that SFSU provides for students that purchase meal plans are bearable at best. The food isn't all that great but it could be a lot worse.",
            "Even though the dorm I chose wasn't very roomy I still had a great time. You will not mind the small rooms once you meet the other like-minded people on your floor and participate in the activities that the RAs put on.",
            "The professors here at SFSU have been great so far. They are all very passionate about their job and the professors are extremely dedicated to making sure the students get a proper education.",
            "I definitely recommend prospective students to visit the campus a couple of times before the academic session starts just to get a feel for the campus because the campus is pretty big. Another good idea for prospective students would be to get involved with on-campus activities. There are various activities going on each day at SFSU and you will have a great time participating in them.",
            "San Francisco State University has been a great school so far. I just finished my first year and I had the best time of my academic career. The other students at SFSU are extremely friendly and the sense of happiness that the atmosphere and campus greenery of the campus gives me is a feeling I won't ever forget."
        ]
    ],
    "pageTitle": "San Francisco State University (SF State) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/San-Francisco-State-University/reviews?_escaped_fragment_=/show/101938",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00093-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899688047,
    "recordOffset": 899558219,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{179692=If you have considered this school i hope you have considered the cost of living in the City, the dorms are expensive and rent at even the cheapest of apartments are upwards of $2100 a month, for one bedrooms and studios. On the other hand, receiving a college education and life experiences a city like San Francisco will put you through are priceless...., 342921=San Francisco State tuition fee is reasonable in its price, although I heard tuition fee will increase in the next fall 2013., 475762=For expecting students I would advise to never have too much fun. College is about exploring and having fun and I cannot stress how much better your college experience will be if you just remember to have fun. When you wake up at 7:59 A.M. for your 8 o'clock morning class, instead of dwelling about it, make the best of it. You only get one real college experience so you might as well make the best of it., 118594=Sign up for the dorms before January of the year you are planning on attending., 299941=Not that everyone is living in the dorm. It's mostly for freshman, sophomore, and transfers. Still, the dorm is so convenient, fun and quite random. You mostly will find tons of drama with your roommate and random things int he hall way, such as people in costume in the middle of March or people dancing, singing or playing guitar on the small quad. Not a good place for quiet and clean freak people., 330779=The food at the college leaves alot to be desired. However, there are many types of foods to choose from...from extremely healthy to extremely fattening. The cafeteria is always full and robust. Get there before 11:50 am. That's when the large crowd begins to fall into the cafeteria and if you have a class at 12:20, you may be pushing it. If all else fails, there are a few cafe type establishments at the head of the school and in the HSS building on the first floor. Plenty of vending machines if you're pressed for time or pack a lunch the night before and bring it with you. Lunch on campus is a little expensive., 708894=© 2015, Cappex.com, LLC, 431573=Every October a group of people dressed as zombies attack people., 332392=Some classes can be challenging, especially if some classes are cross-listed. It's all relevant. Just be a sponge and don't fall into the trap of procrastination. You're grade can turn out to be a C when you are clearly A material. There are lots of group projects in upper division and just like any place of employment, there will always be one or two that are 'slackers' or give the bare minimum. Do not let that stop YOUR progress and grade. If you see something needs to be done by another person, just do it yourself or get assistance from others within your group. I had a 'group' that started out with four people and ended up a 'me' project. Everyone had excuses on why they couldn't or didn't do their part. I didn't let that stop me. I did everyone's section and I received an A+. Believe in yourself and your abilities. If you are not sure, seek out a tutor. Remember, this is your life at stake because when it's all said and done, many of these students you may never see again, and it will be only you holding the torch. March to victory, NEVER settle for defeat from merely not trying., 19849=Attend office hours, attend office hours, attend office hours. Professors stay overtime to answer your questions, and most of them want your money to go to actually learning something. Take advantage. Don't miss class. It's tempting to sleep through your morning classes, yes, but don't forget that you're paying for those. Know your sleeping schedule before registering. If it isn't realistic for you to get up at 8:10 every Monday for a Math class, then don't register for that class. Register early.}",
    "textBeforeTable": "08/27/2009 Reviewer is A current student here. 37 out of 39 people found this review useful. 1 of 159 Liza from Bolinas, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Am learning a lot Classes that are offered here at state are interesting. ALL professors here at state are passionate about their discipline and they are very helpful! We have great and supportive departments. I am a Biology major at state with hopes of attending UCSF for med school and they provide a lot of support. The Biology department is one of the best in the CSU system since SFSU has a lot of connections with Biotech companies in the bay area and health care companies. The Biology department is ranked #3 in the public universities when I read reviews about it. Login to rate or flag the reviews Daniel from Walnut Creek, CA 10/19/2010 Reviewer is A current student here. 16 out of 16 people found this review useful. 3 of 159 Categories Comments Great for these types of students I feel that SF State is a very well rounded school that anyone would enjoy attending. The biggest issue I've noticed among students is the weather. A lot of the kids",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}