{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2011-01-01T00:00:00",
            "2012-12-01T00:00:00",
            "2013-02-20T00:00:00"
        ],
        [
            "Description",
            "No metadata was provided to NOAA CSC along with this lidar data set. The following process step contains information derived from the metadata record of another 2011 Oregon DOGAMI lidar data set and the Watershed Sciences, Inc. lidar report. This lidar report may be accessed at: ftp://ftp.csc.noaa.gov/pub/crs/beachmap/qa_docs/or/burns/OLC_Burns.pdf Acquisition 1. The lidar data were collected between June 19 - 21, 2011. 2. The survey used a Leica SN094 sensor mounted in a Cessna Caravan 208B. 3. Near nadir scan angles were used to increase penetration of vegetation to ground surfaces. 4. Ground level GPS and aircraft IMU were collected during the flight. Processing 1. Flight lines and data were reviewed to ensure complete coverage of the study area and positional accuracy of the laser points. 2. Laser point return coordinates were computed using ALS Post Processor software and IPAS Pro GPS/INS software, based on independent data from the LiDAR system, IMU, and aircraft. 3. The raw LiDAR file was assembled into flight lines per return with each point having an associated x, y, and z coordinate. 4. Visual inspection of swath to swath laser point consistencies within the study area were used to perform manual refinements of system alignment. 5. Custom algorithms were designed to evaluate points between adjacent flight lines. Automated system alignment was computed based upon randomly selected swath to swath accuracy measurements that consider elevation, slope, and intensities. Specifically, refinement in the combination of system pitch, roll and yaw offset parameters optimize internal consistency. 6. Noise (e.g., pits and birds) was filtered using ALS postprocessing software, based on known elevation ranges and included the removal of any cycle slips. 7. Using TerraScan and Microstation, ground classifications utilized custom settings appropriate to the study area. 8. The corrected and filtered return points were compared to the RTK ground survey points collected to verify the vertical and horizontal accuracies. 9. Points were output as laser points, TINed and GRIDed surfaces",
            "The NOAA Coastal Services Center (CSC) received the files in las format. The files contained LiDAR elevation and intensity measurements. The data were in UTM Zone 11, NAD83 (CORS96) coordinates, NAVD88 (Geoid03) vertical datum and units in meters. CSC performed the following processing for data storage and Digital Coast provisioning purposes: 1. The data were converted from UTM Zone 11 coordinates to geographic coordinates. 2. The data were converted from NAVD88 (orthometric) heights to GRS80 (ellipsoid) heights using Geoid03. 3. The data were sorted by time. 4. The data were converted to LAZ format.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2011_OR_DOGAMI_Burns_m1427.xml&view=ISO19115Components-HTMLTable&altview=none",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00049-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 613547970,
    "recordOffset": 613539768,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:2011_OR_DOGAMI_Burns_m1427Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Component Title Date Citation Identifier 1 2011 Oregon Department of Geology and Mineral Industries (DOGAMI) Lidar: Burns Study Area 2012-01-01 2 None 1 North American Datum 1983 2007-01-19 Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 NOAA CSC (originator) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov originator http://coast.noaa.gov 1 NOAA CSC (publisher) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}