{
    "relation": [
        [
            "Patent application number",
            "20100017189",
            "20140180665"
        ],
        [
            "Description",
            "Transparent Intellectual Network Storage Device - The invention is an intellectual network storage device that uses a network to store and retrieve data, and that connects to an existing storage controller of a host computer. The device is transparent to the operating system of the host computer, and thus does not require additional software, such as a device driver, to operate. The device includes a device board, which is connected to an existing storage controller of a host computer via any suitable interface, a set of hardware or software acting as a remote storage server, and a connection that carries signals between the device board and the remote storage server.",
            "Transparent Intellectual Network Storage Device - The invention is an intellectual network storage device that uses a network to store and retrieve data, and that connects to an existing storage controller of a host computer. The device is transparent to the operating system of the host computer, and thus does not require additional software, such as a device driver, to operate. The device includes a device board, which is connected to an existing storage controller of a host computer via any suitable interface, a set of hardware or software acting as a remote storage server, and a connection that carries signals between the device board and the remote storage server."
        ],
        [
            "Published",
            "01-21-2010",
            "06-26-2014"
        ]
    ],
    "pageTitle": "Sergiy - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/sergiy-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00329-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 436029667,
    "recordOffset": 436004492,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Sergiy Naydon, Dnepropetrovsk UA 09-06-2012 SOLAR CELL WITH IMPROVED PERFORMANCE - This application discloses silicon solar cells manifesting enhanced light induced degradation characteristics. The application also discloses silicon solar cells with a silicon-based substrate comprising boron, oxygen and carbon, and an antireflective coating (ARC) containing at least one carbon-containing layer adjacent to the substrate. Also disclosed are methods for preparing solar cells. 20120222741 Published Description Patent application number Sergiy Navala, Cote Saint-Luc CA 06-12-2014 Methods for Objectively Determining the Visual Axis of the Eye and Measuring Its Refraction - Provided are methods for determining an axis of best vision of an eye or for objectively determining a visual axis of an eye and for making the most accurate measurement of refraction. Generally, an optical measuring device or instrument projects laser beams into the eye during a scan. Positions of the projected beams are detected and measured on the retina to produce a set of projections. Wave front tilt of radiation that is backscattered from the retina is calculated as a best fit from the set of projections. The axis of best vision or the visual axis is reconstructed from a set of those traces of chief rays exiting from the eye that cross the nodal point of the optical system of the eye and that are normal to the wave front tilts. Measuring with the Styles Crawford scans centered over this axis provides the most",
    "textAfterTable": "Patent applications by Sergiy Naydon, Dnepropetrovsk UA Sergiy Oleksandrov, Daejeon KR Patent application number Description Published 20130225445 BIO-REACTION DEVICE CHIP - Provided is a bio-reaction device chip for confirming or detecting a biomaterial reaction, and more particularly, is a bio-reaction device chip, where a plurality of wells are formed in the plate to contain biomaterials to be tested, thereby simultaneously analyzing various targets, and the well is formed to have a structure of two or more steps such that the sample to be tested is contained in the lower well and a protective layer for protecting the sample, such as oil, is contained in the upper well, thereby preventing evaporation of the sample due to heating at the time of the biomaterial reaction, and thus, improving reliability in analysis. 08-29-2013 Sergiy Panchishniy, Roanoke, TX US Patent application number Description Published 20130047176 CONTENT RECOMMENDATION USING SUBSEQUENCE PROFILING - A method includes identifying at least one program viewing sequence. The at least one program viewing sequence includes a plurality of programs. The method may include identifying a subsequence in the at least one program viewing sequence. The subsequence includes a subset of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}