{
    "relation": [
        [
            "",
            "Parsonage Compensation",
            "Non-Parsonage Compensation"
        ],
        [
            "Federal Income Tax",
            "N",
            "Y"
        ],
        [
            "State Income Tax (if applicable)",
            "N",
            "Y"
        ],
        [
            "City Income Tax (if applicable)",
            "N",
            "Y"
        ],
        [
            "Self-Employment Tax (Federal obligation)",
            "Y",
            "Y"
        ]
    ],
    "pageTitle": "Clergy Taxes CPA, Rabbi CPA, Minister CPA, Cantor Taxes, Clergy CPA, Clergy Tax, Clergy Tax CPA NYC",
    "title": "",
    "url": "http://www.clergytaxescpa.com/clergytaxes.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00001-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 374096930,
    "recordOffset": 374088728,
    "tableOrientation": "VERTICAL",
    "lastModified": "Thu, 21 May 2015 01:20:55 GMT",
    "textBeforeTable": "Self-Employment Tax: Y City Income Tax: Y State Income Tax: Y Federal Income Tax: Y Non-Parsonage Compensation Self-Employment Tax: Y City Income Tax: N State Income Tax: N Federal Income Tax: N Parsonage Compensation Definition of Parsonage Ministers, rabbis, cantors, priests and other religious officials who work as leaders of religious organizations are entitled to have some of their income excluded from taxation. In particular, the amount spent on housing and furnishing the home is excluded from income taxation. This is called Parsonage. Clergy Compensation There are two components of a clergy person's compensation. The amount allocated to parsonage and the residual amount left over after the parsonage allocation (referred to as \"Non-Parsonage\" compensation in the remainder of this article). Each component has different types of tax liabilities. Dual-Status for Tax Purposes Ministers, rabbis and cantors have a unique standing for tax purposes. For income tax purposes they are considered employees (and the rabbi, minister or cantor should have the customary income tax withholding and receive a W-2). For Social Security and Medicare taxes they are deemed to be self-employed. This is a crucial distinction as being deemed self-employed requires the clergy person to essentially pay double for these taxes than if the clergy person would have been a traditional employee (the reason being that as a traditional employee the employer would be required to make matching Social Security and",
    "textAfterTable": "Withholding Most churches and synagogues do not account for the self-employment tax obligation when determining withholding taxes and this typically leads to the minister, rabbi and cantor under withholding. To insure the proper amount is withheld the clergy person should divide his total compensation (Parsonage plus Non-Parsonage) by the number of pay-periods and multiply by 15.3%. This is the amount that should be withheld as an additional amount for each pay period for federal taxes. The minister should inform the person in charge of payroll withholding about the additional amount that is needed to be withheld (if the religious entity is matching Social Security and Medicare taxes for part or all of the clergy person's compensation, please adjust accordingly). The computation above slightly overestimates the tax obligation as there is an adjustment for one-half of self-employment taxes. What can be claimed as part of Parsonage? If the minister, rabbi or cantor is not living in church or synagogue furnished housing, the amounts spent for the annual cost of the home including furnishing, yard and utilities. If the minister is living in a residence provided to him by his or her church then it would be the market value of the home, furnishing, yard and utilities. While not an exhaustive list here are some samples of items that may be included in parsonage:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}