{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor"
        ],
        [
            "Comments",
            "Campus security is great because there are never any problems on campus. It is such a small community, so far away from anything that we never have any problems. Generally, the campus security are students themselves, but we do have a regular security guard.",
            "There are a lot of ways that you can get involved in something on campus. Wether it's ultimate frisbee, poetry, or sign language you like, there is often something you can find that you like.",
            "The school usually has pretty regular events to keep us energized, but on a school night, there isn't very much to do on campus, unless you and a friend think of something. Your best bet would be in the city of Salem itself.",
            "The food seems to get better every year, and they are getting better about offering more options especially for those with food allergies or intolerances. The food isn't always the best, but the atmosphere is great because it is like eating with your family every night. Except you didn't have to make the food.",
            "Dorm life can be really crazy. Everyone is really close, , but sometimes it can be hard to make friends outside of the ones you make in your hall. You will often all do things together, usually for a bonding experience. But with all those people together, it can be pretty loud and crazy when you are trying to sleep.",
            "You will be challenged academically depending on the classes that you take, and what degree you are pursuing. Overall, you will have homework, reading, or be working on a future project every night. It also gets harder as the semester continues because all the professors like having everything due the same day."
        ]
    ],
    "pageTitle": "Corban University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Corban-University/reviews?_escaped_fragment_=/show/41306",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00208-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910816375,
    "recordOffset": 910774804,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{177043=© 2015, Cappex.com, LLC, 131903=Each of the dorms has a tradition of sorts, but the best one is Pumpkin Smash. Pumpkin Smash is held mid-November, and what it is is one of the guy dorms -Farrar- smash a ton of pumpkins, and then wrestle in it until there's only one guy left, who is then dubbed King. It's a lot of fun, but a little gross -you can see steam billowing out of the pile of men/pumpkin!, 12297=Visit! There are two weekend overnight visits each year (one in November and one in February or March), and there are individual campus tours almost daily. I would highly encourage you to come visit and see what our campus is like.}",
    "textBeforeTable": "01/31/2010 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 42 Casey from Post Falls, ID Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Categories Comments Great for these types of students Corban College is great for a student who loves God and wants to get connected with other believers. If you are a hard worker and willing to seek God's will in your life, Corban is the place for you. Tips for prospective students If you are a student here, I would suggest that you bring a car to campus. It is not an absolute necessity, but the bus stop is a thirty minute walk from campus, and the campus is a five minute drive out of town. Bang for the buck Corban is rather expensive, but I find it to be well worth the money. Each student graduates with a bachelor degree in his or her chosen field, as well as with a minor in Bible. Not only that, Corban lets students begin their observations as freshman so they can go directly out into the field. Am enjoying being here The people are all extremely welcoming. Everyone works together to avoid leaving anybody out of an event. The campus is beautiful, the dorms are comfortable, and the food is not too bad either!",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}