{
    "relation": [
        [
            "Substances used",
            "Marihuana",
            "Hashish",
            "Heroin",
            "Amphetamines",
            "Hallucinogens",
            "Opium and its derivatives",
            "Morphine and morphine-like synthetic substances",
            "Barbiturates, tranquillizers",
            "Cocaine",
            "Alcohol in association"
        ],
        [
            "Percentage of male subjects using them",
            "36",
            "70",
            "41",
            "36",
            "55",
            "29",
            "8",
            "20",
            "10",
            "25"
        ],
        [
            "Percentage of female subjects using them",
            "23",
            "69",
            "42",
            "28",
            "43",
            "22",
            "4",
            "17",
            "7",
            "16"
        ]
    ],
    "pageTitle": "UNODC - Bulletin on Narcotics - 1973 Issue 4 - 003",
    "title": "",
    "url": "http://www.unodc.org/unodc/en/data-and-analysis/bulletin/bulletin_1973-01-01_4_page004.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00324-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 794847836,
    "recordOffset": 794819922,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16190=Between April 1971 and May 1972, 662 usable forms had been received. Between now and the end of December, when the survey will be terminated, it is expected that more than 1,000 case notes will have been received and analysed., 139620=The foregoing are the main results of this medico-social survey of 662 cases of drug abuse reported from April to May 1972., 16601=The latest analysis, which is presented here, covers the 662 case notes collected up to 31 May 1972. This sample is large enough to enable us to undertake a number of investigations which could not be undertaken earlier. However, certain sub-groups comprising various categories of drug users (common geographical origin, exclusive consumption of certain substances, etc.) are still too small. The over-all survey covering more than 1,000 case notes will, we hope, make it possible to undertake more detailed investigations., 15172=Author: F. DAVIDSON, M. ETIENNE, J. PIESSET Pages: 9 to 32 Creation Date: 1973/01/01, 70586=As mentioned above, the proportion of these young people who were not working and were not students, apprentices or in military service was very high. In the 14-25 age group, it was 40.5 per cent for young men and 45.8 per cent for young women. By comparison, the results of the 1968 census, published by the National Institute of Statistics and Economic Studies (INSEE),[4] show that only 3 per cent of the young men and 25 per cent of the young women in this age group had no occupation., 18263=Our work in 1973 will be concentrated on more detailed investigations of this kind., 139822=INSEE, Active population, 1968, Sample survey of 1/20, January 1971., 38271=The following table gives the breakdown of occupations in the other cases (325), compared with the breakdown in the population as a whole (National Institute of Statistics and Economic Studies (INSEE), 1968 census).}",
    "lastModified": "Thu, 30 Jun 2005 06:45:00 GMT",
    "textBeforeTable": "The breakdown of the services providing the information was as follows: The health information forms were received from 48 metropolitan d?partments and one overseas d?partment. A. SOCIO-ECONOMIC SURVEY Medico-social survey of 662 drug users 1. Monography by the National Institute of Health and Medical Research (INSERM), to be published shortly. The conclusion which emerges is that no action can be in the least effective if drug abuse is considered as a single epidemic disease to be treated by standardized therapeutic or prophylactic measures comparable to those used in tuberculosis control or the prevention of rickets. The failure of the efforts made in this field by neighbouring countries, however well-funded and ingenious they may have been, is sufficient to prove this point. The diversity of the cases we have studied has led us to agree with the clinicians that the habitual use of drugs is, in most cases, the symptom of a complex personal and social \"pathology\", in addition to being a means of relief, escape or change for the young person concerned. Fundamentally, except in regard to the risks involved, there is little difference here from the situation which may be observed in the case of all those persons who are legally misusing tranquillizers and sleeping pills. Clinical studies, which are obviously indispensable in investigating any human problem, have long emphasized the complexity of the factors involved. The third point on which we have become convinced is that fashion, curiosity,",
    "textAfterTable": "485 72.2 25-29 74 11.2 30 and over 37 5.6 Not specified 5 0.6 It will be noted that the under-twenty-fives predominate (81.4 per cent). 2. Sex Male: 66.9 per cent (443 subjects) Female: 33.1 per cent (219 subjects). 3. Breakdown by age and sex Age group Percentage of all males in sample Percentage of all females sample 14-17 5.2 17.4 18-24 77.0 67.4 25-29 11.8 10.1 30 and over 5.9 5.0 Not specified 0.1 0.1 Thus, there were only half as many female as male drug users, but the girls began at an earlier age. 4. Nationality Per cent French 91.2 Other Europeans 3.5",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}