{
    "relation": [
        [
            "",
            "Increased considerably",
            "Increased somewhat",
            "Remained basically unchanged",
            "Decreased somewhat",
            "Decreased considerably",
            "Total"
        ],
        [
            "Number of Respondents",
            "0",
            "1",
            "19",
            "0",
            "1",
            "21"
        ],
        [
            "Percent",
            "0.0",
            "4.8",
            "90.5",
            "0.0",
            "4.8",
            "100.0"
        ]
    ],
    "pageTitle": "FRB: Senior Credit Officer Survey on Dealer Financing Terms, September 2012",
    "title": "",
    "url": "https://www.federalreserve.gov/econresdata/releases/SCOOS_201209.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00176-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897316175,
    "recordOffset": 897282315,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18754=As the increased clearance, through central counterparties and other financial market utilities, of OTC derivatives trades may lead to changes in the collateralization of such transactions, the September survey included a set of special questions about the types of assets currently posted as initial margin. In particular, dealers were asked about the types of assets currently posted as collateral by their clients and the types of assets the dealers themselves currently post as collateral to CCPs. In addition, respondents were also queried about their expectations for changes over the next year in the types of collateral posted both by clients to dealers and by dealers to CCPs., 5052=The September Senior Credit Officer Opinion Survey on Dealer Financing Terms collected qualitative information on changes over the previous three months in credit terms and conditions in securities financing and over-the-counter (OTC) derivatives markets. In addition to the core set of questions, this survey included a set of special questions about the types of assets posted as collateral against OTC derivatives transactions. The 22 institutions participating in the survey account for almost all of the dealer financing of dollar-denominated securities to nondealers and are the most active intermediaries in OTC derivatives markets. The survey was conducted during the period from August 14, 2012, to August 27, 2012. The core questions ask about changes between June 2012 and August 2012.1, 8841=Dealers and other financial intermediaries. In the September survey, about one-third of respondents indicated that they had increased the amount of resources and attention devoted to management of concentrated exposures to dealers and other financial intermediaries over the past three months. (See the chart \"Management of Concentrated Credit Exposures and Indicators of Supply of Credit.\") In the June survey, about one-half of respondents had reported such an increase., 16636=As in the June survey, dealers reported that the credit terms under which most types of securities included in the survey are financed were little changed on balance. The only notable exceptions were agency and non-agency RMBS, for which a few respondents, on net, indicated that they had increased the maximum amount of funding available and extended the maximum maturity for their most-favored clients., 5930=While responses to the September survey pointed to no significant changes in the credit terms applicable to important classes of counterparties over the past three months, dealers did note a slight easing for some counterparties--including trading real estate investment trusts (REITs) and traditionally unlevered institutional investors such as pension funds, mutual funds, endowments, and insurance companies.2 The results of the survey also offered several other broad insights regarding dealer-intermediated provision of credit and leverage:, 11486=Trading real estate investment trusts. About one-fifth of dealers indicated in the September survey that they had eased nonprice terms offered to trading REITs over the past three months, while price terms had remained basically unchanged. More-aggressive competition from other institutions was the most important reason cited for doing so. Respondents indicated that use of financial leverage by trading REITs was little changed, on balance, over the same period. About one-fifth of dealers noted an increase in the intensity of efforts by trading REITs to negotiate more-favorable price and nonprice terms over the past three months, and two-fifths of respondents reported an increase in the provision of differential terms to most-favored clients., 9986=Hedge funds. Respondents to the September survey indicated that both price terms (such as financing rates) and nonprice terms (including haircuts, maximum maturity, covenants, cure periods, cross-default provisions, or other documentation features) offered to hedge funds for securities financing and OTC derivatives transactions had remained basically unchanged over the past three months. About one-fourth of dealers noted that there had been an increase in the intensity of efforts by hedge funds to negotiate more-favorable price and nonprice terms over the same period--the same fraction as in the June survey. Nearly all of the dealers indicated that the use of financial leverage by hedge funds had remained basically unchanged over the past three months, a different pattern of responses from surveys earlier in the year when modest net fractions of respondents had pointed to a reduction in financial leverage. (See the chart \"Use of Financial Leverage.\") Respondents also noted that there had been little change, on net, in the availability of additional financial leverage under agreements currently in place with hedge funds, which gives those funds the ability to rapidly increase their use of leverage should they choose to do so. About one-fourth of dealers reported that the provision of differential terms to most-favored (as a function of breadth, duration, and extent of relationship) hedge funds had increased over the past three months., 12269=Mutual funds, exchange-traded funds, pension plans, and endowments. A few dealers indicated that they had eased nonprice terms offered to mutual funds, exchange-traded funds (ETFs), pension plans, and endowments over the past three months, while price terms were said to have remained basically unchanged. About one-fifth of dealers noted an increase in the intensity of efforts by clients in this category to negotiate more-favorable price and nonprice terms over the same period. Respondents to the September survey reported that use of financial leverage by mutual funds, ETFs, pension plans, and endowments was basically unchanged over the past three months.}",
    "lastModified": "Fri, 04 Oct 2013 19:04:41 GMT",
    "textBeforeTable": "Over the past three months, how has the amount of resources and attention your firm devotes to management of concentrated credit exposure to dealers and other financial intermediaries (such as large banking institutions) changed? Dealers and Other Financial Intermediaries In some questions, the survey differentiates between the compensation demanded for bearing credit risk (price terms) and the contractual provisions used to mitigate exposures (nonprice terms). If your institution's terms have tightened or eased over the past three months, please so report them regardless of how they stand relative to longer term norms. Please focus your response on dollar-denominated instruments; if material differences exist with respect to instruments denominated in other currencies, please explain in the appropriate comment space. Where material differences exist across different business areas--for example, between traditional prime brokerage and OTC derivatives--please answer with regard to the business area generating the most exposure and explain in the appropriate comment space. Questions 1 through 40 ask about credit terms applicable to, and mark and collateral disputes with, different counterparty types, considering the entire range of securities financing and over-the-counter (OTC) derivatives transactions. Question 1 focuses on dealers and other financial intermediaries as counterparties; questions 2 and 3 on central counterparties and other financial utilities; questions 4 through 10 focus on hedge funds; questions 11 through 16 on trading real estate investment trusts (REITs); questions 17 through 22 on mutual funds, exchange-traded funds (ETFs), pension plans, and endowments; questions 23 through 28 on insurance companies;",
    "textAfterTable": "Back to section top Central Counterparties and Other Financial Utilities Over the past three months, how has the amount of resources and attention your firm devotes to management of concentrated credit exposure to central counterparties and other financial utilities changed? Number of Respondents Percent Increased considerably 2 9.1 Increased somewhat 11 50.0 Remained basically unchanged 9 40.9 Decreased somewhat 0 0.0 Decreased considerably 0 0.0 Total 22 100.0 To what extent have changes in the practices of central counterparties, including margin requirements and haircuts, influenced the credit terms your institution applies to clients on bilateral transactions which are not cleared? Number of Respondents Percent To a considerable extent 1 4.5 To some extent 5 22.7 To a minimal extent 11 50.0 Not at all 5 22.7 Total 22 100.0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}