{
    "relation": [
        [
            "Pokemon",
            "Boldore",
            "Woobat",
            "Aron",
            "Axew",
            "Drilbur"
        ],
        [
            "Type",
            "Rock",
            "Psychic/Flying",
            "Steel/Rock",
            "Dragon",
            "Ground"
        ],
        [
            "Chance of Encounter",
            "30%",
            "30%",
            "20%",
            "20%",
            "100%"
        ],
        [
            "Possible Levels",
            "27-28",
            "27-28",
            "29-30",
            "29-30",
            "27-30"
        ],
        [
            "Found In",
            "Anywhere",
            "Anywhere",
            "Anywhere",
            "Anywhere",
            "Dust Cloud"
        ]
    ],
    "pageTitle": "Pokemon Black Version 2 FAQ/Walkthrough for DS by RedIsPoetic - GameFAQs",
    "title": "",
    "url": "http://www.gamefaqs.com/ds/661226-pokemon-black-version-2/faqs/64482?page=4",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00289-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 454230363,
    "recordOffset": 454198764,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{137969=© 2015 CBS Interactive Inc. All rights reserved.SitemapAdvertisePrivacy PolicyAd ChoiceTerms of Use}",
    "textBeforeTable": "Trainer Battle: Team Plasma Grunt You'll follow Hugh and Cheren onto the ship. The three of you will converse before you're approached by a Grunt. He will raise the alarm and an entire group of Grunts will appear from the north, followed by a group to the south. You'll be completely surrounded and the epic fighting will ensue! Plasma Frigate - PWT If you want to, you can check out the Relic Passage - PWT Entrance before you enter the Driftveil Tournament in the Pokemon World Tournament building. First you may wish to exit and grab a few items. You'll find yourself at an intersection. Take the path south first. You'll head onto the docks. When you reach a T-intersection, head west. At the end of this dock is a PP Up! Grab it and head back to the main intersection in front of the Pokemon World Tournament building. This time, take the path east. Along the this path are two more stalls. They can also do something useful, although I don't yet know what. At the very end of the path is a man looking north. Talk to him to receive a Rocky Helmet. From there, head north until you're past the fountain. Move west and you'll see two Vending Machines with a bin to either side. Look in the eastern bin to find some Zinc. That's all there is to do here! You'll",
    "textAfterTable": "Double Battle: Team Plasma Grunt and Team Plasma Grunt Pokemon Level Type Team Plasma Grunt One Grimer 29 Poison Krokorok 29 Ground/Dark Team Plasma Grunt Two Golbat 29 Poison/Flying Liepard 29 Dark Cheren's Party Stoutland 33 Normal Watchog 31 Normal Cinccino 31 Normal Reward: $2320 Talk to your rival to intitiate the final Double Battle. This time you're teaming up with Hugh! Double Battle: Team Plasma Grunt and Team Plasma Grunt Pokemon Level Type Team Plasma Grunt One Grimer 29 Poison/Flying Raticate 29 Dark Team Plasma Grunt Two Koffing 29 Poison Watchog 29 Ground/Dark Hugh's Party, If Snivy Was Your Starter Pignite 33 Fire/Fighting Simipour 31 Water Tranquill 31 Normal/Flying Hugh's Party, If Tepig Was Your Starter Dewott 33 Water",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}