{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Good from what I've heard, although housing is off campus...",
            "Good greek life and a good club selection!",
            "SIS Majors",
            "TDR, The Beach, LA Quad, Main Quad, The Mud Box",
            "I'm on an almost full scholarship, but even if I had the money I would think twice. It can get expensive.",
            "Everything - DC is your Oyster.",
            "4. The meal swipes could be worth more, but TDR is great.",
            "5. Living in is amazing, you are basically part of a HUGE floor family.",
            "Definitely apply, AU is an amazing school. If any doubts, make sure you come by and visit.",
            "AU is perfect for International Relations, great for liberal arts majors and good for science majors."
        ]
    ],
    "pageTitle": "American University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/American-University/reviews?_escaped_fragment_=/show/94785",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00218-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891672175,
    "recordOffset": 891578858,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{302678=I am planning to attend in 2013, so I haven't had a chance to take classes, but from what I know, they require to have additional English and Math exams. I think it is a good thing because they ensure that the students have the skills necessary to be successful in advanced classes, especially research. I took some college classes in my high school, and most of the classes transferred and were applied towards my degree., 464237=I went to go look at this school in February of 2013 when I was looking at Maryland CP, GWU, and Georgetown. I got on the campus and was immediately unimpressed, the entire campus was grey and drap and the people were less than friendly. Needless to say, I did not apply here., 243934=The dorms can be pretty cramped, especially as the school's popularity grows. But the campus is expanding starting in 2013 to add more dormitories, which will make dorm life more comfortable., 335901=There is one main dining hall - Terrace Dining Hall (better known as TDR) - with the classic stations of salad, grill, pasta/pizza, and wok. In 2013, there should be implemented several other food options, such as Elevation Burger and Starbucks. They will join the ones already on campus such as Einstein Bros. Bagels, Megabytes, Eagle's Nest, and Tavern (got to get the tenders!)., 106669=The capitol is no NYC, but there's rarely a quiet night downtown. There are plenty of clubs and concerts (a popular small venue is The 9:30 club) where well-known bands and DJs come to play. Tuesday nights there are live poetry readings at Busboys and Poets on K street. If you're not one to travel downtown often, there's plenty happening on campus! Sororities have hosted some dance parties in Mary Graydon Center, movies have been shown before they premier in theaters, local metal/alternative bands have played in the basement of the Kay Spiritual Life Center, a zip line was set up down the length of the quad, as well as a petting zoo! The list goes on for miles., 491298=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/18/2009 Reviewer is A current student here. 52 out of 52 people found this review useful. 1 person found this inaccurate. 1 of 105 Bailey from Reno, NV Check out reviews left by other students or leave your own review. You could win a free scholarship. American University Reviews American University › District of Columbia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck While the tuition is very high, the quality of things on campus is very good. There are multiple different construction projects going on, but housing is currently a big issue. Many freshman find themselves in triples, and due to limited housing, juniors and seniors are having a harder time getting into campus housing. The food here is ok, though there are only two different options for places to use your meal swipes on campus. Am enjoying being here DC is such a great environment for college students, because there's always something going on in the city. American is unique because it has a campus, while still being inside the city. Am learning a lot The professors here at American are some of the best I've met between visiting campuses or friends at other colleges. They are very approachable, and dedicated to their fields of study. I haven't met one yet that doesn't have some sort of higher degree, and all have extra activities going on outside being a teacher. Login to rate or flag the reviews Justine from Topeka, KS",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}