{
    "relation": [
        [
            "First Name",
            "Raymond",
            "Belinda",
            "Jason",
            "Ivan"
        ],
        [
            "Last Name",
            "Bracy",
            "Garza",
            "Hill",
            "Zapien"
        ],
        [
            "Suffix",
            "",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            "LA, SenLevin01-07",
            "DirDemCauc02-04;COSSenMenendez05-08"
        ],
        [
            "New",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=17868A5D-3916-4E6B-9483-405D59BD37B0&filingTypeID=82",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 227904048,
    "recordOffset": 227888496,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17695=Miscellaneous tariff bills on artificial flowers: S. 2082 (floral sprays); S. 2083 (swags); S. 2084 (wreaths); S. 2599 (single-species bushes); S. 2600 (multi-species bushes); S. 2465 (arrangements); S. 2466 (floral stems); S. 2370 (clips); S. 2371 (picks); S. 2372 (candle rings), 12259=S. 730, Affordable Footwear Act of 2009 H.R. 496, Trade Enforcement Act of 2009 Discussions related to international operations and barriers to foreign investment in retail Discussions related to food security and agricultural development Discussions regarding bilateral investment treaties and the model BIT Discussions related to preference program reform H.R. 4101, New Partnership for Trade Development Act of 2009 H.R. 1318/1886, H.R. 2410 & S. 496, Pakistan and Afghanistan Reconstruction Opportunity Zones Discussions related to Panama and Colombia Free Trade Agreements S. 1631, Customs Facilitation and Trade Enforcement Reauthorization Act of 2009 H.R. 4284, to extend the Generalized System of Preferences and the Andean Trade Preferences Act, and for other purposes, 37249=ERISA preemption of state laws on helath benefits requirements Educational outreach and information sharing on Company's health care benefits, open enrollment online tools, $4 generic prescriptions, health clinics, health information technology, and health care reform principles S. 391 & H.R. 1321, Healthy Americans Act, a bill to provide affordable, guaranteed health coverage H.R. 2641, Medicare Secondary Payer and Workers' Compensation Settlement Agreements Act, and other general Medicare secondary payer issues Public private partnership with ONDCP to raise awareness to combat drug abuse S. 1152 & H.R. 2460, The Healthy Families Act, a bill to allow Americans to earn paid sick time so that they can address their own health needs and the health needs of their families General health care legislative reform -- policy options, financing policy options, delivery system reform options, and employer responsibility: America's Healthy Future Act (Senate Finance Committee proposal); S. 1679, Affordable Health Choices Act (Senate HELP Committee proposal); H.R. 3200 America's Affordable Health Choices Act of 2009, to provide affordable, quality health care for all Americans and reduce the growth in health care spending, and for other purposes; House proposals from Ways and Means, Energy & Commerce, and Education & Labor Committees; S. 1679 (HELP Committee passed bill); H.R. 3962 (House-passed bill); managers' amendments from Senate and House leadership H.R. 3991 Emergency Influenza Containment Act & S. 2790, Pandemic Protection for Workers, Families and Businesses Act, to ensure that American workers are able to follow, without financial harm, the recommendations of their employer and public health authorities to stay home when they have symptoms of a contagious disease that may put co-workers, customers or the public at risk, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 31754=H.R. 2383, to amend the Truth in Lending Act to prohibit unfair practices in electronic payment system networks, and for other purposes H.R. 4173, Wall Street Reform and Consumer Protection Act of 2009: CFPA, derivatives issues Senator Dodd discussion draft of finacial regulatory reform legislation: CFPA. derivitives issues Prepaid/gift card issues H.R. 3269, The Corporate and Financial Institution Compensation Fairness Act of 2009, 46068=H.R. 1173, Organized Retail Crime Act, to combat, deter, and punish individuals and enterprises engaged in organized crime involving theft and fencing of retail merchandize Education to federal law enforcement regarding the problem of organized retail crime S. 470, to combat organized retail crime involving retail theft for the purpose of re-selling stolen merchandize H.R. 1166, the E-Fencing Enforcement Act of 2009, to provide for more effective enforcement of the federal prohibition on the interstate shipment of stolen property H.R. 4011, Organized Retail Crime Prevention and Enforcement Act of 2009, to amend the federal criminal code to prohibit the transportation of fraudulently obtained goods valued at $1,000 or more for sale on an online marketplace and to the barter or sale of such goods online with knowledge that such goods have been stolen, converted or taken by fraud H.R. 2695 & S. 1212, Interchange Fees: legislation to amend the antitrust laws to ensure competitive market-based rates and terms for merchants' access to electronic payment systems H.R. 627 & S. 414, Credit Cardholders' Bill of Rights Act of 2009/Credit Card Accountability Responsibility and Disclosure Act of 2009/Credit CARD Act of 2009 H.R. 2221, Data Accountability and Trust Act H.R. 2861, Shareholder Empowerment Act of 2009 & S. 1074, Shareholder Bill of Rights Act of 2009 -- corporate governance issues, 27564=FY 2010 Administration budget proposal -- international tax issues, LIFO repeal provisions, and Energy Efficient Buildings Deduction (extended as part of H.R. 6049, extenders legislation in the 110th Congress) Sales and use taxes on interstate transactions (S. 34 and H.R. 3396 in the 110th Congress) H.R. 4213 Tax Extenders Act of 2009, 81303=Cargo security, C-TPAT, supply chain security, domestic emergency preparedness and readiness issues, DHS reauthorization General education on Walmart's global supply chain security program H.R. 2355, Making Opportunities Via Eficient and More Effective National Transportation (MOVEMENT) Act, 66257=Issues related to Company's domestic and international sustainability agenda, including its China Sustainability Initiative H.R. 2454 & H.R. 2998, American Clean Energy and Security Act of 2009, and S. 1733, Clean Energy Jobs and Power Act -- issues related to cap and trade, energy efficiency, smart grid, advanced meters, demand response, decoupling, EPACT05 proceedings, transmission grid, competitive markets/renewables, consumer rights to environmental attributes, green jobs and renewable projects Water issues: water reclamation; storm water runoff; water efficiency, 52644=H.R. 1409 & S. 560, Employee Free Choice Act H.R. 2460 & S. 1152, Healthy Families Act, a bill to provide paid sick leave H.R. 3249 & S. 1478, Strengthen and Unite Communities with Civics Education and English Skills Act of 2009 Administration initiatives seeking the participation of philanthropic companies and organizations in student achievement (K-16) and school reform/improvement: Department of Education Investing in Innovation fund; White House Office of Social Innovation Fund, 22389=Food Safety -- Education initiative regarding Company's food safety practices H.R. 2749, FDA Globalization Act of 2009, to amend the Federal Food, Drug and Cosmetic Act to improve the safety of food in the global market, and for other purposes H.R. 1398, the Labeling Education and Nutrition (LEAN) Act of 2009 S. 510, FDA Food Safety Modernization Act Women, Infants and Children (WIC) program reauthorization and H.R. 1105 (FY 09 omnibus appropriations bill) - eWIC issues S. 2792, A bill to amend the Federal Meat Inpection Act to develop an effective sampling and testing program to test for E. coli 0157:H7 in boneless beef manufacturing trimmings and other raw ground beef components, and for other purposes, 62308=S. 1232, a bill to amend the Federal Food, Drug and Cosmetic Act with respect to the importation of prescription drugs, and for other purposes, 57632=H.R. 2454 & H.R. 2998, American Clean Energy and Security Act of 2009, and S. 1733, Clean Energy Jobs and Power Act -- issues related to cap and trade, energy efficiency, smart grid, advanced meters, demand response, decoupling, EPACT05 proceedings, transmission grid, competitive markets/renewables, consumer rights to envirnonmental attributes, green jobs and renewable projects Potential amendment to Pub. L. No, 111-5 for aggregation of sites for renewable projects National Action Plan on Demand Response S. 1462, The American Clean Energy Leadership Act (and related Senate bills) -- amendments to Public Utility Regulatory Policy Act regarding net metering and interconnection; Distrbuted Generation amendment to the Renewable Electric Standard, 70845=H.R. 2221, Data Accountability and Trust Act -- data security FTC; Exploring Privacy, A Roundtable Series (December 7, 2009) Discussions on privacy and online behavioral advertising legislation}",
    "textBeforeTable": "",
    "textAfterTable": "3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  RAYMOND BRACY  2024340999  rsouth@stateandfed.com 5. Senate ID#  40305-12 7. Client Name Self Check if client is a state or local government or instrumentality  WAL-MART STORES, INC 6. House ID#  338300000",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}