{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus safety is a huge priority at Hope. You will frequently see campus safety vans around campus through out the day and there is a shuttle to various places on campus at night. They are very friendly and always willing to lend a helping hand!",
            "Hope is great for students who want a great environment and to be prepared for adult life.",
            "Hope has two huge traditions. One of these is the Pull, which is a huge tug of war competition between freshman and sophomores that takes place over a river. Pullers train for three weeks with their moralers for this competition. Nykerk is a competition between freshman and sophomores and includes events such as: oration (speech), play(theater), and song(music). Each year competes for the Nykerk Cup!",
            "Get involved with campus traditions. Nykerk and the Pull are two of Hope's oldest traditions. They provide great ways for freshman and sophomores to get involved.",
            "You will become well acquainted with Phelps at your time at Hope. Phelps provides a variety of different options each day. If you're not up for Phelps food, then head over to the Kletz for a quesadilla.",
            "All of the dorms are pretty nice. Get to know your R.A. and your life will be a lot easier, most of them are really nice and highly approachable. Smaller dorms provide a close community, while larger dorms are great for meeting lots of new people.",
            "Professors expect a lot from you, however their standards are not ridiculous and they are always there to lend a helping hand.",
            "Make sure that you apply early and that all of your forms are in on time. Also, make friends with upperclassmen, they can serve as great mentors and show you all of the wonderful things about Hope College.",
            "Hope College is the best! It provides such a great community for students to thrive spiritually as well as academically. It truly prepares you for the future."
        ]
    ],
    "pageTitle": "Hope College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Hope-College/reviews?_escaped_fragment_=/show/56701",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00090-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892835483,
    "recordOffset": 892773521,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{253694=© 2015, Cappex.com, LLC, 25209=I am not sure how I will be paying for this education but believe God has it all under control. There is helpful scholarships but they don't cover May terms and Summer classes., 242226=Durfee Hall, the all-men freshman dorm, has quite a few unusual traditions. A couple times a year, they have Chapel runs, where they strip down-- either to their boxers or completely naked-- and run to the Chapel in the middle of the night. They also have a competition where they do completely insane challenges for a month. Whoever gets the most points win. One of their challenges was to do a snow angel in front of Phelps Dining Hall in their boxers--in the dead of winter. Chapel is also amazing. Every Monday, Wednesday, and Friday, there is a super short worship/sermon from 10:30-10:50 am. It's worth getting up even if you don't have any classes until noon! Sometimes there are guest singers or preachers. There's also The Gathering, which happens every Sunday night. It's a little longer church sermon, but is much more intimate and ends with singing the Doxology while the entire congregation joins hands. It's definitely worth giving up an hour and a half of your Sunday night.}",
    "textBeforeTable": "08/12/2009 Reviewer is A current student here. 18 out of 19 people found this review useful. 1 of 51 Dale from Grandville, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. Hope College Reviews Hope College › Michigan › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Tips for prospective students Make sure you spend the night and attend classes to see if this is the right fit for you. Talk to students in your similar interests and they can relate their personal opinion on the topic rather than the advisers or professors, although they give great insight too. Bang for the buck Although Hope is very expensive, being a private school, they are usually very good about working with financial situations. This was the most expensive option for me, but I don't regret one day spent on campus. Am enjoying being here The atmosphere at Hope is amazing, and people are consistently nice and supportive. There are many well rounded activities for any individual to become involved in. Also, there is a great balance of social life and academics. Am learning a lot The professors here always offer office hours and are willing to help you in anyway possible. I feel like I'm constantly challenged and involved in my classes Login to rate or flag the reviews Amanda from Livonia, MI",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}