{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "As long as you have the common sense to bring friends with you when you go out at night and you stay within the Yale bubble (basically from the New Haven green to streets near Broadway and Popeyes/Alpha Delta Pizza), you won't have a problem. New Haven has a reputation as an unsafe city, but in my experience it's no different than other cities - it has it's bad parts, but mostly it's fine. All residential colleges require an ID to get into, so there aren't random people walking around and Yale students look out for each other. There is also a pretty large campus security presence and a lot of resources if you need a ride home or feel unsafe. I always feel safer if there is a guy in the group I'm out with as well.",
            "I'm not involved in Greek life, but it can be a fun part of the social scene. Many athletes are involved in fraternities and sororities, and most of the fraternities are associated with a specific sport or two. They seem to be really supportive of their members, and I haven't heard anything about bad hazing or problems with sexual misconduct.",
            "You can pretty much do anything you want at Yale, as long as you're up to the process of getting into whatever activity you want to do. The admission process for some activities can be daunting, but I can't imagine what I'd do without the people from my teams, jobs, and clubs.",
            "High-achieving extroverts do really well at Yale, which can be daunting for introverts, since nearly every extracurricular requires an application and interview, an audition, or a tryout.",
            "The admissions office will tell you that Yale students touch the golden foot of a statue on Old Campus before tests for luck and allow you to take a picture doing so to give you luck for your application. We don't touch it, and you probably shouldn't either, judging by rumors of what some groups have put on the foot.",
            "The financial aid at Yale cannot be matched. Paired with the incredible academic rigor, you won't find a school with better bang for the buck.",
            "It depends on what social scene you are into, but there's anything from frat parties to board games and friends watching Netflix. Toads is a dance club/bar/bonding experience that Yale students go to on Wednesdays and Saturdays. The social experience is really what you make of it, and for me has been much better as a sophomore that as a freshman, because people have relaxed about general drinking and party habits. There is a lot of alcohol consumption and very little regulation by Yale security or police.",
            "Yale's food is way better than other cafeteria food. The desserts are incredible (hello, freshman 15) and there are special dinners each semester with really classy food. The freshman year holiday dinner was another highlight of my Yale experience. There's even a place where you can get bagels with lox (tons and tons of smoked salmon and capers!) every other Saturday!",
            "Some people love the dorms, but if you don't click with your residential college, it can be hard. (There is the option of transferring to another residential college as a sophomore.) In my college, freshman year has all suites of 4 people, but sophomore year is all 6's, and junior and senior years are 3's,4's, and 5's, so it can be really difficult to stay with all your suitemates if the number doesn't quite work out. There is a ton of housing drama. Overall, the social scene is really nice, and the dorms themselves are beautiful - all hard wood floors and paneling, with large windows to let in light.",
            "Yale is hard, especially as a STEM major, but I love it. There are so many resources available and so many opportunities because Yale is one of the greatest research universities in the world. It's really easy to find work in a lab or make connections with incredible writers and artists, if you're a humanities person. I couldn't ask for more!",
            "If you are accepted, make sure it's the school and not just the name that you love (that goes for any school). Also, go to Bulldog Days if you can. I felt that Yale was the right fit for me when I visited, which is why I'm here now. If you decide to enroll, sign up for a pre-orientation program; it's a great way to start the semester with a group of friends and makes the transition so much easier while also giving you connections to upperclassmen. FOOT (Freshman Outdoor Orientation Trips) was one of my favorite Yale experiences!",
            "Yale is a great place for an academic challenge and usually great socially, but it can be isolating for students from lower-income families due to the large number of extremely wealthy, boarding school/magnet school kids. The residential college system gives you a group of people to associate with, but is basically luck of the draw, and because the dorms are organized by entryway, there are few people on one floor, which keeps groups fairly small and close-knit. STEM majors are often discouraged due to harder courses and a lack of well-taught intro classes, especially in mathematics, but tend to bond over the walks to science hill, the never-ending stream of midterms, and the eccentric lecturers."
        ]
    ],
    "pageTitle": "Yale University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Yale-University/reviews?_escaped_fragment_=/show/70413",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00037-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911429231,
    "recordOffset": 911380575,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{171027=Take AP and advanced classes, do well in the them, try to get at least a 2000 on the SAT's, and DO WHAT YOU LOVE. Besides good grades and some extracurriculars/leadership, Yale really looks for students who are passionate about and have excelled in a certain field. My passion was art. For some it was music, and for some it was math competitions. In short, it's good to have some extra-curriculars and leadership, but in order to stand out, you need to have something that you're really passionate about and that you've excelled in. By excelled I mean things like teaching an art class or entering art competitons (if you're an artist) or if you're really interested in politics, maybe working on a local campiagn. Just find something that you can really delve into. This is what will separate you from people who only have a perfect SAT and GPA to go on., 38512=Food on campus is not bad, but the availability of late-night food is less than satisfactory. Dining halls close at 7:30, and this tends to be a problem for students who are up late. The only other options around campus (Gourmet Heaven and Durfee's) are ridiculously expensive. However, Downtown New Haven has some great restaurants. If money is not a factor, these are definitely great options., 79487=Yale is by far one of the most academically demanding institutions in the world. You will be pushed harder than you have ever be pushed before, and you will learn more than you have ever thought possible. But unlike other Ivy League schools, Yale has a healthy academic climate that will not burn you out. Yale's liberal arts curriculum will nurture your mind. You will get taught by some of the world's leading scholars, like historian John Gaddis, psychologist Paul Bloom, economist Stephen Roach, and law scholar Akhil Amar., 221509=© 2015, Cappex.com, LLC, 95573=Looks like Yale's engineering program are very small with a high studnet to faculty ratio of 1:1 or 2:1}",
    "textBeforeTable": "07/27/2009 Reviewer is Researching this school. Reviewer has been to campus. 101 out of 114 people found this review useful. 1 of 60 Sara from Buda, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. Yale University Reviews Yale University › Connecticut › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot It is hard to limit yourself to only 4 or 5 courses with all that Yale has to offer. It isn't unheard of for very ambitious students to pile on 6 or even 7 at a time! Many classes will push you hard to master the material, but there are always a handful of courses that are more laid back. That is, you get as much out of them as you're willing to put in. Login to rate or flag the reviews Sophia from Marlboro, NJ 10/25/2010 Reviewer is A current student here. 44 out of 46 people found this review useful. 1 person found this inaccurate. 3 of 60 Categories Comments Great for these types of students The arts scene is great here, so anyone who really likes the arts will enjoy Yale. Frankly, every scene you can think of is pretty vibrant here, and everyone will find their place. If people are looking for professional advancement and training though, they'd be far better off looking for",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}