{
    "relation": [
        [
            "Responder",
            "Lawrence Catchpole",
            "Patrick Nepper",
            "hiromi honda",
            "Nicholas Jones",
            "KATERINA PASTRA",
            "Simon Harper",
            "Jose ROUILLARD",
            "Kostas Karpouzis",
            "Alex Pfalzgraf",
            "Norbert Reithinger",
            "Jan Alexanderson",
            "Quan Nguyen",
            "Ali Choumane",
            "Garland Phillips",
            "Hirotaka Ueda",
            "Massimo Romanelli",
            "Daniel Sonntag",
            "Yoshitaka Tokusho"
        ],
        [
            "General comments",
            "",
            "Again, I would like to see a revitalization of XHTML+Voice. Both, XHTML and VoiceXML have already proven their advantages for their respective modalities. Combining both to build a multimodal specification language seems very promising to me (as far as our prototype implementations are concerned).",
            "",
            "I think maybe there needs to be an explicit statement about how UI design is expected to evolve so we can discuss the target. I suspect we have at least 3 stages: (a) simple UI (like a GUI). (2) composite UI involving lots of input / output technologies. (3) environmental UI involving lots of separate devices in an intelligent environment.",
            "",
            "",
            "",
            "",
            "",
            "Excuse for any typos and glitches of a non-native speaker :-)",
            "",
            "",
            "",
            "",
            "",
            "",
            "I think the form is well-structured. But more concrete scenarios should be regarded. I think different integration environments and characteristics, e.g., time, effort, and skills, result naturally in different standardisation requirements.",
            ""
        ]
    ],
    "pageTitle": "Results of Questionnaire Questionnaire on Multimodal Web Application Authoring - Web-Based Straw-poll and Balloting System",
    "title": "",
    "url": "http://www.w3.org/2002/09/wbs/1/MmiAuthoringQuestions/results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00000-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 811413058,
    "recordOffset": 811396664,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{1117=This questionnaire was open from 2007-05-06 to 2007-06-30.}",
    "lastModified": "Wed, 29 Jul 2015 10:34:11 GMT",
    "textBeforeTable": "Details 5.65 Others (Please specify below) 4.18 Automobiles 3.76 Kiosks 4.12 Home appliances: communication (telephone, chat, etc.) 3.82 Home appliances: security (outside lights, locks, etc.) 3.18 Home appliances: food management(microwave, refrigerator, coffeepot, etc.) 4.35 Home appliances: entertainment (TV, radio,video recorder, gaming devices, etc.) 3.35 Home appliances: environment (thermostat, lights, etc.) 4.76 Cell phones 3.76 Laptops 3.65 Desktop PC's Value All responders: Choices Averages: 14 1 1 1 Others (Please specify below) 1 8 2 5 1 Automobiles 4 2 5 1 2 3 Kiosks 1 8 2 5 1 Home appliances: communication (telephone, chat, etc.) 3 3 4 4 1 2 Home appliances: security (outside lights, locks, etc.) 3 1 2 6 5 Home appliances: food management(microwave, refrigerator, coffeepot, etc.) 1 7 7 1 1 Home appliances: entertainment (TV, radio,video recorder, gaming devices, etc.) 1 2 5 5 2 2 Home appliances: environment (thermostat, lights, etc.) 1 12 3",
    "textAfterTable": "Nicholas Jones 3 4 5 3 4 3 3 3 3 3 4 The falling cost of simple computing combined with wireless networking means that it's likely there will be a very wide range of future devices that don't fit into today's neat categories such as \"cellphone\" or \"home entertainment device\". Furthermore, I expect that in the longer term future user interfaces will become disassociated from individual devcies, with multiple devices participating in a user experience. E.g. use cases like \"follow me\" video calls which switch between the mobile phone and the TV as I move around the house. Therefore specifications should be as open as possible to new devices and new multi-device interaction paradigms. KATERINA PASTRA 5 5 3 4 5 3 3",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}