{
    "relation": [
        [
            "Patent application number",
            "20110123852",
            "20130312255"
        ],
        [
            "Description",
            "Thin Film Electrodes and Battery Cells, and Methods of Fabrication - Thin-film electrodes and battery cells, and methods of fabrication. A thin film electrode may be fabricated from a non-metallic, non-conductive porous support structure having pores with micrometer-range diameters. The support may include a polymer film. A first surface of the support is metalized, and the pores are partially metallized to create metal tubes having a thickness within a range of 50 to 150 nanometers, in contact with the metal layer. An active material is disposed within metalized portions of the pores. An electrolyte is disposed within non-metalized portions of the pores. Active materials may be selected to create an anode and a cathode. Non-metalized surfaces of the anode and cathode may be contacted to one another to form a battery cell, with the non-metalized electrolyte-containing portions of the anode facing the electrolyte-containing portions of the cathode pores. A battery cell may be fabricated as, for example, a nickel-zinc battery cell.",
            "Method of Fabricating Thin Film Electrodes Including Metal Tubes Filled With Active Material - A thin film electrode is fabricated from a non-metallic, non-conductive porous support structure having pores with micrometer-range diameters. The support may include a polymer film. A first surface of the support is metalized, and the pores are partially metallized to create metal tubes having a thickness within a range of 50 to 150 nanometers, in contact with the metal layer. An active material is disposed within metalized portions of the pores. An electrolyte is disposed within non-metalized portions of the pores. Active materials may be selected to create an anode and a cathode. Non-metalized surfaces of the anode and cathode may be contacted to one another to form a battery cell, with the non-metalized electrolyte-containing portions of the anode facing the electrolyte-containing portions of the cathode pores. A battery cell may be fabricated as, for example, a nickel-zinc battery cell."
        ],
        [
            "Published",
            "05-26-2011",
            "11-28-2013"
        ]
    ],
    "pageTitle": "Peck, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/peck-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00315-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 454197107,
    "recordOffset": 454160745,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Gary E. Peck, Virginia Beach, MD US //]]> BarDraw('2936603',['Patent applications by Don E. Peck, Raleigh, NC US'],[[1,2,1,1]],['2005','2008','2009','2010'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2936603\" align=\"center\"></div> </div> <canvas id=\"bg2936603\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Don E. Peck, Raleigh, NC US</p> <div class=\"bar2936603\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>07-29-2010</td> <td><a href=\"/patents/app/20100190452\">System of Communication Using Microwave Signals Over Wireline Networks</a> - The present invention provides a system for wide-range microwave communications over wireline networks. In an exemplary embodiment, a wide-range transceiver is made having pre-calibrated modular units including an IF radio processing card, an RF transmitter module, and an RF receiver module. Calibration factors are loaded into a memory (e.g., EEPROM) in each module during production. Certain additional calibration factors may also be loaded upon installation, such as a one time calibration for the type and length of cable connecting the RF unit to a remote SPU (signal processing unit). A processor in the RF unit is responsive to control signaling indicating a desired transmitter or receiver configuration (e.g., a particular frequency, bandwidth and modulation), to attenuate the signal in the transmitter/receiver path based on the predetermined calibration factors from the applicable modules. A method for calibrating the modules is also disclosed.</td> <td>20100190452</td> <tr> </tr> <td>01-15-2009</td> <td><a href=\"/patents/app/20090017774\">System and Method for Calibrating a Transceiver</a> - The present invention provides systems and methods for calibrating a transceiver. In an exemplary embodiment, a method of operating a modular wide-range microwave",
    "textAfterTable": "Gerald W. Peck, Saint Simons Island, GA US Patent application number Description Published 20120065752 Audio Recorder and Player for Persons with Impaired Vision - A sound recorder and player has a main body that is shaped to be held in the palm of either the right or left hand, with finger grips that associate recorder/player functions with each finger of the hand. A principal tactile feature enables the user to identify quickly the orientation of the device with respect to a person's thumb. The device is compact so as to minimize space requirements for carrying it, and it is rounded both for comfort in the hand and to reduce snagging and potential difficulty in removing it from, or putting it into, a pocket or bag. 03-15-2012 Gregory Peck, Jamaica, NY US Patent application number Description Published 20130345033 Device and Method for Exercise Device - The present invention provides an exercise device for exercising the human body, wherein the device is formed as a low friction apparatus for use on a variety of surfaces. The device in a particular form incorporates a retraining harness that is affixed to the device that allows the user to secure their hands and feet into separate devices. The present invention is also directed to a device that allows the user to select between high friction and low frictions parts of the bottom, so as to",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}