{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus police are always patroling the area and there are emergency alert station all across campus for everyone's safety.",
            "There is no Greek life.",
            "There are clubs for every major, and most are fairly active. There is always something going on on campus, but to stay in the loop be sure to check the website or visit the Lyceum for information.",
            "Walters State is great for anyone that is not exactly sure where they want to go or what they want to do. Also, if someone is having a hard time going away from home, WSCC offers a lot of majors and most classes transfer to four year institutions in the surrounding area.",
            "The nursing program is located on the bottom floor of the technology building, and the student tutoring lab is located on the lower level of the Lyceum.",
            "$3,000 dollars are year compared to $12,000+ is a great deal.",
            "There are many different things that go on on campus. Athletics, plays, movie showings, and club meetings can always be found.",
            "The cafe has a lot of choices. People are always inside eating and having fun.",
            "There are not dorms on campus. It is a commuting school.",
            "The academics are, sometimes, easier compared to four year institutions. Even though the work is not as hard, I am still learning the same things as my friends that attend four year schools just at an easier pace for me to understand.",
            "Get to school about fifteen minutes prior to class time, especially for afternoon classes, because parking spaces fill up fast. Get to know the faculty because they can help in deciding what you want to do or where you want to go or help in getting you to where you want to be.",
            "Walters State is a great school to start out. Small classes and being close to home made the transition from high school into college much easier. The professors and other faculty are very friendly and helpful, which makes the experience a lot better."
        ]
    ],
    "pageTitle": "Walters State Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Walters-State-Community-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00310-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909737079,
    "recordOffset": 909695613,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{106995=They help you with whatever you need. The school will not have any federal financial aid starting fall 2013. The teachers and staff are all very helpful., 180215=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/10/2009 Reviewer is A current student here. 10 out of 10 people found this review useful. 1 of 47 Lauren from Sevierville, TN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "This college is great for all students. Bang for the buck The classes are more affordable than most other colleges. Am enjoying being here All of the staff is really nice and the classes are easy to get to. Am learning a lot The classes are small so it is easy to get the help you need. Login to rate or flag the reviews Taylor from New Tazewell, TN 09/27/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 4 of 47 Categories Comments Bang for the buck I had issues with Financial Aid and my Hope scholarship, but once the counselors were able to straighten things out Walters State seems worth the money. Am enjoying being here",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}