{
    "relation": [
        [
            "Date",
            "Jan 29, 2004",
            "Dec 17, 2004",
            "Apr 11, 2006",
            "Dec 11, 2006",
            "Dec 14, 2006",
            "Mar 2, 2009",
            "Mar 5, 2013",
            "Apr 15, 2013",
            "Oct 29, 2013",
            "Feb 10, 2014",
            "May 2, 2014",
            "Oct 26, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: STS BIOPOLYMERS, INC., NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:WHITBOURNE, RICHARD J.;CHAMBERLAIN, ALEXANDRA M.;HULLIHEN, DANIEL G.;AND OTHERS;REEL/FRAME:014945/0302 Effective date: 20030922",
            "Owner name: ANGIOTECH BIOCOATINGS CORP., WASHINGTON Free format text: CHANGE OF NAME;ASSIGNOR:STS BIOPOLYMERS, INC.;REEL/FRAME:016083/0970 Effective date: 20041021 Owner name: STS BIOPOLYMERS, INC., NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:WHITBOURNE, RICHARD J.;CHAMBERLAIN, ALEXANDRA M.;HULLIHEN, DANIEL;AND OTHERS;REEL/FRAME:016083/0956;SIGNING DATES FROM 20040920 TO 20041013 Owner name: STS BIOPOLYMERS, INC., NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:WHITBOURNE, RICHARD J.;CHAMBERLAIN, ALEXANDRA M.;HULLIHEN, DANIEL;AND OTHERS;SIGNING DATES FROM 20040920 TO 20041013;REEL/FRAME:016083/0956",
            "Owner name: CREDIT SUISSE, AS COLLATERAL AGENT, NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNOR:ANGIOTECH BIOCOATINGS CORP.;REEL/FRAME:017448/0708 Effective date: 20060323",
            "Owner name: ANGIOTECH BIOCOATINGS, INC., NEW YORK Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:CREDIT SUISSE;REEL/FRAME:018606/0632 Effective date: 20061211",
            "Owner name: ANGIOTECH BIOCOATINGS CORP., NEW YORK Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE ASSIGNEE NAME PREVIOUSLY RECORDED ON REEL 018606 FRAME 0632. ASSIGNOR(S) HEREBY CONFIRMS THE RELEASE OF SECURITY INTEREST;ASSIGNOR:CREDIT SUISSE;REEL/FRAME:018633/0599 Effective date: 20061211",
            "Owner name: WELLS FARGO FOOTHILL, LLC AS AGENT,GEORGIA Free format text: SECURITY AGREEMENT;ASSIGNORS:ANGIOTECH PHARMACEUTICALS, INC.;AFMEDICA, INC.;AMERICAN MEDICAL INSTRUMENTS HOLDINGS, INC.;AND OTHERS;REEL/FRAME:022329/0310 Effective date: 20090227",
            "Owner name: ANGIOTECH PHARMACEUTICALS (US), INC., ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ANGIOTECH BIOCOATINGS CORP.;REEL/FRAME:029930/0255 Effective date: 20130301",
            "Owner name: QUILL MEDICAL, INC., CANADA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:DEUTSCHE BANK NATIONAL TRUST COMPANY;REEL/FRAME:030218/0820 Effective date: 20130412 Owner name: ANGIOTECH PHARMACEUTICALS, INC., CANADA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:DEUTSCHE BANK NATIONAL TRUST COMPANY;REEL/FRAME:030218/0820 Effective date: 20130412 Owner name: ANGIOTECH INTERNATIONAL HOLDINGS CORP., CANADA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:DEUTSCHE BANK NATIONAL TRUST COMPANY;REEL/FRAME:030218/0820 Effective date: 20130412 Owner name: MEDICAL DEVICE TECHNOLOGIES, INC., CANADA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:DEUTSCHE BANK NATIONAL TRUST COMPANY;REEL/FRAME:030218/0820 Effective date: 20130412 Owner name: ANGIOTECH AMERICA, INC., CANADA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:DEUTSCHE BANK NATIONAL TRUST COMPANY;REEL/FRAME:030218/0820 Effective date: 20130412 Owner name: AMERICAN MEDICAL INSTRUMENTS HOLDINGS, INC., CANAD Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:DEUTSCHE BANK NATIONAL TRUST COMPANY;REEL/FRAME:030218/0820 Effective date: 20130412 Owner name: MANAN MEDICAL PRODUCTS, INC., CANADA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:DEUTSCHE BANK NATIONAL TRUST COMPANY;REEL/FRAME:030218/0820 Effective date: 20130412 Owner name: B.G. SULZLE, INC., CANADA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:DEUTSCHE BANK NATIONAL TRUST COMPANY;REEL/FRAME:030218/0820 Effective date: 20130412 Owner name: ANGIOTECH PHARMACEUTICALS (US), INC., CANADA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:DEUTSCHE BANK NATIONAL TRUST COMPANY;REEL/FRAME:030218/0820 Effective date: 20130412 Owner name: ANGIOTECH BIOCOATINGS CORP., CANADA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:DEUTSCHE BANK NATIONAL TRUST COMPANY;REEL/FRAME:030218/0820 Effective date: 20130412 Owner name: SURGICAL SPECIALTIES CORPORATION, CANADA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:DEUTSCHE BANK NATIONAL TRUST COMPANY;REEL/FRAME:030218/0820 Effective date: 20130412",
            "Owner name: ANGIOTECH PHARMACEUTICALS, INC., CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ANGIOTECH PHARMACEUTICALS (US), INC.;REEL/FRAME:031510/0399 Effective date: 20130716",
            "Year of fee payment: 4",
            "Owner name: IPXMEDICAL, LLC, TENNESSEE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ANGIOTECH PHARMACEUTICALS, INC;REEL/FRAME:032815/0107 Effective date: 20140425 Owner name: IPXMEDICAL, LLC, TENNESSEE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ANGIOTECH PHARMACEUTICALS, INC.;REEL/FRAME:032815/0138 Effective date: 20140425",
            "Owner name: ANGIOTECH PHARMACEUTICALS (US), INC., ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ANGIOTECH BIOCOATINGS CORP.;REEL/FRAME:034034/0900 Effective date: 20130301"
        ]
    ],
    "pageTitle": "Patent US7771468 - Medicated stent having multi-layer polymer coating - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7771468?dq=7,550,386",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00149-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478005415,
    "recordOffset": 477954100,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{53701=Prior coatings also do not provide drug-containing layers with useful cohesion. Therefore, even though polymer layers cover the drug layers, the drug layers can break up in the direction orthogonal to the device surface, causing catastrophic adhesion failures. Up to 40% of the drug can be lost during stent expansion with prior drug layer coatings. (G. W. Stone, May 5, 2003 TCTMD e-letter), 60088=In another embodiment of the invention, the surface properties of the coating can be further influenced by its relative composition, having varying degrees for example, from highly lubricious to essentially non-lubricious. By including pharmacological agents in the surface layer, the surface can become a drug reservoir and provide high regional drug concentrations, while systemic concentrations remain low. Such polymeric alloys are described herein, and also in U.S. Pat. No. 5,069,899, Whitboume, et al., titled “Anti-thrombogenic, anti-microbial compositions containing heparin;” U.S. Pat. No. 5,525,348, Whitboume, et al., titled “Coating compositions comprising pharmaceutical agents;” U.S. Pat. No. 6,086,547, Hanssen, et al., titled “Wire for medical use coated with polyether sulphone and a copolymer;” and U.S. Pat. No. 6,110,483, Whitboume, et al., titled “Adherent, flexible hydrogel and medicated coatings;” published PCT international application WO 01/15526 titled “Anti-infective covering for percutaneous and vascular access devices and coating method;” U.S. Ser. No. 09/442,891, filed Nov. 18, 1999, titled “Flexible sealed coil-like devices;” and U.S. Ser. No. 60/196,781, provisional application filed Apr. 13, 2001, titled “Targeted therapeutic agent release devices and methods of making and using the same,” which are incorporated herein by reference., 79189=Cellulose esters such as cellulose acetate, cellulose acetate propionate, cellulose acetate butyrate, cellulose acetate phthalate, and cellulose nitrate may be used. The cellulose ester preferably serves as a polymer component in the hybrid polymer compositions. Cellulose nitrate is preferred because of its compatibility with the active agents and its ability to impart non-tackiness and cohesiveness to the coatings. Cellulose nitrate has been shown to stabilize entrapped drugs in ambient and processing conditions. Cellulose nitrate (nitrogen content=11.8-12.2%) preferably is used in this invention, although grades of the polymer having lower nitrate concentrations could be used. Viscosity grades, such as 3.5, 0.5 or 0.25 seconds, are used in order to provide proper rheological properties when combined with the coating solids used in these formulations. Higher or lower viscosity grades could be used. However, the higher viscosity grades can be more difficult to use because of the high viscosities that obtain at the solids concentrations preferred in this invention. Lower viscosity grades, such as 3.5, 0.5 or 0.25 seconds, preferably are used in order to provide proper theological properties when combined with the coating solids used in these formulations. Physical properties such as tensile strength, elongation, flexibility, and softening point are related to viscosity (molecular weight) and can decrease with the lower molecular weight species, especially below the 0.25 second grades., 65135=In a further embodiment, the medicated stent may comprise one or more polymers having a flexural modulus greater that 1000 psi and elongation at break greater than 200%. The medicated stent may have a drug reservoir layer comprising a polymer selected from acrylate polymer/copolymer, acrylate hydroxyl and/or carboxyl copolymer, polyvinyl pyrrolidone (PVP), PVP/VA, cellulose ester, polyurethane, polycarbonate-urethane polymer, silicone-urethane polymer, epoxy polymer, polyethylene glycol and/or polyethylene oxide. The medicated stent may have a drug reservoir comprising one or more polyurethanes, cellulose nitrate, and/or one or more other cellulose ester polymer(s)., 67898=In a further embodiment, the active agent may be selected from one or more of plasmin, streptokinase, single chain urokinase, urokinase, t-PA (tissue type plasminogen activator), aminocaproic acid, aspirin, monoclonal antibodies, peptides, drugs (e.g. ReoPro, Cilastagel, eptifibatide, tirofiban, ticlopidine, Vapiprost, dipyridamole, forskolin, angiopeptin, argatroban, dextan, heparin, LMW heparin, heparin complexes, Enoxaparin, Dalteparin, hirudin, recombinant hirudin, anti-thrombin, synthetic antithrombins, thrombin inhibitors, Warfarin, other coumarins, vincristine, vinblastine, paclitaxel and its analogues, methotrexate, cisplatin, fluorouracil, rapamycin, sirolimus, tacrolimus, everolimus, azathioprine, cyclophosphamide, mycophenolic acid, corticosteroids, colchicine, nitroprusside, paclitaxel, angiostatin and endostatin; genetic materials, oligonucleotides, Cilazapril, Lisinopril, Captopril, VEGF, FGF, Probucol, Tocopherol, nifedipine, dipyridamole, Molsidomine, angiopeptin, prednisolone, glucocorticoid, dexamethasone, rifamycin, Re-188, Re-186, I-125, Y-90 celecoxib, Vioxx, dipyridamole, theophylline, alone or in combinations., 99883=Examples of active agents that can be combined with the hybrid polymer carrier layers of the invention include anti-fibrin and fibrinolytic agents, including plasmin, streptokinase, single chain urokinase, urokinase, t-PA (tissue type plasminogen activator), aminocaproic acid; anti-platelet agents including, aspirin, prostacyclins (and analogues); glycoprotein IIb/IIa agents including monoclonal antibodies, peptides (e.g. ReoPro, Cilastagel, eptifibatide, tirofiban, ticlopidine, Vapiprost, dipyridamole, forskolin, angiopeptin, argatroban), thromboxane inhibitors; anti-thrombin and anti-coagulant agents, including dextan, heparin, LMW heparin (Enoxaparin, Dalteparin), hirudin, recombinant hirudin, anti-thrombin, synthetic antithrombins, thrombin inhibitors, Warfarin (and other coumarins); anti-mitotic, antiproliferative and cytostatic agents, including vincristine, vinblastine, paclitaxel, methotrexate, cisplatin, fluorouracil, rapamycin, azathioprine, cyclophosphamide, mycophenolic acid, corticosteroids, colchicine, nitroprusside; antiangiogenic and angiostatic agents, including paclitaxel, angiostatin and endostatin; genetic materials and oligonucleotides; ACE inhibitors (e.g. Cilazapril, Lisinopril, Captopril); growth factor (e.g. VEGF, FGF) antagonists; antioxidants and vitamins (e.g. Probucol, Tocopherol); calcium channel blockers (e.g. nifedipine); fish oil (omega 3-fatty acid); phosphodiesterase inhibitors (e.g. dipyridamole); nitric acid donor (e.g. Molsidomine); somatostatin analogues (e.g. angiopeptin); immunosuppresives and anti-inflammatory agents (e.g. prednisolone, glucocorticoid and dexamethasone); antimicrobials (e.g. rifamycin) and radionuclides, including alpha, beta and gamma emitting isotopes (e.g. Re-188, Re-186, I-125, Y-90); COX-2 inhibitors such as Celecoxib and Vioxx; kinase inhibitors, such as epidermal growth factor kinase inhibitor, tyrosine kinase inhibitors, MAP kinase inhibitors protein transferase inhibitors, Resten-NG, and other biologically active agents and biologic response modifiers, and others, alone or in combinations to exert multiple actions simultaneously in order to prevent restenosis, and provide other desired biological effects., 44705=This application is a continuation-in-part of International Patent Application No. PCT/US02/08039, filed on Mar. 18, 2002 which claims priority to U.S. Provisional Application No. 60/276,089, filed on Mar. 16, 2001, all of which are hereby incorporated by reference., 73863=The primer layer can comprise an ethylene acrylic acid copolymer and an epoxy polymer, wherein the ethylene acrylic acid copolymer can be one or more of PRIMACOR.™. 5989 and 5990. The epoxy can be one or more of EPOTUF.RTM. 38-505, EPOTUF.RTM. 37-618, and EPON 1001., 52157=Finally, Von Bergelen et al. “The JOSTENT™ Coronary Stent Graft-Just Another Stent? . . . or How Should it be Implanted?”, Abstract: 825-4, ACC 2000/49th Annual Scientific Session, Mar. 12-15, 2000, Anaheim, Calif., USA, describes a sleeve of two stents with an ultra thin PTFE tube there between, which was implanted in 24 patients who had suffered acute coronary ruptures. This method mandates the use of oversized high-pressure balloon catheters to achieve adequate expansion of this new coronary stent graft (CSG). In addition, the endoprosthsesis must be accurately sized and placed to avoid occlusion of side branches originating from the target lesion segment, and thrombus formation is a concern.}",
    "textBeforeTable": "Patent Citations The gelatin and human albumin polymers produce coatings that fail to adhere to steel tabs or stainless steel stents. The inventive coatings were far superior. CONCLUSION The coated stents were dyed with a Gentian Violet solution and compared to a dyed uncoated stent. The stent pieces were dipped into the solution and blotted dry with a paper towel. Both the coated stents showed a bright purple color while the uncoated stent did not show the bright purple color. This shows that the stents were covered with the polymer coatings. The samples underwent the dry adhesion tape test and were observed under a microscope. Polymer strands were seen to be coming off, showing the samples failed the adhesion test. No other tests were performed since they failed the first test. The coating solutions both produce a uniform coating on the steel tabs. However, the tape dry adhesion tests show that both coatings failed. No other tests were preformed since they failed in the first test. Results/Summary Repeat steel tab procedure using the 15 mm stainless steel stents, except add one step. After drawing the sample from the coating solution use helium to blow any excess polymer off the stent. (Remove any polymer that may be filling the holes in the stent.) Clean the steel tabs with 1,1,1 trichloroethane then coat with each of the polymer solutions by dip coat",
    "textAfterTable": "US6368611 Aug 31, 1999 Apr 9, 2002 Sts Biopolymers, Inc. Anti-infective covering for percutaneous and vascular access device and coating method US6395326 May 31, 2000 May 28, 2002 Advanced Cardiovascular Systems, Inc. Apparatus and method for depositing a coating onto a surface of a prosthesis US6403635 Aug 17, 2000 Jun 11, 2002 The United States Of America As Represented By The Secretary Of The Department Of Health And Human Services Method of treating atherosclerosis or restenosis using microtubule stabilizing agent US6491666 Nov 17, 2000 Dec 10, 2002 Microchips, Inc. Microfabricated devices for the delivery of molecules into a carrier fluid US6491938 Jun 29, 2001 Dec 10, 2002 Neorx Corporation Therapeutic inhibitor of vascular smooth muscle cells US6515009 Feb 15, 1995 Feb 4, 2003 Neorx Corporation Therapeutic inhibitor of vascular smooth muscle cells US6515016 Dec 1, 1997 Feb 4, 2003 Angiotech Pharmaceuticals, Inc. Composition and methods of paclitaxel for treating psoriasis US6599928 Jul",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}