{
    "relation": [
        [
            "Activity",
            "Take the public ferry from Dar es Salaam to Zanzibar",
            "Explore the beautiful and historic streets of Zanzibar's Stone Town"
        ],
        [
            "Approximate Cost",
            "Included in Kitty",
            "Included in Kitty"
        ]
    ],
    "pageTitle": "Trip Notes for Africa East & South between Nairobi and Cape Town",
    "title": "",
    "url": "http://www.dragoman.com/holidays/trip-notes/africa-east-and-south-between-nairobi-and-cape-town?format=dossier&vid=6263&did=69901",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00151-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 408758179,
    "recordOffset": 408691686,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3311=While we are staying in South Luangwa National Park, we have the chance organise an optional visit to Kawaza Village to experience rural life in Zambia. Kawaza is a social centre for many of the surrounding smaller villages and is situated about 10 Kms. from the national park. As far back as 1997, it has been the centre of a community tourism project. The local villagers of Kawaza genuinely want to share their culture with the visitors, so that they see, not only wildlife, but also the local life of the people who live in the area. Usually we will take part in or watch one of the village’s two dancing groups. Normally the women’s group will perform local dances and stories and discuss everyday life in rural Zambia. They are very keen for their guests to join in and they will cook a traditional Kunda midday meal for us. The Kunda, who live throughout the Luangwa Valley have been here for thousands of years. Like all traditional farming and hunting communities in this part of Africa, they have suffered over the past years with diminishing resources. National Parks may preserve the wildlife but generally, they do not benefit local people and often there is a conflict of interest between the two. At Kawaza, the villagers are now benefiting directly from our visits and have a stake in the local tourist infrastructure. Initially all profits went to the whole community, but over the years profits have gone to fund school supplies, books, a water pump, local medicines and services for the communities sick. Each year the village decides what is to be done with the money.}",
    "TableContextTimeStampAfterTable": "{171677=As of May 2014, there is a new East African Tourist Visa available – this is a common visa that covers Kenya, Uganda and Rwanda. It is available on arrival at Jomo Kenyatta International airport in Nairobi, or any major land border into Kenya (e.g. from Tanzania or Ethiopia). At the time of writing (2015), the cost of this visa is USD100 for all nationalities. This is recommended if you are doing our ‘gorilla loop’ through Uganda and Rwanda., 80905=Hwange National Park became the royal hunting grounds to the Ndebele warrior-king Mzilikazi in the early 19th century and was set aside as a National Park in 1929. Today Hwange boasts a tremendous selection of wildlife with over 100 species of mammals and nearly 400 bird species. The elephants of Hwange are world famous and the park elephant population is one of the largest in the Africa.  We will explore the park in open 4x4 vehicles and stay within the park at one of the camp grounds., 170678=From September 2015 it will no longer be possible to obtain a visa on arrival or at a consulate, and tourists of all nationalities will have to obtain an e-visa at least 7 days in advance of arrival into Kenya - please go to www.ecitizen.go.ke to set up an account and apply; it may take up to 7 days to be approved, then they will send a visa approval confirmation to your email address which you must print out to present at the border. At the time of writing (2015), the cost of a single-entry visa is USD50, EUR40 or GBP30 for all nationalities., 49655=The Namib Desert stretches for about 2000 km from Southern Angola to Olifants River in South Africa. It is squeezed into an area less than 200 kms wide between the South Atlantic Ocean and the Great Western Escarpment., 2403=Botswana is one of the finest safari destinations in Africa. With 17% of the country covered by national parks, the wildlife is diverse. There are over 85 species of mammals and well over 1000 types of birds that reside in the country's national parks. Chobe, probably best know for its elephant population, is Botswana's premier national park., 233303=For mobile phones, please note that most countries in the Americas operate at 850MHz and 1900 MHz which is not the same frequencies used in Europe, Africa, Asia and Australia. Most modern tri-band and quad-band mobile phones will be able to operate on these frequencies but please check your mobile phone specifications before travelling to ensure that you'll be able to use your phone in the Americas., 109055=Please Note: Between January and March during the rainy season, it may not be possible to visit this village. The exact details will depend on local circumstances., 15030=The show case of the 2010 FIFA world cup has shown the world that South Africa is a modern country with deep routes in traditional culture. It's the perfect destination to understand how the modern world can blend with traditional African culture., 198791=United States. http://travel.state.gov/travel/travel_1744.html, 177297=As of December 2014, there is a new common visa available called the UNIVISA or Kazavisa, costing USD50 for all nationalities - this will cover Zimbabwe and Zambia for a maximum of 30 days, and for as many entries back and forth between the two countries as required. Please note this is currently undergoing a trial period and is only available at Harare or Lusaka airports, Victoria Falls airport and land border, and the Kazangula land border to Botswana - it is not yet available at the Chirundu border to Malawi or the Plumtree border to Botswana used by Dragoman trips, so this scheme is currently most useful for those arriving in Victoria Falls., 49886=The desert has some stunning flora and fauna. Probably the most famous is the wonder plant, Welwitschia mirabilis, which is endemic to the Namib. Many of these horizontal trees are over 1000 years old. This plant, which is part of the pine tree family, only has two leaves, but these leaves are vital as they allow the plant to take up fog water. In fact, the incessant fog, which comes in from the Atlantic in the mornings, is the reason that the Namib has such prolific flora and fauna, providing just enough moisture for life to carry on. Both plants and animals have adapted to utilising the small amount of moisture that is available., 238999=These trip notes were printed on 03/08/2015, 182545=Zambian Kwacha - please note that the currency of Zambia (the Kwacha, old code ZMK, new code ZMW) was re-based in 2013, and the old notes are no longer accepted. Please be careful that you only accept notes of the new currency (2013 and later) when exchanging money as some money changers have been known to offload old currency onto travellers. The new currency comes in denominations of ZMW2, 5, 10, 20, 50 and 100 - any notes such as ZMK5000 are the old currency, do not accept them!, 178893=As of December 2014, there is a new common visa available called the UNIVISA or KAZA visa, costing USD50 - this will cover Zimbabwe and Zambia for a maximum of 30 days, and for as many entries back and forth between the two countries as required. Please note this is currently undergoing a trial period and is only available at Harare or Lusaka airports, Victoria Falls airport and land border, and the Kazangula land border to Botswana - it is not yet available at the Chirundu border to Malawi or the Plumtree border to Botswana used by Dragoman trips, so this scheme is currently most useful for those arriving in Victoria Falls. The KAZA visa is available to citizens of the UK, Australia, New Zealand, USA, Canada and most EU countries, but is not available to Irish passport holders.}",
    "lastModified": "Mon, 03 Aug 2015 19:05:57 GMT",
    "textBeforeTable": "+27 21 424-6169 Cape Town Gardens 8001 73 Kloof Street Once in Cape Town (was Saasveld Lodge) Hotel for the night: Once in Cape Town Please note that many of the optional activities listed below will only be possible if you have extra time in Cape Town before the start of the trip. We stay in a hotel situated in Cape Town's popular, lively and vibrant Kloof Street with a large variety of restaurants, coffee shops, cafes and bars all within walking distance. The rest of the day will be free to explore the city. There is the option tonight of joining the group for dinner.  There will be a group meeting today at 10:00am. Your leader will leave a note at reception telling you where this important meeting will take place. Border Information: Welcome to the charming and beautiful city of Cape Town, home to the stunning Table Mountain. You will likely enter South Africa at Cape Town International Airport. ( Mon 03 Aug ) Day 1: Cape Town ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2015-08-03 19:05:56.000000 [timezone_type] => 3 [timezone] => UTC ) ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2015-08-03 19:05:56.000000 [timezone_type] => 3 [timezone] => UTC ) ZenDate Object ( [tz:protected] => DateTimeZone Object (",
    "textAfterTable": "Visit to the Kirstenbosch Botanical Gardens ZAR 45 Full-day Shark Cage Diving excursion ZAR 1400 Tour to the Cape of Good Hope and the Boulders Penguin Colony ZAR 540 Tour of Cape Town Townships and the District Six Museum ZAR 395 Head out on a full-day wine tasting tour of the famous area of Stellenbosch, just outside of Cape Town ZAR 650 Abseiling, canyoning and hiking on Table Mountain and Platteklip Gorge ZAR 895 Visit to the colourful district of Bo Kaap USD Explore the Dutch-built Castle of Good Hope, the oldest colonial building in South Africa ZAR 28 Explore the beautiful beaches of Cape Town, including those at False Bay, St. James, Clovelly or Fish Hoek USD About Cape Town: With its stunning coastline, dominating mountain and modern cityscape, Cape Town is one of Africa's most appealing cities. With vineyards on its doorstep, adventure activities around every other corner and plenty of restaurants and cafes to while away the time, this is a fantastic holiday destination in it's own right. Whether you're finishing or joining a Dragoman trip here, Cape Town is a very easy city to spend some extra time in. Cape Town and the Western Cape in general has a very cosmpolitan feel thanks to it's cultural diversity, vibrancy and creativity. The city is also lucky enough to benefit from great",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}