{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Lived on campus for two years, I personally never had a problem. Over those two years I only heard of two rooms having issues, but there was a direct personal conflict with the rooms. The security is often bothersome and suspecting, annoying for the innocent, but a student can know that the security is out and monitoring.",
            "No nation-wide fraternity/or sororities, however, the school and the people in this school take the abilene based groups very seriously!",
            "The effort is there, but the student base is not, only around 300 students live on campus and less than 100 stay for the weekends, its hard to do much with such a small campus.",
            "While the education may be rough, the students are a blast, and the social life is a must! The homecoming is a blast! However it is sad that one of the biggest attractions for students is the light show that is put on old main for the Christmas holidays.",
            "McMurry charges over 30k a year which is obsurd. I would rank this lower if possible. For old run-down classrooms and pitiful technology and staff, the schools education is worth less than 6k a year.",
            "There is nothing to do in abilene worth bragging about. I suggest meeting people and getting out as much as possible!",
            "From my first year to the last, the quality of food dramatically increased, however, so did the price of food. The two available places to get food were only open at inopportune times of the day, and not on sundays. Which is awful for students who live on campus.",
            "Lived in the lower-class dorms, but had the time of my life! the small campus is great for meeting people and always staying busy.",
            "Depending on the professor, for the most part the classes are very easy.",
            "Talk to your teachers....ALOT! everyday, go by office hours, whether one knows the information or not, play dumb.",
            "McMurry University is a great institution for those who fit the mold. Excellent for students who enjoy the small atmosphere, and teachers who prefer attendance grades and class participation other than actual work."
        ]
    ],
    "pageTitle": "McMurry University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/McMurry-University/reviews?_escaped_fragment_=/show/10028",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00255-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895190635,
    "recordOffset": 895159370,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{110317=Classes don't start until January, so I have no idea how tough it is., 114209=© 2015, Cappex.com, LLC, 78610=I really cannot wait for August to come. I am soooo excited to attend. Just counting down the days!, 108702=I have no idea; as I said, classes don't start until January., 76225=McMurry is a great, family orientated school. With having only 1400 students, anybody and everybody will ALWAYS feel home. The atmosphere at McMurry is unbeatable.}",
    "textBeforeTable": "06/09/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 7 out of 7 people found this review useful. 1 of 28 Courtney from Wimberley, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp =",
    "textAfterTable": "What to do for fun There are so many fun clubs to join, from Religious Life, to Greek life, to intramural sports! Homecoming is a huge event, with a big tailgate and a huge university-wide party on the field. The university also has its own fitness center with treadmills, elliptical machines, and a weight room. There is also an activities gym, open for people to go swimming or play in racquetball tournaments. Food and Dining McMurry has the Village Market, which serves as its regular cafeteria with a large buffet and salad bar with at least 3 choices of meals on weekdays (usually only 2 on weekends). There will always be pizza and hamburgers, but every day has a different dish ranging from pork chops to spaghetti to barbecue sandwiches. The breakfasts are great, featuring a big Belgian waffle maker and a sweet lady ready to take your order for breakfast burritos and omelets, among the other choices like donuts and cinnamon rolls. Also, it's great to have homemade desserts every day, not to mention a Blue Bell ice cream bar, with new flavors every week. The Sports Grille serves as a restaurant, with certain sandwiches and burgers you can order, and Java City is the university's personal coffee shop with frozen treats as well as warm, and bread and scones available for purchase. Dorm Life",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}