{
    "relation": [
        [
            "Attack Locations",
            "HE = Head",
            "CH = Chest",
            "AB = Abdomen",
            "RA = Right Arm",
            "LA = Left Arm",
            "RL = Right Leg",
            "LL = Left Leg"
        ],
        [
            "Protect Locations",
            "HE = Head",
            "BD = Body",
            "",
            "AM = Arms",
            "",
            "LE = Legs",
            ""
        ]
    ],
    "pageTitle": "Duel2.Com - Content",
    "title": "",
    "url": "http://www.reality.com/duel2/modules.php?name=Content&pa=showpage&pid=11",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00001-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 673467335,
    "recordOffset": 673459133,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20718=Published on: 2002-07-14 (1750 reads)}",
    "textBeforeTable": "Fighting Strategy Left of the \"Training\" and \"Wish to Fight\" sections of your strategy sheet is the Strategy section. The strategy section is divided into seven vertical sections (1st, 2nd, 3rd, 4th, 5th, 6th On, and Desperate). The sections \"1st\" through \"5th\" represent your warrior's strategy in the first through fifth minutes of the duel respectively. The section labeled \"6th On\" represents your warrior's strategy from the beginning of the 6th minute to the conclusion of the duel. The \"Desperation\" section represents the strategy your warrior will switch to at any time during the duel that they become desperate due either to wounds or exhaustion. In each of these vertical sections, you must enter minute by minute strategy decisions regarding Offensive Effort, Activity Level, Kill Desire, Attack Location, Protect Location, Offensive Tactic, and Defensive Tactic. You can prepare your warrior to fight with a wide range of different strategies for any given length of combat. The strategy section is the heart of the strategy sheet. Fill it out with care. Your choice of strategy should be influenced by your warrior's abilities, their fighting style, and often the type of opponent you believe you might face. The number of strategic considerations make this section of the strategy sheet the most subtle and the most intriguing. We strongly recommend you read about your warrior's fighting style in the Reference Section to get an idea of what sort of approach to try with",
    "textAfterTable": "You will note that the Protect Locations provide greater coverage than the Attack Locations. For example, while a warrior can defend both legs at once, they can select only one leg (either right or left) to attack. Different fighting styles have a greater susceptibility to be struck in particular locations and a greater capacity to attack particular locations well. For example, warriors of the Slashing fighting style have a greater tendency to be struck in the arms, but are themselves more able to strike the arms of their opponent. Striking a foe in particular locations will have different effects. For example, a blow to the arm can cause a warrior to drop their weapon. A blow to the legs may cause a warrior to fall to the ground. Head, chest, and abdomen wounds are more deadly and have a greater likelihood of killing an opponent. There are many considerations that may influence your choice of Attack and Protect locations in each minute. Copyright © by Duel2.Com All Right Reserved. Published on: 2002-07-14 (1750 reads) [ Go Back ] Content ©",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}