{
    "relation": [
        [
            "Payment method",
            "",
            "Money Order/Bank cheque",
            "Other - See seller's payment instructions",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Ladies White Angel Heaven Fancy Dress Costume Corset Tutu Skirt | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/Ladies-White-Angel-Heaven-Fancy-Dress-Costume-Corset-Tutu-Skirt-/280772442858?pt=AU_WomensLingerie&var=&hash=item870e08e6a4",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00205-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 414935543,
    "recordOffset": 414883238,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at Returns are accepted within 30 days of purchase. Garments must be unworn and in their original condition. We offer refunds without the express postage we have paid. A restocking fee of $8.50 will be deducted from the refunds where FREE POSTAGE is offered for that item. We will refund using the method of payment that was used to purchase the item once we have received the item. Please allow several days for the refund to appear on your statement. Exchanges: We accept exchanges within 7 days of purchase provided the garments are unworn and returned in their original condition. Customer will be requested $8.5 express postage (within Australia) for resending the item. We will post the replacement item once the original has been received at our end. Return policy details The buyer is",
    "textAfterTable": "Seller's payment instructions None Specified Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count Current Max Bid:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}