{
    "relation": [
        [
            "",
            "1",
            "2"
        ],
        [
            "RxCUI",
            "200346",
            "200346"
        ],
        [
            "RxNorm NAME",
            "cefdinir 300 MG Oral Capsule",
            "cefdinir 300 MG Oral Capsule"
        ],
        [
            "RxTTY",
            "PSN",
            "SCD"
        ]
    ],
    "pageTitle": "DailyMed - CEFDINIR- cefdinir capsule",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=38f6adf7-e26c-4764-8ec9-360813874dd4",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00043-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 60581363,
    "recordOffset": 60540693,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1271=46032719, 22364=NDC 0781-2176-69 in unit dose cartons of 50 (5 x 10) capsule-blisters, 732=NDC 0781-2176-60, 125036=0781-2176-60, 51068=In clinical trials, 5093 adult and adolescent patients (3841 U.S. and 1252 non-U.S.) were treated with the recommended dose of cefdinir capsules (600 mg/day). Most adverse events were mild and self-limiting. No deaths or permanent disabilities were attributed to cefdinir. One hundred forty-seven of 5093 (3%) patients discontinued medication due to adverse events thought by the investigators to be possibly, probably, or definitely associated with cefdinir therapy. The discontinuations were primarily for gastrointestinal disturbances, usually diarrhea or nausea. Nineteen of 5093 (0.4%) patients were discontinued due to rash thought related to cefdinir administration., 22634=NDC 0781-2176-60 in bottles of 60 capsules, 22509=NDC 0781-2176-64 in unit dose cartons of 10 (1 x 10) capsule-blisters - 3 cartons packed in 1 unit dose carton of 30 (3 x 10), 22572=NDC 0781-2176-01 in bottles of 100 capsules, 56736=The carcinogenic potential of cefdinir has not been evaluated. No mutagenic effects were seen in the bacterial reverse mutation assay (Ames) or point mutation assay at the hypoxanthine-guanine phosphoribosyltransferase locus (HGPRT) in V79 Chinese hamster lung cells. No clastogenic effects were observed in vitro in the structural chromosome aberration assay in V79 Chinese hamster lung cells or in vivo in the micronucleus assay in mouse bone marrow. In rats, fertility and reproductive performance were not affected by cefdinir at oral doses up to 1000 mg/kg/day (70 times the human dose based on mg/kg/day, 11 times based on mg/m2/day)., 55207=Cefdinir was not teratogenic in rats at oral doses up to 1000 mg/kg/day (70 times the human dose based on mg/kg/day, 11 times based on mg/m2/day) or in rabbits at oral doses up to 10 mg/kg/day (0.7 times the human dose based on mg/kg/day, 0.23 times based on mg/m2/day). Maternal toxicity (decreased body weight gain) was observed in rabbits at the maximum tolerated dose of 10 mg/kg/day without adverse effects on offspring. Decreased body weight occurred in rat fetuses at ≥ 100 mg/kg/day, and in rat offspring at ≥ 32 mg/kg/day. No effects were observed on maternal reproductive parameters or offspring survival, development, behavior, or reproductive function., 1300=46032718}",
    "textBeforeTable": "Number of versions: 2 CEFDINIR- cefdinir capsule View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close Labeler - Sandoz Inc (110342024) 04/06/2007 ANDA065330 ANDA Marketing End Date Marketing Start Date Application Number or Monograph Citation Marketing Category Marketing Information 10 in 1 BLISTER PACK 4 5 in 1 CARTON NDC:0781-2176-69",
    "textAfterTable": "RxNorm CEFDINIR- cefdinir capsule RxCUI RxNorm NAME RxTTY 1 200346 cefdinir 300 MG Oral Capsule PSN 2 200346 cefdinir 300 MG Oral Capsule SCD Get Label RSS Feed for this Drug CEFDINIR- cefdinir capsule To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=38f6adf7-e26c-4764-8ec9-360813874dd4 To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To view updated drug label links, paste the RSS feed address (URL) shown below into a RSS reader, or use a browser which supports RSS feeds, such as Safari for Mac OS X. How to discontinue the RSS feed If you no longer wish to have this DailyMed RSS service, simply delete the copied URL from your RSS Reader.",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}