{
    "relation": [
        [
            "% of base salary",
            "Adam Crozier",
            "Ian Griffiths"
        ],
        [
            "Cash",
            "60%",
            "55%"
        ],
        [
            "Compulsory Deferral",
            "60%",
            "55%"
        ],
        [
            "Voluntary Deferral",
            "60%",
            "55%"
        ],
        [
            "Total",
            "180%",
            "165%"
        ]
    ],
    "pageTitle": "FE Investegate |ITV PLC Announcements | ITV PLC: Annual Financial Report",
    "title": "",
    "url": "http://www.investegate.co.uk/article.aspx?id=201203291000023057A",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00081-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 526750063,
    "recordOffset": 526620766,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{15900=Our Studios business has shown particularly strong growth in 2011. Total ITVS revenues grew 10% from £554 million to £612 million, driven primarily by international production. External revenues were up 9% to £320 million. This revenue growth has more than offset the investment made in creative renewal, enabling EBITA before exceptional items to rise £2 million to £83 million during the year., 55836=Awards 2011/12, 22579=2011 was the first full year of the pay HD channels ITV2, ITV3 and ITV4 on the Sky platform, and they performed in line with our expectations. In early 2012 we signed archive video on demand (VOD) deals with Lovefilm and Netflix and a VOD and catch up deal with Sky. These are non-exclusive deals which enable us to retain the option of doing similar deals with other parties should opportunities arise. We will also be launching a pay version of ITV Player later this year, which we will start to test internally in the second quarter of 2012. While this is slightly later than originally anticipated, we want to guarantee the quality of the user experience before launching to the public., 12068=We have increased our co-production activity as well: in 2011, we co-produced Julian Fellowes' Titanic which has now been sold into 86 countries ahead of its screening in April to coincide with the centenary of the Titanic's disaster; we also co-produced Prime Suspect in the US with Universal Television for NBC, which was sold into 116 countries. In 2012 we will be co-producing Mrs Biggs, a drama about Ronnie Biggs' wife, with Seven Network in Australia., 78549=Mary Fagan                           020 7157 3965 or 07736 786448 Mike Large                            020 7157 3021 or 07768 261528, 16785=Creative renewal lies at the heart of our strategy to build an international content business. 2011 saw a significant increase in our development budget and the number of new pilots created. This contributed to ITV Studios (ITVS) securing 111 new commissions in the year (up 28% compared to 2010), of which 66 were in the UK and 45 were international., 55462=·      Three Royal Television Society Awards including X Factor for Best Entertainment Show, Ant & Dec for Best Entertainment Performance (I'm a Celebrity) and the Road to Coronation Street for Best Single Drama., 33337=Our performance relative to the market is an important metric for us and this is reflected in our share of broadcast (SOB) - one of our key performance indicators. ITV Family net advertising revenue (NAR) was up 1% in 2011, ahead of the television advertising market for the fourth consecutive year, with SOB increasing from 45.1% to 45.3%. This outperformance was driven by an improved second half performance as advertisers concentrated spend around our autumn schedule of sport, drama and entertainment., 55741=The high quality of the content we produce and the programming we make famous on our channels has been recognised by many industry awards during 2011, including:, 27925=Television is a long-term business and Peter Fincham and his team continue to make plans for the schedule several years in advance. In 2011, we spent just over £1 billion on programming and we continue to ensure that our programming investment is made as efficiently as possible, while maintaining variety and quality. Our programme budget for 2012 will remain at around £1 billion - we believe this is a sufficient level to provide the breadth, variety and freshness that audiences and advertisers require. We recently secured c.£35 million of savings from 2013 onwards when we renegotiated a number of rights deals including the Champions' League and FA Cup. Some of these savings may be reinvested back into the schedule., 33710=Although we delivered significant growth in non-NAR revenues in 2011, we still have a high degree of reliance on advertising revenues. We therefore remain firmly focused on maximising our audience and revenue share from our free-to-air broadcast business., 51609=Focus for 2012, 48096=• ITV programme budget confirmed at c.£1bn for 2012, 71108=The Directors' Report is prepared in line with the relevant provisions of the Companies Act 2006. In preparing the Directors' Report the Company has had regard to the guidance issued by the Accounting Standards Board in its Reporting Statement on narrative reporting. The Directors' Report is intended to provide shareholders with a greater understanding of the Company, of its position in the markets within which it operates, and of its prospects., 6301=Our total programming budget for 2012 will be around £1 billion, of which around £800 million will be spent on the ITV1 NPB, as we work to improve the variety of the schedule across the year. Schedule costs in the first half will increase due to Euro 2012 in June., 57082=We are also encouraged by the prospects for our free-to-air television business given current trends within the market. As we approach the end of analogue switch-off in the UK, the impact of fragmentation on audiences has already largely been felt. The daily average number of minutes of television watched has been rising in the UK in recent years, reaching record levels in 2010, and was broadly flat year-on-year in 2011 at 4 hours 2 minutes.  Live viewing via television sets is still around the same level as it was in 2004, but viewing via other devices is  growing. This suggests that VOD viewing to date has been incremental. , 2004=Although ITV Family NAR has started the year better than we expected, it is still down 2% in Q1 and, whilst we expect to outperform the market again in 2012, we remain cautious on the full year outlook for the television advertising market., 42907=• 111 new commissions in 2011, 46214=• 376m long form video views in 2011, up 44%, 29021=Our channel brands are increasingly important in the constantly evolving digital market. Those channels linked to a strong 'mother brand' (ITV, BBC, C4, C5 and Sky) have recorded growth in SOV this year while other independent digital channels have seen a marked 9% decline. To consolidate this strength and build upon it we will be rebranding all of our channels during the second half of 2012 to position them for the challenges and opportunities which lie ahead., 20048=The SDN business, which operates one of the six digital terrestrial multiplex licences in the UK that make up Freeview, saw 37% growth in its revenues as a result of the renegotiation of a number of its licences in 2010. This revenue growth will not be repeated in 2011 as this was a one-off increase., 59985=We have made progress across the business and against virtually all of our key performance indicators in 2011. We saw a solid performance on-screen, with ITV Family share of viewing (SOV) up by 1% in 2011 and the digital channels continuing to show strong growth with SOV up 10%. ITV1 SOV, which benefited from the successful launch of ITV1+1, was down 2%, and ITV Family share of commercial impacts (SOCI) was down 1% but we will continue to work to improve these performances.  , 3184=Our 2011 financial and operating results demonstrate the progress we are making and the momentum we have built up. We will increasingly look to content, pay and online as engines for growth in the UK and internationally as we invest further in our key strategic priorities. Everyone at ITV remains firmly focused on delivering the Transformation Plan and we remain on track to do so., 23896=Online revenues grew by 21% in 2011 to £34 million, which contributed to the 13% growth in non-NAR revenues within Broadcasting and Online to £310 million (2010: £275 million). While this represents encouraging growth we are still aware of the need to build scale within Online. Our challenge is to choose the best monetisation strategy for our content and to continue to innovate, to open up new revenue streams., 20639=These all represent encouraging trends in our engagement with consumers but our challenge is to monetise the audiences we now have across multiple platforms. We have invested in fixing our online technology platform in 2011 but still have some way to go and the quality and the performance of ITV Player will further improve. We will continue to invest in navigation, ease of use, content and robustness to improve the quality of the overall user experience on our website., 63162=Whilst the Company is focused on annual performance targets we are making investments in people, content and technology for the long term value of the business. Although the Transformation Plan is being delivered against the context of a complex regulatory environment for UK broadcasting, we do not see regulation as a barrier to delivery of the strategy and we have started discussions with Ofcom and the Government about the ITV Channel 3 licences, the current terms of which end in 2014., 46049=• 9% of VOD viewing in December on mobile, 8178=In 2012 we will look to build on the momentum we have created. In 2011 we invested £28 million in ITVS, Online, technology and our digital channels, and in 2012 we expect to invest a further £25 million., 77222=for the year ended 31 December 2011, 82090=ITV plc (the 'Company') released its preliminary announcement of annual results for the year ended 31 December 2011 ('Preliminary Announcement') on 2 March 2012. Further to the Preliminary Announcement, the Company can now confirm that the Report and Accounts 2011, Notice of Annual General Meeting and Form of Proxy will be mailed to shareholders on 29 March 2012. The Report and Accounts 2012 are now available on the Company's website at www.itvplc.com/investors, 40137=Our people remain key to ITV and to the delivery of the Transformation Plan. Our management team have now been in place for over a year and, together with the wider leadership team, are driving the Transformation Plan forward and continuing to facilitate cultural change at all levels of the business. We are very pleased to see that our employees are embracing the changes, with engagement having risen to 85% in 2011 (2010: 75%). We have also brought our recruitment operation in-house and the team have launched a brand new careers website to ensure we continue to attract and retain the best talent., 14808=Our strategy revolves around creating long-running, returnable drama and entertainment formats which travel well internationally, so recommission levels are also a key focus for us. 75 recommissions in the UK, including Vera, Lewis and a celebrity version of The Chase, relative to 57 in 2010, represent positive steps in this area as we build up our pipeline of content., 78980=Pippa Foulds                        020 7157 6555 or 07778 031097, 15356=Our new UK commissions for ITV1 include SWAGS (a six-part drama about service wives and girlfriends), Superstar (in collaboration with Lord Andrew Lloyd Webber) which will be screened in 2012, and Mr Selfridge (a ten-part drama about the life of the flamboyant American entrepreneur, Harry Gordon Selfridge) for 2013. We also had ten off-ITV commissions including The Devil's Dinner Party for Sky Atlantic and Dirk Gently for BBC., 81050=The Company's 2012 Annual General Meeting will be held at 11.00 a.m. on Wednesday, 9 May 2012 at The Queen Elizabeth II Conference Centre, Broad Sanctuary, Westminster, London SW1P 3EE.   The Notice of Annual General Meeting and Form of proxy will be available on our website from 29 March 2012., 80200=·      Notice of 2012 Annual General Meeting, 37263=The move of the Company's Manchester base from Quay Street to MediaCity is now well under way and will deliver a bespoke, state-of-the-art production facility for Coronation Street as well as providing modern offices for everyone working in Manchester with improved technology. The first move for staff in Manchester into the new site will take place later this year. We will also be moving all staff in Leeds to one site and modernising a number of our regional offices with HD studios. As a result of our investment in technology and property, there is expected to be an increase in capital expenditure in 2012 to £70-£80 million., 32294=ITV Family share of commercial impacts (SOCI) was down 1% in 2011 with ITV1 Adult SOCI down 4%, although we saw stronger performances from many of our key sub-demographics (Housewives, Adult ABC1s, 16-34s) which have a bearing on the contract rights renewal mechanism. Our digital channels' SOCI was again strong, up 9%., 28438=In December, Ofcom announced that it would not be referring the advertising trading model to the Competition Commission. While our strategy is not dependent upon regulatory relief, we welcomed this decision as we had always maintained that a lengthy market review, at a time of such rapid change and increasing competition, would not be beneficial for UK consumers or the UK television industry., 6696=In 2012, we aim to repeat the performance of 2011 by outperforming the television advertising market, as we did in 2011, and hold ITV Family SOV. We will refresh and enhance all of our channel brands and continue to invest in brand defining content as efficiently as possible., 30075=Our digital channels continue to perform very strongly. ITV2 and ITV3 remain the largest digital channels in the UK and saw SOV rise 8% and 11% respectively, while ITV4 saw a 13% rise in SOV making it one of the fastest growing digital channels. ITV2, which won Channel of the Year and Best Entertainment Channel at the Broadcast Digital Awards, has seen particular success with the BAFTA award-winning The Only Way is Essex (TOWIE) and Celebrity Juice, both of which will be returning in 2012. TOWIE averaged 1.8 million viewers (up 21%) across the series while Celebrity Juice averaged 2.2 million viewers (up 12%), with one episode peaking at 3.1 million (14% share) making it the most-watched non-terrestrial programme of the year. We are continuing to invest in brand-defining content for our digital channels with new drama commissions for ITV2 and rights to the French Open, Europa League and the African Cup of Nations for ITV4., 80043=·      Form of Proxy for 2012 Annual General Meeting, 21063=Mobile viewing has increased rapidly in 2011, representing 9% of all VOD viewing of ITV content in December, comparable with the BBC iPlayer. This enables us to engage ever more closely with consumers. In the first seven months following its launch the ITV Player app had more than three million downloads., 68622=·    We remain cautious on the television advertising outlook for 2012, but we expect to outperform the market for the full year. Our progress against the Plan and the strength of our results gives the Board confidence to propose a full year dividend of 1.6p., 2683=We will maintain our tight focus on cash management throughout the organisation. With positive net cash of £45 million, ITV is in a strong position financially which gives us the flexibility to invest in the business while making the right decisions for the long-term future of the business. After £339 million of bond buy-backs in 2011 we will continue to look at options for the balance sheet that make economic sense. We are conscious of the uncertain economic environment and the need to maintain flexibility to deliver our strategic priorities., 12603=We continue to look at new ways of working with creative talent and have signed a development agreement with an independent production company, The Garden. We have also entered into a joint venture with BAFTA-winning Channel 4 drama commissioners Camilla Campbell and Robert Wulff-Cochrane to establish a new scripted production company, Noho Film and TV, which will begin development on a number of projects in 2012., 32712=In 2011, ITV Family's share of viewing (SOV) was up 1%, driven by the continued strong growth of our digital channels which were up 10%. ITV1 SOV, which benefited from the successful launch of ITV1+1, was down 2% - this is below where we want it to be and we will work to improve performance in 2012., 9139=2012 and beyond, 5907=We will increasingly focus on long-running, returnable series and have a strong schedule for 2012 with returning dramas such as Downton Abbey, Vera, and Scott and Bailey alongside an exciting line-up of new drama including SWAGS, Titanic and Mrs Biggs - many of which are being made by ITVS. A number of ITV's top entertainment shows will be returning in 2012, including X Factor, I'm a Celebrity, Dancing on Ice and Long Lost Family, while we will be screening new shows including Superstar and Fool Britannia., 38410=In 2011 we launched our investment programme in technology in order to make the business fit-for-purpose. We have begun to roll out our desktop refresh, which is aimed at giving all of our people the best tools for the job, and we will continue this refresh throughout 2012. We are now taking steps towards complete digital production for all of our shows by implementing plans for tapeless content. Significant technology projects are being implemented across the organisation - we are aware that they will take time to accomplish but we are confident that they will lead to great improvements to the way in which we operate., 4824=We will continue to build scale in our online business, improving the distribution and performance of ITV Player, and driving up online viewing and revenues. We also plan to make ITV Player available on manufacturers' connected television sets and launch YouView. We will expand our pay strategy in 2012, as we launch ITV Pay Player and pay products, renegotiate existing video on demand deals and negotiate new ones, and develop potential pay channels over time. We also plan to roll out our 'Total Value' exploitation under new teams., 76472=In August 2010 we announced our strategy to transform the business over five years, focusing on our four strategic priorities:, 31855=ITV1's on-screen successes in 2011 have included Vera, Marchlands, Scott and Bailey, Strangeways, the Rugby World Cup, Doc Martin, and Downton Abbey, which won a Golden Globe for best mini-series, as well as winning the Christmas ratings battle with a consolidated audience of 12 million. Four of the top five performing new dramas were on ITV1 in 2011 and ITV1 also won the Terrestrial Channel of the Year Award at the Edinburgh Television Festival., 30890=Some of our key shows, including X Factor and I'm a Celebrity, did not perform as well as in 2010, but they remain very important brands for us as they still drive large, diverse audiences, which appeal greatly to advertisers. We remain committed to these programmes and continually look at ways of refreshing them to improve their on-screen performance. ITV1 continues to deliver some of the largest audiences on television. The average X Factor audience across the series was 12.3 million, which made it the largest entertainment format on UK television in 2011, as it has been for three of the last four years. It was also the third most successful series ever of the show in terms of audience., 300998=For the purposes of the Data Protection Act 1998, the data controller is Trustnet Limited of 2nd Floor, Golden House, 30 Great Pulteney Street, London, W1F 9NN. Our nominated representative for the purpose of this Act is Kirsty Witter., 39416=We have continued to restructure ITV where appropriate to drive out waste and complexity in the business. During 2011 we delivered cost savings of £20 million, ahead of the targeted £15 million. These savings follow on from the £40 million delivered in 2010. We will remain focused on costs to ensure that we have the appropriate cost base across the business and have identified a further £20 million of savings in 2012. Our continued commitment to the tight management of cash and costs has helped us move into a positive net cash position of £45 million at the end of 2011. We have also improved the efficiency of our balance sheet with £339 million of bond buy-backs. We continued our long-term strategy of managing the costs and risks associated with the pension schemes through our longevity swap and an extension to the SDN pension partnership., 26060=A. We will spend around £1 billion on programming in 2012 which will give the schedule the variety and quality we need for our viewers and advertisers. We will also continue to invest in brand defining content for our digital channels., 31287=Our soaps continued to perform strongly with Emmerdale (average 7.6 million viewers per episode) increasing SOV by 3% during the year, while Coronation Street (9.4 million viewers) was only marginally down (-1%) despite the tough comparative of the 50th anniversary year in 2010., 34307=A. We are targeting a further £20 million of cost savings in 2012, we will be continuing to roll out our desktop refresh programme to all areas of the business and we will see the first people moving into our new offices in MediaCity. We will also continue to focus on getting the right people to work for ITV., 78088=Caroline Cook                      0207 157 3709 or 07799 071509, 36501=During 2011, we made progress in simplifying the network structure through the acquisition of Channel Television., 81507=Appendix A to this announcement contains the Report and Accounts 2011 in unedited full text for the purposes of compliance with the Disclosure and Transparency Rules. Any page and note references refer to page numbers and notes in the Report and Accounts 2011., 13764=We have highlighted the need to have a significant stake in the intellectual property rights of the content we show on our screens, and have made progress in this area in 2011. ITVS produced 1,929 hours of original commissions (2010: 1,740) for the ITV1 network, increasing its share of the network's spend to 55% from 53% in 2010 but we want to grow our share further still., 7723=In 2012 we will continue to build strength in the team across ITV to drive forward the Transformation Plan. We will look for further ways to improve efficiency and performance, driving out waste and complexity. We have identified a further £20 million of cost savings and planned further improvements in technology - our desktop refresh will continue throughout the year to ensure that our people have the right equipment to do their jobs. Capital expenditure in 2012 is expected to be £70-£80 million as we make these technological improvements and implement our site move from Manchester. We will also continue to build the improved collaborative creative process between Broadcast and Studios to help focus on creating long-running, returnable formats., 19629=In 2011 we announced the first product placement deals in the UK with Nationwide and Nestlé but the market remains very small. We previously highlighted that the new rules which Ofcom implemented would impact our ability to exploit this new revenue stream and this continues to be the case., 74373=2012 and beyond, 5277=Live top sporting events in 2012 include Euro 2012, Champions League, Europa League, Tour de France and The French Open tennis. We will also continue to implement our ongoing news review.}",
    "TableContextTimeStampAfterTable": "{790070=At 31 December 2010, 261671=During the year the Committee considered the performance and audit fees of the external auditor, and the level of non-audit work undertaken, and recommended to the Board that a resolution for the re-appointment of KPMG Audit Plc for a further year as the Company's auditor be proposed to shareholders at the AGM in May 2011. The resolution was passed and KPMG Audit Plc was reappointed for a further year., 106826=Our credit ratings continued to improve in 2011. In April, Standard & Poor's upgraded the long-term credit rating from B+ (Stable Outlook) to BB (Stable Outlook) and Moody's Investors Service increased its rating from Ba3 (Stable Outlook) to Ba2 (Stable Outlook). In May, Fitch revised its outlook on our BB rating from Stable to Positive. In August, Moody's Investors Service similarly revised upward the outlook., 293161=2012, 233495=The Company considers annually whether it is appropriate to commission an investor audit. No audit was undertaken in 2011., 162126=It is the Company's policy not to make cash contributions to any political party. However, within the normal activities of the Group's national and regional news-gathering operations there may be occasions when an activity may fall within the broader definition of 'political expenditure' contained within the Companies Act 2006. Shareholder authority for such expenditure was given at the 2011 Annual General Meeting. However, during 2011 the Group made no payments falling within this definition (2010: nil)., 181736=•  CEO, GE Capital Global Consumer Finance UK (1996-1998), 101835=Nov 2016, 184466=•  Director of Deregulation Unit, BIS (formerly the DTI) and Cabinet Office  (1995-1997), 221899=The Company's aim is to reflect UK demographics both representationally within the organisation and on-screen. Year-on-year progress has been achieved in working towards this target. Key activity in 2011 included:, 181129=• Group Chief Executive of RSA Insurance Group plc (2003-2011), 305004=2012 Bonus performance targets, 320966=EPS base year 2008, 20066=In 2011, we gained market share once again, increasing our SOB to 45.3% of the total UK television market. This was due to strong performances by both the sales team and on-screen as we continue to deliver the big audiences and brands that are most demanded by advertisers., 274730=The Committee met four times in 2011 and considered the following:, 230776=The Board has conducted a review of the effectiveness of the Group's systems of internal controls for the year ended 31 December 2011. In the opinion of the Board, the Company has complied with the internal control requirements of the Code throughout the year, maintaining an ongoing process for identifying, evaluating, and minimising risk. Further information is set out in the Audit Committee Report, 656024=The total future minimum sublease payments expected to be received under non-cancellable subleases at the year end is £4 million (2010 restated: £6 million)., 178925=•  Member of the Investor Board of EMI Group (2007-2008), 785568=At 1 January 2010, 187512=•  Trustee of The Roundhouse Trust (2003-2008), 365598=8 March 2011 Compulsory Deferral2, 419570=29 February 2012, 40140=We have delivered another strong financial performance in 2011. External revenue has grown by 4%, which has been driven by non-NAR revenue, in particular from ITV Studios. This revenue growth, coupled with tight control of costs, has led to 13% growth in EBITA before exceptional items and 23% growth in adjusted EPS., 359207=Information given in the table below is for the period from 1 January 2011 to 31 December 2011., 262258=The Audit Committee Report was approved by the Board on 29 February 2012 and signed on its behalf by John Ormerod., 206382=26 April 2010, 613284=In respect of all Group companies outside of the UK only those translation differences arising since 1 January 2004, the date of transition to IFRS, are presented as a separate component of equity. On disposal of an interest in a joint venture or an associate, the related translation reserve is released to the income statement as part of the gain or loss on disposal., 405218=As at 31 December 2011 the Company had received notifications from the following companies and institutions of the voting interests of themselves and their clients in 3% or more of the issued ordinary share capital (carrying rights to vote in all circumstances) of the Company (numbers of shares and percentage interests are as at the notification dates)., 359748=At 1 January 2011, 187979=•  Regional managing partner, UK and Ireland and senior partner, UK, Arthur Andersen (2001-2002), 294775=The incentive framework used in 2011 will continue to be used in 2012. It is based on the following principles:, 186885=•Trustee of the Design Museum (2006-2012), 141498=We have again completed an engagement campaign in 2011, with the members of the Management Board visiting ITV locations and giving employees the opportunity to feed back their thoughts and concerns about the business. This engagement has continued through other forums such as the Company intranet, video booths and regular hard copy newsletters, as well as through briefings between managers and their teams by which employees can understand the financial and economic factors affecting the Company's performance and how their role contributes to the execution of our strategy. Participation in ITV's Employee Engagement Survey increased from 62% to 82% in 2011 while employee engagement has improved from 75% to 85%., 112210=Full actuarial valuations are carried out every three years. The latest completed actuarial valuation of Section A of the main defined benefit scheme was carried out as at 1 January 2008 and, on the bases adopted by the Trustee, that Section was in deficit to an amount of £190 million or 9% of the liabilities in that section. An actuarial valuation of Section A is being undertaken as at 1 January 2011., 293221=Following completion of the 2012 salary review, the Company agreed a salary increase of 3% for all ITV employees earning £60,000 and below, with any increase for those earning £60,001 and above being linked to their performance rating for 2011. The executive Directors both received a salary increase of 2.5% from 1 January 2012 in line with overall personal and company-wide performance., 745525=At 31 December, 381113=26 March 20105, 706323=At 31 December 2011, total deferred tax assets are £115 million (2010: £139 million) and total deferred tax liabilities are £50 million (2010: £66 million)., 415198=The Trustee comprises nine Directors - the Trustee Chairman, together with four directors appointed by the Company and four directors nominated by the members. During 2011, one of the member nominated directors resigned and was replaced by a new director on completion of a selection process., 395440=3 An award over nil-cost options subject to the same provisions and performance conditions attaching to the awards made under the PSP in March 2010. , 205337=3 January 2006, 77551=The total reported tax charge of £79 million results in an effective tax rate slightly lower than the statutory rate of tax of 26.5%, for the reasons noted above. The 2010 charge was lower primarily due to the recognition of a deferred tax asset of £68 million in 2010 in respect of tax losses not previously recognised. , 263807=We are using the incentives framework introduced in 2011 to reward delivery of business results and of the Transformation Plan., 404647=The Remuneration Report was approved by the Board on 29 February 2012 and signed on its behalf by Andy Haste., 310926=Performance Share Plan 2009 and 2010 (PSP), 246736=·              Risk management: the Committee continued to consider the process for managing risk within the business. New risk management procedures were implemented in 2011 and the Committee has monitored progress made in embedding these procedures in the management processes., 186982=•  Non-executive director and chairman of Merlin Claims Services Holdings Limited (2007-2010) , 416027=Trustee evaluations take place each year and are currently being further developed as part of a Trustee board effectiveness review. The Trustee directors receive regular training throughout the year; a minimum of two days' training is expected to be undertaken. Training requirements are identified by reference to any skills gaps and specific committee roles and training is delivered both by attendance at external courses and with targeted training to support specific agenda items. During 2011, those Trustee directors who had not completed the Pension Regulator's toolkit received training on the Regulator's Trustee Knowledge and Understanding scope guidance to assist with completion of the toolkit., 179399=•  Chief executive of BAA plc (2003-2006), deputy chief executive of BAA plc (2001-2003), 40576=After 'profit to cash' conversion of 103% we now have positive net cash for the first time in seven years, and having bought back £339 million of debt in 2011, the gross debt levels have significantly reduced as well. Continuing this focus on cash and costs has meant that we are now in a strong financial position from which to implement the next stage of the Transformation Plan., 1586=2011, 319091=EPS cumulative years 2012 to 2014., 190732=The Board takes seriously the guidance set out in The UK Corporate Governance Code (the Code). During 2011 ITV plc complied with the requirements of the Code as set out in this report., 414137=The Group operates a pension scheme which provides retirement and death benefits for employees of ITV plc. The ITV Pension Scheme (the Scheme) comprises three sections: A, B and C. Section A includes the defined contribution (DC) section of the Scheme. The DC section is open to new members. The majority of defined benefit (DB) sections were closed to new members in 2002 (with the last section closing on 1 August 2007) but are still open to future accrual., 813776=Method 3: For business combinations prior to 1 January 2004, goodwill is included at its deemed cost, which represents the amount recorded under UK GAAP at that time less amortisation up to 31 December 2003. The classification and accounting treatment of business combinations occurring prior to 1 January 2004, the date of transition to IFRS, has not been reconsidered as permitted under IFRS 1. Goodwill is stated at its recoverable amount being cost less any accumulated impairment losses and is allocated to cash-generating units., 375523=31 Dec (100%), 50619=SDN external revenues increased by 37%, largely due to the full year impact of the new contracts signed in the second half of 2010. Growth of this scale will not be repeated in 2012 as there were no material changes to SDN contracts in 2011., 671562=In 2010 operating exceptional gains of £28 million were recognised for service credits relating to introduction of a member option to change pension payments at retirement and one-off change to pension payments, and settlement gain in relation to the enhanced transfer value exercise., 202019=Board and Committee membership and attendance at meetings in 2011, 246221=In considering reports on 2011 the Committee has considered judgements applied in establishing provisions for taxation and pension obligations and accounting for multi-year broadcasting rights. Judgements associated with impairment and the application of the going concern basis were also considered but were less challenging as the Company's operating and financial performance has strengthened., 175554=9 September 2008, 300649=For 2012 the maximum Bonus opportunities will remain unchanged for Adam Crozier and Ian Griffiths at 180% and 165% of base salary respectively., 157428=We have a variety of suppliers who are key to the business. A number of the Company's major suppliers are involved in the broadcast of ITV's family of channels and include Arqiva, Technicolor, SES Astra and BT. Other key suppliers include those who provide the technology for outside broadcast such as SIS. In 2011 ITV signed an agreement with Irdeto to provide an IT platform for the provision of pay TV capability. ITV has also engaged Mace Group to manage and deliver the move into MediaCity in Manchester., 307100=·      if an individual voluntarily defers one-third of their annual Bonus into shares, they will receive a matching award of shares under the PSP (on a 1:1 basis subject to the performance conditions that apply to PSP awards)., 322871= EPS cumulative years 2010 to 2012, 330399=9 Sept 2008, 102279=Jan 2017, 671102=A £1 million credit (2010: £7 million credit) due to revised estimates for property provisions raised as exceptional items due to the large headcount reduction in 2009., 369009=26 April 20103, 355381= - Executive Directors will receive a bonus for 2011 as detailed in the table below and shown in the table above:, 227626=As part of their professional development executive Directors may accept external appointments as non-executive directors of other companies and retain any related fees paid to them. Details of fees received by executive Directors during 2011 can be found in the Remuneration Report., 370463=April 2014, 174493=•  Non-executive director of Camelot Group plc (2007-2010), 207427=9 September 2008, 367182=8 March 2011 Voluntary, 269124=The Committee obtains advice from various sources in order to ensure it makes informed decisions. During 2011, the Committee undertook a formal review of its independent external advisers. As a result of this process Deloitte LLP were re-appointed. The Committee's main advisers are set out below. Adam Crozier, Chief Executive, is invited to attend the meetings of the Committee as appropriate. No individual is involved in decisions relating to their own remuneration., 292689=Executive Directors' base salaries are reviewed on an annual basis, effective from 1 January, and the same annual review process is applied to the Senior Executive Group as to all other ITV employees. With effect from 1 January 2011 the executive Directors both received a salary increase of 3% in line with overall personal and company-wide performance., 68676=Despite the reduction in adjusted financing costs, statutory net financing costs are flat at £75 million. This is primarily because of £39 million of one-off losses incurred on the buy-backs of certain bonds, in particular that of the 2015 £100 million bond tap which was issued at a substantial discount in 2009. These losses were partially offset by mark-to-market gains and lower imputed pension interest., 389105=Dec 2012, 374485=26 March 20104, 382490=March 2013-, 112739=Actuarial valuations of Sections B and C of the main scheme were carried out at 1 January 2010 and on the bases adopted by the Trustees, both were in deficit with a combined deficit of £49 million or 11% of the liabilities in those sections., 341973=2  Gains on exercise of restricted share awards includes value of restricted shares awarded to Ian Griffiths in March 2010 and released 50% in 2010, and 50% in 2011. Participants entered into a section 431 election to pay income tax on the value of the awards on the date of grant, so the value of awards released was net of income tax., 173485=26 April 2010, 601785=This section sets out the Group's accounting policies that relate to the financial statements as a whole. Where an accounting policy is specific to one note, the policy is described in the note to which it relates. This section also shows new EU endorsed accounting standards, amendments and interpretations, whether these are effective in 2011 or later years. We explain how these changes are expected to impact the performance of the Group., 185435=18 January 2008, 339048=The total amounts of Directors' remuneration for the period from 1 January 2011 to 31 December 2011 were as follows:, 290515=2011, 364754=26 Oct (50%), 176835= (2000-2005) and head of finance at Emap, 275924=·      reviewed the Remuneration Report for 2010, prior to its approval by the Board, and adoption by shareholders at the Annual General Meeting in May 2011;, 447526=2010 £m, 142903=Our package of voluntary benefits, Relish, provides valuable cost savings for employees and also for the Company. Enrolment for 2012 Relish benefits was more popular than ever, with 53% of employees now participating in at least one Relish benefit. All eligible employees earning under £60,001 received a 3% increase in salary in January 2012, as well as an additional one-off award to the value of £250 as part of the annual pay review., 600778=Cash and cash equivalents at 31 December, 725764=Adjusted earnings per share 2010, 169189=Our focus in 2012 will be to continue to look at new technology which will enable us to reduce carbon emissions, initially within our static production bases, alongside other activities which will contribute to a sustainable future. Narrative around the above performance indicators, our current activity and our planned changes can be found on our Corporate Responsibility website, www.itvplc.com., 691106=1 January, 96724=Cash spend on acquisition of property, plant and equipment and intangible assets was £43 million (2010: £28 million), as we started to upgrade our technology across the business and invest in future-proofing our soaps, in particular the new site for Coronation Street. This is expected to increase significantly in 2012 to around £70-£80 million due to increased investment in core technology and moving the Manchester site to MediaCity., 49942=Our largest advertising categories of retail, food, and entertainment & leisure all declined in 2011 in the context of a challenging consumer environment, but this was compensated for by strong growth in finance, cars and car dealers, and  telecommunications., 177794=3 January 2006, 115460=Additional 2012 deficit funding for Section A*, 395330=2 An award over restricted shares for 2010 performance., 113682=We have agreed with the Trustee the level of contributions to the main section of the Scheme through to the end of 2014., 181569=•  President and CEO, GE Capital Global Consumer Finance UK, Western Europe and Eastern Europe (1998-1999), 163729=We continue to engage with the investment community regarding our corporate responsibility performance. In 2011 ITV was once again included in the Dow Jones Sustainability World Index., 275374=·      set the business and personal performance targets for 2011 annual bonuses aligned with the business plan for the year and the Transformation Plan;, 23485=Following the launch of our mobile apps in summer 2011, mobile devices now account for around 9% of all long form video views in recent months., 118730=In 2011 ITV continued to develop and review its risk management process. Our approach covers risks at all levels of the organisation and examines business risks on both a top down and bottom up basis. The approach breaks down risks into three core groups:, 417211=Pension Scheme indemnities: Qualifying pension scheme indemnity provisions, as defined in section 235 of the Companies Act 2006, were in force for the financial year ended 31 December 2011 and remain in force for the benefit of each of the Directors of ITV Pension Scheme Limited, a subsidiary of ITV plc. These indemnity provisions cover, to the extent permitted by law, certain losses or liabilities incurred as a director or officer of ITV Pension Scheme Limited., 184310=•  Group Director of Corporate Affairs (1997-2006) and Company Secretary (2004-2006), Tesco plc, 360952=in 2011, 187619=•  Chairman of Walbrook Group (2004-2007), 393430=31 Dec (50%), 41451=The cost savings have been reinvested in areas key to the Transformation Plan. Investment of £28 million was made in 2011 against specific initiatives aligned to the plan: improving the online experience and making the ITV Player available on more platforms; re-energising the creative pipeline by investing in additional creative staff and development of new programmes; more brand defining content for the digital channels; and technology investments to improve efficiency across the business. Despite this investment, we have been able to keep our average headcount flat as we reallocate resources to areas of the business which will drive the strategy., 305090=The Committee has used a consistent approach to that used for 2011 to set 2012 performance targets and measures which continue to support both the delivery of the Transformation Plan and key operational outcomes. On target performance will result in a payout of 60% of the maximum Bonus opportunity., 184201=•  Chairman, Dobbies Garden Centres (2007-2011), 599124=Cash and cash equivalents at 1 January, 389052=Dec 2011-, 333763=The fees are reviewed annually. There is no fee for membership of the Nomination Committee. The basic fee increased by £2,500 to £57,500 with effect from 1 January 2011. It has been agreed that the basic fee will increase by 2.5% to £58,938 from 1 January 2012. The annual fees payable in 2011 were as follows:, 767615=As at 31 December 2011, trade receivables of £11 million (2010: £8 million) were provided against. Movements in the Group's provision for impairment of trade receivables can be shown as follows:, 380926=June 2013, 14296=ITV Family SOV has improved by 1% in the year, returning audience share back to the same level as in 2009. A 2% decline in ITV1 audience share has been more than offset by a continued strong performance by the digital channels, which were up 10%., 503096=Balance at 1 January 2011, 14638=The movement in SOV can be split between viewing performance on each platform and the change in usage of each of these platforms during the year ('platform mix'). Removing the impact of the change in platform mix, 2010's SOV adjusted for the 2011 platform mix was 22.7%., 1706=2010, 426424=We have audited the Consolidated and Company financial statements of ITV plc for the year ended 31 December 2011 set out in the Financial Statements section., 400173=There were no changes in Directors' interests in shares between the end of the financial year and 29 February 2012., 172935=• Partner, McKinsey and Co (1979-1986, 164801=2009, 691160=2011, 314294=2011 Award Strategic Targets, 50979=Online & On Demand revenues have increased by £6 million, continuing the growth of recent years which has seen these revenues almost double from £18 million in 2008., 776278=Property, plant and equipment are stated at cost less accumulated depreciation and impairment losses. Certain items of property, plant and equipment that were revalued to fair value prior to 1 January 2004, the date of transition to IFRS, are measured on the basis of deemed cost, being the revalued amount less depreciation up to the date of transition., 174873= Joint Chief Executive (1995-1998), 316528=EPS cumulative years 2011 to 2013., 274914=·      reviewed base salaries for the Senior Executive Group with effect from 1 January 2011 using the same process as applied to other ITV employees;, 411219=Purchase of own shares:The Directors have the authority to purchase up to 388.9 million of the Company's ordinary shares. The authority remains valid until the 2012 Annual General Meeting, or 10 August 2012 if earlier., 174384=• Group Chief Executive, Royal Mail Group (2003-2010), 651911=2010 (restated), 208469=11 August 2008, 123657=- There is a major regulatory breach that results in the loss of the Channel 3 licence, or the Channel 3 licence is not renewed in 2014 and no contingency plan is in place to cover that loss., 418403=As recommended by the Audit Committee, a resolution for the re-appointment of KPMG Audit Plc as auditor to the Company will be proposed at the 2012 Annual General Meeting., 117718=* Since there were no initiatives in 2011 which reduced the Scheme's deficit by at least £10 million, compared with the level had such initiatives not been implemented., 360370=At 31 Dec 2011, 400751=31 December, 33264=2011, 291165=1 January 2011, 354528=1 The 2011 emoluments shown for Adam Crozier are for the full 12-month period ended 31 December 2011. The emoluments shown for 2010 are for the eight-month period from the date of his appointment on 26 April 2010 to 31 December 2010. For comparative purposes the full 2010 year equivalent would have been approximately £1.268 million., 364696=26 April (50%), 172447=• Chief Executive (1991-1996) and Chairman (1996-1999), ASDA Group plc, 393374=23 May (50%), 104110=There are no financial covenants on any of our debt and the next scheduled repayment is in June 2014., 405996=At 31 December 2011, 51700=Broadcasting & Online costs have been tightly managed. The £19 million decrease in schedule costs is principally due to there being no football World Cup costs in 2011. This has been offset in part by £10 million investment in more brand defining content for the digital channels, supporting their continuing growth in key demographic audiences. Other costs have increased by 4% due to investment and revenue-related costs, such as £7 million investment in Online & On Demand and the launches of ITV1+1 and pay HD channels, offset in part by general efficiency savings., 731824=A.   Diluted earnings per share are impacted by the £135 million 2016 Convertible Eurobond issued in November 2009., 99762=Our debt is financed using instruments with a range of maturities. Borrowings at 31 December 2011 (net of currency hedges and secured gilts) are repayable as follows:, 262804=On the following pages we set out the Remuneration Report for 2011., 199293=Details of Board membership during 2011 is set out in the table below. There were no changes to the Board during the year., 380871=June 2012-, 78771=The Board has proposed a final dividend of 1.2p. With the interim dividend of 0.4p, this gives a total dividend of 1.6p for 2011., 392340=17 March 20107, 304742=In addition, Adam Crozier and Ian Griffiths received payout levels of 95% and 90% respectively for performance against 2011 individual targets., 429247=·      the financial statements give a true and fair view of the state of the Group's and of the Parent Company's affairs as at 31 December 2011 and of the Group's profit for the year then ended;, 187721=•  Chairman of audit committee and Transport for London (2004-2006), 413444=The Company's policy, in relation to all its suppliers, is to settle the terms of payment when agreeing the terms of the transaction, ensure awareness of the terms and to abide by those terms provided that it is satisfied that the supplier has provided the goods or services in accordance with the agreed terms and conditions. The Company does not follow any code or standard payment practice. The number of days' purchases outstanding for payment by the Company as at 31 December 2011 was nil days (2010: nil)., 471071=As at 31 December, 670747=There were no exceptional reorganisation or restructuring costs in 2011 (2010: £17 million in relation to cost saving restructuring initiatives)., 316850=2012 Award Strategic Targets, 379492=1 June 20095, 319240=25% STRATEGIC - for awards made in 2009, 172026=• Chairman, Energis (2002-2005), 152248=All ITV programmes must comply with the Ofcom Broadcasting Code in relation to their content and scheduling. We observe the 9.00 pm watershed and alert viewers to material that may cause offence. Our in-house compliance team follow detailed compliance procedures, providing advice to commissioners and programme-makers both during production and during the process of reviewing programmes before broadcast. Our in-house viewer services team provide a responsive complaints handling service while viewers can also raise complaints directly with Ofcom. In 2011 Ofcom found 12 breaches of the code compared to six in 2010. We respond to any breach by assessing the causes and implementing any changes required to our practices and processes., 25990=There has been significant growth in non-NAR revenues in 2011 with an increase of £93 million to £922 million. This is due to a £35 million increase from international productions, a £31 million increase in supply of programming from ITV Studios to Broadcasting & Online, a £16 million increase in SDN external revenues, and a £6 million increase from online advertising., 162821=Our obligation to operate responsibly includes a consideration of our impact on the environment. Our production activities involve content production both in the studio and on location, and the running of such operations consumes large amounts of energy, producing carbon emissions. Our priority continues to be the reduction of carbon emissions to comply with the Carbon Reduction Commitment - Energy Efficiency Scheme. In 2011 we took another step towards our goal of reducing carbon emissions by 15% by the end of 2012 (from the 2008 baseline), with the aim of reducing our impact on the environment and the amount of carbon credits the Company will have to purchase in summer 2012. This figure will be published on our Corporate Responsibility website. Statistics are outlined opposite., 310769=Performance Share Plan 2011 and 2012 (PSP), 143998=The business case around diversity is compelling as it ensures we attract and retain the best talent. This is achieved through our inclusive Equal Opportunities policy. Our policy reflects the Equality Act 2010 and aims for equality around gender, marital or parental status, race, origin, nationality, religious belief, disability, age, sexual orientation, and gender reassignment. ITV is recognised as a positive employer, holding the 'two-tick' disability symbol and being the only broadcaster to be part of Stonewall's top 100 Workplace Equality Index, for the second year running. ITV participates in major national and industry-specific diversity forums, working as a collective to share best practice and campaign for change., 105952=We are aware of the inefficiency of the balance sheet and, as noted above, have continued to take steps during the course of the year to help address this. Since October 2009 we have repurchased £662 million (nominal value) of debt., 306373=As part of the incentives framework introduced in 2011 to support the delivery of the Transformation Plan, changes were made to the terms of the long-term incentive awards to be made to the Senior Executive Group under the PSP. The same arrangements will be used in 2012., 370841=8 March 2011 Core Award, 195865=Some of the things the Board has focused on during 2011 include:, 209517=3 September 2010, 372466=8 March 2011 Matching Award, 656311=The total operating lease expenditure recognised during the year was £42 million (2010 restated: £12 million) and total sublease payments received was £4 million (2010 restated: £5 million)., 181451=•  Director of AXA UK plc (life and pensions) (1999-2003), 710008=A deferred tax asset of £558 million (2010: £602 million) in respect of capital losses of £2,230 million (2010: £2,230 million) has not been recognised due to uncertainties as to the amount and whether a capital gain will arise in the appropriate form and relevant territory against which such losses could be utilised. For the same reasons, deferred tax assets in respect of overseas losses of £9 million (2010: £9 million) that time expire between 2017 and 2026 have not been recognised., 113105=Given that the timetable for the valuation of Section A of the Scheme was different to that of Sections B and C, in order to increase efficiency and to streamline the processes the Group has agreed with the Trustee that actuarial valuations of all three sections will be undertaken as at 1 January 2011. We are in ongoing discussions with the Trustee regarding the results., 143470=As in the previous year, the pay award for 2011 for eligible employees (earning above £60,000) was performance-related. We share the success of ITV through our all-employee annual bonus which paid out in 2011. The Company also operates an all-employee Save As You Earn scheme., 184764=•  Ministry of Agriculture and Fisheries and Food (1973-1992), 672566=The £3 million gain principally relates to the sale of Screenvision Holdings (Europe) Limited. In 2010 the £4 million gain principally related to the sale of Screenvision US (Technicolor Cinema Advertising LLC)., 96334=The 'profit to cash' ratio is more in line with target this year following the very high conversion rates over the previous two years. Programme rights and other inventory have reduced by over £200 million since 2008, meaning that they are now at more normal levels., 301516=2011 Bonus performance measures, 187143=•  Non-executive director of Negative Equity  Protection Holdings Limited (2007-2009), Millen Group Limited (2007-2009) and  BMS Associates Limited (2004-2008), 234243=The AGM for 2012 will be held on 9 May 2012 (further details can be found in Other Governance and Statutory Disclosures ). The Notice of Meeting sets out the resolutions being proposed. The Notice, together with any related documents, is made available to shareholders at www.itvplc.com, or is mailed to them, if they have elected to receive hard copies, at least 20 working days before the meeting. Last year all resolutions were passed with votes ranging from 86.94% to 99.92%., 811795=Method 1: All business combinations that have occurred since 1 January 2009 were accounted for using the acquisition method. Under this method, goodwill is measured as the fair value of the consideration paid (including the recognition of any non-controlling interests of the business being bought), less the fair value of the identifiable assets acquired and liabilities assumed, all measured at the acquisition date. Subsequent adjustments to the fair value of net assets acquired can only be made within 12 months of the acquisition date, and only if fair values were determined provisionally at an earlier reporting date. These adjustments are accounted for from the date of acquisition. Acquisitions of non-controlling interests are accounted for as transactions with owners and therefore no goodwill is recognised as a result of such transactions. Transaction costs incurred in connection with those business combinations, such as legal fees, due diligence fees and other professional fees were expensed as incurred., 70733=2011, 810669=There are £10 million of capital commitments at 31 December 2011 (2010: £2 million)., 290975=1 January 2011, 219187=All Directors are required by the Company's Articles of Association to be elected by shareholders at the first Annual General Meeting (AGM) following their appointment by the Board. Subsequently, all Directors are subject to re-election by shareholders at least every three years. However, all Directors will be submitted for re-election at the AGM in 2012 as recommended by the Code., 142334=We have continued to invest in our people through training programmes for all employees as well as leadership development. 92% of managers benefited from formal training in 2011. The introduction of a new online performance management tool will continue to ensure clarity around capability and objective-setting as well as succession planning. More detailed information around leadership and succession planning can be found in the Governance section., 179157=•  Member of the National Employment Panel (2006-2008), 41082=In 2011 we have taken further cost out of the business. £20 million of cost savings have been delivered, which is ahead of our £15 million target, and we have kept a tight grip on the schedule costs (the costs of programmes shown on air)., 69578=The adjusted financing costs in 2012 are likely to be broadly flat as the full year benefit from the bond buy-backs carried out in 2011 is likely to be largely offset by a step up in the interest rate on the 2019 loan., 280959=·              Reviewed annually from 1 January., 309657=The PSP was the only LTIP used to make awards in 2009, 2010 and 2011., 172113=• Member of Parliament (1997-2005), Chief Executive and Deputy Chairman of the Conservative Party (1998-1999); Shadow Minister for Europe (1999-2000); Shadow Secretary of State for Department of Environment, Transport and the Regions (2000-2001); Founder, Policy Exchange (2001), 744695=At 1 January, 111372=On 8 July 2011, the partnership's interest in SDN was increased by a further £50 million, enabled by the increase in the value of the SDN business. As a result of this, the partnership will increase the annual contribution to the Scheme by £3 million to £11 million per annum from 2013 onwards; the 2012 cash contribution will be £10 million. Under the partnership arrangements, we have committed to making a payment to the main section of the Scheme of up to £200 million in 2022 (an increase of £50 million compared to the original agreement made in 2010), if and to the extent that it remains in deficit., 186297= (2010, director from 2009), 385781=March 2014-, 418770=The Annual General Meeting will be held on Wednesday, 9 May 2012 at 11.00 am at the Queen Elizabeth II Conference Centre, Broad Sanctuary, Westminster, London, SW1P 3EE. The Notice of the Annual General Meeting contains an explanation of special business to be considered at the meeting. A copy of the Notice will be available on the Company's website at www.itvplc.com., 97377=A £233 million improvement in the year has resulted in a positive net cash position at 31 December 2011 of £45 million (31 December 2010: net debt of £188 million). Total cash has reduced by £59 million in the year to £801 million, as a significant portion of the cash generated from operations has been used to reduce gross debt. This reduction in gross debt has been achieved through £339 million (nominal) of debt buy-backs., 68053=Adjusted financing costs are £19 million (28%) lower as we continue to make the balance sheet more efficient. Financing costs directly attributable to bonds have reduced due to the benefit of £485 million of bond buy-backs over the last two years, including £339 million in 2011. Cash-related net financing income has increased by £7 million, mainly due to the increased level of cash held and the benefit of receiving a better return through a slightly longer investment horizon., 387682=2 October 2008, 244664=In 2011 the Committee met eight times., 416851=All advisers and suppliers are appointed through a rigorous tender process and are monitored through regular informal review meetings. There is a timetable for completing a formal review of advisers. No formal reviews were undertaken in 2011., 192902=The number of meetings held during the year and attendance of Directors is set out in the table below. An annual schedule of matters the Board wishes to consider at each meeting and at each meeting of its committees is produced. Meetings are normally held at one of the London sites and at least once a year at one of the regional offices. In 2011 the Board met colleagues in Leeds. Board meetings are structured around the following areas:, 172573=• Finance Director, Kingfisher plc (1986-1991), 721397=Earnings per share 2010, 117370=Total expected pension contributions in 2012, 384353=8 March 2011 Matching, 176936= Business Communications (1995-2000), 51279=Other commercial income includes sponsorship, minority revenues, pay, PRS, media sales and other income. The 6% growth in 2011 has been helped by the new pay revenues from ITV2, 3 and 4 HD on Sky. These pay revenues will increase again in 2012 due to the new deals signed with Sky, Lovefilm and Netflix., 164923=2008, 98369=The £16 million of dividend payments represents only the payment of the interim dividend whereas in 2012 we are likely to pay both the 2011 final and the 2012 interim dividends., 560674=Balance at 31 December 2010, 238698=Finally, we note that whilst we are satisfied with the work of our auditors KPMG and recommend their reappointment at the forthcoming AGM, in 2012 we plan to carry out a more thorough review and market appraisal to be considered in formulating the Committee's recommendation for the appointment of auditors at the 2013 AGM., 356129=of 2011, 174731=•  Joined Saatchi & Saatchi Advertising in 1988,, 430398=Opinion on other matters prescribed by the Companies Act 2006, 265098=·      the Committee believes that the level of bonus payments for 2011 is a fair reflection of the Company performance during the year. It reflects the progress made against the Transformation Plan, reducing ITV's cost base and managing cash and working capital in 2011;, 62386=The creative renewal process within ITV Studios is beginning to show signs of momentum, as evidenced by the increase in  new commissions, which are up 28% in 2011. However, the lead time between commission, delivery and transmission means it takes time for this momentum to come through into the financial numbers., 302536=ITV's financial performance in 2011 has been strong, as outlined in the Performance & Financials section. In light of performance during the year, the following payment levels against corporate financial targets for the executive Directors have been approved:, 708977=Due to the change in the statutory tax rate, deferred tax is provided at 25% (2010: 27%), which is the rate that has been substantively enacted to apply from 1 April 2012. The impact of the change in the tax rate is £6 million (2010: nil), of which £3 million was recognised in the deferred tax charge and the remainder recognised in equity., 447377=  2011 £m, 188165=•  Held various positions within Arthur Andersen from 1970, 315798=2010 levels, 322131=2009 levels, 367006=March 2014, 245237=·              Financial reporting: the Committee reviewed the financial information published by the Company, including the annual financial statements and half year financial report. To assist its review the Committee received reports from management and from the auditors on compliance with accounting standards, key judgements in preparation of the financial statements and compliance of those statements with best practice and laid down disclosure standards. The Committee was pleased at the progress made in clarifying what are often complex explanations and disclosures in the new format 2010 financial statements. The Committee introduced a new process for verifying Interim Management Statements., 344483=31 December, 687825=Tax losses brought forward may be utilised against current year profits if the brought forward losses and the current year profits are of the same type. Use of tax losses in this way leads to a reduction of the tax charge. Tax losses of £11 million (2010: £68 million) principally include the recognition of a deferred tax asset of £11 million (2010: £45 million) on the remaining financing losses linked to previous investments ('loan relationship deficits') following the successful conclusion of an enquiry with the tax authorities. In 2010 this also included a credit for utilisation of £16 million of previously deferred loan relationship deficits and a credit of £5 million on the recognition of a deferred tax asset on other losses., 170473=1 January 2010, 411619=Trusts: The Company has a discretionary trust funded by loans to acquire shares for the potential benefit of employees of the Group. Details of shares held by the trust at 31 December 2011 are set out in Section 4 Capital Structure and Financing Costs. During the year shares have been released from the trust in respect of share schemes for employees. The trust waives the right to dividends payable on those shares held by the trust that are not subject to any share plan operated by the Company where participants are the beneficial but not registered owners of shares., 377472=8 March 2014, 179704=Chairman of the West London Consortium (2006-2011), 211609=18 January 2008, 672079=In 2011 a £3 million (2010: £4 million) loss on sale and impairment of non-current assets was incurred primarily as a result of a detailed fixed asset review undertaken in preparation for moving premises in Manchester., 159929=During 2011, our activities have ranged from charitable giving to donations to specific programmes and campaigns. In all, ITV has contributed to £1.5 million in cash (2010: £1.5 million) and £3.4 million in-kind (2010: £5.7 million). In addition through our call to action campaigns, such as Born to Shine, Malaria No More and Text Santa we have raised £6.4 million through text and phone lines. Text Santa was a major new charity initiative, launched as a dedicated on-air appeal over the Christmas period, raising awareness and money for those most vulnerable during the festive period. In all, we raised a total of £4.1 million, which will be split between our nine deserving charities: Carers UK, Crisis, Help the Hospices, Samaritans and WRVS, as well as children's hospital charities Great Ormond Street Hospital Children's Charity, Noah's Ark Appeal, Helping Hand, and Yorkhill Children's Foundation. We hope to repeat this in 2012., 655343=Property leases typically run for a period of between 3 and 15 years and may have an option to renew after that date. Lease payments are generally subject to market review every 5 years to reflect market rentals, but because of the uncertainty over the amount of any future changes, such changes have not been reflected in the table above. None of the leases include contingent rentals. The property operating lease disclosures in 2010 have been restated principally because of revised estimations of break clauses in the lease contracts., 300911=2011 Bonus outcomes, 140612=The following information summarises the impact that the Company's operations have had on its people, customers, suppliers, community and environment during 2011., 218281=In view of the relatively new makeup of the Board, for 2011 the evaluation took the form of interviews by the Chairman with each Board member which resulted in some adjustments to the Board agendas and appropriate changes in Board focus and conduct., 102736=March 2019, 115793=10% of 2011 EBITA before exceptional items over £300 million, 187849=•  Practice senior partner, London, Deloitte & Touche (2002-2004), 399011= Any portion of the award that does not vest following the publication of the results for the year ended 31 December 2011, or that is not exercised by 31 December 2012, will lapse and the Plan will terminate., 104399=During the year we took further steps to improve the efficiency of our balance sheet, where it made economic sense to do so. In 2011 we repurchased £339 million nominal value of bonds comprising all of the £110 million 2013 bonds (at a book loss of £4 million) and £229 million of the 2015 bonds. The repurchase of 2015 bonds was at a book loss of £35 million, which was mainly incurred against repurchasing all £100 million of a tap issue to this series of bonds undertaken in early 2009 at the height of the financial crisis., 661652=Fees payable to KPMG and associates for the auditing of accounts of any associate of the Group, internal audit services, services relating to corporate finance transactions entered into or proposed to be entered into, by or on behalf of the Group or any of its associates, and any other assurance services were £nil during 2011 and 2010., 197511=Some of the things the Board is planning for 2012 include:, 236334=On the following pages we set out the Audit Committee's Report for 2011. The report comprises four sections:, 261089=The Committee has noted that KPMG have been the Company's auditors since 2004 and while satisfied with their work considers it best practice periodically to undertake a more thorough review and market appraisal.  The Committee plans to carry out such a review in 2012 to be taken into account in formulating the recommendation to the Board for the reappointment of auditors at the 2013 AGM., 191168=29 February 2012, 106309=In 2012 we will continue to look at the options for the balance sheet that make economic sense. Any potential course of action will take into account our prudent view of liquidity under an uncertain economic outlook, and ensure that sufficient flexibility is maintained to invest in the business and to deliver the Transformation Plan., 715343=Adjusted earnings per share 2011, 79019=The final dividend will be payable on 1 June 2012 to shareholders on the register as at 4 May 2012. The ex-dividend date will be 2 May 2012., 370401= April 2013-, 244582=What we focused on in 2011, 59633=UK production revenues have increased by £27 million, largely as a result of an increase in supply to ITV channels, where there has been an increase in the ITV Studios proportion of ITV1 original commissions from 53% in 2010 to 55% in 2011., 300987=Performance targets for the Senior Executive Group in 2011 were set to ensure they support both the Transformation Plan and delivery of key operational outcomes. The Committee ensured that the maximum bonus opportunity could only be achieved for significant outperformance of all corporate, financial and individual bonus outcomes, with on target performance achieving a 60% payout of maximum bonus opportunity., 372290=March 2015, 97959=Interest paid was lower than 2010 as our adjusted financing costs reduced, but we also had one-off losses on debt buy-backs of £39 million and higher corporation tax payable as we returned to a full year of making payments for taxable profits. We also resumed the payment of dividends., 172773=• Non-executive director of British Rail (1992-1994), Railtrack plc (1994-2000), and Geest plc (1988-1991), 135034=In 2010 we identified two potential strategic risks - 1) inadequate management information and 2) inadequate infrastructure - which are not included in our 2011/12 risk register. Following improvements in our management information systems we no longer deem this to be a key strategic risk, and the risk of inadequate infrastructure has been encompassed within more specific risks above., 118010=Assuming no unforeseen circumstances, no further change is currently expected in our committed contributions to Section A of the Scheme before 2015., 113921=We expect to make deficit funding contributions of £71 million in 2012, £66 million to Section A and £5 million to Sections B and C. Details of how this is constituted can be seen in section 3.6 of the Financial Statements and are summarised below., 184621=•  Member of Prime Minister's Policy Unit (1992-1994), 151541=In 2011 we continued to commission an independent research company to recruit and survey a Vision Panel. The panel is representative of 8,000 adult television viewers. This enables ITV to measure audience reaction to programmes and content on a daily basis and to achieve an in-depth understanding of viewer expectations and preferences. The panel enables ITV to ask further questions about its channels, new ideas and views on broader media issues. Qualitative research is also obtained via focus groups which may target particular demographics to gain insights for programme development., 404279=The market price of the ITV plc ordinary shares at 31 December 2011 was 68.15 pence and the range during the year was 51.65 pence (on 12 September 2011) to 93.45 pence (on 2 March 2011)., 210562=1 January 2010, 108166=The aggregate IAS 19 deficit on defined benefit schemes at 31 December 2011 was £390 million (31 December 2010: £313 million). The most significant reason for the increase was as a result of the fall in corporate bond yields which are used to value the liabilities, although this was partially offset by a reduction in the rate of market implied inflation. The value of the assets of the ITV Pension Scheme ('the Scheme') increased during the year, driven by a strong performance by the bonds and swaps used for hedging interest and inflation risk. This gain has been reduced by losses in the Scheme's equity portfolio and the impact of the introduction of the longevity swap. , 602720=As required by EU law (IAS Regulation EC 1606/2002) the Group's accounts have been prepared in accordance with International Financial Reporting Standards as adopted by the EU ('IFRS'), and approved by the Directors., 79966=Whilst statutory profit before tax of £327 million (2010: £286 million) has improved, basic earnings per share are lower than 2010 due to the statutory tax charge. The reason for this statutory tax charge increase of £63 million is primarily due to the recognition of a deferred tax asset of £68 million in 2010 in respect of tax losses not previously recognised., 109626=On 22 August 2011 the trustee of the Scheme ('the Trustee') completed a transaction that removes the risk of increases in pension liabilities that would arise if a significant portion of the Scheme's defined benefit pensioner population were to enjoy a longer life than is currently expected. The instrument is known as a longevity swap and it de-risks the future cash flows of the pension scheme., 423029=The Directors are responsible for keeping adequate accounting records that are sufficient to show and explain the parent company's transactions and disclose with reasonable accuracy at any time the financial position of the parent company and enable them to ensure that its financial statements comply with the Companies Act 2006. They have general responsibility for taking such steps as are reasonably open to them to safeguard the assets of the Group and to prevent and detect fraud and other irregularities., 33439=2010, 645387=There are no Staff costs within exceptional items in 2011 (2010: £11 million)., 114475=Expected Pension Contributions in 2012, 181883=•  President of National Westminster Bank US Consumer Credit Business (1995-1996), senior vice-president and head of US Consumer Loan Products Division (1992-1995), 812999=Method 2: All business combinations that occurred between 1 January 2004 and 31 December 2008 were accounted for using the purchase method in accordance with IFRS 3 'Business Combinations (2004)'. Goodwill on those combinations represents the difference between the cost of the acquisition and the fair value of the identifiable net assets acquired and did not include the value of the non-controlling interest. Transaction costs incurred in connection with those business combinations, such as legal fees, due diligence fees and other professional fees were included in the cost of acquisition., 181340=•  Chief Executive of AXA Sun Life plc (1999-2003), 710977=Earnings per share 2011, 199995=At the AGM in May 2012 there will be resolutions to re-elect each of the Directors., 101383=Oct 2015, 182518=3 September 2010, 172675=• Chairman, Chartwell Land plc (1987-1991), 174612=•  Chief Executive of the Football Association (2000-2002), 187373=•  Member of audit and retail risk control committees and HBOS plc (2004-2008), 624838=The Board of Directors considers the business primarily from a product or activity perspective. The reportable segments for the years ended 31 December 2011 and 31 December 2010 are therefore 'Broadcasting & Online' and 'ITV Studios', the results of which are outlined in the following table:, 344873=31 December, 99476=Strong free cash flow generation in 2011 further strengthened the balance sheet and liquidity position., 177062=•  Manager in audit and corporate finance Ernst & Young (1988-1994), 136336=During 2011, our responsibility strategy has been revised to align to the Transformation Plan and our four strategic priorities, and to contribute towards long-term industry sustainability. The strategy also aims to mitigate our risks and uncertainties and ensure the Company continues to behave in a responsible manner through specific performance targets. Objectives have been identified by the newly formed Corporate Responsibility Committee and are supported by the Management Board. A new role of Head of Corporate Responsibility has been appointed to roll out the strategy across the Company. They will be responsible for consolidating activity for maximum impact and managing policy around charitable giving, both on and off-screen. This role reports directly into the Group HR Director, who also chairs the Corporate Responsibility Committee, ensuring activity is relevant and integrated into the business., 180349=11 August 2008, 202403=Attendance in 2011, 733123=E.   Other tax adjustments reflect the reversal of the credit arising from the recognition of the deferred tax asset generated on certain losses partially offset by those losses utilised in the current year. This credit is the main reason why on a statutory basis the EPS for 2010 is higher than 2011., 529465=Balance at 31 December 2011, 179548=•  President of Global Home Care, Procter & Gamble (1999-2001), 342620=The Directors' emoluments for the year ended 31 December 2011 are set out in the table below., 275640=·      determined the performance targets that would apply to the Performance Share Plan (PSP) awards made in 2011, in line with the approvals received from shareholders;, 321080=25% STRATEGIC - for awards made in 2010, 318361=2011 levels, 305759=2012 Bonus performance measures, 100938=June 2014, 218648=It is the Board's intention to commission an external board evaluation in 2012/2013., 689166=The effective tax rate is the tax charge on the face of the income statement expressed as a percentage of the profit before tax. In the year ended 31 December 2011, the effective tax rate is lower than the standard rate of UK corporation tax primarily because of the release of an overseas prior year over provision. In the year ended 31 December 2010, the effective tax rate was lower than the standard rate of UK corporation tax primarily due to the recognition of deferred tax assets on brought forward tax losses. As explained in the Financial and Performance Review, the Group uses an adjusted tax rate to show the cash tax impact on its adjusted earnings., 400984=2010, 372234=March 2014-, 795474=At 31 December 2011, 154810=ITV 2011, 29233=There was strong growth of 28% in 2011 as creative renewal started to take place. The 111 includes 10 off-ITV commissions in the UK, and 45 international programmes., 431592=Under the Companies Act 2006 we are required to report to you if, in our opinion:, 363633=26 April 20101, 176547= Emap plc (2005-2008), 274655=What we did in 2011, 427230=This report is made solely to the Company's members, as a body, in accordance with Chapter 3 of Part 16 of the Companies Act 2006. Our audit work has been undertaken so that we might state to the Company's members those matters we are required to state to them in an auditor's report and for no other purpose. To the fullest extent permitted by law, we do not accept or assume responsibility to anyone other than the Company and the Company's members, as a body, for our audit work, for this report, or for the opinions we have formed., 534345=Balance at 1 January 2010, 332450=2011, 337816=The Chairman receives an annual fee of £300,000 and no further payment for membership of committees. He also received an award over 400,000 shares for each year (total 1.2 million shares) of his initial three-year appointment term to be released in three tranches over the initial term. The first tranche was released on 23 May 2011, the second tranche on 31 December 2011 and the third tranche will be released on 31 December 2012. He is not required to apply a percentage of his cash fee to acquire shares, as the Committee considers him to be sufficiently aligned with shareholders' interests with his current shareholding., 153104=We continue to deliver access services across our family of broadcast channels beyond the targets set by Ofcom for subtitling, signing and audio description. On the ITV Player about 80% of programming is now subtitled, and plans to offer audio description and signing are progressing well. Signing continues to be provided by our award-winning in-house facility SignPost which offers online signing services, news, information, entertainment and education in and about sign language. As well as signing provision, SignPost has been recognised for its wider access and community work. Signed Stories, our website with books to see in sign language and subtitles, won a Plain English Campaign Media Award in December 2011 for the clarity and simplicity of all its written content. ITV BabySign won the Best Early Years Digital Content at the 2012 BETT awards. The free website helps parents teach sign language to babies before they are old enough to speak, improving early years communication and bonding., 42231=There will be further investment in 2012 of around £25 million, which will be partly funded by new incremental cost savings of £20 million, as we continue to look at ways to improve the efficiency and performance of ITV., 396629=6 The Turnaround Plan (the Plan) was introduced in 2007. No awards have been made under the Plan since 2008. An award in the form of nil-cost options was made to a number of key senior Executives with a maximum value of 550% of the individual's salary. Participants were required to acquire and retain a number of shares with a value up to 100% of annual base salary for the duration of the performance period to 31 December 2011. 75% of the awards were subject to performance over a five-year period. Up to 50% of the award subject to TSR (25% of the total award) was subject to performance over the three-year period to 31 December 2009. This condition was not met, and 25% of the total award lapsed. The balance of the award will be tested once the 2011 final year results have been published and will vest dependent on the performance conditions described below., 199533=Andy Haste completed three years as a non-executive Director in August 2011. It was agreed that he should serve a further term subject to the Board succession planning framework. Mike Clasper completed six years as a non-executive Director in January 2012 and has been asked by the Board to continue as a Director for a further 12 month period.}",
    "textBeforeTable": "  Maximum Bonus opportunities   ·      up to one-third of any Bonus may be voluntarily deferred into shares under the DSA for three years. A deferral into shares is matched by an additional award under the PSP. The balance is paid in cash. ·      one-third of any Bonus is compulsorily deferred into shares for three years under the DSA; and ·      one-third of any Bonus is paid in cash;   Under the incentive framework the Bonus arrangements for the Senior Executive Group are as follows:   All ITV employees participate in a bonus arrangement which rewards them when ITV is successful.   Annual incentives are provided for the Senior Executive Group through the ITV Annual Bonus Scheme (Bonus) and the Deferred Share Award Plan (DSA). The performance conditions that apply are set on an individual basis and are closely linked to the Company's corporate, financial and strategic priorities. Short-term incentives   Executives are required to defer a significant proportion of any annual bonus into shares in order to achieve maximum award levels under long-term incentive awards.   ·      reward sustained performance over an extended period. ·      support a culture of accountability: valuing execution and delivery, with a clear commercial focus; and ·      application of",
    "textAfterTable": "  For 2012 the maximum Bonus opportunities will remain unchanged for Adam Crozier and Ian Griffiths at 180% and 165% of base salary respectively.   2011 Bonus outcomes Performance targets for the Senior Executive Group in 2011 were set to ensure they support both the Transformation Plan and delivery of key operational outcomes. The Committee ensured that the maximum bonus opportunity could only be achieved for significant outperformance of all corporate, financial and individual bonus outcomes, with on target performance achieving a 60% payout of maximum bonus opportunity.   2011 Bonus performance measures The majority of the bonus opportunity (60%) was based upon the achievement of corporate and financial targets, weighted to the area of the business for which the executive has primary responsibility. For Adam Crozier and Ian Griffiths the targets were set at a corporate level. Across the Senior Executive Group these targets include profit generation, profit to cash conversion, Family SOV (platform adjusted), online targets, revenue targets, content creation targets and delivery of agreed cost savings targets.   The remainder of the bonus opportunity (40%) was based upon the contribution that the executive makes toward the overall Transformation Plan through the delivery of specific targets.   ITV's financial performance in 2011 has been strong, as outlined in the Performance & Financials section. In light of performance during the year,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}