{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "food is so so",
            "some of the dorms are amazing",
            "from what Ive experienced it is not a cupcake school very mind stimulating",
            "try to get you housing situated as soon as possible before its to late",
            "a strong professor core. Very helpful with selecting classes. Always helps to try and help you with whats best for you."
        ]
    ],
    "pageTitle": "East Stroudsburg University of Pennsylvania Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/East-Stroudsburg-University-of-Pennsylvania/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00092-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896624251,
    "recordOffset": 896564737,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{260752=There's always something to do here on campus. Something is going on every day, whether it be lounge games, parties on the quad, or free fairs! Come April, ESU will never be quiet during the day. It's lively and inviting!, 276487=East Stroudsburg has many alumni that are very successful such as Jim Saxton who was an U.S Representative from 1980 to 2009. Moreover, one has created a new boxing device called the quiet punch which will become useful as time goes by., 174894=I have yet to take a class at ESU but I start later in August but I believe that any college classes can be difficult but if one works hard then all the hard work will pay off in the end. I will be studying nursing so I know I will have a lot of work to do but ESU offers programs to help students who need help in and particular subject., 285342=© 2015, Cappex.com, LLC, 90369=Your roommates are going to be are going to be pretty cool. the actual campus is currently renovating its dorms. Laurel hall dorms are great, you are literally right next to the main classrooms, the buildings are almost touching. Some of the Dorms are not as convent and are a bit antiquated. Many of the Dorms were build't in 1976 and can get cold on the lower floors especially, but construction on three new buildings have been completed since 2011 the rooms are warm, modern and include a kitchen area.}",
    "textBeforeTable": "01/13/2010 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 67 Nathaly from East Stroudsburg, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Login to rate or flag the reviews Amanda from Philadelphia, PA 07/30/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 6 out of 6 people found this review useful. 2 of 67 Categories Comments Tips for prospective students Yuo would feel right at home if you are away from home. I'm from Philadelphia but ESU became my second home. Login to rate or flag the reviews Hannah from Perkasie, PA 07/10/2010 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 5 out of 6 people found this review useful. 3 of 67 Categories Comments Bang for the buck Hopefully I will be",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}