{
    "relation": [
        [
            "Timestamp",
            "2012-04-27",
            "2012-04-27"
        ],
        [
            "Action",
            "Added",
            "Added"
        ],
        [
            "Category",
            "RELATION",
            "RELATION"
        ],
        [
            "Detail",
            "is a GO:0036206 (regulation of histone gene expression)",
            "is a GO:0010629 (negative regulation of gene expression)"
        ]
    ],
    "pageTitle": "GO:0036208 negative regulation of histone gene expression",
    "title": "",
    "url": "http://www.ebi.ac.uk/QuickGO/GTerm?id=GO:0036208",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00082-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 423078235,
    "recordOffset": 423051694,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{122271=Copyright (c) EMBL-EBI 2013 | EBI is an Outstation of the European Molecular Biology Laboratory | Privacy | Cookies | Terms of use, 122138=EMBL-EBI, Wellcome Trust Genome Campus, Hinxton, Cambridgeshire, CB10 1SD, UK +44 (0)1223 49 44 44}",
    "textBeforeTable": "icon for more details. Synonyms are alternative words or phrases closely related in meaning to the term name, with indication of the relationship between the name and synonym given by the synonym scope. Click on the Synonyms GO:0036208 Wiki Page GONUTS This term was created even though it describes a process relating to a group of gene products, because histones are highly conserved proteins that are essential components of cellular chromatin in eukaryotic cells. Comment Any process that decreases the frequency, rate or extent of expression of a histone-encoding gene. Gene expression is the process in which a gene's coding sequence is converted into a mature gene product or products (proteins or RNA). This includes the production of an RNA transcript as well as any processing to produce a mature RNA product or an mRNA (for protein-coding genes) and the translation of that mRNA into protein. Definition Biological Process Ontology negative regulation of histone gene expression Name GO:0036208 ID Term Information Term Basket",
    "textAfterTable": "Ancestor Chart This chart is interactive; you can click on the term boxes and legend for more information. Display Key ShowHide GO IDs ShowHide Term box width Term box height Slim colours ShowHide Show children ShowHide Image size limit (in megapixels) Note that setting the limit too high may result in images being generated slowly; it may even cause the browser to crash. The maximum limit is 20 megapixels. Child Terms This table lists all terms that are direct descendants (child terms) of GO:0036208: Term has no children Protein Annotation Display",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}