{
    "relation": [
        [
            "Volts",
            "120",
            "240",
            "",
            "120",
            "240",
            "",
            "120",
            "240"
        ],
        [
            "Amps",
            "1.0",
            "2.1",
            "",
            "3.1",
            "6.3",
            "",
            "4.2",
            "8.3"
        ],
        [
            "Watts",
            "125",
            "500",
            "",
            "375",
            "1500",
            "",
            "500",
            "2000"
        ],
        [
            "Ohms",
            "115",
            "115",
            "",
            "38",
            "38",
            "",
            "29",
            "29"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://nordicgroup.us/hotelcooking/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00242-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 181392991,
    "recordOffset": 181359804,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{65795=Deal Extreme 2296, $4.10, 72900=Most of the appliances mentioned on this site are 120V only, though a few are dual voltage. To use 120V appliances in places with 220V electricity a high wattage travel converter can be used. These converters are for appliances that are purely resistive (no motors, no electronics, no clocks, no timers, no digital temperature controls, etc). These converters do not have a step-down transformer inside which is why they are so small, light, and inexpensive. They will not harm the purely resistive element inside a cooking appliance. Buy a 2000 watt model which is far more than most appliances use, because you want a lot of margin. Converters can get very hot depending on the wattage of the appliance used with it, and the manufacturers always warn that these are not designed for continuous use because excess power is bled off as heat by the triacs., 11957=Try http://item.gmarket.co.kr/detailview/Item.asp?goodscode=283792768 but this site shows the 220V version for the Korean market. The 220V model is 1300 watts., 18939=Power: 120 V Electric Rating: 1300 Watts Temperature Control: 80(Warm) -230(C) / 176-446(F) Heater: Sheath Heater Deep-Pan Depth: 2.4\" (6 cm) Deep-Pan Full Capacity (L): 3.4 liter Net Weight: 8.8 lbs or 4.0 kg Dimensions: 14-1/2\"D x 13-1/4\"W x 7-1/2\"H 1-year Manufacturer's warranty, 55211=I finally bought one of these in December 2012 for my daughter to take to her college dorm room where she is on the 5 day meal plan and needs to cook or eat out on weekends. Since she's half-Asian she needs her rice. The heating element is about 60Ω, which means that at 120V this unit draws about 2 amps, and is about 240 watts., 15120=The middle and right photos are from a Marukai advertisement http://www.marukai.com/osusume_march.html., 83158=Last Update: 22 April 2013, 67351=A more detailed description of the very similar Powerbright TK2000 can be found here, but this unit does not allow the voltage conversion function to be switched off and is not recommended. However the explanation of the conversion capabilities may be useful., 68425=Conair Travelsmart TS253AD 220 to 110V Voltage Converter/Plug Adapter, 2000 Watt Note: This device can be used as a plug adapter with dual-voltage appliances because voltage conversion function can be switched off., 8312=Electric woks are good for stir frying. Also good for steaming (includes steaming rack). You could also use it for tasks as mundane as boiling water. $50. 120V only. 1500 watts., 71269=There's an article at http://kakopa.com/PSA220-110/index.html which I will summarize. The author analyzed the Radio Shack converter model 273-1404.}",
    "TableContextTimeStampAfterTable": "{27659=2000 Watt/220V Ukrainian Immersion Heater (About 500W at 120V), 27311=1500 Watt/220V Ukrainian Immersion Heater (About 375W at 120V), 64933=http://www.samstores.com/details.asp?ProdID=1530, 9828=The Norpro 559 is the most common immersion heater available in the U.S. and is 300 watts. I wouldn't advise using it at 220V since it would produce 1200 watts and would likely self-destruct., 7036=This combination appliance might be all you need to prepare meals for one person. About $30. 120V only. 1150 watts., 97349=© 2012, The Nordic Group. No part of this website may be reproduced without written consent of the Nordic Group.}",
    "lastModified": "Tue, 22 Apr 2014 21:50:57 GMT",
    "textBeforeTable": "Here is a table with some different 240V immersion heaters and how much heat they produce at 240V and 120V: There is one from Hong Kong on eBay (prices in Australian dollars, that's a good deal, see: http://www.ebay.com/itm/Traveling-2000W-220V-Electric-Element-Immersion-Heater-/190551104039. There are a bunch of high-power 220V immersion heaters from the Ukraine that are sold on eBay, but the shipping is quite expensive. A 1500W model is $28 with shipping. A 2000W model is about $25 with shipping. Note that these will work fine at 120V, the wattage will just be reduced by about 75%. For 220V/240V immersion heaters check stores that sell 220V/240V appliance for use outside the U.S., generally Indian or Chinese stores. I picked up a 500W/220V immersion heater for $5.99 at an Indian store in Sunnyvale, CA,  http://www.eastwestusastore.com, but it isn't on their web site. This will also work at 120V, but it will be only 125W at 120V so it would take a long time to boil water (I tried it and it took 19 minutes to bring 8 ounces of water to a rolling boil). 120V only version is available at many stores for about $5. Amazon sells it as well. See DoitBest and see if they have free store to store shipping for your area. The last time I checked, they charged $5.29 for this immersion heater. Voltage",
    "textAfterTable": "Immersion Heater Volts, Amps, Watts, Ohms   1500 Watt/220V Ukrainian Immersion Heater (About 375W at 120V) 2000 Watt/220V Ukrainian Immersion Heater (About 500W at 120V) Return to Table of Contents Send e-mail to: hotelroomcookingacademician@nordicgroup.xx (change xx to us) Small Microwave Ovens Obviously most of these are too big to carry with you in your luggage, but on trips where you're driving they'd work out okay. Hotel staff is likely to be unconcerned about a microwave oven since the fire danger is minimal. I take along a folding hand truck that folds very flat and small in order to cart the microwave into the hotel. I figured it was cheaper to bring along a small microwave than to pay every time for an upgraded room that included a microwave, though more and more standard rooms now include a microwave oven and a refrigerator, and at most motel chains the breakfast area has a microwave that's available even outside of breakfast hours. Remember that the cooking wattage is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}