{
    "relation": [
        [
            "First Name",
            "Denise",
            "Larson",
            "Thomas"
        ],
        [
            "Last Name",
            "Cardman",
            "Frisby",
            "Susman"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=1192E100-9C35-4501-ABC0-CC596C4E90F2&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00151-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 223561318,
    "recordOffset": 223545406,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31925=H.R. 1873, S. 987, the Arbitration Fairness Act, 82319=H.R.308/S.32, Large Capacity Ammunition Feeding Device Act. H.R.645, To Restore Second Amendment Rights to the District of Columbia. H.R.822, National Right-to-Carry Reciprocity Act. H.R. 2900, the Secure Access to Firearms Enhancement Act S.35/H.R.591, Gun Show Background Check of 2011. S.436/H.R.1781, Fix Gun Checks Act of 2011 S.1305, No Firearms for Foreign Felons Act., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 40739=H.R. 2012, S.420, the Foster Care Mentoring Act of 2011. H.R.3126, S.1667, Stop Child Abuse in Residential H.R.681, Every Child Deserves a Family Act. Programs for Teens Act H.R.2464, Families Beyond Bars Act. H.R. 2883, S.1542, Child and Family Services Improvement and Innovation Act, 90875=H.R.32, the Homeless Children and Youth Act of 2011, 75212=Draft legislation to establish an Article I immigration court, and general issues regarding improvement of immigration courts H.R. 1842, S.952 the Development, Relief, and Education for Alien Minors Act of 2011 H.R. 1932, the Keep Our Communities Safe Act of 2011 General communications on immigration detention conditions and enforcement of ICE Detention Standards; access to legal representation and notice of legal rights; efforts to combat notario fraud. Communications regarding the Administration's implementation of a policy to apply prosecutorial discretion to immigration removal cases, 78513=Department of Labor/American Bar Association Lawyer Referral Program provisions and oversight H.R. 1161, the Community Alcohol Regulatory Effectiveness Act of 2011 Department of Labor Proposed Rule on the Labor-Management Reporting and Disclosure Act, Interpretation of the \"Advice\" Exemption, RIN 1215-AB79 and 1245-AA03, 76 Fed. Reg. 36178 (June 21, 2011) H.R. 1409, Quality Health Care Coalition Act of 2011 H.R. 1839, Community Pharmacy Fairness Act of 2011 H.R. 1946, Preserving Our Hometown Independent Pharmacies Act of 2011, 85367=H.R. 1063, Strengthening Medicare And Repaying Taxpayers Act of 2011 - all provisions, 12242=Draft bankruptcy technical corrections bill prepared by ABA proposing partial repeal of bankruptcy attorney liability provisions contained in Sections 102, 203(a), and 226-229 of P.L. 109-8 (formerly S. 256), Bankruptcy Abuse Prevention and Consumer Protection Act of 2005, to add a new partnership section to the Bankruptcy Code, and to make certain technical amendments to Section 363(f) of the Code regarding certain sales of real property, 47508=S. 410, Sunshine in the Courtroom Act of 2011 S. 569, Federal Judicial Fairness Act H.R. 862, the Supreme Court Transparency and Disclosure Act H.R. 592, S. 623 Sunshine in Litigation Act H.R. 727, S. 348, Judicial Transparency and Ethics Enhancement Act -I.G. for Courts H.R.858, To provide for the conversion of a temporary judgeship for the district of Hawaii to a permanent judgeship. H.R.1021, Temporary Bankruptcy Judgeships Extension Act of 2011 H.R. 966, S. 533, Lawsuit Abuse Reduction Act of 2011 H. R. 1416, S. 755, Crime victim Restitution and Court Fee Intercept Act H.R. 2480, Administrative Conference of the United States Reauthorization Act of 2011 S. 1606 and H.R. 3010, Regulatory Accountability Act of 2011 Proposed Presidential Proclamation and proposed Justice Department Commemoration designating October 16-22, 2011 as Mediation Week, 57643=H.R.74, Private Prison Information Act of 2011 H.R.82, Drug Court Reauthorization Act. H.R.223, Federal Prison Bureau Nonviolent Offender Relief Act. H.R. 313, Drug Trafficking Safe Harbor Elimination Act of 2011 S.250, Justice for All Reauthorization Act of 2011. S.306, National Criminal Justice Commission Act of 2011. S.401, Public Corruption Prosecution Improvements Act of 2011. H.R.2316, Fair Sentencing Clarification Act of 2011. H.R.2449, Fresh Start Act of 2011 S.132, Criminal Justice and Forensic Science Reform Act of 2011. S.645/H.R.1360, Child Protection Improvements Act of 2011. S.1231, the Second Chance Reauthorization Act of 2011. S.1301, Trafficking Victims Protection Reauthorization Act of 2011. H.R. 2870, the Adam Walsh Reauthorization Act of 2011 Draft legislation prohibiting all federal agencies from pressuring companies and other organizations to waive their attorney-client privilege, work product, or employee legal protections in return for cooperation credit during investigations and other civil and criminal enforcement matters Proposed changes to Justice Department internal policy involving waiver of attorney-client privilege, work product, and employee legal protections as conditions for receiving cooperation credit during investigations (set forth in August 2008 corporate charging guidelines amendment to U.S. Attorneys Manual [Filip Memorandum]) Proposed Presidential executive order applying a modified version of the Justice Departments August 2008 corporate charging guidelines provisions dealing with waiver of attorney-client privilege, work product, and employee legal protections to all federal agencies Proposed changes to Securities and Exchange Commission policy involving waiver of attorney-client privilege, work product, and employee legal protections as conditions for receiving cooperation credit during investigations (set forth in the Commissions Seaboard Report, formally known as the Report of Investigation Pursuant to Section 21(a) of the Securities Act of 1934 and Commission Statement on the Relationship of Cooperation to Agency Enforcement Decisions, issued on October 23, 2001 as Releases 44969 and 1470; and in Section 4.3 of the SECs Enforcement Manual issued on October 6, 2008 and revised on January 13, 2010) Proposed changes to Department of Housing and Urban Development policy involving waiver of attorney-client privilege and work product protections (including the written policy set forth in the HUDs February 3, 2006 formal Notice to public housing authorities [PHAs] and permanently incorporated into HUD guidance at Appendix 6 to HUD Handbook 1530.1 REV-5, Litigation dated May 2004 and Section 7.4G of HUD Handbook 7460.8 REV-2, Procurement Handbook for Public Housing Agencies dated March 2007, and the informal policy of requesting that such public housing authorities waive these protections during audits and investigations) Proposed changes to Environmental Protection Agency policy involving waiver of attorney-client privilege, work product, and employee legal protections as conditions for receiving cooperation credit during investigations (set forth in the EPA Cooperation Standards, \"Incentives for Self-Policing: Discovery, Disclosure, Correction and Prevention of Violations,\" Effective May 11, 2000) Proposed changes to Department of Defense policy involving waiver of attorney-client privilege and work product protections (set forth in DOD policy titled Use of DOD Information SystemsStandard Consent Banner and User Agreement requiring military defense lawyers to provide access to client computer files issued on May 9, 2008) H.R.1823, Criminal Code Modernization and Simplification Act of 2011 H.R.1254, Synthetic Drug Control Act of 2011 H.R.1771, Justice Integrity Act H.R.1793, Clean Up Government Act of 2011 H.R.1913, Bryne/JAG Program Accountability Act H.R.2212/S.2017, Democracy Restoration Act H.R.2242, Fairness in Cocaine Sentencing Act of 2011 H.R.2243, Literacy, Education and Rehabilitation Act H.R.2244, Prisoner Incentive Act of 2011 H.R.2303, Major Drug Trafficking Prosecution Act of 2011 S. 1670, H.R.3618, End Racial Profiling Act of 2011 S.1731, Combating Money Laundering, Terrorist Financing, and Counterfeiting Act of 2011 Advocated adoption of ABA Standards in regards to U.S. Department of Justice (DOJ) implementation of the recommendations of the National Commission to Eliminate Prison Rape. Advocated policy in regards to oversight of the Equal Employment Opportunity Commission to policies that may reduce barriers to employment of persons with criminal records, 43663=S. 1346 and H.R. 2669, Stop Tax Haven Abuse Actprovisions subjecting lawyers that act as formation agents to the anti-money laundering and suspicious activity reporting requirements of the Bank Secrecy Act S. 1483 and H.R. 3416, Incorporation Transparency and Law Enforcement Assistance Actprovisions requiring states, certain businesses, and company formation agents to obtain and disclose beneficial ownership information regarding new companies and subjecting lawyers that act as formation agents to the anti-money laundering and suspicious activity reporting requirements of the Bank Secrecy Act. Draft legislation amending P.L. 111-203 (formerly, H.R. 4173), Dodd-Frank Wall Street Reform and Consumer Protection Act, and draft rules implementing particular sections of the Actprovisions relating to federal regulation of lawyers, protecting the attorney-client privilege, Congo conflict minerals disclosure, consumer protection issues, potential technical improvements to the structure and powers of the Consumer Financial Protection Bureau, and eight financial reform principles endorsed by the American Bar Association, 29001=H.R. 1249, S. 23, the America Invents Act H.R. 516, the Bring Jobs Back to America Act H.R. 3261, the Stop Online Piracy Act S. 968, the Preventing Real Online Threats to Economic Creativity and Theft of Intellectual Property Act of 2011, 71926=H.R. 2829, the United Nations Transparency, Accountability and Reform Act of 2011 Draft legislation to combat international violence against women Treaty Doc. 96-53, Convention on the Elimination of All Forms of Discrimination Against Women Treaty Doc. 103-39, Convention on the Law of the Sea Proposal to establish a mechanism to impose civil responsibility on states that engage in state-sponsored violence against women as a weapon of war and to provide reparations for victims. Issues relating to legal services market access for lawyers and law firms overseas, 54480=H.R. 968, Detainee Security Act of 2011 S. 548, Effective Interrogation of Unprivileged Enemy Belligerents Act S. 551, Military Detainee Procedures Improvement Act of 2011 S. 553, Detention of Unprivileged Enemy Belligerents Act S.554, to prohibit the use of Department of Justice funds for the prosecution in Article III courts of individuals accused of 2001, terrorist attacks. H.R. 1540, S. 1253, the National Defense Authorization Act -- provisions relating to Guantanamo detainees, 34635=H.R. 1540 Section 573; H.R. 6523; S.1253, S.1867 National Defense Authorization Act of FY2012 Activity in opposition to problem legislation concerning child custody matters for members of the military. S. 1106, Justice for Troops Act; S. 1253 Section 554 -- Activity in support of funding for the military pro bono projects for FY2012. H.R. 1540; S. 1253, Section 551 National Defense Authorization Act of FY2012 -- Activity in response to proposed amendments to the Uniform Code of Military Justice concerning sexual abuse and rape, Articles 120, 120b, and 125. H.R. 1540, Section 531 National Defense Authorization Act of FY2012 activity in clarification of provisions concerning correction of military records., 23477=H.R. 1519, S. 797, the Paycheck Fairness Act H.R. 1397, S.811, Employment Non-Discrimination Act - provisions related to eliminating employment discrimination based on sexual orientation and gender identity. H.R. 1473, H.R. 1, DOD and full-year Continuing Appropriations Act of 2011- provisions relating to Title X funding and funding for Planned Parenthood S.598, Respect for Marriage Act - provisions related to repealing the Defense of Marriage Act H.R. 2032, To protect the interests of each resident of intermediate care facilities for the mentally retarded in class action lawsuits by federally-funded entities involving such residents and in Department of Justice actions that could result in an agreement to move such a resident from that resident's facility - provisions related to increasing class action requirements for people with disabilities in intermediate care facilities for the mentally retarded. Reauthorization of the Older Americans Act, all provisions relating to legal assistance and elder rights portions of the Act S. 1744, Guardian Accountability and Senior Protection Act all provisions relating to state court funding for guardianship and conservatorship proceedings and the use of technology to improve conservatorship reporting S. 1763, the Stand Against Violence and Empower Native Women (SAVE) Act provisions relating to services, protection, and and justice for underserved populations S. 1925, Violence Against Women Reauthorization Act of 2011 all provisions relating to legal assistance to victims, services to underserved populations H.R. 3195, S 1781, Civil Rights Tax Relief Act of 2011 all provisions, 51710=H.R. 5, Help Efficient, Accessible, Low-cost, Timely Healthcare (HEALTH) Act of 2011, provisions related to contingency fees, caps on damages, and state preemption, 15349=HR 2112, Consolidated and Further Continuing Appropriations Act - funding for Legal Services Corporation; funding and operations of the U.S. Patent and Trademark Office; funding for reentry programs under the Second Chance Act; juvenile justice programs and indigent defense services administered by the Department of Justice; Bureau of Prison programs; and funding for the Department of Justice Executive Office of Immigration Review Legal Orientation Program. HR 2055, HR 3671, the Consolidated Appropriations Act, 2012 -- Divisions A, D, F and I as below: FY 2012 Financial Services and General Government Appropriationsprovisions providing funding for the Administrative Conference of the United States, the Securities and Exchange Commission, the Internal Revenue Service and for the IRS Volunteer Income Tax Assistance and Low-Income Taxpayer Clinic programs; funding for Defender Services; and funding for U.S. Courts; oppose ban on funding for needle exchange programs. FY2012 Labor, Health and Human Services and Education Appropriations funding for programs authorized under the Preserving Safe and Stable Families Act (SANCA), funding for programs authorized under the federal Child Abuse Prevention and Treatment Act (CAPTA); oppose ban on funding for needle exchange programs. FY2012 State, Foreign Operations and Related Agencies Appropriations - funding for international rule of law assistance and supportive language for ABA rule of law programs; oppose ban on funding for needle exchange programs. Activity in support of funding for the Thurgood Marshall Legal Educational Opportunity Program for FY2012 Activity in support of funding for the ABA Military Pro Bono Project for FY2011 and FY2012., 88059=H.R. 1416, S. 755, Crime Victim Restitution and Court Fee Intercept Act Communications regarding options for tax reform relating to partnerships and financial transactions}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  THOMAS M. SUSMAN  2026621765  thomas.susman@americanbar.org 5. Senate ID#  1808-12 7. Client Name Self Check if client is a state or local government or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}