{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3",
            "Step 4",
            "Step 5",
            "Step 6",
            "Step 7"
        ],
        [
            "Command or Action",
            "Do one of the following: Open a NAM console session from the router. See the Opening and Closing a NAM Console Session from the Router. Open a Telnet or SSH session to the NAM. See the Opening and Closing a Telnet or SSH Session to the NAM.",
            "Do one of the following: ip http server enable ip http secure server enable Example: root@localhost# ip http server enable Example: root@localhost# ip http secure server enable",
            "Do one of the following: Enter a web username. Press Return to enter the default web username \"admin\". Example: Please enter a web administrator user name [admin]: joeadmin Example: Please enter a web administrator user name [admin]:",
            "Enter a password. Example: New password:",
            "Enter the password again. Example: Confirm password:",
            "On your PC, open a web browser.",
            "In the web browser, enter the NAM system IP address or hostname as the URL. Example: http://172.20.105.215/ Example: https://172.20.105.215/ Example: http://nam1/"
        ],
        [
            "Purpose",
            "Accesses the NAM CLI.",
            "Enables the HTTP server. or Enables the HTTP secure server (HTTPs).",
            "Configures a web username. The NAM requires at least one web username and password configuration. If NAM does not prompt you for a web username and password, then at least one web username and password combination was previously configured.",
            "Configures a password for the web username.",
            "Confirms the password for the web username.",
            "--",
            "Opens the NAM Traffic Analyzer in your web browser. You are automatically redirected to the NAM Traffic Analyzer login page."
        ]
    ],
    "pageTitle": "Interface and Hardware Component Configuration Guide, Cisco IOS Release 15S - Network Analysis Module (NM-NAM) [Cisco IOS 15.5S] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/interface/configuration/15-s/ir-15-s-book/ir-nm-nam.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00244-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 373661295,
    "recordOffset": 373599846,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{37604=16- and 36-Port Ethernet Switch Module for Cisco 2600 Series, Cisco 3600 Series, and Cisco 3700 Series, Cisco IOS feature module, 310808=This feature was implemented on the following platforms: Cisco 2811, Cisco 2821, and Cisco 2851., 309902=This feature was introduced on the following platforms: Cisco 2600XM series, Cisco 2691, Cisco 3660, Cisco 3725, and Cisco 3745., 4635=For Cisco 2691, Cisco 3725, and Cisco 3745 routers only, make sure that the router runs ROM Monitor (ROMMON) Version 12.2(8r)T2 or a later version. This ROMMON version contains a fix that prevents the router from resetting all the network modules when it is reloaded. Refer to the ROM Monitor Download Procedures for Cisco 2691, Cisco, 3631, Cisco 3725, and Cisco 3745 Routers., 315763=RMON --remote monitoring. MIB agent specification described in RFC 1271 that defines functions for the remote monitoring of networked devices. The RMON specification provides numerous monitoring, problem detection, and reporting capabilities.}",
    "textBeforeTable": "DETAILED STEPS show running-config show ip interface brief 9.    Do one of the following: 8.    end 7.    no shutdown ip address ip-address mask ip unnumbered interface number 6.    Do one of the following: 5.    interface analysis-module slot /0 4.    ip address ip-address mask 3.    interface type number 2.    configure terminal 1.   ",
    "textAfterTable": "Step 7 no shutdown Example:  Router(config-if)# no shutdown   Activates the Analysis-Module interface.   Step 8 end Example:  Router(config-if)# end Example:  Router#   Returns to privileged EXEC mode.   Step 9 Do one of the following: show ip interface brief show running-config Example:  Router# show ip interface brief Example:  Router# show running-config   Displays the IP addresses and summary status of the interfaces. or Displays the contents of the currently running configuration file. Verify that you properly configured the Analysis-Module interface.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}