{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Home of the largest private police force in the country, UPenn takes its students' safety very seriously, with many procedures in place to protect those who work and study here.",
            "Second to none, the weekends are always filled with fraternity fun.",
            "Take your pick, there are literally hundreds of clubs and activities to participate in yearly, from Badminton to politics.",
            "Those who will appreciate a demanding education in a city environment will do best here.",
            "The annual Toast to Old Penn is held at the football stadium, where at halftime, everyone hurls actual toast onto the track. Quite a sight to see.",
            "The University of Pennsylvania provides a first rate education for less than many other private universities. Value is all around you at UPenn, and again, the ability to network with some of the future leaders of America pays for itself.",
            "The city has great nightlife, and you can basically spend a whole day in just one section, exploring history and culture. Visit Old City to take a free tour of Independence Hall, then hop on the bus to the Art Museum area to explore some of our nation's greatest treasures!",
            "Meal plans for those who don't have the patience to cook for themselves, and an excellent selection of restaurants which cater to the college crowd. There are even a few places which are open until 4:30 AM!",
            "New facilities for students who prefer a modern dormitory, and classic facilities for those who want the feeling of a smaller college. You can live on or off campus, and there is a great management company in University City which deals specifically in renting to students and faculty.",
            "As a colonial college and Ivy League university, you can expect a highly rigorous education, reinforced by a solid core of subjects within the liberal arts.",
            "Get into the city to explore your surroundings. Make sure you take the time to interview people who work at and attend the university for a better understanding of what it can offer you.",
            "The University of Pennsylvania is a wonderful place to receive an education. This city of Philadelphia is a great backdrop for this classic Ivy League school. There are many opportunities to make a great career for yourself, and the networking is second to none."
        ]
    ],
    "pageTitle": "University of Pennsylvania Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Pennsylvania/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00196-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902740163,
    "recordOffset": 902674868,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{64160=If you can, AVOID 1920 COMMONS. The food is terrible. Youre better off going to Hill or Houston., 137557=SAT scores are not everything to this school. I admit I did not have the best score for applying to this school (1900 and 30 ACT) it didn't stop me from applying. Keep your hopes up, be active in your home, school and community and it will give you that fighting chance., 285296=There are three dining areas at each end and the middle of campus. 1920 Commons was hit or miss but Hill was pretty good., 150203=Awesome social experience, whether or not you're on a hall with people that become your best friends. I was on a particularly quiet hall. Though I was disappointed at first, I soon came to appreciate the peacefulness of my living environment. Every time I wanted to get rowdy, I'd walk down the hall or across the quad to my friends' halls. My room was the size of a closet and we had co-ed, less than desirable bathrooms, but the experience of living with over 1000 other freshman in a 1800s castle was well worth it. Being able to walk outside and sit on the grass on a sunny day to listen to music or do your homework while your best friends surround you playing frisbee or walking to class is an unmatchable freedom., 317513=© 2015, Cappex.com, LLC, 120003=Meal plans for those who don't have the patience to cook for themselves, and an excellent selection of restaurants which cater to the college crowd. There are even a few places which are open until 4:30 AM!}",
    "textBeforeTable": "07/12/2009 Reviewer is A current student here. 76 out of 81 people found this review useful. 1 of 75 Katherine from Murrieta, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Login to rate or flag the reviews Joseph from Highland Hts., OH 11/03/2010 Reviewer is A current student here. 38 out of 39 people found this review useful. 3 of 75 Categories Comments Great for these types of students The typical student here tends to be farely polarized: incredible work ethic and party animal. While Penn is ideal for anyone of this personality complexion, it isn't mandatory. I certainly didn't fit this mold--though I'm slowly being converted--and many of my friends don't either. Nonetheless, do not apply here if you aren't prepared to work hard and pull plenty of all-nighters. Tips for prospective students Visit campus. Penn was bottom of the list for me, barely even a consideration. On my way to spend two days at Duke, I felt obliged to stop and spend half a day at Penn. I won't bore you with the details, but let's just say that I'm sitting in a dorm at Penn right now with no regrets. Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}