{
    "relation": [
        [
            "Related Topic",
            "DHCP commands: complete command syntax, command modes, command history, defaults, usage guidelines, and examples",
            "DHCP conceptual information",
            "DHCP server configuration",
            "DHCP client configuration",
            "DHCP relay agent configuration",
            "DHCP server on-demand address pool manager configuration",
            "DHCP advanced features",
            "DHCP options"
        ],
        [
            "Document Title",
            "Cisco IOS IP Addressing Services Command Reference",
            "\"DHCP Overview\" module",
            "\"Configuring the Cisco IOS DHCP Server\" module",
            "\"Configuring the Cisco IOS DHCP Client\" module",
            "\"Configuring the Cisco IOS DHCP Relay Agent\" module",
            "\"Configuring the DHCP Server On-Demand Address Pool Manager\" module",
            "\"Configuring DHCP Services for Accounting and Security\" module",
            "\"DHCP Options\" appendix in the Network Registrar User's Guide , Release 6.1.1"
        ]
    ],
    "pageTitle": "IP Addressing: DHCP Configuration Guide, Cisco IOS Release 12.4T - Configuring DHCP Enhancements for Edge-Session Management [Cisco IOS Software Releases 12.4 T] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipaddr_dhcp/configuration/12-4t/dhcp-12-4t-book/config-dhcp-for-edge-session-management.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00279-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 369170031,
    "recordOffset": 369140722,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{119026=RFC 1542, 119609=RFC 2685, 119328=RFC 2131, 109295=In the example above, an SG-supplied class name, called classname1, would relay the DHCP DISCOVER packet to the server at the relay target IP address 10.20.10.1, while SG classname2 would relay the DHCP DISCOVER packet to the server at the relay target IP address 10.0.10.1. This configuration relays the packet to destination IP address 10.0.0.1, because the pool matches the first configured address on the interface. If the SG returns a classname3, then the default pool is the default address specified as the relay destination. If the SG returns any class name other than classname1, classname2, or classname3, then no relay action is taken.}",
    "textBeforeTable": "Related Documents The following sections provide references related to configuring DHCP Enhancements for Edge-Session Management. Additional References In the example above, an SG-supplied class name, called classname1, would relay the DHCP DISCOVER packet to the server at the relay target IP address 10.20.10.1, while SG classname2 would relay the DHCP DISCOVER packet to the server at the relay target IP address 10.0.10.1. This configuration relays the packet to destination IP address 10.0.0.1, because the pool matches the first configured address on the interface. If the SG returns a classname3, then the default pool is the default address specified as the relay destination. If the SG returns any class name other than classname1, classname2, or classname3, then no relay action is taken. class classname3 relay target 10.0.10.1 class classname2 relay target 10.20.10.1 class classname1 relay destination 10.1.0.0 relay source 10.1.0.0 255.255.0.0 ip dhcp pool abc-pool-1  In the following example, an SG-supplied class name is to be used in selecting the remote DHCP server to which packets should be relayed.   SG-Supplied Class Name Configuration Example   relay target 10.0.0.5 class",
    "textAfterTable": "Standards Standards Title No new or modified standards are supported by this functionality. -- MIBs MIBs MIBs Link No new or modified MIBs are supported by this feature. To locate and download MIBs for selected platforms, Cisco IOS releases, and feature sets, use Cisco MIB Locator found at the following URL: http://www.cisco.com/go/mibs RFCs RFCs Title RFC 951",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}