{
    "relation": [
        [
            "Gen.",
            "*",
            "1",
            "2",
            "3",
            "4",
            "5"
        ],
        [
            "1st game",
            "Male Hero",
            "Red Ash",
            "Gold Ethan",
            "Ruby Brendan",
            "Diamond Ethan",
            "Black"
        ],
        [
            "2nd game",
            "Rival",
            "Green Gary",
            "Silver",
            "Emerald ~ Wally",
            "Pearl Barry",
            "White"
        ],
        [
            "3rd game",
            "Female Hero",
            "Blue, Yellow Leaf",
            "Crystal Chris, Kris, Lyra",
            "Sapphire May",
            "Platinum Dawn",
            "?"
        ]
    ],
    "pageTitle": "User:DanPMK - Bulbapedia, the community-driven Pokémon encyclopedia",
    "title": "",
    "url": "http://bulbapedia.bulbagarden.net/w/index.php?title=User:DanPMK&oldid=1158709",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00317-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 34594999,
    "recordOffset": 34578064,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Generation 3? 5 Lol 2: The awakening 4 Lol 3 From DPBP 2 Food for thought 1 Generation 3? Contents TBA This user is a player of Pokémon LeafGreen Version. This user is a player of Pokémon FireRed Version. My Pokémon history - Remade This user is a",
    "textAfterTable": "It seems in Generation 3 they broke this formula. Perhaps to keep the \"Green\" one as the rival and the \"Blue\" one as the female hero? Food for thought Also: Trapinch -> Vibrava -> Salamence Bagon -> Shelgon -> Flygon From DPBP I don't wanna lose this bit on information so I'll put it here. Regarding DPBP... Aipom and Ambipom, expected to be numbers 218 and 219, respectively, were moved to #267 and #268. It is unknown why their original position after the Hoppip family was changed. The next family, Sunkern's, occupies numbers 219 and 220. As Aipom received a new evolution and would have required a second slot, MK's hypothesis is that they forgot about Ambipom when numbering the Pokémon. The following Pokémon, all of which notably do not evolve, were moved: Qwilfish, expected to be #267, was moved to #218. Girafarig, expected to be #259 after Wobbuffet, was moved all the way to #489, after Gastrodon; this is where Ambipom's space would have been had he been unrelated to Aipom. Shuckle, expected to be #268 (#267 accommodating Qwilfish's move), was moved to Girafarig's place. Lol I was looking through a text file I had and found this text. I apparently wrote it in response to",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}