{
    "relation": [
        [
            "Leasehold interests",
            "Buildings and improvements",
            "Tenant improvements",
            "Furniture, fixtures and equipment"
        ],
        [
            "",
            "",
            "",
            ""
        ],
        [
            "Remaining lease term",
            "5 to 40 years",
            "The shorter of the term of the related lease or useful life",
            "5 to 10 years"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.wikinvest.com/stock/Mack-Cali_Realty_(CLI)/Filing/10-Q/2006/F2275506",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00054-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 827156983,
    "recordOffset": 827073892,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1012407=the joint venture completed redevelopment of the property and placed the office/flex building in service.  The Company holds a 50 percent interest in the joint venture.  The venture has a mortgage loan with a $14.9 million balance at September 30, 2006 secured by its office/flex property.  The mortgage bears interest at a rate of LIBOR plus 175 basis points and matures in January 2007, with one two-year extension option, subject to certain conditions.  The venture has provided notice and the required extension fee to the lender of its intention to extend the term of the loan until January 2009., 1019199=On July 20, 2006, the Company entered into a second joint venture agreement with PRC to form Red Bank Corporate Plaza II L.L.C.  The venture was formed to hold land on which it plans to develop Red Bank Corporate, 909205=Through September 30, 2006, the Company completed seven of the acquisitions of interests in the Non-Portfolio Properties, which included the acquisitions of:  a 530,000 square foot, mixed-use office/retail complex; a 139,750 square-foot fully-leased office property; an office property in development; two vacant land parcels and two pre-developed projects.  The aggregate cost of the completed acquisitions was approximately $24.7 million., 1008153=The Company holds a 50 percent interest in G&G Martco, which owns Convention Plaza, a 305,618 square foot office building, located in San Francisco, California.  The venture has a mortgage loan with a $47.3 million balance at September 30, 2006 collateralized by its office property.  The loan also provides the venture the ability to increase the balance of the loan up to an additional $266,000 for the funding of qualified leasing costs.  The loan bears interest at a rate of the London Inter-Bank Offered Rate (\u0093LIBOR\u0094) (5.322 percent at September 30, 2006) plus 162.5 basis points and was scheduled to mature in August 2006.  The Company has agreed in principle to sell its joint venture interest to an affiliate of its current joint venture partner.  The maturity date of the mortgage loan was extended to November 15, 2006.  The Company performs management and leasing services for the property owned by the joint venture and recognized $36,000 and $30,000 in fees for such services in the three months ended September 30, 2006 and 2005, respectively, and $119,000 and $99,000 for the nine months ended September 30, 2006 and 2005, respectively., 1036056=100 Kimball has a construction loan in an amount not to exceed $29 million, with a balance at September 30, 2006 of $12.5 million.  The loan bears interest at a rate of LIBOR plus 195 basis points and matures on December 8, 2008 with a one-year extension option., 284443=The aforementioned financial statements should be read in conjunction with the notes to the aforementioned financial statements and Management\u0092s Discussion and Analysis of Financial Condition and Results of Operations and the financial statements and notes thereto included in Mack-Cali Realty Corporation\u0092s Annual Report on Form 10-K for the fiscal year ended December 31, 2005., 1014986=On November 17, 1999, the Company entered into a joint venture with Hyatt Corporation (\u0093Hyatt\u0094) to develop a 350-room hotel on the South Pier at Harborside Financial Center, Jersey City, New Jersey, which was completed and commenced initial operations in July 2002.  The Company owns a 50 percent interest in the venture., 996263=On February 12, 2003, the NJSEA selected The Mills Corporation and the Company to redevelop the Continental Airlines Arena site (\u0093Arena Site\u0094) for mixed uses, including retail.  In March 2003, Hartz Mountain Industries, Inc., (\u0093Hartz\u0094), filed a lawsuit in the Superior Court of New Jersey, Law Division, for Bergen County, seeking to enjoin NJSEA from entering into a contract with the Meadowlands Venture for the redevelopment of the Continental Airlines Arena site.  In May 2003, the court denied Hartz\u0092s request for an injunction and dismissed its suit for failure to exhaust administrative remedies.  In June 2003, the NJSEA held hearings on Hartz\u0092s protest, and on a parallel protest filed by another rejected developer, Westfield, Inc. (\u0093Westfield\u0094).  On September 10, 2003, the NJSEA ruled against Hartz\u0092s and Westfield\u0092s protests.  Hartz and Westfield, as well as Elliot Braha and three other taxpayers (collectively \u0093Braha\u0094), thereafter filed appeals from the NJSEA\u0092s final decision.  By decision dated May 14, 2004, the Appellate Division of the Superior Court of New Jersey rejected the appellants\u0092 contention that the NJSEA lacks statutory authority to allow retail development of its property.  The Appellate Division also remanded Hart\u0092s claim under the Open Public Records Acts, seeking disclosure of additional documents from NJSEA, to the Law Division for further proceedings.  The Supreme Court of New Jersey declined to review the Appellate Division\u0092s decision.  On August 19, 2004, the Law Division issued a decision resolving Hartz\u0092s Open Public Records Act claim and, 913276=The Company acquired the following office properties during the nine months ended September 30, 2006:  (dollars in thousands), 999676=In January 2004, Hartz and Westfield also appealed to the Appellate Division of the Superior Court of New Jersey from the NJSEA\u0092s December 2003 approval and execution of the Redevelopment Agreement with the Meadowlands Venture., 796112=The Company accounts for its investments in unconsolidated joint ventures for which Financial Accounting Standards Board (\u0093FASB\u0094) Interpretation No. 46 (revised December 2003), Consolidation of Variable Interest Entities (\u0093FIN 46\u0094) does not apply under the equity method of accounting as the Company exercises significant influence, but does not control these entities. These investments are recorded initially at cost, as Investments in Unconsolidated Joint Ventures, and subsequently adjusted for equity in earnings and cash contributions and distributions., 813456=The Company received dividend income of approximately $902,000 from its holdings in CarrAmerica stock during the three months ended March 31, 2006, which is recorded in interest and dividend income.  During the three months ended March 31, 2006, the Company sold all of its 1,804,800 shares of CarrAmerica common stock realizing a gain of approximately $15.1 million, which is recorded in gain on sale of marketable securities., 243097=Consolidated Statements of Cash Flows for the nine months ended September 30, 2006 and 2005, 1018691=On October 20, 2006, the venture entered into a $22.0 million construction loan with a commercial bank collateralized by the land and development project.  The loan carries an interest rate of LIBOR plus 130 basis points and matures in April 2008.  The loan currently has three one-year extension options subject to certain conditions, each of which require payment of a fee., 212362=QUARTERLY REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 800493=The Company has evaluated its joint ventures with regards to FIN 46.  As of September 30, 2006, the Company has identified its Meadowlands Xanadu joint venture as a VIE, but is not consolidating such venture as the Company is not the primary beneficiary.  Disclosure about this VIE is included in Note 4: Investments in Unconsolidated Joint Ventures., 995510=In October 2006, Mills, the manager of the Meadowlands Venture, provided the Company information regarding the restatements of financial information it had previously presented to the Company for the period from November 25, 2003 (the inception of the Meadowlands Venture) through December 31, 2005.  Included in the Company\u0092s equity in loss of unconsolidated joint ventures from the Meadowlands Venture of $1.8 million for the three and nine months ended September 30, 2006 is $1.4 million related to the Company\u0092s allocated share of the loss arising from the restatement for the period referenced above., 373547=2006, 240234=Consolidated Statement of Changes in Stockholders\u0092 Equity for the nine months ended September 30, 2006, 843016=The dividends and distributions payable at September 30, 2006 represents dividends payable to preferred shareholders (10,000 shares) and common shareholders (62,562,206 shares), and distributions payable to minority interest common unitholders of the Operating Partnership (15,595,825 common units) for all such holders of record as of October 4, 2006 with respect to the third quarter 2006.  The third quarter 2006 preferred stock dividends of $50.00 per share, common stock dividends and common unit distributions of $0.64 per common share and unit were approved by the Board of Directors on September 19, 2006.  The preferred stock dividends, common stock dividends and common unit distributions payable were paid on October 16, 2006., 1009797=On May 20, 1998, the Company entered into a joint venture with Columbia Development Company, L.L.C. (\u0093Columbia\u0094) to form American Financial Exchange L.L.C. (\u0093AFE\u0094).  The venture was formed to acquire land for future development, located on the Hudson River waterfront in Jersey City, New Jersey, adjacent to the Company\u0092s Harborside Financial Center office complex.  Among other things, the partnership agreement provides for a preferred return on the Company\u0092s invested capital in the venture, in addition to the Company\u0092s proportionate share of the venture\u0092s profit, as defined in the agreement., 1027810=GE Gale has a mortgage loan in an amount not to exceed $52.8 million, which has a balance at September 30, 2006, of $39.3 million.  The loan provides the venture the ability to draw funds for qualified leasing and capital improvement costs.  The loan bears interest at a rate of LIBOR plus 275 basis points and matures on January 9, 2009, with an extension option through January 9, 2011., 1011436=On August 20, 1998, the Company entered into a joint venture with S.B. New York Realty Corp. to form Ramland Realty Associates L.L.C.  The venture was formed to own, manage and operate One Ramland Road, a 232,000 square foot office/flex building and adjacent developable land, located in Orangeburg, New York.  In August 1999,, 287246=September 30, 2006, 851407=The Company accounts for stock options and restricted stock awards granted prior to 2002 using the intrinsic value method prescribed in Accounting Principles Board Opinion No. 25,  \u0093Accounting for Stock Issued to Employees,\u0094 and related Interpretations (\u0093APB No. 25\u0094).  Under APB No. 25, compensation cost for stock options is measured as the excess, if any, of the quoted market price of the Company\u0092s stock at the date of grant over the exercise price of the option granted.  Compensation cost for stock options is recognized ratably over the vesting period.  The Company\u0092s policy is to grant options with an exercise price equal to the quoted closing market price of the Company\u0092s stock on the business day preceding the grant date.  Accordingly, no compensation cost has been recognized under the Company\u0092s stock option plans for the granting of stock options made prior to 2002.  Restricted stock awards granted prior to 2002 are valued at the vesting dates of such awards with compensation cost for such awards recognized ratably over the vesting period., 1017769=On March 23, 2006, the Company entered into a joint venture with the PRC Group (\u0093PRC\u0094) to form Red Bank Corporate Plaza L.L.C.  The venture was formed to develop Red Bank Corporate Plaza, a 92,878 square foot office building located in Red Bank, New Jersey, which has been fully pre-leased to Hovnanian Enterprises, Inc. for a 10-year term.  The Company holds a 50 percent interest in the venture.  PRC contributed the vacant land for the development of the office building as its initial capital in the venture.  The Company funded the costs of development up to the value of the land contributed by PRC of $3.5 million as its initial capital.  PRC and the Company each funded development costs of the venture of $1.1 million in excess of their initial capital contributed., 652550=Balance at September 30, 2006, 224667=Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past ninety (90) days.  YES  x NO o, 759761=Mack-Cali Realty Corporation, a Maryland corporation, together with its subsidiaries (collectively, the \u0093Company\u0094), is a fully-integrated, self-administered, self-managed real estate investment trust (\u0093REIT\u0094) providing leasing, management, acquisition, development, construction and tenant-related services for its properties and third-parties.  As of September 30, 2006, the Company owned or had interests in 321 properties plus developable land (collectively, the \u0093Properties\u0094).  The Properties aggregate approximately 36.1 million square feet, which are comprised of 214 office buildings and 96 office/flex buildings, totaling approximately 35.7 million square feet (which include 43 office buildings and one office/flex building aggregating 5.3 million square feet owned by unconsolidated joint ventures in which the Company has investment interests), six industrial/warehouse buildings totaling approximately 387,400 square feet, two retail properties totaling approximately 17,300 square feet, a hotel (which is owned by an unconsolidated joint venture in which the Company has an investment interest) and two parcels of land leased to others.  The Properties are located in nine states, primarily in the Northeast, plus the District of Columbia., 213536=For the quarterly period ended September 30, 2006, 1000042=In November 2004, Hartz and Westfield filed additional appeals in the Appellate Division challenging NJSEA\u0092s resolution authorizing the execution of the First Amendment to the Redevelopment Agreement with Meadowlands Venture and the ground lease with the Meadowlands Venture., 987232=The Company and Mills own a 20 percent and 80 percent interest, respectively, in the Meadowlands Venture.  These interests were subject to certain participation rights by The New York Giants, which were subsequently terminated in April 2004.  The Meadowlands Xanadu Venture Agreement required the Company to make an equity contribution up to a maximum of $32.5 million, which it fulfilled in April 2005.  Pursuant to the Meadowlands Xanadu Venture Agreement, Mills has received subordinated capital credit in the venture of approximately $118.0 million, which represents certain costs incurred by Mills in connection with the Empire Tract prior to the creation of the Meadowlands Venture.  However, under the First Amendment to the Meadowlands Xanadu Venture Agreement, the Company and Mills agreed that due to the expected receipt by the Meadowlands Venture of certain other sums and certain development costs savings in connection with Meadowlands Xanadu, Mills\u0092 subordinated capital credit in the venture for the Empire Tract should be reduced to $60.0 million as of the date of the First Amendment to the Meadowlands Xanadu Venture Agreement.  The Meadowlands Xanadu Venture Agreement requires Mills to contribute the balance of the capital required to complete the entertainment phase, subject to certain limitations.  The Company will receive a 9 percent preferred return on its equity investment, only after Mills receives a 9 percent preferred return on its equity investment.  Residual returns, subject to participation by other parties, will be in proportion to each partner\u0092s respective percentage interest., 1000456=All of the above appeals have been consolidated by the Appellate Division.  On August 17, 2006, the Appellate Division issued an opinion affirming NJSEA\u0092s selection of the Meadowlands Venture and rejecting the appellants\u0092 arguments in all respects.  On August 28, 2006, Hartz made a motion before the Appellate Division for reconsideration of this decision and for supplementation of the record.  That motion is pending., 983382=Agreement was entered into as of June 30, 2005.  Meadowlands Xanadu\u0092s approximately 4.76 million-square-foot complex is expected to feature a family entertainment, recreation and retail destination comprising five themed zones: sports; entertainment; children\u0092s education; fashion; and food and home, in addition to four office buildings, aggregating approximately 1.8 million square feet, and a 520-room hotel., 983937=On December 3, 2003, the Meadowlands Venture entered into a redevelopment agreement (the \u0093Redevelopment Agreement\u0094) with the New Jersey Sports and Exposition Authority (\u0093NJSEA\u0094) for the redevelopment of the area surrounding the Continental Airlines Arena in East Rutherford, New Jersey and the construction of the Meadowlands Xanadu project.  The Redevelopment Agreement provides for a 75-year ground lease and requires the Meadowlands Venture to pay the NJSEA a $160 million development rights fee and fixed rent over the term.  Fixed rent will be in the amount of $1,000 per year for the first 15 years, increasing to $7.5 million from the 16th to the 18th years, increasing to $8.4 million in the 19th year, increasing to $8.7 million in the 20th year, increasing to $9.0 million in the 21st year, then to $9.2 million in the 23rd to 26th years, with additional increases over the remainder of the term, as set forth in the ground lease.  The ground lease also allows for the potential for participation rent payments by the Meadowlands Venture, as described in the ground lease agreement.  The First Amendment to the Redevelopment Agreement and the ground lease, itself, were signed on October 5, 2004.  The Meadowlands Venture received all necessary permits and approvals from the NJSEA and U.S. Army Corps of Engineers in March 2005 and commenced construction in the same month.  As a condition to fill wetlands pursuant to the permit issued by the U.S. Army Corps of Engineers and pursuant to the Redevelopment Agreement, as amended, Mills conveyed certain vacant land, known as the Empire Tract, to a conservancy trust.  On June 30, 2005, the $160 million development rights fee was deposited into an escrow account by the Meadowlands Venture in accordance with the terms of the First Amendment to the Redevelopment Agreement.  On such date, the following amounts were paid from escrow:  (i) approximately $37.2 million to defease certain debt obligations of the NJSEA; and (ii) $26.8 million to the NJSEA, which, in turn, paid such amount to the Meadowlands Venture for the Empire Tract.  Subsequently, the remainder of the monies were released from the escrow account to the NJSEA., 237365=Consolidated Statements of Operations for the three and nine month periods ended September 30, 2006 and 2005, 1006126=The New Jersey Builders\u0092 Association (\u0093NJBA\u0094) has commenced an action, which is pending in the Appellate Division, alleging that the NJSEA has failed to meet a purported obligation to provide affordable housing at the Meadowlands Complex and seeking, among other relief, an order enjoining the construction of Meadowlands Xanadu.  NJBA filed an application for preliminary injunctive relief seeking to enjoin further construction of Meadowlands Xanadu, which the Appellate Division denied on July 28, 2005.  The Meadowlands Venture is not a party to that action., 1031453=On June 15, 2006, the Company entered into a joint venture with a Gale Affiliate to form M-C Kimball, LLC (\u0093M-C Kimball\u0094).  M-C Kimball was formed for the sole purpose of acquiring a Gale Affiliate\u0092s 33.33 percent membership interest in Gale Kimball, L.L.C. (\u0093Gale Kimball\u0094), an entity holding a 25 percent interest in 100 Kimball Drive LLC (\u0093100 Kimball\u0094), which is developing a 175,000 square foot office property located at 100 Kimball Drive, Parsippany, New Jersey (the \u0093Kimball Property\u0094)., 905881=On May 9, 2006, the Company completed the acquisitions of:  (i) The Gale Company and certain of its related businesses, which engage in construction, property management, facilities management, and leasing services (collectively, the \u0093Gale Company\u0094); (ii) three office properties; and (iii) indirect interests in a portfolio of office properties, located primarily in New Jersey, which were owned indirectly by The Gale Company and its affiliates (\u0093Gale\u0094) and affiliates of SL Green Realty Corp. (\u0093SL Green\u0094).  The agreements to complete the aforementioned acquisitions (collectively, the \u0093Gale/Green Transactions\u0094) required that the Company complete all of the acquisitions., 1036446=The Company performs construction and development services for the property owned by 100 Kimball for which it recognized $130,000 in income (net of $2.4 million in direct costs) and $276,000 in income (net of $5.7 million in direct costs) in the three and nine months ended September 30, 2006., 223675=(732) 590-1000, 1039012=On September 8, 2006, the Company entered into a joint venture with a Gale Affiliate to form M-C Vreeland, LLC (\u0093M-C Vreeland\u0094).  M-C Vreeland was formed for the sole purpose of acquiring a Gale Affiliate\u0092s 50 percent membership interest in 12 Vreeland Associates, L.L.C., an entity owning an office property located at 12 Vreeland Road, Florham Park, New Jersey., 1037103=On June 9, 2006, the Company entered into a joint venture with a Gale Affiliate to form 55 Corporate Partners, LLC (\u009355 Corporate\u0094).  55 Corporate was formed for the sole purpose of acquiring from a Gale Affiliate a 50 percent interest in SLG 55 Corporate Drive II, LLC (\u0093SLG 55\u0094), an entity indirectly holding a condominium interest in a vacant land parcel located in Bridgewater, New Jersey, which can accommodate development of an approximately 200,000 square foot office building.  Sanofi-Aventis, which occupies neighboring buildings, has an option to cause the venture to construct the building, which it would lease on a long-term basis.  Sanofi-Aventis is required to pay a penalty of $7 million, subject to certain conditions, in the event it fails to exercise the option.  The remaining 50 percent in SLG 55 is owned by SLG Gale 55 Corporate LLC, an affiliate of SL Green Realty Corp (\u0093SLG Gale 55\u0094)., 1030336=The Route 93 Ventures have mortgage loans with an amount not to exceed $58.6 million, with a $39.4 million balance at September 30, 2006 collateralized by its office properties.  The loan provides the venture the ability to draw additional monies for qualified leasing and capital improvement costs.  The loan bears interest at a rate of LIBOR plus 220 basis points and matures on July 11, 2008, with three one-year extension options., 1023998=Substantially all of the OP LP Properties are encumbered by mortgage loans with an aggregate outstanding principal balance of $358.5 million.  $190.2 million of the mortgage loans bear interest at a weighted average fixed interest rate of 6.32 percent per annum and mature at various times through May 2016.  $168.3 million of the mortgage loans bear interest at a floating rate ranging from LIBOR plus 185 basis points to LIBOR plus 275 basis points per annum and mature at various times through August 2008.  Included in the floating rate mortgage loans are $90.3 million provided by an affiliate of SL Green., 834138=The Company has elected to be taxed as a REIT under Sections 856 through 860 of the Internal Revenue Code of 1986, as amended (the \u0093Code\u0094).  As a REIT, the Company generally will not be subject to corporate federal income tax (including alternative minimum tax) on net income that it currently distributes to its shareholders, provided that the Company satisfies certain organizational and operational requirements including the requirement to distribute at least 90 percent of its REIT taxable income to its shareholders.  The Company has elected to treat certain of its corporate subsidiaries as taxable REIT subsidiaries (each a \u0093TRS\u0094).  In general, a TRS of the Company may perform additional services for tenants of the Company and generally may engage in any real estate or non-real estate related business (except for the operation or management of health care facilities or lodging facilities or the providing to any person, under a franchise, license or otherwise, rights to any brand name, 1041350=The following is a summary of the financial position of the unconsolidated joint ventures in which the Company had investment interests as of September 30, 2006 and December 31, 2005:  (dollars in thousands), 226526=As of October 27, 2006, there were 62,604,676 shares of the registrant\u0092s Common Stock, par value $0.01 per share, outstanding., 1015457=The venture had a mortgage loan with a commercial bank with a $62.9 million balance at December 31, 2003 collateralized by its hotel property.  The debt bore interest at a rate of LIBOR plus 275 basis points, which was scheduled to mature in December 2003, and was extended through January 29, 2004.  On that date, the venture repaid the mortgage loan using the proceeds from a new $40.0 million mortgage loan, (with a balance as of September 30, 2006 of $38.9 million) collateralized by the hotel property, as well as capital contributions from the Company and Hyatt of $10.8 million each.  The new loan carried an interest rate of LIBOR plus 200 basis points and was scheduled to mature in February 2007.  On October 12, 2006, the venture repaid the mortgage loan using proceeds from a new $70.0 million mortgage loan collateralized by the hotel property.  The new loan carries an interest rate of 6.15 percent and matures in November 2016.  On May 25, 2004, the venture obtained a second mortgage loan with a commercial bank for $20.0 million.  The loan carried an interest rate of LIBOR plus 175 basis points and was scheduled to mature in February 2007.  The proceeds from this loan were used to make distributions to the Company and Hyatt in the amount of $10.0 million each.  This loan was repaid in full during the quarter from operating cash.  Additionally, the venture has a loan with a balance as of September 30, 2006 of $7.3 million with the City of Jersey City, provided by the U.S. Department of Housing and Urban Development.  The loan currently bears interest at fixed rates ranging from 6.09 percent to 6.62 percent and matures in August 2020.  The Company has posted a $7.3 million letter of credit in support of this loan, $3.6 million of which is indemnified by Hyatt., 981470=The debt of the Company\u0092s unconsolidated joint ventures aggregating $571.0 million as of September 30, 2006 is non-recourse to the Company, except for customary exceptions pertaining to such matters as intentional misuse of funds, environmental conditions and material misrepresentations, and except as otherwise indicated below., 1005427=On April 5, 2005, the New York Football Giants (\u0093Giants\u0094) filed an emergent application with the Supreme Court of New Jersey, Chancery Division, seeking an injunction stopping all work on the Meadowlands Xanadu project as being in violation of its existing lease with the NJSEA.  After hearing oral argument on the application on August 5, 2005, the court denied the Giants\u0092 motion for preliminary injunctive relief.  On June 22, 2006, the court entered a Stipulation and Consent Order that dismissed without prejudice the parties\u0092 respective claims., 374204=2005, 1001030=On September 30, 2004, the Borough of Carlstadt filed an action in the Superior Court of New Jersey Law Division, challenging Meadowlands Xanadu, which asserted claims that are substantially the same as claims asserted by Hartz and Braha in the above appeals.  By Order dated November 19, 2004, the Law Division transferred that matter to the Superior Court of New Jersey, Appellate Division.  This matter was voluntarily dismissed by Carlstadt in accordance with a March 22, 2006, Settlement Agreement and Release between Carlstadt and the Meadowlands Venture., 1013151=The Company performs management, leasing and other services for the property owned by the joint venture and recognized $35,000 and $8,000 in fees for such services in the three months ended September 30, 2006 and 2005, respectively, and $82,000 and $63,000 for the nine months ended September 30, 2006 and 2005, respectively., 1029129=On June 1, 2006, the Route 93 Venture was formed between the Route 93 Participant, a majority-owned subsidiary of the Company, having a 30 percent interest and the Commingled Pension Trust Fund (Special Situation Property) of JPMorgan Chase Bank having a 70 percent interest, for the purpose of acquiring seven office buildings, aggregating 670,000 square feet, located in the towns of Andover, Bedford and Billerica, Massachusetts.  Profits and losses are shared by the partners in proportion to their respective interests until the investment yields an 11 percent IRR, then sharing will shift to 40/60, and when the IRR reaches 15 percent, then sharing will shift to 50/50., 1020725=On May 9, 2006, as part of the Gale/Green Transactions, the Company entered into a joint venture, Mack-Green-Gale LLC (\u0093Mack-Green\u0094), with SL Green, pursuant to which Mack-Green holds a 96 percent interest and acts as general partner of Gale SLG NJ Operating Partnership, L.P. (the \u0093OP LP\u0094).  The Company acquired its interest in Mack-Green for approximately $116 million, which was funded primarily through borrowing under the Company\u0092s revolving credit facility.  The OP LP owns 100 percent of entities which own 25 office properties (the \u0093OP LP Properties\u0094) which aggregate 3.5 million square feet (consisting of 17 office properties aggregating 2.3 million square feet located in New Jersey and eight properties aggregating 1.2 million square feet located in Troy, Michigan), as well as a minor, non-controlling interest in four office properties aggregating 419,000 square feet located in Naperville, Illinois., 1030903=The Company performs management and construction services for the properties owned by the Route 93 Ventures and recognized $0 for such services in the three and nine months ended September 30, 2006., 845193=The dividends and distributions payable at December 31, 2005 represents dividends payable to preferred shareholders (10,000 shares) and common shareholders (62,028,306 shares), and distributions payable to minority interest common unitholders of the Operating Partnership (13,650,439 common units) for all such holders of record as of January 5, 2006 with respect to the fourth quarter 2005.  The fourth quarter 2005 preferred stock dividends of $50.00 per share, common stock dividends and common unit distributions of $0.63 per common share and unit were approved by the Board of Directors on December 6, 2005.  The common stock dividends and common unit distributions payable were paid on January 13, 2006.  The preferred stock dividends payable were paid on January 17, 2006., 855919=The following table illustrates the effect on net income and earnings per share if the fair value based method had been applied to all outstanding and unvested stock awards for the three and nine month periods ended September 30, 2005: (dollars in thousands), 994010=On August 21, 2006, The Mills Corporation (\u0093TMC\u0094) announced that it had signed a non-binding letter of intent with Colony Capital Acquisitions, LLC (\u0093Colony\u0094) and Kan Am USA Management XXII Limited Partnership (\u0093Kan Am\u0094) under which Colony would arrange for construction financing for Meadowlands Xanadu and make a significant equity infusion into the Meadowlands Venture, and TMC would not have any financial obligations post closing (\u0093Colony Transaction\u0094).  Kan Am has been a partner with Mills in the Meadowlands Venture., 947350=The Company sold the following office properties during the nine months ended September 30, 2006:  (dollars in thousands), 982195=On November 25, 2003, the Company and affiliates of The Mills Corporation (\u0093Mills\u0094) entered into a joint venture agreement (\u0093Meadowlands Xanadu Venture Agreement\u0094) to form Meadowlands Mills/Mack-Cali Limited Partnership (\u0093Meadowlands Venture\u0094) for the purpose of developing a $1.3 billion family entertainment, recreation and retail complex with an office and hotel component to be built at the Meadowlands sports complex in East Rutherford, New Jersey (\u0093Meadowlands Xanadu\u0094).  The First Amendment to the Meadowlands Xanadu Venture, 907539=In connection with the Company\u0092s acquisition of the Gale Company, Mr. Stanley C. Gale and certain other affiliates of Gale are restricted from competing with the Company or hiring the Company\u0092s employees for a period of four years expiring on May 9, 2010., 1025290=The Company performs management, leasing, and construction services for the properties owned by the joint venture and recognized $900,000 in income (net of $310,000 in direct costs) and $1.7 million in income (net of $737,000 in direct costs) for such services in the three and nine months ended September 30, 2006., 1042635=September 30, 2006, 1039737=The office property at 12 Vreeland is a 139,750 square foot office building that is fully leased to a single tenant through June 15, 2012.  The property is subject to a mortgage loan, which matures on July 1, 2012, in the initial amount of $18.1 million bearing interest at 6.9 percent per annum.  As of September 30, 2006 the outstanding balance on the mortgage note was $10.6 million., 215782=TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 1013997=On September 18, 1998, the Company entered into a joint venture with Prudential to form Ashford Loop Associates L.P.  The venture was formed to own, manage and operate 1001 South Dairy Ashford, a 130,000 square foot office building acquired on September 18, 1998, and 2100 West Loop South, a 168,000 square foot office building acquired on November 25, 1998, both located in Houston, Texas.  The Company held a 20 percent interest in the joint venture.  On February 25, 2005, the Company sold its interest in the venture to Prudential for $2.7 million., 854186=In 2002, the Company adopted the provisions of FASB No. 123, and in 2006, the Company adopted the provisions of FASB No. 123(R), which did not have a material effect on the Company\u0092s financial position and results of operations.  These provisions require that the estimated fair value of restricted stock (\u0093Restricted Stock Awards\u0094) and stock options at the grant date be amortized ratably into expense over the appropriate vesting period.  For the three months ended September 30, 2006 and 2005, the Company recorded restricted stock and stock options expense of $815,000 and $1,070,000, respectively, and $2,429,000 and $2,696,000 for the nine months ended September 30, 2006 and 2005, respectively.  FASB No. 148, Accounting for Stock-Based Compensation \u0097 Transition and Disclosure, was issued in December 2002 and amends FASB No. 123, Accounting for Stock Based Compensation.  FASB No. 148 provides alternative methods of transition for a voluntary change to the fair value based method of accounting for stock based compensation.  In addition, this Statement amends the disclosure requirements of FASB No. 123 to require prominent disclosures in both annual and interim financial statements about the method of accounting for stock-based employee compensation and the effect of the method used on reported results.  FASB No. 148 disclosure requirements are presented below:, 555026=Balance at January 1, 2006, 222428=08837-2206, 1003119=Three separate lawsuits have been filed in the United States District Court for the District of New Jersey, challenging a permit issued by the U.S. Army Corps of Engineers (\u0093USACE\u0094) in connection with the project.  The first suit was filed on March 30, 2005, by the Sierra Club, the New Jersey Public Interest Research Group, Citizen Lobby, Inc. and the New Jersey Environmental Federation.  Additional suits were filed on May 16 and May 31, 2005, respectively, by Hartz (together with one of its officers as an individually-named plaintiff) and the Borough of Carlstadt.  The Sierra Club also filed a motion for a preliminary injunction to stop certain construction activities on the project, which the Court denied on July 6, 2005.  On October 26, 2005, the court granted the motions of the Meadowlands Venture and the USACE to dismiss the Hartz complaint for lack of standing.  The deadline for appealing that decision has passed, so the Hartz action is ended.  On October 31, 2005, the USACE filed a motion to dismiss the complaint filed by the Borough of Carlstadt for lack of standing.  On February 7, 2006, the Court granted the motion and dismissed the Borough of Carlstadt\u0092s complaint in its entirety.  On March 9, 2006, Carlstadt filed a notice of appeal of this decision to the United States Court of Appeals for the Third Circuit.  This appeal has, 1025966=On May 9, 2006, as part of the Gale/Green Transactions, the Company acquired from a Gale Affiliate for $1.8 million a 50 percent controlling interest in GMW Village Associates, LLC (\u0093GMW Village\u0094).  GMW Village holds a 20 percent interest in GE/Gale Funding LLC (\u0093GE Gale\u0094).  GE Gale owns a 100 percent interest in the entity owning Princeton Forrestal Village, a mixed-use, office/retail complex aggregating 530,000 square feet and located in Plainsboro, New Jersey (\u0093Princeton Forrestal Village\u0094 or \u0093PFV\u0094)., 1028331=The Company performs management, leasing, and construction services for PFV and recognized $402,000 in income (net of $3.2 million in direct costs) for such services in the three and nine months ended September 30, 2006., 816145=Costs incurred in obtaining financing are capitalized and amortized on a straight-line basis, which approximates the effective interest method, over the term of the related indebtedness.  Amortization of such costs is included in interest expense and was $725,000 and $817,000 for the three months ended September 30, 2006 and 2005, respectively, and $2,171,000 and $2,556,000 for the nine months ended September 30, 2006 and 2005, respectively., 764711=Rental properties are stated at cost less accumulated depreciation and amortization. Costs directly related to the acquisition, development and construction of rental properties are capitalized. Capitalized development and construction costs include pre-construction costs essential to the development of the property, development and construction costs, interest, property taxes, insurance, salaries and other project costs incurred during the period of development. Included in total rental property is construction and development in-progress of $173.6 million and $118.8 million (including land of $61.8 million and $58.4 million) as of September 30, 2006 and December 31, 2005, respectively. Ordinary repairs and maintenance are expensed as incurred; major replacements and betterments, which improve or extend the life of the asset, are capitalized and depreciated over their estimated useful lives. Fully-depreciated assets are removed from the accounts., 1024747=On August 9, 2006, $69.7 million of mortgage loans were refinanced.  The new loan has a maximum principal amount of $90.0 million with $78.0 million drawn at September 30, 2006.  The loan provides the ability to draw funds for qualified leasing and capital improvement costs.  The loan bears interest at a rate of LIBOR plus 185 basis points and matures on August 8, 2008 with a two-year extension option., 811369=The Company\u0092s marketable securities at December 31, 2005 carried a value of $50.8 million and consisted of 1,468,300 shares of common stock in CarrAmerica Realty Corporation, which were all acquired in 2005.  The Company\u0092s marketable securities at December 31, 2005 were all classified as available-for-sale and were carried at fair value based on quoted market prices.  The Company recorded an unrealized holding loss of $790,000 as other comprehensive loss in 2005.  From January 1, 2006 through January 25, 2006, the Company purchased an additional 336,500 shares of common stock in CarrAmerica for a total purchase price of $11.9 million., 1006837=On January 25, 2006, the Bergen Cliff Hawks Baseball Club, LLC (the \u0093Cliff Hawks\u0094), filed a complaint against the Company and Mills, alleging that the Company and Mills breached an agreement to provide the Cliff Hawks with a minor league baseball park as part of the Xanadu Project.  This matter is pending., 968304=1510 Lancer Drive, 287928=December 31, 2005, 998582=ordered NJSEA to disclose some, but not all, of the documents Hartz was seeking.  The Appellate Division, in a decision rendered on November 24, 2004, upheld the findings of the Law Division in the remand proceeding.  The Supreme Court of New Jersey declined to review the Appellate Division\u0092s decision.  At Hartz\u0092s request, the NJSEA thereafter held further hearings on December 15 and 16, 2004, to review certain additional facts in support of Hartz\u0092s and Westfield\u0092s bid protest.  Braha, as a taxpayer, did not have standing to participate in the supplemental protest hearing.  On March 4, 2005, the Hearing Officer rendered his Supplemental Report and Recommendation to the NJSEA, finding no merit in the protests presented by Hartz and Westfield.  The NJSEA accepted the Hearing Officer\u0092s Supplemental Report and Recommendation on March 30, 2005 and Hartz and Braha have appealed that decision to the Appellate Division., 284952=The results of operations for the three and nine month periods ended September 30, 2006 are not necessarily indicative of the results to be expected for the entire fiscal year or any other period., 234538=Consolidated Balance Sheets as of September 30, 2006 and December 31, 2005, 818850=Costs incurred in connection with leases are capitalized and amortized on a straight-line basis over the terms of the related leases and included in depreciation and amortization.  Unamortized deferred leasing costs are charged to amortization expense upon early termination of the lease.  Certain employees of the Company are compensated for providing leasing services to the Properties.  The portion of such compensation, which is capitalized and amortized, approximated $908,000 and $911,000 for the three months ended September 30, 2006 and 2005, respectively and $2,574,000 and $2,817,000 for the nine months ended September 30, 2006 and 2005, respectively.}",
    "textBeforeTable": "FORM 10-Q UNITED STATES SECURITIES AND EXCHANGE COMMISSION WASHINGTON, D.C. 20549   Ex-32.1 Ex-32.1 Ex-31.2 Ex-31.1 Ex-10.94 Ex-10.93 Ex-10.92 Ex-10.91 10-Q Documents found in this filing: Mack-Cali Realty 10-Q 2006",
    "textAfterTable": "or       o   TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934       For the transition period from                                            to                                              ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}