{
    "relation": [
        [
            "Hive",
            "Key",
            "Value Name",
            "Type",
            "Value"
        ],
        [
            "HKEY_LOCAL_MACHINE",
            "\\System\\CurrentControlSet\\Services\\LanManServers\\Paremeters",
            "EnableSecuritySignature",
            "REG_DWORD",
            "1"
        ]
    ],
    "pageTitle": "Designing and Planning Windows NT External Security",
    "title": "",
    "url": "https://technet.microsoft.com/en-us/library/cc767895(d=printer).aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00265-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 886440319,
    "recordOffset": 886383205,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{100429=06/20/97 12:00AM, 101512=09/05/97 12:00AM, 101360=08/08/97 12:00AM, 192527=Content management can be configured to replicate content through firewalls by allowing outgoing communication over TCP port 507. The source and destination IP addresses will be known in advance as well. The only issue may be that the source TCP port is randomly selected, though most firewalls permit source port numbers over 1024 without restrictions., 102120=11/20/97 12:00AM, 100095=05/28/97 12:00AM, 107186=Word document properties recognize both 1900 and 2000 as valid centuries and support years of four digits., 102882=12/12/97 12:00AM, 106888=Enhancements for the year 2000, including:, 92353=In order to protect existing customer investments, Windows RAS and routing-based VPN solutions provide a smooth migration path from an existing PPTP infrastructure to a platform based on L2TP, IPSEC, and EAP. Windows 2000 will support client/server PPTP and L2TP based VPNs running over IPSEC, as well as server-server tunnels based on PPTP, L2TP, and IPSEC., 107300=The DHCP administrator program supports the years between 2000-2009 with a minimum of two digits., 101037=07/15/97 12:00AM, 101663=11/01/97 12:00AM, 102271=11/24/97 12:00AM, 109113=The financial institution installed Windows NT Server to C:\\MSWNT, not the default directory, to provide a layer of security against Trojan horse attacks that assume the default C:\\WINNT directory., 103193=01/12/98 06:29PM, 201730=Microsoft TechNet May 1999 Volume 7, Issue 5, 168088=A known limitation of WSH is that it currently can administer IIS only. This will be overcome in Windows 2000, which exposes the administration of all operating system facets through the scripting functionality. In Windows NT 4, however, WSH cannot capture Windows NT configuration information, so you must incorporate other methods with it to create a complete recovery process. Tools available for this are described below., 83903=PPTP and the Point-to-Point Protocol (PPP) are supported by the Windows NT 4.0 and Office 2000 Remote Access Service/dial-up networking clients and by Windows 9x dial-up networking (built into Windows 98; Windows 95 requires an upgrade). PPTP uses the Internet as an infrastructure to connect clients or remote networks to a main corporate network. With Remote Access Service (RAS), users have direct dial-up, circuit-based access to a corporate network. With PPTP connection, users first establish direct dial-up, circuit-based connection to an Internet Service Provider (ISP) then use an encrypted \"tunnel\" over the Internet that connects to a corporate PPTP server. Figure 4 shows a PPTP RAS connection:, 103649=07/07/98 08:00PM, 100580=06/25/97 12:00AM, 102427=12/11/97 12:00AM, 101208=08/07/97 12:00AM, 103038=x01/09/98 08:23PM, 100730=07/11/97 12:00AM, 72359=The source port is typically randomly selected from the pool of unassigned ports and typically will be greater than 1024 (as this is presumed to be the last defined port)., 137818=Shut down and restart the computer running Windows NT Server. For more information see Knowledge Base article 161990, Title: How to Enable Strong Password Functionality in Windows NT., 201485=161990, Title: How to Enable Strong Password Functionality in Windows NT, 87736=PPTP sends data using IP GRE packets (IP protocol 47) and controls the tunnel using a TCP connection to port 1723. To filter PPTP packets through a firewall, you must make these changes:, 100292=142047, 154984, 154985, 167629, 169461, 104035=Installing and testing all these post SP3 hotfixes is costly and time consuming. The better approach is to install Windows NT Service Pack 4, which contains all the SP3 fixes plus the latest year 2000 updates and support for the Euro currency. SP4 is the best solution from a security perspective. For a complete list of the SP4 fixes, see the release notes or Appendix A. Some of the important ones are:, 184743=Creates a centralized standards-based LDAP directory that can be integrated or migrated to future LDAP infrastructures such as Windows 2000., 101969=11/18/97 12:00AM, 103495=02/12/98 06:24PM, 103344=02/11/98 05:10PM, 54063=Users must maintain the confidentiality of user accounts and passwords. Users must not use the same passwords for accessing external (Web) and internal (corporate) systems because user accounts and passwords are transmitted over external services, such as the Internet, in clear text and easily intercepted. Strong passwords are required on the external DMZ. For more information see Knowledge Base article 161990, Title: How to Enable Strong Password Functionality in Windows NT., 106938=The User Manager and User Manager for Domains recognize the year 2000 as a leap year., 100246=06/09/97 12:00AM, 88213=Configure the firewall to allow traffic sent to or from TCP port 1723. This is the PPTP control channel for configuring and managing the tunnel between the client and the tunnel server. The packet filter should include the address of the tunnel server. That is, out-bound traffic with port 1723 as the source port or the destination port should be allowed only from the tunnel server, and in-bound traffic with port 1723 as the source port or the destination port should be allowed only to the tunnel server. This is not necessary, but it enhances firewall security., 91991=As a result, IPSEC largely complements, but does not overlap, the functionality provided by PPTP and L2TP. This makes it attractive to combine the flexibility of Layer 2 VPN protocols (PPTP/L2TP) with the security provided by IPSEC. Microsoft will support such a \"merged VPN\" platform (PPTP or L2TP running over IPSEC) in Windows 2000., 100881=07/14/97 12:00AM, 101558=171295}",
    "textBeforeTable": "Designing and Planning Windows NT External Security TechNet Archive Other Microsoft Products and Technologies Windows Server Windows Azure Pack for Windows Server Windows System Center SQL Server Solutions Guidance for IT Professionals Security Guidance and Updates Scripting with Windows PowerShell Online Services Office Products",
    "textAfterTable": "Corporate Security Position What proper security policies, procedures, and technologies are needed to protect your organization from inadvertent or intentional damage or loss of data. Creating a Security Policy Outlines a general security policy that applies to access, management, and hosting within the network environment. Creating a Security Policy Document How to establish standards in a thorough security policy, using an example based on an MCS engagement. Securing the External DMZ—Firewall and Router Security Discusses how to secure your DMZ—the area in which your servers are typically placed to provide the best security. Securing a Windows NT Internet Information Server Provides guidelines for creating a hacker-resistant Windows NT Web server environment. Testing and Evaluating the Current Security Level Outlines a series of possible solutions to handle archiving and retrieval of changes that occur when new Web sites and applications are installed on Web servers. Validation Options Describes three ways that MCS client accounts have provided secure access to their users: Basic security and Secure Sockets Layer (SSL), Windows NT challenge-response, and a Lightweight Directory Access Protocol (LDAP)-based directory architecture. How Some Sample Accounts Use Their DMZ Examines",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}