{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "very intwined with the students and respectful",
            "bowling club chess club math club",
            "open minded ,smart ,willing to learn",
            "I just like chilling in the libary reading books cooling.",
            "You get every thing you pay for in henry ford they pride themselves on educating the mind",
            "Its alot of of fun activities like kickboxing classes",
            "It has a great cafe affordable with great menu",
            "No dorm",
            "Talk to your academic counselor they are the main help and they are good at what they do .",
            "Henry Ford community college is a very diverse school.They have great teachers and its a great ominous .Henry ford community college also has great class sizes."
        ]
    ],
    "pageTitle": "Henry Ford Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Henry-Ford-Community-College/reviews?_escaped_fragment_=/show/57223",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00212-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 918357627,
    "recordOffset": 918319246,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{111374=I love it. I've only gone there for two semesters over a year ago but I love the teachers. I'm currently enrolling in the Fall 2012 semester to finish my degree, 131046=Henry Ford is an excellent school with helpful and knowledgeable teachers. I have enjoyed the last 3 years I have spent there and look forward to the next 2 years I will spend in the nursing program. I expect to graduate with my RN in December 2013., 196382=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/15/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has not been to campus. 2 out of 3 people found this review useful. 1 of 52 Julonia from Farmington Hills, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); });",
    "textAfterTable": "Manage your time wisely Tips for prospective students Make the best of your education. In three sentences HFCC is overall a great school to attend. The professors are very helpful when it comes to getting the information you need as a student. I would say that HFCC is one of the best community colleges in Michigan. Login to rate or flag the reviews Jasmine from Detroit, MI 05/29/2012 Reviewer is A past student here. 2 out of 2 people found this review useful. 3 of 52 Categories Comments Campus Safety The campus is pretty safe and well lit. If something is going on or seems suspicious, the school will alert students. Also, campus safety will walk you to your car if you want them to. Great for these types of students Henry Ford has a lot of programs. It's a great school for: -Nursing & Other Health Related Careers -Computer Information",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}