{
    "relation": [
        [
            "Citing Patent",
            "US6683124",
            "US6743835 *",
            "US6794007",
            "US6946181",
            "US7175362",
            "US7198427",
            "US7300689",
            "US7806625",
            "US7901154",
            "US7901753",
            "US8740141",
            "US20040146352 *",
            "US20050031803 *"
        ],
        [
            "Filing date",
            "Sep 27, 2001",
            "Dec 5, 2001",
            "Mar 23, 2001",
            "Sep 5, 2001",
            "May 27, 2003",
            "Jul 18, 2003",
            "Oct 11, 2004",
            "Feb 12, 2007",
            "Jul 16, 2007",
            "Nov 12, 2004",
            "Oct 23, 2007",
            "Jul 18, 2003",
            "Oct 11, 2004"
        ],
        [
            "Publication date",
            "Jan 27, 2004",
            "Jun 1, 2004",
            "Sep 21, 2004",
            "Sep 20, 2005",
            "Feb 13, 2007",
            "Apr 3, 2007",
            "Nov 27, 2007",
            "Oct 5, 2010",
            "Mar 8, 2011",
            "Mar 8, 2011",
            "Jun 3, 2014",
            "Jul 29, 2004",
            "Feb 10, 2005"
        ],
        [
            "Applicant",
            "Clariant Finance (Bvi) Limited",
            "Goldschmidt Ag",
            "Patrick J. Carr",
            "Fieldturf Inc.",
            "Avturf L.L.C.",
            "Avturf L.L.C.",
            "Fieldturf Tarkett Inc.",
            "Avturf, L.L.C.",
            "Avturf L.L.C.",
            "Avturf L.L.C.",
            "Tarkett Inc.",
            "Carr Patrick J",
            "Fieldturf Inc."
        ],
        [
            "Title",
            "Fluorescent pigment compositions",
            "Preparation of nondusting free-flowing pigment concentrates",
            "Artificial turf airport marking safety system",
            "Artificial grass for landscaping",
            "Synthetic covering systems for safety areas of airports",
            "Method of operating a safety system for airports and airfields",
            "Artificial grass for landscaping",
            "Infilless and/or fuel absorbing synthetic covering system for safety areas of airports",
            "Arrester bed system and method for airports and airfields",
            "Synthetic runway surface system",
            "Aircraft arrestor system and method of decelerating an aircraft",
            "Method of operating a safety system for airports and airfields",
            "Artificial grass for landscaping"
        ]
    ],
    "pageTitle": "Patent US5439968 - Fluorescent pigment concentrates - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5439968?dq=7222078",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00329-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473984975,
    "recordOffset": 473967323,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29929=One hundred grams of fluorescent green pigment (Day-Glo S-16 orange) was added to the molten polyethylene wax and mixed thoroughly for five minutes using a Cowles mixer at 1800 rpm. After mixing, the molten composition was poured from the beaker onto a cool flat surface and cooled to room temperature. The resulting blend was examined visually for phase separation and compatibility. Compositions which appeared to be compatible were further let down into extrusion grade polypropylene (MFR 12, 0.90 density) at a let-down ratio of 24-parts polypropylene to 1-part pigment master batch and then extruded into 2-mil thick film. The resulting film was examined and rated for pigment dispersion., 13160=This is a continuation of application Ser. No. 07/790,917 filed on Nov. 13, 1991, now abandoned., 13648=Fluorescent pigments or daylight fluorescent pigments have been produced commercially since the late 1940's for use in paints, printing inks, and plastics. US patent literature from 1938 forward describes the preparation and use of various fluorescent pigments. Patton, in his Pigment Handbook, (Volume 1, pp 891-903) describes the chemistry, the production, the properties, the major uses, and some of the limitations of fluorescent pigments. An early advancement in the use of fluorescent colorants for plastics is described in U.S. Pat. No. 2,119,189 in which Widmer taught the use of a resinous molecule as a carrier or suitable medium for fluorescent dyes. Later, Switzer, Kazenas, and others utilized extremely friable organic glass-like compounds as carriers for fluorescent dyes. These glass-like compounds included modified sulphonamide resins, ureamelamines, glyceryl phthalates, polyesters, polyamides, vinyl resins, and silica gels.}",
    "textBeforeTable": "Patent Citations The invention has been described in detail with Particular reference to Preferred embodiments thereof, but it will be understood that variations and modifications can be effected within the spirit and scope of the invention.  TABLE 2__________________________________________________________________________Polypropylene Film Blends* Parts by Wt.Materials 1 6 8 9 10 11 12__________________________________________________________________________Example 1 Concentrate 1Example 6 Concentrate 1Example 8 Concentrate 1Example 9 Concentrate 1Example 10 Concentrate 1Example 11 Concentrate 1Example 12 Concentrate 1Polypropylene 24 24 24 24 24 24 24(12 MFR 0.91 density)Film PropertiesPigment Dispersion Poor Poor Fair Exc Exc Exc ExcPlate Out Severe Severe Severe None None None None__________________________________________________________________________ *Films prepared using DayGlo NX15 fluorescent pigment.  TABLE 1______________________________________Compatibilities of Low Molecular WeightPolyolefins with Fluorescent Pigments* Compatibility Polyolefin/Pigment Ratio, (4:1) S-16 Z-18 NX-15Polyolefin Pigment Pigment Pigment______________________________________Ex. 1 Epolene C-10 Wax I I IEx. 2 Epolene E-14 Wax I I IEx. 3 ECO (2.2% CO) I I IEx. 4 ECO (9% CO) I I IEx. 5 ECO (14% CO) I I IEx. 6 ECO (21% CO) I I IEx. 7 ECO (31% CO) I I IEx. 8 Epolene C-16 Wax C C CEx. 9 Epolene L-630-130 Wax C C CEx. 10 Epolone E-43 Wax C C CEx. 11 P-1689-002 Crystalline PP C C CEx. 12 P-1824-004 Amorphous PP C C C______________________________________ *Day-Glo S16 Orange, Z18 Signal Green, NX15 Orange, all based on polyamid or modified polyamide carrier resins. Selected compositions from",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6683124 Sep 27, 2001 Jan 27, 2004 Clariant Finance (Bvi) Limited Fluorescent pigment compositions US6743835 * Dec 5, 2001 Jun 1, 2004 Goldschmidt Ag Preparation of nondusting free-flowing pigment concentrates US6794007 Mar 23, 2001 Sep 21, 2004 Patrick J. Carr Artificial turf airport marking safety system US6946181 Sep 5, 2001 Sep 20, 2005 Fieldturf Inc. Artificial grass for landscaping US7175362 May 27, 2003 Feb 13, 2007 Avturf L.L.C. Synthetic covering systems for safety areas of airports US7198427 Jul 18, 2003 Apr 3, 2007 Avturf L.L.C. Method of operating a safety system for airports and airfields US7300689 Oct 11, 2004 Nov 27, 2007 Fieldturf Tarkett Inc. Artificial grass for landscaping",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}