{
    "relation": [
        [
            "Date",
            "Jun 26, 1997",
            "Jun 26, 1997",
            "Jun 1, 2001",
            "Jul 6, 2005",
            "Dec 21, 2005",
            "Feb 14, 2006"
        ],
        [
            "Code",
            "SULP",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Surcharge for late payment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20051221"
        ]
    ],
    "pageTitle": "Patent US5271383 - Method for reducing intussusception - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5271383?dq=6702462",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00061-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470420143,
    "recordOffset": 470401524,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although the invention has been described in terms of particular embodiments and applications, one of ordinary skill in the art, in light of this teaching, can generate additional embodiments and modifications without departing from the spirit of or exceeding the scope of the claimed invention. Accordingly, it is to be understood that the drawings and descriptions herein are profferred by way of example to facilitate comprehension of the invention and should not be construed to limit the scope thereof. Tensioning cables 166 and 168 inside endoscopic insertion member 122 are selectively placed under tension to control the direction in which the distal end portion of endoscopic insertion member 122 is turned. Instead of inflating balloon 136 via biopsy channel 142, inflation may be accomplished via an auxiliary channel 140 (FIG. 4A) provided in endoscopic insertion member 122. Balloon 136, as well as other balloons described herein, is effective to displace at least some fecal matter from the distal end of endoscopic insertion member 122 to form a transparent pocket or space, thereby facilitating visual inspection of an intussusscepted intestinal section SIS. Upon an inflation of balloon 136 to a sufficient size, rod 144 may be retracted back into channel 142. As illustrated in FIG. 4C, headpiece or flange 146 deforms to function as a one-way valve, preventing an untimely contraction of balloon 136. To deflate balloon 136, rod is pushed partially out of channel 142. Upon",
    "textAfterTable": "Citing Patent Filing date Publication date Applicant Title US5458612 * Jan 6, 1994 Oct 17, 1995 Origin Medsystems, Inc. Prostatic ablation method and apparatus for perineal approach US5792118 * Dec 12, 1996 Aug 11, 1998 Kurth; Paul A. Permanent catheter with an exterior balloon valve and method of using the same US6953431 Apr 4, 2003 Oct 11, 2005 University Of South Florida Eccentric dilation balloons for use with endoscopes US6979290 May 29, 2003 Dec 27, 2005 The Board Of Trustees Of The Leland Stanford Junior University Apparatus and methods for coronary sinus access US7833156 Apr 24, 2007 Nov 16, 2010 Transenterix, Inc. Procedural cannula and support system for surgical procedures US7993350 May 9, 2007 Aug 9, 2011 Medtronic, Inc. Shapeable or steerable guide sheaths and methods for making and using them US8016748 Nov 8, 2005 Sep 13, 2011 The Board Of Trustees Of The",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}