{
    "relation": [
        [
            "Date",
            "07-28-15",
            "07-07-15",
            "04-30-15",
            "03-20-15",
            "02-25-14",
            "04-08-13",
            "11-25-11",
            "02-03-12",
            ""
        ],
        [
            "Site Name",
            "Rabbit's Reviews",
            "Honest Porn Reviews",
            "Mr. Porn",
            "The PaySites",
            "Dino Reviews",
            "Porn Adept",
            "FreeOnes",
            "Nude Reviews",
            "Average Score:"
        ],
        [
            "Score",
            "79 of 100",
            "8.6 of 10",
            "76 of 100",
            "83.1 of 100",
            "77 of 100",
            "86 of 100",
            "7.3 of 10",
            "73 of 100",
            "79.1"
        ]
    ],
    "pageTitle": "Club Filly - the review from thebestporn.com",
    "title": "",
    "url": "http://www.thebestporn.com/review/clubfilly/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 72,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00150-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 737589379,
    "recordOffset": 737575726,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{43668=Pic Dimensions (HQ):  Downloadable = 1600 x 1200 Archives = 800 x 600, 39656=  May be Non-Exclusive DVD Studio Content. Essentially this is DVD studio content that an possibly be found on other Internet video sites or by buying the actual DVD. Essentially this is a collection of videos from Filly Films Studio., 42417=Exclusive Info:  Advertised: Exclusive My Opinion: May not be 100% exclusive, but original Filly Films content.}",
    "textBeforeTable": "Scores from other online adult review sites. Outside Reviews View All: User Reviews & Comments (1) \"This site isn't secure so be cautious when joining\" 09-06-13 (2 Replies) Comment Title / Date Comments (1) Submit : Add Review | Add Comment None so far. Recent Reviews (0) Register to submit your reviews and comments. 0 Ratings: 1 Comments: 0 Reviews:",
    "textAfterTable": "Outside Review dates and scores are submitted to us directly by the approved review site periodically. We have limited control over the scores displayed. Contact Us - FAQ's - Glossary - Announcements - Privacy Policy - Porn Reviews - Webmasters DISCLAIMER: ALL MODELS APPEARING ON THIS WEBSITE ARE 18 YEARS OR OLDER. Protecting Minors We are strong supporters of RTA and ICRA, two of the most recognized self labeling organizations. Our site is properly labeled to assist in the protection of minors accessing inappopriate content. For information about filtering tools, check this site. To report child pornography, go directly to ASACP!  We're proud to be a corporate sponsor. Have concerns or questions about porn addiction?  We recommend this helpful resource. Copyright © 2003-2007 Ranks.com, Inc. and its licensors. All Rights Reserved. Last",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}