{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "many organization, clubs and sports",
            "has to 2-3 different places to obtain food and drinks",
            "Did not dorm",
            "Heard good comments about the professors form students",
            "Apply early so you may get scholarships",
            "The campus is good. its in the city so everything is available"
        ]
    ],
    "pageTitle": "LIU Brooklyn - Long Island University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/LIU-Brooklyn-Long-Island-University/reviews?_escaped_fragment_=/show/42200",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00295-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909388339,
    "recordOffset": 909335725,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{209155=The Long Island University-Brooklyn Campus is a HUGE beautiful campus. The staff and students give a very welcoming feel. The campus offers so much I can not wait until September 4th !, 139636=I am currently an undergraduate student at Long Island University. I am please with the studies that I'm conducting here at LIU. For spring 2013 I will change my major from Business Management to Finance. I believe this is a good change for my class major., 264862=© 2015, Cappex.com, LLC, 67272=Preferred you don't get the 2000 dollar meal plan and just buy food, unless you have no choice but to take it., 14117=I think this school is great for students with money but has no interest in really putting there all into college. ! May seem harsh but that is what it seems like to me.}",
    "textBeforeTable": "06/09/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 13 out of 15 people found this review useful. 1 of 72 Keshia from Manchester, CT Check out reviews left by other students or leave your own review. You could win a free scholarship. LIU Brooklyn - Long Island University Reviews LIU Brooklyn - Long Island University › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var",
    "textAfterTable": "Tips for prospective students Attend the Live Chats that the Global College hosts throughout the year so you can get all of your questions answered by students. Or email current students, find them on Facebook, etc. Also, you can request more information by contacting Global College staff on the website, Facebook and by email. Website: http://www.brooklyn.liu.edu/globalcollege/ Twitter: http://twitter.com/#!/globalcollege Facebook: http://www.facebook.com/GlobalCollege Bang for the buck The school costs about $40,000 a year but there are a lot of opportunities for scholarships. I got a scholarship for about $12,000 and then more scholarships later in the year as a reward for getting good grades. Also, there are student leadership positions and scholarships that you can apply for. Did enjoy being here Being in a different country was a really great decision for me! I have always wanted to travel and with the Global College, you get to not only be immersed in another culture, you get to travel around and go on field trips! Also, the class size is pretty small (ranging from about 20-40) so you get to know the other students and the teachers very well and become like family. In the first year of the program, students live with host families and then have the option to get an apartment. Many people stay long-time friends with",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}