{
    "relation": [
        [
            "Date",
            "Jul 31, 1998",
            "Oct 10, 2000",
            "Aug 16, 2004",
            "Oct 21, 2004",
            "Oct 21, 2004",
            "Jun 16, 2008",
            "Dec 5, 2008",
            "Jan 27, 2009"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "SULP",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Surcharge for late payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: INTELLA INTERVENTIONAL CORPORATION, CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:GANDHI, DEEPAK R.;HILLSMAN, CECILY M.;HEGDE, ANANT V.;AND OTHERS;REEL/FRAME:009388/0785 Effective date: 19980724",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "",
            "Effective date: 20081205"
        ]
    ],
    "pageTitle": "Patent US6156053 - Dual catheter assembly - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6156053?dq=5,664,133",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044271733.81/warc/CC-MAIN-20150728004431-00011-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 465698415,
    "recordOffset": 465677178,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{52553=Referring back to FIG. 4, proximal end 54 of elongate tubular member 52 is attached to manifold 80. Optionally, elongate tubular member 52 may include strain relief 81 along its portion which spans the vicinity immediately both inside and outside of manifold 80. Although any suitable manifold may be used with the dual catheter assembly, a manifold that allows any combination of the plurality of balloons to be independently inflated and/or deflated is generally preferred. This type of manifold is disclosed by U.S. Ser. No. 09/014,532 filed Jan. 28, 1998 entitled \"MULTIPLE VALVE SINGLE PORT MANIFOLD\" by inventors Thomas Michael Bourne, Anant Hegde, and Harm TenHoff which is incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations Although the dual catheter assembly and its method of use has been described with reference to particular embodiments, it should be understood that various features of the preferred embodiments may be used in any suitable combination. For example, a preferred device feature may be entirely eliminated such as coiled floppy tip 20 by replacing it with an extension of shaft 12. Similarly, even an especially preferred feature like a stent mounted on the second catheter may be entirely eliminated from the dual catheter assembly. In some situations, it may be desirable to mix the stated preferences between the first and second catheters. For example, a stent may be placed on a balloon on the first catheter instead of a second catheter. In another example, first catheter may be a multiple lumen balloon catheter having a manifold similar to that described for second catheter 50 instead of fitting 28. Accordingly, although the present invention has been described with reference to preferred embodiments, it should be appreciated that these embodiments are for purposes of illustration only and are not intended to limit the scope of the appended claims. If pre-assembly is not desired, the catheters which comprise the dual catheter assembly may be put together in situ. For example, first catheter 10 is introduced into the occluded vessel to pre-dilate the stenosis. Once this completed, fitting 28 is removed and a guidewire extension is attached (if necessary) so",
    "textAfterTable": "Extendable balloon-on-a-wire catheter, system and treatment procedure US5364347 * Jul 30, 1993 Nov 15, 1994 Cardiovascular Imaging Systems, Inc. Catheter system having a balloon angioplasty device disposed over a work element lumen and method of use US5484412 * Apr 19, 1994 Jan 16, 1996 Pierpont; Brien E. Angioplasty method and means for performing angioplasty US5501668 * Apr 19, 1994 Mar 26, 1996 Boston Scientific Corporation Angioplasty balloon catheter and adaptor US5505699 * Mar 24, 1994 Apr 9, 1996 Schneider (Usa) Inc. Angioplasty device US5725535 * Sep 20, 1996 Mar 10, 1998 Hegde; Anant V. Multiple balloon stent delivery catheter and method US5846246 * Feb 1, 1996 Dec 8, 1998 Cordis Corporation Dual-balloon rapid-exchange stent delivery catheter with guidewire channel EP0213748A1 * Jul 30, 1986 Mar 11, 1987 Advanced Cardiovascular Systems, Inc.",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}