{
    "relation": [
        [
            "Date",
            "Feb 8, 1999",
            "Dec 23, 1999",
            "Aug 30, 2000",
            "Jun 22, 2006",
            "Jun 22, 2010",
            "Oct 28, 2011",
            "Mar 5, 2014",
            "Jun 24, 2014",
            "Feb 9, 2015"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: NORTHERN TELECOM LIMITED, CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:BAKER, STEVEN F.;REEL/FRAME:009999/0932 Effective date: 19981130",
            "",
            "Owner name: NORTEL NETWORKS LIMITED,CANADA Free format text: CHANGE OF NAME;ASSIGNOR:NORTEL NETWORKS CORPORATION;REEL/FRAME:011195/0706 Effective date: 20000830",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: ROCKSTAR BIDCO, LP, NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:NORTEL NETWORKS LIMITED;REEL/FRAME:027164/0356 Effective date: 20110729",
            "Owner name: ROCKSTAR CONSORTIUM US LP, TEXAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ROCKSTAR BIDCO, LP;REEL/FRAME:032389/0800 Effective date: 20120509",
            "Year of fee payment: 12",
            "Owner name: RPX CLEARINGHOUSE LLC, CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ROCKSTAR CONSORTIUM US LP;ROCKSTAR CONSORTIUM LLC;BOCKSTAR TECHNOLOGIES LLC;AND OTHERS;REEL/FRAME:034924/0779 Effective date: 20150128"
        ]
    ],
    "pageTitle": "Patent US6505046 - Method and apparatus for distributing location-based messages in a wireless ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6505046?dq=7555727",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043058631.99/warc/CC-MAIN-20150728002418-00185-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486596188,
    "recordOffset": 486560342,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20606=This application claims the benefit of U.S. Provisional Application No. 60/066,653, filed Nov. 19, 1997.}",
    "textBeforeTable": "Patent Citations In summary, the network and process of the present invention provides the ability to process a mobility origination, derive the subscriber's location from this trigger, and construct the set of all coupons or message associated with that location, for that subscriber, at that time. These messages are then delivered to the subscriber on their handset for their selection or deletion. The WSN can also be configured to further filter the information sent to the handset by giving the subscriber selectable options through an interactive voice response menu. The user can respond to requests by pressing a particular key or speaking a particular word or words. After the announcement or interactive voice response is complete, the WSN disconnects the voice connection and begins sending the short message coupons incrementally. When the call arrives, a voice connection between the WSN and the subscriber handset is set-up. At this point, the WSN plays a specific announcement such as “Welcome to Dirty Creek Mall. We will shortly download 3 coupons to your handset.” The message flow begins with the subscriber dialing the pre-defined telephone number. The mobile then generates the origination message to the MSC/HLR. The message flow requires that the original voice call be routed back to the WSN as part of the origination request. In this case, the mobile origination response includes a temporary logical dialed number that causes the MSC to route the call to the WSN.",
    "textAfterTable": "US6731940 * Apr 28, 2000 May 4, 2004 Trafficmaster Usa, Inc. Methods of using wireless geolocation to customize content and delivery of information to wireless communication devices US6738808 Jun 30, 2000 May 18, 2004 Bell South Intellectual Property Corporation Anonymous location service for wireless networks US6755342 * Dec 31, 2001 Jun 29, 2004 Bellsouth Intellectual Property Corporation Credit card validation for an interactive wireless network US6819919 Oct 18, 2000 Nov 16, 2004 Telcontar Method for providing matching and introduction services to proximate mobile users and service providers US6836477 * Dec 23, 1999 Dec 28, 2004 Tekelec Methods and systems for routing messages in a communications network US6836667 * Sep 19, 2000 Dec 28, 2004 Lucent Technologies Inc. Method and apparatus for a wireless telecommunication system that provides location-based messages US6847823 * Dec 20, 2000 Jan 25, 2005 Nokia Corporation",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}