{
    "relation": [
        [
            "Date",
            "Dec 17, 1992",
            "Mar 16, 1993",
            "Jul 30, 1996",
            "Mar 26, 1997",
            "Apr 17, 2001",
            "Sep 23, 2001",
            "Nov 27, 2001"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: COMMAND (U.S) INC., KENTUCKY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:VBM CORPORATION;REEL/FRAME:006359/0655 Effective date: 19921109",
            "Year of fee payment: 4",
            "Owner name: OXYTECH, INC., INDIANA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:COMMAND (U.S.) INC.;REEL/FRAME:008048/0754 Effective date: 19960627",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20010926"
        ]
    ],
    "pageTitle": "Patent US4869733 - Super-enriched oxygen generator - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4869733?dq=6076065",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044271733.81/warc/CC-MAIN-20150728004431-00261-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475392195,
    "recordOffset": 475370858,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26428=This application is a continuation of application Ser. No. 031,541, filed March 30, 1987 now abandoned which, in turn is a continuation-in-part of application Ser. No. 865,869, filed May 22, 1986, now U.S. Pat. No. 4,673,415., 26757=This application is a continuation of U.S. patent application Ser. No. 865,869, filed May 22, 1986.}",
    "textBeforeTable": "Patent Citations The invention has been described with reference to the preferred embodiments. Obviously, modifications and alterations will occur to others upon reading and understanding the preceeding detailed description. It is intended that the invention be construed as including all such modifications and alterations insofar as they come within the scope of the appended claims or the equivalents thereof. In the illustrated embodiment, the substantially pure oxygen is received in an enriched oxygen pressure increasing means 90'. Periodically, a second control valve 98' introduces compressed air from the reservoir 32' into a pressurizing fluid receiving region 96' to pump the enriched oxygen into an oxygen storage reservoir 100'. Check valves 132 and 134 ensure unidirectional flow toward storage 104' and downstream equipment 114. A control means 120' causes a control valve 86 to allow the pressurized oxygen/argon mixture to pass into a second bed 80' of the second physical separation material for a preselected duration. A restrictor valve 130 allows a small fraction of gas to escape from the second bed through the secondary gas outlet 22. After the preselected duration, the control means 120' causes the inlet-outlet valve 86 to interconnect the second bed with downstream equipment 90', 100' and 114 through check valves 132 and 134. Because the oxygen is adsorbed while the argon and nitrogen pass therethrough, gas disproportionately rich in argon and nitrogen passes through the restrictor valve 130 rendering gas remaining in bed",
    "textAfterTable": "US4013429 * Jun 4, 1975 Mar 22, 1977 Air Products And Chemicals, Inc. Fractionation of air by adsorption US4190424 * Dec 28, 1977 Feb 26, 1980 Boc Limited Gas separation US4194890 * Feb 1, 1978 Mar 25, 1980 Greene & Kellogg, Inc. Pressure swing adsorption process and system for gas separation US4239509 * May 30, 1979 Dec 16, 1980 Air Products And Chemicals, Inc. Method of purifying crude argon US4264340 * Feb 28, 1979 Apr 28, 1981 Air Products And Chemicals, Inc. Vacuum swing adsorption for air fractionation US4386945 * Feb 1, 1982 Jun 7, 1983 Litton Systems, Inc. Process and compound bed means for evolving a first component enriched gas US4477265 * Aug 5, 1982 Oct 16, 1984 Air Products And Chemicals, Inc. Argon purification US4519813",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}