{
    "relation": [
        [
            "Cited Patent",
            "US4224125 *",
            "US4897173 *",
            "US5264103 *",
            "US5496453 *",
            "US5540828 *",
            "US5575895 *",
            "US5582697 *",
            "US5695947 *",
            "US5906921 *",
            "US5922188 *",
            "US5985116 *",
            "US6059946 *",
            "US6104940 *",
            "JPH02310457A",
            "JPH05340915A",
            "JPH06109693A",
            "JPH08320304A",
            "JPH09101280A"
        ],
        [
            "Filing date",
            "26 Sep 1978",
            "19 Jun 1986",
            "15 Oct 1992",
            "12 Oct 1994",
            "15 Feb 1994",
            "30 May 1995",
            "20 Apr 1995",
            "6 Jun 1995",
            "24 Sep 1998",
            "7 Mar 1997",
            "12 Dec 1997",
            "13 Apr 1998",
            "4 Jun 1999",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Publication date",
            "23 Sep 1980",
            "30 Jan 1990",
            "23 Nov 1993",
            "5 Mar 1996",
            "30 Jul 1996",
            "19 Nov 1996",
            "10 Dec 1996",
            "9 Dec 1997",
            "25 May 1999",
            "13 Jul 1999",
            "16 Nov 1999",
            "9 May 2000",
            "15 Aug 2000",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Applicant",
            "Matsushita Electric Industrial Co., Ltd.",
            "Matsushita Electric Industrial Co., Ltd.",
            "Matsushita Electric Industrial Co., Ltd.",
            "Kyoto Daiichi Kagaku Co., Ltd.",
            "Yacynych; Alexander",
            "Matsushita Electric Industrial Co., Ltd.",
            "Matsushita Electric Industrial Co., Ltd.",
            "Biomedix, Inc.",
            "Matsushita Electric Industrial Co., Ltd.",
            "Matsushita Electric Industrial Co., Ltd.",
            "Matsushita Electric Industrial Co., Ltd.",
            "Matsushita Electric Industrial Co., Ltd.",
            "Matsushita Electric Industrial Co., Ltd.",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Title",
            "Enzyme electrode",
            "Biosensor and method for making the same",
            "Biosensor and a method for measuring a concentration of a substrate in a sample",
            "Biosensor and method of quantitative analysis using the same",
            "Method for making electrochemical sensors and biosensors having a polymer modified surface",
            "Biosensor and method for producing the same",
            "Biosensor, and a method and a device for quantifying a substrate in a sample liquid using the same",
            "Amperometric cholesterol biosensor",
            "Biosensor and method for quantitative measurement of a substrate using the same",
            "Biosensor and method for quantitating biochemical substrate using the same",
            "Biosensor",
            "Biosensor",
            "Electrode probe and body fluid examination equipment including the same",
            "Title not available",
            "Title not available",
            "Title not available",
            "Title not available",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US6212417 - Biosensor - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US6212417?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 456640727,
    "recordOffset": 456619492,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although the present invention has been described in terms of the presently preferred embodiments, it is to be understood that such disclosure is not to be interpreted as limiting. Various alterations and modifications will no doubt become apparent to those skilled in the art to which the present invention pertains, after having read the above disclosure. Accordingly, it is intended that the appended claims be interpreted as covering all alterations and modifications as fall within the true spirit and scope of the invention. As discussed above, the present invention can provide a highly reliable biosensor which can eliminate adverse influences of any substance other than the substrate in a sample. As noted above, the current across the counter and the third electrodes 4 and 7 reflects the concentration of the existing ascorbic acid and oxygen. Therefore, their concentration can be determined from this current value. A correction of the result of measurement by the concentration of the ascorbic acid and oxygen yields a precise glucose concentration from which the influence of these substances has been excluded. Then, 25 seconds after detection of supply of the sample solution, a potential of 500 mV was applied onto the working electrode 2 using the third electrode 7 as reference, and the current flowing between the counter electrode 4 and the working electrode 2 was measured after 5 seconds. After measurement of the current across the two electrodes 2 seconds",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6885196 17 Jul 2001 26 Apr 2005 Matsushita Electric Industrial Co., Ltd. Biosensor US6892085 * 26 Nov 2002 10 May 2005 Medtronic Minimed, Inc. Glucose sensor package system US7050843 28 Oct 2004 23 May 2006 Lifescan, Inc. Electrically-conductive patterns for monitoring the filling of medical devices US7070680 4 Oct 2002 4 Jul 2006 Infopia Co., Ltd. Biosensor US7276146 4 Oct 2002 2 Oct 2007 Roche Diagnostics Operations, Inc. Electrodes, methods, apparatuses comprising micro-electrode arrays US7276147 5 Mar 2003 2 Oct 2007 Roche Diagnostics Operations, Inc. Method for determining the concentration of an analyte in a liquid sample using small volume samples and fast test times US7341846 16 Jun 2003 11 Mar 2008 Arkray, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}