{
    "relation": [
        [
            "Date",
            "Aug 24, 1998",
            "Jul 15, 2003",
            "Jul 13, 2007",
            "May 12, 2011",
            "Jul 21, 2011"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: ATI TECHNOLOGIES, INC., CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:GRIGOR, GORDON F.;GIEMBOREK, VLADIMIR;HABERFELLNER, JOHN;REEL/FRAME:009511/0175;SIGNING DATES FROM 19980715 TO 19980721",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: ATI TECHNOLOGIES ULC, CANADA Effective date: 20061025 Free format text: CHANGE OF NAME;ASSIGNOR:ATI TECHNOLOGIES INC.;REEL/FRAME:026270/0027",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6023281 - Method and apparatus for memory allocation - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6023281?dq=5,241,671",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043058631.99/warc/CC-MAIN-20150728002418-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480076967,
    "recordOffset": 480052130,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The foregoing discussion has described a method and apparatus for allocating memory in a multi-processor environment that uses memory resources efficiently while allowing for memory mapping conventions that require contiguous blocks of memory. By sharing memory resources, the processors in the system are able to increase the flexibility of their individual memory mapping options while using less memory than would be required if the memory resources were not shared. Thus, increased flexibility is achieved at a reduced cost. It will be appreciated that those of ordinary skill in the art will be able to devise various arrangements which, although not explicitly described or shown herein, embody the principles of the invention and are thus within its spirit and scope. For example, additional fixed memory sets can be included in the memory structures to support additional processors with fixed limitations. Similarly, additional flexible address sets can be interspersed throughout the memory space, allowing each of the address sets to increase it memory allocation to a degree limited by the proximity of its closest address-set neighbors. Additional locations in the memory 101 may be used to store data that supports the graphics processing but requires no more than a fixed amount of memory. These fixed allocations 102 and 108 are stored in blocks outside of the memory area that is reserved for graphics data whose storage requirements may fluctuate. It may be preferable to store these blocks adjacent",
    "textAfterTable": "Continuously sliding window method and apparatus for sharing single-ported memory banks between two agents US6269431 Aug 13, 1998 Jul 31, 2001 Emc Corporation Virtual storage and block level direct access of secondary storage for recovery of backup data US6295575 * Jun 29, 1998 Sep 25, 2001 Emc Corporation Configuring vectors of logical storage units for data storage partitioning and sharing US6353878 Aug 13, 1998 Mar 5, 2002 Emc Corporation Remote control of backup media in a secondary storage subsystem through access to a primary storage subsystem US6421711 Jun 29, 1998 Jul 16, 2002 Emc Corporation Virtual ports for data transferring of a data storage system US6438595 Jun 24, 1998 Aug 20, 2002 Emc Corporation Load balancing using directory services in a data processing system US6600493 * Feb 14, 2000 Jul 29, 2003 Intel Corporation Allocating memory based on memory device organization US6711595 * May 9, 2000 Mar 23, 2004",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}