{
    "relation": [
        [
            "Date",
            "Sep 8, 2003",
            "Jan 12, 2004",
            "Nov 11, 2004",
            "Jan 18, 2006",
            "Feb 24, 2011",
            "Jun 2, 2011",
            "Feb 25, 2015"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: KIRUSA, INC., NEW JERSEY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MATHUR, ROHITASHVA;REEL/FRAME:014483/0243 Effective date: 20030908",
            "Owner name: KIRUSA, INC., NEW JERSEY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:SARASWAT, VIJAY ANAND;UPPALADADIUM, VIJAYABALAJI PRASANNA;VAIDYA, SHIRISH;REEL/FRAME:014870/0578;SIGNING DATES FROM 20030916 TO 20031012",
            "",
            "Owner name: KIRUSA INC.,NEW JERSEY Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:INNOVACOM 4;REEL/FRAME:017029/0011 Effective date: 20051209",
            "Year of fee payment: 4",
            "Owner name: WALOOMBA TECH LTD., L.L.C., DELAWARE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:KIRUSA INC.;REEL/FRAME:026378/0115 Effective date: 20110201",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US20040104938 - System and method for multi-modal browsing with integrated update feature - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20040104938?dq=5,815,794",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044271733.81/warc/CC-MAIN-20150728004431-00039-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 485248835,
    "recordOffset": 485217662,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26250=[0001] This application claims the benefit of U.S. Provisional Application No. 60/409,448, entitled “System and method for Multi-Modal Browsing with Integrated Update Feature,” filed Sep. 9, 2002., 55964=[0043] At this point, it should be noted that the placing of a voice call to the number identified by _K_PHONE provides sufficient information to synchronize a voice browser to an equivalent point in the navigation that has been reached by the visual browser. In a preferred embodiment of the invention, multi-modal platform 116 inserts the number(s) to call into the visual content, and knows where in the content the number(s) have been inserted. Thus, the fact that a call has been placed by a particular wireless telephone 102 to a particular telephone number provides sufficient information to deduce the point on the visual page to which the user has navigated. For example, suppose a voice call is initiated to the telephone number 555-1234, and multi-modal platform knows that this number is called only from a link contained on card #5 (e.g., card 205 in FIG. 2). Thus, the calling of this number indicates that the user has reached card #5. Moreover, multi-modal platform can determine the card from which the mode swap was initiated by using at least one different telephone number on each card. Thus, multi-modal platform has the opportunity to synchronize voice browser 119 to the state that had been reached by the visual browser, by using the information that is implied by the calling of a particular telephone number. (It should be noted that the name “update card” refers to the fact that it enables multi-modal platform 116 to “update” the state of one browser to the state of another.)}",
    "textBeforeTable": "Patent Citations [0061] It is noted that the foregoing examples have been provided merely for the purpose of explanation and are in no way to be construed as limiting of the present invention. While the invention has been described with reference to various embodiments, it is understood that the words which have been used herein are words of description and illustration, rather than words of limitations. Further, although the invention has been described herein with reference to particular means, materials and embodiments, the invention is not intended to be limited to the particulars disclosed herein; rather, the invention extends to all functionally equivalent structures, methods and uses, such as are within the scope of the appended claims. Those skilled in the art, having the benefit of the teachings of this specification, may effect numerous modifications thereto and changes may be made without departing from the scope and spirit of the invention in its aspects. </wml> </card> </p> Update text. <p> </do> <prev/> <do type=“options” label=“Back”> </do> <go href=“page2.jsp”/> <do type=“accept” label=“Update”> <timer value=“$(clock)”/>",
    "textAfterTable": "Apr 11, 2006 International Business Machines Corporation Systems and methods for implementing modular DOM (Document Object Model)-based multi-modal browsers US7032169 * May 22, 2002 Apr 18, 2006 International Business Machines Corporation Method and system for distributed coordination of multiple modalities of computer-user interaction US7050905 * Feb 16, 2001 May 23, 2006 Nokia Corporation Navigation system with updating segments US7062491 * Oct 22, 2001 Jun 13, 2006 Pocketthis, Inc. Data synchronization mechanism for information browsing systems US7146407 * Oct 22, 2001 Dec 5, 2006 Pocketthis, Inc. Data synchronization mechanism for information browsing systems US20010047258 * Mar 16, 2001 Nov 29, 2001 Anthony Rodrigo Method and system of configuring a speech recognition system US20020001295 * Mar 8, 2001 Jan 3, 2002 Woo-Kyeong Park System and method for providing wireless application protocol service through internet US20020156864",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}