{
    "relation": [
        [
            "Date",
            "Aug 16, 1990",
            "Jun 6, 1991",
            "Jun 9, 1993",
            "Oct 18, 1996",
            "Oct 18, 1996",
            "Nov 12, 1996",
            "Sep 18, 2000",
            "Dec 20, 2002",
            "Jun 25, 2003",
            "Nov 11, 2003",
            "Sep 16, 2004"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "SULP",
            "FPAY",
            "REMI",
            "FPAY",
            "AS",
            "AS",
            "RF",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Surcharge for late payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Reissue application filed",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: AHLSTROM SCREEN PLATES INC., NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:FREJBORG, FREY A.;HALONEN, LASSI J.;REEL/FRAME:005420/0526 Effective date: 19900815",
            "Owner name: A. AHLSTROM CORPORATION, A CORPORATION OF FINLAND, Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:AHLSTROM SCEEN PLATES INC., A NY CORP.;REEL/FRAME:005719/0217 Effective date: 19910528",
            "Owner name: AHLSTROM PUMPS INC., NEW YORK Free format text: MERGER;ASSIGNOR:AHLSTROM SCREEN PLATES INC.;REEL/FRAME:006576/0241 Effective date: 19911223 Owner name: AHLSTROM PROCESS EQUIPMENT INC., NEW YORK Free format text: CHANGE OF NAME;ASSIGNOR:AHLSTROM PUMPS INC.;REEL/FRAME:006576/0231 Effective date: 19911101 Owner name: CAE SCREENPLATES INC., NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:AHLSTROM PROCESS EQUIPMENT INC.;REEL/FRAME:006576/0246 Effective date: 19930524",
            "",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20030912",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US5200072 - Screen plates and methods of manufacture - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5200072?dq=7222078",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00251-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472574575,
    "recordOffset": 472550058,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{66548=A comparison of the performance characteristics of a conventional screen cylinder is made below with respect to low and high consistency screen cylinders of the embodiments illustrated in FIGS. 1-4 and 5-8, respectively, in each of two different cylinder configurations. In the first Table A1, each cylinder has a height and diameter of 1042.8 mm and 1066.88 mm, respectively, a slot width of 0.5 mm and a slot pitch of 3.2 mm (i.e., a centerline-to-centerline distance of 3.2 mm).}",
    "textBeforeTable": "Patent Citations While the invention has been described in connection with what is presently considered to be the most practical and preferred embodiment, it is to be understood that the invention is not to be limited to the disclosed embodiment, but on the contrary, is intended to cover various modifications and equivalent arrangements included within the spirit and scope of the appended claims. It will be appreciated that, by the foregoing described method, fabrication costs and times are substantially reduced in comparison with the prior methods previously described. Additionally, this method enables approximately 20% to 80% greater effective screen area than afforded by screen plates manufactured by previous methods, while simultaneously affording increased strength. The capability of replacing only the screening plate portion of the screen cylinder whereby screen cylinder replacement costs is also afforded, together with the foregoing noted advantages. Thus, the deformation of the present cylinders is much less than in the conventional cylinders and is considerably less in the high strength cylinder of FIGS. 5-8 which is used preferably for screening high consistency pulp. The overall strength of both embodiments of cylinders hereof is therefore substantially increased in comparison with a conventionally formed cylinder of the same size with identical slot width and pitch.  TABLE B______________________________________Deformation (mm) Conventional FIGS. 1-4 FIGS. 4-8______________________________________Radial 0.340 0.200 (59%) 0.006 (2%)Tangential 3.23 0.10 (3%) 0.06 (2%)______________________________________ The following Table B represents a comparison of",
    "textAfterTable": "US5727316 * Dec 9, 1994 Mar 17, 1998 Cae Screenplates Inc. Method of manufacturing a screen cylinder and a screen cylinder produced by the method US5799798 * Aug 23, 1996 Sep 1, 1998 Chen; Chao-Ho Screen cylinder for screening high consistency pulp US5849188 * May 23, 1997 Dec 15, 1998 Baker Hughes Incorporated Wire mesh filter US5980745 * Dec 8, 1998 Nov 9, 1999 Baker Hughes Incorporated Wire mesh filter US6354373 Nov 25, 1998 Mar 12, 2002 Schlumberger Technology Corporation Expandable tubing for a well bore hole and method of expanding US6425486 Jan 29, 1999 Jul 30, 2002 Gl& V Sweden Ab Cylindrical screen and a method of manufacturing it US6460757 Nov 14, 2000 Oct 8, 2002 Newscreen As Apparatus and method for forming slotted wire screens US6491168 Apr 23, 2000 Dec 10, 2002",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}