{
    "relation": [
        [
            "Date",
            "Aug 13, 2001",
            "Nov 1, 2001",
            "May 8, 2003",
            "May 18, 2011",
            "May 20, 2015"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: D.S.P.C. TECHNOLOGIES LTD., ISRAEL Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:OFIR, EDLIS;RONI, SHOEV;REEL/FRAME:012081/0884;SIGNING DATES FROM 20010711 TO 20010718",
            "Owner name: D.S.P.C. TECHNOLOGIES LTD., ISRAEL Free format text: CHANGE OF ADDRESS;ASSIGNOR:D.S.P.C. TECHNOLOGIES LTD.;REEL/FRAME:012252/0590 Effective date: 20011031",
            "Owner name: INTEL CORPORATION, CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:D.S.P.C. TECHNOLOGIES LTD.;REEL/FRAME:014264/0838 Effective date: 20030403",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US7301987 - Background processing and searching for a communication channel - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7301987?dq=6181294",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043058631.99/warc/CC-MAIN-20150728002418-00099-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474669375,
    "recordOffset": 474644547,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It will be appreciated by persons skilled in the art that the present invention is not limited by what has been particularly shown and described herein above. Rather the scope of the invention is defined by the claims that follow: . Thus the present invention reduces power consumption, reduces the wake period and increases the sleep period 14 in slotted mode. FIG. 4 ). The shortened wake period is shown in the shaded areas of FIG. 5 ). It is noted that the second time period may be separate from or at least partially overlap the first time period. The procedure continues with checking if the mobile station is in step with the currently detected PN offset (step 122 hereinabove). Power remains on for analog and digital processing, but since the processing is done at a fast rate, even that power is lowered to the sleep level before the total time normally needed to perform the three processes of reception (step 136 in FIG. 5 The portion 75 of the CDMA signal is then processed off line during a second time period (step 134 in ). FIG. 5 ) along with the RF and analog receiver may be turned on. During the period in which the searching process looks for neighboring stations, the rake receiver and search engine 70 way be turned off, since there is",
    "textAfterTable": "US5627882 May 26, 1994 May 6, 1997 U.S. Philips Corporation Enhanced power saving method for hand-held communications system and a hand-held communications system therefor US5677928 * Nov 18, 1991 Oct 14, 1997 Mcdonnell Douglas Corp. Spread spectrum communication system US5678227 Jul 29, 1994 Oct 14, 1997 Motorola, Inc. Apparatus and method for minimizing the turn on time for a receiver operating in a discontinuous receive mode US5708971 Mar 13, 1995 Jan 13, 1998 Ericsson Inc. Two-way paging system and apparatus US5737322 Apr 27, 1995 Apr 7, 1998 U.S. Philips Corporation Selective call system and a secondary station for use therein US5740517 Nov 24, 1995 Apr 14, 1998 Nec Corporation Radio pager sync acquisition timing arrangement for battery saving operation US5754583 May 6, 1996 May 19, 1998 Motorola, Inc. Communication device and method for determining finger lock status in a radio receiver US5758266 Sep 30, 1994 May 26,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}