{
    "relation": [
        [
            "Date",
            "Oct 19, 2000",
            "May 23, 2006",
            "Mar 2, 2007",
            "Nov 10, 2010",
            "Nov 30, 2010",
            "Mar 2, 2011",
            "Nov 1, 2013",
            "Apr 10, 2015"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "REMI"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Maintenance fee reminder mailed"
        ],
        [
            "Description",
            "Owner name: ENTERASYS NETWORKS, INC., NEW HAMPSHIRE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:CABLETRON SYSTEMS, INC.;REEL/FRAME:011219/0376 Effective date: 20000929",
            "Owner name: OBSIDIAN, LLC, CALIFORNIA Free format text: SECURITY AGREEMENT;ASSIGNOR:ENTERASYS NETWORKS, INC.;REEL/FRAME:017656/0552 Effective date: 20060516 Owner name: WELLS FARGO FOOTHILL, INC., CALIFORNIA Free format text: SECURITY AGREEMENT;ASSIGNOR:ENTERASYS NETWORKS, INC.;REEL/FRAME:017656/0552 Effective date: 20060516",
            "Year of fee payment: 4",
            "Owner name: WELLS FARGO TRUST CORPORATION LIMITED, AS SECURITY Free format text: GRANT OF SECURITY INTEREST IN U.S. PATENTS;ASSIGNOR:ENTERASYS NETWORKS INC.;REEL/FRAME:025339/0875 Effective date: 20101109",
            "Owner name: ENTERASYS NETWORKS, INC., MASSACHUSETTS Free format text: RELEASE AND REASSIGNMENT OF PATENTS AND PATENT APPLICATIONS AT REEL/FRAME NO. 17656/0552;ASSIGNORS:WELLS FARGO CAPITAL FINANCE, INC. (FORMERLY KNOWN AS WELLS FARGO FOOTHILL, INC.);ENTERPRISE COMMUNICATIONS FUNDING GMBH, AS SUCCESSOR IN INTEREST TO OBSIDIAN, LLC;REEL/FRAME:025406/0769 Effective date: 20101110",
            "Year of fee payment: 8",
            "Owner name: ENTERASYS NETWORKS INC., MASSACHUSETTS Free format text: TERMINATION AND RELEASE OF SECURITY INTEREST IN PATENTS AT REEL/FRAME NO. 25339/0875;ASSIGNOR:WELLSFARGO TRUST CORPORATION LIMITED;REEL/FRAME:031558/0677 Effective date: 20131031",
            ""
        ]
    ],
    "pageTitle": "Patent US6615271 - Traffic control system having distributed rate calculation and link flow control - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6615271?dq=4200770",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043058631.99/warc/CC-MAIN-20150728002418-00230-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475019783,
    "recordOffset": 474983891,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{85463=Turning now to FIG. 13, there is shown the data fields for a control cell for end-to-end flow control with the addition of a field 1310 containing an identifier of the virtual circuit. The control cell data fields for pure end-to-end flow control are given in FIG. 9, and so the corresponding fields in FIG. 13 are labelled accordingly. In FIG. 13 and in FIG. 9, field 900 contains the stamped transmission rate. In FIG. 13 and FIG. 9, field 905 contains the value of the u_bit., 89199=At block 1714 process 1520 dequeues a data cell from FIFO buffer 1530 and transmits the data cell to the downstream node. The process then goes to block 1720., 109709=the SUM is taken over all virtual circuits passing through the outgoing link so that the expression R(i)/SUM R(j) is the fraction of total rates passing through the outgoing link; and M(dynamic) is the total dynamic memory 2214 allocated for virtual circuits passing through the outgoing link., 78546=After transmission of burst 1010 the source station waits for a time interval indicated as IPG 1012. IPG is an acronym derived from Inter Packet Gap. After time period IPG 1012, a next burst 1020 is transmitted by the source station. After a waiting time period IPG 1022 the next burst 1030 is transmitted by the source station, and so on., 114098=The virtual buffer VBA stored in field 1206 of the of the Switch Credit Table 1102 is computed by the expression:, 90320=At block 1724 process 1520 decrements the value of CB, the credit balance stored in field 1224 of Switch Credit Table 1102. The process 1520 then returns along path 1726 to decision block 1710. At decision block 1710, the process again enters the loop of path 1712 where it tests the value of CB until it once again finds the value of CB to be greater than zero, 0., 94001=At block 1814 the value of variable CR is calculated as the number of cells transmitted to the downstream node NTx, where the value of NTx is stored in field 1220 of Switch Credit Table 1102, plus the number of virtual buffers VBA assigned to that virtual circuit. The number of cells transmitted NTx is a long running counter. Also the number of cells received by a node, NRx, stored in field 1222 is a long running counter. For example, both counters NRx and NTx may have been initialized when the switch was booted up and put into service. For example, both counters NRx and NTx may have very large absolute values, such as hundreds of millions of cells, but their difference is a small number. However, the difference, which is important, is the number of cells received by a downstream node and the number of cells transmitted by an upstream node, as will be made clear with reference to the following discussion of the credit receive process 1512 with reference to FIG. 19. Their difference, plus a number of virtual buffers VBA to be discussed hereinbelow, is the number of cells that FIFO queue 1530 has enough buffers to store, for the particular virtual circuit. Process 1512 then proceeds to block 1816., 91528=Before continuing with a discussion of block 1814, we turn to FIG. 18B to more clearly explain the transfer of a credit balance from a downstream node to an upstream node. As shown in FIG. 18B, switch “i” 18B01 is the upstream switch. Switch “i+1” 18B02 is the downstream switch. Link 18B10 transmits data cells from switch “i” 18B01 to switch “i+1” 18B02. Data cells in flight from switch “i” to switch “i+1” are shown by lines 18B12, 18B14, 18B16, . . . etc., 93334=When switch “i” receives a credit balance CR(i) from the downstream switch, CR(i) is also an absolute number, as calculated in block 1814 by the expression:, 112407=A fixed amount of memory M(fixed) 2314 must be allocated to accommodate “feasible” source rates, and to accommodate clock skew., 85996=Turning now to FIG. 14, there is shown a field diagram of the data in a credit cell. Field 1410 contains a value of the credit variable CR. Field 1420 contains the identifier for the virtual circuit, represented by the symbol VC_id. The header of a credit cell may, for example, not contain an identifier for the virtual circuit under consideration. Accordingly, the virtual circuit is identified by the contents of VC_id field 1420., 85210=Field 1242 contains the value of the “local counter”, and is represented by the symbol n. The value of n is initialized to 0. The value of n is the number of data cells transmitted since the last credit cell was sent upstream., 87410=Turning now to FIG. 16, data receive process 1510 is shown. Upon receipt of a data cell from an upstream node, the process 1510 enters block 1610. The process 1510 then enters block 1612 where the value of NRx is incremented, where NRx is the total number of data cells received from an upstream link on the virtual circuit. The process then goes to block 1614., 88604=Turning now to FIG. 17, there is shown Data Transmit Process 1520. At decision block 1710 the process 1520 tests the credit balance CB, where the value of the credit balance CB is stored in field 1224 of Switch Credit Table 1102. In the event that the value of CB is not greater than zero, 0, the process branches through path 1712 to repeat the loop on decision block 1710. In the event that the test in decision block 1710 finds the credit balance CB to be greater than zero, 0, the process goes to block 1714., 82211=Field 1204 contains the Actual Buffer Allocation, represented by BA. The Actual Buffer Allocation is the memory allocation for a given virtual circuit. The value of BA is initialized to N2. The value of N2 is stored in field 1226., 83547=Field 1208 contains the buffer used value, BU. BU is the actual number of cells queued for the virtual circuit. The value of BU is initialized to 0., 88197=At block 1616 process 1510 increments the value of BU, the count of buffers used and is stored in field 1208 of Switch Credit Table 1102. The process then goes to block 1620., 84129=Field 1222 contains the total number of data cells received from the upstream node, and is represented by the symbol NRx. The value of NRx is initialized to 0., 89964=At block 1723, process 1520 increments the value of counter NTx, where NTx keeps count of the total number of cells transmitted on the virtual circuit to the downstream link. The value of counter NTx is stored in field 1220 of Switch Credit Table 1102. Process 1520 then proceeds to block 1724., 81827=Turning now to FIG. 12, there is illustrated a number of data fields data maintained in data field 1106 of Switch Credit Table 1102. Field 1202 contains the Recorded Rate, represented by R. The Recorded rate is the last seen stamped rate seen in an end-to-end control packet as shown in FIG. 13 hereinbelow. The value of R is initialized to 0., 87116=Each of the four processes 1510, 1512, 1520, and 1522 are asynchronous in their operation. That is, the processes exchange necessary information, each process runs when it has work to do, and each process halts after it has accomplished its task., 97298=Upstream node 2012 transmits data cells to middle node 2010 along data path 2020 In return middle node 2010 transmits credit cells of FIG. 9 to upstream node 2012 along credit path 2022. The credit balance held by middle node 2010 must depend upon, among other parameters: the number of data cells transmitted from upstream node 2012 to middle node 2010, which data cells occupy buffers in middle node 2010; and also, on the draining of buffers in middle node 2010, and these buffers in middle node 2010 are drained by transmission of data cells from middle node 2010 to downstream node 2014 along data path 2030. Middle node 2010 receives a credit cell from downstream node 2014 along credit path 2040. The number of credits in middle node 2010 determines the rate at which middle node 2010 can transmit data cells along data path 2030., 112561=An amount of memory must be allocated for overbooking, where overbooking means permitting the source stations to transmit at rates in excess of the calculated “feasible” rates computed by the end-to-end flow control. Overbooking is possible because the discretization of the transmission rates, coupled with rounding down computed rates to the lower discrete rate, leads to underutilization of the network capacity. Also, transient effects such as virtual circuits not occupying all of their assigned feasible transmission rates, leads to underutilization of the network capacity, etc. The amount of overbooking memory M(overbooking) 2316 allocated is computed by the expression:, 89405=At block 1720 the process decrements the value of BU, the number of buffers used, which value is stored in field 1208 of Switch Credit Table 1102. The process then goes to block 1722., 96911=Turning now to FIG. 20, there is shown an interaction between three nodes implementing a credit based flow control method. The middle node 2010 is a switch. Upstream node 2012 and downstream node 2014 may either be a switch or a station. Upstream node 2012 may be a source station. Downstream node 2014 may be a destination station., 111867=Turning now to FIG. 23, there is shown memory allocation for a network implementing the SECOND EXEMPLARY EMBODIMENT. Total memory 2310 is allocated for virtual circuit buffers. M(Min) 2312 is allocated as in the same way as in the first exemplary embodiment, and is calculated by the expression:, 95479=At block 1818 the value of local counter n is set to zero, 0, and the result stored in field 1242 of Switch Credit Table 1102. Upon completing the task of block 1818, process 1512 then returns along path 1820 to decision block 1810, where it again begins looping to test the value of n against the value of N2., 84315=Field 1224 contains the Credit Balance, represented by the symbol CB. The Credit Balance CB is the number of credits available for the switch to forward cells to the downstream node. The value of CB is initialized to N2., 93933=as shown in block 1912 of FIG. 19., 98923=Turning now to FIG. 21, previous FIG. 8 is reproduced, with the addition of block 2110. Accordingly, FIG. 21 shows the steps of rate control information process in the switch, when hop-by-hop flow control is implemented along with the end-to-end rate control. At block 2110 the process sets the value of R, the latest recorded transmission rate for the virtual circuit and stored in field 1202 of switch Credit Table 1102, to the value of PSR. The value of PSR is read from the end-to-end control cell field 900 as shown in FIG. 9. Each virtual circuit transmits an end-to-end control cell of FIG. 9 during each time period T, and so the value of R stored in field 1202 of Switch Credit Table 1102 is updated once each time period T. The process then proceeds to block 2112 where the process is done., 110029=The amount of virtual buffer allocated VBA 1206 stored in Switch Credit Table 1102 is computed by the expression:, 22898=This application is a continuation application of prior application Ser. No.: 08/845,336 filed Apr. 25, 1997 which issued on Oct. 19, 1999 as U.S. Pat. No. 5,968,128, which was a divisional of Ser. No. 08/276,291 filed Jul. 18, 1994 and which issued as U.S. Pat. No. 5,734,825 on Mar. 31, 1998., 87833=At block 1614 the process 1510 transfers the data cell to queue 1530. Queue 1530 is a first in first out, FIFO, queue. FIFO queue 1530 is drained by data transmit process 1520, as will be described in more detail with reference to FIG. 17. The process 1510 then goes to block 1616., 81503=Turning now to FIG. 11, there is illustrated a Switch Credit Table 1102. Each active virtual circuit passing through the switch has a virtual circuit indicator, and the virtual circuit indicator is entered into field 1104. Each virtual circuit has data maintained in data field 1106., 84970=Field 1240 contains the bandwidth of the outgoing link, represented by the symbol Bw., 86727=Data transmit process 1520 transmits data cells to the downstream node. Credit receive process 1522 receives credit cells from the downstream node. Queue 1530 holds data cells after they have been received by data receive process 1510 and before the data cell has been transmitted to the downstream node by data transmit process 1520., 88426=At block 1620 the process becomes quiet until another data cell is received by the switch, at which time the process begins again at block 1610., 79431=The “Average Rate” is expressed in bits per second. The interpacket gap IPG is expressed in seconds. The “Number of Burst Bits” is the number of bits transmitted by a source station during a burst such as burst 1010, 1020, 1030, . . . etc., 83217=Field 1206 contains the Virtual Buffer Allocation VBA. The virtual buffer memory allocation for a virtual circuit is to allow for memory to be used in overbooking. The value of VBA is initialized to the sum of BA and N2. The value of VBA is the same as BA in field 1204 if no overbooking is used., 84720=Field 1228 contains the Round Trip Time of the outgoing link, represented by the symbol RTT. This quantity must be set in response to the physical length of the outgoing link and the round trip delay of the downstream node., 83722=Field 1220 contains the Total number of data cells transmitted downstream, NTx. The value of NTx is initialized to 0. The NTx variable records the cumulative number of data cells forwarded downstream in the virtual circuit. The value of NTx is initialized at a major event such as boot up of the switch, and so records the number of data cells transmitted during a very long time., 114411=where as before, VBA(i) is the virtual buffer allocation for virtual circuit “i”, BA(i) is the buffer allocation computed above; RTT(link) is the outgoing link round trip time; and, R(i) is the recorded rate from field 1202 of Switch Credit Table 1102 for virtual circuit “i”., 98302=In view of FIG. 20, it is seen that all of the nodes and links of a complex network depend on the events that occur at other nodes. If a downstream node becomes faster for some reason, then its queues 1530 for each virtual circuit will empty out rapidly, and all upstream nodes will be able to transfer data packets more rapidly through the faster node. Conversely, if a downstream node has a failure and cannot transfer packets as rapidly as planned, all of the nodes of the network attempting to pass cells through the node having a failure will become backed up with full queues 1530., 90768=Turning now to FIG. 18A, credit transmit process 1512 is shown. At decision block 1810 the process loops on a test of whether or not the value of n is equal to or greater than N2, where n is stored in field 1242 of Switch Credit Table 1102, and N2 is stored in field 1226 of Switch Credit Table 1102. In the event that n is not equal to or greater than N2, the loop continues around path 1812. In the event that n is equal to or greater than N2, the process goes to block 1814. Decision block 1814 receives the updated value of n from block 1722 in FIG. 17, when n is incremented by the data transmit process 1520, as shown by arrow 1540 in FIG. 15., 86470=Turning now to FIG. 15, there are shown hop-by-hop flow control processes. The data receive process 1510, receives data cells from the upstream node. Credit transmit process 1512 transmits credit cells to the upstream node., 89636=At block 1722 the process 1520 increments the value of n, the local counter value stored in field 1242 of Switch Credit Table 1102. The value of n counts the number of data cells transmitted since the last credit cell was sent upstream. The process then goes to block 1723., 95858=Turning now to FIG. 19 there is shown credit receive process 1522. At block 1910 the processes recognizes that a credit cell has been received from a downstream node. The credit cell relates to the virtual circuit identified by field 1420 of the credit cell, as shown in FIG. 14. The credit cell receive process then goes to block 1912., 84562=Field 1226 contains the minimum buffer allocation N2. The value of N2 is discussed hereinabove with reference to field 1206., 95298=At block 1816, process 1512 transmits a credit cell, as shown in FIG. 14, to the upstream node. Process 1512 then goes to block 1818., 107744=Memory 2210 is broken into two parts, M(minimum) 2212 and M(dynamic) 2214. The minimum memory which must be allocated for buffers is given by N2 for each virtual circuit. Let the number of virtual circuits passing through the outgoing link be represented by K. Then the minimum memory which must be allocated is given by the expression:, 77397=In discussing hybrid flow control methods, it is first helpful to more closely examine a “feasible transmission rate” as determined by the methods of FIG. 1-FIG. 9. The feasible transmission rates for the source stations of a network are defined such that the sum of rates of all virtual circuits going through any link of the network does not exceed the capacity of that link, for all links of the network. Turning now to FIG. 10, there is shown a timing diagram 1002. The time axis 1004 is used to illustrate spacing of cells transmitted by a source station. A first burst of bytes 1010 is illustrated. The number of bytes in burst 1010 is determined by the number of cells transmitted in a back-to-back fashion by the source station. For example, if only one ATM cell is transmitted in burst 1010, then there will be 53 bytes transmitted, where each byte is 8 bits, for a total of 8*53 bits or 424 bits. As a further example, if N cells are transmitted during burst 1010, then the number of bits transmitted during the burst 1010 will N*8*53, or N times 424 bits., 96249=At block 1912 the credit balance is calculated, and is then stored in field 1224 of Switch Credit Table 1102. The value of CB is calculated as the value of variable CR as read from field 1410 of the credit cell, less the value of NTX of the upstream node. At block 1912, the number of cells transmitted by the upstream node NTx is subtracted from the credit received from the downstream node from block 1814. Process 1522 then goes to block 1914, where the process becomes quiet until another credit cell is received, at which time the process becomes active again at block 1910.}",
    "textBeforeTable": "Patent Citations While the invention has been described with reference to specific example embodiments, the description is not meant to be construed in a limiting sense. Various modifications of the disclosed embodiment, as well as other embodiments of the invention, will be apparent to person skilled in the art upon reference to this description. It is therefore contemplated that the appended claims will cover any such modifications or embodiments which fall within the true scope of the invention. Furthermore, when a source rate is adjusted to a higher rate, the source is not required to wait for two network round trip times as shown in box 630 of FIG. 6B, as required by the second exemplary embodiment. Thus, the sources may be more aggressive, and depend upon the hop-by-hop flow control to prevent overflowing of buffers at the downstream switches. In the third exemplary embodiment transient response to new source stations coming on line is better. The buffer allocations are the same as in the second exemplary embodiment. The third exemplary embodiment method is more aggressive, in that if a boundary switch can allocate credits to a newly starting source station, then the source station can start before the system assigns a feasible rate to the new source station. The new source station can then start transmitting before the feasible rate is assigned. The Third Exemplary Embodiment may be summarized as follows. Source stations are controlled by both:",
    "textAfterTable": "1 An algorithm for rate allocation in a packet-switching network with feedback by Anna Charny, Masters Thesis, Massachusetts Institute of Technology, May 1994. 2 Backward explicit congestion notification for ATM local area network by Newman, 1993 IEEE publication, pp. 719-723. 3 European Search Report, EP 95 30 4994, Oct. 19, 1995. Referenced by Citing Patent Filing date Publication date Applicant Title US7016301 * Sep 1, 1999 Mar 21, 2006 Cisco Technology, Inc. Fair multiplexing scheme for multiple input port router US7085846 * Dec 31, 2001 Aug 1, 2006 Maxxan Systems, Incorporated Buffer to buffer credit flow control for computer network US7145914 Dec 31, 2001 Dec 5, 2006 Maxxan Systems, Incorporated System and method for controlling data paths of a network processor subsystem US7242683 * Nov 4, 2002 Jul 10, 2007 Airbus France",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}