{
    "relation": [
        [
            "Date",
            "Dec 20, 1996",
            "Jun 21, 2001",
            "Jun 16, 2005",
            "Jul 20, 2009",
            "Jan 13, 2010",
            "Mar 2, 2010"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: NIDEC CORPORATION, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ICHIYAMA, YOSHIKAZU;REEL/FRAME:008368/0066 Effective date: 19961218",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20100113"
        ]
    ],
    "pageTitle": "Patent US5707154 - Hydrodynamic fluid pressure bearings - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5707154?dq=4740761",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00037-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481489611,
    "recordOffset": 481470452,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The terms and expressions which have been employed in the foregoing specification are used therein as terms of description and not limitation, and there is no intention in the use of such terms and expressions of excluding equivalents of the features shown and described or portions thereof, it being recognized that the scope of the invention is defined and limited only by the claims which follow. As has been described in the specification and shown in the drawings, the present invention employs an air interposition communicating through a communication means with the outside atmosphere in order to minimize the frictional loss of the lubricant and to prevent the lubricant from leaking out during a motor temperature increase. In case any of the two portions of the lubricant provided at opposite sides of the air interposition is decreased, the lubricant is supplemented by the other portion through a storage groove by capillary action. Accordingly, the lubricant requires no external replenishment and will stay for a relatively long period in the hydrodynamic bearing, thereby increasing the operating life of the motor. An alternative embodiment of the air passageway 40 is shown in FIG. 7. The air passageway 40 diametrically passes through the stationary shaft between the air interposition, but does not open at the location of the groove 32a (as denoted by the phantom lines). FIG. 6 shows an alternative embodiment of the present invention. In this embodiment,",
    "textAfterTable": "Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5885005 * Sep 18, 1996 Mar 23, 1999 Hitachi, Ltd. Bearing device and spindle motor provided with the bearing device US6034454 * Mar 25, 1999 Mar 7, 2000 Nidec Corporation Motor US6066903 * Mar 15, 1999 May 23, 2000 Nidec Corporation Hydrodynamic bearing for use in an electric motor and an electric motor having the hydrodynamic bearing US6069767 * Dec 19, 1997 May 30, 2000 Seagate Technology, Inc. Both ends open fluid dynamic bearing with multiple thrust plates US6071014 * Dec 30, 1998 Jun 6, 2000 International Business Machines Corporation Spindle motor with hybrid air/oil hydrodynamic bearing US6154339 * Apr 14, 1998",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}