{
    "relation": [
        [
            "Date",
            "9 Feb 1999",
            "3 Oct 2006",
            "9 May 2007",
            "4 Feb 2008",
            "11 Feb 2008",
            "18 Mar 2010",
            "17 Jun 2010",
            "3 Feb 2012"
        ],
        [
            "Code",
            "AS",
            "CC",
            "AS",
            "FPAY",
            "REMI",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: ACTISYSTEMS, INC., OKLAHOMA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:BROOKEY, TOMMY F.;REEL/FRAME:009770/0049 Effective date: 19990205",
            "",
            "Owner name: MASI TECHNOLOGIES, LLC, OKLAHOMA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ACTISYSTEMS, INC.;REEL/FRAME:019265/0255 Effective date: 20070426",
            "Year of fee payment: 4",
            "",
            "Owner name: M-I L.L.C.,TEXAS Free format text: SECURITY AGREEMENT;ASSIGNORS:ACTISYSTEMS, INC.;MASI TECHNOLOGIES, L.L.C.;REEL/FRAME:024103/0032 Effective date: 20061231",
            "Owner name: M-I L.L.C.,TEXAS Free format text: SECURITY AGREEMENT;ASSIGNORS:MASI TECHNOLOGIES, L.L.C.;APHTECH FLUIDS INC.;HITECH FLUID SYSTEMS LTD.;REEL/FRAME:024547/0688 Effective date: 20100412",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US6770601 - Aphron-containing aqueous well drilling and servicing fluids - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US6770601",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00242-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481934671,
    "recordOffset": 481893063,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{106642=D'Arrigo U.S. Pat. No. 4,684,479, incorporated herein by reference, discloses surfactant mixtures comprising (a) a member selected from the group consisting of glycerol monoesters of saturated carboxylic acids containing from about 10 to about 18 carbon atoms and aliphatic alcohols containing from about 10 to about 18 carbon atoms; (b) a sterol-aromatic acid ester; (c) a member selected from the group consisting of sterols, terpenes, bile acids and alkali metal salts of bile acids; (d) a member selected from the group consisting of sterol esters of aliphatic acids containing from 1 to about 18 carbon atoms; sterol esters of sugar acids; esters of sugar acids and aliphatic alcohols containing from about 10 to about 18 carbon atoms; esters of sugars and aliphatic acids containing from about 10 to about 18 carbon atoms; sugar acids; saponins; and sapogenins; and (e) a member selected from the group consisting of glycerol, glycerol di- or triesters of aliphatic acids containing from about 10 to about 18 carbon atoms and aliphatic alcohols containing from about 10 to about 18 carbon atoms; said components being present in said mixture in a weight ratio a:b:c:d:e of 2-4:0.5-1.5:0.5-1.5:0-1.5:0-1.5., 78435=The patent application is a continuation-in-part application of U.S. patent application Ser. No. 08/800,727 filed Feb. 13, 1997 now U.S. Pat. No. 5,881,826, and of P.C.T. International Application No. PCT/US98/02566 filed Feb. 10, 1998, to each of which priority is claimed herein., 87510=The book by Felix Sebba entitled “Foams and Biliquid Foams—Aphrons”, John Wiley & Sons, 1987, incorporated herein by reference, is an excellent source on the preparation and properties of aphrons, i.e., microbubbles. An aphron is made up of a core which is often spherical of an internal phase, usually gas, encapsulated in a thin shell. This shell contains surfactant molecules so positioned that they produce an effective barrier against coalescence with adjacent aphrons., 81551=Recent studies and field experience indicate that this LSRV is helpful in controlling the invasion of drilling fluids and filtrate by creating a high resistance to movement into the formation openings. Since the fluid moves at a very slow rate, viscosity becomes very high, and the drilling fluid is contained within the borehole with a very slight penetration. This has been beneficial in protecting the zones from damage as well as reducing differential sticking in these fluids. See for example the article entitled “Drill-In Fluids Improve High Angle Well Production”, Supplement to the Petroleum Engineer International, March, 1995., 95139=Means are known in the art to enhance the low shear rate viscosity of liquids. Thus aqueous systems can be viscosified with certain polymers which produce a fluid exhibiting a high yield stress, shear thinning behavior. Particularly useful are biopolymers produced by the action of bacteria, fungi, or other microorganisms on a suitable substrate. Exemplary biopolymers are the polysaccharides produced by the action of Xanthomonas compestris bacteria which are known as xanthan gums. These are available commercially from several sources including: Kelco Oil Field Group, Inc., under the trademarks “Xanvis” and “Kelzan”; Rhone-Poulenc Chimie Fine, under the trademark “Rhodopol 23-p”; Pfizer Inc., under the trademark “Flocon 4800C”; Shell International Chemical Company of London, U.K., under the trademark “Shellflo ZA”; and Drilling Specialties Company, under the trademark “Flowzan.” See for example U.S. Pat. No. 4,299,825 and U.S. Pat. No. 4,758,356, each incorporated herein by reference. Other biopolymers useful in the fluids of this invention are the so-called welan gums produced by fermentation with a microorganism of the genus Alcaligenes. See for example U.S. Pat. No. 4,342,866, incorporated herein by reference. Gellan gums are disclosed in U.S. Pat. No. 4,503,084, incorporated herein by reference. Schleroglucan polysaccharides produced by fungi of the genus sclerotium are disclosed in U.S. Pat. No. 3,301,848, incorporated herein by reference. Commercially available schleroglucan is sold under the trademarks “Polytran” from the Pillsbury Company and “Actigum CS-11” from CECA S. A. Succinoglycan polysaccharides are produced by cultivating a slime-forming species of Pseudomonas, Rhizobium, Alcaligenes or Agrobacterium, e.g., Pseudomonas sp. NCIB 11264, Pseudomonas sp. NCIB 11592 or Agrobacterium radiobacter NCIB 11883, or mutants thereof, as described in European Patent No. A40445 or A138255. Commercially available succinoglycan biopolymer is sold by Shell International Chemical Company of London, U.K., under the trademark “Shellflo-S”., 115010=Moreover, the aqueous base aphron-containing well drilling and servicing fluids set forth in co-pending U.S. patent applications Ser. No. 08/800,727 filed Feb. 13, 1997 now U.S. Pat. No. 5,881,826 and Ser. No. 09/121,713 filed Jul. 24, 1998 pending, as well as co-pending PCT patent application PCT/US98/02566 filed Feb. 10, 1998, can also be used in well servicing operations such as completion operations, workover operations, sand control operations, frac pack operations, and the like, including use of the fluids as spotting fluids to release pipes and tools stuck in the filter cake on the sides of a borehole by differential sticking., 97694=Miller et al. U.S. Pat. No. 4,707,281, incorporated herein by reference, discloses that an additive comprising high pyruvic xanthan containing about 5 to 9 percent by weight pyruvic acid and locust bean gum, wherein the weight ratio of the high pyruvate xanthan to locust bean gum is from about 40:60 to 80:20, increases the LSRV of aqueous drilling and completion fluids., 98086=Daigle U.S. Pat. No. 3,953,336 discloses that shear thinning drilling fluids having enhanced LSRV are prepared from an aqueous liquid, a polysaccharide such as xanthan gum, and a cellulose derivative, such as hydroxyethylcellulose (HEC), carboxymethylcellulose (CMC), or hydroxpropylcellulose (HPC), wherein the weight ratio of xanthan gum to cellulose derivative, preferably HEC, is from 80:20 to 20:80.}",
    "textBeforeTable": "Patent Citations An additional 0.5 g (0.5 ppb) of BLUE STREAK™ aphron-generating surfactant was added to the fluid of Example 3 and similarly evaluated. The data obtained are set forth in Table A. EXAMPLE 4 In 350 ml of fresh water were hydrated 3.0 g (3.0 ppb) of sodium alginate. Thereafter 1.0 g of a 30% by weight solution of calcium chloride was added to crosslink the polymer, followed by 0.5 g (0.5 ppb) of BLUE STREAK™ aphron-generating surfactant. The fluid was evaluated as in Example 1. The data are set forth in Table A. EXAMPLE 3 17.2 6.9 38 4440 168,000 4 11.2 7.4 53 4800 256,000 3 19.8 6.68 42 1460  61,000 2 16.0 7.01 87 1120  98,000 1 Vol. % ppg STI 100 rpm 0.5 rpm Example Aphrons Density Brookfield Viscosity, cp",
    "textAfterTable": "US3243000 23 Jun 1965 29 Mar 1966 Exxon Production Research Co Method and composition for drilling wells and similar boreholes US3246696 25 Oct 1963 19 Apr 1966 Pan American Petroleum Corp Method of freeing pipe stuck in a well US3251768 18 Jul 1962 17 May 1966 Exxon Production Research Co Drilling muds and similar fluids US3269468 20 Jul 1962 30 Aug 1966 Continental Oil Co Foaming agents for use in air drilling of wells US3301848 24 Oct 1963 31 Jan 1967 Pillsbury Co Polysaccharides and methods for production thereof US3313362 3 Feb 1965 11 Apr 1967 Air Drilling Specialties Co Method of and composition for use in, gas drilling US3328295 3 Dec 1964 27 Jun 1967 Pan American Petroleum Corp Method for preventing differential sticking and reducing fluid loss US3334052 30 Apr 1963 1 Aug 1967 Kurz Fredrik Wilhelm Anton Method of preparing a gel product",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}