{
    "relation": [
        [
            "Date",
            "11 Sep 1989",
            "11 Jul 1994",
            "27 Jan 1995",
            "13 Jul 1998",
            "1 Jul 2002"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: LEGGETT & PLATT, INCORPORATED, NO. 1 LEGGETT RD., Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:KAWASAKI, NOZOMU;SCOTT, TERENCE A.;REEL/FRAME:005140/0325;SIGNING DATES FROM 19881116 TO 19881121",
            "Year of fee payment: 4",
            "Owner name: L & P PROPERTY MANAGEMENT COMPANY, ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:LEGGETT & PLATT, INCORPORATED;REEL/FRAME:007312/0104 Effective date: 19911001",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US4986738 - Airflow control system pump and housing - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US4986738",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00317-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 489267823,
    "recordOffset": 489231064,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While we have described only a limited number of embodiments of our invention, persons skilled in this art will appreciate changes and modifications which may be made while still practicing this invention. Furthermore, the invention has been described as relative to a fluid bed, although certain aspects of the invention are applicable to other forms of body supports, including seating devices, vehicle seats and other forms of furniture. Therefore, we do not intend to be limited, except by the scope of the following appended claims: In actual practice, the pressure regulator S1 would differ in the embodiment of FIGS. 10 and 11 from the pressure regulators R1 and R3 of FIG. 7 in that the slotted adjustment screw 126 would be replaced by a more easily maneuverable adjusting knob (not shown) attached to the lower end of the screw. In all other respects, the regulator S1 would be identical to the pressure regulators R1 and R3. In order to establish pressure differences between the pressure supplied to each of the zones 41 -45 of the bed via the pressure regulators R5 -R8, the cross-sectional areas 301a of the chambers 301 of the regulators R5 -R8 differ between the regulators R5 -R8. Specifically, the area 301a of the pressure regulator R5 is 4/11 of the area 301a of regulator R7, the area 301a of the regulator R6 is 8/11 of the area 301a of regulator R7, and",
    "textAfterTable": "US4797962 * 5 Nov 1986 17 Jan 1989 Air Plus, Inc. Closed loop feedback air supply for air support beds US4810169 * 9 Jun 1987 7 Mar 1989 Kraenzle Josef Pump unit * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5193986 * 6 Jan 1992 16 Mar 1993 Grant Manufacturing Corporation Fluid pump US5201102 * 6 Aug 1991 13 Apr 1993 Mcclure Wilbur F Casket bed system US5277474 * 14 Aug 1991 11 Jan 1994 Medimatch Limited Cushion US5446933 * 8 Jul 1993 5 Sep 1995 Gabelhouse; Robert D. J. Bed with a plurality of vertically aligned body support members which communicate with a common fluid chamber US5509154",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}