{
    "relation": [
        [
            "Citing Patent",
            "US7897164 *",
            "US8048618",
            "US8715352 *",
            "US20080147191 *",
            "US20100042218 *",
            "US20100179659 *"
        ],
        [
            "Filing date",
            "Oct 30, 2008",
            "Jun 27, 2007",
            "Dec 14, 2006",
            "Dec 14, 2006",
            "",
            "Sep 27, 2007"
        ],
        [
            "Publication date",
            "Mar 1, 2011",
            "Nov 1, 2011",
            "May 6, 2014",
            "Jun 19, 2008",
            "Feb 18, 2010",
            "Jul 15, 2010"
        ],
        [
            "Applicant",
            "Warsaw Orthopedic, Inc",
            "The University Of Hong Kong",
            "Depuy Spine, Inc.",
            "Depuy Spine, Inc.",
            "Nebosky Paul S",
            "Wan-Ju Li"
        ],
        [
            "Title",
            "Compositions and methods for nucleus pulposus regeneration",
            "Method for preparing and preserving a natural allograft intervertebral disk for humans",
            "Buckling disc replacement",
            "Buckling disc replacement",
            "Orthopaedic implant with porous structural member",
            "Cell-nanofiber composite and cell-nanofiber-hydrogel composite amalgam based engineered intervertebral disc"
        ]
    ],
    "pageTitle": "Patent US6958078 - Bioartificial intervertebral disc - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6958078?dq=6985872",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00026-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 498929275,
    "recordOffset": 498906509,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38307=The donor nucleus pulposus cells are suspended within the carrier material, typically by gently mixing the cells into the carrier material until they are well dispersed therein. Depending on the intended use of the bioartificial nucleus pulposus, the nucleus pulposus cells can be any type of NP cells, such as donor cells from humans or animals. The concentration and number of cells in the carrier can vary depending on the type of cells and the desired properties of the bioartificial nucleus pulposus. The cells can be obtained for use in any suitable manner. For example, rabbit NP cells can be isolated by enzymatic digestion from the lumbar discs of euthanized rabbits. In one method, the cells are isolated with testicular hyaluronidase (1600 u/ml, 60 minutes) followed by collagenase (0.25 mg/ml) and Pronase E (0.1 mg/ml, 16 hours). After isolation, aliquots of the cells can be immediately frozen for long-term storage in liquid nitrogen using cell freezing media. Cells used for seeding the support structure can be cultured using standard tissue culture techniques in suitable media, such as in DMEM with 10% fetal bovine serum. The cells may be incubated for various lengths of time to determine their viability following the isolation., 28272=The bioartificial nucleus pulposus of the invention includes an artificial support structure or scaffold. If the bioartificial nucleus pulposus is intended as a total replacement for a natural nucleus pulposus, the support structure is generally disc-shaped. The support structure has a plurality of pores. Preferably, the pores have an average diameter within a range of from about 100 microns to about 1000 microns, and more preferably from about 300 microns to about 600 microns. The pore size, porosity, and surface area (surface-to-volume ratio) of the support structure affect its properties. Typically, the support structure is an open pore sponge-like structure. The support structure is made from a biodegradable material. The biodegradable material degrades as a new nucleus pulposus is formed in the spine, eventually leaving nothing foreign to the body. Any of a wide variety of biodegradable materials can be used, such as a biodegradable polymer or a combination of biodegradable polymers. Preferably, the biodegradable material is a biodegradable polymer such as poly(lactide-co-glycolide) (PLGA) or poly(lactide) (PLLA). The bioartificial nucleus pulposus should have physical properties and strength similar to the natural nucleus pulposus that it replaces. In some embodiments, the support structure has a strength of at least about 80 kPa, and more preferably at least about 100 kPa. The strength can be measured by any suitable means, such as by using a mechanical testing system (MTS). A relatively strong support structure will be able to bear some of the load from the spine while the nucleus pulposus cells grow.}",
    "textBeforeTable": "Patent Citations In accordance with the provisions of the patent statutes, the principle and mode of operation of this invention have been explained and illustrated in its preferred embodiments. However, it must be understood that this invention may be practiced otherwise than as specifically explained and illustrated without departing from its spirit or scope. Alternatively, the bioartificial nucleus pulposus can be used to produce a bioartificial intervertebral disc adapted for replacing a natural intervertebral disc which has degenerated in the spine of a patient. The entire degenerated disc can be replaced instead of just the nucleus pulposus. The bioartificial intervertebral disc comprises a hollow disc adapted for use as part of an intervertebral disc, and the bioartificial nucleus pulposus contained within the hollow disc. The hollow disc comprises an annulus and first and second endplates attached to opposing faces of the annulus. In a preferred embodiment, the hollow disc is a natural intervertebral disc with its natural nucleus pulposus removed. The natural intervertebral disc has an annulus comprising collagen fibers and first and second endplates comprising cartilage. However, the hollow disc could also be made of any other materials suitable for functioning as part of an intervertebral disc in a body, such as plastics or other polymers. Typically, the annulus will be made from a tough fibrous material. The method of replacing the natural intervertebral disc involves providing the hollow disc and introducing the bioartificial nucleus",
    "textAfterTable": "US6224630 * May 29, 1998 May 1, 2001 Advanced Bio Surfaces, Inc. Implantable tissue repair device US6240926 May 19, 1999 Jun 5, 2001 The Trustees Of The University Of Pennsylvania Compositions and methods for intervertebral disc reformation US6306169 * Nov 9, 1998 Oct 23, 2001 Abonetics Ltd. Tissue implant US6340369 * Aug 14, 2000 Jan 22, 2002 Bret A. Ferree Treating degenerative disc disease with harvested disc cells and analogues of the extracellular matrix US6352558 Dec 29, 1999 Mar 5, 2002 Ed. Geistlich Soehne Ag Fuer Chemische Industrie Method for promoting regeneration of surface cartilage in a damage joint US6428802 Dec 29, 1999 Aug 6, 2002 Children's Medical Center Corp. Preparing artificial organs by forming polylayers of different cell populations on a substrate US6451060 Mar 5, 2001 Sep 17, 2002 Rush-Presbyterian-St. Luke's Medical Center Cartilage matrix and in vitro production of transplantable cartilage tissue",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}