{
    "relation": [
        [
            "Citing Patent",
            "US5854782 *",
            "US6178152 *",
            "US6392981 *",
            "US6493294 *",
            "US8321880 *",
            "US20110296446 *"
        ],
        [
            "Filing date",
            "Nov 9, 1995",
            "Jan 30, 1998",
            "Feb 27, 1998",
            "Jun 2, 1999",
            "May 20, 2011",
            ""
        ],
        [
            "Publication date",
            "Dec 29, 1998",
            "Jan 23, 2001",
            "May 21, 2002",
            "Dec 10, 2002",
            "Nov 27, 2012",
            "Dec 1, 2011"
        ],
        [
            "Applicant",
            "Sanyo Electric Co. Ltd",
            "Robert Bosch Gmbh",
            "Mitsubishi Electric Engineering Company Limited",
            "Pioneer Electronic Corporation",
            "Sony Corporation",
            "Sony Corporation"
        ],
        [
            "Title",
            "Multi-disk player",
            "Device for playing compact disks",
            "Disc device",
            "Disc reproducing device",
            "Disc changer",
            "Disc changer"
        ]
    ],
    "pageTitle": "Patent US5532985 - Disk player with magazine - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5532985?dq=7,292,151",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00120-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 468204723,
    "recordOffset": 468172960,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Having described preferred embodiments of the invention with reference to the accompanying drawings, it is to be understood that the invention is not limited to those precise embodiments, and that various changes and modifications may be effected therein by one skilled in the art without departing from the scope or spirit of the invention as defined in the appended claims. Alternative embodiments of the present invention provide for the lowering of the clamp assembly 190 while the selected disk is displaced downward upon a turntable 202 where the disk reader assembly 200 is fixed in position. Such an embodiment provides for the simultaneous lowering of the selected carriage in a clearance provided by a downward displacement of the disks 201' in a magazine. Referring to FIG. 39, the disk 201 is lifted free of its carriage, 58 or 59, and pressed into clamping engagement against the clamp assembly 190. The turntable 202 then rotates the disk 201 while the optical pick-up 203 travels from left and right in the figure to read the disk 201. The disk 201 is played while overlapping the remaining disks 201' in the magazine 50. The overlapping arrangement presented is made possible by the clearance provided by the lifter plate 43 as shown in FIG. 37. The selected disk 201 is released from the disk reader assembly 200 by reversing the operation of the motor 231 thereby lowering the disk reader",
    "textAfterTable": "US4969138 * Aug 22, 1988 Nov 6, 1990 Pioneer Electronic Corporation Multi-disk player system US4993008 * Sep 22, 1988 Feb 12, 1991 Pioneer Electronic Corporation Multiple-disk player with automatic fade-out function US5062092 * Nov 24, 1989 Oct 29, 1991 General Electric Company Jukebox having rotatable disk stack US5099466 * Oct 26, 1990 Mar 24, 1992 Pioneer Electronic Corporation Multidisk containing player including magazine having a housing with separable upper and lower half portions US5117409 * Oct 26, 1990 May 26, 1992 Pioneer Electronic Corporation Multidisk containing player including magazine having a housing with separable upper and lower half portions US5123001 * Aug 23, 1990 Jun 16, 1992 Nakamichi Corporation Disk playback device US5177722 * May 30, 1991 Jan 5, 1993 Nakamichi Corporation Disk player with disk changer functions",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}