{
    "relation": [
        [
            "Citing Patent",
            "US5980484 *",
            "US6129738 *",
            "US6409863",
            "US6475184",
            "US6475185 *",
            "US6527790 *",
            "US6620149",
            "US6689098",
            "US6814751",
            "US7066953",
            "US7300415",
            "US7608063",
            "US8574219",
            "US9079000",
            "US20040122465 *",
            "US20040133268 *",
            "US20040138737 *",
            "US20040148006 *",
            "US20050010278 *",
            "US20100305678 *",
            "US20120053565 *",
            "US20120089220 *",
            "WO2000044430A1 *",
            "WO2002045597A2"
        ],
        [
            "Filing date",
            "Feb 17, 1998",
            "Jun 20, 1998",
            "Jun 12, 2000",
            "Jun 14, 2000",
            "Feb 24, 2000",
            "Dec 7, 2000",
            "Oct 5, 2000",
            "Oct 25, 2002",
            "Jan 30, 2002",
            "Jun 19, 2002",
            "Dec 20, 2002",
            "Feb 23, 2006",
            "Sep 18, 2006",
            "Oct 16, 2012",
            "Dec 20, 2002",
            "Oct 14, 2003",
            "Aug 21, 2003",
            "Jan 16, 2004",
            "Aug 4, 2004",
            "May 27, 2009",
            "Sep 13, 2011",
            "Sep 6, 2011",
            "Jan 26, 2000",
            "Dec 6, 2001"
        ],
        [
            "Publication date",
            "Nov 9, 1999",
            "Oct 10, 2000",
            "Jun 25, 2002",
            "Nov 5, 2002",
            "Nov 5, 2002",
            "Mar 4, 2003",
            "Sep 16, 2003",
            "Feb 10, 2004",
            "Nov 9, 2004",
            "Jun 27, 2006",
            "Nov 27, 2007",
            "Oct 27, 2009",
            "Nov 5, 2013",
            "Jul 14, 2015",
            "Jun 24, 2004",
            "Jul 8, 2004",
            "Jul 15, 2004",
            "Jul 29, 2004",
            "Jan 13, 2005",
            "Dec 2, 2010",
            "Mar 1, 2012",
            "Apr 12, 2012",
            "Aug 3, 2000",
            "Jun 13, 2002"
        ],
        [
            "Applicant",
            "Scimed Life Systems, Inc.",
            "Medtronic Ave, Inc.",
            "Scimed Life Systems, Inc.",
            "Scimed Life Systems, Inc.",
            "Scimed Life Systems, Inc.",
            "Scimed Life Systems, Inc.",
            "Scimed Life Systems, Inc.",
            "Scimed Life Systems, Inc.",
            "Rosengart Todd K",
            "Rosengart Todd K",
            "Advanced Cardiovascular Systems, Inc.",
            "Medrad, Inc.",
            "Boston Scientific Scimed, Inc.",
            "Boston Scientific Scimed, Inc.",
            "Mcmurtry Christopher",
            "Advanced Stent Technologies, Inc.",
            "Advanced Stent Technologies, Inc.",
            "Davidson Charles J",
            "Advanced Stent Technologies, Inc.",
            "Khaldoon Alaswad",
            "Abbott Cardiovascular Systems Inc.",
            "E.V.R. Endovascular Researches S.A.",
            "Mario Immacolato Paternuosto",
            "Scimed Life Systems Inc"
        ],
        [
            "Title",
            "Dilation balloon for a single operator exchange catheter or similar device",
            "Method and apparatus for treating stenoses at bifurcated regions",
            "Methods of fabricating a catheter shaft having one or more guidewire ports",
            "Catheter shaft",
            "Occlusion device",
            "Intravascular balloon catheter for embolic coil delivery",
            "Corewire securement system",
            "Occlusion device",
            "Method and apparatus for performing an anastamosis",
            "Method and apparatus for performing an anastamosis",
            "Balloon catheter having an external guidewire",
            "Dual lumen aspiration catheter system",
            "Catheter shaft including a metallic tapered region",
            "Integrated crossing balloon catheter",
            "Balloon catheter having an external guidewire",
            "Extendible stent apparatus",
            "Stent with protruding branch portion for bifurcated vessels",
            "Stent range transducers and methods of use",
            "Extendible stent apparatus",
            "Thrombectomy and Balloon Angioplasty/Stenting Device",
            "Rapid exchange infusion catheter",
            "Microcatheter",
            "Improvements in a probe adapted to provide an isolated operating room at the distal end of the oesophagus",
            "Intravascular balloon catheter for embolic coil delivery"
        ]
    ],
    "pageTitle": "Patent US5718683 - Dilation balloon for a single operator exchange intravascular catheter or ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5718683?dq=5839108",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00215-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 465569375,
    "recordOffset": 465546774,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{24403=This is a divisional of application Ser. No. 08/567,810, filed on Dec. 6, 1995, now U.S. Pat. No. 5,549,553 which is a continuation of application Ser. No. 08/055,009, filed on Apr. 29, 1993 now abandoned., 43588=Preferably, the shaft 14 has a length of approximately 135 cm and an inner diameter of approximately 0.0210 inches which defines the inflation lumen 20. To provide greater stiffness for manipulation of the shaft 14, the proximal portion 16 is made of stainless steel hypodermic tubing having an outer diameter of about 0.023 inches. The proximal portion 16 of the shaft 14 can also be configured as a coil spring which is pre-loaded a desired amount to vary the flexibility of the shaft. The distal portion 18 of shaft 14 has an outer diameter of about 0.025 inches and is formed of a relatively flexible polymeric material, such as a polyolefin copolymer or polyethylene, to allow the shaft 14 to easily track through a vessel. A stiffening wire 32, preferably about 0.005 inches in diameter, is also provided to facilitate manipulation of the catheter 12. The stiffening wire 32 extends longitudinally through the inflation lumen 20 of the shaft 14 and through the balloon 28 to a distal end 33 of the balloon 28. A proximal end 34 of the stiffening wire 32 is attached to the proximal portion 16 of the shaft 14 and a tapered distal end 36 is attached to the distal end 33 of the balloon 28. A spring coil tip can be secured about the distal end 36 of the stiffening wire 32, and a radiopaque marker (not shown) can be mounted about the wire 32 within the interior chamber 38 of the balloon 28 for tracing the position of the balloon as the catheter 12 is inserted into the patient via fluoroscopy. A catheter shaft incorporating the foregoing features is disclosed in U.S. patent application Ser. No. 07/833,099, filed Feb. 10, 1992, the disclosure of which is specifically incorporated herein by reference. The stiffening wire 32 can be attached to the shaft 14 and balloon 28 in any suitable manner known in the art. For example, the distal end 36 of the wire 32 can be secured to a distal end of the shaft 14 or a proximal portion of the balloon 28.}",
    "textBeforeTable": "Patent Citations Although the present invention has been described with reference to preferred embodiments, those skilled in the art will recognize that changes may be made in form and detail without departing from the spirit and scope of the invention. As such, it is intended that the foregoing detailed description be regarded as illustrative rather than limiting and that it is the following claims, including all equivalents thereof, which are intended to define the scope of the invention. Thus, a single-operator exchange type catheter is provided which minimizes the profile of the balloon and facilitates trackability of the catheter over the guide wire. To initially position the catheter 12 in a patient's vessel, the guide wire 30 is preferably advanced to a desired location in a vessel. The proximal portion 35 of the guide wire 30 is then inserted into the guide wire lumen 52 of the balloon 28 End the catheter 12 is advanced distally to the desired location in the vessel. Alternatively, the catheter 12 can be advanced over the guide wire 30 prior to insertion in the vessel and the assembly can be advanced to a desired location in the vessel. As best shown in FIG. 1, a substantial portion of the guide wire 54 is positioned outside the catheter shaft 14 to allow a single-operator exchange of the catheter 12 for a second catheter. When a different size or configuration catheter is required, the",
    "textAfterTable": "US5147377 * Jul 12, 1990 Sep 15, 1992 Harvinder Sahota Balloon catheters US5160321 * Nov 27, 1991 Nov 3, 1992 Harvinder Sahota Balloon catheters US5180367 * Sep 16, 1991 Jan 19, 1993 Datascope Corporation Procedure and balloon catheter system for relieving arterial or veinal restrictions without exchanging balloon catheters US5232446 * Oct 30, 1991 Aug 3, 1993 Scimed Life Systems, Inc. Multi-sinus perfusion balloon dilatation catheter US5320605 * Jan 22, 1993 Jun 14, 1994 Harvinder Sahota Multi-wire multi-balloon catheter US5338300 * Jul 28, 1993 Aug 16, 1994 Scimed Life Systems, Inc. Performance enhancement adaptor for intravascular balloon catheter US5368567 * Aug 9, 1993 Nov 29, 1994 Schneider (Usa) Inc. Dilatation balloon catheter with infusion lumen US5380319 * Oct 2, 1992",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}