{
    "relation": [
        [
            "Date",
            "Jun 7, 2005",
            "Aug 27, 2009",
            "Feb 22, 2011",
            "Mar 13, 2013",
            "Mar 5, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: ADOMO, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:SKAKKEBAEK, JENS;FRIFELDT, HEINE;POTZE, WILLAM R.B.;REEL/FRAME:016667/0189 Effective date: 20050513",
            "Owner name: AVAYA INC.,NEW JERSEY Free format text: MERGER;ASSIGNOR:ADOMO, INC.;REEL/FRAME:023154/0362 Effective date: 20090818",
            "Owner name: BANK OF NEW YORK MELLON TRUST, NA, AS NOTES COLLAT Free format text: SECURITY AGREEMENT;ASSIGNOR:AVAYA INC., A DELAWARE CORPORATION;REEL/FRAME:025863/0535 Effective date: 20110211",
            "Owner name: BANK OF NEW YORK MELLON TRUST COMPANY, N.A., THE, Free format text: SECURITY AGREEMENT;ASSIGNOR:AVAYA, INC.;REEL/FRAME:030083/0639 Effective date: 20130307",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7808980 - Integrated multi-media communication system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7808980?dq=U.S.+Patent+",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00047-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474249563,
    "recordOffset": 474200501,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6401=FIG. 13 is a block diagram of a system 13 that includes multiple Sites (defined herein) and multiple components, under an alternative embodiment. System 13 includes multiple Sites, some of which may have multiple MCSs, IMs, private communication networks and MSERVs. As shown, system 13 includes MSERV 1390 and MSERV 1391 communicating via a network 1392, which may comprise any of a public network, such as a PSTN, or private communications network or other network. The MSERVs are coupled to one or more IMs. For example, as shown here, MSERV 1390 is coupled to IMs 1385 (IM1 and IM2), and MSERV 1391 is coupled to IMs 1386 (IM3 and IM4). The IMs are coupled to one or more MCSs. For example, as shown here IM1 is coupled to MCS1, MCS2, and MCS3; IM2 is coupled to MCS2, MCS3, MCS4 and MCS5; IM3 is coupled to MCS6 and MCS7; and IM 4 is coupled to MCS8. The MCSs are coupled to private communications networks. As shown here, MCS1, MCS2, MCS3, MCS4 and MCS 5 are coupled to private communications network 11360A; MCS6, and MCS7 are coupled to private communications network 2 1360B; and MCS8 is coupled to private communications network 2 1360B and private communications network 3 1360C.}",
    "TableContextTimeStampAfterTable": "{128430=The folder area 1202 may also include a subfolder (“VOICE MESSAGE SYSTEM”) under the Public Folder. As such, the VOICE MESSAGE SYSTEM folder may not be considered an actual folder but instead a uniform resource locator (“URL”) that, when selected, sends an HTTP request to a web server and launches/displays an ICS browser inside the client device message browser. The web server may, for example, be a component of the MCS and/or IM, but is not so limited. The ICS browser is an embedded or hidden browser that displays the ICS Window in the area of the client device message browser where emails would typically appear, and the voice mail messages are displayed in the ICS Window., 44490=Integrating Messaging Server Directory Service With Communication System Voice Mail Message Interface, U.S. application Ser. No. 11/053,709, invented by Heine Frifeldt, David Forney, and Anthony Shaffer, filed Feb. 7, 2005;, 117835=ICS 1100 replaces the voice mail server typically found in enterprise networks with at least one MCS 1110. MCS 1110 is coupled to the private communications network (e.g., PBX) of each network enterprise. While one MCS is shown in this example system 11, the enterprise network may include multiple MCSs 1110 coupled to enterprise network in an “N+1” configuration, where “N” is any number 1, 2 . . . X., 113431=The information flow 1000 begins when a caller places a call 802 to a user and availability of the user results in the caller leaving a voice mail message VMSG for the user. The voice mail message VMSG is received at the MCS, however a component of the MCS detects an unavailable or offline condition of the MSERV. In response to detecting the offline condition, the MCS assigns a CACHEID to the incoming message VMSG, and holds 1004C the message contents VMSG along with the CACHEID in the Cache., 113982=Information flow 1000 continues when a user accesses 820 the enterprise network system to retrieve his/her voice mail messages while the MSERV remains in an offline condition. Upon being provided with access to the MCS, the user selects a voice mail message from a list of CACHEIDs generated from the collection of voice mail messages held for him/her by in the cache. In response to the user selection, the MCS searches 1022 the Cache using the Cache identification CACHEID of the selected message. Upon locating the voice mail message by its CACHEID in the Cache, the MCS pulls 1014R the voice mail message contents from the Cache, and plays the voice mail message for the user as appropriate to the action selected by the user., 114773=The MCS continues to monitor the condition of the MSERV. At such time as the MCS detects a return of the MSERV to an online condition, the MCS pulls 1004P the voice mail message VMSG and its CACHEID from the Cache, and transfers 1004M the voice mail message and CACHEID via the IM to the MSERV. The MSERV assigns an identification VMSGID to the incoming voice mail message VMSG and stores 1006 the voice mail message VMSG along with the VMSGID and CACHEID in one or more areas of memory as described above., 121314=The ICS of an embodiment provides the FBUI 1180 to a user via his/her local client device. The FBUI is provided to the client device through the use of a FBUI Form, where the structure of the FBUI Form conforms to the message structure of the messaging server environment. For example, when the messaging server environment includes the use of Microsoft Exchange and Microsoft Outlook, the FBUI Form is generated to comply with Microsoft formats as appropriate to Exchange and Outlook, 98178=The pulling of information from the MSERV by the MCS includes pulling and caching of information including the GAL, Public Folder, and User List. The pulled information is cached by the MCS on a system or non-individual basis because this information applies throughout the enterprise. This information is pulled and cached periodically, for example at 24-hour intervals (e.g., each morning at 2:00 am), or may be loaded on demand, but is not so limited., 126104=The contents area 1204 generally presents the contents of the folder selected using the folder area 1202. As an example, the contents area 1204 presents information corresponding to any number of voice mail messages in the user's mail box when the INBOX or VOICE MESSAGES folder is selected. Contents area 1204 allows the user to select a particular voice mail message by placing a cursor on “VOICE MESSAGE 1 INFORMATION” for example. By (double) clicking a message in the contents area 1204 or otherwise indicating to the message browser to display a voice message, a new window (referred to as the “ICS Window”) is displayed. The ICS Window now includes function are 1206., 116893=Messaging server environment 1140 includes the MSERV and a Database 1144, but is not so limited. The LAN couples to any number of other networks 150 and 160 using any of a variety of communication protocols, where the networks 1150 and 1160 may be of the same or of different types. As an example, the networks may include a public communications network 1150 and a private communications network 1160. Private communications network 1160 may be a PBX coupled to the LAN of the enterprise network, for example. Networks 1150 and 1160 allow for information transfers between client devices 1170 that are local to enterprise network 1101 and client devices 1199 that are external to enterprise network 1101. The client devices may alternatively be referred to as “user devices” 1170 and 1199., 46001=System And Method For Providing Code On Voicemail Appliance, U.S. application Ser. No. 11/053,376, invented by Jens Skakkebaek and Lutz Birkhahn, filed Feb 7, 2005., 129152=As an example, the ICS Window is displayed in the contents area 1204 of an embodiment. The ICS Window may be served from the IM and may contain any information related to the voice messaging system that is user specific. In one embodiment, the ICS Window will display a user login prompt where the user enters the user name and PIN code. Subsequently, the system displays the user's configuration date, such as PIN code, attendant extension, greeting type, and other applicable information., 125578=Folder area 1202 presents one or more folders to which the user has access via the FBUI 1200 and the client device. The “INBOX” may contain a list of voice mail messages in the same listing as other messages, including email messages. Alternatively, the Inbox may include a subfolder (“VOICE MESSAGES”) which includes the voice mail messages, and selection of this folder results in the presentation of voice mail messages of the user's mail box in the contents area 1204., 92205=User mailbox 704 stores email messages sent to the user, as well as outgoing messages and other items, for predetermined periods of time. In an embodiment, the messages can be of at least two types, one of which is a “normal” message that is routinely accessible by the user. Another message type is a “hidden” message that is not routinely accessible by the user through the normal user email interfaces. In an embodiment, a hidden message is used to store data used by the Voice Applications. In contrast to the data stored in the Custom Attribute, however, the data stored in the hidden message can be much larger than the 2048 byte limit of the custom attribute. In one embodiment, among the data stored in the hidden message are audio files stored as attachments to the hidden message, such as a “busy” greeting for the user's voice mail mailbox, a “no answer” greeting for the user's voice mail mailbox, and a recorded name for the user's voice mail mailbox., 44088=Distributed Cache System, U.S. application Ser. No. 11/015,411, invented by Shahriar Vaghar, Yang Wang, and Jens Skakkebaek, filed Feb. 7, 2005;, 127977=In other embodiments, presentation of areas or information of the FBUI may vary in many ways. For example, in one embodiment, the action buttons 1206 appear after the user has selected (for example by double clicking a particular voice message from the contents area 1204. Action buttons 1206 may also appear when the user right clicks on a particular voice message in the contents area 1204., 45334=Extensible Diagnostic Tool, U.S. application Ser. No. 11/053,270, invented by David Forney, Heine Frifeldt, and Anthony Shaffer, filed Feb. 7, 2005;, 43436=Form-Based User Interface For Controlling Messaging, U.S. application Ser. No. 11/053,537, invented by Heine Frifeldt, Anthony Shaffer, and Willem R. B. Potze, filed Feb. 7, 2005;, 90964=The user object further includes a number of “Custom Attributes.” The number of Custom Attributes is small, for example fifteen, compared to the number of fixed attributes. The Custom Attributes are usable to store information not provided for in the predefined fixed attributes. In one embodiment, a Custom Attribute stores user-specific data that is used by the Voice Applications. Examples of such user-specific data include a class of service (“COS”) for the user, a voice mail extension for the user, whether voice mail is enabled for the user, etc. The data is stored as a data stream in the Custom Attribute with a maximum size of 2048 bytes. In an alternative embodiment, the user-specific data that is used by the Voice Applications is stored as individual data items in fixed attributes by extending AD in a known manner., 44746=Improved Message Data Access In Multi-Media Communication System, U.S. application Ser. No. 11/053,736, invented by Jens Skakkebaek and Heine Frifeldt, filed Feb. 7, 2005;, 44265=Caching User Information In An Integrated Communication System, U.S. application Ser. No. 11/053,272, invented by Jens . Skakkebaek, Willem R. B, Potze, and Heine Frifeldt, filed Feb. 7, 2005;, 43870=Caching Message Information In An Integrated Communication System, U.S. application Ser. No. 11/053,147, invented by Shahriar Vaghar, Yang Wang, and Jens Skakkebaek, filed Feb. 7, 2005;, 43648=Controlling Messaging Actions Using Form-Based User Interface, U.S. application Ser. No. 11/053,146, invented by Heine Frifeldt, Anthony Shaffer, and Willem R. B. Potze, filed Feb. 7, 2005;, 131219=As described above, FBUI 1200 allows a user to take action on a voice mail message via buttons 1206A-1206E of FBUI 1200. Therefore, placing the cursor of contents area 1204 on a particular message and choosing an action on the selected message with a button 1206A-1206E invokes the action on the message via components of the MCS and/or the enterprise network environment., 45143=Networked Voicemail, U.S. application Ser. No. 11/053,425, invented by David Forney, Jens Skakkebaek, Heine Frifeldt, and Anthony Shaffer, filed Feb. 7, 2005;, 44950=System And Method For Voicemail Privacy, U.S. application Ser. No. 11/053,054, invented by Anthony Shaffer, Heine Frifeldt and David Forney, filed Feb. 7, 2005;, 126853=Function area 1206 of FBUI 1200 presents one or more “voice mail action buttons” 1206A-1206E (also referred to herein as “buttons”) each of which represents an action the user may select for a voice mail message. In this example, the VOICE MESSAGES folder is selected, and selection of a message in contents area 1204 allows the user to take an action on the selected message using buttons 1206A-1206E. Placing the cursor of contents area 1204 on a particular message and choosing an action on the selected message with a button 1206A-1206E therefore invokes operations on the message via components of the ICS (e.g., MCS, Cache, IM). The buttons 1206A-1206E of an embodiment include a “Play on Phone” button 1206A, a “Play on Computer” button 1206B, a “Call Sender” button 1206C, a “Reply by Voicemail” button 1206D, and a “Forward by Voicemail” button 1206E, but the embodiment is not limited to this same number of buttons or to buttons offering the same functionality., 45515=System And Method For Providing Data On Voicemail Appliance, U.S. application Ser. No. 11/053,538, invented by Jens Skakkebaek and Lutz Birkhahn, filed Feb. 7, 2005;, 45822=Communication System, U.S. application Ser. No. 11/053 539, invented by Heine Frifeldt, David Forney, and Anthony Shaffer, filed Feb. 7, 2005; and}",
    "textBeforeTable": "Patent Citations While certain aspects of the ICS are presented below in certain claim forms, the inventors contemplate the various aspects of the ICS in any number of claim forms. For example, while only one aspect of the ICS is recited as embodied in machine-readable medium, other aspects may likewise be embodied in machine-readable medium. Accordingly, the inventors reserve the right to add additional claims after filing the application to pursue such additional claim forms for other aspects of the ICS. In general, in the following claims, the terms used should not be construed to limit the ICS to the specific embodiments disclosed in the specification and the claims, but should be construed to include all processing systems that operate under the claims. Accordingly, the ICS is not limited by the disclosure, but instead the scope of the ICS is to be determined entirely by the claims. The elements and acts of the various embodiments described above can be combined to provide further embodiments. These and other changes can be made to the ICS in light of the above detailed description. The above description of illustrated embodiments of the ICS is not intended to be exhaustive or to limit the ICS to the precise form disclosed. While specific embodiments of, and examples for, the ICS are described herein for illustrative purposes, various equivalent modifications are possible within the scope of the ICS, as those",
    "textAfterTable": "System and method for improving delivery of messages to a messaging system US5909483 Sep 9, 1996 Jun 1, 1999 Comverse Network Systems, Inc. Remote subscriber migration US5915001 * Nov 14, 1996 Jun 22, 1999 Vois Corporation System and method for providing and using universally accessible voice and speech data files US5946386 Mar 11, 1996 Aug 31, 1999 Xantel Corporation Call management system with call control from user workstation computers US5995596 Mar 12, 1997 Nov 30, 1999 Siemens Information And Communication Networks, Inc. System and method for coordination of multimedia messages across multiple systems US6021181 Feb 24, 1997 Feb 1, 2000 Wildfire Communications, Inc. Electronic voice mail message handling system US6047053 May 22, 1997 Apr 4, 2000 Wildfire Communications, Inc. Network based knowledgeable assistant US6052709 Dec 23, 1997 Apr 18, 2000 Bright Light Technologies, Inc. Apparatus and method for controlling delivery of unsolicited electronic mail US6070081 Nov",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}