{
    "relation": [
        [
            "Date",
            "Jan 30, 1997",
            "Jun 18, 2002",
            "Aug 16, 2006",
            "Jan 26, 2007",
            "Mar 27, 2007"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: CORDIS CORPORATION, FLORIDA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:COLETTI, PAUL A.;REEL/FRAME:008399/0334 Effective date: 19970130",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20070126"
        ]
    ],
    "pageTitle": "Patent US5863285 - Balloon catheter with radioactive means - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5863285?dq=6702462",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00310-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471503943,
    "recordOffset": 471482537,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The connecting lines of the conductors on the balloon members to the proximal end of the catheter may be embodied in many different ways. For each conductor on a balloon member a separate pair of connecting lines running to the proximal end may be employed in the manner illustrated but, in the case of these conductors being electrical connectors as well, a multiplexer may for instance be used as well. Electronic circuits such as preamplifiers and tuning and adapting electronics may be received in said connecting lines. All these and similar embodiments are considered to fall within the scope of the attached claims. 3) Uses existing devices and technology so that it is easy and now relatively inexpensive to manufacture. 2) Radioactive to prevents stenosis; 1) Centered on the lumen of the body by being located in the catheter wall; Because the conductor is radioactive, there is the possibility of providing restenosis therapy to the lumen. The device is: With the embodiment of FIG. 2 it may for instance be possible that the inner balloon member 18 can be expanded independently of the outer balloon member 16. As a result treatment may be carried out whilst only the outer balloon member 16 is expanded and the inner balloon member 18 still is deflated. Also in the case of an embodiment as illustrated in FIG. 3, the balloon members 26-28 may be made in such a way",
    "textAfterTable": "US5411466 * Mar 28, 1994 May 2, 1995 Robert L. Hess Apparatus for restenosis treatment US5503613 * Jan 21, 1994 Apr 2, 1996 The Trustees Of Columbia University In The City Of New York Apparatus and method to reduce restenosis after arterial intervention US5503614 * Jun 8, 1994 Apr 2, 1996 Liprie; Samuel F. Flexible source wire for radiation treatment of diseases US5540659 * Aug 30, 1994 Jul 30, 1996 Teirstein; Paul S. Irradiation catheter and method of use US5643171 * Nov 15, 1994 Jul 1, 1997 Neocardia, Llc Method and apparatus for uniform radiation treatment of vascular lumens US5662580 * Feb 10, 1995 Sep 2, 1997 Neocardia, Llc Combined angioplasty and intravascular radiotherapy method and apparatus US5722984 * Jan 16, 1996 Mar 3, 1998 Iso Stent, Inc. Antithrombogenic radioactive coating for an",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}