{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,098 topics 2,123,749 replies",
            "85,550 topics 1,153,590 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,757 replies",
            "5,996 topics 75,810 replies",
            "50,538 topics 466,152 replies",
            "22,766 topics 196,284 replies",
            "4,270 topics 60,436 replies",
            "1,128 topics 8,214 replies",
            "3,598 topics 115,165 replies"
        ],
        [
            "Last Post Info",
            "How big LS really is next t... By CarnageRacing00 A minute ago",
            "GTA IV confessions By Mona Sax 20 minutes ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Ultimate 100% Save File... By Militia 7 hours ago",
            "Whats your favorite/hated r... By Kristian. 2 hours ago",
            "New Model Army By mikey_1982 An hour ago",
            "Something that has always b... By spaceeinstein 28 minutes ago",
            "Grand Theft Auto III Chain... By Kristian. 2 hours ago",
            "Anybody has a 100 % savegame? By Cerium 22 hours ago",
            "Grand Theft Auto - Memes By Niobium 9 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=5&t=308660&p=1060056909",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986615.83/warc/CC-MAIN-20150728002306-00114-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 109849795,
    "recordOffset": 109820217,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16617=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 9397=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 18774=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 14309=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 47428=Google, Yahoo, lester622, Bing, PSNSammy1, Gytis-JDM, BassicalyDrunK, kk9fan97, CH14R1, s2n vaniish, Shenmue18, Pavle, JakeHorgrove, Vassago1988, SilentSeasons, hezus123, Cripto136, TreFacTor, m2roadwarrior, *Lola, Crubbiestimp42, Jack_Coen88, Lilscotton, Red Lynx 23, Midnight Hitman, CarnageRacing00, LiangHuBBB, Mirage Las Vegas, Z i X, denis1379, Claude Liberty, Pigglesman, hornedturtle, Freddy1Krueger, nyvenom30, GTAKid667, camo_boy67, zel1n26, p-s-3x, Officer Garza, Beastly40, CReaper210, icecoldkilla1467, undertaker fan, _Douglas_, Slam_Jones, T33MU, Doc302, craigdyid, Dondara, J Cobra, diegomart123, Imposssible, qiangqiang101, paulmgrath, Biggie Deaf, monkb4skunk, Alec Skorpio, harvecito, Icantthinkofonew, Andreas_XTC, marshallbslayer, Majestic81, Markuza97, Ivan1997GTA, Black Terminator, PhilipTrevors, joe1606, ashbashbluesfan, Daz, XxKing69XavierxX, Reywas1, JimmyFantastic, saintsrow, Kahkenbols, Dawsonroberts13, uncaged, Ameeno98, Rippir1600, gizz01, BLOOD-MOND, lol232, Mike324467, DANIEL3GS, unknown modder, MR.V8, Fozzie_420, Cool Username, blancosdos, CamxxCore, AnthMUFC-Champs, Lay, bronysplatter, kaasje, Jphunter0, NikoBellicGTAIV, XCarlSagan865X, levendis, Vova07, emiliumium, deadx23, SuperGTFan, SagaciousKJB, TriPasta, DentureDynamite, The Wraith, calambos, Rusty Balls, Mockingbae, Chipsman, gorskiegangsta, YESYESYES, Chao§pawN, Gtaultimatefanboy, gfen, DaltonWilliams123, Capa, Nima_1i, GTA4LIFE9000, RobinVerhulstZ, Laguezmer, Chekoloco, LeopardGecko, J-B, Niobium, silverharbinger, Shabazz916, yojc, jp9865, nmk111, GunTotinHippie, epoxi, TarHeelJohn, Fox2Quick, Retired Mafia, Silent, Djeli, Rytherik, GamesBoy316, HulioG, Kal74, StayTrue, killstreakmx, ethandavo, GAMIR_GTA, MASTER GABE 202, Halal Cyborg, kKatie, JasonW135, Str33tJustus, Maresz55, A Paradox from 94, Captain Sensib1e, ChickenAndBeer, Spectacus, //XP//, 22Laxer22, dragoon371, StoneCold-Y2J, size_m, GunsNroses61, statistic, RustyShackleford, banter mcbanter, BRITLAND, polaris23, HorrA1985, Dig2307, Hollistupid, GypsyBastard, yakprince, BattleExel26, CalebJKimbell, fSpiral, TargetPractice89, thegough, Max Payne, RiseAgainBH, Miauuu5_7, HarveyVercetti, Commissioner Monk, Engman97, 2 Wheelz, PlatinumSerb, Jinx., Stoney0503, l0lsmores, LetsPlayOrDy, Pegger420, Allegri32, RandomCholo, frodzet, B-Turb0, Svip, o_Marvelous, Jax765, gelou307, dice, Maxandmov, Marwin, Egonga, KingpinRCR, I Love Anna Kournikova, Kimmedrano92, Saso70, ProdigyHD, TalkingPear, XB36Hazard, pizzapuff1990, VideoGameJames, .R3b3L, MF Modding, Tycek, UllsArrow, ninjaontour, kzstone, EF2000, U.N.K.N.O.W.N, Clark., evGTA, CJPNE, CptAngel, Miss Blossom, Daequil, del__cielo, Nuggets, dSk_43, knightsgarage, Cudwieser, xrk, MAX310VELO, roboticsuperman, ClaudeSpeed1911, Black_MiD, Dave_TE, BlackNoise, Heists, Walter175, Nik., alkaline_, m3tal z_DKI, Lord_Smasherton, AeroAviation, xTOMMYTROJANx, Fenton, nonamenoname, jennyjesus, zuckmeslow, r.lorenzo13, Pettyium117, DennisStanistan, Freeman.BIO, StepNaza, EzBoRR, Tossin Salad, Google Mobile, vnctmrn, santtuu74., southparkmayor, 65536, CaptainMental, SuperHolySheep, CartmanKusanagi, bama764, TempleOfLight, Twin Turbo, g3o0or, TheTechPoTaToCHIP, Schleemil, Pyroshox, CoCkPuNcH, B Dawg, Gtaonlinelegitplayer14, gamefriik200, Ledorus, CTBass, Cuesta, Don Maximus Meridius, Dirty.Hairy, autotheftgrand, Nugsy, Huraldo, DonSpeedy, _CP_, toxluv, v17, Shadowfennekin, nkjellman, IgorX, Arms Dealer, Hombre_Loco, Estraikerful, OverdrivePedal, Drunkmoons, Teezo, eli.g1026, mkjah222, PreciousWall, maxx1013, Chaise, the nameless, Josivers, KingLouieThaXIII, SSJEavan747, pg1313, H52VERGR52VER, zanesix, spankyspeedster, k2x, feckyerlife, Setzaroth, fastman92, dkluin, Heisenberg_GR, Lukasdk, Irontis, Indignation, Talabick, IIOctaneII, zzr, GTA_The_Series, Edmachine, ClaudeSpeed600, -Velox, mario_rz, Masiku, Killerman29, CaptHayes, Gamerjman19, Lebowski_RS, cswood, Private Custard, Pegassi Autobot, ZenderAlpha, Rohith_Kumar_Sp, HokusaiXL, CBH, sivispacem, dstyl, Zondar, ApexReclaimer, davidp027, evinaz, TheNameless, 20919=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 136803=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 12591=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 9 minutes ago By B-Turb0 The Paleto Bay Mayors Offic... 613,525 replies 15,193 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Lord_Smasherton Driving away in deathmatches 2,279,335 replies 113,227 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,443 topics 416,564 replies [.NET] How to rename a blip? By LetsPlayOrDy A minute ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}