{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,098 topics 2,123,774 replies",
            "85,550 topics 1,153,592 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,757 replies",
            "5,996 topics 75,810 replies",
            "50,538 topics 466,152 replies",
            "22,766 topics 196,284 replies",
            "4,270 topics 60,436 replies",
            "1,128 topics 8,214 replies",
            "3,598 topics 115,166 replies"
        ],
        [
            "Last Post Info",
            "Story Mode DLC discussion t... By SuperGTFan A minute ago",
            "Reasons why GTA IV is bette... By CarnageRacing00 13 minutes ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Ultimate 100% Save File... By Militia 7 hours ago",
            "Whats your favorite/hated r... By Kristian. 3 hours ago",
            "New Model Army By mikey_1982 2 hours ago",
            "Something that has always b... By spaceeinstein 52 minutes ago",
            "Grand Theft Auto III Chain... By Kristian. 3 hours ago",
            "Anybody has a 100 % savegame? By Cerium 23 hours ago",
            "Create your own radio stati... By Sayuri 11 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=58&t=199330&p=2930818",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986615.83/warc/CC-MAIN-20150728002306-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 106831471,
    "recordOffset": 106803220,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9533=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 131093=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 19011=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 12828=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 16854=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 14546=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 47803=GTAKid667, Yahoo, Bing, Flandre, Google, Cico555, Eneveon, Cornphlake, Fozzie_420, darktytanus, U.N.K.N.O.W.N, Black_MiD, J Cobra, DODGPLUMMA, Huraldo, zz latios, Pavle, Jehannum, HulioG, craigdyid, Rashkovskys Shiv, H52VERGR52VER, monkb4skunk, Kiyone_Alien_Cop, SigiloHQ, Marty McFly, Rytherik, theGTAking101, BlackMilk, SpreeMurder, gil62291, Max Payne, GTA4LIFE9000, Officer Vic, hezus123, emiliumium, fastman92, PS3KillsThe360, TexasRocks, Lowi, SuperGTFan, ClareXoBearrx3, psymin, Halal Cyborg, ATP2555, oreank582894, A_Glorious_Spoon, BlackRuiner, Doomscream, SilentSeasons, 458Speciale, RafaelSousaSam, m3tal z_DKI, Progeekzy, silverharbinger, ktek01, DANIEL3GS, ehazard750000, Stoney0503, AztecaEh, Vadim M., friendly luggage, DonSpeedy, Captain Sensib1e, Vassago1988, Trash99, ChrissyBoi87, Jinx., Remix1994PL, chainsoar, ManikB141, Icantthinkofonew, _Douglas_, thalilmythos, sheepy111, eimaj1779, Officer Ronson, Supernutz40, deadx23, Dbzk1999, KingxGregory, Marwin, Skullkicker227, StingR, YESYESYES, TalkToMyAgent, Josivers, NikoJohnsonToreno, Twin Turbo, blk95ta, xInfamousRYANx, Midnight Hitman, o_Marvelous, potato123, Jobbo, gangrel669, JesusFR33K, AcidRunner, Mithridates158, Google Mobile, CoCkPuNcH, MrSaucyZ, Biff73, The Yokel, thegough, Facebook, ambiency, Shabazz916, ViciousSpirit, Reyks, Fleckz, CeltHD, Irviding, ashbashbluesfan, icecoldkilla1467, SSJEavan747, Maresz55, Soki93, Geralt of Rivia, grunsker, DrunkenMunkey78, Retired Mafia, gizz01, joe grizzly, TheMcSame, yojc, Ledorus, The Hero, SSKYZX, Warliss, paulmgrath, dice, Masiku, sasuke78200, Juicyfer, DaTwista, Th3MaN1, Monkeyhobo10101, Stormingz, hsthompson, someoneyouwontknow, CarnageRacing00, Mastah, menny, snoops26, highwayking, Verstappen, Lion, feloniousrick, LetsPlayOrDy, tails_prower_2040, Officer Garza, Texturiser, Rytuklis, FiS!!HeR, RominOctane, arewenotmen, Craank_AG, nmk111, jakematos2, Heists, Wolf., EvilDog77, Rangerlump, Quakex64, HipsterHillbilly, Freddy1Krueger, LibertyKing, Rippir1600, gtaguy95, PhilipTrevors, Beto2O, Jack_Coen88, ZODIAC 4 v2, sivispacem, jaskdavis, Hades_, superkj210, killstreakmx, blancosdos, sewersss, Semaj 2JZ♢, PNutterSammich, kalle55, Heysuse, Red Lynx 23, Slasherr, r0eladn, feckyerlife, zzACE91zz, Feurian42, johnson., PoeticWhisper, GTAV112, Royal22, -RONIN-, cswood, Lester-The-Molester, ClaudeSpeed1911, Shadowfennekin, Boooster, 22Laxer22, Egonga, Edmachine, greenghost2212, MarQs, unknown modder, epoxi, Dutch Psycho, M.K.N., Matttheking2015, Pettyium117, Claude Liberty, A-Lonely-Dragon, Slam_Jones, GamesBoy316, ZeroSafe5615, SirBurka_, bixlas13, Mokrie Dela, Laguezmer, Nima_1i, djflashpoint, Lay, BeckermannDewitt, Der_Don, roboticsuperman, s2n vaniish, p-s-3x, Shenmue18, BRITLAND, Judicious 7, Lebowski_RS, Lilscotton, Tossin Salad, RiozoR, SumSkittles, misak, fish61324, FlightOfIcarus, CrazyTigerGamimg, _CP_, Stephan90, ErMerGerd, IIOctaneII, Daz, jiggaman1, Miss Blossom, thatmobster, XJpostman, SagaciousKJB, Ninja Budgie, DaltonWilliams123, tweepey, Daemian, Ivan1997GTA, NikkoCharger, diegomart123, Andreas_XTC, Girish, unikatil, Itzreality, CalebJKimbell, Guad, sebejszczyn, lecroc69, Breitsmeister, Pegassi Autobot, The_Gardener, missanthropy, Tylomon, JakeHorgrove, Lord_Smasherton, StepNaza, scaldy78, Superfrogger, Doc302, Carface80, NotAHipster, marshallbslayer, GipsyDanger MK2, SchoolOfHardKnocks, -Z31N-, Drunkmoons, SeBBy., yakprince, bronysplatter, rapidwiz, 313izzle, Heisenberg_GR, jake-dk, Arms Dealer, NikoBellicGTAIV, davidp027, ZANTHERA, XxKing69XavierxX, Spade115, DumbForum, floyd65, Cool Username, JohnnyCallisto, Spectacus, Zkape, MePlayingGTA, Valanga, undertaker fan, Jon3s, x_FRoe__, OysterBarron, J-B, -Velox, kk9fan97, afrocan, USMCxMyth., Setzaroth, GVJLIMA, JuanG12, Miro, Majestic81, KingLouieThaXIII, foresaken1mc, Mike324467, flitcroft101, Andreas, 21156=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By psymin The Paleto Bay Mayors Offic... 613,534 replies 15,190 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By nyvenom30 GTA not working? ps4 2,279,393 replies 113,228 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,445 topics 416,564 replies Change number of peds in a... By Nima_1i 8 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}