{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "Hip Travel Guides Visit our NEW travel site, with its own forums, galleries and unique features! Separate registration required.",
            "Travel Photo Gallery Interesting images from around the world. Add yours! Note: Gallery moved to new website!",
            "Africa Discuss African destinations, culture, and travel tips with Africans and other travelers.",
            "Australia Discuss the land down under, Aussie culture, upcoming events and travel tips.",
            "Asia Discuss Asian culture, upcoming events and Asia travel tips. Make friends with Asians and other travelers.",
            "Canada Meet Canadians and discuss Canadian culture, upcoming events and travel tips.",
            "Europe Discuss European culture, upcoming events and Europe travel tips. Make friends with Europeans and other travelers.",
            "Find-A-Ride Welcome to the Ride Board. Use this forum at your own risk! By posting or responding here, you accept all responsibility.",
            "Latin America Discuss Latino culture, travel tips and destinations in Latin America.",
            "New Zealand Discuss the land of the Kiwis, the Maori and Tree Ferns. Make friends with New Zealanders and pickup some travel tips.",
            "Postcards from Planet Earth Post up images and descriptions of places you've been!",
            "Travel Talk Discuss the joys and travails of travel",
            "Travel Polls",
            "Backpackers Message Forum Post personal and group messages here"
        ],
        [
            "Stats",
            "2,900 Hits",
            "2,809 Hits",
            "110 topics 883 replies",
            "786 topics 6,339 replies",
            "375 topics 2,704 replies",
            "1,049 topics 10,414 replies",
            "2,433 topics 23,942 replies",
            "934 topics 1,674 replies",
            "205 topics 766 replies",
            "318 topics 8,275 replies",
            "43 topics 500 replies",
            "350 topics 1,683 replies",
            "13 topics 454 replies",
            "170 topics 888 replies"
        ]
    ],
    "pageTitle": "Hip Forums",
    "title": "",
    "url": "http://www.hipforums.com/forum/index.php?journalnoteid=19671",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987775.70/warc/CC-MAIN-20150728002307-00189-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 492497183,
    "recordOffset": 492472151,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{100550=lion1978 - Jun 12 2015 02:58 PM, 82512=Aerianne - Jun 27 2015 08:50 AM, 80942=skip - Jul 08 2015 04:25 PM, 81691=Shale - Jun 27 2015 03:17 PM, 80152=skip - Jul 28 2015 09:56 AM, 97517=Dal Justice - Jul 26 2015 09:42 PM, 117869=Lodog, meeses, GLENGLEN, Mattekat, Reverand JC, gibbiddy, Irminsul, knifeartist, r0llinstoned, strokinupanddown, Tyrsonswood, Wizardofodd, Pressed Rat, Texasisit, MellowDonna , thefutureawaits,  rollingalong, cindy94, Theprodu, petermc, neonspectraltoast, NoxiousGas, unfocusedanakin, orison, Average Ordinary Guy, Asmo, jerry420 , heeh2, zz3, Scorpio Kenny, ChinaCatSunflower02, Lolli, cbcrazy, Ghirardelli, AnyaZ89, Ausrob77, Aerianne, mvmcd1950, 11379=For people associated with the Good Earth Commune in San Francisco from 1963 to the present!, 117770=38 members, 2378 guests, 1 anonymous users, 99013=oneofthebeautifulpeople - Jun 25 2015 04:28 AM, 83257=skip - Jun 22 2015 03:38 PM, 99824=Eerily - Jun 18 2015 05:37 AM, 98282=GeorgeJetStoned - Jul 02 2015 08:02 PM}",
    "textBeforeTable": "Toggle Travel Travel 10,475 replies 924 topics Hip Photos Post up any photos you like here, but again no porn. 64,121 replies 5,045 topics Member Photos Post a picture of yourself here. You can also add one to your profile. The photo must be on another server or our Hip Photo Gallery (see below for info). Please no porno, copyrighted material or very large images. Stats Forum   Toggle Image Galleries Image Galleries 7,691 replies 1,188 topics Yoga and Meditation Peaceful paths to health and enlightenment. 50,855",
    "textAfterTable": "Toggle Classifieds Classifieds   Forum Stats For Sale or Trade Please include location & other contact info. 1,222 topics 2,406 replies Help Wanted Please give as much info as possible including location & contact info. 437 topics 1,513 replies Personals All personal ads go here 1,873 topics 6,887 replies Toggle Forum Issues Forum Issues   Forum Stats",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}