{
    "relation": [
        [
            "Award Name",
            "Olivia James Traveling Fellowship",
            "Oncology Nursing Society Grant",
            "Oregon State University International Cultural Service Program",
            "Oregon State University Provosts Scholarship",
            "Overseas Research Fellowship",
            "Overseas Study Grants-In-Aid",
            "Oxford Royale Academy Scholarships",
            "Oxford Summer Academy",
            "Pacific Prime Global Diversity Scholarship",
            "Palmer B. Carson- PFLAG Jeanne Manford Scholarship For Glbt Leadership",
            "Palmer B. Carson-PFLAG Regional Scholarships",
            "Parker B Francis Fellowship In Pulmonary Research",
            "Passion For Fashion Scholarship",
            "Paul E Garber Fellowship",
            "Paul Stewart Award",
            "Paul Sumerall Memorial Scholarship",
            "Peace Revolution Africa Regional Fellowships 2013 – “Be the Peace Agent”",
            "Peace Revolution Artistic Fellowship in Thailand",
            "Peace Revolution Artistic Fellowship in Thailand - January 2014",
            "Pellegrini Scholarship",
            "PEO International Peace Scholarship",
            "Petro-Canada Graduate Research Award Program",
            "PFLAG National Scholarships",
            "PFLAG Scholarship For Students With At Least One Gay, Lesbian, Bisexual Or Trans",
            "PGMS Scholarship"
        ],
        [
            "Field",
            "Anthropology, History and Arts, Visual & Performing",
            "Nursing",
            "Unrestricted",
            "Unrestricted",
            "Medicine and Health Sciences",
            "Unrestricted",
            "Unrestricted",
            "Humanities, Political Science, Languages/Linguistics...",
            "Unrestricted",
            "Unrestricted",
            "Unrestricted",
            "Medicine and Health Sciences",
            "Unrestricted",
            "Aviation/Aerospace",
            "Veterinary and Animal Sciences",
            "Technology, Sociology, Journalism...",
            "Unrestricted",
            "Unrestricted",
            "Unrestricted",
            "Unrestricted",
            "Public / Community Service",
            "Natural Resources",
            "Accounting, Marine Biology, Plant Sciences...",
            "Unrestricted",
            "Agriculture"
        ],
        [
            "Description",
            "Fellowship for PhD candidates or recent recipients of their PhD. The award is to be used for travel and... Nationality: Unrestricted Host Countries: Turkey, Syria, Italy...",
            "To encourage the research career development of nurses through support of oncology clinically-oriented research. Nationality: Unrestricted Host Countries: United States",
            "Available only to international students enrolled at Oregon State. A select number of students (32-35) receive partial tuition remission scholarships... Nationality: Unrestricted Host Countries: United States",
            "Partial tuition scholarship for students of high academic achievement Nationality: Unrestricted Host Countries: United States",
            "To assist Australian graduates to take up a prearranged position overseas to either further their research and/or their training in... Nationality: Australian Host Countries: Unrestricted",
            "To provide postgraduates with the opportunity to travel overseas to undertake data collection, field trips, learn new techniques, pursue research... Nationality: Unrestricted Host Countries: Australia",
            "Candidates will be assessed on the following areas: Academic Potential (Personal Statement and Teacher Recommendation), 50% weight; Academic History (Previous Examination... Nationality: Unrestricted Host Countries: Unrestricted",
            "A challenging and exciting summer program for academically well motivated students, held in the University of Oxford. Full or partial... Nationality: Unrestricted Host Countries: United Kingdom",
            "Pacific Prime will award two $500 scholarships to international students who are enrolled for at least one semester of study... Nationality: Unrestricted Host Countries: Thailand, Taiwan, Singapore...",
            "Be a graduating high school senior entering higher education for the first time in fall. Self identify as either a... Nationality: Unrestricted Host Countries: United States",
            "Be a graduating high school senior entering higher education for the first time in fall. Self identify as either a... Nationality: Unrestricted Host Countries: United States",
            "For research in pulmonary medicine. Nationality: Unrestricted Host Countries: United States",
            "The Passion for Fashion Competition challenges people to create their own original design, fashion marketing, merchandising, or retail management plan.... Nationality: Unrestricted Host Countries: United States and Canada",
            "To offer opportunities for research in astronomy, geology, and space science. Nationality: Unrestricted Host Countries: United States",
            "One-time award for scientific research on birds. Nationality: Unrestricted Host Countries: Unrestricted",
            "Scholarships for projects/studies in the money transfer and remittance industry in fields directly related to the international transfer of funds,... Nationality: Unrestricted Host Countries: Unrestricted",
            "After successfully organizing two major events, last September, in Kenya and Nigeria, Peace Revolution will come back to Africa to... Nationality: Unrestricted Host Countries: Unrestricted",
            "Applications are open for the Peace Revolution Artistic Meditation Retreat in Thailand – This Artistic Meditation Retreat will bring together... Nationality: Unrestricted Host Countries: Unrestricted",
            "This fellowship will bring together twenty-five Artists from all around the world with different backgrounds and specialties in a two-week... Nationality: Unrestricted Host Countries: Unrestricted",
            "Award to students who merit an award of Swiss nationality. Nationality: American Host Countries: United States",
            "To allow women from other countries to pursue graduate study in the US and Canada. Nationality: Unrestricted Host Countries: United States and Canada",
            "For Canadian students to conduct research in specialized fields of study relating to the petroleum industry. Nationality: Canadian Host Countries: Unrestricted",
            "* Be a graduating high school senior entering higher education for the first time in fall. * Self identify... Nationality: Unrestricted Host Countries: Unrestricted",
            "Be a graduating high school senior entering higher education for the first time. Self identify as either a gay, lesbian,... Nationality: Unrestricted Host Countries: United States",
            "Each year the PGMS scholarship committee awards monetary scholarships to students in horticulture or related fields. Applicants must be at... Nationality: Unrestricted Host Countries: Unrestricted"
        ],
        [
            "10 25 50 100",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Browse Awards | International Scholarships Search | IEFA",
    "title": "",
    "url": "http://www.iefa.org/scholarships?Award_page=33&sort=name",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986615.83/warc/CC-MAIN-20150728002306-00135-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 499584703,
    "recordOffset": 499562380,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Search only independent award listings. Where are you from? Unrestricted Afghanistan Aland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Ashmore and Cartier Australia Austria Azerbaijan Bahrain Baker Island Bangladesh Barbados Bassas da India Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory British Virgin Islands Brunei Darussalam Bulgaria Burkina Faso Burma Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Clipperton Island Cocos (Keeling) Islands Colombia Comoros Congo, Democratic Republic of the Congo, Republic of the Cook Islands Coral Sea Islands Costa Rica Cote d Ivoire Croatia Cuba Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic East Timor Ecuador Egypt El Salvador Equatorial Guinea",
    "textAfterTable": "Go to page: << First < Previous 28 29 30 31 32 33 34 35 36 37 Next > Last >> 706 418 183 838 16 14 2196 1669 2141 1297 1300 643 1334 593 158 2374 2234 2451 2239 567 684 72 1301 1303 407 Sponsors Find us on Facebook",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}