{
    "relation": [
        [
            "Date",
            "Sep 30, 2003",
            "Feb 13, 2008",
            "Feb 13, 2008",
            "Oct 17, 2011",
            "Jan 15, 2014"
        ],
        [
            "Code",
            "FPAY",
            "SULP",
            "FPAY",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Fee payment",
            "Surcharge for late payment",
            "Fee payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Year of fee payment: 7",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: JPMORGAN CHASE BANK, N.A., AS ADMINISTRATIVE AGENT Free format text: SECURITY AGREEMENT;ASSIGNORS:NCR CORPORATION;NCR INTERNATIONAL, INC.;REEL/FRAME:032034/0010 Effective date: 20140106"
        ]
    ],
    "pageTitle": "Patent US6100790 - Modulated backscatter wireless communication system having an extended range - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6100790?dq=5958006",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00060-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480981615,
    "recordOffset": 480958437,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27663=This is a Continuation of application, Ser. No. 08/504,188, filed Jul. 17, 1995 now issued as U.S. Pat. No. 5,640,683; which is a file wrapper continuation of prior continuing application Ser. No. 08/206,075, filed on Mar. 4, 1994 now abandoned on Jul. 7, 1995., 31833=Such modulated backscatter technology has been used to implement the uplink communications path in a number of applications similar to ESL systems to date. The most common use of this technology is to communicate with a vehicle tag as that vehicle passes through a toll collection station; the purpose of that communication is to electronically pay the toll of that vehicle without requiring the vehicle to slow down and pay a toll. Such a system (described in U.S. Pat. Nos. 4,075,632 issued Feb. 21, 1978 to H. W. Baldwin et al; 4,739,328 issued Apr. 19, 1988 to A. R. Koelle et al; and 4,786,907 issued Nov. 22, 1988 to A. R. Koelle) typically utilizes line-of-sight communications from the toll collection station to the vehicle tag. This system also utilizes directional antennas at the toll collection station to maximize the signal-to-noise ratio to obtain a reliable communications path. However, despite the use of these techniques, the effective range of these systems can be very limited, perhaps to as little as 10-20 feet from the toll collection station to the vehicle.}",
    "textBeforeTable": "Patent Citations What has been described, then, is merely illustrative of the application of the principles of the present invention. Other arrangements and methods can be implemented by those skilled in the art without departing from the spirit and scope of the present invention. Finally, the ceiling receiver can listen to an uplink frequency f6 that is close to other uplink frequencies; but f6 is known to have no uplink signal present from any ESL tag. The uplink at f6 thereby serves as a \"noise\" reference for establishing decision thresholds to detect if, for example, the uplink at f1 is present. The hypothesis is that any interference would be wider in bandwidth and span the frequencies f1 through f5. Instead of several ESL tags applying uplink signals at frequencies f2, f3, . . . etc., respectively, it is also possible for one ESL tag to simultaneously respond on multiple uplink frequencies. In this way, the uplinks can be a multi-state symbol (e.g., a 4-bit symbol f2,f3,f4,f5) and more information can be conveyed in a given time period. Yet, these frequencies can be chosen to avoid the noise from fluorescent lights. The limited states of a narrowband uplink, i.e., absent or present, need not restrict uplink communications to two states. As in the game of \"20 Questions\", sequential uplinks can be used to convey complete information. Note that the use of narrowband signals in the uplink path does not",
    "textAfterTable": "Jul 14, 1986 Nov 22, 1988 Amtech Corporation Transponder useful in a system for identifying objects US4888591 * Oct 6, 1988 Dec 19, 1989 Amtech Technology Corporation Signal discrimination system US4924363 * Feb 15, 1989 May 8, 1990 Dapopp Products Ltd. Attention-attracting device for use beneath a display shelf US4926187 * Sep 26, 1988 May 15, 1990 Fujitsu Limited Radio-frequency identification system US5030807 * Jan 16, 1990 Jul 9, 1991 Amtech Corporation System for reading and writing data from and into remote tags US5140701 * Apr 12, 1991 Aug 18, 1992 Comsat Carrier signal detection circuit featuring a wide range of signal/noise performance US5166676 * Feb 16, 1990 Nov 24, 1992 Destron/Idi, Inc. Identification system US5172314 * May 3, 1991 Dec 15, 1992 Electronic Retailing",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}