{
    "relation": [
        [
            "Citing Patent",
            "US7444108 *",
            "US7583905 *",
            "US7590464",
            "US7590501",
            "US7689311",
            "US7697166",
            "US7746524 *",
            "US7925366",
            "US7995225",
            "US8049935",
            "US8078082 *",
            "US8169657",
            "US8203750",
            "US8253958",
            "US8284416 *",
            "US8587833",
            "US20100271649 *"
        ],
        [
            "Filing date",
            "Mar 31, 2005",
            "Jul 18, 2007",
            "May 29, 2007",
            "Aug 28, 2007",
            "May 29, 2007",
            "Aug 3, 2007",
            "Dec 23, 2005",
            "May 29, 2007",
            "Jun 7, 2010",
            "Jan 17, 2011",
            "Dec 10, 2008",
            "May 9, 2007",
            "Aug 1, 2007",
            "Apr 30, 2007",
            "Apr 27, 2009",
            "Jun 14, 2012",
            "Apr 27, 2009"
        ],
        [
            "Publication date",
            "Oct 28, 2008",
            "Sep 1, 2009",
            "Sep 15, 2009",
            "Sep 15, 2009",
            "Mar 30, 2010",
            "Apr 13, 2010",
            "Jun 29, 2010",
            "Apr 12, 2011",
            "Aug 9, 2011",
            "Nov 1, 2011",
            "Dec 13, 2011",
            "May 1, 2012",
            "Jun 19, 2012",
            "Aug 28, 2012",
            "Oct 9, 2012",
            "Nov 19, 2013",
            "Oct 28, 2010"
        ],
        [
            "Applicant",
            "Xerox Corporation",
            "Kabushiki Kaisha Toshiba",
            "Palo Alto Research Center Incorporated",
            "Xerox Corporation",
            "Palo Alto Research Center Incorporated",
            "Xerox Corporation",
            "Xerox Corporation",
            "Xerox Corporation",
            "Xerox Corporation",
            "Xerox Corp.",
            "Xerox Corporation",
            "Xerox Corporation",
            "Xerox Corporation",
            "Xerox Corporation",
            "Xerox Corporation",
            "Xerox Corporation",
            "Xerox Corporation"
        ],
        [
            "Title",
            "Parallel printing architecture with parallel horizontal printing modules",
            "Image forming apparatus and image forming method",
            "System and method for on-line planning utilizing multiple planning queues",
            "Scanner calibration robust to lamp warm-up",
            "Model-based planning using query-based component executable instructions",
            "Color job output matching for a printing system",
            "Bi-directional inverter printing apparatus and method",
            "System and method for real-time system control using precomputed plans",
            "Scheduling system",
            "Optical scanner with non-redundant overwriting",
            "Modular printing system",
            "Registration method using sensed image marks and digital realignment",
            "Color job reprint set-up for a printing system",
            "Scheduling system",
            "Digital image printing a job including monochromatic and color images",
            "Color job reprint set-up for a printing system",
            "Digital image printing a job including monochromatic and color images"
        ]
    ],
    "pageTitle": "Patent US7206536 - Printing system with custom marking module and method of printing - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7206536?ie=ISO-8859-1&dq=5,072,412",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00128-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 462729851,
    "recordOffset": 462701027,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{32379=The following references, the disclosures of which are incorporated herein by reference in their entireties, variously relate to “tandem engine” printers, “parallel” printers, “cluster printing”, and “output merger” or “interposer” systems: U.S. Pat. No. 5,568,246 to Keller, et al., U.S. Pat. No. 4,587,532 to Asano, U.S. Pat. No. 5,570,172 to Acquaviva, U.S. Pat. No. 5,596,416 to Barry, et al.; U.S. Pat. No. 5,995,721 to Rourke et al; U.S. Pat. No. 4,579,446 to Fujino; U.S. Pat. No. 5,389,969 to to Soler, et al.; a 1991 “Xerox Disclosure Journal” publication of November–December. 1991, Vol. 16, No. 6, pp. 381–383 by Paul F. Morgan; and a Xerox Aug. 3, 2001 “TAX” publication product announcement entitled “Cluster Printing Solution Announced.”, 57264=In turn, the scheduling system 154 receives information about the document to be printed from a previewer 156, which may located along with the scheduling system 154 and paper path controller 152 within the overall control system 150 for the printing system or elsewhere, such as in the network server or in individual workstations linked thereto. Various methods of scheduling print media sheets may be employed. For example, U.S. Pat. No. 5,095,342 to Farrell, et al.; U.S. Pat. No. 5,159,395 to Farrell, et al.; U.S. Pat. No. 5,557,367 to Yang, et al.; U.S. Pat. No. 6,097,500 to Fromherz; and U.S. Pat. No. 6,618,167 to Shah; and as described, for example, in U.S. application Ser. No. 10/284,560, filed Oct. 30, 2002, for PLANNING AND SCHEDULING RECONFIGURABLE SYSTEMS WITH REGULAR AND DIAGNOSTIC JOBS, by Fromherz; U.S. application Ser. No. 10/284,561, filed Oct. 30, 2002, for PLANNING AND SCHEDULING RECONFIGURABLE SYSTEMS WITH ALTERNATIVE CAPABILITIES by Fromherz; U.S. application Ser. No. 10/424,322, filed Apr. 28, 2003, for MONITORING AND REPORTING INCREMENTAL JOB STATUS SYSTEM AND METHOD by Fromherz, and copending application Ser. No. 10/924,458, filed Aug. 23, 2004, entitled PRINT SEQUENCE SCHEDULING FOR RELIABILITY, all of which are incorporated herein in their entireties by reference, disclose exemplary job scheduling systems which can be used to schedule the print sequence herein, with suitable modifications, such as to include scheduling of the routing of print media to interchangeable marking modules.}",
    "textBeforeTable": "Patent Citations It will be appreciated that various of the above-disclosed and other features and functions, or alternatives thereof, may be desirably combined into many other different systems or applications. Also that various presently unforeseen or unanticipated alternatives, modifications, variations or improvements therein may be subsequently made by those skilled in the art which are also intended to be encompassed by the following claims. The modular architecture enables a wide range of marking engines to be selectively employed in the same system. The marking engines can involve a variety of types and processing speeds. The modular architecture can provide redundancy for marking engines and paths. The modular architecture can utilize as little as a single media source on the input side, a single printer module and a single finisher on the output side. It is to be appreciated that an advantage of the system is that it can achieve very high productivity, using marking processes in elements that do not have to run at high speeds and marking/finishing processes that can continue to run while other marking engines are being serviced or replaced. Although not shown, other examples of the modular architecture can include an odd number of marking engines. For example, three marking engines can be configured such that two are aligned vertically and two are aligned horizontally, wherein one of the marking engines is common to both the vertical and horizontal alignment. The",
    "textAfterTable": "US5570172 Jan 18, 1995 Oct 29, 1996 Xerox Corporation Two up high speed printing system US5570451 * Oct 18, 1994 Oct 29, 1996 Canon Kabushiki Kaisha Image forming apparatus including plural image forming means and plural recording medium transport passages US5596416 Jan 13, 1994 Jan 21, 1997 T/R Systems Multiple printer module electrophotographic printing device US5629762 Jun 7, 1995 May 13, 1997 Eastman Kodak Company Image forming apparatus having a duplex path and/or an inverter US5710968 Aug 28, 1995 Jan 20, 1998 Xerox Corporation Bypass transport loop sheet insertion system US5778377 Nov 4, 1994 Jul 7, 1998 International Business Machines Corporation Table driven graphical user interface US5884910 Aug 18, 1997 Mar 23, 1999 Xerox Corporation Evenly retractable and self-leveling nips sheets ejection system US5953559 * Aug 31, 1998 Sep 14, 1999 Ricoh Company, Ltd. Device and method for forming full-color",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}