{
    "relation": [
        [
            "Date",
            "Jul 9, 2008",
            "Jan 13, 2011",
            "May 30, 2012",
            "May 7, 2014",
            "Aug 1, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: CAYENNE MEDICAL, INC., ARIZONA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:BAIRD, KEVIN N.;HARPER, DEREK J.;KOVALSKI, JOANNE, (FOR JOE P. KOVALSKI);AND OTHERS;REEL/FRAME:021216/0692;SIGNING DATES FROM 20080214 TO 20080222 Owner name: CAYENNE MEDICAL, INC., ARIZONA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:BAIRD, KEVIN N.;HARPER, DEREK J.;KOVALSKI, JOANNE, (FOR JOE P. KOVALSKI);AND OTHERS;SIGNING DATES FROM 20080214 TO 20080222;REEL/FRAME:021216/0692",
            "Owner name: VENTURE LENDING & LEASING VI, INC., CALIFORNIA Free format text: SECURITY AGREEMENT;ASSIGNOR:CAYENNE MEDICAL, INC.;REEL/FRAME:025626/0518 Effective date: 20110112 Owner name: VENTURE LENDING & LEASING V, INC., CALIFORNIA Free format text: SECURITY AGREEMENT;ASSIGNOR:CAYENNE MEDICAL, INC.;REEL/FRAME:025626/0518 Effective date: 20110112",
            "Owner name: CAYENNE MEDICAL, INC., ARIZONA Free format text: RELEASE BY SECURED PARTY;ASSIGNORS:VENTURE LENDING & LEASING V, INC.;VENTURE LENDING & LEASING VI, INC.;REEL/FRAME:028292/0812 Effective date: 20120525",
            "Owner name: VENTURE LENDING & LEASING VI, INC., CALIFORNIA Free format text: SECURITY INTEREST;ASSIGNOR:CAYENNE MEDICAL, INC.;REEL/FRAME:032841/0715 Effective date: 20140211 Owner name: VENTURE LENDING & LEASING VII, INC., CALIFORNIA Free format text: SECURITY INTEREST;ASSIGNOR:CAYENNE MEDICAL, INC.;REEL/FRAME:032841/0715 Effective date: 20140211",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7879094 - Systems for material fixation - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7879094?dq=7143430",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00309-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 469444739,
    "recordOffset": 469406621,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6279=Referring now to FIGS. 2-9, a preferred method of using the disclosed inventive implant will now be discussed. In FIGS. 2A and 2B, the implant 10 of FIG. 1 is shown in its undeployed orientation. A preferred procedure for deploying the implant is generally similar in many respects to the procedure disclosed in U.S. Patent Application Publication No. 2006/0155287, herein already expressly incorporated by reference.}",
    "TableContextTimeStampAfterTable": "{26860=This application is also related to co-pending U.S. application Ser. No. 11/281,566 entitled Devices, Systems, and Methods for Material Fixation, filed on Nov. 18, 2005 and published as U.S. Patent Application Publication No. US 2006/0155287 on Jul. 13, 2006, and to co-pending U.S. application Ser. No. 11/725,981, entitled Devices, Systems, and Methods for Material Fixation, filed on Mar. 20, 2007. Both of these prior pending applications are commonly owned and herein expressly incorporated by reference., 26556=This application claims the benefit under 35 U.S.C. 119(e) of the filing date of Provisional U.S. Application Ser. No. 60/854,178, entitled Methods and Systems for Material Fixation, filed on Oct. 24, 2006, which application is expressly incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations Accordingly, although exemplary embodiments of the invention has been shown and described, it is to be understood that all the terms used herein are descriptive rather than limiting, and that many changes, modifications, and substitutions may be made by one having ordinary skill in the art without departing from the spirit and scope of the invention. . Once this anchor is in place, the proximal ends of the tendon bundles are trimmed to complete the procedure. This portion of the ACL reconstruction procedure is fully explained in co-pending U.S. application Ser. No. 11/725,981, which has already been fully and expressly incorporated by reference herein. Any suitable tibial anchor 102 may be used in conjunction with femoral anchors of the type disclosed in this application, but the tibial anchors shown and described in the 981 patent application are presently preferred. FIG. 55 , illustrate the installation of the femoral anchor of the present invention, in various embodiments. However, as one skilled in the art would understand, to complete the repair procedure further steps are necessary. Once the femoral anchor has been deployed and installed, as previously described, the anchored tendons 70 extend proximally from the femoral tunnel through the tibial tunnel and out through tibial aperture 66. To complete the procedure, a tibial anchor 102 is preferably installed, to anchor the tendon bundles in place, as shown in FIGS. 41 and 42",
    "textAfterTable": "Self-seating expansion anchor US5176709 Feb 5, 1992 Jan 5, 1993 Medevelop Ab Method for inserting an anchoring element within a bone US5211647 Feb 19, 1992 May 18, 1993 Arthrex Inc. Interference screw and cannulated sheath for endosteal fixation of ligaments US5234430 Dec 18, 1991 Aug 10, 1993 Huebner Randall J Orthopedic fixation screw and method US5236445 May 14, 1992 Aug 17, 1993 American Cyanamid Company Expandable bone anchor and method of anchoring a suture to a bone US5258016 Feb 14, 1992 Nov 2, 1993 American Cyanamid Company Suture anchor and driver assembly US5268001 Sep 25, 1991 Dec 7, 1993 Innovasive Devices, Inc. Bone fastener US5320626 Feb 19, 1992 Jun 14, 1994 Arthrex Inc. Endoscopic drill guide US5336240 Mar 3, 1992 Aug 9, 1994 Liebscherkunststofftechnik Bone-dowel assembly for anchoring a suture US5350383 Feb 18, 1993 Sep",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}