{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "Website Feedback Forum for technical support, feedback and questions about the autosport.com website. Suggestions and constructive criticisms are welcome as well.",
            "Racing Comments The place for debates on the current affairs of Formula 1, rallying, MotoGP, NASCAR, V8, Indycar, and all other forms of motorsport. Be warned: arguments are welcome, personal insults are not. Subforum: RC's Bets & Games",
            "The Paddock Club Forum for FULL MEMBERS only (those with at least 30 posts on the board). The place to talk about (almost!) any non-motorsport topic, while sipping champagne and socialising with others. To gain access you have to PM the Paddock bouncer Slartibartfast and beg...",
            "Racing Simulators The place to find out which racing simulator to buy, what is the recommended set-up and how to improve your lap times",
            "The Technical Forum The place to discuss the technical aspect of F1, including driving techniques, engine statistics and aerodynamics",
            "The Nostalgia Forum A forum dedicated to the research, study, discussion, and just plain ol' talking about the history of motor sports. Questions are always welcomed; variety is encouraged. If you have an interest in the history of motor sports, this is the place to be! Subforums: Motorcycle Racing Nostalgia, Racing Collectables, Historical Research",
            "Grand Prix Travelling Going to a Grand Prix? Been there, done that -- and want to share your experience? Post your questions and comments here",
            "For Sale & Want Ads Got F1 related things to sell? Want to buy something? Post here and see what the Bulletin Board members can do."
        ],
        [
            "Stats",
            "2,589 topics 27,875 replies",
            "55,685 topics 4,049,486 replies",
            "743 topics 214,164 replies",
            "2,566 topics 49,504 replies",
            "5,965 topics 131,746 replies",
            "28,988 topics 769,620 replies",
            "1,168 topics 7,100 replies",
            "1,505 topics 2,072 replies"
        ],
        [
            "Last Post Info",
            "Delayed print subs deliveri... By milestone 11 Yesterday, 11:48",
            "How advantageous would it b... By stewie Today, 06:36",
            "Protected Forum By Vitesse2 Today, 06:00",
            "Dirt Rally By Myrvold Yesterday, 20:34",
            "Drag Racing Boats By Bob Riebe Today, 04:23",
            "Gold Bug Lotus 26R, who can... By Ray Bell Today, 04:42",
            "First GP, Spa '15 quest... By Kristian Yesterday, 11:20",
            "Drivers looking for racing... By drivehunters Today, 01:18"
        ]
    ],
    "pageTitle": "The AUTOSPORT Forums",
    "title": "",
    "url": "http://forums.autosport.com/index.php?act=Post&CODE=02&f=10&t=26190&qpid=1421685",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 91785425,
    "recordOffset": 91769031,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16465=Prost1997T - Yesterday, 18:17, 19234=Joe Bosworth - Yesterday, 12:38, 15749=aramos - Today, 01:16, 18516=cabianca - Yesterday, 13:28, 14997=drivehunters - Today, 01:18, 17138=D-Type - Yesterday, 17:31, 14382=Vettelari - Today, 01:49, 17800=Wally123 - Yesterday, 16:42}",
    "textBeforeTable": "Toggle Forums Forums You currently have javascript disabled. Several functions may not work. Please re-enable javascript to access full functionality. Javascript Disabled Detected More Forums Members View New Content Quick Navigation  Help Files Members Forums Search section:",
    "textAfterTable": "Recent Topics How advantageous would it be for a backmarker team to focus all efforts into 1 single track? Vettelari - Today, 01:49 Drivers looking for racing team drivehunters - Today, 01:18 The \"manual starts\" or \"less completely automated start\" thread. aramos - Today, 01:16 Another F4 championship launches... Prost1997T - Yesterday, 18:17 Track Information D-Type - Yesterday, 17:31",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}