{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "Interactive Forums Twitter Database A moderated forum for use during chats with current and former players, coaches, and Front Office Staff of the Redskins as well as containing the RedskinsRadio forum where you get a chance to ask questions every day for discussion on the daily show",
            "\"Unofficial\" ES 2006 Mock Draft A member-driven and run Mock Draft Forum.",
            "ExtremeSkins Ring Of Fame Memorial forum for members that are no longer with us. Though you may be gone, you are not forgotten.",
            "Online Gaming Leagues PS3 Forum A separate forum for organization and discussion for Madden and other online gaming leagues. Challenge you fellow ESers to an organized tournament or an individual match up. Game on!",
            "Washington Redskins Graphic Library ExtremeSkins members are encouraged to post and share any Washington Redskins and NFL images they may have found on the internet or created themselves for the benefit and enjoyment of the community.",
            "Skin Flicks (The Film Room) ExtremeSkins.com staff and contributing members are inviting you to review some home-made Washington Redskins game highlights."
        ],
        [
            "Stats",
            "3 topics 76 replies",
            "47 topics 558 replies",
            "1 topics 0 replies",
            "144 topics 2,242 replies",
            "937 topics 11,744 replies",
            "1,071 topics 8,752 replies"
        ],
        [
            "Last Post Info",
            "ES Members - Post your twit... By Dukes and Skins 07 Feb 2015",
            "Rate who you think had the... By Tazhog 11 May 2006",
            "In Memory Of By TK 23 Mar 2008",
            "Looking for Video Game Simu... By Jermaine76 14 Mar 2015",
            "HELP! Looking for Panoramic... By monstercb2002 21 Jul 2015",
            "For the fans video By timitim 27 Jun 2015"
        ]
    ],
    "pageTitle": "Extremeskins",
    "title": "",
    "url": "http://es.redskins.com/newreply.php?do=newreply&p=8604687",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00313-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 85398875,
    "recordOffset": 85375244,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{20820=Redskins Nation is a half-hour show devoted to giving fans unfiltered access to the day's events at Redskins Park. Hosted by Larry Michael, the show features Redskins players, coaches and sit-down interviews with team officials. (Show re-airs at 11:30 p.m/7:30 a.m. daily)}",
    "TableContextTimeStampAfterTable": "{52487=Jermaine76 - Today, 05:23 PM, 56476=thesubmittedone, Monk4thaHALL, kaimu, Riggo-toni, Google, Jumbo, jobaga, Metalhead, Bing, nemocystem, J.W.Deville, TryTheBeal!, TheDoyler23, Secret Agent X-9, Yahoo, burgngold fan, tibbidoe, Mr. Sinister, Shiv, wit33, Springfield, steve09ru, Dirt, redrobert, Ghost of Nibbs McPimpin, skinfan2k, SloppyOneXXVI, bowhunter, panahoo, Dheavy, Momma There Goes That Man, Ertic, bga76, TerrificTim, grego, skinsfan_1215, Major Harris, Digger, Murphs56, Dr. Do Itch Big, DieHardSkins88, BLEED-B&G, ASalty, Supreme Wu, youngestson, Widget_5, B.A.M.F., Taylor703, mossomo, Main-Maine, skinfan57, SemperFi Skins, BombBird2121, J-bomb, bigmatt496, Wyndorf25, Kosher Ham, Section106, Zazzaro703, slaga, Taco Bell, ConnSKINS26, D'Pablo, tonyro, I.fskinsfan, samy316, skinsphan, remixedinfinity, SkinsFanRob, RawRebel, Jacoby6644, storretti, Gymratfwp, COWBOY-KILLA-, HeavyHTTR, FireInHisBelly, SKINSFAN87, galloprf, JK79, LuRedskins, Snagletooth, Skin em, MonkFan8, skinsfan999, JWB, PokerPacker, MrWill, Zguy28, Mista T, HAILSKINSNYC, Die Hard, hogdirty, 30148=The complete archive of posts from The Stadium forum for the 2004 season., 33204=The complete archive of posts from The Stadium forum for the 2002 season., 51160=BRAVEONAWARPATH - Today, 07:53 PM, 53925=Howie411 - Today, 04:36 PM, 53253=TK - Today, 05:06 PM, 1210=Enjoy speaking about the Washington Redskins in friendly confines amongst your fellow Skins fans. Hail Skins! See ARCHIVES forums below for threads from 2001-2008, 51815=ExtremeSkins Staff - Today, 07:11 PM, 28584=The complete archive of posts from The Stadium forum for the 2005 season., 34648=The complete archive of posts from The Stadium forum for the 2001 season., 31680=The complete archive of posts from The Stadium forum for the 2003 season.}",
    "textBeforeTable": "Toggle THE CLUB LEVEL Forums THE CLUB LEVEL Forums Today, 07:39 PM By goskins10 Practice Notes: 2015 #Skins... 4,943 replies 3,431 topics Redskins.com News A separate news forum for Redskins.com articles. If you used to comment on the articles directly on Redskins.com, this is the new home for doing so. Today, 08:07 PM By Skinsfan1311 Wife pregnant--selling my s... 51,946 replies 14,673 topics The Classifieds Buy, sell or trade here. Members are encouraged to use this forum to purchase or sell single game or season's tickets, parking passes or any other",
    "textAfterTable": "Toggle STADIUM MAINTAINANCE Forums STADIUM MAINTAINANCE Forums   Forum Stats Last Post Info Feedback and Tech Support An outlet for members inclined to offer feedback and suggestions regarding the facilities. As well as ask for assistance with any technical issues. 961 topics 6,257 replies Some posts linked into wron... By Larry 19 Jun 2015 Toggle THE REDSKINS TRADITION THE REDSKINS TRADITION   Forum Stats Last Post Info",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}