{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6"
        ],
        [
            "RxCUI",
            "1362706",
            "1362706",
            "1362712",
            "1362712",
            "1362720",
            "1362720"
        ],
        [
            "RxNorm NAME",
            "mexiletine hydrochloride 150 MG Oral Capsule",
            "Mexiletine Hydrochloride 150 MG Oral Capsule",
            "mexiletine hydrochloride 200 MG Oral Capsule",
            "Mexiletine Hydrochloride 200 MG Oral Capsule",
            "mexiletine hydrochloride 250 MG Oral Capsule",
            "Mexiletine Hydrochloride 250 MG Oral Capsule"
        ],
        [
            "RxTTY",
            "PSN",
            "SCD",
            "PSN",
            "SCD",
            "PSN",
            "SCD"
        ]
    ],
    "pageTitle": "DailyMed - MEXILETINE HYDROCHLORIDE- mexiletine hydrochloride capsule",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=693DA40B-26D4-40D6-87D1-158E256F40AB",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00024-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 57367151,
    "recordOffset": 57334591,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{52974=Among 10,867 patients treated with mexiletine in the compassionate use program, marked leukopenia (neutrophils less than 1000/mm3) or agranulocytosis were seen in 0.06% and milder depressions of leukocytes were seen in 0.08%, and thrombocytopenia was observed in 0.16%. Many of these patients were seriously ill and receiving concomitant medications with known hematologic adverse effects. Rechallenge with mexiletine in several cases was negative. Marked leukopenia or agranulocytosis did not occur in any patient receiving mexiletine alone; five of the six cases of agranulocytosis were associated with procainamide (sustained release preparations in four) and one with vinblastine. If significant hematologic changes are observed, the patient should be carefully evaluated, and, if warranted, mexiletine should be discontinued. Blood counts usually return to normal within a month of discontinuation (see ADVERSE REACTIONS)., 44566=Mexiletine hydrochloride commonly produces reversible gastrointestinal and nervous system adverse reactions but is otherwise well tolerated. Mexiletine has been evaluated in 483 patients in one month and three month controlled studies and in over 10,000 patients in a large compassionate use program. Dosages in the controlled studies ranged from 600 to 1200 mg/day; some patients (8%) in the compassionate use program were treated with higher daily doses (1600 to 3200 mg/day). In the three month controlled trials comparing mexiletine to quinidine, procainamide and disopyramide, the most frequent adverse reactions were upper gastrointestinal distress (41%), lightheadedness (10.5%), tremor (12.6%) and coordination difficulties (10.2%). Similar frequency and incidence were observed in the one month placebo-controlled trial. Although these reactions were generally not serious, and were dose-related and reversible with a reduction in dosage, by taking the drug with food or antacid or by therapy discontinuation, they led to therapy discontinuation in 40% of patients in the controlled trials. Table 1 presents the adverse events reported in the one-month placebo-controlled trial., 10534=Satisfactory control can be achieved in most patients by 200 to 300 mg given every eight hours with food or antacid. If satisfactory response has not been achieved at 300 mg q8h, and the patient tolerates mexiletine well, a dose of 400 mg q8h may be tried. As the severity of CNS side effects increases with total daily dose, the dose should not exceed 1200 mg/day., 17370=Syncope and hypotension, each about 6 in 1000; bradycardia, about 4 in 1000; angina/angina-like pain, about 3 in 1000; edema, atrioventricular block/conduction disturbances and hot flashes, each about 2 in 1000; atrial arrhythmias, hypertension and cardiogenic shock, each about 1 in 1000., 16776=Short-term memory loss, about 9 in 1000 patients; hallucinations and other psychological changes, each about 3 in 1000; psychosis and convulsions/seizures, each about 2 in 1000; loss of consciousness, about 6 in 10,000., 54589=In three month controlled trials, elevations of SGOT greater than three times the upper limit of normal occurred in about 1% of both mexiletine-treated and control patients. Approximately 2% of patients in the mexiletine compassionate use program had elevations of SGOT greater than or equal to three times the upper limit of normal. These elevations frequently occurred in association with identifiable clinical events and therapeutic measures such as congestive heart failure, acute myocardial infarction, blood transfusions and other medications. These elevations were often asymptomatic and transient, usually not associated with elevated bilirubin levels and usually did not require discontinuation of therapy. Marked elevations of SGOT (> 1000 U/L) were seen before death in four patients with end-stage cardiac disease (severe congestive heart failure, cardiogenic shock)., 51882=Convulsions (seizures) did not occur in mexiletine controlled clinical trials. In the compassionate use program, convulsions were reported in about 2 of 1000 patients. Twenty-eight percent of these patients discontinued therapy. Convulsions were reported in patients with and without a prior history of seizures. Mexiletine should be used with caution in patients with known seizure disorder., 4768=Rev. D 3/2015}",
    "textBeforeTable": "Number of versions: 5 MEXILETINE HYDROCHLORIDE- mexiletine hydrochloride capsule View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Boxed Warnings, Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close Labeler - Teva Pharmaceuticals USA Inc (001627975) 06/05/1995 ANDA074377 ANDA Marketing End Date Marketing Start Date Application Number or Monograph Citation Marketing Category Marketing Information 06/05/1995 100 in 1 BOTTLE; Type 0: Not a Combination Product NDC:0093-8741-01 1",
    "textAfterTable": "RxCUI RxNorm NAME RxTTY 1 1362706 mexiletine hydrochloride 150 MG Oral Capsule PSN 2 1362706 Mexiletine Hydrochloride 150 MG Oral Capsule SCD 3 1362712 mexiletine hydrochloride 200 MG Oral Capsule PSN 4 1362712 Mexiletine Hydrochloride 200 MG Oral Capsule SCD 5 1362720 mexiletine hydrochloride 250 MG Oral Capsule PSN 6 1362720 Mexiletine Hydrochloride 250 MG Oral Capsule SCD Get Label RSS Feed for this Drug MEXILETINE HYDROCHLORIDE- mexiletine hydrochloride capsule To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=693DA40B-26D4-40D6-87D1-158E256F40AB To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To view updated drug label links, paste the RSS feed address (URL) shown below into a RSS reader, or use a browser which supports RSS feeds, such as",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}