{
    "relation": [
        [
            "",
            "Maximum exposure under the limited guarantees",
            "Less: Guarantee claims paid (inception-to-date)",
            "Less: Amount of exposure recognized as a contingent liability",
            "Maximum Off-Balance-Sheet Exposure Under the Limited Guarantees"
        ],
        [
            "2002",
            "$243,764",
            "(35,034)",
            "(6,508)",
            "$202,222"
        ],
        [
            "2001",
            "$330,936",
            "(34,756)",
            "(3,966)",
            "$292,214"
        ]
    ],
    "pageTitle": "FDIC: 2002 Annual Report - Financial Statements and Notes",
    "title": "",
    "url": "https://www.fdic.gov/about/strategic/report/2002annualreport/pgs41-58.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00311-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 932577475,
    "recordOffset": 932547747,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{89527=The depreciation expense was $47 million and $45 million for 2002 and 2001, respectively., 97866=Provision for insurance losses was a negative $87 million for 2002 and $1.8 billion for 2001. The following chart lists the major components of the provision for insurance losses., 95763=As stated above, the FDICIA requires the FDIC to maintain the insurance funds at a designated reserve ratio (DRR) of not less than 1.25 percent of estimated insured deposits (or a higher percentage as circumstances warrant). As of September 30, 2002, the BIF reserve ratio was 1.25 percent of estimated insured deposits. The FDICIA authorizes and mandates BIF assessments if needed to maintain the fund at the DRR or to return the fund to the DRR if it falls below the DRR. The FDIC is required to set semiannual assessment rates that are sufficient to increase the reserve ratio to the DRR not later than one year after such rates are set, or in accordance with a recapitalization schedule of fifteen years or less., 96487=The DIFA provided, among other things, for the elimination of the mandatory minimum assessment formerly provided for in the FDI Act. It also provided for the expansion of the assessment base for payments of the interest on obligations issued by the Financing Corporation (FICO) to include all FDIC-insured institutions, and it made the FICO assessment separate from regular assessments, effective on January 1, 1997. The FICO was established by the Competitive Equality Banking Act of 1987 as a mixed-ownership government corporation whose sole purpose was to function as a financing vehicle for the FSLIC., 48080=The Omnibus Budget Reconciliation Act of 1990 (1990 OBR Act), the Federal Deposit Insurance Corporation Improvement Act of 1991 (FDICIA), and the Deposit Insurance Funds Act of 1996 (DIFA) made changes to the FDIC's assessment authority (see Note 7) and borrowing authority. The FDICIA also requires the FDIC to: 1) resolve failing institutions in a manner that will result in the least possible cost to the deposit insurance funds and 2) maintain the insurance funds at not less than 1.25 percent of estimated insured deposits or a higher percentage as circumstances warrant., 94245=The 1990 OBR Act removed caps on assessment rate increases and authorized the FDIC to set assessment rates for BIF members semiannually, to be applied against a member's average assessment base. The FDICIA: 1) required the FDIC to implement a risk-based assessment system; 2) authorized the FDIC to increase assessment rates for BIF-member institutions as needed to ensure that funds are available to satisfy the BIF's obligations; 3) required the FDIC to build and maintain the reserves in the insurance funds to not less than 1.25 percent of estimated insured deposits; and 4) authorized the FDIC to increase assessment rates more frequently than semiannually and impose emergency special assessments as necessary to ensure that funds are available to repay U.S. Treasury borrowings., 50978=The BIF is primarily funded from: 1) interest earned on investments in U.S. Treasury obligations and 2) deposit insurance assessments. Additional funding sources are U.S. Treasury and Federal Financing Bank (FFB) borrowings, if necessary. The 1990 OBR Act established the FDIC's authority to borrow from the FFB on behalf of the BIF and the SAIF. The FDICIA increased the FDIC's authority to borrow for insurance purposes from the U.S. Treasury, on behalf of the BIF and the SAIF, from $5 billion to $30 billion., 116729=Financial instruments that potentially subject the BIF to credit risk consist primarily of gross receivables from bank resolutions totaling $6.1 billion. The receivables from bank resolutions include payments made to cover obligations to insured depositors, advances to receiverships to provide working capital, and receivables for expenses paid by the BIF on behalf of receiverships. Assets held by the FDIC in its receivership capacity for closed BIF-insured institutions are the main source of repayment of the BIF's receivables from closed banks. An allowance for loss of $5.6 billion, or 92% of the gross receivable, was recorded as of December 31, 2002. Of the remaining eight percent of the gross receivable, the amount of credit risk is limited since 77% of the receivable will be repaid from receivership cash and cash equivalents., 70486=(b) For TIIS, the yields in the above table are stated at their real yields at purchase, not their effective yields. Effective yields on TIIS include a long-term annual inflation assumption as measured by the CPI-U. The long-term CPI-U consensus forecast is 2.4%, based on figures issued by the Office of Management and Budget and the Congressional Budget Office in early 2002., 45296=The U.S. Congress created the Federal Deposit Insurance Corporation (FDIC) through enactment of the Banking Act of 1933. The FDIC was created to restore and maintain public confidence in the nation's banking system., 97101=The annual FICO interest obligations of approximately $790 million are paid on a pro rata basis using the same rate for banks and thrifts. The FICO assessment has no financial impact on the BIF. The FICO assessment is separate from the regular assessments and is imposed on banks and thrifts, not on the insurance funds. The FDIC, as administrator of the BIF and the SAIF, is acting solely as a collection agent for the FICO. During 2002 and 2001, $621 million and $627 million, respectively, was collected from BIF-member institutions and remitted to the FICO., 82049=As of December 31, 2002 and 2001, the unamortized premium, net of the unamortized discount, was $508 million and $499 million, respectively., 59460=There were no available-for-sale securities sold during 2002. In 2001, the BIF reported a gross realized gain of $78 million on the sale of securities designated as available-for-sale. Proceeds from the sales were $1.5 billion. Specific identification was used to determine cost of the securities sold in computing the realized gain., 49258=Legislation on deposit insurance reform was introduced during February 2002 in the House and Senate. The House acted on the FDIC's recommendations by passing legislation, H.R. 3717, the Federal Deposit Insurance Reform Act of 2002, on May 22, 2002. Another reform bill, S. 1945, the Safe and Fair Deposit Insurance Act of 2002, was introduced in the Senate on February 14, 2002. No further action was taken by the 107th Congress during the year on these bills. In January and February 2003, however, similar deposit insurance reform legislation was reintroduced in the Senate and House, respectively. Legislative proposals during the 107th Congress included merging BIF and SAIF, modifying restrictions on charging risk-based insurance premiums, implementing assessment credits and rebates, changing the designated reserve ratio from a fixed 1.25 percent of estimated insured deposits to a range, increasing deposit insurance coverage for all accounts (including higher coverage for retirement accounts), and indexing the insurance limit to inflation. Deposit insurance reform provisions may have a significant impact on the BIF and the SAIF, if enacted into law. FDIC management, however, cannot predict which provisions, if any, will ultimately be enacted., 116308=As of September 30, 2002, deposits insured by the BIF totaled approximately $2.5 trillion. This would be the accounting loss if all depository institutions were to fail and the acquired assets provided no recoveries., 92605=As part of the FDIC's efforts to maximize the return from the sale of assets from bank resolutions, representations and warranties, and guarantees are offered on certain loan sales. In general, the guarantees, representations, and warranties on loans sold relate to the completeness and accuracy of loan documentation, the quality of the underwriting standards used, the accuracy of the delinquency status when sold, and the conformity of the loans with characteristics of the pool in which they were sold. The total amount of loans sold subject to unexpired representations and warranties, and guarantees was $6.7 billion as of December 31, 2002. The contingent liability from all outstanding claims asserted in connection with representations and warranties was $11.6 million and $1.5 million at December 31, 2002 and 2001, respectively., 90364=The contingent liability is derived by applying expected failure rates and historical loss rates to groups of institutions with certain shared characteristics. In addition, institution-specific analysis is performed on those banks where failure is imminent absent institution management resolution of existing problems. As of December 31, 2002 and 2001, the contingent liabilities for anticipated failure of insured institutions were $1.0 billion and $1.9 billion, respectively., 51499=The FDICIA established a limitation on obligations that can be incurred by the BIF, known as the Maximum Obligation Limitation (MOL). As of December 31, 2002 and December 31, 2001, the MOL for the BIF was $56.7 billion and $55.4 billion, respectively., 108301=The BIF's pro rata share of the Corporation's liability to employees for accrued annual leave is approximately $34.1 million and $35.3 million at December 31, 2002 and 2001, respectively., 58746=As of December 31, 2002 and December 31, 2001, the book value of investments in U.S. Treasury obligations, net, was $27.5 billion and $30.2 billion, respectively. As of December 31, 2002, the FDIC held $6.2 billion of Treasury inflation-indexed securities (TIIS) for the BIF. These securities are indexed to increases or decreases in the Consumer Price Index for All Urban Consumers (CPI-U). Additionally, FDIC held $1.5 billion of callable U.S. Treasury bonds at December 31, 2002, with the premiums being amortized to the first call date. Callable U.S. Treasury bonds may be called five years prior to the respective bonds' stated maturity on their semi-annual coupon payment dates upon 120 days notice., 82402=The bank resolution process takes different forms depending on the unique facts and circumstances surrounding each failing or failed institution. Payments for institutions that fail are made to cover obligations to insured depositors and represent claims by the BIF against the receiverships' assets. There were ten bank failures in 2002 and three in 2001, with assets at failure of $2.5 billion and $54 million, respectively, and BIF outlays of $2.1 billion and $49.5 million, respectively., 45602=The Financial Institutions Reform, Recovery, and Enforcement Act of 1989 (FIRREA) was enacted to reform, recapitalize, and consolidate the federal deposit insurance system. The FIRREA created the Bank Insurance Fund (BIF), the Savings Association Insurance Fund (SAIF), and the FSLIC Resolution Fund (FRF). It also designated the FDIC as the administrator of these funds. All three funds are maintained separately to carry out their respective mandates., 58417=Reclassifications have been made in the 2001 financial statements to conform to the presentation used in 2002., 108666=The FDIC provides certain life and dental insurance coverage for its eligible retirees, the retirees' beneficiaries, and covered dependents. Retirees eligible for life insurance coverage are those who have qualified due to: 1) immediate enrollment upon appointment or five years of participation in the plan and 2) eligibility for an immediate annuity. The life insurance program provides basic coverage at no cost to retirees and allows converting optional coverages to direct-pay plans. Dental coverage is provided at no cost to all retirees eligible for an immediate annuity. At December 31, 2002 and 2001, the BIF's net postretirement benefit asset recognized in the \"Interest receivable on investments and other assets, net\" line item in the Statements of Financial Position was $130 thousand and $3.6 million, respectively., 110165=The BIF's allocated share of the FDIC's lease commitments totals $138.6 million for future years. The lease agreements contain escalation clauses resulting in adjustments, usually on an annual basis. The allocation to the BIF of the FDIC's future lease commitments is based upon current relationships of the workloads among the BIF, the SAIF, and the FRF. Changes in the relative workloads could cause the amounts allocated to the BIF in the future to vary from the amounts shown below. The BIF recognized leased space expense of $36.9 million and $38.5 million for the years ended December 31, 2002 and 2001, respectively., 109513=The Corporation's postretirement benefits plan curtailment loss resulting from the voluntary employee buyout programs and reduction-in-force was $1.6 million in 2002, with BIF's pro rata share totaling $1.3 million., 82901=Assets held by the FDIC in its receivership capacity for closed BIF-insured institutions are the main source of repayment of the BIF's receivables from closed banks. As of December 31, 2002 and 2001, BIF receiverships held assets with a book value of $1.1 billion and $154.6 million, respectively (including cash, investments, and miscellaneous receivables of $479 million and $71.9 million at December 31, 2002 and 2001, respectively). Generally, the estimated cash recoveries from the management and disposition of these assets that are used to derive the allowance for losses are based in part on a statistical sampling of receivership assets. For certain recent and significant failures, a separate evaluation was performed, based on non-representative sampling, to estimate cash recoveries on the majority of receivership assets in order to determine the appropriate allowance for losses. These estimated recoveries are regularly evaluated, but remain subject to uncertainties because of potential changes in economic conditions. Such uncertainties could cause the BIF's and other claimants' actual recoveries to vary from the level currently estimated., 95039=The FDIC uses a risk-based assessment system that charges higher rates to those institutions that pose greater risks to the BIF. To arrive at a risk-based assessment for a particular institution, the FDIC places each institution in one of nine risk categories, using a two-step process based first on capital ratios and then on other relevant information. The assessment rate averaged approximately 22 cents and 14 cents per $100 of assessable deposits for 2002 and 2001, respectively. On November 12, 2002, the Board voted to retain the BIF assessment schedule at the annual rate of 0 to 27 cents per $100 of assessable deposits for the first semiannual period of 2003. The Board reviews premium rates semiannually., 44410=NOTES TO THE FINANCIAL STATEMENTS Bank Insurance Fund (BIF) December 31, 2002 and 2001, 48682=The Gramm-Leach-Bliley Act (GLBA) was enacted on November 12, 1999, in order to modernize the financial services industry (banks, brokerages, insurers, and other financial services providers). The GLBA lifts restrictions on affiliations among banks, securities firms, and insurance companies. It also expands the financial activities permissible for financial holding companies and insured depository institutions, their affiliates and subsidiaries., 107283=During 2002, the Corporation offered voluntary employee buyout programs to a majority of its employees and conducted a reduction-in-force (RIF) in an effort to reduce identified staffing excesses. As a result, over 700 employees left or will leave the Corporation by December 31, 2003. Approximately 91 percent of the affected employees have left their positions in 2002. Termination benefits included compensation of fifty percent of the current salary for voluntary departures. The total cost of this benefit to the Corporation was $33.1 million for 2002, with BIF's pro rata share totaling $28.9 million, which is included in the \"Operating expenses\" line item. In 2002, BIF paid $10.1 million of this compensation benefit and the remaining unpaid amount is recorded as a liability in the \"Accounts payable and other liabilities\" line item.}",
    "textBeforeTable": "Dollars in Thousands Bank Insurance Fund Statements of Financial Position at December 31 Bank Insurance Fund (BIF)     III. Financial Statements and Notes   2002 Annual Report Home > About FDIC > Financial Reports > 2002 Annual Report",
    "textAfterTable": "Interest receivable on investments and other assets, net 483,674 547,101 Receivables from bank resolutions, net (Note 4) 505,395 79,155 Property and equipment, net (Note 5) 303,084 303,969 Total Assets $33,432,307 $32,529,773 Liabilities Accounts payable and other liabilities $148,573 $134,990 Contingent liabilities for: (Note 6) Anticipated failure of insured institutions 1,008,097 1,911,000 Litigation losses 204,805 37,123 Other contingencies 20,492 7,835 Total Liabilities 1,381,967 2,090,948 Commitments and off-balance-sheet",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}