{
    "relation": [
        [
            "Error Returned",
            "TT_ERR_NOMP",
            "TT_ERR_PROCID",
            "TT_ERR_PTYPE",
            "TT_ERR_POINTER"
        ],
        [
            "Description",
            "The ttsession process is not available. The ToolTalk service tries to restart ttsession if it is not running. This error indicates that the ToolTalk service is either not installed or not installed correctly.",
            "The process identifier specified is out of date or invalid.",
            "The ToolTalk service could not locate the specified ptype.",
            "The pointer passed does not point at an object of the correct type for this operation. For example, the pointer may point to an integer when a character string is needed."
        ]
    ],
    "pageTitle": "Appendix A The Messaging Toolkit (Common Desktop Environment: ToolTalk Messaging Overview)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19683-01/816-0379/6m6scd578/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00233-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74567707,
    "recordOffset": 74548471,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{109943=It installs a toolkit-internal operation number (opnum) callback on a series of signatures that the ptype is assumed to contain. The toolkit-internal opnum callback passes clientdata to the cb argument when a request is received that matches one of these signatures. The opnums start at base_opnum, which must be zero or a multiple of 1000.}",
    "lastModified": "Fri, 11 Feb 2011 12:11:01 GMT",
    "textBeforeTable": "Table A-1 ToolTalk Messaging Toolkit Functions Most of the messages in the Messaging Toolkit are the messages in the standard ToolTalk message sets. For detailed descriptions of the standard ToolTalk message sets, see the ToolTalk Reference Manual. Table A-1 lists the functions described in this chapter that partly comprise the ToolTalk Messaging Toolkit. Tools that follow the ToolTalk messaging conventions will not use the same ToolTalk syntax for different semantics, nor will tools fail to talk to each other because they use different ToolTalk syntax for identical semantics. If these protocols are observed, cooperating applications can be modified, even replaced, without affecting one another. The ToolTalk Messaging Toolkit plays a key role in application inter-operability and offers complete support for messaging. The message protocol specification includes the set of messages and how applications should behave when they receive the messages. These messages can be retrofitted to any existing application to leverage the functionality of the application. You can easily add these messages to existing applications to send, receive, and use shared information. Interoperability is an important theme if independently developed applications are to work together. The messages in the toolkit have been agreed upon by developers of interoperating applications; the protocols form a small, well-defined interface that maximizes application autonomy. General Description of the ToolTalk Messaging Toolkit Although most of the messages in the ToolTalk Messaging Toolkit are the messages in the standard ToolTalk message sets, the functions of the Messaging",
    "textAfterTable": "ttdt_file_quit() Unregisters interest in ToolTalk events about a file  ttdt_file_request() Creates and sends a standard ToolTalk request about a file  ttdt_Get_Modified() Asks if any ToolTalk client has changes pending on a file  ttdt_message_accept() Accepts the responsibility for handling a ToolTalk request  ttdt_open() Creates a ToolTalk communication endpoint  ttdt_Revert () Requests that a ToolTalk client revert to the last saved version of a file  ttdt_Save() Requests that a ToolTalk client save a file  ttdt_sender_imprint_on() Causes a tool to emulate the behavior and characteristics of the specified ToolTalk tool  ttdt_session_join() Joins a ToolTalk session and registers patterns and default callbacks for many standard desktop messages  ttdt_session_quit() Unregisters any patterns and default callbacks registered when session joined, and quits the ToolTalk session  ttdt_subcontract_manage() Manages",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}