{
    "relation": [
        [
            "Patent application number",
            "20110068625",
            "20110225452",
            "20140307358"
        ],
        [
            "Description",
            "DUAL LINE ACTIVE AUTOMATIC TRANSFER SWITCH - A dual line active automatic transfer switch (ATS) is provided. A first switch structure is connected to a first PSU of the plurality of PSUs, and operable between a first position connecting a first input line of the dual line and a second position connecting a second input line of the dual line with the one PSU. A second switch structure is connected to at least one additional PSU of the plurality of PSUs, and operable between a third position connecting the first input line and a fourth position connecting the second input line with the at least one additional PSU. The first and second switch structures are operable between each of the first, second, third, and fourth positions to alternatively connect each of the plurality of PSUs to one of the first and second input lines and connect, when each of the dual lines is charged, both of the first and second input lines to at least one of the plurality of PSUs.",
            "APPARATUS TO MAINTAIN REDUNDANCY IN FOUR LINE SYSTEM - Exemplary embodiments adapted to distribute power from four input lines to a plurality of power supply units (PSUs) configured in an N+1 architecture are provided. In one such embodiment, a plurality of rectifier devices have first and second ends, each of the plurality of rectifier devices connected at the first end to one of the four input lines, and adapted to be bypassed by a first relay in a first operating mode and provide rectified input current in a second operating mode. A plurality of second relays is connected between each of the second ends of the plurality of rectifier devices. The plurality of second relays are adapted to be closed in the second operating mode to sum the rectified input current from each of the plurality of rectifier devices in a single node connecting each of the plurality of PSUs.",
            "Battery Circuit Fault Protection in Uninterruptable Power Sources - A power system which includes a battery (or string of batteries) as well as a preemptive fuse driver, PFD, system. The PFD protection system reliably protects circuits that could be damaged by long term fault currents. More specifically, the PFD protection system includes a sensor and a controller as well as a controlled switch. The controller includes a PFD control module which allows protection to be tuned specifically to the source and load characteristics."
        ],
        [
            "Published",
            "03-24-2011",
            "09-15-2011",
            "10-16-2014"
        ]
    ],
    "pageTitle": "Duan, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/duan-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00116-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434410711,
    "recordOffset": 434364554,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jiwu Duan, Tucson, AZ US 11-26-2009 METAL SULFATE ALCOHOL COMPOSITION AND PROCESS THEREWITH - A metal sulfate alcohol composition as well as a process to produce such composition is disclosed. Also disclosed is a process to produce polyester containing the metal sulfate alcohol composition. 20090292102 11-26-2009 CONTINUOUS WET GRINDING PROCESS - A continuous wet grinding process is disclosed for comminuting material in a liquid, comprising one or more continuous wet grinding line. Said continuous wet grinding line comprises (1) two or more sealed wet grinders connected in cascade, (2) no unsealed container connected between said grinders, (3) a positive displacement pump connected before the first sealed wet grinder in said cascade to provide the required pressure by the process flow and to regulate flow rate, (4) one or more non-volume delivery pump connected before one or more of said grinders except the first grinder in said cascade to provide necessary pressure without changing flow rate. The invention also discloses a polyester composition that contains high quality inorganic filler such as carbon black, said inorganic filler is produced in said continuous wet grinding process, which has narrower particle size distribution and less coarse particles, therefore less breaks during fiber spinning. 20090289133 Published Description Patent application number Jiwen F. Duan, Cary, NC US //]]> BarDraw('2704135',['Patent applications by Jingwu Duan, Yardley, PA US'],[[2,3,2,1,3,1]],['2005','2007','2009','2011','2012','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2704135\" align=\"center\"></div> </div> <canvas id=\"bg2704135\" style=\"max-width:",
    "textAfterTable": "Jubao Duan, Skokie, IL US Patent application number Description Published 20080268436 Schizophrenia, Schizoaffective Disorder and Bipolar Disorder Susceptibility Gene Mutation and Applications to Their Diagnosis and Treatment - The present invention provides the identification of a number of SNPs that are associated schizophrenia, schizoaffective disorder, bipolar disorder and related mental disorders which were found to be strongly linked to individuals with the disease. The invention provides SNP locations on human chromosome 6, as well as methods of making PCR primers and assays for detecting the SNPs in tested individuals. 10-30-2008 Junan Duan, Lewisville, TX US Patent application number Description Published 20120323923 Sorting Data in Limited Memory - A system for sorting tables comprises an interface operable to receive a first segment of an index column and a first segment of a key column from an on-disk database (ODDB), wherein a value in the index column represents a row of information in the ODDB and a value in the key column represents data to be sorted and each index value is associated with a key value, and wherein the ODDB is operable to store the sorted index values and key values in the first segments, a processor communicatively coupled to the interface, the processor is operable to sort the index values in the first segment and key values in the first segment by the key values according to sorting criteria, remove",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}