{
    "relation": [
        [
            "Patent application number",
            "20110292480",
            "20120086212",
            "20120086213",
            "20120162332",
            "20120206782",
            "20140323886"
        ],
        [
            "Description",
            "BIAXIAL SCANNING MIRROR HAVING RESONANT FREQUENCY ADJUSTMENT - A biaxial micro-electromechanical (MEMS) device is disclosed. The device includes a gimbal rotatable about a gimbal axis of rotation. A pair of gimbal torsion bars connects the gimbal to a support along the gimbal rotation axis. A mirror plate is rotatable about a mirror axis of rotation, the mirror plate rotation axis being substantially perpendicular to the gimbal rotation axis. A pair of mirror plate torsion bars connects the mirror plate to the gimbal along the mirror plate axis of rotation. One or more gimbal moment-of-inertia-altering blocks are positioned on a surface of the mirror plate away from the gimbal axis of rotation. Additionally, one or more mirror plate moment-of-inertia-altering blocks are positioned on a surface of the mirror plate away from the mirror plate rotation axis such that the distance from the mirror plate axis determines a resonant frequency of the biaxial MEMS device.",
            "APPARATUS FOR WIND COLLECTION - The present invention provides an omnidirectional wind collection apparatus. The wind collector includes an outer housing with a peripheral wind inlet circumferentially formed therein. An inner housing disposed within the outer housing has an inner surface with a first opening at a lower end thereof to guide the collected wind to a smaller second opening at the top end. The inner surface is curved between the bottom and top openings to form a progressively narrower passage. The configuration of the inner surface creates a Venturi effect such that the wind is accelerated toward the second opening. A wind pass-through portion is formed above the second opening in the inner housing. Based on the Bernoulli effect, the passage of uncollected wind through this portion creates a low pressure region that expedites flow of collected wind through the first and second openings of the inner housing.",
            "ELECTRIC POWER GENERATOR WITH FERROFLUID BEARINGS - An electric generator using ferrofluid bearings is provided. The generator includes stators having plural magnets separated by a yoke of magnetizable materials. A rotor configured to rotate in a horizontal plane is positioned between the stators. The rotor includes plural coils in which current is induced during rotation from passing through the magnetic fields generated by the stators. A first set of ferrofluid bearings is positioned between the first stator and the rotor and a second set is positioned between the rotor and the second stator. A third set of ferrofluid bearings is positioned adjacent to the periphery of the rotor and configured to center the rotor. In one embodiment, the electric generator is wind-driven and supported in a wind collection housing.",
            "SUBLIMATION INKS FOR THERMAL INKJET PRINTERS USING THERMALLY STABLE DYE PARTICLES - Thermal inkjet printer sublimation inks are provided having high melting point suspended particles such that the ink does not clog thermal ink jet print heads. Low-cost thermal ink jet printers are used to create thermal transfer images from the inks which are used in conventional thermal transfer processes. An ink set having at least three ink colors includes an aqueous medium of 30-95 weight percent having particles of 50 nm to 1000 nm suspended therein in an amount of 1-10 weight percent. The suspended particles include a sublimation dye and have a melting point of at least a surface of the particle greater than or equal to 200° C. The particles may have a core-shell structure with a sublimation dye core. The ink includes one or more cosolvents from 4-40 weight percent, a surfactant of 0.01 to 5 weight percent, and a biocide of 0.01-5 weight percent.",
            "DEVICE FOR REDUCING SPECKLE EFFECT IN A DISPLAY SYSTEM - The present invention relates to a method and apparatus for speckle noise reduction in laser scanning display. In particular, a MEMS device which can superpose vibrational motion onto a biaxial scanning mirror is provided for reducing the effect of speckling.",
            "Methods and Device for Sensing a Person's Pulse in Traditional Chinese Medicine - This invention discloses a pulse-sensing device and methods for pulse sensing. In one embodiment, the device includes a robotic finger comprising a humanoid-finger structure, and an actuating-force transferring member for transferring an actuating force to the structure at an actuation point thereon and along an actuation direction. One end of the structure is pivotally mounted to a fulcrum and another end has a sensing area. The robotic finger is configured such that, when the sensing area contacts a person's wrist, a first perpendicular distance from the fulcrum to a first line is substantially longer than a second perpendicular distance from the fulcrum to a second line, where the first line is a straight line passing through a sensing point of the sensing area and being substantially perpendicular to the sensing area, and the second line is a straight line passing through the actuation point and orienting along the actuation direction."
        ],
        [
            "Published",
            "12-01-2011",
            "04-12-2012",
            "04-12-2012",
            "06-28-2012",
            "08-16-2012",
            "10-30-2014"
        ]
    ],
    "pageTitle": "Lee, Hong Kong - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/lee-hong-kong-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00075-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 439820911,
    "recordOffset": 439789756,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Francis Chee-Shuen Lee, Hong Kong HK 06-24-2010 Extension cord lock and in line tap - An electrical, circuit breaker protected, extension cord in-line tap, securement device for securing tandemly connected electrical extension cords. The securement device includes opposing proximal and distal open-ended eyelets each having a hinged locking flap for receiving therein a looped end of the associated extension cord thereby preventing unintended separation of the extension cords. The in-line tap further includes a pair of circuit breaker protected auxiliary electrical outlets on opposing sides for powering additional extension cords. 20100159733 Published Description Patent application number Dominic Kan Nam Lee, Hong Kong CN 12-03-2009 ANGULAR-DOMAIN CHANNEL MODEL AND CHANNEL ESTIMATION - A method of modeling wireless communication channels in angular domain is disclosed. The method includes considering radiation patterns 20090299715 Published Description Patent application number Derek Chun Lee, Hong Kong HK 11-17-2011 PORTABLE DEVICE FOR PREVENTING MOVEMENT OF A DOOR - A portable device ( 20110278866 Published Description Patent application number Deborah Anne Hong Lan Lee, Hong Kong HK 12-09-2010 ALL-IN-ONE CHINESE CHARACTER INPUT METHOD - Embodiments of the present invention describe systems and methods for using a combined (or All-In-One) Chinese input method to enter Chinese characters in documents and forms on computers or on web sites. The combined Chinese input",
    "textAfterTable": "Patent applications by Francis Chee-Shuen Lee, Hong Kong HK Hor Lee, Hong Kong CN Patent application number Description Published 20110134642 LED SPOTLIGHT - The LED spotlight relates to cold light source, and more particularly to a light-emitting device with a plurality of LEDs. The LED spotlight of the present Utility Model includes a plurality of LEDs and a circuit board, and the LEDs are installed on the circuit board, the LEDs are arranged in concentric circles with the shape of optical slits of Fresnel zone plate; the LEDs include spherical tops. 06-09-2011 Hor Yau Carrie Lee, Hong Kong CN Patent application number Description Published 20100069087 PERSONAL TRACKING DEVICE WITH LOW POWER CONSUMPTION - An portable tracking device integrating a mobile phone module (e.g. based on GSM or 3G networks), a GPS module, a radio Beacon and ultrasonic beacon. The tracking device is normally in a hibernated state when the entire device consumes little energy and require no periodically changing or recharging batteries to power the device. It consumes power from the primary battery only when a tracking process is actually taken place. With this portable tracking device on",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}