{
    "relation": [
        [
            "",
            "Healthy Subjects: Multiple Dose",
            "Mild Renal Impairment: Multiple Dose",
            "Moderate Renal Impairment: Multiple Dose",
            "Healthy Subjects: Single Dose",
            "Severe Renal Impairment: Single Dose",
            "ESRD: Single Dose; After Dialysis",
            "ESRD: Single Dose; Before Dialysis"
        ],
        [
            "Description",
            "Maraviroc 150 mg twice a day (BID) co-administered with saquinavir 1,000 mg/ritonavir 100 mg twice a day (BID) for 6 days, and a single dose of both agents on Day 7.",
            "Maraviroc 150 mg once a day (QD) co-administered with saquinavir 1,000 mg/ritonavir 100 mg twice a day (BID) for 7 days.",
            "Maraviroc 150 mg every 48 hours co-administered with saquinavir 1,000 mg/ritonavir 100 mg twice a day (BID) for 7 days.",
            "Maraviroc 300 mg single dose.",
            "Maraviroc 300 mg single dose.",
            "Maraviroc 300 mg single dose one hour following completion of morning hemodialysis.",
            "Maraviroc 300 mg single dose three hours prior to start of hemodialysis."
        ]
    ],
    "pageTitle": "Pharmacokinetics, Safety And Toleration Of Maraviroc Administered To Subjects With Various Degrees Of Renal Impaired And Normal Renal Function - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00717067?sect=Xj0156&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00058-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 863934318,
    "recordOffset": 863918382,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups Subjects were enrolled into treatment groups (healthy subjects, mild, moderate, severe renal impairment, or end stage renal impairment on hemodialysis) based on creatinine clearance results obtained closest to the dosing date at screening as determined by the Cockcroft-Gault equation (with the exception of subjects undergoing hemodialysis). Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details Two centers took part in this study between 15 July 2008 and 21 November 2008. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: Maraviroc Drug: Ritonavir Drug: Saquinavir Interventions: Human Immunodeficiency Virus (HIV) Infection Condition:",
    "textAfterTable": "  Healthy Subjects     Mild Renal Impairment     Moderate Renal Impairment     Severe Renal Impairment     ESRD: Single Dose   STARTED     6     6     6     0     0   COMPLETED     6     6     5     0     0   NOT COMPLETED     0     0     1     0     0   Adverse Event                 0  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}