{
    "relation": [
        [
            "Patent application number",
            "20090213347",
            "20100134779",
            "20130329200"
        ],
        [
            "Description",
            "Article Loading/Unloading Method and Article Loading/Unloading Device, Exposure Method and Exposure Apparatus, and Method of Manufacturing Device - A loading/unloading apparatus and method to perform quickly exchanging article to be loaded on a placing table. A first step determines a position of a placing table where articles to be unloaded is loaded to a second position that is different from a first position within said predetermined plane, a second step unloads the articles exist on the lading table that is positioned at said second position after said first step is performed, a third step determines a position of said placing table at said first position while said vertically moving member is positioned at a position lower than a lower surface of a loading member holding a next article to be loaded and waiting over said first position and higher than the placing surface of the placing table after said second step is performed, a fourth step allows a loading member holding the next article to be loaded onto the placing table to wait over the first position before the placing table is positioned at the first position, and a fifth step loading the next article onto the placing table positioned at the first position after the third step is performed.",
            "POSITION MEASUREMENT METHOD, POSITION CONTROL METHOD, MEASUREMENT METHOD, LOADING METHOD, EXPOSURE METHOD AND EXPOSURE APPARATUS, AND DEVICE MANUFACTURING METHOD - A part of a plate of a predetermined shape detachably mounted on a moving body is detected by an alignment system while the position of the moving body is measured by a measurement unit that sets a movement coordinate system of the movement body, and based on the detection results and the measurement results of the measurement unit corresponding to the detection results, position information of an outer periphery edge of the plate is obtained. Therefore, even if there are no alignment marks on the moving body for position measurement, the position of the plate, or in other words, the position of the moving body can be controlled on the movement coordinate system set by the measurement unit, based on the position information of the outer periphery edge of the plate.",
            "POSITION MEASUREMENT METHOD, POSITION CONTROL METHOD, MEASUREMENT METHOD, LOADING METHOD, EXPOSURE METHOD AND EXPOSURE APPARATUS, AND DEVICE MANUFACTURING METHOD - An exposure apparatus exposes an object with an exposure beam. The apparatus includes first and second stages, a measurement device and a controller. The first stage mounts the object. The second stage is movable relative to the first stage. The measurement device obtains position information of an outer periphery edge of the first stage. The controller controls at least one of a position of the first stage and a position of the second stage based on the position information of the outer periphery edge so that the first and second stages do not touch each other."
        ],
        [
            "Published",
            "08-27-2009",
            "06-03-2010",
            "12-12-2013"
        ]
    ],
    "pageTitle": "Sugihara, Tokyo - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/sugihara-tokyo-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 443923039,
    "recordOffset": 443898284,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Taro Sugihara, Tokyo JP //]]> BarDraw('2683528',['Patent applications by Takashi Sugihara, Tokyo JP'],[[1,1,1,3,3,6,1,1,1]],['2005','2007','2008','2010','2011','2012','2013','2014','2015'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2683528\" align=\"center\"></div> </div> <canvas id=\"bg2683528\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Takashi Sugihara, Tokyo JP</p> <div class=\"bar2683528\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>07-09-2015</td> <td><a href=\"/patents/app/20150195081\">RECEIVER, TRANSMITTER, AND COMMUNICATION METHOD</a> - A transmitter for transmitting a transmission signal subjected to modulation after error correction coding and a receiver including a phase compensation unit for receiving the transmission signal and performing demodulation therefor while maintaining synchronization thereof and an error correction decoding unit for performing decoding processing for received data that has been subjected to the demodulation. The transmitter transmits a signal formed of a plurality of pilot sequences as a part of the transmission signal, and the receiver has a phase slip estimation processing function for estimating the phase slip by the phase compensation unit by using the plurality of pilot sequences, and for estimating a phase difference component by the error correction decoding unit, to thereby correct a phase of the received data.</td> <td>20150195081</td> <tr> </tr> <td>05-15-2014</td> <td><a href=\"/patents/app/20140133867\">PRE-EQUALIZED OPTICAL TRANSMITTER AND PRE-EQUALIZED OPTICAL TRANSMISSION METHOD</a> - A pre-equalization optical transmitter includes: a tap coefficient selecting unit for saving, in advance, a tap coefficients for generating an RZ pre-equalization signal and an NRZ pre-equalization signal, and for selecting and outputting one of the tap coefficients according to the value of a parameter that is a factor of transmission",
    "textAfterTable": "Patent applications by Taro Sugihara, Tokyo JP Tarou Sugihara, Tokyo JP Patent application number Description Published 20120008112 Substrate processing method, exposure apparatus, and method for producing device by immersing substrate in second liquid before immersion exposure through first liquid - An immersion type lithographic apparatus includes at least one immersion space and an immersion system configured to at least partially fill the immersion space with a liquid. The apparatus is configured to rinse at least part of the immersion space with a rinsing liquid before the apparatus is used to project a patterned beam of radiation onto a substrate. 01-12-2012 Tomoaki Sugihara, Tokyo JP Patent application number Description Published 20130263130 VIRTUALIZATION SYSTEM, SWITCH CONTROLLER, FIBER-CHANNEL SWITCH, MIGRATION METHOD AND MIGRATION PROGRAM - A virtualization system comprises a plurality of host machines on which a virtual machine operates, a plurality of storages connected to the host machines through a fiber-channel switch; and a switch controller, the switch controller including a migration management unit which instructs the host machine on migration of the virtual machine, wherein the migration management unit instructs the fiber-channel switch connected to a migration destination to set host",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}