{
    "relation": [
        [
            "Patent application number",
            "20120258311",
            "20120270054",
            "20120282419",
            "20140021195",
            "20150068684"
        ],
        [
            "Description",
            "ROLL-TO-ROLL TRANSFER METHOD OF GRAPHENE, GRAPHENE ROLL PRODUCED BY THE METHOD, AND ROLL-TO-ROLL TRANSFER EQUIPMENT FOR GRAPHENE - The present disclosure relates to a graphene roll-to-roll transfer method, a graphene roll-to-roll transfer apparatus, a graphene roll manufactured by the graphene roll-to-roll transfer method, and uses thereof.",
            "ROLL-TO-ROLL DOPING METHOD OF GRAPHENE FILM, AND DOPED GRAPHENE FILM - The present disclosure relates to roll-to-roll doping method of graphene film, and doped graphene film.",
            "GRAPHENE PROTECTIVE FILM SERVING AS A GAS AND MOISTURE BARRIER, METHOD FOR FORMING SAME, AND USE THEREOF - The present invention relates to a method for forming a graphene protective film having gas and moisture barrier properties, to a graphene protective film formed by the method, and to the use thereof. A single-layer or multi-layer graphene protective film can be used as a material for a barrier coating or bags, and improves the gas and moisture barrier properties of a variety of devices in a wide array of industrial fields to thereby maintain the electrical characteristics of devices over a long period of time.",
            "FLEXIBLE TRANSPARENT HEATING ELEMENT USING GRAPHENE AND METHOD FOR MANUFACTURING THE SAME - The present invention relates to a flexible transparent heating element using graphene and a method for manufacturing the same. The heating element comprises a flexible transparent substrate; a graphene layer formed to at least one side of the flexible transparent substrate; and an electrode connected with the graphene layer.",
            "ROLL-TO-ROLL TRANSFER METHOD OF GRAPHENE, GRAPHENE ROLL PRODUCED BY THE METHOD, AND ROLL-TO-ROLL TRANSFER EQUIPMENT FOR GRAPHENE - The present disclosure relates to a graphene roll-to-roll transfer method, a graphene roll-to-roll transfer apparatus, a graphene roll manufactured by the graphene roll-to-roll transfer method, and uses thereof."
        ],
        [
            "Published",
            "10-11-2012",
            "10-25-2012",
            "11-08-2012",
            "01-23-2014",
            "03-12-2015"
        ]
    ],
    "pageTitle": "Ahn, Suwon-Si - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/ahn-suwon-si-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00320-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 439096987,
    "recordOffset": 439066430,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jonghyun Ahn, Suwon-Si KR //]]> BarDraw('3489230',['Patent applications by Jong-Hyon Ahn, Suwon-Si KR'],[[6,2,4,4,1]],['2005','2006','2007','2008','2009'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3489230\" align=\"center\"></div> </div> <canvas id=\"bg3489230\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Jong-Hyon Ahn, Suwon-Si KR</p> <div class=\"bar3489230\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>02-26-2009</td> <td><a href=\"/patents/app/20090051014\">Method of fabricating semiconductor device having silicide layer and semiconductor device fabricated thereby</a> - A method of fabricating a semiconductor device having a silicide layer and a semiconductor device fabricated by the method are provided. The method may involve providing a semiconductor substrate having an active region and a field region, and forming a plurality of gate patterns on each of the active region and the field region. The plurality of gate patterns may each have a sidewall spacer. The plurality of gate patterns on the field region include at least two adjacent gate patterns. The method may involve forming a silicide blocking layer pattern that masks a portion of the field region that exists between each of the adjacent gate patterns on the field region. The method may also involve forming a silicide layer on the active region and any of the plurality of the gate patterns that are not masked by the silicide blocking layer pattern.</td> <td>20090051014</td> <tr> </tr> <th>Published</th> <th>Description</th> <th>Patent application number</th> <tr> <tbody> <table class=\"preltab\" id=\"inv_tab_3489230\"> <h2>Jong-Hyon Ahn, Suwon-Si KR</h2> <div style=\"clear: left;\"></div> </div> </script> // BarDraw('2779151',['Patent applications by Jeonghwan Ahn, Suwon-Si KR'],[[10,2,1]],['2006','2007','2010'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2779151\"",
    "textAfterTable": "Patent applications by Jonghyun Ahn, Suwon-Si KR Jong-Hyun Ahn, Suwon-Si KR Patent application number Description Published 20110316059 FLEXIBLE FERROELECTRIC MEMORY DEVICE AND MANUFACTURING METHOD FOR THE SAME - The present disclosure relates to a flexible nonvolatile ferroelectric memory device, a 1T-1R (1Transistor-1Resistor) flexible ferroelectric memory device, and a manufacturing method for the same. 12-29-2011 20120298971 ELECTRODE AND ELECTRONIC DEVICE COMPRISING THE SAME - A graphene electrode having a surface modified to have a high work function, and an electronic device including the same. 11-29-2012 20130022811 STABLE GRAPHENE FILM AND PREPARING METHOD OF THE SAME - The present disclosure relates to a stable graphene film, a preparing method of the stable graphene film, a graphene transparent electrode including the stable graphene film, and a touch screen including the stable graphene film. 01-24-2013 20130130011 METHOD FOR PREPARING GRAPHENE, GRAPHENE SHEET, AND DEVICE USING SAME - THE PRESENT INVENTION PROVIDES A METHOD FOR PREPARING GRAPHENE BY PROVIDING A REACTION GAS INCLUDING A CARBON SOURCE AND HEAT ONTO A SUBSTRATE, AND REACTING THE SAME TO FORM A GRAPHENE ON THE SUBSTRATE, A GRAPHENE SHEET FORMED BY THE METHOD, AND A DEVICE USING THE SAME. 05-23-2013",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}