{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They have their own police force and they are always willing to walk you to the car, this is super great for when it rains ;)",
            "none that I know of",
            "The sporting events rock! all of our teams play great and win!! There are also cubs for everything, from nursing to traveling.",
            "Students that want to save money and learn, its not a party school but you should go to school because you want to learn anyways. Smart students go here to save a large amount of cash and get a great education along the way.",
            "Student life! I work there as a student assistant ( my $7.40 job- they also work with you class schedule!!) This is a great place to study and meet people, the majority of the campus clubs meet here. There are also many free food events taken place in here weekly. I would tell anyone to stop on in!",
            "The whole reason I decided to go here was because I paid for three semesters here in intervals of 12, 12, and 9 credits all out of pocket. I make $7.40 an hour and have 50 hour paychecks. I have no debt and even had spending cash because the school offers a payment plan. Best financial decision ever. Although I do live at home I will graduate knowing I paid for my schooling all on my own.",
            "There are many clubs and our sports teams are very talented. People are easy to get along with here and events are always going on around campus.",
            "The Bear Bistro food is great, the prices just need to be lowered.",
            "There are no dorms.",
            "I give it a four because it is a community college and you do miss out on the big party college experience, but if you are truly here to learn it is perfect.",
            "Make the effort to pass because you professors will notice and they will help you out. Get to know your professors they are very nice and helpful people. Get involved in your school because it may help you in the future.",
            "This school is very cheap. The classes are smaller which makes learning easier. I have not had a bad professor yet."
        ]
    ],
    "pageTitle": "Mott Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Mott-Community-College/reviews?_escaped_fragment_=/show/26535",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00294-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910285039,
    "recordOffset": 910246070,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12446=Get registered for classes early, especially if you are going for the fall 2011 semester. Classes fill up quick. The campus at Mott Community college is great, its a great environment. Also Mott now has dorms, they share dorms witht the U of M flint, Baker and Kettering. The dorms are called the River Front resident hall, the prices are great, for a single room it's only $3,000 a year., 120777=Mott Community College has a September 11th memorial with a beam from one of the Twin Towers, honoring the fallen victims., 176796=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/06/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 45 Jessica from Flushing, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Login to rate or flag the reviews Joshua from Flushing, MI 01/03/2010 Reviewer is A past student here. 3 out of 3 people found this review useful. 1 person found this inaccurate. 3 of 45 Categories Comments Great for these types of students People that are looking to transfer in state and are looking to save tons of money on pre requisite classes. Good luck!! Tips for prospective students Deadlines catch you off guard. Get in the school and get registered for classes A.S.A.P. If you delay, you'll have to wait long hours to register for classes and can easily get stressed out. Whatever you do, STICK WITH IT! I've seen so many people back out of this school because of the difficult processing. Bang for the buck The price is without doubt the best aspect of this school. I'm no wealthy person and I was able to pay everything off out of pocket. As stated previously, I saved myself roughly $20,000 on classes.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}