{
    "relation": [
        [
            "...",
            "Scoring",
            "Points Allowed",
            "Rebounds",
            "Assists",
            "Steals",
            "Turnovers"
        ],
        [
            "Iowa State",
            "74.4",
            "69.8",
            "38.5",
            "15.3",
            "12.0",
            "14.1"
        ],
        [
            "Missouri",
            "81.3",
            "65.4",
            "36.0",
            "16.48",
            "5.4",
            "13.3"
        ],
        [
            "Edge",
            "MISSOURI",
            "MISSOURI",
            "IOWA STATE",
            "MISSOURI",
            "MISSOURI",
            "MISSOURI"
        ]
    ],
    "pageTitle": "BulldogBlitz.com - Scouting the Cyclones: Tonight's keys",
    "title": "Tale of the Tape",
    "url": "https://mississippistate.rivals.com/content.asp?CID=1050229",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00025-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 882818641,
    "recordOffset": 882802686,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1937=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 BulldogBlitz.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{40108=February 10, 2010, 52766=Top 10 upsets: A November to remember}",
    "textBeforeTable": "James Anderson put up 31 for Oklahoma State), but if Gilstrap compliments him with a big game, things could get interesting in a hurry. It will be interesting to see who draws the assignments to defend the ISU duo. Craig Brackins. But Brackins has been putting on a show in Ames for three years now and the Cyclones haven't been all that good. Gilstrap is the likely newcomer of the year in the Big 12, averaging 14.7 points and a team-high 9.2 rebounds. Missouri can survive a show from Brackins (as it did when This one will cause most to do a double-take. If you're going to stop one player, you would think it would have to be Contain Marquis Gilstrap PowerMizzou.com takes a look at five factors to watch in the pivotal Big 12 matchup. Missouri looks win its second straight and start up a new home winning streak tonight. The Iowa State Cyclones come to town looking to put a major dent in Missouri's tournament hopes. February 10, 2010 Scouting the Cyclones: Tonight's keys Gabe DeArmond PowerMizzou.com",
    "textAfterTable": "Survive on the glass Led by Brackins and Gilstrap, Iowa State can hit the boards a little bit. The Clones are fifth in the league in total rebounds and sixth in rebounding margin. Missouri did well against Colorado, but the Buffs just can't rebound at all. The Tigers will have to be far better on the boards than they were against Texas A&M the last time they played at home. Post up This is not a strength for these Tigers. Against most teams, Mizzou has an athletic advantage by putting Justin Safford, Keith Ramsey and Laurence Bowerson the perimeter and letting them work from the outside in. Not here. Brackins and Gilstrap can match up athletically with the Tiger forwards and take away a lot of the mid-range and driving opportunities. Missouri is going to need its big men to work in the paint and try to get one or both of the Cyclone forwards in foul trouble. Guard the line Though the numbers may be skewed since Lucca Steiger left the team, Iowa State is shooting 40% from three-point range on the season. That's good enough for third in the Big 12. Missouri is the best three-point defensive team in the league with opponents making only 30.4%. Something's got to give here. Iowa State can stay in this game by shooting well",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}