{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "You could join all types of diverse clubs.",
            "Have great and affordable food.",
            "Being willing to learn new things come to college ready to take on the world.",
            "Community really have a great team. They really take the time out to help you move forward in your future career and there courses is really great."
        ]
    ],
    "pageTitle": "Community College of Philadelphia Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Community-College-of-Philadelphia/reviews?_escaped_fragment_=/show/89872",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00224-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909315035,
    "recordOffset": 909258943,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{96008=I started at community in 2009 in their Early childhood education program having to take some low English classes. with the help of my professors in the education department i was able to succeed in the program graduating in August of 2012 with an Associate degree in education, 121328=May not always be perfect but it's good., 283886=© 2015, Cappex.com, LLC, 71186=I love the atmosphere of the Northeast Campus. They have many work-study jobs. I am CCP class of 2013 graduating with a degree and a certificate!}",
    "textBeforeTable": "08/19/2009 Reviewer is A current student here. 5 out of 7 people found this review useful. 1 of 74 Robert from Phila, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Login to rate or flag the reviews xxx from Philadelphia, PA 01/09/2010 Reviewer is A current student here. 3 out of 4 people found this review useful. 2 of 74 Categories Comments Great for these types of students - Students who want transfer to another college in one or two years. - Students who didn't do so well in High school and want to get their grades up. - Students looking for transfer credit. - Students who are unsure of their future. - Students who want a low-cost education. - Students who want a flexible schedule (in case you work, have a family, etc.) Tips for prospective students Don't take Community College for granted, it's a great school if you are looking at its art major. Be prepared to work hard, you will have to put more effort and time into your classes than in Highschool. Bang for the buck The school is incredibly cheap, what more can I say? $1,500 per semester for",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}