{
    "relation": [
        [
            "File Name",
            "oleaut32.dll",
            "oleaut32.dll",
            "oleaut32.dll",
            "oleaut32.dll",
            "oleaut32.dll",
            "oleaut32.dll",
            "oleaut32.dll",
            "oleaut32.dll",
            "oleaut32.dll"
        ],
        [
            "Version",
            "2.40.4532.0",
            "2.40.4520.0",
            "2.40.4520.0",
            "5.2.3790.727",
            "5.2.3790.3057",
            "5.2.3790.4202",
            "6.0.6000.20732",
            "3.50.5022.0",
            "5.1.2600.3266"
        ],
        [
            "Date",
            "21-Dec-2007",
            "21-Dec-2007",
            "21-Dec-2007",
            "21-Dec-2007",
            "21-Dec-2007",
            "21-Dec-2007",
            "21-Dec-2007",
            "21-Dec-2007",
            "21-Dec-2007"
        ],
        [
            "Time",
            "21:14",
            "21:14",
            "21:14",
            "21:14",
            "21:14",
            "21:14",
            "21:14",
            "21:14",
            "21:14"
        ],
        [
            "Size",
            "640,408",
            "939,144",
            "939,144",
            "508,552",
            "567,432",
            "563,848",
            "568,456",
            "586,888",
            "561,288"
        ]
    ],
    "pageTitle": "Microsoft Security Bulletin MS08-008 - Critical",
    "title": "",
    "url": "https://technet.microsoft.com/library/security/ms08-008",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00151-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900009087,
    "recordOffset": 899982072,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{12005=Published: February 12, 2008 | Updated: February 20, 2008, 11337=This is a critical security update for all supported editions of Microsoft Windows 2000, Windows XP, Windows Vista, Microsoft Office 2004 for Mac, and Visual Basic 6. For other affected editions of Windows, this update is rated moderate. For more information, see the subsection, Affected and Non-Affected Software, in this section., 3426=If third-party applications use or install the affected OLE component, could I still be vulnerable even after I have installed all required Microsoft security updates?  No, this security update replaces and re-registers the affected OLE component provided with the operating system. If third party applications follow the recommended best practices for using a shared component as a side by side assembly then they are also not affected. Customers are potentially at risk if third party applications do not follow the recommended best practices and instead redistribute a version of oleaut32.dll with their application. Microsoft Knowledge Base Article 921503 also contains instructions for customers that wish to manually check for the registered affected OLE component. Customers are encouraged to contact their third party solutions developer for addition information.}",
    "TableContextTimeStampAfterTable": "{40699=Note You can combine these switches into one command. For backward compatibility, the security update also supports the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841. For more information about the Update.exe installer, visit the Microsoft TechNet Web site., 115810=Built at 2014-04-18T13:49:36Z-07:00, 26222=By using Windows Server Update Services (WSUS), administrators can deploy the latest critical updates and security updates for Windows 2000 operating systems and later, Office XP and later, Exchange Server 2003, and SQL Server 2000 to Windows 2000 and later operating systems. For more information about how to deploy this security update using Windows Server Update Services, visit the Windows Server Update Services Web site., 4099=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2007-0065., 83169=Note You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841. For more information about the Update.exe installer, visit the Microsoft TechNet Web site., 18753=I am running Internet Explorer for Windows Server 2003. Does this mitigate this vulnerability?  Yes. By default, Internet Explorer for Windows Server 2003 runs in a restricted mode that is known as Enhanced Security Configuration. Enhanced Security Configuration is a group of preconfigured settings in Internet Explorer that can reduce the likelihood of a user or administrator downloading and running malicious Web content on a server. This is a mitigating factor for Web sites that you have not added to the Internet Explorer Trusted sites zone. See also Managing Internet Explorer Enhanced Security Configuration., 30432=System Center Configuration Manager (SCCM) 2007 uses WSUS 3.0 for detection of updates. For more information about SCCM 2007 Software Update Management, visit System Center Configuration Manager 2007., 30722=Note for Windows Vista Microsoft Systems Management Server 2003 with Service Pack 3 includes support for Windows Vista manageability., 101191=Download and install the appropriate language version of the Microsoft Office 2004 for Mac 11.4.0 Update from the Microsoft Mactopia Web site., 29486=For SMS 2003, the SMS 2003 Inventory Tool for Microsoft Updates (ITMU) can be used by SMS to detect security updates that are offered by Microsoft Update and that are supported by Windows Server Update Services. For more information about the SMS 2003 ITMU, see SMS 2003 Inventory Tool for Microsoft Updates. SMS 2003 can also use the Microsoft Office Inventory Tool to detect required updates for Microsoft Office applications. For more information about the Office Inventory Tool and other scanning tools, see SMS 2003 Software Update Scanning Tools. See also Downloads for Systems Management Server 2003.}",
    "textBeforeTable": "Affected Software The following software have been tested to determine which versions or editions are affected. Other versions or editions are either past their support life cycle or are not affected. To determine the support life cycle for your software version or edition, visit Microsoft Support Lifecycle. Affected and Non-Affected Software Known Issues. None. Recommendation. Microsoft recommends that customers apply the update immediately. This security update addresses the vulnerability by adding a check on memory requests within OLE Automation. For more information about the vulnerability, see the Frequently Asked Questions (FAQ) subsection for the specific vulnerability entry under the next section, Vulnerability Information. This is a critical security update for all supported editions of Microsoft Windows 2000, Windows XP, Windows Vista, Microsoft Office 2004 for Mac, and Visual Basic 6. For other affected editions of Windows, this update is rated moderate. For more information, see the subsection, Affected and Non-Affected Software, in this section. This critical security update resolves a privately reported vulnerability. This vulnerability could allow remote code execution if a user viewed a specially crafted Web page. The vulnerability could be exploited through attacks on Object Linking and Embedding (OLE) Automation. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights. Executive Summary General Information Version: 1.2 Published: February 12, 2008 | Updated: February 20, 2008 Vulnerability in OLE Automation Could Allow Remote Code Execution",
    "textAfterTable": "Operating System Windows Vista Service Pack 1 (all editions) Windows Server 2008 (all editions) Microsoft Office 2008 for Mac Frequently Asked Questions (FAQ) Related to This Security Update I am a third-party application developer and I use OLE Automation in my application. Is my application vulnerable and how do I update it?  Visual Basic 6.0 is the only development platform affected by this security update. This bulletin provides a link to download an update for Visual Basic 6.0 Service Pack 6. Developers that use the VB6 Package and Deployment Wizard to redistribute oleaut32.dll should ensure that they update the version of oleaut32.dll installed with their application by downloading the Visual Basic 6.0 update provided in this bulletin. Developers are encouraged to follow recommended best practices for using a shared component. For more information on best practices on shared component use, please see the Microsoft Knowledge Base Article 835322 on Isolated Applications. I am developing software which contains the redistributable file oleaut32.dll from Visual Basic6.0. What do I do?  You should install the security update included in this security bulletin for Visual Basic 6.0. If you have redistributed oleaut32.dll with your application, you should issue an updated version of your application to your customers with the updated version of this file included in Visual Basic",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}