{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "It is a very safe campus and i feel safe even walking around campus at night, there are a lot of lights and plenty of emergency telephones if you need help",
            "none",
            "There are a lot of activities you can do like intermearal sports or clubs like the Disney and harry potter club, or even be on the quiditch team, or play in the zombie vs humans stuff, there are activities for just about anyone",
            "outdoorsy, wanting to be teachers, hipsters, it's a great school for just about anyone",
            "there is a cool arboretum that is fun to walk through and see nature,",
            "I think it's worth the money, I feel like i am getting a good education and meeting so many new friends",
            "I like to sit in the sun and take in all the beauty around me, or go sit in the underground coffee house and read or meet new people",
            "The dinning hall food is okay, but they have great other options on campus that are great like panda express, subways and pizza, and i love the starbucks",
            "I love the dorms, they are great to find new friends and be apart of a community, some rooms can be kinda small but that's normal, defintley recommend to live on campus your first year",
            "The classes are great and some can be kinda challenging but the professors are willing to help and it you put in the time and effort you will do great",
            "Definitely check it out to see if you like it, it's a great school but you definitely need to make sure it's the right place for you",
            "Beautiful, Diverse, Academic"
        ]
    ],
    "pageTitle": "Western Washington University (Western) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Western-Washington-University/reviews?_escaped_fragment_=/show/2081",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00311-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 923813059,
    "recordOffset": 923673582,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{287332=Every club you could possibly think of is at Western. As of the beginning of the 2011-2012 school year there were 206 clubs that were holding meetings. If you can think of a possible club that doesn't already exist, all it takes if 4 friends and a quick application., 695294=© 2015, Cappex.com, LLC, 502302=Along with all of the activities and clubs constantly going on around campus, there are a ton of things to do around town. There is an area of town called Fairhaven where there are a ton of different little shops to go to as well as Boulevard Park to relax and goof off at. You can buy books, crafts, or even make your own piece of art at Creativity. In the downtown area, we have theaters (movies and plays), an imporv theater (where Ryan Stiles sometimes appears) and if you are 21 or over, this is where the bar an club scene is located. Also around town we have a mall where the discount movie theater is located, as well as the Value Village and Spirit Halloween store in October. There is also a location on Lake Watcom where you can rent Kayaks, sail boats, and wind surfers for really cheap., 362253=Apply early! Preferably before November 1st. Your application is like a place holder for housing. The earlier you submit it, the closer to the front you are in line for housing choices.}",
    "textBeforeTable": "07/29/2009 Reviewer is A current student here. 33 out of 33 people found this review useful. 1 of 138 Patricia from Brush Prairie, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Am learning a lot Aside from some 100 level classes, class sizes are generally small (at most 20-30 students), allowing for more one-on-one time between students and professors. In my experience, all of my professors have made themselves very available to students and have offered plenty of opportunities for extra help if needed. Classes are engaging and professors are very enthusiastic about their subjects, making learning all the more enjoyable. Login to rate or flag the reviews Alyssa from Carpinteria, CA 08/19/2009 Reviewer is A current student here. 16 out of 16 people found this review useful. 3 of 138 Categories Comments Great for these types of students Western and Bellingham is a great place for students who care about the environment and making it a greener place. Bellingham is very big on the recycling and compost and once you come an leave you will be too. It is also great for those interested in all sorts of outdoor activities because you can find about pretty much anything to do. Bellingham is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}