{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "It's safe. You won't find people that will steal your stuff, but it's not to say you should be stupid and not take care of your things. There is DPS (Department of Public Safety), you can all them to pick you up if it's late and you need a ride to your dorm. They will take forever though?, maybe it's just been my experience but it takes them a while. I don't want to put 5 stars, saying it's completely 100% guaranteed safety, and then something happens to the one person that read this. It's pretty safe. Do watch out for deer and their poop. I have also encountered raccoons and seen coyotes. I don't want to lie to y'all so there.",
            "There are social frats/sororities and 2 business frats. Social ones have dues around $500 or more. The business ones I hear are about $200. I'm not involved in either type so please be cautious of this information. My roommate is in a social sorority and she is involved but you do not have to be completely committed (die hard status). They give you opportunities and events which are optional. It does buy you friends though.",
            "The HAWC is great! You play pool and ping pong. They offer food options upstairs. The actual building is always open so you can do homework or what not. The Sandbar isn't that bad. Jamba Juice is inside the sandbar. There are also computers there for students to log onto and use, I typically use them to print things out. Mail services is also inside the sandbar. There is also a piano, you'll find students at Pepperdine are extremely talented. Also, you'll find a little couch area and a tv.",
            "The Board, which is like high school's ASB but with 10 times more funds, offers great opportunities to have fun. They put together Blue and Orange Madness and 2 concerts for students. This year Gavin Degraw performed. They have had free trips to Color Me Mine and Rosco's. This is just the tip of the ice berg. There are sometimes parties, off campus of course (know that Pepperdine is a dry campus), but you'll have to get a hold of a Greek life person to know when and where. There's always the beach, 5 minutes away. Santa Monica is at the end of PCH, and LA even further South. Both are great options but sometimes a hassle because it's so far away.",
            "Personally, I enjoy the food options at the Caf and HAWC. People have been asked and they say it's gross, it really isn't. I've only been here a couple months but I suppose that after 4 years it gets boring. Also, there aren't many options off campus. And the few that are available are expensive seafood places. I don't like seafood, so you can see the conflict I have. Back to on campus, their food is a bit greasy and not a lot of healthy options, besides the salad bar and vegetarian option. The salad bar gets old very quickly, you can only get so creative. I forgot to mention: La Brea Bakery (on campus). The place is great but I always forget I have it as an alternative. The offer soup bowls and grilled sandwiches. Don't go to Chipotle too often or you'll get tired of it.",
            "It's comfortable. It's not that interesting really. I use my dorm to sleep, that's pretty much it. I've had a great experience with my roommates and suite mates, some have had bad experiences. Be friendly, be yourself. COMMUNICATE. The person will never know something is wrong unless you tell them, don't waste your time or their time just let it out.",
            "I have only taken GE's so far. They're pretty all right, I could do better but still very manageable.",
            "Get involved! The best way is to join a sorority/ fraternity and be part of Greek life. You'll be in on the latest details and events. Also, bring your car on campus: parking permits are free and you'll need it if you ever want to escape the Malibu Bubble. Take advantage of everything! (All the free t- shirts and admission to games) Meet people, as many as you can, there are some pretty great ones out there.",
            "Pepperdine is truly great! You'll meet a lot of people here and they say they hate it but really they love it. The weather is perfect, the view is breathe taking. Pepperdine has so many opportunities. Their networking is incredible, very helpful for the future. The people are amazing. Sometimes they are too superficial. You just want someone that's real."
        ]
    ],
    "pageTitle": "Pepperdine University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pepperdine-University/reviews?_escaped_fragment_=/show/85261",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00254-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892659951,
    "recordOffset": 892575589,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{375160=© 2015, Cappex.com, LLC, 353245=Campus eating areas consist of the main cafeteria, which usually serves breakfast from 7:30-10 (2 PM on weekends -- sleeping in, FTW) and closes at 9, the H.A.W.C. mini-cafetaria, which stays open later and serves a lot of delicious, overpriced desserts, a Jamba Juice in the Sandbar (which also houses the mail center and a piano students are free to play), a La Brea Bakery/Peet's Coffee next to the cafe which opens rather late at 9, and a coffee cart that's sometimes open in the center plaza. If you're willing to hike, there are also cafeterias at the Drescher graduate campus and the School of Law. Food at the regular Seaver cafeteria is decent but has gotten rather dull due to lack of variety. Students living in residence halls have to purchase a meal plan. Girls usually get by with the minimum B-plan ($1500 equivalent) while guys eat more and end up upgrading to C-plan ($2000) or higher, though one can feasibly get a solid three meals a day by supplementing the B-plan with cereal or other groceries from Ralphs (about a mile away, and campus transportation gives free shuttle rides there)., 168966=The classes are pretty demanding, but you learn so much in the little time you are here per semester. Each semester is about 3 and a half months- that's right, you get out in April your second semester!, 238584=Pepperdine University is a private institution that was founded in 1937. It has a total undergraduate enrollment of 3,474, its setting is suburban, and the campus size is 830 acres. It utilizes a semester-based academic calendar. Pepperdine University's ranking in the 2013 edition of Best Colleges is National Universities, 54., 237536=The student-faculty ratio at Pepperdine University is 13:1, and the school has 67.7 percent of its classes with fewer than 20 students. The most popular majors at Pepperdine University include: Business, Management, Marketing, and Related Support Services; Communication, Journalism, and Related Programs; Social Sciences; Multi/Interdisciplinary Studies; and Psychology. The average freshman retention rate, an indicator of student satisfaction, is 90.2 percent., 349490=I toured Pepperdine last October and I was awestruck. The whole campus was amazing including the academics, campus life, and yes, the view was awesome too. I was completely amazed with Pepperdine., 44674=This has drastically increased since my freshman year 3 years ago. Today, Pepperdine has several dining options, including Jamba Juice, LaBrea Bakery, the Waves Café, and the HAWC student center, as well as coffee carts and small, airport-style take-out options. The quality of food has increased exponentially, as well as the variety of healthy, vegetarian and vegan options. Meal plans are organized on a point system; Freshman must have no less than the 1,100 point meal plan. 1 point = 1 dollar, and all points are loaded onto each student's ID card. Points roll over from Fall to Spring, but expire at the end of each Spring semester. The price of food is not unreasonable, but some food takes upwards of 20 minutes to prepare, worse during the busy hours. Further, the Caf closes at 8:30, so for late-night food, students go to the HAWC, which stays open until 2:00am. LaBrea is only open for breakfast and lunch, and Jamba Juice closes around 8.}",
    "textBeforeTable": "07/07/2009 Reviewer is A current student here. 51 out of 52 people found this review useful. 1 of 82 Rachael from Spokane, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. Pepperdine University Reviews Pepperdine University › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot Pepperdine definitely has some amazing teachers who are willing to go the extra mile for their students. If you put forth the effort, they will certainly reciprocate and work just as hard to make your time in class well spent. My best professor so far was the one who intimidated me from the first day. But I quickly learned that once I proved I was willing to do whatever it takes to succeed and better myself, he guided me with some of the most valuable advice I have ever received. Login to rate or flag the reviews Jessica from California 01/05/2010 Reviewer is A current student here. 23 out of 23 people found this review useful. 3 of 82 Categories Comments Great for these types of students Bookworms, Surfers, Those Looking to Study Abroad, Those Who Want to Keep Off the Freshmen Fifteen, Just About Everyone Tips for prospective students Come to Pepperdine!!! Pepperdine has it all: an excellent academic program,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}