{
    "relation": [
        [
            "Class",
            "Diuretic",
            "Diuretic",
            "Diuretic",
            "Diuretic",
            "Diuretic",
            "Diuretic"
        ],
        [
            "Drug",
            "HCTZ",
            "Chlorthalidone",
            "Furosemide",
            "Spironolactone",
            "Triamterene",
            "Amiloride"
        ],
        [
            "Initial Dose*",
            "1 mg/kg/day",
            "0.3 mg/kg/day",
            "0.5-2.0 mg/kg/ dose",
            "1 mg/kg/day",
            "1-2 mg/kg/day",
            "0.4-0.625 mg/kg/day"
        ],
        [
            "Maximal Dose",
            "3 mg/kg/day up to 50 mg/day",
            "2 mg/kg/day up to 50 mg/day",
            "6 mg/kg/day",
            "3.3 mg/kg/day up to 100 mg/day",
            "3-4 mg/kg/day up to 300 mg/day",
            "20 mg/day"
        ],
        [
            "Dosing Interval",
            "qd",
            "qd",
            "qd-bid",
            "qd-bid",
            "bid",
            "qd"
        ],
        [
            "Evidence?",
            "Expert opinion",
            "Expert opinion",
            "Expert opinion",
            "Expert opinion",
            "Expert opinion",
            "Expert opinion"
        ],
        [
            "FDA?",
            "Yes",
            "No",
            "`No",
            "No",
            "No",
            "No"
        ]
    ],
    "pageTitle": "Expert Panel on Integrated Guidelines for Cardiovascular Health and Risk Reduction in Children and Adolescents: Summary Report - NHLBI, NIH",
    "title": "",
    "url": "http://www.nhlbi.nih.gov/health-pro/guidelines/current/cardiovascular-health-pediatric-guidelines/summary",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00217-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 626999931,
    "recordOffset": 626911800,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{25693=From a population standpoint, clustering of multiple risk factors is the most common association with premature atherosclerosis. The pathologic studies reviewed above show clearly that the presence of multiple risk factors is associated with striking evidence of an accelerated atherosclerotic process. Among the most prevalent multiple risk combinations are the use of tobacco with one other risk factor, and the development of obesity which is often associated with insulin resistance, elevated triglycerides, reduced HDL cholesterol and elevated blood pressure, a combination known as the metabolic syndrome in adults. There is ample evidence from both cross sectional and longitudinal studies that the increasing prevalence of obesity in childhood is associated with the same obesity-related risk factor clustering seen in adults and that this continues into adult life. This high risk combination is among the reasons that the current obesity epidemic with its relationship to future CVD and DM is considered one of the most important public health challenges in contemporary society. One other prevalent multiple risk combination is the association of low cardiorespiratory fitness, identified in 33.6% of adolescents in the NHANES surveys from 1999-2002, with overweight and obesity, elevated total cholesterol and systolic blood pressure, and reduced HDL-C., 46566=Dr. McBride has served as a consultant or advisory board member for Bristol-Myers Squibb, and Merck. He has served on speakers bureaus for Kos, Merck and Pfizer. He declared no relevant relationships since July 2007., 45638=Atherosclerotic cardiovascular disease (CVD) remains the leading cause of death in North Americans but manifest disease in childhood and adolescence is rare. By contrast, risk factors and risk behaviors that accelerate the development of atherosclerosis begin in childhood and there is increasing evidence that risk reduction delays progression towards clinical disease. In 2006, the Director of the National Heart, Lung and Blood Institute (NHLBI), Dr. Elizabeth Nabel, appointed an Expert Panel to develop cardiovascular (CV) health guidelines for pediatric care providers based on a formal evidence review of the science, with an integrated format addressing all the major CV risk factors simultaneously., 43437=By contrast, given the scope of the charge to the Panel, this evidence review needed to address a broad array of questions concerning the development, progression and management of multiple risk factors extending from birth through 21 years of age, including studies with follow-up into later adult life. The time frame extended back to 1985, roughly 5 years before the review for the last NHLBI guideline addressing lipids in children published in 1992. Rather than RCTs, this evidence is largely available in the form of epidemiologic observational studies which must therefore be included in the review. In addition, the review required critical appraisal of the body of evidence that addresses the impact of managing risk factors in childhood on the development and progression of atherosclerosis. Finally, because of known gaps in the evidence base relating risk factors and risk reduction in childhood to clinical events in adult life, the review must include the available evidence justifying evaluation and treatment of risk factors in childhood. The process of identifying, assembling and organizing the evidence was extensive, the review process was complex and conclusions could only be developed by interpretation of the body of evidence. Even with inclusion of every relevant study from the evidence review, there were important areas where evidence was inadequate. Where this occurred, recommendations are a consensus of the Expert Panel. The schema used in grading the evidence appears in Table 1?2; expert consensus opinions are identified as Grade D.}",
    "TableContextTimeStampAfterTable": "{3673=The 2010 Dietary Guidelines for Americans (2010 DGA) include important recommendations for the population over the age of two. The National Cholesterol Education Program Pediatric Panel Report in 1992 provided dietary recommendations for all children as part of a population-based approach to reducing cardiovascular risk. Evidence relative to diet and the development of atherosclerosis in childhood and adolescence was identified by the evidence review for this guideline, and collectively, this provides the rationale for new dietary prevention efforts initiated early in life., 386674=** There is only one FDA-approved fish oil preparation, but there are many generic forms of fish oil capsules that are commercially available. The University of Wisconsin maintains a preventive cardiology patient education Web site http://www.heartdecision.org. The \"fish oil\" section includes information about the content of various preparations. The Web site is updated every 6 months (https://www.heartdecision.org/chdrisk/v_hd/patient_edu_docs/Fish_Oil_11-2007.pdf, 35923=a Based on Estimated Energy Requirements (EER) equations, using reference heights (average) and reference weights (health) for each age/gender group. For children and adolescents, reference height and weight vary. For adults, the reference man is 5 feet 10 inches tall and weighs 154 pounds. The reference woman is 5 feet 4 inches tall and weighs 126 pounds. EER equations are from the Institute of Medicine. Dietary Reference Intakes for Energy, Carbohydrate, Fiber, Fat, Fatty Acids, Cholesterol, Protein, and Amino Acids. Washington (DC): The National Academies Press; 2002., 248210=2.5-6.25 mg/day, 77725=The Fourth Report of the National High Blood Pressure Education Program provided an algorithm and flow diagram to assist clinicians in identifying hypertension in children. For these guidelines, the Fourth Report recommendations are stratified here to provide an age-appropriate approach congruent with other risk factor recommendations in other sections and this is also reflected in a series of revised algorithms (Table 8?1, and Figures 8?1 and 8?2). Conditions under which children < 3 years old should have blood pressure measured are shown in Table 8?2. The blood pressure norms for age, sex, and height are shown in Tables 8?3 and 8?4 below and are taken directly from the Fourth Report. Age-specific percentiles of blood pressure measurements from birth to 12 months are provided in the Report of the 2nd Task Force for Blood Pressure Control in Children, 1987. For all age groups the assessment of left ventricular mass by echocardiography is recommended as the best method to assess hypertensive target organ disease; this should be done for patients with Stage 2 hypertension and those with persistent Stage 1 hypertension. Elevated LV mass may be useful in establishing the need for pharmacologic treatment of hypertension. In Table 8?5, the medications used to achieve blood pressure control in children and adolescents are shown. At present, there are no data to support the use of specific antihypertensive agents for specific age groups., 4293=These new pediatric CV guidelines not only build upon the recommendations for achieving nutrient adequacy in growing children as stated in the 2010 DGA but also add evidence regarding the efficacy of specific dietary changes to reduce CV risk from the current evidence review for the use of pediatric care providers in the care of their patients. Because the focus of these guidelines is on CV risk reduction, the evidence review specifically evaluated dietary fatty acid and energy components as major contributors to hypercholesterolemia and obesity, as well as dietary composition and micronutrients as they affect hypertension. New evidence from multiple dietary trials addressing CV risk reduction in children provides important information for these recommendations., 5220=The Expert Panel concluded that there is strong and consistent evidence that good nutrition beginning at birth has profound health benefits, with the potential to decrease future risk for CVD. The Expert Panel accepts the 2010 DGA as containing appropriate recommendations for diet and nutrition in children 2 years and older. The recommendations in these guidelines are intended for pediatric care providers to use with their patients to address CV risk reduction. The conclusions of the Expert Panel's review of the entire body of evidence in a specific nutrition area with grades are summarized below. Where evidence is inadequate yet nutrition guidance is needed, recommendations for pediatric care providers are based on a consensus of the Expert Panel (Grade D). The age- and evidence-based recommendations of the Expert Panel follow., 74034=In 2004, an NHLBI Task Force published The Fourth Report on the Diagnosis, Evaluation and Treatment of High Blood Pressure in Children and Adolescents. This report included a complete review of the current evidence on this subject and detailed recommendations for managing blood pressure throughout childhood. These recommendations were used as the basic recommendations for these guidelines, considered complete until 2003 when the review for the report ended. This evidence review for blood pressure for these guidelines was therefore limited to studies published between January 1, 2003, and June 30, 2007, with the addition of selected studies through June 30, 2008, identified by the Expert Panel that meet all the criteria for inclusion. Repeating the review performed by the Fourth Report Task Force was not felt to be necessary, given the short time since publication of that report, nor a judicious use of the resources available for development of these guidelines. Recommendations regarding blood pressure are all graded as expert opinion (Grade D) as they are based on the expert consensus conclusions of the Fourth Report., 394660=To identify overweight and obesity in children living in the U.S., BMI percentile distributions relative to gender and age on the Centers for Disease Control and Prevention (CDC) 2000 growth charts are now the preferred reference. The CDC growth charts were not developed as a health-related standard. Instead, the growth charts present percentiles of the BMI distribution derived from measurements taken during several NHANES surveys as points of reference. Although the charts were published in 2000, they include selected data from the 1963 through 1980 surveys and thus are not representative of the U.S. population in 2000. These BMI percentile growth charts provide the best reference data available for describing normal growth in U.S. children. They are, however, a screening tool and not an instrument for the diagnosis of overweight and obesity., 269932=Since the last NHLBI guidelines for lipid management in children and adolescents were published in 1992, both the knowledge base surrounding dyslipidemia in childhood and clinical picture have changed. A series of critical observational studies have demonstrated a clear correlation between lipoprotein disorders and the onset and severity of atherosclerosis in children, adolescents and young adults. A major increase in the prevalence of obesity has led to a much larger population of children with dyslipidemia. At the time of the original guidelines, the focus was almost exclusively on identification of children with elevated low density lipoprotein cholesterol (LDL-C). Since then, the predominant dyslipidemic pattern in childhood is a combined pattern associated with obesity, with moderate to severe elevation in triglycerides (TG), normal to mild elevation in LDL-C and reduced high density lipoprotein cholesterol (HDL-C). Both dyslipidemic patterns have been shown to be associated with initiation and progression of atherosclerotic lesions in children and adolescents as demonstrated by pathology and imaging studies. Identification of children with dyslipidemias, which place them at increased risk for accelerated early atherosclerosis, must include a comprehensive assessment of serum lipids and lipoproteins., 239098=Quinapril, 248863=Children >6 years: 1 mg/kg/day (12.5-50 mg/day), 64136=A clinical practice guideline update from the U.S. Public Health Service published in May, 2008 systematically reviewed almost 9,000 publications and concluded that smoking prevention and cessation interventions are effective in adults. These same methods should be safely applicable in childhood and adolescence since behavioral interventions to alter smoking behaviors have little if any morbidity, and since morbidity with pharmacologic treatment is limited. Physicians who care for children are well positioned to provide prevention and treatment interventions for their patients. Youth interventions must target parents as well as children since parental smoking is both a risk factor for child smoking and provides second hand smoke exposure to fetuses and children. The evidence review assessed prevention and treatment interventions in each of these areas., 440522=There is a lack of consensus on how to define metabolic syndrome in youth, which has led to widely varying estimates of its frequency. A recent analysis of National Health and Nutrition Examination Survey data from 1999 to 2002 yielded prevalence estimates for all teens from 2.0-9.4% and for obese teens from 12.4-44.2%. Regardless of the definition used, the prevalence of the metabolic syndrome risk factor cluster is higher in older (12- to 14-year-old) children compared with younger (8- to-11-year-old) children. The specific etiology for metabolic syndrome is unknown; however, it is most likely caused by the expression of various genotypes modified by environmental interactions and mediated through abdominal obesity and insulin resistance. Longitudinal studies of cohorts where the metabolic syndrome cluster was present in childhood identify an increased incidence of both T2DM and clinical CV events over a followup of 25 years. A strong association between obesity with or without elevated insulin levels and /or hypertension in early childhood and subsequent development of the metabolic syndrome constellation in adulthood has been consistently demonstrated. Treatment of CV risk factor clustering in youth has not been thoroughly evaluated but maintenance of low levels of CV risk factors starting in childhood is associated with a lower prevalence of cardiovascular disease and with increased longevity in adult life., 392913=Dramatic increases in childhood overweight and obesity in the United States since 1980 are an important public health focus. Despite efforts over the last decade to prevent and control obesity, recent reports from NHANES show sustained high prevalence with 17% of children and adolescents with a BMI above the 95th percentile for age and gender. The presence of obesity in childhood and adolescence is associated with increased evidence of atherosclerosis at autopsy and of subclinical measures of atherosclerosis on vascular imaging. Because of its strong association with many of the other established risk factors for CV disease, obesity is even more powerfully correlated with atherosclerosis; this association has been shown for blood pressure, dyslipidemia and insulin resistance in each of the major pediatric epidemiologic studies. Of all the risk factors, obesity tracks most strongly from childhood into adult life. Improvement in weight status and decrease in body fatness have been shown to be associated with improvement in all the obesity-related risk factors and in sub-clinical vascular changes. Higher BMI during childhood is directly associated with increased coronary heart disease in adult life. Extrapolation from current data suggests that adolescent obesity will likely increase adult CHD by 5 to 16% over the next 25 years with more than 100,000 excess cases of CHD attributable to increased obesity in childhood. The evidence review included RCTs, systematic reviews, meta-analyses and observational studies assessing the prevention and treatment of overweight and obesity in childhood and adolescence., 63216=Tobacco dependence is responsible for approximately 4 million annual deaths worldwide, and in utero exposure to tobacco products, involuntary tobacco smoke exposure (second hand smoke), and tobacco use directly impair health in fetuses, infants, children, and adolescents. Based on an analysis of published causes of death, tobacco use is the leading actual cause of death in the U. S. The evidence that cigarette use is harmful and addictive is unequivocal. In childhood, nicotine is highly addicting with symptoms of tobacco dependence demonstrated after brief intermittent use. Cigarette use among high school students declined from 1997 to 2003. Rates were stable from 2003 to 2007 with more than 20% of high school students reporting daily smoking. From a public health standpoint, the need to reduce tobacco exposure is compelling, and a role for pediatric health care providers is essential., 79360=BP recommendations are based on The Fourth Report on the Diagnosis, Evaluation, and Treatment of High Blood Pressure in Children and Adolescents (Fourth Report), with the evidence review updated from 2003.}",
    "lastModified": "Sun, 02 Aug 2015 20:02:30 GMT",
    "textBeforeTable": "(Table 5?2 provides estimated energy requirements (EER) by age, gender and activity level.) Table 5-3. DASH Eating Plan: Servings per Day by Food Group and Total Energy Intake d Estimates for females do not include women who are pregnant or breastfeeding. c The calorie ranges shown are to accommodate needs of different ages within the group. For children and adolescents, more calories are needed at older ages. For adults, fewer calories are needed at older ages. b Sedentary means a lifestyle that includes only the light physical activity associated with typical day-to-day life. Moderately active means a lifestyle that includes physical activity equivalent to walking about 1.5 to 3 miles per day at 3 to 4 miles per hour, in addition to the light physical activity associated with typical day-to-day life. Active means a lifestyle that includes physical activity equivalent to walking more than 3 miles per day at 3 to 4miles per hour, in addition to the light physical activity associated with typical day-to-day life. a Based on Estimated Energy Requirements (EER) equations, using reference heights (average) and reference weights (health) for each age/gender group. For children and adolescents, reference height and weight vary. For adults, the reference man is 5 feet 10 inches tall and weighs 154 pounds. The reference woman is 5 feet 4 inches tall and weighs 126 pounds. EER equations are from the Institute of Medicine. Dietary Reference Intakes for Energy, Carbohydrate, Fiber,",
    "textAfterTable": "3-4 or less 6 or less 6 or less 6 or less 1 oz cooked meats, poultry, or fish 1 egg? Select only lean; trim away visible fats; broil, roast, or poach; remove skin from poultry Rich sources of protein and magnesium Nuts, seeds, and legumes 3 per week 3 per week 3-4 per week 4 per week 4?5 per week 1 1/3 cup or 1½ oz nuts 2 Tbsp peanut butter 2 Tbsp or ½ oz seeds ½ cup cooked legumes (dry beans and peas) Almonds, filberts, mixed nuts, peanuts, walnuts, sunflower seeds, peanut butter, kidney beans, lentils, split peas Rich sources of energy, magnesium, protein, and fiber Fats and oils? 1 1 2 2-3",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}