{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very safe campus. Campus PD can be overbearing at times, but they have good intentions.",
            "Greek life is good, but it's definitely not the South.",
            "All types, everyone will find a niche.",
            "Make sure to find the hollow trees for late at night hanging out. Also there are cool hidden things throughout the campus like the sword in the ____ building or the cans in _____ hall. Try and find them!",
            "For both in state and out of state.",
            "Spend time outside, golf, party, frisbee, date girls, eat food, experience eugene, run, play intramural sports, go to concerts, greek life, there is an unbelievable amount to do.",
            "Food is out of control good. I am an upper classman and still go back to the dorms for food. It's like having an upscale natural food market in the lobby of your dorms.",
            "Some of the dorms are old and falling apart, but everything is being rebuilt. The people, RA's and social life is great!",
            "This is all very based on major as well as prior study habits and organizational skills.",
            "1. Your dorm friends aren't going to be your friends forever 2. Take risks early on and don't feel obligated to commit to anything 3. Get out of your comfort zone and live a little 4. Push yourself academically and be social, you will succeed",
            "Unbelievable opportunity to grow in a thriving community with like minded peers. I highly recommend this school as it is more than just an academic experience. The community and people here are fantastic and everything is only going to get better."
        ]
    ],
    "pageTitle": "University of Oregon (UO) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Oregon/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00049-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 920498799,
    "recordOffset": 920342417,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{759356=The classes are definitely challenging and engaging. I can easily say that if you are present in class and attentive that you are going to learn all these amazing topics and skills. The ratio is 20:1, so the professors are literally everywhere and willing to meet and help you work through topics., 860429=© 2015, Cappex.com, LLC, 71165=Take all of the different groups and types of people that you can think of and multiply that by 1000. Whatever type of student you are, you will be able to find others like you at U of O., 410761=I toured the campus this summer during July, and absolutely fell IN LOVE with this school. The school spirit, the excessive friendliness emanating from people on every corner, how much there was to do and get involved in and the academic rigor they portrayed. Also, the campus is absolutely beautiful, and there seems like something to do for everyone, and there's no one specific stereotype at the U of O., 53173=Get your FAFSA in on time and if you are coming from a different state make sure you get it in by March 1st. My state gave me a different date and my mom is now working double time to pay for my education on her own.}",
    "textBeforeTable": "07/18/2009 Reviewer is A current student here. 42 out of 47 people found this review useful. 1 person found this inaccurate. 1 of 188 Christina from Eugene, OR Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Oregon Reviews University of Oregon › Oregon › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Alexandra from San Diego, CA 11/01/2010 Reviewer is A current student here. 19 out of 19 people found this review useful. 3 of 188 Categories Comments Great for these types of students I can't imagine anyone who would not enjoy being here. The education is terrific, the people are awesome and the school spirit is unbelievable and so exciting. Tips for prospective students Go see the school and talk to some of the students. Be prepared for rain, but it's no big deal. Consider a bike with fenders. Bang for the buck Absolutely worth it. I wish I lived in Oregon so I could pay in-state tuition, but with my scholarship from the school, I am not paying much more than I would for an in-state California University. Am enjoying being here I did not know how I was going to feel about",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}