{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Students that like small colleges and class sizes.",
            "Joining student organizations are always fun! Leadership programs are available to all students! Going to athletic sports games are also fun as well.",
            "There is a small cafe, but it usually closes around 4pm.",
            "There are no dorms.",
            "Take as much classes you possibly can! Study any extra time you can, while knowing breaks are good for the body! Strive for an A all the time.",
            "Make sure you go check out where all your classes are prior to the beginning of classes. Wearing sneakers are great for comfort when traveling through the campus. Getting to know all your teachers is very important because they are the ones you can get accurate help from!",
            "It is great for students that enjoy small-sized classes! Its not a very big college, so getting to classes on time is easily done. The advisers are great with matching your classes with your major!"
        ]
    ],
    "pageTitle": "Northwest Florida State College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Northwest-Florida-State-College/reviews?_escaped_fragment_=/show/128074",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00249-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912280435,
    "recordOffset": 912236243,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{93705=Make sure you start you financial aid in February for the following fall classes--there is no rushing their financial aid office., 89268=This is my first college and I thought everything was expensive. However, compared to other colleges, the classes and books are actually reasonable. Instead paying sometimes a $1000 for one class, you can pay as low even $100 per subject., 125329=I am guessing this is asking something about the price of the school or something? So under that interpretation it is fairly cheap, a 12 credit semester will run you about 1300 and then books which will be about another 500. One good thing is they now offer book rentals or you can always sell your old books back for about half price., 177977=I have never seen a squad car or campus safety officer in six years. I've been told parking is only enforced until 1700. If there is any campus security, I'm guessing they go home at 1700. I have almost exclusively all night classes since that is the only time they are offered. Walking around campus at night I notice the outside lights along the buildings and pathways aren't even on. This is the darkest campus I have ever seen. The school is clearly more interested in reducing costs that providing security for students., 210957=© 2015, Cappex.com, LLC, 2063=Even though it is not a huge college, it is a pretty big college for our community, allowing to attend smaller classes, which means we get to know mostly everybody. I am enrolled in the Pre-Architectural Program, which means i must take all my classes with the same class mates i started with way back in Fall-2008. We have been very helpful with each other, very friendly, etc. The one thing i enjoy the most, it my free time. The college is very flexible, is very easy to get from one building to another, it is just great.}",
    "textBeforeTable": "08/10/2009 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 51 Miguel from Niceville, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Categories Comments What to do for fun The gym is awesome. There is a small theater in town and Destin is only 15 minutes away. Food and Dining Niceville is a small town and there are tons of restaurants nearby. Dorm Life There are apartments close to the school but being a community college there are not exactly dorms. Academic Rigor Depending on the class, more work will be expected of you then others. But if you are willing to actually read the books and pay attention in class it is not hard to pass. Tips for prospective students Attendance policy is enforced so make sure you go to school, and try to get there early if you want a good parking spot. In three sentences The campus is easy to get around and the staff and faculty are friendly. Speaking to an adviser takes time though and some classes are more challenging then others, but over all the school is nice and should be appreciated. Login to rate or flag the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}