{
    "relation": [
        [
            "s",
            "c32",
            "ps"
        ],
        [
            "-",
            "-",
            "-"
        ],
        [
            "puntero al array de caracteres estrecho donde se realizará el carácter multibyte almacenados Original: pointer to narrow character array where the multibyte character will be stored The text has been machine-translated via Google Translate. You can help to correct and verify the translation. Click here for instructions.",
            "el carácter de 32 bits para convertir Original: the 32-bit character to convert The text has been machine-translated via Google Translate. You can help to correct and verify the translation. Click here for instructions.",
            "puntero al objeto de estado de conversión que se utiliza al interpretar la cadena multibyte Original: pointer to the conversion state object used when interpreting the multibyte string The text has been machine-translated via Google Translate. You can help to correct and verify the translation. Click here for instructions."
        ]
    ],
    "pageTitle": "c32rtomb - cppreference.com",
    "title": "",
    "url": "http://es.cppreference.com/w/c/string/multibyte/c32rtomb",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 84441099,
    "recordOffset": 84423338,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 12 Sep 2013 02:43:40 GMT",
    "textBeforeTable": "[editar] Parámetros here for instructions. You can help to correct and verify the translation. Click Google Translate. The text has been machine-translated via __STDC_UTF_32__ is defined, the 32-bit encoding used by this function is UTF-32, otherwise it is implementation-defined. In any case, the multibyte encoding used by this function is specified by the currently active C locale. If the macro Original: __STDC_UTF_32__ macro se define, la codificación de 32-bit utilizado por esta función es UTF-32, de lo contrario, es definido por la implantación. En cualquier caso, la codificación multibyte utilizado por esta función se especifica por la configuración regional C actualmente activo . Si el here for instructions. You can help to correct and verify the translation. Click Google Translate. The text has been machine-translated via *ps is updated to represent the initial shift state. U'\\0', a null byte is stored, preceded by any shift sequence necessary to restore the initial shift state and the conversion state parameter c32 is the null wide character If Original:",
    "textAfterTable": "[editar] Valor de retorno En caso de éxito, devuelve el número de bytes (incluyendo las secuencias de cambio) por escrito a la matriz de caracteres cuyo primer elemento es apuntado por s. Este valor puede ser ​0​, por ejemplo al procesar la primera char32_t en multi- char32_t-secuencia de caracteres (no se produce en UTF-32) . Original: On success, returns the number of bytes (including any shift sequences) written to the character array whose first element is pointed to by s. This value may be ​0​, e.g. when processing the first char32_t in multi- char32_t-character sequence (does not occur in UTF-32). The text has been machine-translated via Google Translate. You can help to correct and verify the translation. Click here for instructions. En caso de fallo (si c32 no es válida 32-bit personaje), regresa -1, tiendas EILSEQ en errno y deja *ps en estado indeterminado . Original: On failure (if",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}