{
    "relation": [
        [
            "",
            "25.",
            "",
            "26.",
            ""
        ],
        [
            "",
            "i",
            "i",
            "i",
            "i"
        ],
        [
            "Children:",
            "Edward Granville Eliot born 29 Aug 1798.",
            "Caroline Georgina Eliot born 27 Jul 1799, baptised 29 Aug 1799, St Germans, Cornwall, died Apr 1865, buried Bognor Regis, Sussex.",
            "Susan Caroline Eliot born 12 Apr 1801.",
            "Charlotte Sophia Eliot born 28 May 1802, baptised 21 Jun 1802, St Martin's-in-the-Fields, Westminster, married 26 Jul 1825 in St James' Church, Westminster, George Martin, who died 27 Aug 1860. Charlotte died 8 Jul 1839, buried Harberton, Devon."
        ]
    ],
    "pageTitle": "The Leveson-Gower Family",
    "title": "",
    "url": "http://freespace.virgin.net/john.elkin/levgower001.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00254-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 98838467,
    "recordOffset": 98822511,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28025=Dudley was created Viscount Sandon and Earl of Harrowby, 19 Jul 1809., 24774=William was MP (Tory) for St Germans 1791-1802, Secretary to Legation at Berlin, Nov 1791-1793, Secretary of Embassy and Minister Plenipotentiary at The Hague 1793-1794, Minister Plenipotentiary to the Elector Palatine and to the Diet of Ratisbon 1796, Lord of the Admiralty 1800-1804, MP (Tory) for Liskeard 1802-1823, Under-Secretary for Foreign Affairs 1804-1805, Lord of the Treasury 1807-1812. Succeeded to the peerage as 2nd Earl of St Germans, 17 Nov 1823., 26975=Henry was MP for Monmouth 1788-90, Bristol 1790-96, Gloucestershire 1796-1803.}",
    "lastModified": "Sun, 09 Jun 2013 22:12:44 GMT",
    "textBeforeTable": "Sir Thomas Gower, 2nd Baronet, born 1605, (son of Sir Thomas Gower and Anne D'Oyley) married (1) Elizabeth Howard, (daughter of Sir William Howard of Naworth Castle and sister of the 1st Earl of Carlisle) married (2) 1631, Frances Leveson, (daughter of Sir John Leveson of Haling and Lilleshall). Thomas buried 3 Sep 1672. MP for Malton, 1661-72, twice Sheriff of the county of York. Knighted 1630. 1. First Generation Generation: [1] [2] [3] [4] [5] [6] [7] [8] [9] [10] [11] [12] [13] The Leveson-Gower Family",
    "textAfterTable": "2. Edward Gower (son of Thomas Gower and Frances Leveson) married Dorothy Wentworth, (daughter of Thomas Wentworth of Elmshall). Edward buried 24 Jan 1662. Children: i Sir Thomas Gower, 3rd Baronet, baptised: 2 Oct 1665, died 28 Oct 1689, Dundalk. ii Frances Gower married Sir James Wood. Frances died 1690. iii Dorothy Gower baptised: 18 Feb 1668. 3. Sir William Leveson-Gower, 4th Baronet, (son of Thomas Gower and Frances Leveson) married Jane Grenville, (daughter of John Grenville, 1st Earl of Bath) died 27 Feb 1696. William died Dec 1691. Children: 4. i John Leveson-Gower born 7 Jan 1674/5. ii Richard Leveson-Gower. iii William Leveson-Gower. iv Katherine Leveson-Gower born 31 Jan 1670, married 14 Jun 1687, Sir Edward Wyndham, 2nd Baronet, of Orchard Wyndham, Somerset. v Jane Leveson-Gower married 2 May",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}