{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "there are as many mishaps here as there are on other campuses, the unfortunate part is that this campus is smaller and therefore cannot hide as much as a larger university but the campus is safe. careless mistakes and risks of course will make it as dangerous as any other college.",
            "cant vouch for that since i do not participate in them.",
            "in the realm of rotc we do a lot as far as spending time together whether it is sponsored by the actual organization or just organized by us. the other clubs engineering, tech, and frats all seem to get out and do a lot as well so the activities are good. the clubs are fairly numerous as well so you will be able to find something that suites you and your major.",
            "students that want smaller universities and the chance to get a lot of help from teachers would definitely like this campus. also those who have higher gpas get the benefit of nicer housing, the higher the gpa the nicer the housing (which is divided into phases).",
            "every wednesday the students have a sort of gathering where they play music, sign up for clubs, socialize and have fun, its an interesting scene definitely something to check out while living on campus.",
            "the money is definitely worth it if you can also afford the time. although its a smaller university the classes arent exactly easier, soem can be challenging and some can be easier. from what i have gotten i can say that it is worth the money, you get a very good education for less cost than other larger universities with more individual attention as well.",
            "the campus has a movie theatre that shows a few films now and again. if not there are always some events that the students themselves sponsor to keep people amused. while there isnt too much in the entertainment scene around hempstead or waller, a few miles farther down there road there are a lot of things to do in cypress, if one can get a ride down there.",
            "the food is not bad, its of course not the top notch cuisine but it doesnt have to be since its meal plan food. the few times i have eaten there i can attest that the food is fairly good.",
            "i live off campus so i no personally experience with the dorm life.",
            "any of these course are what you make of it, and you get out of it what you put in. if you focus this college is like any other and can be tougher depending on the major.",
            "apply for all the financial aid that you can, regardless of whether you think you might need it or not, its always good to have a back up in case a payment doesnt go through or you run into some money trouble personally. keep to the studies and",
            "the university itself is a great place to attend, i wouldn't have thought so if i hadn't come to this school. the smaller population allows for a more personal academic experience and the connections this school has offer a number of jobs upon graduating. the school is cheaper and has a habit of flushing out those who aren't committed to their education by the first year."
        ]
    ],
    "pageTitle": "Prairie View A & M University (PVAMU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Prairie-View-A-M-University/reviews?_escaped_fragment_=/show/1802",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00331-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906694135,
    "recordOffset": 906580434,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{260442=Prairie View A&M instills the proper tools for a student to go off into the real world and succeed. On a scale from 1-10, 10 being the highest, I would rate the school a 10. I can't wait until the fall of 2012 to go to school at PVAMU., 630617=© 2015, Cappex.com, LLC, 229437=They can be a little unorganized. When I applied in 2011, they lost all of my paperwork and I had to pay money to everything sent again. The staff can be a little rude., 114481=For me it is safe. I'm an architect major and at times I'm in the architecture building at 3 or 4 o'clock in the morning and I've walked back to my dorm room across campus worry free. Just lookout for the skunks because they will spray you. Also during the events they do have security outside the gates of the dorm rooms to make sure that the people that are trying to get into the dorm areas actually live there., 19039=I have visited this campus several times because I was interested in attending it in the Fall of 2009. This faculty that I have spoken with pretended like they wanted to assist me with enrolling but each time that I have attended I leave not knowing much more than when I visited. I'm very frustrated and feel that they do not want me as a student. You have to jump through hoops to get any info and they really act like they don't care. I am now looking at going to another college because of this., 607517=With the new recreational center being put up this January I plan to be in there lifting often, But as of now basketball and some on campus activities such as salsa night are fun things to do.}",
    "textBeforeTable": "07/20/2009 Reviewer is A current student here. 39 out of 40 people found this review useful. 1 of 158 Chelsea from Prairie View, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. Prairie View A & M University Reviews Prairie View A & M University › Texas › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Tips for prospective students It is very important to choose your friends wisely. They can make you or break you. Hanging with the wrong crowd can prevent you from having a successful college career so please choose your friends wisely. Login to rate or flag the reviews Empress from Seagoville, TX 01/02/2010 Reviewer is A current student here. 21 out of 21 people found this review useful. 4 of 158 Categories Comments Great for these types of students Students who want to attend a Historical Black College. Future Nursing Majors Open-Minded Students Future Leaders Productive Students College Prepared students, Prairie View is nothing like High School. Tips for prospective students Beside Prairie View's location, there is always some type of activity that enrolled students can get involved in on or around campus. It's location is also another reason that Prairie View A&M University is so family oriented. However, when choosing this University, you're in for a journey, a wonderful journey at that. Once you're a Panther you're always a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}