{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They think they are real cops but they are just security guards.",
            "So cheap go here first and then transfer it is so affordable.",
            "Join a club and get involved!",
            "Someone reccommend a dining plan!",
            "You have to work you are still in college!",
            "Just because it is County College does not mean it's easy.",
            "Very concerned about their students. Always looking for a way to make school easier. Very serious about advising students for the following semester."
        ]
    ],
    "pageTitle": "County College of Morris Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/County-College-of-Morris/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894219919,
    "recordOffset": 894192118,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{105735=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/07/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 27 courtney from Randolph, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Categories Comments Great for these types of students The County College of Morris is great for any high school graduate looking to complete some of the general education courses before transferring over to a university. It is the same quality education but MUCH more affordable. This school is also great for any student to graduate with an associates. We are one of the top 10 community colleges in New Jersey, so if you are a student looking for an affordable, quality education, this is the school for you! Tips for prospective students If you are a prospective student worried about not receiving the college life experience while attending a community college, this is THE school for you. That is not an issue while attending this community college and I can promise you that it will be an experience you will never forget. Bang for the buck Attending community college is probably the best financial decision a college student can make. This school is affordable, offers several scholarships, and provides quality knowledge and education to each and every student. Am enjoying being here This is my second year here at the County College of Morries. Graduating from high school I had my heart set on",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}