{
    "relation": [
        [
            "Indicator",
            "Exercise",
            "Arthritis Program",
            "Maternal Mortality Review",
            "Sexuality Education in Public Schools",
            "STD/STI/HIV Education in Public Schools",
            "Rejection of Abstinence-Only Funds"
        ],
        [
            "Strength of Policy",
            "Limited Policy",
            "Limited Policy",
            "No Policy",
            "No Policy",
            "No Policy",
            "No Policy"
        ],
        [
            "Change from 2007",
            "N/A",
            "N/A",
            "N/A",
            "Same",
            "Same",
            "N/A"
        ]
    ],
    "pageTitle": "Mississippi | Health Care Report Card",
    "title": "",
    "url": "http://hrc.nwlc.org/states/mississippi",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00286-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 119859167,
    "recordOffset": 119842659,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1592=2010 Grade}",
    "TableContextTimeStampAfterTable": "{157572=4 The 2010 Report Card uses data from a different source than in 2007, therefore the 2007 data are not shown in the 2007 column., 158758=© 2010 National Women's Law Center, 155827=1 Currently, states use two different versions of the U.S. Standard Certificate of Live Birth, the source for prenatal care data used in the Report Card. Data collected using the two different birth certificate revisions are not comparable; therefore the Report Card does not grade or rank the states for this indicator. Data for 17 states--Delaware, Florida, Idaho, Kansas, Kentucky, Nebraska, New Hampshire, New York, North Dakota, Pennsylvania, South Carolina, South Dakota, Tennessee, Texas, Vermont, Washington, and Wyoming--is based on the 2003 Revision of the U.S. Standard Certificate of Live Birth. Data for the remaining the remaining 33 states and the District of Columbia is based on the 1989 Revision of the U.S. Standard Certificate of Live Birth. Comparison data is shown in the 2007 column only for the states which continue to use the 1989 revision., 156722=2 The definition of binge drinking among women used by the Behavioral Risk Fact Surveillance System (BRFSS: the Report Card’s data source for this indicator) from 2000 to 2005 was five or more drinks per occasion and was modified in 2006 to be four or more drinks per occasion. The apparent change in the prevalence of binge drinking between 2000 and 2010 among women may be related, in part, to this change in definition. Note that the same Healthy People 2010 benchmark (to reduce the prevalence of binge drinking, with no definition specified, to 6%) is used to determine grades for binge drinking in the 2004, 2007, and 2010 Report Cards., 157402=3 Because more current data are not available, the data from the 2007 Report Card have not been updated and are not shown in the 2007 column.}",
    "lastModified": "Mon, 08 Jul 2013 16:30:09 GMT",
    "textBeforeTable": "Medicaid Eligibility by Income Access to Health Insurance & Services Women's Access to Health Care Services Policy Indicators F 49 87.6 83.3 82.0 74.6 84.2 85.0 74.4 81.9 78.1 86.6 73.0 74.4 75.7 78.0 86.5 High School Completion (%) F 32 78.2 76.0",
    "textAfterTable": "No Policy Same Mail-In Application Meets Policy Same Asset Test for Parents Meets Policy Same Access to Health Insurance & Services Indicator Strength of Policy Change from 2007 Public Insurance for Childless Adults No Policy N/A Regulation of Insurance for Individual Coverage Weak Policy Same Linguistic Access Limited Policy N/A Access to Specific Services Gender Rating Indicator Strength of Policy Change from 2007",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}