{
    "relation": [
        [
            "Semester",
            "Spring 2014",
            "Summer Term 3, 2015"
        ],
        [
            "Instructor",
            "R. Hardwig",
            "K. Shortridge"
        ],
        [
            "Time",
            "",
            ""
        ]
    ],
    "pageTitle": "Roanoke College | Campus Directory",
    "title": "",
    "url": "https://directory.roanoke.edu/course/art/all",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00143-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897368063,
    "recordOffset": 897353065,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9180=Studio experience in areas not normally offered, with the focus to be determine d by the art faculty. May be repeated fo r credit. Lecture/Studio: Hours vary. 1 Unit, 25594=Advanced level work for students who have completed the two printmaking classes Art-241 and Art-341 and either Art-111 or Art-151. It is expected that a student will incorporate the issues introduced in the previous courses. Focus will be on the creation of a self-directed body of work, visual research, advanced development of concepts using disciplinary media and techniques, and will result in a public display or presentation of work. May be repeated for credit. 1/2 Unit, 26880=Advanced level work for students who have completed the ceramics sequence through the 300 level. It is expected that a student will incorporate the issues introduced in the previous courses. Focus will be on the creation of a self-directed body of work, visual research, advanced development of concepts using disciplinary media and techniques and will result in a public display or presentation of work. May be repeated for credit. 1/2 Unit, 28234=Advanced level work for students who have completed the sculpture sequence through the 300 level. It is expected that a student will incorporate the issues introduced in the previous courses. Focus will be on the creation of a self-directed body of work, visual research, advanced development of concepts using disciplinary media and techniques, and will result in a public display or presentation of work. May be repeated for credit. 1/2 Unit}",
    "textBeforeTable": "Offerings Lecture and group discussion on arts and crafts as a form of communication. Emphasis on teaching arts and crafts in schools. Includes work in fibers, clay, paper, and other areas. (Does not apply to major or minor programs in art.) Lecture/Studio: 3 hrs/wk. 1/2 Unit ART 101 Arts and Crafts in the Schools } margin-top:0px !important; p{ } color: #1894e5 !important; margin-top: 20px !important; padding-bottom: 0px !important; margin-bottom: 0px !important; h4{ } color: #1894e5 !important; margin-top: 20px !important; padding-bottom: 0px !important; margin-bottom: 0px !important; }h3{ color:#1894e5 !important; padding-bottom: 0px !important; margin-top:0px !important; margin-bottom: 2px !important; h2{",
    "textAfterTable": "Fall 2015 J. Fowler T/Th 4:30PM-6:00PM Spring 2015 J. Fowler T/Th 4:30PM-6:00PM Spring 2016 V. Staff T/Th 4:30PM-6:00PM ART 111 Drawing I This course is designed to develop a fu ndamental understanding of drawing throu gh various approaches, techniques, and m edia. Emphasis will be on building skill s and knowledge through the act of drawi ng, working primarily from life. Lecture /Studio: 4 hrs/wk. 1 Unit Offerings Semester Instructor Time Fall 2014 K. Shortridge T/Th 1:10PM-3:10PM Spring 2014 K. Shortridge T/Th 1:10PM-3:10PM Fall 2015 K. Shortridge T/Th 1:10PM-3:10PM Spring 2015 K. Shortridge T/Th 1:10PM-3:10PM Spring 2016 K. Shortridge T/Th 1:10PM-3:10PM ART 121 Painting I Introduction to basic principles of pai nting: knowledge and use of media, under standing of color, composition, and form using the painting medium, and developm ent of different styles and techniques. Emphasis will be on building skills and knowledge through the act of painting, w orking primarily from life. Lecture/Stud io: 4 hrs/wk. 1 Unit Offerings Semester Instructor Time Fall 2014 K. Shortridge M/W 9:50AM-11:50AM Fall",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}