{
    "relation": [
        [
            "Bobby Deren ScarletNation.com",
            "It has been pretty much a tale of two seasons for the RU offense, which was in high gear until it met Louisville right around the halfway point of the season. From there, the offense couldn't seem to score more than two touchdowns a game up until the regular season finale against USF. The insertion of new starter Chas Dodd has given the offense more consistency at quarterback as head coach Kyle Flood seemed to wait much too long to pull the plug on former starter Gary Nova. Running back Paul James is back to health, which is a plus for the offense but there is a big minus in the absence of Leonte Carroo, the team's top wide receiver. Add all that up and factor in Notre Dame's array of weapons and the Irish have the more potent offense.",
            "Paul James. The sophomore running back is as healthy as he has been all season and prior to his injury in game no. 4 against Arkansas, he was on pace for a 1,500-plus yard season. A good day from James will take pressure off quarterback Chas Dodd, control the clock and keep RU's defense off the field. James could signle-handedly change the complexion of the entire game with a sound performance against a Notre Dame defensive front that is minus its top player.",
            "Notre Dame. While it may not be the same unit that led the Irish to a national championship game last year, Rutgers is hardly equipped with the same unit that led it to its best bowl in 2012. The Rutgers defense has been littered with youth and pretty much unable to stop any team that has spread the field this season. Only three FBS teams have surrendered more passing yards than Rutgers and the recent firing of former coordinator Dave Cohen was the first step towards rebuilding the defense. Interim coordinator Joe Rossi will get a crack at running the show as the defense needs improvement if Rutgers is to remain competitive against Notre Dame.",
            "Joe Rossi. The interim coordinator takes over a defense that has really struggled this season and drawing up some solid schemes will be key in Rutgers potentially pulling off an upset. How Rossi manages the chess game will also be a telling sign of how legitimate a candidate he is for the vacant DC position. Rutgers has a lot of young talent on defense, but it has not been a unit that has been able to play tough football, create turnovers or generate a consistent pass rush all season. It will be those same players playing on Saturday, but a new coordinator calling the plays.",
            "For all of Rutgers' struggles this season, special teams has been one area that has been pretty consistent. The Scarlet Knights continue to be very good at blocking kicks while Janarion Grant and Quron Pratt have fueled the return game with life. Punter Nick Marsh has been solid and kicker Kyle Federico finally looks like he has figured things out. The edge here goes to Rutgers.",
            "Notre Dame. Rutgers has proved to be just too inconsistent on both sides of the football this season. Notre Dame has veterans who have come through in these kind of situations against quality opponents. Quarterback Chas Dodd has been clutch at times in his career, but just doesn't have the resume to get the edge over Tommy Rees here.",
            "Rutgers limped into the bowl season and through the second half of the year, they were pretty much man-handled by any team with a pulse. There was improvement in the final game against a poor USF team, but not enough to be anything but significant underdogs against Notre Dame. The Scarlet Knights will play better than they have, but won't have enough to outlast the Irish. Notre Dame 31 Rutgers 17."
        ],
        [
            "",
            "Which team has the more potent offense?",
            "Who is the Offensive 'X Factor,' and why?",
            "Which team has the better defense?",
            "Who is the defensive 'X Factor,' and why?",
            "Who has the edge on special teams?",
            "If the game comes down to a final drive, which team drives the length of the field?",
            "Which team will win?"
        ],
        [
            "Pete Sampson IrishIllustrated.com",
            "It's Notre Dame but not by a wide margin. I like where Notre Dame is at the running back position right now. They have developed some quality depth at that spot throughout the year. Their receivers are a touch better than Rutgers, T.J. Jones is an NFL guy and Devaris Daniels will be an NFL guy. Even though Rutgers tight end Tyler Kroft had some All-American notice, I like Notre Dame's 1-2 punch there. For maybe all shortcomings of Tommy Rees' game, he has more experience than either of the two Rutgers quarterbacks. He has played well against teams that don't defend the pass well. And down to the offensive line, I think Notre Dame has a slightly more potent offense.",
            "Devaris Daniels. The junior receiver is more athletically gifted than T.J. Jones, who is Notre Dame's top guy at the position, but very inconsistent at understanding the terms of the offense. I think Daniels is one of those guys who could really be helped out by bowl prep, taking a step back and getting more time to understand checks and adjustments. That's where he struggled a little bit this year. I think Notre Dame is going to have an explosive offense on Saturday and Devaris Daniels has to be a part of that.",
            "Rutgers is so good against the run and so bad against the pass. Notre Dame is more balanced than that. They have played well against good offenses at times. I would give Notre Dame the edge here too even though they are down on defense. They are down a starting nosed guard and their middle linebacker was out in early October, but they still have some NFL talent there. They have a lot of experience, both inside linebackers are fifth-year seniors. Jalen Smith is a freshman All-American, a five-star guy. Against Stanford, Notre Dame's defense was overrun and their lack of depth really showed. But they have played better as a unit, and better than Rutgers' defense.",
            "It's definitely [defensive tackle] Jarron Jones. He is a New York kid, hasn't really played that much, redshirted last year. He was a deep reserve until the last few weeks when Louis Nix got hurt. Jones played a great game against BYU, and was then okay against Stanford. The lights are really starting to come on for him. If he plays a good game and holds the point of attack at the nose guard position, then I think Rutgers will have a difficult time moving the ball on the Notre Dame defense.",
            "Rutgers. Notre Dame kicker Kyle Brindza is quite good. He is 10-of-11 for his career in clutch situations, which is fourth quarter or tie or overtime situations. But their kickoff coverage has been really bad this season. They are rated one of the worst teams in the country in that category and have been burnt on it multiple times. Overall, Rutgers has a more sound special teams unit in the return game and the cover units.",
            "If they need a field goal, I like Notre Dame because they have a kicker who has been clutch in those situations. I also think Tommy Rees has been in that situation so many times and been in fourth-quarterback comeback situations and come through. I like his experience there.",
            "Rutgers has not put up a whole lot of points against good defenses. I think Notre Dame's defense will be one of the better ones they will play this year. I don't think Rutgers will be able to get into the high teens and I don't think Notre Dame's offense is multi-dynamic but I do think they will be able to score four touchdowns. Notre Dame 28, Rutgers 13"
        ]
    ],
    "pageTitle": "ScarletNation.com - Rutgers vs. Notre Dame: Who has the edge?",
    "title": "",
    "url": "https://rutgers.rivals.com/content.asp?CID=1591319&PT=4&PR=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00089-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892645999,
    "recordOffset": 892629132,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1946=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 ScarletNation.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{41654=December 27, 2013}",
    "textBeforeTable": "Kickoff is now less than a day away and it's time to turn to our resident experts to find out who has the edge as Rutgers prepares to take on Notre Dame in the 2013 New Era Pinstripe Bowl. December 27, 2013 Rutgers vs. Notre Dame: Who has the edge? Bobby Deren and Pete Sampson Scarlet Knight Shop Freelance Opportunities Rutgers on Ebay For Recruits About",
    "textAfterTable": "Talk about it in The Round Table FEATURED PRODUCT Nike Rutgers Scarlet Knights Scarlet Fly 3.0 Shorts Rutgers NEWS [More] Latest Headlines:",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}