{
    "relation": [
        [
            "Level",
            "Ammunition",
            "Rough Qty"
        ],
        [
            "1",
            "10mm",
            "40+"
        ],
        [
            "4",
            ".32",
            "20+"
        ],
        [
            "8",
            "5.56",
            "70+"
        ],
        [
            "12",
            "Various",
            "Varies"
        ],
        [
            "16",
            "5mm",
            "320+"
        ]
    ],
    "pageTitle": "Wasteland Survival Guide (quest) - The Fallout wiki - Fallout: New Vegas and more",
    "title": "Ammunition vs Level",
    "url": "http://fallout.wikia.com/wiki/The_Wasteland_Survival_Guide_(quest)",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00188-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 91922031,
    "recordOffset": 91868055,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sun, 26 Jul 2015 22:49:35 GMT",
    "textBeforeTable": "If the player character already visited the Super-Duper Mart, and picked up food and medicine there prior to initiating the Wasteland Survival Guide quest with Moira, when they speak to her, they will instead recount their experiences, which effectively completes this portion of Chapter 1 without having to do it again. Moira will reward the Lone Wanderer with iguana bits if they only complete the required objective or successfully lie to her, and a food sanitizer in addition to the iguana bits if the player character completes the optional objective. All the raiders come in from the doors leading to the restrooms. Inside, at the front of the mart, opening the refrigerator will fulfill the first part of the quest. After this, the player can venture further inside to finish the optional objective. There is a First Aid Box labeled \"Pharmacy Supplies\" in the back room (next to the mini nuke and protectron), in the left-hand corner of the store. Looting it will fulfill the optional objective, but will also summon several more raiders. The intercom will transmit their voices as a warning. Moira wants the Lone Wanderer to look for food and possibly medicine at the nearby Super Duper Mart. Moira will mark it on the player character's map. The mart is filled with raiders. For more information, see the Super-Duper Mart page.",
    "textAfterTable": "Possible replies type answer require bonus smart \"I encountered some raiders, but they were easily outsmarted.\" Int 7 no tough \"I got the food and dealt with those pansy raiders. They couldn't stop me.\" Str 7 no snide \"That place was a death trap. It was crawling with raiders.\" nothing no standard \"It's got a lot more food than most places, but I wasn't the only one there.\" nothing no sly \"Those big, shadowy stores can be great for hiding out.\" Agi 7 no smart \"The raiders were using the pharmacy as a place to store their best gear.\" Int 7 yes snide \"I had a fun party with some raiders. Then a guard robot jumped out of a cake.\" nothing yes standard \"I found raiders and a robot. It was hardly a safe place to scavenge.\" nothing yes tough",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}