{
    "relation": [
        [
            "Date",
            "2009-11-02 17:00:00",
            "2009-11-02 17:00:00",
            "2009-10-28 17:00:00"
        ],
        [
            "Roundtable Name",
            "2009 WS Game Five",
            "2009 WS Game Five",
            "2009 WS Game One"
        ],
        [
            "Comment",
            "Can't let go of the Jeter AB. 2-0, no out, first and third, tying run. Great work by Madson--that's what he does. I really, as a baseball fan, wanted it to come down to Rodriguez. Phil Coke isn't going to sleep well. (Joe Sheehan)",
            "The Phillies haven't lost yet, Joe. By the way, doesn't \"Phil Coke\" sound like the nickname of a low-level Mafia drug runner? (Dan Malkiel)",
            "Phil Coke was quite HR-prone during the regular season. Just saying... (Steven Goldman)"
        ]
    ],
    "pageTitle": "Phil Coke | Baseball Prospectus",
    "title": "",
    "url": "https://baseballprospectus.com/card/card.php?id=COKE19820719A",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 861910199,
    "recordOffset": 861880444,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{42979=Last Update: 12/31/2014 23:59 ET, 150899=Phil Coke has thrown 6,840 pitches that have been tracked by the PITCHf/x system between 2008 and 2015, including pitches thrown in the MLB Regular Season, the MLB Postseason and Spring Training. In 2015, he has relied primarily on his Fourseam Fastball (94mph), Sinker (94mph) and Cutter (91mph), also mixing in a Curve (81mph) and Change (86mph). He also rarely throws a Slider (86mph).}",
    "lastModified": "Sun, 02 Aug 2015 20:28:48 GMT",
    "textBeforeTable": "BP Roundtables Absolutely. He had no reason to take Madson out, and going to Lidge--whose \"comeback\" is fictional--actively damaged the Phillies' chances. It would have been comical to see Phil Coke and Chad Durbin pitching in a tied World Series game. (Joe Sheehan) Joe, do you think Manuel should have left Madson in for the ninth last night? Even if Lidge doesn't give up a run in the top of the ninth, the pitchers' spot is due up first in the bottom of the inning, so at most Lidge was going to pitch one inning. After that, the Phillies would had to have relied on Chad Durbin, Scott Eyre and company. (philsfan from NYC) 2009-11-02 15:00:00 (link to chat) A shrug of the shoulders. Girardi could tap Hinske for an inning and it wouldn't surprise me at this point. He's shock-proofed me. The Rivera decision was the end. (Joe Sheehan) Joe: Can you share for the world what your reaction would have been if Phil Coke had entered the game in the bottom of the 9th (as he would have if the Yanks hadn't scored)? (Fred from Pequannock, NJ)",
    "textAfterTable": "  PITCHf/x Pitcher Profile A Collaboration between BrooksBaseball.net and Baseball Prospectus - Pitch classifications provided by Pitch Info LLC Phil Coke has thrown 6,840 pitches that have been tracked by the PITCHf/x system between 2008 and 2015, including pitches thrown in the MLB Regular Season, the MLB Postseason and Spring Training. In 2015, he has relied primarily on his Fourseam Fastball (94mph), Sinker (94mph) and Cutter (91mph), also mixing in a Curve (81mph) and Change (86mph). He also rarely throws a Slider (86mph).   Baseball Prospectus Analysis Blog Radio Events Newsletter Search News Player Cards Player Search Team Audit Statistics Fantasy Player Forecast Manager Depth Charts Team Tracker Hacking Mass Team Health Reports BP.com Terms of Service Customer Service Privacy Policy Contact Us Glossary",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}