{
    "relation": [
        [
            "Timestamp",
            "2010-12-17",
            "2010-12-17",
            "2010-11-17",
            "2009-10-23",
            "2008-10-21",
            "2008-10-21",
            "2008-10-21",
            "2008-10-21",
            "2008-10-21"
        ],
        [
            "Action",
            "Deleted",
            "Added",
            "Added",
            "Updated",
            "Added",
            "Added",
            "Added",
            "Added",
            "Added"
        ],
        [
            "Category",
            "DEFINITION",
            "DEFINITION",
            "SYNONYM",
            "TERM",
            "RELATION",
            "RELATION",
            "SYNONYM",
            "DEFINITION",
            "TERM"
        ],
        [
            "Detail",
            "Any process by which the symbiont organism modulates the frequency, rate or extent of its G-protein coupled receptor protein-mediated signal transduction as a result of detecting molecules of its host organism. The host is defined as the larger of the organisms involved in a symbiotic interaction.",
            "Any process in which the symbiont organism modulates the frequency, rate or extent of its G-protein coupled receptor protein-mediated signal transduction as a result of detecting molecules of its host organism. The host is defined as the larger of the organisms involved in a symbiotic interaction.",
            "regulation of G-protein coupled receptor protein signalling pathway in response to host",
            "regulation of G-protein coupled receptor protein signaling pathway in response to host",
            "is a GO:0075153 (regulation of transmembrane receptor-mediated signal transduction in response to host)",
            "is a GO:0008277 (regulation of G-protein coupled receptor protein signaling pathway)",
            "regulation of symbiont G-protein coupled receptor protein-mediated signal transduction in response to host",
            "Any process by which the symbiont organism modulates the frequency, rate or extent of its G-protein coupled receptor protein-mediated signal transduction as a result of detecting molecules of its host organism. The host is defined as the larger of the organisms involved in a symbiotic interaction.",
            "regulation of G-protein coupled receptor protein-mediated signal transduction in response to host"
        ]
    ],
    "pageTitle": "GO:0075156 regulation of G-protein coupled receptor protein signaling pathway in response to host",
    "title": "",
    "url": "http://www.ebi.ac.uk/QuickGO/GTerm?id=GO:0075156",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 422361039,
    "recordOffset": 422339194,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{128013=EMBL-EBI, Wellcome Trust Genome Campus, Hinxton, Cambridgeshire, CB10 1SD, UK +44 (0)1223 49 44 44, 128146=Copyright (c) EMBL-EBI 2013 | EBI is an Outstation of the European Molecular Biology Laboratory | Privacy | Cookies | Terms of use}",
    "textBeforeTable": "icon for more details. Synonyms are alternative words or phrases closely related in meaning to the term name, with indication of the relationship between the name and synonym given by the synonym scope. Click on the Synonyms GO:0075156 Wiki Page GONUTS Note that this term is used to annotate gene products of the symbiont. Comment Any process in which the symbiont organism modulates the frequency, rate or extent of its G-protein coupled receptor protein-mediated signal transduction as a result of detecting molecules of its host organism. The host is defined as the larger of the organisms involved in a symbiotic interaction. Definition Biological Process Ontology regulation of G-protein coupled receptor protein signaling pathway in response to host Name GO:0075156 ID Term Information Term Basket",
    "textAfterTable": "Display Key ShowHide GO IDs ShowHide Term box width Term box height Slim colours ShowHide Show children ShowHide Image size limit (in megapixels) Note that setting the limit too high may result in images being generated slowly; it may even cause the browser to crash. The maximum limit is 20 megapixels. Child Terms This table lists all terms that are direct descendants (child terms) of GO:0075156: Relationship To GO:0075156 Child Term Child Term Name Is a GO:0075157 positive regulation of G-protein coupled receptor protein signaling pathway in response to host Is a GO:0075158 negative regulation of G-protein coupled receptor protein signaling pathway in response to host Is a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}