{
    "relation": [
        [
            "S7",
            "First",
            "Business",
            "Economy",
            "Economy",
            "Economy"
        ],
        [
            "Booking Classes",
            "-",
            "C D J",
            "Y B H K",
            "-",
            "S R T V L M N Q O"
        ],
        [
            "Booking Class Percentage",
            "-",
            "125%",
            "100%",
            "50%",
            "25%"
        ]
    ],
    "pageTitle": "Earn Finnair Plus points from flights | Earn Finnair Plus points | Finnair - USA",
    "title": "",
    "url": "https://www.finnair.com/US/GB/finnair-plus/earn-points/flying",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00290-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 924104611,
    "recordOffset": 924064363,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{67959=As a Finnair Plus member, you can also earn points when flying on a Finnair leisure flight (AY1000 series) according to a separate accrual table. The point amount granted is for both ways. Please remember to show your Finnair Plus card at check-in in Finland. Other leisure flights (for example AY7000 series special order flights) are not eligible for point accrual., 31010=Valid from 4 June onwards, 33140=Valid until 3 June 2015., 62405=If you would like to collect missing points for scheduled flights you have taken with Flybe Nordic (flight numbers BE5500–5670) before 30 April 2015, please check the eligible booking classes below and claim your points through our website., 30593=Established in 1951, Japan Airlines is one of the world’s premier carriers. It joined the oneworld alliance in 2007. The airline has major hubs at Tokyo, Osaka, Nagoya and Okinawa, and operates almost 900 daily flights to more than 70 destinations across 20 countries. JAL started to operate a daily flight between Helsinki and Tokyo in summer 2013., 1627=Founded on 1 November 1923, Finnair is one of the world's oldest airlines still in operation. Finnair is known for its comfortable connection between Europe and Asia – via Helsinki., 19652=airberlin (AB) is Germany’s second largest airline with its affiliate airline NIKI (HG) and they joined the oneworld alliance in early 2012. airberlin and NIKI are currently serving over 160 destinations in 40 countries from their several European hubs., 36521=LAN Airlines is one of the largest and most awarded carriers in Latin America. It joined the oneworld alliance in 2000. The airline serves more than 70 destinations in 20 countries throughout South America, North America, Europe and the Pacific., 45104=Qatar Airways is one of the world’s fastest growing and highest rated airlines. It is joining oneworld alliance on 30th October 2013. Qatar’s network covers some 130 destination in 70 countries in the Middle East, Europe, Africa, North and South America, Asia and Australasia., 10124=You can earn points on your package holiday if the flights are operated by Finnair and the flight number is AY1000–1999. Your holiday may be organised by a third party, such as Suntours, with a leisure flight from Finnair., 62276=Point accrual for flights marketed by Flybe Nordic (flight number starting with “BE”) has ended 30 April 2015., 29093=Iberia (IB) is the national airline of Spain and it forms the International Airlines Group together with British Airways. Iberia joined oneworld in 1999 and offers now more than 120 destinations in 45 countries., 83901=As selected by our passengers The best airline in Northern Europe 2010, 2011, 2012, 2013, 2014, 2015, 48175=S7 Airlines is Russia’s largest domestic carrier. It joined the oneworld alliance in 2010. Based at Moscow Airport, the airline operates flights to more than 80 destinations in 20 countries throughout Europe, the Middle East and Asia (including 45 destinations in Russia).}",
    "textBeforeTable": "airberlin (AB) is Germany’s second largest airline with its affiliate airline NIKI (HG) and they joined the oneworld alliance in early 2012. airberlin and NIKI are currently serving over 160 destinations in 40 countries from their several European hubs. airberlin       As a Finnair Plus member, you’ll earn Finnair Plus award and tier points when you fly oneworld partner airlines. If you’re not yet a member, join now You’ll earn points for the flight depending on your booking class. Click the airline logos to see the point accrual for different booking classes. oneworld airlines",
    "textAfterTable": "How to use award points American Airlines American Airlines (AA) is one of the biggest airlines in the world and a founding member of the oneworld alliance. American Airlines provides flights to more than 250 destinations in 50 countries. American Airlines (AA) Booking classes Booking class percentage First A F P 150% Business D I J R 125% Economy Y B C H K M L V W G N Q S O 100% How to use award points British Airways British Airways (BA) is one of the world's leading airlines, with a comprehensive network of connections to 220 destinations in nearly 90 countries. Together with Iberia, British Airways forms the International Airlines Group. British Airways (BA), All flights, (Valid from 4 June onwards.) Booking Classes Booking Class Percentage First A F 150% Business C D I J R 125% Premium Economy E T W 100% Economy B Y",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}