{
    "relation": [
        [
            "",
            "",
            "Item 1",
            "Item 1a",
            "Item 1b",
            "Item 2",
            "Item 3",
            "Item 4",
            "",
            "",
            "Item 5",
            "Item 6",
            "Item 7",
            "Item 7A",
            "Item 8",
            "Item 9",
            "Item 9A",
            "Item 9B",
            "",
            "",
            "Item 10",
            "Item 11",
            "Item 12",
            "Item 13",
            "Item 14",
            "",
            "",
            "Item 15",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Part I",
            "Business",
            "Risk Factors",
            "Unresolved Staff Comments",
            "Properties",
            "Legal Proceedings",
            "Submission of Matters to a Vote of Security Holders",
            "",
            "Part II",
            "Market for Registrant\u0092s Common Equity, Related Shareholder Matters and Issuer Purchases of Equity Securities",
            "Selected Financial Data",
            "Management\u0092s Discussion and Analysis of Financial Condition and Results of Operations",
            "Quantitative and Qualitative Disclosures about Market Risk",
            "Financial Statements and Supplementary Data",
            "Changes in and Disagreements with Accountants on Accounting and Financial Disclosure",
            "Controls and Procedures",
            "Other Information",
            "",
            "Part III",
            "Directors and Executive Officers of the Registrant",
            "Executive Compensation",
            "Security Ownership of Certain Beneficial Owners and Management and Related Shareholder Matters",
            "Certain Relationships and Related Transactions",
            "Principal Accountant Fees and Services",
            "",
            "Part IV",
            "Exhibits and Financial Statement Schedules",
            "",
            "Other",
            "Signatures",
            "Schedule II Valuation and Qualifying Accounts",
            "Subsidiaries of DPL Inc. and The Dayton Power and Light Company",
            "Consent of Independent Registered Public Accounting Firm"
        ],
        [
            "Page No.",
            "",
            "3",
            "16",
            "22",
            "22",
            "22",
            "23",
            "",
            "",
            "23",
            "26",
            "27",
            "51",
            "51",
            "109",
            "109",
            "109",
            "",
            "",
            "110",
            "110",
            "110",
            "110",
            "110",
            "",
            "",
            "111",
            "",
            "",
            "121",
            "123",
            "1",
            "1"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.wikinvest.com/stock/DPL_(DPL)/Filing/10-K/2008/F2394314",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00202-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 841906295,
    "recordOffset": 841809654,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{654771=On February 13, 2006, we received correspondence from the Ohio Department of Taxation (ODT) notifying us that ODT has completed their examination and review of our Ohio Corporation Franchise Tax Returns for tax years 2002 through 2004 and that the final proposed audit adjustments result in a balance due of $90.8 million before interest and penalties.  We have reviewed the proposed audit adjustments and are vigorously contesting the ODT findings and notice of assessment through all administrative and judicial means available. On March 29, 2006, we filed petitions for reassessment with the ODT to protest each assessment as well as request corrected assessments for each tax year.  On October 12, 2006, we signed a Memorandum of Understanding with the ODT that stated if the ODT\u0092s positions are ultimately sustained in judicial proceedings, the total additional tax liability that we would be subject to for tax years 2002 through 2004 would be no more than $50.7 million before interest as opposed to the $90.8 million stated in the ODT\u0092s correspondence of February 13, 2006.  We believe we have recorded adequate tax reserves related to the proposed adjustments; however, we cannot predict the outcome, which could be material to our results of operations and cash flows., 922611=(a)              In 2003, we recorded a cumulative effect of an accounting change related to the adoption of SFAS 143 \u0093Accounting for Asset Retirement Obligations\u0094. In 2005, we recorded an additional obligation in response to FASB Interpretation Number (FIN) 47, \u0093Accounting for Conditional Asset Retirement Obligations, an interpretation of FASB Statement No. 143.\u0094 See Item 7 - Management\u0092s Discussion and Analysis of Financial Condition and Results of Operations., 162416=1-2385, 649683=Substantially all property and plants of DP&L are subject to the lien of the mortgage securing DP&L\u0092s First and Refunding Mortgage, dated as of October 1, 1935 with the Bank of New York, as Trustee (Mortgage)., 942593=·                  DPL\u0092s revenues increased 9% over 2006 primarily due to increases in weather driven retail sales volume, increases in average retail and wholesale rates and the revenue realized from the PJM capacity auctions.  DPL\u0092s fuel costs decreased 6% from 2006, while purchased power costs and operation and maintenance expense increased over 2006., 615690=On October 1, 2004, in compliance with Ohio law, DP&L turned over control of its transmission functions and fully integrated into PJM.  The price at which DPL and DP&L can sell its generation capacity and energy is now more dependent upon the overall operation of the PJM market.  While DP&L can continue to make bi-lateral transactions to sell its generation through a willing-buyer and willing-seller relationship, any transactions that are not pre-arranged are subject to market conditions at PJM.  The rules governing the various regional power markets also change from time to time which could affect DP&L\u0092s costs and revenues.  DP&L incurs fees and costs to participate in the RTO.  We may be limited with respect to the price at which power may be sold from certain generating units and we may be required to expand our transmission system according to decisions made by the RTO rather than our internal planning process.  While RTO transmission rates were initially designed to be revenue neutral, various proposals and proceedings currently taking place at FERC may cause transmission rates to change from time to time.  In addition, developing rules associated with the allocation and methodology of assigning costs associated with improved transmission reliability, reduced transmission congestion and firm transmission rights may have a financial impact on DP&L.  Likewise, in December 2006, FERC approved PJM\u0092s RPM.  RPM became effective in 2007 and provides forward and locational pricing for generation capacity.  The financial impact of RPM on DP&L will depend on a variety of factors, including the market behavior of various participants.  The RPM auctions have been held for the 2007/2008 through 2010/2011 delivery years.  At this time, these auction results are expected to have no material financial impact to DPL.  Because the RTO market rules are continuing to evolve, we cannot fully assess the impact that these power markets or other ongoing RTO developments may have on DP&L., 547243=DP&L provides transmission and wholesale electric service to twelve municipal customers in its service territory, which in turn distribute electricity principally within their incorporated limits.  DP&L also maintains an interconnection agreement with one municipality that has the capability to generate a portion of its own energy requirements.   Approximately one percent of total electricity sales in 2007 represented sales to these municipalities., 242553=DPL is a regional energy company organized in 1985 under the laws of Ohio.  Our executive offices are located at 1065 Woodman Drive, Dayton, Ohio 45432 \u0096 telephone (937) 224-6000., 683455=As long as DP&L preferred stock is outstanding, DP&L\u0092s Amended Articles of Incorporation contain provisions restricting the payment of cash dividends on any of its common stock if, after giving effect to such dividend, the aggregate of all such dividends distributed subsequent to December 31, 1946 exceeds the net income of DP&L available for dividends on its Common Stock subsequent to December 31, 1946, plus $1.2 million. As of December 31, 2007, all earnings reinvested in the business of DP&L were available for DP&L common stock dividends. We expect all 2007 earnings reinvested in the business of DP&L to be available for DP&L common stock dividends, payable to DPL., 539485=As a member of PJM, DP&L is subject to charges and costs associated with PJM operations as approved by the FERC.  On April 19, 2007, the FERC issued an order that modified the traditional method of allocating costs associated with new high voltage planned transmission facilities.  FERC ordered that the cost of new, high-voltage facilities be socialized across the PJM region.  The costs of the new facilities at lower voltages will continue to be assigned to the load centers that benefit from the new facilities.  In a companion order also issued on April 19, 2007, FERC did not change the existing allocation of costs associated with existing transmission facilities, upholding the existing PJM rate design.  On February 1, 2008, FERC issued an order on rehearing that upheld its original decision.  The overall impact of FERC\u0092s orders cannot be definitively assessed at this time because not all new planned construction is likely to happen.  The additional costs allocated to the Company for new large transmission approved projects are expected to be immaterial in 2008 and 2009 but could rise to approximately $12 million or more annually by 2012.  As a result, on December 21, 2007, DP&L filed an application seeking PUCO authority to defer costs associated with these new high-voltage transmission projects for future recovery through retail rates., 548077=On September 28, 2007, the Internal Revenue Service (IRS) published proposed regulations which would change the treatment of transactions involving the provision of insurance between members of a consolidated tax group.  If adopted, these regulations would affect the tax position previously held by Miami Valley Insurance Company (MVIC), our captive insurance company that provides insurance to us and our subsidiaries.  The IRS requested comments by December 27, 2007.  MVIC filed comments as part of a coalition formed for this purpose which included captive insurance companies and parent companies, captive insurance industry associations and insurance departments of numerous states which have captive insurance regulations.  These entities all oppose the IRS\u0092 proposed regulations.  The IRS will review all comments received and may publish a final regulation in the same form, or may substantially change or abandon its proposed regulation.  Since we do not know what steps the IRS will take, we cannot predict the impact on DPL, DP&L or MVIC at this time., 635870=On November 14th, 2007 the OAQDA issued $90 million of collateralized, variable rate revenue bonds, 2007 Series A due November 1, 2040 (the Series A Revenue Bonds). In turn, DP&L borrowed these funds from the OAQDA. The Series A Revenue Bonds are auction rate bonds. Every 35 days, the bonds are offered for sale to the market. The auction process sets the interest rate for the upcoming holding period by selling the bonds to the purchasers who bid to purchase the bonds at the lowest interest rate.  A credit enhancement feature of the Series A Revenue Bonds is the insurance policy issued by Financial Guaranty Insurance Company (FGIC), which insures principal and interest payments on the Series A Revenue Bonds when such payments are due.  FGIC\u0092s credit rating was recently downgraded by Fitch Ratings and Standard & Poor\u0092s from AAA to AA, and by Moody\u0092s from Aaa to A3. The current credit crisis and economic conditions, along with FGIC\u0092s recent credit rating downgrades, has resulted in fewer investors participating in the auction process for the Series A Revenue Bonds, which has resulted in increased interest rates on the Series A Revenue Bonds., 542334=In connection with DP&L and other utilities joining PJM, the FERC ordered utilities to eliminate certain charges to implement transitional payments, known as Seams Elimination Charge Adjustment (SECA), effective December 1, 2004 through March 31, 2006, subject to refund. Through this proceeding, DP&L was obligated to pay SECA charges to other utilities, but received a net benefit from these transitional payments.  The hearing was held in May 2006 and an initial decision was issued on August 10, 2006 that, if upheld by the FERC, would reduce the amount of SECA charges DP&L and other parties are permitted to recover.  DP&L, among others, has taken exception to the initial decision.  A final FERC order on this issue is still pending.  We have entered into a significant number of bi-lateral settlement agreements with certain parties to resolve the matter, which by design will be unaffected by the FERC\u0092s decision to affirm, modify or reject the initial decision.  DP&L management believes that appropriate reserves have been established in the event that SECA collections not resolved by settlement are required to be refunded.  The ultimate outcome of the proceeding establishing SECA rates is uncertain at this time. However, based on the amount of reserves established for this item, the results of this proceeding are not expected to have a material adverse effect on DP&L\u0092s results of operations., 423132=Combustion turbine output is dependent on ambient conditions and is higher in the winter than in the summer.  Our all-time net peak load was 3,300 MW, occurring August 8, 2007., 1057794=For the year ended December 31, 2007, revenues increased $122.2 million, or 9%, to $1,515.7 from $1,393.5 for the same period in the prior year. This increase was primarily the result of higher average rates for retail and wholesale sales, higher retail sales volume and an increase in RTOs ancillary revenue. Retail revenues increased $74.8 million, resulting from a 3% increase in weather driven sales volume as total degree days increased 9%, and a 3% increase in average retail rates primarily relating to the environmental investment and storm recovery riders. These increases resulted in a $38.4 million rate variance and a $34.1 million sales volume variance.  Wholesale revenue increased $6.2 million primarily resulting from a 12% increase in wholesale average rates, partially offset by an 8% decrease in sales volume. This resulted in a favorable $19.8 million wholesale price variance and an unfavorable $13.6 million volume variance. RTO ancillary and other revenues, consisting primarily of compensation for use of DP&L\u0092s transmission assets, regulation services, reactive supply and operating reserves and capacity payments under the RPM construct, increased $41.2 million over the same period in 2006. This increase primarily resulted from $30.9 million realized from the PJM capacity auction, $8.7 million of PJM transmission losses and congestion credits and $2.3 million from the sale of financial transmission rights (FTRs). RTO ancillary revenues from the PJM capacity auction are substantially offset by RTO ancillary charges for PJM capacity charges included in purchased power. Other RTO ancillary revenues are partially offset by other RTO ancillary charges in purchased power., 578917=In November 2004, the State of New York and seven other states filed suit against AEP and various subsidiaries, alleging various CAA violations at a number of AEP electric generating facilities, including Conesville Unit 4 co-owned by CG&E, DP&L and CSP.  AEP settled this case on October 9, 2007 and DP&L will be required to pay approximately $0.5 million for its partial ownership of Conesville Unit 4., 177963=Indicate by check mark whether each registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days., 266855=Installation of flue gas desulfurization (FGD) equipment at the Killen Station was successfully completed in June 2007.  DP&L is in the process of installing the same FGD technology on the four units at Stuart Station.  The first Stuart Station unit was placed into service in early February 2008 with the remaining units to be commissioned prior to June 2008., 263689=On April 25, 2007, DPLE completed the sale of its Darby and Greenville electric peaking generation facilities, providing DPL with approximately $151 million in cash.  Darby Station was sold to Columbus Southern Power (CSP), a utility subsidiary of American Electric Power (AEP), for approximately $102 million in cash. Greenville Station was sold to Buckeye Power, Inc. for approximately $49 million in cash., 590723=In September 2002, DP&L and other parties received a special notice that the USEPA considers us to be PRPs for the clean-up of hazardous substances at the South Dayton Dump landfill site.  In August 2005, DP&L and other parties received a general notice regarding the performance of a Remedial Investigation and Feasibility Study (RI/FS) under a Superfund Alternative Approach.  In October 2005, DP&L received a special notice letter inviting it to enter into negotiations with USEPA to conduct the RI/FS. Information available to DP&L does not demonstrate that it contributed hazardous substances to the site.  Should USEPA pursue a civil action, DP&L will vigorously challenge it., 538282=As part of Ohio\u0092s electric deregulation law, all of the state\u0092s investor-owned utilities are required to join an RTO.  In October 2004, DP&L successfully integrated its 1,000 miles of high-voltage transmission into the PJM Interconnection, L.L.C. (PJM) RTO.  The role of the RTO is to administer an electric marketplace and ensure reliability of the transmission grid.  PJM ensures the reliability of the high-voltage electric power system serving 51 million people in all or parts of Delaware, Illinois, Indiana, Kentucky, Maryland, Michigan, New Jersey, North Carolina, Ohio, Pennsylvania, Tennessee, Virginia, West Virginia and the District of Columbia.  PJM coordinates and directs the operation of the region\u0092s transmission grid, administers the world\u0092s largest competitive wholesale electricity market and plans regional transmission expansion improvements to maintain grid reliability and relieve congestion., 602332=On September 25, 2007, Senate Bill 221 was introduced in the Ohio Legislature.  The bill codifies, in draft form, the governor\u0092s proposed energy policy.  The bill was passed by the Senate on October 31, 2007.  The Ohio House of Representatives has assigned the bill to committee and is taking testimony from interested parties.  As the bill is not yet in final form, the outcome of this proceeding and its financial impact on the Company cannot be determined at this time., 262525=On April 18, 2007, DPL and Associated Electric & Gas Insurance Services (AEGIS) mediated and reached a settlement regarding an insurance claim filed with AEGIS on January 13, 2006 to recoup legal fees associated with the three former executives in which AEGIS agreed to pay DPL $14.5 million for legal fees incurred by DPL and associated with this litigation. The settlement agreement was signed and executed on April 30, 2007 and the recovery was recorded by DPL as a reduction to operation and maintenance expense., 689353=Copyright c 2008, Standard & Poor\u0092s a division of The McGraw-Hill Companies, Inc. All rights reserved., 591832=In December 2003, DP&L and other parties received a special notice that the USEPA considers us to be PRPs for the clean-up of hazardous substances at the Tremont City landfill site.  Information available to DP&L does not demonstrate that it contributed hazardous substances to the site., 687058=The graph below compares the cumulative 5-year total return of holders of DPL Inc.\u0092s common stock with the cumulative total returns of the Dow Jones US Industrial Average index, the S&P Utilities index and the S&P Electric Utilities index. The graph tracks the performance of a $1,000 investment in our common stock and in each index (with the reinvestment of all dividends) from 12/31/2002 to 12/31/2007., 532963=DP&L agreed to implement a Voluntary Enrollment Program (VEP) that would provide customers with an option to choose a competitive supplier to provide their retail generation service should switching not reach 20% in each customer class.  The 20% threshold has never been reached.   Customers who elected to participate in the program were grouped together and collectively bid out to CRES providers.  Four rounds of bidding were conducted for the 2007 program resulting in no bids being received.  DP&L has completed its obligations under this program., 528533=On April 4, 2005, DP&L filed a request with the PUCO to implement a rate stabilization surcharge (RSS), effective January 1, 2006, to recover cost increases associated with environmental capital, related operation and maintenance costs and fuel expenses.  Subsequently, DP&L entered into a settlement agreement that extended DP&L\u0092s rate stabilization period through December 31, 2010 and allowed for recovery of certain fuel and environmental investment costs through an environmental rider.  The PUCO adopted the settlement, but ruled that the environmental rider shall be by-passable by all customers who take service from alternate generation suppliers.  Consistent with the RSS Stipulation approved by the PUCO and prior orders, DP&L made a tariff filing that was approved by the PUCO in November 2006 to implement the environmental investment rider beginning January 1, 2007. The case was appealed to the Ohio Supreme Court by the OCC.  On September 5, 2007, the Ohio Supreme Court affirmed the PUCO\u0092s approval of the settlement agreement but remanded one aspect of the order, that the RSS tariff should be part of the Company\u0092s generation tariffs instead of distribution tariffs.  On December 6, 2007, DP&L filed to modify its tariffs accordingly and does not expect this change to impact future revenues., 685829=Information regarding our equity compensation plans as of December 31, 2007 is disclosed in Item 12 \u0096 Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters, which incorporates such information by reference to our proxy statement for the 2008 Annual Meeting of Shareholders., 569802=On July 15, 2003, the Ohio EPA submitted to the USEPA its recommendations for eight-hour ozone non-attainment boundaries for the metropolitan areas within Ohio.  On April 15, 2004, the USEPA issued its list of ozone non-attainment designations.  Since these initial designations, the Ohio EPA has recommended that nine areas designated non-attainment be designated as attainment.  Currently USEPA has redesignated eight of those areas as attainment for the eight-hour ozone national ambient air quality standards, including counties where DP&L owns and/or operates a number of facilities.  In redesignating these counties as attainment, the Ohio EPA submitted and USEPA approved amendments to the SIP that include maintenance plans for these areas.  In June 2007, the Ohio EPA submitted a plan to USEPA for attaining the eight-hour ozone standard for the Cincinnati-Hamilton area in which DP&L owns a number of facilities.  DP&L cannot determine the outcome of this redesignation effort at this time., 197972=The aggregate market value of DPL Inc.\u0092s common stock held by non-affiliates of DPL Inc. as of June 29, 2007 was approximately $3.2 billion based on a closing sale price of $28.34 on that date as reported on the New York Stock Exchange.  All of the common stock of The Dayton Power and Light Company is owned by DPL Inc.  As of February 20, 2008, each registrant had the following shares of common stock outstanding:, 1079228=For 2007, operation and maintenance expense increased $7.4 million, or 3%, compared to 2006. This variance was primarily the result of increased boiler maintenance costs of $17.7 million, a $9.4 million increase related to operating expenses for the generating facilities, a $3.5 million increase related to turbine maintenance costs, and a $3.0 million increase in overhead line and substation maintenance costs. These increases were partially offset by a $14.5 million insurance settlement reimbursing us for legal fees relating to the litigation with the three former executives, a gain on the sale of the corporate aircraft of $6.0 million, a $4.2 million decrease in legal costs primarily resulting from the settlement of the litigation with the former executives, and $0.4 million decrease in employee benefits costs resulting from a $5.2 million reduction in pension expense, partially offset by a $4.8 million increase in employee benefits., 1064093=For 2006, gross margin of $885.4 million increased $70.7 million, or 9%, from $814.7 million in 2005. As a percentage of total revenues, gross margin remained flat in 2006 at 63.5% compared to 63.4% in 2005. This result reflects the favorable impact of the rate stabilization plan on revenues offsetting the increasing fuel and purchase power costs. In prior years, rising fuel and purchase power costs had eroded gross margin. Fuel costs, which include coal, gas, oil and emission allowance costs, increased by $12.2 million, or 4%, in 2006 compared to the same period in 2005 primarily due to increased fuel prices. Purchased power increased $25.7 million, or 19%, in 2006 compared to the same period in 2005 primarily resulting from increased charges of $30.8 million relating to higher purchased power volume and an increase of $0.9 million in RTO ancillary costs. These increases were partially offset by lower average market rates reducing purchased power costs by $6.0 million. The increase in purchased power volume resulted from our decision to purchase power at lower average market rates instead of running our higher cost generating facilities. In addition, from time to time, we purchased power when our generating facilities were not available due to scheduled maintenance and forced outages., 564562=On December 17, 2003, the USEPA proposed the Interstate Air Quality Rule (IAQR) designed to reduce and permanently cap SO2 and NOX emissions from electric utilities.  The proposed IAQR focused on states, including Ohio, whose power plant emissions are believed to be significantly contributing to fine particle and ozone pollution in other downwind states in the eastern United States.  On June 10, 2004, the USEPA issued a supplemental proposal to the IAQR, now renamed the Clean Air Interstate Rule (CAIR).  The final rules were signed on March 10, 2005 and were published on May 12, 2005.  On August 24, 2005, the USEPA proposed additional revisions to the CAIR and initiated reconsideration on one issue.  Although we cannot predict the, 652152=On May 21, 2007, we settled the litigation with the three former executives in exchange for our payment of $25 million.  As part of this settlement, the three former executives relinquished and dismissed all their claims including those related to certain deferred compensation, restricted stock units (RSUs), MVE, Inc. (discontinued subsidiary of DPL) incentives, stock options, and legal fees. See Note 15 of Notes to Consolidated Financial Statements., 567672=On January 30, 2004, the USEPA published its proposal to restrict mercury and other air toxins from coal-fired and oil-fired utility plants.  The USEPA \u0093de-listed\u0094 mercury as a hazardous air pollutant from coal-fired and oil-fired utility plants and, instead, proposed a cap-and-trade approach to regulate the total amount of mercury emissions allowed from such sources.  The final Clean Air Mercury Rule (CAMR) was signed March 15, 2005 and was published on May 18, 2005.  On March 29, 2005, nine states sued USEPA, opposing the cap-and-trade regulatory approach taken by USEPA.  In 2007, the Ohio EPA adopted rules implementing the CAMR program.    On February 8, 2008, the Court of Appeals struck down the USEPA regulations, finding that the USEPA had not complied with statutory requirements applicable to \u0093de-listing\u0094 a hazardous air pollutant and that a cap-and-trade approach was not authorized by law for \u0093listed\u0094 hazardous air pollutants.  The order is subject to appeal to the U.S. Supreme Court which has a discretionary power to decide whether or not to hear an appeal., 946523=·                  On April 25, 2007, DPLE completed the sale of its Darby and Greenville electric peaking generation facilities, providing DPL with approximately $151 million in cash.  Darby Station was sold to Columbus Southern Power (CSP), a utility subsidiary of American Electric Power (AEP), for approximately $102 million in cash. Greenville Station was sold to Buckeye Power, Inc. for approximately $49 million in cash., 609688=DP&L has provided service at rates governed by the PUCO-approved transition, market development and rate stabilization plans.  Those rates have included a statutorily-required 5% rate reduction in the generation component of its residential rates, a further 2.5% reduction to the residential generation rate through 2008, fixed generation rates through December 31, 2010, and frozen distribution rates through December 31, 2008.  The protection afforded by retail fuel clause recovery mechanisms was eliminated effective January 1, 2001 by the implementation of customer choice in Ohio.  Likewise, through the RSS Stipulation, DP&L extended its commitment to maintain pre-determined rates for generation through December 31, 2010, and in exchange is permitted to charge two new rate riders to offset increases in fuel and environmental costs.  Beginning January 1, 2006, a RSS was implemented that recovered approximately $65 million additional revenue in 2006, net of customer discounts.  The EIR could result in approximately $35 million additional revenue each year, net of customer discounts and assuming insignificant levels of customer switching.  The PUCO ruled this rider will be bypassable by all customers who take service from alternative generation suppliers.  Accordingly, the rates DP&L is allowed to charge may or may not match its expenses at any given time.  Therefore, during this period (or possibly earlier by order of the PUCO), while DP&L will be subject to prevailing market prices for electricity, it would not necessarily be able to charge rates that produce timely or full recovery of its expenses.  DP&L has historically maintained its rates at consistent levels since 1994, when the final phase of DP&L\u0092s last traditional rate case was implemented.  However, as DP&L operates under its PUCO-approved RSS Stipulation, there can be no assurance that DP&L would be able to timely or fully recover unanticipated levels of expenses, including but not limited to those relating to fuel, coal and purchased power, compliance with environmental regulation, reliability initiatives and capital expenditures for the maintenance or repair of its plants or other properties., 534255=On August 28, 2006, the Staff of the PUCO issued a report relating to compliance with the Federal Energy Policy of 2005.  In that report the Staff makes recommendations to the Commission to implement new rules and procedures relating to net metering, customer generator interconnection, stand by power, time-of-use rates, and renewable energy portfolio standards.  DP&L, among others, filed comments and reply comments.  In 2007, the Commission held a series of technical conferences on automated meter infrastructure, interconnection, net metering, and standby power rates.  On December 21, 2007, DP&L filed a series of tariffs to comply with this rule making.  The potential cost associated with new regulations from these proceedings cannot be quantified at this time., 592493=In November 2007, a PRP group contacted DP&L seeking our financial participation in a settlement that the group had reached with the federal government with respect to the clean-up of an industrial site once owned by Carolina Transformer, Inc.  DP&L\u0092s business records clearly show we did not conduct business with Carolina Transformer that would require our participation in any clean-up of the site.  DP&L has declined to participate in the clean-up of this site., 150580=SECURITIES EXCHANGE ACT OF 1934, 657026=We are also under audit review by various state agencies for tax years 2002 through 2006.  We have also filed an appeal to the Ohio Board of Tax Appeals for tax years 1998 through 2001.  Depending upon the outcome of these audits and the appeal, we may be required to increase our tax provision if actual amounts ultimately determined exceed recorded reserves.  We believe we have adequate reserves in each tax jurisdiction but cannot predict the outcome of these audits., 261750=On March 1, 2007, pursuant to the Company\u0092s strategy of reducing its long-term debt, DPL redeemed the $225 million 8.25% Senior Notes when they became due., 274785=2005, 581526=In November 1999, the USEPA filed civil complaints and NOVs against operators and owners of certain generation facilities for alleged violations of the CAA.  Generation units operated by CG&E (Beckjord Unit 6) and CSP (Conesville Unit 4) and co-owned by DP&L were referenced in these actions.  Numerous northeast states have filed complaints or have indicated that they will be joining the USEPA\u0092s action against CG&E and CSP.  DP&L was not identified in the NOVs, civil complaints or state actions., 653982=On May 16, 2007, DPL filed a similar claim with Energy Insurance Mutual (EIM), to recoup additional legal expenses associated with our litigation against the former executives. That claim is pending., 258726=November 2007, 503441=We have substantially all of the total expected coal volume needed to meet our retail and firm wholesale sales requirements for 2008 under contract.  The majority of our contracted coal is purchased at fixed prices.  Some contracts provide for periodic adjustments and some are priced based on market indices.  Substantially all contracts have features that limit price escalations in any given year.   Our sulfur dioxide (SO2) allowance consumption was reduced in 2007 due to the installation of emission control equipment at a portion of our generation facilities.  As a result of this reduction, we will have emission allowance inventory in excess of our needs which we plan to sell during 2008 and in future years.  We did not purchase SO2 allowances or nitrogen oxide (NOX) allowances during 2007, nor do we plan to purchase any in 2008.  Fuel costs are impacted by changes in volume and price and are driven by a number of variables including weather, reliability of coal deliveries, scheduled outages and generation plant mix.  Based on higher volume and price, fuel costs are forecasted to be 15% to 25% higher in 2008 compared to 2007., 1059748=For the year ended December 31, 2006, revenues increased $108.6 million, or 8%, to $1,393.5 from $1,284.9 for the same period in the prior year. This increase was primarily the result of higher average retail rates and higher wholesale sales volume, partially offset by lower retail sales volume and lower average rates for wholesale revenues. Retail revenues increased $64.8 million primarily resulting from an increase in average rates related to the Rate Stabilization Plan surcharge and other regulated asset recovery riders resulting in a $93.0 million price variance, partially offset by lower retail sales volume resulting in a $29.4 million volume variance. Sales volume declined 3% in 2006 from 2005 due to milder weather which resulted in lower heating and cooling degree days. Heating degree days declined 11% and cooling degree days declined 20%. Wholesale revenue increased $40.8 million primarily related to a 34% increase in sales volume resulting in a $45.8 million volume variance, partially offset by a decrease in wholesale average rates resulting in a $5.0 million price variance. For 2006, the RTO ancillary revenues increased $2.8 million, or 4%, to $77.2 million from $74.4 million in 2005., 662536=As of December 31, 2007, there were 22,771 holders of record of DPL common equity, excluding individual participants in security position listings. The following table presents the high and low per share sales prices for DPL common stock as reported by the New York Stock Exchange for each quarter of 2007 and 2006:, 578142=In March 2000, as amended in June 2004, the United States Department of Justice filed a complaint in an Indiana federal court against Cinergy Corp. (now part of Duke Energy) and two Cinergy subsidiaries for alleged violations of the CAA at various generation units operated by PSI Energy, Inc. and CG&E, including generation units co-owned by DP&L (Beckjord Unit 6 and Miami Fort Unit 7).  The defense is being led by Duke Energy and a trial is currently scheduled to begin later in 2008., 689091=Fiscal year ending December 31., 939886=Recently, the coal market has experienced unprecedented price increases. To highlight the significance of this volatility, the coal settle price on the New York Mercantile Exchange (NYMEX) increased significantly during the first few weeks of 2008. We are now in a market for coal that clears on international, rather than solely domestic supply and consumption. Our domestic price is increasingly affected by international supply disruptions and demand balance. Exports from the U.S. have increased in recent years and most significantly during the last six months. In addition, domestic issues like government-imposed direct costs and permitting issues are affecting mining costs and supply availability. We have responded to increases in the price of coal by entering into contracts to hedge our exposure to fuel requirements and other energy-related commodities. We may not be able to hedge the entire exposure of our operations from commodity price volatility. To the extent we are not able to hedge against price volatility, our results of operations, financial position or cash flows could be materially affected., 604212=Changes in our customer base, including government aggregation, could lead to the entrance of competitors in our marketplace, affecting our results of operations, financial condition or cash flows.  Although retail generation service has been a competitive service since January 1, 2001, the competitive generation market has not developed in DP&L\u0092s service territory to any significant degree.  The following are factors that could result in increased switching by customers to CRES providers in the future:, 641238=DPL\u0092s warrant holders could exercise their warrants to purchase 31.6 million shares of common stock at their discretion until March 12, 2012. As a result, DPL could be required to issue up to 31.6 million common shares in exchange for the receipt of the exercise price of $21.00 per share or pursuant to a cashless exercise process. The exercise of all warrants would have a dilutive effect on us and would increase the number of common shares outstanding and increase our common share of dividend costs, thus affecting any existing guidance on EPS and our cash flows., 535345=On April 3, 2007, the PUCO issued proposed revisions to the Commission\u0092s minimum electric service and safety standards.  These rules govern a variety of utility operations such as maintenance programs, new construction, meter reading, and distribution circuit performance.  The proposed changes impact customer service requirements, reliability reporting and distribution inspection and maintenance programs, as well as increase the penalty the Commission may invoke if a utility is found to be in violation of these rules.  DP&L, among others, filed comments and reply comments.  DP&L may experience an increase in distribution operation and maintenance expense associated with the new rules.  We are unable to determine the potential financial impact of these changes at this time., 424769=In 2007, we generated 99% of our electric output from coal-fired units and 1% from oil and natural gas-fired units., 634446=The current global credit crisis may adversely affect our business and financial results. During 2007, higher interest rates, falling property prices and a significant increase in the number of sub-prime mortgages originated in 2005 and 2006 contributed to dramatic increases in mortgage delinquencies and defaults in 2007. The anticipated future delinquencies among high-risk, or sub-prime, borrowers in the United States is expected to continue in the foreseeable future. The widespread dispersion of credit risk related to mortgage delinquencies and defaults through the securitization of mortgage-backed securities, sales of collateralized debt obligations (CDOs) and the creation of structured investment vehicles (SIVs), as well as the unclear impact on large banks of mortgage-backed securities, CDOs and SIVs, caused banks to reduce their loans to each other or make them at higher interest rates. Similarly, the ability of corporations to obtain funds through the issuance of debt was negatively impacted. We issue debt to cover the costs of certain of our operations and expenditures and the inability to issue such debt on reasonable terms or at all could negatively affect our business., 949912=·                  On October 26, 2007, the Board of Directors approved a resolution permitting the transfer of 925,000 shares of DPL Inc. common stock from the DP&L Master Trust to The Dayton Power and Light Company Retirement Income Plan Trust (Pension). This transaction was completed on November 26, 2007, contributing shares of common stock with a fair value of $27.4 million to the Pension and resulting in fully funded status at December 31, 2007., 658046=On April 2, 2007, the U.S. Supreme Court unanimously overturned the rulings of two lower courts and concluded that the CAA\u0092s New Source Review (NSR) requirements are triggered when a major physical or operational change at a facility results in an increase in the facility\u0092s annual emissions (Environmental Defense et al. v. Duke Energy Corp. et al.). The outcome of this case is significant to DP&L because it eliminates one of DP&L\u0092s major arguments in the lawsuit filed against it by the Sierra Club. The Court decided that an annual rate of emissions could be used to determine if major modifications have been made to a plant as opposed to an hourly emission rate as Duke had argued. Using the annual rate makes it more likely that most plant modifications will be found to be \u0093major\u0094 modifications, thus requiring EPA permits. DP&L can still defend against the allegations of NSR violations if it can establish that the activities at issue did not cause total annual emissions to increase or that the projects that resulted in increased emissions were undertaken for routine maintenance, repair, and replacement activities., 601187=Many of the requirements of the Ohio deregulation law were premised on the assumption that the wholesale generation market and, in turn, the retail generation market, would fully develop by the end of 2005, and that the price for generation for even those customers who choose to continue to purchase the service from the regulated utility would be set purely by the market.  That did not occur.  As a result, the PUCO and the utilities, including DP&L, have worked out plans to provide market-based pricing for generation service, but also to stabilize those rates for several years.  What DP&L may propose and what the PUCO will approve in the future regarding pricing and cost recovery will depend on the degree to which the wholesale and retail electric generation markets have developed and the final outcome of the pending energy legislation in Ohio., 951496=·                  On February 1, 2007 and on December 13, 2007, our Board of Directors authorized dividend increases of approximately 4% and 6%, respectively, increasing our dividend per share from $1.00 per share to $1.10 per share.  The 4% increase to dividends, were paid in each quarter during 2007.  The 6% increase to dividends will be paid each quarter in 2008., 572739=On May 5, 2004, the USEPA issued its proposed regional haze rule, which addresses how states should determine the Best Available Retrofit Technology (BART) for sources covered under the regional haze rule.  Final rules were published July 6, 2005, providing states with several options for determining whether sources in the state should be subject to BART.  In the final rule, USEPA made the determination that CAIR achieves greater progress than BART and may be used by states as a BART substitute.  Numerous units owned and operated by us will be impacted by BART.  We cannot determine the extent of the impact until Ohio determines how BART will be implemented., 566517=outcome of the reconsideration proceedings, the petitions or the pending litigation, CAIR has had and will have a material effect on our operations.  Phase I CAIR requirements tend to promote decisions to install FGD equipment and continuous operation of the currently installed Selective Catalytic Reduction equipment.  In 2007, the Ohio EPA revised their State Implementation Plan (SIP) to incorporate a CAIR program consistent with the IAQR.  The Ohio EPA is awaiting approval from the USEPA.  Upon approval, the USEPA will distribute related CAIR NOX seasonal and annual emission allowances.  As a result, DP&L has installed FGD equipment at the Killen generating station and is proceeding with the installation of FGD equipment at the Stuart generating station., 268971=On November 15, 2007, the Ohio Air Quality Development Authority (OAQDA) issued $90 million of OAQDA Revenue Bonds 2007 Series A, due November 2040.  See Note 7 of Notes to Consolidated Financial Statements., 644381=Approximately 54% of our employees are under a collective bargaining agreement. During the third quarter of 2008, we will begin negotiation discussions with employees covered under our collective bargaining agreement which is set to expire in November 2008. If the collective bargaining agreement expires before a new agreement is reached, we would attempt to persuade our employees to continue working while negotiations continue. We believe that we maintain a satisfactory relationship with our employees, however, it is possible that the expiration of the collective bargaining agreement could result in labor disruptions affecting some or all of our operations. We recognize the impact that any resulting labor stoppages could have on our customers and have begun contingency planning if the collective bargaining agreement expires before a new one is reached. A lengthy strike by our employees would have an adverse effect on our operations and financial condition., 586840=On July 9, 2004, the USEPA issued final rules pursuant to the Clean Water Act governing existing facilities that have cooling water intake structures.  The rules require an assessment of impingement and/or entrainment of organisms as a result of cooling water withdrawal.  A number of parties appealed the rules to the Federal Court of Appeals for the Second Circuit in New York and the Court issued an opinion on January 25, 2007 remanding several aspects of the rule to USEPA for reconsideration.  We are undertaking studies at two facilities but cannot predict the impact such studies may have on future operations or the outcome of the remanded rulemaking., 524770=On October 31, 2007, the Ohio Senate passed Senate Bill 221.  The Ohio House of Representatives has assigned the bill to the committee and is taking testimony from interested parties.  In its current form, the bill states that the standard service offer in effect at the end of the utility\u0092s rate plan will remain in effect until the utility files either an electric security plan or a market rate option.  Under the market rate option, the retail generation price will be set by a periodic competitive bid process after the utility demonstrates that there is effective competition in its service territory and that it can meet other market criteria set out in the proposed bill.  Under the electric security plan option, the PUCO will establish rules for filing an electric security plan which may allow for adjustments to the standard offer for costs associated with environmental compliance; fuel and purchased power; construction of new or investment in specified generating facilities; the provision of standby and default service, operating, maintenance, or other costs including taxes.  Once an electric security plan is approved by the PUCO, the utility is required to file an infrastructure improvement plan that will specify the initiatives the utility will take to rebuild, upgrade or replace its electric distribution system.  The proposed bill establishes a goal that by 2025, twenty-five percent of the generation used to supply standard offer generation service in the state will come from advanced energy resources, which may include: sustainable resources, clean coal technology, advanced nuclear generation, fuel cells and co-generation of which half must be met through facilities located in Ohio.  Full compliance with the advanced energy standards may not be mandated if the price impact of compliance exceeds three percent.  The bill creates an advanced energy advisory committee and a federal energy advocate that will evaluate the costs and benefits associated with Regional Transmission Organizations (RTO) on behalf of the state.  It promotes construction of advanced energy projects by providing, 595356=DPL\u0092s construction additions were approximately $347 million, $352 million and $180 million in 2007, 2006 and 2005, respectively, and are expected to approximate $205 million for 2008.  DP&L\u0092s construction additions were approximately $344 million, $349 million and $178 million in 2007, 2006 and 2005, respectively.  Planned construction additions of DP&L for 2008 are expected to approximate $203 million and relate to DP&L\u0092s environmental compliance program, power plant equipment, and its transmission and distribution system.  All environmental additions made during the past three years pertain to DP&L and approximate $206 million, $246 million and $90 million in 2007, 2006 and 2005, respectively., 941290=2007 FINANCIAL OVERVIEW, 688881=*$1000 invested on 12/31/02 in stock or index-including reinvestment of dividends., 554623=The Federal Clean Water Act (FCWA), which prohibits the discharge of pollutants into waters of the United States except pursuant to appropriate permits. In July 2004, the USEPA adopted a new Clean Water Act rule to reduce the number of fish and other aquatic organisms killed by discharges from cooled power plants., 273583=2007, 152039=THE SECURITIES EXCHANGE ACT OF 1934, 267889=On October 26, 2007, the Board of Directors approved a resolution permitting the transfer of 925,000 shares of DPL Inc. common stock from the DP&L Master Trust to The Dayton Power and Light Company Retirement Income Plan Trust (Pension).  This transaction was completed on November 26, 2007, contributing shares of common stock with a fair value of $27.4 million to the Pension and resulting in a fully funded status at December 31, 2007., 653184=On April 18, 2007, DPL and Associated Electric & Gas Insurance Services (AEGIS) mediated and reached a settlement regarding an insurance claim filed with AEGIS on January 13, 2006 to recoup legal fees associated with the three former executives in which AEGIS agreed to pay DPL $14.5 million for legal fees incurred by DPL and associated with this litigation. The settlement agreement was signed and executed on April 30, 2007 and the recovery was recorded by DPL as a reduction to the operation and maintenance expense., 945511=·                  On April 18, 2007, DPL and Associated Electric & Gas Insurance Services (AEGIS) mediated and reached a settlement regarding an insurance claim filed with AEGIS, on January 13, 2006, to recoup legal fees associated with the three former executives in which AEGIS agreed to pay DPL $14.5 million for legal fees incurred by DPL and associated with this litigation. The settlement agreement was signed and executed on April 30, 2007 and the recovery was recorded by DPL as a reduction to operation and maintenance expense., 719897=2003, 241427=In addition, our public internet site includes other items related to corporate governance matters, including, among other things, our governance guidelines, charters of various committees of the Board of Directors and our code of business conduct and ethics applicable to all employees, officers and directors.  You may obtain copies of these documents, free of charge, by sending a request, in writing, to DPL Investor Relations, 1065 Woodman Drive, Dayton, Ohio 45432., 239720=DPL Inc. and DP&L file current, annual and quarterly reports, proxy statement and other information required by the Securities Exchange Act of 1934, as amended, with the Securities and Exchange Commission (SEC).  You may read and copy any document we file at the SEC\u0092s public reference room located at 100 F Street N.E., Washington, D.C. 20549, USA.  Please call the SEC at (800) SEC-0330 for further information on the public reference rooms.  Our SEC filings are also available to the public from the SEC\u0092s web site at http://www.sec.gov., 243084=DPL\u0092s principal subsidiary is DP&L.  DP&L is a public utility incorporated in 1911 under the laws of Ohio.  DP&L sells electricity to residential, commercial, industrial, and governmental customers in a 6,000 square mile area of West Central Ohio.  Electricity for DP&L\u0092s 24 county service area is primarily generated at eight coal-fired power plants and is distributed to more than 515,000 retail customers.  DP&L also purchases retail peak load requirements from DPL Energy, LLC (DPLE), one of DPL\u0092s wholly-owned subsidiaries.  Principal industries served include automotive, food processing, paper, plastic, manufacturing, and defense. DP&L\u0092s sales reflect the general economic conditions and seasonal weather patterns of the area.  DP&L sells any excess energy and capacity into the wholesale market., 927935=Certain statements contained in this discussion are \u0093forward-looking statements\u0094 within the meaning of the Private Securities Litigation Reform Act of 1995. Matters discussed in this report that relate to events or developments that are expected to occur in the future, including management\u0092s expectations, strategic objectives, business prospects, anticipated economic performance and financial condition and other similar matters constitute forward-looking statements. Forward-looking statements are based on management\u0092s beliefs, assumptions and expectations of future economic performance, taking into account the information currently available to management. These statements are not statements of historical fact and are typically identified by terms and phrases such as \u0093anticipate,\u0094 \u0093believe,\u0094 \u0093intend,\u0094 \u0093estimate,\u0094 \u0093expect,\u0094 \u0093continue,\u0094 \u0093should,\u0094 \u0093could,\u0094 \u0093may,\u0094 \u0093plan,\u0094 \u0093project,\u0094 \u0093predict,\u0094 \u0093will\u0094 and similar expressions. Such forward-looking statements are subject to risks and uncertainties, and investors are cautioned that outcomes and results may vary materially from those projected due to various factors beyond our control, including but not limited to: abnormal or severe weather and catastrophic weather-related damage; unusual maintenance or repair requirements; changes in fuel costs and purchased power, coal, environmental emissions, natural gas and other commodity prices; volatility and changes in markets for electricity and other energy-related commodities; performance of our suppliers; increased competition and deregulation in the electric utility industry; increased competition in the retail generation market; changes in interest rates; state, federal and foreign legislative and regulatory initiatives that affect cost and investment recovery, emission levels, rate structures or tax laws; changes in federal and/or state environmental laws and regulations to which DPL and its subsidiaries are subject; the development of Regional Transmission Organizations (RTOs), including PJM Interconnection, L.L.C. (PJM) to which DPL\u0092s operating subsidiary (DP&L) has given control of its transmission functions; changes in our purchasing processes, pricing, delays, contractor and supplier performance and availability; significant delays associated with large construction projects; growth in our service territory and changes in demand and demographic patterns; changes in accounting rules and the effect of accounting pronouncements issued periodically by accounting standard-setting bodies; financial market conditions; the outcomes of litigation and regulatory investigations, proceedings or inquiries; general economic conditions; and the risks and other factors discussed in DPL\u0092s and DP&L\u0092s filings with the Securities and Exchange Commission., 944902=·                  On March 1, 2007, pursuant to the Company\u0092s strategy of reducing its long-term debt, DPL redeemed the $225 million 8.25% Senior Notes when they became due., 650513=In the normal course of business, we are subject to various lawsuits, actions, proceedings, claims and other matters asserted under laws and regulations. We are also from time to time involved in other reviews, investigations and proceedings by governmental and regulatory agencies regarding our business, certain of which may result in adverse judgments, settlements, fines, penalties, injunctions or other relief. We believe the amounts provided in our consolidated financial statements, as prescribed by GAAP, for these matters are adequate in light of the probable and estimable contingencies. However, there can be no assurances that the actual amounts required to satisfy alleged liabilities from various legal proceedings, claims and other matters discussed below, and to comply with applicable laws and regulations will not exceed the amounts reflected in our consolidated financial statements. As such, costs, if any, that may be incurred in excess of those amounts provided as of December 31, 2007, cannot be reasonably determined., 947395=·                  On May 21, 2007, we settled the litigation with the three former executives in exchange for our payment of $25 million. The $25 million settlement was funded from the sale of financial assets held in DP&L\u0092s Master Trust for deferred compensation. As a result of this settlement, DPL realized a net pre-tax gain in continuing and discontinued operations of $31 million and $8.2 million, respectively.  As part of this settlement, the three former executives relinquished and dismissed all their claims including those related to certain deferred compensation, restricted stock units (RSUs), MVE (discontinued subsidiary of DPL) incentives, stock options and legal fees. See Note 15 of Notes to Consolidated Financial Statements., 1021732=2007 vs. 2006, 593353=In August 2006, Ohio EPA issued draft rules for interested party comment related to the disposal of industrial waste.  DP&L, through the Ohio Electric Utility Institute submitted comments on the draft rules.  DP&L cannot predict the impact of the draft rules on future operations., 923434=(b)              Excludes current maturities of long-term debt. Upon adoption of FASB Interpretation Number 46R \u0093Consolidation of Variable Interest Entities (Revised December 2003), an interpretation of ARB No. 51\u0094 at December 31, 2003, DPL deconsolidated the DPL Capital Trust II., 530251=Effective December 19, 2007, the PUCO issued a 90-day moratorium on the disconnection of electric and natural gas services to residential customers who meet low-income guidelines.  Under this regulation, DP&L, along with other Ohio electric and gas utilities, are prohibited from disconnecting residential customers for non-payment of utility bills for a 90-day period provided the customer agrees to enroll in the state\u0092s low-income program or enter into other available payment plans. DP&L believes that the moratorium will not have a material impact on its results of operation, financial position or its cash flows., 719193=2004, 600285=Before 2001, electric utilities provided electric generation, transmission and distribution services as a single product to retail customers at prices set by the PUCO.  In 1999, Ohio enacted legislation that partially deregulated utility service, effective January 1, 2001, making retail generation service a competitive service.  Customers may choose to take generation service from CRES providers that register with the PUCO but are otherwise unregulated.  In connection with this deregulation of the electric industry in Ohio, electric utilities have had to restructure their service and their rates to accommodate competition., 628916=We have constructed or are currently constructing flue gas desulfurization (FGD) facilities at four units located at our J. M. Stuart electric generating station. Construction of the FGD facilities at each unit was completed or is scheduled to be completed in 2008. We are also co-owners of electric generating stations operated by other investor-owned utilities, who are in various stages of constructing FGD facilities at these stations. Significant construction delays could adversely affect our ability to operate or may substantially increase our cost to operate these electric generating stations under federal environmental laws and regulations that become effective in 2010. For those electric generating stations where we are co-owners but do not operate, significant construction delays may substantially increase our pro rata share of the cost to operate those facilities beginning in 2010., 587887=On May 4, 2004, the Ohio EPA issued a final National Pollutant Discharge Elimination System permit (Permit) for J.M. Stuart Station that continued our authority to discharge water from the station into the Ohio River.  During the three-year term of the Permit, we conducted a thermal discharge study to evaluate the technical feasibility and economic reasonableness of water cooling methods other than cooling towers.  In December 2006, we submitted an application for the renewal of the Permit that was due to expire on June 30, 2007.  In July 2007 we received a draft permit proposing to continue our authority to discharge water from the station into the Ohio River.  On February 5, 2008 we received a letter from Ohio EPA indicating that they intend to impose a compliance schedule as part of the final Permit, that requires us to implement one of two diffuser options for the discharge of water from the station into the Ohio River as identified in the thermal discharge study.   The two diffuser options identified by Ohio EPA could cost approximately $33 million based on preliminary cost estimates, of which our pro-rata share would be approximately $11.5 million.  We have not seen the compliance schedule and cannot predict the final outcome of this issue on future operations., 664440=2006, 561426=In 1990, the federal government amended the CAA to further regulate air pollution.  Under the law, the USEPA sets limits on how much of a pollutant can be in the air anywhere in the United States.  The CAA allows individual states to have stronger pollution controls, but states are not allowed to have weaker pollution controls than those set for the whole country. The CAA has a material effect on our operations and such effects are detailed below with respect to certain programs under the CAA., 206518=Portions of DPL\u0092s definitive proxy statement for its 2008 Annual Meeting of Shareholders are incorporated by reference in Part III of this Form 10-K., 269887=On February 1, 2007 and on December 13, 2007, our Board of Directors authorized dividend increases of approximately 4% and 6%, respectively, increasing our dividend per share from $1.00 per share to $1.10 per share.  The 4% increase to dividends, was paid in each quarter during 2007.  The 6% increase to dividends will be paid each quarter in 2008., 240649=Our public internet site is http://www.dplinc.com.  We make available, free of charge, through our internet site, our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and Forms 3, 4 and 5 filed on behalf of our directors and executive officers and amendments to those reports filed or furnished pursuant to the Securities Exchange Act of 1934, as amended, as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC., 944115=·                  DP&L\u0092s revenues increased 9% over 2006 primarily due to increases in weather driven retail sales volume, increases in average retail rates and the revenue realized from the PJM capacity auctions. DP&L\u0092s fuel costs decreased 6% from 2006 while purchased power costs and operation and maintenance expense increased over 2006., 256748=March 2007, 579614=In November 2004, various residents of the Village of Moscow, Ohio sued CG&E, as the operator of Zimmer generating station (co-owned by CG&E, DP&L and CSP), for alleged violations of the CAA and air pollution nuisances.  CG&E, on behalf of all co-owners, is leading the defense of this matter., 544112=On August 8, 2005, the Energy Policy Act of 2005 (the 2005 Act) was enacted.  This new law encompasses several areas including, but not limited to:  electric reliability, repeal of the Public Utility Holding Company Act of 1935, promotion of energy infrastructure and preservation of a diverse fuel supply for electricity generation and energy efficiency.  In response to the 2005 Act, the FERC issued a Notice of Proposed Rulemaking to amend its regulations to incorporate the criteria which an entity must satisfy in order to qualify to be an Electric Reliability, 1062291=For 2007, gross margin of $900.3 million increased $14.9 million, or 2%, from $885.4 million in 2006. As a percentage of total revenues, gross margin decreased to 59.4% in 2007 compared to 63.5% in 2006. This result primarily reflects the favorable impact of both retail and wholesale revenues discussed above and lower fuel costs offset by increased purchased power costs. Fuel costs, which include coal, gas, oil and emission allowance costs, decreased by $20.9 million, or 6%, in 2007 compared to the same period in 2006 primarily due to lower generation output of 4% resulting from scheduled and unscheduled plant outages, as well as a 2% decrease in average fuel prices. Purchased power increased $128.2 million in 2007 compared to the same period in 2006 resulting from a $57.6 million increase in charges relating to higher purchased power volume and a $41.2 million increase due to higher average market rates. Also included in purchased power is a $28.4 million increase related largely to RTO ancillary charges for PJM capacity charges. The increase in purchased power volume was primarily the result of increased retail sales volume and partner operated generating facilities being less available compared to the prior year due to planned and unplanned outages.  In addition, we purchase power when market prices are below the marginal costs associated with our higher cost generating facilities. The RTO ancillary charges for PJM capacity charges are substantially offset by RTO ancillary revenues for PJM capacity resulting in minimal impact to gross margin., 546252=In October 2006, the FERC also approved new mandatory reliability standards which become effective in 2007, with requirements applying to certain assets and activities of DPL, DP&L and DPLE.  FERC subsequently has promulgated some revisions and additional reliability standards, including cyber-security standards.  The new regulations include potential penalties for failure to comply with these standards.  DPL, DP&L and DPLE are currently assessing and modifying compliance documents and procedures as needed.  We are working with consultants, other utilities and other organizations to comply with the new mandatory standards and their compliance documentation requirements., 659446=In September 2004, the Sierra Club filed a lawsuit against the Company and the other owners of the Stuart generating station in the United States District Court for the Southern District of Ohio for alleged violations of the CAA, including issues similar to those presented in the Duke Energy case and other issues relating to alleged violations of opacity limitations. DP&L, on behalf of all co-owners, is leading the defense of this matter. A sizable amount of discovery has taken place and expert reports were filed at various times from May through September, 2007. On February 14, 2008, upon the request of the Sierra Club, DP&L and the other owners of the Stuart generating station, the Court approved another sixty day stay of proceedings to permit the parties the opportunity to determine if a settlement of the case could be reached. Settlement negotiations are ongoing., 531881=As of December 31, 2007, four unaffiliated marketers were registered as Competitive Retail Electric Service (CRES) providers in DP&L\u0092s service territory.  While there has been some customer switching to date associated with unaffiliated marketers, it represented less than 0.15% of sales in 2007.  DPLER, an affiliated company, is also a registered CRES provider and accounted for 99.3% of the total kWh supplied by CRES providers within DP&L\u0092s service territory in 2007.  In addition, several communities in DP&L\u0092s service area have passed ordinances allowing the communities to become government aggregators for the purpose of offering alternative electric generation supplies to their citizens.  To date, none of these communities have aggregated their generation load., 585576=In 2007, the Ohio EPA and the USEPA issued NOVs to DP&L for alleged violations of the CAA at the O.H. Hutchings Station.  The NOVs alleged deficiencies relate to stack opacity and particulate emissions.  Discussions are under way with the USEPA and Ohio EPA and DP&L has provided data to those agencies regarding its maintenance expenses and operating results.  DP&L is unable to determine whether any additional actions will take place with respect to this matter., 261049=February 2007, 606664=Customers can elect to take generation service from a CRES provider offering services to customers in DP&L\u0092s service territory.  As of December 31, 2007, five CRES providers have been certified by the PUCO to provide generation service to DP&L customers.  One of those five, DPL Energy Resources, Inc. (DPLER), is a wholly-owned affiliate of DPL.  Although DPLER supplied 99.3% of the total kWh consumed by customers served by CRES providers in DP&L\u0092s service territory in 2007, at the end of 2007 there was a slight increase in the non-residential customers served by unaffiliated CRES providers.  There has been no residential customer switching to date.  Depending on the development of the wholesale market and the level of wholesale prices, CRES providers could become more active in DP&L\u0092s service territory and may begin to offer prices lower than DP&L\u0092s standard offer.  This could result in more switching by DP&L\u0092s customers and a further loss of revenues by DP&L., 1022353=2006 vs. 2005, 150953=For the fiscal year ended December 31, 2007, 571222=On January 5, 2005, the USEPA published its final non-attainment designations for the national ambient air quality standard for Fine Particulate Matter 2.5 (PM 2.5).  These designations included counties and partial counties in which DP&L operates and/or owns generating facilities.  On March 4, 2005, DP&L and other Ohio electric utilities and electric generators filed a petition for review in the D.C. Circuit Court of Appeals, challenging the final rule creating these designations.  On November 30, 2005, the court ordered USEPA to decide on all petitions for reconsideration by January 20, 2006.  On January 20, 2006, USEPA denied the petitions for reconsideration.  The court ordered a briefing schedule with final briefs due in July 2008 and oral arguments to be scheduled for fall 2008.  The Ohio EPA must submit regulations to attain and maintain compliance with the PM 2.5 national ambient air quality standard in April 2008.  DP&L cannot determine the outcome of the petition for review or the effect such Ohio EPA regulations will have on its operations., 936462=On September 25, 2007, Senate Bill 221 was introduced in the Ohio Legislature.  The bill codifies, in draft form, the governor\u0092s proposed energy policy.  The bill was passed by the Senate on October 31, 2007. The Ohio House of Representatives has assigned the bill to committee and is taking testimony from interested parties. As the bill is not yet in final form, the outcome of this proceeding and its financial impact on the Company cannot be determined at this time., 562234=On October 27, 2003, the USEPA published final rules regarding the equipment replacement provision (ERP) of the routine maintenance, repair and replacement (RMRR) exclusion of the CAA.  Subsequently, on December 24, 2003, the United States Court of Appeals for the D.C. Circuit stayed the effective date of the rule pending its decision on the merits of the lawsuits filed by numerous states and environmental organizations challenging the final rules.  As a result of the stay, the Ohio EPA delayed its previously announced intent to adopt the RMRR rule.  On October 20, 2005, USEPA proposed to revise the emissions test for existing electric generating units.  At this time, we are unable to determine the impact of the ERP appeal or the outcome of the proposed emissions test., 619143=Annually, PJM performs a review of the capital additions required to provide reliable electric transmission services throughout its territory.  PJM traditionally allocated the costs of constructing these facilities to those entities that benefited directly from the additions.  On April 19, 2007, the FERC issued an order that modified the traditional method of allocating costs associated with new high voltage planned transmission facilities.  FERC ordered that the cost of new high-voltage facilities be socialized across the PJM region.  The costs of the new facilities at lower voltages will continue to be assigned to the load centers that benefit from the new facilities.  In a companion order also issued on April 19, 2007, FERC did not change the existing allocation of costs associated with existing transmission facilities, upholding the existing PJM rate design.  The overall impact of FERC\u0092s orders cannot be definitively assessed at this time because not all new planned construction is likely to happen.  The additional costs allocated to the Company for new large transmission approved projects are expected to be immaterial in 2008 and 2009 but could rise to approximately $12 million or more annually by 2012.  As a result, DP&L filed an application seeking PUCO authority to defer costs associated with these new high-voltage transmission projects for future recovery through retail rates., 642621=Our internal controls, accounting policies and practices, and internal information systems are designed to enable us to capture and process transactions in a timely and accurate manner in compliance with generally accepted accounting principles (GAAP) in the United States of America, laws and regulations, taxation requirements and federal securities laws and regulations. We implemented corporate governance, internal control and accounting rules issued in connection with the Sarbanes-Oxley Act of 2002 (the \u0093Act\u0094). Our internal controls and policies have been and continue to be closely monitored by management and our Board of Directors to ensure continued compliance with Section 404 of the Act. While we believe these controls, policies, practices and systems are adequate to verify data integrity, unanticipated and unauthorized actions of employees, temporary lapses in internal controls due to shortfalls in oversight or resource constraints could lead to improprieties and undetected errors that could impact our results of operations, financial condition or cash flows., 264741=On May 21, 2007, we settled the litigation with the three former executives in exchange for our payment of $25 million. The $25 million settlement was funded from the sale of financial assets held in DP&L\u0092s Master Trust for deferred compensation. As a result of this settlement, DPL realized a net pre-tax gain in continuing and discontinued operations of $31 million and $8.2 million, respectively. As part of this settlement, the three former executives relinquished and dismissed all their claims including those related to certain deferred compensation, restricted stock units (RSUs), MVE, Inc.(discontinued subsidiary of DPL) incentives, stock options and legal fees. See Note 15 of Notes to Consolidated Financial Statements., 247576=DPL, DP&L, and its subsidiaries employed 1,562 persons as of January 31, 2008, of which 1,333 were full-time employees and 229 were part-time employees.  Approximately 54% of our employees are under a collective bargaining agreement.  During the third quarter of 2008, we will begin negotiation discussions with employees covered under our collective bargaining agreement which is set to expire in November 2008.  If the collective bargaining agreement expires before a new agreement is reached, we would attempt to persuade our employees to continue working while negotiations continue.  We believe that we maintain a satisfactory relationship with our employees; however, it is possible that the expiration of the collective bargaining agreement could result in labor disruptions affecting some or all of our operations., 523957=Since January 2001, DP&L\u0092s electric customers have been permitted to choose their retail electric generation supplier.  DP&L continues to have the exclusive right to provide delivery service in its state certified territory and the obligation to supply retail generation service to customers that do not choose an alternative supplier.  The PUCO maintains jurisdiction over DP&L\u0092s delivery of electricity, standard service offer, and other retail electric services., 582327=In December 2007, the Ohio EPA issued a NOV to DP&L-operated Killen generating station (co-owned by DP&L and CG&E) for alleged violations of the CAA.  The NOVs alleged deficiencies in the continuous monitoring of opacity.  A compliance plan has been submitted to the Ohio EPA.  To date, no further actions have been taken by the Ohio EPA., 274184=2006, 924544=(d)              In the fourth quarter of 2006, DPL entered into agreements to sell two of its peaking facilities resulting in a $44.2 million ($71 million pre-tax) impairment charge. The sale was finalized in April 2007. During 2006, DPL recorded a $37.3 million ($61.2 million pre-tax) charge for early redemption of debt. DP&L recorded a $2.5 million ($4.1 million pre-tax) charge for early redemption of debt. In May 2007, DPL settled the litigation with the former executives resulting in a $19.7 million ($31 million pre-tax) gain. In April 2007, DPL also recouped legal costs associated with the litigation with the former executives from one of its insurers resulting in a $9.2 million ($14.5 million pre-tax) gain., 574158=On April 2, 2007, the U.S. Supreme Court unanimously overturned the rulings of two lower courts and concluded that the CAA\u0092s NSR requirements are triggered when a major physical or operational change at a facility results in an increase in the facility\u0092s annual emissions (Environmental Defense et al. v. Duke Energy Corp. et al.).  The outcome of this case is significant to DP&L because it eliminates one of DP&L\u0092s major arguments in the lawsuit filed against it by the Sierra Club.  The Court decided that an annual rate of emissions could be used to determine if major modifications have been made to a plant as opposed to an hourly emission, 159174=1065 Woodman Drive Dayton, Ohio 45432, 950822=·                  On November 15, 2007, the Ohio Air Quality Development Authority (OAQDA) issued $90 million of OAQDA Revenue Bonds 2007 Series A, due November 2040.  See Note 7 of Notes to Consolidated Financial Statements., 541177=As a member of PJM, the value of DP&L\u0092s generation capacity is affected by changes in and the clearing results of the PJM capacity construct.  The construct utilizes a Reliability Pricing Model (RPM) that changes the way generation capacity is priced and planned for by PJM.  PJM held its first RPM auction during April 2007 for the 2007/2008 planning year and held subsequent auctions during July and October 2007 and January 2008.  The results of these auctions have not had a material impact on our results of operations, financial position or cash flows.  The FERC decisions establishing RPM have been appealed by various entities to the Federal appeals court.  RPM remains in effect pending the outcome of the appeal.  DP&L has intervened and supports the FERC decisions., 583372=In 2006, DP&L detected a malfunction with its emission monitoring system at DP&L-operated Killen generating station (co-owned by DP&L and CG&E) and ultimately determined its SO2 and NOx emissions data were under reported.  DP&L has petitioned the USEPA to accept an alternative methodology for calculating actual emissions for 2005 and the first quarter 2006.  DP&L has sufficient allowances in its general account to cover the understatement and is working with the USEPA to resolve the matter.  Management does not believe the ultimate resolution of this matter will have a material impact on results of operations, financial position or cash flows., 948604=·                  In July 2007, DPL completed a depreciation rate study for non-regulated generation property based on its property, plant and equipment balances as of December 31, 2005, with adjustments for subsequent scrubber additions. The results of the depreciation study concluded that DPL\u0092s depreciation rates should be reduced due to asset lives being extended beyond previously estimated lives. DPL adjusted the depreciation rates for its non-regulated generation property, effective August 1, 2007, reducing depreciation expense. For the year ended December 31, 2007, the reduction in depreciation expense increased income from continuing operations by $9.5 million, increased net income by approximately $6.0 million and increased basic EPS by approximately $0.06 per share. See Note 1 of Notes to Consolidated Financial Statements., 576555=In September 2004, the Sierra Club filed a lawsuit against us and the other owners of the Stuart generating station in the United States District Court for the Southern District of Ohio for alleged violations of the CAA, including issues similar to those presented in the Duke Energy case and other issues relating to alleged violations of opacity limitations.  DP&L, on behalf of all co-owners, is leading the defense of this matter.  A sizable amount of discovery has taken place and expert reports were filed at various times from May through September 2007.  On February 14, 2008, upon the request of the Sierra Club, DP&L and the other owners of the Stuart generating station, the Court approved another sixty day stay of proceedings to permit the parties the opportunity to determine if a settlement of the case could be reached.  Settlement negotiations are ongoing., 563400=In a regulation proceeding relating to the same issue decided by the U.S. Supreme Court in the Duke Energy case discussed below, the USEPA issued a proposed rule in October 2005 concerning the test for measuring whether modifications to electric generating units should trigger application of New Source Review (NSR) standards under the CAA.  The proposed rule seeks comments on two different hourly emissions test options as well as the USEPA\u0092s current method of measuring previous actual emission levels to projected actual emission levels after the modification.  A third option that tests emissions increase based upon emissions per unit of energy output is also available for comment.  We cannot predict the outcome of this rulemaking or its impact on current environmental litigation., 246784=Under the recently enacted Public Utility Holding Company Act of 2005, the Federal Energy Regulatory Commission (FERC) requires that utility holding companies comply with certain accounting, record retention and filing requirements.  DPL believes it is exempt from these requirements because DP&L\u0092s operations are confined to a single state.  On January 31, 2006, DPL filed a FERC 65B Waiver Notification, with the FERC, requesting that the FERC approve DPL\u0092s waiver and avoid FERC regulation., 684938=On December 13, 2007, our Board of Directors authorized a 6% dividend increase on DPL\u0092s common stock, raising the annual dividend on common shares from $1.04 per share to $1.10 per share. These dividends will be paid in each quarter during 2008., 580614=In June 2000, the USEPA issued a Notice of Violation (NOV) to DP&L-operated Stuart generating station (co-owned by DP&L, CG&E, and CSP) for alleged violations of the CAA.  The NOV contained allegations consistent with NOVs and complaints that the USEPA had recently brought against numerous other coal-fired utilities in the Midwest.  The NOV indicated the USEPA may (1) issue an order requiring compliance with the requirements of the Ohio SIP or (2) bring a civil action seeking injunctive relief and civil penalties of up to $27,500 per day for each violation.  To date, neither action has been taken., 941915=·                  For the year ended December 31, 2007, DPL\u0092s basic and diluted earnings per share (EPS) of $2.06 and $1.88, respectively, increased over the basic and dilutive EPS for the same period in 2006 by $0.82 and $0.73, respectively., 684459=On February 1, 2007, our Board of Directors authorized a 4% dividend increase on DPL\u0092s common stock, raising the annual dividend on common shares from $1.00 per share to $1.04 per share. These dividends were paid in each quarter during 2007., 924089=(c)               During 2007, our rating agencies upgraded our corporate credit and debt ratings.}",
    "textBeforeTable": "  For the transition period from                          to   THE SECURITIES EXCHANGE ACT OF 1934 o TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF   OR   For the fiscal year ended December 31, 2007   SECURITIES EXCHANGE ACT OF 1934 x ANNUAL REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE   FORM 10-K   WASHINGTON, D.C. 20549 UNITED STATES SECURITIES AND EXCHANGE COMMISSION   Complete submission text file Graphic Ex-32.D",
    "textAfterTable": "  DPL Inc. x The Dayton Power and Light Company x   Indicate by check mark whether the registrant is a large accelerated filer, an accelerated filer, or a non-accelerated filer.  See definition of \u0093accelerated filer and large accelerated filer\u0094 in Rule 12b-2 of the Exchange Act.       Large    ",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}