{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "We have public safety that will escort any student any where they need to on campus at night time if they do not want to walk alone. I encourage future students to walk with someone if its night or call public safety. It is their job to provide safety so do not feel you can't call them.",
            "I am not affiliated with any sororities but I've seen many of them here on campus.",
            "Clubs create networking, socializing and volunteering. It also looks great on a resume.",
            "If you're a person that enjoys being involved in organizations then you should join one or two, etc, of the many organizations offered here on campus. I am apart of a Women's Intramural Basketball team because I played basketball in high school and found a family of women that loved to play as much as I.",
            "It is not an unusual tradition to attend class everyday!",
            "On campus there is a bowling alley, theater, open mic, the recreational center so feel free to exercise and play basketball, rock climbing, organizations have events periodically, Carmike theaters, apple bees and many other activities. College is as fun as you make it so do not sit in your room all day complaining about how boring it is if you're not trying to get involved.",
            "I didn't like the dining to much because the food was repetitive and after my freshman year I decided to opt out of obtaining a meal plan.",
            "I absolutely love dorm life! I met many of my friends due to residing in the dorms. I encourage it and its so much fun!",
            "Its only hard if you make it hard. If tending to your studies as you're supposed to then school will not be to rigorous although I would recommend tutor sessions and asking your professor if you encounter any problems.",
            "A few tips for prospective students consist of: mentally prepare yourself for college, time is money; which means avoid failing classes because the consequences are the loss of money and not acquiring the credit to fulfill your degree. Make a long-term plan so you can have an idea of your expected graduation date and work towards that. In the end, remember to study and have fun because these next years of college will be the best of your life.",
            "The University of Central Missouri has a great Accountancy Department with genuine professors yearning to help students. It is a great environment for students to socialize and encounter new people from all over the world as well. Although the city of Warrensburg is small, there are plenty of activities to engage to avoid boredom."
        ]
    ],
    "pageTitle": "University of Central Missouri (UCM) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Central-Missouri/reviews?_escaped_fragment_=/show/69445",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00328-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 919469711,
    "recordOffset": 919401525,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{321215=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/15/2009 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 74 Jessica from MO Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Central Missouri Reviews University of Central Missouri › Missouri › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "the dorms here are fairly large and you get a bathroom in your room so you don't have to walk down the hall. Academic Rigor this is a challenging school but the teachers are here to make sure you get through it. Tips for prospective students always be on time for class and turn in assignments when they are due. also get involved in campus activities. In three sentences this is a great school to attend. there are small classroom sizes and teachers who really care. this is an awesome place to make friends for life. Login to rate or flag the reviews Jennifer from Warrensburg, MO 07/24/2012 Reviewer is A current student here. 6 out of 6 people found this review useful. 3 of 74 Categories Comments Campus Safety The campus is very safe. Campus Police are always available when you need them. There",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}