{
    "relation": [
        [
            "Patent application number",
            "20090268804",
            "20100134157"
        ],
        [
            "Description",
            "Delayed decision feedback sequence estimator - Disclosed is a delayed decision feedback sequence estimator comprising a delayed decision feedback sequence estimator main unit including DDFSE computing unit group including (L+M) DDFSE computing units, equal in number to a length of each of plurality of blocks into which a received data symbol sequence is divided; wherein (L+M) DDFSE computing units are connected in a pipeline configuration to execute delayed decision feedback sequence estimation of the blocks in parallel; and an edge effect detection and correction circuit that detects an edge effect due to processing the delayed decision feedback sequence estimation of the separated block and corrects a relevant bit error.",
            "PLL circuit and method of cotrolling the same - A PLL circuit according to an exemplary aspect of the present invention includes: a PFD that detects a phase difference between two clock signals; an LPF that outputs a voltage based on a detection result of the PFD; a VCO that controls a frequency of a VCO output clock output based on the voltage; a frequency divider that divides a frequency of the VCO output clock and outputs an output clock; and an automatic adjustment circuit that adjusts a frequency division ratio of the frequency divider based on the voltage. The automatic adjustment circuit includes a comparison circuit that outputs a control signal for controlling the frequency divider and a control signal for controlling the reference voltage. This circuit configuration makes it possible to control an oscillation frequency of a PLL circuit with accuracy and stability."
        ],
        [
            "Published",
            "10-29-2009",
            "06-03-2010"
        ]
    ],
    "pageTitle": "Kawashima, Kanagawa - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/kawashima-kanagawa-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00273-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 453521007,
    "recordOffset": 453492512,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Toshitsugu Kawashima, Kanagawa JP //]]> BarDraw('2931371',['Patent applications by Toshitaka Kawashima, Kanagawa JP'],[[2,2,1,4,3,4,1,1]],['2005','2006','2007','2008','2009','2010','2011','2012'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2931371\" align=\"center\"></div> </div> <canvas id=\"bg2931371\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Toshitaka Kawashima, Kanagawa JP</p> <div class=\"bar2931371\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>07-12-2012</td> <td><a href=\"/patents/app/20120175611\">METHOD OF MANUFACTURING THIN FILM TRANSISTOR, THIN FILM TRANSISTOR, AND DISPLAY UNIT</a> - A thin film transistor having (a) an oxide semiconductor film including a channel region composed of an oxide semiconductor, and a source electrode region and a drain electrode region that are composed of the same oxide semiconductor as that of the channel region and have a higher carrier density than that of the channel region; (b) a gate insulating film; and (c) a gate electrode.</td> <td>20120175611</td> <tr> </tr> <td>05-19-2011</td> <td><a href=\"/patents/app/20110115003\">SOLID-STATE IMAGING DEVICE AND METHOD FOR MANUFACTURING SOLID-STATE IMAGING DEVICE, AND ELECTRONIC DEVICE</a> - A solid-state imaging device includes a photoelectric conversion portion that is provided above an imaging surface of a substrate, and a plurality of readout circuit portions that are provided below the photoelectric conversion portion on the imaging surface. The photoelectric conversion portion includes a photoelectric conversion film that receives incident light and produces a signal charge, and a first electrode and a second electrode that sandwich the photoelectric conversion film, and the first electrode, the photoelectric conversion film, and the second electrode are sequentially layered upward on the imaging surface. Further, each of the readout circuit portions",
    "textAfterTable": "Patent applications by Toshitsugu Kawashima, Kanagawa JP Yasunari Kawashima, Kanagawa JP Patent application number Description Published 20080231223 Rotor Driving Control Device and Image Forming Apparatus - A device of a motor with a rotation control means that decreases the fluctuation of its rotation period. The control is carried out based on the amplitude and the phase generated by amplitude-and-phase generating devices, detecting passage time of detected portions ( 09-25-2008 Yoshinari Kawashima, Kanagawa JP Patent application number Description Published 20080316770 Backlight and light guide plate, method of manufacturing diffuser and light guide plate, and liquid crystal display apparatus - The present invention relates to a backlight and a light guide plate, a method of manufacturing a diffuser and the light guide plate, and to a liquid crystal display apparatus, all enabling a cost reduction by reducing the parts count and curtailing unnecessary manufacturing processing. A diffuser 12-25-2008 20110013074 Biometric authentication apparatus - The present invention provides a biometric authentication apparatus realizing reduction in thickness while holding high authentication precision. The biometric authentication apparatus includes: a light source emitting light in a wavelength range including a wavelength range",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}