{
    "relation": [
        [
            "Beath OPR",
            "410/1",
            "410/2"
        ],
        [
            "Births / baptisms",
            "1643-1819",
            "1820-1854"
        ],
        [
            "Proclamations / marriages",
            "1643-1819",
            "1820-1854"
        ],
        [
            "Deaths / burials / mortcloths",
            "1802-1819",
            "1820-1852"
        ]
    ],
    "pageTitle": "GENUKI - Fife Old Parish Registers - Contents - Parishes A-C",
    "title": "",
    "url": "http://www.genuki.org.uk/big/sct/FIF/DetailedListofOPRsAC.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00015-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 461040552,
    "recordOffset": 461024910,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{1=Last updated 14 August, 2014 : William McM. Owen}",
    "TableContextTimeStampAfterTable": "{28285=B.  and M.  intermixed till 1782; after which they occur on alternate pp. of the Register. Duplicate of Record 1652 - 1657, and 1690 - 1712. B. defective 1782 - 1784; M. defective 1782 - 1787. Not very carefully kept after 1782. Mothers' names not recorded in entries of B. till 1784, and frequently omitted even after that date. D.  (Burials.), 46189=B.  Record appears to have been regularly kept. Mothers' names not recorded till Oct. 1667, and not unfrequently omitted 1672 - 1700 incl. M.  Portion of second leaf lost. Record 1653 - 1661 very much wasted, large portions of the leaves being decayed, and from 1661 to Aug. 1670, it is entirely lost. Only three entries Nov. 1698 - July 1700. Blank Jan. 1734 - April 1746, and only one entry, 1811, Dec. 1807 - Dec. 1812. No entry June 1818 - May 1820. After 1706 (exc. 1746 - 1754 incl.) the fact of Marriage is seldom added to the entries of Proclamation or Contract. D.  Blank Dec. 1641 - May 1647, and Nov. 1648 - Aug. 1667. Only one entry July 1674 - Nov. 1679., 29585=B.  blank April 1649 - Feb. 1676, May 1683 - Jan. 1686, and Aug. 1714 - Feb. 1718. M.  Prior to 1649, entries among B. for same period. Blank May 1649 - Nov. 1673, from which date to 1678, only entries of Contracts. Blank Oct. 1678 - May 1692, June 1714 - Jan. 1720, and Aug. 1794 - Jan. 1796. No entry for 1805 nor 1815. After 1775, entries of Clandestine Marriages (chiefly celebrated at Edinburgh) not unfrequent. D.  (Burials.), 24860=B.  and M.  intermixed throughout. Proclamations and Marriages often separately recorded. [Subsequent to publication of the Detailed List, records were found within other Church of Scotland records (CH2/25/4) which contain Deaths 1830 - 1855. These are now included in the OPR Records as 407/3.], 6866=B.  Only one entry Oct. 1662 - Feb. 1664. Record, 1692 - 1705, tabulated. Irregular entries about 1763, and 11 leaves at end of Record for 1806, containing such entries, dated 1784 - 1808; they are also of frequent occurrence after 1807. M.  From 1710 - 1744 the entries occur among B. for same period. Separate Record of M., however, recommences June 1741. Blank June 1762 - Jan. 1764. After Record for 1806, are four leaves containing 'Clandestine Marriages', 1784 - 1807. [Vol 399/1b contains handwriting samples on fly-leaf. Vol. 399/4 contains an index to B. 1841 - 1855 (surname followed by forename of child), and an index to M. 1843 - 1855 (both parties' surnames, bridegroom's first).] [Subsequent to publication of the Detailed List, the 4 volumes with Death records were added (399/5, 399/6, 399/7, 399/8).], 47872=B.  and M.  intermixed 1693 - 1748, and D.  (Mortcloth Dues) also included from Feb. 1704. United Record blank July 1709 - Sept. 1726, and no entries of M. Dec. 1708 - Jan. 1727. From Feb. 1751, the B. M. and D. (Burials) for each year are recorded by turns in the same Register, exc. that the Burials are blank Oct. 1765 - 1773. There are, however, Mortcloth Dues for this last period. From 1751 - 1764 inclusive, both Contracts and Marriages are recorded. Mothers' names inserted in entries of B. after Dec. 1696., 620=The Detailed List of the Old Parochial Registers of Scotland, published 1872, provides information about the content of, and the gaps within, the Old Parish Registers (OPRs) of births / baptisms, marriages / proclamations, and deaths / burials., 10306=B.  blank Jan. 1689 - Feb. 1691. Mothers' names not regularly recorded till about 1763. M.  only transcribed entries of Contracts, etc. prior to Dec. 1669; blank July 1682 - Oct. 1702. D.  (Burials.) Exc. entries of Earl of Morton's family, 1739 - 1848, on one page after M. for1819, the Record is blank from Oct. 1669 - April 1790. Mortcloth Dues, 1790 - Dec. 1816, after which Deaths and Burials are recorded., 31509=B.  blank July 1686 - May 1701. Prior to 1733, the entries are tabulated. Only five entries Dec. 1743 - Jan. 1747. Not very carefully kept 1782 - 1806. M.  Contracts and Proclamations prior to 1686. Blank May 1686 - June 1701. Contracts and Marriages 1701 - 1762. Blank Dec. 1702 - July 1705. No entry Jan. 1743 - April 1744. Marriages after 1762, exc. a few entries of Contracts and Proclamations about 1770 - 1777. D.  Deaths prior to 1743. Blank May 1743 - April 1806, after which date generally Deaths and Burials. Only nine entries 1806 - 1818 incl., then none till 1825; five entries 1825 - 1828 incl.; again blank till 1838, and very defective to end of Record in 1848., 34666=B.  and M.  intermixed till 1654. Four leaves imperfect at 1650, and four at 1660. B.  Blank Oct. 1654 - Jan. 1662, from which date there is a separate Record. Blank Oct. 1674 - Oct. 1692, Sept. 1698 - Jan. 1701, and Nov. 1704 - July 1705. Mothers' names not recorded till 1692. M.  Contracts prior to 1654. Blank (exc. entries of indirect reference to M.) June 1654 - July 1669. Contracts and Marriages 1669 - 1684. Blank June 1684 - May 1687, from which date Contracts till 1699. Blank Oct. 1699 - July 1705, and May 1752 - Sept. 1761. No entries Dec. 1781 - Nov. 1783, from which date the M. again occur among the B. Entries more full after 1786. D.  Mortcloth Dues intermixed with other matters till 1760. Blank 1699 - 1706, and 1760 - 1784. Burials 1784 - 1786, then blank till Dec. 1790, from which date Deaths., 22847=B.  blank Dec. 1661 - Mar. 1663, and Aug. 1667 - Sept. 1702. After 1794, blank spaces occur, apparently intended for neglected registrations. M.  blank Dec. 1661 - Aug. 1663, and July 1667 - Oct. 1702. Record, 1702 - 1786, well kept. Blank (exc. five entries for 1794) June 1786 - April 1795, from which date till 1817 entries of Proclamations merely, and these defective till April 1797. Entries of sums 'mortified' by bridegrooms before Marriage 1701 - 1794 in vol. 2. D.  blank Feb. 1662 - Feb. 1663, and June 1667 - Nov. 1774. Mortcloth Dues from latter date till Jan. 1817, when a Record of Deaths again commences. From 1704 - 1799, occasional entries relating to funeral Expenses of Paupers, mixed up with other matters in vol. 2., 42916=From 1685 till 1693 B. M. and D. are entered in parallel cols. of the same pages. M.  Contracts and Marriages, 1655 - 1684 inclusive, separately recorded. M. and D. are recorded in parallel cols. after 1693. Separate Record containing Contracts of M. 1685 - 1779. D.  (Burials.) Blank Nov. 1693 - Jan. 1750. After Jan. 1753, the entries occur on occasional pp. of the Record containing Contracts for same period., 19261=B.  (Baptisms), M.  (Proclamations and Marriages), and D.  (Burials and Mortcloth Dues) prior to 1711 intermixed with other matters. B. and M. blank Sept. 1699 - Dec. 1704. No entry of M. Nov. 1730 - July 1732. B. and M. intermixed 1711 - 1747. Separate Record of B. after Jan. 1748. Exc. Jan. 1748 - Jan. 1752, Mothers' names not recorded. From 1711 - 1748, Proclamations and Burials, and Mortcloth Dues, and from 1748, Proclamations and Mortcloth Dues, are intermixed with other matters. There is also, however, a separate Record of Deaths and Burials April 1748 - May 1753 on a leaf at end of vol. 3., 12015=B. M. and D. prior to1702 generally recorded in parallel columns of the Register. After 1702 Births recorded separately. Blank (exc. two entries) Jan. 1734 - Jan. 1749. Mothers' names not recorded. M. and D. Proclamations and Mortcloth Dues till 1727. Blank 1727 - 1783, after which date Marriages and Burials are recorded. M. terminate March 1794, exc. one entry for 1823; and D. terminate Sept. 1794., 26302=B.  M.  and D.  1670 - 1701 are recorded in parallel cols. of the same pages. M. appear defective 1695 - 1701; but there are separate  entries of Contracts, which to some extent supplement the Record. B. and M. blank 1701 - 1722, from which date till 1745 they are usually entered on alternate pp. of the same Register. Blank (exc. a few irregular entries) 1745 - 1754. No entry of M. for 1819. D.  Burials to Dec. 1684; Deaths 1685 - 1701 inclusive. Record wanting 1701 - 1783; there is, however, a leaf containing irregular entries1640 - 1717. [Subsequent to publication of the Detailed List, records were found within other Church of Scotland records (CH2/382/2) which contain Baptisms 1701 - 1721, 1755 (1 entry), Marriages 1706 - 1721 and Deaths 1729 - 1798 (one leaf). These are now included in the OPR Records as 408/3.], 33148=B.  and M.  intermixed till 1709. Separate entries of Contracts and of Marriages prior to that date. Both Records blank June 1709 - 1717, after which separate Registers kept. The fact of Marriage very frequently omitted about 1782 - 1797 incl., 44280=B.  and M.  intermixed 1694 - Dec. 1711, and Jan. 1720 - Nov. 1806. Entries prior to 1703 irregular. Only one entry of B. Aug. 1704 - June 1706. Mothers' names not recorded in entries of B. till Dec. 1743. Only one entry of M. July 1783 - Nov. 1785. There are also separate Records of B. and M. commencing 1797. D.  Burials intermixed with B. and M. Oct. 1783 - Sept. 1794, then blank till April 1817, after which a separate Record of Deaths and Burials., 13932=B.  and M.  intermixed till May 1643. Separate Records of B. June 1643 - Dec. 1649. Blank Dec. 1649 - Jan. 1657, after which B. and M. are again intermixed till 1670. Blank June 1670 - July 1672. Separate Record of B. from July 1672. Only six entries July 1681 - Aug. 1684. Entries 1736 - 1773 tabulated. Exc. June 1643 - Dec. 1649, Mothers' names not recorded in B. till Jan. 1670, and sometimes omitted after that date. M.  blank March 1654 - Jan. 1657, May 1670 - April 1678, March 1681 - Oct. 1684, and July 1690 - Nov. 1691. One entry May 1696 - Oct. 1698. Blank Dec. 1718 - July 1720, Jan. 1724 - Oct. 1725, and Aug. 1795 - Oct. 1796. No entry 1810. Duplicate of Record 1796 - 1824. After 1773, fact of Marriage rarely added to the entry of Contract or Proclamation. D.  Deaths and Burials till June 1779, then Deaths only. Blank (exc. one entry for 1829) Sept. 1798 - 1833., 50003=From 1654 - 1817, B. M. and D. occur in the same Register book:- B. on left hand pages; M. and D. on right hand pages. B.  defective 1696 - 1701, and blank (exc. three entries) Feb. 1716 - Nov. 1718. Mothers' names seldom recorded in entries of B. 1688 - July 1769. M.  blank Jan. 1697 - Nov. 1703, and Dec. 1715 - June 1719; defective 1738 - 1740. D.  (Burials.) Blank March 1697 - Dec. 1702. Separate Records of B. M. and D. after Jan. 1817., 20877=B.  blank Dec. 1667 - Aug. 1684. Leaf at Sept. 1690 destroyed. No entries March 1696 - May 1697. Irregular about 1783 - 1793. Separate Record for Children of Dissenters at Lochgelly 1769 - 1805, the portion of which prior to 1779 is almost illegible. M.  blank May 1684 - Oct. 1697, from which date till 1760 the entries are mixed with B. for the same period. M. 1760 - 1790 occur on occasional pages of Record of B. Separate Record from No. 1791. The entries for 1793 are Contracts (exc. one M.). Only two entries Oct. 1795 - Feb. 1798. From 1797 - 1806 incl., the entries are chiefly Contracts, with the fact of Marriage sometimes added 1798 - 1800., 2417=B.  No entries between Dec. 1624 and Oct. 1625. Imperfect leaf at June 1680. Blank Jan. 1717 - May 1719. Leaves of Record 1660 - 1677 much frayed. Mothers' names not recorded till March 1783. M.  blank July 1713 - Oct. 1719, and (exc. entries of Contract or Proclamation Money 1759 - 1767) July 1759 - May 1784. No entry for 1787. D.  (Burials.), 16374=B.  and M.  intermixed till Feb. 1601, and entered in parallel cols. of the same Record 1601 - 1612. Imperfect leaf of B. after Dec. 1645. Blank Feb. 1683 - March 1684. Mothers' names seldom recorded Oct. 1587 - Oct. 1609. The early portion of the Register contains entries for the neighbouring parishes of Abercrombie or St Monance, Kilrenny, and Pittenweem. M.  blank (exc. three entries 1611 - 1612) Oct. 1609 - Oct. 1651, also Nov. 1699 - Nov. 1757; from which last date they are recorded among the B. Record for 1651 - 1699 generally embraces Contracts, with occasional entries of M. After 1757 the entries relate to Proclamations. D.  Exc. Burials for 1579, and 1585 - 1587 among B. and M., one p. of entries without year (circa 1600), and a few entries 1601 - 1603, there is no regular Record till Nov. 1747. Blank Oct. 1754 - Nov. 1783, and July 1794 - Jan. 1839. There are, however, Mortcloth Dues 1791 - 1837, exc. 1818 - 1820. Entries of D. 1783 - 1794 among B. and M. for same period. There is also a Record of D. of parishoners, collected from various sources by Rev. Hew Scott, D.D., embracing period 1549 - 1838. [Vol. 403/5 contains indexes to B. M. and D. 1838 - 1854 (surname followed by forename).], 40687=B.  and M.  intermixed till 1757. Upper portion of leaves of Record 1724 - 1757 very much wasted. and many entries partially, some entirely, destroyed. Mothers' names seldom recorded in entries of B. till 1817. M.  blank Dec. 1757 - Nov. 1783. There is, however, a separate Record containing Proclamations Dec. 1696 - April 1773, the leaves of which (1723 - 1734) are partially destroyed by damp. D.  (Burials.) Entries May 1727 - Jan. 1817, recorded on alternate pp. of the Register of B., after which date there is a separate Record. Mortcloth Dues 1723 - 1773 recorded among the Proclamations of M., 36883=B.  Duplicate of Record 1652 - 1679. Blank Jan. 1694 - Jan. 1706. Exc. Dec. 1660 - Feb. 1679 in one Record, and 1706 - 1713, Mothers' names seldom recorded till 1752. M.  Duplicate of  Record 1652 - 1678. No entry for 1691. Blank March 1694 - March 1700, from which date till Aug. 1721 only entries of fees paid by persons when contracted. Blank Aug. 1721 - Oct. 1780. Proclamations and Marriages after 1780. D.  Deaths and Burials prior to 1678. Duplicate of Record 1653 - 1678. Blank Nov. 1688 - Dec. 1699. Transcribed entries of Mortcloth Dues 1699 - 1721. Blank Aug. 1721 - Dec. 1753, after which Burials., 38978=B.  M.  and D.  (Burials) intermixed till 1644, and recorded in parallel cols. of the same pp. from 1645 - 1817, after which three separate Records are kept. Blank Jan. 1644 - March 1645, and Dec. 1646 - March 1649. Margins of leaves 1642 - 1680 much wasted, rendering many entries of M. imperfect, and some altogether illegible. Blank in Record of Burials May 1655 - Jan. 1708. After Jan. 1817, Deaths.}",
    "lastModified": "Sat, 04 Jul 2015 18:23:08 GMT",
    "textBeforeTable": "Abbotshall Parishes A - C (this page)         Parishes D - L         Parishes M - W B.  = Baptism / Birth;  M.  = Marriage;  D.  = Death.  p. = page; pp. = pages; col. = column The original records have all been made available on microfilm, and the births / baptisms, marriages / proclamations, and deaths / burials are all available on the internet at the ScotlandsPeople website. The 'Remarks relative to Blanks, Defects, Condition of Registers, etc.' (2. above) for the parishes in Fife is reproduced here in its entirety. Some later information has been provided by the National Records of Scotland. The later information and my editorial additions are given in [square brackets]. The information contained in the Detailed List'stables showing the number of volumes and the embracing dates (1. above) has been superseded by more up-to-date information provided by the Registrar General. This current information is given here. It is also in the 'Church Records' section on each parish page and is available as List of Old Parochial Registers in the \"Help searching Scottish Ancestors\" section of the Scotland's People website. Since the publication of the book, all the Old Parish Registers have been taken into the care of the Registrar General in Edinburgh and some more information has been found, particularly in Kirk Session records, which adds to and has been included in the current known OPR records. B.  No entries between Dec. 1624 and Oct. 1625. Imperfect",
    "textAfterTable": "399/2 1710-1785 1710-1744   399/3 1785-1819 1741-1819   399/4 1820-1854 (+ index) 1820-1855 (+ index)   399/5     1750-1806 399/6     1806-1843 399/7     1818-1850 399/8     1851-1860 Data supplied by the National Records of Scotland B.  Only one entry Oct. 1662 - Feb. 1664. Record, 1692 - 1705, tabulated. Irregular entries about 1763, and 11 leaves at end of Record for 1806, containing such entries, dated 1784 - 1808; they are also of frequent occurrence after 1807. M.  From 1710 - 1744 the entries occur among B. for same period. Separate Record of M., however, recommences June 1741. Blank June 1762 - Jan. 1764. After Record for 1806, are four leaves containing 'Clandestine Marriages', 1784 - 1807. [Vol 399/1b contains handwriting samples on fly-leaf. Vol. 399/4 contains an index to B. 1841 - 1855 (surname followed by forename of child), and an index to M. 1843 - 1855 (both parties' surnames, bridegroom's first).] [Subsequent to publication of the Detailed List, the 4 volumes with Death records were added (399/5, 399/6, 399/7, 399/8).] Abdie Abdie OPR Births / baptisms Proclamations /",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}