{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "If you want to succeed you have to go out of your way to actually talk to teachers and counselors and they WILL help.",
            "Montgomery College has been a life changer for me. Teachers are always happy to help and there are tons of places to get the help you need. They have a lot of information on transferring to four year colleges."
        ]
    ],
    "pageTitle": "Montgomery College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Montgomery-College/reviews?_escaped_fragment_=/show/62026",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00109-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891571535,
    "recordOffset": 891481413,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{247120=I am a full-time student for the fall 2012 semester and I pay less than $3,500.00 including the costs of textbooks and other course required materials., 60498=Montgomery is for the students that have known each other for years; I've been attending this school since August and haven't met any new friends, besides the one I had in high school., 14827=Montgomery College is very affordable (~$2000 a semester depending on how many credits you take)., 573559=© 2015, Cappex.com, LLC, 522883=The classes are good overall it all depends on the professor as well. Some of the classes are harder here than at a university so when you transfer its much easier that community college. If i could rate the college on the scale of 1-10 I would give the school a 9.5-10., 465536=The classes are not high, there is always financial aid help; and some teachers give out scholarships. Last semester I took 3 classes and my bill was $1600, which is pretty good for a community college.}",
    "textBeforeTable": "07/24/2011 Reviewer is A current student here. 8 out of 9 people found this review useful. 1 of 148 Andrea from Silver Spring, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Am learning a lot When I transferred here from my old university, I noticed that the professors were dedicated in teaching their students I learned so much and even understood the subjects that I usually struggled in. Login to rate or flag the reviews Janice Norman from Rockville, MD 01/24/2012 Reviewer is A current student here. 4 out of 4 people found this review useful. 2 of 148 Categories Comments Campus Safety campus safety is excellent. campus security is at the college 24/7 even if the students are not. there are security escorts for students if they request it. there are call boxes located throughout the campus in case of emergency. students can go to these call boxes and phone directly to campus security for help, escorts, assistance with car trouble etc.the college parking lot lights are on till 12:00am. disabled students can opt to fill out forms informing security of their classes in case they need assistance in an emergency. the college also offers self defense",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}