{
    "relation": [
        [
            "",
            "4-Month Arm",
            "6-Month Arm"
        ],
        [
            "Description",
            "Daily treatment with INH, rifampicin, ethambutol and pyrazinamide for 2 months followed by 2 months of daily INH plus rifampicin over a maximum time period of 18 weeks.",
            "Daily treatment with INH, rifampicin, ethambutol and pyrazinamide for 2 months followed by 4 months of daily INH plus rifampicin over a maximum time period of 28 weeks."
        ]
    ],
    "pageTitle": "Tuberculosis Treatment Shortening Trial - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00130247?sect=X01256&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00284-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 857565063,
    "recordOffset": 857543543,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups Subjects who met eligibility criteria were started on standard chemotherapy and routinely followed during anti-TB therapy. Patients with drug-susceptible TB who were sputum culture negative after 2 months of treatment were randomly assigned at 4 months to stop treatment or received an additional 2 months of daily isoniazid (INH) and rifampicin. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details HIV-uninfected 18 to 60 year old adults with suspected or newly diagnosed pulmonary tuberculosis were eligible for enrollment at participating sites in Kampala, Uganda; Vitória, Brazil; and Manila/Makati City, the Philippines. Screening began in April 2002 in Uganda, December 2002 in Brazil, and November 2003 in the Philippines. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: Pyrazinamide",
    "textAfterTable": "Participant Flow:   Overall Study     4-Month Arm     6-Month Arm   STARTED     196     198   COMPLETED     194     194   NOT COMPLETED     2     4   Pregnancy                 1                 0   Post-randomization exclusion                 1                 2   Not compliant with DOT                 0    ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}