{
    "relation": [
        [
            "Element",
            "Namespace",
            "Local Part"
        ],
        [
            "Value",
            "http://www.globalcompany.example.com/ns/CreditCardAuthorizationService",
            "InvalidCredit"
        ]
    ],
    "pageTitle": "Creating the First Half of the OrderProcessor BPEL Process",
    "title": "",
    "url": "http://docs.oracle.com/cd/E12839_01/integration.1111/e10275/orderprocess.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00172-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 77125231,
    "recordOffset": 77099304,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{196091=In the Inputs Arguments section, in the orderID field, enter an ID over 1000 to submit an order for over $2000., 161484=In the Expression area, enter 2000, and then click OK to close the Expression Builder., 56470=In the Inputs Arguments section of the Test Web Service page, in the orderID field, enter an ID under 1000., 160161=You define variables in the data model. When you make changes later, you must edit the value of the variable. You create a variable named MAX_PRICE to define the dollar amount where orders above this amount would need manual approval from a manager and orders under this amount are approved automatically. You set the MAX_PRICE variable to $2000.}",
    "lastModified": "Wed, 28 Jan 2015 09:48:02 GMT",
    "textBeforeTable": "Enter the following values: Double-click the new catch to display the Catch dialog. Click the Add Catch Branch icon for the scope to create a second catch. Click the Collapse (-) icon to minimize the catch. Back in the Throw dialog, click OK. In the Variable Chooser dialog, select the gOrderProcessFaultVariable and click OK. Click the Browse Fault Variables icon next to the Fault Variable field. OrderProcessorFault Local Part http://www.globalcompany.example.com/ns/OrderProcessor Namespace Throw_NoCreditCard Name Value Element Enter the following values: Double-click the new throw activity. The Throw activity dialog displays. From the Component Palette, drag a Throw activity below Assign_noCCNumber. In the selectionFailure catch, insert a throw activity after assign activity Assign_noCCNumber, so the Scope_AuthorizeCreditCard scope throws a fault: In the Assign dialog, click OK. Click",
    "textAfterTable": "Click OK in the Catch dialog. Click the Expand (+) icon to expand the InvalidCredit catch. In the InvalidCredit catch, assign data to take the credit card type and assign it to global variable gOrderProcessorFaultVariable for orders without a valid credit card type. From the Component Palette, drag an Assign activity into the branch. Rename this activity by double-clicking name underneath the icon. Do not double-click the assign icon itself. In the edit field, enter Assign_InvalidCreditFault. Double-click Assign_InvalidCreditFault. The Assign dialog displays. From the dropdown list, select Copy Operation. The Create Copy Operation dialog appears. Enter and select the following values: Element Value From   Type Expression Expression Select the XPath Expression Builder icon. The Expression Builder displays. In the BPEL Variables section, expand Variables > gOrderInfoVariable",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}