{
    "relation": [
        [
            "Patent application number",
            "20110312903",
            "20120316341"
        ],
        [
            "Description",
            "FLUORINATION OF ORGANIC COMPOUNDS - Methods for fluorinating organic compounds are described herein.",
            "FLUORINATION OF ORGANIC COMPOUNDS - Methods for fluorinating organic compounds are described herein."
        ],
        [
            "Published",
            "12-22-2011",
            "12-13-2012"
        ]
    ],
    "pageTitle": "Tang, MA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/tang-ma-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00259-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 442425831,
    "recordOffset": 442402649,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Pingping Tang, Quincy, MA US 07-25-2013 LEGEND INDICATOR FOR SELECTING AN ACTIVE GRAPH SERIES - Various arrangements for identifying and selected a data value of a dataset presented on a graph are described. The graph may be presented, wherein the graph illustrates a plurality of datasets and a legend that identifies each of the plurality of datasets. A selection of the dataset may be received via the legend of the graph. An input of a point on the graph may be received. A value of a data point from the dataset that corresponds to the input of the point on the graph may be presented. 20130187923 Published Description Patent application number Melinda Yian Tang, Cambridge, MA US 11-22-2012 INTERACTIVE CUSTOM REGIONS - One embodiment is directed to a computer program, embodied on a computer readable medium. The computer program is configured to control a processor to execute instructions. The instructions include receiving a selection of built-in interactive regions provided by a visualization component, aggregating the selected set of regions, and creating one or more custom regions from the aggregation of the selected set of regions. 20120297327 Published Description Patent application number Melinda Tang, Cambridge, MA US 02-20-2014 Remote Use of Local Computing Components - A local computing device is connected to a remote computing device over a network. A user provides input to a",
    "textAfterTable": "Qing Tang, Acton, MA US Patent application number Description Published 20100305155 SUBSTITUTED PYRAZOLE INHIBITORS OF C-MET PROTEIN KINASE - The present invention relates to compounds of formula I, which is useful in the inhibition of c-Met protein kinase. The invention also provides pharmaceutically acceptable compositions comprising compounds of formula I and methods of using the compositions in the treatment of proliferative disorders. 12-02-2010 20110136789 C-MET PROTEIN KINASE INHIBITORS - The present invention relates to compounds of formula I useful in the inhibition of c-Met protein kinase. The invention also provides pharmaceutically acceptable compositions comprising the compounds of the invention and methods of using the compositions in the treatment of proliferative disorders. 06-09-2011 20110165120 INHIBITORS OF SERINE PROTEASES - The present invention relates to compounds of formula I: 07-07-2011 20110182856 INHIBITORS OF SERINE PROTEASES - The present invention relates to compounds of formula (I): 07-28-2011 20120165333 C-MET PROTEIN KINASE INHIBITORS - The present invention relates to compounds of formula I useful in the inhibition of c-Met protein kinase. The invention also provides pharmaceutically acceptable compositions comprising the compounds of the invention and methods of using the compositions in the treatment of proliferative disorders. 06-28-2012 20130190289 COMPOUNDS AND METHODS FOR THE TREATMENT OR PREVENTION OF FLAVIVIRUS INFECTIONS - A compound is represented by Structural Formula (I): 07-25-2013 20140275024 DNA-PK INHIBITORS - The present invention relates",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}