{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "i feel very safe at wsu. there are always campus police around and well lit areas at all time.",
            "i've only been here about a year so i'm not really familiar with the ttraditions. i know they have white out parties where the fans wear all white to basketball games but that's all i know of.",
            "wsu is slightly expensive but if your determind to get a good education there are ways to help you pay for school. dozens of scholarhsips if you are persistne enough. the teachers are very helpful and strive to help you be successful.",
            "the fitness center at wsu is very nice. take advantage of their opportunities and get involved with intramurals and make friends.",
            "once again, i'm a commuter so i never really eat on campus. i have heard it was very good though.",
            "i never lived in wsu dorms but in my previous university i did. they were a blast and probably some of the best times of my life. i made lifelong friends and memories. i would strongly recommend staying in dorms for at least one to two years. it's so worth it.",
            "it's college so of course it's not going to be easy. but going to class, asking questions, and staying focused and on track with your course load you will be successful.",
            "study hard. college is a time to perhaps find yourself but also to get a good education and not waste money. so go to class, study hard, work hard, take advantage of your opportunites, and enjoy it.",
            "clean & pretty campus teachers are very helpful easy commute"
        ]
    ],
    "pageTitle": "Wright State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Wright-State-University-Main-Campus/reviews?_escaped_fragment_=/show/74560",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00290-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897157147,
    "recordOffset": 897074979,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{147767=BURT or BART, depending on who you talk to, is a GIANT, red statue which is supposed to be an interpretation of the Wright Flyer. Ask other students what the shorthand names mean. Campus also has a modern art piece covering the topic of the fall of the twin towers in 2001. I believe the statue was actually made with pieces of the fallen buildings which brings a personal touch. The best place on campus is Allyn Hall, which is the home of the Air Force ROTC program. The building has an outdoor deck where students can go to eat and is surrounded by a pool of water which is beautiful in the summer and the fall., 451252=© 2015, Cappex.com, LLC, 223105=You should apply fairly early since most of the academic scholarships have a deadline in February. Take advantage of free tutoring for first year students. psychology 1010, super easy. Have not shown up since first week of school and have an A in the ninth week., 319516=I graduated from Wright State University in 2012. It took me five years due to health issues and family problemsa. I know that without the services that they offer free for minorities, like tutoring. I probably wouldn't have made it through. I am a first year college student . I went into college not knowing what it took to succeed but Wright State made it easy to get in touch and be mentored by people who had similar experiences as me. I would reccoment Wright State to any student who likes small classrooms, knowlegable teachers, and wants a small campus., 302600=There's a really nice mall next to campus. The area around that is quite good. Plenty of activities planned by the University Activities Board, like Fall Fest and April Craze, and WSU owns the Nutter Center where they do events and concerts (Monster trucks come, Trans-Siberian Orchestra was there, etc.), 228126=WSU has a lot of resources that make the tuition worthwhile. The campus is nice, there are plenty of student resources including on campus health clinic, a pharmacy that was just opened in 2012, counseling and legal services, and many other things., 146301=There are so many sororities on campus my head spins when I start to hear the names. These sororities also do a lot of charitable events especially during breast-cancer awareness month in October., 262646=If you plan to go to Wright State and want to live on campus, choose Hamilton Hall! It's great here. We're like ten feet away from the building where the cafeteria is (and the tunnel system! It's January and I never wear a coat because I barely have to go outside!), 149167=Wright State constantly has events going on. Students will often receive emails on seminars, magic shows, Fall Fest, May Daze, the haunted trails, Multicultural Halloween, and more! Plus, campus is surrounded by plenty of stores for shopping!}",
    "textBeforeTable": "08/11/2009 Reviewer is A current student here. 19 out of 20 people found this review useful. 1 of 107 Mik? from Ravenna, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Tips for prospective students Make sure you go to your professor for help and ask plenty of questions. If the professor knows who you are then you will do better. Also make shure you go to every class, there is know better way to know the material than actually going to class. Bang for the buck I thought Wright State was not much better than a Community College because so many people went there from my school and it was a really easy school to get into. However, Wright State leads Ohio in many different areas throughout the nation and its a great education for the little amount you actually pay. Am enjoying being here A lot of my friends from my high school class go to Wright State so I know a lot of people here and there are a ton of places to hang out, both on and off campus. The Student Union has a ton of things, from playing pool to swimming in a pool. There is also a ton of restaurants in the area to eat at, of every variety. The Fairfield Commons Mall is also a great place to shop and spend your time. Am learning a lot",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}