{
    "relation": [
        [
            "Argument",
            "name",
            "repositoryId",
            "host",
            "port",
            "scheme",
            "namespace",
            "isDefault",
            "path",
            "pathPrepend",
            "servletPathPart",
            "rewriteUrls",
            "pathTrim",
            "timeoutInMillisecs",
            "propagateTimeoutExceptions",
            "server"
        ],
        [
            "Definition",
            "Connection name. The name must be unique for this connection type within a namespace.",
            "CMIS repository ID. Typically, the name of the Oracle Content Server connection name.",
            "Hostname of the server hosting the CMIS REST service. Typically, the machine name of the WC_Spaces managed server.",
            "Port of the server hosting the CMIS REST service. Typically, the port number of the WC_Spaces managed server.",
            "Optional. HTTP scheme for accessing the CMIS REST service. Valid options are http and https. Defaults to http.",
            "Optional. WebCenter Personalization connection namespace for the connection. If not specified or set to none, the connection is available to all namespaces.",
            "Optional. Indicates whether this connection is the default CMIS connection. Valid values are 1 (true) or 0 (false). Defaults to 0.",
            "Optional. CMIS service URL path. Defaults to /api/cmis/repository/.",
            "Optional. Base CMIS service URL path to prepend to the servletPathPart and path. Defaults to /rest.",
            "Optional. Servlet section of the CMIS service URL path.",
            "Optional. Specifies how to rewrite URLs returned from the CMIS REST service. Valid options are producer, consumer, and none. Defaults to none. For more details, see 'Managing WebCenter Personalization' in the Oracle Fusion Middleware Administrator's Guide for Oracle WebCenter.",
            "Optional. Specifies the path parts to trim from URLs returned from the CMIS REST service. Defaults to None. For more details, see 'Managing WebCenter Personalization' in the Oracle Fusion Middleware Administrator's Guide for Oracle WebCenter.",
            "Optional. Timeout in milliseconds (as a string) to wait for CMIS calls to return, or None for no timeout. Defaults to None.",
            "Optional. Valid values are 1 (true) and 0 (false). When set to 1, CMIS call timeouts raise an exception. When set to 0, exceptions are not raised.",
            "Optional. Name of the Managed Server hosting the WebCenter Personalization service. This parameter is only required in a nondefault deployment configuration. No value is required for a default deployment where the WC_Utilities server hosts Personalization services."
        ]
    ],
    "pageTitle": "Oracle WebCenter Custom WLST Commands",
    "title": "",
    "url": "https://docs.oracle.com/cd/E21764_01/web.1111/e13813/custom_webcenter_admin.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00330-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 866195055,
    "recordOffset": 866088828,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{268718=Edits an existing Microsoft SharePoint 2007 repository connection. This command requires that you specify values for appName and name, plus at least one additional argument., 162353=The following example archives activity stream data that is older than October 1, 2009:, 463069=Choose OCS for Microsoft Office Communications Server 2007., 187205=Create a Microsoft SharePoint 2007 repository connection., 627383=The following example creates a connection named MyPEConnection for a WebCenter Spaces. The connection points to a Microsoft Exchange Server 2003., 460508=Use the listIMPAdapters command to find out which types of instant messaging and presence servers are supported. Out-of-the-box, WebCenter applications support Oracle WebLogic Communications Server (OWLCS), Microsoft Live Communications Server (LCS), and Microsoft Communications Server 2007 (OCS)., 587711=The frequency, in seconds, that Space distribution lists are checked for new incoming emails. The default is 1800 seconds (30 minutes)., 626838=The following example creates a connection named MyPEConnection for WebCenter Spaces (appName='webcenter'). The connection points to a Microsoft Exchange Server 2007 and is designated as the default connection for the Personal Events service., 187625=Edit a Microsoft SharePoint 2007 repository connection., 173817=The following example archives activity stream data associated with Spaces that have been inactive (no activities have occurred, regardless of open or closed status) since October 1, 2009:, 621416=The Personal Events service supports connections to Microsoft Exchange Server 2003 and Microsoft Exchange Server 2007.While you can register multiple personal events connections for a WebCenter application, only one connection is used for personal events services - the default (or active) connection., 188045=List all Microsoft SharePoint 2007 connections that are configured for a WebCenter application., 261480=Creates a connection to a Microsoft SharePoint 2007 repository., 178409=The following example restores activity stream data archived since October 1, 2009:}",
    "lastModified": "Wed, 13 May 2015 05:19:31 GMT",
    "textBeforeTable": "listMailConnection(appName, [verbose, name, server, applicationVersion])  Syntax      Lists all of the mail server connections that are configured for a named WebCenter application. Description    Use with WLST: Online Module: Oracle WebCenter listMailConnections    name='myMailServer', key='mailProperty1') wls:/weblogic/serverConfig> deleteMailConnectionProperty(appName='webcenter',  The following example deletes a mail server connection property named mailProperty1. Example       Optional. Version number of the deployed application. Required if more than one version of the WebCenter application is deployed. applicationVersion    Optional. Name of the managed server where the WebCenter application is deployed. For example, WC_Spaces. Required when applications with the same name are deployed to different servers and also when you have a cluster.  server    Name of the connection property you want to delete. key    Name of an existing mail server connection. name    Name of the WebCenter application in which to perform this operation.",
    "textAfterTable": "appName Name of the WebCenter application in which to perform this operation.  verbose Optional. Displays the default mail server connection in verbose mode, if available. Valid options are 1 (true) and 0 (false). When set to 1, the name and details of the mail server connection are listed. When set to 0, only the connection name displays. This argument defaults to 0.  server Optional. Name of the managed server where the WebCenter application is deployed. For example, WC_Spaces. Required when applications with the same name are deployed to different servers and also when you have a cluster.  applicationVersion Optional. Version number of the deployed application. Required if more than one version of the WebCenter application is deployed. Example The following example lists the name and details of the mail server connection that the Mail service is using, in an application named webcenter.  wls:/weblogic/serverConfig> listDefaultMailConnection(appName='webcenter', verbose=1) setDefaultMailConnection Module: Oracle WebCenter",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}