{
    "relation": [
        [
            "Flag",
            "SASL",
            "STARTTLS"
        ],
        [
            "Description",
            "Simple Authentication and Security Layer (RFC 2554)",
            "Transaction Level Security (RFC 2487)"
        ]
    ],
    "pageTitle": "Part??IV Mail Services Topics (System Administration Guide: Network Services)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19082-01/819-1634/6n3vrg2ko/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00138-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 77216887,
    "recordOffset": 77140111,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{6450=Costales, Bryan. sendmail, Third Edition. O'Reilly & Associates, Inc., 2002., 186257=SOLARIS=21000, 392233=The preceding example places a limit of 1000 on the number of messages that are delivered per connection on an smtp mailer., 381340=A new FEATURE() that turns off sendmail's default setting from m4–generated configuration files to “listen” on several different ports, an implementation of RFC 2476.}",
    "lastModified": "Wed, 28 Aug 2013 19:41:39 GMT",
    "textBeforeTable": "sendmail Flags Table 14–1 General Starting in the Solaris 10 release, the following flags are used to compile sendmail. If your configuration requires other flags, you need to download the source and recompile the binary. You can find information about this process at http://www.sendmail.org. Flags Used and Not Used to Compile sendmail Versions of the Configuration File Alternative sendmail Commands MILTER, Mail Filter API for sendmail Flags Used and Not Used to Compile sendmail This section, which includes the following topics, describes some of the differences in the Solaris version of sendmail as compared to the generic Berkeley version. Solaris Version of sendmail editmap(1M) makemap(1M) mailstats(1) mail.local(1M) sendmail(1M) For details that are not covered in these chapters, see the following man pages: Changes From Version 8.12 of sendmail Changes in Version 8.13 of sendmail Interactions of sendmail With Name Services Mail Addresses and Mail Routing Mail Service Programs and Files Software and Hardware Components of",
    "textAfterTable": "NETINET6 Support for IPv6. This flag has been moved from conf.h to Makefile. Table 14–2 Maps and Database Types Flag  Description  NDBM Support for ndbm databases NEWDB Support for Berkeley DB databases  USERDB Support for the user database  NIS Support for nis databases NISPLUS Support for nisplus databases LDAPMAP Support for LDAP maps MAP_REGEX Support for regular expression maps  Table 14–3 Solaris Flags Flag  Description  SUN_EXTENSIONS Support for Sun extensions that are included in sun_compat.o. SUN_INIT_DOMAIN For",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}