{
    "relation": [
        [
            "First Name",
            "Emily",
            "Julia"
        ],
        [
            "Last Name",
            "Schlect",
            "Gustafson"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "Assistant Analyst, CBO",
            "Staff Asst, Senate ENR; LD, Rep. Rehberg"
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=362BB8DE-5890-46E4-815C-6C16A0DB661E&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00242-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 224445210,
    "recordOffset": 224435138,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27720=-H.R. 2337, Energy Policy Reform and Revitalization Act of 2007, Title I, Section 103, study of carbon dioxide captured from coal-fired power plants and coal-to-liquids plants, Title II, Section 224, due diligence fee relating to coal, Title IV, storage formation including unmineable coal seams, Title V, sharing of penalties and fees of coal-to-liquids equally available to other forms of energy. - House Energy and Commerce Committee \"Discussion Draft\", comprehensive climate change policy legislation. - S. 3628, Stop Excessive Energy Speculation Act. -H.R. 6604, Commodities Market Transparency and Accountability Act. -H.R. 6899, Comprehensive American Security and Consumer Protection Act, federal renewable electricity standard. - S. 1387, Federal Greenhouse Gas Registry Act of 2008, All Titles. -H.R. 6877, Greenhouse Gas Registry Act, All Titles., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 64422=-S. 906, Mercury Export Ban Act of 2008, All Titles., 59327=- H.R. 3001, National Defense Authorization Act for FY 2009, multi-year procurement contracts for alternative/coal-derived fuels; Authorization of funding for coal derived fuels; DOD testing, research and development., 12193=-Department of the Interior, Environment, and Related Agencies Appropriations Bill, FY 2009 (no bill no.), sections of the Bureau of Land Management (BLM), U.S. Geological Survey (USGS), and Office of Surface Mining (OSM), funding for Mining Law Administration at the BLM; the Minerals Information Team at the USGS; deferred payment of coal lease bids, bonus bids; BLM programs; USFS programs. EPA programs. -S. 3230, Department of Labor, Health and Human Services, Educations and Related Agencies Appropriations Bill, FY 2009, sections on the National Institute for Occupational Safety and Health (NIOSH) Center for Disease Control, funding for mine safety research programs at NIOSH. -S. 2358, Energy and Water Development Bill, FY 2009 (no house bill no.), Fossil Energy Research and Development; Corps of Engineers; Civil Works-Construction and Regulatory Program funding for coal research, development and demonstration programs; lock and dam rehabilitation projects; and the Administration's proposed barge tax. -H.R. 2638, Consolidated Security, Disaster Assistance and Contiunion Appropriations Act of 2009, funding for coal-to-liquids testing, research and development., 52481=-H.R. 1495 and S. 1248, Water Resources Act of 2007, authorization of navigation projects. -S. 1125, Freight Rail Infrastructure Capacity Expansion Act, All Titles. -H.R. 2701, Transportation Energy Security and Climate Change Mitigation Act of 2007, Sec. 203., 47107=-H.R. 5140, Recovery Rebates and Economic Stimulus for the American People Act of 2008, AMT Monetization Amendment -H.R. 3221, Renewable Energy and Energy Conservations Tax Act of 2007, AMT Monetization, Coal excise tax refund -H.R. 6049, Energy and Tax Extenders Act of 2008 -S. 2886, Alternative Minimum Tax and Extenders Tax Relief Act of 2008 -S. 3098, Substitute to Extender Bill -S.Amdt. 4387, Foreclosure Prevention Act of 2008, AMT Monetization, Coal excise tax. -H.R. 2419, Food and Energy Security Act of 2007, Title XII, Sec. 11231 Alternative fuel excise tax credit for coal-to-liquids -H.R. 1424, Energy Improvement and Extension Act of 2008. -S. 3125, Energy Independence and Tax Relief Act of 2008. - S. 3478, Energy Independence and Investment Act of 2008. - S. 3132, Accerlating Carbon Capture and Sequestration Act of 2008., 20885=-CWA, Section 404, jurisdiction, permits, definitions; Mercury Rulemaking for Power Plants; Clean Air Interstate Rule; Particulate Matter NAAQS; Ozone NAAQS, Prevention of Significant Deterioration; New Source Review. -H.R. 2421 and S. 1870, Clean Water Restoration Act, Section 4 and 5, definition of waters of the United States and navigable waters definition. -H.R. 2169, To amend the Federal Water Pollution Control Act, All Titles. - S, 3469, CAIR Reinstatement Act of 2008., 61597=-H.R 6066, Extractive Industries Transparency Disclosure Act, All Titles. -H.R. 5512, Coin Modernization and Taxpayer Savings Act of 2008., 34849=-H.R. 576, Federal Mine Ventilation Safety Act of 2007, All Titles. -H.R. 2768 and H.R. 2769, S-MINER Act, All Titles. -S. 1655, Miner Health and Safety Enhancement Act of 2007, All Titles. -S. 742, Ban Asbestos in America Act of 2007. -S. 2127, Mine Disaster Family Assistance Act of 2007. -H.R. 6093, Bruce Vento Ban Asbestos and Prevent Mesotheliom Act of 2008. -Mine Safety & Health Administration Staffing and Resource Allocation; Mine Safety Emergency Training Standard; Metal/Nonmetal Diesel Particulate Emissions (DPM); Crystalline Silica; Respirable Coal Mine Dust; MINER Act Implementation; Mine Seal Rule; Mine Rescue Rule., 40135=-Implementation of Mining Law Reform in Senate (no bill) -S. 2750, Abandoned Mine Reclamation Act of 2008, All Titles -H.R. 5583, Grand Canyon Watersheds Protection Act. - House Natural Resources Committee, Resolution to withdraw lands in Arizona for mining. -Mining Law Administration; Surface Mining Control and Reclamation Act Administration; Federal Land Policy Management Administration; Regulation of Mining on Public Lands; Fair Market Value on Public Lands; OSM Stream Buffer Zone Rule; Energy Policy Act/Coal Leasing Amendments; Guidance on historic preservation, Fair market value rulemaking, Leasing of Solid Minerals other than coal and oil shale rulemaking.}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20001 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  RICH NOLAN  2024633241  rnolan@nma.org 5. Senate ID#  28218-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}