{
    "relation": [
        [
            "Argument",
            "-type mbeanType",
            "-mbean objectName",
            "-pretty",
            "-property property"
        ],
        [
            "Definition",
            "Returns information for all MBeans of the specified type. For more information, see Section A.13.1, \"Specifying MBean Types.\"",
            "Fully qualified object name of an MBean in the http://java.sun.com/j2se/1.5.0/docs/api/javax/management/ObjectName.html format. For example, if you want to look up an MBean for an EPL Processor Stage, the naming is as follows (in practice, the string should be on one line): \"com.bea.wlevs:Name=,Type=, Application=\"",
            "Places property-value pairs on separate lines.",
            "The name of the MBean property (attribute) or properties to be listed. If -property is not specified, all properties are displayed."
        ]
    ],
    "pageTitle": "wlevs.Admin Command-Line Reference",
    "title": "",
    "url": "https://docs.oracle.com/cd/E28280_01/admin.1111/e14300/admin_tool.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00076-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 864910551,
    "recordOffset": 864877418,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{261024=The format is MM-dd-yyyy:HH:mm:ss, such as 10-20-2007:11:22:07., 189984=For example, to play back only events with record-time less than or equal to January 20, 2010, at 6:00pm, use the following value:, 203091=For example, to specify that play back should start on January 20, 2010, at 5:00am, use the following value:, 188989=For example, to play back only events with record-time greater than or equal to January 20, 2010, at 5:00am, use the following value:, 270605=The following example shows how to list all the resource revisions created between 11:10:07 and 11:22:07 on 20 November 2007 for the application helloworld:, 170987=For example, to specify that recording should end on January 20, 2010, at 6:00pm, use the following value:, 274823=The following example shows how to roll back all the resource revisions created between 11:10:07 and 11:22:07 on 20 November 2007 for the application helloworld:, 203934=For example, to specify that play back should end on January 20, 2010, at 6:00pm, use the following value:, 266143=The following example shows how to list all the change records created between 11:10:07 and 11:22:07 on 20 November 2007 for the application helloworld:, 170141=For example, to specify that recording should start on January 20, 2010, at 5:00am, use the following value:, 171990=The format is HH:mm:ss, such as 01:00:00.}",
    "lastModified": "Wed, 14 Jan 2015 14:04:18 GMT",
    "textBeforeTable": "Table A-26 GET Arguments GET [-pretty] {-type mbeanType| -mbean objectName} [-property property1] [-property property2]... [ Common Arguments ] [ User Credentials Arguments ] [ Connection Arguments ] java wlevs.Admin  A.13.3.1 Syntax    abbribute2: value property1: value MBeanName: object-name . . . property2: value property1: value MBeanName: object-name  If -pretty is specified, each property-value pair is displayed on a new line and curly brackets are not used to separate the pairs: Note that the properties and values are expressed as name-value pairs, each of which is returned within curly brackets. This format facilitates parsing of the output by a script. . . . {MBeanName object-name {property1 value} {property2 value}. . .}  The output of the command is as follows: Displays MBean properties (attributes) and JMX object names (in the http://java.sun.com/j2se/1.5.0/docs/api/javax/management/ObjectName.html format). A.13.3 GET       Sets the specified property values for the named MBean instance. SET Searches for MBeans whose ObjectName matches a pattern that you specify. QUERY Invokes",
    "textAfterTable": "A.13.3.2 Example The following example displays all properties of the CQLProcessorMBean that was registered for the Processor Stage when the application called helloworld was deployed in Oracle Event Processing.  prompt> java wlevs.Admin -url service:jmx:msarmi://localhost:9002/jndi/jmxconnector -username wlevs -password wlevs GET -pretty -mbean com.bea.wlevs:Name=eplprocessor,Type=CQLProcessor,Application=helloworld The following example displays all instances of all CQLProcessorMBean MBeans.  prompt> java wlevs.Admin -url service:jmx:msarmi://localhost:9002/jndi/jmxconnector -username wlevs -password wlevs GET -pretty -type CQLProcessor A.13.4 INVOKE Invokes a management operation for one or more MBeans. For Oracle Event Processing MBeans, you usually use this command to invoke operations other than the getAttribute and setAttribute that most Oracle Event Processing MBeans provide. A.13.4.1 Syntax  java wlevs.Admin [ Connection Arguments ] [ User Credentials Arguments ] [ Common Arguments ] INVOKE {-type mbeanType | -mbean objectName} -method methodname [argument . . .] Table A-27 INVOKE Arguments Arguments Definition  -type mbeanType Invokes the operation on all MBeans of a specific type. For",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}