{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "Students that live in Pinellas, Hillsborough, and Pasco counties and would still like to live at home and commute to school!! Also great for any student that loves the Tampa area (access to Ybor city, great sports teams, and of course within decent proximity to our beautiful Florida beaches!!).",
            "Keep your grades up in the last semester of high school, work hard and don't slack off, and make sure to apply as early as possible for FAFSA and USF Tampa campus to ensure admission as well as a solid chance of being awarded scholarship money!!",
            "The prices per credit-hour and for fees are a lot like most public Florida colleges. Therefore, along with Florida Bright Futures Scholarships and the AMAZING scholarships that USF offers its high-standing students (as well as the Honors College scholarship given to Honors students each semester), college tuition is easily covered for me! I don't live on campus, of course, but for a commuter, money isn't a worry for me :)",
            "I absolutely LOVE USF!!!! I commute about 50 minutes to USF Tampa and back to my home in Seminole, Florida each day of the working week. I would travel even further to be able to enjoy the beautiful campus, the wonderful Honors college staff and classes, and the amazing student body. Everyone I have met is so wonderful and helpful! I made such a great choice coming to this school and this campus :)",
            "There are so many majors to choose from and some AMAZING professors to learn from! There is a tremendous opportunity of important information to learn. Everything I have encountered so far has been current, relevant information to this time period as far as Public Health and Humanities go. You truly know that what you are learning you can use for the rest of your life in the workplace or in the community."
        ]
    ],
    "pageTitle": "University of South Florida-Main Campus Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-South-Florida-Main-Campus/reviews?_escaped_fragment_=/show/2508",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00260-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910329663,
    "recordOffset": 910138426,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{65518=If you study hard in high school, you will most likely be awarded an undergraduate scholarship ranging from $2000-$4000 a year based on your SAT scores. This along with federal aid will really diminish the need for loans!, 529412=Humans versus Zombies is a staple of the campus in October for Halloween. It's a week long, campus-wide, game of tag essentially. It happens once every semester and is one of the most fun events I've ever participated in/watched!, 750471=There's a really cool sundial type thing with a meteorite in the middle of it, and on the summer solstice at 1:12 pm the circle above casts a shadow perfectly onto the circle in the center., 1116083=Food in the Argos, Andros, and Juniper/Poplar areas have ok food. Their food changes all the time but has sections that are always constant like sandwiches and pizza. The Marshall student center has a subway, panda express, chick-fil-a, and an organic section. After spring break of 2013 a pollo tropical is going to be on campus., 532688=The classes are consistent with whatever level you sign up for (1000 to 4000). Even if the course material is difficult, the professors are VERY accessible, as well as are the free tutor services and learning centers., 579975=The bathrooms are all cleaned regularly, the Juniper-Poplar Hall was just built in 2009, and there are always constant get togethers and fun activities on each floor., 176636=Apply early and be persistent. USF has not traditionally turned applicants away but this has changed over the past few years. Not everyone gets accepted anymore. Entrance requirements like GPA and SAT are really important so take the time to earn a high GPA and study for the SAT. Also, the university offers millions of dollars in scholarships to new students but you have to apply for them several months before the school year starts. Start looking into scholarships as early as October of the year before because their deadlines are often in the spring and long before the school year begins. Make some friends who are already at the university since they can give you specific tips on who to go to if you have an issue during the application process. It's easy to get lost in a big state university system so be diligent and take everything seriously. You'll have plenty of fun once you're accepted.}",
    "textBeforeTable": "07/25/2009 Reviewer is A current student here. 80 out of 81 people found this review useful. 1 of 417 Jessica from Tampa, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. University of South Florida-Main Campus Reviews University of South Florida-Main Campus › Florida › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Julie from Deland, FL 08/13/2009 Reviewer is A current student here. 47 out of 47 people found this review useful. 2 of 417 Categories Comments Great for these types of students Enthusiastic students with drive and ambition. Students who love having fun just as much as learning. Students who are open to try new things. Tips for prospective students Get involved ASAP. The sooner you get involved, the easier it is. Try new things and be open minded. Oh yea, study hard and make your classes top priority. Enjoy this time in your life. You get back as much as you put in. Bang for the buck Tuition is going up, and USF recognizes that. The fees included in tuition do not begin to cover what you can receive from this school. There are SO many free things around campus. If you pay attention, you can usually find free food…daily. There are so many activities and events that are",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}