{
    "relation": [
        [
            "Part number",
            "46M0830",
            "46M0930",
            "81Y4426"
        ],
        [
            "Description",
            "ServeRAID M5025 SAS/SATA Controller",
            "ServeRAID M5000 Series Advance Feature Key†",
            "ServeRAID M5000 Series Performance Accelerator Key†"
        ],
        [
            "Maximum quantity supported",
            "4",
            "1 per one M5025",
            "1 per one M5025"
        ]
    ],
    "pageTitle": "IBM Redbooks | IBM System x3650 M3 (Withdrawn)",
    "title": "",
    "url": "http://www.redbooks.ibm.com/redbooks.nsf/5193609f3941e9cf85256bc300724cfc/c5dd4f1b2c677e85852577d0005f1aa6?OpenDocument",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00029-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 684482295,
    "recordOffset": 684443298,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{17970=This document is being moved! In September 2015, this document will be moved to lenovopress.com and will no longer be available on the IBM Redbooks site. Please bookmark the URL http://lenovopress.com/TIPS0805 to access this specific document both today and after the migration in September.}",
    "TableContextTimeStampAfterTable": "{210712=Publish Date 13 December 2010, 210770=Last Update 21 March 2014, 100242=Network adapters x3650 M3 supports up to four integrated Gigabit Ethernet ports. Two ports are standard, and two ports can be added by installing the optional Dual-port Gigabit Ethernet Daughter card, 46M1076. This card uses a dedicated connector on the motherboard and does not consume a PCI expansion slot. Integrated NICs have the following features:}",
    "lastModified": "Thu, 30 Jul 2015 12:10:58 GMT",
    "textBeforeTable": "Standard specifications The following table lists the standard specifications. Table 1. Standard specifications Back to top Locations of key components and connectors Figure 2 shows the front of the server. Figure 2. Front view of the IBM System x3650 M3 Figure 3 shows the rear of the server. Figure 3. Rear view of the IBM System x3650 M3 Figure 4 shows the locations of key components inside the server. Figure 4. Inside view of the IBM System x3650 M3 Back to top An altimeter works in conjunction with the IMM to govern fan rotation based on the readings that it delivers. This saves money under normal conditions because the fans do not have to spin at high speed. The x3650 M3 uses hexagonal ventilation holes in the chassis. Hexagonal holes can be grouped more densely than round holes, providing more efficient airflow through the system chassis. This ultimately results in reduced operational costs. Energy-efficient components, including low-voltage",
    "textAfterTable": "Memory Up to 18 DIMM sockets (9 DIMMs per processor). Up to 288 GB with 16 GB DDR3 RDIMMs and 18 populated DIMM slots (up to 144 GB with 9 DIMMs per processor), or up to 48 GB with 4 GB DDR3 UDIMMs and 12 populated DIMM slots (up to 24 GB with 6 DIMMs per processor). Memory protection ECC, ChipKill (for x4-based memory DIMMs), memory mirroring, and memory sparing. Disk drive bays Up to 16 2.5\" hot-swap SAS/SATA HDDs or solid-state drives. Maximum internal storage Up to 25.6 TB with 1.6 TB SSDs, or Up to 19.2 TB with 1.2 TB SAS HDDs, or Up to 16.0 TB with 1 TB SATA HDDs Intermix of SAS/SATA/SSD is supported. RAID support RAID 0, 1, 1E with ServeRAID-BR10il v2 or M1015; RAID 0, 1, 5, 10, 50 with M5014 or M5015. Optional upgrade to RAID 5 is available for M1015. Optional upgrade to RAID 6, 60 is available for M5014/M5015. Optical drive bays One, support for DVD-ROM or Multiburner. Separate bay. Tape drive bays Optional Tape Enablement Kit is available to support one DDS5, DDS6, or RDX internal tape drive. If used, the maximum number",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}