{
    "relation": [
        [
            "Category",
            "Datatype",
            "Valid values",
            "Broker default",
            "Imported?",
            "Parameter class",
            "Role",
            "Standby type",
            "Corresponds to",
            "Scope",
            "Enterprise Manager name"
        ],
        [
            "Description",
            "Integer",
            "1 to 30",
            "4",
            "Yes, from the LOG_ARCHIVE_MAX_PROCESSES initialization parameter",
            "Dynamic",
            "Primary and standby",
            "Physical, logical, or snapshot",
            "LOG_ARCHIVE_MAX_PROCESSES initialization parameter",
            "Database",
            "Archiver Processes"
        ]
    ],
    "pageTitle": "Data Guard Broker Properties",
    "title": "",
    "url": "http://docs.oracle.com/cd/E11882_01/server.112/e10702/dbpropref.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00123-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 73771663,
    "recordOffset": 73731239,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{60695=In the following example, the STATUS from South_Sales is empty because there is no error for the South_Sales destination. The South_Report destination returned the ORA-01034 message.}",
    "lastModified": "Tue, 19 May 2015 18:29:58 GMT",
    "textBeforeTable": "The LogArchiveMaxProcesses configurable database property specifies the initial number of archiver processes (ARCn) the Oracle database invokes. The actual number of archiver processes in use may increase subsequently based on the archiving workload. 8.3.12 LogArchiveMaxProcesses Not applicable Enterprise Manager name Instance (On an Oracle RAC database, you can use the EDIT INSTANCE * ON DATABASE command to have all instances use the same value for this property.) Scope LOG_ARCHIVE_FORMAT initialization parameter Corresponds to Physical, logical, or snapshot Standby type Primary and standby Role Static Parameter class Yes, from the LOG_ARCHIVE_FORMAT initialization parameter on the primary database Imported? Empty string Broker default %d_%t_%s_%r Valid values String Datatype Description Category LOG_ARCHIVE_FORMAT initialization parameter. It is possible that the in-memory value and server parameter",
    "textAfterTable": "8.3.13 LogArchiveMinSucceedDest The LogArchiveMinSucceedDest configurable database property controls when online redo log files are available for reuse. For the online redo log files to be available for reuse, archiving must succeed to a minimum number of destinations. Category Description Datatype Integer Valid values 1 to 10 Broker default 1 Imported? Yes, from the LOG_ARCHIVE_MIN_SUCCEED_DEST initialization parameter Parameter class Dynamic Role Primary Standby type Not applicable Corresponds to LOG_ARCHIVE_MIN_SUCCEED_DEST initialization parameter Scope Database Enterprise Manager name Not applicable 8.3.14 LogArchiveTrace Set the LogArchiveTrace configurable instance-specific property to an integer value to see the progression of the archiving of online redo log files on the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}