{
    "relation": [
        [
            "Type",
            "SDD20",
            "U30C",
            "CK6"
        ],
        [
            "Quantity",
            "10",
            "10",
            ""
        ],
        [
            "Manufacturer",
            "CSR Qishuyan",
            "Krupp",
            "CSR Chengdu"
        ],
        [
            "Notes",
            "",
            "Variant of GE U26C, not to be confused with the identically-named GE U30C.",
            "Shunting locomotive"
        ],
        [
            "Sources",
            "[20][21]",
            "[21]",
            "[22]"
        ]
    ],
    "pageTitle": "TAZARA Railway - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/TAZARA_Railway",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00090-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 887860927,
    "recordOffset": 887816741,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{3048=The TAZARA Railway, also called the Uhuru Railway or the Tanzam Railway, is a railroad in East Africa linking the port of Dar es Salaam in Tanzania with the town of Kapiri Mposhi in Zambia's Central Province. The single-track railway is 1,860 km (1,160 mi) long and was built by the Tanzania-Zambia Railway Authority (TAZARA)[citation needed] from 1970 to 1975 as a turnkey project financed and supported by China. At the time of its completion, two years ahead of schedule, the TAZARA was the single longest railway in sub-Saharan Africa.[1] At the cost of US $500 million to build, the TAZARA was the largest single foreign-aid project undertaken by China.[2], 219277=In 1965, Southern Rhodesia's white-led colonial government issued its Unilateral Declaration of Independence from Britain, and threatened to sever Zambia's trade routes to the sea. As Nyerere and Kaunda continued to supported black liberation movements in Rhodesia, South Africa, Mozambique, and they sought to build a rail link between their countries to protect Zambia's political and economic independence.[25] Such a connecting railway would also help develop the agricultural regions of southwestern Tanzania and northeastern Zambia.[25], 223104=At the time, China was actively seeking diplomatic support in the Third World against both the United States and Soviet Union. Some believe that Mao originally supported the construction of the railway to secure votes against the Soviet Union at the Asia-Africa summit of Algiers of 1965.[29] Though the Algiers conference was cancelled, Chinese support for the TAZARA continued.[30], 228075=Construction was begun in 1970 and operation commenced in October 1975, two year ahead of schedule. Before the railway construction began, 12 Chinese surveyors travelled for nine months on foot from Dar es Salaam to Mbeya in the Southern Highlands to choose and align the railway's path., 239783=In 1985, seven European countries pledged additional aid to the TAZARA and provided $150 million from 1987 to 1993.[27] China also gave more aid during this period. However, a report for USAID in 1987 warned that equipment repairs would only \"reduce some short-range problems\" unless the \"underlying causes\" were fixed, as the locomotive workshops lacked basic supplies and spare parts, and less than 20% of the employees at the locomotive workshops were actually doing work.[52], 199242=In greater Dar es Salaam, the TAZARA is also used for passenger commuter rail. The Dar es Salaam commuter rail was launched in 2012 to relieve traffic congestion. The TAZARA offers two routes on its 20.5 km rail network.[6] The first from its station in Dar es Salaam to Mwakanga which lies on the outskirts of the city. It stops at Kwa Fundi Umeme, Kwa Limboa, Lumo Kigilagila, Sigara, Kitunda road, Kipunguni B, Majohe and Magnus. The second service runs from its Dar es Salaam station to Kurasini via Kwa Fundi Umeme, Yombo, Chimwaga, Maputo, Mtoni Relini and Kwa Aziz Ali Relini.[7], 217025=Following World War II, interest in railway construction revived.[1] A map from April 1949 in the Railway Gazette showed a line from Dar es Salaam to Kapiri Mposhi, not far from the route that would eventually be taken by the Chinese railway.[23] A report in 1952 by Sir Alexander Gibb & Partners concluded that the Northern Rhodesia-Tanganyika railway would not be economically justified, due to the low level of agricultural development and the fact that existing railways through Mozambique and Angola were adequate for carrying copper exports.[24] A World Bank report in 1964 also concluded that the line was uneconomical, suggesting that a road should be built instead., 228375=In all, from surveying, to construction, to training and management, China sent about 50,000 personnel from 1965 to 1976, including 30,000 to 40,000 workers.[41] An estimated 60,000 Africans participated in the railway's construction.[41] At the height of construction in 1972, there were 13,500 Chinese and 38,000 African workers on the project.[42], 208360=Rovos Rail of South Africa operates the Pride of Africa, a luxury train, that runs periodic tours from Cape Town to Dar es Salaam via the TAZARA.[13] Commuter train service on the TAZARA between Dar es Salaam and its suburbs commenced in 2012., 241485=In the 1990s, the economic performance of the railway began to decline with changes to the broader economic and political environment. With the independence of Namibia in 1990 and the end to apartheid in South Africa in 1994, southern African regimes were no longer dominated by unfriendly white leaders and Zambian copper had more economic outlets to the south and east. Road transport provided competition in the form of the Trans–Caprivi Highway and the Walvis Bay Corridor to Namibia. The completion of the U.S.-sponsored Tan-Zam Highway brought direct roadway competition along route. Traffic fell from 1.2 million tons in 1990 to 630,000 tons in 2003 to 533,000 tons in 2011[53] and 480,000 tons in 2013.[54], 237604=The initial diesel hydraulic locomotives sent by the Chinese were insufficiently powerful to haul heavy loads up the steep escarpment between Mlimba and Makambako.[27] When the Chinese rolling stock broke down, there was limited local capacity to for repair.[27] By 1978, 19 to 27 of the locomotives were out of operation for repair and so were half of the rail cars.[49] Employee theft was serious enough that 20 Zambian crew members were fired in 1978 for stealing and drivers were brought back from China for a return run, and hundreds of other Chinese advisers had their stay extended.[49] These problems resulted in much lengthier than planned turnaround times for freight and in 1978 Zambia had to break ranks and reopen links with Rhodesia for its copper exports.[50], 246691=Service on the TAZARA continued to deteriorate. In 2008, the railway's condition was described as being \"on the verge of collapse due to financial crisis,\" and dangerous track conditions were discovered by Chinese technicians inspecting the line.[55] At the beginning of 2010, the Chinese government gave TAZARA a US$39 million interest-free loan to revive its operations.[56][57] However, TAZARA management estimated that it would require US$770 million to become commercially viable.[58] The company's cash flow difficulties have led to delays in paying salaries, resulting in frequent strikes by the workforce.[59] In 2011, China wrote off about half of the debts it was owed by the TAZARA,[11] and in October 2012, gave $42 million for four new main locomotives, two shunting locomotives, other equipment, spare parts and staff training.[60] At the time, the TAZARA had only 10 main line locomotives.[60], 218475=In 1961, Tanganyika became independent, under the leadership of Julius Nyerere and in 1964 joined with Zanzibar to form the United Republic of Tanzania. Also in 1964, Northern Rhodesia was granted independence as Zambia, under the leadership of Kenneth Kaunda. Both Nyerere and Kaunda were charismatic socialist African leaders who supported the self-determination of their African neighbors.[1], 240645=Passenger traffic on the railway rose from below 500,000 in the early 1980s to 988,000 in 1990.[27] Local goods accounted for nearly half of the cargo shipped on the line between 1985 and 1988.[27], 226905=The West reacted to Chinese backing for the project with both alarm and derision. Critics questioned construction quality and competence of the Chinese, calling the TAZARA, the \"bamboo railway.\"[27] The Wall Street Journal stated in 1967, \"the prospects of hundreds and perhaps thousands of Red Guards descending upon an already troubled Africa is a chilling one for the West.\"[39] The United States funded the Tan-Zam Highway, which was built from 1968 to 1973, to compete with the railway.[40], 238991=In 1983, the Tanzania and Zambia invited the Chinese back to help manage the railway.[51] About 250 Chinese managers were assigned to railway bureaus along route.[51] They brought operational profitability to the railway and paid for their expenses through revenues.[51] Cargo reached 985,000 tons, but the Chinese had to issue additional zero-interest loans to pay for spare parts and rehabilitation., 206460=As of March 2015, two passenger trains per week traverse the entire TAZARA in each direction, departures are on Tuesdays and Fridays in each direction. The Friday train makes all possible stops, and the Tuesday services makes less stops.[8] The entire journey, as scheduled, takes 36 hours, though delays can extend the trip to as long as 50 hours or more.[8][10] Trains on the TAZARA are slower than overland bus service but cheaper and safer.[8][11] In recent years, the TAZARA trains have attracted foreign tourists wishing to see the landscape and wildlife along route.[8] For a period of 2 months, the Zambian train terminated at the border, and passengers needed to change to the Tanzanian train to continue their journey (and v.v) however it was then decided that the Zambian and the Tanzanian train would travel straight through with no need to change trains at the border. It is advisable to have a Zambian visa in advance, if required. Reservations open a month in advance and can only be obtained in Zambia for journeys from Zambia, and in Tanzania for journeys originating in Tanzania.[12], 249778=The railway is described as an economic \"lifeline\" for Zambia and the government in Lusaka has remained committed to its revitalization.[11] In April 2013, Zambia’s second largest copper miner, Konkola Copper Mines, agreed to re-commence shipping copper on the TAZARA after a five-year hiatus.[61] By November 2013, the line was reported shipping 15,000 tons of copper weekly, but still prone to breakdowns and delays.[61] Zambia’s copper output was expected to increase from 850,000 tons in 2013 to 1.5 million tons in 2015.[61] In addition to carrying copper, manganese, cobalt and other minerals for export, the TAZARA also transports Asian imports and fertilizer to Zambia, Congo DR, Malawi, Burundi, and Rwanda.[11], 226059=South Rhodesia’s declaration of independence changed Kaunda’s outlook change.[36] He accepted the Chinese offer while visiting China in January 1967.[37] On September 6, 1967, an agreement was signed in Beijing by the three nations. China committed itself to building a railway between Tanzania and Zambia, supplying an interest-free loan of RMB988 million (approx. US$500 million) to be repaid over 30 years.[10][38], 220258=Nyerere and Kaunda initially pursued different avenues for the construction of an alternative rail route. Nyerere, after a visit to Beijing, accepted a team of Chinese surveyors, who produced a short report in October 1966. Kaunda was initially more skeptical of Communist involvement and pursued Western backing. The resulting Canadian-British aerial survey produced a favourable report in July 1966, but Western funding was not forthcoming.[26] All told, Britain, Japan, West Germany, World Bank, the United States and United Nations all declined to fund the project.[1][27] The USSR was similarly uninterested.[27], 236097=Within the first years of operation, serious problems arose with maintenance and employees. In their haste to complete the railway ahead of schedule, the Chinese did not train sufficient African technicians to take over management of the railway.[27] Landslides and washouts frequently disrupted service, especially during the rainy season of 1979.[27], 248492=In September 2013, the TAZARA was reporting monthly losses of about $1 million on $1.53 million in monthly revenue against $2.5 million in average monthly expenditures.[11], 257100=The TAZARA remains an enduring symbol of the solidarity of the developing world and Chinese support for African independence and development. When Beijing hosted the 2008 Summer Olympic Games, the starting point of the torch relay in Tanzania was the grand terminal of the TAZARA.[64], 223700=Trade Minister Abdulrahman Mohamed Babu, who first visited China in 1959, and other ministers from Zanzibar were instrumental in lobbying Chinese leaders for support and then persuading Nyerere to accept the assistance.[31] At the 1965 Commonwealth prime minister's conference, British prime minister Harold Wilson was so struck by Tanzania's pro-China attitude that he felt many of Nyerere's ministers were \"directly in the Chinese pay.\" [32] Canadian prime minister Lester Pearson also questioned whether Nyerere should get so close to the Chinese.[33] Nyerere later complained that Western nations opposed the Chinese plans for the railway, but did not offer him any alternative.[34], 209339=The TAZARA has a track gauge of 3 ft 6 in (1,067 mm), also known as the Cape Gauge, which is used throughout southern Africa.[14] The railways of Zambia, Zimbabwe, South Africa, Botswana, Mozambique, Angola, Malawi, Namibia and the Congo primarily use the Cape Gauge. There is no break of gauge at Kapiri Mposhi. The remainder of Tanzania’s railways have 1,000 mm (3 ft 3 3⁄8 in) metre gauge tracks.[15] A transshipment station with a break of gauge station was built in Kidatu in 1998.[15], 233789=The project pressed forward despite the enormous political upheaval and economic dislocation in China caused by the Cultural Revolution, during which most domestic railway building projects were halted or delayed as vast numbers of government officials were purged. President Liu Shaoqi, who made the initial offer to President Nyerere in 1965, was removed from power in 1966, publicly vilified and died in 1969. In Tanzania, Abdulrahman Mohamed Babu, who had persuaded the Chinese to back the TAZARA, was sentenced to death in 1972 for allegedly plotting to overthrow the Zanzibar government. He was pardoned by Nyerere in 1978., 221801=In February 1965, when Nyerere visited Beijing, he was initially hesitant to raise the issue of the railway out of concern that China was also a poor country. President Liu Shaoqi offered to assist Tanzania and Zambia in building a railway between the two countries.[10][28] Chairman Mao Zedong told Nyerere, “You have difficulties as do we, but our difficulties are different. To help you build the railway, we are willing to forsake building railways for ourselves.”[10] Chinese leaders assured Nyerere that the full ownership of the railway would be handed to Tanzania and Zambia upon completion along with the technology and equipment for operations.[28], 251405=In March 2014, Tanzanian, Zambian and Chinese officials held talks to recapitalize the TARZARA and to split the management into two companies, one in each of Tanzania and Zambia.[54]}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "Locomotives[edit] Equipment[edit] There are 22 tunnels in the Udzungwa Mountains, which limit the loading gauge. Semaphore signalling. High-manganese steel rail weighing 45 kg/m (90 lb/yard), mostly jointed.[19] Pre-stressed concrete ties on the main line, with wood ties used at turnouts and on bridges.[18] 20 tonne axle loadings.[18] Air/vacuum brakes.[18] American-style Janney (AAR) coupling.[17] Except for the rail gauge, TAZARA generally reflects Chinese railway standards of the 1970s. TAZARA has a design capacity of 5 million tons per year.[16] The TAZARA has a track gauge of 3 ft 6 in (1,067 mm), also known as the Cape Gauge, which is used throughout southern Africa.[14] The railways of Zambia, Zimbabwe, South Africa, Botswana, Mozambique, Angola, Malawi, Namibia and the Congo primarily use the Cape Gauge. There is no break of gauge at Kapiri Mposhi. The remainder of Tanzania’s railways have",
    "textAfterTable": "History[edit] Origins of the project[edit] In the late 19th century, a railway from British Rhodesia to Tanganyika (then German East Africa) to carry copper ore was originally envisioned by Cecil Rhodes.[1] After World War I, Tanganyika was handed over to the United Kingdom for administration as a League of Nations Mandate, and British colonial authorities again explored the idea.[1] Following World War II, interest in railway construction revived.[1] A map from April 1949 in the Railway Gazette showed a line from Dar es Salaam to Kapiri Mposhi, not far from the route that would eventually be taken by the Chinese railway.[23] A report in 1952 by Sir Alexander Gibb & Partners concluded that the Northern Rhodesia-Tanganyika railway would not be economically justified, due to the low level of agricultural development and the fact that existing railways through Mozambique and Angola were adequate for carrying copper exports.[24] A World Bank report in 1964 also concluded that the line was uneconomical, suggesting that a road should be built instead. In 1961, Tanganyika",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}