{
    "relation": [
        [
            "First Name",
            "Paul",
            "Martha"
        ],
        [
            "Last Name",
            "Marchand",
            "Ford"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "N/A",
            "N/A"
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=FEB110F3-79DC-4826-9A2E-C95D2A07DC01&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00171-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 231264423,
    "recordOffset": 231250501,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{25292=P.L. 108-171, Deficit Reduction Act of 2005, implementation of provisions dealing with Medicaid, TANF, other human services. Funding for Lifespan Respite Care Act, provisions that address respite care services for family caregivers of individuals with special needs. Increase Federal Medical Assistance Percentage (FMAP). Health Care Reform, including long term services and supports, and the Community Living Assistance Services and Supports (CLASS Act). S. 700 and H.R. 1708, End the Medicare Disabilities Waiting Period Act. H.R. 868, Direct Support Professional Fairness and Security Act. H.R. 2390, Guidance, Understanding, and Information for Dual-Eligibles (GUIDE) Act of 2009. H.R. 3200, America's Affordable Health Choices Act of 2009. S. 1679, Affordable Health Choices Act. Senate Finance Committee bill: America's Healthy Future Act of 2009 (no number yet). S. 1213, Patient-Centered Outcomes Research Act of 2009. Patient Protection and Affordable Care Act, P.L. 111-148. H.R. 3962, Affordable Health Care for America Act. Health Care and Education Affordability Reconciliation Act, P.L. 111-152., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 43586=S. 493 and H.R. 1205, Achieving a Better Life Experience Act of 2009., 36053=S. 683 and H.R. 1670, Community Choice Act, provisions providing independence for individuals with disabilities, and the Community First Choice Option proposal for Medicaid. P.L. 109-171, implementation of the Deficit ReductionAct, provisions dealing with Medicaid. H.R. 868, Direct Support Professionals Fairness and Security Act. Implementation of Medicaid Section 1917 (d) regarding trusts and transfer of asset rules. The Empowered at Home Act of 2009, H.R. 2688 and S. 434, to amend the Medicaid Section 1915 (i) Home and Community Based Services Option. Implementation of the Olmstead decision regarding community integration. Health Care Reform, including numerous long term services and supports provisions. Federal Medical Assistance Percentage (FMAP increase. S. 493 and H.R. 1205, Achieving a Better Life Experience Act of 2009. Home and Community Based Services Waiver (Section 1915(c)) and Option (Section 1915 (i))., 29870=FY 2011 HUD appropriations for Section 811 Supportive Housing for Persons with Disabilities Program, Section 8 Housing Choice Vouchers--Omnibus Budget Appropriations, H.R. 3288. H.R. 1675 and S. 1481, Frank Melville Supportive Housing Investment Act of 2009. Implementation of Department of Homeland Security Appropriations, provisions dealing with the needs of persons with disabilities. Transportation/HUD appropriations bill, provisions dealing with housing for persons with disabilities. H.R. 3288, Transportation, HUD FY 2010 approprations bill and the companion Senate bill (no number yet). S. 1482, Frank Melville Supportive Housing Act., 16535=P.L. 108-446, Individuals with Disabilities Education Act Implementation. Deceptive Practices and Voter Intimidation Protection Act, all provisions dealing with voter protections. U.N. Convention on the Rights of People with Disabilities. Enforcement activities of DOJ regarding CRIPA, ADA, Section 504, Olmstead decision, aversives and restraints, civil rights policy regarding people with disabilities. Seclusion and restraints legislation. Mental retardation terminology legislation, S. 2781., 12255=L-HHS-ED Appropriations for FY 2011, all provisions dealing with education (IDEA), NCLB, human services and employment for persons with disabilities and Social Security Administration Limitation on Administrative Expenses (LAE), American Recovery and Reinvestment Act SSA's Limitation on Administrative Expenses budget proposal, provisions dealing with having enough SSA staff support for beneficiaries. American Recovery and Reinvestment Act - The Medicaid relief for states in economic stimulus and Social Security provisions. Stop Over Spending Act, provisions dealing with a proposed new budget process and control of Federal spending. FY 2011 HUD Appropriations (no bill number yet).}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20036 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  PAUL MARCHAND  2027832229  marchand@thearc.org 5. Senate ID#  4174-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}