{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The security force at the school is remarkable. They patrol the premises and are accessible and have a presence on the campus. They are also kind and helpful.",
            "There are all types of clubs from Honor Society to travel. Many of the clubs post their information on the cork boards all over the school",
            "SJRSC is great for all ages. I am an older person going back to school and the entire experience is user friendly. I recommend the college to high school graduates as well because the curriculum is so flexible. You can have some classes in the classroom, some online, and if you move away you can still continue with distance learning.",
            "I chose SJRSC for two reasons, the radiology department is excellent with state of the art equipment, and it offers the most reasonable tuition. I researched private schools as well as public and this school is half the cost of private institutions.",
            "There is always something going on in St. Augustine. There are 5k's almost every month, beach volleyball, paddle tennis, public tennis courts, kayaking, canoeing, windsurfing, surfing, too many to count! Plus there is the Amphitheater that has great concerts on a monthly basis.",
            "There are great restaurants in the area. St. Augustine is known for fabulous restaurants and dining experiences.",
            "Just like anything in life, it is as challenging as we want it to be. I find the courses challenging and motivating. Just be there and learning will happen. But you definitely have to do the homework!",
            "School is what you make of it. Get to know your instructors and ask for help if you need it. Keep an open mind so they can fill it with new thoughts and ideas!",
            "SJRSC is the place to get higher education. The faculty and staff set students up to succeed and I am thrilled to be part of this institution. The school has made such an impression on me that I hope to come back here and teach in the next 5 or 6 years"
        ]
    ],
    "pageTitle": "Saint Johns River State College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Saint-Johns-River-State-College/reviews?_escaped_fragment_=/show/67493",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00041-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 918836607,
    "recordOffset": 918803285,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{154082=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/21/2009 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 41 Anthony from Orange Park, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Brittni from orange park, FL 09/16/2009 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 41 Categories Comments Great for these types of students St. Johns River Community College is great for students who enjoy small to normal sized classes, and who want to get an excellent learning experience. Tips for prospective students Some tips that I would give prospective students is to make sure that you check your school email, becuase sometimes teachers will cancel classes and will post that the classes are cancelled to your email; therefore, you will not have to waste gas driving to school only to drive back home because class was cancelled for what ever reason that day. Another tip that I would give prospective students is to make sure that they get a parking decal, so that way they will not be fined. Bang for the buck When it comes to paying for classes, St. Johns River Community College is not as bad as a university. It",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}