{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Coupon Period",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24 (final Coupon Period)"
        ],
        [
            "Start Date",
            "April 2, 2012",
            "July 2, 2012",
            "October 3, 2012",
            "January 3, 2013",
            "April 3, 2013",
            "July 2, 2013",
            "October 3, 2013",
            "January 2, 2014",
            "April 3, 2014",
            "July 2, 2014",
            "October 2, 2014",
            "December 31, 2014",
            "April 1, 2015",
            "July 1, 2015",
            "October 1, 2015",
            "December 31, 2015",
            "April 1, 2016",
            "June 30, 2016",
            "October 3, 2016",
            "January 3, 2017",
            "April 3, 2017",
            "June 30, 2017",
            "October 3, 2017",
            "January 3, 2018"
        ],
        [
            "Coupon Valuation Date*",
            "June 29, 2012",
            "October 2, 2012",
            "January 2, 2013",
            "April 2, 2013",
            "July 1, 2013",
            "October 2, 2013",
            "December 31, 2013",
            "April 2, 2014",
            "July 1, 2014",
            "October 1, 2014",
            "December 30, 2014",
            "March 31, 2015",
            "June 30, 2015",
            "September 30, 2015",
            "December 30, 2015",
            "March 31, 2016",
            "June 29, 2016",
            "September 30, 2016",
            "December 30, 2016",
            "March 31, 2017",
            "June 29, 2017",
            "October 2, 2017",
            "January 2, 2018",
            "April 2, 2018 (Final Valuation Date)"
        ],
        [
            "Coupon Payment Date**",
            "July 5, 2012",
            "October 5, 2012",
            "January 7, 2013",
            "April 5, 2013",
            "July 5, 2013",
            "October 7, 2013",
            "January 6, 2014",
            "April 7, 2014",
            "July 7, 2014",
            "October 6, 2014",
            "January 5, 2015",
            "April 6, 2015",
            "July 6, 2015",
            "October 5, 2015",
            "January 5, 2016",
            "April 5, 2016",
            "July 5, 2016",
            "October 5, 2016",
            "January 5, 2017",
            "April 5, 2017",
            "July 5, 2017",
            "October 5, 2017",
            "January 5, 2018",
            "April 5, 2018 (Maturity Date)"
        ],
        [
            "Scheduled Trading Days***",
            "63",
            "65",
            "63",
            "61",
            "63",
            "65",
            "62",
            "63",
            "62",
            "64",
            "62",
            "62",
            "63",
            "64",
            "63",
            "62",
            "63",
            "65",
            "63",
            "62",
            "62",
            "65",
            "63",
            "61"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/83246/000114420412017822/0001144204-12-017822.txt",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00104-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 718836335,
    "recordOffset": 718345968,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{84140=You should read this document together with the prospectus dated March 22, 2012, the prospectus supplement dated March 22, 2012 and the Equity Index Underlying Supplement dated March 22, 2012. If the terms of the securities offered hereby are inconsistent with those described in the accompanying prospectus supplement, prospectus or underlying supplement, the terms described in this free writing prospectus shall control. You should carefully consider, among other things, the matters set forth in “Risk Factors” beginning on page FWP-8 of this free writing prospectus, page S-3 of the prospectus supplement and page S-1 of the Equity Index Underlying Supplement, as the securities involve risks not associated with conventional debt securities. We urge you to consult your investment, legal, tax, accounting and other advisors before you invest in the securities. As used herein, references to the “Issuer”, “HSBC”, “we”, “us” and “our” are to HSBC USA Inc., 2525=Prospectus Supplement dated March 22, 2012 and, 2728=Equity Index Underlying Supplement dated March 22, 2012), 179602=March 28, 2012, 1981=March 28, 2012, 159404=The following graph sets forth the historical performance of the SBR based on the daily historical closing levels from March 27, 2007 through March 27, 2012. The closing level for the SBR on March 27, 2012 was 2,564.23. We obtained the closing levels below from Bloomberg Professional® service. We make no representation or warranty as to the accuracy or completeness of the information obtained from Bloomberg Professional® service., 25635=If the Reference Return is below the Buffer Level, the securities provide 1:1 exposure to the decline in the Reference Asset beyond -30%. If you lose some or a substantial portion of your initial investment, even with any Coupon payments, your yield on an investment in the securities may be negative., 31609=The graph above illustrates the daily 5-yr performance of the Reference Asset through March 27, 2012. The closing levels in the graph above were obtained from Bloomberg Professional® Service. Past performance is not necessarily an indication of future results. For further information on the Reference Asset please see “The S&P BRIC 40 Index” on page FWP-12 and in the accompanying Equity Index Underlying Supplement. We have derived all disclosure regarding the Reference Asset from publicly available information. Neither HSBC USA Inc. or any of its affiliates assumes any responsibilities for the adequacy or accuracy of information about the Reference Asset., 171871=In Notice 2008-2, the Internal Revenue Service (“IRS”) and the Treasury Department requested comments as to whether the purchaser of an exchange traded note or pre-paid forward contract (which may include the securities) should be required to accrue income during its term under a mark-to-market, accrual or other methodology, whether income and gain on such a note or contract should be ordinary or capital, and whether foreign holders should be subject to withholding tax on any deemed income accrual. Accordingly, it is possible that regulations or other guidance could provide that a U.S. holder (as defined in the prospectus supplement) of a security is required to accrue income in respect of the securities prior to the receipt of payments with respect to the securities or their earlier sale. Moreover, it is possible that any such regulations or other guidance could treat all income and gain of a U.S. holder in respect of the securities as ordinary income (including gain on a sale). Finally, it is possible that a non-U.S. holder of the securities could be subject to U.S. withholding tax in respect of the securities. It is unclear whether any regulations or other guidance would apply to the securities (possibly on a retroactive basis). Prospective investors are urged to consult with their tax advisors regarding Notice 2008-2 and the possible effect to them of the issuance of regulations or other guidance that affects the U.S. federal income tax treatment of the securities., 2332=(To Prospectus dated March 22, 2012,}",
    "lastModified": "Thu, 29 Mar 2012 10:02:44 GMT",
    "textBeforeTable": "  Investment in the securities involves certain risks. You should refer to “Risk Factors” beginning on page FWP-8 of this document, page S-3 of the accompanying prospectus supplement and page S-1 of the accompanying Equity Index Underlying Supplement.   Neither the U.S. Securities and Exchange Commission ( the “SEC”) nor any state securities commission has approved or disapproved of the securities or passed upon the accuracy or the adequacy of this document, the accompanying underlying supplement, prospectus or prospectus supplement. Any representation to the contrary is a criminal offense. We have appointed HSBC Securities (USA) Inc., an affiliate of ours, as the agent for the sale of the securities. HSBC Securities (USA) Inc. will purchase the securities from us for distribution to other registered broker-dealers or will offer the securities directly to investors. In addition, HSBC Securities (USA) Inc. or another of its affiliates or agents may use the pricing supplement to which this free writing prospectus relates in market-making transactions in any securities after their initial sale. Unless we or our agent informs you otherwise in the confirmation of sale, the pricing supplement to which this free writing prospectus relates is being used in a market-making transaction. See “Supplemental Plan of",
    "textAfterTable": "FWP- 2   Payoff Example    The table at right shows the hypothetical payout profile of an investment in the securities reflecting the Buffer Level of -30%.   Your total payment on the securities will depend on how frequently the Accrual Provision is satisfied. You will receive your quarterly Coupons on each Coupon Payment Date. If you lose some or a substantial portion of your initial investment, even with any Coupon payments, your yield on an investment in the securities may be negative.  ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}