{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN"
        ],
        [
            "regulations.gov",
            "2013-07509",
            ""
        ]
    ],
    "pageTitle": "26 CFR 31.3402(f)(1)-1 - Withholding exemptions. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/26/31.3402(f)(1)-1?quicktabs_7=0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00298-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 933321743,
    "recordOffset": 933302946,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22127=This document contains corrections to final regulations (TD 9662) that were published in the Federal Register on Monday, March 31, 2014 (79 FR 17860) relating to section 3504 of the Internal Revenue Code (Code) providing circumstances under which a person (payor) is designated to perform the acts required of an employer and is liable for employment taxes with respect to wages or compensation paid by the payor to individuals performing services for the payor's client pursuant to a service agreement between the payor and the client., 37451=This document contains corrections to final regulations (TD 9645) that were published in the Federal Register on Friday, November 29, 2013. The final regulations are relating to Additional Hospital Insurance Tax on income above threshold amounts, as added by the Affordable Care Act., 3050=This document contains final regulations that will remove regulations relating to information reporting and backup withholding for the Qualified Payment Card Agent (QPCA) Program. This document also amends regulations to remove references to the QPCA Program. Enactment of the payment card and third party network reporting requirements in the Housing Assistance Tax Act of 2008 made the QPCA Program obsolete. Because no payors have applied to be designated as a QPCA (and no payors have been designated as a QPCA), no taxpayers will be affected by these final regulations., 41769=This document contains corrections to final regulations (TD 9649) that were published in the Federal Register on Thursday, December 12, 2013 (78 FR 75471). The final regulations are relating to agents authorized by the secretary under section 3504 of the Internal Revenue Code to perform acts required of employers who are home care service recipients., 73325=98 Stat. 1052, 71013=§ 1441 - Withholding of tax on nonresident aliens, 12532=This document contains corrections to final and temporary regulations (TD 9658), which were published in the Federal Register on Thursday, March 6, 2014 (79 FR 12726). The regulations relate to the withholding of tax on certain U.S. source income paid to foreign persons, information reporting and backup withholding with respect to payments made to certain U.S. persons, and portfolio interest paid to nonresident alien individuals and foreign corporations., 46226=This document contains final regulations relating to agents authorized by the Secretary under section 3504 of the Internal Revenue Code to perform acts required of employers who are home care service recipients. The final regulations affect employers and their designated agents who pay wages for home care services, which are subject to taxes under the Federal Unemployment Tax Act. The final regulations also modify the existing regulations under section 3504 to be consistent with the organizational structure of the Internal Revenue Service (IRS), and to update the citation to the Internal Revenue Code of 1986.}",
    "lastModified": "Mon, 29 Jun 2015 23:57:29 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 79 FR 63811 - Removal of the Qualified Payment Card Agent Program 2014-10-27; vol. 79 # 207 - Monday, October 27, 2014 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 26. Title 26 published on . [T.D. 6516, 25 FR 13032, Dec. 20, 1960, as amended by T.D. 6654, 28 FR 5252, May 28, 1963; T.D. 7065, 35 FR 16539, Oct. 23, 1970; T.D. 7114, 36 FR 9020, May 18, 1971; T.D. 7115, 36 FR 9234, May 21, 1971; T.D. 7670, 45 FR 6932, Jan. 31, 1980; T.D. 7915, 48 FR 44073, Sept. 27, 1983; T.D. 8164, 52 FR 45633, Dec. 1, 1987] These restrictions do not apply if the combined wages of the employee and the spouse (if any) from other than one employer is less than the amount specified in",
    "textAfterTable": "TD 9699 DEPARTMENT OF THE TREASURY, Internal Revenue Service Final regulations. These regulations are effective October 27, 2014. 26 CFR Parts 31 and 301 Summary This document contains final regulations that will remove regulations relating to information reporting and backup withholding for the Qualified Payment Card Agent (QPCA) Program. This document also amends regulations to remove references to the QPCA Program. Enactment of the payment card and third party network reporting requirements in the Housing Assistance Tax Act of 2008 made the QPCA Program obsolete. Because no payors have applied to be designated as a QPCA (and no payors have been designated as a QPCA), no taxpayers will be affected by these final regulations. 2014-09-16; vol. 79 # 179 - Tuesday, September 16, 2014 79 FR 55362 - Authority for Voluntary Withholding on Other Payments GPO FDSys XML | Text Additional",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}