{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "RxCUI",
            "616852",
            "616852",
            "616853",
            "616853",
            "702055",
            "702055",
            "702055",
            "702169",
            "702169",
            "702169"
        ],
        [
            "RxNorm NAME",
            "fenofibrate 150 MG Oral Capsule",
            "Fenofibrate 150 MG Oral Capsule",
            "fenofibrate 50 MG Oral Capsule",
            "Fenofibrate 50 MG Oral Capsule",
            "Lipofen 150 MG Oral Capsule",
            "Fenofibrate 150 MG Oral Capsule [Lipofen]",
            "Lipofen 150 MG Oral Capsule",
            "Lipofen 50 MG Oral Capsule",
            "Fenofibrate 50 MG Oral Capsule [Lipofen]",
            "Lipofen 50 MG Oral Capsule"
        ],
        [
            "RxTTY",
            "PSN",
            "SCD",
            "PSN",
            "SCD",
            "PSN",
            "SBD",
            "SY",
            "PSN",
            "SBD",
            "SY"
        ]
    ],
    "pageTitle": "DailyMed - LIPOFEN- fenofibrate capsule",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?id=87095&dictionary=on",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00232-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 59804163,
    "recordOffset": 59762315,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{87747=The Fenofibrate Intervention and Event Lowering in Diabetes (FIELD) study was a 5-year randomized, placebo-controlled study of 9795 patients with type 2 diabetes mellitus treated with fenofibrate. Fenofibrate demonstrated a non-significant 11% relative reduction in the primary outcome of coronary heart disease events (hazard ratio [HR] 0.89, 95% CI 0.75-1.05, p=0.16) and a significant 11% reduction in the secondary outcome of total cardiovascular disease events (HR 0.89 [0.80-0.99], p=0.04). There was a non-significant 11% (HR 1.11 [0.95, 1.29], p=0.18) and 19% (HR 1.19 [0.90, 1.57], p=0.22) increase in total and coronary heart disease mortality, respectively, with fenofibrate as compared to placebo.1, 103260=Revised: 1/2013, 20841=The effects of fenofibrate on serum triglycerides were studied in two randomized, double-blind, placebo-controlled clinical trials of 147 hypertriglyceridemic patients. Patients were treated for eight weeks under protocols that differed only in that one entered patients with baseline TG levels of 500 to 1500 mg/dL, and the other TG levels of 350 to 500 mg/dL. In patients with hypertriglyceridemia and normal cholesterolemia with or without hyperchylomicronemia, treatment with fenofibrate at dosages equivalent to 150 mg LIPOFEN per day decreased primarily very low density lipoprotein (VLDL), triglycerides and VLDL cholesterol. Treatment of some with elevated triglycerides often results in an increase of LDL-C (see Table 5)., 105878=To report SUSPECTED ADVERSE REACTIONS, contact Kowa Pharmaceuticals America, Inc. at 1 (877) 334-3464 or FDA at 1-800-FDA-1088 or via the web at www.fda.gov/medwatch/index.html for voluntary reporting of adverse reactions.}",
    "TableContextTimeStampAfterTable": "{29551=https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=9a883573-aa2a-4376-bb0f-3b88246d2169}",
    "textBeforeTable": "Number of versions: 5 LIPOFEN- fenofibrate capsule View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close MANUFACTURE(66869-137, 66869-147) , ANALYSIS(66869-137, 66869-147) , PACK(66869-137, 66869-147) , LABEL(66869-137, 66869-147) 968996160 Galephar Pharmaceutical Research Inc. Business Operations ID/FEI Address Name Establishment MANUFACTURE(66869-137, 66869-147) , ANALYSIS(66869-137, 66869-147) , PACK(66869-137, 66869-147) 003551624 Galephar Pharmaceutical Research Inc. Business Operations ID/FEI Address Name Establishment API",
    "textAfterTable": "616853 fenofibrate 50 MG Oral Capsule PSN 4 616853 Fenofibrate 50 MG Oral Capsule SCD 5 702055 Lipofen 150 MG Oral Capsule PSN 6 702055 Fenofibrate 150 MG Oral Capsule [Lipofen] SBD 7 702055 Lipofen 150 MG Oral Capsule SY 8 702169 Lipofen 50 MG Oral Capsule PSN 9 702169 Fenofibrate 50 MG Oral Capsule [Lipofen] SBD 10 702169 Lipofen 50 MG Oral Capsule SY Get Label RSS Feed for this Drug LIPOFEN- fenofibrate capsule To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=9a883573-aa2a-4376-bb0f-3b88246d2169 To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To view updated drug label links, paste the RSS feed address (URL) shown below into a RSS reader, or use a browser which supports RSS feeds, such as",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}