{
    "relation": [
        [
            "Date",
            "Jul 7, 2000",
            "Oct 15, 2009",
            "Oct 18, 2013"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: SCHNEIDER AUTOMATION INC., MASSACHUSETTS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:DUBE, DENNIS J.W.;TANZMAN, ALLAN;MOONEY, STEPHEN;REEL/FRAME:010928/0188 Effective date: 20000629",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US7032029 - Method and apparatus for an active standby control system on a network - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7032029?dq=6,247,130",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00037-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480894455,
    "recordOffset": 480843392,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26007=This patent application claims priority to U.S. Patent Application No. 09/224,196, filed Dec. 30, 1998, entitled, “Input/Output (I/O) Scanner For A Control System With Peer Determination,” now U.S. Pat. No. 6,327,511, issued Dec. 4, 2001., 36184=The subject matter of the present application is related to the following commonly assigned applications: U.S. patent application Ser. No. 08/927,005 filed on Sep. 10, 1997, entitled “Web Interface To A Programmable Controller;” U.S. patent application Ser. No. 09/224,196 filed Dec. 30, 1998, entitled “Input/Output (I/O) Scanner For A Control System With Peer Determination;” U.S. patent application Ser. No. 09/303,458 filed Apr. 30, 1999, entitled “Web Interface To A Programmable Controller;” U.S. Pat. No. 6,061,603 issued May 9, 2000, entitled “A System For Remotely Accessing An Industrial Control System Over a Commercial Communications Network” (Divisional Application of above cited U.S. patent application Ser. No. 08/927,005);” and U.S. patent application Ser. No. 09/477,113 filed Dec. 31, 1999, entitled “Dual Ethernet Stack For Maximum Speed Access To A PLC.” The contents of these Applications are expressly incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations A portion of the disclosure of this patent document contains material, that includes, but is not limited to, Appendix A and Appendix B, which is subject to copyright protection. The copyright owner has no objection to the facsimile reproduction by anyone of the patent document or the patent disclosure, as it appears in the United States Patent and Trademark Office patent file or records, but otherwise reserves all rights. Appendix B, which is part of the present disclosure, consists of 9 pages and is a source code listing of one embodiment of a main module for the hot-standby task in the present invention, which is described in more detail above. Appendix A, which is part of the present disclosure, consists of 2 pages and is a source code listing of one embodiment of an include file for the hot-standby task in the present invention, which is described in more detail above. Reference to Appendices While specific embodiments have been illustrated and described, numerous modifications come to mind without significantly departing from the spirit of the invention and the scope of protection is only limited by the scope of the accompanying claims. , as one of ordinary skill would understand. This embodiment does not need to use an RTOS 150 for its operation, and thus includes some additional routines for handling. The program of this detailed flow diagram can be loaded",
    "textAfterTable": "Aug 15, 1989 International Business Machines Corp. Operator access to monitoring applications US4897777 Apr 11, 1988 Jan 30, 1990 Square D Company Peer-to-peer register exchange controller for PLCS US4912623 Apr 11, 1988 Mar 27, 1990 Square D Company Multiple processor communications system US4937777 Oct 7, 1987 Jun 26, 1990 Allen-Bradley Company, Inc. Programmable controller with multiple task processors US4949274 May 18, 1988 Aug 14, 1990 Omega Engineering, Inc. Test meters US4953074 Jul 6, 1988 Aug 28, 1990 Hitachi, Ltd. Function-distributed control apparatus US4992926 Oct 17, 1988 Feb 12, 1991 Square D Company Peer-to-peer register exchange controller for industrial programmable controllers US5012402 Dec 16, 1988 Apr 30, 1991 Murata Kikai Kabushiki Kaisha System for modifying a machine's program at a remote location US5023770 Apr 11, 1988 Jun 11, 1991 Square D Company High-speed press control system",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}