{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2012-01-01T00:00:00",
            "2012-01-01T00:00:00",
            "2012-01-01T00:00:00",
            "2012-01-01T00:00:00",
            "2012-01-01T00:00:00",
            "2013-10-01T00:00:00",
            "2013-11-19T00:00:00"
        ],
        [
            "Description",
            "Data acquisition and processing - This lidar dataset was collected and processed by WSI and their survey subcontractor, McClintock Land Associates (October 21-25, 2012). WSI has provided a delivery report which outlines in detail their data acquisition procedures, processing methods, and results of all accuracy assessments. The delivery report is available on the citation page for this publication.",
            "Quality control - WSI submitted the data to the State of Oregon Department of Geology and Mineral Industries (DOGAMI) for independent quality control analysis. After addressing any concerns from DOGAMI, WSI submitted the revised data set to DGGS along with a technical report describing details about the lidar acquisition, accuracy, and quality. DOGAMI also provided a separate report summarizing their methodologies and the results of quality control checks.",
            "Point-cloud data - all returns - classified - Lidar data points were classified (ASPRS standard) through automated point processing algorithms and manual inspection.",
            "Point-cloud data - ground returns - classified - Lidar data points that were classified as \"ground\" were extracted to create the ground point data file.",
            "Lidar intensity images - The lidar intensity values of ground points were symbolized (0-255 grayscale) according to their relative intensity values. The resultant image was exported to a raster format.",
            "The NOAA Coastal Services Center (CSC) received the files in las format. The files contained lidar elevation and intensity measurements. The data were in UTM Zone 6 (NAD83) coordinates and elevations were in meters, referenced to the NAVD88 (Geoid09) vertical datum. CSC performed the following processing for data storage and Digital Coast provisioning purposes: 1. The data were filtered for elevation outliers. 2. The data that were classified as 11, 12, and 13 were reclassified to classes 14, 15, and 16, respectively. The following data classifications are available for download: 1 (Unclassified), 2 (Ground), 3 (Low Vegetation), 4 (Medium Vegetation), 6 (Buildings), 7 (Low Point/Noise), 9 (Water Surface), 10 (Ignored Ground - Ground points within 1 m of breaklines), 14 (Withheld - Points that have intensity values of 0 or 255), 15 (Mobile - Temporary Places Structures (cars, boats, docks, buoys)), 16 (Utilities - Man made non-habitable structures (fences, power lines)) 3. The data were converted from GPS week time to Adjusted GPS time. 4. The data were converted from UTM Zone 6 (NAD83) coordinates to geographic coordinates. 5. The data were converted from NAVD88 (orthometric) heights to GRS80 (ellipsoid) heights using Geoid09. 6. The data were converted to LAZ format.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Components NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/ak2012_whitter_m2580.xml",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/ak2012_whitter_m2580.xml&view=ISO19115Components-HTMLTable&title=Components%20NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/ak2012_whitter_m2580.xml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00270-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 610060437,
    "recordOffset": 610044043,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:ak2012_whitter_m2580Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "1 Lidar Delivery Report 1 Lidar QC Report 2 None 1 North American Datum 1983 2007-01-19 Top CI_Series Count Component Name Issue Identification Page 1 Annual Report AR 2012-C Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 2 Citation URL ftp://csc.noaa.gov/pub/DigitalCoast/lidar1_z/geoid12a/data/2580/supplemental/rdf2013_003_qc_report.pdf 1 Alaska Division of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}