{
    "relation": [
        [
            "Other Data:",
            "Cash flows provided by operating activities",
            "Cash flows used in investing activities",
            "Cash flows used in financing activities"
        ],
        [
            "",
            "$ 96,116",
            "29,263",
            "75,015"
        ],
        [
            "",
            "$ 132,641",
            "16,553",
            "63,036"
        ],
        [
            "",
            "$ 318,821",
            "117,255",
            "259,442"
        ],
        [
            "",
            "$ 322,820",
            "41,480",
            "302,429"
        ]
    ],
    "pageTitle": "Lamar Advertising Company : Announces Fourth Quarter and Year End 2011 Operating Results | 4-Traders",
    "title": "",
    "url": "http://www.4-traders.com/LAMAR-ADVERTISING-CO-4920/news/Lamar-Advertising-Company--Announces-Fourth-Quarter-and-Year-End-2011-Operating-Results-14038682/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00220-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 272055631,
    "recordOffset": 272025428,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{79062=2011 2010 2011 2010, 73016=proceeds to Lamar Media of approximately $489 million., 82831=December 31,, 91857=Adjusted EBITDA include adjustments to 2010 for acquisitions and divestitures for the same time frame as actually owned in 2011., 77027=A conference call will be held to discuss the Company's operating results on Wednesday, February 22, 2012 at 9:00 a.m. central time. Instructions for the conference call and Webcast are provided below:, 74061=For the first quarter of 2012 the Company expects net revenue to be approximately $264 million. On a pro forma basis this represents an increase of approximately 3%., 69397=Baton Rouge, LA - February 22, 2012 - Lamar Advertising Company (Nasdaq: LAMR), a leading owner and operator of outdoor advertising and logo sign displays, announces the Company's operating results for the fourth quarter ended December 31, 2011., 69726=Lamar reported net revenues of $288.2 million for the fourth quarter of 2011 versus $275.7 million for the fourth quarter of 2010, a 4.6% increase. Operating income for the fourth quarter of 2011 was $45.9 million as compared to $32.8 million for the same period in 2010. Lamar recognized $6.4 million in net income for the fourth quarter of 2011 compared to a net loss of $7.1 million for the fourth quarter of 2010. Adjusted EBITDA, (defined as operating income before non-cash compensation, depreciation and amortization and gain on disposition of assets - see reconciliation to net income (loss) at the end of this release) for the fourth quarter of 2011 was $125.8 million versus $115.4 million for the fourth quarter of 2010, a 9.1% increase. Free cash flow (defined as Adjusted EBITDA less interest, net of interest income and amortization of financing costs, current taxes, preferred stock dividends and total capital expenditures - see reconciliation to cash flows provided by operating activities at the end of this release) for the fourth quarter of 2011 was $63.9 million as compared to $59.2 million for the same period in 2010, a 7.9% increase. Pro forma net revenue for the fourth quarter of 2011 increased 4.0% and pro forma Adjusted EBITDA increased 8.5% as compared to the fourth quarter of 2010. Pro forma net revenue and Adjusted EBITDA include adjustments to the 2010 period for acquisitions and divestitures for the same time frame as actually owned in the 2011 period. Tables that reconcile reported results to pro forma results and operating income to outdoor operating income are included at the end of this release., 79006=December 31, December 31,, 72743=Notes Offering. On February 9, 2012, Lamar's wholly owned subsidiary, Lamar Media Corp., closed a private placement of $500 million in aggregate principal amount of 5 7/8% Senior Subordinated Notes due 2022, which resulted in net, 82992=2010, 72421=As of December 31, 2011, Lamar had $274.1 million in total liquidity that consists of $240.6 million available for borrowing under its revolving senior credit facility and approximately $33.5 million in cash and cash equivalents., 82874=2011, 92215=2011 2010, 78339=Lamar Advertising Company is a leading outdoor advertising company currently operating over 150 outdoor advertising companies in 44 states, Canada and Puerto Rico, logo businesses in 22 states and the province of Ontario, Canada and approximately 60 transit advertising franchises in the United States, Canada and Puerto Rico., 71480=Lamar reported net revenues of $1,133.5 million for the twelve months ended December 31, 2011 versus $1,092.3 million for the same period in 2010, a 3.8% increase. Operating income for the twelve months ended December 31, 2011 was $186.4 million as compared to $139.5 million for the same period in 2010. Adjusted EBITDA for the twelve months ended December 31, 2011 was $487.1 million versus $465.2 million for the same period in 2010. There was net income of $8.6 million for the twelve months ended December 31, 2011 as compared to a net loss of $40.1 million for the same period in 2010. Free Cash Flow for the twelve months ended December 31, 2011 decreased 10.6% to $224.8 million as compared to $251.5 million for the same period in 2010, primarily due to the increase in capital expenditures of $63.6 million over the comparable period in 2010., 90665=2011 2010 % Change, 74314=This press release contains forward-looking statements, including the statements regarding guidance for the first quarter of 2012. These statements are subject to risks and uncertainties that could cause actual results to differ materially from those projected in these forward-looking statements. These risks and uncertainties include, among others; (1) our significant indebtedness; (2) the state of the economy and financial markets generally and the effect of the broader economy on the demand for advertising; (3) the continued popularity of outdoor advertising as an advertising medium; (4) our need for and ability to obtain additional funding for operations, debt refinancing or acquisitions; (5) the regulation of the outdoor advertising industry; (6) the integration of companies that we acquire and our ability to recognize cost savings or operating efficiencies as a result of these acquisitions; (7) the market for our Class A common stock and (8) other factors described in our filings with the Securities and Exchange Commission, including the risk factors in item 1A of our 2011 Annual Report on Form 10-K, as supplemented by any risk factors contained in our Quarterly Reports on Form 10-Q. We caution investors not to place undue reliance on the forward-looking statements contained in this document. These statements speak only as of the date of this document, and we undertake no obligation to update or revise the statements, except as may be required by law., 78055=Company Contact: Keith A. Istre Chief Financial Officer (225) 926-1000 KI@lamar.com, 77529=Available through Monday, February 27, 2012 at 11:59 p.m. eastern time, 73101=Tender Offer. Also, on February 9, 2012, Lamar Media announced the results of the early settlement of its tender offer to purchase, for cash, up to $700 million of its outstanding 6 5/8% Senior Subordinated Notes due 2015, 6 5/8% Senior Subordinated Notes due 2015-Series B and 6 5/8% Senior Subordinated Notes due 2015-Series C (collectively, the \"6 5/8% Notes\"). As of February 8, 2012, the early settlement date of the tender offer, Lamar Media received tenders in respect of $582.9 million aggregate principal amount of 6 5/8% Notes, $483.7 million of which were accepted for purchase on February 9, 2012 by Lamar Media for a total cash payment (including accrued and unpaid interest up to but excluding February 9, 2012) of $511.6 million. The tender offer will expire at midnight, New York City time, on February 24, 2012, unless extended or earlier terminated.}",
    "textBeforeTable": "2011 2010 2011 2010 December 31, December 31, Three months ended Twelve months ended 818,523 2,409,140 3,648,961 155,829 $ 91,679 838,998 2,158,528 3,427,353 95,281 $ 33,503 Total debt (including current maturities) Total stockholders' equity Total assets Working capital Cash and cash equivalents 2010 December 31, $ 251,467 2011 December 31, 224,752 Selected Balance Sheet Data: (1)See the capital expenditures detail included below for a breakdown by category. Free cash flow $ 63,906 $ 59,208 $ ) ( 43,452 ) ) ( 107,070 15,740 23,888 ) ( Total capital expenditures (1) ( 365 ) 1,119 ) 168,747 ) 465,150 365 ) ( 2,921 ) ( 152,007 ) ( 487,115 $ 92 ) ( 150 ) ( 40,194 ) ( 115,384 $ ( 1,072 ) ( ( 92 ) ( $ 125,839 $ ( 36,881 ) ( Preferred stock dividends Current tax expense Adjusted EBITDA Interest, net Free Cash Flow Computation: OTHER DATA",
    "textAfterTable": "Reconciliation of Free Cash Flow to Cash Flows Provided by Operating Activities: Cash flows provided by operating activities $ 96,116 $ 132,641 $ 318,821 $ 322,820 Changes in operating assets and liabilities ( 5,185 ) ( 54,222 ) 20,957 ( 18,800 ) Total capital expenditures ( 23,888 ) ( 15,740 ) ( 107,070 ) ( 43,452 ) Preferred stock dividends ( 92 ) ( 92 ) ( 365 ) ( 365 ) Other ( 3,045 ) ( 3,379 ) ( 7,591 ) ( 8,736 ) Free cash flow $ 63,906 $ 59,208 $ 224,752 $ 251,467",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}