{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2009-08-28T00:00:00",
            "2009-09-10T00:00:00",
            "2009-09-24T00:00:00",
            "2009-10-14T00:00:00",
            "2009-10-23T00:00:00",
            "2009-11-17T00:00:00"
        ],
        [
            "Description",
            "All datasets obtained by NGDC were converted to common horizontal and vertical datums of NAD 83 geographic and NAVD 88, respectively, using FME and VDatum transformation tool. They were also converted to common file format, ESRI point shapefiles, for visualization and inspection.",
            "Datasets were visually inspected with ArcGIS for identification and editing of data anomalies. Datasets were then compared with overlapping datasets to ensure data consistency.",
            "Coastline datasets were merged and adjusted to fit satellite imagery.",
            "xyz files of the bathymetric data were surfaced using GMT's 'surface' tool onto a 1 arc-second grid outside Mobile Bay and 1/3 arc-second within the bay that interpolated to fill empty cells. Points extracted every 10 meters along the coastline were also included to ensure that the bathymetric grid reached zero at the coast. The resulting Arc ASCII grid was imported into ArcGIS and clipped to the coastline to remove values over land.",
            "xyz files for each input dataset were gridded using MB-System's 'mbgrid' tool, which utilizes a high-tension spline interpolation method to fill grid cells with no input elevation values. Preferential weighting was given to more recent, higher-accuracy datasets. Gridding was performed in quadrants, each with a 5% data buffer. The grids were imported in ArcGIS and seamlessly merged to create the final DEM.",
            "The NAVD 88 DEM was quantitatively evaluated by comparing with source datasets and with elevation values extracted from NGS geodetic monuments. It was visually evaluated by converting to UTM-zone coordinates (units of meters horizontally and vertically) and then creating a slope grid to identify gridding artifacts in the DEM."
        ]
    ],
    "pageTitle": "Components NOAA/NESDIS/NGDC/MGG/DEM/iso/xml/671.xml",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/DEM/iso/xml/671.xml&view=ISO19115Components-HTMLTable&title=Components%20NOAA/NESDIS/NGDC/MGG/DEM/iso/xml/671.xml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00312-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 607631919,
    "recordOffset": 607620626,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.ngdc.mgg.dem:671Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/DEM View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Citation Identifier 1 Baldwin County topographic lidar 2001-01-01 1 Composite Shoreline and associated data of Alabama State Composite, AL_COMP 2001-01-01 1 Digital Elevation Model Footprints ArcGIS Map Service 2011-02-15 1 Digital Elevation Models of Mobile, Alabama: Procedures, Data Sources, and Analysis 2010-01-01 1 Digital Elevation Models: Color Shaded Relief ArcGIS Image Service 2011-10-19 1 Little Lagoon Side Scan Sonar Surveys 2008-01-01 1 Mobile County topographic lidar 2002-01-01 1 Mobile, Alabama Coastal Digital Elevation Model 2009-12-01 1 NASA/GCMD Data Center Keywords",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}