{
    "relation": [
        [
            "Patent application number",
            "20140260673",
            "20140263758",
            "20150102523",
            "20150144717"
        ],
        [
            "Description",
            "REMOTE FLOW RATE MEASURING - The methods and systems described herein can be used for remote measuring of flow rate from a multitude of different flow meters without requiring each flow meter to be capable of onboard processing and displaying of flow rate information. A single electronic device can be used to remotely measure the flow rate of a multitude of different flow meters.",
            "DRIP EMITTER - A drip emitter is described herein that is advantageously configured to allow large grit to pass through the drip emitter when in use. The drip emitter includes a housing containing a flow path extending between a water inlet and a water outlet, a pressure-reducing segment, such as a torturous path, of the flow path downstream of the inlet and upstream of the outlet, and a dynamic pressure regulator downstream of the water inlet and upstream of the pressure-reducing segment of the flow path. The dynamic pressure regulator is configured such that a decrease in pressure in the pressure-reducing segment of the flow path causes the dynamic pressure regulator to adjust to maintain a generally constant rate of flow through the water inlet as compared to the rate of flow when there is no decrease in pressure in the pressure-reducing segment of the flow path.",
            "CONSECUTIVE PIECEWISE MOLDING SYSTEM AND METHOD - The present invention is directed to a method for additively fabricating a solid object from a series of components. The method utilizes additive fabrication with a programmed computer operating a machine to produce a solid object based on a three dimensional, computerized rendering of the solid object. Each component is produced from one or more molds which are filled with a fluid material that solidifies into a component that attaches to a previously manufactured component by way of the same process.",
            "Conduit With Connector And Assembly Thereof - A fluid supply line is provided to reduce the labor and cost required for dripline system installations by providing predetermined fitting locations where driplines can be attached. The supply line consists of a conduit having a side wall, a connector extending through the side wall of the conduit, the connector having a conduit connecting segment extending outside the conduit and an inlet segment extending into the conduit, and the inlet segment being connected to the side wall of the conduit."
        ],
        [
            "Published",
            "09-18-2014",
            "09-18-2014",
            "04-16-2015",
            "05-28-2015"
        ]
    ],
    "pageTitle": "Turk, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/turk-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00098-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 429137027,
    "recordOffset": 429119607,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Michael F. Turk, Porter Ranch, CA US 02-27-2014 ANTI-BACKLASH GEAR CONTROL DEVICE - An anti-backlash gear control device is disclosed that includes a first bias module operable to generate a first bias to be applied to a first motor operable with a first gear, and a second bias module operable to generate a second bias, opposite the first bias, to be applied to a second motor operable with a second gear. The first gear and the second gear are operably connected to a load gear, such that rotation of at least one of the first gear and the second gear causes the load gear to move. Additionally, a command module can receive a drive command and output at least one of first and second command signals based on the drive command to be summed with the first and second biases, respectively, to generate first and second drive signals to operate the first and second motors to drive the first and second gears, respectively. 20140053672 Published Description Patent application number Michael F. Turk, Waltham, MA US //]]> BarDraw('2510875',['Patent applications by Michael F. Turk, Los Angeles, CA US'],[[1,1,2,2,2,2]],['2006','2009','2010','2011','2012','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2510875\" align=\"center\"></div> </div> <canvas id=\"bg2510875\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Michael F. Turk, Los Angeles, CA US</p> <div class=\"bar2510875\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>07-31-2014</td> <td><a href=\"/patents/app/20140209147\">CONCENTRATING PHOTOVOLTAIC SOLAR PANEL</a> - The",
    "textAfterTable": "Robert L. Turk, Waukegan, IL US Patent application number Description Published 20090148755 BATTERY FOR A POWER TOOL - A battery for use in a power tool, including a battery housing, at least one battery cell in the battery housing, a pivoting member at least partially enclosed within the battery housing which moves between a latched position and an unlatched position, and a biasing device associated with the pivoting member for urging the pivoting member towards the latched position. 06-11-2009 Ryan Christopher Turk, Peachtree City, GA US Patent application number Description Published 20100214877 Event Reminding System - In a method for reminding a patient to take a medication, the medication is labeled with a predefined symbol. A device displays the predefined symbol each time the medication is to be taken by the patient. 08-26-2010 Steve Turk, Conroe, TX US Patent application number Description Published 20120088697 FOAMER/SULFUR SCAVENGER COMPOSITION AND METHODS FOR MAKING AND USING SAME - A new multi-purpose foaming composition having applications in oil field application, industrial applications, waste management applications, or other applications that can be benefited by a foam, is disclosed, where the composition includes a surfactant, a sulfur scavenger and optionally an additive, where the sulfur scavenger and/or additive improve foam characteristics and/or the foam improves an activity of the sulfur scavenger and/or the additives. Method",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}