{
    "relation": [
        [
            "Description",
            "#229: Disbrow Store Alterations H.E. Kirkemo",
            "#220: W.A. Disbrow Store Addition H.E. Kirkemo",
            "#17: Oscar Hemgreen Store Building Ole Bakke"
        ],
        [
            "Dates",
            "1950",
            "1947",
            "1913"
        ]
    ],
    "pageTitle": "Archives West: Gibson, Kirkemo, and Bakke Architectural Drawings, 1890-1971",
    "title": "",
    "url": "http://archiveswest.orbiscascade.org/ark:/80444/xv09237",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00157-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 18516531,
    "recordOffset": 18492645,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5367=Although he officially retired in 1909, Gibson remained involved in the projects of his protégé, Ole Bakke. In the 1910s, while Gibson actively pursued his interest in long-distance automobile touring, Bakke continued the Gibson architectural tradition in Western Montana and Idaho, designing numerous public and private buildings., 5007=In 1920, Bakke hired H. E. Kirkemo as a draftsman. Kirkemo worked with Bakke on important Missoula buildings including the Wilma Theatre and Thornton Hospital. After Bakke retired, Kirkemo continued the architectural firm under his own name. Formally trained, Kirkemo created innovative designs using modern architectural theory and materials. Kirkemo designed hundreds of public and private buildings throughout Western Montana and Idaho. When he retired in the early 1960s, his son James W. Kirkemo took over the business. James Kirkemo, Sheldon Witwer, and Stuart Price are responsible for many of the prominent, modern buildings in Missoula and Western Montana., 1323=The collection was processed for the first time in 1999. Prior to then, the architectural firm had prepared a detailed inventory of the drawings. During and subsequent to processing, a number of unidentified drawings, mostly Gibson’s, were identified by Dr. H. Rafael Chacon of the University of Montana’s Art Department., 6012=Albert John Gibson was born in 1862 in Savannah, Ohio. He moved to Butte, Montana, when he was twenty-one and worked there for five years. In 1888, he arrived in Missoula, Montana, and worked with E.C. Selander as a carpenter. He later formed a partnership with Robert Mentrum and began to study architecture, for which he exhibited a natural genius. Gibson designed St. Patrick's Hospital, Missoula City-County High School, the Missoula County Courthouse, Sacred Heart Academy, most of the early University of Montana buildings, the Greenough Mansion, the Ravalli County Courthouse, and many other buildings in Montana and Idaho., 1428=Gift of Joseph Crabtree, 1998.}",
    "textBeforeTable": "Series XXVI:  Milltown, Montana Return to Top 1940 H.E. Kirkemo #163: Ellinghouse & Laing Service Station Dates Description Series XXV:  Livingston, MontanaReturn to Top undated A.J. Gibson #221: Liberty Theater Remodeling 1927 H.E. Kirkemo #64: Wallace Meat Company Two-Family House Dates Description Series XXIV:  Kellogg, IdahoReturn to Top 1931 H.E. Kirkemo #94: Symes Hotel Addition 1945 H.E. Kirkemo #208: Sanders County Hospital 1932 H.E. Kirkemo #98: Andy Holt Garage 1934 H.E. Kirkemo #112: Hot Springs High School",
    "textAfterTable": "Series XXVII:  Missoula, Montana Return to Top Description Dates Building 167-169 South 2nd, South Side of Main Street undated #231: American Legion Club Post #27 H.E. Kirkemo (KGVO/KMSO Radio and TV), 400 Ryman Avenue 1949 #128: Ole Anderson Residence A.J. Gibson 413 Eddy Street [ca. 1910] #200: Ole Anderson Residence A.J. Gibson undated #110: Four-Flat Buildings A.J. Gibson 317-323 South 3rd Street West, 320-326 and 328 334 South 6th Street East [ca. 1903-1912] #201: Dave Andrews Flat Building (Andrews Apartments) A.J. Gibson 233-239 South 2nd Street West [ca. 1904-1906] #7: David J. Andrews Residence A.J. Gibson 222 South 4th Street West (formerly 210 South 4th Street West) [ca. 1902]",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}