{
    "relation": [
        [
            "Course",
            "MUS 776",
            "MUS 780",
            "MUS 894"
        ],
        [
            "Title",
            "Graduate Piano, Voice, or Instrumental Major (2) (Maximum of 6 units allowed)",
            "Graduate Major Repertoire (2) (Maximum of 6 units allowed)",
            "Creative Work Project"
        ],
        [
            "Units",
            "4",
            "4",
            "3"
        ]
    ],
    "pageTitle": "Music - San Francisco State University Bulletin 2012 - 2013",
    "title": "",
    "url": "http://www.sfsu.edu/~bulletin/previous_bulletins/1213/programs/music.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00152-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 716033659,
    "recordOffset": 716011827,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=site archived June 3, 2013}",
    "TableContextTimeStampAfterTable": "{9362=San Francisco State University has been an accredited institutional member of the National Association of Schools of Music since 1963., 866=Search 2012-2013 SF State Bulletin, 5374=CA 141 Phone: 415-338-1431 Website: musicdance.sfsu.edu, 63781=Students should apply by April 1 for the following fall or October 1 for the following spring. Applicants are required to file two applications, one with the University and one with the School of Music and Dance. Admission to conditionally classified status requires acceptance by both the University and the School of Music and Dance. A departmental application form may be obtained by writing to the School of Music and Dance, or by calling (415) 338-1431. University applications may be requested from the graduate admissions office or online at www.sfsu.edu/~gradstdy/.}",
    "textBeforeTable": "Solo Classical Performance Emphasis   Total for major: 30 units Emphasis (listed below): 21 units Total for core: 9 units One graduate seminar in Music History (selected from MUS 750-755): 3 units 3 Advanced Analysis MUS 710 3 Introduction to Graduate Study MUS 700 Units Title Course Core Requirements   Courses are 3 units unless otherwise indicated. On-line course descriptions are available.   All students must complete a 9 unit core requirement and complete an emphasis as designated below. Participation in a large conducted classical ensemble in the area of study is required of all graduate students (orchestral instruments and voice) enrolled in applied lessons. Enrollment is required during the semester of graduation.   This program provides graduate study for the superior performer and allows for maximum development of specialized skills in the candidate's particular area of documented achievement. Students may emphasize classical solo performance, chamber music, or conducting. This degree is particularly appropriate for students intending to perform or conduct music professionally, to teach applied performance in college/university settings or private studio, or to pursue doctoral studies in performance. The program culminates in a formal graduate recital. Master of Music   Total for emphasis: 21 units Foreign Language Competency Examination ",
    "textAfterTable": "Music electives on advisement: 10 units Total for emphasis: 21 units   Chamber Music Emphasis Course Title Units MUS 701 Chamber Music Literature 3 MUS 776 Graduate Piano, Voice, or Instrumental Major (2) (Maximum of 6 units allowed) 4 MUS 780 Graduate Major Repertoire (2) (Maximum of 6 units allowed) 4 Music electives on advisement: 7 units [Must include 1 unit each of MUS 778, Chamber Music Performance; advanced score reading and transposition (MUS 852); and keyboard instruction. Performance ability in another instrument or voice is strongly encouraged.] Total for emphasis: 21 units   Conducting Emphasis Course Title Units MUS 701     or MUS 701 Choral Literature   Symphonic Literature 3 MUS 781     or MUS 782 Choral Conducting (2)   Instrumental Conducting (2) 8 MUS 894 Creative Work",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}