{
    "relation": [
        [
            "Revenue Source",
            "RTÉ Player",
            "iTunes Movies",
            "XBox Movies",
            "YouTube (Ireland)",
            "UPC TVOD (Transaction Video on Demand)"
        ],
        [
            "Analysis",
            "Sample",
            "Sample",
            "Sample",
            "Sample",
            "Sample"
        ],
        [
            "Remarks",
            "The top 400 programmes per quarter are processed. Performances are weighted first by the total number of streams and then by the duration of music within the programmes.",
            "The top 500 movies (with music titles) per quarter are processed. Performances are weighted first by the total number of streams and then by the duration of music within the movies.",
            "The top 100 movies (with music titles) per quarter are processed. Performances are weighted first by the total number of streams and then by the duration of music within the movies.",
            "The top 5000 videos (with music titles) per quarter are processed. Performances are weighted first by the total number of streams and then by the duration of music within the videos.",
            "The top 100 movies (with music titles) per quarter are processed. Performances are weighted first by the total number of streams and then by the duration of music within the movies."
        ],
        [
            "Distribution Frequency",
            "Quarterly. April, July, October & December",
            "Quarterly. April, July, October & December",
            "Quarterly. April, July, October & December",
            "Quarterly. April, July, October & December",
            "Quarterly. April, July, October & December"
        ]
    ],
    "pageTitle": "IMRO » IMRO Distribution Policies",
    "title": "",
    "url": "http://www.imro.ie/music-creators/imro-distribution-policies/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00069-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 520678367,
    "recordOffset": 520656625,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{8429=Distribution Process Policy Board Approved 2014, 103526=Where an IMRO customer pays a TV tariff, the royalties are added pro-rata to all licensed television station pools (including cable re-transmitted channels) and distributed as part of the broadcast distribution in April and October., 104000=Where an IMRO customer pays a combined background tariff e.g. for the use of a CD player and/or a radio and/or a TV, then two-thirds of this revenue will be treated as recorded revenue and distributed on the same basis as ‘Background Music – Shops & Bars’ (see below) while one-third will be added pro-rata to all licensed television and radio station pools (including cable re-transmitted channels) and distributed as part of the broadcast distribution in April, July, October and December., 28270=This split will be reviewed every 5-7 years.  It was last assessed in 2011., 84889=Cinema royalies are distributed by IMRO once a year in July. Based on extensive analysis of music usage within cinemas royalties are split on the following basis, 27809=Television royalties are distributed by IMRO quarterly in April, July, October and December.  Based on analysis of independently commissioned media monitoring data, IMRO policy is to split television royalties in the following manner:, 103777=Where an IMRO customer pays a Radio tariff, the royalties are added pro-rata to all licensed radio station pools and distributed as part of the broadcast distribution in April, July, October and December., 41230=Radio royalties are distributed by IMRO quarterly in April, July, October and December.  Based on analysis of independently commissioned media monitored data, radio royalties are split in the following manner, 41827=This split will be reviewed every 5-7 years. It was last assessed in 2011., 92936=From January 2015, a threshold of €24 will be applied to invoiced live events. This will result in events under this threshold being distributed via the Tours & Residencies Scheme upon submission of qualifying performances via the IMRO website., 96692=From January 2012, members must submit qualifying performances via the IMRO website.  A fixed cost of 10% will be applied to this scheme., 121293=IMRO is committed to forwarding international royalties to its members in the shortest possible time. With 12 payment runs a year (January to December), IMRO is at the forefront internationally of providing the most frequent distribution of overseas royalties to its members.}",
    "textBeforeTable": "This document was approved on the following dates: Approval IMRO Board IMRO Distribution Committee IMRO CEO IMRO Finance Department IMRO Licensing Department IMRO Distribution Department Document Control IMRO Distribution Policies Home Music Creators Contact News AboutCopyright MusicUsers MusicCreators AboutIMRO }); $('#search-3 input[name=s]').search({'url': 'http://www.imro.ie/wp-admin/admin-ajax.php?action=warp_search', 'param': 's', 'msgResultsHeader': 'Search Results', 'msgMoreResults': 'More Results', 'msgNoResults': 'No results found'}).placeholder(); jQuery(function($) { Follow @IMROireland }(document, 'script', 'facebook-jssdk')); fjs.parentNode.insertBefore(js, fjs); js.src = \"//connect.facebook.net/en_GB/all.js#xfbml=1&appId=144392585590924\"; js = d.createElement(s); js.id = id; if (d.getElementById(id)) return; var js, fjs = d.getElementsByTagName(s)[0];",
    "textAfterTable": "20/12/2012 IMRO Board Revised policies increasing distribution frequency for TV, Radio, Live, Background Music and Overseas Payments 20/02/2013 IMRO Board New policies for Spirit FM, Setanta Sports, iTunes Movies, X Box Movies 19/06/2013 IMRO Board Revised Cinema policy and various updates 18/09/2014 IMRO Board New policy for UPC TVOD 26/11/2014 IMRO Board Introduction of threshold for invoiced live events Distribution Process Policy Board Approved 2014   IMRO Distribution Policies   1 Introduction. 5 2 Broadcast Royalties. 7 2.1 Television. 7 National Television – General8 National Television – Advertising. 8 Local/Cable Television. 9 Cable Re-Transmission",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}