{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Prepare for your audition and make sure you know what you want from life. Be prepared to be challenged and only apply if you are certain that your art is truly your life's goal.",
            "It is a bustling environment which pushes young srtist to develop and trhive in what they love. AMDA provides the young artist with a chance to work hard for what they want by supplying the tools for success. The school is located in the heart of Manhattan and empowers you to love what you do."
        ]
    ],
    "pageTitle": "AMDA College and Conservatory of the Performing Arts - New York Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/AMDA-Col-and-Conservatory-of-the-Performing-Arts/reviews?_escaped_fragment_=/show/13837",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00264-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 919855739,
    "recordOffset": 919827354,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{98571=This place has amazing teachers. I was amazed by how many celebrities have gone here. AMDA makes me want to graduate sooner than 2016., 103754=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/20/2009 Reviewer is A current student here. 31 out of 32 people found this review useful. 1 of 25 Simeon from Rock Hill, SC Check out reviews left by other students or leave your own review. You could win a free scholarship. AMDA College and Conservatory of the Performing Arts Reviews AMDA College and Conservatory of the Performing Arts › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Bang for the buck As a student if you put your best foot forward in this program your money will be worth all of that and more. As a student at AMDA you have to make up in your mind to how serious you are about this art, in order to receive all that you need to gain at this institution. The instructors will only push you so much, it's up to you to take the torch and run with it. One thing that we were always asked was Is this craft your hobby, or your career?. When you think of that question and exactly what it means this will drive you insane to put your best foot forward for your money. Am enjoying being here I am truly enjoying my time at AMDA the intensity of the program is what i need to learn as an artist. The atmosphere at the institution is great. You get to know the feeling of what true professionals deal with on a day to day basis. The city is AWESOME! Being in the heart of Manhattan is nothing short of amazing, you see your dreams right before your eyes each day. Am learning a lot The Training at this institution is incredibly educating. The",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}