{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "creative, enthusiastic, athletic, social,",
            "bring warm clothes! be willing to try new activities! you'll make some great new friends. Club sports like ultimate frisbee are a blast!",
            "wooster is a great school you learn a lot, but it is expensive. there are a lot of opportunities to go abroad or get an internship.",
            "THe campus is gorgeous in the summer, spring and fall! it is a little rough in the winter for us southerners, but there is such an inviting atmosphere here that it makes those ok.",
            "The teachers are so wonderful here and always willing to help !"
        ]
    ],
    "pageTitle": "The College of Wooster Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-College-of-Wooster/reviews?_escaped_fragment_=/show/16500",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00270-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898489155,
    "recordOffset": 898440756,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21001=I have made amazing friendships that will last a lifetime. Due to there only being about 2000 students on campus, you get to know almost everyone. It is great to walk to class and receive a lot of hellos and smiles. It is wonderful to know a lot of peoples names and always be able to talk to someone at anytime. Everyone is very nice and always willing to help others. There are tons of opportunities to join many different clubs, groups, and get involved in different activities. The campus is beautiful, all year long, it is small and very personable. Every student has the opportunity to grow as a student and as a person at this college., 172822=© 2015, Cappex.com, LLC, 123510=The move in process is always aided by fall athletes that are there for their camp week. Every year on the day that senior theses are due all the seniors get drunk and march through a big arch in the humanities building. And every year the family of each student gets a letter saying that administrators try to provide the best education at a reasonable cost, but in order to maintain the wooster lifestyle tuition and fees have to go up by some ridiculous amount., 95302=You get a tootsie roll your senior year when you turn in your thesis. Also, the seniors always march through a big arch we have on campus every year. Sometimes if there's a lot of snow in the winter, people try to fill it up, but it never works., 61851=Don't come here. The strong and frequent tuition hikes alone make it not worth it, and the aforementioned campus culture makes it a lot worse. Everybody has a friend who had to transfer out for financial reasons, and al ot of others are taking on enormous debt. They (tuition hikes) also make the school very economically exclusive, and foster a very high maintenance culture and environment. Payscale recently ranked wooster #778 out of bout 1200 schools in its best value category (#1 being the best). Ultimately, good students will succeed wherever they go, and there are plenty of better options.}",
    "textBeforeTable": "03/25/2011 Reviewer is A current student here. 15 out of 15 people found this review useful. 1 of 32 Woogirl Check out reviews left by other students or leave your own review. You could win a free scholarship. The College of Wooster Reviews The College of Wooster › Ohio › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Katie 05/26/2011 Reviewer is A current student here. 8 out of 8 people found this review useful. 2 of 32 Categories Comments Great for these types of students Curious. Our liberal arts curriculum makes it extremely possible for students to explore disciplines that they may be interested in or want to learn more about. Students will rarely feel restrained by their major because they will have so many opportunities to learn about other subjects. Tips for prospective students Come visit the campus! It really is beautiful and there's no better way to know if you'll fit in then by visiting for yourself. And don't be afraid to ask questions to anyone on campus, either. One of our greatest attributes is our friendliness and students, faculty and staff are always more than willing to tell you about their experiences. Bang for the buck Wooster has a pretty hefty price tag; that is true. But the good news is that the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}