{
    "relation": [
        [
            "Parameter",
            "Gathering cut-off",
            "Trusted cut-off",
            "Noise cut-off"
        ],
        [
            "Sequence",
            "23.1",
            "23.1",
            "23.0"
        ],
        [
            "Domain",
            "10.0",
            "10.0",
            "9.9"
        ]
    ],
    "pageTitle": "Pfam: Family: Ubiquitin_2 (PF14560)",
    "title": "",
    "url": "http://pfam.xfam.org/family/PF14560",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00069-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 189918175,
    "recordOffset": 189852902,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{261476=This entry represents a domain characteristic of ubiquitin (Ub) and ubiquitin-like (Ubl) proteins such as SUMO [PUBMED:17491593, PUBMED:15479240] and Nedd8 [PUBMED:9857030]., 18619=Ubiquitin (originally, ubiquitous immunopoietic polypeptide) was first identified in 1975[1] as an 8.5 kDa protein of unknown function expressed in all eukaryotic cells. The basic functions of ubiquitin and the components of the ubiquitination pathway were elucidated in the early 1980s at the Technion by Aaron Ciechanover, Avram Hershko, and Irwin Rose for which the Nobel Prize in Chemistry was awarded in 2004.[10], 11814=Lysine 48-linked chains have been much-studied. They are the forms of chains that signal proteins to the proteasome, which destroys and recycles proteins.[8] This discovery won the Nobel Prize for chemistry in 2004.[10][11], 258232=Grynberg M, Jaroszewski L, Godzik A;, BMC Bioinformatics. 2003;4:46.: Domain analysis of the tubulin cofactor system: a model for tubulin folding and dimerization. PUBMED:14536023 EPMC:14536023}",
    "lastModified": "Sun, 02 Aug 2015 20:28:14 GMT",
    "textBeforeTable": "Model details: search method: hmmsearch -Z 80369284 -E 1000 --cpu 4 HMM pfamseq build method: hmmbuild -o /dev/null HMM SEED HMM build commands: HMM information 20.85 % Average coverage of the sequence by the domain: 21 % Average identity of full alignment: 80.10 aa Average length of the domain: 1025 Number in full: 73 Number in seed: Bateman A Author: Domain Type: none Previous IDs: Jackhmmer:1t0y Seed source: Curation This section shows the detailed information about the Pfam family. You can see the definitions of many of the terms in this section in the glossary and a fuller explanation of the scoring system that we use in the scores section of the",
    "textAfterTable": "Model length: 87 Family (HMM) version: 2 Download: download the raw HMM for this family Species distribution Sunburst Tree Sunburst controls Show Weight segments by... number of sequences number of species Change the size of the sunburst Small Large Colour assignments Archea Eukaryota Bacteria Other sequences Viruses Unclassified Viroids",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}