{
    "relation": [
        [
            "Show Title / Episode",
            "CSI: Miami / \"Rap Sheet\"",
            "Justified / \"The Hammer\""
        ],
        [
            "Actor",
            "Terry Crews",
            "Timothy Olyphant"
        ],
        [
            "Character",
            "Craig Waters",
            "US Marshal Raylan Givens"
        ],
        [
            "Note",
            "",
            ""
        ],
        [
            "Air Date",
            "2002 - ????",
            "2010 - ????"
        ]
    ],
    "pageTitle": "Glock pistol series - Internet Movie Firearms Database - Guns in Movies, TV and Video Games",
    "title": "",
    "url": "http://www.imfdb.org/wiki/Glock",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00331-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 521150967,
    "recordOffset": 521079609,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12968=(1982 - Present), 287583=The Glock 22 is a full sized pistol chambered for .40 S&W. Many American law enforcement agencies use this model, for example, FBI Academy graduates are issued this or a Glock 23 (according to the agent preference) as their standard field weapon. It is also the standard weapon of the DEA (Drug Enforcement Administration) along with the Glock 23, Glock 27, and the SIG Pro SP 2340. US Marshals also carry the Glock 22 and Glock 23 as their service weapons for all Deputy US Marshals. In 2008 the Glock 22 became the standard service weapon for all probationary LAPD officers, once they complete probation these officers then have a choice to either stay with their Glock 22 or go with some other weapon on the LAPD approved carry list.}",
    "lastModified": "Thu, 30 Jul 2015 08:40:35 GMT",
    "textBeforeTable": "Film 4th Generation Glock 17 - 9x19mm. Glock 17 (3rd Generation) with stainless steel slide - 9x19mm 3rd Generation Glock 17 - 9x19mm. Note the finger grooves, thumb reliefs, and accessory rail on the frame, which differentiate it from the older model. 2nd Generation Glock 17 - 9x19mm. This model added finger stepping and cuts to the backstrap of the frame to make it easier to hold than the Generation 1 model. 1st Generation Glock 17 - 9x19mm. Note: When adding pictures of Glock 17 pistols to movie/TV/video game pages",
    "textAfterTable": "Tony Giorgio Baker Suppressed, as the fictional \"Glock 7\" Vondie Curtis-Hall Miller As the fictional \"Glock 7\" John Costelloe Cochrane Robert Patrick O'Reilly Harley Davidson and the Marlboro Man Chelsea Field Virginia Slim 1991 Hard Boiled Johnny Wong's Thugs 1992 Undercover Blues Ralph Brown Leamington 1993 Carnosaur Raphael Sbarge 'Doc' Smith With laser sight 1993 Trouble Bound Billy Bob Thornton Coldface 1993 RoboCop 3 Nancy Allen Officer Anne Lewis With laser sights 1993 The Fugitive Tommy Lee Jones U.S. Deputy Marshal Sam",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}