{
    "relation": [
        [
            "Where to set the attribute",
            "C or Java programs or UNIX ODBC.INI file",
            "Windows ODBC Data Source Administrator"
        ],
        [
            "How the attribute is represented",
            "Preallocate",
            "Preallocate check box"
        ],
        [
            "Setting",
            "0 - Does not preallocate file system space for data store when creating the data store (default). 1 -Preallocates file system space for the data store.",
            "unchecked - Does not preallocate file system space for data store when creating the data store (default). checked - Preallocates file system space for the data store."
        ]
    ],
    "pageTitle": "Data Store Attributes",
    "title": "",
    "url": "http://docs.oracle.com/cd/E18283_01/timesten.112/e13069/attribute.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00274-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 78774607,
    "recordOffset": 78713412,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{297156=A statement that is over 32761 bytes in length., 354342=When the query timeout is set after establishing a connection to the data store, the client driver returns an error if the network timeout value is greater than 0, and the query timeout value greater than or equal to the network timeout value. The SQLState is set to S1000., 119021=An integer from 1 through 2047 -The value represents the expected maximum number of connections., 367440=sysconf(_SC_THREAD_STACK_MIN)/ 1024, 367642=r1.rlim_cur /1024}",
    "lastModified": "Sat, 14 Aug 2010 15:01:21 GMT",
    "textBeforeTable": "Set Preallocate as follows: Setting Only the instance administrator can change the value of this attribute. Required privilege The reason for this behavior is that PreAllocate is set at database creation time. It is not a first connection attribute. The duplicate operation is not a database creation operation, so the preallocate attribute is not honored. The checkpoint files are subsequently allowed to grow to the same size as checkpoint files on the master data store (PermSize + database header), but the space is not preallocated. The checkpoint files increase in size as data is added. When a duplicate operation is carried out, the duplicated store has behavior consistent with a Preallocate setting of 0, even if it is set to 1 on the original or duplicated data store. The behavior is indicated by the size of the checkpoint files, which is the sum of the size of the data and size of the database header. Using Preallocate=1 in combination with ttRestore or ttRepAdmin -duplicate and a value of PermSize that does not match the value of PermSize of the original data store may result in two checkpoint files with different sizes. This has not been shown to have negative effects. However, the issue can be avoided completely either by using the same PermSize as the original data store or by setting Preallocate=0. The Preallocate attribute determines",
    "textAfterTable": "Note: reallocating disk space for a large data store is very time consuming. ReplicationApplyOrdering Starts user-specified parallel replication, when used with the ReplicationParallelism attribute. Set the value of this attribute to 1, to initiate parallel replication. Required privilege Only the instance administrator can change the value of this attribute. Setting Set ReplicationApplyOrdering as follows: Where to set the attribute How the attribute is represented Setting C or Java programs or UNIX ODBC.INI file ReplicationApplyOrdering 0 - Specifies single threaded replication (default). 1 - Specifies parallel replication. Windows ODBC Data Source Administrator Replication Apply Ordering check box unchecked - Specifies single threaded replication (default). checked - Specifies parallel replication. ReplicationParallelism",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}