{
    "relation": [
        [
            "Patent application number",
            "20100056701",
            "20120231337"
        ],
        [
            "Description",
            "AQUEOUS THERMOSETTING COMPOSITION - An aqueous thermosetting composition comprising an amino resin (A) obtained by addition dehydration condensation of an amino compound (a), an aldehyde (b) and an alcohol (c) and a urethane resin (B) obtained by polymerization of an isocyanate (d), a polyol (e) and an oxycarboxylic acid (f) having two or more hydroxyl groups. The aqueous thermosetting composition of the present invention contains both an amino resin and a urethane resin in a one-pack hardener, and the respective performances of the resins can be retained without any deterioration. Further, the aqueous thermosetting composition exhibits favorable dispersibility in water and excels in storage stability, so that it is useful in a wide spectrum of application fields, such as paint, ink, adhesive, coating material, binder and primer.",
            "AQUEOUS PASTE FOR ELECTROCHEMICAL CELL, ELECTRODE PLATE FOR ELECTROCHEMICAL CELL OBTAINED BY APPLYING THE AQUEOUS PASTE, AND BATTERY COMPRISING THE ELECTRODE PLATE - The aqueous paste for an electrochemical cell of the present invention comprises an aqueous dispersion for an electrochemical cell that comprises an olefin copolymer (a); an active material; and a conductive assistant, wherein the olefin copolymer (a) has a weight average molecular weight of not less than 50,000 and is at least one kind selected from a random propylene copolymer (a-1) containing 50% by weight to less than 85% by weight of a structural unit derived from propylene; an acid-modified random propylene copolymer (a-2) obtained by modifying the copolymer (a-1) with an acid; and an ethylene-(meth) acrylic acid copolymer (a-3) containing 5% by weight to less than 25% by weight of a structural unit derived from (meth) acrylic acid."
        ],
        [
            "Published",
            "03-04-2010",
            "09-13-2012"
        ]
    ],
    "pageTitle": "Gen - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/gen-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00163-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438075523,
    "recordOffset": 438046183,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Gen Miyata, Ichihara-Shi JP 06-11-2015 DISTRIBUTION DEVICE FOR WEB CONTENT - The present invention provides a distribution device for web content capable of quickly distributing a multi-domain web page in response to a request from a client. A unit 20150161284 Published Description Patent application number Gen Mineki, Saitama JP //]]> BarDraw('3249684',['Patent applications by Gen Matsui, Bothell, WA US'],[[2,1,1,1,1,1]],['2006','2009','2011','2012','2013','2015'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3249684\" align=\"center\"></div> </div> <canvas id=\"bg3249684\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Gen Matsui, Bothell, WA US</p> <div class=\"bar3249684\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>01-22-2015</td> <td><a href=\"/patents/app/20150021441\">REDUNDANT CURRENT-SUM FEEDBACK ACTUATOR</a> - A system and methods for redundant current-sum feedback control of an actuator system is presented. An actuator comprises actuation coils configured to actuate the actuator, and an actuation coil current sensor senses a measured total coil current comprising a sum of coil currents of each of the actuation coils. Actuator coil controllers control the actuation coils based on a commanded total coil current and the measured total coil current.</td> <td>20150021441</td> <tr> </tr> <td>05-02-2013</td> <td><a href=\"/patents/app/20130104991\">FLOW-GAIN BASED HYDRAULIC ACTUATOR LEAKAGE TEST</a></td> <td>20130104991</td> <tr> </tr> <td>11-29-2012</td> <td><a href=\"/patents/app/20120303210\">SUPPRESSING ELECTRICAL FAILURE EFFECTS IN SERVO CONTROL SYSTEMS</a> - Systems to manage servo controls are disclosed. In some embodiments servo controls may implemented in systems to deflect control surfaces in aircraft. In one embodiment, a system to manage the output of a servo valve comprises",
    "textAfterTable": "Gen Miyata, Chiba JP Patent application number Description Published 20100056716 water-based amino resin and water-based thermosetting resin composition containing the same - An object of the present invention is to provide a definitely novel water-based amino resin improving the problems of a butylated amino resin which has excellent physical properties in a coated film but is less liable to be provided with a water base property as compared with a methylated amino resin and a methylated amino resin which is easy to be provided with a water base property but has inferior physical properties in a coated film as compared with a butylated amino resin. 03-04-2010 Gen Mizuno, Yamaguchi JP Patent application number Description Published 20120149902 PYRROLO[2,3-D]PYRIMIDINE DERIVATIVE - Provided is a compound represented by the Formula (I) having a HER2 inhibitory action or a pharmacologically acceptable salt thereof, 06-14-2012 Gen Morita, Tokyo JP Patent application number Description Published 20150208336 Mobile Terminal, Communication Method, Communication System Program, Information Processing Apparatus, Service Rendering Method and Distribution Server - A mobile terminal includes: a plurality of communication interfaces that are respectively correlated to at least one of a plurality of radio access schemes; and a communication unit that communicates using at least one of the plurality of communication interfaces. The communication unit communicates using a communication interface correlated to a radio",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}