{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is small and that makes getting around pretty easy. Campus security patrols the parking lots continuously. Most parking lots are well lit. The college does a great job of notifying students if their is a safety risk on campus.",
            "There are no Greek life clubs at this time. I did recently receive an email about possibly starting a chapter at the campus.",
            "There are far and few clubs and activities.",
            "Rhodes State College is great for a student who does not want to live on campus, or has children. The college would also be great for adults who work full time during the day. The college offers night classes in a wide variety of programs.",
            "The college started a easter egg hunt for students this year. They hid eggs with prizes all over campus and students randomly found them as they walked to and from classes.",
            "The college is very cost effective but you get what you pay for. The tuition is very low compared to other colleges in the area. It is a great way to start your education with out going into serious debt. The downfall is with lower tuition comes less services for the students. There are few extra curricular activities, student housing, and food options on campus. Also, computer access is very limited.",
            "Rhodes State College has a small game room in one of the buildings. There is also a gymnasium and the students have access to exercise equipment.",
            "The cafeteria offers great food. The only downfall is the cafeteria is only open for limited hours and its not open at all during the summer.",
            "Rhodes State College does not offer dorms. There is a shared living apartment option with very limited space.",
            "There is a wide variety of programs offered.",
            "This is a great school to start your college education. The cost of tuition is low compared to other schools in the area. If you are looking to transfer to a four year program most local colleges accept the credits from Rhodes State.",
            "At Rhodes State College is a cost effective school for students looking to obtain an associates degree. The college lacks in housing, sports programs, and other extra curricular activities. The school does offer a wide variety of educational programs."
        ]
    ],
    "pageTitle": "James A Rhodes State College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/James-A-Rhodes-State-College/reviews?_escaped_fragment_=/show/93454",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00312-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 889989679,
    "recordOffset": 889955591,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{113677=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "03/30/2011 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 of 30 Amanda from Wapakoneta, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Food and Dining Cafeteria on site from M-Friday only. Dorm Life No dorms available. Academic Rigor They have a very competitive health field so make sure you bring your A game in order to stay above the rest in your area of study. Tips for prospective students Make sure to become familiar with your program adviser they can be a wealth of knowledge for the beginning student. In three sentences This college is providing me a traditional and distant education opportunity for learning. The college is on the cutting edge of technology, I would recommend this college to anyone who is looking for an affordable 2yr degree of study. Login to rate or flag the reviews Nathaniel from Coldwater, OH 02/08/2012 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 30",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}