{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I am just starting so everything is fun.",
            "I have not dined at the college yet.",
            "I do not live in a dorm.",
            "I am in online classes, but I attend all functions I can.",
            "Spend time getting to know your college layout before school starts.",
            "I love this college. They have treated me with respect all the way. They helped me any time I needed."
        ]
    ],
    "pageTitle": "Ivy Tech Community College-Northeast Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Ivy-Tech-Community-College-Northeast/reviews?_escaped_fragment_=/show/36076",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00105-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895614575,
    "recordOffset": 895576060,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{94283=Ivy Tech Northeast is a great, fast-track to a degree that will place you in a career. The campus has been updated, the curriculum has grown immensely, and there's a better student life available than when I first attended in 2003. I like Ivy Tech much better than when I attended IPFW., 52555=You get SO much for your dollar. It costs about $1500 for a semester of classes here (full time), while at other places it can cost $25,000 a semester (at least for culinary), 142200=© 2015, Cappex.com, LLC, 117724=Ivy Tech in Fort Wayne has came a long way since I started in 2011. the Academic center is much improved and the advisors seem to have the students best interest in mind. my rating for this college would be a 8 out of 10, 50155=I am very please with the traditional classroom experience that I have had at this campus since 12/2010}",
    "textBeforeTable": "05/13/2011 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 36 from Huntington, IN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Tips for prospective students Can be honor roll students Bang for the buck Willing to work With a good a attude. Will enjoy being here Because it is in my own state fort Wayne In Will learn a lot Because It is a great college, and the professors are well prepard. Login to rate or flag the reviews elizabeth from Columbia City, IN 10/17/2011 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 36 Categories Comments Great for these types of students small campus, dont want to live on campus, online classes and on the campus courses Tips for prospective students dont give up on your hopes of not being able to get in to a school, eventually when you least",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}