{
    "relation": [
        [
            "Religion",
            "Mainline Protestant",
            "Catholic",
            "Other",
            "None"
        ],
        [
            "Adherents",
            "157",
            "126",
            "2",
            "5,156"
        ],
        [
            "Congregations",
            "2",
            "1",
            "-",
            "-"
        ]
    ],
    "pageTitle": "Black Hawk, Colorado (CO 80422, 80427) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Black-Hawk-Colorado.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00015-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 363532655,
    "recordOffset": 363411789,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{125000=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!, 4984=According to our research of Colorado and other state lists there were 6 registered sex offenders living in Black Hawk, Colorado as of August 02, 2015. The ratio of number of residents in Black Hawk to the number of sex offenders is 20 to 1.}",
    "TableContextTimeStampAfterTable": "{41039=2004 Presidential Elections Results, 30160=Ozone [ppb] level in 2012 was 42.2. This is worse than average. Closest monitor was 11.5 miles away from the city center., 14760=On 5/18/1975, a category F3 tornado 40.5 miles away from the city center ., 28704=Carbon Monoxide (CO) [ppm] level in 2006 was 0.403. This is worse than average. Closest monitor was 18.4 miles away from the city center., 37268=Educational Attainment (%) in 2013, 40467=1996 Presidential Elections Results, 41611=2012 Presidential Elections Results, 30865=Particulate Matter (PM10) [µg/m3] level in 2012 was 19.7. This is about average. Closest monitor was 14.7 miles away from the city center., 28052=Air Quality Index (AQI) level in 2012 was 91.1. This is worse than average., 41895=Graphs represent county-level data. Detailed 2008 Election Results, 79796=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 14473=On 6/15/1988, a category F3 (max. wind speeds 158-206 mph) tornado 30.3 miles away from the Black Hawk city center injured 7 people and caused between $5,000,000 and $50,000,000 in damages., 41325=2008 Presidential Elections Results, 40753=2000 Presidential Elections Results, 48476=11.81% of this county's 2011 resident taxpayers lived in other counties in 2010 ($46,108 average adjusted gross income), 31615=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 6.35. This is significantly better than average. Closest monitor was 19.4 miles away from the city center., 50303=12.52% of this county's 2010 resident taxpayers moved to other counties in 2011 ($43,246 average adjusted gross income), 29427=Nitrogen Dioxide (NO2) [ppb] level in 2001 was 8.43. This is worse than average. Closest monitor was 15.0 miles away from the city center., 78465=Total of 7 patent applications in 2008-2015., 37666=School Enrollment by Level of School (%) in 2013}",
    "textBeforeTable": "Religion statistics for Black Hawk city (based on Gilpin County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Wood (4%) Electricity (4%) Utility gas (89%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of convenience stores (with gas): 1 Gilpin County: 1.97 / 10,000 pop. State: 3.13 / 10,000 pop. Number of full-service restaurants: 2 Here: 3.93 / 10,000 pop. State: 8.99 / 10,000 pop. Adult diabetes rate: This county: 4.9% Colorado: 5.3% Adult obesity rate: Gilpin County: 16.8% Colorado: 18.4% Local government employment and payroll (March 2012) Function Full-time employees Monthly full-time payroll Average yearly full-time wage Part-time employees Monthly part-time payroll Financial Administration 4 $30,628 $91,884 0 $0 Other Government Administration 7",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}