{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The cost of this school is amazing when compared to others in Colorado, and it is a University! It is a community college price for a great education.",
            "There are great restaurants in the area. Downtown Denver is a fun place to explore.",
            "Living at home is what most students do at Metro. This is where the social aspect lacks a bit.",
            "It is not that difficult for me, but I did complete the International Baccalaureate program in high school. The classes are easy, but not boring.",
            "Thi is a great choice to save some money, but do not expect the social scene typically portrayed about colleges.",
            "The cost of the school is very affordable. Getting to school is not difficult with the RTD system. The social life is lacking compared to other schools."
        ]
    ],
    "pageTitle": "Metropolitan State University of Denver Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Metropolitan-State-College-of-Denver/reviews?_escaped_fragment_=/show/27248",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00202-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908939899,
    "recordOffset": 908846735,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{500609=MSUD has just received university status as of 2013. It is located downtown on a campus shared by CUD and CCD (higher ed schools) completing what is called the Auraria Campus. Amenities include lite rail transportation, public library and easy access to food nearby., 528610=© 2015, Cappex.com, LLC, 127604=Register on the day registration is available. If you take loans, complete everything in April or you will want to kick yourself in August. This isn't high school. The academic work is more challenging but the experience definitely is not. Show up, pay attention, and leave. College is only as hard as you make it., 149530=When I visited this school in March of 2012, I was shocked by the huge campus and the amazing campus amenities (Starbucks on campus? Oh, yeah!). Everyone I met there was so nice and helpful, even the student who had nothing to gain from helping me out. In short, this school seems like a great one and I can't wait to attend!, 120158=If you are willing to push yourself, you can make even the freshman level classes as hard as you want. I had papers that were supposed to be about 1200 words for English comp, but I talked with my teacher to get extended time and ended up writing pieces about 3000 words in length. Now, those papers are being submitted to editors and publisher and will hopefully be in the hands of the public sometime soon! =P, 148771=While I am not currently enrolled in this school, from what I can tell of my March visit here, the academic rigor is above average, because of the wonderful teachers employed by the school and the inventive and original curriculum's they have put together.}",
    "textBeforeTable": "08/10/2011 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 7 out of 7 people found this review useful. 1 of 127 Ashlynn from Morrison, CO Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); });",
    "textAfterTable": "07/04/2011 Reviewer is A current student here. 4 out of 4 people found this review useful. 2 of 127 Categories Comments Great for these types of students If you want somewhere that always had life and has a wide range of class hours and days then this is for you. you can work your classes around your life and not have to work your life around school. if you work a job then its a good place to go because you can always use the light rail or the bus to go where you need to go. Tips for prospective students If you don't mind the big moving school then it's for you. They offer a lot of great programs there. It might not be the whole dorm living college but there is still a lot of life there. Bang for the buck For being such a big school its really cheap. You don't have to pay an arm and a leg to go there. But just because the tuition is low it doesn't mean that its a bad school. I'm happy that they have made",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}