{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "for the tuition price, njit is definitely the best choice for a student interested in engineering, sciences, architecture, etc.",
            "njit offers a recreation center with an indoor pool, gym, dance halls, etc. in the campus center, there is a lobby with bowling allies and billiard tables. outside, there is space as well as a soccer field to play outdoor sports. around the campus, the city of newark offers museums and shopping.",
            "a large variety of food is offered on and around the campus.",
            "dorms are small and there are many mechanical complaints about the dorm buildings.",
            "the program is very time consuming and can get challenging at times.",
            "only dorm if you can manage time and money. be prepared to spend more time at school than at home.",
            "it's a small friendly campus. it's surrounded by a huge city. the academic program is more difficult than at most colleges."
        ]
    ],
    "pageTitle": "New Jersey Institute of Technology (NJIT) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/New-Jersey-Institute-of-Technology/reviews?_escaped_fragment_=/show/106032",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00150-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898535543,
    "recordOffset": 898484667,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{176505=There are several Greek organizations on campus. The Greeks have a positive impact on the campus sponsoring safety events, raising awareness for causes and raising funds for them as well. There is a significant Greek presence on campus and a new housing facility for the Greeks will be opened fall 2013., 225328=I am currently a cadet in the Air Force Reserve Officer Training Corps (AFROTC) on campus and will be attending pilot training upon completion of my bachelor' in May 2014. I have received beneficial leadership and management training that no college alone can teach., 257340=© 2015, Cappex.com, LLC, 245381=Living on campus is ideal for time purposes, but dorm life can vary depending on the building you're in. Freshman dorms tend to have more events going on in them, while the Honors dorm tends to have a more social atmosphere. The upper class dorms tend to be somewhere in between. Honors dorm is by far the nicest (just built in 2013 I think and it looks like a hotel) while the others are pretty much the same. In these dorms, yeah you'll see cockroaches, smell weird smells, hear lots of dubstep, but whatever, it's all part of the college experience. If for some reason you decide not to live in one of NJIT's halls, there is a university apartment building right next to NJIT that I hear has reasonable prices.}",
    "textBeforeTable": "07/10/2009 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 65 Paul from Monroe Township, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. New Jersey Institute of Technology Reviews New Jersey Institute of Technology › New Jersey › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Benjamin from Jersey City, NJ 06/09/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 4 out of 5 people found this review useful. 3 of 65 Categories Comments Great for these types of students Students looking to major in computer and engineering based careers. Tips for prospective students Great Financial Aid package Login to rate or flag the reviews Mr. Blank 01/03/2010 Reviewer is A current student here. 4 out of 4 people found this review useful. 4 of 65 Categories Comments Bang for the buck I find it to be a little pricey, especially",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}