{
    "relation": [
        [
            "Title",
            "STANDARDIZED PATIENT",
            "ART MODEL",
            "ALTERNATE FUNDING TEMPORARY",
            "TRAINEE",
            "POLICE OFFICER I",
            "POLICE OFFICER II",
            "POLICE OFFICER III",
            "THERAPY ASSISTANT I",
            "THERAPY ASSISTANT II",
            "THERAPY ASSISTANT III",
            "CLIENT CARE AIDE I",
            "CLIENT CARE AIDE II",
            "DENTAL CARE I",
            "DENTAL CARE II",
            "DENTAL CARE III",
            "HEALTH CARE TECH I",
            "HEALTH CARE TECH II",
            "HEALTH CARE TECH III",
            "HEALTH CARE TECH IV",
            "NURSE I",
            "NURSE II",
            "NURSE III",
            "MENTAL HLTH CLINICIAN I",
            "MENTAL HLTH CLINICIAN II",
            "MENTAL HLTH CLINICIAN III",
            "DIAG PROCED TECHNOL I",
            "DIAG PROCED TECHNOL II",
            "DIAG PROCED TECHNOL III",
            "LABORATORY SUPPORT I",
            "LABORATORY SUPPORT II",
            "LABORATORY SUPPORT III",
            "LABORATORY TECHNOLOGY I",
            "LABORATORY TECHNOLOGY II",
            "LABORATORY TECHNOLOGY III",
            "LABORATORY TECHNOLOGY IV",
            "ANIMAL CARE I",
            "ANIMAL CARE II",
            "ANIMAL CARE III",
            "VETERINARY TECHNOLOGY I",
            "VETERINARY TECHNOLOGY II",
            "VETERINARY TECHNOLOGY III",
            "VETERINARY TECHNOLOGY IV",
            "ELECTRICAL TRADES I",
            "ELECTRICAL TRADES II",
            "ELECTRICAL TRADES III",
            "MACHINING TRADES I",
            "MACHINING TRADES II",
            "MACHINING TRADES III",
            "PIPE/MECH TRADES I",
            "PIPE/MECH TRADES II",
            "PIPE/MECH TRADES III",
            "STRUCTURAL TRADES I",
            "STRUCTURAL TRADES II",
            "STRUCTURAL TRADES III",
            "UTILITY PLANT OPER I",
            "UTILITY PLANT OPER II",
            "EQUIPMENT MECHANIC I",
            "EQUIPMENT MECHANIC II",
            "EQUIPMENT MECHANIC III",
            "EQUIPMENT MECHANIC IV",
            "EQUIPMENT OPERATOR I",
            "EQUIPMENT OPERATOR II",
            "EQUIPMENT OPERATOR III",
            "PRODUCTION I",
            "PRODUCTION II",
            "PRODUCTION III",
            "PRODUCTION IV",
            "CUSTODIAN I",
            "CUSTODIAN II",
            "CUSTODIAN III",
            "CUSTODIAN IV",
            "DINING SERVICES I",
            "DINING SERVICES II",
            "DINING SERVICES III",
            "DINING SERVICES IV",
            "DINING SERVICES V",
            "GENERAL LABOR I",
            "GENERAL LABOR II",
            "GENERAL LABOR III",
            "GROUNDS & NURSERY I",
            "GROUNDS & NURSERY II",
            "GROUNDS & NURSERY III",
            "MATERIALS HANDLER I",
            "MATERIALS HANDLER II",
            "MATERIALS HANDLER III",
            "MATERIALS SUPERVISOR",
            "SECURITY I",
            "SECURITY II",
            "SECURITY III",
            "ENGR/PHYS SCI ASST I",
            "ENGR/PHYS SCI ASST II",
            "ENGR/PHYS SCI ASST III",
            "INSPECTOR I",
            "INSPECTOR II",
            "INSPECTOR III",
            "LTC OPERATIONS I",
            "LTC OPERATIONS II",
            "PROJECT PLANNER I",
            "PROJECT PLANNER II",
            "POLICE COMMUNICATION TECH",
            "POLICE COMMUNICATION SUPV",
            "SERVICE DISPATCHER",
            "CUST SUPPORT COORD I",
            "CUST SUPPORT COORD II",
            "CUST SUPPORT COORD III",
            "DATA SPECIALIST",
            "DATA SUPERVISOR",
            "ADMIN ASSISTANT I",
            "ADMIN ASSISTANT II",
            "ADMIN ASSISTANT III",
            "OFFICE MANAGER I",
            "OFFICE MANAGER II",
            "LIBRARY TECHNICIAN I",
            "LIBRARY TECHNICIAN II",
            "LIBRARY TECHNICIAN III",
            "MEDICAL RECORDS TECH I",
            "MEDICAL RECORDS TECH II",
            "MEDICAL RECORDS TECH III",
            "MUSEUM GUIDE",
            "SALES ASSISTANT I",
            "SALES ASSISTANT II",
            "SALES ASSISTANT III",
            "IT TECHNICIAN I",
            "IT TECHNICIAN II",
            "MEDIA SPECIALIST I",
            "MEDIA SPECIALIST II",
            "ARTS TECHNICIAN I",
            "ARTS TECHNICIAN II",
            "ARTS PROFESSIONAL I",
            "TECHNICIAN I",
            "TECHNICIAN II",
            "TECHNICIAN III",
            "TECHNICIAN IV",
            "TECHNICIAN V",
            "PROGRAM ASSISTANT I",
            "PROGRAM ASSISTANT II",
            "LEGAL ASSISTANT I",
            "LEGAL ASSISTANT II",
            "STATE TEACHER AIDE",
            "CHILD CARE AIDE",
            "EARLY CHILDHOOD EDUC I",
            "EARLY CHILDHOOD EDUC II",
            "ACCOUNTING TECHNICIAN I",
            "ACCOUNTING TECHNICIAN II",
            "ACCOUNTING TECHNICIAN III",
            "ACCOUNTING TECHNICIAN IV",
            "PROFESSIONAL ENGINEER I",
            "ENGR/PHYS SCI TECH I",
            "ENGR/PHYS SCI TECH II",
            "ENGR/PHYS SCI TECH III",
            "ELECTRONICS SPEC I",
            "ELECTRONICS SPEC II",
            "ELECTRONICS SPEC III",
            "ELECTRONICS SPEC IV",
            "LABORATORY COORD I",
            "LABORATORY COORD II",
            "LABORATORY COORD III"
        ],
        [
            "Job Code",
            "2700",
            "2701",
            "2702",
            "2703",
            "2704",
            "2705",
            "2706",
            "2707",
            "2708",
            "2709",
            "2710",
            "2711",
            "2712",
            "2713",
            "2714",
            "2715",
            "2716",
            "2717",
            "2718",
            "2719",
            "2720",
            "2721",
            "2722",
            "2723",
            "2724",
            "2725",
            "2726",
            "2727",
            "2728",
            "2729",
            "2730",
            "2731",
            "2732",
            "2733",
            "2734",
            "2735",
            "2736",
            "2737",
            "2738",
            "2739",
            "2740",
            "2741",
            "2742",
            "2743",
            "2744",
            "2745",
            "2746",
            "2747",
            "2748",
            "2749",
            "2750",
            "2751",
            "2752",
            "2753",
            "2754",
            "2755",
            "2756",
            "2757",
            "2758",
            "2759",
            "2760",
            "2761",
            "2762",
            "2763",
            "2764",
            "2765",
            "2766",
            "2767",
            "2768",
            "2769",
            "2770",
            "2771",
            "2772",
            "2773",
            "2774",
            "2775",
            "2776",
            "2777",
            "2778",
            "2779",
            "2780",
            "2781",
            "2782",
            "2783",
            "2784",
            "2785",
            "2786",
            "2787",
            "2788",
            "2789",
            "2790",
            "2791",
            "2792",
            "2793",
            "2794",
            "2795",
            "2796",
            "2797",
            "2798",
            "2799",
            "2800",
            "2801",
            "2802",
            "2803",
            "2804",
            "2805",
            "2806",
            "2807",
            "2808",
            "2809",
            "2810",
            "2811",
            "2812",
            "2813",
            "2814",
            "2815",
            "2816",
            "2817",
            "2818",
            "2819",
            "2820",
            "2821",
            "2822",
            "2823",
            "2824",
            "2825",
            "2826",
            "2827",
            "2828",
            "2829",
            "2830",
            "2831",
            "2832",
            "2833",
            "2834",
            "2835",
            "2836",
            "2837",
            "2838",
            "2839",
            "2840",
            "2841",
            "2842",
            "2843",
            "2844",
            "2845",
            "2846",
            "2847",
            "2848",
            "2849",
            "2850",
            "2851",
            "2852",
            "2853",
            "2854",
            "2855",
            "2856"
        ],
        [
            "Classified Staff Equivalent",
            "n/a",
            "n/a",
            "P1A1XX",
            "n/a",
            "A4B2TX",
            "A4B3XX",
            "A4B4XX",
            "C5L1TX",
            "C5L2XX",
            "C5L3XX",
            "C6P1TX",
            "C6P2XX",
            "C6Q1TX",
            "C6Q2XX",
            "C6Q3XX",
            "C6R1TX",
            "C6R2XX",
            "C6R3XX",
            "C6R4XX",
            "C6S1XN",
            "C6S2XN",
            "C6S3XN",
            "C6U1TX",
            "C6U2XX",
            "C6U3XX",
            "C8A1TX",
            "C8A2XX",
            "C8A3XX",
            "C8C1TX",
            "C8C2XX",
            "C8C3XX",
            "C8D1TX",
            "C8D2XX",
            "C8D3XN",
            "C8D4XX",
            "C9A1TX",
            "C9A2XX",
            "C9A3XX",
            "C9C1TX",
            "C9C2XX",
            "C9C3XX",
            "C9C4XX",
            "D6A1TX",
            "D6A2XX",
            "D6A3XX",
            "D6B1XN",
            "D6B2XX",
            "D6B3XX",
            "D6C1TX",
            "D6C2XX",
            "D6C3XX",
            "D6D1TX",
            "D6D2XX",
            "D6D3XX",
            "D6E1TX",
            "D6E2XX",
            "D7A1TX",
            "D7A2XX",
            "D7A3XX",
            "D7A4XX",
            "D7B1TX",
            "D7B2XX",
            "D7B3XX",
            "D7C1TX",
            "D7C2XX",
            "D7C3XX",
            "D7C4XX",
            "D8B1TX",
            "D8B2XX",
            "D8B3XX",
            "D8B4XX",
            "D8C1TX",
            "D8C2XX",
            "D8C3XX",
            "D8C4XX",
            "D8C5XX",
            "D8D1TX",
            "D8D2XX",
            "D8D3XX",
            "D8E1TX",
            "D8E2XX",
            "D8E3XX",
            "D8G1TX",
            "D8G2XX",
            "D8G3XX",
            "D8G4XN",
            "D8H1TX",
            "D8H2XN",
            "D8H3XN",
            "D9B1XN",
            "D9B2XX",
            "D9B3XX",
            "D9C1XN",
            "D9C2XX",
            "D9C3XX",
            "D9D1TX",
            "D9D2XX",
            "D9E1TN",
            "D9E2XX",
            "G1A2TX",
            "G1A3XX",
            "G1B2TX",
            "G2C2XN",
            "G2C3XX",
            "G2C4XX",
            "G2D4XX",
            "G2D5XX",
            "G3A2TX",
            "G3A3XX",
            "G3A4XX",
            "G3A5XN",
            "G3A6XX",
            "G3C2TX",
            "G3C3XX",
            "G3C4XN",
            "G3D1TX",
            "G3D2XN",
            "G3D3XN",
            "G3E1TX",
            "G3F1TX",
            "G3F2XX",
            "G3F3XX",
            "H2I1IN",
            "H2I2TN",
            "H3I2TX",
            "H3I3XX",
            "H3U1IN",
            "H3U2TN",
            "H3U3XX",
            "H4M1IN",
            "H4M2TN",
            "H4M3XN",
            "H4M4XN",
            "H4M5XN",
            "H4R1XX",
            "H4R2XX",
            "H5E1XX",
            "H5E2XX",
            "H7B1XX",
            "H7C1TX",
            "H7C2XX",
            "H7C3XX",
            "H8B1XX",
            "H8B2XX",
            "H8B3XX",
            "H8B4XN",
            "I2C4*A",
            "I5D1*B",
            "I5D2*N",
            "I5D3*N",
            "I5E2TX",
            "I5E3XX",
            "I5E4XN",
            "I5E5XX",
            "I9A1TX",
            "I9A2XX",
            "I9A3XX"
        ],
        [
            "Title Definition",
            "This class describes positions that are involved in the direct delivery of academic curriculum.",
            "This class describes positions that are involved in the direct delivery of academic curriculum.",
            "This class uses one level and describes seasonal, temporary positions that work for short periods of time, e.g., summer months, special events, or projects. The work can be any variety of assignments performed under close supervision and in support of programs, events, or projects. The aide also may be expected to attend a variety of educational seminars. Appointments to this class are limited to six months out of a 12-month employment period. Because of the temporary nature of this class, positions are not eligible for benefits (except those required by law), salary survey increases, or performance awards.",
            "This class describes work preparing to enter a specific class series. Positions receive on-the-job training or formal courses designed to develop the characteristics required by the class series for which in training. Positions are not to remain in this class indefinitely, and the target class must be identified when the job is created.",
            "This class describes the fully-operational police officer. Positions in this level conduct vehicle or foot patrol to detect criminal activity, respond to communication orders, investigate and gather evidence at the scene, request assistance or emergency aid, establish and maintain control of situations, direct and control crowds and traffic, issue citations or warrants, restrain and take persons into custody, prepare reports and records, and follow-up on incidents or suspected activities. Positions prepare evidence and reports for prosecution and testify in court as witnesses. Positions may give community service presentations on safety and crime prevention or detection methods or programs.",
            "This class describes work leader responsibilities. In addition to the work described by the Police Officer I class, positions in this level oversee and direct the work of other police officers. Positions take charge at crime scenes or crowd settings to direct enforcement actions. Positions review investigative work of others to assure evidence standards are met. Some positions review reports and logs for accuracy and completeness. Positions may also train others, either individually or in groups, in specialty topics such as first aid, weapons handling, physical defense, vehicle driving techniques, or other areas.",
            "This class describes the first supervisory level. Positions in this class perform duties similar to those described in the lower classes in this series and have supervisory responsibilities over positions in lower police officer or related security classes. This class also includes those positions with higher level Decision Making and lower level supervisory responsibilities than the typical supervisory position.",
            "This class describes the clearly defined level where positions follow established work processes and procedures. Positions operate within standard operations and alternatives that are known and any deviation from such requires prior approval. Some assignments do not move beyond this level.",
            "This class describes full-operating therapy assistant. While the duties are similar to those performed at the lower level, the complexity of the job is different. The systems, operations, and processes are still established and defined but allow more flexibility and latitude in implementing treatment plans written by professional therapists. The work requires adapting practical approaches or routines for various situations. Not all circumstances are covered by established guidelines so positions must improvise solutions and alternatives. This class includes responsibility for training lower level assistants.",
            "This class describes positions with responsibility for writing patient treatment plans that are reviewed by professional therapists or for supervising therapy assistant positions responsible for implementing patient treatment plans. At this level, positions design and implement operations to accomplish the work. Work includes, but is not limited to, deciding what operations will be performed and how processes will be implemented.",
            "This class describes the clearly defined level where positions follow established work procedures. Positions operate within standard guidelines and alternatives that are known and any deviation from such requires prior approval. Some assignments do not move beyond this level.",
            "This class describes the fully operational level. Positions operate independently in performing the full range of client aide tasks and problem solving. Positions follow established work procedures and operate within standard guidelines and alternatives.",
            "This class describes the full-operating level dental assistant. Positions operate independently in performing the full range of dental support and chair side assistance tasks and problem solving. Positions follow established work procedures and operate within standard guidelines and alternatives.",
            "This class describes the second-level dental technician. While the type of duties are similar to those performed at the lower level, the complexity of the job is different. The systems, operations, and processes are still established and defined but allow more flexibility and latitude in adapting practical approaches or routines for various situations. Not all circumstances are covered by established guidelines so positions must improvise solutions and alternatives. This class includes responsibility for training lower level technicians.",
            "This class describes the unit supervisor. The unit supervisor is responsible for the work product of three of more full-time equivalent positions including developing the work procedures for the unit.",
            "This class describes the fully operational level. Positions operate independently in performing the full range of technical health tasks and problem solving. Positions follow established work procedures and operate within standard guidelines and alternatives.",
            "This class describes the second-level health technician. While the type of duties is similar to those performed at the lower level, the complexity of the job is different. The systems, operations, and processes are still established and defined but allow more flexibility and latitude in adapting practical approaches or routines to various situations. Not all circumstances are covered by established guidelines so positions must improvise solutions and alternatives. This class includes responsibility for training lower level technicians.",
            "This class describes the third level health care technician. Although positions follow established work processes, they have the authority to determine the procedures required to accomplish the work. Positions use judgment on an ongoing basis to select the most appropriate guidelines and adapt them to develop work procedures that accomplish tasks. Some positions in this class function as a work leader. The work leader exercises some control over the continual work product of others.",
            "This class describes the unit supervisor that exercises direct, formal control over others.",
            "This class describes the full-operating nurse. Positions operate independently in performing the full range of professional nursing tasks and problem solving. This class includes the preceptor who provides guidance to nurses being acclimated to the working environment.",
            "This class describes the work leader. Positions are responsible for implementing procedures, directing workflow, resolving nursing and general care issues, and leading staff on a shift. At this level, positions function as either a supervisor over technical health care staff or direct care workers, or as a work leader over at least two FTE, one of which must be a professional nurse.",
            "This class describes the unit supervisor or the nurse with advanced, specialized, or non-traditional assignments. The supervisor is responsible for an infirmary, clinic, shift, or population of patients including accountability for the use of equipment, space, and resources. Positions directly control the work of assigned nursing staff, participate in development of nursing processes and policies, and determine the work procedures for the unit. Advanced, specialized, or non-traditional assignments are those where positions are developing processes and standards applied facility-wide. To meet this concept, positions must have a higher level of decision-making than the full operating level nurse.",
            "This class describes the clearly defined level. Positions follow established work processes and procedures and operate within standard guidelines and alternatives that are known and any deviation from such requires prior approval. Some assignments will not move beyond this level.",
            "This class describes the fully operational level. Positions operate independently in performing the full range of tasks and problem solving. Positions follow established work processes but have flexibility in deciding how operations will be completed and have latitude in adapting practical approaches for various situations. Not all circumstances are covered by established guidelines so positions must improvise solutions and alternatives.",
            "This class describes the Mental Health Clinician with increased team, facility, program, case coordination, or supervisory responsibilities. Positions in this class are assigned decision making authority for determining processes within a treatment team, ward, facility, or program. At this level, positions apply the full range of accepted treatment practices independently.",
            "This class describes the diagnostic support level. Positions perform clearly defined assignments and follow established work processes and procedures. Positions operate within standard processes and alternatives that are known and any deviation from such requires prior approval. Some assignments do not move beyond this level.",
            "This class describes the full-operating technologist responsible for performing standardized tests and procedures. Positions operate independently in performing the full scope of standardized tests and procedures. Work requires determining solutions to practical problems using specified professional standards and established criteria. Judgment is used to select and apply existing guidelines to solve problems and accomplish the assignment. Some assignments do not move beyond this level.",
            "This class describes the full-operating technologist responsible for performing non-standardized tests and procedures. Positions operate independently in performing the full scope of non standardized tests and procedures. Work requires establishing technical procedures and determining solutions to practical problems using specified professional standards and established criteria. Judgment is used to select and apply existing guidelines to solve problems and accomplish the assignment.",
            "This class describes the full-operating level. Positions operate independently in performing the full range of support tasks and problem solving. Positions follow established work procedures and operate within standard guidelines and alternatives.",
            "This class describes the work leader. In addition to the duties performed at the Laboratory Support I level, work leaders are partially accountable for the work product of two or more fulltime equivalent positions.",
            "This class describes the highest level in laboratory support. Positions in this level have the authority to design and implement, without prior approval, the general operations to accomplish the unit's work. Work includes, but is not limited to, deciding what operations will be performed and how processes will be implemented; creating and revising procedures; establishing general record keeping systems. There is more flexibility and latitude in adapting practical approaches or routines for various situations. Not all circumstances are covered by established guidelines so positions must improvise solutions and alternatives.",
            "This class describes the full-operating technician responsible for performing routine tests and procedures and/or preparing specimens and tissue for testing. Positions operate independently in performing the full scope of routine, standardized tests, procedures and problem solving. Positions follow established work procedures and operate within standard guidelines and alternatives. Some assignments will not move beyond this level.",
            "This class describes the full-operating technician responsible for performing non-routine tests and procedures. Positions operate independently in performing the full scope of non-routine tests and procedures. Work requires determining solutions to practical problems using specified professional standards and established criteria. Judgment is used to select and apply existing guidelines to solve problems and accomplish the assignment. Some assignments do not move beyond this level.",
            "This class describes the fully operational professional technologist level. At this level, positions perform non-routine analytical techniques that require the modification of laboratory or testing procedures in order to accomplish the work. Judgment is used in the adaptation and skilled application of guidelines to solve the full range of problems related to the assignment.",
            "This class describes the unit supervisor. Positions have responsibility for administering a laboratory including staffing, training, quality control, and developing and implementing laboratory processes, operations and standards.",
            "This class describes the clearly defined level where positions follow established work procedures. Positions operate within standard guidelines and alternatives that are known and any deviation from such requires prior approval. Some assignments do not move beyond this level.",
            "This class describes the fully operational level. Positions operate independently in performing the full range of animal care tasks and problem solving. While the type of duties is similar to those performed at the lower level, the complexity of the job is different. The systems, operations, and processes are still established and defined but allow more flexibility and latitude in adapting practical approaches or routines for various situations. Not all circumstances are covered by established guidelines so positions must improvise solutions and alternatives. This class includes responsibility for training lower levels.",
            "This class describes the unit supervisor. Supervisors directly control the work of assigned staff and determine the operations for the unit. The work includes providing input into planning research activities, developing and implementing quality assurance standards, operating procedures and animal care manuals, coordinating the training of staff, and overseeing the daily operations of the unit.",
            "This class describes the clearly defined level where positions follow established work procedures. Positions operate within standard guidelines and alternatives that are known and any deviation from such requires prior approval. Some assignments do not move beyond this level.",
            "This class describes the full-operating technologist responsible for performing specialized patient care. Positions operate independently in performing the full scope of clinical care. Work requires determining solutions to practical problems using specified professional standards and established criteria. Judgment is used to select and apply existing guidelines to solve problems and accomplish the assignment. Some assignments do not move beyond this level.",
            "This class describes the second level specialized care provider, work leader, or staff authority level. This level of specialized care provider works in areas such as cardiac care, anesthesia, or intensive care where the work requires the use of discretion and creativity within limits of theory and principles of the field, program objectives, and, general systems and guidelines. Judgment is used in the adaptation and skilled application of guidelines to solve the full range of problems related to the assignment and must anticipate and analyze the impact and consequences of decisions made. Work leaders exercise some control over the continual work product of others. Staff authorities possess a unique level of knowledge and expertise in a professional field that is needed by the agency to support its overall mission. Agency management routinely relies on the essential consultation of the authority before deciding broad, critical program and policy direction. The consultation provided is accepted as fact and not refuted on its technical merit, even if management does not act on it for political or budgetary reasons. Staff authorities are authorized to take action and issue expert opinions that provide direction for further action by others. Authorities design strategy, systems, processes, guidelines, rules, and standards that are mission critical and directly impact the agency’s ongoing operation and broad program or policy. Staff authority is delegated by agency management, beyond the immediate supervisor, and has direct influence and impact agency-wide, including clients.",
            "This class describes the unit supervisor. Supervisors directly control the work of assigned staff and determine the operations for the unit.",
            "This class describes electrical maintenance work and/or assisting skilled licensed electricians in the installation, alteration, maintenance, and repair of electrical systems, appliances, devices, and/or traffic signals. It involves assisting higher-level fully-operational electrical trade workers by performing routine and limited electrical trades tasks. The work at this level is clearly defined where positions follow established work procedures and operate within standard guidelines and alternatives which are known and any deviation from such requires prior approval. Some assignments do not move beyond this level.",
            "This class describes the full-operating electrician. The work involves the installation, alteration, maintenance, and repair of electrical systems, electrical fixtures, apparatus, and/or traffic signal and control equipment. It includes planning new, or modifying existing installations, providing access for future maintenance, making installations, connecting the power source, testing circuits, preparing sketches showing location of wiring and equipment, and repairing faulty equipment or systems. Work is assigned by means of verbal or written orders and is carried out by the position in accordance with standard practices of the electrical trade. Positions in this class may direct the work of others.",
            "This class describes the supervisory level. Supervisory positions are accountable for actions and decisions that impact the pay, status, and tenure of three or more full-time equivalent positions. Supervisors coordinate the work with the other supervisory trades positions and ensure that the work performed is done in accordance with appropriate plans, specifications, and/or agency standards. Positions in this class also perform the duties of the lower-level class in the series.",
            "This class describes the clearly defined level where positions follow established work procedures. Positions operate within standard guidelines and alternatives which are known and any deviation from such requires prior approval. Some assignments do not move beyond this level.",
            "This class describes the full-operating level. Positions operate independently to perform the full range of tasks and determine solutions to the full range of problems. Judgment is used to select the most appropriate guidelines and adapt them to accomplish the tasks. Positions continually determine practical solutions to problems by applying specific processes, techniques, and methods. Position serves as a resource to others. Some assignments do not move beyond this level. Some positions may require certification.",
            "This class describes the specialized level where positions design and fabricate unique, one-of-a-kind, highly specialized equipment or scientific instruments. This level may also include positions that design and fabricate adaptations of mechanized equipment. Some positions may perform classroom instruction of students. Some positions may require certification.",
            "This class describes the clearly defined level where positions follow established work procedures. Positions operate within standard guidelines and alternatives which are known and any deviation from such requires prior approval. Some assignments do not move beyond this level.",
            "This class describes the full-operating level. Positions operate independently to perform the full range of tasks and determine solutions to the full range of problems. Judgment is used to select the most appropriate guidelines and adapt them to accomplish the tasks. Positions continually determine practical solutions to problems by applying specific processes, techniques, and methods. Positions serve as a resource to others. Some assignments do not move beyond this level.",
            "This class describes the supervisory level. The supervisor is responsible for a work unit including accountability for the use of equipment, space, and resources. Supervisors in this class directly control the work of assigned staff and determine the work procedures for the unit.",
            "This class describes the clearly defined level where positions follow established work procedures. Positions operate within standard guidelines and alternatives which are known and any deviation from such requires prior approval. Positions may assist a specific, full-operating trades position where work is limited to specific tasks with a detailed explanation of how the task is to be completed and it is subject to inspection while in progress and upon completion. Some assignments do not move beyond this level.",
            "This class describes the full-operating level. Positions operate independently to perform the full range of tasks and determine solutions to the full range of problems. Judgment is used to select the most appropriate guidelines and adapt them to accomplish the tasks. Positions continually determine practical solutions to problems by applying specific processes, techniques, and methods. Position serve as a resource to others. Some assignments do not move beyond this level.",
            "This class describes the supervisory level. The supervisor is responsible for a work unit including accountability for the use of equipment, space, and resources. Supervisors directly control the work of assigned staff and determine the work procedures for the unit.",
            "This class describes the full-operating level. Positions operate independently to perform the full range of tasks and determine solutions to the full range of problems. Judgment is used to select the most appropriate guidelines and adapt them to accomplish the tasks. Positions continually determine practical solutions to problems by applying specific processes, techniques, and methods. Positions serve as a resource to others. Some assignments do not move beyond this level.",
            "This class describes the supervisory level. Supervisory positions are responsible for a work unit including accountability for the use of equipment, space, and resources. Supervisors directly control the work of assigned staff and determine the work procedures for the unit.",
            "This class describes the clearly defined level where positions follow established work procedures. Positions operate within standard guidelines and alternatives which are known and any deviation from such requires prior approval. Some assignments do not move beyond this level.",
            "This class describes the full-operating mechanic. Although positions carry out defined work procedures and processes, positions operate independently to perform the full range of tasks. Judgment is required on an ongoing basis to select the most appropriate guidelines and adapt them to accomplish the tasks. Positions continually determine practical solutions to problems by applying specific processes, techniques, and methods. Positions serve as a resource to others. Some assignments do not move beyond this level.",
            "This class describes the third level mechanic. At this level, positions are either supervisors or specialized mechanics. Supervisory positions are responsible for a work unit including accountability for the use of equipment, space, and resources. Supervisors directly control the work of assigned staff and determine the work procedures for the unit. The mechanic repairs, rebuilds, maintains, modifies, and installs special systems on a variety of types of heavy and/or comparable specialized equipment. Repairs at this level cover all vehicle systems, including installing electrical and electronic equipment or repairing hydraulic and pneumatic systems. The work also requires the design and fabrication of parts and tools and may include welding parts and structural members.",
            "This class describes the heavy or specialized equipment supervisor or the aircraft mechanic. Supervisory positions are responsible for a work unit involved in the mechanical repair of heavy equipment. This includes accountability for the use of equipment, space and resources. Supervisors directly control the work of assigned staff and determine work processes, including identifying and/or designing series of procedures needed to carry out a process. The aircraft mechanic is responsible for the maintenance and repair of aircraft, including final operational testing, troubleshooting of the entire mechanical, electrical, hydraulic, oxygen, pneumatic, fuel, surface control, and rigging systems along with all component parts installed in aircraft. Licensure is required for the aircraft mechanic.",
            "This class describes the first full-operating level in the equipment operator series. It describes work operating two axle vans, automobiles, trucks, and equipment to pick up and deliver goods, materials, and or passengers. This work typically requires a basic driver’s license.",
            "This class describes the second, full-operating level in the equipment operator series. It describes work operating buses, medium-sized trucks and equipment, typically with no more than two axles, to pick up and deliver goods, materials, or passengers. The work also includes monitoring the mechanical condition and cleanliness of the equipment, inspecting and maintaining fluid and air pressure levels, and keeping associated records and reports. This level typically requires special licensure or certification to operate the equipment.",
            "This class describes the third, full-operating level in the equipment operator series. It describes work operating large buses, trucks, or other equipment, typically having at least three axles, to pick up and deliver goods and materials. Positions may monitor work schedules and train new employees. Special licensure or certification is usually required to operate the equipment. Some positions in this class may have lead work responsibility over equipment operators.",
            "This class describes the clearly defined level where positions operate high-speed reproduction equipment capable of producing exact copies or work in support of printing shop operations. At this level work does not involve tight or exact registration processes. Positions follow established work procedures and operate within standard guidelines and alternatives which are known and any deviation from such requires prior approval. Some assignments do not move beyond this level.",
            "This class describes the full-operating production level. Although positions carry out defined work procedures and processes, positions operate independently to perform the full range of tasks. Judgment is required on an ongoing basis to select the most appropriate guidelines and adapt them to accomplish the tasks. Positions continually determine practical solutions to problems by applying specific processes, techniques, and methods. Positions serve as a resource to others. Some assignments do not move beyond this level.",
            "This class describes the initial specialized level or the work leader. Although positions follow established work processes, they have the authority to determine the procedures required to accomplish the work. Positions use judgment on an ongoing basis to select the most appropriate guidelines and adapt them to develop work procedures that accomplish the tasks. Specialized positions perform assignments that include operating offset or T-head presses or process cameras for one or two color work requiring tight or exact registration, operating high-speed computer networked equipment, or operating large or high speed computerized multiple-fold folders and collator, stitcher, finisher equipment. The work leader exercises some control over the continual work product.",
            "This class describes the full-operating specialized level or the supervisor for high-speed reproduction and print shop support work. Positions at the specialized level exercise a higher level of complexity than lower levels in this series. These positions complete the full-range of assignments and problem solving related to tight and exact, three and four color registration work on a press or process camera. The supervisor is responsible for a work unit including accountability for the use of equipment, space, and resources. Supervisors directly control the work of assigned staff and determine the work procedures for the unit.",
            "This class describes the fully operational level. Positions operate independently in performing the full range of custodial tasks and problem solving. The assignment is clearly defined so the position follows established work procedures. Positions operate within standard guidelines and alternatives that are known and any deviation from such requires prior approval. Many assignments do not move beyond this level.",
            "This class describes the work leader. In addition to operating independently to perform the full range of custodial tasks, work leaders exercise some control over the continual work product of others.",
            "This class describes the first-level supervisor. The supervisor is responsible for a work unit including accountability for the use of equipment, space, and resources. Supervisors in this class directly control the work of assigned staff and determine the work procedures for the unit. Although positions follow established work processes, they have the authority to determine the procedures required to accomplish the work. Positions use judgment on an ongoing basis to select the most appropriate technical guidelines and adapt them to develop work procedures that accomplish tasks.",
            "This class describes the second-level supervisor. Positions directly control the daily operation of multiple work units through subordinate unit supervisors.",
            "This class describes the full-operating food handler. Positions operate independently in performing the full range of food service tasks and problem solving. The assignment is clearly defined so the position follows established work procedures. Positions operate within standard guidelines and alternatives that are known and any deviation from such requires prior approval. Many assignments do not move beyond this level.",
            "This class describes the second level in Dining Services. At this level positions function as either a production assistant or a work leader over food handling positions. Although positions carry out defined work procedures and processes, judgment is required on an ongoing basis to select the most appropriate technical guidelines and adapt them to accomplish the tasks. Positions continually determine practical solutions to problems by applying specific processes, techniques, and methods. The work leader exercises some control over the continual work product. Some assignments will not move beyond this level.",
            "This class describes the full-operating food production level or the supervisor over food handling positions. Although positions follow established work processes, they have the authority to determine the procedures required to accomplish the work. Positions use judgment on an ongoing basis to select the most appropriate technical guidelines and adapt them to develop work procedures that accomplish the tasks. The supervisor is responsible for a work unit including accountability for the use of equipment, space, and resources. Supervisors in this class directly control the work of assigned staff and determine the work procedures for the unit. Some assignments will not move beyond this level.",
            "This class describes the production work leader. Work leaders exercise some control over the continual work product of others.",
            "This class describes the production supervisor. Supervisors exercise direct, formal control over assigned staff. Work includes accountability for actions and decisions impacting the pay, status, and tenure of others and for determining operations to accomplish the work.",
            "This class describes full-operating general labor work. Positions operate independently to perform the full range of tasks and determine solutions to the full range of problems. Judgment is used to select the most appropriate guidelines and adapt them to accomplish the tasks. Positions continually determine practical solutions to problems and applying specific processes, techniques, and methods. Positions serve as a resource to others. Some assignments do not move beyond this level.",
            "This class describes the work leader. In addition to the duties and responsibilities of the General Labor I, work leader positions are partially accountable for the work product of two or more full-time equivalent positions. Positions monitor work schedules, maintain equipment and supplies, train new employees, and maintain leave records.",
            "This class describes the supervisory level. Supervisory positions are accountable for actions and decisions that impact pay, status, and tenure of three or more full-time equivalent positions. Positions in this class may also perform the duties of the lower-level classes in the series.",
            "This class describes the full-operating level. Positions operate independently to perform the full range of tasks and determine solutions to the full range of problems. Judgment is used to select the most appropriate guidelines and adapt them to accomplish the tasks. Positions continually determine practical solutions to problems and applying specific processes, techniques, and methods. Positions serve as a resource to others. Some assignments do not move beyond this level.",
            "This class describes the work leader or specialized grounds work. Work leaders exercise some control over the continual work product of others. In addition to the duties and responsibilities of a Grounds I position, work leader positions are partially accountable for the work product of two or more full-time equivalent positions. Positions monitor work schedules, maintain grounds equipment and supplies, train new employees, and maintain leave records. Specialized grounds work includes a variety of specialized, skilled tasks beyond the full-operating level, which may require licensure, certification, or specialized training. Positions maintain all or a portion of a massive, sophisticated underground sprinkler system or backflow irrigation system. In conjunction with sprinkler or irrigations systems, positions read blueprints, design systems, diagnose malfunctions, install control mechanisms or supervise installation. Some positions identify diseases or infestations of trees and shrubs and mix compounds, sprays, or pesticides to control pests.",
            "This class describes the supervisor. Supervisory positions are accountable for actions and decisions that impact pay, status, and tenure of three or more full-time equivalent positions. Positions in this class may also perform the duties of the Grounds I and Grounds II levels.",
            "This class describes the fully-operational stocking and distributing level. Positions in this level receive and unpack shipments; accept or refuse shipments after verifying the quality and quantity of contents against orders, bills of lading, and specifications and report any discrepancies; safely move, store, and rotate items; fill and deliver orders; physically count items periodically for perpetual or special inventories; initiate reorders from established reorder points by filling out forms, contacting the vendor, or reporting to a supervisor; pack, weigh, and label outgoing shipments; fill out paperwork or contact vendors to initiate reorders. The work often involves climbing, lifting, and operating power equipment to load, unload, move, stack, or tier items in the storage facility. This class typically describes standardized work but may also be used to train for a higher level in this series.",
            "This class describes positions that perform work within established storeroom or warehouse operations, as described by the Materials Handler I, however, the complexity of the assignment is increased. Work often involves the resolution of disputes or claims that deviate from established guidelines, forecasting future needs and setting stock levels for items in the inventory where there is an absence of historical usage data, or selecting the brand and source of unique scientific or technical items for special orders where multiple descriptions exist. Some positions in this class may function as work leaders or, in a few cases, as working supervisors.",
            "This class describes positions that establish and revise working standards and procedures for the daily operation of the storeroom or warehouse. In addition, these positions participate in the work described by the Materials Handler II class. Some positions may have work leader responsibility, including planning assignments and controlling the timeliness, soundness, and accuracy of the work of others.",
            "This class describes positions that supervise the overall warehousing operation for an agency, region, or state facility. Work includes overseeing the daily ordering, receipt, storage, physical inventory, and distribution of items by developing procedures and delivery routes and schedules. Positions determine what items are carried in the inventory, supervise staff, oversee an operating budget by authorizing expenditures and preparing budget estimates, prepare plans to obtain space and equipment, and set ordering and delivery priorities for the warehouse.",
            "This class describes the fully-operational level. Positions operate independently in performing the full range of security and parking services. Work requires determining solutions to the full range of practical problems. Judgment is used on an ongoing basis to select and apply the most appropriate guidelines and adapt them to develop work procedures that accomplish the tasks. Work includes ensuring that equipment is operational, enforcing agency rules and regulations, writing reports, collecting fees, and assisting law enforcement officials as needed. Some assignments will not move beyond this level.",
            "This class describes the work leader. Work leaders exercise some control over the continual work product of others.",
            "This class describes the supervisor. Supervisors exercise direct, formal control over assigned staff. Work includes accountability for actions and decisions impacting the pay, status, and tenure of others and for determining operations to accomplish the work.",
            "This class describes the entry level. Work is designed to train positions for a higher level in the class series. Although tasks are similar to those of the clearly defined level, assignments are structured and performed with direction and assistance from others. Positions carry out established work processes and operations by learning to apply and follow procedures, techniques, rules, and regulations. Once training has been completed, the position is to be moved to the next level. Positions should not remain in this class indefinitely.",
            "This class describes the clearly defined level. Positions in this level operate equipment and devices to record or measure readings or quantities and prepare records of such. The work may involve making prescribed calculations to determine follow-on actions based on set standards or requirements. Positions are expected to select from clearly defined alternatives and follow procedures outlined in manuals, guides, specifications, or instructions.",
            "This class describes the fully-operational level. Positions in this level perform work with decision making limited to how and what operations will be completed based on a range of alternatives.",
            "This class describes the fully-operational compliance inspector. The focus of inspections is on compliance with statutory rules and regulations as opposed to licensed or certified trades, such as, but not limited to, protection from substandard products, accuracy of measuring devices, installation and inspection of facilities and signage. Positions operate independently in performing the full range of compliance inspections. Work requires determining solutions to the full range of practical problems. Judgment is used on an ongoing basis to select and apply the most appropriate guidelines and adapt them to develop work procedures that accomplish the tasks. Positions may serve as a resource to others. Some assignments will not move beyond this level.",
            "This class describes the fully-operational single trade inspector or compliance inspector supervisor. In addition to statutory rules and regulations, trade inspectors apply standards and codes of a trade in inspecting installation of systems or construction of structures, including issuing certificates of occupancy. Also included are those positions that perform inspections of internal construction projects at state facilities that may involve multiple trades, including reviewing change orders and contractor’s requests for payment. Positions operate independently in performing the full range of trades inspections. Work requires determining solutions to the full range of practical problems. Judgment is used on an ongoing basis to select and apply the most appropriate guidelines and adapt them to develop work procedures that accomplish the tasks. Some positions serve as a resource to others. Some assignments will not move beyond this level. Supervisors exercise direct, formal control over assigned compliance inspection staff. Work includes accountability for actions and decisions impacting the pay, status, and tenure of others. Licensure or certification in a single trade is required, such as uniform building code, state or national electrical code, uniform and international plumbing code, uniform and international mechanical code, national boiler and pressure vessel code, or HUD construction codes and standards.",
            "This class describes the fully-operational multiple-trades inspector or supervisor over single-trade inspectors. In addition to statutory rules and regulations, inspectors apply standards and codes of multiple trades in inspecting installations of systems or construction of structures, including issuing certificates of occupancy. Positions operate independently in performing the full range of multiple trades inspections. Work requires determining solutions to the full range of practical problems. Judgment is used on an ongoing basis to select and apply the most appropriate guidelines and adapt them to develop work procedures that accomplish the tasks. Licensure or certification is required in multiple trades (examples in Inspector II). The purpose and results of multiple-trades inspections at this level is to inspect and regulate external entities, which is different from construction inspections of contractors working on projects at state facilities. Also included in this class are supervisors who exercise direct, formal control over assigned single trade inspection staff. Work includes accountability for actions and decisions impacting the pay, status, and tenure of others. Such supervisory positions may require licensure/certification in a single trade.",
            "The concept of this class is the second-level supervisor of a multi-trade organization or program supervision of a major segment of an organization with a variety of occupations in LTC. This class describes work supervising, directing, and coordinating various trades positions performing construction and/or maintenance work in LTC operations. The work may involve consulting with agency staff, vendors, contractors, architects, and engineers involved with agency construction or maintenance projects. Some positions are responsible for planning and directing the daily operations of a major segment of the organization which includes; recommending the budget and staffing patterns, authorizing and monitoring the expenditure of funds and the use of resources; developing inventory control systems, training programs, and equipment repair guidelines; purchasing equipment, parts, and tools; developing safety programs and processes to ensure compliance with department, state, and federal rules and regulations; planning the use, distribution, modification, and replacement of equipment and vehicles to meet needs; and supervising both shop and field maintenance personnel. It also may involve developing controlled or preventive maintenance and capital outlay projects, participating in contract preparation, providing technical cost estimates of time and material for a variety of projects, writing detailed equipment and material specifications, and functioning as liaison with outside entities.",
            "This class describes the program supervisor. Program supervisors manage the daily operation of a major segment of the organization that is designated as critical and essential to the agency. Positions determine the annual business plans that integrate with the agency’s mission and goals, determine implementation policies and guidelines, develop budgets, establish staffing and directly control the work of others. Work involves directing the implementation of policies, rules, and regulations. Positions are involved in the preparation, presentation, and justification of budgets and policy determinations, implementation, and administration on matters of long-range planning, preventive maintenance, equipment replacement, and determining priorities for construction, repair, and/or remodeling projects.",
            "This class describes the fully-operating project planner. The work may also include new minor construction work as well as renovation projects. The work is performed under general supervision of a higher-level trades supervisor, manager, or project planner and is evaluated on the basis of results achieved, accuracy of estimates, and demonstration of good judgment in resolving planning and estimating problems. The work includes determining practical solutions to maintenance or repair problems and projects, and such positions serve as a resource to others. Some assignments do not move beyond this level.",
            "This class describes the supervisory level. Supervisory positions are accountable for actions and decisions that impact the pay, status, and tenure of three or more full-time equivalent positions. Supervisors coordinate the work with the other supervisory trades positions and ensure that the work performed is done in accordance with appropriate plans, specifications, and/or agency standards. Positions in this class also perform the duties of the lower-level class in the series.",
            "This class describes the fully-operational level. Positions receive and record emergency and routine complaints; clarify the situation and determine the need for, and level of, response; transmit information to officers; retrieve and update crime reports and background inquiries. Work also includes performing other office support tasks in support of the communication function, such as filing, data entry and typing, and checking-out keys and equipment.",
            "This class describes the unit supervisor responsible for the daily operation of the communication center. Positions in this class supervise at least three full-time equivalent positions, including decisions affecting pay, status, and tenure. Work includes monitoring the work load and flow, ensuring compliance with policy and regulations, establishing work schedules and production standards, creating operating procedures and writing manuals, designing courses and training staff, ordering supplies and maintaining equipment, and resolving complaints against staff.",
            "This class describes the fully-operational dispatcher operating radio equipment to relay transportation or maintenance services. In addition to collecting and relaying work orders for service as described above, positions in this class may also verify billing charges, schedule and track vehicles and drivers by generating trip tickets on the computer; keep logs of activities, time of departure and return, mileage and fuel used; and issue keys, permits, radios, and pagers.",
            "This class describes the fully-operational customer support coordinator in a data processing environment. At this level, work involves establishing production schedules by confirming the customer's input/output requirements, determining the feasibility of requests and estimating run times, checking and adjusting job control language parameters, and notifying customers of any problems with running their jobs. This class also includes \"help desk\" work where positions take requests for service changes; provide instructions to callers on the routines to use to locate and solve problems, including referral to other data processing staff; enforce security procedures for system access and data integrity by creating or deleting passwords, defining the level of access and training customers; and, train customers on how to access the system and use its hardware or software. Positions maintain manual or automated records of problems reported and changes requested. Positions in the class may order, stock, and check out data processing supplies and maintain the data processing equipment inventory.",
            "This class describes the second-level coordinator in a data processing environment. While the environment, system, and its operations and processes have not changed, the complexity of the job is different. At this level, the guidelines allow for greater flexibility in choosing from multiple options that could all be correct at any given point in order to adapt a practical approach or routine for a given situation. Positions in this class may set up job control language parameters and syntax, troubleshoot problems that do not follow established patterns so the cause is not obvious and established protocols do not work; adapt scheduling guidelines when the customer is unclear about needs and there is uncertainty on the availability of resources due to conflicts with the needs of other customers who have the same priority and time requirements. Also included in this class are work leader positions that are partially accountable for the work product of at least two full-time equivalent positions. Such positions assign and monitor work, report on unit activities, write internal instructions referenced by other staff, and train and schedule staff.",
            "This class describes the supervisor of a customer support unit. In addition to the duties performed in other customer support coordinator classes, positions in this class are responsible for the direct supervision of at least three full-time equivalent positions, including decisions that affect the pay, status, and tenure of others. Work includes overseeing production scheduling and/or problem/change management activities by monitoring and reporting on work unit activities, projecting workload, establishing unit priorities and standards, and developing procedures on how unit functions will be performed. Some positions may function as an agency's security administrator which involves enforcing policies and processes on access, including writing procedures or instructions for staff and customers on how to create passwords and who has access to the unit's software.",
            "This class describes the specialist level in this series. While the system operations are defined, the work is in support of a special business function so a greater level of complexity and judgment are required. Knowledge of the business function being supported and the data processing system’s operations in terms of processing the transactions must be applied in order to ensure compliance with standards and rules and to ensure the correct transfer of data from one system to another. In addition to entry and verification of data, positions use judgment to ensure that the source document and transaction are proper and to correct any invalid documents or information. Positions troubleshoot and report problems with the processing of transactions to the system or program administrator; test system changes to ensure revisions work properly given business function rules; explain systems, rules, and procedures to others; and train system users.",
            "This class describes the supervisor responsible for the daily operation of a data entry work unit. In addition to work described by previous data classes, positions in this class supervise at least three fulltime equivalent positions including decisions that directly affect the pay, status, and tenure of others. The unit supervisor trains and schedules assigned staff, plans work schedules and assigns work, establishes and modifies operating procedures, monitors production and quality standards, authorizes overtime, and maintains personnel files and leave records. Included in this class are positions which function as work leaders over data specialist positions.",
            "This class describes the entry level. Work is designed to train positions for a higher level in the class series. Although tasks are similar to those of the fully-operational level, assignments are structured and performed with direction and assistance from others. Positions carry out established work processes and operations by learning to apply and follow procedures, techniques, rules, and regulations. Once training has been completed, the position is to be moved to the next level. Positions should not remain in this class indefinitely.",
            "This class describes the third administrative assistant level. While the type of duties is similar to those performed by the Administrative Assistant I, the complexity of the job is different. The systems, operations, and processes are still established and defined but allow more flexibility and latitude in adapting practical approaches or routines for various situations. Not all circumstances are covered by established guidelines or they do not work so positions must improvise solutions and alternatives. Illustrations include, but are not limited to, positions that are authorized to make exceptions to eligibility requirements, quotas, and fees or charges; design work methods used by others; perform desk top publishing, including the design, layout, paste up, and editing of program documents; produce technical documents, such as scientific papers, use several software packages; release official information or documents that are legally confidential depending on the reason, requestor, and document requested; schedule facilities, such as class or conference rooms, by determining the eligibility of the event and group; plan events by writing specific orders and compiling operating expense data, arranging the logistics and equipment, selecting menus and caterers, designing decorations, scheduling the site, locating selected presenters, setting reservation deadlines, and making transportation and lodging arrangements for participants; create and sign correspondence without prior instructions where the content varies based on the nature of issue being addressed; and, complete the forms to adjust or transfer funds as restrictions change or to cover shortages, and authorize expenditures for office supplies. Although this class is primarily a non-supervisory class, some positions may be a work leader or working supervisor who participates in the same work as others in the unit and operates under the same established procedures and set deadlines or schedules. The only difference is the performance of supervisory elements, such as training, assigning and reviewing work, and scheduling, which are described exclusively in the Line/Staff Authority factor.",
            "This class describes the fourth administrative assistant level. Positions in this level have the authority to design and implement, without prior approval, the general office and administrative operations to accomplish the unit's work. Work includes, but is not limited to, deciding what operations will be performed and how processes will be implemented; creating and revising office procedures and writing office procedure manuals, designing forms; establishing general office record systems and resource libraries, including content of files and publications, coding and maintenance schemes, circulation and retrieval, production, access, and disposal; compiling and formatting the content for program materials, such as annual reports and newsletters; accounting for the unit’s allotted funds by authorizing (signing) operating expenditures for such things as office supplies, calculating estimated office operating expenses for the annual budget request; and, designing the physical layout of the unit’s work area. Some positions in this class may function as work leaders who are partially accountable for the work product of at least two full-time equivalent positions.",
            "This class describes the office manager. In addition to the type of duties described in the Administrative Assistant III, positions in this level are responsible for organizing and supervising all general support activities to ensure cost effective, efficient, and consistent operation of the work unit. Work includes monitoring work loads, flow, and the use of assigned resources; establishing office procedures, operations, and standards; and evaluating office production and quality. Positions are accountable for the work product of at least three full-time equivalent positions, including decisions that affect pay, status, and tenure.",
            "This class describes the office manager who is a second-level supervisor. In addition to the duties and responsibilities described by the Office Manager I class, positions in this level are accountable for the work of others through the supervision of at least two subordinate unit supervisors, including decisions that affect pay, status, and tenure.",
            "This class describes the fully-operational library technician. Positions in this level provide a variety of library support work including any combination of the following activities: completing and processing the forms to order books, subscriptions, or bindery services; checking-in and verifying the receipt of new materials; selecting, downloading, and verifying bibliographic records from national and local databases; updating existing computer records; preparing materials for circulation by stamping identification marks on materials and attaching labels, security tags, and card jackets; sorting and shelving materials according to call numbers; issuing library cards; checking materials out and in; generating overdue notices and fine statements; providing directional and general information to patrons and helping patrons locate material; responding to requests to borrow or lend materials from other libraries; assembling loose periodicals and serials for binding and verifying that bound volumes meet work order instructions; repairing damaged library materials; processing materials to be placed on reserve; and, keeping records of services provided or contacts with patrons.",
            "This class describes the second level library technician. While the types of duties are similar to those performed by a Library Technician I, the complexity of the work is different. The systems, operations, and processes are still established and defined but allow more flexibility and latitude in adapting practical approaches for various situations. Not all circumstances are covered by established guidelines so positions must use judgment in devising solutions and alternatives. The work at this level includes determining priorities, solving problems affecting the accurate processing of materials or transactions, recommending procedure changes to remedy processing problems, determining work methods and priorities for others, and making exceptions to policies, procedures, and fees. This class also includes the work leader or working unit supervisor who participates in the same work as others in the unit and operates under the same established procedures and set deadlines or schedules. The only difference is the performance of supervisory elements, such as training, assigning and reviewing work, and scheduling.",
            "This class describes the highest-level library technician. The work at this level requires the application of the elementary principles and practices of library science. Positions are either responsible for a branch library or work unit in a central library, or are responsible for a technical function as an assistant to a professional librarian. The work must include the authority to design and implement, without prior approval, the administrative operations to accomplish the work of the branch, unit, or function. The work includes deciding what operations will be performed and how they will be implemented; creating and revising procedures and writing, updating, and revising procedure manuals; planning, scheduling, and assigning work projects; developing work standards and monitoring work quality and flow; monitoring and authorizing the expenditure of unit operating funds; solving problems affecting the operations and standards of the unit; and authorizing exceptions to library policies and procedures. This class includes positions having work leader or supervisory responsibility for a staff of lower level library technicians.",
            "This class describes the first level of the medical records technician. Work in this class includes assembling charts and census counts; reviewing records for completeness, conformance to legal requirements, and/or eligibility for a registry; notifying the originator of any deficiencies; classifying diagnoses and procedures according to the uniform coding system; computing numbers for reports; and, determining the validity of authorizations for release of medical information. Positions in this class also perform related support work, such as arranging travel for clinicians or clients, scheduling examinations, filling out billing paperwork, medical transcription, and data entry.",
            "This class describes the second level of the medical records technician. In addition to the duties and responsibilities in the Medical Records Technician I class, positions in this class assist in maintaining the quality of an agency's medical records classification system and release of medical information. Work includes determining operating procedures, developing data collection forms, and monitoring the quality of the agency's treatment records.",
            "This class describes the work leader or unit supervisor. In addition to the duties and responsibilities of a medical records technician, positions in this class oversee the work product of other positions.",
            "This class describes the fully-operational museum guide. Work includes scheduling and conducting tours; explaining historical information and site interpretations and answering questions from visitors; preparing the site for tours by deactivating alarms and unlocking doors, raising shades, vacuuming carpets, and dusting display cases; answering telephones and directing visitors; and, collecting admissions fees and keeping records of the number of visitors. Positions assure facility security by observing visitors, activating alarms, locking doors, and reporting theft or vandalism to security. Some positions are responsible for recruiting, training, scheduling, and evaluating the work of volunteers.",
            "This class describes the first level of sales assistant. Positions provide customer service and sales support by assisting customers with the selection, purchase, and return of merchandise. The work includes explaining and demonstrating product features to customers, suggesting merchandise to meet the needs of the customer, operating cash registers, collecting payment and making change, examining defective goods returned by customers to determine if refund or replacement should be made, stamping or tagging prices on merchandise, taking and filling customer orders, stocking shelves and rotating inventory, informing the sales manager when stock is low, arranging product displays, and maintaining a clean, orderly sales area. The work at this level often involves providing instruction, demonstration, and training to new or temporary sales and customer service positions.",
            "This class describes the work leader. In addition to the duties described by the Sales Assistant I class, positions in this class are partially accountable for the work of two or more full-time equivalent positions. Work leaders relieve staff for breaks and fill in for leave, monitor work schedules and flow, assign work to staff, resolve problems and complaints referred by lower-level sales assistants, and insure that store policies and procedures developed at higher levels in the sales department or store are followed.",
            "This class describes the supervising sales assistant. Positions at this level are accountable for the work of others through direct supervision of three or more full-time equivalent positions. Positions establish work schedules and determine staffing needs to assure adequate sales floor coverage during regular and high-volume periods.",
            "This class describes the entry level technician. Positions perform tasks that are structured and designed to provide training and experience. Tasks are performed under direct supervision and detailed instruction and guidance is received. Employees in this class learn to apply established techniques, procedures, practices, and methods directly related to the assignment. Positions do not remain at this level indefinitely.",
            "This class describes the intermediate level. Positions operate independently in performing assignments that are limited to phases of a fully-operational professional assignment or which may be designed to provide continued training and experience. Work requires determining solutions to practical problems using specified professional standards and established criteria. Judgment is used to select and apply existing guidelines to solve problems and accomplish the assignment.",
            "This class describes the full-operating level of technical media specialist work. Positions at this level apply established, standard guidelines, practices, techniques, methods, procedures, and instructions in performing defined technical audio-visual work. Positions at this level are involved in the operation, distribution, equipment and/or inventory control of media equipment, and maintenance of a variety of audio-visual/media equipment.",
            "This class describes work leader technical media specialist work. In addition to the work performed at the Media Specialist I level, positions at this level function as work leaders as described by the Line/Staff Authority factor. The Media Specialist II differs from the Media Specialist I on the Decision Making and Line/Staff Authority factors.",
            "This class describes the entry level technician. Positions perform tasks that are structured and designed to provide training and experience. Tasks are performed under direct supervision and detailed instruction and guidance is received. Employees in this class learn to apply established techniques, procedures, practices, and methods directly related to the assignment. Positions do not remain at this level indefinitely.",
            "This class describes the fully-operational technician or entry level professional. Technicians operate independently in performing the full range of technical duties and problem-solving. Although positions carry out defined work procedures and processes, judgment is required on an ongoing basis to select the most appropriate technical guidelines and adapt them to accomplish tasks. Positions continually determine practical solutions to problems by applying specified processes, techniques, and methods. Entry level professional positions perform tasks that are structured and designed to provide training and experience. Tasks are performed under direct supervision and detailed instruction and guidance is received. Entry professionals learn to apply theories and principles of the professional media arts field. Non-supervisory technical assignments will not move beyond this level. Entry professional positions do not remain at this level indefinitely.",
            "This class describes the intermediate level. Positions operate independently in performing assignments that are limited to phases of a fully-operational professional assignment or which may be designed to provide continued training and experience. Work requires determining solutions to practical problems using specified professional standards and established criteria. Judgment is used to select and apply existing guidelines to solve problems and accomplish the assignment.",
            "This class describes the entry level. Positions perform tasks that are structured and designed to provide training and experience. Tasks are performed under direct supervision and detailed instruction and guidance is received. Employees in this class learn to apply established techniques, procedures, practices, and methods directly related to the assignment. Positions do not remain at this level indefinitely.",
            "This class describes the second-level technician. The assignment is clearly defined so the position follows established work procedures. Positions operate within standard guidelines and alternatives which are known and any deviation from such requires prior approval. Some assignments will not move beyond this level.",
            "This class describes the third-level technician. Although positions carry out defined work procedures and processes, judgment is required on an ongoing basis to select the most appropriate technical guidelines and adapt them to accomplish the tasks. Positions continually determine practical solutions to problems by applying specific processes, techniques, and methods.",
            "This class describes the fourth-level technician. Although positions follow established work processes, they have the authority to determine the procedures required to accomplish the work. Positions use judgment on an ongoing basis to select the most appropriate technical guidelines and adapt them to develop work procedures that accomplish the tasks.",
            "This class describes the fifth-level technician who is responsible for a work unit or area (e.g., park), including accountability for the use of equipment, space, and resources. Positions in this class directly control the work of assigned staff and determine work processes, including identifying and/or designing series of procedures needed to carry out a process.",
            "This class describes the first level of program assistant where positions perform technical support and/or office management duties as described under the Description of Occupational Work section above. Work involves making decisions within established technical work processes related to a program or professional subject area and interpreting program specific guidelines to resolve problems, answer questions, and/or advise others on specific program issues or matters.",
            "This class describes the second level of technical support and/or office manager duties. In addition to the work performed at the Program Assistant I level, positions at this level are expected to exercise a higher degree of decision making and independence by functioning with less direction. Positions have the authority to make decisions within the limits and objectives set by an administrator and the technical guidelines of a program or professional subject area without prior approval. This class identifies positions responsible for organizing and establishing work processes to deliver program services prescribed by management.",
            "This class describes first-working level legal assistant work. Positions in this class are not expected to perform the full range of legal support work. Because of the structure of assignments, decision making and complexity are limited to carrying out established work processes and operations or phases of the fully-operational assignment by following and applying instructions, procedures, rules, and regulations. Tasks performed at this level may be the same as the fully-operational level but are performed with more direction and assistance and provide the experience and development necessary to function at the full-operating Legal Assistant II level. Positions in this level perform work identified above under the Description of Occupational Work section. Also, as described above, some positions provide legal support services at a correctional facility.",
            "This class describes fully-operational legal assistant work. Positions in this level are expected to exercise a higher degree of decision making and complexity than the lower Legal Assistant level by performing at the fully-operational level with less direction and assistance. Work involves performing the full range of legal assistant work identified above under the Description of Occupational Work section including assignments such as, performing research by gathering and analyzing legal data pertinent to individual cases or issues, and advising attorneys and management on the findings of research and recommending appropriate courses of action related to cases such as precedent case(s) upon which arguments and strategies may be based. The Legal Assistant II differs from the Legal Assistant I on the Decision Making and Complexity factors.",
            "This class describes the teacher aide. As described above, positions in this class assist a teacher by implementing lesson plans as directed, instructing students, monitoring and responding to a student's instructional and behavioral needs, and conferring with the teacher on special needs of the student. Positions in this class also perform office support tasks, such as maintaining and mailing student records, copying materials, maintaining the supply inventory and filling requests. Positions in this class may also monitor the classroom when the teacher is away for brief periods of time. Included in this class are positions receiving training and orientation where performance is expected to reach the fully operational level within the initial probationary period.",
            "This class describes the aide in a childcare setting. Duties include, but are not limited to, implementing assigned individual or group activities with children in arts and crafts, music and dance, reading and storytelling, playground and recreation, field trips, and related activities; serving meals and snacks; maintaining the child care center's safety and sanitation standards; reporting signs of a child's illness or unusual behavior to a teacher or supervisor; assisting children with a variety of tasks as directed; and, suggesting alternatives to routine activities to the teacher or supervisor.",
            "This class describes the early childhood educator. Duties include, but are not limited to, writing daily lesson plans for educational and recreational activities for assigned children or classes in accordance with center guidelines and developmentally appropriate techniques. Daily lesson plans may include activities in arts and crafts, music and dance, reading and storytelling, recreation, field trips, and related child care activities appropriate to the children’s ages. Positions interact with supervisors and parents in dealing with the needs of ill children or children with behavioral problems. Positions may also conduct or oversee the serving of meals and snacks, maintaining safety and sanitation standards, and assisting children with a variety of tasks as requested by the child.",
            "This class describes the work leader. In addition to the duties and responsibilities of an Early Childhood Educator I, positions in this class have work leader responsibilities for childcare aides or other child care educators. Positions at this level develop lesson plans and activities that are carried out by any member of the teaching team.",
            "This class describes the first-level accounting technician. Work is performed within established and known accounting systems, processes, and operations. Duties include, but are not limited to, computing charges, deductions, discounts, interest, and payments; paying vouchers; processing accounts payable and accounts receivable; processing accounting forms and routing for approval; checking for proper documentation, accuracy of figures and codes, compliance with rules and regulations, and necessary signatures; batching data for input or inputting data into the automated accounting systems; verifying data entered and making correcting entries; collecting and depositing payments and balancing receipts and deposits; maintaining logs and files; and, distributing warrants, statements, reports, etc.",
            "This class describes the second-level accounting technician. While the types of duties are similar to those performed by the Accounting Technician I, the job complexity is different. The systems, operations, and processes are still established and defined but allow more flexibility and latitude in adapting practical approaches and routines for various situations. Not all circumstances are covered by established guidelines so positions must improvise solutions and alternatives. For example, positions design processing procedures used by others. This class also includes the work leader that involves the performance of such duties as assigning work and scheduling, as described in the Line/Staff Authority factor.",
            "This class describes the third-level accounting technician. The type of duties are similar to those performed by the Accounting Technician II though the decision making level allows for flexibility in deciding how operations will be completed.",
            "This class describes positions with supervisory duties and responsibilities.",
            "This class describes the fully-operational, professional (licensed) engineer. Positions in this level apply the engineering sciences and mathematics to analysis or design of projects or programs with engineering components. The work typically includes duties as responsible charge engineer which may involve lower level engineering positions. This class is distinguished from the Engineer-In-Training II class in professional (licensed) responsibility for engineering as is reflected in the higher level of Complexity.",
            "This class describes the first-level technician. Positions in this level provide basic support to engineers or scientists by following standard, pre-established procedures, tests, or formulas. The work includes running standard tests, measurements, or quantitative analyses on samples; operating equipment or instruments as instructed; recording and comparing results with established standards or specifications; collecting field data or samples; and recording information on tests, samples, or activities. Positions also maintain equipment and supplies and may initiate orders to replenish such. Although this is a non-supervisory class, some positions may give work direction or check the work of other positions.",
            "This class describes the second-level technician. In addition to work described by the Technician I class, positions in this level have responsibility for decisions on the operations needed to complete the work. Positions decide how and what work is accomplished in an engineering or physical sciences work area.",
            "This class describes the first-level supervisor or staff authority. In addition to work described in previous levels, positions in this level have responsibility for decisions that affect the pay, status, or tenure of others.",
            "This class describes the first-working level. Positions in this level install, operate, troubleshoot, and repair telecommunications or electronic equipment. The work entails responding to work orders or requests for service, working with customers to identify problems or faults, and then completing repairs or ordering necessary parts. Positions record actions taken to solve problems and may initiate billing for services. Positions operate necessary test equipment and maintain tools and supplies.",
            "This class describes the fully-operational level. In addition to work described by the lower levels, positions in this level decide when and how installation and repair actions will occur. The work includes a variety of telecommunications or electronic maintenance activities. Positions are expected to use judgment in selecting or creating solutions to unusual problems or faults. The work entails modifications to existing equipment or installation of new types of devices requiring practical innovations for power, heat, or cooling requirements.",
            "This class describes the work leader or staff authority level. In addition to work described by the previous class, positions in this level have work leader responsibilities over others. This may include assigning work, evaluating the quality of work performed, instructing and training on new equipment, or advising on equipment faults. This class also describes those positions functioning as agency authorities on a subject matter where managers and peers rely on the position for expert advice and consultation.",
            "This class describes the supervisory level. Positions in this level have responsibility for establishing installation, maintenance, or operating processes used by others. The work also includes responsibility for decisions which affect the pay, status, or tenure of others.",
            "This class describes the first-level laboratory coordinator. Positions in this level oversee and monitor the activities of a laboratory. Duties include, but are not limited to, scheduling the use of and/or setting up of laboratory apparatus and equipment, materials and supplies, and space; training students or others to use laboratory equipment to conduct experiments; ordering supplies, maintaining inventories, and distributing supplies; ordering, maintaining, and repairing apparatus and equipment; developing laboratory record keeping systems and maintaining appropriate laboratory records; and producing necessary reports concerning laboratory activities.",
            "This class describes the second-level laboratory coordinator. While duties and responsibilities are similar to those of a Teaching Laboratory Coordinator I, positions have greater decision making responsibility for selecting experimental methods and test procedures and may have work leader responsibilities.",
            "This class describes the highest-level laboratory coordinator. In addition to the duties and responsibilities of laboratory coordinators, positions at this level have greater responsibility for designing laboratory processes, writing laboratory manuals, and teaching courses."
        ]
    ],
    "pageTitle": "Job Definitions",
    "title": "",
    "url": "http://www.cu.edu/print/employee-services/human-resources/job-definitions",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00272-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 398781391,
    "recordOffset": 398734711,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{43065=Any position in CU's 2200 series (university staff positions) is exempt from the State Personnel System. Contact the appropriate HR department [2] for more information.}",
    "lastModified": "Wed, 05 Aug 2015 10:36:52 GMT",
    "textBeforeTable": "Clinical Faculty The rank of Senior Instructor permits higher recognition and salary than that of Instructor. Senior Instructors are not tenure-eligible and their service as Senior Instructor does not count toward the award of tenure. Senior Instructors are usually employees at will. Only Senior Instructors who engage in 50% or more clinical activity may be appointed to limited or indeterminate appointments. All other Senior Instructors are at will employees by law. Individual schools and colleges may require Senior Instructors to perform scholarly and/or service activities, but must make clear distinctions between Instructors/Senior Instructors and tenure-track Assistant Professors in terms of job qualifications, work assignments or expectations. 1311 Senior Research Instructor This title is held by individuals competent to carry out research or scholarly work of a quality comparable to that produced by a graduate student research assistant. Other persons eligible to be considered for appointment to the PRA title would be individuals, such as Graduate Student Teaching Assistants, who possess professional skills and competencies that can be applied to assist the professor directly in the support of the research program. A PRA works in a collaborative role with the principal investigator and contributes substantively to the investigation and analysis of the project. As a collaborator on the project, the PRA may receive full credit as co-author of publications and technical reports, and shares responsibilities in the research setting. A",
    "textAfterTable": "PHYSICIAN 2410 Physicians are licensed practitioners who provide professional medical assessment, diagnosis, and treatment for patients in both routine and emergency settings.  Duties are performed in accordance with established standards and ethics of medical practice.   PSYCHOLOGIST 2411 Psychologists are licensed to provide psychological counseling and treatment of emotional, behavioral and psychological disorders, including conducting initial evaluations utilizing interview, psychological assessment instruments and other available information; formulating care/treatment plans for psychological interventions; recommending referrals; and maintaining appropriate documentation of services.  Positions may also provide psycho-educational workshops, crisis intervention, emergency counseling, and outreach and consultation with students, parents, faculty, and staff regarding counseling-related issues to the campus community.  These assignments may include supervision of psychologist trainees or interns. HOSPITALITY Jobs in this career family provide hosting services for students, parents, faculty, staff, other visitors and guests of the University. Functions include food service management, catering, event planning, hotel operations and conference services. Title Job Code Title Definition HOSPITALITY DIRECTOR 2420",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}