{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "It is one of the spendier colleges but I find my experiences and education totally worth it!!",
            "Go to games, swimming, bowling, movies, party's!",
            "Food is great not only is the campus food good but there are tons of local places just around campus!",
            "Great dorms! The RA's are always very helpful!",
            "You are expected to do your work and do it well and on time. The professors are great and definitely test your knowledge and skills",
            "Best school I have been to! Great teachers and smaller class sizes. Great campus!!"
        ]
    ],
    "pageTitle": "Pacific University-Oregon Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pacific-University-Oregon/reviews?_escaped_fragment_=/show/79650",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00017-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900037163,
    "recordOffset": 899978245,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{260632=© 2015, Cappex.com, LLC, 11759=Pacific University is an expensive school, with the projected cost for the 2009-2010 school year at over $39,000. As daunting as this figure may look, Pacific does offer good “bang for the buck”. I have found that the books and supplies estimate is much higher than the actual cost, as long as you are frugal. Also, Pacific offers many scholarship opportunities, including merit based scholarships, competitive academic scholarships, special interest scholarships, and need based scholarships. These scholarships can cover a large part of the tuition. For example the honors merit scholarship is worth $12,000 per year. This year, I received a scholarship from Pacific, which I hadn’t even applied for. I believe the schooling at Pacific is of much higher quality than many other less expensive schools. The student to faculty ratio is 13:1. This enables you to develop relationships with teachers who know you by name and are willing to spend extra time to help you understand a subject or further pursue an interest. Each of these things add value to the educational experience offered at Pacific University. I believe the quality of the education is worth the cost, as long as you are willing to work hard and have education as a top priority., 8569=The teacher to student rate is 1:19 . It is a private school and the average graduation percentage is 71% !}",
    "textBeforeTable": "12/03/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 54 Tess from Bothell, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "11/10/2009 Reviewer is Researching this school. Reviewer has not been to campus. 3 out of 7 people found this review useful. 2 of 54 Categories Comments Great for these types of students The school is quite diverse and I heard that there is a strong Hawaiian influence in the college. Any one would feel welcome here. Its a tight net community and its truly welcoming. Tips for prospective students Come visit the school or talk to an admissions counselor. It wont hurt to check the college out. Bang for the buck Everyone knows that Private schools are known for their academic excellence and sure it can cost a little more, but wouldn't you want to have a higher chance of succeeding? Will enjoy being here The area is beautiful . It is also 60 miles away from the Oregon coast and 80 miles away from Mt. Hood. Will learn a lot The teacher to student rate",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}