{
    "relation": [
        [
            "Code or Value",
            "0",
            "1",
            "."
        ],
        [
            "Value Description",
            "At or above the detection limit",
            "Below lower detection limit",
            "Missing"
        ],
        [
            "Count",
            "50",
            "2050",
            "194"
        ],
        [
            "Cumulative",
            "50",
            "2100",
            "2294"
        ],
        [
            "Skip to Item",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "NHANES 2007 - 2008: Polyfluorinated Compounds Data Documentation, Codebook, and Frequencies",
    "title": "",
    "url": "http://www.cdc.gov/nchs/nhanes/nhanes2007-2008/PFC_E.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00261-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 354530255,
    "recordOffset": 354517860,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10309=Organic fluorochemicals are used in multiple commercial applications including surfactants, lubricants, paints, polishes, food packaging and fire-retarding foams. Several of these polyfluorochemicals (PFCs) are ubiquitous contaminants found both in humans and animals worldwide. Perfluorooctane sulfonate (PFOS) has been used in a wide variety of industrial and consumer products including protective coatings for carpets and apparel, paper coatings, insecticide formulations, and surfactants. In May 2000, the 3M Company, the sole manufacturer of PFOS in the United States and the principal manufacturer worldwide, announced that it was discontinuing the production of perfluorooctanyl fluoride-based chemistries, including PFOS. Perfluorooctanoic acid (PFOA) is used primarily to produce its salts which are used in the production of fluoroelastomers and fluoropolymers, such as polytetrafluoroethylene (PTFE) and polyvinylidine fluoride (PVDF). PTFE has numerous uses in many industrial and consumer products, including coatings on textiles and carpet; uses in the automotive, mechanical, aerospace, chemical, electrical, medical, and building/construction industries; personal care products; and non-stick coatings on cookware. PVDF is used primarily in electrical/electronics, building/construction, and chemical processing industrial sectors., 6479=The NHANES QA/QC protocols meet the 1988 Clinical Laboratory Improvement Act mandates. Detailed QA/QC instructions are discussed in the NHANES LPM., 11066=Title: Polyfluorinated Compounds (PFC_E ) Contact Number: 1-866-441-NCHS Years of Content: 2007 - 2008 First Published: October, 2010 Revised: October, 2013 Access Constraints: None Use Constraints: None Geographic Coverage: National Subject:Polyfluorinated Compounds Record Source: NHANES 2007 - 2008 Survey Methodology: NHANES 2007 - 2008 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files}",
    "lastModified": "Fri, 09 May 2014 20:25:55 GMT",
    "textBeforeTable": "Both males and females 12 YEARS - 150 YEARS Target: Two-year MEC weights of subsample C English Text: Two-year MEC weights of subsample C SAS Label: WTSC2YR Variable Name: WTSC2YR - Two-year MEC weights of subsample C Both males and females 12 YEARS - 150 YEARS Target: Respondent sequence number. English Text: Respondent sequence number SAS Label: SEQN Variable Name: SEQN - Respondent sequence number Codebook and Frequencies Westgard J.O., Barry P.L., Hunt M.R. Clin Chem (1981) 493. Kuklenyik Z, Needham LL, Calafat AM. Measurement of 18 perfluorinated organic acids and amides in human serum using on-line solid-phase extraction. Anal Chem 2005;77:6085-6091. Caudill SP, Schleicher RL, Pirkle JL. Multi-rule quality control for the age-related eye disease study. Statist Med 2008;27:4094-4106. References Please refer to the Analytic Guidelines for further details on the use of sample weights and other analytic issues. 0.2 LBXPFDO Perflurododecanoic acid 0.2 LBXPFUA Perfluoroundecanoic acid 0.1 LBXPFSA Perfluorooctane sulfonamide 0.082 LBXPFNA Perfluorononanoic acid 0.4 LBXPFHP Perfluoroheptanoic acid 0.1 LBXPFBS Perfluorobutane sulfonic acid 0.2 LBXPFDE Pefluorodecanoic acid 0.2 LBXMPAH 2-(N-Methyl-perfluorooctane",
    "textAfterTable": "LBXEPAH SAS Label: 2-(N-ethyl-PFOSA) acetate English Text: 2-(N-Ethyl-perfluorooctane sulfonamido) acetic acid Target: Both males and females 12 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 0.14 to 1.5 Range of Values 2100 2100 . Missing 194 2294 LBDEPAHL - 2-(N-ethyl-PFOSA) acetate comment Variable Name: LBDEPAHL SAS Label: 2-(N-ethyl-PFOSA) acetate comment English Text: 2-(N-Ethyl-perfluorooctane sulfonamido) acetic acid comment code Target: Both males and females 12 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 0 At or above the detection limit 72 72 1 Below lower detection limit 2028 2100 . Missing 194 2294 LBXPFDE - Perfluorodecanoic acid Variable Name: LBXPFDE SAS Label:",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}