{
    "relation": [
        [
            "Patent application number",
            "20110052796",
            "20120204791",
            "20140014032",
            "20140070689",
            "20140199496"
        ],
        [
            "Description",
            "METHOD AND DEVICE FOR PRODUCING STOICHIOMETRY GRADIENTS AND LAYER SYSTEMS - A process and a device for coating substrates with a stoichiometric gradient in an in-line coating system include at least two evaporation devices, each with an evaporator tube. The evaporator tubes are implemented so as to be tiltable independently of one another, whereby the transition area of the two vapor lobes can be adapted to the requirements of the gradient profile. Furthermore, the spacing of the evaporator tubes from the substrate and each other can be set.",
            "APPARATUS FOR TRANSPORTING STRIP-LIKE MATERIAL - An apparatus for transporting strip-like material, has a treatment roller and at least one transporting or strip-gliding roller. The at least one transporting or strip-guiding roller is arranged upstream or downstream of the treatment roller, and comprises a twisting roller having an axis of rotation which encloses an angle other than 0° in relation to an axis of rotation of the treatment roller. The twisting roller rotates the course taken by the strip-like material in relation to the course defined by the surface of the treatment roller.",
            "DEVICE FOR PRODUCING STOICHIOMETRY GRADIENTS AND LAYER SYSTEMS - A process and a device for coating substrates with a stoichiometric gradient in an in-line coating system include at least two evaporation devices, each with an evaporator tube. The evaporator tubes are implemented so as to be tiltable independently of one another, whereby the transition area of the two vapor lobes can be adapted to the requirements of the gradient profile. Furthermore, the spacing of the evaporator tubes from the substrate and each other can be set.",
            "SUBSTRATE TREATMENT INSTALLATION - A substrate treatment installation includes an installation chamber and a light source for the exposure of substrates to light. The light source is arranged in the interior of the substrate treatment installation and includes at least one discharge lamp arranged in a housing, which is permeable to light at least in sections and has a vacuum-tight cavity for accommodating the lamp, and also at least one reflector element arranged in spatial proximity to the at least one lamp and having an electrical connection.",
            "METHOD AND DEVICE FOR PRODUCING A LOW-EMISSIVITY LAYER SYSTEM - A method for producing a low-emissivity layer system includes the steps of forming at least one low-emissivity layer on at least one side of the substrate by deposition, and subsequent brief tempering of a deposited low-emissivity layer by electromagnetic radiation, avoiding an immediate heating up of the substrate. A device for performing the method includes a flash lamp arrangement."
        ],
        [
            "Published",
            "03-03-2011",
            "08-16-2012",
            "01-16-2014",
            "03-13-2014",
            "07-17-2014"
        ]
    ],
    "pageTitle": "Gross, DE - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/gross-de-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00111-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 431146535,
    "recordOffset": 431105994,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Harald Gross, Langebrueck DE 02-10-2011 SUPPLY DEVICE - The invention relates to a supply device ( 20110030599 06-11-2009 Vacuum Pump - A vacuum pump for producing a vacuum in a space which is to be evacuated comprises a housing ( 20090148284 Published Description Patent application number Hans-Rochus Gross, Bergisch Gladbach DE 04-09-2009 Refrigerator Unit and/or Freezer Unit - The present invention relates to a refrigerator unit and/or a freezer unit comprising a cooling tank, which includes an inner tank having a refrigerated space, and an evaporator. The present invention furthermore relates to a method of installing a refrigerator unit and/or freezer unit in which an evaporator as well as at least one further electrical and/or technical cooling functional component are inserted in an inner tank of the refrigerator unit and/or freezer unit and are fastened to an inner tank wall. Installing the various electrical and technical cooling components after one another individually at different positions of the inner tank of the unit and individually connecting them to the outwardly disposed electronics of the unit is avoided with the present invention. Already installing individual components before the foaming of the unit tank is in particular also avoided, whereby the housing handling is considerably facilitated. In accordance with the invention, at least a substantial part of the electrical and technical cooling components, in particular the evaporator, the evaporator sensor and the refrigerated space sensor,",
    "textAfterTable": "Patent applications by Harald Gross, Langebrueck DE Heinz-Jürgen Gross, Mulheim An Der Ruhr DE Patent application number Description Published 20090252615 Cooled Turbine Rotor Blade - A cooled turbine rotor blade for a gas turbine which is traversed axially by flow and is equipped with an attachment area and an airfoil profile is provided. Meandering cooling channels with interposed deflecting regions are provided in the interior of the airfoil profile. In the deflecting regions, it is possible to prevent dead water regions, which are generated in the prior art, by virtue of at least one of the ribs running so as to curve towards the leading edge or towards the trailing edge in the region of the airfoil tip. At the same time, an opening is provided in the curvature of the rib. Through this opening a part of the coolant flows in the deflecting region and can pass over into the adjacent cooling duct. 10-08-2009 20100054952 Turbine Blade - A turbine blade comprising a plurality of ribs arranged one after the other in a cooling channel extending along a leading edge is provided. The plurality of ribs is split into pairs of ribs formed by two ribs arranged",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}