{
    "relation": [
        [
            "",
            "35. Were you adequately informed about the procedure?",
            "36. Were you given information about the biological nature of the fetus?",
            "37. Were you well informed about the procedure and fetus through other sources before seeking an abortion?",
            "38. Was your decision made in consultation with your doctor?",
            "39. Were you encouraged to ask questions?",
            "40. Were your questions thoroughly answered to your satisfaction?",
            "41. Do you believe there was information you were not given, or were misinformed about?",
            "42. Were risks and dangers discussed?"
        ],
        [
            "N/A or Unsure",
            "4%",
            "4%",
            "1%",
            "2%",
            "6%",
            "19%",
            "8%",
            "7%"
        ],
        [
            "Not at All",
            "49%",
            "90%",
            "83%",
            "70%",
            "64%",
            "52%",
            "10%",
            "65%"
        ],
        [
            "",
            "17%",
            "3%",
            "7%",
            "4%",
            "16%",
            "12%",
            "1%",
            "16%"
        ],
        [
            "",
            "15%",
            "2%",
            "5%",
            "5%",
            "8%",
            "8%",
            "4%",
            "5%"
        ],
        [
            "",
            "10%",
            "0%",
            "0%",
            "6%",
            "3%",
            "4%",
            "4%",
            "4%"
        ],
        [
            "Very Much",
            "6%",
            "2%",
            "4%",
            "14%",
            "2%",
            "4%",
            "73%",
            "4%"
        ]
    ],
    "pageTitle": "A Survey of Aborted Women | After Abortion",
    "title": "",
    "url": "http://afterabortion.org/1999/a-survey-of-aborted-women/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00333-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 4907983,
    "recordOffset": 4885244,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 30 Jul 2015 09:50:30 GMT",
    "textBeforeTable": "The survey discussed in Chapter One was distributed through WEBA chapters to 252 women in 42 states. It consisted of two sections: background information and the actual survey questions. The instructions read as follows: APPENDIX TWOSurvey Results Despite the fact that this sample cannot be generalized to the whole population, the results do appear to be representative of the experiences of those women who do have difficulties after an abortion. This is a legitimate reference point in and of itself. This study is analogous to studying a group of patients who all becoming ill from, for example, an artificial sweetener. It is proper scientific method to study the symptoms and experiences of this group of “sick” patients. Only then can their “illness” be cataloged and a hypothesis be developed. Only after identifying the primary symptoms could one then go out and survey all users of the artificial sweetener to determine how widespread these symptoms may be. This latter stage is part of our ongoing work. In referring to the findings of this study, then, it would be most appropriate to say, for example, “Of women who report post-abortion problems, 53% felt ‘forced’ to abort by one or more other people, and 39% report feeling very much ‘forced’ to abort by others.” Note, this was a survey of women who had some involement with Women Exploited By Abortion, a peer support group for women who were experiencing negative post-abortion reaction. Because this is a self-selected",
    "textAfterTable": "High age at time of survey: 64 yrs Average time since abortion: 10.0 yrs (Survey age minus abortion age) Greatest time since abortion: 36 yrs Least time since abortion: 7 months RACE OR ETHNIC ORIGIN White 87% Other 13% LEGAL AND ILLEGAL ABORTIONS Legal 92% Illegal 8% EDUCATION LEVELDegree Equivalent No Answer Under 12 yrs High School (12 yrs) Associate or Trade (13-14) Bachelors (15-16) Masters (17-18) Ph.D. (>18) 5% 6% 39% 26% 19% 4% 1% WEEKS PREGNANT AT TIME OF ABORTION <5 wks 5-6 7-8 9-10 11-12 13-24 >24 2% 13% 23% 18% 24% 19% 0% Average gestation at time of abortion: 10.2 wks Low gestation at time of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}