{
    "relation": [
        [
            "Element",
            "Process Excel URL Links check box",
            "Process Excel mailto Links check box",
            "Process Excel UNC Links check box",
            "Update button",
            "Reset button"
        ],
        [
            "Description",
            "Specifies whether links to external URLs (for example, http://www.company.com) in Microsoft Excel spreadsheets should be converted to links in the generated PDF files.",
            "Specifies whether links to e-mail addresses (for example, mailto:support@company.com) in Microsoft Excel documents should be converted to the corresponding links in the generated PDF files.",
            "Specifies whether links to both absolute URL links (for example, http://www.company.com) and relative URL links (for example, ../../../../portal.htm) in Microsoft Excel documents should be converted to corresponding links in the generated PDF files.",
            "Saves changes to settings.",
            "Reverts to the last saved settings."
        ]
    ],
    "pageTitle": "A User Interface",
    "title": "",
    "url": "http://docs.oracle.com/cd/E21764_01/doc.1111/e10800/e01_interface.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 73780879,
    "recordOffset": 73746768,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{140302=False: the refinery is unavailable and the time of the next update attempt is displayed. For example: False Next update at: 3/26/ 5:01 AM}",
    "lastModified": "Wed, 13 May 2015 05:18:56 GMT",
    "textBeforeTable": "Access this Inbound Refinery page by selecting Conversion Settings, then selecting Third-Party Application Settings and clicking the Options button for Microsoft Excel. A.21 Excel Options Page Reverts to the last saved settings. Reset button Saves changes to settings. Update button Specifies whether markups in Microsoft Word documents should be included in the generated PDF files (requires Word XP or later). Print Document with Word Markup check box Specifies whether links to both absolute URL links (for example, http://www.company.com) and relative URL links (for example, ../../../../portal.htm) in Microsoft Word documents should be converted to corresponding links in the generated PDF files. Process Word UNC Links check box Specifies whether comments added to Microsoft Word documents should be converted to notes in the generated PDF files. Process Document Comments to PDF Notes check box Specifies whether links to footnotes and endnotes in Microsoft Word documents should be converted to links in the generated PDF files. Process",
    "textAfterTable": "A.22 PowerPoint Options Page Access this Inbound Refinery page by selecting Conversion Settings, then selecting Third-Party Application Settings and clicking the Options button for Microsoft PowerPoint. Element Description Process PowerPoint Hyperlinks check box Specifies whether hyperlinks in PowerPoint presentations should be converted to hyperlinks in the generated PDF files. Process PowerPoint mailto Links check box Specifies whether links to e-mail addresses (for example, mailto:support@company.com) in PowerPoint documents should be converted to the corresponding links in the generated PDF files. Process PowerPoint Links to Internal Slides check box Specifies whether links to other slides within the same PowerPoint presentation should be converted to hyperlinks in the generated PDF files. Process PowerPoint UNC Links check box Specifies whether UNC links in",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}