{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Catholic",
            "Mainline Protestant",
            "Other",
            "None"
        ],
        [
            "Adherents",
            "3,450",
            "2,567",
            "1,367",
            "2",
            "8,018"
        ],
        [
            "Congregations",
            "18",
            "4",
            "11",
            "-",
            "-"
        ]
    ],
    "pageTitle": "Oxford, Wisconsin (WI 53952) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Oxford-Wisconsin.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00194-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 360519279,
    "recordOffset": 360396896,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{24580=Incorporated in 1912, 5800=According to our research of Wisconsin and other state lists there were 26 registered sex offenders living in Oxford, Wisconsin as of August 02, 2015. The ratio of number of residents in Oxford to the number of sex offenders is 35 to 1.}",
    "TableContextTimeStampAfterTable": "{24157=Hotels: Generations (1148 East Ormsby Street), Crossroads Motel (W6330 State Road 23)., 47799=2008 Presidential Elections Results, 30835=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 7.74. This is about average. Closest monitor was 24.5 miles away from the city center., 27893=Nitrogen Dioxide (NO2) [ppb] level in 2003 was 4.36. This is significantly better than average. Closest monitor was 17.2 miles away from the city center., 12869=On 9/26/1951, a category F4 (max. wind speeds 207-260 mph) tornado 26.8 miles away from the village center killed one person and injured 9 people and caused between $50,000 and $500,000 in damages., 47227=2000 Presidential Elections Results, 28640=Sulfur Dioxide (SO2) [ppb] level in 2004 was 1.66. This is about average. Closest monitor was 16.3 miles away from the city center., 30066=Particulate Matter (PM10) [µg/m3] level in 2012 was 11.7. This is significantly better than average. Closest monitor was 24.5 miles away from the city center., 44091=School Enrollment by Level of School (%) in 2013, 48369=Graphs represent county-level data. Detailed 2008 Election Results, 46941=1996 Presidential Elections Results, 61829=6.74% of this county's 2011 resident taxpayers lived in other counties in 2010 ($34,317 average adjusted gross income), 85443=Total of 2 patent applications in 2008-2015., 48085=2012 Presidential Elections Results, 86762=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 63651=6.53% of this county's 2010 resident taxpayers moved to other counties in 2011 ($26,599 average adjusted gross income), 43693=Educational Attainment (%) in 2013, 47513=2004 Presidential Elections Results, 12555=On 6/7/1984, a category F5 (max. wind speeds 261-318 mph) tornado 34.7 miles away from the Oxford village center killed 9 people and injured 200 people and caused between $50,000 and $500,000 in damages., 27246=Air Quality Index (AQI) level in 2012 was 78.0. This is about average., 29366=Ozone [ppb] level in 2012 was 37.3. This is about average. Closest monitor was 17.2 miles away from the city center.}",
    "textBeforeTable": "Religion statistics for Oxford village (based on Marquette County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Wood (3%) Bottled, tank, or LP gas (6%) Electricity (13%) Utility gas (77%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 5 Marquette County: 3.34 / 10,000 pop. Wisconsin: 1.86 / 10,000 pop. Number of convenience stores (with gas): 9 Marquette County: 6.02 / 10,000 pop. State: 4.12 / 10,000 pop. Number of full-service restaurants: 17 Here: 11.37 / 10,000 pop. State: 8.64 / 10,000 pop. Adult diabetes rate: This county: 9.2% Wisconsin: 7.6% Adult obesity rate: Marquette County: 30.3% Wisconsin: 27.5% Low-income preschool obesity rate: This county: 12.0% State: 13.0%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}