{
    "relation": [
        [
            "",
            "Combination Arm (FluCAM)",
            "Fludarabine Alone"
        ],
        [
            "Description",
            "Participants received both fludarabine (Fludara) and alemtuzumab (Campath) intravenously. Initial escalation of alemtuzumab from 3 to 30 mg (escalation can take up to 14 days). Up to six cycles of fludarabine 30 mg/m^2 intravenous (IV) followed by alemtuzumab 30 mg IV on the first 3 days of each 28 day cycle.",
            "Participants received fludarabine monotherapy 25 mg/m^2 IV daily for the first 5 days of each 28 day cycle for up to 6 cycles."
        ]
    ],
    "pageTitle": "Fludarabine (Fludara®) Plus Alemtuzumab (CAMPATH®, MabCampath®) vs Fludarabine Alone in B-Cell Chronic Lymphocytic Leukemia (B-CLL) Patients - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00086580?sect=Xh015&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00026-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 868852199,
    "recordOffset": 868835875,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups Treatment was from initiation of study drug(s) to 4 weeks after last administration of study drug. Follow-up was for those without disease progression and ended upon disease progression or primary endpoint analysis whichever came first. Observation included those with disease progression who were observed for alternative rx and overall survival. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details No text entered. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Biological: FluCAM [Fludara + Campath] Biological: fludarabine phosphate Interventions: B-Cell Chronic Lymphocytic Leukemia Condition: Allocation: Randomized;   Endpoint Classification: Safety/Efficacy Study;   Intervention Model: Parallel Assignment;   Masking: Open Label;",
    "textAfterTable": "Participant Flow for 3 periods Period 1:   Treatment Period     Combination Arm (FluCAM)     Fludarabine Alone   STARTED     168     167   Safety Population     164 [1]   165 [2] COMPLETED     103 [3]   107 [4] NOT COMPLETED     65     60   Disease progression                 9                 8   Unable to comply with protocol                 3  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}