{
    "relation": [
        [
            "Subject Matter",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products",
            "Food Processing & Food Products (Imaging)",
            "Food Processing & Food Products (Imaging)",
            "Food Processing & Food Products (Imaging)",
            "Food Processing & Food Products (Imaging)",
            "Food Processing & Food Products (Imaging)",
            "Food Processing & Food Products (Imaging)"
        ],
        [
            "Docket",
            "18.04",
            "58.07",
            "61.13",
            "109.06",
            "145.06",
            "20.04",
            "57.06 + 209.02",
            "121.08",
            "1.05",
            "53.11",
            "167.07",
            "67.11",
            "86.10",
            "90.10",
            "90.10",
            "5.13",
            "24.07",
            "45.13",
            "120.11",
            "95.13",
            "33.11",
            "18.06",
            "146.06",
            "104.07"
        ],
        [
            "Title",
            "USE OF NANOSECOND SCALE, TIME-RESOLVED, IMAGING TO DIFFERENTIATE CONTEMPORANEOUS FLUORESCENCE RESPONSES FROM MULTIPLE SUBSTANCES",
            "SIMULTANEOUS ACQUISITION OF FLUORESCENCE AND REFLECTANCE IMAGING TECHNIQUES WITH A SINGLE IMAGING DEVICE FOR MULTITASK INSPECTION",
            "SPREADABLE PRODUCTS DERIVED FROM RICE BRAN OIL",
            "GENES ENCODING FATTY ACID DESATURASES FROM SORGHUM BICOLOR",
            "TWO NOVEL ALKYLERESORCINOL SYTHASE GENE FROM SORGHUM; CLONING, EXPRESSION, TRANSFORMATION AND CHARACTERIZATION",
            "A NOVEL O-METHYLTRANSFERASE GENE FROM SORGHUM CLONING, EXPRESSION, TRANSFORMATION AND CHARACTERIZATION",
            "MODIFIED ALTERNAN",
            "NOVEL LIPID CONTAINING COMPOSITION PREPARED FROM STARCH-FATTY ACID COMPLEXES",
            "METHOD OF DETACHING MICROORGANISMS FROM, OR OF INHIBITING MICROBIAL ATTACHMENT TO, ANIMAL OR POULTRY CARCASSES OR SEAFOOD OR PARTS THEREOF",
            "METHOD FOR DETECTING AND DISTINGUISHING INFECTIOUS NOROVIRUS FROM INACTIVATED NOROVIRUS",
            "METHODS OF SEPARATING OIL FROM OIL-CONTAINING SEEDS",
            "PROCESSES FOR ISOLATING GLYCOMACROPEPTIDES",
            "DETECTION OF AFLATOXINS AND AFLATOXIGENIC ASPERGILLI IN NATURAL FUNGAL BOUQUETS",
            "A DEVICE FOR THE MEASUREMENT OF GLUTEN QUALITY IN WHEAT MEALS AND FLOURS",
            "METHOD AND APPARATUS FOR MEASURING PROTEIN QUALITY",
            "FUMIGANT AND ITS APPLICATION METHOD FOR PEST CONTROL",
            "FURANOCOUMARIN REMOVAL FROM GRAPEFRUIT JUICE BY EDIBLE FUNGAL HYPHAE",
            "UTILIZATION OF NON-NUTRITIVE ADSORBENTS TO SEQUESTER MYCOTOXINS DURING EXTRACTION OF PROTEIN OR OTHER VALUE ADDED COMPONENTS FROM MYCOTOXIN CONTAMINATED CEREAL OR SEED OIL MEAL",
            "SINGLE-CAMERA MULTI-MIRROR IMAGING METHOD AND APPARATUS FOR WHOLE-SURFACE INSPECTION OF ROTATING OBJECTS",
            "LINE-SCAN RAMAN IMAGING METHOD AND SYSTEM FOR SAMPLE EVALUATION",
            "METHODS FOR ROTATING ROUND OBJECTS FOR WHOLE-SURFACE LINE-SCAN IMAGING",
            "FRUIT BIN FILLER AND ACCUMULATING MECHANISM",
            "SORTING OF AGRICULTURAL PROCESS STREAMS",
            "PORTABLE MULTISPECTRAL IMAGING SYSTEMS"
        ],
        [
            "Description",
            "Time-dependent differences in fluorescence responses of normal surfaces of the fruit or vegetable as opposed to surfaces which are contaminated with feces, may be used for improved detection of feces-contaminated fruits and vegetables. In this process, the surface of a fruit or vegetable which contains a native chlorophyll is illuminated with a pulse of UV or visible light having a wavelength effective to elicit fluorescence of feces of a plant consuming animal.",
            "This disclosure describes an invention of an opto-electronics imaging technology and methodology to simultaneously capture line-scan based multispectral combinations of fluorescence and reflectance images of fast-moving objects using a single imaging device.",
            "A solvent fractionation procedure for the production of a spreadable product derived from rice bran oil. The product resembles a nut butter in both appearance and texture.",
            "These fatty acid desaturases sequentially catalyze the formation of polyunsaturated fatty acids, starting from the precursor palmitoleic acid to yield a unique hexadecatrienoic acid, possessing an unusual terminal double bond.",
            "Two cDNA clones, designated SbLRS1 and SbLRS2, coding for polyketide synthases were isolated from sorghum. These polyketide synthases catalyze the formation of phenolic lipids, utilizing fatty acyl-CoA precursors plus malonyl-CoA.",
            "A novel O-methyltransferase gene was isolated from Sorghum bicolor and the recombinant enzyme was shown in vitro to use resveratrol as a substrate and produce pterostilbene. This metabolite is also beneficial to human health by acting as a strong antioxidant (Martinez and Moreno, 2000; Stivala et al., 2001) and by having cancer chemopreventive properties (Jang et al., 1997).",
            "Four new Penicillium spp. isolates (NRRL 21996, NRRL 21967, NRRL 21968 and NRRL 21969) are capable of essentially quantitative conversion of native alternan to a polymeric modified form having a lower apparent molecular weight than native alternan. It would have utility as a substitute for gum arabic for uses such as bulking agents and extenders in foods and cosmetics. 209.02Four new Penicillium spp. isolates (NRRL 21966, NRRL 21967, NRRL 21968, and NRRL 21969) are capable of essentially quantitative conversion of native alternan to a polymeric modified form having a lower apparent molecular weight than native alternan. A fifth isolate (NRRL 30489) obtained from a survey of deposited organisms and classified as a Penicillium subgenus Biverticillium has the same ability.",
            "This invention covers starch-oil compositions prepared from amylose-containing starches",
            "Methods of detaching microorganisms (e.g., bacteria) from, or of inhibiting microbial (e.g., bacterial) attachment to, animal or poultry carcasses or seafood or parts thereof, wherein the method involves contacting animal or poultry carcasses or seafood or parts thereof at least once with at least one of the following: (i) a polysulfated polysaccharide, (ii) carboxymethyl cellulose, or (iii) guanidine or arginine, optionally together with sodium chloride and at least one non-ionic surfactant, or (iv) mixtures thereof.",
            "The USDA has discovered that inactivation processes that damage the virus capsid generally results in norovirus that can’t attach to its receptor (as judged by inability to interact with swine mucin). Thus using swine mucine, it is possible to distinguish between infectious norovirus and inactivated norovirus; using swine mucin magnetic beads, it is possible to extract only potentially infectious norovirus leaving behind inactivated virus. By marrying this virus extraction method to RT-PCR detection techniques, ARS has made a practical assay for detection of infectious norovirus.",
            "Nitrogen is pumped through a fritted disk at the bottom of a column containing an aqueous dispersion of finely milled germ. Foam containing 10% oil and surfactant protein overflowed through an outlet and is collected.",
            "This invention recovers a high value peptide from excess whey products generated by the cheese-making industry and will aid utilizing whey protein products, increasing their commercial value and generating additional income for the dairy industry by providing a novel, beneficial nutraceutical ingredient at a low cost and in kilogram quantities.",
            "The invention reports the ability to detect the unique volatile organic compound (VOC) emission output of aflatoxigenic aspergilli while in a natural fungal bouquet commonly found on almonds that have undergone standard processing and is ready for storage and/or shipping.",
            "The invention is an electronic device for measuring gluten quality in cereals, specifically wheat grain.",
            "The invention is an electronic device for measuring gluten quality in cereals, specifically wheat grain. Measurement is based on sedimentation of ground grain meal or flour hydrated with acidic detergent, specifically sodium dodecylsulfate in lactic acid.",
            "The invention provides methods for post harvest disinfection of agricultural commodities using a nitric oxide as a fumigant.",
            "The invention involves the use of fungal tissue for the removal of highly lipophilic furanocoumarins from grapefruit juice. This invention involves the nearly quantitative binding/adsorption of the grapefruit furanocoumarins to heat-killed (autoclaved) fungal hyphae.",
            "A method for the removal of mycotoxins from cereal or oil seed meal that includes the use of a mycotoxin sequestrant to form a food grade composition for human consumption. The composition contains no more or less than an FDA approved level of mycotoxin for a human food product.",
            "A device and method for automated whole-surface imaging and inspection of round-shaped objects such as fruits or vegetables. The device is a single-camera multi-mirror imaging inspection system to detect surface defects and selected contamination on the outer surface of objects by rotation of the object either in place or while traveling on a processing line.",
            "A line-scan-based hyperspectral Raman chemical imaging system that can be used to inspect bulk powder foods for contaminant detection and ingredient authentication.",
            "This invention addresses the implementation of automated whole-surface imaging of round-shaped fruits without pause or interruption to the objects' travel on a continuously moving processing line.",
            "The invention features a unique system for receiving fruit, randomly distributed from a feed conveyor, accumulating the fruit in a uniform mass, and then carefully placing it in a bin. Placement of fruit into a bulk container without damage or with minimal damage is a critical function on picking aids, mechanical harvesters, and especially in packing sheds. The fruit industry does not have a commercial \"dry\" bin filler that does not inflict damage to fruit during filling.",
            "The invention relates to an apparatus for automated sorting of objects comprising a population, and for methods of sorting using same.",
            "Our invention is a two-band spectral imaging system that acquires images of two spectral bands simultaneously. To measure spectral response of the objects in a form of bundle of images, often called multi- or hyper-spectral imaging, is useful tool to identify the presence of specific substance and is widely used in agricultural industry such as food inspection and remote sensing."
        ]
    ],
    "pageTitle": "ARS : Office of Technology Transfer (OTT)",
    "title": "",
    "url": "http://www.ars.usda.gov/business/Docs.htm?docid=763&page=7&pf=1&cg_id=0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00204-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 301035483,
    "recordOffset": 300984028,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1343=B 0001.08 (hybridoma cell line) C1749 MONOCLONAL ANTIBODY}",
    "TableContextTimeStampAfterTable": "{67586=2014 National Federal Laboratory Consortium Award, 55933=USDA, Agricultural Research Service Office of Technology Transfer 5601 Sunnyside Avenue, Room 4-1159 Beltsville, MD 20705-5131 (301) 504-5989 / fax: (301) 504-5060 E-mail: license@ars.usda.gov, 64864=FY 2012      FY 2011     FY 2010     FY 2009     FY 2008, 67758=2014 Regional Federal Laboratory Consortium Award, 65694=FY 2007     FY 2006     FY 2005     FY 2004     FY 2003     FY 2002     FY 2001, 67240=2013 National Federal Laboratory Consortium Award, 67413=2013 Regional Federal Laboratory Consortium Award}",
    "textBeforeTable": "Each year, approximately 60 new patents are issued by the U.S. Patent Office for USDA inventions. The Office of Technology Transfer (OTT) transfers these inventions through licenses to the private sector for commercialization. Below are links to technologies that are available for licensing. Please contact OTT licensing staff for more information on a specific invention. Food Processing & Products Available Technologies   This invention comprises a shallow water u-tube which utilizes a large-scale airlift pump that is designed to transfer large volumes of aerated and/or oxygenated water at very low pumping head to the surface of an aquaculture pond.",
    "textAfterTable": "    Plant Genes Available Technologies Each year, approximately 60 new patents are issued by the U.S. Patent Office for USDA inventions. The Office of Technology Transfer (OTT) transfers these inventions through licenses to the private sector for commercialization. Below are links to technologies that are available for licensing. Please contact OTT licensing staff for more information on a specific invention.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}