{
    "relation": [
        [
            "Date",
            "2010-04-05 09:30:00",
            "2010-04-05 09:30:00"
        ],
        [
            "Roundtable Name",
            "Season Opener Roundtable",
            "Season Opener Roundtable"
        ],
        [
            "Comment",
            "\"Jake Green (LA): In 2015, who will be the best pitcher of the three? Tim Lincecum, Stephen Strasburg, or Aroldis Chapman?\" Good question. Today I'll go with Tiny Tim, since he's the proven quantity and I'm notoriously risk averse. Ask again in September, though, and you might well get a different answer. (Ken Funck)",
            "\"Jake Green (LA): In 2015, who will be the best pitcher of the three? Tim Lincecum, Stephen Strasburg, or Aroldis Chapman\" I really don't know how to answer these kinds of questions, to be honest. The analytical part of my brain kicks in and says that the margin of error on this sort of thing vastly swamps the difference between them in talent. So if you're sending in these questions and I'm not picking them, please don't feel slighted. I just honestly don't have a good answer for you, and don't feel like giving you a bad answer just to say I did. (Colin Wyers)"
        ]
    ],
    "pageTitle": "Aroldis Chapman | Baseball Prospectus",
    "title": "",
    "url": "http://www.baseballprospectus.com/card/card.php?id=53014",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00024-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 310425351,
    "recordOffset": 310382992,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{308336=Aroldis Chapman has thrown 5,445 pitches that have been tracked by the PITCHf/x system between 2009 and 2015, including pitches thrown in the MLB Regular Season, the MLB Postseason, The World Baseball Classic and Spring Training. In 2015, he has relied primarily on his Fourseam Fastball (101mph), also mixing in a Slider (88mph) and Change (89mph)., 31795=Last Update: 12/31/2014 23:59 ET}",
    "lastModified": "Sun, 02 Aug 2015 20:39:38 GMT",
    "textBeforeTable": "BP Roundtables You know, for some reason the team I always come back to for questions like this is the Reds. Not that I EXPECT their young guys to take a step forward so much as that I'm interested to see if they can. To see if pitchers like Johnny Cueto, Mike Leake or Aroldis Chapman can succeed in that ballpark, under Dusty. To see if Jay Bruce finally lives up to the hype, if Chris Dickerson can hold down a regular corner spot. I don't actually root for the Reds, but I've been intrigued by their collection of talent for years. (Jay Jaffe) Jay, who are your pet players this year? Guys you expect to put themselves on the map or take an underrated step forward? (slim from Fairfield Cty) 2010-03-26 13:00:00 (link to chat) He'll be called up. He's already in Triple-A, so I think if he can keep the walks under control that he'll be called up sooner than later. I'm holding on to him in an NL-only, but if you're in a mixed, non-keeper and have someone who can help you just as much (and sooner) it may be worth it to get them. (Marc Normandin)",
    "textAfterTable": "  PITCHf/x Pitcher Profile A Collaboration between BrooksBaseball.net and Baseball Prospectus - Pitch classifications provided by Pitch Info LLC Aroldis Chapman has thrown 5,445 pitches that have been tracked by the PITCHf/x system between 2009 and 2015, including pitches thrown in the MLB Regular Season, the MLB Postseason, The World Baseball Classic and Spring Training. In 2015, he has relied primarily on his Fourseam Fastball (101mph), also mixing in a Slider (88mph) and Change (89mph).   Baseball Prospectus Analysis Blog Radio Events Newsletter Search News Player Cards Player Search Team Audit Statistics Fantasy Player Forecast Manager Depth Charts Team Tracker Hacking Mass Team Health Reports BP.com Terms of Service Customer Service Privacy Policy Contact Us Glossary AMERICAN LEAGUE Baltimore Orioles",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}