{
    "relation": [
        [
            "Job Title",
            "Kitchen team members for fun, healthy café at Bay Area Discovery Museum",
            "Bilingual Education Coordinator – Community Partnerships",
            "Public Programs Intern",
            "Development Intern",
            "Graphic Design Intern"
        ],
        [
            "Location",
            "Sausalito, CA",
            "Sausalito, CA",
            "Sausalito, CA",
            "Sausalito, CA",
            "Sausalito, CA"
        ]
    ],
    "pageTitle": "Events - Entry Level Jobs, Internships, and Career Overview",
    "title": "",
    "url": "http://www.onedayonejob.com/jobs-internships/events/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00033-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 619407167,
    "recordOffset": 619274820,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{226583=Major League Lacrosse - Major League Lacrosse is a Brighton, MA based professional lacrosse league that had its first games in 2001 and plans to expand extensively over the next decade., 295867=Copyright © 2007-2015 One Day, One Job. All rights reserved., 52961=Conrad N. Hilton Foundation - Conrad N. Hilton Foundation is an Agoura Hills, CA based non-profit “family foundation established in 1944 by the man who started Hilton Hotels.”}",
    "textBeforeTable": "Washington sports outdoors non-profit finance events education conservation all employers accounting See the complete The Mountaineers profile The Mountaineers - The Mountaineers is a Seattle based non-profit that has “been teaching skills, sharing adventures, creating volunteers, and conserving land” for more than a century. Companies with Entry Level Jobs and Internships in Events Food Music Sports Arts Design Entertainment Careers Related to Event Planning Party Event Business Event Planning Professionals Networking Opportunities Pathable Parties, Planning, & Pretty Little Things A Lifestyle Thing Outstanding Occasions Birch Design Studio Event Manager Blog Blogs and Websites @EPACommunity @BelovelyEvents",
    "textAfterTable": "See all 442 job postings Krash - Krash is based in Boston and offers a “way for founders, entrepreneurs and innovators to rapidly build the supportive personal and professional networks they need.” See the complete Krash profile all employers California community management events Illinois marketing Massachusetts New York Washington DC Job Title Location Summer City Launch Intern New York, NY Summer City Launch Intern Boston, MA See all 2 job postings Fever - Fever is a New York, NY and Madrid, Spain based startup social network that is “changing the way people make plans.” See the complete Fever profile all",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}