{
    "relation": [
        [
            "Air pollutant",
            "Dust",
            "SO2",
            "NO2",
            "CO",
            "CO2",
            "CH4",
            "N2O"
        ],
        [
            "Unit",
            "kg/106m3",
            "kg/106m3 x %Sc",
            "kg/106m3",
            "kg/106m3",
            "kg/106m3",
            "kg/GJ",
            "kg/GJ"
        ],
        [
            "Value",
            "15",
            "2 x Sc",
            "1 280",
            "360",
            "1 964 000",
            "0.0014",
            "0.0001"
        ]
    ],
    "pageTitle": "CC:INFO/AIJ: REPORT",
    "title": "",
    "url": "http://unfccc.int/kyoto_mechanisms/aij/activities_implemented_jointly/items/1905.php?middle=j",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00057-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 254137979,
    "recordOffset": 254099714,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{108618=1999 - II stage boiler houses (gas), 166308=The gas boilers installed in the second stage started their operation in the middle of October 1999. Their reduced emissions in 1999 concerns a period of 76 days in 1999 autumn season. For the winter/spring seasons of 1999 (114 days) the emission from old coal fired boilers is assumed. The time shares of two fuel types in 1999 for the group of II stage was following:, 106451=1067.77, 156509=For the years after 1999, no additional training was foreseen., 57959=Yes – monitoring reports in 1998 and 1999 and emissions data from ECO S.A., 48187=1998, 44962=The project started in 1998 and is divided into two stages. At first stage (realization in 1998) 10 boiler houses were the subject of modernization (including one boiler house was liquidated, users were connected to the other modernised boiler house). At second stage (realization in 1999) remaining 6 boiler houses were modernized, where already nine modern gas-fired boilers were installed. The boilers were started-up at the end of September and began the operation in the middle of October. Their reduced emissions in 1999 concerned a period of 76 days in autumn season, which was 40% of 1999 boilers operation time., 118230=1999 GHG emissions for entire project can be evaluated as a sum of I and II stage emissions:, 95900=1196, 121965=The predicted GHG emission amounts to approx. 1700 Mg CO2eq per year. This prediction can be checked and verified in forthcoming years using the measurements of gas consumption and heat consumption, which will be continued in next years., 119906=Emission of GHG in the next years can be provisionally evaluated basing on measurements / monitoring of input energy in 1999, with following assumptions:, 120176=for II stage boiler houses: input energy can be estimated as 10/4 of 1999 gas energy (20398 GJ), 48301=1999, 46373=Training component was realised in 1999., 62886=- 6348 Mg CO2 equivalent - for 1997 fuel consumption (option I);, 138848=2001, 167959=The results showed GHG calculated emission 14.3% (required power) or 19.7% (installed power) higher then the emission evaluated from 1997 fuel consumption. Basing on that result „measuring error\" of baseline can be evaluated at the level of 15-20%., 120679=2000 and next years GHG emissions for entire project, 177665=© 2014 United Nations Framework Convention on Climate Change, 107342=1195.34, 123126=2000, 62459=- 16 % higher then 1997 consumption for required power option., 56658=The total 1999 annual emission of greenhouse gases was 47.3% lower then baseline in terms of CO2 equivalent. For the individual GHG gases the reduction ranges from 46.4% (CO2) to 78.4% (CH4)., 44687=31-12-1999, 63562=Emission - 1997 fuel consumption, 44472=01-01-1998, 121643=1699.3, 155333=Individual training for Byczyna secondary ecological school teachers, followed by the object lesson given by KAPE in Byczyna for the group of teachers and students in January 2000, 103775=2544.88, 88635=GAS 2000 / 20, 119603=1936.5, 152330=Training component in 1999 was realised by knowledge transfer seminars, educational program for schools as well as general information on the project., 115613=2448.7, 118576=1999 GHG emissions for entire project, 102197=1999 - I stage boiler houses (gas), 59252=The estimated difference (cost reduction) between baseline and 1999 environmental fee is at the level of 20,000 PLN per year, so environmental fees can be treated as economic aspect that influences total operational costs of heat production., 130150=Environmental effects achieved in the year 2000 were determined by comparison of emission magnitudes estimated earlier, using both the baseline study and values of emission needed for calculation and assignment of environmental fees, collected for commercial use of natural resources in this year. The amounts of released greenhouse gases such as CO2, CH4, and N2O correspond to emissions quantified prior in the baseline study. Nevertheless, the volume of primary emission of residual pollutants has not been published in this document and these data originate from ECO S.A. in result of its’ computations. With regards to methodology of calculations, the markers based method were applied – supposing the following set of indexes:, 118169=1999 emissions for entire project, 54304=voivodeship lists of priority projects regarding environmental protection for 1998,, 48495=2013, 114251=1999 GHG emissions for II stage group of boiler houses, 108154=Total 1999 CO2 equivalent emission for I stage amounts to 578.0 Mg/a., 84319=1701, 10631= June 2001, 113427=The gas boilers installed in the second stage started their operation in the middle of October 1999. Their reduced emissions in 1999 concerns a period of 76 days in 1999 autumn season. For the winter/spring seasons of 1999 (114 days) the emission from old coal fired boilers is assumed. So the time shares of two fuel types in 1999 for the group of II stage boiler houses was following:, 158946=1280, 156912=GHG emissions in 1999 were calculated basing on below emission factors, gas calorific values, gas fuel consumption measurements and the results of baseline study., 101532=The light-marked boiler houses were the subject of modernisation in 1998 (I stage). The dark-marked boiler house was dismantled, users were connected to the modernised boiler house at ul. Dluga 8. Other boiler houses were modernised in 1999 (II stage)., 89386=GAS 2000 ECO / 16, 45592=Realisation of project was conducted according to the schedule for 1999. This implicates that there have been no changes in project conditions, compared to the situation as described in the baseline and first monitoring report. The only change in the technical realisation was the final destination of a boiler type GAS 3000 ECO/9. This boiler was mounted in another building instead of the originally selected building. As the size and thermal quality of this replacing building is comparable to the originally selected, this change do not affect the emission levels in baseline and monitoring reports., 61980=Fuel consumption in 1997 amounted to 2569 Mg:, 46205=Two monitoring studies were conducted in 1998 and 1999. The data concerning monitoring 2000 have been transferred by Opole District Heating Energy Enterprise., 113909=Using the above shares the 1999 GHG emissions for II stage boiler houses were calculated:, 135617=The volume of emission of pollutants in the year 2000, were quantified using the methodology founded on markers recommended by Minister of Environment on purpose to determine the pollutants charge aimed at allocation of fees for commercial use of environmental resources. Aforementioned markers both for CH4 and N2O were admitted on same levels like in baseline study., 82947=The project started in 1998 and is divided into two stages. At first stage (realization in 1998) 10 boiler houses were the subject of modernization (including one boiler house was liquidated, users were connected to the other modernised boiler house). At second stage (realization in 1999) remaining 6 boiler houses were modernized., 59929=Yes – monitoring report in 1999., 108255=Input energy and GHG emissions for gas-fired II stage boiler houses in 1999 are presented in the table below:, 68090=- Ba1 = B’97 consumption of fuel registered in 1997, 96269=1494, 62542=Parameters of fuel used in 1997 (not every data were available):, 56892=Instead in 2000, when already all new boiler- houses have been operating, reductions in emissions of relevant greenhouse gases expressed in percents were following: 79,6% - CO2, 99,6% - CH4, 98,3% - N2O, 88281=GAS 2000 ECO / 20, 118052=Total 1999 CO2 equivalent emission for II stage boiler houses amounts to 3426.8 Mg/a., 91638=Realisation of project was conducted according to the schedule for 1999. This implicates that there have been no changes in project conditions, compared to the situation as described in the base line and first monitoring report. The only change in the technical realisation was the final destination of a boiler type GAS 3000 ECO/9. This boiler was mounted in another building (Moniuszki 4) instead of the originally selected building. As the cubature and thermal quality of this replacing building is comparable to the originally selected, this change will not affect the emission levels in base line and monitoring reports., 101805=Input energy (gas consumption times calorific value) and GHG emissions for I stage boiler houses in 1999 are presented in the table below:, 120080=for I stage boiler houses: input energy equal to 1999 gas energy (10497 GJ), 67832=in the case when information on 1997 consumption of fuel was not available the value calculated for installed boilers power was assumed as annual consumption, 62373=- 19,2 % higher then 1997 consumption for installed power option;, 60912=The starting point was existing state evaluated for 1997. Below the results of baseline study are presented as well as description of methodology., 166773=Using the above shares GHG emissions in 1999 for II stage boiler houses were calculated using the option no. 2 of baseline study calculations.}",
    "textBeforeTable": "Please fill in one table for each participant/actor. For individuals fill in as from item \"Function within activity\". A. 2) Participants/actors: Reduction of Atmospheric Pollution through modernisation of HEAT Supply system in the Town of ByCzyna. A. 1) Title of project: A. Description of project The uniform reporting format contained below is to be used in reporting on activities implemented jointly under the pilot phase. It is noted that the reporting should be consistent with decision 5/CP.1 and 8/CP.2. The SBSTA notes that the uniform reporting format could possibly require revision in the light of experience gained and methodological work conducted under the pilot phase. ACTIVITIES IMPLEMENTED JOINTLY UNDER THE PILOT PHASE UNIFORM REPORTING FORMAT: List of Projects  June 2001 Reduction of Atmospheric Pollution through modernisation of HEAT Supply system in the Town of ByCzyna Activities Implemented Jointly Under the Pilot Phase Uniform Reporting Format:   ACTIVITIES IMPLEMENTED JOINTLY(AIJ) Your location: Home Please choose Activities Implemented Jointly Admin. &",
    "textAfterTable": "Country: Netherlands Telephone: +31 55 549 34 93 Fax: +31 55 541 98 37 E-mail: WWW-URL: Contact person (for this activity): -------------------------------------------------------------- Surname: Mr. Brand, B.Sc. First name, middle name: Roel Job title: Direct tel.: +31 55 549 38 03 Direct fax: +31 55 549 37 40 Direct E-mail: Roel.Brand@mep.tno.nl a) Organisation includes: institutions, ministries, companies, non-governmental organisations, etc. involved in the activity, i.e. research institutes associated with the project, auditors, government agency closely following the activity.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}