{
    "relation": [
        [
            "Payment method",
            "Money order/Cashiers cheque",
            "Other - See seller's payment instructions"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/2003-Sea-Doo-GTX-Used-Jet-Ski-Trailer-for-Sale-California-/121368256832?pt=Personal_Watercraft&hash=item1c421ca140",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00136-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 408063539,
    "recordOffset": 408017874,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{54952=CATHEDRAL CITY, CALIFORNIA 92234, 48586=2003 Sea Doo GTX 10'8\" Used Jet Ski, 74203=Payment Terms - The winning bidder should contact Car Angel/Boat Angel immediately after close of auction to confirm the intended payment arrangements. Go to payment info page. A deposit is due within 24 hours of the end of the auction, in the amount stated of the final selling price. This deposit is nonrefundable should the buyer fail to pay the remaining balance when due. The deposit may be paid either via Pay Pal, or Cashier’s Check or Money order VIA OVERNIGHT COURIER addressed to: Boat Angel 1641 E University Dr Ste 104 – Mesa, AZ 85203. The balance is due within 2 days of the end of the auction. Payment of the balance may be made via cashier's check, money order or Pay Pal. In the event contact is not made within 24-hours of the end of the auction and/or payments are not made by the specified times, Car Angel/Boat Angel reserves the right to re-list the item. We also reserve the right to re-list the item if the telephone number provided from a buyer’s eBay information is incorrect. After payment is made the buyer has only seven days to inspect and remove the item. Items left by buyer or buyer’s agent for longer than 30 days at the storage yard, marina, repair shop, dealership or donor designated storage location shall be deemed abandoned and shall render the Bill of Sale void. Abandoning the item will cause the entire proceeds paid to Boat Angel to be forfeited and the item shall be at the sole discretion of Boat Angel to be available for resale. If the buyer prior to the 30 days enters a contract with a marina, storage yard, repair facility, etc., that item shall not be considered abandoned and the buyer shall pick it up at his or her sole determination not subjecting the donor/consignee to any fees for that storage period., 49475=Year: 2003, 60850=For Repeat Buyers: Repeat buyers only, will be rewarded with a discount on the current purchase. Purchases with a final bid price above $5000 will receive a $100 discount limited to the bid price, and purchases with a final bid price of $1000 to $5000 will receive a $50 discount limited to the bid price. Winning bids below $1000 will receive no repeat buyer discount. NO REPEAT BUYER DISCOUNT FOR NON-US BIDDERS. Repeat buyers may only win one auction every 10 days.}",
    "textBeforeTable": "Full Payment Payment details Go to the Gigamoves website Want a personalized quote from one of these transport companies?  Sign in to get free shipping quotes. Shipping Quotes Shipping to: United States, Canada Item Location:Cathedral City, California, United States If your vehicle is near you, just make arrangements with the seller to pick it up. If it's further away, you can either fly or drive to the car's location, or you can hire a shipping service to get it delivered to your door. The seller may have additional options available, so check their description for more information Shipping and handling Seller assumes all responsibility for this listing. 00000 Ask a question - opens in a new window or",
    "textAfterTable": "Full payment is required within 3 days of auction close Seller's payment instructions Payment in FULL within 48hrs. PHONE 602-903-4449 Contact after the sale we need your address for instructions.$299 document handling fee due immediately through PayPal upon winning bid or the item may be re-listed/resold. Call with any questions, DO NOT just email. 4 people available in office Mon-Fri. Payment HELP at BOATANGEL.ORG/PAYMENTS Please fax proof of all wires and direct deposits to 480 668 4855. Send Cashiers checks & money orders overnight Vehicle Purchase Protection This vehicle is eligible for up to $50,000 in Vehicle Purchase Protection in the event that you never receive after you have paid for it or sent a refundable deposit. To qualify for Vehicle Purchase Protection you must be the winning bidder or an auction or click the Buy It Now button directly on the eBay site. Additional eligibility may apply. Please refer to the full terms, conditions and restrictions Financing Get Low Monthly Payments on the Vehicle You Always Wanted! Get Pre-approved at netLoan Funding | Estimate monthly payment Monthly Payment Calculator",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}