{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3",
            "Step 4",
            "Step 5",
            "Step 6",
            "Step 7",
            "Step 8",
            "Step 9",
            "Step 10",
            "Step 11",
            "Step 12",
            "Step 13",
            "Step 14",
            "Step 15",
            "Step 16",
            "Step 17",
            "Step 18"
        ],
        [
            "Command or Action",
            "enable Example: Router> enable",
            "configure terminal Example: Router# configure terminal",
            "frame-relay switching Example: Router(config)# frame-relay switching",
            "interface type slot / port Example: Router(config)# interface serial0",
            "encapsulation frame-relay [ietf] Example: Router(config-if)# encapsulation frame-relay",
            "frame-relay interface-dlci dlci switched Example: Router(config-if)# frame-relay interface-dlci 122 switched",
            "frame-relay intf-type [dce] Example: Router(config-fr-dlci)# frame-relay intf-type dce",
            "exit Example: Router(config-if)# exit",
            "vc-group group-name Example: Router(config)# vc-group groupa",
            "interface type slot / port FR-DLCI FR-SSCS-DLCI Example: Router(config-vc-group)# serial 1/0 100 100",
            "exit Example: Router (config-vc-group)# exit",
            "interface atm slot / port . subinterface-number {multipoint | point-to-point} Example: Router(config)# interface atm 0/1.22 multipoint",
            "pvc vpi / vci Example: Router(config-subif)# pvc 0/33",
            "encapsulation aal5mux frame-relay Example: Router(config-if-atm-vc)# encapsulation aal5mux frame-relay",
            "exit Example: Router(config-if-atm-vc)# exit",
            "exit Example: Router(config-if)# exit",
            "connect connection-name vc-group group-name ATM-interface ATM-VPI/VCI Example: Router(config)# connect frf5-v vc-group groupa atm0 0/33",
            "Do one of the following: clp-bit {0 | 1 | map-de} de-bit map-clp Example: Router(config-frf5)# clp-bit 0"
        ],
        [
            "Purpose",
            "Enables privileged EXEC mode. Enter your password when prompted.",
            "Enters global configuration mode.",
            "Enables Frame Relay permanent virtual circuit (PVC) switching.",
            "Enters interface configuration mode.",
            "Enables Frame Relay encapsulation. Use the ietf keyword to set the encapsulation method to comply with the Internet Engineering Task Force (IETF) standard (RFC 1490). Use the ietf keyword when connecting to another vendor's equipment across a Frame Relay network.",
            "Indicates that a Frame Relay data-link connection identifier (DLCI) is switched and enters Frame Relay dlci configuration mode. The dlciargument is the DLCI number to be used on the specified interface or subinterface.",
            "Configures a Frame Relay switch type. Use the dce keyword if the router or access server functions as a switch connected to a router.",
            "Exits interface configuration mode.",
            "Assigns multiple Frame Relay DLCIs to a VC group and enters ATM-Frame Relay VC group configuration mode.",
            "Specifies the Frame Relay DLCIs in the VC group and maps them to the Frame Relay-SSCS DLCIs.",
            "Exits ATM-Frame Relay VC group configuration mode.",
            "Creates an ATM subinterface and enters subinterface configuration mode. The arguments and keywords are as follows: slot --Number of the slot being configured. Refer to the appropriate hardware manual for slot and port information. port --Number of the port being configured. Refer to the appropriate hardware manual for slot and port information. subinterface-number --Subinterface number in the range 1 to 4294967293. The number that precedes the period (.) must match the number to which this subinterfce belongs. multipoint --Multipoint interface. point-to-point --Point-to-point interface.",
            "Creates an ATM permanent virtual circuit (PVC) or assigns a name to an ATM PVC. The arguments are as follows: vpi / --ATM network virtual path identifier (VPI) for this PVC. The absence of the \"/\" and a VPI value defaults the VPI value to 0. vci -- ATM network virtual channel identifier (VCI) for this PVC. The VCI is a 16-bit field in the header of the ATM cell. The VCI value is unique only on a single link, not throughout the ATM network, because it has local significance only. The vpi and vci arguments cannot both be set to 0; if one is 0, the other cannot be 0.",
            "Configures the ATM adaptation layer (AAL) and encapsulation type for an ATM permanent virtual circuit (PVC) and enters ATM VC configuration mode.",
            "Exits ATM VC configuration mode.",
            "Exits interface configuration mode.",
            "Configures an FRF.5 one-to-one connection between two Frame Relay end users over an intermediate ATM network and enters FRF.5 configuration mode. The arguments and keywords are as follows: connection-name --A connection name. Enter as a 15-character maximum string. vc-group --Specifies a VC group name for a many-to-one FRF.5 connection. Enter as an 11- character maximum string. ATM-interface --The ATM interface type and number, for example, atm1/0. ATM-VPI/VCI --The ATM virtual path identifier/virtual channel identifier (VPI/VCI). If a VPI is not specified, the default VPI is 0.",
            "Sets the ATM cell loss priority (CLP) bit field in the ATM cell header. or Sets the discard eligible (DE) bit mapping from ATM to Frame Relay."
        ]
    ],
    "pageTitle": "Asynchronous Transfer Mode Configuration Guide, Cisco IOS Release 15M&T - Enhanced Voice and QoS for ADSL and G.SHDSL [Cisco IOS 15.5M&T] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/atm/configuration/15-mt/atm-15-mt-book/atm-v-qos-gshdsl.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00075-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 370624111,
    "recordOffset": 370558385,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{99860=Support was added for Cisco 1720, Cisco 1750, Cisco 1751, and Cisco 1760., 47489=When you configure the ip rtp header-compression command, the router adds the ip tcp header-compression command to the configuration by default. The ip tcp header-compression command is used to compress the TCP/IP packets of the headers. Header compression is particularly useful on networks that have a large percentage of small packets, such as those supporting many Telnet connections. The TCP header compression technique, described fully in RFC 1144, is supported on serial lines that use High-Level Data Link Control (HDLC) or PPP encapsulation., 45033=Multilink PPP (MLP), standardized in RFC 1990, is similar to load-balancing techniques in that it sends packets across the individual links in a round-robin fashion. However, MLP adds three significant capabilities:, 27711=The maximum data rate between an SCC and a DSL WIC depends primarily on the maximum clock rate that the SCC can support. For example, on the Cisco 2600 series mainboard, which supports two DSL WICs, the total SCC clock rate that can be configured for both WICs is 8 Mbps. Therefore, if only one DSL WIC is present on the mainboard, AAL5 and AAL2 clock rates can be configured to 7 Mbps and 1 Mbps, respectively. If two DSL WICs are supported on the mainboard, the total of 8 Mbps should be distributed among the four SCCs., 41156=If a Cisco router terminates the PPP over Ethernet (PPPoE) traffic, a computer connected to the Ethernet interface may have a problem accessing websites. The solution is to manually reduce the maximum transmission unit (MTU) configured on the computer by constraining the TCP maximum segment size (MSS). To manually reduce the MTU configured on the computer, use the ip tcp adjust-msscommand. The mss argument value must be 1452 or less., 16588=Refer to the Release Notes for the Cisco 1700 Series Routers for Cisco IOS Release 12.2(8)YN document for caveat information for multiple PVCs., 48929=The Compressed Real-Time Protocol (cRTP) feature reduces bandwidth consumption on real-time applications such as voice. Thus, by using cRTP, you can further improve voice quality. Configuring cRTP can save troubleshooting time by isolating potential cRTP issues. Based on RFC 2508, the RTP header compression feature compresses the IP, User Data Protocol (UDP), and Real-Time Transport Protocol (RTP) header (IP/UDP/RTP header) from 40 bytes to 2 or 4 bytes, reducing unnecessary bandwidth consumption. RTP header compression is a hop-by-hop compression scheme; therefore, cRTP must be configured on both ends of the link (unless the passive option is configured)., 31358=For more information about analog voice interface support, refer to the Voice Port Testing Enhancements in Cisco 2600 and 3600 Series Routers and MC3810 Series Concentrators., 100168=Support was added for Cisco 2610-2651, Cisco 3620, Cisco 3640, and Cisco 3660., 27165=Network module SCCs also pose similar limitations. That is, on the Cisco 2600 series, the total clock rate for all four SCCs is 8 Mbps. The maximum AAL5 clock rate that may be configured on a network module is 5.3 Mbps. On the Cisco 1700 series, the maximum configurable SCC clock rate for both AAL5 and AAL2 is 8 Mbps., 79012=RFC 1483 Bridging, 78715=RFC 1483 Routing, 14221=For information about RFC 1483 bridging, refer to the following documents:, 37728=For information about virtual circuit (VC) bundling, refer to Configuring an ADSL WAN Interface Card on Cisco 1700 Series Routers ., 12085=For information about Survivable Remote Site Telephony (SRST), refer to the Survivable Remote Site Telephony Cisco 2600/3600 Voice Technical Marketing solutions document., 99557=Enhanced voice and QoS features were added for Cisco 1720, Cisco 1721, Cisco 1751, Cisco 1760, Cisco 2610XM-2651XM, Cisco 3640, Cisco 3640A, and Cisco 3660., 100464=This feature was introduced. The Cisco 1720 did not support voice., 39494=You can configure the size of the tx ring for each permanent virtual circuit (PVC). The default value is 60. However, the value of the setting can be 1 through 60 on Cisco 1700 series routers and 3 through 60 on Cisco 2600 and Cisco 3600 series routers. A low tx ring setting, such as 2 or 3, is required for latency-critical traffic. For example, when the tx ring limit is configured as 3 and LLQ is configured on the PVC, the worst case delay for a voice packet is the time required to transmit three data packets. When the buffering is reduced by configuring the tx ring limit, the delay experienced by voice packets is reduced by a combination of the tx ring and LLQ mechanism.}",
    "TableContextTimeStampAfterTable": "{27856=For Cisco 2600 and 3600 series routers, the minimum value for ADSL and G.SHDSL is 1 Mbps. The maximum value is 7 Mbps for mainboard slots and 5.3 Mbps for network modules. The default value for ADSL and G.SHDSL is 2.6 Mbps for both mainboard slots and network modules., 239430=Specifies a maximum size in units of time for packet fragments on a MLP bundle. The delay-max argument is the maximum amount of time, in milliseconds, that it should take to transmit a fragment. The range is from 1 to 1000 milliseconds., 297897=The following output is from a Cisco 1721 router. This example shows how to create an FRF.5 one-to-one connection using the the connect command with the network-interworking keyword., 295386=The following example from a Cisco 2621 network module shows that the clock rate on the AAL5 channel is set to the maximum value of 5.3 Mbps on interface ATM 1/0:, 41165=The system limitation for Cisco 2600 and Cisco 3600 series routers is that the total SCC clock rate that can be configured for one or more WICs is 8 Mbps. The following troubleshooting tips for Cisco 2600 and Cisco 3600 routers explain situations for which warning and error messages can be received because of the 8 Mbps limitation., 295115=The following example from a Cisco 2621 mainboard module shows that the clock rate on the AAL5 channel is set to the maximum value of 7 Mbps on interface ATM 0/0:, 294860=The following example from a Cisco 1760 router shows that the clock rate on the AAL2 channel is set to the value of 5.3 Mbps on interface ATM 1/0:, 41710=1.    If you configure a clock rate that exceeds the maximum limit, the configuration will fail. In the following example (on a Cisco 2621 router), both the AAL5 SCC and the AAL2 SCC have been configured to 4 Mbps. Then an additional 7 Mbps are configured on the AAL5 SCC., 356521=RFC 1213, 309130=The following output is from a Cisco 2600 router that is configured for tx ring-limit tuning:, 294599=The following example from a Cisco 1760 router shows that the clock rate on the AAL5 channel is set to the minimum value of 4 Mbps on interface ATM 0/0:, 300285=The following output is from a Cisco 1721 router. This example shows how to create an FRF.8 connection using the the connect command with the service-interworking keyword., 99678=Router(config-if-atm-vc)# vbr-rt 1500 1500, 17489=The following is sample output using the show atm pvc command on a Cisco 1721 router that show detailed information about the PVC. In this example, five packets are sent, with the CLP set to 1., 115708=Specifies a maximum size in units of time for packet fragments on a MLP bundle. The delay-max argument is the maximum amount of time, in milliseconds, that it should take to transmit a fragment. The range is from 1 to 1000 milliseconds., 222723=The following show command output is from a Cisco 1721 router. Use the show connection all or show connection id commands to check the state of the connection. Use show frame-relay pvc command to verify the state of the Frame Relay PVC and use show atm pvc commandto verify the state of the ATM PVC., 34056=To verify the clock rate setting for an ADSL WIC or G.SHDSL WIC on a Cisco 1700, Cisco 2600, or Cisco 3600 series router, use the show running-config or the show controllers atmcommand in EXEC mode., 93747=Router(config-if)# ip address 172.100.10.10 255.255.255.0, 292439=The following output is from a Cisco 1721 router. In this example, all output packets that have an IP precedence value of 0 are sent with the CLP set to 1., 28133=To make full use of the 2.3 Mbps bandwidth for VoATM non-switched trunk calls on G.SHDSL, you can change the 1 Mbps default value on Cisco 2600 series and Cisco 3600 series routers and configure the AAL2 clock rate as 2.6 Mbps., 308359=The following output is from a Cisco 1751 router. The tx ring limit is configured on an ATM PVC interface., 340777=RFC 1483 bridging, 303342=The following example was configured on a Cisco 2600 router equipped with two xDSL WICs., 192303=The following show command output is from a Cisco 1721 router. Use the show connection all or show connection id commands to check the state of the connection. Use the show frame-relay pvc command to verify the state of the Frame Relay PVC, and use the show atm pvc command to verify the state of the ATM PVC., 36959=The following show controllers atm example from a Cisco 2621 router shows verification of the SCC clock rates for ATM interface 0/0 on mainboard slot 0 and ATM interface 0/1 on mainboard slot 1:, 337980=QoS features on Cisco 1700 series routers, 236355=Router(config-if)# ip address 172.10.10.0, 250988=The default value is 60. On Cisco 1700 series routers, possible values are 1 through 60. On Cisco 2600 and Cisco 3600 series routers, possible values are 3 through 60.}",
    "textBeforeTable": "DETAILED STEPS de-bit map-clp clp-bit {0 | 1 | map-de} 18.   Do one of the following: 17.    connect connection-name vc-group group-name ATM-interface ATM-VPI/VCI 16.    exit 15.    exit 14.    encapsulation aal5mux frame-relay 13.    pvc vpi / vci 12.    interface atm slot / port . subinterface-number {multipoint | point-to-point} 11.    exit 10.    interface type slot / port FR-DLCI FR-SSCS-DLCI 9.    vc-group group-name 8.    exit 7.    frame-relay intf-type [",
    "textAfterTable": "Verifying FRF.5 The following show command output is from a Cisco 1721 router. Use the show connection all or show connection id commands to check the state of the connection. Use the show frame-relay pvc command to verify the state of the Frame Relay PVC, and use the show atm pvc command to verify the state of the ATM PVC.  Router# show connection all ID Name Segment 1 Segment 2 State ======================================================================== 1 frf5 Serial0 100 ATM0 0/33 UP Router# show connection id 1 FR/ATM Network Interworking Connection: frf5 Status - UP Segment 1 - Serial0 DLCI 100 Segment 2 - ATM0 VPI 0 VCI 33 Interworking Parameters - fr-sscs-dlci 1022 de-bit map-clp clp-bit map-de Router# show frame-relay pvc 100 PVC Statistics for interface Serial0 (Frame Relay DCE) DLCI = 100, DLCI USAGE = FRF.5, PVC STATUS = ACTIVE, INTERFACE = Serial0 input pkts 5 output pkts 5 in bytes 520 out bytes 520 dropped pkts 0 in pkts dropped 0 out pkts dropped 0 out bytes dropped 0 in FECN pkts 0 in BECN pkts 0 out FECN pkts 0 out BECN pkts 0 in DE pkts 0 out DE pkts 0 out bcast pkts 0 out bcast bytes 0 5 minute input rate 0 bits/sec, 0 packets/sec 5 minute",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}