{
    "relation": [
        [
            "Patent application number",
            "20110105687",
            "20120095223",
            "20120095224",
            "20120095225",
            "20130023629",
            "20130041111",
            "20130053520"
        ],
        [
            "Description",
            "CROSSLINKING AGENT, AND CROSSLINKING POLYMER COMPOSITION AND MOLDED PRODUCT FORMED OF THE SAME - The present invention provides a crosslinking agent which is excellent in processing characteristics and crosslinking performance, and is capable of preventing staining of a molded product upon molding in a metal mold which tends to be induced when using the crosslinking agent together with a triallyl isocyanurate. The crosslinking agent of the present invention comprises an isocyanurate derivative represented by the following general formula (I):",
            "TRIALLYL ISOCYANURATE, TRIALLYL CYANURATE AND PROCESS FOR PRODUCING TRIALLYL ISOCYANURATE - The present invention provides triallyl isocyanurate comprising a less amount of corrosive substances by identifying the corrosive substances among impurities included in the triallyl isocyanurate. Triallyl isocyanurate of the present invention comprises an organic chlorine compound represented by the following general formula (I) in an amount of not more than 100 ppm:",
            "TRIALLYL ISOCYANURATE AND PROCESS FOR PRODUCING THE SAME - The present invention provides triallyl isocyanurate comprising a less amount of corrosive substances by identifying the corrosive substances among impurities included in the triallyl isocyanurate. Triallyl isocyanurate of the present invention comprises an organic chlorine compound represented by the following chemical formula (I) in an amount of not more than 500 ppm:",
            "METHOD OF STORING TRIALLYL ISOCYANURATE - The present invention provides a method of storing TAIC in which TAIC is prevented from suffering from freezing and solidification during storage thereof in the winter season. In the method of the present invention, the triallyl isocyanurate is mixed with a silane coupling agent to prepare a composition comprising both thereof, and the resulting composition is stored. In the preferred embodiment of the present invention, the silane coupling agent is used in an amount of 5 to 30% by weight based on the weight of the triallyl isocyanurate, and γ-methacryloxypropyl trimethoxysilane is used as the silane coupling agent.",
            "TRIAZINE DERIVATIVES AND APPLICATION THEREOF - The object of the present invention is to provide a novel triazine derivative which is excellent in the heat resistance and rapid in the cross-linking rate, and can be suitably used as a crosslinking agent.",
            "CROSS-LINKING AGENT FOR CROSS-LINKABLE ELASTOMER AND APPLICATION THEREOF - The object of the present invention is to provide a cross-linking agent for a cross-linkable elastomer which is rapid in the cross-linking rate in comparison with triallyl isocyanurate (TAIC).",
            "CROSS-LINKING AGENT FOR CROSS-LINKABLE ELASTOMERS AND APPLICATION THEREOF - The object of the present invention to provide a cross-linking agent for a cross-linkable elastomer which is excellent in the heat resistance and rapid in the cross-linking rate in comparison with triallyl isocyanurate (TAIC)."
        ],
        [
            "Published",
            "05-05-2011",
            "04-19-2012",
            "04-19-2012",
            "04-19-2012",
            "01-24-2013",
            "02-14-2013",
            "02-28-2013"
        ]
    ],
    "pageTitle": "Yamaura, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/yamaura-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00272-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440134607,
    "recordOffset": 440104019,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Mabuko Yamaura, Fukushima-Ken JP 02-09-2012 FUEL CELL APPARATUS - A fuel cell apparatus includes a fuel cell stack in which an end plate is arranged at both ends of a cell stacked body, and a conduit that is bolted to the fuel cell stack and that supplies and discharges fluid to and from the fuel cell stack. An end plate internal manifold that extends at an angle inclined with respect to a direction in which a stacked body internal manifold extends is formed inside the end plate. A conduit internal flow path is formed inside the conduit. A direction in which a portion that includes an end plate-connecting portion of the conduit internal flow path extends is inclined in the same direction as the direction in which the end plate internal manifold is inclined, with respect to a direction perpendicular to a surface of the end plate. 20120034545 04-07-2011 FUEL CELL - A fuel cell includes a stacked body formed by a plurality of single cells that are stacked together; two end plates, one of which is arranged on the outside of one end portion in the stacking direction of the plurality of single cells of the stacked body and the other of which is arranged on the outside of the other end portion in the stacking direction of the plurality of single cells of the stacked body; two fixing plates arranged on two opposing side surfaces, from among four side surfaces of",
    "textAfterTable": "Patent applications by Mabuko Yamaura, Fukushima-Ken JP Masaaki Yamaura, Kanagawa JP Patent application number Description Published 20110170897 CLEANING MEMBER FOR IMAGE FORMING APPARATUS, CHARGING DEVICE, PROCESS CARTRIDGE, AND IMAGE FORMING APPARATUS - The present invention provides a cleaning member for an image forming apparatus, including: an axle; and a belt-like elastic medium that is wound on the outer circumferential surface of the axle in a spiral shape and that includes a first edge portion in at least one of both ends in the width direction thereof and a second edge portion coming in contact with a surface to be cleaned at an angle different from that of the first edge portion. 07-14-2011 20110170898 CLEANING MEMBER FOR IMAGE FORMING DEVICE, CHARGING DEVICE, PROCESS CARTRIDGE, AND IMAGE FORMING DEVICE - A cleaning member 07-14-2011 20140119759 IMAGE FORMING APPARATUS - An image forming apparatus includes an image bearing member that bears a toner image; a transfer member that faces the image bearing member, nips a recording medium together with the image bearing member, and allows the recording medium to pass therebetween; a transfer-bias applying unit that applies transfer bias voltage to generate an electric field between the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}