{
    "relation": [
        [
            "Description",
            "Hypertext Transfer Protocol (HTTP)",
            "Secure Hypertext Transfer Protocol (HTTPS)"
        ],
        [
            "UDP",
            "--",
            "--"
        ],
        [
            "TCP",
            "80 (See note 2, Alternate Port Available)",
            "443 (See note 2, Alternate Port Available)"
        ]
    ],
    "pageTitle": "Technical Reference for Ports Used in Configuration Manager",
    "title": "",
    "url": "https://technet.microsoft.com/en-us/4b858b75-2e73-4d39-a508-b1f5c2b863bc",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00062-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 876866391,
    "recordOffset": 876849124,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{84904=Configuration Manager does not require the SQL Server Browser, which uses port UDP 1434., 13747=1433 (See note 2, Alternate Port Available), 5064=System Center 2012 Configuration Manager is a distributed client/server system. The distributed nature of Configuration Manager means that connections can be established between site servers, site systems, and clients. Some connections use ports that are not configurable, and some support custom ports you specify. You must verify that the required ports are available if you use any port filtering technology such as firewalls, routers, proxy servers, and IPsec., 3880=Updated: May 14, 2015, 93969=Intrasite communication between the SQL Server database engine and various Configuration Manager site system roles default to port TCP 1433., 3921=Applies To: System Center 2012 Configuration Manager, System Center 2012 Configuration Manager SP1, System Center 2012 Configuration Manager SP2, System Center 2012 R2 Configuration Manager, System Center 2012 R2 Configuration Manager SP1, 32052=2701, 93848=SQL Server Service, which defaults to port TCP 1433, 4649=This topic appears in the Site Administration for System Center 2012 Configuration Manager guide and in the Security and Privacy for System Center 2012 Configuration Manager guide., 102133=For information these ports, see the Required Configurations for Migration section in the Prerequisites for Prerequisites for Migration in System Center 2012 Configuration Manager topic., 53918=1433 (See note 2, Alternate Port Available)}",
    "textBeforeTable": "Applies To: System Center 2012 Configuration Manager, System Center 2012 Configuration Manager SP1, System Center 2012 Configuration Manager SP2, System Center 2012 R2 Configuration Manager, System Center 2012 R2 Configuration Manager SP1 Updated: May 14, 2015   Technical Reference for Ports Used in Configuration Manager Technical Reference for Ports Used in Configuration Manager Blogs Forums Support Downloads Gallery Learn Wiki Library Home Sign in United States (English) Skip to main content",
    "textAfterTable": "If you support Internet-based clients by using SSL bridging, in addition to port requirements, you might have to also allow some HTTP verbs and headers to traverse your firewall. For more information, see Prerequisites for Internet-Based Client Management in the Planning for Communications in Configuration Manager topic. The port listings that follow are used by Configuration Manager and do not include information for standard Windows services, such as Group Policy settings for Active Directory Domain Services and Kerberos authentication. For information about Windows Server services and ports, see Service overview and network port requirements for the Windows Server system. Configurable Ports Non-Configurable Ports Ports Used by Configuration Manager Clients and Site Systems Additional Lists of Ports AMT Out of Band Management Ports Client to Server Shares Connections to Microsoft SQL Server External Connections made by Configuration Manager Installation Requirements for Site Systems that Support Internet-Based Clients Ports Used by Configuration Manager Client Installation Ports Used by Migration Ports Used by Windows Server Configurable Ports Configuration Manager allows you to configure the ports for the following types of communication: Application Catalog Website point to Application Catalog web service point Enrollment proxy point to enrollment point Client to site systems that run IIS Client to Internet (as proxy server settings) Software update point to Internet (as proxy server settings) Software update",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}