{
    "relation": [
        [
            "Value",
            "1",
            "5",
            "-9",
            "-8",
            "."
        ],
        [
            "Label",
            "TRUE",
            "FALSE",
            "REFUSED",
            "DONT KNOW",
            "Missing"
        ],
        [
            "Frequency",
            "1567",
            "10099",
            "4",
            "11",
            "8332"
        ],
        [
            "Valid Percent",
            "13.43%",
            "86.57%",
            "-",
            "-",
            "-"
        ],
        [
            "Total Percent",
            "07.83%",
            "50.46%",
            "00.02%",
            "00.05%",
            "41.63%"
        ]
    ],
    "pageTitle": "all",
    "title": "",
    "url": "http://www.icpsr.umich.edu/icpsrweb/CPES/files/cpes/sections/BLPERSONA1/variables/all",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00157-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 516481587,
    "recordOffset": 516469930,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "5 FALSE 1 TRUE PEA40 I never met a person that I didn't like. Would you say this is true or false for you? Variable Label: Never met person didn't like NSAL PEA40 NLAAS PEA1 NCSR PEA40 CPES V03221 Home > Interactive Codebook > CPES > Personality > all How should I detect and handle the single PSU in a stratum for NLAAS or CPES Latino groups with Stata? CPES Variable Search Function is available now! Correction of the label of CPES V06442/NLAAS LI1 variable Are all NCS-R Screening Section questions asked of all respondents? How should I handle no subpopulation (Asian or Latino) members in a stratum for only NLAAS Asian or Latino groups with Stata? Announcements Search Data Processing Restricted Use Data Data Analysis Downloading Data Other Measures CIDI Diagnostics Disorder Weighting and Complex Designs Instrumentation Sample",
    "textAfterTable": "Disclaimer: Frequencies displayed above are not weighted. Missing Data Codes: -9 (Refused), -8 (Don't know), . (Missing) Total Cases: 20013 You can also view this variable in SDA . CPES V03223 NCSR PEA41 NLAAS PEA11 NSAL PEA41 Variable Label: Have always told the truth PEA41 I have always told the truth. (IF NEC: Would you say this is true or false for you?) 1 TRUE 5 FALSE Value Label Frequency Valid Percent Total Percent 1 TRUE 4547 27.86% 22.72% 5 FALSE 11772 72.14% 58.82% -9 REFUSED 4 - 00.02% -8 DONT KNOW 8 - 00.04% . Missing 3682 - 18.40% Disclaimer: Frequencies displayed above are not weighted. Missing Data Codes: -9",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}