{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            ""
        ],
        [
            "School",
            "Florida State",
            "Texas Tech",
            "Oklahoma",
            "Michigan",
            "Washington"
        ],
        [
            "Total Commits",
            "2",
            "2",
            "1",
            "1",
            "1"
        ],
        [
            "Commits",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Commits",
            "1",
            "1",
            "0",
            "0",
            "0"
        ],
        [
            "Commits",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Avg Stars",
            "4.50",
            "4.50",
            "5.00",
            "5.00",
            "5.00"
        ],
        [
            "Points",
            "316",
            "307",
            "209",
            "208",
            "208"
        ]
    ],
    "pageTitle": "UGASports.com - Rivals.com's top five classes by position",
    "title": "",
    "url": "https://uga.rivals.com/content.asp?CID=264733",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00092-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 883269668,
    "recordOffset": 883253274,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1923=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 UGASports.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{102194=USC - again - grabbed another No. 1 ranking at a position with five-star defensive end Jeff Schweiger Jr. as the best end in the Trojan class. Not far behind USC are Florida and Georgia. The Gators' class is bolstered by five-star pick Derrick Harvey. UGA's top defensive end is Brandon Miller, the nation's No. 1 weakside defensive end., 41738=February 4, 2004, 53106=Florida State grabs the top spot at the position with the additions of Xavier Lee and Drew Weatherford. However, Texas Tech should be commended for the job they did with the additions of Graham Harrell and Robert Johnson. Oklahoma - with quarterback Rhett Bomar - has the No. 3 class for quarterback.}",
    "textBeforeTable": "Quarterback There were some interesting battles for the top spot at each position - including at quarterback. Were Xavier Lee and Drew Weatherford enough to put Florida State on top or did Texas Tech beat them out with their signal-callers? Find out this and more in this Rivals.com exclusive. A big piece of the recruiting rankings puzzle is how teams do individually at each position, and Rivals.com is proud to present an in-depth look at the top five teams at each of the positions. TD { font-family: Verdana; font-size: x-small; }TD.main { background-color: #ffffff;font-family: Verdana; }-->",
    "textAfterTable": "Florida State grabs the top spot at the position with the additions of Xavier Lee and Drew Weatherford. However, Texas Tech should be commended for the job they did with the additions of Graham Harrell and Robert Johnson. Oklahoma - with quarterback Rhett Bomar - has the No. 3 class for quarterback. Running back   School Total Commits Commits Commits Commits Avg Stars Points 1",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}