{
    "relation": [
        [
            "Field",
            "Port",
            "Partner System ID",
            "Partner Port Number",
            "Age",
            "Flags",
            "Port Priority",
            "Admin Key",
            "Oper Key",
            "Port State"
        ],
        [
            "Description",
            "Port on which link bundling is configured.",
            "Peer’s LACP system identification (sys-id). It is a combination of the system priority and the MAC address of the peer device.",
            "Port number on the peer device",
            "Number of seconds since the last LACP PDU was received on the port.",
            "Indicators of device activity.",
            "Port priority setting.",
            "Defines the ability of a port to aggregate with other ports.",
            "Determines the aggregation capability of the link.",
            "Activity state of the port. See the Port State description in the show lacp internal Field Descriptions table for state variables."
        ]
    ],
    "pageTitle": "Cisco IOS Carrier Ethernet Command Reference - show ethernet cfm maintenance-points local through weight [Support] - Cisco",
    "title": "Table 40 show lacp neighbors Field Descriptions",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/cether/command/ce-cr-book/ce-s1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00329-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 359274095,
    "recordOffset": 359167581,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{93145=Specifies the VPN ID. Range: 1 to 32767., 8470=Integer from 1 to 32767 that identifies the VPN., 32692=The VPN ID. Range: 1 to 32767., 11299=Displays the CCDB contents on the basis of the ITU-T Y.1731 Carrier Code (ICC)-based maintenance entity group (MEG) identifier., 59303=(Optional) The VPN ID. Range: 1 to 32767., 104284=ITU-T Y.1731 ITU Carrier Code (ICC) identifier. Also displays the unique maintenance entity group (MEG) code (UMC).}",
    "TableContextTimeStampAfterTable": "{631852=Configures the guard interval. The time interval ranges from 10 to 2000 seconds., 704916=Integer in the range of 2 to 1024 that is the number of UNIs in the EVC. The default is 2., 678503=The following example shows how to send an Ethernet CFM traceroute message to MAC address aabb.cc00.1010 in maintenance level 4 on evc_100:, 36670=Displays CFM information on the basis of the ITU-T Y.1731 Carrier Code (ICC)-based maintenance entity group (MEG) identifier.}",
    "textBeforeTable": "Syntax Description evc-name ] { static | dynamic } level-id | evc number | level type domain-name | interface [ domain [ mep | mip ] [ detail ] local maintenance-points cfm ethernet show To display information about local Connectivity Fault Management (CFM) maintenance points that are configured on a device, use the show ethernet cfm maintenance-points local command in privileged EXEC mode. show ethernet cfm maintenance-points local weight (srvs instance) uni count transport ipv4 (PTP) traceroute ethernet vlan traceroute ethernet evc traceroute ethernet tod timer (Ethernet ring) template (eoam) sync interval status peer topology dual-homed status decoupled source template (eoam) snmp-server host traps evc snmp-server enable traps ether-oam snmp-server enable traps ethernet evc snmp-server enable traps ethernet cfm crosscheck snmp-server enable traps ethernet cfm cc snmp-server enable traps ethernet cfm alarm shutdown (bridge-domain) show ptp port dataset port show",
    "textAfterTable": "evc-name (Optional) Identifier foe an EVC. The evc-name argument is not supported in Cisco IOS Release 12.2(54)SE and Cisco IOS Release12.2(50)SY. static (Optional) Indicates configuration through the CLI. dynamic (Optional) Indicates configuration through a dynamic session or an accounting, authentication, and authorization (AAA) server. Command Default When none of the optional keywords and arguments is specified, information about all the maintenance points on the device is shown. Command Modes Privileged EXEC (#) Command History Release Modification 12.2(33)SRA This command was introduced. 12.4(11)T This command was integrated into Cisco IOS Release",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}