{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Share any unusual traditions or locations on campus",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "There are campus police and a station just a few blocks down from the main campus.",
            "The campus has a few myths. One is the statue of St. Antony. It is said if you rub his head, you will pass your next exam.",
            "There are so many options available here! I ate at the Mongolian grill where I chose what all I wanted grilled and they made it in to a sateed dish over rice.",
            "I was unable to tour the inside of a dorm room but I was in their main lobby floors. Each dorm has a space for students to relax or study and somehave very own cafes for snacks and drinks!",
            "My audition to apply for the music department includes all major and minor scales, a class A solo and an etude. The program seemed to be very accredited and with James Swearingen as the music ed prof, there is so much potential for a student to studies here.",
            "Capital had a beautiful campus with an amazing orchestra hall called Mees Hall."
        ]
    ],
    "pageTitle": "Capital University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Capital-University/reviews?_escaped_fragment_=/show/89816",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00092-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910935755,
    "recordOffset": 910890214,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{169527=Capital is very very small, so if you are looking for an incredibly exciting and fast-paced curriculum, start your search elsewhere. If you're looking for a college where professors will move a class to the lawn outside last-minute, you can roll out of bed at 7:48 and still make your 8am class, and your professors will email you to check up on you if you're having an off semester, Capital may be right for you., 196337=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "10/08/2010 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 44 Jordan from Frankfort, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "10/14/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 44 Categories Comments Great for these types of students The nursing program is very strong, as is the conservatory program. Capital is great for students who like a personal learning environment and are very studious. Tips for prospective students Submit your housing application early. Make sure to have some extra spending money for weekend meals because the dining hours can be kind of inconvenient. Take advantage of the opportunities during orientation to attend club meetings and meet other students. Bang for the buck CU is very, very expensive, however they give out a great deal of scholarships. My tuition is almost totally covered by scholarships and loans. I think the experience is worth the high cost to learn here. Am enjoying being here The small campus makes it easy to get back and forth to class. There are a lot of great resteraunts around Bexley, and a Kroger and CVS fairly close to the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}