{
    "relation": [
        [
            "Feature key",
            "Describes a region of interest that cannot be described in other subsections.More...Regioni",
            "Describes a region of interest that cannot be described in other subsections.More...Regioni"
        ],
        [
            "Position(s)",
            "23 – 230",
            "51 – 91"
        ],
        [
            "Length",
            "208",
            "41"
        ],
        [
            "Description",
            "Interaction with GRB2, ERI3 and SYN1By similarity",
            "5 X 8 AA tandem repeats of P-H-G-G-G-W-G-Q"
        ],
        [
            "Graphical view",
            "",
            ""
        ],
        [
            "Feature identifier",
            "",
            ""
        ],
        [
            "Actions",
            "Add BLAST",
            "Add BLAST"
        ]
    ],
    "pageTitle": "PRNP - Major prion protein precursor - Homo sapiens (Human)",
    "title": "",
    "url": "http://www.uniprot.org/uniprot/P04156",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00171-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 816155815,
    "recordOffset": 816072579,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 22 Jul 2015 00:00:00 GMT",
    "textBeforeTable": "Region 5 8 84 – 91 <p>Indicates the positions and types of repeated sequence motifs or repeated domains within the protein.</p><p><a href='../manual/repeat' target='_top'>More...</a></p>Repeati 4 8 76 – 83 <p>Indicates the positions and types of repeated sequence motifs or repeated domains within the protein.</p><p><a href='../manual/repeat' target='_top'>More...</a></p>Repeati 3 8 68 – 75 <p>Indicates the positions and types of repeated sequence motifs or repeated domains within the protein.</p><p><a href='../manual/repeat' target='_top'>More...</a></p>Repeati 2 8 60 – 67 <p>Indicates the positions and types of repeated sequence motifs or repeated domains within the protein.</p><p><a href='../manual/repeat' target='_top'>More...</a></p>Repeati",
    "textAfterTable": "<p>Provides general information on the biological role of a domain. The term ‘domain’ is intended here in its wide acceptation, it may be a structural domain, a transmembrane region or a functional domain. Several domains are described in this subsection.</p><p><a href='../manual/domain_cc' target='_top'>More...</a></p>Domaini The normal, monomeric form, PRPN(C), has a mainly alpha-helical structure. Misfolding of this form produces a disease-associated, protease-resistant form, PRPN (Sc), accompanied by a large increase of the beta-sheet content and formation of amyloid fibrils. These fibrils consist of a cross-beta spine, formed by a steric zipper of superposed beta-strands. Disease mutations may favor intermolecular contacts via short beta strands, and may thereby trigger oligomerization. In addition, the heparan-sulfate proteoglycan, GPC1, promotes the association of PRPN (C) to lipid rafts and appears to facilitate the conversion to PRPN (Sc). Contains an N-terminal region composed of octamer repeats. At low copper concentrations, the sidechains of His residues from three or four repeats contribute to the binding of a single copper ion. Alternatively, a copper ion can be bound by interaction with the sidechain and backbone amide nitrogen of a single His residue. The observed copper binding stoichiometry suggests that two repeat regions cooperate to stabilize the binding of a single copper ion. At higher copper concentrations, each octamer can bind one copper ion by interactions with the His sidechain and Gly backbone atoms. A mixture of binding types may occur, especially in the case of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}