{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They can take a while to resond to certain situations",
            "Tons of clubs and activities including intramural sports",
            "Sports Players Abnormally smart people",
            "EVERYTHING is expensive here",
            "There is a new student recreation center being built that includes a lot of cool things",
            "The dining hall does not give a lot of options. There is nothing that is open late",
            "The dorms are really small.",
            "It is a tough college, but the professors and the academic (tutor center) are always ready to help",
            "Be sure to familiarize yourself with academic plans",
            "Randolph Macon is a small private college. It has a lot of option for one majoring in the sciences. Great place to be."
        ]
    ],
    "pageTitle": "Randolph-Macon College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Randolph-Macon-College/reviews?_escaped_fragment_=/show/39092",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00230-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 914871727,
    "recordOffset": 914832615,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{10701=I came here, as I said earlier, from a community college. I had no intention of being very involved on campus in terms of extra curricular activities or really even taking advantage of many of the college services as it was just not something I was used to. That quickly changed when I learned about all that this college had to offer. I joined the Political Science Student Association, the Young Democrats, and am the re-founding member of our colony of Phi Kappa Sigma fraternity (by the way, I hated the notion of Going Greek when I got here). I'm actually kind of sad that I'll graduate in Spring 2012., 155906=© 2015, Cappex.com, LLC, 152616=I am going to transfer here in Fall 2015, but I have heard that majoring in science is really rigorous. I guess it depends on your major, but I would say Randolph-Macon gets you well prepared for your future., 9469=First, take advantage of meeting with your academic adviser early and often. You want to know exactly what you want to do before the next semester comes. They are very helpful and can help you map out your plan all the way to graduation. Second, GO GREEK. The campus is 33% affiliated and only has 1200 students. Trust me, Greek Life is not what you think it is. Check it out., 17228=This is always my favorite part to tell people. In a word, the food sucks. It's definitely not your mom's cooking. You've got two options, the actual dining hall and Macon Coffee, that has wraps and salads for take out. The dining hall is so lackluster, there's not many food options, so everyone always opts for the go-to sub. It's also only open until 7:30, which to me, is so early!, 82184=Randolph-Macon is not a young college and does not have all new dorms, although a new freshman dorm, Andrews Hall, was just completed in August, 2012, and plans for a new senior apartment building are currently being drawn up. The current dorms on campus are not in brand new condition, but are very easily made to feel comfortable and like a home-away-from-home.}",
    "textBeforeTable": "02/01/2011 Reviewer is A current student here. 10 out of 11 people found this review useful. 1 of 31 Megan from Stafford, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. Randolph-Macon College Reviews Randolph-Macon College › Virginia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck The college makes every attempt possible for every student who wishes to attend. Without having any sort of familial support, Randolph-Macon helped me find ways to pay for the tuition and fees without having to submerge myself in debt. Although the cost is pricey for many families, you get what you pay for with every dollar in education, networking opportunities and socialization. Am enjoying being here As an athlete and member of Alpha Phi Omega, Theta Omega chapter, I've found many ways to entertain myself outside of the classroom. The college offers a nook for everyone willing to lend their time to an extra club or organization; Greek life, varsity athletics, intramural sports, clubs and external activities such as Army ROTC keep the varieties of these options fresh. The staff and faculty are incredibly friendly; there isn't a problem finding a group of friends at this college. Am learning a lot Coming from a small-town school with no AP courses, I had been used to coasting through schoolwork without ever having to try. Randolph-Macon professors challenge their students and work within their schedules to help individual needs. I've had professors give me their cell phone numbers in case I needed clarification on certain topics or homework questions.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}