{
    "relation": [
        [
            "Year",
            "2013",
            "2014",
            "2015",
            "total"
        ],
        [
            "Framing Chances",
            "1755",
            "6431",
            "1158",
            "9344"
        ],
        [
            "Extra Strikes",
            "26",
            "72",
            "7",
            "106"
        ],
        [
            "Framing Runs",
            "3.9",
            "10.8",
            "1.2",
            "15.9"
        ],
        [
            "Framing Runs per 7000",
            "15.6",
            "11.7",
            "7.1",
            "11.9"
        ],
        [
            "Blocking Chances",
            "1211",
            "1473",
            "535",
            "3219"
        ],
        [
            "PB/WP Saved",
            "-0.8",
            "-9.5",
            "0.1",
            "-10.2"
        ],
        [
            "Blocking Runs",
            "-0.2",
            "-2.7",
            "0.0",
            "-2.8"
        ],
        [
            "Blocking Runs per 7000",
            "-1.2",
            "-12.6",
            "0.3",
            "-6.1"
        ],
        [
            "Total Receiving Runs",
            "3.7",
            "8.1",
            "1.2",
            "13.0"
        ],
        [
            "Total Receiving Runs per 7000",
            "14.4",
            "-0.9",
            "7.4",
            "5.7"
        ]
    ],
    "pageTitle": "Travis d'Arnaud | Baseball Prospectus",
    "title": "",
    "url": "http://www.baseballprospectus.com/p/55784",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00103-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 312641883,
    "recordOffset": 312618227,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{32938=Last Update: 12/31/2014 23:59 ET}",
    "lastModified": "Thu, 30 Jul 2015 12:10:05 GMT",
    "textBeforeTable": "Advanced Catching Metrics No BP Roundtables have mentioned this guy. BP Roundtables I'm a huge fan, so I'll take the over. (Kevin Goldstein) Travis D'Arnaud career MLB all-star appearances, 0.5. Over or Under? (Susan from New York) 2010-05-28 14:00:00 (link to chat) Definitely B. Power potential was always there, and this is all a guy figuring things out. Nothing fluky there, it's all real. (Kevin Goldstein) Any explanations for Travis D'Arnaud's power spike this year? Good hitter's environment, or just a talented guy figuring things out? (Nik from Hamilton) 2011-09-02 14:00:00 (link to chat) Over. Way over. (Jason Parks) Travis D'Arnaud, Career All-Star Appearances, 1.5, Over or Under? (Bobby from LA) 2011-12-14 13:00:00 (link to chat) If you're all in for this season, then Moore is the only one I'd say is untouchable. That said, you shouldn't need to deal some of these other guys for Hardy either. D'Arnaud and Betances should be taken off the table if at all possible.",
    "textAfterTable": "A Collaboration between BrooksBaseball.net and Baseball Prospectus - Pitch classifications provided by Pitch Info LLC     Baseball Prospectus Analysis Blog Radio Events Newsletter Search News Player Cards Player Search Team Audit Statistics Fantasy Player Forecast Manager Depth Charts Team Tracker Hacking Mass Team Health Reports BP.com Terms of Service Customer Service Privacy Policy Contact Us Glossary AMERICAN LEAGUE Baltimore Orioles Boston Red Sox New York Yankees Tampa Bay Rays Toronto Blue Jays Chicago White Sox Cleveland Indians Detroit Tigers Kansas City Royals Minnesota Twins Los Angeles Angels Oakland Athletics Seattle Mariners Texas Rangers NATIONAL LEAGUE Atlanta Braves",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}