{
    "relation": [
        [
            "",
            "Name",
            "",
            "John R. Coghlan",
            "Virginia Walters",
            "Michael A. Kirk"
        ],
        [
            "",
            "Age",
            "",
            "69",
            "38",
            "60"
        ],
        [
            "",
            "Position",
            "",
            "President, CEO CFO, Chairman of the Board",
            "Treasurer, Director",
            "Secretary, Director"
        ]
    ],
    "pageTitle": "GENESIS FINANCIAL INC - FORM 10-K - April 13, 2012",
    "title": "",
    "url": "http://www.getfilings.com/sec-filings/120413/GENESIS-FINANCIAL-INC_10-K/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00338-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481339003,
    "recordOffset": 481264629,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{504381=Dated:  April 11, 2012, 446211=There was no compensation to any Director during the fiscal year ended December 31, 2011., 488910=8-K filed December 8, 2010, 490296=10-K filed August 11, 2010, 330467=The following table presents a reconciliation of assets measured at fair value on a recurring basis using significant unobservable inputs (Level 3) during the years ended December 31, 2011 and 2010:, 404117=On October 20, 2011, the Company entered into a month-to-month tenancy with 3773 West Fifth, LLC, a company owned and controlled by John and Wendy Coghlan.  The monthly rent is $750.  John Coghlan is the chairman of our board of directors, President, CEO, CFO and majority shareholder., 50644=COMPETITION. When Genesis formally entered the hard money markets in the latter half of 2004, the market was very competitive, but very fragmented.  Most hard money lenders operated on a local basis, limiting their lending to borrowers and collateral properties located a short distance from their base of operations.  They also marketed only to the retail market, ignoring brokers and dealing directly with the borrowers., 219123=2010, 51174=Beginning in late 2007, we noticed that some of the commercial lenders were cutting back and tightening their lending parameters. Some were even exiting the business, or closing operations due to high delinquencies and repossessions.  By the end of 2010, a large percentage of the lenders had exited the business or suspended operations, and virtually every remaining commercial real estate lender had severely tightened their parameters.  The Company expects this trend to continue., 269268=December 31, 2010, 108347=2010, 400332=On June 30, 2010, CFC purchased a commercial loan for $31,995, a land loan for $70,868 and a business note for $7,137 totaling $110,000., 30650=In the latter part of 2008, national economic conditions made any real estate lending very precarious, forcing the Company to again re-focus its efforts. Real estate loans again became our primary target.  The larger companies, which had dabbled in the industry, discontinued purchasing real estate loans in 2008, primarily due to the decimation of the securitization markets.  This left a huge funding void in the seller financed real estate market.  Genesis had been forced to re-focus its business towards, 35249=In regard to our commercial lending, Genesis focused on \"hard money lending\" which was typically a short term loan collateralized with non-conforming types of real property with a borrower who may have a compromised credit rating.  Genesis followed two general underwriting rules in its \"hard money\" lending, (1) only make a loan if you want to own the collateral and (2) never lend an amount of money which might exceed the price you would be willing to pay for the collateral as a purchaser. Hard money loans are normally equity based, not credit based.  Genesis originally targeted a 70% maximum loan-to-value ratio, but as the real estate markets declined from 2007 on, we have continued to reduce that maximum.  At this point, with the continued uncertainty in real estate values, we will estimate the present value of the collateral property, reduce that by 20%-30% as a contingency for future declining values, and then keep our loan to an amount that is no more than 50% of that adjusted value., 29673=In 2004, larger financial institutions, which had dabbled in the industry in the past on a smaller, wholesale scale, recognized the potential profitability from buying seller financed real estate loans directly from the sellers. These institutions entered the market. Their competitiveness drove many of the brokers out of business, and made the margin spreads so low that smaller funding companies with a higher cost of funds could not compete, or had to settle for lower quality loans.  Genesis was one of those companies, and although we believed we could maintain a presence in the industry by focusing on niche sectors of the market, such as partial purchases and non-conforming property types, management decided to expand the Company\u0092s focus, and look to other business markets as well.  Commercial real estate lending was the Company\u0092s primary choice to pursue., 88875=As of December 31, 2011 our company had approximately 157 shareholders of its common stock holding 7,863,358 shares and has approximately 51 shareholders of its Series B preferred stock holding 1,957,500 shares., 105146=General and administrative expenses (\u0093G&A\u0094) for fiscal years ended December 31, 2011 and 2010 were $141,538 and $367,145, respectively. G&A primarily consists of executive compensation, rent and professional fees for legal, accounting and public relations, utilities, depreciation and maintenance.  The year over year increases and (decreases) for the fiscal years ended December 31, 2011 and 2010 were ($225,607) and $130,990, respectively.  The primary reasons for the changes were as follows:, 170634=Investments made in two private companies of $300,000 in 2011 compared to $750,000 in 2010., 182544=March 20, 2012, 501505=**   In accordance with Rule 406T of Regulation S-T, the XBRL related information in Exhibit 101 to this Annual Report on Form 10-K shall not be deemed to be \u0093filed\u0094 for purposes of Section 18 of the Exchange Act, or otherwise subject to the liability of that section, and shall not be incorporated by reference into any registration statement or other document filed under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such filing., 96199=(2)  On November 5, 2010, the board of directors authorized the issuance of 250,000 common stock options each to John Coghlan, Co-president and Director of the Company, Greg M. Wilson, attorney for the Company, and James Bjorklund and Wes Sodorff, advisors to the Company. The stock options, representing 1,000,000 common shares, have an exercise price of $.20 per share., 468026=(4)  Virginia Walters was installed as Treasurer and as a member of the board of directors on October 20, 2011., 103952=Of the loans held for sale at December 31, 2011 and 2010, 52% and 48% loans, respectively, with values of $305,919 and $482,517, respectively, were in payment default., 474101=On December 15, 2010, John R. Coghlan purchased 500,000 Series \"B\" Preferred shares from the Company for $500,000., 402946=During the year ended December 31, 2010, Genesis Holdings, Inc. recorded $31,560 in management fees and $15,799 in servicing fees for 2010 and still owes the Company $47,240 at December 31, 2010., 494495=10-K  filed August 11, 2010, 29105=The reduction in availability of funds to purchase real estate notes created a void in the market for a few years from 2000 thru 2003, and again from 2007 thru 2010.  The brokers with product to sell were faced with limited avenues, creating a market opportunity for Genesis, and that was the focus of the Company\u0092s business plan during that period. The Company also pursued commercial real estate loans during these periods to fill the void in the contract market., 364524=During the year ended December 31, 2010, the Company authorized the issuance of 250,000 common stock options each to John Coghlan, Co-president and Director of the Company, Greg M. Wilson, attorney for the Company, and James Bjorklund and Wes Sodorff, advisors to the Company. The stock options, representing 1,000,000 common shares, have an exercise price of $.20 per share.  No options were issued during 2011 and 261,000 options were available for future grants., 478811=DeCoria, Maichel &Teague, P.S. serves as our registered independent accountant and has audited our financial statements for the years ending December 31, 2011 and 2010., 410271=Based on this evaluation, management concluded that, as of December 31, 2011, our internal control over financial reporting were effective in providing reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles., 185502=2011, 488442=SB-2 Amendment No. 3 filed July 3, 2003, 321453=In January 2010, the FASB issued ASU 2010-06, which amends Subtopic 820-10 to require new disclosures on fair value measurements as follows:, 399213=On March 9 2011, CFC purchased 200,000 shares of Series B Preferred Stock being offered by the company., 155449=On May 2010, Genesis Financial, Inc. completed a private placement of 1,050,000 shares of common stock at $.10 per share to accredited investors for a total price of $105,000., 326216=December 31,, 75373=5/20/2010, 445810=Except as set forth above, there were no outstanding equity awards to any Executive Officer at the end of the fiscal year ended December 31, 2010 and 2011., 489806=10-K filed April 23, 2010, 376465=Compensation expense relating to stock options granted during the year ended December 31, 2010 was $167,955 which is classified as \u0091other operating expense\u0092., 360194=At December 31, 2010, in connection with the Company\u0092s purchase of Flyback Energy, Inc.\u0092s (FEI\u0092s) preferred stock (see Note 4), the Company entered into a note payable agreement with FEI on November 23, 2010 for $700,000 to be paid in monthly installments of $140,000 through April 2011 plus interest at .035% per annum.  The first payment was made in December 2010.  The note is collateralized by FEI preferred stock purchased by the Company.  This note was paid in full during April 2011., 401349=There was no activity for the years ended December 31, 2011 and 2010., 146918=On May 16, 2011, the promissory note was converted to a $250,000 line of credit on the same terms and conditions. At December 31, 2011 the balance owing is $187,107. The line has a term of 12 months, and an origination fee of 1/2%, or $1,250. The payments are due monthly on the 1st on all accrued unpaid interest. The Riverbank line of credit is senior to the CFC line of credit, and is collateralized by the assets of Genesis.  The Riverbank line requires that the CFC line may not be paid down lower than the amount owing to Riverbank at any time during the term of the loan.  The line is payable on demand and is personally guaranteed by John R. and Wendy Coghlan., related parties of the Company. (See Note 12), 110075=For the years December 31, 2011 and 2010, interest expense amounted to $82,167 and $110,252, respectively., 69248=REPORTS TO SECURITY HOLDERS. The Company is currently obligated to file periodic reports with the United States Securities and Exchange Commission in accordance with the requirements of Section 15(d) of the Securities Exchange Act of 1934. The Company is required to file quarterly reports on Form 10-Q and annual reports on Form 10-K. The Company is current in its filings.  The Company is currently a Smaller Reporting Company under applicable SEC regulations., 58864=On April 25, 2011, the Company purchased $50,000 of Series \u0093C\u0094 Preferred Stock that is convertible at $.60 per share or 83,333 shares of common stock and bears a 5% interest rate., 27765=In 2007, the sub-prime real estate markets started to experience problems, and by mid-2008, the market was in a free-fall.  The Company started to experience increased delinquencies, and the collapse of the financial markets eliminated any chance of our payors being able to refinance or sell their properties, which resulted in increased loan defaults and repossessions.  Effective January 1, 2009, the Company out-sourced all its operations and servicing functions to reduce expenses during this downturn. Management tightened up the Company's underwriting parameters.  Management focused its efforts on maintaining the performing portions of the portfolio, selling repossessed collateral properties, and reducing debt., 322374=ASU 2010-06 also provides amendments to Subtopic 820-10 that clarifies existing fair value measurement disclosures as follows:, 365108=The fair value of the options granted during the year ended December 31, 2010 was estimated on the date of grant using the Black-Scholes option-pricing model with the weighted average assumptions given below:, 453497=This table is based upon information derived from our stock records. We believe that each of the shareholders named in this table has sole or shared voting and investment power with respect to the shares indicated as beneficially owned; except as set forth above, applicable percentages are based upon 7,863,358 and 7,757,108 shares of common stock outstanding as of December 31, 2011 and 2010, respectively. In computing the number of shares of common stock beneficially owned by a person and the percentage ownership of that person, we deemed outstanding shares of common stock subject to conversion of preferred stock and options held by that person that are currently exercisable or exercisable within 60 days of December 31, 2011.  We did not deem those shares outstanding, however, for the purpose of computing the percentage ownership of any other person., 58243=On November 23, 2010, Genesis Financial, Inc. closed the purchase of an equity interest in Flyback Energy, Inc., a closely held Washington corporation, for $1,200,000.  The purchase was for $1,200,000 of Series \u0093B\u0094 Preferred Stock and Common Stock Purchase Warrants from Flyback Energy, Inc.  The purchase represents a ten percent equity interest in Flyback Energy, Inc.  John R. Coghlan, Co-President of Genesis Financial, Inc. was elected to the Board of Directors of Flyback Energy, Inc. February 7, 2011., 353925=On December 6, 2010, the Company entered into an agreement with AWG International, Inc. to purchase 54,953 shares of the AWG International, Inc. common stock for $250,000. As part of the transaction Genesis Financial, Inc. was also issued common stock purchase warrants to acquire an additional 54,953 common shares for $250,000.  The Company exercised the warrants for 54,953 shares for $250,000, in 2011.  After the purchase represents a, the Company owned ten percent equity interest in AWG International, Inc. at December 31, 2011., 54425=Management decided to make some major adjustments to the Company\u0092s business plans.  The decision was made to reduce overhead expense by outsourcing the day-to-day operations of the Company, to focus on reducing the Company\u0092s debt through a re-structuring of terms with our credit facilitators, to pursue the sale of Company assets, to continue acquisitions and originations only on deals that have been pre-sold, to focus on salvaging delinquent accounts through increased collection activity and workouts, to increase the focus on maintenance and resale of repossessions, and to diversify asset acquisitions into non-real estate assets.  This plan was implemented January 1, 2009., 498331=CEO Certification pursuant to Section 302 of Sarbanes-Oxley Act of 2002, 74852=9/17/2008, 397609=On November 5, 2010, John R. Coghlan was granted 250,000 common stock options exercisable at $0.20 per share in consideration of $41,988 officer's compensation., 471439=On December 27, 2008, the Company entered into a Corporate Restructuring Agreement which has been characterized as a Management and Servicing Agreement with Genesis Finance Corporation, a Washington Corporation (\"GFC\").  See Exhibit 10.13. Genesis Financial, Inc. (GFI) outsourced its day-to-day management and servicing operations to GFC, an affiliated company, effective January 1, 2009. GFC is owned and controlled by Michael Kirk, GFI\u0092s Secretary and member of its board of directors.  The Company agreed to pay GFC a monthly fee of $6,000.  For this fee, GFC would manage and service the Genesis Financial assets and be responsible for accounting and office expenses.  , 236077=For the Years Ended December 31, 2010 and 2011, 125937=2009, 420028=MICHAEL A. KIRK, Secretary and Director, age 60, will act in an advisory capacity to the Board of Directors.  He will oversee and be directly involved with buying, underwriting, and any real estate related transactions.  Mr. Kirk is a founder of Genesis and has served as an officer and Director since inception in January, 2002.  Mr. Kirk will devote part time to the business., 3709=[  ]   TRANSITION REPORT UNDER SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 83576=September 30, 171639=Investments made in two private companies of $750,000 in 2010.   No such investment made in 2009, 474460=On March 9, 2011, CFC purchased 200,000 shares of Series \u0093B\u0094 Preferred Stock being offered by the company for $200,000., 446536=We presently have no formal independent Board committees. Until further determination, the full Board of Directors will undertake the duties of the audit committee, compensation committee and nominating and governance committee.  The members of the Board of Directors performing these functions as of December 31, 2011, are Michael A. Kirk, John R. Coghlan and Virginia Walters., 473375=On September 1, 2010, John R Coghlan purchased a $41,980 interest in a Limited Liability Company that was applied to the CFC line of credit., 476690=On December 31, 2010, Genesis Holdings, Inc. booked $31,560 in management fees and $15,799 in servicing fees for 2010 and still owes $47,240., 437614=The following table sets forth information with respect to outstanding equity awards held by the Company\u0092s officers as of December 31, 2011., 76398=6/14/2011, 499251=CEO Certification pursuant to Section 906 of Sarbanes-Oxley Act of 2002, 389097=At December 31, 2011 and 2010 cash and cash equivalents and loans held for sale (see Note 2) are the only asset accounted for at fair value on a recurring basis and are measured utilizing the fair value calculation input hierarchy Level 1 and Level 3, respectively.  Real estate owned is accounted for at fair value on a nonrecurring basis utilizing the fair value calculation input hierarchy Level 3 (see Note 3).  The Company has no liabilities that are accounted for at fair value on a recurring basis., 78814=Our common stock is quoted on the OTC Pinksheets.  The following table sets forth the high and low bid prices of our common stock for the quarters ending December 31, 2011 and 2010 and interim periods.  The quotations set forth below reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not represent actual transactions., 146297=At December 31, 2010, the Company  a promissory note with Riverbank, with a balance owing of $286,264, with a variable interest rate equal to the prime rate index (as published in the Wall Street journal) plus 1%, with a floor of 6%. The rate at December 31, 2011 and, 2010 was 6%. The line had a term of 14 months, and an origination fee of 1/2%, or $2,369.  The payments are due quarterly in the amount of $100,000, for the first four payments, and the last payment will be $95,164.   , 358822=On December 15, 2010, the Company entered into a convertible note agreement with John R. Coghlan, a related party (see Note 12). The note accrues interest at 8% per annum with interest and balance due on December 15, 2012.  The note is convertible at anytime by Mr. Coghlan into one share of the Company\u0092s Series B Preferred stock for every $1.00 outstanding of the note payable and related accrued interest.  In connection with the issuance of this note, the Company recognized a beneficial conversion feature of $128,750 that resulted in a discount to the note payable. The discount is being amortized into earnings over the term of the note. The note is collateralized by 290,000 shares of the Company\u0092s Series B Preferred stock.  The beneficial conversion feature was based upon the difference between the fair value of the preferred stock into which the note is convertible at the date of issue ($378,750) less the face value of the note ($250,000).  The fair value of the preferred stock at the date of issue was calculated based upon the fair value of the shares of common stock (2.5 shares of common stock for each 1 shares of preferred stock or 625,000 shares) into which the preferred stock was convertible at the date of issue., 59157=Flyback Energy, Inc, founded in 2003, is a development stage company with no product revenues.  Its assets consist principally of its intellectual property.  The Company has developed two energy controller products, the lighting energy controller and the motor energy controller., 323598=The new disclosures and clarifications of existing disclosures discussed above are effective for interim and annual periods beginning after December 15, 2011, except for the disclosures about fair value measurements.  Those disclosures are effective for fiscal years beginning after December 31, 2010.  Adoption of this guidance has not, and is not expected to have, a material impact on the Company\u0092s financial statements., 420536=Mr. Kirk is the President of Genesis Finance Corporation, a closely held corporation, which provides loan servicing function for Genesis Financial, Inc. From January 1, 2009 through December 31, 2011, the Company out-sourced all its operations and servicing functions to reduce expenses, and further tightened underwriting parameters, while management focused on selling repossessed collateral properties and reducing company debt.  Commencing January 1, 2011, Genesis Finance Corporation reduced its fee to $1,500 per month, payable in cash and/or reimbursed Genesis Finance corporation office expenses to continue to manage the Genesis Financial loan portfolio., 155722=Fiscal Year ended December 31, 2011 compared to year ended December 31, 2010., 496349=Form of $250,000 Convertible Note Subscription Agreement between John R. Coghlan and Genesis Financial dated  December 15, 2010, 75881=8/13/2008, 400703=On September 29, 2010, CFC purchased a $54,820 interest in two properties secured by commercial real estate, a $619,103 interest in four properties secured by land, a $157,612 interest in two properties secured by residential real estate and a $2,249 interest in a business note in exchange for total reduction of $833,767 in the Company\u0092s line of credit balance with CFC.   , 110787=For the years ended December 31, 2007 through 2011, the loan portfolio of purchased, sold and originated is as follows., 181574=In our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of Genesis Financial, Inc. as of December 31, 2011 and 2010, and the results of its operations and its cash flows for the years then ended in conformity with accounting principles generally accepted in the United States of America., 495846=Form of $250,000 Convertible Note Agreement between John R. Coghlan and Genesis Financial dated December 15, 2010, 473871=On December 15, 2010, John R. Coghlan loaned the Company $250,000 to finance the investment in AWG International, Inc. (See Note 5)., 324145=During February 2010, the FASB issued ASU 2010-08, which corrected existing guidance for various topics.  The update became generally effective for the first reporting period (including interim periods) beginning after issuance.  These conditions did not have a material impact on the Company\u0092s financial statements., 313851=Earnings per share \u0096 Basic earnings per common share have been computed on the basis of the weighted-average number of common shares outstanding during the period presented.  Diluted earnings per common share are computed on the basis of the number of shares that are currently outstanding plus the number of shares that would be issued pursuant to outstanding warrants, stock options and common stock issuable on conversion of preferred stock unless such shares are deemed to be anti-dilutive. The dilutive effect of convertible debt and outstanding securities, which are anti-dilutive, in periods of future income, would be as follows as of December 31, 2011 and 2010:, 396894=On February 2, 2010, John R. Coghlan purchased a $157,790 interest in a commercial loan from the Company., 477357=There was no activity for the year ended December 31, 2011 and 2010., 503090=Dated: April 11, 2012, 72061=For most of the fiscal year ending December 31, 2011, the Company operated out of 2,700 square feet of leased space which it shared with Genesis Finance Corporation and several other entities, located at 12314 E. Broadway Ave., Spokane Valley, WA 99216.  The annual lease payments totaled $21,000.  On October 20, 2011, the Company changed its principal executive offices to 3773 West 5th Avenue, Suite 301, Post Falls, ID 83854. We entered into a month-to-month tenancy.  We believe that our office facilities are currently adequate for us to conduct present business activities.  Our monthly rent is $750. The leasehold is owned by West 3773 Fifth, LLC, 100% owned by John and Wendy Coghlan. John Coghlan is the chairman of our board of directors, President, CEO, CFO and majority shareholder., 474933=On June 30, 2010, CFC purchased a commercial contract for $31,995, a land contract for $70,868 and a business note for $7,137 totaling $110,000., 409645=Management is responsible for establishing and maintaining adequate internal control over financial reporting of the Company. Management, with the participation of our Chief Executive Officer and Principal Financial Officer (Chairman of the Board), has evaluated the effectiveness of our internal control over financial reporting as of December 31, 2011, based on the criteria established in Internal Control \u0096 Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission., 82961=June 30, 96688=During fiscal year ending December 31, 2011, no options were issued, exercised or expired., 10791=As of April 4, 2012 there were 8,107,108 common shares issued and outstanding., 497390=September 29, 2010 documentation regarding the assignment of certain properties and the business note to Coghlan Family Corporation, 39019=As of December 31, 2011, the Company had experienced a dramatic increase in delinquencies, surpassing the level of national conventional market trends. In past market downturns, seller financed loan buyers weathered these downturns because most of our loans had high borrower\u0092s equity positions, were well-seasoned, and our investment ratios to value were much lower than in the conventional markets. However, in this present market downturn, those loans that have resulted in repossessions, in many cases, are secured by properties that have dropped in value to a level where the principal investment amount exceeds the collateral value., 118895=2008, 111850=2007, 103590=At December 31, 2011 and 2010, loans held for sale total $598,251 and $1,015,832, respectively.  Real estate owned total $1,095,353 and $1,029,362 at December 31, 2011 and 2010, respectively.  These properties were listed for sale.  , 406498=We maintain disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934, as amended (the \u0093Exchange Act\u0094) that are designed to be effective in providing reasonable assurance that information required to be disclosed in our reports under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the Securities and Exchange Commission (the \u0093SEC\u0094), and that such information is accumulated and communicated to our management to allow timely decisions regarding required disclosure., 139948=2011, 7977=Indicate by check mark whether the issuer (1) filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days. Yes [X] No [  ], 417856=JOHN R. COGHLAN, President, Chief Financial Officer, Director and Chairman of the Board, age 69, became a Director on January 2, 2006. Mr. Coghlan is a retired C.P.A. Mr. Coghlan became responsible for the overall management of operations January 1, 2010. Prior to that time, he acted in an advisory capacity to the Board of Directors. Mr. Coghlan graduated from the University of Montana with a degree in Business Administration and has held the designation of Certified Public Accountant since 1966.  Mr. Coghlan was a founder of Labor Ready, Inc., a New York Stock Exchange traded company, and served as Chief Financial Officer and Director of Labor Ready from 1987 through 1996, when he retired.  Since his retirement, the Coghlan Family Corporation, a privately held family business that manages family investment accounts, has employed Mr. Coghlan.  Coghlan Family Corporation is 100% owned by the Coghlan Family LLC.  John and Wendy Coghlan, husband and wife, own minority interests in Coghlan, LLC and control both the LLC and the Corporation through the LLC management agreement.  The remaining interests in the Coghlan, LLC are owned by Mr. Coghlan\u0092s children and grandchildren., 498791=CFO Certification pursuant to Section 302 of Sarbanes-Oxley Act of 2002, 355021=Bank line of credit:  At December 31, 2010, the Company had a promissory note with Riverbank, with a balance owing of $286,264, with a variable interest rate equal to the prime rate index (as published in the Wall Street journal) plus 1%, with a floor of 6%. The rate at December 31, 2011 and, 2010 was 6%. The line had a term of 14 months, and an origination fee of 1/2%, or $2,369.  The payments are due quarterly in the amount of $100,000, for the first four payments, and the last payment will be $95,164.   , 500170=The following materials from Genesis Financial, Inc.'s Annual Report on Form 10-K for the year ended December 31, 2011 are formatted in XBRL (eXtensible Business Reporting Language): (i) the Consolidated Balance Sheets, (ii) the Consolidated Statements of Operations, (iii) Consolidated Statement of Stockholders' Deficit, (iv) the Consolidated Statements of Cash Flow, and (iv) Notes to consolidated Financial Statements tagged as blocks of text., 444283=On November 5, 2010, the board of directors authorized the issuance of 250,000 common stock options to John Coghlan, Co-president and Director of the Company.  The compensation expense relating to Mr. Coghlan's grant was $41,988., 483294=To our knowledge, the Company's principal accountant during the fiscal years ending December 31, 2011 and December 31, 2010 did not engage any other persons or firms other than the principal accountant's full-time, permanent employees., 84196=December 31, 378707=December 31,, 65261=Although diversifying, it is the intention of the Company to retain its primary focus on real estate related property and loans. During the fourth quarter of 2010 and first quarter of 2011 Genesis conducted a private placement of preferred stock and focused on new investments and loans on a very selective basis. It is the intention of the company to keep this type of equity investment below forty percent of total assets and confine new real estate financing to the northwest portion of the United States., 52664=In 2007, the Company started to experience increased delinquencies, primarily due to a slow-down in the borrower\u0092s business, resulting in reduced cash flows.  The prior workouts that resulted in a payoff before repossession declined dramatically.  This appeared to be due to the fact that the borrowers could not refinance their collateral properties, nor could they sell their properties to pay off the loan.  This resulted in more repossessions, and the Company learned that it could not sell those repossessed properties as easily or for their appraised values., 379778=2010, 154110=On November 11, 2010 the Company filed Articles of Amendment to the Amended and Restated Articles of Incorporation creating 2,000,000 shares of Series \u0093B\u0094 Preferred Stock. The designated Series \u0093B\u0094 Preferred Stock consists of 2,000,000 with a par value $1.00; is non-dividend bearing, convertible to common at $.40 per share subject to any recapitalization. The holders of the Preferred stock will be entitled to receive, prior and in preference to any distributions to the holders of the common stock.  Each share of the Preferred Stock is convertible into two and one-half common stock shares at the option of the holder.  Each share of Series \u0093B\u0094 Preferred Stock can automatically converted immediately prior to the closing of a firm commitment underwritten initial public offering pursuant to an effective registration statement filed under the Securities Act of 1933 or upon the receipt by the Corporation of a written request for such request for such conversion from the holders of the majority of the Series \u0093B\u0094 Preferred Stock holders., 496871=Form of Security Agreement related to $250,000 Convertible Promissory Note Agreement with John R. Coghlan dated December 15, 2010, 185817=2010, 427522=In 2010 we compensated one officer with a grant of stock options.  Compensation expenses for 2011 and 2010 were $41,988 and $45,000, respectively., 155262=As of December 31, 2011, 2,000,000 shares had been sold with net proceeds of $2,000,000., 89673=There are no restrictions imposed on the Company, which limit its ability to declare or pay dividends on its common stock, except for corporate state law limitations. No cash dividends have been declared or paid to date and none are expected to be paid in the foreseeable future.  However, upon issuance of the Series \"B\" Preferred stock, the Company determined that a beneficial conversion feature of $1,102,250 and $194,833 had been realized for the years ended December 31, 2011 and 2010, respectively. This beneficial conversion feature was recognized as a deemed dividend distribution to the preferred shareholders on the date of issuance because the preferred stock is convertible at the option of the holder immediately upon issuance.  As of December 31, 2011, 2,000,000 Series \"B\" preferred shares had been sold with net proceeds of $2,000,000.  , 10040=The aggregate market value of the voting and non-voting common equity held by non-affiliates of the registrant on June 30, 2011, the last business day of the registrant\u0092s most recently completed fiscal year, based on the last reported trading price of the registrant\u0092s common stock on the Over the Counter Pink Sheets was $3,633,437. The sum excludes the shares held by officers, directors, and stockholders whose ownership exceeded 10% of the outstanding shares at June 30, 2011, in that such persons may be deemed affiliates of the Company. This determination of affiliate status is not necessarily a conclusive determination for other purposes.  , 387626=The Company has analyzed its filing positions in all jurisdictions where it is required to file income tax returns and have recognized that certain tax positions taken in the 2008 through 2010 years could result in minor adjustments to the fair value adjustments for tax purposes.  However, these adjustments would not result in a tax provision as they would result in revisions to the net operating loss carryforward amount., 375217=Outstanding and exercisable, December 31, 2010 and 2011, 300825=Genesis Financial, Inc. (\u0093the Company\u0094 or \u0093Genesis\u0094) was incorporated in Washington State on January 24, 2002.  The Company is primarily engaged in the business of purchasing and selling real estate receivable loans and periodically providing bridge capital funding.  Loans consist of real estate loans and mortgage notes collateralized by primarily first position liens on residential and commercial real estate.  The loans collateralized by real estate are typically non-conventional either because they are originated as a result of seller financing, or the underlying property is non-conventional., 149802=On December 15, 2010, the Company entered into a convertible note agreement with John R. Coghlan. The note accrues interest at 8% per annum with interest and balance due on December 15, 2012.  The note is convertible at anytime by Mr. Coghlan into 1 share of the Company\u0092s Series B Preferred stock for every $1.00 outstanding of the note payable and related accrued interest. In connection with the issuance of this note, the Company recognized a beneficial conversion feature of $128,750 that resulted in a discount to the note payable. The discount is being amortized into earnings over the term of the note. The note is collateralized by 290,000 shares of the Company\u0092s Series B Preferred stock. Presently, the Company has insufficient authorized Series B Preferred stock and will be required to amend the Series B Preferred Stock increasing the Series B to 2,290,000 authorized shares under the terms of the loan agreement. The beneficial conversion feature was based upon the difference between the fair value of the preferred stock into which the note is convertible at the date of issue ($378,750) less the face value of the note ($250,000).  The fair value of the preferred stock at the date of issue was calculated based upon the fair value of the shares of common stock (2.5 shares of common stock for each 1 shares of preferred stock or 625,000 shares) into which the preferred stock was convertible at the date of issue., 388171=We have determined that we are subject to examination of our income tax filings in the United States for the 2008 through 2011 tax years. In the event that the Company is assessed penalties and or interest, penalties will be charged to other operating expense and interest will be charged to interest expense., 132951=2010, 51765=MARKET ANALYSIS. The hard money market was quite strong in 2004, at the time of the Company\u0092s increased focus in making these loans, and continued that way throughout 2006.  Frequent foreclosure litigation and repossessions are an expected part of the hard money industry, in contrast to the conventional markets. With the exception of those few deals with unusual circumstances affecting the outcome, most problem loans were eventually worked out, and paid off, or the repossession and resale resulted in a profit, broke even, or at worse, the Company experienced a small loss.  The losses were at an acceptable level, but the Company established a fair value reserve account, and started setting aside funds to cover those small losses in 2005, and continued that practice throughout 2006., 355667=On May 16, 2011, the promissory note was converted to a $250,000 line of credit on the same terms and conditions. At December 31, 2011 the balance owing is $187,107. The line has a term of 12 months, and an origination fee of 1/2%, or $1,250. The payments are due monthly on the 1st on all accrued unpaid interest. The Riverbank line of credit is senior to the CFC line of credit, and is collateralized by the assets of Genesis.  The Riverbank line requires that the CFC line may not be paid down lower than the amount owing to Riverbank at any time during the term of the loan.  The line is payable on demand and is personally guaranteed by John R. and Wendy Coghlan, related parties of the Company., 351773=On November 23, 2010, the Company closed the purchase of an equity interest in Flyback Energy, Inc., for $1,200,000.  The purchase was for $1,200,000 of Series \u0093B\u0094 Preferred Stock and Common Stock Purchase Warrants from Flyback Energy, Inc., a closely held Washington corporation payable on an installment basis.  At November 23, 2010, the purchase represented a ten percent equity interest in Flyback Energy, Inc. assuming the warrants were exercised and Series \"B\" Preferred Shares converted into 2,666,666 of common stock.  At December 31, 2011, the purchases represented an eight percent equity interest in Flyback Energy Inc., 494293=Warehousing Line of Credit Agreement with Coghlan Family Corporation dated January 1, 2010, 158549=2010, 103196=During the year ended December 31, 2011 and 2010, the Company recognized $86,246 and $135,812, respectively, of interest, processing fee and other income. The Company wrote off interest receivable of $108,412 resulting in net loss from revenues of $22,166 during the year ended December 31, 2011., 467255=(3)  In computing the number of shares of common stock beneficially owned by a person and the percentage ownership of that person, we deemed outstanding shares of common stock subject to conversion of preferred stock and options held by that person that are currently exercisable or exercisable within 60 days of December 31, 2011. We did not deem those shares outstanding, however, for the purpose of computing the percentage ownership of any other person., 490585=Promissory Note with American West Bank dated October 14, 2004, 426111=Our board of directors adopted our Code of Ethical Conduct which applies to all of our employees and directors, including our principal executive officer, principal financial officer, principal accounting officer or controller, and persons performing similar functions.  We believe the adoption of our Code of Ethical Conduct is consistent with the requirements of the Sarbanes-Oxley Act of 2002., 398361=On December 15, 2010, John R. Coghlan purchased $500,000 of the Series “B” Preferred Stock being offered by the Company.  (See Note 6)., 379506=2011, 351282=The Company has no investments available for sale at December 31, 2011 and 2010.    , 184719=December 31,, 170939=2010, 48565=COMMERCIAL REAL ESTATE LENDING. Genesis was a commercial real estate lender on a small scale prior to 2004, supplementing the Company\u0092s seller financed loan acquisitions.  In the latter part of 2004, due to the competitiveness of the seller financed loan market, management decided to expand the Company\u0092s efforts in the commercial lending market.  Our broker network supplied us with potential borrowers. Since the management and staff of Genesis had considerable previous experience with commercial lending, it was a natural and comfortable adjustment. As with any business venture, the Company looked through the commercial lending industry for a \u0093niche\u0094, and it was determined that Genesis was best suited to do \u0093Hard Money\u0094 commercial lending. Hard money lenders focus on those loans that are usually smaller in size, shorter terms (more of an interim financing), often collateralized by non-conforming property types, or the borrowers do not qualify for conventional financing due to credit history issues.  Typically, hard money loans warrant a higher interest rate providing a smaller, high cost-of-funds lender like Genesis with the opportunity to earn a favorable return on investment., 408782=Based upon that evaluation, management concluded that our disclosure controls and procedures are effective at a reasonable assurance level as of December 31, 2011 to cause the information required to be disclosed by us in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods prescribed by SEC, and that such information is accumulated and communicated to management, including our Chief Executive Officer and Principal Financial Officer (Chairman of the Board), as appropriate, to allow timely decisions regarding required disclosure., 102710=Fiscal Year ended December 31, 2011 compared to year ended December 31, 2010., 82344=March 31, 158026=2011, 399601=On April 12, 2011, CFC purchased an additional 19,000 shares of Series B Preferred being offered by the company., 254173=BALANCES, DECEMBER 31, 2010, 476133=There was no purchase activity for the years ended December 31, 2011 and 2010., 397234=On September 1, 2010, John R Coghlan purchased a $41,980 interest in a Limited Liability Company that was applied to the CFC line of credit., 69094=As of January 1, 2011 the Company had one paid employee., 107555=2011, 3568=For the fiscal year ending December 31, 2011, 495283=Management and Servicing Agreement titled Corporate Restructuring Agreement with Genesis Financial Corporation dated December 27, 2008, effective January 1, 2009, 338818=December 31,, 109279=During 2011 and 2010, we outsourced our day-to-day operations to Genesis Finance Corporation, a company owned and controlled by Michael Kirk, an executive officer and director of Genesis Financial, Inc. Management believed this decision to outsource our day-to-day operations management has been very effective, and beneficial to the Company and its shareholders.  In 2006, 2007, and 2008, our operations expenses were $620,185, $576,904, and $500,415, respectively.  In 2009, 2010 and 2011 the operations expenses were $236,155, $367,145, and $141,087, respectively., 315850=2010, 414909=As of December 31, 2011, the Directors and Executive officers were as follows:, 445452=On November 5, 2010, the board of directors authorized the issuance of 250,000 common stock options to John Coghlan, Co-president and Director of the Company. The stock option, representing 250,000 common shares, has an exercise price of $.20 per share.  , 499711=CFO Certification pursuant to Section 906 of Sarbanes-Oxley Act of 2002, 320230=In May 2011, the FASB issued ASU 2011-04, which amends Subtopic 820 to clarify the application of existing common fair value measurement and disclosure requirements.  ASU 2011-04 provides clarification for the following:, 164418=December 31,, 491047=Warehousing Line of Credit Promissory Note Agreement with Coghlan Family Corporation dated April 18, 2006, 490094=Management and Loan Servicing Agreement with Genesis Holdings II, Inc. dated July 15, 2008, 31863=COMPETITIVE ADVANTAGE. In this competitive environment, Genesis sought to distinguish its offering from those of our competitors through excellent service, rapid customer response, and consistent and fair underwriting evaluations and procedures. We believed that our market focus on superb service and our existing contacts in the industry would provide a sustainable competitive advantage.  We also believed that our ability to diversify into other related markets, such as commercial real estate lending, would give us a competitive advantage. Throughout 2008, the Company focused on increasing its presence in the seller financed markets, supplementing that business with the occasional commercial real estate loan.  By the third quarter of 2008, it was becoming apparent that the real estate markets were going to get worse before they got better, and the Company tightened its purchasing and lending parameters to mitigate the increasing risk.  From January 1, 2009 through December 31, 2010, the Company out-sourced all its operations and servicing functions to reduce expenses, and further tightened underwriting parameters, while management focused on selling repossessed collateral properties and reducing company debt. We outsourced to Genesis Finance Corporation, a company owned and controlled by Mike Kirk, an executive officer and director of Genesis Financial, Inc., 470918=Genesis Financial, Inc. had the following related party transactions the years ended December 31, 2011 and 2010., 491552=Promissory Note with Riverbank dated June 29, 2009, 104217=During 2011 and 2010, we repossessed one and three, respectively, properties which represented real property collateral under our purchased loans., 218294= Year Ended December 31, 471152=Years Ended December 31, 2011 and 2010:, 386715=The deferred tax assets were calculated assuming a 39% and 34% tax rate at December 31, 2011 and December 31, 2010, respectively.  The annual tax provision (benefit) is different from the amount that would be provided by applying the statutory federal income tax rate to our pretax income (loss) primarily due to net operating loss carryovers and provisions for losses., 55230=As of January 1, 2011, the Company had down-sized enough to manage a sizable portion of its own affairs, and renegotiated its outsourcing agreement with Genesis Finance Corporation, an affiliate company, lowering the monthly fee to $1,500. As of January 1, 2012 the monthly fee was removed and the outsourcing services were offset by general offices expenses paid by the Company on behalf of Genesis finance Corporation.  On January 1, 2011, Genesis hired one employee, Virginia Walters, to manage its affairs going forward., 357105=Line of credit - affiliated company: the Company had a $2,500,000 Line of Credit Agreement with the Coghlan Family Corporation, Inc. (\u0093CFC\u0094), with balances owing of $1,510,000 and $1,750,845 at December 31, 2011 and 2010, respectively. CFC is an affiliated company controlled by a John R Coghlan. If the Company defaults on the agreement, the default interest rate will be 12%.  Interest is payable monthly. The line has a term of 12 months and an origination fee of 1/2% or $12,500. The credit line is collateralized by all of Genesis\u0092 assets and is subordinate to the RiverBank line of credit. The line of credit agreement requires that the Company maintain a debt to equity ratio of no greater than 3.0. Borrowings under the line are personally guaranteed by Michael A. Kirk, the CEO of the Company. Because of the economic conditions, CFC has agreed to waive the interest starting October 1, 2010 and has also agreed to waive the 3.0 debt to equity ratio requirement as well as the 12% default rate., 369239=The aggregate intrinsic value of options outstanding and exercisable as of December 31, 2011 was $850,000 based on our closing stock price of $1.05 per common share at December 31, 2011.  All options outstanding were fully vested and exercisable at December 31, 2011., 494791=Warehousing Line of Credit Agreement with Coghlan Family Corporation dated January 1, 2008, 371401=Outstanding and exercisable, December 31, 2009, 81646=Fiscal 2010, 475544=On September 29, 2010, CFC purchased a $54,820 interest in two properties secured by commercial real estate, a $619,103 interest in four properties secured by land, a $157,612 interest in two properties secured by residential real estate and a $2,249 interest in a business note in exchange for total reduction of $833,767 in the Company\u0092s line of credit balance with CFC.., 479081=The following table presents fees for professional audit services rendered by DeCoria, Maichel &Teague, P.S. for the audit or review of Genesis\u0092 financial statements for the years ended December 31, 2011 and 2010, and fees billed for other services rendered by DeCoria, Maichel & Teague, P.S.  , 268969=December 31, 2011, 363768=On April 10, 2002, the Board of Directors approved the Genesis Financial, Inc. Stock Option Plan (the Plan), and the Plan was subsequently approved by the Shareholders of the Company on May 2, 2002.  The plan allows for issuance of Incentive Stock Options (ISOs) and Non-statutory Stock Options (NSOs).  The maximum number of shares that may be subject to option and exercised under the Plan is 1,300,000 shares (adjusted for the two for one stock split that occurred in 2007).  The ISOs and NSOs expire 30 days after the recipient ceases to be an employee for the Company, or one year after the recipient\u0092s death.   , 33372=As of January 1, 2011 the Company was operating with one paid employee and outsourcing the property management in exchange for office expenses incurred by Genesis Finance Corporation., 49873=Although hard money loans carry a higher degree of risk, due to the non-conforming nature of the loans, that risk is partially offset with the low loan-to-value ratios, which seldom exceed 60%, providing a cushion for the lender if the property has to be repossessed and resold. Throughout 2008, as real estate values throughout the nation continued to decline, it became apparent that loan to value ratios as low as even 50%-60% were insufficient to provide that cushion for the lender, as values have dropped in some geographic areas as much as 50%-70%.  As of December 31, 2011, these values continued to decline, and the Company did not see an end to this decline., 151358=In connection with the Company\u0092s purchase of FEI\u0092s preferred stock, the Company entered into a note payable agreement with FEI, on November 23, 2010, for $700,000, to be paid in monthly installments of $140,000, through April 2011, plus interest at .035% per annum. The first payment was made in December 2010, and the balance at December 31, 2010 was $560,000. The note is collateralized by FEI preferred stock purchased by the Company.  This note was paid on full on April 18, 2011., 360974=On November 11, 2010 the Company filed Articles of Amendment to the Amended and Restated Articles of Incorporation creating 2,000,000 shares of Series B Preferred Stock.  The designated Series B Preferred Stock consists of 2,000,000 shares with a par value $1.00; is non-dividend bearing, convertible to Common Stock at $.40 per share subject to any recapitalization. The holders of the Preferred Stock will be entitled to receive, prior and in preference to any Distributions of any assets of the Corporation to the holders of the Common Stock.  Each share of the Preferred Stock is convertible into two and one-half common stock shares at the option of the holder.  Each share of Series B Preferred Stock can automatically converted immediately prior to the closing of a firm commitment underwritten initial public offering pursuant to an effective registration statement filed under the Securities Act of 1933 or upon the receipt by the Corporation of a written request for such request for such conversion from the holders of the majority of the Series B Preferred Stock holders., 95983=(1)  Original stock option plan was 650,000 shares, but has been adjusted for a 2 for 1 forward stock split which occurred on January 2, 2007., 405439=We have had no disagreements on any matter of accounting principles or practices, financial statement disclosure, or auditing scope or procedures with any of our accountants for the years ended December 31, 2011 and 2010, or any interim periods.  We have not had any other changes in, nor have we had a disagreement, whether or not resolved, with our accountants on accounting and financial disclosures during our recent fiscal year or any later interim period., 472583=As of January 1, 2012, the monthly fee was removed and the outsourcing services were offset by general offices expenses paid by the Company on behalf of Genesis Finance Corporation., 242118=BALANCES, DECEMBER 31, 2009, 387203=At December 31, 2011, the Company had a federal net operating loss carry forward available for income tax purposes of approximately $2,500,000.  Because management does not believe it is more likely than not that the carry forward will be utilized, the related deferred tax asset has been fully reserved., 331577=Year Ended December 31,, 396589=There was no activity for the year ended December 31, 2011., 106707=December 31,, 437852=OUTSTANDING EQUITY AWARDS AT December 31, 2011, 36473=The economic environment as of December 31, 2011 was very volatile, and while it had created a uniquely attractive opportunity for Genesis, we still had a real estate market that was experiencing dramatically declining values.  Interest rates were at low levels.  Simultaneously, the banks and large finance companies had tightened credit requirements and had completely exited the \"sub-prime\" lending markets, providing opportunities for those who were properly positioned to take advantage of the situation. Genesis will seek opportunities to acquire real estate loans, and/or properties, in the northwest United States which we believe will provide targeted financial returns., 489607=Management and Loan Servicing Agreement with Genesis Holdings, Inc. dated April 6, 2004, 477680=On October 20, 2011, the Company entered into a month-to-month tenancy with 3773 West Fifth, LLC, a company owned and controlled by John and Wendy Coghlan. The monthly rent is $750, 472257=As of January 1, 2011, the Company had down-sized enough to manage a sizable portion of its own affairs, and renegotiated its agreement with Genesis Finance Corporation, lowering the monthly fee to $1,500.  , 318911=New Accounting Pronouncements \u0097 In June 2011, the Financial Accounting Standards Board (\"FASB\") issued Accounting Standards Update (\"ASU\") 2011-05, which, among other things, amended Subtopic 220 with respect to the presentation of other comprehensive income and its components in the financial statements.  The update amended Subtopic 220 so that a Securities and Exchange Commission filer may present other comprehensive income either in a single continuous statement or in two separate but consecutive statements.  The filer is also required to present on the face of the financial statements reclassification adjustments for items that are reclassified from other comprehensive income to net income in the statements where the components of net income and the components of other comprehensive income are presented.  The amendments in this update apply to both annual and interim periods beginning after December 15, 2011, with the exception of the amendment regarding presentation of reclassification adjustments, which has been deferred to a later date.  Adoption of this update is not anticipated to have a material impact on our financial statements., 395636=On January 1, 2009, the Company entered into a Management and Servicing Agreement with Genesis Finance Corporation, a Washington Corporation. Mike Kirk, Genesis Financial, Inc.\u0092s president is the president Genesis Finance Corporation. The Company agrees to pay Genesis Finance Corporation a monthly fee of $6,000 per the Management and Servicing Agreement. As of January 1, 2011, the Company had down-sized enough to manage a sizable portion of its own affairs, and renegotiated its outsourcing agreement with Genesis Finance Corporation, lowering the monthly fee to $1,500. As of January 1, 2012 the monthly fee was removed and the outsourcing services were offset by general offices expenses paid by the Company on behalf of Genesis finance Corporation.  , 147752=At December 31, 2011 and 2010, the Company had a $2,500,000 Line of Credit Agreement with the Coghlan Family Corporation, Inc. (\u0093CFC\u0094), with balances owing of $1,510,000 and $1,750,845, respectively. CFC is an affiliated company controlled by a John R Coghlan. If the Company defaults on the agreement, the default interest rate will be 12%.  Interest is payable monthly. The line has a term of 12 months and an origination fee of 1/2% or $12,500. The credit line is collateralized by all of Genesis\u0092 assets and is subordinate to the RiverBank line of credit. The line of credit agreement requires that the Company maintain a debt to equity ratio of no greater than 3.0. Borrowings under the line are personally guaranteed by Michael A. Kirk, the CEO of the Company. Because of the economic conditions, CFC has agreed to waive the interest starting October 1, 2010 and has also agreed to waive the 3.0 debt to equity ratio requirement as well as the 12% default rate., 352542=The Company paid $500,000 down with the balance of $700,000 payable on a promissory note at $140,000 monthly commencing December 23, 2010.  The $700,000 note was paid in full during the second quarter of 2011. On April 25, 2011, the Company purchased $50,000 of Series \u0093C\u0094 Preferred Stock that is convertible at $.60 per share or 83,333 shares of common stock and bears a 5% dividend rate., 417451=As of December 31, 2011, Genesis operated with three Executive Officers and a three member Board of Directors. The Company anticipates adding additional board members during the next twelve months. The following are brief biographical descriptions of the current Executive Officers and Directors of Genesis., 180274=We have audited the accompanying balance sheets of Genesis Financial, Inc. (\u0093the Company\u0094) as of December 31, 2011 and 2010, and the related statements of operations, changes in stockholders\u0092 equity and cash flows for the years then ended. These financial statements are the responsibility of the Company\u0092s management. Our responsibility is to express an opinion on these financial statements based on our audits., 419167=Labor Ready, Inc. is an international provider of temporary labor with 769 locations as of March 28, 2003 and annual revenues of $862.7 million for the year ended December 31, 2002.  At the time Mr. Coghlan retired from Labor Ready in 1996, it operated 200 locations and generated $163 million in annual revenues., 500954=*    In accordance with Item 601of Regulation S-K, this Exhibit is hereby furnished to the SEC as an accompanying document and is not deemed \u0093filed\u0094 for purposes of Section 18 of the Securities Exchange Act of 1934 or otherwise subject to the liabilities of that Section, nor shall it be deemed incorporated by reference into any filing under the Securities Act of 1933., 40805=PARTIAL PURCHASE. This is the purchase of the front portion of the contract cash flow. For example, Genesis might purchase the first ten years cash flow of a twenty year note, and the remaining ten years might be retained by the seller. In a partial purchase, our position is secured by a recorded full assignment of the note. An unrecorded \"Partial Purchase Agreement\" contract is signed with the seller, outlining the agreement. The seller's position in title is eliminated, and should the note go into default, the seller must either pay off our position or forfeit its rights to the remaining cash flow. In 2008, Genesis decided to pursue this partial purchase product in earnest because we believed that the investment risk was considerably lower than the full purchase product. As of December 31, 2011, this was our promoted preference for purchases., 31482=more commercial real estate lending in late 2004, due to the heavy competition, and at the end of 2007, made the decision to change that focus back towards the seller financed real estate loans, to take advantage of the void left by the exiting big players., 315737=2011, 474693=On April 12, 2011, CFC purchased an additional 19,000 shares of Series \u0093B\u0094 Preferred being offered by the company for $19,000., 473613=On November 5, 2010, John R. Coghlan was granted 250,000 common stock options exercisable at $0.20 per share in consideration of $41,988 officer's compensation., 148822=On September 29, 2010, CFC was assigned two properties secured by commercial real estate, an interest in four properties secured by land, an interest in two properties secured by residential real estate and an interest in a business note in exchange for total reduction of $833,767 in the Company\u0092s line of credit balance with CFC., 444615=Upon ninety (90) days advance notice, Mr. Coghlan for all or part of the Shares on, or before December 31, 2014 may exercise the Option.  Upon expiration or termination, the Option will be void., 62722=On December 6, 2010, Genesis Financial, Inc. entered into an agreement with AWG International, Inc., a Nevada corporation, to purchase 54,953 shares of the AWG International, Inc. Common Stock for $250,000. As part of the transaction, Genesis Financial, Inc. was also issued Common Stock Purchase Warrants to acquire an additional 54,953 common shares for $250,000.  The Company exercised the warrants during the first quarter of 2011., 399948=On January 1, 2008, the Company entered into a Line of Credit Agreement Promissory Note Agreement with Coghlan Family Corporation.  (See Note 5), 476436=On December 31, 2011, Genesis Holdings, Inc. booked $24,880 in management fees and $12,455 in servicing fees for 2011 and still owes $9,654., 109143=Competitive Advantages of Outsourcing 2011-2010, 63276=AWG International, Inc. was organized in the State of Nevada on March 18, 2010.  The Company had nominal revenues for the years ending December 31, 2011 and 2010.  Its assets consist principally of intellectual property., 166490=2010, 264188=BALANCES, DECEMBER 31, 2011, 102892=Net loss from operations for the years ended December 31, 2011 and 2010 were $580,646 and $440,760, respectively.  The primary reasons for the losses were fair value adjustments and operating expenses., 388768=At December 31, 2011 and 2010, the carrying amounts of cash and cash equivalents, lines of credits and notes payable approximate their fair value because of the short maturity or holding period of these instruments., 53621=From December 31, 2007 through December 31, 2011 the real estate markets throughout the country were experiencing dramatic down-turns in values, and at the same time the lending markets were tightening up, making refinancing very difficult, regardless of the property type.  The Company was experiencing increasing delinquencies, resulting in increased litigation expense, and eventual repossession.  In several cases, it was apparent that the value of the collateral had dropped below the principal loan balance, which assured significant financial losses.  The Company is currently concentrating on the collection and liquidation of prior loans and real estate and is making few new loans., 165506=2011, 91485=The following table summarizes our equity compensation plan information as of December 31, 2011.  Information is included for equity compensation plans not approved by our security holders., 473172=On February 2, 2010, John R. Coghlan purchased a $157,790 interest in a commercial loan from the Company., 421302=Prior to founding Genesis, Mr. Kirk was the Senior Vice President of Metropolitan Mortgage & Securities Co., Inc. (\"Metropolitan\"). In that capacity, Mr. Kirk managed a staff of 155 and was responsible for all corporate production units, including real estate loan acquisition, commercial real estate lending, wholesale residential lending, retail residential lending, correspondent lending, secondary markets, alternative cash flow acquisitions, and equipment leasing. In Metropolitan's fiscal year ending in 2000, his operations produced $634 million in transaction volume, involved $900+ million in total assets and contributed $97 million in revenues. Mr. Kirk joined Metropolitan in 1982 as a contract buyer and a member of the underwriting committee. He was a contract buyer and senior underwriter for 12 years. During his tenure with Metropolitan, Mr. Kirk was a member of a team that moved the company from a retail focus to the wholesale market, and increased production ranging between 20% and 55% annually 5 years in a row. He was instrumental in turning Metropolitan into a diverse, full-service financial institution and personally designed and implemented many of the products available at Metropolitan. He also coordinated Metropolitan's securitization business., 26471=INTRODUCTION. Genesis was incorporated in the State of Washington on January 24, 2002 for the purpose of purchasing and reselling seller financed real estate loans (also referred to as \"loans\" or \"real estate notes\" or \"portfolio\"). All loans purchased or originated, are held for sale, and are carried on the financial statements at cost or fair value, whichever is less.  We purchase seller financed real estate loans from sellers directly or from sellers who are introduced to Genesis by brokers. When the owner of a real estate loans wishes to sell the loan, the owner may contact a broker or Genesis directly.  Seller financed real estate loans are originated by the selling owner of real property.  This is an unconventional form of financing which does not involve banks or mortgage companies.  When we commenced business, we initially focused on purchasing residential and commercial real estate loans and business notes from $25,000 to $250,000 in value, and the brokering of larger transactions. As the business grew, we expanded our services to include larger loans and other forms of cash flow investment instruments., 11606=December 31, 2011, 149251=We consider the terms of the promissory note and lines of credit to be acceptable. As of December 31, 2011 and 2010, the total combined balances on promissory note and the lines of credit were $1,697,107 and $2,037,109, respectively. Interest expense on the lines of credit will fluctuate in future periods with loan reductions. The decrease for the lines of credit for the years December 31, 2010 and 2009, were ($340,002) and ($951,891), respectively., 398004=On December 15, 2010, John R. Coghlan entered into a convertible note payable with the Company for $250,000. (See Note 5)., 362514=Upon issuance of the preferred stock, the Company determined that a beneficial conversion feature of $1,102,250 and $194,833 for the 2011 issuances and the 2010 issuances, respectively, was realized.  This beneficial conversion feature was recognized as a deemed dividend distribution to the preferred shareholders on the date of issuance because the preferred stock is convertible at the option of the holder immediately upon issuance.  , 155926=At December 31, 2011 and 2010, we had cash available of $22,117 and $117,455, respectively on the Riverbank line of credit., 3370=[X]   ANNUAL REPORT UNDER SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 502785=Pursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized., 395248=Genesis Financial, Inc. had the following related party transactions the years ended December 31, 2011 and 2010., 73255=The majority of the properties owned by us were acquired through foreclosure of various loans in our loan portfolio.  A description of our REO with a total net carrying value of $1,095,393 as of December 31, 2011 follows:, 85435=Fiscal 2011, 487526=SB-2 filed February 20, 2003, 402409=During the year ended December 31, 2011.Genesis Holdings, Inc. recorded $24,880 in management fees and $12,455 in servicing fees for 2011 and still owes the Company $9,654 at December 31, 2011, 362186=During the year ended December 31, 2010, 850,500 shares had been sold with net proceeds of $850,500. During the year ended December 31, 2011, an additional 1,149,500 shares were sold for net proceeds of $1,149,500., 427771=The following table set forth the compensation information on executive officers Michael A. Kirk, John Coghlan and Virginia Walters for the fiscal years ending December 31, 2011 and 2010.}",
    "textBeforeTable": "(Name of Issuer in its Charter) Genesis Financial, Inc. Commission file number:  333-103331 For the transition period from                 to                    [  ]   TRANSITION REPORT UNDER SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934 For the fiscal year ending December 31, 2011 [X]   ANNUAL REPORT UNDER SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934 (Mark One) FORM 10-K WASHINGTON, D.C. 20549 SECURITIES AND EXCHANGE COMMISSION UNITED STATES exhibit1016.htm EX-10 - FORM OF SECURITY AGREEMENT - GENESIS FINANCIAL INC exhibit1014.htm EX-10 - FORM OF CONVERTIBLE NOTE AGREEMENT - GENESIS FINANCIAL INC exhibit1015.htm EX-10 - FORM OF CONVERTIBLE NOTE AGREEMENT - GENESIS FINANCIAL INC exhibit1017.htm EX-10 - DOCUMENTATION - GENESIS FINANCIAL INC exhibit1010.htm EX-10 - FORM OF COMMON STOCK PURCHASE WARRANT - GENESIS FINANCIAL INC exhibit108.htm EX-10 - FORM OF PROMISSORY NOTE - GENESIS FINANCIAL INC exhibit109.htm EX-10 - FORM OF PURCHASE AGREEMENT - GENESIS FINANCIAL INC exhibit106.htm EX-10 - FORM OF SERIES B STOCK PURCHASE AGREEMENT - GENESIS FINANCIAL INC exhibit107.htm",
    "textAfterTable": "(Zip Code) Issuer\u0092s telephone number: (208) 457-9442 Securities Registered Pursuant of Section 12(b) of the Act: None Securities Registered Pursuant of Section 12(g) of the Act: None Indicate by check mark if the registrant is a well-known seasoned issuer, as defined in Rule 405 of the Securities Act.  Yes [  ]   No [X] Indicate by check mark of the registrant is not required to file reports pursuant to Section 13 or 15(d) of the Act.  Yes [  ] No [X] Indicate by check mark whether the issuer (1) filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days. Yes [X] No [  ] Indicate by check mark whether the registrant has submitted electronically and posted on its corporate Web site, if any, every Interactive Data File required to be submitted and posted pursuant to Rule 405 of Regulation S-T (§232.405 of this chapter) during the preceding 12 months (or for such shorter period that the registrant was required to submit and post such files).  Yes [",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}