{
    "relation": [
        [
            "Description",
            "Small",
            "Medium",
            "Large",
            "X-Large",
            "2X-Large"
        ],
        [
            "Size",
            "29-41\u0094",
            "32-47\u0094",
            "35-51\u0094",
            "37-57\u0094",
            "42-61\u0094"
        ],
        [
            "Color Code",
            "yellow",
            "Blue",
            "Brown",
            "Green",
            "Orange"
        ],
        [
            "Qty",
            "3/pk",
            "3/pk",
            "3/pk",
            "3/pk",
            "3/pk"
        ],
        [
            "SKU",
            "AA90691",
            "AA90692",
            "AA90693",
            "AA90694",
            "AA90695"
        ]
    ],
    "pageTitle": "Abri-Fix Pants Super",
    "title": "",
    "url": "http://www.idiaper.com/Abri-Fix-Pants-Super_p_23248.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 512078378,
    "recordOffset": 512062716,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Abri-Fix products offer comfort, security and user dignity. Abri-Fix is easy-to-use and looks like normal underwear and they are reusable. Abri-Fix offer the possibility for individual solutions. Products specially designed for optimum pad fixation and comfort Widest span in sizes \u0096 from Small to XX-Large Widest range covering different needs and user situations Abena produces by far the largest range of fitting products to match different user groups, and also for extreme sizes. The Abri-Fix range has been developed in close co-operation with end users, care staff and our own nurse specialists. Normal underwear is not ideal as a fitting product, since there needs to be room for the absorbent product to fit inside, securely and comfortably. Needs and requirements for a certain quality and price mix can vary greatly, depending on whether the products are for short term or longer term users, or whether the products are for institutional or private use. Individualised care through: Abri-Fix Reusable Pants  Description",
    "textAfterTable": "AA90695 100% FREE SHIPPING ON ALL ORDERS IN THE CONTINENTAL US",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}