{
    "relation": [
        [
            "",
            "VIOLATION OF SAFETY",
            "REGULATION WHICH",
            "ENDANGERS LIFE OR",
            "PROPERTY"
        ],
        [
            "",
            "Reprimand to",
            "5-day",
            "suspension",
            ""
        ],
        [
            "",
            "5-day",
            "suspension to",
            "30-day",
            "suspension"
        ],
        [
            "",
            "10-day suspension",
            "to removal",
            "",
            ""
        ]
    ],
    "pageTitle": "[Decision Number] | FLRA.GOV",
    "title": "",
    "url": "https://www.flra.gov/decisions/v40/40-008.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00101-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909287551,
    "recordOffset": 909264622,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{24018=We note that the Agency's schedule of offenses and penalties contains a similar exception: \"Remedies for offenses should normally fall within the range shown in the schedule unless mitigating or aggravating factors justify a remedy outside the range.\" See Appendix B. However, the fact that the proposal adopts an exception to the schedule of penalties that is substantively the same as that prescribed by the Agency does not affect the negotiability of the proposal. See Patent Office Professional Association and Patent and Trademark Office, Department of Commerce, 25 FLRA 384, 402, 406 (1987), aff'd mem. sub nom. Patent Office Professional Association v. FLRA, No. 87-1135 (D.C. Cir. Mar. 30, 1988) (per curiam)., 72002=2302, 108526=OCPMINST 12752.1 CH-1, 7619=40:0056(8)NG - - NAGE Local R4-45 and Navy Resale and Service Support Office, Norfolk, Virginia - - 1991 FLRAdec NG - - v40 p56, 18262=Proposals that restrict the penalty that can be imposed on employees for a given offense directly interfere with management's right to discipline employees under section 7106(a)(2)(A) of the Statute. See U.S. Department of the Navy, Naval Aviation Depot, Marine Corps Air Station, Cherry Point, North Carolina, 36 FLRA 28, 32-36 (1990) (Marine Corps Air Station); American Federation of Government Employees, Local 1770 and U.S. Department of the Army Headquarters, XVII Airborne Corps and Fort Bragg, Fort Bragg, North Carolina, 34 FLRA 903, 906-07 (1990) (Fort Bragg); West Point Elementary School, 29 FLRA at 1538-40; and Fort Eustis, 29 FLRA at 968-70., 102623=OCPMINST 12752.1 CH-1, 94615=OCPMINST 12752.1 CH-1, 11407=The Agency contends that the proposal is nonnegotiable because it directly interferes with management's right to discipline employees under section 7106(a)(2)(A) of the Statute. The Agency notes that the Authority has held to be nonnegotiable proposals that incorporate into the parties' agreement terms governing the range of disciplinary actions that were drawn from existing agency regulations. Id. at 3-4, citing New York State Nurses Association and Veterans Administration, Bronx Medical Center, 30 FLRA 706, 732-35 (1987), reversed as to other matters sub nom. Veterans Administration Bronx Medical Center v. FLRA, No. 88-1150 (D.C. Cir. Sept. 27, 1988), decision on remand, 33 FLRA 377 (1988), request for reconsideration denied, 34 FLRA 805 (1990), petition for review dismissed sub nom. New York State Nurses Association v. FLRA, No. 88-1893 (D.C. Cir. April 11, 1989); West Point Elementary School Teachers Association, NEA and The United States Military Academy Elementary School, West Point, New York, 29 FLRA 1531, 1538-40 (1987), affirmed on other grounds sub nom. West Point Elementary School Teachers Association v. FLRA, 855 F.2d 936 (2d Cir. 1988) (West Point Elementary School); National Federation of Federal Employees, Council of Veterans Administration Locals and Veterans Administration, 31 FLRA 360, 399-410 (1988), remanded as to other matters sub nom. Veterans Administration v. FLRA, No. 88-1314 (D.C. Cir. Sept. 27, 1988), decision on remand, 33 FLRA 349 (1988). The Agency argues that the proposal in this case is \"more intrusive\" because the Union \"is attempting to negotiate the penalties that may be imposed for various infractions.\" Id. at 4., 93168=c. Undue hardship on an activity/command. 29 CFR 1613.704(c) provides that reasonable accommodation is not required when it would impose an undue hardship on the operation of the program of the employee's activity/command, such as continuing an unreliable employee in a critical function or in duties which could affect the health or welfare of others.}",
    "lastModified": "Wed, 05 Aug 2015 10:48:36 GMT",
    "textBeforeTable": "10-day suspension to removal  5-day suspension to  removal  Reprimand to 5-day suspension FALSIFYING ATTENDANCE RECORD FOR ONESELF OR ANOTHER EMPLOYEE 10-day  suspension to  removal  5-day suspension to removal Reprimand to  removal  EXCESSIVE  UNAUTHORIZED ABSENCE (MORE THAN 5  CONSECUTIVE WORK DAYS)               ATTENDANCE         THIRD OFFENSE SECOND OFFENSE      FIRST OFFENSE OFFENSES   OFFENSES AND RANGES OF REMEDIES (PENALTIES) 5. For information concerning other offenses for which employees may be disciplined by removal, fine or imprisonment, see FPM Chapter 735. 4. Suspension remedies on this schedule refer to CALENDAR DAYS. 3. Remedies for disciplinary offenses will generally range from the minimum remedy to the maximum indicated. However, depending on the gravity of the offense, the past record, and the position of the employee, a remedy outside",
    "textAfterTable": "UNEXCUSED TARDINESS  Reprimand Reprimand to  Reprimand to 1-day  2-day suspension  suspension CONDUCT ACTUAL OR ATTEMPTED  Reprimand to  5-day  10-day THEFT OF GOVERNMENT  removal  suspension to  suspension to PROPERTY OR THE  removal  removal PROPERTY OF OTHERS CRIMINAL, DISHONEST,  Reprimand to  5-day  10-day INFAMOUS OR NOTORI-  removal  suspension to  suspension to OULSLY DISGRACEFUL  removal  removal",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}