{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,168 topics 2,126,886 replies",
            "85,565 topics 1,154,216 replies",
            "1,071 topics 11,084 replies",
            "4,218 topics 64,772 replies",
            "5,996 topics 75,831 replies",
            "50,556 topics 466,351 replies",
            "22,767 topics 196,346 replies",
            "4,275 topics 60,564 replies",
            "1,127 topics 8,223 replies",
            "3,611 topics 115,957 replies"
        ],
        [
            "Last Post Info",
            "Anyone else thinks Michael... By Scaglietti A minute ago",
            "Characters who needed more... By Mirage Las Vegas 7 minutes ago",
            "The Ultimate 100% Save File... By Militia 3 hours ago",
            "Which Vehicle Do You Prefer? By svanderman 3 hours ago",
            "Was LCS as good as other GTAs? By Militia 20 hours ago",
            "Gta San Andreas on WIndows... By Raavi 34 minutes ago",
            "The Ultimate 100% Save File... By Militia 3 hours ago",
            "Playstation store version ps3 By Militia 2 hours ago",
            "What do you hate of GTA 2? By Cerium 19 hours ago",
            "Grand Theft Auto - Memes By Tomasak 3 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Track&f=226&t=412847",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00213-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 109909123,
    "recordOffset": 109887210,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16692=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 47809=Bing, Fubbick, hitman774, JackhammahNZ, Google, Cyberzone2, JAKEBAB, Yahoo, Dodow, Coleco, IParadise CityI, sivispacem, Sveittjpong, Tomasak, HaythamKenway, SaL_Leone, FuzzyWaffles88, xInfamousRYANx, Kixa, JakeHorgrove, Owl Man, summerdoll, Google Mobile, ZeroSafe5615, C64fanatic, SharoFFenstein, R.Rezzrax, Jax765, Pavle, arewenotmen, Fox2Quick, Nerfgoth, Days Are Gone, Azum, CaptHayes, The Hero, Amlack, Dexter_Raminus, livejoker, Frozen Valor, p-s-3x, SAVILLAIN, Mach1bud, blackindia, Bread_, Smooth Longsack, NoSignal666, LILSPILLYUM, .Sharingan, CaptainMarvel, wrilky, GTA4LIFE9000, jazzbone, The Lone Wanderer, Christophe69, jam_1989, KBG, driver7, Bongsquirrel, Semaj 2JZ♢, RageJenB, universetwisters, HulioG, Walter175, RandomStunt, RedDagger, LittleBlueTroll, Gazaag, m2roadwarrior, lebongjames187, coach_wargo, Shia LaBeouf, emelen, stainesey, Pikas_PK, 44MA9NUM357, Shotty Pop, the nameless, ballen205, DumbForum, CMCSAVAGE, GTA_Matt24, Slasherr, CaptianBackwoods, Royal22, xX 5yndicat3 Xx, LFC484, Scaife13, Nick1020, Braindawg, ArmorKingHunter, Jacob_Rivera_11232, woories19, teagle, Phnx., 55d, LuizLopezIV, Matttheking2015, Alfred Packer, Farque2, Chaos69soahC, Dondara, DonSpeedy, kcchief1981, silentkiller44, NcShane, SneakyPenguin91, Cancerslug, Craank_AG, Randy93, Ivan1997GTA, esmittystud101, Netman005, Lubas, Screwe45, Electrogypsy, ShadowCola, theNGclan, CML99, Superfrogger, Officer Garza, Burgermauger, Jon3s, Anotic, Jurm, FunkyFreak, kaasje, Mirage Las Vegas, Zoolock, clevertrev, FMHn, Itzreality, HarpinHurst, longhurstgb, LukeyDukey1988, Ak47clower, Th3MaN1, r.lorenzo13, ZCAB, Johnny Playert, smokingndriving, GodHatesKittens, toxluv, rob2021, Supermaxi800, TheMcSame, lolznc, //XP//, Corndog93, Kachii, conedotexe, Pletzturra, Mr. Fahrenheit, Los Santos citizen, BeckermannDewitt, goldadderXD, StangOne50, iNero, Runnin_Gag, VideoGameJames, UlfiDerGeier, TwisterVictor1, Svip, Arms Dealer, JuZ 75, MrBossFTW, Super1334Pwner48, scania970, ShiviSRT-10, Nathan46970, Sickboy6, Xing of Virtue, Darrel, Ezuu, Kiyone_Alien_Cop, machine4578, Special Members, Fireman, Total Failure, Broken Condom Kid, paulhv2, Cognoscenti, Epic., m3tal z_DKI, DrRockso26, NotAHipster, VikDarkbomb, journeystuart, Receptor, Cico555, beretta-gt88, ZANTHERA, MaidenOfWar, Chuck Finley, 12thmanfirefighter, Gnarwolf, Pyroshox, KornbreadMaf1a, Blackbird88, Doktor Gott, CM-Punk, blah265, RideEmOut2, jerryinohio78, Alvarez, svanderman, pedrohenrique23, Turbocharger, ScarySKRILLEX, een57, Los Santos Kid, Marticus, unicornace, StingR, Hylskriksen, Tank, kadajacs, gtuned, lord tammerlain, whywontyoulisten, Indignation, WalterS_LV, Loc14, Souths CraZe, iiConTr0v3rSYx, 21132=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12760=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 14309=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 108199=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 9466=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 18851=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By JakeHorgrove The GTAForums Official R* Crew 614,465 replies 15,212 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By JakeHorgrove The next DLC 2,291,154 replies 113,683 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,510 topics 416,507 replies Ryosuke's normal map pl... By Bread_ 42 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}