{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,108 topics 2,124,067 replies",
            "85,552 topics 1,153,641 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,757 replies",
            "5,996 topics 75,810 replies",
            "50,539 topics 466,164 replies",
            "22,766 topics 196,288 replies",
            "4,270 topics 60,440 replies",
            "1,128 topics 8,214 replies",
            "3,599 topics 115,213 replies"
        ],
        [
            "Last Post Info",
            "Is there something we can d... By Fuzzknuckles 4 minutes ago",
            "Reasons why GTA IV is bette... By MrDeSanta 4 minutes ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Ultimate 100% Save File... By Militia 22 hours ago",
            "Whats your favorite/hated r... By Kristian. 17 hours ago",
            "Snail Trail's Spook-o-m... By Spider-Vice 5 hours ago",
            "Which Vehicle Do You Prefer? By PhillBellic 56 minutes ago",
            "Which Vehicle Do You Prefer? By PhillBellic 20 minutes ago",
            "Anybody has a 100 % savegame? By Cerium A day ago",
            "Mapmaking By PhillBellic 15 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=2&t=191838&p=2836844",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 104237691,
    "recordOffset": 104212534,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{99821=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 14507=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 9506=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 19002=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 21119=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12788=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 16816=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 47838=Bing, Yahoo, CyberGhost101, Google, PhillBellic, OysterBarron, No_Flex_zone, Nick1020, Fonshway, arewenotmen, svanderman, Chaise, El-Gaddafii, missanthropy, Oldsmobile_85, Indignation, Alec Skorpio, Th3MaN1, XenoxX, dueldeluxe, SatournFan, MyNameJeff, A Siente, TexasRocks, zoso80, zapotist, hoopz71, MrManquet, Hyde Original, TheSikkest, Mr. Fahrenheit, GamesBoy316, Reconified, Svip, Freakorama, JON22, 11john11, dlow, gizmonomono, PentagonSteeringWheel, Wolfpac4Life, Gummy , Wombater, gelou307, rlr149, Josivers, SmilingjacK420, Gridl0k, hotline.n.w.refn, Junior_Djjr, hamizzzz, RiseAgainBH, Katabasis, Paul_silvana10910, jBhIpS, mobe, RJSanModder, Furry_Monkey, WhosYu, SuperGTFan, michael de santa shit, A-Lonely-Dragon, Scuba 21, PANiC ATTACK3R, paperbagdude, Google Mobile, Jon3s, Wesser, lebongjames187, TheUnholy, DOCTOR USS875, Pavle, athande, Mockingbae, GTAKid667, Speedz0r, vorwort, The Intellect, Fuzzknuckles, lunchxbles, TalkToMyAgent, Edmachine, Lester-The-Molester, BlaineCountyRoleplays, Saint_Jackie, KyloW13, shadowkill98, NikoB08, UshaB, GTAandStuff, REXX93, ZEST, super_slav, AnnouncerKoto, drew0318, Retired Mafia, Chris CJ Jakobsson, blackalienHD, zSaintX, kulomet333, alexthingy, Zasalive, Khumaro, v1p3r_eddy, Razor440, thedarksayia, GTAclown, Masny, TempleOfLight, jdwarfer, IvI Ph03nix IvI, BlackMilk, Receptor, Barrett_killz, Nopheros, Eqaulo, U.N.K.N.O.W.N, nehctik, GTAGuy1995, GipsyDanger MK2, Joeysa, maus05, Halal Cyborg, Onyxo599, kalle55, Wallly, RafaeShe, kuusko, __TheGovernor__, JimmyFantastic, hornedturtle, wtf is a madrazo, RoloBabs, size_m, The Odyssey, Marwin, BurnettVice, TheIceWarrior, GTAVNoob, Sky_Light12, Earleys, joshloar10, Nate Courage, boppa_, ClaudeSpeed1911, dkluin, UAL, Marticus, shmok2, Andreas_XTC, sleepwalk1980, FedoraTheExplora, Pressure Drop, asktheking, Awesome.D, Shotty Pop, yojc, Girish, Gantons Most Wanted, K20, Phangled5, Kalitu, Tacts_21, Apex., Mr.untitled, MeowMix99914, Carbonox, ODD_ZoeWowiee, Malcot, UTKR, longhurstgb, Sangers, MGgames100, Parikshit Singh, TobISIS, Euda, raggazam, volta2001, daliakiller, zignat, Matttheking2015, TJGM, mab-gast, Argonaut, marvinviray, AdusPL, Heisenberg_GR}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 5 minutes ago By BlaineCountyRoleplays Professional Police Role Pl... 613,647 replies 15,199 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By svanderman New Heist Ideas 2,280,667 replies 113,297 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,454 topics 416,590 replies Requests/Finds (Mods you... By GTAclown 7 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}