{"relation": [["Name", "WILL ACTON", "BRANDON DAVIDSON", "BEN EAGER", "TRAVIS EWANYK", "TAYLOR FEDUN", "MARTIN GERNAT", "DENIS GREBESHKOV", "curtis hamilton", "ryan hamilton", "ROMAN HORAK", "brad hunt", "ryan Jones", "kale kessy", "oscar klefbom", "anton lander", "philip larsen", "STEVE MACINTYRE", "MARTIN MARINCIN", "Ryan Martindale", "andrew miller", "david musil", "TYLER PITLICK", "COREY POTTER"], ["POS", "F", "d", "F", "F", "d", "d", "D", "f", "F", "F", "D", "F", "F", "d", "F", "d", "F", "D", "F", "F", "d", "F", "D"], ["age", "26", "22", "29", "20", "25", "20", "30", "22", "28", "22", "25", "29", "21", "20", "22", "24", "33", "21", "22", "25", "20", "22", "29"], ["GP", "10", "26", "15", "33", "23", "21", "19", "16", "20", "31", "26", "4", "27", "27", "18", "7", "6", "24", "17", "32", "19", "14", "6"], ["G", "2", "0", "1", "3", "3", "0", "2", "2", "4", "7", "3", "2", "2", "0", "9", "1", "0", "3", "2", "5", "0", "1", "0"], ["A", "1", "2", "0", "2", "11", "9", "4", "3", "8", "11", "12", "0", "2", "3", "6", "6", "0", "4", "4", "12", "2", "4", "1"], ["P", "3", "2", "1", "5", "14", "9", "6", "5", "12", "18", "15", "2", "4", "3", "15", "7", "0", "7", "6", "17", "2", "5", "1"], ["+/-", "1", "-14", "-3", "-5", "2", "-4", "-7", "0", "0", "-6", "2", "2", "-3", "-10", "3", "-4", "-2", "4", "-7", "-4", "-6", "-2", "-1"], ["PIM", "12", "20", "62", "38", "27", "12", "12", "11", "10", "14", "12", "2", "53", "6", "10", "4", "30", "5", "8", "10", "15", "6", "21"]], "pageTitle": "FUTURE WATCH | Aidan Muir - Edmonton Oilers - Future Watch", "title": "", "url": "http://oilers.nhl.com/club/news.htm?id=698328", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00258-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 182339183, "recordOffset": 182311047, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{5145=\"It was shorthanded, so basically my job off the draw in the offensive zone is just to get the loose puck. I just got lucky I guess. The puck was trickling and I just poked at it, got past one of the defencemen and it was there again, so I poked it again, and it was just a footrace. I started to get an inside position on him. Somehow I kind of fell down and tried to keep the puck on my stick. As I was turning backwards, I was like, 'Alright, I know what's going to happen now.' \"I just kind of tried to whack at the puck and tried to get a piece of it.\" The shot itself was no stroke of luck. Muir knew where he wanted to go. \"I knew the puck was there and I tried to hit it with purpose. I tried to hit it to the opposite side. I wasn't going to try to hit the goalie with it. I guess I kind of aimed for the right side. It was still kind of a wild whack but I tried to get enough heat on it.\" Muir said, since he scored that goal, his Twitter has 'blown up' and he was shocked to see the articles begin to show up online. \"It's pretty cool,\" said the young Brampton, Ontario native. \"My dad sent me a video of (Hockey Night in Canada host) Ron MacLean saying my name on 'Hot Stove'. He said, 'Do we have enough time for the Aidan Muir goal?' They said no, so we never got to actually see it on TV. Apparently it was on there, so we're trying to find it.\" That one goal aside, Muir has managed to put together a strong start to his rookie season in the USHL. His 19 points (8-11-19) rank second on the team and he has three points in his last four games. \"It's taken me maybe a month or so to get used to the level of competition that I'm playing at,\" Muir said, after making the jump from Michigan AAA youth hockey with the Victory Honda Under-18 team. \"Then from then on, I seem to be excelling so far. My last few games, I've been feeling really comfortable out there. My legs have been feeling good and my speed and puck control… Lately, I think I've been doing really well. I'm really on track. I think I'm only going to go up from here.\" One of his greatest assets as a player he's exhibited so far has proven to be his size. \"Usually guys my size aren't that good of skaters. Obviously, from that video it's easy to see that size and speed are pretty big assets on that goal. I focus on stuff like that… The times I play the best, I'm just being aggressive.\" One of the things that Muir has focused on improving in the early part of this 2013-2014 campaign is his puck control. \"Being quick with the puck, being smarter managing it and every level you go up, it gets quicker. You can't hold on to the puck for very long at all. Just being aware of where your players are and getting the puck to them.\" Muir is a Western Michigan University commit and says he still plans on joining the college ranks following this season. The Oilers fourth round pick in 2013, 113th overall, says he expects a smooth transition to the higher level of play. \"I'm thinking once I get to college, I'm going to pick it up pretty quick and be able to showcase myself pretty well. I think the rise in talent in the college players is going to help my game as well.\" Muir is undecided on what course of study he will choose to take at WMU but there is one field he has his eyes on; aviation. An interesting story involving the Oilers prospect is that at the end of his senior year in high school, Muir won a nation-wide aviation competition which sent him just outside of Seattle, Washington for two weeks. \"Ever since then, it's really gotten my attention.\" Whether Muir chooses to pursue a degree in aviation, business or any other major, is yet to be determined. However, hockey seems to be the first thing on his mind, right now. \"I'm just building my talents up for next year.\" If those talents reflect anything close to his highlight reel goal from last week, Western Michigan is getting one talented young player next season.}", "TableContextTimeStampAfterTable": "{60965=edmontonoilers.com is the official Web site of the Edmonton Oilers Hockey Club. The Edmonton Oilers and edmontonoilers.com are trademarks of Edmonton Oilers Hockey Corp. NHL, the NHL Shield, the word mark and image of the Stanley Cup and NHL Conference logos are registered trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks as well as all other proprietary materials depicted herein are the property of the NHL and the respective NHL teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. Copyright © 1999-2015 Edmonton Oilers Hockey Club and the National Hockey League. All Rights Reserved.}", "textBeforeTable": "Oklahoma City (AHL) Stats Updated as of Tuesday, December 31, 2013 at 4:00 p.m. MST 2011-12 2012-13 | Past Prospect Stats: Barons Schedule | AHL Standings |  Barons Player Stats |    \"It was shorthanded, so basically my job off the draw in the offensive zone is just to get the loose puck. I just got lucky I guess. The puck was trickling and I just poked at it, got past one of the defencemen and it was there again, so I poked it again, and it was just a footrace. I started to get an inside position on him. Somehow I kind of fell down and tried to keep the puck on my stick. As I was turning backwards, I was like, 'Alright, I know what's going to happen now.' \"I just kind of tried to whack at the puck and tried to get a piece of it.\" The shot itself was no stroke of luck. Muir knew where he wanted to go. \"I knew the puck was there and I tried to hit it with purpose. I tried to hit it to the opposite side. I wasn't going to try to hit the goalie with it. I guess I kind of aimed for the right side. It was still", "textAfterTable": "Bakersfield (ECHL) Name POS age    GP G A P +/- PIM Cameron Abney   F 22 15 0 2 2 2 46 MARTIN GERNAT D 20 3 0 1 1 -2 6 KALE KESSY F 20 3 1 0 1 -1 0 DAVID MUSIL D 20 3 1 0 1 -3 2 Canadian Hockey League Name POS age GP", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}