{"relation": [["Rank", "1", "2", "3", "4", "5", "6"], ["No", "12", "3", "6", "10", "5", "22"], ["Name", "Will Power", "Helio Castroneves", "Ryan Briscoe", "Dario Franchitti", "Takuma Sato", "Justin Wilson"], ["Gap", "--.----", "0.1445", "0.4737", "0.0255", "0.1809", "0.1257"], ["Diff", "--.----", "0.1445", "0.6182", "0.6437", "0.8246", "0.9503"], ["Time", "1:29.3164", "1:29.4608", "1:29.9346", "1:29.9600", "1:30.1410", "1:30.2667"], ["Speed", "135.832 mph", "135.612 mph", "134.898 mph", "134.86 mph", "134.589 mph", "134.402 mph"]], "pageTitle": "AutoRacing1.com - Other Racing News and Car Test Page", "title": "", "url": "http://www.autoracing1.com/article.asp?id=2096", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 7, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00063-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 303188119, "recordOffset": 303170403, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{18962=Television coverage of Sunday’s Camping World Grand Prix at The Glen will start at 3:30 p.m. ET on ABC-TV., 9381=2015 Teams, 9183=2014 Drug Policy, 8624=2014 Indy Lights Rules, 8075=2015 IC Rule Book, 9555=2014 Scanner Freq, 8817=2014 Pro Mazda Rules, 8441=2015 IC Aero Rules, 29753=HIDEKI MUTOH (No. 06 Formula Dream/Panasonic, 14th) \"After the yellow flag, I went back out on red tires. Then I was stuck behind Milka, and it was the second timed lap on the tires, which is the best lap over the life of the tire. It ended up costing us our second and third timed laps. For sure, there was more in the Formula Dream/Panasonic car because even on the last lap, which was a 1:31.1, there was still some left on the table; at least two or three-tenths of a second, which would have been good enough to get us to the next group of qualifying. Starting 14th isn't good, but we have two sets of new red Firestone alternate tires that others don't, so at least that is good for strategy.\", 15949=Saturday’s result also marked the sixth consecutive season that Team Penske has been awarded the pole at Watkins Glen (Castroneves started from the top position in 2006 when the starting grid was based on practice times). Unfortunately, the team is still searching for its first win at The Glen during the remarkable run., 15227=Power posted the fastest lap of the day – 1:29.3164 in the No. 12 Verizon Team Penske Dallara/Honda – around the 3.37-mile, 11-turn road course. Extending its IZOD IndyCar Series record for consecutive team poles, Power’s effort tied the all-time open-wheel racing record for consecutive poles shared by Team Penske (Rick Mears and Danny Sullivan over two seasons) and All-American Racers (Bobby Unser over two seasons). Team Penske will have a chance to extend the streak on July 17 in qualifying at the Toronto street circuit., 16287=Following Power on the grid will be Team Penske teammates Helio Castroneves and Ryan Briscoe. Castroneves recorded a lap of 1:29.4609 in the No. 3 Team Penske Dallara/Honda, while Briscoe clocked the third-fastest time – 1:29.9346 – in the No. 6 Team Penske Dallara/Honda., 8253=2015 IC Engine Rules, 7885=2015 Schedule, 9001=2014 USF2000 Rules}", "textBeforeTable": "Final Fast 6 Qualifying Takuma Sato Justin Wilson Ryan Briscoe Dario Franchitti Helio Castroneves Will Power The results from Round 2 Qualifying - Top 6 advanced to Final round qualifying Raphael Matos Paul Tracy Takuma Sato Will Power Scott Dixon Dario Franchitti Group 2 Mario Moraes Adam Carroll Justin Wilson Ryan Briscoe Marco Andretti Helio Castroneves Group 1 The results from Group 1 and Group 2 of Round 1 Qualifying - All 12 advanced o Round 2 Television coverage of Sunday’s Camping World Grand Prix at The Glen will start at 3:30 p.m. ET on ABC-TV. For Power, Saturday’s pole position was his fifth of the season and another point for his series-leading total. He now leads Scott Dixon by 12 points in the standings. “I was definitely a little bit rusty around this place at the beginning of the weekend, but my engineer and I came up with a good car at the end,\" said Power. \" I was able to turn a lap in the second segment (of qualifying) that was fast and we were able to save a set of red (tires) and that really helped us in the last session.  Another pole for Team Penske - eight in a row is pretty good.” “It’s a good testament to the team,” said Cindric. “But with all of those poles here, we still haven’t", "textAfterTable": "QUOTES: WILL POWER (No. 12 Verizon Team Penske, pole): \"Yeah, it's awesome to have the Verizon car on pole again. We're certainly racking them up, but we've got to get the race win. It's such an advantage to get a win with the way the points are structured. We'll focus on tomorrow and see if we can get it done.\" (About qualifying): \"It was hard. I was on it. I haven't driven so hard, because I haven't had such an advantage here. In the practice sessions, I was a little worried. I was thinking, 'Man, it's going to be tough to get pole.' But we worked hard, and we got it all together.\" (About Firestone tires): \"The reds were so stuck. There was heaps of grip. Incredible.\" (About race strategy): \"We've got to make a decision on what tires to start. It's going to be a difficult decision, just looking at what happened to Ryan last year when he had a few people with reds on and he had blacks.\" (About Penske pole streak): \"It's fantastic. It just shows what this team's all about. It's a great team, a lot of teamwork.\" HELIO CASTRONEVES (No. 3 Team Penske, second): \"It's a great effort for Team Penske, Tim Cindric and Will (Power) and Ryan (Briscoe). We all worked together, and here we are, 1-2-3. Certainly the competition is pushing us, but credit goes to my engineer Ron Ruzewski and the other ones, as well. Each one of", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}