{"relation": [["Season", "2013-14", "2010-11", "2005-06", "2004-05", "2000-01"], ["Player", "Stephen Curry", "Derrick Rose", "Steve Nash", "Steve Nash", "Allen Iverson"], ["Tm", "GSW", "CHI", "PHO", "PHO", "PHI"], ["PTS", "24.0", "25.0", "18.8", "15.5", "31.1"], ["TRB", "4.3", "4.1", "4.2", "3.3", "3.8"], ["AST", "8.5", "7.7", "10.5", "11.5", "4.6"], ["STL", "1.6", "1.0", "0.8", "1.0", "2.5"], ["BLK", "0.2", "0.6", "0.2", "0.1", "0.3"], ["FG%", "0.471", "0.445", "0.512", "0.502", "0.42"], ["WS", "13.4", "13.1", "12.4", "10.9", "11.8"], ["WS/48", "0.225", "0.208", "0.212", "0.203", "0.19"], ["PER", "24.1", "23.5", "22.3", "22.0", "24.0"]], "pageTitle": "Why Stephen Curry Will Be the Next Point Guard to Win NBA MVP | Bleacher Report", "title": "Stephen Curry vs. Point Guard MVPs since 2000", "url": "http://bleacherreport.com/articles/2089487-why-stephen-curry-will-be-the-next-point-guard-to-win-nba-mvp", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991951.97/warc/CC-MAIN-20150728002311-00341-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 24361139, "recordOffset": 24314402, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{104278=Surprise winners have come in the past. Derrick Rose won in 2010-11 when he wasn’t even on the map heading into the season. The right combination of personal accomplishments, team success and outward circumstances coalesced, and it was enough to give Rose the award. A similar situation could occur with Curry., 150893=Copyright © 2015 Bleacher Report, Inc. Turner Broadcasting System, Inc. All Rights Reserved. BleacherReport.com is part of Bleacher Report - Turner Sports Network, part of the Turner Sports and Entertainment Network. Certain photos copyright © 2015 by Getty Images. Any commercial use or distribution without the express written consent of Getty Images is strictly prohibited., 109169=When you factor in points generated off assists (which includes three-point makes on assisted shots), Curry actually produces more points per game than any of the past award winners at his position. He even beats James in the 2011-12 season and isn’t far off him from his 2012-13 season or even from Durant this year., 105056=The truth of the matter is that Curry is already much closer than Rose was in the summer of 2010. In fact, his numbers from last season are arguably better than those of any point guard who has been named the MVP in recent years. (Allen Iverson is included here, although he played both shooting guard and point guard his MVP season.) }", "textBeforeTable": "The truth of the matter is that Curry is already much closer than Rose was in the summer of 2010. In fact, his numbers from last season are arguably better than those of any point guard who has been named the MVP in recent years. (Allen Iverson is included here, although he played both shooting guard and point guard his MVP season.)  Personal Succes   Surprise winners have come in the past. Derrick Rose won in 2010-11 when he wasn’t even on the map heading into the season. The right combination of personal accomplishments, team success and outward circumstances coalesced, and it was enough to give Rose the award. A similar situation could occur with Curry. Now that he has an award, Durant could have votes taken from him by superstar teammate Russell Westbrook in the future. Or, voter fatigue could hit him as it hit James if he wins again. If James switches teams again, the ring-chaser critics will hurt him. If he stays with the Miami Heat, Dwyane Wade’s diminishing abilities could limit the team’s success. The qualifier \"if a player other than Durant or James\" shouldn’t be ignored. They are clearly the two best players in the world, and something would have to happen for one of them not to win, but it’s possible. If there is a player other than Kevin", "textAfterTable": "Basketball-Reference.com Curry had more win shares, more win shares per 48 minutes and a higher player efficiency rating than any of his counterparts. He outscored Steve Nash in his two wins and had more dimes than either Allen Iverson or Derrick Rose when they won theirs. When you factor in points generated off assists (which includes three-point makes on assisted shots), Curry actually produces more points per game than any of the past award winners at his position. He even beats James in the 2011-12 season and isn’t far off him from his 2012-13 season or even from Durant this year. Points Produced by Perimter MVPs since 2000 Season Player Tm PTS/G PGA/G PC/G 2009-10 LeBron James CLE 29.7 19.7 49.4 2008-09 LeBron James CLE 28.4 17.4 45.8 2013-14 Kevin Durant OKC 32 12.4 44.4 2012-13 LeBron James MIA 26.8 17.1 43.9 2013-14 Stephen Curry GSW 24.0 19.0 43.0 2005-06 Steve Nash PHO 18.8 23.7 42.5 2010-11 Derrick Rose CHI 25.0 17.4", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}