{"relation": [["Player", "Ariel Faith Plate", "cynic", "Ir1sh", "Jake_R", "Jetuser aka Everything Is Fine", "Leveraged", "MOOMANiBE", "Ninjai", "Spitfire1945", "Dougley"], ["Date taken", "4/13/11", "4/15/11", "4/15/11", "4/13/11", "4/15/11", "4/13/11", "4/13/11", "4/13/11", "4/13/11", "4/13/11"], ["Steam account", "Steam Profile", "Steam Profile", "Steam Profile", "Steam Profile", "Steam Profile", "Steam Profile", "Steam Profile", "Steam Profile", "Steam Profile", "Steam Profiles"], ["Played Portal 2 before anyone else could", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "No"], ["Other changes", "", "Mentioned in original countdown text. Twitter. 4/17 - Steam named changed to testsubject93", "Mentioned in original countdown text. Steam Icon, inverted and adjusted for contrast. Numbers seem to read \"There is a hhole in the sky through which I can fly\"; also contains a section of the Aperture Science BBS logo.", "Youtube Video (references caesar ciphers and 13). The description on the video is ascii text encoded in hex, which when converted to ascii and rot13'd reads: There's a hole in the sky... through which I can fly.", "Twitter.", "Wiki Contribs, Name changed to -testsubject1337- Steam Profile", "Wiki Contribs", "", "Steam forum usurped Podcast spectrogram", "Wiki Contribs, Twitter account. Dougley has reappeared in the Steam group's chat, and has provided some information about the progress bars. --> According to the other \"changed\" players, Dougley's contributions after being taken were not directed or condoned by Valve. He has also been confirmed to not be at Valve playing Portal 2 with the other nine players."]], "pageTitle": "Player Changes - Portal 2 ARG Wiki - Valve ARG Network", "title": "", "url": "http://valvearg.com/w/index.php?title=Player_Changes&diff=18256&oldid=16961", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00292-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 248301795, "recordOffset": 248286421, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{55060=Many valuable contributors unexpectedly disconnected from the IRC server around 10:56 AM PST all uttering the same message and have had various social network updates that read like:, 45892=At approximately 11:20 AM PST on April 13th, several well-known players began to exhibit strange behaviour. Notably a news item was posted to the front page of the wiki stating \"There's a hole in the sky... through which I can fly.\". Various wiki editors removed the message only to see it reinserted by wiki admins, IRC ops or well known players. Finally, after a brief edit war, the final message read \"Stop worrying about them. They are okay. They are still people. Who are okay. They are busy doing safe things that are supervised by a responsible safety associate. Everything is fine here.\"}", "textBeforeTable": "Taken Players 6 The Watcher 5 Purpose 4 The Console 3 Steam Conversations 2 There's a hole in the sky... through which I can fly. 1 Taken Players Contents The image in the orange portal is clearly from the middle image on this page of Valve's website: http://www.valvesoftware.com/company/ At the same time, User pages on the wiki were changed, and Steam profiles were changed to show a new PO TA T O banner At approximately 11:20 AM PST on April 13th, several well-known players began to exhibit strange behaviour. Notably a news item was posted to the front page of the wiki stating \"There's a hole in the sky... through which I can fly.\". Various wiki editors removed the message only to see it reinserted by wiki admins, IRC ops or well known players. Finally, after a brief edit war, the final message read \"Stop worrying about them. They are okay. They are still people. Who are okay. They are busy doing safe things that are supervised by a responsible safety associate.", "textAfterTable": "There's a hole in the sky... through which I can fly. Many valuable contributors unexpectedly disconnected from the IRC server around 10:56 AM PST all uttering the same message and have had various social network updates that read like: http://Twitter.com/MOOMANiBE I am okay. I am still a person. Who is okay. I am busy doing safe things that are supervised by a responsible safety associate. Timestamps below are EST:  [13:56] <MOOMANiBE> There's a hole in the sky... through which I can fly. [13:56] * MOOMANiBE (~MOOMANiBE@adsl-75-45-23-46.dsl.scrm01.sbcglobal.net) Quit (Quit: I am okay. I am still a person. Who is okay.) [13:56] <Dougley> There's a hole in the sky... through which I can fly. [13:56] * Dougley (~Dougley@host-174-45-189-49.chy-wy.client.bresnan.net) Quit [13:56] <Leveraged> There's a hole in the sky... through which I can fly. [13:56] * Leveraged (~Leveraged@Leveraged.user.gamesurge) Quit (Quit: Leaving.) [13:56] <Jake_R> There's a hole in the sky... through which I can fly. [13:57] * Jake_R (~chatzilla@5ED2EBA8.cm-7-3d.dynamic.ziggo.nl) Quit (Quit: ChatZilla 0.9.86.1 [Firefox 3.6.16/20110319135224]) [13:57] <Ariel_Faith_Plate> There's a hole in the sky... through which I can fly. [13:57] * Ariel_Faith_Plate (~chatzilla@adsl-71-145-134-95.dsl.austtx.sbcglobal.net) [13:58] <Ninjai> There's a hole in the sky... through which I can fly. [13:58] * Ninjai (mibbit@adsl-75-6-137-170.dsl.skt2ca.sbcglobal.net) Quit (Quit: http://www.mibbit.com ajax IRC Client) The phrase these players are using, \"There's a hole in the sky... through which I can fly\", is very similar to Aperture Science's motto from the teaser trailer to Portal 1.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}