{"relation": [["Pos.", "CF", "2B", "DH", "RF", "SS", "C", "1B", "LF", "3B"], ["Player", "Curtis Granderson", "Placido Polanco", "Gary Sheffield", "Magglio Ordonez", "Carlos Guillen", "Ivan “Pudge” Rodriguez", "Sean Casey", "Craig Monroe", "Brandon Inge"], ["Avg.", ".260", ".295", ".298", ".298", ".320", ".300", ".272", ".255", ".253"], ["RBI", "68", "52", "25", "104", "85", "69", "59", "92", "83"], ["HR", "19", "4", "6", "24", "19", "13", "8", "28", "27"]], "pageTitle": "…And on the First Day of April I Said, “Let There Be Baseball” | Detroit Sports Unleashed", "title": "", "url": "https://sportsunleashed.wordpress.com/2007/04/01/and-on-the-first-day-of-april-i-said-let-there-be-baseball/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00024-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 876038748, "recordOffset": 876012172, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6844=Toronto has a team stocked with talent as well, however, and they are annually ousted in their division by the top-tier talent of the Yankees and Red Sox. For quite some time, I have figured that the Blue Jays could be a playoff team in a weaker division, and not necessarily the NL West. Roy Halladay headlines the rotation — the staff ace went 16-5 with a 3.19 ERA last season. Halladay, who will receive the start for the Blue Jays tomorrow, is a former Cy Young winner who once came within one out of no-hitting the Tigers. The Blue Jays also feature AJ Burnett and Gustavo Chacin in their rotation, and last year added BJ Ryan to finish games out of the bullpen. With a fat contract, Vernon Wells leads the outfield from center, and put up a .303 batting average, with 32 homers and 106 runs batted in, in 2006. He also has decent speed and is always a threat to steal on the base-paths (17 steals last season). Aside from several younger, athletic infielders, the Blue Jays also have power bats that can anchor the middle of their lineup. Frank Thomas, the designated hitter, drove in 114 runs with 39 long balls last season, and Troy Glaus had 104 RBIs (38 HR) from third base last year. The Blue Jays have the pitching and pop in their bats to take a game on any given day, so Leyland will need to make sure his Tigers are fired up and ready to go for the beginning of the regular season., 3450=After months of anticipation, it has arrived — the game we all know and love: baseball. Tonight’s Cardinals game (8:00 pm on ESPN2) begins the 2007 Major League Baseball regular season. Tomorrow is a holiday that will cause people to fill the streets of Detroit, a little something we like to call Opening Day. Yes, the pages of the calendar have finally turned to April, and now it is finally time to begin a nightly ritual of America’s game. The lineup for Opening Day is as follows (with 2006 regular season numbers):, 8257=Up Next: The 2006 MLB season starts with a series at home against the Toronto Blue Jays. Comerica Park is expected to be in relatively warm weather on Monday (high of 63), but wind may be a factor. With a day off on Tuesday, the Tigers will miss out on the warmest weather of the week, as temperatures drop to the high 30s/low 40s for the games on Wednesday & Thursday, when it is possible snow will be sighted. Nevertheless, it will be great to see the boys of summer back on the field once again. Each team has a clean slate, so everything in the past must be placed in the backseat as teams race for division records this season. For the American League Central, it’s a literal tossup — every expert has a different pick, and every team that is not Kansas City has a legitimate shot at winning the division. Talent is spread evenly enough where it is the consistency and execution that will determine who comes out of the Central alive.}", "textBeforeTable": "After months of anticipation, it has arrived — the game we all know and love: baseball. Tonight’s Cardinals game (8:00 pm on ESPN2) begins the 2007 Major League Baseball regular season. Tomorrow is a holiday that will cause people to fill the streets of Detroit, a little something we like to call Opening Day. Yes, the pages of the calendar have finally turned to April, and now it is finally time to begin a nightly ritual of America’s game. The lineup for Opening Day is as follows (with 2006 regular season numbers): …And on the First Day of April I Said, “Let There Be Baseball” ↓ Jump to Comments by Chris | April 1, 2007 · 5:51 pm Tigers Fall to Jays on Opening Day → ← Gridiron: A Month Until D-Day", "textAfterTable": "Starting for the Tigers is Jeremy Bonderman, who posted a 14-8 record for the Tigers last season, while putting up a 4.08 ERA and 202 strikeouts in the regular season. Adding in his postseason means Bonderman threw over 220 innings last year, which is elevated. At just 24-years-old, Bonderman has long been regarded as the future of Tigers pitching. Last season proved that the future of Tigers baseball is right now. Toronto has a team stocked with talent as well, however, and they are annually ousted in their division by the top-tier talent of the Yankees and Red Sox. For quite some time, I have figured that the Blue Jays could be a playoff team in a weaker division, and not necessarily the NL West. Roy Halladay headlines the rotation — the staff ace went 16-5 with a 3.19 ERA last season. Halladay, who will receive the start for the Blue Jays tomorrow, is a former Cy Young winner who once came within one out of no-hitting the Tigers. The Blue Jays also feature AJ Burnett and Gustavo Chacin in their rotation, and last year added BJ Ryan to finish games out of the bullpen. With a fat contract, Vernon Wells leads the outfield from center, and put up a .303 batting average, with 32 homers and 106 runs batted in, in 2006. He also has decent speed and is always a threat to steal on the base-paths (17 steals last season). Aside from several younger, athletic infielders, the", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}