{"relation": [["Season", "2012", "2012", "2012", "2012", "2012", "2012", "2012", "2012", "2012", "2012"], ["Team", "Atlanta", "St. Louis", "Washington", "San Francisco", "Cincinnati", "New York Yankees", "Detroit", "Texas", "Baltimore", "Oakland"], ["Drafted/Developed", "11", "9", "8", "8", "8", "5", "5", "4", "3", "2"], ["Traded Prospects", "1", "0", "3", "2", "2", "2", "5", "2", "1", "1"], ["Traded MLBs", "3", "2", "1", "2", "3", "1", "2", "7", "8", "7"], ["FA/Waivers", "0", "4", "3", "3", "2", "8", "4", "3", "4", "6"], ["Ttl", "15", "15", "15", "15", "15", "16", "16", "16", "16", "16"], ["Constr Method", "#1", "#1/#4", "#2", "#2", "#1", "#4", "#2/#4", "#3/#4", "#3", "#3"]], "pageTitle": "mark teixeira at Nationals Arm Race", "title": "", "url": "http://www.nationalsarmrace.com/?tag=mark-teixeira", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00302-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 599884779, "recordOffset": 599801679, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{34538=26. Doug Melvin, Milwaukee Brewers: Melvin is an interesting case; the Brewers purposely bottomed out their farm system to make a playoff run in 2011, the last year before they lost Prince Fielder and their fortunes would change.  And change they have; the Brewer’s player development efforts have not moved off the bottom of the league (their farm system is either last or dead last on every pundit list) while their on-the-field record has dropped (they’ve gone from 96 to 83 to 74 wins in the last three years).   Now they’re the 4th best team in their division and it isn’t close, and it is unclear what their plan is going forward.   They’ve got quality players at certain places, but have made odd signings (losing their 1st round pick last year to sign Kyle Lohse of all people).  You can’t help the Ryan Braun situation, and they got unlucky with injuries (Corey Hart in particular) so perhaps this ranking is unfair.  But I still feel like the Brewers are adrift in terms of strategy and thus Melvin’s ranked this low., 176201=Obviously the situation with the Dodgers and Mets prevents them from doing such a franchise-altering commitment.  Plus both teams have half-way decent options playing at 1B for them now (James Loney and Ike Davis).   The Giants were at $118M in 2011 and seem tapped out; they have $84M committed prior to their Arb cases, including a potentially record-setting arbitration case with Tim Lincecum.  They’ll easily be above $100M once these cases are said and done.  Lastly St. Louis: if they were willing to pay $25M/year, they would have re-signed Pujols.  So clearly they’ve reached a financial threshold themselves., 195429=A: (The allegation also being that Ripken was friends with Brady Anderson, whose 50 homer season seems awfully suspicious in hind-sight).  Nobody’s ever said a word about Ripken and PEDs.  You have to think he was well aware of his legacy the closer he got to 2130 games.  I’d be shocked if he was shown to be a user.  Him and Derek Jeter would be probably the two most shocking PED revelations in the history of the game, if they turned out to be true.  Boswell doesn’t think Ripken profiled to a typical user., 120775=Method #2: Ride your developed Core and use your prospects to acquire big names: (Washington, San Francisco and Detroit to an extent): The Nats have transformed themselves over just a couple of seasons, relying less on FAs to plug holes caused by an awful farm system to having most of their core team developed at home (See the table further below to follow the transformation of our team over the past few seasons).  Those spots they couldn’t depend on have been filled by trades (three guys acquired by flipping prospects for them; in addition to Gonzalez Kurt Suzuki and Tyler Clippard also count here).  San Francisco has seen their payroll skyrocket as they extend their home-grown talent, but for the most part they have stayed true to the team development concept.  Their one major Free Agent (Barry Zito) is notoriously one of the worst contracts in baseball and it is somewhat surprising to even see him on the post-season roster.  He wouldn’t be if Tim Lincecum was pitching in 2012 like he has regularly done in previous seasons.  Detroit was entirely in method #2 until they decided to spend money like the Yankees; we’ll revisit in #4., 12671=6. Ben Cherington, Boston Red Sox.  Normally I’m really skeptical of GMs for teams with $175M payrolls who have success.  But it is difficult to argue with what Cherington has done since taking over the reigns.  He completely undid a ton of the damage that his predecessor had done by offloading two horrible contracts (Carl Crawford and Adrian Gonzalez) and one malcontent (Josh Beckett) on the Dodgers and actually receiving prospect value back.   He has quickly built the Boston farm system back to where it is one of the best in the game (they have as many top 100 prospects as any organization out there).  And they just won the World Series.  Cherington loses some credit for the disastrous Bobby Valentine hiring that led to the even more disastrous 2012 season … but he also recognized the faults with both the team and the manager and led a complete 180 degree turnaround.  And I laughed at Cherington’s almost comical chasing of closers (as documented in this space in June 2013).  But a title erases a lot of criticism.  Boston remains well positioned going forward but will be depending very heavily on the fruits of their farm system in 2014 and beyond.  If Boston turns these high value prospects into another playoff appearance while driving down payroll, Cherington’s ranking will only rise., 22830=14. Brian Cashman, New York Yankees.  Some say that just the mere fact that Cashman has survived as long as he has in the shadow of the Steinbrenner family ownership of the Yankees should be proof enough that he is among the best GMs in the game, and certainly higher ranked than he is here.   Fair enough.  But here’s the inescapable facts: his farm system is deteriorating, the most significant player on the 2014 team actually developed at home seems to be Brett Gardner, they had a $225M payroll last year and didn’t make the playoffs, their rotation will pivot mostly on a 40-yr old’s career renaissance, and their starting 2014 infield played a combined 200 games last year.    And they’re being saved only by the grace of Bud Selig‘s hatred for Alex Rodriguez, whose suspension “saves” the team $25M this year (quickly spent on their new “#3 starter” Masahiro Tanaka, to whom they guaranteed more than $175M dollars).  I dunno; maybe Cashman should be lower.  They have made the playoffs 4 of the last 6 years and have a title, and Cashman’s early tenure record speaks for itself .. but at what point do you notice that the team hasn’t done very much since the “core four” have entered their decline phases and begin to wonder if Cashman isn’t just a guy with a big checkbook instead of a good GM?, 190716=Now, is he coming to the Nats?  If I was Mike Rizzo i’d sign him in a heartbeat for 3yrs/$75M.  I’d balk at an 8-year deal.  But, the rumors persist and have been swirling for more than 2 weeks.  So where there’s heat, there’s likely fire.  Boswell says that the key date is Jan 18th, the day that the Rangers either sign or cut bait on Yu Darvish.  If the Rangers suddenly have $120M that they didn’t think they’d have yesterday, they will sign Fielder., 20520=12. Chris Antonetti, Cleveland Indians.  Antonelli has subscribed to the same “wheeling and dealing” mechanism for building teams that Billy Beane has done, and it turned a perennial doormat Indians team into a 2013 playoff team.  They play in a small market and have an $80M payroll, and Antonelli has taken their farm system from awful to respectable in the last three years.  So the system is improving as is the on-the-field product.  So far, so good in Cleveland for Antonelli’s tenure.  I’m hesitant to push him much higher because i’m convinced the Indians succeeded in 2013 on the backs of several very awful divisional rivals (for example; the Indians were 17-2 on the season versus the White Sox but only 4-15 versus the Tigers, quite a swing for a 90-win team; if they were that legitimate a team they would have been much closer to .500 against their divisional winner).  So slightly above the median looks good., 87146=Washington has sent a decent number of players to play in the WBC over the years, with very mixed results for the team’s interests.  In 2006 the team sent seven different players to the inaugural WBC:, 206136=Now, based on the rules of compensation (as explained in the Kilgore’s Nats Journal blog posting today), the first 18 picks of the 2011 draft are protected (usually first 15 but there’s a few compensation picks in there from failed draft picks in 2010).  So, IF Dunn is leaving (and the prevaling opinion seems to lean that way despite all realistic arguments against it…), what the Nats now root for is a team in the “bottom” half of the first round to be the signing team.  If this happens, we’ll get their 1st rounder AND a supplemental pick.  Otherwise we’re looking at the supplemental pick plus the signing team’s 2nd rounder.  That’s not nearly as nice of a haul frankly., 86052=I read a quickie piece with some Mike Rizzo quotes from the Washington Time’s beat reporter Amanda Comak on November 11th, 2012 and there was an interesting tidbit at the bottom: per Comak,  Rizzo has not been approached yet about any Washington Nationals participation in the WBC, but would approach each request on a “case-by-case basis” to determine what is in the best interests of the team.  This got me thinking about possible Nats representatives on 2013 WBC teams., 7671=2. Andrew Friedman, Tampa Bay.  Is there any argument that Friedman is this high? He took over in 2005 and within three years had the league’s best record.  They’ve won 90+ games four years in a row in the league’s best division.  He’s done this despite routinely having one of the lowest payrolls in the game, despite off-loading talent as soon as it becomes pricey, by stockpiling draft picks (11 of the first 75 picks in the 2011 draft), and by signing his key players early on to incredibly club-friendly contracts (see the deals that Evan Longoria and David Price signed pre-arbitration).   In fact, I daresay that the success the Rays have had in the draft was a driving force behind richer owners (hello, Mr. Jerry Reinsdorf) pushing for bonus limits on the amateur market.  In 2013 the team had the 3rd lowest payroll in the game but still made the playoffs ahead of the Yankees (who spent nearly FOUR TIMES as much as the Rays).  Many would say these facts by default put Friedman #1 and I wouldn’t argue; only the drop-off in his farm system this year keeps him from overtaking Mozeliak.  Call these two GMs 1 and 1-a., 4387=I created a GM rankings spreadsheet where I track all sorts of interesting information that you use to judge GMs (the link is also along the right hand side of the blog), and where I tried to quantitatively judge the 30 GMs.  The spreadsheet has GM tenure, market size, ownership meddling factors, Farm system rankings, 2012 and 2013 payroll versus W/L rankings, plus my attempts to quantify three facets of a GM’s job: MLB success, Trades and FA moves and the Farm system.  I will freely admit; i am paying significantly more attention to performance over the past three  years than performance over the past 10.  Maybe that’s fair, may be not.  But it hurts a long-time GM like Brian Cashman who guided his team to the playoffs year after year (but, see Cashman’s write up for my reservations on GMs of massive payroll teams)., 57038=Lots of questions about Mr. Williams. Photo Nats official 2014 via sportingnews.com, 205032=As posted by other bloggers today, October 28th 2010, (especially in this post here on the Nationals Enquirer which rather eloquently titles their posting with the obvious consequence of Dunn’s Elias rating), the Nats dodged a huge bullet and will be fully compensated if Adam Dunn decides to leave via free agency (that is well, unless they do the unthinkable and fail to offer him Arbitration).  The official Elias Rankings came out and previous estimates on Dunn were slightly low (resulting in panicked posts by yours truly and others about his being a type B free agent and thus making our entire mis-handling of the contract extension even more egregiously bad)., 167146=March 23rd, 2012 at 3:23 pm, 36925=28. Rick Hahn (Kenny Williams), Chicago White Sox.  What can you say?  The White Sox lost 100 games with a $118M payroll last year and have had the worst (or near to it) farm system in the game for years.  The White Sox organization is in a bad way, and i’m not sure why Williams’ stewardship was rewarded with the “promotion” to team president.   They lost 18 games in the win column from 2012 to 2013 and it is hard to see how they’re going to be any better this year.  It does seem though that they are undergoing a “rebuilding effort,” in that their payroll seems like it will be $40M less this year versus last and they’ve moved some of their bigger salaries in “rebuilding mode” moves (Alex Rios, Jake Peavy).  So perhaps its slightly unfair to have Hahn so low, if he’s entering into a purposely bad period.  Nonetheless; this set of executives got the White Sox where they are now, so their low ranking is earned., 65937=I think we’ll all be pretty frigging sick of Derek Jeter once August and September rolls-around.  Yeah he’s a great player, first ballot hall of famer.  But so are about 20-25 other guys playing right now.  I agree with the questioner’s rant about the over-coverage of all things Yankees.   Boswell points out that Jeter’s career WAR is one spot above Bobby Grich, so as to temper some expectations.  That’s harsh; even I recognize his importance to the game as a surpassing point than just whittling down all his accomplishments to one (dubious) number. , 41586=Here’s some other links relevant to this discussion, for your perusal.  Wiki’s list of all 30 GMs.  Baseball America’s excellent Executive database.  Scout.com’s Kiley McDaniel ranked the GMs by job security in Jan 2014.   Buster Olney posted a “Peer Review” of GMs back in 2010, but its mostly obsolete with all the movement since.  Still somewhat interesting to hear what GMs are saying about each other anonymously., 112891=Justin Verlander is one of the most important home-grown players in the 2012 playoffs. Photo unk via rumorsandrants.com, 2030=I’ve had a draft version of a “GM Rankings” post written for nearly three years.  Why so long?  Because I started the post, got distracted, and then no less than seven general manager positions were filled/replaced in two very hectic weeks following the end of the 2011 season.  There’s no way you can judge how well a GM has done with just a few months on the job, so there was no point in trying to rank the GMs when a quarter of them were un-rankable., 103184=November 21st, 2012 at 10:59 am, 32535=24. Dan O’Dowd/Bill Geivett, Colorado Rockies.   The Rockies have a very unique front-office structure right now, resulting from an August 2012 shake-up that left industry insiders questioning the roles and the message coming from the team.   Nonetheless, the direction of the Rockies leaves something to be desired.   They’ve drifted on the field, employed questionable starting pitching usage strategies, and generally are treading water.  Their farm system is starting to look up though; will that be enough to compete in a division with the Dodgers?, 76960=A: I hope you mean righty hitter only; he is a career .220 lefty hitter but .262 righty. If I was the Nats brass, i’d try him as a righty-only guy.  But by all accounts Danny Espinosa is a bit stubborn and may not be open to limiting a unique skill that he may continue to think distinguishes himself from other competitors.  I continue to wonder just how hurt he was last year … as others have said, it isn’t like Espinosa suddenly forgot how to hit.  Yes he was always somewhat limited as a player, but 20-homer capable middle infielders don’t grow on trees.  Boswell says the team isn’t messing with Espinosa, and that they want to see what he can do in 2014.  Fair enough., 200028=January 11th, 2012 at 10:22 am, 86712=Lets take a quick look at the Nationals representatives on WBC teams from the past, talk about whether its really in the best interests of the team to even let these guys play, and then talk about who may be candidates for the 2013 WBC regardless., 25293=16. Ned Colletti, Los Angeles Dodgers.  Seriously, how do you judge the job Colletti is doing right now?   His team’s payroll went from $95M in 2012 to more than $216M in 2013.  He’s got $57M tied up in three outfielders not named Yasiel Puig right now.   You almost got the impression that Colletti called up Boston and just said, “Hey, I’ll take every sh*tty contract off your hands right now … i’ve got money to spend and I don’t care how we spend it!”  On the bright side, somehow the Dodgers have kept a reasonable ranking with their farm system throughout all of this, but the skill involved with paying everyone on your team $20M/year is close to nil.  As with Cashman, I wonder if Colletti is ranked too high even here., 24305=15. Dave Dombrowski, Detroit Tigers.  Lots of on-field success thanks to Dombrowski sticking to his plan; he took over the year the Tigers lost 119 games.   It is worth noting that 3 years later they were in the world series.  Now he’s gotten them into the playoffs three years running, to which he’s due plenty of credit.  But his farm system has hit rock bottom, he’s spending a ton of money, and he’s making very questionable moves.  The industry panned his Doug Fister move (even if it seemed to greatly benefit the Nats) and people questioned his Prince Fielder for Ian Kinsler move.  They were weird moves for a “win now” team.  Perhaps I should give Dombrowski more credit, but his 2013-14 off-season knocked him down a number of pegs for me.  If they miss out on the playoffs to an up-and-coming Royals team, he’ll suddenly be on the hot-seat., 27348=18. Terry Ryan, Minnesota Twins.  Ryan has been with Minnesota for-ever; hired in 1994.  He stepped aside and then was re-hired in 2011, and is now in a rebuilding phase.  The team let go one of its faces of the franchise last off season (Justin Morneau) and is going to begin a big youth movement this year.  They’re going to be bad, but perhaps not Houston bad thanks to a couple of (odd?) starting pitcher signings.  Help is coming; Ryan has built on of the best farm systems in the game and it features two of the top 5 prospects out there (Byron Buxton and Miguel Sano).   Perhaps it isn’t fair to rank Ryan here with Luhnow higher, but Ryan was partly responsible for the downfall of this team and the abhorrent starting rotation of last year.  But once their MVP-grade talents arrive at the majors, Ryan’s work of rebuilding the farm system should be rewarded., 226837=BA’s Jim Callis’ top 10 Nats prospects (the comments are his’) 1. Bryce Harper, of: Has monster power, though he won’t match Strasburg’s immediate impact. 2. Wilson Ramos, c: Matt Capps trade freed Ramos from being blocked by Joe Mauer with Twins. 3. Derek Norris, c: Still needs to polish bat and defense, but he has power and on-base ability. 4. A.J. Cole, rhp: First-round stuff earned him $2 million as a fourth-rounder. 5. Sammy Solis, lhp: Don’t be surprised if the $1 million second-rounder outperforms Cole. 6. Danny Espinosa, ss: Solid defender has cannon arm and surprising pop (40 HR in 2009-10). 7. Chris Marrero, 1b: Best proven all-around bat in system, though little defensive value. 8. Brad Peacock, rhp: Runs his fastball up to 95, flashes solid knuckle-curve and changeup. 9. Michael Burgess, of: Power potential remains impressive, but will he make enough contact? 10. Yunesky Maya, rhp: Former Cuban national team ace got $8 million big league contract., 198943=Q: Does Fielder make sense if the Nats are planning on building a cost-controlled dynasty?  The 1998 yankees didn’t have any 30-homer players, let alone a big bopper at $25M/year., 132191=October 19th, 2012 at 11:48 am, 240070=I still see him focusing on the NL.  Based on this … Dunn seems like he may have options in the NL, which means our chances of having him accept a 3 year deal with us less likely.  Not good news for us in 2011., 78705=A: Yeah probably.  That’s why you change managers; to change the message.  I’m not going to disparage Davey Johnson too much here other than to say what i’ve said before; the team needed a new voice.  Boswell points out that Johnson’s 2012 job was fantastic and that there’s “different jockeys for different horses.” I like that analogy., 219094=November 7th, 2010 at 9:35 am, 87780=The tournament was marred for the team by a blown UCL ligament to Ayala, who had undergone elbow surgery earlier in the off-season but pitched for his home country anyway.  The team did not want Ayala to participate in the inaugural event, did not want him used by the Mexican team, and team officials were “livid” by the injury, which cost Ayala the season and cost the team its 8th inning setup guy.  Ayala recovered to pitch again in 2008 but was never as effective, and was shipped out in 2009 for a PTBNL.  Coincidentally, I suspect the team still harbors some ill-will towards Ayala to this day.  Meanwhile the other two relievers who participated both experienced regressions in form; Cordero’s ERA nearly doubled (from 1.82 to 3.19) from his breakout 2005 season while Majewski’s numbers dipped slightly before he was traded in the big Cincinnati deal of 2006., 37968=29. Ruben Amaro, Philadelphia Phillies.  I’ll admit that i’m probably biased here.  While i’ve given credit to other GMs whose teams have had success in the past several years, i’ve not given Amaro the same benefit of the doubt.  And that basically comes down to several, clear facts; Amaro has destroyed the Phillies with multiple long-term deals for declining players, most notably Ryan Howard‘s contract (widely considered the worst dollar for dollar contract in the game).  His team 3rd highest payroll in 2013 and nearly lost 90 games.  His recent FA moves have been laughable (Delmon Young and Michael Young?  John Lannan as his sole pitching move last off-season?  His ridiculous contract extension for Carlos Ruiz this past off-season?).  His heels-in-the-ground obstinant refusal to adopt any understanding or acceptance for analytics or modern statistical approach to his job makes me wonder just how asleep at the wheel his owner is.  He’s let his farm system lapse while his on-the-field product falters.  He puts out mixed messages in regards to his direction (Cliff Lee mentioned in trade rumors?  Are the Phillies going to rebuild or not?).  But the coup-de-grace for me is the news that just came out that Amaro’s organization has purposely attempted to sabotage college kids who spurned the Phillies last summer, ratting them out to the NCAA out of pettiness, spite or vengeance.   Despite their WS win and appearances in the last 6 years, I cannot for the life of me figure out why Amaro still has a job at this point., 179509=All these teams seem to be pretty self-explanatory.  Maybe Arizona gets into the market, but they’ve gone to great pains to lose payroll, paring it down to just $56M last year while somehow winning the division.  Their highest paid player in 2011 was just $5.8M.  A $25M/year guy doesn’t fit with their team., 139220=Below are my round-by-round picks.  Yahoo O-Ranks are given; this is Yahoo’s rank for the player for the 2012 season.  Average Draft Rank (ADR) is listed as per MockDraftCentral’s ratings, though honestly after the Holds guys start going off the board the ADR is mostly useless.  Plus ADR reports are based on the classic 5×5 league, not the 6×6 league that we’re doing.   But it does illustrate some of the over-drafts and/or value picks I got., 10474=4. Jon Daniels, Texas Rangers.  Texas made the 2010 World Series with the 27th highest payroll in the major leagues.  That in and among itself is enough to earn Daniels his street cred.  However, his 2013 payroll had ballooned to $125M and they got unlucky by missing out on the playoffs by one game in 2013.  Otherwise two World Series trips in four years is still nothing to shake a stick at, and the fact that they didn’t win game 6 of the 2011 World Series still amazes me.  Daniels’ reputation is on the line though in a big way; his moves for Prince Fielder, for Shin-Soo Choo and for Alex Rios will be tested in 2014.  The team will need everything it can get out of its (mostly) home grown rotation thanks to unfortunate injuries already suffered this year (Derek Holland tripping over his own dog).  I give Daniels a ton of credit for accomplishing what he did with a $65M payroll; can he continue to do it with a $130M payroll?  The bar only gets higher., 33301=25. Alex Anthopolous, Toronto Blue Jays. Anthopolous took over for the maligned JP Ricciardi after the 2009 season.  In the time since, he traded Roy Halladay, acquired Morrow, traded for Escobar and Jo-Jo Reyes, acquired Rajai Davis, and perhaps most impressively offloaded the albatross contract for Vernon Wells.  He had an 85-win team in the hardest division in baseball with a 70M payroll for 2011.  Then he went for it, emptying the farm system (which was one of the league’s best in 2011) to acquire the likes of R.A. Dickey and the whole slew of ex-Marlins.  Now he’s got a massive payroll, an underperforming team and empty cupboards in the minors.  All the good work he did to prepare Toronto for battle in the AL east has gone for naught unless last year was just a big huge adjustment period for all these newly acquired veterans., 236294=Unless the entire 2010 season was just a charade and we plan on signing him anyway.  Per Boswell there’s a 3-year deal on the table now.  But if you’re Dunn, you HAVE  to see what is out there right now, right?, 92402=Who from the Nationals franchise may make a 2013 WBC roster?  First off, thanks to James Wagner‘s 11/15/12 NatsJournal post we already know of three WBC participants; Solano is on the Columbian team, minor leaguer Jimmy Van Ostrand is on the Canadian team, and A-ball catcher Adrian Nieto is on the Spanish team.  Curacao qualifies to play with the Netherlands, and I’d guess that Bernadina would make a great choice considering the lack of Dutch players in baseball (Baseball Continuum’s projections agree.  And as of 12/4/12 he’s officially been listed as a Netherlands participant).. Venezuela is already qualified for the main draw and has a relatively strong possible team.  The Baseball Continuum blog posted an early projection of the Venezuelan team and listed Flores as a likely participant (specifically mentioning that Ramos wasn’t considered due to injury recovery; I’d suspect these two players to switch based on Ramos’ recovery and Flores’ awful 2012).   If Henry Rodriguez was healthy i’d guess he would be on that list too, but his season-ending surgery probably precludes his participation.  The Dominican Republic has perhaps the strongest depth and has no need for the recently called up Perez among its outfield depth.  Maya’s defection eliminates him from discussion for the Cuban team.  (12/4/12 update): Chien-Ming Wang has been announced as a member of Chinese Taipei’s team (for the purposes of this article I investigated all 2012 Nats)., 240484=October 6th, 2010 at 1:53 pm, 31745=23. Dan Duquette, Baltimore Orioles.  Duquette has had an odd off-season; his owner 86’d two of his signings thanks to questioning the “medicals,” which insiders point out is Peter Angelos‘ method of nixing deals he doesn’t like.  Must be frustrating.  Instead Duquette is now signing every re-tread FA who can’t find a job thanks to the CBA’s draft pick compensation issues, punting draft pick after draft pick.  The O’s did make the playoffs in 2012, thanks to an unsustainable record in one-run games, and have had a decent run of success out of their farm system (Manny Machado should be mentioned in the same breath as Trout and Harper frankly), but are they on the right track to get back?, 79530=February 19th, 2014 at 8:18 am, 231532=October 21st, 2010 at 3:32 pm, 136869=Last year we had Losses as a category instead of Holds but too many of the league hated the Losses category, but wanted to keep OPS as a 6th category.  So we’ve introduced Holds as a category for the 2012 season.  I proposed this but rather inadvertantly; my strategy going into this 2012 season was going to be to go after the exact type of pitcher who normally gets holds; the setup-guy, the excellent specialized reliever who pitchers 60-70 innings but gets 70-80 K’s with excellent ERAs and WHIPs.  With no Losses to worry about, the value of holding any type of pitcher increased over last year’s edition of the league. The only downside was that we are also introducing a transaction limit for the season (65 over the 21 week season).  So picking good arms early will be crucial., 76327=A: Also borrowing from my Dec 2013 post, I’ll go with Ohlendorf and Roark.  Ohlendorf as the long-man, spot starter rubber arm guy.  Roark with the hope he continues his magical run of exceptional command and fearless relief.  I know that only leaves on lefty out there, and leaves guys like Ryan Mattheus and Christian Garcia in AAA.  Hey, I could be wrong.   Boswell doesn’t seem to guess., 72397=A: Yes and yes.  McCann is a  huge loss.  Tim Hudson may not “seem” like a loss given the Braves pitching depth, but he was their opening day starter in 2013 and was their bulldog staff leader (if not an “ace” in the literal sense of the word).   They also let go Paul Maholm, who gave them a ton of decent innings last year.  They’re depending on Brandon Beachy to come back healthy and on the rest of their young rotation to contribute.  Otherwise they did little this off-season other than extending a couple of guys.   As far as BJ Upton, what choice do they have but to run him out day after day at this point?  Same as Dan Uggla: those two guys are getting paid a ton of money and will be given every chance to prove themselves.  Boswell agrees., 19480=11. Brian Sabean, San Francisco Giants.  Sabean is the longest tenured GM in the game, is unabashedly “old school” and is consistently mocked for his signings and moves.  I thought his Tim Lincecum deal was ridiculous, I couldn’t believe the amount of money they guaranteed Hunter Pence, and more than a few people are questioning the Michael Morse deal.   San Francisco’s farm system is weak and has been for years (after contributing MVPs and Cy Young winners, it should be said).   To all these naysayers I say this: Two World Series titles in the last four years.  The goal of every team is to win the title, and his teams have done it twice in four years.  The Yankees have one title in the last 15  years.  So you have to give Sabean some credit.  11th seems about right.  Not too high, not too low.  He’d have been much higher had his team not imploded in 2013., 237493=LA: James Loney: cost contained and home grown.  plus no FA $$ spent until ownership divorce settled. SD: Adrian Gonzalez SF; Aubrey Huff: a FA and SF desperately needs hitters. Col: Todd Helton; not the greatest hitter anymore but signed through 2013. Ariz: Adam LaRoche who is a FA but I sense Ariz is rebuilding and not FA buyers, 90525=Now, which Nats may play for the 2013 teams?  First off, looking at the Nationals 40-man roster, we have become an amazingly heavy USA-born team (we’ll get to non-40man roster players in a moment). Thanks to the Nats big board resource (originated by Brian Oliver and now maintained by “SpringfieldFan”), which has the country of origin for players, here’s a breakdown of the home-country of our current 36 active (as of November 15th, 2012) roster players:, 182983=January 12th, 2012 at 9:30 am, 191257=Q: Baseball is set to announce their HOf inductees for 2012 today. Anyone you feel strongly about that should get in? What are your thoughts on Dale Murphy and Don Mattingly?, 226098=Matt Kemp apparently is irritated with his club’s management, leading to spurrious trade rumors.  But Kemp is even further away from free agency than Greinke, currently on a 2 year deal and then facing one more arbitration year before being cut loose by 2013., 16220=8. Frank Wren, Atlanta Braves.  A couple years ago you would probably have Wren ranked in the middle of the pack at best.  He clearly botched both ends of the Mark Teixeira deals, essentially turning Texas regulars Elvis Andrus, Neftali Feliz, Matt Harrison and catcher Jarrod Saltalamacchia into a year of Teixeira and Casey Kotchman.  Imagine how good Atlanta would be right now if they still had the 3 core members that remain in Texas.  That being said, you cannot argue with where the Braves have been going.  With middle-of-the-road payrolls and an awful TV deal the Braves have a team with a lot of home-grown talent that won the NL East by 10 games last year.  His rotation is young and home-grown (Minor, Beachy, Medlen, Teheran), his team full of home-grown talent (with Freeman, Heyward and Simmons leading the way).  And they have the best bullpen in the game.  On the down-side, there are questions about some of his recent signings (BJ Upton and Uggla in particular), the farm system hasn’t quite come back from its 2010 rankings (thanks to so much of the talent it generated), and I’m not sure anyone really likes Atlanta’s 2013 off-season.  So, we’ll give Wren credit for the past few years and indicate a note of caution going forward., 44370=February 26th, 2014 at 8:03 am, 60760=As for the Yankees chances in 2014 in general, check out their current depth chart: Their rotation is set to be Sabathia (coming off an awful year), 40-yr old Kuroda, Tanaka, Ivan Nova and David Phelps.  Does that sound like a 95-win rotation?   Here’s their infield: Mark Teixeira (15 games last year), Brian Roberts (77 games last year), Derek Jeter (17 games last year), and Eduardo Nunez (90 games last year).   Does that infield inspire confidence?  What makes anyone think that infield is lasting even a quarter of the season without a major injury?  Plus, Buster Olney or Jayson Stark recently mentioned this factoid:  “No team has ever in the history of the game had a winning season starting a shortstop as old as Jeter.”    Yes the Yankees made some significant signings (Beltran, Ellsbury, McCann).  But I don’t think its enough to make up for what’s going to happen to their infield.  I think years of overpaying for FAs and being unlucky in their player development has caught up with the Yankees in a big way and they’ll be lucky to be a .500 team this year.  Boswell points out that PECOTA has them as 82-80.   And then he drops a scary subtle hint saying that Ian Desmond has already declined an $85M deal and may have his sights on becoming the next Yankees long-term shortstop.  Ouch.  Thankfully the timing doesn’t quite work out; Jeter retires after this year and the Nats have Desmond locked up for two seasons., 94644=Which leaves our large contingent of American players.  A couple of writers have started postulating on these rosters (David Schoenfield‘s very early guess as to a potential USA roster is here, Baseball Continuum’s latest projection is here).  So using these two posts as a starting point, lets go position-by-position and give some thoughts as to who may get some consideration.  Keep in mind the WBC rosters are generally very reliever heavy, since no starter is going to be “allowed” to pitch a complete game in March., 6851=1. John Mozeliak, St. Louis.   What more can you say about the model franchise of baseball and its leader/architect?   The #1 farm system last year, a huge percentage of its players home-grown, in the playoffs three of the last four years, a win and a runner-up in that time, and all while maintaining a payroll outside the top 10 in the league.  This team survived the FA loss of the game’s best player (Albert Pujols) by returning to the playoffs the subsequent year and leading the league in wins in 2013.  Can’t ask for much more than that.  Mozeliak is my choice for the best GM in the game over two other more famous candidates in the elite category., 225227=Zach Greinke is under contract to KC through 2012, has a limited no-trade clause and will probably cost (by various accounts) at least two young MLBers plus one or more additional prospects.  I use the Roy Halladay-to the Phillies deal as a comparison.  Halladay still had an entire year on the contract and Philly had to give up two high end prospects plus a third good young player in Kyle Drabek.   If Greinke was in the last year of his contract (ala Cliff Lee this year) the price would be far less (indeed, the Rangers gave up their #1 prospect Justin Smoak but the other players were lesser ranked prospects)., 57738=A: I’ll take the easy way out on this one: I’ll say that the rookies are most likely to benefit and the veterans are least-likely.  But that’s probably not very fair because it assumes that our vets will automatically have a hard time adjusting to a new voice.  In reality, Matt Williams‘ pedigree as a player is going to shut just about any veteran up; name one player on this team who has accomplished anything close to what Williams did as a player?   I mean, we’re talking about a guy with multiple All Star appearances, multiple Gold Gloves, multiple Silver Sluggers, a couple near MVP seasons, more than 200 post-season at-bats spread across 5 post-season trips, three trips to the World Series and one ring.  He also played in two specific games that are both counted among the best games of the last 50 years (Game 7 of the 1997 World Series and 2001’s Game 7 of the World Series)., 2513=Well, now we’re two plus years onwards from October 2011, each of those seven new GMs has had two seasons and three off-seasons to show their vision, and I think its time to revisit my rankings., 230657=Now, think about how we’d possibly look 2 years from now at the beginning of 2012.  Harper has torn through a year in the minors, Solis has made  his mlb debut and looks like the 2nd coming of Madison Bumgarner.  Strasburg looks great in rehab starts in Florida and in Potomac.  Espinosa and Desmond are settled in to their roles, Zimmermann has bounced fully back from TJ surgery and looks great, and we’ve added an outfield bat to augment what we had in 2009.  That’s an enticing story, a good young up and coming team that should be able to attract a serious FA starter to augment what is already here., 26103=17. Dayton Moore, Kansas City Royals.   Other mid-market teams (Oakland, Tampa, Pittsburgh) have shown a ton more accomplishment on the field than Kansas City; why hasn’t Moore’s teams done better?  He’s been in his job nearly 8 seasons and the team spun its wheels for seven of them.  Signings that didn’t pay off and fizzled farm system talents defined this team for years.  Finally Moore went all-in, trading the best prospect in the game (Wil Myers) for a package of pitchers to help the Royals get over the hump.   Between 2012 and 2013 they added $21M in payroll and these players and gained 14 games in the win column; just enough for … 3rd place.   The industry entirely believes Moore was fleeced by Tampa Bay, and the trade looked so bad at the time that pundits wondered if Moore wasn’t getting some pressure from above to “win more now or get canned.”  But it didn’t take Myers but the next season to win the rookie of the year award, and he may be a player that Kansas City fans rue for a generation.  I think Moore may not be long for the job, and with good reason; why hasn’t he been able to win when guys like Huntington and Beane have?, 74498=Why am I predicting Detwiler will win the rotation spot?  Partly because of options (Detwiler has none while Roark, Ohlendorf and Jordan all do), but partly because I’ve sort of come back around on him after looking more closely at his 2013 season.  He had a decent to good 2012; he posted a 118 ERA+ and even if his advanced FIP/SIERA didn’t indicate he was quite that good, he was still more than a servicable 5th starter.  Then in his first seven 2013 starts he was also very good (he had a 2.53 ERA in his first 7 starts and 42 2/3 innings … he got hurt in his 8th start).  The rest of his season was a mess, with him fighting injury and ballooning his seasonal ERA from 2.53 to more than 4.00 in five more starts.   If he comes back healthy to start 2014, why wouldn’t we expect more of the same performance that he had at the start of 2013?  For these reasons, I think Detwiler breaks camp as the 5th starter., 206979=The first round draft order for 2011 goes like this, thanks to mlbtraderumors.com, 67466=A: All reports list Christian Garcia as (finally) healthy.  But its telling that the team is already specifically pointing out that “he’s made it further than he did last year.”  It seems like his fragility is almost a running joke on the team now.  Chances of breaking into the 7-man bullpen?  Remote unless there’s injuries.  But if he goes to AAA and pitches lights out, he’ll be first guy back.   If he stays healthy (four words that should be attached to every single sentence ever written about Garcia).  Boswell says that if he’s healthy, he’s on the team.  I have a very hard time believing that; who makes way?  Not Soriano, Storen, Clippard or Stammen.  Not Blevins.  Ohlendorf?  Roark?  Roark’s numbers last fall were *better* than anything Garcia did in 2012 and in 4 times the innings.  Ohlendorf isn’t being paid north of $1M to screw around in upstate New York.  And, none of this takes into account the statements from Williams about liking to have two lefties in the bullpen… If it were me, I’d want to see Garcia pitch at least a month straight without hurting something on his person.  , 85916=Harper makes perfect sense to represent the US in 2013 WBC. Photo GQ magazine Mar 2012, 74265=A: Ross Emery Detwiler, for the same reasons I pointed out in my 2014 Staff Projections post in late december.   Quoting myself from that post:, 14186=7. Mike Rizzo, Washington Nationals.  Rizzo took over for the disgraced Jim Bowden in March of 2009 and had quite a job ahead of him.  The team on the field was on their way towards losing 100 games for the second year in a row and the farm system was dead last in the majors.  What has Rizzo done since?  The team improved 30 games in the win column between 2010 and 2012, the farm system was considered the best in the game just two years on from Rizzo’s hiring (it should be said, thanks to two straight #1 overall picks resulting in two of the most dynamic players in the last 20 years being available to us), and now has two drafts and two off-seasons worth of work under his belt.  He has brought a new mind-set to the draft, focusing on quick-to-the-majors college arms instead of nebulous tools-y high school players.  He also has managed to work with the sport’s most notorious agent (Scott Boras) and successfully handled the two most high-profile draftees (arguably) in the history of the game.  He has completely re-made the Nats roster in the past two years (only 3 members of the opening day roster 2009 team are still with the franchise).   I’ve questioned his roster construction at times, feeling like he over-emphasized defenders at the expense of offense (running Michael Morse and Josh Willingham out of town), and he obsessed over a leadoff/CF type until he got one (Denard Span, trading away our best starting pitching prospect at the time), but a 98-win season smooths over a lot of criticism.  Other pundits place Rizzo even higher than I have; 7th seems like a good spot to be until we see if this team can get back to the playoffs.   If the Nats falter again in 2014 and don’t achieve something in this “window,” Rizzo’s tenure and the 2012 season may be viewed simply as an aberration instead of a well built team., 31132=22. Michael Hill, Miami Marlins.  The one huge caveat that goes with the Miami GM job is this: Jeffrey Loria is probably the most hands on owner in the game, and you almost can’t judge this GM’s ability based on who is calling the shots.  The only other owner who seems to have as much pull is, ironically, ranked next.   Miami loaded up for 2012 in their new stadium and had completely dismantled things before August.  Now they’re a $50M payroll team with some superstar prospects .. but a middling farm system and questionable direction., 95425=(Note: I’m still considering our Free Agents as “Nats players” for the purposes of this analysis, since this really goes position by position from our 2012 team to find candidates)., 90018=This begs the question; do we even WANT our pitchers playing on this team?  The first two WBCs have shown pretty distinctly that our pitchers have regressed greatly after playing.  This only makes sense: the spring training routines are greatly impacted to play in this event.  We may see a ton of front-office resistance to specific guys (especially those coming off injury) playing in the 2013 event.  Which could affect the eligibility of some specific players for 2013., 88929=In 2009, the team had 5 participants:, 9098=3. Billy Beane, Oakland.   The league’s 2nd longest tenured GM is likely to retire as its longest, since he owns a stake in the team and has re-made his approach to building teams in the last couple of years to great success.  This ownership stake affords Beane the job security that he wouldn’t have otherwise, and has afforded him the time he needed to find his next “market inefficiency.”  After some lean years following the “Moneyball” period in the mid 2000s, Beane has turned the A’s into a two-time defending AL West defending champion (a division with two of the most profligate spending teams in the game).  His new team-building method seems to be around wheeling-and-dealing, and he’s been good at it.  He turned over a significant amount of his 2012 team and won even more games in 2013.   The ding on Beane may be his farm system; Oakland has struggled to develop players lately and some may argue that Beane’s ranking should be slightly lower as a result.  I’ll say this though; being successful in the league when routinely putting out payrolls in the $55M-$60M range (where his 2012 and 2013 teams sat) by default makes you one of the best in my book.  , 192702=A: Sounds great.  Except that this scenario really only serves the perfect world desires of the Nationals.  In reality LaRoche is a slow starter and we may really hear the boo-birds early.  Morse was great in 2011 but most predict a sliding back.  Harper probably needs some MLB adjustment time.  We’ll see what happens.  Boswell likes this scenario. Sure, who wouldn’t?  But it does sound a bit too convenient., 89347=The WBC seemed to energize particularly Dunn, who enjoyed playing in a post-season atmosphere for the first (and only) time in his career.  Nobody suffered any injuries, but Hanrahan in particular may have been affected by his lack of a proper spring training; he posted a 7.71 ERA for the team while losing the closer spot and was shipped to Pittsburgh.  Ironically, Rivera also experienced a huge regression of form, going from a 3.96 ERA in 2008 to a 6.10 ERA in 2009 and was eventually released., 137927=My draft strategy for 2012 is as follows:, 1319=I was listening to a baseball podcast this past week about General Managers in baseball and heard an interesting fact; it has now been more than two years since an MLB General Manager has been fired.  Sure enough, the last GM fired was Houston’s Ed Wade in November of 2011.  There is a GM with less service time (Rick Hahn of the White Sox), but he rose to take over the job for long time GM Kenny Williams, who was promoted to executive VP of the team.  So all in all there’s been decent stability among baseball executives in the shorter term.}", "textBeforeTable": "Here is the summary of roster construction and “Construction Strategy Category” that we’ll talk about next.  Note that I only count the “core players” on a team for this analysis.  The core players is defined as the 5-man starting rotation, the setup and closer, the 8 out-field players, and the DH for AL teams.  I didn’t extend this all the way to the 25-man roster, figuring that these core 15 players are the main reasons teams win and advance.  That and huge chunks of the bullpen and the bench are either fill-in FAs or draftees and it would skew the analysis of how teams really got to the playoffs.  Here’s the summary (the table is sorted by count of Draftees): Free Agent: The player was acquired in free agency.  This category also includes two other types of acquisitions: waiver claims and cash purchases.  These three categories are lumped together since all three indicate that a team has acquired a player with zero outlay in terms of development or prospects.  Examples for the Nats: Edwin Jackson, Adam LaRoche. Traded Prospects: The player was acquired by the team by virtue of trading prospects.  This is essentially the reverse of #2.  The Nats key example is Gio Gonzalez. Traded MLBers: The player was acquired by the team by virtue of trading an established MLB player.  Most of the time these days, this means the player was acquired as a prospect (since most trades seem to be of the prospect-for-established player kind).  Example", "textAfterTable": "So, what are the four construction methods I’ve identified? Again borrowing from last year’s version of this post, they are (with this year’s examples).  The complication this year is that some of the 10 playoff teams don’t fall neatly into one specific category. Method #1: Build from within 100%: (Cincinnati, Atlanta).   Atlanta, amazingly, didn’t use a single Free Agent among its core 15 this year.  They made a couple of key trades to acquire a few starters, but the rest of their lineup is home-grown draftees.  That may change next year as they try to replace Chipper Jones, Michael Bourn and possibly Brian McCann, who may leave via free agency.  Meanwhile Cincinnati has just a couple of free agents and mostly rely on guys they’ve grown as well. Method #2: Ride your developed Core and use your prospects to acquire big names: (Washington, San Francisco and Detroit to an extent): The Nats have transformed themselves over just a couple of seasons, relying less on FAs to plug holes caused by an awful farm system to having most of their core team developed at home (See the table further below to follow the transformation of our team over the past few seasons).  Those spots they couldn’t depend on have been filled by trades (three guys acquired by flipping prospects for them; in addition to Gonzalez Kurt Suzuki and Tyler Clippard also count here).  San Francisco has seen their payroll skyrocket as they extend their home-grown talent, but for the most", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}