{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,113 topics 2,124,834 replies",
            "85,556 topics 1,153,847 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,760 replies",
            "5,996 topics 75,812 replies",
            "50,547 topics 466,212 replies",
            "22,766 topics 196,302 replies",
            "4,270 topics 60,452 replies",
            "1,127 topics 8,215 replies",
            "3,602 topics 115,437 replies"
        ],
        [
            "Last Post Info",
            "Realistic Fuel Mod + Downlo... By XitWound 2 minutes ago",
            "Where is Roman's Cab De... By Mr. Fahrenheit 6 minutes ago",
            "Why does this game receive... By Sayuri 6 hours ago",
            "Whats your favourite radio... By LilithAkuma 6 hours ago",
            "Unique Vehicles By Militia 15 hours ago",
            "Destination Blips Not Showing By SuperHydracid An hour ago",
            "Any Other Setting/Theme The... By Spadge007 2 hours ago",
            "Grand Theft Auto III Chain... By GTAKid667 An hour ago",
            "What do you hate of GTA 2? By Jeansowaty 3 hours ago",
            "Deadliest Grand Theft Auto... By The Made Man A minute ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=239&t=553674&p=1062459262",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00036-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 108216499,
    "recordOffset": 108193955,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18664=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 121220=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 20784=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12550=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 47429=Google, Yahoo, Rangerlump, Bing, jennyjesus, Finn 7 five 11, iBUCKEYE, GTAKid667, Epic., FicZGB, WHAT!?, ShiviSRT-10, Randy93, Jyx, machine4578, deadx23, Chloroform, Pavle, hyperar, Earleys, cleaverov, Alvarez, Shooter Hex, m2roadwarrior, MyName'sJeff, Ritu85, sdelgado, Bms842, bLiNg.LK-YMF-420, FlacidJack, silentkiller44, Furry_Monkey, Google Mobile, _F_, ZAZ, whywontyoulisten, ItsThatGuy!, Th3MaN1, m3tal z_DKI, Yan22, X12-1992, GTA_Sharpshooter, poncia612, s2n vaniish, Mr. Fahrenheit, Anotic, EagleStrike, jp9865, FiS!!HeR, J-B, marshallbslayer, Spaghetti Cat, Furious_Wave, scottmacdougall, The Made Man, JimmyFantastic, link-thezoraband, RICHIEB91, obv23, Niobium, Trevor Philips Inc, NDH92, Captain Sensib1e, GTAV112, Daniel1Plainview, XJpostman, STEEZYR, Lester-The-Molester, mirthless, A Maned Wolf, Retrocoyote, Mister Pink, Kalik, Stoney0503, Fuzzknuckles, ~TKP~, Electrogypsy, DaveGrimes96, adra12, CMCSAVAGE, Mach1bud, shadowski, Dabzilla, Icantthinkofonew, AK47-Mentalman, TiberiusMcQueen, theNGclan, JPull07, XitWound, HumanRacehorse, Jeansowaty, Cjs3315, AztecaEh, CH14R1, Ivan1997GTA, Craigsters, Speccy, _d3xt3r_, TheJasonGallant, RideEmOut2, LeopardGecko, arewenotmen, Heysuse, ClaudX, VikDarkbomb, ghilliesuit101, Saintdestroyer, mario_rz, missanthropy, MaqLite, lydianduck, ezento, RazorRain, Rebel, TBONE1138, 458Speciale, Stolas, Pettyium117, Fearx--, Max Payne, AUScowboy, Alex Francisco, RJSanModder, Vadim M., TovarishTony, Edmachine, kulomet333, longhurstgb, feckyerlife, CartmanKusanagi, HulioG, Richardbrown30, nordi, FireBallz21, Choco Taco, Shiest Bubble, joe_alker, Squishinator, WhitTe_MamBa, Gamerjman19, svanderman, emelen, Joekill95, mxrcg, DerpCat, Daemian, yojc, Braulioaej, Ezuu, Director Josh, No_Future, Alphapug, xFranGTAx, Andreaz1, A8ul99, Starpaul20, Mr.SoapyLegs, Heavy Weapons Guy, Im Ricky I Win, Kiyone_Alien_Cop, Majestic81, pigeons99, Sigurd, SSKYZX, SeekingAsylum, Brabham, StangOne50, Anachronistic, _Douglas_, sjaak327, super_slav, American Alpha, kaasje, GRANDHEIST, Fireman, SuperSaiyanHazza, Bootels, JeepXJFreak98, Xorthian, DaBOSS54320, GuilhermeIM, NoSignal666, Hades_, toxluv, The_Anti-tragedy, warcreator92, Andreas, Silent, ironMANx956, Gummy , James K, Mottershead, tails_prower_2040, Malcot, feloniousrick, RonaGui, torresno9, MGgames100, Kinnaj, Cuesta, SuperGTFan, the_grizzly_man, timason, ryanhunter_rfc, Trentallica, Sven6895, Slasherr, TJGM, gangrel669, Kahkenbols, Smooth Longsack, goonit, MKKJ, jerryinohio78, ndyerger, Craank_AG, -Velox, Pooyan Cyrus, hoopz71, frodzet, ZiggZagg420, Dondara, Russell_Brand, miclin, JohnnyCallisto, Zonnex, MenuET, 17th, baru94, evoluon--720, Rucke, RevengeOfSpartacus, venom62, marhex, Superman1233, Weazel__03, ChickenAndBeer, maxx1013, GTA4LIFE9000, Shy, Fox2Quick, Vrock_wave, fullxthrottle94, SalvatoreCJ1903, dkluin, Automan, ZchDnn, DJ_Jiggles, Blankerz, Misunderstood, SkylarStClaire, ED-E, TexasRocks, Jenna_Taylier, Heisenberg_GR, REXX93, nLytin, Shadowfennekin, adit999, Antsaboy, TheMcSame, Retired Mafia, mahey31, j0ffline, Nightmare3883, Quinn_flower, JCX1992, SanAndreas88, Smale45, TheGuyBehindYou, AdusPL, Bluntnation94, xTOMMYTROJANx, BeckermannDewitt, NBAKingzFan10, ScarySKRILLEX, M4k3, 9438=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 14116=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 16426=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 35 minutes ago By Mikiroony The Lost MC Liberty 613,409 replies 15,202 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Fearx-- Dinka Vindicator is the bes... 2,283,387 replies 113,405 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,462 topics 416,623 replies Adding contacts to iFruit (... By DaBOSS54320 6 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}