{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,113 topics 2,124,837 replies",
            "85,556 topics 1,153,848 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,760 replies",
            "5,996 topics 75,812 replies",
            "50,547 topics 466,212 replies",
            "22,766 topics 196,302 replies",
            "4,270 topics 60,452 replies",
            "1,127 topics 8,215 replies",
            "3,602 topics 115,437 replies"
        ],
        [
            "Last Post Info",
            "GTA V Deeper Story Themes/M... By SuperGTFan A minute ago",
            "Where is Roman's Cab De... By Mr. Fahrenheit 7 minutes ago",
            "Why does this game receive... By Sayuri 6 hours ago",
            "Whats your favourite radio... By LilithAkuma 6 hours ago",
            "Unique Vehicles By Militia 15 hours ago",
            "Destination Blips Not Showing By SuperHydracid An hour ago",
            "Any Other Setting/Theme The... By Spadge007 3 hours ago",
            "Grand Theft Auto III Chain... By GTAKid667 An hour ago",
            "What do you hate of GTA 2? By Jeansowaty 3 hours ago",
            "Deadliest Grand Theft Auto... By The Made Man 11 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=239&t=557717&p=1062551239",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00333-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 109429879,
    "recordOffset": 109405692,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16558=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 12682=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 122362=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 47699=Bms842, Retired Mafia, Google, GTAKid667, Dannybrett6, Craigsters, Bing, m3tal z_DKI, CarimboHanky, deadx23, RedDagger, Zodape, Yahoo, Killerman29, Honch777, Andreaz1, REXX93, cerberus073, marhex, SpreeMurder, mirthless, SuperGTFan, idonknowhow, kzstone, fac316, Riqitch8, thisgood, Wscratch, SeekingAsylum, blitz, Auramew, Zonnex, Alphapug, marshallbslayer, ghilliesuit101, Jyx, FertileFuZZ, Mr. Fahrenheit, Kahkenbols, Edmachine, missanthropy, Trevor Philips Inc, 313izzle, BendingB, -untz-, AcidRunner, James K, Daemian, Scaife13, ZchDnn, Superman1233, NuBiXx, Gummy , ~TKP~, Google Mobile, WHAT!?, Lebowski_RS, boy22bit, Avenged Sevenfold, scalliano, jake-dk, arewenotmen, Omar_DmX, TarHeelJohn, LeopardGecko, Heists, Electrogypsy, zenova, Lord Helton, Pavle, ChickenAndBeer, Dirty.Hairy, meta187, bama764, Alvarez, MaqLite, FicZGB, ZAZ, SaL_Leone, sivispacem, LazerGunFunk, Matomat, XJpostman, Sleepingmonster, adra12, kolorowytoster, TiberiusMcQueen, Ukeman5, Th3MaN1, Daniel1Plainview, Hellpig, Fuzzknuckles, iBUCKEYE, BeckermannDewitt, Holo fenix, Arms Dealer, bLiNg.LK-YMF-420, whywontyoulisten, Feawyn, Finn 7 five 11, Hunter54711, SeekiNDestroyin96, Alfred Packer, Ritu85, JimmyFantastic, jennyjesus, Hoosierdaddy76, SSKYZX, Bo Gotti, Delta8042, Hades_, Stoney0503, obv23, statistic, cleaverov, p-s-3x, NoSignal666, sjaak327, Craank_AG, The_Anti-tragedy, TheVideoVolcano, Lester-The-Molester, Jon3s, CanOdope, xTOMMYTROJANx, SouthLand, Fachuro, ShiviSRT-10, VikDarkbomb, Brabham, Dabzilla, joe_alker, Im Ricky I Win, FiS!!HeR, Randy93, Plage, ironMANx956, RICHIEB91, Niobium, oCrapaCreeper, Menaced, machine4578, TheGuyBehindYou, TexasRocks, GrandReaping, Gridl0k, sdelgado, Run Down That Guy, ItsThatGuy!, UNH1NG3D, Captain Sensib1e, enix, Anotic, Speccy, ClaudX, Kiyone_Alien_Cop, DevastatingMag, Maresz55, MyName'sJeff, JSnipe135i, drzayas, Cuesta, hyperar, aksisisdead, rozay, Kalik, Alster, Slasherr, Rangerlump, Epic., Zoolock, fue, ..GhosT, HexagoN, Guns*R-Us, Z i X, GTA_Matt24, LewisVee, Vassago1988, Jahgee, JCX1992, jp9865, Ivan1997GTA, ji.Ruichi, TJGM, FlacidJack, AUScowboy, TBONE1138, Icantthinkofonew, silentkiller44, Samba., BigStu4q, shivii, Bubbles_Shed, kulomet333, funmw2, GTA_Sharpshooter, Marticus, MRMBF, Pettyium117, Fearx--, del__cielo, Mach1bud, s2n vaniish, poncia612, Chloroform, Earleys, Shooter Hex, m2roadwarrior, Furry_Monkey, _F_, Yan22, X12-1992, EagleStrike, J-B, Spaghetti Cat, Furious_Wave, scottmacdougall, The Made Man, link-thezoraband, NDH92, GTAV112, STEEZYR, A Maned Wolf, Retrocoyote, Mister Pink, DaveGrimes96, CMCSAVAGE, shadowski, AK47-Mentalman, theNGclan, JPull07, XitWound, HumanRacehorse, Jeansowaty, Cjs3315, AztecaEh, CH14R1, _d3xt3r_, TheJasonGallant, RideEmOut2, Heysuse, Saintdestroyer, mario_rz, lydianduck, ezento, RazorRain, Rebel, 458Speciale, Stolas, Max Payne, Alex Francisco, RJSanModder, Vadim M., TovarishTony, longhurstgb, feckyerlife, CartmanKusanagi, HulioG, Richardbrown30, nordi, FireBallz21, Choco Taco, Shiest Bubble, Squishinator, WhitTe_MamBa, Gamerjman19, svanderman, emelen, Joekill95, mxrcg, DerpCat, yojc, Braulioaej, Ezuu, Director Josh, No_Future, xFranGTAx, A8ul99, Starpaul20, 20916=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 9570=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 18796=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 14248=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 45 minutes ago By Mikiroony The Lost MC Liberty 613,409 replies 15,202 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By missanthropy [PS3] Looking for people to... 2,283,403 replies 113,406 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,463 topics 416,623 replies Realistic Fuel Mod + Downlo... By XitWound 11 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}