{
    "relation": [
        [
            "Citing Patent",
            "US5978398 *",
            "US5991326 *",
            "US6044100 *",
            "US6222871",
            "US6382800 *",
            "US6396083 *",
            "US6617618",
            "US6674785",
            "US6704336 *",
            "US6720585 *",
            "US6764926",
            "US6787381",
            "US6787822",
            "US6792026 *",
            "US6813295",
            "US6815731",
            "US6819701 *",
            "US6822992",
            "US6822995",
            "US6879615",
            "US6888873",
            "US6922426",
            "US6975660",
            "US7022539",
            "US7058112",
            "US7095770 *",
            "US7167495",
            "US7257143 *",
            "US7260137",
            "US7286585",
            "US7295586",
            "US7378680",
            "US7408964",
            "US7435660",
            "US7519095",
            "US7718992 *",
            "US7940827",
            "US8168456",
            "US8451875",
            "US20040065888 *",
            "US20040097000 *",
            "US20050034661 *",
            "EP1083641A1 *",
            "WO1999053580A1 *"
        ],
        [
            "Filing date",
            "Jul 31, 1997",
            "Apr 14, 1998",
            "Dec 23, 1997",
            "Jun 22, 1999",
            "Mar 23, 1998",
            "Jun 26, 2000",
            "Feb 27, 2002",
            "Sep 20, 2001",
            "Jul 22, 2000",
            "Jan 11, 2002",
            "Mar 25, 2002",
            "Nov 7, 2003",
            "Jun 28, 2000",
            "Mar 26, 2002",
            "Mar 25, 2002",
            "Mar 31, 2003",
            "Mar 26, 2002",
            "Feb 2, 2004",
            "Feb 21, 2002",
            "Jan 24, 2003",
            "Feb 21, 2002",
            "Dec 20, 2001",
            "Dec 27, 2001",
            "Oct 1, 2003",
            "Dec 27, 2001",
            "Dec 20, 2001",
            "Oct 1, 2004",
            "Oct 1, 2004",
            "Jan 23, 2006",
            "Mar 14, 2005",
            "Feb 21, 2002",
            "Aug 31, 2004",
            "Dec 20, 2001",
            "Jul 11, 2006",
            "Jul 13, 2007",
            "Sep 22, 2006",
            "Feb 26, 2009",
            "Dec 27, 2010",
            "Oct 31, 2006",
            "Oct 1, 2003",
            "Nov 7, 2003",
            "Aug 31, 2004",
            "Sep 7, 2000",
            "Mar 9, 1999"
        ],
        [
            "Publication date",
            "Nov 2, 1999",
            "Nov 23, 1999",
            "Mar 28, 2000",
            "Apr 24, 2001",
            "May 7, 2002",
            "May 28, 2002",
            "Sep 9, 2003",
            "Jan 6, 2004",
            "Mar 9, 2004",
            "Apr 13, 2004",
            "Jul 20, 2004",
            "Sep 7, 2004",
            "Sep 7, 2004",
            "Sep 14, 2004",
            "Nov 2, 2004",
            "Nov 9, 2004",
            "Nov 16, 2004",
            "Nov 23, 2004",
            "Nov 23, 2004",
            "Apr 12, 2005",
            "May 3, 2005",
            "Jul 26, 2005",
            "Dec 13, 2005",
            "Apr 4, 2006",
            "Jun 6, 2006",
            "Aug 22, 2006",
            "Jan 23, 2007",
            "Aug 14, 2007",
            "Aug 21, 2007",
            "Oct 23, 2007",
            "Nov 13, 2007",
            "May 27, 2008",
            "Aug 5, 2008",
            "Oct 14, 2008",
            "Apr 14, 2009",
            "May 18, 2010",
            "May 10, 2011",
            "May 1, 2012",
            "May 28, 2013",
            "Apr 8, 2004",
            "May 20, 2004",
            "Feb 17, 2005",
            "Mar 14, 2001",
            "Oct 21, 1999"
        ],
        [
            "Applicant",
            "Motorola, Inc.",
            "Bandwidth9, Inc.",
            "Lucent Technologies Inc.",
            "Bandwidth9",
            "Ricoh Company, Ltd.",
            "Commissariat A L'energie Atomique",
            "Ricoh Company Ltd.",
            "Ricoh Company, Ltd.",
            "Joseph Reid Henrichs",
            "Optical Communication Products, Inc.",
            "Agilent Technologies, Inc.",
            "Sony Corporation",
            "Picogiga International",
            "Joseph Reid Henrichs",
            "Agilent Technologies, Inc.",
            "Ricoh Company Ltd.",
            "Joseph Reid Henrichs",
            "Joseph R. Henrichs",
            "Finisar Corporation",
            "Joseph Reid Henrichs",
            "Finisar Corporation",
            "Finisar Corporation",
            "Finisar Corporation",
            "Ricoh Company, Ltd.",
            "Finisar Corporation",
            "Finisar Corporation",
            "Finisar Corporation",
            "Finisar Corporation",
            "Ricoh Company, Ltd.",
            "Finisar Corporation",
            "Finisar Corporation",
            "Finisar Corporation",
            "Finisar Corporation",
            "Finisar Corporation",
            "Ricoh Company, Ltd",
            "Samsung Electro-Mechanics Co., Ltd.",
            "Ricoh Company, Ltd.",
            "Finisar Corporation",
            "Finisar Corporation",
            "Ricoh Company, Ltd.",
            "Kazuhiko Nemoto",
            "Finisar Corporation",
            "Sony Corporation",
            "Bandwidth9 Inc"
        ],
        [
            "Title",
            "Long wavelength vertical cavity surface emitting laser",
            "Lattice-relaxed verticle optical cavities",
            "Lateral injection VCSEL",
            "Vertical optical cavities produced with selective area epitaxy",
            "Light emitting semiconductor devices",
            "Optical semiconductor device with resonant cavity tunable in wavelength, application to modulation of light intensity",
            "Light emitting semiconductor device with GaInNAs active layer and GaAs spacer layers",
            "Vertical-cavity, surface-emission type laser diode and fabrication process thereof",
            "Folded cavity surface emitting laser",
            "Low thermal impedance DBR for optoelectronic devices",
            "Method for obtaining high quality InGaAsN semiconductor devices",
            "Semiconductor laser and method of production of the same",
            "Heterojunction III-V transistor, in particular HEMT field effect transistor or heterojunction bipolar transistor",
            "Folded cavity solid-state laser",
            "Asymmetric InGaAsN vertical cavity surface emitting lasers",
            "Light emitting semiconductor device with GaInNAs active layers and GaAs spacer layers",
            "Super-luminescent folded cavity light emitting diode",
            "Folded cavity surface-emitting laser",
            "GaAs/AI(Ga)As distributed bragg reflector on InP",
            "FCSEL that frequency doubles its output emissions using sum-frequency generation",
            "Long wavelength VCSEL bottom mirror",
            "Vertical cavity surface emitting laser including indium in the active region",
            "Vertical cavity surface emitting laser including indium and antimony in the active region",
            "Vertical-cavity, surface-emission type laser diode and fabrication process thereof",
            "Indium free vertical cavity surface emitting laser",
            "Vertical cavity surface emitting laser including indium, antimony and nitrogen in the active region",
            "Use of GaAs extended barrier layers between active regions containing nitrogen and AlGaAs confining layers",
            "Multicomponent barrier layers in quantum well active regions to enhance confinement and speed",
            "Vertical-cavity surface-emission type laser diode and fabrication process thereof",
            "Low temperature grown layers with migration enhanced epitaxy adjacent to an InGaAsN(Sb) based active region",
            "Carbon doped GaAsSb suitable for use in tunnel junctions of long-wavelength VCSELs",
            "Migration enhanced epitaxy fabrication of quantum wells",
            "Vertical cavity surface emitting laser including indium and nitrogen in the active region",
            "Migration enhanced epitaxy fabrication of active regions having quantum wells",
            "Vertical-cavity, surface-emission type laser diode and fabrication process thereof",
            "Nitride semiconductor device",
            "Vertical-cavity, surface-emission type laser diode and fabrication process thereof",
            "Vertical cavity surface emitting laser with undoped top mirror",
            "Vertical cavity surface emitting laser having strain reduced quantum wells",
            "Vertical-cavity, surface-emission type laser diode and fabrication process thereof",
            "Semiconductor laser and method of production of the same",
            "System for developing a nitrogen-containing active region",
            "Semiconductor laser comprising a plurality of active layers and facet coatings and method of production of the same",
            "Lattice-relaxed vertical optical cavities"
        ]
    ],
    "pageTitle": "Patent US5903586 - Long wavelength vertical cavity surface emitting laser - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5903586?dq=5,664,133",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00113-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 494622332,
    "recordOffset": 494606374,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27359=Active structure 23, in this embodiment, includes three nitride based quantum well layers 35, 36, and 37, separated by barrier layers 38 and 39. For example quantum well layers 35, 36, and 37 and barrier layers 38 and 39 are each approximately 100 Å and the total thickness of active region 20 is approximately one wavelength of the emitted light or a multiple thereof. Quantum well layers 35, 36, and 37 are formed of Ga1-y Iny As1-x (N)x, more specifically Ga0.75 In0.25 As1-x Nx, where x=0.0001-0.1, and barrier layers 38 and 39 are formed of GaAsP or GaAs for strain compensation. More specifically, the GaInAsN quantum wells are under compression, and the GaAsP barrier layers are under tension, therefore the indium composition in the quantum well layers 35, 36, and 37 can be increased in a range of 5-10%. This increase in the indium material allows for a longer wavelength emission without the generation of misfit dislocations utilizing the same thickness of active layer (100 Å). In addition, it should be understood that dependent upon the crystal orientation of the GaAs substrate 12, a higher indium composition can be utilized. Alternatively, if the strain created between the quantum well layers 35, 36, and 37 and the barrier layers 38 and 39 is not to be compensated for, GaAs can be used for barrier layers 38 and 39. One skilled in the art will understand that more or fewer quantum well layers and barrier layers can be used depending upon the application. Active region 20 and first and second mirror stacks 14 and 26 respectively are configured to emit light with a wavelength in a range of approximately 1.3-1.55 micrometers without the use of aluminum within the active region material system. The elimination of aluminum within the active region assures an increase in reliability and lifetime of the laser device. To achieve this range the quantum wells are configured with a direct energy band-gap in a range of approximately 1.0 to 0.08 eV. The mole fraction of the indium is higher than that found in a typical VCSEL structure due to the use of the GaAsP barrier layer. In that the incorporation of a nitride based quantum well active region is difficult at low growth temperatures, the use of a GaAs (111) substrate would further facilitate the achievement of a longer wavelength emission by adding a small fraction of Nitrogen to the InGaAs. This fraction is much lower than the one required for a GaAs (100) substrate., 21822=In a preferred embodiment the active region and the first and the second mirror stacks are configured to emit light with a wavelength in a range of approximately 1.3-1.55 micrometers. The quantum well is configured with a direct energy band-gap in a range of approximately 1.0 to 0.8 eV., 23545=Turning now to the drawings in which like reference characters indicate corresponding elements throughout the several views, attention is first directed to FIG. 1 which illustrates a long wavelength vertical cavity surface emitting laser (VCSEL) generally designated 10. Typically, VCSELs are formed by depositing a plurality of layers on a substrate to form the VCSEL. See, for example, U.S. Pat. No. 5,034,092, entitled \"PLASMA ETCHING OF SEMICONDUCTOR SUBSTRATES\", issued Jul. 23, 1991, assigned to the same assignee and included herein by this reference, and U.S. Pat. No. 5,256,596, entitled \"TOP EMITTING VCSEL WITH IMPLANT\", issued Oct. 26, 1993, assigned to the same assignee and included herein by this reference. VCSEL 10 of the present invention is formed on a substrate 12, which in this specific embodiment, is GaAs, more specifically either GaAs (100) or GaAs (111). GaAs is used to facilitate epitaxial growth of the components of VCSEL 10 which emits light in long wavelengths approximately in the range of 1.3 μm-1.55 μm. While it should be understood that either GaAs (100) or GaAs (111) can be used for substrate 12, when GaAs (111) is employed, the surface crystal orientation will allow for longer wavelength continuous wave (CW) operation at normal operating temperatures. More specifically, the use of a GaAs material having a (111) oriented substrate will allow for the extension of an emitted wavelength up to 1.1 μm when only InGaAs is used in the active region. This wavelength extension is extremely hard to achieve on a (100) substrate surface crystal orientation., 29918=Cladding region 25 includes one or more layers which may be graded if necessary for more efficient carrier and optical confinement in active structure 23. In this specific embodiment, cladding region 25 is formed of a InGaP/GaAs material system. For example cladding region 25 includes a first layer 40 formed of p-type InGaP to lattice match mirror stack 26 and serve as an etch stop layer during fabrication of a ridge waveguide type VCSEL. A complete disclosure of the construction of ridge VCSELs is available in U.S. Pat. No. 5,256,596 entitled \"TOP EMITTING VCSEL WITH IMPLANT\", issued Oct. 26, 1993, assigned to the same assignee and incorporated herein by this reference. A second layer 41 is formed of a material having a gradient to more efficiently confine carriers in active structure 23. In this particular embodiment, second layer 41 is formed of undoped GaAs. Again, the indium mole fraction in layer 40 of InGaP ranges from about 45-55% to assure a lattice match to GaAs and is p-doped utilizing magnesium, or any other similar dopant.}",
    "textBeforeTable": "Patent Citations While we have shown and described specific embodiments of the present invention, further modifications and improvements will occur to those skilled in the art. We desire it to be understood, therefore, that this invention is not limited to the particular forms shown and we intend in the append claims to cover all modifications that do not depart from the spirit and scope of this invention. Various changes and modifications to the embodiments herein chosen for purposes of illustration will readily occur to those skilled in the art. For example, it should be understood that VCSEL structure symmetry exists for both the p and n dopants as well as electrically inverted structure designs. To the extent that such modifications and variations do not depart from the spirit of the invention, they are intended to be included within the scope thereof which is assessed only by a fair interpretation of the following claims. To complete VCSEL 10, a contact layer 45 is positioned on mirror stack 26, and a contact layer 46 is positioned on substrate 12, for example on the rear surface thereof. In this particular embodiment, contact layers 45 and 46 are formed of GaAs. As will be understood by those skilled in the art contact 45 is so constructed as to permit the emission of light from VCSEL 10. Mirror stack 26 is grown by epitaxially depositing pairs of layers on cladding region 25. In",
    "textAfterTable": "US20040065888 * Oct 1, 2003 Apr 8, 2004 Ricoh Company, Ltd. Vertical-cavity, surface-emission type laser diode and fabrication process thereof US20040097000 * Nov 7, 2003 May 20, 2004 Kazuhiko Nemoto Semiconductor laser and method of production of the same US20050034661 * Aug 31, 2004 Feb 17, 2005 Finisar Corporation System for developing a nitrogen-containing active region EP1083641A1 * Sep 7, 2000 Mar 14, 2001 Sony Corporation Semiconductor laser comprising a plurality of active layers and facet coatings and method of production of the same WO1999053580A1 * Mar 9, 1999 Oct 21, 1999 Bandwidth9 Inc Lattice-relaxed vertical optical cavities * Cited by examiner Classifications U.S. Classification 372/45.01, 257/94, 372/96 International Classification H01S5/223, H01S5/323,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}