{
    "relation": [
        [
            "Date",
            "Oct 11, 2000",
            "May 30, 2001",
            "Mar 9, 2004",
            "Jan 3, 2006",
            "Apr 26, 2007",
            "Jan 4, 2010",
            "Jan 2, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "CC",
            "FPAY",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "",
            "",
            "Year of fee payment: 4",
            "Owner name: EMERSON CLIMATE TECHNOLOGIES, INC.,OHIO Free format text: CERTIFICATE OF CONVERSION, ARTICLES OF FORMATION AND ASSIGNMENT;ASSIGNOR:COPELAND CORPORATION;REEL/FRAME:019215/0273 Effective date: 20060927",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6412293 - Scroll machine with continuous capacity modulation - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6412293?dq=6377161",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00132-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477467663,
    "recordOffset": 477441287,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{59455=A main bearing housing 26 is provided which is supported by outer shell 12 and which in turn movably supports orbiting scroll member 14 for relative orbital movement with respect to non-orbiting scroll member 16. Non-orbiting scroll member 16 is supported by and secured to main bearing housing 26 for limited axial movement with respect thereto in a suitable manner such as disclosed in U.S. Pat. No. 5,407,335 issued Apr. 18, 1995 and assigned to the same assignee as the present application, the disclosure of which is hereby incorporated by reference., 58778=Compressor 10 is generally of the type disclosed in U.S. Pat. No. 4,767,293 issued Aug. 30, 1988 and assigned to the same assignee as the present application the disclosure of which is hereby incorporated by reference. Compressor 10 includes a hermetically sealed outer shell 12 within which is disposed orbiting and non-orbiting scroll members 14 and 16 each of which include upstanding interleaved spiral wraps 18 and 20 which define moving fluid pockets 22, 24 which progressively decrease in size as they move inwardly from the outer periphery of the scroll members 14 and 16.}",
    "textBeforeTable": "Patent Citations While it will be apparent that the preferred embodiments of the invention disclosed are well calculated to provide the advantages and features above stated, it will be appreciated that the invention is susceptible to modification, variation and change without departing from the proper scope or fair meaning of the subjoined claims. Additional options available for control module 190 would be to utilize an adaptive strategy with variable cycle times such as 10-30 seconds based on room thermostat error versus set point and/or possibly outdoor ambient. This adaptive method would balance more effectively comfort versus peak demand reduction and optimum solenoid cycling life. With the advent of the Internet-based communication, it is now possible to easily receive the utility signal by Internet. Thus, several houses or appliances within one house can be synchronized out-of-phase to achieve overall utility-site demand loading without any noticeable comfort degradation in each house or in the individual house. When the load shedding signal is received, control module 190 switches variable speed blower 412 to a lower speed, preferably 70% air flow and signals scroll compressor 12 to pulse between its full capacity (100%) and its reduced capacity, preferably 65%, through a communication line 424. In addition to reducing the speed for evaporator blower 412, the condenser fan speed for variable speed blower 410 can also be reduced accordingly in proportion to the compressor duty cycle to maximize comfort and system efficiency if",
    "textAfterTable": "Aug 30, 1988 Copeland Corporation Scroll-type machine with axially compliant mounting US4846633 Nov 24, 1987 Jul 11, 1989 Mitsubishi Denki Kabushiki Kaisha Variable-capacity scroll-type compressor US4877382 May 2, 1988 Oct 31, 1989 Copeland Corporation Scroll-type machine with axially compliant mounting US4992033 Jul 31, 1989 Feb 12, 1991 Copeland Corporation Scroll-type machine having compact Oldham coupling US5074760 Jul 19, 1989 Dec 24, 1991 Mitsubishi Jukogyo Kabushiki Kaisha Scroll type compressor US5074761 Feb 4, 1991 Dec 24, 1991 Mitsubishi Jukogyo Kabushiki Kaisha Rotary compressor US5102316 Oct 1, 1990 Apr 7, 1992 Copeland Corporation Non-orbiting scroll mounting arrangements for a scroll machine US5983658 * May 12, 1997 Nov 16, 1999 Ford Motor Company Automotive air conditioning US6047557 * Sep 29, 1997 Apr 11, 2000 Copeland Corporation Adaptive control for a refrigeration system using pulse width",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}