{
    "relation": [
        [
            "Citing Patent",
            "US7299273 *",
            "US7363363",
            "US7486652 *",
            "US7546340 *",
            "US7650109 *",
            "US7730534 *",
            "US7783701",
            "US7821533 *",
            "US7936370 *",
            "US8170602 *",
            "US8533329 *",
            "US8559320 *",
            "US8610772",
            "US8612554 *",
            "US8712893",
            "US8752106 *",
            "US8754946 *",
            "US8842179",
            "US20040103193 *",
            "US20040117469 *",
            "US20040148515 *",
            "US20040205123 *",
            "US20040205512 *",
            "US20060064477 *",
            "US20070199032 *",
            "US20090238085 *",
            "US20100328461 *",
            "US20110167484 *"
        ],
        [
            "Filing date",
            "Dec 16, 2002",
            "Dec 23, 2002",
            "Apr 3, 2006",
            "Dec 11, 2003",
            "Dec 26, 2003",
            "Apr 29, 2006",
            "Nov 20, 2007",
            "Sep 23, 2004",
            "Sep 25, 2004",
            "Oct 18, 2004",
            "Mar 14, 2011",
            "Mar 19, 2008",
            "Apr 14, 2010",
            "Dec 11, 2003",
            "Nov 11, 2013",
            "Oct 11, 2005",
            "Sep 2, 2010",
            "Sep 30, 2011",
            "Nov 7, 2003",
            "Dec 16, 2002",
            "Dec 11, 2003",
            "Dec 11, 2003",
            "May 24, 2002",
            "Oct 11, 2005",
            "Apr 29, 2006",
            "Mar 19, 2008",
            "Sep 2, 2010",
            ""
        ],
        [
            "Publication date",
            "Nov 20, 2007",
            "Apr 22, 2008",
            "Feb 3, 2009",
            "Jun 9, 2009",
            "Jan 19, 2010",
            "Jun 1, 2010",
            "Aug 24, 2010",
            "Oct 26, 2010",
            "May 3, 2011",
            "May 1, 2012",
            "Sep 10, 2013",
            "Oct 15, 2013",
            "Dec 17, 2013",
            "Dec 17, 2013",
            "Apr 29, 2014",
            "Jun 10, 2014",
            "Jun 17, 2014",
            "Sep 23, 2014",
            "May 27, 2004",
            "Jun 17, 2004",
            "Jul 29, 2004",
            "Oct 14, 2004",
            "Oct 14, 2004",
            "Mar 23, 2006",
            "Aug 23, 2007",
            "Sep 24, 2009",
            "Dec 30, 2010",
            "Jul 7, 2011"
        ],
        [
            "Applicant",
            "International Business Machines Corporation",
            "Xds, Inc.",
            "Inventec Appliances Corp.",
            "Sony Corporation",
            "Japan Tobacco Inc.",
            "Smartvue Corporation",
            "Simtone Corporation",
            "Smartvue Corporation",
            "Smartvue Corporation",
            "Olympus Corporation",
            "Blackberry Limited",
            "Avaya Inc.",
            "Smartvue Corporation",
            "Sony Corporation",
            "Allstate Insurance Company",
            "Smartvue Corporation",
            "Smartvue Corporation",
            "Smartvue Corporation",
            "Pandya Suketu J.",
            "Raghuram Krishnapuram",
            "Akihiro Kikuchi",
            "Toshiharu Terasawa",
            "Hoover Rick Paul",
            "Renkis Martin A",
            "Renkis Martin A",
            "Prakash Khanduri",
            "Renkis Martin A",
            "Research In Motion Limited"
        ],
        [
            "Title",
            "Method and system to bundle message over a network",
            "System and method for provisioning universal stateless digital and computing services",
            "Gateway",
            "Portable server and portable server system",
            "Analyzing system, analyzing method using the same, and system for collecting survey results for use in analysis",
            "Enterprise video intelligence and analytics management system and method",
            "System and method for provisioning universal stateless digital and computing services",
            "Wireless video surveillance system and method with two-way locking of input capture devices",
            "Wireless video surveillance system and method with dual encoding",
            "Information acquisition device, information providing device, and information providing system",
            "Apparatus and method for integrating authentication protocols in the establishment of connections between computing devices",
            "Method and apparatus for measuring voice quality on a VoIP network",
            "Wireless video surveillance system and method with input capture and data transmission prioritization and adjustment",
            "Portable file server for wirelessly transmitting and receiving data to and from a terminal wherein the effective distance for wirelessly transmitting and receiving is adjusted by selecting from a list of distinct distances",
            "Enhanced claims damage estimation using aggregate display",
            "Mesh networked video and sensor surveillance system and method for wireless mesh networked sensors",
            "Wireless video surveillance system and method with two-way locking of input capture devices",
            "Video surveillance sharing system and method",
            "Response time and resource consumption management in a distributed network environment",
            "Method and system to bundle message over a network",
            "Portable file server",
            "Portable server and portable server system",
            "Method,system and processing system for associating uniform resource locator (URL) link data with images created by a camera or other image capture device",
            "Mesh networked video and sensor surveillance system and method for wireless mesh networked sensors",
            "Wireless surveillance system releasably mountable to track lighting",
            "METHOD AND APPARATUS FOR MEASURING VOICE QUALITY ON A VoIP NETWORK",
            "Wireless Video Surveillance System and Method with Two-Way Locking of Input Capture Devices",
            "Apparatus and method for integrating authentication protocols in the establishment of connections between computing devices"
        ]
    ],
    "pageTitle": "Patent US7092369 - Communications network with wireless gateways for mobile terminal access - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7092369?dq=6,243,373",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481060475,
    "recordOffset": 481025066,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{25781=This application is related to U.S. patent application Ser. No. 09/589,514, filed Jun. 8, 2000 and to U.S. patent application Ser. No. 09/520,929, filed Mar. 8, 2000, which is a divisional of U.S. patent application Ser. No. 08/916,605, filed Aug. 22, 1997, which in turn is a continuation of U.S. patent application Ser. No. 08/691,263, filed Aug. 2, 1996, now abandoned, which claims the benefit of U.S. Provisional Application Ser. No. 60/006,872, filed Nov. 17, 1995., 25609=This application is a continuation-in-part of U.S. patent application Ser. No. 08/827,263, filed Mar. 28, 1997 now U.S. Pat. No. 6,747,692., 50886=An alternative terminal configuration can be based on the arrangement disclosed in U.S. patent application Ser. No. 08/691,263, filed Aug. 2, 1996, assigned herewith. That application describes a modular type terminal having interchangeable data collection modules, together with a detailed discussion of communications between mobile units and the Internet.}",
    "textBeforeTable": "Patent Citations Without further analysis, the foregoing will so fully reveal the gist of the present invention that others can readily adapt to various applications without omitting features that, from the standpoint of prior art, fairly constitute essential characteristics of the generic or specific aspects of the invention and, therefore, such adaptations should and are intended to be comprehended within the meaning and range of equivalents of the following claims. It will be appreciated that any of the features discussed in relation to one embodiment can, as appropriate, be incorporated in any other embodiment without departing from the teaching of the present invention. This concept could be expanded to conference rooms or centers. Also this system preferably uses the IEEE 802.11b wireless network system protocol, but could be implemented using another wireless network protocol, such as Bluetooth. The act of leasing network time would be as follows: the visitor will enter in some personal information, over secure sockets, required to complete a financial exchange (account, PIN, etc.). Once the transaction has been verified, the visitor will be transitioned to another wireless network access point that will provide the agreed upon service. The system will monitor the time and resources used and prorate the cost to the visitor. Since the system is monitoring the network activity, it can make smart choices as to the medium used to perform the function requested. At the expiration of",
    "textAfterTable": "US5828694 Jul 1, 1996 Oct 27, 1998 Trimble Navigation Limited Determination of multipath tracking error US5831574 Oct 7, 1996 Nov 3, 1998 Snaptrack, Inc. Method and apparatus for determining the location of an object which may have an obstructed view of the sky US5841396 Dec 4, 1996 Nov 24, 1998 Snaptrack, Inc. GPS receiver utilizing a communication link US5845203 Jan 25, 1996 Dec 1, 1998 Aertis Cormmunications Remote access application messaging wireless method US5845287 Jul 9, 1996 Dec 1, 1998 Alcatel N.V. Apparatus for managing relationships between objects US5854605 Jul 5, 1996 Dec 29, 1998 Trimble Navigation Limited GPS receiver using data bit timing to achieve a fast time to first fix US5874914 Mar 8, 1996 Feb 23, 1999 Snaptrack, Inc. GPS receiver utilizing a communication link US5877724 Mar 25, 1997 Mar 2, 1999 Trimble Navigation Limited Combined position locating and cellular telephone system with a single shared",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}