{
    "relation": [
        [
            "Date",
            "Oct 10, 1995",
            "Jun 28, 2001",
            "Aug 10, 2005",
            "Jan 20, 2006",
            "Mar 21, 2006"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: BOEHRINGER MANNHEIM GMBH, GERMANY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ESSENPREIS, MATTHIAS;KNUETTEL, ALEXANDER;BOECKER, DIRK;REEL/FRAME:007792/0197;SIGNING DATES FROM 19950821 TO 19950822",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20060120"
        ]
    ],
    "pageTitle": "Patent US5710630 - Method and apparatus for determining glucose concentration in a biological ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5710630?dq=4182933",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483873471,
    "recordOffset": 483831485,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{53609=Danielson et al: \"Guided-wave reflectometry with micrometer resolution\", Applied Optics, 26, 1987, pp 2836-2842., 100728=The maximum which is visible in FIG. 9 at about 1450 nm is due to the displacement of water by glucose in the range of a water absorption band. The slight shoulder at about 1570 nm is caused by a glucose absorption band. This difference could possibly be used as an additional means for separating the influence of glucose as compared to other parameters., 101396=The results of these experiments are shown in FIG. 10 and 11. FIG. 10 shows the change of the index of refraction n with respect to the glucose concentration for the two light wavelengths represented in the figure (1300 and 1550 nm), depending on the glucose concentration which is indicated in mM. The shown values of the index of refraction were calculated from DPS-values using formula (1) (as described in the context of FIGS. 6 and 7). A normalization was performed using values of the index of refraction of pure water which are known from the literature whereby knowledge of lg is not required., 53751=Takada et al: \"New measurement system for fault location in optical waveguide devices based on an interferometric technique\", Applied Optics, 26, 1987, pp 1603-1606., 84547=The possibility of determining the glucose concentration in the eye's anterior chamber using an optical property of the aqueous humor depending on this glucose concentration has already been long discussed. For instance the 1976 U.S. Pat. No. 3,958,560 describes the possibility to irradiate light from one side of the anterior chamber at a shallow angle into said chamber in such manner that the beam passes straight through the anterior chamber along a secant to the cornea curvature and exits on the far side (again at a shallow angle) (\"anterior-chamber transmission method\"). Procedures wherein the light is irradiated from the front (approximately normally to the cornea curvature) into the anterior chamber and wherein light reflected out of this chamber is detected (\"anterior-chamber reflection method\") illustratively are known from the European patent applications 0 589 191 and 0 603 658. The measurement quantities discussed in these publications are the optical rotation of polarized light and the (spectroscopically measured) optical absorption., 53946=Schmitt et al.: \"Measurement of Optical Properties of Biological Tissues by Low-Coherence Reflectometry\", Applied Optics, 32, 1993, pp 6032-6042., 92157=W. L. Danielson et al, \"Absolute optical ranging using low coherence interferometry\", Appl. Opt. 30, 2975 (1991),}",
    "textBeforeTable": "Patent Citations Even though the above discussed principle of measurement (contrary to the case of conventional spectroscopic measurement) does not mandate detection steps for a plurality of light wavelengths, it may be advantageous to irradiate measuring light with a plurality of different wavelengths and to evaluate the then detected light each time in the above described manner. It may be appropriate furthermore to combine the described method with optical-absorption measurements. As a result accuracy of measurement may be increased, thereby reducing in particular spuriousness of the measurement results on account of further substances contained in the aqueous humor, for instance ascorbic acid, amino acids and lactic acid, that might hamper glucose determination. Moreover the measurement error linked to temperature fluctuations in the eye's anterior chamber may thus be reduced. FIG. 11 is a representation of the dependence of the difference dn of the measurement values of FIG. 10 including error bars on the glucose concentration. It is apparent that the differential index of refraction dn has a clearly measurable dependence on the glucose concentration. The accuracy of the measurement of dn is largely independent on small changes of the geometrical path length (i.e. the length of the cuvette k). Therefore dn is a suitable measurement quantity for the determination of the glucose concentration in cases, where the geometrical path length of the sample light path is not constant. The results of these experiments are shown in FIG. 10",
    "textAfterTable": "Won Suck Yang A non-invasive method and apparatus for measuring blood chemical concentration EP0589191A1 * Aug 9, 1993 Mar 30, 1994 Edward W. Stark Non-invasive glucose measurement method and apparatus EP0603658A1 * Dec 9, 1993 Jun 29, 1994 Boehringer Mannheim Gmbh Device for in-vivo determination of an optical property of the liquid of the aqueous humor of the eye * Cited by examiner Non-Patent Citations Reference 1 * Danielson et al., Applied Optics , Guided wave reflectometry with micrometer resolution , vol. 26, No. 14, 15 Jul. 1987. 2 Danielson et al., Applied Optics, \"Guided-wave reflectometry with micrometer resolution\", vol. 26, No. 14, 15 Jul. 1987. 3 * Huang et al., Science , Optical Coherence Tomography , vol. 254. 4 Huang et al., Science, \"Optical Coherence Tomography\", vol. 254. 5",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}