{
    "relation": [
        [
            "Date",
            "Mar 10, 2003",
            "Nov 22, 2010",
            "Mar 29, 2011",
            "Mar 29, 2011",
            "Nov 28, 2014",
            "Apr 17, 2015",
            "Jun 9, 2015"
        ],
        [
            "Code",
            "AS",
            "REMI",
            "SULP",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Surcharge for late payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: INTERNATIONAL BUSINESS MACHINES CORPORATION, NEW Y Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:BLYTHE, CHRISTOPHER JAMES;DAUGHTREY, ERIK A.;CUOMO, GENNARO A.;AND OTHERS;REEL/FRAME:013836/0602;SIGNING DATES FROM 20020121 TO 20030304",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20150417"
        ]
    ],
    "pageTitle": "Patent US7207043 - Programmatic response-time based workload distribution techniques - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7207043?ie=ISO-8859-1&dq=6985872",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00328-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483268791,
    "recordOffset": 483224672,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While preferred embodiments of the present invention have been described, additional variations and modifications in those embodiments may occur to those skilled in the art once they learn of the basic inventive concepts. Therefore, it is intended that the appended claims shall be construed to include the preferred embodiments and all such variations and modifications as fall within the spirit and scope of the invention. The computer program instructions may also be loaded onto one or more computers or other programmable data processing apparatus to cause a series of operational steps to be performed on the computers or other programmable apparatus to produce, on each such device, a computer implemented process such that the instructions which execute on the device provide steps for implementing the functions specified in the flowchart and/or block diagram block or blocks. These computer program instructions may also be stored in one or more computer-readable memories, where each such memory can direct a computer or other programmable data processing apparatus to function in a particular manner, such that the instructions stored in the computer-readable memory produce an article of manufacture including instruction means which implement the function specified in the flowchart and/or block diagram block or blocks. The present invention has been described with reference to flowchart illustrations and/or block diagrams of methods, apparatus (systems), and computer program products according to embodiments of the invention. It will be",
    "textAfterTable": "Jun 11, 1998 Nov 5, 2002 Microsoft Corporation Thread optimization US6535878 * Mar 19, 1998 Mar 18, 2003 Roxio, Inc. Method and system for providing on-line interactivity over a server-client network US6542920 * May 19, 2000 Apr 1, 2003 Sun Microsystems, Inc. Mechanism for implementing multiple thread pools in a computer system to optimize system performance US6629142 Jun 22, 2000 Sep 30, 2003 Sun Microsystems, Inc. Mechanism for optimizing processing of client requests US6816882 * May 31, 2000 Nov 9, 2004 International Business Machines Corporation System and method for automatically negotiating license agreements and installing arbitrary user-specified applications on application service providers US6879995 * May 1, 2000 Apr 12, 2005 Sun Microsystems, Inc. Application server message logging US6898617 Nov 18, 1999 May 24, 2005 International Business Machines Corporation Method, system and program products for managing thread pools of a computing environment to avoid deadlock situations by dynamically altering",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}