{
    "relation": [
        [
            "Date",
            "Jul 31, 1998",
            "Oct 5, 1998",
            "Nov 20, 1998",
            "Sep 26, 2003",
            "Nov 16, 2007",
            "Nov 26, 2007",
            "Oct 28, 2008",
            "Oct 21, 2011"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "REMI",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: WHITAKER CORPORATION, THE, DELAWARE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ZIEGNER, BERNHARD ALPHONSO;JAIN, NITIN;REEL/FRAME:009362/0146 Effective date: 19980731",
            "Owner name: WHITAKER CORPORATION, THE, DELAWARE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:SLETTEN, ROBERT JOHN;BROWN, STEVE ROBERT;REEL/FRAME:009667/0845 Effective date: 19980731",
            "Owner name: WHITAKER CORPORATION, THE, DELAWARE Free format text: ;ASSIGNORS:SLETTEN, ROBERT JOHN;BROWN, STEVE ROBERT;REEL/FRAME:009600/0129 Effective date: 19980928",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "Owner name: AUTOILV ASP, INC.,UTAH Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:M/A-COM, INC.;TYCO ELECTRONICS TECHNOLOGY RESOURCES, INC.;TYCO ELECTRONICS CORPORATION;AND OTHERS;REEL/FRAME:021750/0045 Effective date: 20080926",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6064286 - Millimeter wave module with an interconnect from an interior cavity - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6064286?dq=6859936",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 488615535,
    "recordOffset": 488587777,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While specific embodiments of the present invention are shown and described, it is envisioned that those skilled in the art may devise various modifications of the present invention without departing from the spirit and the scope of the appended claims. As mentioned, a package in accordance with the present invention may be configured for mounting on the surface of a printed wiring board, directly on a support plate or essentially any other substrate without departing from the scope of the present invention. With regard to assembling and mounting the packages 20a and 20b. illustrated in FIGS. 9 and 13, essentially the same assembly and mounting processes can be employed as described in relation to the package 20 illustrated on FIG. 1. As with the other packages described, locating bosses 54b are preferably provided on the bottom surface 46b of the base 22b of the package 20b as shown in FIG. 15, and the locating bosses 54b are received in corresponding apertures to position the package 20b when the package 20b is mounted. Preferably, the components of the package 20b illustrated in FIGS. 12-15 are formed of the same materials as corresponding components of the packages 20, 20a previously described. For example, preferably the interconnect 26b is formed of the same materials as interconnects 26 and 26a. Similar to the packages 20, 20a previously described, the package 20b preferably provides that the waveguide structures 48b are received",
    "textAfterTable": "Oct 3, 1995 Sumitomo Electric Industries, Ltd. Plastic package type semiconductor device having a rolled metal substrate US5482898 * Mar 27, 1995 Jan 9, 1996 Amkor Electronics, Inc. Method for forming a semiconductor device having a thermal dissipator and electromagnetic shielding US5556807 * Feb 18, 1993 Sep 17, 1996 Intel Corporation Advance multilayer molded plastic package using mesic technology US5752851 * Feb 5, 1996 May 19, 1998 Ford Motor Company Circuit clip connector US5770300 * Dec 3, 1996 Jun 23, 1998 Fuji Electric Co., Ltd. Multilayered metallic printed board and molded module US5821615 * Dec 5, 1996 Oct 13, 1998 Lg Semicon Co., Ltd. Semiconductor chip package having clip-type outlead and fabrication method of same US5847453 * Mar 19, 1997 Dec 8, 1998 Honda Giken Kogyo Kabushiki Kaisha Microwave circuit package JPH03212006A *",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}