{
    "relation": [
        [
            "Date",
            "Mar 16, 1999",
            "Mar 7, 2000",
            "Aug 19, 2003",
            "Mar 10, 2006",
            "Apr 19, 2010",
            "Sep 10, 2010",
            "Nov 2, 2010"
        ],
        [
            "Code",
            "AS",
            "AS",
            "CC",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: RADIONICS, INC., MASSACHUSETTS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:COSMAN, ERIC R.;RITTMAN, WILLIAM J., III;GOLDBERG, S. NAHUM;AND OTHERS;REEL/FRAME:009818/0717;SIGNING DATES FROM 19990212 TO 19990216 Owner name: MASSACHUSETTS GENERAL HOSPITAL, MASSACHUSETTS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:COSMAN, ERIC R.;RITTMAN, WILLIAM J., III;GOLDBERG, S. NAHUM;AND OTHERS;REEL/FRAME:009818/0717;SIGNING DATES FROM 19990212 TO 19990216",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20100910"
        ]
    ],
    "pageTitle": "Patent US20010003798 - Balloon catheter for intra-urethral radio-frequency urethral enlargement - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20010003798?ie=ISO-8859-1&dq=6,970,917",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473453047,
    "recordOffset": 473411949,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{44374=[0012] Another system and procedure contemplated by Onik et al. is described in their research paper entitled “Transrectal ultrasound-guided percutaneous radical cryosurgical ablation of the prostate;” Cancer, vol. 72, pp. 1291-1299 (1993). This technique is utilized for the treatment of prostate cancer and involves disposing cryogenic (freezing) probes in the prostate for ablating the cancer cells. Onik et al. propose passing a cryogenic probe transperineally (through the perineum) into the prostate. At the same time, an imaging ultrasonic probe is passed through the rectum and is used to visualize the position of the cryogenic probe and the volume of cryogenic ablation in the prostate. This technique requires use of cryogenic probes (also referred to as cryo-probes) having relatively large diameters. The cryo-probes are complex in construction and operation and require elaborate cooling and thawing cycles, making the procedure typically quite complicated and expensive. It is technically challenging and critical to maintain precise temperatures at the target tissue area to prevent hemorrhaging when removing the probe and also to prevent freezing sensitive rectal mucosa tissue., 51463=[0019] Transurethral microwave thermotherapy (or “TUMT”) has been used to treat BPH and illustrates the use of a cooled catheter which also delivers heat energy to the prostate. A catheter which has a microwave probe inside it is inserted into the urethra to the point of the prostate. The microwave probe is typically a microwave antenna which is located inside the catheter near its distal end and is connected to an external generator of microwave power output. In this way the prostate is heated by radiative electromagnetic heating. At the same time the catheter is cooled by circulation of a coolant fluid within the catheter. The objective is, as stated above, to cool the urethra and thereby prevent damage to it by the heating process which is occurring in prostatic tissue that is outside of and at a distance from the urethra. Thus, the TUMT procedure seeks to preserve the urethra and the prostate tissue immediately outside the urethra by cooling the catheter with fluid coolant that is circulated within the catheter. In TUMT, the microwave antenna is located inside the catheter and not in conductive electrical contact with the urethra. The microwave heating in the TUMT procedure occurs in the prostatic tissue located at a distance away from the urethra as a result of the simultaneous cooling action of the channels within the catheter and the deposition of microwave power into the prostate tissue from the radiated energy from the antenna. Thus the prostatic tissue immediately around the urethra and the urethra itself are deliberately spared from receiving an ablative level of heating in the TUMT procedure. Further explanation of the TUMT system and procedure can be found in the paper by Blute, et al., entitled “Transurethral microwave thermal therapy for the management of benign prostatic hyperplasia: results of the United States prostration cooperative study.” J. Urol., vol. 150, pp. 1591-1596 (1993)., 37158=[0001] This application is a continuation-in-part of application Ser. No. 09/021,802, filed on Feb. 11, 1998, entitled “METHOD AND SYSTEM FOR PERFORMING INTRA-URETHRAL RADIO-FREQUENCY URETHRAL ENLARGEMENT.”}",
    "textBeforeTable": "Referenced by [0114] In view of these considerations, as would be apparent by persons skilled in the art, implementations and system should be considered broadly and with reference to the claims set forth below: [0113] Forms and embodiments of the intra-urethral radio-frequency urethral ablation system and method are provided involving various electrode designs with and without temperature monitoring, and in various electrode geometries. However, it should be recognized that other obvious forms may be used. For example, various materials, configurations, and control and display systems can be employed in a system or method for performing intra-urethral prostate ablation, with or without the capability of cooling the electrode, without departing from the scope of the invention. [0112] Yet a further advantage of the present invention is that the electrode construction and geometry is simpler and less expensive than the electrode structure for a cooled microwave catheter, as used in TUMT. For example, in the exemplary embodiments of FIGS. 1 through 7, only two channels are required. One channel is for inflation of the balloon. The other channel is for drainage of urine from the bladder or alternatively injection of contrast media into the bladder. In the case of TUMT, where cooling of the catheter and electrode is an objective, further channels within the catheter must be present to enable circulation of coolant fluid. For example, a channel which carries the fluid",
    "textAfterTable": "Mar 10, 2015 Covidien Lp System and method for ablation procedure monitoring using electrodes US20040227428 * Jun 14, 2004 Nov 18, 2004 Microsoft Corporation Electrostatic bimorph actuator US20100168745 * Jun 26, 2008 Jul 1, 2010 Loeser Edward A Composite fiber electrosurgical instrument US20100228202 * Jun 27, 2008 Sep 9, 2010 Flip Technologies Limited Catheter and a method for producing a catheter US20110257512 * Nov 23, 2009 Oct 20, 2011 Koninklijke Philips Electronics N.V. Susceptibility-based local flow detection to control mr-guided ablation using balloon devices US20110295161 * Mar 9, 2011 Dec 1, 2011 Rajiv Chopra Ultrasonic therapy applicator US20110313416 * Jan 15, 2010 Dec 22, 2011 Qijun Jiang Electrohydaulic prostate tissue treatment probe US20120203217 * Feb 3, 2011 Aug 9, 2012 Vivant Medical, Inc. System and",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}