{
    "relation": [
        [
            "Date",
            "2 May 1990",
            "14 Jun 1990",
            "16 Sep 1991",
            "18 Jan 1994",
            "19 Apr 1994",
            "19 Jan 1995",
            "5 Sep 1995",
            "30 Apr 1998",
            "25 Jul 2000",
            "29 Apr 2002"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: LINUS TECHNOLOGIES, INC., VIRGINIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:SKLAREW, RALPH C.;REEL/FRAME:005802/0513 Effective date: 19870323",
            "Owner name: LINUS TECHNOLOGIES, INC., 6804 LANGLEY SPRINGS COU Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:SKLAREW, RALPH C.;REEL/FRAME:005390/0365 Effective date: 19900430",
            "Owner name: GRID SYSTEMS CORPORATION Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:LINUS TECHNOLOGIES, INC.;REEL/FRAME:005834/0248 Effective date: 19900430",
            "Owner name: AST RESEARCH, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:GRID SYSTEMS CORPORATION;REEL/FRAME:006845/0133 Effective date: 19940103",
            "Year of fee payment: 4",
            "Owner name: BANK OF AMERICA NATIONAL TRUST AND SAVINGS ASSOCIA Free format text: SECURITY INTEREST;ASSIGNOR:AST RESEARCH, INC., A DELAWARE CORPORATION;REEL/FRAME:007288/0234 Effective date: 19941223",
            "Owner name: AST RESEARCH, INC., CALIFORNIA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:BANK OF AMERICA NATIONAL TRUST AND SAVINGS ASSOCIATION;REEL/FRAME:007492/0165 Effective date: 19950901",
            "Year of fee payment: 8",
            "",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US4972496 - Handwritten keyboardless entry computer system - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US4972496",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00054-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480799355,
    "recordOffset": 480749108,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{100151=Program lines 2600 to 4000 contain the character recognition subroutine which includes the software code necessary to get X and Y coordinates. This section of the program corresponds to FIG. 8., 30673=Reference is hereby made to Disclosure Document No. 144,644, filed Jan. 14, 1986., 56745=Reference is now made to FIG. 4 which discloses an overall system block diagram of the major electronic circuitry used in the preferred embodiment of the present invention. Microcomputer 14 includes a microprocessor 50, interconnected to a plurality of other electronic elements by means of data path or bus 52. A Read-Only-Memory (ROM) 54 which is programmed with the operating and application programs and a battery powered Random Access Memory (RAM) 56 is connected for bidirectional data flow onto bus 52. Microprocessor 50 may be a conventional single-chip eight-bit or sixteen-bit device which functions to execute the fixed control programs residing in ROM 54, and further receives control programs from and provides control signals to the other electronic elements via bus 52. Microprocessor 50 may be of the type commercially designated Z80 (manufactured by Zilog Microcomputers of Cupertino, Calif.), of a type 8088 device (manufactured by Intel Corp. of Santa Clara, Calif.) or any similar or more powerful microprocessor. ROM 54 may be of the type 2564 or 4764, both manufactured by Texas Instruments of Dallas, Tex. The storage capacity of RAM 56 is determined in part by the sizes of the application programs, the operating program and the database. As discussed below, RAM 56 may be of the static SRAM or dynamic DRAM type. The primary requirements of RAM 56 are that it have sufficient storage capacity and that it require a minimum of input power., 100364=Program lines 2600 to 2699 make up a subroutine designed to obtain the X and Y coordinates of a given Point. This code corresponds to boxes 152, 154, 160, 162, 164, 166 and 168 of FIG. 8., 30856=This is a continuation-in-part of U.S. patent application Ser. No. 06/889,513, filed July 25, 1986, now abandoned.}",
    "textBeforeTable": "Patent Citations Although the invention has been described in terms of a selected preferred embodiment encompassing the apparatus and methods aspects of a keyboardless computer system, the invention should not be deemed limited thereto, since other embodiments and modifications will readily occur to one skilled in the art. ##SPC1## The invention has numerous useful applications, almost without limitation. The most obvious applications are text editing and filling out and modifying forms. Some of the many other applications that may not come to mind as readily are writing in languages utilizing large numbers of symbols like Japanese or Chinese; writing in Arabic and similar languages made up of a limited number of complex symbols; writing chemical equations, including those involving organic compounds; writing music (a \"window\" with five parallel lines can be provided for musical applications); writing symbols and codes for graphic manipulation of data, including the transfer of graphic data to a spreadsheet; in education, as where predetermined questions are presented on the screens and the answers written in long-hand; as in teaching mathematics, as when numbers are manually inserted in equations and the equation analyzed to determine the result using those numbers; in CAD/CAM applications involving symbols, geometric shapes and the like. Further modifications and enhancements to the present invention would be obvious to those skilled in the art. For example, the common characteristics of each Font Symbol could be extracted and organized into a synthetic symbol.",
    "textAfterTable": "Title US5111512 * 14 May 1991 5 May 1992 At&T Bell Laboratories Method for signature verification US5148155 * 13 Nov 1990 15 Sep 1992 Wang Laboratories, Inc. Computer with tablet input to standard programs US5157384 * 28 Apr 1989 20 Oct 1992 International Business Machines Corporation Advanced user interface US5166666 * 14 Jun 1991 24 Nov 1992 Sony Corporation Pen operated processing system with speed-responsive switching US5174759 * 28 Nov 1989 29 Dec 1992 Preston Frank S TV animation interactively controlled by the viewer through input above a book page US5185515 * 24 Oct 1990 9 Feb 1993 Hitachi, Ltd. Automated teller machine and method thereof US5192826 * 31 Dec 1990 9 Mar 1993 Yamaha Corporation Electronic musical instrument having an effect manipulator",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}