{
    "relation": [
        [
            "Date and Time",
            "October 10 at 6PM",
            "October 12 at 6PM",
            "October 25 at 5PM",
            "October 27 at 5PM",
            "November 14 at 5 PM",
            "November 17 at 5PM",
            "November 26 at 6PM",
            "November 29"
        ],
        [
            "Duration",
            "3 Hours",
            "3 Hours",
            "1 Hour",
            "1 Hour",
            "1 Hour",
            "1 Hour",
            "3 Hours",
            "1 Hour"
        ],
        [
            "Location",
            "Furnas Dissection Lab",
            "Furnas Dissection Lab",
            "Capen Library",
            "Capen Library",
            "Capen Library",
            "Capen Library",
            "Furnas Dissection Lab",
            "Capen Library"
        ],
        [
            "Reason for Meeting",
            "To assign tasks for Gate 2 and begin the dissection of the angle grinder",
            "To complete the dissection of the angle grinder",
            "To collectively review Gate 2 before submission",
            "To assign clarify and assign tasks for Gate 3",
            "To collectively review Gate 3 before submission",
            "To assign clarify and assign tasks for Gate 4",
            "To assign tasks for Gate 4 and begin the reassembly of the angle grinder",
            "To collectively review Gate 4 before submission"
        ],
        [
            "Tasks to Accomplish at Meeting",
            "Disassemble angle grinder, take photographs and create a log of each step",
            "Finish disassembling the angle grinder, take photographs and create a log of each step",
            "Read through all parts of the project, check for spelling and/or grammar mistakes, and verify that all parts were completed with a sufficient level of detail",
            "Go through Gate 3 assignment, divide jobs, and collectively discuss the interpretations of any tasks",
            "Read through all parts of the project, check for spelling and/or grammar mistakes, and verify that all parts were completed with a sufficient level of detail",
            "Go through Gate 4 assignment, divide jobs, and collectively discuss the interpretations of any tasks",
            "Reassemble angle grinder, take photographs and create a log of each step",
            "Read through all parts of the project, check for spelling and/or grammar mistakes, and verify that all parts were completed with a sufficient level of detail"
        ]
    ],
    "pageTitle": "Group 16 - DeWalt 4 1/2 in Angle Grinder Gate 1 - GICL Wiki",
    "title": "Table 2: Group Meeting Plan",
    "url": "http://gicl.cs.drexel.edu/index.php?title=Group_16_-_DeWalt_4_1/2_in_Angle_Grinder_Gate_1&oldid=192383",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00151-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 101387611,
    "recordOffset": 101366854,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{41413=• 1400 MWO motor that powers through tougher jobs, 41740=• Both with maximum speed of 11000 rpm, 45067=\"How to Use an Angle Grinder.\" The Family Handyman. N.p., n.d. Web. 07 Dec. 2012. <http://www.familyhandyman.com/DIY-Projects/Saving-Money/Buying-Tools/how-to-use-an-angle-grinder/View-All>, 7331=Our group plans to perform the disassembly October 10 and 12 in the lab. Given the relatively small size of our product, we do not expect the dissection process to take longer than these two three hour sessions. During the disassembly process we will have one member take pictures of the product after each step of the dissection and one member record a written description of each step. This will facilitate the eventual reassembly of the part. Once the product has been fully disassembled and analyzed, we will reassemble the product by putting the parts back together in the same order we took them apart. The same tools used for disassembly should suffice for this part. Our preliminary dates for completing the reassembly are November 19 and in the lab. The remaining jobs such as part analysis and written submissions will as a rule be completed two days before each gate is due. A timeline of our activities is provided in Figure 1 for reference., 43818=11 Amp 5 In. AC/DC Small Angle Grinder with Trigger Grip-6121-31A at The Home Depot. N.p., n.d. Web. 06 Oct. 2012. <http://www.homedepot.com/h_d1/N-5yc1v/R-203405174/h_d2/ProductDisplay?catalogId=10053>., 44177=\"4 1/2\" Small Angle Grinder.\" Blackanddecker.com. N.p., n.d. Web. 06 Oct. 2012. <http://www.blackanddecker.com/power-tools/G950.aspx>., 44448=\"History of the Angle Grinder.\" FLEX. N.p., n.d. Web. 06 Oct. 2012. <http://www.flex-tools.com/gb/Unternehmen/Historie___Vision.php?navid=20>., 44742=\"Sign Up Today!\" Grinder Buying Guide. N.p., n.d. Web. 06 Oct. 2012. <http://www.cpometabo.com/grinder-buying-guide/grinder-buying-guide%2Cdefault%2Cpg.html>.}",
    "textBeforeTable": "In this section our group provides a brief summary of each group member's skills and flaws relevant to the project. The primary traits we were concerned with were general experience with machines, experience with angle grinders, computer and solid modeling skills, people skills, and availability. We decided that these factors would provide an adequate idea of which parts of the project each group member would be best for, as well as helping us figure out which skills we would have to develop over the course of the project. This self-evaluation is provided in Table 1 below. Analysis of Group Members Figure 1: Proposed Timeline of Events for Project Needle Nose Pliers T-15-T-25 Torx wrenches In addition, these are the tools our group may or may not need, depending on the nature of the internal components: 4 mm-6 mm Crescent Wrenches or Sockets w/ Socket Driver 5/32”-1/4” Crescent Wrenches or Sockets w/ Socket Driver 1/16”-1/8” Phillips Head and Flathead Screwdrivers Based on an initial assessment of the product's exterior and the fasteners in place, these are the tools we expect to need for reassembly and disassembly: Our group plans to perform the disassembly October 10 and 12",
    "textAfterTable": "Date and Time Duration Location Reason for Meeting Tasks to Accomplish at Meeting October 10 at 6PM 3 Hours Furnas Dissection Lab To assign tasks for Gate 2 and begin the dissection of the angle grinder Disassemble angle grinder, take photographs and create a log of each step October 12 at 6PM 3 Hours Furnas Dissection Lab To complete the dissection of the angle grinder Finish disassembling the angle grinder, take photographs and create a log of each step October 25 at 5PM 1 Hour Capen Library To collectively review Gate 2 before submission Read through all parts of the project, check for spelling and/or grammar mistakes, and verify that all parts were completed with a sufficient level of detail October 27 at 5PM 1 Hour Capen Library To assign clarify and assign tasks for Gate 3 Go through Gate 3 assignment, divide jobs, and collectively discuss the interpretations of any tasks November 14 at 5 PM 1 Hour Capen Library To collectively review Gate 3 before submission Read through all parts of the project, check for spelling and/or grammar mistakes, and verify that all parts were completed with a sufficient level of detail November 17 at 5PM 1 Hour Capen Library To assign clarify and assign tasks for Gate 4 Go through Gate 4 assignment, divide jobs, and collectively discuss the interpretations of any tasks November 26 at 6PM 3 Hours Furnas Dissection Lab To",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}