{
    "relation": [
        [
            "",
            "Screen size & resolution",
            "Weight",
            "Processor",
            "Memory",
            "Graphics",
            "Hard disk"
        ],
        [
            "Asus VivoBook X550CA",
            "15.6-inch 1,366 x 768",
            "2.6kg",
            "1.9GHz Intel Core i3-3217U",
            "4GB",
            "Integrated (Intel HD Graphics 4000)",
            "750GB"
        ],
        [
            "Asus X552CL",
            "15.6-inch 1,366 x 768",
            "2.4kg",
            "1.7GHz Intel Core i5-3217U",
            "6GB",
            "Dedicated (Nvidia GeForce GT 710M)",
            "750GB"
        ],
        [
            "Lenovo IdeaPad Yoga 11 2",
            "11.6-inch 1,366 x 768",
            "1.4kg",
            "2.1GHz Intel Pentium N3520",
            "4GB",
            "Integrated (Intel HD Graphics 4000)",
            "500GB"
        ],
        [
            "Toshiba Satellite C55-A-1N0",
            "15.6-inch 1,366 x 768",
            "2.3kg",
            "2.5GHz Intel Core i5-4200M",
            "4GB",
            "Integrated (Intel HD Graphics 4600)",
            "750GB"
        ],
        [
            "Acer V5-122P",
            "11.6-inch 1,366 x 768",
            "1.4kg",
            "1GHz AMD A6-1450",
            "6GB",
            "Integrated (AMD Radeon HD 8280)",
            "500GB"
        ],
        [
            "HP Pavilion Touchsmart 11",
            "11.6-inch 1,366 x 768",
            "1.4kg",
            "1GHz AMD A4-1250",
            "4GB",
            "Integrated (AMD Radeon HD 8210)",
            "500GB"
        ]
    ],
    "pageTitle": "Choosing a laptop for your family | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/gds/Choosing-a-laptop-for-your-family-/10000000178364283/g.html",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00273-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 414666715,
    "recordOffset": 414641324,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "  Comparison table eBay loves: Small size, good battery life, touchscreen Watch out for: The processor is a little underpowered RRP: £329 The HP Pavilion Touchsmart 11-ea030sa is a cheap 11.6in laptop that's light enough, at 1.4kg, for any member of the family to carry around. As the name suggests, this laptop has a wonderfully responsive touchscreen, making it easy for the kids to use Windows 8 and its apps. Some corners have had to be cut and the AMD A4 processor is a little slow. It will cope with day-to-day apps and the Internet, but editing photos and videos could be a bit slow. Likewise, the integrated graphics will struggle with modern 3D games, although they will cope with older titles. With decent battery life and a 500GB hard disk, this HP is a good choice if portability is more important than power. HP Pavilion Touchsmart 11-e030sa eBay loves: Low price, small size Watch out for: It's a little slow RRP: £309 This tiny 11.6in laptop with a 1,366 x 768 resolution screen weighs just 1.4kg and is exceptional value. It has",
    "textAfterTable": "Size and weight For most families, a laptop with a 15.6in screen will do the job nicely. This gives you a nice trade-off between a comfortable screen size, weight and overall portability. Get the lightest laptop you can afford, but you'll be looking at a model that most likely weighs between 1.8kg and 2.3kg at this size. If you want something a bit more portable that you can take everywhere with you, a model with an 11.6in or 13.3in screen will do the job. These will weigh somewhere between 1.4kg and 1.8kg. The trade off here is that you'll have to make-do with a slower processor in order to keep the price down.   Battery life As you'll mostly be using your laptop around the home, battery life isn't such an important consideration, but it's still good to get one that can be used away from the mains socket for a decent amount of time. That will give you more flexibility to use it around the house, and perhaps out in the garden. Judging the longevity of a laptop’s battery is always difficult, as it depends on the applications you use. Relatively undemanding programs such as web browsers, email clients and word processors use far less battery power, for example, than games and video playback.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}