{
    "relation": [
        [
            "SITE",
            "El Paso County",
            "New Mexico DPS",
            "Maricopa County",
            "Yuma County",
            "San Diego",
            "San Francisco",
            "Brooks County",
            "Total"
        ],
        [
            "HIDTA",
            "$ 2.28",
            "2.64",
            "1.64",
            "1.64",
            "2.40",
            "-",
            "-",
            "$10.60"
        ],
        [
            "BYRNE",
            "-",
            "-",
            "4.70",
            "1.78",
            "-",
            "1.86",
            "-",
            "$ 8.34"
        ],
        [
            "OTHER",
            "$ 2.07",
            "6.07",
            "-",
            "-",
            "0.13",
            "-",
            "-",
            "$ 8.27"
        ],
        [
            "TOTAL",
            "$ 4.35",
            "$ 8.71",
            "$ 6.34",
            "$ 3.41",
            "$ 2.52",
            "$ 1.86",
            "-",
            "$27. 19"
        ]
    ],
    "pageTitle": "OIG Audit Report 08-22",
    "title": "",
    "url": "https://oig.justice.gov/reports/OJP/a0822/exec.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00157-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 875251023,
    "recordOffset": 875239023,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Audit Report 08-22 March 2008 Office of the Inspector General}",
    "TableContextTimeStampAfterTable": "{42927=The Violence Against Women and Department of Justice Reauthorization Act of 2005 merged the Byrne Grant Program with the Local Law Enforcement Block Grant Program (LLEBG) to create the Edward Byrne Memorial Justice Assistance Grant Program., 43391=We did not analyze possible duplicate SCAAP funding for the New Mexico DPS because it only submits reimbursement requests for prosecution services. As a result, our audit only included SWBPI reimbursements for prosecution services. SWBPI pre‑trial detention reimbursement requests are submitted through the State of New Mexico’s counties. Also, we did not analyze possible duplicate funding for Brooks County or San Francisco. Brooks County did not receive SCAAP funding between FYs 2002 through 2006 and San Francisco did not provide a listing of SWBPI cases submitted for reimbursements., 2565=Initially, the program was administered by the Executive Office for United States Attorneys (EOUSA) in DOJ. However, in FY 2002 the management of the Southwest Border Prosecution Initiative (SWBPI) was transferred to the Office of Justice Programs (OJP), DOJ’s grant-making arm., 42424=No jurisdictions were reimbursed in the 4th quarter of FY 2004 because no funds were available. In addition, for the quarters ended December 31, 2004, March 31, 2005, June 30, 2005, September 30, 2005, December 31, 2005, March 31, 2006, June 30, 2006, and September 30, 2006, SWBPI recipients received pro-rata reimbursements of 49.29 percent, 44.08 percent, 47.40 percent, 50.16 percent, 53.18 percent, 47.61 percent, 43.09 percent, and 44.05 percent respectively., 22026=Pursuant to the FY 2002 Appropriations Act and all subsequent DOJ appropriations, SWBPI is intended to reimburse states and localities for prosecution and pre-trial detention costs associated with federally initiated criminal cases. Accordingly, on each SWBPI application the recipient certified that total federal reimbursements did not exceed 100 percent of actual prosecution and pre‑trial detention costs for SWBPI cases. Nevertheless, as noted above, we found that SWBPI recipients received reimbursements of $49.78 million in excess of supported costs. In our judgment, this is inconsistent with a statutory scheme that is intended to reimburse recipients for actual costs., 2855=From October 1, 2001, through September 31, 2006, OJP provided reimbursements totaling $161.13 million to the four Southwest Border states and local jurisdictions, as shown in Table 1., 17655=The importance of the issues identified in our audit are reinforced by the fact that, as of the 4th quarter of FY 2006, OJP was only able to reimburse SWBPI applicants for 44 percent of the total maximum reimbursement amount because reimbursement requests exceeded available funding. If OJP ensured that only eligible cases were reimbursed and reimbursements were linked to the actual costs to prosecute and detain SWBPI defendants, additional funds would be available to more fully reimburse existing SWBPI jurisdictions for the actual costs of eligible cases.9, 10456=The July 2007 guidelines specify that new cases resulting from probation or parole violations and revocation hearings resulting from a previously reimbursed SWBPI case are not eligible for reimbursement. Further, extradition cases are also not eligible for reimbursement. Although none of these types of cases would have been eligible for reimbursement under the previous guidelines, the revised guidelines ensure that jurisdictions are aware of the fact that these types of cases are ineligible., 39756=OJP has accepted applications for all of FY 2007, but as of January 31, 2008, had not made any reimbursements for FY 2007 SWBPI submissions., 1075=In 1994, U.S. Attorney Offices along the Southwest Border began to establish partnerships with state and county prosecutors through which states and local governments began prosecuting federally initiated drug cases resulting from the illegal importation of controlled substances at the Southwest Border. As the number of federally declined criminal cases prosecuted by state and local governments began to increase, so did the related financial and resource burden on the states and localities. As a result, in fiscal year (FY) 1998, state and local prosecutors along the Southwest Border began informing the DOJ that they would no longer be able to prosecute federally initiated cases unless they received federal funds. To address these concerns, in 2000 Congress passed Public Law 106-246 to provide FY 2001 funding to state, county, parish, tribal, and municipal governments to reimburse them for costs associated with the prosecution and pre‑trial detention of federally initiated illegal immigration and drug and alien smuggling cases that subsequently are declined by the U.S. Attorneys offices and instead referred to state and local jurisdictions. However, none of the subsequent appropriations limit the types of federally initiated cases that are allowable for reimbursement. As a result, any federally initiated case that is declined by the U.S. Attorneys offices and subsequently prosecuted by an eligible state or local jurisdiction is allowable for reimbursement., 13236=The audit generally covered, but is not limited to, SWBPI reimbursements awarded from FYs 2002 through 2006. Audit work was conducted at OJP; the Office of National Drug Control Policy (ONDCP); the Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF); the Drug Enforcement Administration (DEA); the Federal Bureau of Investigation (FBI); and EOUSA., 9065=Our audit generally covered SWBPI reimbursements awarded from FYs 2002 through 2006.3 Therefore, we used the SWBPI guidelines in effect during the period covered by our audit when conducting our analysis. However, in July 2007 OJP updated the SWBPI guidelines and made the following changes:, 41356=No jurisdictions were reimbursed in the 4th quarter of FY 2004 because no funds were available. In addition, for the quarters ended December 31, 2004, March 31, 2005, June 30, 2005, September 30, 2005, December 31, 2005, March 31, 2006, June 30, 2006, and September 30, 2006, SWBPI recipients received pro-rata reimbursements of 49.29 percent, 44.08 percent, 47.40 percent, 50.16 percent, 53.18 percent, 47.61 percent, 43.09 percent, and 44.05 percent respectively., 27363=In sum, as a result of not linking reimbursement rates to actual costs, jurisdictions may receive reimbursements in excess of their actual costs. As of the 4th quarter of FY 2006, SWBPI applicants only received 44 percent of the maximum reimbursement amount because reimbursement requests exceeded available funding.12 If OJP ensured that only eligible cases were reimbursed and reimbursements were linked to the actual costs to prosecute and detain SWBPI defendants, additional funds would be available to more fully reimburse actual costs for eligible cases., 10033=The July 2007 guidelines no longer contain the statement that when a case is submitted under the “both” category, the prosecution timeline takes precedence in determining the case reimbursement category. However, the OJP application still allows for cases to be submitted under the “both” category rather than requiring that prosecution and pre-trial detention reimbursements be submitted separately.}",
    "textBeforeTable": "TABLE 3. PROSECUTION GRANTS RECEIVED BY SWBPI RECIPIENTS (Dollars in Millions) In addition to SWBPI reimbursements, we determined that six of the seven jurisdictions included in our audit also received HIDTA, Byrne grant, and other federal prosecution funds totaling $27 million during the review period, as shown in Table 3.14 Federal Prosecution Funding We identified three major federal programs that provide funding to state and local jurisdictions for prosecution and detention services, each of which may partially duplicate funding provided through the SWBPI program. These programs are ONDCP High Intensity Drug Trafficking Area (HIDTA) Drug Prosecution Initiatives, OJP’s Edward Byrne Memorial Justice Assistance Grant Program (Byrne Grant Program), and the Department of Homeland Security, Bureau of Immigration and Customs Enforcement (DHS ICE), SCAAP.13 At the time the SWBPI reimbursement applications are submitted, the jurisdiction’s CEO or designee is required to certify that the SWBPI claim has been adjusted to account for additional prosecution and pre‑trial detention funding received through other federal programs. We found that only one of the seven jurisdictions included in our audit took steps to adjust their claims to account for additional funding from overlapping federal programs, and that OJP has not taken action to identify potential duplicate funding between the SWBPI program and other federal programs. Additional Federal Programs with Overlapping Objectives In sum, as a result of not linking reimbursement rates to actual costs, jurisdictions may receive reimbursements in excess of their actual costs. As",
    "textAfterTable": "Source: OJP, ONDCP, and SWBPI recipients With the exception of El Paso County, none of the six other jurisdictions included in our audit took steps to ensure that the SWBPI reimbursements, when combined with additional federal funding received for prosecution and pre‑trial detention services, did not exceed the cost to prosecute the SWBPI cases. Although El Paso County did not track its costs to prosecute SWBPI cases, it deducted $1.51 million from its SWBPI reimbursement requests in an attempt to ensure that federal funding did not exceed 100 percent of the costs to prosecute the SWBPI case. Federal Detention Funding OJP also administers SCAAP in conjunction with the DHS ICE. SCAAP provides federal payments to states and localities that incur correctional officer salary costs for incarcerating undocumented criminal aliens. Since the SWBPI program also includes reimbursement for pre-trial detention services, we looked at the possibility of duplicate funding between SCAAP and the SWBPI. We found that four of the seven jurisdictions included in our audit received SCAAP funds totaling $95,559 for pre-trial detention services provided in SWBPI cases submitted for reimbursement.15 However, we found that none of the jurisdictions had taken any action to ensure they were not receiving duplicate SCAAP funds for these same cases. In our judgment, the jurisdictions included in our audit made unsupported certifications in each quarterly SWBPI reimbursement application because they did not adjust their claims to account for the total additional funding",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}