{
    "relation": [
        [
            "Saint-Denis",
            "Stade de France",
            "Capacity: 80,000",
            "",
            "Nantes",
            "Stade de la Beaujoire",
            "Capacity: 38,500",
            ""
        ],
        [
            "Marseille",
            "Stade Vélodrome",
            "Capacity: 60,000",
            "",
            "Toulouse",
            "Stadium de Toulouse",
            "Capacity: 37,000",
            ""
        ],
        [
            "Paris",
            "Parc des Princes",
            "Capacity: 49,000",
            "",
            "Saint-Étienne",
            "Stade Geoffroy-Guichard",
            "Capacity: 36,000",
            ""
        ],
        [
            "Lens",
            "Stade Félix Bollaert",
            "Capacity: 41,800",
            "",
            "Bordeaux",
            "Parc Lescure",
            "Capacity: 35,200",
            ""
        ],
        [
            "Lyon",
            "Stade de Gerland",
            "Capacity: 41,200",
            "",
            "Montpellier",
            "Stade de la Mosson",
            "Capacity: 33,900",
            ""
        ]
    ],
    "pageTitle": "Football World Cup 1998 - The Full Wiki",
    "title": "",
    "url": "http://www.thefullwiki.org/Football_World_Cup_1998",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00115-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 747002479,
    "recordOffset": 746964225,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{25513=The tournament opened with 1994 FIFA World Cup champions Brazil's 2-1 victory over Scotland. Norway pulled the shock of Group A, topping the holders 2-1 after two late goals. Still, both teams advanced to the next round. Italy easily won Group B, with Chile's three draws enough for them to get through. The Italy-Chile clash which ended 2-2 saw Italy's Roberto Baggio cast aside the spectre of his miss in the penalty shootout in the final 4 years earlier: this time around his highly controversial spot-kick earned Italy a draw., 317847=The official video game is World Cup 98. But many other games such as International Superstar Soccer 98, World League Soccer 98, Actua Soccer 2, Neo Geo Cup '98: The Road to the Victory and so on were released and were mainly based on the 1998 FIFA World Cup., 5586=The 1998 FIFA World Cup, the 16th FIFA World Cup, was held in France from 10 June to 12 July 1998. France was chosen as hosts by FIFA on 1 July 1992. The tournament was won by France, who beat Brazil 3-0 in the final. France won their first title, becoming the seventh nation to win a World Cup, and the first host nation to win the tournament since Argentina in 1978., 24611=The format of the competition was different from 1994, as the finals were expanded from 24 to 32 teams. The 32 teams were divided into eight groups of four. The eight group winners and the eight group runners-up would qualify for the knockout stage. The golden goal rule was also introduced to decide knockout matches which went into extra time. Another change in the rules came into effect at this World Cup, stating that as regulation time was about to expire in any period of play the fourth official would use a handheld electronic display to show how many minutes of stoppage time were to be played. This practice has continued since then, after being well received by media and spectators alike., 51652=For a list of all squads that played in the final tournament, see 1998 FIFA World Cup squads., 13683=Germany, Italy, Argentina, Spain, Romania and the Netherlands were seeded along with defending champion Brazil and host France. For the first time in FIFA's history, the draw took place in a football stadium - Stade Vélodrome in Marseilles, on 4 December 1997.}",
    "textBeforeTable": "Ten stadia were used during the tournament: Venues The official mascot of this World Cup was Footix, a cockerel with the words \"FRANCE 98\" on the chest. Its body is mostly blue, like the host's national team shirt and its name is a portmanteau of \"football\" and the ending \"-ix\" from the popular Astérix comic strip. Mascot The official song for the event was La Copa de la Vida by Ricky Martin, and the official anthem was La Cour des Grands by Youssou N'Dour and Axelle Red. For the first time ever, the final featured the host nation and the defending champions. Zinedine Zidane scored two headers from corners in the 27th minute and in first half stoppage time respectively, and Emmanuel Petit added a late goal in second half stoppage time to give France a 3-0 win over Brazil. An estimated one million people took to the Paris streets to celebrate through the night. France became seventh country to have won the world cup, joining Uruguay, Italy, Germany, Brazil, England and",
    "textAfterTable": "Match officials Africa Said Belqola Gamal Al-Ghandour Lucien Bouchardeau Lim Kee Chong Ian McLeod Asia Abdul Rahman Al-Zeid Ali Bujsaim Masayoshi Okada Pirom Un-Prasert Europe Marc Batta Günter Benkö Pierluigi Collina Hugh Dallas",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}