{
    "relation": [
        [
            "Date",
            "6/23/2012",
            "5/27/2012",
            "4/3/2012",
            "3/12/2012",
            "2/18/2012",
            "1/23/2012"
        ],
        [
            "Team",
            "Detroit",
            "Detroit",
            "Detroit",
            "Detroit",
            "Detroit",
            "Detroit"
        ],
        [
            "Position",
            "CB",
            "DT",
            "DT",
            "RB",
            "RB",
            "OT"
        ],
        [
            "Name",
            "Aaron Berry",
            "Nick Fairley",
            "Nick Fairley",
            "Mikel Leshoure",
            "Mikel Leshoure",
            "Johnny Culbreath"
        ],
        [
            "Incident",
            "Arrested on suspicion of DUI after allegedly driving into several parked cars in Pennsylvania.",
            "Arrested in Mobile, Ala., charged with DUI, trying to elude police.",
            "Arrested in Mobile, Ala., charged with marijuana possession.",
            "Arrested in southwest Michigan, charged with second marijuana possession offense in a month.",
            "Arrested, charged with marijuana possession in Benton Township, Mich.",
            "Arrested, charged with misdemeanor marijuana possession in South Carolina."
        ],
        [
            "Resolution",
            "Assigned to diversionary program.",
            "",
            "",
            "",
            "Pleaded to lesser charge, $485 fine.",
            "Paid $412 fine."
        ]
    ],
    "pageTitle": "The Detroit Lions Only Play is \"Go To Jail\" - Vikings Digital Diaries",
    "title": "",
    "url": "http://vikingsdigitaldiaries.com/2012-articles/the-detroit-lions-only-play-is-qgo-to-jailq.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00096-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 253352591,
    "recordOffset": 253326608,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21850=Biggest disappointments from the 2014-15 regular seasonPuck Drunk Love, 35253=The 2014 NFL Announcer Rankings32 Flags, 20805=Five players who should rebound in 2015-16Puck Drunk Love, 48329=Posted by PJD on Aug 7, 2012 14:00, 28702=The 2002 Rose Bowl Feels Like a Lifetime Ago For Miami and NebraskaThe Student Section, 51553=I also found a website that tracks all NFL arrests since 2000, by player, team, or position. I did a quick pull for the Lions in 2012 and they already have 6 arrests in there, with some pretty heavy shit:, 34294=Best and worst MLS kits for the 2015 season32 Flags, 15301=2014-15: The Year of the Injured NBA SuperstarCrossover Chronicles, 60076=They’re clearly a little late on the Adrian Peterson thing, but maybe that’s because HE DIDN’T DO ANYTHING WRONG, GOD DAMMIT!!!! and because he hasn’t had his trial yet or something. And thankfully Chris Cook was booked in 2011 so people kind of forget about it, even if I haven’t, NOR EVER WILL. Either way, that only pushes us to 3 arrests this year (unless I’m forgetting some? I feel like I am …), which totally isn’t bad! I mean, the Caleb King one is probably way worse than any of the Lions’ marijuana charges, but hey … Maybe that guy should have defended himself better and we wouldn’t have this problem., 71420=VikingsDigitalDiaries.com is a Minnesota Vikings fan web site and is in no way affiliated with the Minnesota Vikings, the National Football League, or its Properties. This site is for informational and entertainment purposes only. VikingsDigitalDiaries.com is not an official web site for the Minnesota Vikings. Copyright © 2014 www.PurpleJesusDiaries.com - All Rights Reserved - Trademarks used herein are property of their respective owners.}",
    "textBeforeTable": "I also found a website that tracks all NFL arrests since 2000, by player, team, or position. I did a quick pull for the Lions in 2012 and they already have 6 arrests in there, with some pretty heavy shit: That’s where the Detroit Lions Monopoly board comes into play above. Hilarious! Go To Jail is their only option, the morons! At least there isn’t a square that says “Record an 0-16 Record.” Oops. Either way, I’ve started to sour a bit on the Lions recently, and it largely has to do with them having greater success than my favorite team in the Vikings. Now, I DO foresee a crash back to earth this season where they play some middling ball largely because they didn’t upgrade their defense this offseason, and also partially because they’ve turned into a team with a bunch of criminals (says the guy who writes a blog about the Vikings, I get it). The Detroit Lions sure are cute. I’ve raved about their awesome wide receiver Calvin Johnson, the boner-inducing defensive tackle Ndamukong Suh, and have been jealous of their metal music listening head coach in Jim Schwartz. In comparison, I bet Leslie Frazier listens to the Charmels before a game starts. I mean, they’re fine and",
    "textAfterTable": "Does this really only count as 3 though, since Mikel Leshoure and Nick Fairley were arrested twice, separately (amazing, by the way) and Aaron Berry has since been released by the team? I say no, because lick a butthole, Lions. You earned those prison showers. In comparison, here is the Vikings illustrious list for this year: Date Team Position Name Incident Resolution 6/2/2012 Minnesota FB Jerome Felton Arrested on suspicion of drunken-driving 4/28/2012 Minnesota RB Caleb King Arrested in relation to assault that fractured a man’s skull. Fight allegedly started after victim said King looked like comedian Eddie Murphy. Cut by team three days later. They’re clearly a little late on the Adrian Peterson thing, but maybe that’s because HE DIDN’T DO ANYTHING WRONG, GOD DAMMIT!!!! and because he hasn’t had his trial yet or something. And thankfully Chris Cook was booked in 2011 so people kind of forget about it, even if I haven’t, NOR EVER WILL. Either way, that only pushes us to 3 arrests this year (unless I’m forgetting some? I feel like I am …), which totally isn’t bad! I mean, the Caleb King one is probably way worse than",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}