{
    "relation": [
        [
            "Year",
            "2006",
            "2007",
            "2008",
            "2009",
            "2010"
        ],
        [
            "Black",
            "65.7",
            "68.0",
            "65.7",
            "69.0",
            "76.5"
        ],
        [
            "White",
            "23.5",
            "20.9",
            "21.4",
            "16.5",
            "12.1"
        ],
        [
            "Hispanic",
            "5.7",
            "6.1",
            "8.3",
            "9.0",
            "7.1"
        ],
        [
            "Asian",
            "5.1",
            "4.6",
            "4.6",
            "5.2",
            "3.9"
        ],
        [
            "Indian",
            "0.0",
            "0.0",
            "0.0",
            "0.3",
            "0.4"
        ]
    ],
    "pageTitle": "Soldan International Studies High School - Wikipedia, the free encyclopedia",
    "title": "Percent of students by race",
    "url": "https://en.wikipedia.org/wiki/Soldan_International_Studies_High_School",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00251-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 872052335,
    "recordOffset": 872021731,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20044=After the conversion to a magnet school, Soldan became home to a significant international student population.[22] By 1996, nearly 40 percent of students were from 32 countries other than the United States.[22] As part of the merger of the Center for Management, Law and Public Policy, the school became the only high school in the state to have a law library as part of its facilities.[23] During the 2010–2011 school year, as part of a district budget process, Soldan began to accept seventh and eighth grade students.[24], 16783=Starting in the late 1980s, St. Louis schools were required to improve physical conditions and create magnet schools as part of promoting a court-ordered desegregation program. The international studies magnet program originally was set for implementation at Northwest High School, but in August 1988, U.S. District Court Judge Stephen N. Limbaugh revised the district magnet school program.[15] Among the changes was that Soldan would become a magnet school for international studies, and that it would become the highest part of a \"cluster\" of magnet schools focused on international relations, with lower-level schools having a focus on foreign languages.[15], 86855=Coordinates: 38°39′19″N 90°16′20″W﻿ / ﻿38.655404°N 90.272282°W﻿ / 38.655404; -90.272282, 17999=Also part of the court desegregation plan was the physical improvement of city schools.[16] Significant renovations to Soldan began in late 1989 and included interior renovations and the replacement of the school's two 2,000-square-foot gymnasiums with one 10,000-square-foot gymnasium.[16] Due to the renovations, the building was closed from the 1990–1991 to the 1992–1993 school years, and its students were reassigned to Roosevelt High School.[17][18] While the building was undergoing renovations, the city's Center for Management, Law and Public Policy magnet school was folded into the international studies program at Soldan.[19] After three years of construction, the renovated building reopened on September 2, 1993.[20] However, an electrical rewiring of the school and the installation of a synchronized clock system, which were to be completed as part of the renovation work, were not finished until early 1995 owing to a contractual dispute with an electrical company.[21], 11531=During the 1930s and 1940s, the school became widely known as the city's \"predominantly Jewish\" school, with students from several notable or wealthy families in the Central West End.[8] Although the school remained open on Jewish holidays, it often had significantly lower attendance.[9] During its early years, Soldan graduated several notable individuals, including William McChesney Martin, Jr., the longest-serving Chairman of the United States Federal Reserve, and Clark Clifford, a presidential adviser and United States Secretary of Defense. In 1922, Clifford and Martin were tennis doubles partners on the school's team.[10] It also was during the 1920s that Tennessee Williams attended the school; in the 1940s, Soldan received notability as the school attended by some of the characters in Williams' The Glass Menagerie. In 1948, the school received students after the closure of nearby rival Blewett High School, which was located one block from Soldan.[5] After the merger, the school was briefly known as Soldan-Blewett; it returned to its original name in 1955.[5], 9639=William B. Ittner's design for the school received praise from the United States Bureau of Education for its attention to detail and to the needs of students It was designed to stylistically complement the nearby Clark School, which was designed in Gothic Revival style, with fittings and brickwork to suggest a Tudor period Gothic structure built in approximately 1620. With a capacity of 1,600 students, the building originally occupied an area of 288 by 256 feet and had three stories. The original design of the building had 41 classrooms, with 23 designed for 48 students and 18 for 35 students. The building's 18 science demonstration rooms and laboratories accommodated physiology, physiography, chemistry, botany, and physics, and in the basement, the building was designed with shops for woodworking, machining, and domestic science. The building also had four art rooms with skylights for studio work and three mechanical drafting rooms. The auditorium was the largest in the school system up to that time, with a seating capacity of 1,750, while the music room was built with a capacity of more than 300 students. To provide for ample physical education opportunities, the school was built with two gymnasiums.[7] The school originally had two separate cafeterias for male and female students, although the practice of gender segregation at lunch was ended in the late 1940s.[5], 4000=Soldan International Studies High School (also known as Soldan High School) is a public magnet high school in the Academy neighborhood of St. Louis, Missouri that is part of the St. Louis Public Schools. From its opening in 1909, Soldan was known for its wealthy and predominantly Jewish student population. Starting in the 1950s, the student population underwent a rapid change in demographics; by the mid-1960s, it was predominantly African American. In the early 1990s, the school was renovated and reopened as a magnet school with a focus on international relations., 23185=For the 2010–2011 school year, the school offered seven activities approved by the Missouri State High School Activities Association (MSHSAA): boys' and girls' cross country, 11-man football, boys' and girls' soccer, girls' tennis, girls' softball, and girls' volleyball.[26] In addition to its current activities, Soldan students have won several state championships, including:, 8574=By the end of the 1890s, the population of the city had increased to more than 575,000, but since 1855, the St. Louis Public Schools had operated only one high school. To meet the need for greater space for high school students, the school district built two new high schools in 1904. Three years later, the district began building a fourth high school, which would become Soldan.[4] Known during its construction as Union Avenue High School and renamed Soldan High School upon opening, the school was named for Frank Louis Soldan, the superintendent of St. Louis schools from 1895 until his death in 1908.[5] Land acquisition costs for the building were $10,000, and construction cost $630,000.[6], 28751=Soldan has a low dropout rate; for the 2009–2010 school year, 1.8 percent of students dropped out compared to the Missouri state dropout rate of 3.5 percent.[2] Soldan also has a discipline incident rate of 3.1 percent, which is comparable to the average Missouri rate.[2][29] Since the passage of No Child Left Behind in 2001, Soldan has met the requirements for adequate yearly progress (AYP) twice. In 2006, Soldan students achieved 17.2 percent proficiency in communication arts, allowing the school to meet AYP via making satisfactory progress.[2] In 2009, the school met AYP in communication arts via a confidence interval.[2], 22338=In 2011 it had an enrollment of 801, making it the 119th largest high school in Missouri.[25][unreliable source?], 24788=In the 2009–2010 school year, Soldan had an enrollment of 749 students with 53.6 full-time-equivalent teachers, for a student-teacher ratio of 13.97.[1] In 2010, more than 80 percent of students qualified for free or reduced-price lunches.[28] Since 2006, more than 65% of the student population at Soldan has been African American and the white student population has declined by roughly half.[28], 14286=After the Brown v Board of Education decision in 1954, white parents and students of Soldan were among the most welcoming in the city toward integration.[11] On the first day of integration, the school saw no protests, although national media personalities such as NBC evening news anchor John Cameron Swayze covered the event.[12] Neither black nor white students reported significant incidents of racial tensions or problems, although black students often chose to eat in separate areas of the building from whites in the cafeteria.[13] Despite the relatively uneventful process, Soldan experienced a rapid change in the demographics of its student population.[5] During the 1940s, more than 90 percent of Soldan students were Jewish whites; by the early 1960s, the majority were African American.[5] By 1965, only one white student attended Soldan, and many of the school's African American students had moved into the area from poorer neighborhoods such as Mill Creek Valley after urban renewal projects had displaced them.[14]}",
    "lastModified": "Sat, 01 Aug 2015 18:58:40 GMT",
    "textBeforeTable": "In the 2009–2010 school year, Soldan had an enrollment of 749 students with 53.6 full-time-equivalent teachers, for a student-teacher ratio of 13.97.[1] In 2010, more than 80 percent of students qualified for free or reduced-price lunches.[28] Since 2006, more than 65% of the student population at Soldan has been African American and the white student population has declined by roughly half.[28] Demographics[edit] The school also has produced one tennis doubles state champion and three boys' outdoor track and field individual events champions.[27] Boys' Indoor Track and Field: 1961, 1970 Boys' Swimming and Diving: 1938, 1941 Boys' Basketball: 1981, 2012 For the 2010–2011 school year, the school offered seven activities approved by the Missouri State High School Activities Association (MSHSAA): boys' and girls' cross country, 11-man football, boys' and girls' soccer, girls' tennis, girls' softball, and girls' volleyball.[26] In addition to its current activities, Soldan students have won several state championships, including: Activities[edit] In 2011 it had an enrollment of 801, making it the 119th largest high school in Missouri.[25][unreliable source?]",
    "textAfterTable": "Students receiving free or reduced price lunch Year Percent 2006 83.0 2007 83.3 2008 67.5 2009 69.0 2010 86.3 Faculty information by year Year Average years experience Percent with master's degree 2006 14.6 64.2 2007 15.5 64.6 2008 8.9 54.9 2009 7.3 58.1 2010 6.8 48.5 Academic and discipline issues[edit] Soldan has a low dropout rate; for the 2009–2010 school year, 1.8 percent of students dropped out compared to the Missouri state dropout rate of 3.5 percent.[2] Soldan also has a discipline incident rate of 3.1 percent, which is comparable to the average Missouri rate.[2][29] Since the passage of No Child Left Behind in 2001, Soldan has met the requirements for adequate yearly progress (AYP) twice. In 2006, Soldan students achieved 17.2 percent proficiency in communication arts, allowing the school to meet AYP via making satisfactory progress.[2] In 2009, the school met AYP in communication arts",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}