{
    "relation": [
        [
            "Month",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12"
        ],
        [
            "Cost",
            "20,000.00",
            "20,000.00",
            "20,000.00",
            "20,000.00",
            "20,000.00",
            "20,000.00",
            "12,000.00",
            "12,000.00",
            "12,000.00",
            "12,000.00",
            "12,000.00",
            ""
        ],
        [
            "Depreciation",
            "333.33",
            "333.33",
            "333.33",
            "333.33",
            "333.33",
            "333.33",
            "624.00",
            "272.00",
            "272.00",
            "272.00",
            "80.00",
            ""
        ],
        [
            "Reserve",
            "13,133.33",
            "13,466.67",
            "13,800.00",
            "14,133.33",
            "14,466.67",
            "14,800.00",
            "15,424.00",
            "15,696.00",
            "15,968.00",
            "16,240.00",
            "16,320.00",
            ""
        ],
        [
            "Depreciation Basis",
            "20,000.00",
            "20,000.00",
            "20,000.00",
            "20,000.00",
            "20,000.00",
            "20,000.00",
            "16,320.00",
            "16,320.00",
            "16,320.00",
            "16,320.00",
            "16,320.00",
            ""
        ]
    ],
    "pageTitle": "Oracle Assets User Guide",
    "title": "",
    "url": "http://docs.oracle.com/cd/E18727_01/doc.121/e13586/T293142T302125.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 65,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74124315,
    "recordOffset": 74038458,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{338600== 1000 * 0.833, 337772=Asset added on: April 1st, 2007, 370531=At the end of the month, the following accounting entry is booked to record the depreciation expense for March 2010:, 185820=FY 2009 = 6.667% * (1 - 50%) = 3.3335%, 351754=In accordance with the Japan Tax Reforms 2007, Oracle Assets now supports calculation of What-if Projections Analysis for JP-250DB and JP-STL-EXTND depreciation methods. Also, you can use the What-If analysis for assets that are in Extended Depreciation using the JP-STL EXTND method., 365141=On March 31, 2010, a professional evaluation was performed on the asset and an impairment loss was recorded on the asset., 174809=FY 2004 = 19.2% * (1 - 30%) = 13.44%, 185003=FY 2011 = 3.3335% * 1,000,000 = 33,335, 434211=If the asset is retired in the first half of a depreciation period, no depreciation is taken for the last depreciation period of its life. That is, if the asset is retired on 04-JAN-1999, no depreciation is taken for the depreciation period January 1999. If the asset is retired in the second half of the last depreciation period of the asset's life, a half a month of depreciation is taken. For instance, if the asset is retired on 18-JAN-1999, depreciation is taken for the prorate period 01-JAN-1999 through 15-JAN-1999, but not for the prorate period 16-JAN-1999 through 31-JAN-1999., 388991=On April 1, 2006, an asset was recorded into Oracle Assets with the following details:, 176221=Because the additional first-year depreciation deduction retroactively applies to assets placed in service after September 10, 2001, many users may have closed their previous fiscal year before the additional first-year depreciation deduction was available., 184711=FY 2005 = 3.3335% * 1,000,000 = 33,335, 452927=Check Straight Line for Retirements if you are setting up an asset category with a 1250 property class in a tax book. Oracle Assets uses a straight-line depreciation method in determining the gain or loss resulting from the retirement of 1250 (real) property., 352387=By setting the FA: Japan 2007 Tax Reforms Features profile option to Yes, the system adds the following to the What-If Analysis window:, 168503=Oracle Assets provides special depreciation methods to help you take advantage of the additional first-year depreciation deduction provided by the Job Creation and Worker Assistance Act of 2002., 174315=FY 2002 = 44% * 1,000,000 = 440,000, 176996=Oracle Assets provides special depreciation methods for qualified leasehold and restaurant improvements to help you take advantage of the additional first-year depreciation deduction provided by the American Jobs Creation Act of 2004., 186063=FY 2014 = 6.667% * (1 - 50%) = 3.3335%, 185569=FY 2004 = 50% + 3.333% * (1 - 50%) = 51.6665%, 461964=Coastal Landscapes is entering a five year equipment lease with Marine Technologies on March 1, 1993. The fair value of the equipment is $100,000. The lessee's incremental borrowing rate is 12%. The minimum lease payments consist of monthly payments of $1,900 of which three payments are due at lease inception. The first regular payment is due on April 1, 1996. There is no bargain purchase option, and the title does not transfer to Coastal Landscapes at the end of the lease. The economic life of the asset is six years., 362248=No Salvage Value or Depreciation Limit, DPIS After April 1, 2007, 470495=Fremont Corporation has entered a lease agreement dated January 1, 1990. The term of the lease is five years, requiring equal rental payments of $20,000 at the beginning of each year. The equipment has a fair value of $100,000 and an economic life of ten years. The lease contains a bargain purchase option for $5,000. The lessee's incremental borrowing rate is 10%., 352048=In order to use the What-If Analysis for JP-250DB and JP-STL EXTND depreciation methods, set the FA: Japan 2007 Tax Reforms Features profile option toYes., 185247=FY 2016 = 3.333% * 1,000,000 = 33,330, 345992=The Date in Service is defaulted to a high range of March 31, 2007., 184760=FY 2006 = 3.3335% * 1,000,000 = 33,335, 174549=FY 2007 = 4.032% * 1,000,000 = 40,320, 232354=**** Group A Depreciation Expense in FY 2002 = Depreciable Basis * Annual Rate = 22,850 * 30% = 6,855, 411714=On April 1, 2011, it was decided that the depreciation on the asset was to be restarted. To restart depreciation on a non-depreciating asset, perform the following:, 155482=Note: To meet the requirements for the Japan 250% Declining Balance depreciation method, the Guarantee Rate Evaluation check box was added to the Depreciation Method window in addition to the Use Japan NBV Calculation for Impairments. The check boxes are only displayed when the FA: Japan 2007 Tax Reforms Features profile option is set to Yes. For more information, see Japan Tax Reforms features., 178414=The following table shows the table-based depreciation methods Oracle Assets provides to help you take advantage of the additional first-year depreciation deduction allowed by the American Jobs Creation Act of 2004. The same depreciation method, life, and prorate convention apply to both regular tax and AMT purposes on the qualified asset., 216693=* Group Asset Depreciable Basis in Feb-2000 = (End of Current Period Balance + End of Previous Year Balance) / 2 = (50,000 + 0) / 2 = 25,000, 168707=The Job Creation and Worker Assistance Act of 2002 provides an additional depreciation deduction for both regular tax and alternative minimum tax purposes in the United States. It provides an additional first-year depreciation deduction that is equal to 30 percent of the qualified asset's depreciable basis. The depreciable basis of the asset and the depreciation deduction in the year of purchase and in later years would be adjusted to reflect the additional first-year depreciation deduction. Refer to the Job Creation and Worker Assistance Act of 2002 for compliance., 186306=FY 2019 = 3.333% * (1 - 50%) = 1.6665%, 174502=FY 2006 = 8.064% * 1,000,000 = 80,640, 362109=Salvage Value 10% and Depreciation Limit 95%, DPIS before March 31, 2007, 433065=In this example, if an asset has a date placed in service in the first half of January (for example, 04-JAN-1998), an entire month of depreciation is taken for the period of addition. The depreciation is charged for the first prorate period, 01-JAN-1998 through 15-JAN-1998, as well as the second prorate period, 16-JAN-1998., 441489=You set up your QuickCode values for Property Type in the QuickCodes window. If you have assets in the United States, enter 1245 for personal property and 1250 for real property., 212171=** Group Asset Depreciation Expense Mar-2000 = Group Asset Depreciable Basis * Annual Depreciation Rate / Periods Per Year = 35,000 * 30% / 12 = 875, 216843=** Group Asset Depreciable Basis in Mar-2000 = (End of Current Period Balance + End of Previous Year Balance) / 2) = (60,000 + 0) / 2 = 30,000, 326964=On March 30, 2007, the Japan Tax Reform act was published by the Ministry of Finance Japan and was enacted on April 1, 2007. The reform significantly impacted the methods used for depreciation of assets in Japan and provided new guidelines on the calculation and treatment of depreciation of assets. The purpose of the new deprecation rules laid down in the FY2007 Tax Reforms is to increase the Depreciation expenses by abolishing salvage value and increasing the depreciation limit on assets so that the companies can reduce National and Local taxes. Additionally, new depreciation methods were introduced and extended depreciation feature made available for assets acquired before April 1, 2007. In order to address the Japanese depreciation requirements, the following Japan specific depreciation methods have been created and seeded within Oracle Assets., 334005=The Dual Rate Evaluation depreciable basis rule is part of the predefined rules. This depreciable basis rule determines the basis for the calculation of depreciation. The rule checks the rate that is used for calculating depreciation and accordingly determines the depreciable basis. This depreciable basis rule is available only if the FA: Japan 2007 Tax Reforms Features profile option is set to Yes., 177240=The American Jobs Creation Act of 2004 provides that qualified leasehold and restaurant improvements placed in service between October 22, 2004 and Dec. 31, 2005 will be depreciated over 15 years using the straight-line method. These improvements can still qualify for the 50 percent bonus depreciation if they were placed in service before Dec. 31, 2004., 433400=If the asset is retired in the first half of a depreciation period, no depreciation is taken for the last depreciation period of its life. That is, if the asset is retired one year later on 04-JAN-1999, no depreciation is taken during the depreciation period January 1999. If the asset is retired in the second half of the last depreciation period of the asset's life, half a month of depreciation is taken. For instance, if the asset is retired on 18-JAN-1998, depreciation is taken for the prorate period 01-JAN-1998 through 15-JAN-1998, but not for the prorate period 16-JAN-1998 through 31-JAN-1998., 158501=Note: To meet the requirements for the Japan Tax Reforms, the Cost and NBV at Beginning of Year parameters were added to the Test Formula tabbed region. The system displays these parameters only when the FA: Japan 2007 Tax Reforms Features profile option is set to Yes. For more information, see Japan Tax Reforms features., 340053=The reform provided an extended depreciation benefit to assets acquired before April 1, 2007 which have already reached the earlier depreciation limit of 95%. Under this benefit, these assets could now be depreciated further to 1 Yen using the Straight Line method over a 60 month period. Through the Find Eligible Assets window, you can search for the eligible assets and then use the Set Extended Depreciation window to record the decision whether or not a particular asset should be avail for extended depreciation. Once the decision is recorded on the asset and then you click on the Submit button of Set Extended Depreciation window, a concurrent process is launched to update the depreciation method to JP-STL-EXTND and depreciation limit is set to 1 Yen., 329544=As a result of the reform, new Straight Line depreciation rates were published for assets acquired on or after April 1, 2007. The Straight Line depreciation rate calculation for assets acquired prior to April 1, 2007 used rates rounded downward rather than upward as required by the new reform. As a result, the existing seeded JP-STL XXYR depreciation methods were modified. For depreciation terms where the rate calculation required by the reform impacted the rate, an additional rate line was added to the depreciation method. For depreciation methods where there was not an impact, the method continues to contain a single rate line. For example, in the JP-STL depreciation methods for assets with a life of four or five years the change in the rounding did not impact the rate, therefore, only one rate line is defined. Whereas in JP-STL deprecation methods for asset with lives of three to six, there was an impact on the rate, so an additional rate line was added. The method contains one rate that can be used for assets with a DPIS of prior to April 1, 2007 with another for assets with a DPIS on or after April 1, 2007., 365105=Fiscal Year: April – March, 186258=FY 2018 = 6.667% * (1 - 50%) = 3.3335%, 397049=On April 1, 2000, an asset was recorded into Oracle Assets with the following details:, 344723=The system adds the Extended Depreciation menu option to the Depreciation menu if the FA: Japan 2007 Tax Reforms Features profile option is set to Yes. The Extended Depreciation menu provides access to the following:, 226798=** Group Asset Depreciation Expense in FY-2002 = Depreciable Basis * Annual Rate = 24,700 * 30% = 7,410, 391262=The asset has reached its depreciation limit and is no longer depreciating. The asset’s current net book value is 50,000. As a result of the 2007 tax reform, the asset’s depreciation method was changed on April 1, 2007 and the remaining value is being depreciated using the Extended Straight Line Depreciation method. Then on March 31, 2008, a professional evaluation was performed on the asset and an impairment loss was recorded on the asset., 186015=FY 2013 = 6.666% * (1 - 50%) = 3.333%, 185771=FY 2008 = 6.667% * (1 - 50%) = 3.3335%, 453218=If you check Straight Line For Retirements, enter the straight-line depreciation Method and Life you want to use for the Gain From Disposition of 1250 Property Report. This is the default method for your asset in the Retirements window and in the tax book if you use mass copy., 174766=FY 2003 = 32% * (1 - 30%) = 22.4%, 232187=** Group A Depreciable Basis in FY 2001 = 30,000 - 4,500 = 25,500, 185295=FY 2017 = 3.3335% * 1,000,000 = 33,335, 185052=FY 2012 = 3.3335% * 1,000,000 = 33,335, 184809=FY 2007 = 3.333% * 1,000,000 = 33,330, 208333=* Group Depreciation Expense in Apr-2000 = (Group Asset Depreciable Basis) * Annual Depreciation Rate / Periods Per Year = 40,000 * 30% / 12 = 1,000, 338881== Decode (sign(1000 * 0.02789)-((1000 - 833)* 0.833)),1,Revised Rate, Original Rate), 358059=For assets acquired prior to March 31, 2007 and are being depreciated using the seeded depreciation methods of JP-STL XXYR, JP-DB XXYR, and JP-STL-EXTND, the net book value for the impairment calculation, the salvage value is not considered in the calculation., 348753=In order to access the Find Eligible Assets window, set the FA: Japan 2007 Tax Reforms Features profile option to Yes., 222267=*** Group A Depreciation Expense in Mar-2000 = (((End of Current Period Balance + End of Previous Year Balance) / 2) x Annual Depreciation Rate - Year to Date Depreciation ) / Remaining Fiscal Year Periods = ((( 60,000 + 0 ) / 2 ) x 30% - 1,022.73 ) / 10 = 797.73, 337920=Asset cost = 1000 Yen, 185149=FY 2014 = 3.3335% * 1,000,000 = 33,335, 185966=FY 2012 = 6.667% * (1 - 50%) = 3.3335%, 237165=***Group A Depreciable Basis in FY 2001 = 30,000 - 6,000 = 24,000, 382470=Fiscal Year: April – Mar, 186209=FY 2017 = 6.667% * (1 - 50%) = 3.3335%, 226581=* Group Asset A Depreciable Basis in FY-2002 = Cost - Salvage Value - Accumulated Depreciation = 40,000 - 15,300 - 24,700, 174455=FY 2005 = 8.064% * 1,000,000 = 80,640, 185674=FY 2006 = 6.667% * (1 - 50%) = 3.3335%, 204644=* Group Depreciation Expense in Mar-2000 = (Group Asset Depreciable Basis * Annual Depreciation Rate) / Periods Per Year = (40,000 * 30%) / 12 = 1,000, 122878=If your periods include the year, such as JAN-1995, and you are using the hyphen (-) as the suffix delimiter, you must use either a two or four-digit year suffix. Oracle Assets automatically adds a four-digit year to the end of the period name if you do not enter a year. Otherwise, you can enter a two-digit year suffix., 169468=The following table shows the table-based depreciation methods Oracle Assets provides to help you take advantage of the additional first-year depreciation deduction allowed by the Job Creation and Worker Assistance Act of 2002., 174719=FY 2002 = 30% + 20% * (1 - 30%) = 44%, 212014=* Group Asset Depreciable Basis in Mar-2000 = (End of Current Period Balance + End of Previous Period Balance) / 2 = (40,000 + 30,000) / 2 = 35,000, 360934=In order to perform impairments on asset’s using the Japan depreciation methods, ensure that the FA: Japan 2007 Tax Reforms Features profile option is set to Yes. Then, follow the setup steps as detailed in the Application Setup for Asset Impairments section of Oracle Assets User Guide., 363083=On April 1, 2007, an asset was recorded into Oracle Assets with the following details:, 185723=FY 2007 = 6.666% * (1 - 50%) = 3.333%, 174407=FY 2004 = 13.44% * 1,000,000 = 134,400, 171608=On June 1, 2002, a corporation acquires and places in service qualified property that costs $1 million. The corporation is allowed an additional first-year depreciation deduction of $300,000. The depreciation calculation is computed as shown in the following table:, 339523== Decode (sign(floor(1000 * 0.02789)-((1000 - 833- 139) * 0.833)),1,Revised Rate, Original Rate), 174949=FY 2007 = 5.76% * (1 - 30%) = 4.032%, 184857=FY 2008 = 3.3335% * 1,000,000 = 33,335, 185101=FY 2013 = 3.333% * 1,000,000 = 33,330, 388819=Prior depreciation method JP-STL 8YR, date place in service before April 1, 2007, Depreciation limit reached, converted to extended depreciation on April 1, 2007., 236906=* Group A Depreciable Basis in FY 2000 = Cost - Salvage Value - Accumulated Depreciation - Reduced Amount = 30,000 - (20,000 * 50%) = 20,000, 186161=FY 2016 = 6.666% * (1 - 50%) = 3.333%, 351457=In order to access the Set Extended Depreciation Window, set the FA: Japan 2007 Tax Reforms Features profile option to Yes., 122298=For example, if your fiscal year runs from June 1 to May 31, and the current date is July 15, 1995, you are in calendar 1995 and fiscal 1996. If you specify FISCAL, your period name is JUL-96. If you specify CALENDAR, your period name is JUL-95., 185344=FY 2018 = 3.3335% * 1,000,000 = 33,335, 174855=FY 2005 = 11.52% * (1 - 30%) = 8.064%, 357194=In Japan, depreciation limits are legislated by the tax regulation and are set to 95% of the asset cost for assets with a date place in service (DPIS) before March 31, 2007. Most Japanese companies use the same depreciation limit for accounting purposes and depreciation is calculated up to the depreciation limit. While depreciation is limited to the depreciation limit, assets may be impaired beyond the depreciation limits. For assets using the Japan depreciation methods, are not longer prevented from impairing asset which have reached their depreciation limits., 184660=FY 2004 = 51.6665% * 1,000,000 = 516,665, 185625=FY 2005 = 6.667% * (1 - 50%) = 3.3335%, 185198=FY 2015 = 3.3335% * 1,000,000 = 33,335, 345435=Acquired on or before 31st March 2007, 338004=Guarantee Rate = 0.02789, 184955=FY 2010 = 3.333% * 1,000,000 = 33,330, 192197=The table below illustrates asset and calculated amounts for the first four periods of 2000., 193313=* Depreciation Expense in Mar-2000 = 32,000 * 30% / 12 = 800, 185917=FY 2011 = 6.667% * (1 - 50%) = 3.3335%, 232262=*** Group A Depreciable Basis in FY 2002 = 40,000 - 12,150 - 10,000 * 50% = 22,850, 184906=FY 2009 = 3.3335% * 1,000,000 = 33,335, 337312=To accommodate the above variables, the system displays Cost and NBV at Beginning of Year parameters in the Test Formula tabbed region of Depreciation Formula window. In order to have access to these parameters, the FA: Japan 2007 Tax Reforms Features profile option must be set to Yes., 237056=** Group A Depreciation Expense in FY 2000 = Depreciable Basis * Annual Rate = 20,000 * 30% = 6,000, 330849=As part of the reform, the Japan government published a new 250% Declining Balance Depreciation Method which can be used on assets acquired on or after April 1, 2007. For this method, the rate applied for depreciation is an accelerated balance method which is 250% of the rates used under the straight line method or more commonly known as 250DB. The method comes with an added feature of a straight-line switch. As a result, a new Guarantee Rate Evaluation Method check box was introduced to the Depreciation Method window to support the new 250DB method. This option enables five new variables to be available in defining depreciation formulas within the window., 232037=* Group A Depreciable Basis in FY 2000 = Cost - Salvage Value - Accumulated Depreciation - Reduced Amount = 30,000 - (30,000 * 50%) = 15,000, 514970=Copyright © 1988, 2010, Oracle and/or its affiliates. All rights reserved., 185869=FY 2010 = 6.666% * (1 - 50%) = 3.333%, 222000=** Group A Depreciation Expense in Feb-2000 = (((End of Current Period Balance + End of Previous Year Balance) / 2) x Annual Depreciation Rate - Year to Date Depreciation ) / Remaining Fiscal Year Periods = ((( 50,000 + 0 ) / 2 ) x 30% - 375 ) / 11 = 647.73, 368247=When determining the impairment loss, the current period’s (March 2010) is included in the CNBV calculation., 216995=*** Group Asset Depreciation Expense Mar-2000 = (Group Asset Depreciable Basis * Annual Depreciation Rate) / Periods Per Year = (30,000 * 30%) / 12 = 750, 186112=FY 2015 = 6.667% * (1 - 50%) = 3.3335%, 174360=FY 2003 = 22.4% * 1,000,000 = 224,000, 185393=FY 2019 = 1.6665% * 1,000,000 = 16,665, 180055=On December 1, 2004, a corporation acquires and places in service a qualified asset that costs $1 million. The corporation is allowed an additional first-year depreciation deduction of $500,000. The depreciation calculation is computed as shown in the following table:, 373896=On March 31, 2010, a profession evaluation was performed on the asset and an impairment loss was recorded on the asset., 221739=* Group A Depreciation Expense in Jan-2000 = (((End of Current Period Balance + End of Previous Year Balance) / 2) x Annual Depreciation Rate - Year to Date Depreciation ) / Remaining Fiscal Year Periods = ((( 30,000 + 0 ) / 2 ) x 30% - 0 ) / 12 = 375, 434013=If an asset is placed in service in the second half of January, for example, 18-JAN-1998, a half month of depreciation is taken in the period of addition (16-JAN-1998 through 31-JAN-1998)., 399309=As of March 2005, the asset has reached its depreciation limit and is no longer depreciating. The asset’s current net book value is 50,000. Then on March 31, 2010, a professional evaluation was performed on the asset and a 50,000 impairment loss was recorded on the asset., 174902=FY 2006 = 11.52% * (1 - 30%) = 8.064%, 406465=As of March 2004, the asset has been depreciated by 800,000 and the depreciation flag is manually set to No and is no longer depreciating. The asset’s current net book value is 200,000. Then on March 31, 2010, a professional evaluation was performed on the asset and a 100,000 impairment loss was recorded on the asset.}",
    "lastModified": "Tue, 23 Jun 2015 15:20:42 GMT",
    "textBeforeTable": "Refer to the Setting Up General Ledger section of Oracle General Ledger Implementation Guide for additional details in how to complete the following setup steps. General Ledger Setup Steps Setting up Oracle Workflow. Managing data security which includes setting up responsibilities to allow access to a specific set of business data and complete a specific set of transactions, and assigning individual users to one or more of these responsibilities. Performing system-wide setup tasks such as configuring concurrent managers and printers. To set up the underlying Oracle Applications technology, complete the following setup steps: Perform the following steps to implement Oracle Assets. The steps are discussed in detail in the Setting Up sections of required Oracle product user guides. The following tables list the related product setup steps. Related Product Setup Steps Setup Steps Setup Checklist Setup Flowchart Related Product Setup Steps Related Topics This section contains a brief overview of each task required to set up Oracle Assets. Setting Up - Overview Overview of Asset Insurance Defining Asset Warranties Exporting Lease Payments to Oracle Payables Entering Leases Lease Analysis Defining Distribution Sets Setting Up Asset Categories Defining Price Indexes Specifying Dates for Prorate Conventions Defining Investment Tax Credit Rates Setting Up Depreciation Ceilings Japan Tax Reforms - FY2007",
    "textAfterTable": "Define Your Ledgers   Step 2 Optional Define Your Unit of Measure Classes   Step 3 Optional Define Your Units of Measure   Step 4 Optional Define Your Employees   Step 5 Optional Define Your Descriptive Flexfields   Step 6 Optional Set Up Oracle Subledger Accounting   Step 7 Optional Decide How to Use the Account Generator   Step 8 Required with defaults Define Additional Journal Entry Sources   Step 9 Required with defaults Define Additional Journal Entry Categories   Step 10 Optional Define Your Supplier and Employee Numbering Schemes   Step 11 Optional Define Your Suppliers   Step 12 Required Define Your Asset Key Flexfield   Step 13 Required Define Your Asset Category Flexfield   Step 14 Required Define Your Location Flexfield   Step 15 Required Define Your System Controls  ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}