{
    "relation": [
        [
            "Product Information",
            "",
            "License Information",
            "Minimum Macintosh System Requirements",
            "Miscellaneous",
            "Weight"
        ],
        [
            "Upgrade Version :",
            "Number of Users :",
            "License Quantity :",
            "MAC Compatible :",
            "Country of Origin :",
            "Weight :"
        ],
        [
            "No",
            "1",
            "1 License",
            "Yes",
            "USA",
            "1.00 lbs. per Each"
        ],
        [
            "Platform Support :",
            "",
            "",
            "",
            "Brand :",
            ""
        ],
        [
            "Mac",
            "",
            "",
            "",
            "Encore Software",
            ""
        ]
    ],
    "pageTitle": "Warbirds 2012 for Mac (1-User) [Download] | Quill.com",
    "title": "",
    "url": "http://www.quill.com/warbirds-2012-for-mac/cbs/280116.html?Effort_Code=901&Find_Number=DWN1155&promoCode=300300666",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00060-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 679150119,
    "recordOffset": 679106683,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Specifications Players can learn how to fly historical aircraft, get FREE online flight training from live instructor pilots, and learn how to survive in a simulated combat environment with real combat flying skill in WarBirds 2012. 30-day FREE trial in the aerial combat MMOG where players can compete in air-to-air action against other real players in online combat and join online squadrons. Special Bonus! Players can also experience World War II combat in the Armored Assault simulation and World War I aerial combat in Dawn of Aces, both included in WarBirds 2012 as bonus games. They can go on raids with their squadron mates and participate in reenactments of many of the great air battles of World War II. Online WarBirds can be found at www.Totalsims.com. Pick from an array of WWII aircraft, each with its entirely unique combat characteristic and “personality,\" making each game a new experience. A Wealth of Options. Players can choose from countless online scenarios, modes and options that gives WarBirds a stunningly deep playing experience. Historical accuracy and remarkable detail. Remarkable historical accuracy and attention to detail that has made the WarBirds series one of the",
    "textAfterTable": "Loading... See all categories See all products Education Purchasing Solutions Quill Ideas Quill Coupons Bulk Office Supply Center About Quill Contact Us Recycle Ink and Toner Cartridges for QuillCash Think Pink Office Supplies Join Us On:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}