{
    "relation": [
        [
            "Shipping and handling",
            "Free shipping",
            "US $20.00"
        ],
        [
            "Each additional item",
            "Free",
            "Free"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "ePacket delivery from Hong Kong",
            "Other Shipping (FedEx International Economy)"
        ],
        [
            "Delivery*",
            "Estimated between Fri. Aug. 14 and Fri. Aug. 28",
            "Estimated between Mon. Aug. 10 and Wed. Aug. 12"
        ]
    ],
    "pageTitle": "H Shape Model 4 Pcs 9W UV Gel Nail Curing Dryer Lamp Light Bulb Replacement 45 | eBay",
    "title": "",
    "url": "http://www.ebay.com/itm/310391458424",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00245-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 416611555,
    "recordOffset": 416560947,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter 5 or 9 numbers for the ZIP Code. Please enter a valid ZIP Code. ZIP Code: Select a valid country. There are 418 items available. Please enter a number less than or equal to 418. -Select- Argentina Austria Belarus Belgium Brazil Brunei Darussalam Bulgaria Canada Chile Colombia Costa Rica Croatia, Republic of Cyprus Czech Republic Denmark Ecuador Egypt Estonia Finland France Germany Greece Hong Kong Hungary Iceland India Indonesia Ireland Israel Japan Korea, South Latvia Lithuania Luxembourg Macau Malaysia Maldives Malta Mexico Moldova Monaco Netherlands New Zealand Norway Oman Pakistan Peru Philippines Poland Portugal Puerto Rico Romania Russian Federation Saudi",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Handling time Will usually ship within 1 business day of receiving cleared payment - opens in a new window or tab. Return policy After receiving the item, contact seller within Refund will be given as Return shipping 30 days Money back Buyer pays return shipping",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}