{
    "relation": [
        [
            "Model step",
            "Austria",
            "Belgium",
            "Bulgaria",
            "Cyprus",
            "Czech Republic",
            "Denmark",
            "Estonia",
            "Finland",
            "France",
            "Germany",
            "Greece",
            "Hungary",
            "Ireland",
            "Italy",
            "Latvia",
            "Lithuania",
            "Luxembourg",
            "Malta",
            "Netherlands",
            "Poland",
            "Portugal",
            "Romania",
            "Slovakia",
            "Slovenia",
            "Spain",
            "Sweden",
            "United Kingdom",
            "Norway"
        ],
        [
            "1",
            "0.12",
            "0.2",
            "0.38",
            "0.16",
            "0.52",
            "0.1",
            "0.39",
            "0.18",
            "0.12",
            "0.12",
            "0.26",
            "0.28",
            "0.38",
            "0.14",
            "0.39",
            "0.56",
            "0.1",
            "0.22",
            "0.16",
            "0.24",
            "0.2",
            "0.26",
            "0.14",
            "0.32",
            "0.32",
            "0.25",
            "0.13",
            "0.1"
        ],
        [
            "",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***",
            "**",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***",
            "**",
            "*",
            "***",
            "*",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***"
        ],
        [
            "2",
            "0.17",
            "0.28",
            "0.61",
            "0.23",
            "0.79",
            "0.13",
            "0.62",
            "0.27",
            "0.17",
            "0.17",
            "0.38",
            "0.44",
            "0.6",
            "0.21",
            "0.53",
            "0.89",
            "0.13",
            "0.29",
            "0.21",
            "0.36",
            "0.3",
            "0.43",
            "0.2",
            "0.45",
            "0.48",
            "0.31",
            "0.2",
            "0.13"
        ],
        [
            "",
            "***",
            "***",
            "***",
            "**",
            "*",
            "***",
            "",
            "***",
            "***",
            "***",
            "***",
            "***",
            "*",
            "***",
            "",
            "",
            "**",
            "",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***"
        ],
        [
            "3",
            "0.15",
            "0.26",
            "0.51",
            "0.21",
            "0.75",
            "0.12",
            "0.54",
            "0.24",
            "0.15",
            "0.16",
            "0.35",
            "0.39",
            "0.57",
            "0.19",
            "0.46",
            "0.81",
            "0.13",
            "0.28",
            "0.2",
            "0.31",
            "0.25",
            "0.36",
            "0.17",
            "0.38",
            "0.42",
            "0.3",
            "0.18",
            "0.12"
        ],
        [
            "",
            "***",
            "***",
            "***",
            "***",
            "*",
            "***",
            "",
            "***",
            "***",
            "***",
            "***",
            "***",
            "*",
            "***",
            "",
            "",
            "**",
            "",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***",
            "***"
        ]
    ],
    "pageTitle": "Wages and working conditions in the crisis | Eurofound",
    "title": "Table A2: Estimates of country intercepts in multinomial model of types of crisis outcomes – type L",
    "url": "http://www.eurofound.europa.eu/observatories/eurwork/comparative-information/wages-and-working-conditions-in-the-crisis",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00162-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 436565979,
    "recordOffset": 436497466,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{84246=Section 1 describes of the main wage trends in EU countries in the period 2008–2010. Attention is paid to the wage evolution and, to a lesser extent, wage inequality and the use of variable pay. When available, national data are presented according to individual characteristics such as gender, age, type of employment contract and occupation., 87748=2010, 235378=A collective labour agreement was concluded on 1 April 2010 in the Dutch Horeca sector. This was four months later than planned because negotiations proved quite difficult as the employers’ side could not come to an agreement. In the Netherlands, wages in the Horeca sector slumped during the past decade. Between 2001 and 2009, wages have risen by only 21% compared with 27% in all other sectors. The trade unions’ demand was for a pay rise in 2010 and 2011 but, during the negotiations, it became clear that the employers were not prepared to award any pay rise at all. In the end, an agreement was concluded whereby no rise was foreseen in 2010. Initially, a 1% rise was agreed for 2010 but this was changed to a different proposal, that is, 0.75% in January 2011 and 1% on 1 July 2011. The trade unions were prepared to agree this wage moderation because they wanted to give some more breathing space to those employers facing financial difficulties. The same scenario is happening again for the new agreement (2012–2013). The trade unions are prepared to show some moderation but want a guarantee that wages will follow inflation. The employers want to change the whole method of wage increases by linking any rises (even when corrected for inflation) to a performance assessment whereby, if an employer does not carry out the assessment in the allotted period, the worker should receive a 3% pay rise. The precise content of the 2012–2013 proposals is not yet known., 263432=Given the long-term EU2020 commitments to fight poverty and to get more people into quality jobs, the results from this study are worrying., 228913=According to the 2011 working paper ‘Collective bargaining and balanced recovery: The case of Austria (547Kb PDF)’ from the International Labour Office (ILO), a total of 60 companies encompassing more than a quarter of all employees in the electronics sector qualified for the clauses and were allowed to increase wages by only 1.4%., 85862=The reports from the national correspondents document the key official sources on wage information for their country. These sources contain the most appropriate information on workers’ wages, in contrast with the commonly gathered information on wage costs or wage information derived from national accounts that also include company payments for social benefits. It is important to compare the information in the national reports and EU statistics from DG ECFIN’s annual macroeconomic database (AMECO). This study looks specifically at what happened in 2009 and 2010, the two main years following the beginning of the credit crisis., 228374=The Austrian electronics sector is another example. In 2009, the collective agreement included a system of hardship clauses (Konjunkturklauseln) that offered companies in extremely difficult economic situations a reduction in wage increase from 2.2% to 1.4%. To apply these hardship clauses, a company had to:, 93440=The maps in Figures 1–3 summarise the data for 2009 and 2010, and classify the countries in terms of the amount of wage growth., 249433=The UK is the only country that limited the minimum wage for younger workers in order to boost employment for this category of the unemployed. Finland discontinued a temporary financial support system for enterprises hiring low-income and older workers on the basis of a study showing a negative assessment of the results. Portugal had put in place a series of measures aiming at maintaining employment in sectors and companies at risk (namely, reducing social security contributions for older workers, subsidising training initiatives in specific sectors), but it ended these initiatives by the end of December 2010 in an effort also intended to further cut public spending., 266855=Hayter, S., Fashoyin, T. and Kochan, T.A. (2011), ‘Collective bargaining for the 21st century’, The Journal of Industrial Relations, Vol. 53, No. 2, 2011, pp. 225–247., 131894=In Horeca, as in 2009, a variety of patterns emerge, although an employment decrease is most frequently observed. This sector did not seem to suffer much in this period in Denmark, Germany, Hungary and Norway., 124810=The series of maps in Figures 4–8 depict the main effects of the crisis in each Member State, for which data are available, on the five different sectors studied in the two years following 2008 in terms of:, 128399=The picture for construction is similar (Figure 5), although there is no change in either nominal wages or employment in four countries in 2009 (the Czech Republic, Poland, Slovakia and Sweden)., 95923=The data on average nominal wage growth in Figure 1 show that the freezing of wages is the dominant pattern. Only two countries (Latvia and Lithuania) had average wage cuts in 2009, being joined in 2010 by Greece and Ireland. Poland, Slovakia, Slovenia and Norway are the only countries with a persistent wage growth on average., 136781=In Ireland, more recent data are available which show an increase in the Gini coefficient from 30.7 in 2008 to 33.9 in 2010, and a similar rise in the income quintile share ratio, that is, the ratio between the total income received by the 20% of the population with the highest income and that received by the 20% of the population with the lowest income (also known as S80/S20)., 181173=The same phenomenon was observed in Slovakia, a country where 26% of the workers enjoyed a growing income but 16% had to cope with declining pay. Data from the EWCS on the number of hours worked in that country suggest that, in 2010, the wages decline in Slovakia correlated strongly with the decrease in the number of hours worked., 79408=In response to the problems posed by the financial and economic crisis, the European Commission has put forward a series of new policies better known as ‘European economic governance’. As emphasised in the Euro Plus Pact (166Kb PDF), wages and collective bargaining systems are seen as one of the main instruments for the European coordination of economic policy and wage developments should be in line with developments in labour productivity. At the same time, the commitments to the Europe 2020 strategy are reconfirmed. Making work more attractive or enhancing job quality are among the Europe 2020 commitments. The report examines how these two policy goals have been combined in Member States in the current period of economic crisis., 247257=Recent information from the Institute for Employment Research (IAB) panel study reveals that about 1%–2% of all companies in Germany adopted this kind of agreement in 2009; the proportion rose to 15% in companies employing 100–250 people and to 30% in companies employing more than 500 people. The number of companies with a PEC increased by 50% between 2006 and 2009, that is, from 1.2% to 1.7% (Bellmann and Gerner, 2012a)., 111891=Very few data are available on working time regimes. In Belgium, France, Latvia and Spain, full-time workers earned more relative to part-time workers in 2009 compared with 2008. However, this pay gap diminished in Austria, Finland, Germany, Malta, the Netherlands, Slovakia, the UK and Norway., 178882=A report on employee attitudes to pay in 2011 by the Chartered Institute for Personnel and Development (CIPD) in the UK found that the net satisfaction score among those who received a pay rise in 2011 was +56 (net scores refer to the proportion of people agreeing with a statement minus those disagreeing). The net satisfaction score among those who received a pay freeze was -41, down from -26 in the 2010 survey and -23 in the 2009 survey. The main reasons given for dissatisfaction were that:, 95364=Figure 3: Real average wage growth by country, 2009 and 2010 (AMECO), 138137=Every aggregate figure is the result of decisions made by micro-level units. To obtain an insight into the company-level decision-making process, the ECB’s Wage Dynamics Network undertook a company survey in 2008–2009 addressed at managers. Although mainly based on pre-crisis data, the survey’s findings indicate that when companies cut costs in reaction to an economic shock, cutting wages is an exceptional practice. Even then, the cuts will mainly affect the variable part of wages (for example, compensation for overtime or a change in shift assignments) and the reduction or elimination of certain wage components outside laws or collective agreements (for example, bonus payments and fringe benefits). More often, labour costs are reduced through changes in employment levels. Stopping recruitment overcomes the issue of training entrants and cutting temporary employment can be a response to lower demand. Other options are to increase prices, decrease margins or cut non-labour costs., 145643=Previous research by Babecký et al (2010) on the data obtained from the 2007–2008 wave of the survey investigated the reasons why companies do not opt for a strategy of wage cuts and put forward the following arguments., 234266=After three consecutive years in crisis, the Bulgarian government froze wages in all budget agencies (state and municipal offices) and proposed the introduction of a new pay system for Bulgarian state employees from the beginning of 2012. Wages will be maintained at their existing levels but any increases will depend on the specific performance of employees, which will be evaluated periodically. The model of pay in Bulgaria’s public administration sector is such that there will be a basic monthly remuneration that will be a fixed rate (70% of fixed gross wage and 30% of bonuses). Employees will be evaluated annually for wage increases and quarterly for additional bonuses or extra incentives. This new model of payment in the state administration was fully supported by employers’ organisations in the National Council for Tripartite Cooperation (NCTC), but trade unions expressed concerns about the emergence of subjectivity in the assessment of employee performance. They therefore suggested that the new system should be introduced initially as a pilot scheme in only a few departments., 224517=After all, the EU2020 strategy proclaims ‘inclusive growth’ (that is, ‘fostering a high-employment economy delivering economic, social and territorial cohesion’)., 128129=In 2009, manufacturing was hit by restructuring and downsizing in almost the entire EU. In Figure 4, employment decreases (type L) are evident in 17 countries (see also Table 7). In six countries, the crisis also involved nominal wage decreases (LW)., 170437=Criticism of Herzberg’s theory emerged initially because it was based on a survey among employees with higher levels of educational attainment. A similar survey among unskilled workers (let alone the working poor) yielded other results, as surveys cited in several of the country reports clearly demonstrate. A 2004 study on job satisfaction in Finland (202Kb PDF) by the Research Institute of the Finnish Economy (ETLA) examined determinants of job satisfaction using Finnish data from the European Community Household Panel (ECHP). According to these results, higher wages increased job satisfaction even when controlling for a host of other factors. The ETLA study also found that a loss of income due to involuntarily having to work part time had a strong negative effect on job satisfaction., 160962=The question arises as to how well the shifts in employment fit with the evolution of wages. Figure 9 shows the clustering of the five patterns of change along the dimensions of nominal and real growth during the Great Recession, 2009–2010. As might be expected, the wage growth figures of the downgrading pattern of change are partially situated below the zero line, and on average, lower than all the other types. The upgrading and the hybrid upgrading/polarisation patterns of change generally stay above a real wage freeze, but the effect is not universal and not definitive. In addition, the polarisation pattern of change has the largest variation and so, in order to interpret the wage evolution in terms of employment shifts, there should be differently skewed income distributions over all occupations., 162052=Figure 9: Nominal and real growth by pattern of job change during 2009–2010, 203772=Source: EWCS 2010, own calculations, 172822=In Austria, information on wages and job satisfaction during the crisis is available through the Work Climate Index (Arbeitsklima Index), a measure of economic and social change from the point of view of employees compiled regularly by the Chamber of Labour (AK). The index explores assessments concerned with society, companies, work and future expectations, and thus records subjective perspectives. It is representative of all Austrian employees and is based on quarterly surveys. The index shows that Austrian employees were less satisfied with their income in 2010 than they were in 2000: 65% reported being ‘(very) satisfied’ with their income in 2000 while 58% were ‘(very) satisfied’ in 2010. However, between 2006 and 2010 the share of employees being ‘(very) satisfied’ rose from 59% in 2006 to 61% in 2007, falling to 59% in 2008 before rising again to 60% in 2009. As noted in the September 2010 issue of the Arbeitsklima Index newsletter (in German), these figures indicate that the crisis did not have a negative influence on employees’ satisfaction with their income. However, the crisis did have an influence on employees’ optimism about future economic developments. The share of employees looking toward to the future with optimism amounted to 83% in 2007, decreased to 72% in 2008 and was only 61% in 2010. This somewhat pessimistic view is confirmed by the responses described in the March 2011 issue of the Arbeitsklima Index newsletter (in German) to a question about how easy it would be to find a new and acceptable job: 52% in 2008 believed that it would be ‘(very) easy’ to find a new job but this share had fallen to only 45% at the end of 2010., 194275=Source: EWCS 2010, own calculations, 87710=2009, 135793=In Belgium, the d9/d1 ratio was 2.3 in 2009, which is not fundamentally different from the years before. The same stable inequality appears in France at a slightly higher level of about 2.9 and in Luxembourg at around 4.2. In Italy, wage dispersion, as measured by the Gini coefficient (indicating the variation in the distribution of incomes from a perfectly equal distribution), remains stable at a level of 25%. In this case, however, there is information on wage inequality within occupational groups; recently there has been decreasing wage dispersion among managers and clerks and increasing wage dispersion among blue-collar workers., 106511=2008, 171421=The International Social Survey Programme (ISSP) survey on Quality of Working Life was carried out in 2006 by two Czech research centres on a sample of 2,043 employed people aged over 15 years (CZ0901019D). Data from the survey imply that at least two-thirds of respondents regarded their income level as ‘definitely important’ and a further 28.7% of respondents as ‘rather important’. It can therefore be concluded that income level seems to have a significant direct influence on job satisfaction in the Czech Republic., 174723=The Bulgarian Working Climate Index study, a national representative survey carried out by Institute for Social and Trade Union Research (ISTUR)/the Confederation of Independent Trade Unions in Bulgaria (CITUB) in November–December 2010, revealed a moderately strong relationship between the dynamics of wages in the last year and job security: 59.5% of respondents experienced no pay increase in 2010 compared to 2009, whereas 23.4% received lower pay and 17.1% higher pay. Of the respondents with increased wages, 59.5% were positive about keeping their job, 22.9% had negative expectations and 17.6% were not sure. At the opposite end, only 41.4% of those declaring a reduction in wages were optimistic about keeping their job, 43.2% declared their job was at risk and 15.4% were not sure., 175610=In Spain, some interesting information on the issue refers to the evolution of the general average satisfaction of Spanish workers with their pay conditions. According to data from the annual Spanish survey on quality of life at work (in Spanish), there is an increasing dissatisfaction with pay among Spanish workers: on a scale from one to 10, the average level of satisfaction was 6.2 in 2006 and 5.8 in 2010. In particular, 2010 recorded a remarkable downward trend in comparison with the previous two years. This decreasing level of satisfaction applied to both men and women; it extended to all professional situations but was especially relevant among employers (both with and without employees). Employees in the private sector also had a more negative perception of their salary than those in the public sector. It is difficult to establish a link between decreasing levels of satisfaction with wages and the economic crisis. From a tentative, common sense perspective, it could be argued that workers (especially salaried ones) currently have two opposing perceptions about their salary. On one hand, they are increasingly dissatisfied about the wage moderation experienced in the last two years but, on the other hand, (many) workers may feel that, compared with unemployed people, they still have a job and receive an associated wage (though not in all cases) and so there is limited scope to complain., 185326=In Ireland, the economic hardships had a completely opposite effect. The Mercer ‘What’s Working’ survey, conducted between the final quarter of 2010 and the second quarter of 2011, attempted to measure the impact of the current crisis on company performance and employee morale. The survey found that far fewer Irish workers today:, 259002=The general picture is, however, the same everywhere. From a managerial point of view, there has to be a balance in all cost-saving measures between protection measures with a longer-term perspective aimed at maintaining employment and high-skilled labour, and those measures aimed at immediate cost reductions, such as the temporary abolishment of some bonuses or the dismissal of a cohort of workers. In the harsh economic climate during 2008, running into 2009 and 2010, many concessions seem to have been made by the trade unions in favour of employment guarantees. Notwithstanding a few exceptions, these concessions were rather unsubstantiated and far from concrete., 256768=In the course of 2008–2010, measures leading to pay cuts or pay freezes in one form or another on a national, regional, sectoral or in-company level were a common tool to counteract the effects of the economic crisis. Other interventions were also observed, such as reducing training opportunities, but these were rather an exception. A striking feature is that, by far, most measures were adopted on a temporary basis. This fits with the observation that the economic crisis in 2008–2009 was deep, unexpected and considered to be of a short duration. Governmental agencies, sectoral bodies and enterprises seem to have responded very quickly to the sudden economic downfall and to have focused on straightforward approaches., 182640=Although the research project ‘Our society’ of the Public Opinion Research Centre (CVVM) found that job satisfaction in the Czech Republic has declined in recent years, the growing insecurity in the labour market was reflected in employees’ unwillingness to leave their current job. While the share of workers who felt significantly undervalued in terms of pay and were considering a job change grew significantly between 2006 and 2008, their number fell substantially in the period to 2011. The only group of employees who were considering leaving their job more often than in previous times were the ones who considered their remuneration adequate. The national report assumes that such people are primarily in higher and specialised posts and do not feel threatened by the current labour market situation (Figure 10)., 136453=In Germany, the d9/d1 ratio was stable at around 3.3 until 2008 but is estimated to have increased lately. In Estonia, no figures after 2008 have been published but there seems to be a trend of rising wage inequality due to more people returning to education and an increasing percentage of low-paid workers., 266234=Erikson, R., Goldthorpe, J.H. and Portocarero, L. (1979), ‘Intergenerational class mobility in three Western European societies: England, France and Sweden’, British Journal of Sociology, Vol. 30, No. 4, 1979, pp. 341–415., 104645=Notes: *So far in 2009; **Expected for 2009. See Annex 2 for a full list of country codes., 162321=Note: A prime symbol after the country code indicates 2010 data. See Annex 2 for a full list of country codes., 105874=Between 2008 and 2009, the gender pay gap was shrinking in most countries (represented by the minus signs in Table 4) with Bulgaria, Hungary, Latvia, Romania, Slovakia and Spain the sole exceptions., 113048=The plus (increasing) and minus (decreasing) signs in Table 5 show the direction of the trend in 2008, 2009 and 2010., 131420=Although there is less information for 2010, a similar pattern is apparent (see Figures 4–8 and Table 8). The number of countries for which data are available ranges from 14 to 18 depending on the sector of activity., 96271=Findings differ for real wage growth according to the data source. In 2009, the figures from the national reports (Figure 2) are more positive than the AMECO calculations (Figure 3) but, in 2010, it is the opposite. AMECO sketches a dominant picture of freezing of the average wage in both years, with the exception of real cuts in Hungary, Latvia, Lithuania and Romania in 2009 and Greece, Hungary, Latvia and Romania in 2010. The data from national reports still show a picture of an average real positive wage growth in 2009 with the exception of Latvia and Lithuania. By this time the west European countries belonging to the euro zone already show a trend of freezing wages. The 2010 data from the national reports show a consistent pattern of average wage cuts in the majority of countries for which data are available., 139150=For a limited number of countries, the survey was repeated in 2009, taking into account the first phase of the crisis. Only 1.2% of the managers surveyed in the nine countries and three sectors covered in this study (manufacturing, trade and market services) suggested that cutting base wages was a common strategy used during the Great Recession of 2008–2009 (Table 9)., 75586=The economic and financial crisis of 2008–2010 has impacted on pay in most EU Member States leading to wage deceleration, pay freezes and sometimes pay cuts. The crisis hit vulnerable groups (low-skilled, young, migrants) particularly hard. Data from five key sectors (manufacturing, construction, accommodation and food services, financial services, public administration) reveal more crisis effects on employment than on wages. Cuts in low-paid and temporary jobs, or reductions in their hours, tended to be the first measure adopted while the ‘wage cushion’ often seen in higher-ranking jobs allowed cost savings through cuts in bonuses and other rewards. Cutting wages is also seen as detrimental to worker motivation and retention. Most responses taken were temporary with few trade-offs at company level between wages and other elements of the employment relationship., 230425=In order to make employment more financially attractive for low-wage earners and to increase the gap between wages and unemployment benefit, the fiscal and para-fiscal pressure on low wages has been further reduced in Belgium. For a minimum wage of €1,415 a month, employees are granted a 100% cut in their personal social security contributions. These contributions increase gradually thereafter to achieve a level equal to the regular rate of 13.07% for monthly wages in excess of €2,247. The Belgian government has also decided on a direct increase of €120 per year in the net wage to the minimum wage level of €1,415 per month. This increase is being implemented via a new tax credit equal to a fixed percentage of the actual reduction in personal social security contributions. The tax credit is steadily reduced until a monthly wage of €2,247 is achieved. With a view to achieving a direct net effect on monthly remuneration, an impact on the payroll tax is anticipated, starting in April 2011. A budget of €30 million in 2011 and €40 million in 2012 has been earmarked for the purpose., 132123=In financial services, the decrease in employment continued in 2010, but with fewer cases of wage decline (the Czech Republic, Latvia, Lithuania and Romania only)., 267593=Rose, M. (2001), Disparate measures in the workplace: Quantifying overall job satisfaction (6.77Kb PDF) (conference presentation), 5–7 July 2001, British Household Panel Survey (BHPS) Research Conference, Colchester., 80810=The report covers mainly the first phase of the crisis, that is, the financial or credit crisis followed by the first abrupt economic downturn. In 2008, a worldwide crisis set in following the crisis in the housing sector in the USA (the credit crisis). At about the same time, EU Member States such as Ireland and Spain were trapped by a stimulating monetary policy in the euro zone, which caused overheating of their economies (also from the housing sector). The crisis in the international financial sector followed that in construction and real estate as many banks now held worthless shares in funds derived from the housing market. Countries intervened through nationalisation of banks or state bank guarantees to prevent a collapse of the financial system and to limit the effect of the financial crisis on other sectors., 267049=Herzberg F. (2003), One more time: How do you motivate employees?, Harvard Business Review, Vol. 81, No. 1, 2003, pp. 87–96., 81658=Some countries (for example, Belgium and Germany) recovered quickly from the first crisis mainly as a result of a growing demand from emerging economies, although most countries did not succeed in dealing fully with the impact of the crisis in the following years. Initially Greece appeared to mask its real economic state, which put pressure on the euro. As a consequence, other Mediterranean countries and Ireland became targeted by investors in government bonds. As interest rates rose, the economic outlook of the whole of Europe worsened – causing what is termed the ‘debt crisis’. However, this 2011 crisis is not included in this report as there is generally a delay of at least a year after events in the availability of data from administrative sources and academic publications on wages. Therefore, this report focuses on the 2008–2009 crisis (the Great Recession) and the aftermath up until 2010, although anecdotal evidence from 2011 is included in the policy discussion., 247734=Evaluations of the pre-crisis period showed mixed results in terms of employment savings, that is, positive results in the short term, negative results in the medium term and positive results again in the longer term (Hübler, 2005). ‘Internal’ flexibility (in pay, teamwork or job tasks) seemed to be the key characteristic to avoid ‘external’ flexibility (Massa-Wirth and Seifert, 2005). The companies with PECs were also not providing more training (Bellmann and Gerner, 2012b). In other words, PECs seemed to be primarily a bargaining concession designed to contribute to a direct and short-term company stabilisation (of jobs). Therefore, it is perhaps no coincidence that, in their recent evaluation of the PECs in the 2008–2009 crisis, Bellmann and Gerner (2012a) demonstrate a clear employment effect, concluding that the agreements clearly reduced the negative employment effects of the crisis in those companies affected by it., 267918=Sousa-Poza, A. and Sousa-Poza, A.A. (2000), ‘Well-being at work: a cross-national analysis of the levels and determinants of job satisfaction’, Journal of Socio-Economics, Vol. 29, No. 6, 2000, pp. 517–538., 144362=Source: Fabiani et al (2010, Table 7), 131741=In construction, a limited number of countries escape the crisis, though these are different from the ones in 2009 apart from Sweden., 180765=Data from the fifth EWCS report show that 60% of the individuals in Spain who had suffered a reduction in working time in the course of 2010 had to cope with a corresponding salary decrease; for 27% of them salary was maintained and the remaining 13% even managed to acquire a pay increase notwithstanding the fact that they actually worked less., 266483=Fabiani, S., Lamo, A., Messina, J., and Rõõm, T. (2010), Firm adjustment during times of crisis (conference presentation), 7th ECB/CEPR Labour Market Workshop, Unemployment developments after the crisis, 16–17 December 2010, Frankfurt am Main, Germany., 179755=Not only employees but also employers dread a negative impact of pay limitations on the motivation and loyalty of employees. A 2011 working paper on how firms adjust in a crisis (417Kb PDF) by the Central Bank of Luxembourg based on WDN surveys indirectly makes reference to the relationship between wage changes and employee satisfaction. The survey asked respondents to identify obstacles to possible wage cuts. Some of the major obstacles identified by companies were the fear of reducing workers’ level of effort and morale (different from the notion of job satisfaction), hence lowering the quantity and quality of output., 267200=Hübler, O. (2005), ‘Sind betriebliche Bündnisse für Arbeit erfolgreich?’, Jahrbücher für Nationalökonomie und Statistik, Vol. 225, No. 6, 2005, pp. 630–652., 244094=A Danish manufacturing enterprise put in place a number of arrangements involving its employees in order to manage the economic situation during the crisis. The enterprise’s first proposal was a nominal reduction in pay of approximately €6.70 (DKK 50) per hour, which was rejected by the employees and the trade union. After lengthy negotiations, the employees accepted a savings package in 2010 which consisted of a wage freeze until 2013, a reduction in bonuses and variable pay, and an end to employer-paid health insurance, physiotherapist, chiropractor and massage therapist. The previously full-time health and safety representative was given other job functions and the position of health and safety representative was deemed secondary., 177113=In France, there is no systematic analysis of the relationship between job satisfaction and the evolution of wages and salaries. A survey on working conditions (in French) by a polling company conducted among 903 French employees in March 2009 showed that a majority (89%) were happy with their working conditions despite the upcoming crisis. Some 68% replied that their working conditions had not deteriorated over the previous six months. Only around a quarter of the surveyed employees (24% of the managers and 21% of the employees) reported a shift in the opposite direction – in particular an increase in stress levels and work pressure, and pay freezes, and to a lesser extent, a decline in the social climate at work (rising tensions between colleagues) and customer relations. A quarter (25%) feared a worsening of their working conditions in the months to come, the most prominent fear being to be laid off (61%)., 137181=In Latvia, even though dispersion is hampered by downward pressure on wages because of the crisis, the d9/d1 ratio in the public sector rose from 8.7 to 10.7 between 2008 and 2010, one explanation being an increasing share of low-paid work. A similar trend is found in Lithuania. An expansion of low-paid work in Poland is a trend that preceded the crisis but which continues to push inequality. In Portugal, however, the rising inequality is said to stem from a sharp rise in the income of the upper quintile., 132569=In summary, the impact of the crisis seems much more sector-specific in 2010 than in 2009. Nevertheless, Lithuanian employment and wages are again affected in all sectors and, in each sector, more than half the countries show a decrease in employment., 311146=COORDINATING THE NETWORK OF EU AGENCIES 2015 - read more, 132306=Finally, public administration seems to have been hit with some delay in many countries, as the total of countries showing stability/growth (type O) has shrunk from 13 out of 23 where data are available in 2009 to four out of 15 cases in 2010., 125890=Figure 5: Effects of the crisis in construction sector, 2009 and 2010, 127588=Figure 8: Effects of the crisis in public administration sector, 2009 and 2010, 113930=The report deals with the more robust aggregate wage inequality figures later, but concludes for now that a stretch of the wage distribution in both directions (for example, in Austria, Hungary, Spain and Sweden) was uncommon in the immediate post-crisis period. There is too little information available to make any general conclusion about 2010., 266001=Bellmann, L. and Gerner, H.-D. (2012b), ‘Further training and company-level pacts for employment in Germany’, Jahrbücher für Nationalökonomie und Statistik, Vol. 232, No. 2, 2012, pp. 98–115., 265520=Babecký, J., Du Caju, P., Kosma, T., Lawless, M., Messina, J. and Rõõm, T. (2010), ‘Downward nominal and real wage rigidity: Survey evidence from European Firms’, Scandinavian Journal of Economics, Vol. 112, No. 4, 2010, pp. 643–920., 186184=Slightly more than one in three (35%) of Irish workers was reported to be seriously considering leaving their organisation in 2011, up sharply from 22% in 2004., 188740=The question about changes in pay in the EWCS is as follows: ‘If you compare your current situation with that of January 2009, have you experienced a change in your salary or income?’. The possible answers are: a decrease, an increase or no change. The latter two options were interpreted for this analysis as stable or improved pay, while the first option was taken to refer to pay reduction. Note that this can reflect a reduction in the basic pay, other components of pay, a reduction in working hours, or combinations of these items., 167804=However, the European Working Conditions Survey (EWCS) contains some questions that may shed some light on this relationship. These findings are reported in the second half of this section. As highlighted in the previous section, companies reacted to the crisis mainly with changes in employment (job cuts or working time reduction) and what can be generally called wage moderation. Strong intervention in wages was not a dominant practice. Data from the fifth EWCS in 2010 allow for a more detailed investigation of the types of employees who are more or less confronted with the challenge of income reductions and increased job insecurity (or both)., 243452=The Czech national air carrier, Czech Airlines (ČSA), has suffered long-lasting financial difficulties. In 2009, the company planned to dismiss up to 200 people if employees did not accept a wage cut. However, a direct reduction of wages was blocked by an existing three-year collective agreement. This set out a wage increase of one percentage point above inflation in 2009, which stood at 1.2% in June 2009. The trade unions and ČSA management discussed the issue of a wage cut for a number of weeks and the pilots finally agreed to a 6.5% wage cut in order to save jobs., 178194=Dutch workers have been hardly touched by the economic crisis, with wages still showing some upward movement and employment staying at the high levels seen before the crisis. According to statistics (in Dutch) from the Netherlands Institute for Social Research (SCP), working conditions were not an issue in the studied period. The percentage of employees satisfied with their working conditions was 77% in 2010 compared with 73% in 2007. Experiences of work-related stress, the number of accidents at work and physical demands remained quite unaffected by the economic crisis., 159448=In the 2011 Eurofound report Shifts in the job structure in Europe during the Great Recession, composition changes are measured through a so-called job distribution. This is an ordering of occupations in five groups according to the wage quintile to which the occupations belong in the base year. The next step is to examine the changes in employment levels for these clusters of occupations., 86598=Table 2 sets out the country trends for these years (precise data are given in Annex 1 to this report) in relation to wage deceleration, that is, an average actual nominal wage growth lower than the year before. The table shows that wage deceleration took place in almost all EU Member States in 2009, with the notable exceptions of Denmark, France and Greece. In 2010, the pace of wage growth continued to decrease in about one third of the countries (Bulgaria, the Czech Republic, Denmark, Greece, Finland, Hungary, Ireland, Luxembourg and Poland, Romania, Slovakia, Sweden and the UK). This figure is influenced by the strength of wage growth during the upward business cycle of 2008., 127016=Figure 7: Effects of the crisis in financial services sector, 2009 and 2010, 77999=The current financial and economic crisis has put increased pressure on workers’ wages in most countries of the European Union (TN1109060S). This pressure has been highlighted in recent negotiations and agreements at national, sector and company level in which wage moderation, pay freezes or cuts have been agreed. However, forms of wage moderation, pay freezes or pay cuts have been agreed in some cases in an attempt to limit the negative impact of the crisis on other working conditions such as job security, employment guarantees and better access to training. Furthermore, limited wage increases have been observed in some economic sectors while other sectors and companies have experienced pay freezes or pay cuts. As highlighted in the note Assessing the links between wage setting, competitiveness and imbalances (511Kb PDF) from the European Commission Directorate General of Economic and Financial Affairs (DG ECFIN) to the Economic Policy Committee in July 2011, these wage developments have also come to the forefront of discussions on how to tackle the current macro-imbalances., 162466=Source: Wages and employment data from the national contributions, patterns from the 2011 Eurofound report Shifts in the job structure in Europe during the Great Recession, 186841=Micro-level data from the fifth EWCS in 2010 makes it possible to investigate different types of consequences depending on the impact of the crisis on job security and wages. The comparative exercise below shows which scenario is most common in which countries. This is followed by a discussion of vulnerable groups and their relative risk of facing a wage cut, job insecurity or both simultaneously at aggregate, EU27 level., 125323=Figure 4: Effects of the crisis in manufacturing sector, 2009 and 2010, 193904=Figure 11: Labour conditions consequences of the crisis (employees only), 2010, 181525=The Bulgarian Working Climate Index reveals a relationship between the dynamics of wages and satisfaction with the daily hours of work. In the group of respondents who experienced a wage increase in 2010, 85.7% were satisfied with their working time arrangements, 7.1% were negative on the issue and 7.2% undecided. The shares obtained for the cohort of workers whose pay decreased in 2010 were 69.9%, 19.1% and 11.0%, respectively., 126456=Figure 6: Effects of the crisis in Horeca sector, 2009 and 2010, 94163=Figure 1: Nominal average wage growth by country, 2009 and 2010 (%), 255601=In Spain, the most important recent policy initiative intended to support the situation of the most vulnerable groups of workers is the Labour Reform passed in June 2010 by the Spanish government. For more vulnerable groups of workers, one part of the reform refers to the promotion of employment of young and unemployed people. The most important issue raised under this heading is the reallocation of tax benefits for employers for the recruitment of individuals at high risk of unemployment. The benefits defined after the reform are per year for a period of three years, as follows:, 164045=For example, Belgium is traditionally a highly unionised country and does monitor the evolution of collectively agreed wages. Looking at wage trends during the crisis, a decrease in wage drift can be seen, indicating that a safety margin for wages was built up in an upward business cycle to be compressed during a downturn. Together with composition shifts, this caused wage drift to be negative at the aggregate level in 2008 and 2009, and limited in 2010. Germany follows the same line of reasoning, but anticipates a steep increase in wage drift in 2011. In the Czech Republic, a different trend is found: collective bargaining safeguards wage growth in those companies where negotiation takes place. Here wage drift did not decrease during the crisis, although this is an artificial effect as fewer agreements were reached because of the crisis., 183988=In Norway, the financial crisis and economic uncertainty has led more than a third of employees to be more loyal to their employers than ever before. This finding is revealed in the 2010 edition of a global workplace survey called the Kelly Global Workforce Index (316Kb PDF) which obtained the views of around 134,000 employees worldwide, including about 2,000 in Norway and was conducted between October 2009 and the end of January 2010. The survey revealed that 35% of Norwegian workers believed the financial crisis had made them more loyal to their employers, 4% responded that they were less loyal and 61% said the crisis had not made any difference. The impact of economic uncertainty was greatest among older workers (aged 48–65 years), among whom 38% said they had become more loyal compared with 36% of those aged 18–19 years and 33% of those aged 30–47 years. Surprisingly, pay was not the main reason for employees feeling more loyal than before. In response to the question, ‘what factor would make you more committed or engaged in work,’ only 14% stated that higher wages or better benefits were critical, with 35% % giving ‘more interesting / challenging work’ and 31% ‘more or improved job training’ as the two main reasons., 113185=In 2009, the pay gap in the high/mid and the mid/low categories rose in about half the countries and shrunk in the others. Comparison of the wage inequality trend between the mid/low-paid occupations with the high/mid trend shows a mirroring pattern in many countries; for example, the low-paid occupations earned relatively less in Belgium in 2009 while the top-paid occupations moved towards the median wage occupation category, implying less wage inequality in the upper part of the wage distribution. The same pattern is found in Cyprus, Germany, Ireland, Romania and Norway. The opposite pattern (a stretched wage distribution from the top incomes) is found in Bulgaria, the Czech Republic, Finland, Slovakia and the UK., 97193=A company survey carried out by the Wage Dynamics Network (WDN) of the European Central Bank (ECB) included questions on the company’s capacity to deal with an adverse ‘demand shock’; a demand shock is a sudden surprise event that temporarily increases or decreases demand for goods or services. The survey was held in 12 EU countries covering a total of 11,918 companies in 2007–2008 and repeated in mid-2009 in nine countries. Table 3 presents data from those nine countries where both waves of the survey took place., 265801=Bellmann, L. and Gerner, H.-D. (2012a), ‘Company-level pacts for employment in the global crisis 2008/09’, The International Journal of Human Resource Management [in press]., 168660=A Eurofound study from 2006 on Mesuring job satisfaction in surveys demonstrated that a myriad of factors can influence job satisfaction., 268303=Sem Vandekerckhove, Jan Van Peteghem and Guy Van Gyes, HIVA-KU LEUVEN, 94767=Figure 2: Real average wage growth by country, 2009 and 2010}",
    "lastModified": "Fri, 31 Jul 2015 09:20:39 GMT",
    "textBeforeTable": "Because the crisis has affected different economic sectors differently, the report takes a sectoral approach at different points by adopting the broad statistical classification of economic activities in the European Community, NACE Rev. 2 (5.63Mb PDF), set out in Table 1. Some countries (for example, Belgium and Germany) recovered quickly from the first crisis mainly as a result of a growing demand from emerging economies, although most countries did not succeed in dealing fully with the impact of the crisis in the following years. Initially Greece appeared to mask its real economic state, which put pressure on the euro. As a consequence, other Mediterranean countries and Ireland became targeted by investors in government bonds. As interest rates rose, the economic outlook of the whole of Europe worsened – causing what is termed the ‘debt crisis’. However, this 2011 crisis is not included in this report as there is generally a delay of at least a year after events in the availability of data from administrative sources and academic publications on wages. Therefore, this report focuses on the 2008–2009 crisis (the Great Recession) and the aftermath up until 2010, although anecdotal evidence from 2011 is included in the policy discussion. The report covers mainly the first phase of the crisis, that is, the financial or credit crisis followed by the first abrupt economic downturn. In 2008, a worldwide crisis set in following the crisis in the housing sector in the USA (the credit crisis). At about the same time, EU",
    "textAfterTable": "% Employees 2007 2009* 2009** 2007 2009 (past) 2007 2009* 2009** 2007 2009 (past) AT 1.54 1.72 1.51 0.06 1.23 9.30 1.76 8.43 5.71 1.07 BE 2.87 1.04 1.76 0.20 0.27 15.89 23.72 4.41 2.39 14.58 CZ 9.32 8.95 3.24 1.13 3.71 31.39 54.63 11.72 11.95 49.13 EE 3.68 44.08 38.61 0.14 30.35 21.27 61.54 64.61 9.60 56.94 ES 0.14 2.55 0.52 0.03 1.35 1.45 26.68 3.73 0.80 22.21 FR 2.54 1.92 4.73 0.86 1.21 7.68 85.98 83.77 5.27 82.48 IT 0.68 2.03 4.29 0.06 1.14 3.81 31.71 62.77 1.25 30.86",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}