{
    "relation": [
        [
            "Patent application number",
            "20130180474",
            "20130180696"
        ],
        [
            "Description",
            "FLOW CONTROL DEVICES AND METHODS FOR A ONCE-THROUGH HORIZONTAL EVAPORATOR - Disclosed herein is a once-through evaporator comprising an inlet manifold; one or more inlet headers in fluid communication with the inlet manifold; one or more tube stacks, where each tube stack comprises one or more substantially horizontal evaporator tubes; the one or more tube stacks being in fluid communication with the one or more inlet headers; one or more outlet headers in fluid communication with one or more tube stacks; an outlet manifold in fluid communication with the one or more outlet headers; and a plurality of flow control devices to dynamically control the fluid flow to a respective inlet header.",
            "A METHOD AND APPARATUS FOR CONNECTING SECTIONS OF A ONCE-THROUGH HORIZONTAL EVAPORATOR - Disclosed herein is a once-through evaporator comprising an inlet manifold; one or more inlet headers in fluid communication with the inlet manifold; one or more tube stacks, where each tube stack comprises one or more substantially horizontal evaporator tubes; the one or more tube stacks being in fluid communication with the one or more inlet headers; one or more outlet headers in fluid communication with one or more tube stacks; and an outlet manifold in fluid communication with the one or more outlet headers."
        ],
        [
            "Published",
            "07-18-2013",
            "07-18-2013"
        ]
    ],
    "pageTitle": "Zhang, CT - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/zhang-ct-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00137-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 436336607,
    "recordOffset": 436309047,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{24119=Patent applications by Hai-Jun Zhang, Middletown, CT US}",
    "textBeforeTable": "Wei D. Zhang, South Windsor, CT US 12-25-2014 METHOD OF AIR PREHEATING FOR COMBUSTION POWER PLANT AND SYSTEMS COMPRISING THE SAME - Disclosed herein is a heat exchanger for transferring heat between a first gas flow and a second gas flow, the heat exchanger comprising at least two sectors; a first sector that is operative to receive a combustion air stream; and a second sector that is opposed to the first sector and that is operative to receive either a reducer gas stream or an oxidizer gas stream, and a pressurized layer disposed between the first sector and the second sector; where the pressurized layer is at a higher pressure than combustion air stream, the reducer gas stream and the oxidizer gas stream. 20140374053 07-18-2013 SUPERCRITICAL HEAT RECOVERY STEAM GENERATOR REHEATER AND SUPERCRITICAL EVAPORATOR ARRANGEMENT - A supercritical heat recovery steam generator includes a duct defining an interior area and having a gas inlet and a gas outlet. The duct is configured to convey gas from the gas inlet to the gas outlet. A portion of the duct between the gas inlet and the gas outlet defines an exhaust gas flow segment of the interior area. A supercritical evaporator is disposed in the interior area and a reheater is disposed in the interior area. The reheater and the supercritical evaporator are disposed in the exhaust gas flow segment, adjacent to each other with respect to the flow of the exhaust gas. 20130180228",
    "textAfterTable": "Weilong Zhang, Glastonbury, CT US Patent application number Description Published 20100040911 FUEL CELL FLOW FIELD HAVING STRONG, CHEMICALLY STABLE METAL BIPOLAR PLATES - A bipolar plate ( 02-18-2010 20100055538 FUEL CELL FLOW FIELD HAVING METAL BIPOLAR PLATES - A bipolar plate ( 03-04-2010 20130299355 SURFACE CLEANING AND ACTIVATION FOR ELECTRODEPOSITION IN IONIC LIQUIDS - A surface preparation solution comprises an ionic liquid solvent and a water and oxygen scavenging species. Methods for making the solution, and methods for using the solution to prepare and activate a substrate surface for bulk electrodeposition are also disclosed. 11-14-2013 20130302641 UNDERPOTENTIAL DEPOSITON OF METAL MONOLAYERS FROM IONIC LIQUIDS - A metal article comprises an alloy substrate having a surface and a non-diffused metal monolayer disposed thereon. The surface has a first surface work function value Φ 11-14-2013 Patent applications by Weilong Zhang, Glastonbury, CT US Xiaomei Zhang, Bethany, CT US Patent application number Description Published 20110195110 UREA COMPOUNDS USEFUL IN THE TREATMENT OF CANCER - Pyrazole urea compounds, pharmaceutical compositions which contain them and methods for treating cancer using them. 08-11-2011",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}