{
    "relation": [
        [
            "Test Assertion:",
            "Description:",
            "Target:",
            "Predicate:",
            "Reporting:",
            "Prescription:",
            "Error Message:",
            "Diagnostic Data:"
        ],
        [
            "BP1033",
            "The SOAP envelope does not contain the namespace declaration xmlns:xml=\"http://www.w3.org/XML/1998/namespace\".",
            "/wsil:testLog/wsil:messageLog/wsil:message/wsil:messageContents/soap11:Envelope",
            "not(.//*[fn:namespace-uri(.) = 'http://www.w3.org/XML/1998/namespace'])",
            "true=passed, false=failed",
            "preferred",
            "The SOAP envelope contains the namespace declaration xmlns:xml=\"http://www.w3.org/XML/1998/namespace\".",
            "SOAP envelope"
        ]
    ],
    "pageTitle": "Basic Profile - Version 1.2 (WGD)",
    "title": "",
    "url": "http://ws-i.org/profiles/BasicProfile-1.2-WGD.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 264909835,
    "recordOffset": 264835803,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{25922=1. Introduction 1.1. Guiding Principles 1.2. Relationships to Other Profiles 1.2.1. Compatibility with Basic Profile 1.1 1.2.2. Relationship to Basic Profile 2.0 1.3. Test Assertions 1.4. Notational Conventions 1.5. Profile Identification and Versioning 2. Profile Conformance 2.1. Conformance Requirements 2.2. Conformance Targets 2.3. Conformance Scope 2.4. Claiming Conformance 3. Messaging 3.1. Message Serialization 3.1.1. XML Envelope Serialization 3.1.2. Unicode BOMs 3.1.3. XML Declarations 3.1.4. Character Encodings 3.2. SOAP Envelopes 3.2.1. SOAP Envelope Structure 3.2.2. SOAP Envelope Namespace 3.2.3. SOAP Body Namespace Qualification 3.2.4. Disallowed Constructs 3.2.5. SOAP Trailers 3.2.6. SOAP encodingStyle Attribute 3.2.7. SOAP mustUnderstand Attribute 3.2.8. xsi:type Attributes 3.2.9. SOAP 1.1 attributes on SOAP 1.1 elements 3.3. SOAP Processing Model 3.3.1. Mandatory Headers 3.3.2. Generating mustUnderstand Faults 3.3.3. SOAP Fault Processing 3.4. SOAP Faults 3.4.1. Identifying SOAP Faults 3.4.2. SOAP Fault Structure 3.4.3. SOAP Fault Namespace Qualification 3.4.4. SOAP Fault Extensibility 3.4.5. SOAP Fault Language 3.4.6. SOAP Custom Fault Codes 3.5. Use of SOAP in HTTP 3.5.1. HTTP Protocol Binding 3.5.2. HTTP Methods and Extensions 3.5.3. SOAPAction HTTP Header 3.5.4. HTTP Success Status Codes 3.5.5. HTTP Redirect Status Codes 3.5.6. HTTP Client Error Status Codes 3.5.7. HTTP Server Error Status Codes 3.5.8. HTTP Cookies 3.5.9. Non-Addressable Consumers and Instances 3.6. Use of URIs in SOAP 3.6.1. Use of SOAP-defined URIs 3.7. WS-Addressing Support 3.7.1. Requiring WS-Addressing SOAP Headers 3.7.2. NotUnderstood block in MustUnderstand Fault on WS-Addressing SOAP Headers 3.7.3. Use of wsa:Action and WS-Addressing 1.0 - Metadata 3.7.4. Valid Values for SOAPAction When WS-Addressing is Used 3.7.5. SOAP Defined Faults Action URI 3.7.6. Understanding WS-Addressing SOAP Header Blocks 3.7.7. Ignored or Absent WS-Addressing Headers 3.7.8. Present and Understood WS-Addressing Headers 3.7.9. SOAP MustUnderstand or VersionMismatch fault Transmission 3.7.10. Faulting Behavior with Present and Understood WS-Addressing Headers 3.7.11. [message id] and One-Way Operations 3.7.12. Refusal to Honor WS-Addressing Headers 3.7.13. Use of Non-Anonymous Response EPRs 3.7.14. Optionality of the wsa:To header 3.7.15. Extending WSDL Endpoints with an EPR 3.7.16. Combining Synchronous and Asynchronous Operations 3.7.17. Conflicting Addressing Policies 4. Service Description 4.1. Required Description 4.2. Document Structure 4.2.1. WSDL Schema Definitions 4.2.2. WSDL and Schema Import 4.2.3. WSDL Import location Attribute Structure 4.2.4. WSDL Import location Attribute Semantics 4.2.5. Placement of WSDL import Elements 4.2.6. XML Version Requirements 4.2.7. XML Namespace Declarations 4.2.8. WSDL and the Unicode BOM 4.2.9. Acceptable WSDL Character Encodings 4.2.10. Namespace Coercion 4.2.11. WSDL documentation Element 4.2.12. WSDL Extensions 4.3. Types 4.3.1. QName References 4.3.2. Schema targetNamespace Structure 4.3.3. soapenc:Array 4.3.4. WSDL and Schema Definition Target Namespaces 4.3.5. Multiple GED Definitions with the same QName 4.3.6. Multiple Type Definitions with the same QName 4.4. Messages 4.4.1. Bindings and Parts 4.4.2. Bindings and Faults 4.4.3. Unbound portType Element Contents 4.4.4. Declaration of part Elements 4.5. Port Types 4.5.1. Ordering of part Elements 4.5.2. Allowed Operations 4.5.3. Distinctive Operations 4.5.4. parameterOrder Attribute Construction 4.5.5. Exclusivity of type and element Attributes 4.6. Bindings 4.6.1. Use of SOAP Binding 4.7. SOAP Binding 4.7.1. Specifying the transport Attribute 4.7.2. HTTP Transport 4.7.3. Consistency of style Attribute 4.7.4. Encodings and the use Attribute 4.7.5. Multiple Bindings for portType Elements 4.7.6. Operation Signatures 4.7.7. Multiple Ports on an Endpoint 4.7.8. Child Element for Document-Literal Bindings 4.7.9. One-Way Operations 4.7.10. Namespaces for wsoap11 Elements 4.7.11. Consistency of portType and binding Elements 4.7.12. Describing headerfault Elements 4.7.13. Enumeration of Faults 4.7.14. Type and Name of SOAP Binding Elements 4.7.15. name Attribute on Faults 4.7.16. Omission of the use Attribute 4.7.17. Default for use Attribute 4.7.18. Consistency of Envelopes with Descriptions 4.7.19. Response Wrappers 4.7.20. Part Accessors 4.7.21. Namespaces for Children of Part Accessors 4.7.22. Required Headers 4.7.23. Allowing Undescribed Headers 4.7.24. Ordering Headers 4.7.25. Describing SOAPAction 4.7.26. SOAP Binding Extensions 4.8. Use of XML Schema 4.9. WS-Addressing 1.0 - Metadata 5. Service Publication and Discovery 5.1. bindingTemplates 5.2. tModels 6. Security 6.1. Use of HTTPS Appendix A: Referenced Specifications Appendix B: Extensibility Points Appendix C: Normative References Appendix D: Defined Terms Appendix E: Acknowledgements, 30276=Copyright © 2002-2010 by The Web Services-Interoperability Organization (WS-I) and Certain of its Members. All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{167881=R1014 The children of the soap11:Body element in an ENVELOPE MUST be namespace qualified. CORE TESTABLE BP1202, 453744=R1112 An INSTANCE SHOULD use either a \"200 OK\" or \"202 Accepted\" HTTP status code for a response message that does not contain a SOAP envelope but indicates the successful outcome of a HTTP Request. HTTP-TRANSPORT TESTABLE BP1101, 738667=As per WS-Addressing 1.0 - Core, the [destination] message addressing property of a request message without a wsa:To header is \"http://www.w3.org/2005/08/addressing/anonymous\". Note that none of the WS-Addressing 1.0 specifications describes the semantics of sending a SOAP request message, over HTTP, either without a wsa:To header or with a wsa:To header with the value of \"http://www.w3.org/2005/08/addressing/anonymous\". To clarify, such a request is considered to be addressed to \"the entity listening at the URI of the HTTP Request that contains this message\". Sent over a connection to http://www.example.org, the following three example messages are consistent:, 741636=R1154 When sending a request message to an endpoint which is specified by a WSDL 1.1 description in which the wsdl:port element has been extended with a wsa:EndpointReference, if the wsa:Action SOAP header block is present, the SENDER MUST populate the wsa:To and reference parameter SOAP headers of that request message with the values of the wsa:Address and wsa:ReferenceParameters elements (respectively) of the extending endpoint reference. CORE TESTABLE, 1006994=R2005 The targetNamespace attribute on the wsdl:definitions element of a description that is being imported MUST have same the value as the namespace attribute on the wsdl:import element in the importing DESCRIPTION. CORE TESTABLE BP2104, 353737=R1016 A RECEIVER MUST accept faults that carry an xml:lang attribute on the faultstring element. CORE NOT_TESTED, 534450=R1142 An ENVELOPE that includes a wsa:Action SOAP header block and which is described using a WSDL 1.1 description MUST conform to WS-Addressing 1.0 - Metadata, Section 5.1. CORE TESTABLE BP1142a BP1142b BP1142c, 748979=The above example is incorrect for two reasons. Firstly, it violates R1157 because the GetPOStatus and CancelPO operations do not have policies containing the wsam:Addressing assertion attached to them. Secondly, the effective policies for both the CreatePO and UpdatePO operations contain conflicting assertions (a wsam:Addressing assertion that is unconstrained with regards to anonymous/non-anonymous and a wsam:Addressing assertion that is constrained to just non-anonymous) within the same alternative., 650928=R1149 If any WS-Addressing header blocks are not honored, the RECEIVER MUST generate a fault. CORE NOT_TESTABLE, 808711=R2001 A DESCRIPTION MUST only use the WSDL \"import\" statement to import another WSDL description. CORE TESTABLE BP2101, 922780=R2022 When they appear in a DESCRIPTION, wsdl:import elements MUST precede all other elements from the WSDL namespace except wsdl:documentation. CORE TESTABLE BP2105, 774967=R2028 A DESCRIPTION using the WSDL namespace (prefixed \"wsdl\" in this Profile) MUST be valid according to the XML Schema found at \"http://ws-i.org/profiles/basic/1.1/wsdl-2004-08-24.xsd\". CORE TESTABLE BP2705, 647777=R1162 When the wsa:FaultTo SOAP header exists, the RECEIVER MUST NOT transmit faults to the endpoint referred to by the wsa:ReplyTo header. CORE TESTABLE, 1040420=R2027 If during the processing of a description, a consumer encounters a WSDL extension element that has a wsdl:required attribute with a boolean value of \"true\" that the consumer does not understand or cannot process, the CONSUMER MUST fail processing. CORE NOT_TESTABLE, 905798=R2007 A DESCRIPTION MUST specify a non-empty location attribute on the wsdl:import element. CORE TESTABLE BP2098, 839807=R2002 To import XML Schema Definitions, a DESCRIPTION MUST use the XML Schema \"import\" statement. CORE TESTABLE BP2101, 530369=R1160 A RECEIVER, for the purposes of comparison of URI values of information items defined by the SOAP 1.1 specification, MUST treat the computed absolute URI values as simple strings as defined in RFC3986 (see RFC3986, Section 6.2.1). CORE NOT_TESTABLE, 624668=R1145 If a SOAP envelope does not contain any WS-Addressing header blocks, or contains WS-Addressing header blocks that do not include any soap11:mustUnderstand=\"1\" attributes, and the RECEIVER chooses to ignore them, then any response (normal or fault) SHOULD be transmitted. If it is transmitted then it is transmitted on the HTTP Response message (if available). HTTP-TRANSPORT NOT_TESTED, 532697=R1040 If an endpoint requires use of WS-Addressing by use of a wsam:Addressing policy assertion, an ENVELOPE sent by a SENDER MUST carry all required WS-Addressing SOAP headers. CORE NOT_TESTED, 5956=Requirement levels, using RFC2119 language (e.g., MUST, MAY, SHOULD) indicate the nature of the requirement and its impact on conformance. Each requirement is individually identified (e.g., R9999) for convenience., 472665=R1114 An INSTANCE SHOULD use a \"405 Method not Allowed\" HTTP status code if a HTTP Request message's method is not \"POST\". HTTP-TRANSPORT NOT_TESTABLE, 67404=This Profile allows for the use of protocol bindings other than HTTP. Section 2.2 identifies the use of Simple SOAP and XOP encoded messages using HTTP. Section 3.1 identifies how encoding is handled for HTTP only. RFC 2616 and RFC 3023 provide guidance for HTTP. If another transport protocol is used, the responsibility for defining how to handle transport-specific features (e.g. content encoding) falls to the specification of the binding of SOAP to that transport protocol., 151398=R9981 An ENVELOPE MUST have exactly zero or one child elements of the soap11:Body element. CORE TESTABLE BP1881, 375192=R1140 When HTTP is used as the transport, a MESSAGE SHOULD be sent using HTTP/1.1. HTTP-TRANSPORT TESTABLE BP1001, 747310=In addition to the above restrictions and as stated in R1158 , the effective policy alternatives for a given policy subject must not contain conflicting assertions., 279969=R1013 An ENVELOPE containing a soap11:mustUnderstand attribute MUST only use the lexical forms \"0\" and \"1\". CORE TESTABLE BP1013, 313724=R1027 A RECEIVER MUST generate a \"soap11:MustUnderstand\" fault when an envelope contains a mandatory header block (i.e., one that has a soap11:mustUnderstand attribute with the value \"1\") targeted at the receiver (via soap11:actor) that the receiver does not understand. CORE NOT_TESTABLE, 248078=R1005 An ENVELOPE MUST NOT contain soap11:encodingStyle attributes on any of the elements whose namespace name is \"http://schemas.xmlsoap.org/soap/envelope/\". CORE TESTABLE BP2005, 647273=R1161 Other than those faults specified in R1036, faults in R1147 SHOULD be transmitted by the RECEIVER as specified in WS-Addressing 1.0 - Core, Section 3.4. CORE TESTABLE, 316562=R1107 A RECEIVER MUST interpret a SOAP message as a Fault when the soap11:Body of the message has a single soap11:Fault child. CORE NOT_TESTABLE, 855337=R2003 A DESCRIPTION MUST use the XML Schema \"import\" statement only within the xsd:schema element of the types section. CORE TESTABLE BP2103, 538=The keywords \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC2119., 279215=R1007 An ENVELOPE described in an rpc-literal binding MUST NOT contain soap11:encodingStyle attribute on any element that is a grandchild of soap11:Body . CORE NOT_TESTED, 355187=R1004 When an ENVELOPE contains a faultcode element, the content of that element SHOULD be either one of the fault codes defined in SOAP 1.1 (supplying additional information if necessary in the detail element), or a Qname whose namespace is controlled by the fault's specifying authority (in that order of preference). CORE NOT_TESTABLE, 491576=R1123 The value of the cookie MUST be considered to be opaque by the CONSUMER. HTTP-TRANSPORT NOT_TESTABLE, 472322=R1113 An INSTANCE SHOULD use a \"400 Bad Request\" HTTP status code, if a HTTP Request message is malformed. HTTP-TRANSPORT NOT_TESTABLE, 134578=R1019 A RECEIVER MUST ignore the encoding pseudo-attribute of the envelope's XML declaration. CORE NOT_TESTABLE, 353408=Note that this requirement conflicts with the schema for SOAP appearing at its namespace URL. A schema without conflicts can be found at \"http://ws-i.org/profiles/basic/1.1/soap-envelope-2004-01-21.xsd \"., 406368=R1108 A MESSAGE MUST NOT use the HTTP Extension Framework (RFC2774). HTTP-TRANSPORT TESTABLE BP1262, 470433=R1130 An INSTANCE MUST use the \"307 Temporary Redirect\" HTTP status code when redirecting a request to a different endpoint. HTTP-TRANSPORT NOT_TESTABLE, 746269=R1156 In a DESCRIPTION, a policy that contains the wsam:Addressing assertion MUST be attached to either a wsdl:port, a wsdl:binding or a wsdl:binding/wsdl:operation. CORE NOT_TESTABLE_XPATH, 296266=R1032 The soap11:Envelope, soap11:Header, and soap11:Body elements in an ENVELOPE MUST NOT have attributes in the namespace \"http://schemas.xmlsoap.org/soap/envelope/\". CORE TESTABLE BP1032, 1093665=R2110 In a DESCRIPTION, declarations M, 312828=R1025 A RECEIVER MUST handle envelopes in such a way that it appears that all checking of mandatory header blocks is performed before any actual processing. CORE NOT_TESTABLE, 624277=When WS-Addressing headers are present in a SOAP envelope, but do not contain a soap11:mustUnderstand=\"1\" attribute, a RECEIVER may choose to ignore these SOAP headers (per R1143 ). Consistent with R1036 , valid reasons may exist why (not where) faults are not transmitted., 135543=R9980 An ENVELOPE MUST conform to the structure specified in SOAP 1.1 Section 4, \"SOAP Envelope\" (subject to amendment by the Profile). CORE TESTABLE BP1600, 824241=R2803 In a DESCRIPTION, the namespace attribute of the wsdl:import MUST NOT be a relative URI. CORE TESTABLE BP2803, 390557=Note that support for HTTP/1.0 is implied in HTTP/1.1, and that intermediaries may change the version of a message; for more information about HTTP versioning, see RFC2145, \"Use and Interpretation of HTTP Version Numbers.\", 643145=SOAP 1.1 allows a RECEIVER to ignore headers that it does not understand. This behavior is particularly relevant for WS-Addressing headers that affect message processing and routing. As an example, take the following message sent to a SOAP node that does not understand the \"http://www.w3.org/2005/08/addressing\" namespace:, 474302=R1126 An INSTANCE MUST return a \"500 Internal Server Error\" HTTP status code if the response envelope is a Fault. HTTP-TRANSPORT TESTABLE BP1126, 742921=R1155 When sending a request message to an endpoint which is specified by a WSDL 1.1 description in which the wsdl:port element has not been extended with a wsa:EndpointReference, if the wsa:Action SOAP header block is present, the SENDER MAY populate the wsa:To SOAP header of that request message with the value of the location attribute of the wsoap11:address extension element. CORE TESTABLE, 391252=R1132 A HTTP Request MESSAGE MUST use the HTTP POST method. HTTP-TRANSPORT TESTABLE BP1264, 902531=R2011 An XML Schema directly or indirectly imported by a DESCRIPTION MUST use version 1.0 of the eXtensible Markup Language W3C Recommendation. CORE NOT_TESTABLE, 317207=R1000 When an ENVELOPE is a Fault, the soap11:Fault element MUST NOT have element children other than faultcode, faultstring, faultactor and detail. CORE TESTABLE BP1260, 352148=R1002 A RECEIVER MUST accept faults that have any number of elements, including zero, appearing as children of the detail element. Such children can be qualified or unqualified. CORE NOT_TESTED, 118233=R1018 A SIMPLE_SOAP_MESSAGE MUST indicate the correct character encoding, using the \"charset\" parameter. CORE TESTABLE BP1018, 921946=R2008 A CONSUMER MAY, but need not, retrieve a WSDL description from the URI specified in the location attribute on a wsdl:import element. CORE NOT_TESTED, 471980=R1125 An INSTANCE MUST use a 4xx HTTP status code for a response that indicates a problem with the format of a request. HTTP-TRANSPORT TESTABLE, 438402=R1111 An INSTANCE SHOULD use a \"200 OK\" HTTP status code on a response message that contains an envelope that is not a fault. HTTP-TRANSPORT TESTABLE BP1100, 85193=R1010 A RECEIVER MUST accept messages with envelopes that contain an XML Declaration. CORE TESTABLE BP1015, 471190=RFC2616 notes that user-agents should not automatically redirect requests; however, this requirement was aimed at browsers, not automated processes (which many Web services will be). Therefore, the Profile allows, but does not require, consumers to automatically follow redirections., 490971=R1122 An INSTANCE using Cookies SHOULD conform to RFC2965. HTTP-TRANSPORT NOT_TESTED, 199779=R1009 An ENVELOPE MUST NOT contain Processing Instructions. CORE TESTABLE BP1208, 491254=R1121 An INSTANCE SHOULD NOT require consumer support for Cookies in order to function correctly. HTTP-TRANSPORT NOT_TESTED, 791371=R2029 A DESCRIPTION using the WSDL SOAP binding namespace (prefixed \"wsoap11\" in this Profile) MUST be valid according to the XML Schema found at \" http://schemas.xmlsoap.org/wsdl/soap/2004-08-24.xsd\". CORE TESTABLE BP2704, 1024046=R2025 A DESCRIPTION containing WSDL extensions MUST NOT use them to contradict other requirements of the Profile. CORE NOT_TESTABLE, 359675=R1141 When HTTP is used as the transport, a MESSAGE MUST be sent using either HTTP/1.1 or HTTP/1.0. HTTP-TRANSPORT TESTABLE BP1002, 649587=R1163 When applying the processing rules defined by WS-Addressing 1.0 - Core, Section 3.4, if a related message lacks a [message id] property, the RECEIVER MUST generate a wsa:MessageAddressingHeaderRequired fault. CORE TESTABLE, 295621=R1017 A RECEIVER MUST NOT fault on the absence of the xsi:type attribute in envelopes, except in cases where this attribute is required to indicate a derived type (see XML Schema Part 1: Structures, Section 2.6.1). CORE NOT_TESTABLE, 528667=R1204 When an INSTANCE is non-addressable, a SOAP ENVELOPE, that is described by the output message of a WSDL operation supported by the INSTANCE, MUST be bound to a HTTP Request message. HTTP-TRANSPORT TESTABLE, 974127=R4005 A DESCRIPTION SHOULD NOT contain the namespace declaration xmlns:xml=\"http://www.w3.org/XML/1998/namespace\". CORE TESTABLE BP2034, 183507=Although published errata NE05 (see http://www.w3.org/XML/xml-names-19990114-errata ) allows the namespace declaration xmlns:xml=\"http://www.w3.org/XML/1998/namespace\" to appear, some older processors considered such a declaration to be an error. These requirements ensure that conformant artifacts have the broadest interoperability possible., 352553=R1003 A RECEIVER MUST accept faults that have any number of qualified or unqualified attributes, including zero, appearing on the detail element. The namespace of qualified attributes can be anything other than \"http://schemas.xmlsoap.org/soap/envelope/\". CORE NOT_TESTED, 648619=Note: To avoid a recursive situation, if a fault is generated while trying to transmit to the endpoint referred to by the wsa:ReplyTo header (R1146 ) and the wsa:FaultTo header is absent, R1147 does not apply., 651717=R1152 If an INSTANCE attempts to send a message to a non-anonymous [destination] URI then the message MUST be transmitted in the entity-body of an HTTP Request. CORE TESTABLE BP1152a BP1152b BP1152c, 473034=R1115 An INSTANCE SHOULD use a \"415 Unsupported Media Type\" HTTP status code if a HTTP Request message's Content-Type header field-value is not permitted by its WSDL description. HTTP-TRANSPORT NOT_TESTABLE, 231149=R1011 An ENVELOPE MUST NOT have any element children of soap11:Envelope following the soap11:Body element. CORE TESTABLE BP1263, 648155=R1148 If an error occurs when transmitting the fault in R1147, a RECEIVER MAY choose to send a fault related to this transmission error on the HTTP Response (if available). HTTP-TRANSPORT NOT_TESTED, 754756=In cases where there are multiple policy alternatives within the effective policy, some which violate R1158 and some which do not, consumers MAY consider those policy alternatives that do not violate R1158., 334871=R1001 When an ENVELOPE is a Fault, the element children of the soap11:Fault element MUST be unqualified. CORE TESTABLE BP1261, 1043240=R2101 A DESCRIPTION MUST NOT use QName references to WSDL components in namespaces that have been neither imported, nor defined in the referring WSDL document. CORE TESTABLE BP2416, 757741=R0001 Either an INSTANCE's WSDL 1.1 description, its UDDI binding template, or both MUST be available to an authorized consumer upon request. CORE TESTABLE BP2703, 870754=R2004 In a DESCRIPTION the schemaLocation attribute of an xsd:import element MUST NOT resolve to any document whose root element is not \"schema\" from the namespace \"http://www.w3.org/2001/XMLSchema\". CORE TESTABLE BP2106, 533310=R1041 An ENVELOPE that is a MustUnderstand SOAP fault, sent from an endpoint that has a policy alternative containing the wsam:Addressing assertion attached to its WSDL endpoint subject, MUST NOT contain a NotUnderstood SOAP header block with the qname attribute value that identifies a WS-Addressing defined SOAP header block. CORE NOT_TESTED, 646939=R1147 If a fault is generated, the RECEIVER SHOULD transmit the fault (per R1029). CORE NOT_TESTED, 606962=WS-Addressing provides the URI http://www.w3.org/2005/08/addressing/soap/fault for \"SOAP defined faults\". However, it only recommends, rather than mandates its use for the SOAP 1.1 defined MustUnderstand and VersionMismatch faults. This Profile mandates the use of the WS-Addressing defined wsa:Action value for SOAP 1.1 defined MustUnderstand and VersionMismatch faults, for interoperability., 167211=R1015 A RECEIVER MUST generate a fault if they encounter an envelope whose document element is not soap11:Envelope . CORE NOT_TESTED, 1077544=R2105 All xsd:schema elements contained in a wsdl:types element of a DESCRIPTION MUST have a targetNamespace attribute with a valid and non-null value, UNLESS the xsd:schema element has xsd:import and/or xsd:annotation as its only child element(s). CORE TESTABLE BP2107, 183959=R1008 An ENVELOPE MUST NOT contain a Document Type Declaration. CORE TESTABLE BP1007, 938399=R2023 When they appear in a DESCRIPTION, wsdl:types elements MUST precede all other elements from the WSDL namespace except wsdl:documentation and wsdl:import. CORE TESTABLE BP2018, 421973=R1109 If present, the values of the following parameters - type, start-info, SOAPAction, and boundary - on the Content-Type MIME header field-value in a request MESSAGE MUST be a quoted string. HTTP-TRANSPORT TESTABLE BP1006, 470794=R1131 A CONSUMER MAY automatically redirect a request when it encounters a \"307 Temporary Redirect\" HTTP status code in a response. HTTP-TRANSPORT NOT_TESTED, 645718=R1036 Regardless of whether the wsa:ReplyTo or wsa:FaultTo SOAP headers appear in the incoming message, a RECEIVER that receives a SOAP envelope that generates either a SOAP MustUnderstand or VersionMismatch fault SHOULD transmit either fault. If it is transmitted, such a fault is transmitted on the HTTP Response message (if available). HTTP-TRANSPORT NOT_TESTED, 701216=R1153 Except in cases in which a RECEIVER exposes a WSDL description and its endpoint includes a wsdl:port that has been extended with a wsa:EndpointReference, a RECEIVER MUST NOT fault a SOAP request message due to the absence of the wsa:To header. CORE TESTABLE BP1153a BP1153b, 215535=R1033 An ENVELOPE MUST NOT contain the namespace declaration xmlns:xml=\"http://www.w3.org/XML/1998/namespace\". CORE TESTABLE BP1033, 1041573=For the purposes of the Profile, all elements in the \"http://schemas.xmlsoap.org/wsdl/\" namespace are extensible via element as well as attributes. As a convenience, WS-I has published a version of the WSDL 1.1 schema that reflects this capability at: http://ws-i.org/profiles/basic/1.1/wsdl-2004-08-24.xsd, 493525=R1202 When a CONSUMER is non-addressable, a SOAP ENVELOPE, that is described by the output message of a WSDL operation supported by an INSTANCE, MUST be bound to a HTTP Response message. HTTP-TRANSPORT TESTABLE BP1126a BP1126b, 1024376=R2026 A DESCRIPTION SHOULD NOT include extension elements with a wsdl:required attribute value of \"true\" on any WSDL construct (wsdl:binding, wsdl:portType, wsdl:message, wsdl:types or wsdl:import) that claims conformance to the Profile. CORE TESTABLE BP2123, 68456=R9701 An ENVELOPE MUST be serialized as XML 1.0. CORE TESTABLE BP1019, 886934=R2010 An XML Schema directly or indirectly imported by a DESCRIPTION MUST use either UTF-8 or UTF-16 encoding. CORE TESTABLE BP2202, 438047=R1124 An INSTANCE MUST use a 2xx HTTP status code on a response message that indicates the successful outcome of a HTTP Request. HTTP-TRANSPORT NOT_TESTABLE, 590860=R1144 When the wsa:Action SOAP header block is present in an envelope, the containing HTTP Request MESSAGE MUST specify a SOAPAction HTTP header with either a value that is an absolute URI that has the same value as the value of the wsa:Action header, or a value of \"\" (empty string). CORE TESTABLE BP1144, 886604=R2009 An XML Schema directly or indirectly imported by a DESCRIPTION MAY include the Unicode Byte Order Mark (BOM). CORE NOT_TESTED, 957921=R4004 A DESCRIPTION MUST use version 1.0 of the eXtensible Markup Language W3C Recommendation. CORE TESTABLE BP2700, 1060697=R2102 A QName reference to a Schema component in a DESCRIPTION MUST use the namespace defined in the targetNamespace attribute on the xsd:schema element, or to a namespace defined in the namespace attribute on an xsd:import element within the xsd:schema element. CORE TESTABLE BP2417, 315336=R1029 Where the normal outcome of processing a SOAP envelope would have resulted in the transmission of a SOAP response, but rather a fault is generated instead, the RECEIVER MUST NOT transmit the non-faulting response. CORE NOT_TESTABLE, 263667=R1006 An ENVELOPE MUST NOT contain soap11:encodingStyle attributes on any element that is a child of soap11:Body . CORE TESTABLE BP2005, 990923=R4003 A DESCRIPTION MUST use either UTF-8 or UTF-16 encoding. CORE TESTABLE BP2201, 470023=There are interoperability problems with using many of the HTTP redirect status codes, generally surrounding whether to use the original method, or GET. The Profile mandates \"307 Temporary Redirect\", which has the semantic of redirection with the same HTTP method, as the correct status code for redirection. For more information, see the 3xx status code descriptions in RFC2616., 623671=R1143 When a message contains multiple WS-Addressing SOAP header blocks with at least one of those header blocks containing a soap11:mustUnderstand='1' attribute, then a RECEIVER MUST honor all the WS-Addressing SOAP header blocks or none of them. CORE NOT_TESTABLE, 746709=R1157 If a DESCRIPTION has a policy alternative containing the wsam:Addressing assertion attached to a wsdl:binding/wsdl:operation, then all of the wsdl:operations within that wsdl:binding MUST also have a policy alternative containing the wsam:Addressing assertion attached to them. CORE NOT_TESTABLE_XPATH, 528257=R1203 When an INSTANCE is non-addressable, a SOAP ENVELOPE, that is described by the input message of a WSDL operation supported by the INSTANCE, MUST be bound to a HTTP Response message. HTTP-TRANSPORT TESTABLE, 1023216=R2030 In a DESCRIPTION the wsdl:documentation element MAY be present as the first child element of wsdl:import, wsdl:part and wsdl:definitions in addition to the elements cited in the WSDL 1.1 specification. CORE NOT_TESTED, 490673=R1120 An INSTANCE MAY use the HTTP state mechanism (\"Cookies\"). HTTP-TRANSPORT NOT_TESTED, 625841=R1146 A RECEIVER MUST transmit non-faulting responses to the endpoint referred to by the wsa:ReplyTo header or generate a fault instead (per R1029). CORE TESTABLE BP1146, 355749=R1031 When an ENVELOPE contains a faultcode element the content of that element SHOULD NOT use of the SOAP 1.1 \"dot\" notation to refine the meaning of the fault. CORE NOT_TESTABLE, 607399=R1035 An ENVELOPE MUST use the http://www.w3.org/2005/08/addressing/soap/fault URI as the value for the wsa:Action SOAP header element, when present, for either of the SOAP 1.1 defined VersionMismatch and MustUnderstand faults. CORE TESTABLE BP1035, 101917=R1012 An ENVELOPE MUST be serialized using either UTF-8 or UTF-16 character encoding. CORE TESTABLE BP1018, 754285=R1158 In a DESCRIPTION the effective policy for a given endpoint MUST NOT contain both the wsam:AnonymousResponses and wsam:NonAnonymousResponses assertions within a single policy alternative. CORE NOT_TESTABLE_XPATH, 314865=R1028 When a fault is generated by a RECEIVER, further processing SHOULD NOT be performed on the SOAP envelope aside from that which is necessary to rollback, or compensate for, any effects of processing the envelope prior to the generation of the fault. CORE NOT_TESTABLE}",
    "lastModified": "Sun, 26 Jul 2015 18:16:11 GMT",
    "textBeforeTable": "E0001 - Header blocks - Header blocks are an extensibility mechanism in SOAP.CORE TESTABLE BP1901 Simple Object Access Protocol (SOAP) 1.1 Extensibility points: This section of the Profile incorporates the following specifications by reference, and defines extensibility points within them: 3. Messaging The union of the requirements tagged as \"HTTP-TRANSPORT\" and \"CORE\" requirements comprise \"BP 1.2 Complete\". \"Basic Profile 1.2 HTTP-Transport\": Encompasses the HTTP transport-dependent requirements only. The conformance claim URI includes the HTTP-specific transport layer requirements. The \"HTTP-TRANSPORT\" URI must be combined with the \"CORE\" URI and cannot be used in isolation. The conformance claim URI for \"HTTP-TRANSPORT\" is: http://ws-i.org/profiles/basic-profile/1.2/http-transport \"Basic Profile 1.2 Core\": Encompasses the transport-independent requirements only. The conformance claim URI allows this Profile to be reusable for application across multiple transports. No transport-specific requirements apply. The conformance claim URI for \"CORE\" is: http://ws-i.org/profiles/basic-profile/1.2/core \"Basic Profile 1.2 Complete\": Encompasses all the requirements in this Profile the transport-independent (CORE) and HTTP-specific transport-layer mechanisms (HTTP-TRANSPORT). For interoperability, this aggregated conformance claim URI that combines all requirements for \"COMPLETE\" is: http://ws-i.org/profiles/basic-profile/1.2/complete Claims of conformance for the Basic Profile 1.2 encompass the transport-independent and HTTP-specific requirements. Claims are separated into two disjoint parts and an aggregated claim for the complete Basic Profile: \"CORE\", \"HTTP-TRANSPORT\", and \"COMPLETE\". The Basic Profile 1.2 conformance claim URI(s) are: UDDI Claim Attachment Mechanism for Web Services Registrations - REGDATA",
    "textAfterTable": "Test Assertion Part What it means: Test Assertion ID: [markup: testAssertion/@id] (required) A unique ID for the current test assertion. Description: [markup: testAssertion/description ] (optional) A plain text description of the current test assertion. At minimum expressing the TA predicate. Comments: [markup: testAssertion/comments ] (optional) A plain text comment about the TA script and how well it covers the profile requirement. Explanation material for users, and developers (what could be improved, etc.). Target: [markup: testAssertion/target ] (required) The artifacts to be tested, defined by an XPath expression that returns a list of XML nodes from the log file in input. For every artifact (node) selected by the Target expression, there will be a report entry for this TA in the test report, with a result of either: passed failed warning notApplicable notApplicable notRelevant missingInput undetermined See the \"reporting\" item for the meaning of these results. Cotarget: [markup: testAssertion/cotarget ] (optional) Artifact that is related to the target, and that needs be accessed for the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}