{
    "relation": [
        [
            "Patent application number",
            "20090041615",
            "20100080729"
        ],
        [
            "Description",
            "Corrosion Resistant Alloy Compositions with Enhanced Castability and Mechanical Properties - Disclosed are novel nickel-base alloy compositions that may be cast as a single crystal or directionally solidified alloy consisting essentially of, by weight: 8-12% Cr, 10-14% Co, 0.3-0.9% Mo, 3-7% W, 2-8% Ta, 2.0-5.5% Al, 1.5-5.0% Ti, up to 2% Nb, less than 0.1% B, less than 0.1% Zr, 0.05-0.15% C, less than 0.5% Hf, 2-4% Re, 0.05-0.2% Si, up to 0.015% S, up to 0.1% La, up to 0.1% Y, up to 0.1% Ce, up to 0.1% Nd, up to 0.1% Dy, up to 0.1% Pr, up to 0.1% Gd, balance is Ni, and wherein (La+Y+Ce+Nd+Dy+Pr+Gd) is 0.001-0.1%. The compositions for the nickel-base superalloy have a balance between oxidation resistance, corrosion resistance, castability, and mechanical properties, such as creep resistance and thermo-mechanical fatigue resistance.",
            "Nickel-base alloy for gas turbine applications - A nickel-based alloy suitable for casting gas turbine components having a lower density and basic heat treating process while achieving improved strength is disclosed. Multiple embodiments of the alloy are disclosed capable of providing both directionally-solidified and equiaxed castings. Also disclosed is a method of making a cast and heat treated article utilizing the improved nickel-base alloy."
        ],
        [
            "Published",
            "02-12-2009",
            "04-01-2010"
        ]
    ],
    "pageTitle": "Fuchs, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/fuchs-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00340-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 448865995,
    "recordOffset": 448828526,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Gerhard E. Fuchs, Gainesville, FL US 10-25-2012 ALTERNATING CURRENT MACHINE WITH INCREASED TORQUE ABOVE AND BELOW RATED SPEED FOR HYBRID/ELECTRIC PROPULSION SYSTEMS - The machine in accordance with the present disclosure is an AC machine whose pole numbers can be switched (from pole p 20120268053 01-28-2010 ALTERNATING CURRENT MACHINE WITH INCREASED TORQUE ABOVE AND BELOW RATED SPEED FOR HYBRID ELECTRIC PROPULSION SYSTEMS - The machine in accordance with the present disclosure is an AC machine whose pole numbers can be switched (from pole p 20100019714 Published Description Patent application number Ewald Franz Fuchs, Boulder, CO US 01-20-2011 Pulse jet air cleaner system; components; and, methods - Pulse jet air cleaner systems components and methods are described. The features relate to air cleaner housings that include a cartridge receiving section. Features described relate to a possible two-stage construction, a pulse jet accumulator section, pulse jet equipment for cleaning a filter cartridge positioned within the air cleaner; evacuation valve arrangements for projection of dust from the air cleaners; and other example features. Methods of assembly and use are also provided. 20110011042 Published Description Patent application number Erwin P. Fuchs, Farmington, MN US 11-14-2013 METHODS AND COMPOSITIONS FOR CANCER IMMUNOTHERAPY - The present invention generally relates to the field of cancer and methods and compositions for cancer immunotherapy. In one embodiment, a method for",
    "textAfterTable": "Henry Fuchs, Chapel Hill, NC US Patent application number Description Published 20090009723 Methods, Systems, and Computer Program Products for Full Spectrum Projection - A broadband electromagnetic wave beam is projected from a broadband wave source ( 01-08-2009 20100045783 METHODS AND SYSTEMS FOR DYNAMIC VIRTUAL CONVERGENCE AND HEAD MOUNTABLE DISPLAY USING SAME - Methods and systems for dynamic virtual convergence ( 02-25-2010 20110046483 METHODS, SYSTEMS, AND COMPUTER READABLE MEDIA FOR IMAGE GUIDED ABLATION - The subject matter described herein includes methods, systems, and computer readable media for image guided ablation. One system for image guided ablation includes an ultrasound transducer for producing a real-time ultrasound image of a target volume and of surrounding tissue. The system further includes an ablation probe for ablating the target volume. The system further includes a display for displaying an image to guide positioning of the ablation probe during ablation of the target volume. The system further includes at least one tracker for tracking position and orientation of the ablation probe during the ablation of the target volume. The system further includes a rendering and display module for receiving a pre-ablation image of the target volume and for displaying a combined image on the display, where the combined image includes a motion tracked, rendered image of the ablation probe and an equally motion tracked real-time ultrasound image registered with the pre-ablation image. 02-24-2011 20120038739 METHODS, SYSTEMS, AND COMPUTER",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}