{
    "relation": [
        [
            "First Name",
            "Jennifer W.",
            "Thomas M.",
            "Katie R."
        ],
        [
            "Last Name",
            "Lindsey",
            "Sneeringer",
            "McCall"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=D2338943-B147-4510-83B7-5983DD34FB45&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00038-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 218343008,
    "recordOffset": 218334806,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16216=HR 2868, Chemical Facility Anti Terrorism Act of 2009, provisions relating to the impact on the domestic steel industry, Entire bill. H.R.3258, Drinking Water System Security Act of 2009, Entire bill S. 2996/H.R.5186, Continuing Chemical Facilities Anti-terrorism Security Act of 2010, provisions relating to the impact on the domestic steel industry., 18623=H.R.1337, America's Energy Security Trust Fund Act of 2009, Entire bill. H.R.1759, Emission Migration Prevention with Long-term Output Yields Act, Entire bill. H.R.2454, American Clean Energy and Security Act, Entire bill. S.1733, Clean Energy Jobs and American Power Act, Entire bill. H.R.3173/S.1421, Asian Carp Prevention and Control Act, Entire bill. H.R. 4844 / S. 3213 - To ensure that amounts credited to the Harbor Maintenance Trust Fund are used for Harbor Maintenance. - Entire bill S. J. Res. 26 - A joint resolution disapproving a rule submitted by EPA relating to endangerment finding and the cause or contribute findings for greenhouse gases under section 202(a) of the Clean Air Act. - Entire resolution S.3589, S.3590, S.3591, Carbon Capture and Sequestration Deployment Act of 2010, Entire bill., 31758=Steel inputs in the upcoming Miscellaneous Tariff Bill H.R.4380, United States Manufacturing Enhancement Act of 2010, Miscellaneous tariff issues. H.R.6517, Omnibus Trade Act of 2010, Provisions related to MTB., 38616=H.R. 496/S.1466, Trade Enforcement Act of 2009, all provisions relating to the enforcement of U.S. trade laws. H.R. 499, Nonmarket Economy Trade Remedy Act of 2009, all provisions relating to the application of countervailing duties to nonmarket economies. H.R. 471- Supporting Americas Manufacturers Act, all provisions relating to section 421 in trade law. H.R. 5320 - Assistance, Quality & Affordability Act 2010, Buy American amendment. Issues relating to the implementation and enforcement of American trade laws. H.R.4692/S.3662, National Manufacturing Strategy Act of 2010, entire bill. H.R.1875, End the Trade Deficit Act, entire bill. H.R.5156, Clean Energy Technology Manufacturing and Export Assistance Act of 2010, entire bill. H.R.5320, The Assistance and Affordability Act of 2010, Buy American Amendment. Public Law 111-227, United States Manufacturing Enhancement Act of 2010, entire bill. H.R.1855/S.777, SECTORS Act of 2010, entire bill. H.R.4678/S.1606, Foreign Manufacturers Legal Accountability Act of 2010, entire bill. H.R.5637, American Jobs Matter Act of 2010, entire bill. H.R.4553, 21st Century Buy American Act, entire bill. H.R.2378/S.1027, Currency Reform for Fair Trade Act, entire bill. H.R.5041/S.3324, SEAM Act of 2010, entire bill. H.R.5312, Reciprocal Government Procurement with China Creates American Jobs Act, entire bill. The Claims Resolution Act of 2010 -- Section 504 -- Technical Correction relating to the repeal of the Continued Dumping and Subsidy Offset Act., 34029=S. 1325/H.R.3916, A bill to amend the Internal Revenue Code of 1986 to permanently extend and modify the section 45 credit for refined coal from steel industry fuel, and for other purposes, Entire bill Miscellaneous tax measurers including Last In, First Out (LIFO) H.R.4213, American Workers, State, and Business Relief Act of 2010, Steel Industry Fuel Credit. Public Law 111-148, The Patient Protection and Affordable Care Act Regarding the following issues: ERISA federal preemption Health tax treatment: exclusions and excise tax on high value plans Public Option Employer Mandates Cost Shifting HRAs/HSAs/FSAs Application of Health Industry Fee to TPA fees Premium Taxes on Employer Plans Part Time Workers Individual Mandates Public Law 111-118, Department of Defense Appropriations Act, FY2010, Provisions related to health insurance subsidy extenders. H.R.2847, Hiring Incentives to Restore Employment Act, Provisions related to health insurance subsidy extenders. COBRA, Extend benefits period; extend termination date; and tax provisions to self-insured plans. H.R.1132/S.461, To amend the Internal Revenue Code of 1986 to extend and modify the railroad track maintenance credit, entire bill., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 12266=Provisions regarding Federal funding for corporate investments, MTB and tax benefits. Public Law 111-5, American Reinvestment and Recovery Act of 2009, Health insurance subsidy extenders. Public Law 111-118, Department of Defense Appropriations Act, FY2010, Health insurance subsidy extenders. Public Law 111-117, Consolidated Appropriations Act, FY2010, Buy American requirements for Highway & Public Transportation projects. H.R.4899, Supplemental Appropriations Act, FY2010, Department of Energy programs and loan guarantee provision. H.R.5114, Flood Insurance Reform Priorities Act of 2010, Flood insurance issues. H.R.6517, Omnibus Trade Act of 2010, Provisions regarding MTB., 43540=Public Law 111-117, Consolidated Appropriations Act, FY2010, Buy American requirements for Highway & Public Transportation projects. Soo Lock Proposal issues generally; Monongahela 4D 2,3,4; Olmstead 4D and Ohio River., 27619=MSHA and OSHA as it relates to steelmaking operations. Pension relief as it relates to the steel industry H.R.5663/S.3671, Robert C. Byrd Mine and Workplace Safety Act of 2010, Entire bill. H.R.3936, Preserve Benefits and Jobs Act of 2009, Entire bill. H.R.6495, Robert C. Byrd Mine Safety Protection Act of 2010, Entire bill., 23281=S. 593 - Ban Poisonous Additives Act of 2009 - Entire bill S. 510 - Food Safety Modernization Act. - Bill as it relates to S. 593}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20001 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  Thomas M. Sneeringer  2027836333  jwlindsey@uss.com 5. Senate ID#  71553-12 7. Client Name Self Check if client is a state or local government or",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}