{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8"
        ],
        [
            "RxCUI",
            "606726",
            "606726",
            "606726",
            "606728",
            "606728",
            "606728",
            "606728",
            "606728"
        ],
        [
            "RxNorm NAME",
            "esomeprazole magnesium 20 MG Delayed Release Oral Capsule",
            "Esomeprazole 20 MG Delayed Release Oral Capsule",
            "Esomeprazole 20 MG (as esomeprazole magnesium trihydrate 22.3 MG) Delayed Release Oral Capsule",
            "NexIUM 20 MG Delayed Release Oral Capsule",
            "Esomeprazole 20 MG Delayed Release Oral Capsule [Nexium]",
            "Nexium 20 MG (as esomeprazole magnesium 22.3 MG) Delayed Release Oral Capsule",
            "Nexium 20 MG Delayed Release Oral Capsule",
            "Nexium 24 HR 20 MG Delayed release Oral Capsule"
        ],
        [
            "RxTTY",
            "PSN",
            "SCD",
            "SY",
            "PSN",
            "SBD",
            "SY",
            "SY",
            "SY"
        ]
    ],
    "pageTitle": "DailyMed - NEXIUM- esomeprazole magnesium capsule, delayed release",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=3a65d9b7-7a8d-4fc6-a290-50c3543dc485",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00149-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 59969135,
    "recordOffset": 59910815,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{61487=1216, 8878=Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088., 52619=1188, 190093=Revised: 11/2012, 338=©2012 AstraZeneca Pharmaceuticals LP. All rights reserved, 200117=1000 mg, 205773=Warnings and Precautions, Interaction with Clopidogrel (5.4) 10/2012, 41028=Triple Therapy (NEXIUM/amoxicillin/clarithromycin): Two multicenter, randomized, double-blind studies were conducted using a 10 day treatment regimen. The first study (191) compared NEXIUM 40 mg once daily in combination with amoxicillin 1000 mg twice daily and clarithromycin 500 mg twice daily to NEXIUM 40 mg once daily plus clarithromycin 500 mg twice daily. The second study (193) compared NEXIUM 40 mg once daily in combination with amoxicillin 1000 mg twice daily and clarithromycin 500 mg twice daily to NEXIUM 40 mg once daily. H. pylori eradication rates, defined as at least two negative tests and no positive tests from CLOtest®, histology and/or culture, at 4 weeks post-therapy were significantly higher in the NEXIUM plus amoxicillin and clarithromycin group than in the NEXIUM plus clarithromycin or NEXIUM alone group. The results are shown in Table 12:, 469=Issued November 2012, 30071=NDC 0186-5040-82 bottles of 1000, 44960=Two multicenter, double-blind, placebo-controlled studies were conducted in patients at risk of developing gastric and/or duodenal ulcers associated with continuous use of non-selective and COX-2 selective NSAIDs. A total of 1429 patients were randomized across the 2 studies. Patients ranged in age from 19 to 89 (median age 66.0 years) with 70.7% female, 29.3% male, 82.9% Caucasian, 5.5% Black, 3.7% Asian, and 8.0% Others. At baseline, the patients in these studies were endoscopically confirmed not to have ulcers but were determined to be at risk for ulcer occurrence due to their age (≥60 years) and/or history of a documented gastric or duodenal ulcer within the past 5 years. Patients receiving NSAIDs and treated with NEXIUM 20 mg or 40 mg once-a-day experienced significant reduction in gastric ulcer occurrences relative to placebo treatment at 26 weeks. See Table 11. No additional benefit was seen with NEXIUM 40 mg over NEXIUM 20 mg. These studies did not demonstrate significant reduction in the development of NSAID-associated duodenal ulcer due to the low incidence., 135790=For other antiretroviral drugs, such as saquinavir, elevated serum levels have been reported, with an increase in AUC by 82%, in Cmax by 75%, and in Cmin by 106%, following multiple dosing of saquinavir/ritonavir (1000/100 mg) twice daily for 15 days with omeprazole 40 mg daily co-administered days 11 to 15. Therefore, clinical and laboratory monitoring for saquinavir toxicity is recommended during concurrent use with NEXIUM. Dose reduction of saquinavir should be considered from the safety perspective for individual patients., 61024=1209, 116763=As with the management of any overdose, the possibility of multiple drug ingestion should be considered. For current information on treatment of any drug overdose contact a Poison Control Center at 1–800–222–1222., 205113=Dosage and Administration (2) 12/2011, 193630=To report SUSPECTED ADVERSE REACTIONS, contact AstraZeneca at 1-800-236-9933 or FDA at 1-800-FDA-1088 or www.fda.gov/medwatch., 99258=Esomeprazole magnesium 40 mg once daily was given in combination with clarithromycin 500 mg twice daily and amoxicillin 1000 mg twice daily for 7 days to 17 healthy male and female subjects. The mean steady state AUC and Cmax of esomeprazole increased by 70% and 18%, respectively during triple combination therapy compared to treatment with esomeprazole alone. The observed increase in esomeprazole exposure during co-administration with clarithromycin and amoxicillin is not expected to produce significant safety concerns., 118885=Of the total number of patients who received NEXIUM in clinical trials, 1459 were 65 to 74 years of age and 354 patients were ≥ 75 years of age., 30522=NDC 0186-5020-82 bottles of 1000, 25159=©AstraZeneca 2012, 205430=Warnings and Precautions, Concomitant use of NEXIUM with Methotrexate (5.9) 01/2012, 136635=For some antiretroviral drugs, such as atazanavir and nelfinavir, decreased serum levels have been reported when given together with omeprazole. Following multiple doses of nelfinavir (1250 mg, twice daily) and omeprazole (40 mg daily), AUC was decreased by 36% and 92%, Cmax by 37% and 89% and Cmin by 39% and 75% respectively for nelfinavir and M8. Following multiple doses of atazanavir (400 mg, daily) and omeprazole (40 mg, daily, 2 hr before atazanavir), AUC was decreased by 94%, Cmax by 96%, and Cmin by 95%. Concomitant administration with omeprazole and drugs such as atazanavir and nelfinavir is therefore not recommended., 53187=1187, 205608=Warnings and Precautions, Clostridium difficile associated diarrhea (5.3) 09/2012, 169627=1000 mg, 29842=NDC 0186-5040-85 bottles of 1000, 125763=Esomeprazole is the s-isomer of omeprazole. In four population-based cohort studies that included 1226 women exposed during the first trimester of pregnancy to omeprazole there was no increased risk of congenital anomalies., 25117=Rev. 11/2012, 205264=Indications and Usage, Treatment of GERD (1.1) 12/2011}",
    "textBeforeTable": "Number of versions: 1 NEXIUM- esomeprazole magnesium capsule, delayed release View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close REPACK(63629-3347) , RELABEL(63629-3347) 171714327 Bryant Ranch Prepack Business Operations ID/FEI Address Name Establishment Registrant - Bryant Ranch Prepack (171714327) Labeler - Bryant Ranch Prepack (171714327) 03/19/2001 NDA021153 NDA Marketing",
    "textAfterTable": "PSN 5 606728 Esomeprazole 20 MG Delayed Release Oral Capsule [Nexium] SBD 6 606728 Nexium 20 MG (as esomeprazole magnesium 22.3 MG) Delayed Release Oral Capsule SY 7 606728 Nexium 20 MG Delayed Release Oral Capsule SY 8 606728 Nexium 24 HR 20 MG Delayed release Oral Capsule SY Get Label RSS Feed for this Drug NEXIUM- esomeprazole magnesium capsule, delayed release To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=3a65d9b7-7a8d-4fc6-a290-50c3543dc485 To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To view updated drug label links, paste the RSS feed address (URL) shown below into a RSS reader, or use a browser which supports RSS feeds, such as Safari for Mac OS X. How to discontinue the RSS feed If you no longer wish to have this DailyMed RSS service, simply delete the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}