{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "Greek life is very popular here! I am involved in Greek life and it is such a good way to get connected on campus.",
            "Greek life is very popular at Western, and there are many volunteer and club activities you can get involved in.",
            "Any type of student would fit in at WKU.",
            "The kissing bridge is an awesome spot to take a first date! Rumor has it that if you kiss your date for the first time under the bridge, you're destined to marry that person!",
            "WKU is affordable, and offers a wide variety of majors and plenty of opportunities. However, the dorms aren't the cleanest and could use some updating, as could the food.",
            "There are plenty of things to do for fun in Bowling Green! You can go to the mall, go bowling, take a painting class, try hot yoga, etc. Campus Activities Board is always offering fun events on campus too, in case you don't feel like taking the shuttle or driving.",
            "The food choices are good, but get tiring. There are not enough healthy food options available for a meal swipe, or at easy access. Subway's lines are always very long, and the healthier restaurants are at the top of the hill or in Fresh...Fresh is decent, depending on the day you go.",
            "If you have a community bathroom...bless your soul. Sharing a shower with people who have no respect for others is horrible. Hair on the shower walls and in the drain, people not knowing how to flush or use the trash can, etc. However, this is probably true of most university community bathrooms.",
            "The class rigor depends mainly on the teacher and the subject. Higher level classes are obviously more difficult because they are for students that are majoring in that area. Use ratemyprofessor.com and it will give you a good idea on the class difficulty level.",
            "If you know you will be able to make it to class on time, schedule your classes for earlier in the morning. It may suck to be in class at 9 am, but it sucks even more to still be in class at 5 pm!"
        ]
    ],
    "pageTitle": "Western Kentucky University (Western) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Western-Kentucky-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00146-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 916055603,
    "recordOffset": 915925626,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{228639=I lived in the best and most recently renovated dorms on campus. Northeast and Southwest are the nicest on the inside. However there is this thing where the desk clerk has to see your ID when you enter the building because of a girl being murdered back in 2006. The windows do not open all the way because of a guy was on mushrooms and jumped out of his window from the 20th (or so) floor. It's a pain sometimes but it's also easy to get used to and forget all about it. The upperclassmen dorms are the best., 555545=I will attend dorm life in the Fall 2013., 46914=Don't cruise through General Ed. classes. The more you know of English, History, Geography, Psychology, Sociology, and other cultures, the more well-rounded you will be in your chosen field of work. The most important class you can take is English: being able to express yourself and write with confidence and good grammar., 585829=GO TO STUDENT ACTIVITIES. WKU has a rich history in sports. Big Red, WKU's mascot, has found his way into college bowl games in football, March Madness in basketball, and conference championships in Softball, Baseball, Swimming, Track, and Cross Country. If it wasn't enough that WKU keeps winning championships, the student body continues to support them every step of the way. Every game, the entire student body will pour into the arena, dressed in red, singing the Western fight song. You shouldn't ever have to leave campus to find something fun. Western's campus is always buzzing with opportunity., 722316=Get involved! After attending the ATP Freshmen Orientation there in late March, I realized there are so many activities, especially in the realm of intermural sports. Even if you're not on a varsity team of some kind, you can still get involved in the sport or program you love by starting a club or joining one that already exists., 763703=© 2015, Cappex.com, LLC, 161986=The food is alright. This fall 2012 we are supposed to get a panda express and Starbucks! We also have a subway and down the road there is McDonald's, Taco-bell, sonic and things in that area., 571341=Campus life is really awesome here at the hill. We have football games that all the students get into for free. Just this past year, I got to see Phillip Phillips in concert and I get to see Andy Grammar in concert in a few weeks. This campus is always bouncing with oppurtunities and there is always something to do., 474977=This university has brought a world of new exploration to mine. I'm living in Madrid after the abroad program I took in 2010 and I'm teaching English as well as a wedding photographer., 68225=I graduated in 1990 with an associate degree of science, nursing. The time I have had to reflect on my education at western was it is one of the best colleges in Kentucky. I was very fortunate to have been a student at Western.}",
    "textBeforeTable": "07/07/2009 Reviewer is A current student here. 27 out of 27 people found this review useful. 1 of 173 Kaitlyn from Louisville, KY Check out reviews left by other students or leave your own review. You could win a free scholarship. Western Kentucky University Reviews Western Kentucky University › Kentucky › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck Every penny is worth the education here. You can be sure that not only will you graduate feeling more confident about the knowledge you gained, but you will come away with life-altering experiences that will allow you to grow as an individual. WKU strongly supports study abroad and is always encouraging students to choose from hundreds of programs that will allow them to travel the world, while they obtain a few credit hours. There is even thousands of dollars in scholarship money available to help in several of these opportunities. Am enjoying being here WKU has a wide range of activities, organizations, and clubs to keep you interested throughout the year. Christian organizations to the performing arts groups to athletic clubs to Greek communities, you will be sure to find something that interests you enough to get involved immediately. Am learning a lot The faculty at WKU are highly skilled and most are personable with their students. It's obvious that they want to share their knowledge and they do this on a personal level by encouraging in-class discussions and questions. They let you know on the first day of classes of the easiest way to reach them, should you need anything throughout the semester. Then they",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}