{
    "relation": [
        [
            "Month",
            "Jan",
            "Feb",
            "Mar",
            "Apr",
            "May",
            "Jun",
            "Jul",
            "Aug",
            "Sep",
            "Oct",
            "Nov",
            "Dec"
        ],
        [
            "Climate",
            "Freezing Cold with Snowfall",
            "Very Cold",
            "Very Cold",
            "Moderately Cold",
            "Pleasant",
            "Pleasant",
            "Pleasant",
            "Pleasant",
            "Pleasant",
            "Moderately Cold",
            "Very Cold",
            "Freezing Cold"
        ],
        [
            "Details",
            "The weather during this month is very cold accompanied by occasional snowfall. This might not be the best time for tourism as the temperature is below freezing points and the area is prone to avalanche. Snowfall can also cause road blockage making it difficult for travelling.",
            "Winter season is accompanied by snowfall, which continues during this month in Srinagar. This might not be the most apt tourist season as the cold waves grip the region, making it uncomfortably cold. Tourists cannot enjoy the famous shikara ride as the Dal lake remains frozen. Newly married couples can look out for the best Srinagar honeymoon packages and enjoy a wonderful time.",
            "The temperature starts to rise but it is still very cold and might not be suitable for sightseeing or any other adventure activities. The skies remain clear and cold winds dominate. The ice begins to melt and the end of this month will see the beginning of the spring season. Snowfall has stopped but there will be snow on the ground.",
            "The tourist season for Srinagar begins from this month. The lakes have melted and the natural vibrancy is eloquent. The famous gardens comes back to life after a long winter break. The climate is cold during the morning but nights can be very chilly. Extra care is required if accompanied by kids or old people. Snow can be found on mountains and slightly higher slopes.",
            "The weather starts to get warm but is still in the comfortably cold range. This is the best time for enjoying sightseeing or indulging in the various adventure sports and tourist activities. Nights can be chilly so woolens are recommended. Snow can be found on higher altitudes.",
            "The weather continues to remain cool during the morning and can get chilly during the evenings. The sun and cloud play hide and seek in the sky and the region may receive short duration and light rainfall. A good time for enjoying various activities and the natural vista that prevails during this time. Go to high altitudes for enjoying snow.",
            "This is the warmest month of the year and is within the comfortable hot level. Srinagar is very beautiful at this time with lots of blue sky and very little rainfall. The whole valley is covered with mosaic of varying shades of green rice fields, low lying meadows and trees. Tourists interested in playing with snow, need to go to high altitudes but travelling to these places can be difficult.",
            "The weather of Srinagar in August can be categorized as cool and pleasant during the days and chilly during the night. The sky remains clear for most part of the day. Sun shines brightly and cool breeze keep the temperature under check. A good time for holidaying and enjoying the Shikara ride. Rainfall may occur but is not much of an annoyance.",
            "Rainfall have completely vanished and the region becomes dry. Autumn begins somewhere from the middle of this month and the greenery of the regions changes to gold and further to rustic red. One of the best time for tourism in Srinagar.",
            "One of the most beautiful months to visit the city. The climate is cool and pleasant and the sun shines brightly. Temperatures are comfortable with a cooling breeze. A good time for enjoying a splendid holiday in Srinagar, however care needs to be exercised if travelling with kids and old people. Honeymoon enthusiast can also book package for honeymoon in this month. Snow begins to accumulate at the slopes and high altitudes.",
            "The winter season begins and cold waves starts to tighten their grip on the city. Days are very cold and nights can be extremely chilly. Might not be the best time for travelling as the weather is cold beyond the comfort level. The region will receive snowfall from the mid of this month.",
            "This is one of the coldest month of the year and snowfall occurs. During this time the people of Srinagar shift to the winter capital, Jammu. The mercury goes down to the freezing points and snowfall can cause road blockages, disrupting travel."
        ]
    ],
    "pageTitle": "SRINAGAR Weather, Temperature, Best Season, Srinagar Weather Forecast, Climate",
    "title": "",
    "url": "http://www.mustseeindia.com/Srinagar-weather",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00132-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 608430091,
    "recordOffset": 608400681,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Srinagar Weather Home  ›  Destinations  ›  Jammu and Kashmir  ›  Srinagar  ›  Weather   var addthis_config = {services_compact: 'facebook,print,twitter,email,google,gmail,pinterest,blogger,stumbleupon,favorites,tumblr,more'}; register_onload(function(){hide_zedo_image()}); googletag.cmd.push(function() { googletag.display('div-gpt-ad-1325834386456-188'); }); }); googletag.enableServices(); googletag.defineSlot('/1008434/season-header-1-banner', [728, 90], 'div-gpt-ad-1325834386456-188').setTargeting('NetworkId', 'season').addService(googletag.pubads()); googletag.cmd.push(function() { add_comscore(); } el.parentNode.insertBefore(s, el); s.src = (document.location.protocol == \"https:\" ? \"https://sb\" :\"http://b\") + \".scorecardresearch.com/beacon.js\"; s.async = true; el = document.getElementsByTagName(\"script\")[0]; var s = document.createElement(\"script\"); function add_comscore(){ _comscore.push({ c1: \"2\", c2: \"15366170\" }); var _comscore = _comscore || [];  ",
    "textAfterTable": "View all photos Best Season: Apr - Oct Summer 14 to 30Â°C, Winter -2 to14Â°C Best Season / Best time to visit Srinagar Srinagar has only two climates, pleasant summers and a very chilly, freezing winters. Rainfalls are very scanty here. The best time to visit Srinagar is from April to October Winter (October to March) accounts for winters with minimum consistently well below 0Â°C and maximum only about 15Â°C. Winters are associated with heavy snowfalls. It may not be good period to book tour packages for Srinagar. During winter months the lakes are all frozen and snowfall can cause road blockages. Summer (April to September) are ideal for sightseeing and is the peak tourist season with a maximum temperature of 30Â°C and a minimum well below 14Â°C. Srinagar is a beautiful place and a major part of North India tourism. Summers are excellent time for visiting the lakes and beautiful gardens and the natural beauty is at its pinnacle in Srinagar. The winters on the other hand is extremely cold and freezing and not suitable for holidaying. Heavy",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}