{
    "relation": [
        [
            "",
            "Maraviroc QD",
            "Maraviroc BID",
            "Placebo"
        ],
        [
            "Description",
            "Maraviroc 150 or 300 milligrams (mg) tablet orally once daily (QD) in the evening, dose adjusted according to the other prescribed drugs taken by participants as part of optimized background therapy (OBT) selected according to local standard of care (3 to 6 drugs based on resistance testing, treatment history and safety considerations). Placebo matched to maraviroc tablet orally in the morning.",
            "Maraviroc 150 or 300 mg tablet orally twice daily (BID) in the morning and evening, dose adjusted according to the other prescribed drugs taken by participants as part of OBT selected according to local standard of care (3 to 6 drugs based on resistance testing, treatment history and safety considerations).",
            "Placebo matched to maraviroc tablet orally BID in the morning and evening, in combination with OBT selected according to local standard of care (3 to 6 drugs based on resistance testing, treatment history and safety considerations)."
        ]
    ],
    "pageTitle": "Trial of Maraviroc (UK-427,857) in Combination With Optimized Background Therapy Versus Optimized Background Therapy Alone for the Treatment of HIV-1 Infected Subjects - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00098722?sect=Xi0156&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00108-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 873550411,
    "recordOffset": 873534017,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups No text entered. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details No text entered. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: Maraviroc (UK-427,857) Drug: optimized background therapy Interventions: HIV Infections Condition: Allocation: Randomized;   Endpoint Classification: Safety/Efficacy Study;   Intervention Model: Parallel Assignment;   Masking: Double Blind (Subject, Caregiver, Investigator, Outcomes Assessor);   Primary Purpose: Treatment Study Design: Interventional Study Type: Results First Received: April 16, 2012  ",
    "textAfterTable": "Maraviroc BID, Open Label Participants from maraviroc QD, maraviroc BID and Placebo (double blind phase) who received maraviroc 150 or 300 mg BID in the morning and evening, dose adjusted according to the other prescribed drugs taken by participants as part of OBT selected according to local standard of care (3 to 6 drugs based on resistance testing, treatment history and safety considerations) during open label phase. In Study-off Drug (ISOD), Open Label Participants from maraviroc QD, maraviroc BID and Placebo (double blind phase) who received no study treatment along with OBT selected according to local standard of care (3 to 6 drugs based on resistance testing, treatment history and safety considerations) during open label phase. Maraviroc BID, Observation Phase Participants continuing from open label phase, who received maraviroc 150 or 300 mg BID in the morning and evening, dose adjusted according to the other prescribed drugs taken by participants as part of OBT selected according to local standard of care (3 to 6 drugs based on resistance testing, treatment history and safety considerations) during observational phase. In Study-off Drug (ISOD), Observation Phase Participants continuing from open label phase, who received no study treatment along with OBT selected according to local standard of care (3",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}