{
    "relation": [
        [
            "POSITION OF BAND",
            "Head or shoulder",
            "Shoulder, above red band.",
            "Body",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "COLOUR OF BAND",
            "Red",
            "White",
            "Green",
            "Bright yellow",
            "Two green with bright yellow between.",
            "Black zig-zag",
            "Two bright yellow",
            "White, 1/4-inch wide",
            "White, 1-inch wide"
        ],
        [
            "NATURE OF PROJECTILE",
            "All shell filled explosive.",
            "S.A.P.C.",
            "",
            "Practice and target smoke.",
            "H.E., special bombardment practice.",
            "H.E. Radar",
            "Target ship practice.",
            "15-inch",
            "14 and 16-inch"
        ],
        [
            "DENOTING",
            "Shell is filled with explosive.",
            "S.A.P.C. shell.",
            "Shell is filled with T.N.T.",
            "Shell is for practice firings.",
            "Shell is tilled with T.N.T. (green) and is for practice firings (yellow).",
            "Radar Shell",
            "Suitable for practice firings at target ships.",
            "Centre of gravity.",
            "Position for grab."
        ]
    ],
    "pageTitle": "The Gunnery Pocket Book - Part 2",
    "title": "",
    "url": "http://www.maritime.org/doc/br224/part2.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00244-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 575102891,
    "recordOffset": 575064664,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{109406=Copyright © 2013, Maritime Park Association. All Rights Reserved. Legal Notices and Privacy Policy Version 3.00}",
    "textBeforeTable": "203. The following coloured bands are painted round projectiles:- (i) Old Method.   66   Shell filled with shellite. Green cap or point Shrapnel Shell. Red point The points or caps of shell are painted the same colour as the body, with the following exceptions:- Smoke Shell (new method only). Green All shell filled with gunpowder and practice projectiles. These include Star Shell, Shrapnel, Practice, H.A,. Practice, and Smoke Shell (old method only). Black All shell filled with high explosive. These include A.P.C., C.P.B.C., C.P.C., S.A.P., S.A.P.C., and H.E. Dull Yellow TRACERS AND IGNITERS. 201. To enable the flight of the projectile to be seen, a tracer may be fitted into the base. A tracer consists of a small tube or disc filled with tracer composition, which is ignited when the gun fires. The igniter is a device to ensure self-destruction of the shell if the fuze has not operated by a given time. The tracer and igniter is a similar device combining the functions of tracer and self destruction. COLOURING AND MARKING ON PROJECTILES. Plate 19. 202. In order that they may readily be distinguished, types of projectile are",
    "textAfterTable": "(ii) Present Method. POSITION OF BAND AND MARKING COLOUR OF BAND AND MARKING NATURE OF PROJECTILE DENOTING Head or Shoulder Red - Shell is filled with explosive. Shoulder above red band White S.A.P.C. and S.A.P. S.A.P. Shoulder, above and below red band. White A.P. and A.P.C. A.P. or A.P.C. shell. Shoulder or body Green or black and green. - Shell filled T.N.T. or head filled T.N.T. Shoulder or body Black zig zag H.E. H.E. (Radar) shell. Blue H.E Shell filled RDX/BWX. Blue with T.N.T. stencilled below band. H.E. Shell filled RDX/T.N.T. Bright yellow Practice Shell is for practice firings. Above driving band Red Tracer shell Fitted with live tracers. Body Two green with bright yellow between. H.E. special bombardment practice. Shell is filled with T.N.T. (green) and is for practice firings (yellow). Body White, 1/4-in. wide 15-inch Centre of gravity. White, 1-in. wide 16-inch Position for grab. (G. 6619/46.-A.F.P. P.75147.   67   \"Starshell have a green or red star painted on a white circular background.\" The letter \"S\" on a white circle",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}