{
    "relation": [
        [
            "Timestamp",
            "2008-05-13",
            "2008-05-12",
            "2003-09-04"
        ],
        [
            "Action",
            "Added",
            "Deleted",
            "Added"
        ],
        [
            "Category",
            "DEFINITION",
            "DEFINITION",
            "DEFINITION"
        ],
        [
            "Detail",
            "The synthesis of antisense RNA, an RNA molecule complementary in sequence to another RNA or DNA molecule, which, by binding the latter, acts to inhibit its function and/or completion of synthesis, on a template of DNA.",
            "The synthesis of antisense RNA, an RNA molecule complementary in sequence to another RNA or DNA molecule, which, by binding the latter, acts to inhibit its function and/or completion of synthesis, on a template of DNA.",
            "The synthesis of antisense RNA, an RNA molecule complementary in sequence to another RNA or DNA molecule, which, by binding the latter, acts to inhibit its function and/or completion of synthesis, on a template of DNA."
        ]
    ],
    "pageTitle": "GO:0009300 antisense RNA transcription",
    "title": "",
    "url": "http://www.ebi.ac.uk/QuickGO/GTerm?id=GO:0009300",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00047-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 408051311,
    "recordOffset": 408025245,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{122673=Copyright (c) EMBL-EBI 2013 | EBI is an Outstation of the European Molecular Biology Laboratory | Privacy | Cookies | Terms of use, 122540=EMBL-EBI, Wellcome Trust Genome Campus, Hinxton, Cambridgeshire, CB10 1SD, UK +44 (0)1223 49 44 44}",
    "textBeforeTable": "Usage of this term is subject to the following annotation guidelines: Annotation Guidance GO:0009300 Wiki Page GONUTS The synthesis of antisense RNA, an RNA molecule complementary in sequence to another RNA or DNA molecule, which, by binding the latter, acts to inhibit its function and/or completion of synthesis, on a template of DNA. Definition Biological Process Ontology antisense RNA transcription Name GO:0009300 ID Term Information Dataset Web Services P06727 tropomyosin Search for proteins by name or accession: GO:0006915 apoptosis Search for terms by keyword or ID: Term Basket",
    "textAfterTable": "Key ShowHide GO IDs ShowHide Term box width Term box height Slim colours ShowHide Show children ShowHide Image size limit (in megapixels) Note that setting the limit too high may result in images being generated slowly; it may even cause the browser to crash. The maximum limit is 20 megapixels. Child Terms This table lists all terms that are direct descendants (child terms) of GO:0009300: Relationship To GO:0009300 Child Term Child Term Name Regulates GO:0060194 regulation of antisense RNA transcription Negatively regulates GO:0060195 negative regulation of antisense RNA transcription Positively regulates GO:0060196 positive regulation of antisense RNA transcription Protein Annotation",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}