{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "the campus feels very safe.",
            "greek life does a lot on campus. parties and open mic nights are the best.",
            "go to parties and participate in whats going on on campus.",
            "the food on campus is okay. i wish we had more food places to choose from on campus.",
            "dorm is different from life at home. it's more freedom but you are also living with other people. so you have to balance it out between you and your roomates.",
            "general business.",
            "make sure you have everything you need for your dorm. and get ready to meet new people.",
            "csu is a great school. it offers many facilities for students such as a computer lab and library. i would rate the school a eight."
        ]
    ],
    "pageTitle": "Columbus State University (CSU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Columbus-State-University/reviews?_escaped_fragment_=/show/94014",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00125-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911603323,
    "recordOffset": 911535854,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{262650=Classes are not very challenging. Georgia, especially Columbus, does not have strict academics, and CSU seems to be trying to dumb down their curriculum to prevent students from dropping out as quickly. You will occasionally find challenging classes, such as Dr. Luck's U.S. History to 1865 class., 125561=Columbus State University is not what I expected it to be from my summer 2010 orientation. It is a little better than I expected and a little worse. However, I cannot imagine being anywhere else, I thought about transferring for my sophomore year, for a different experience, but I just didn't want to have to start over, when I like how things are at the school I am at., 258648=Greek life on campus is very active. Every September, the sororities have a sorority rush event to recruit new members. The sororities and fraternities often sponsor campus events, mostly at the beginning of the Fall term and the end of the Spring term., 176245=Every year we have the welcome back cougar kickoff event which lasts the first two weeks of classes and has many events such as comedy night, day of service, freshman convocation, lunch with the president, etc. Also every October Kappa Sigma fraternity hosts a shave to save, breast cancer awareness event at the clock tower., 121616=There is a shuttle bus that takes students to Main Campus and the Downtown Campus if they do not have a car or would just like to save a little gas money. There is also an exceptional gym that was opened in the Spring 2011 semester so it is fairly new, 158541=The dining hall on Main Campus is a typical dining hall with many choices. Only about once a week is there a day when I am not satisfied eating there. On the RiverPark campus The Den is undergoing major changes for the fall 2012 semester that is supposed to improve the choices, quality, and atmosphere for the students on that campus., 326501=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/20/2009 Reviewer is A current student here. 20 out of 21 people found this review useful. 1 of 77 Alex from Stockbridge, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Great for these types of students Average (academically) Diversified Tips for prospective students Get a campus map the day you enroll and get familiar with it. Be on time for class. Have the will to learn and you will succeed at this college, that is a guarantee. It's not a college that kicks you in the rear everyday. It's more of a college that just wants you to learn fast and easy. It's not Harvard and it's not hard. The professors want you to learn but they don't try to kill you in the process. Bang for the buck Columbus State University is definitely a bang for the buck college. Everything about CSU is great. The one and only complaint I have is that the cafe is not the greatest restaurant to eat at when you get hungry. However, there is a Popeyes Louisiana Kitchen right across from the cafe which is so delicious. There is also a restaurant called Einstein Bros. which offers foods like sandwiches and bagels as well as drinks such as chilled cappuccinos. CSU is by far the best university to enroll in if you want to gain intellect, intelligence, and all other key factors that will prepare you for your occupation. All of this is offered without stealing your hard earned cash from your wallet...or purse.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}