{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I've yet experienced any malicious foul play at CSU.",
            "Due to my at home commitments (child), I'm unable to partake in clubs and activities.",
            "CSU is an university for all age groups.",
            "The newly remodel library is amazing.",
            "Due to my age/maturity and being a single parent, I don't participate in the student life activities. However, based upon my fellow classmates, student life is pretty exciting.",
            "I bring lunch from home.",
            "I live off campus.",
            "The instructors I've had the privilege to obtain knowledge from were definitely challenging.",
            "The advise I offer potential students is to visit the campus to in order to get a feel of it. Afterall, selecting an educational institution is one of the most important decision one will make in their life.",
            "CSU is an affordable university. The guidance counselors and instructors I've encountered with are awesome. The relationships I'd established with former classmates were a blessing."
        ]
    ],
    "pageTitle": "Chicago State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Chicago-State-University/reviews?_escaped_fragment_=/show/77084",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00075-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900961091,
    "recordOffset": 900922984,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{177861=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/02/2009 Reviewer is Researching this school. Reviewer has not been to campus. 11 out of 16 people found this review useful. 1 of 44 Tatiana from Chicago, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new",
    "textAfterTable": "Juan from Chicago, IL 01/30/2012 Reviewer is A current student here. 7 out of 7 people found this review useful. 3 of 44 Categories Comments Campus Safety safety is one of the top priorities at chicago state university. be ensured that the students and staff are always in good hands with the fine men and women from the illinois state police depatrment stationed on campus. Bang for the buck chicago state university exceeds expectations. student life at chicago state university will open your eyes to culture, ideas, and better life choices. What to do for fun a student can choose from a number of clubs and societies to join. the recreation center is always a hit for any athlete. the clubs at chicago state university organize events, concerts, and luncheons. Food and Dining chicago state university is known for having exquisite food options. lunch and dinner are, probably, the meal times when the cafeteria",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}