{
    "relation": [
        [
            "First Name",
            "James",
            "Heather",
            "Jason"
        ],
        [
            "Last Name",
            "Donnellan",
            "Wingate",
            "Cole"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=0850AA9A-EA7E-4C3F-9A88-25652CE9DBB6&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00258-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 226881432,
    "recordOffset": 226873230,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{77029=H.R. 1982 - The Medicare Secondary Payer and Workers Compensation Settlement Agreements Act: all provisions, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 18691=S. 635, H.R. 749 - Eliminate Privacy Notice Confusion Act: all provisions. Bipartisan Budget Act of 2013 (amendment to H.J. Res. 59) - Section 203, restrictions on access to death master file., 36134=Federal Reserve Rulemaking on Regulatory Capital Rules: Regulatory Capital, Implementation of Basel III, Minimum Regulatory Capital Ratios, Capital Adequacy, Transition Provisions, and Prompt Corrective Action (FRS Docket No. R-1438 & RIN 3064-AD95); Standardized Approach for Risk-weighted Assets; Market Discipline and Disclosure Requirements (FRS Docket No. R-1442 & RIN 3064-AD96); Advanced Approaches Risk-Based Capital Rule; Market Risk Capital Rule (FRS Docket No. R-1442 & RIN 3064-AD97), 72719=S. 1217 - the Housing Finance Reform and Taxpayer Protection Act of 2013: all provisions. Housing finance reform legislation in development at Senate Banking - no bill yet, 46360=S.1270 - The Secure Annuities For Employees (SAFE) Retirement Act of 2013; Retirement Security Act of 2013 and Security Throughout Retirement Act (no bill numbers): all provisions. USA Retirement Funds - HELP committee white paper - full proposal., 74907=H.R. 2767 - the Protecting American Taxpayers and Homeowners (PATH) Act: all provisions, 79173=Public Law 112-242, the SMART (Strengthening Medicare and Repaying Taxpayers) Act of 2012 - changes to Medicare Secondary Payer system ensuring proper implementation, 70631=H.R. 2374 - Retail Investor Protection Act: all provisions, 25942=Implementation of Financial Regulatory Reform Dodd-Frank Wall Street Reform and Consumer Protection Act (2010 HR 4173/S 3217): derivatives, systemically important, orderly liquidation, prudential requirements, Federal Insurance Office study, 67296=H.R. 2140 - the Insurance Capital and Accounting Standards Act of 2013: all provisions, 81389=FCC Rules amending the Telephone Consumer Protection Act of 1991 (FCC 12-21): full rules, 42009=S.226, H.R. 515 - Parental Bereavement Leave Act; S.631, H.R. 1286 - Healthy Families Act: all provisions, 63222=S. 1369 - to provide additional flexibility to the Board of Governors of the Federal Reserve System to establish capital standards that are properly tailored to the unique characteristics of the business of insurance, and for other purposes: all provisions, 48628=S. 1145, H.R. 2171 - Lifetime Income Disclosure Act: all provisions, 14318=H.R. 537- Social Networking Online Protection Act; H.R. 624 - Cyber Intelligence Sharing and Protection Act; H.R. 756 - Cybersecurity Enhancement Act; H.R. 2720 - Alexis Agin Identity Theft Protection Act of 2013 (Death Master File): all provisions, 44164=H.R. 1406 - Working Families Flexibility Act; H.R. 517 - Federal Employees Paid Parental Leave Act; H.R. 675 - Part-Time Workers Bill of Rights: all provisions}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20036 Country USA 3. Principal place of business (if different than line 2) City  1095 Avenue of the Americas State  NY Zip Code  10036 Country  USA 4a. Contact Name b. Telephone Number c. E-mail  Ms.  Clara Cortes  2125786433  ccortes@metlife.com 5. Senate ID#  40032280-12 7. Client Name Self Check if client is a state or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}