{
    "relation": [
        [
            "--:--",
            "15:00",
            "15:30",
            "18:30"
        ],
        [
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "EP plenary in Strasbourg",
            "ALDE WGC meeting",
            "ALDE group meeting",
            "DROI subcommittee meeting"
        ]
    ],
    "pageTitle": "ALDE \"EU 2020\" StrategyALDE \"EU 2020\" Strategy - ISSUES - Leonidas Donskis",
    "title": "",
    "url": "http://www.donskis.lt/p/en/2/2/98?y=2012&m=5&day=21",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00247-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 408514239,
    "recordOffset": 408500643,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{2249=At the Commission`s presentation on the annual progress reports in January 2009, the Commission stated that recent member states` efforts to implement the Lisbon Strategy provided \"a strong basis\" for the future. In reality, the EU`s goal of becoming the most dynamic knowledge-based economy by 2010 is no more than an illusion.The figures in the Commission report reveal that the member states are far from implementing the agreed Lisbon Strategy-policy. The EU`s target of ensuring that 70% of Europeans take part in the labour market appears out of reach since the current rate is 65.5%. In areas that are seen as key to keeping Europe competitive, like R&D investment and high-speed Internet access,there is stagnation. Spending on R&D and innovation remains at a stable low of 1,84% of GDP, with only Sweden and Finland performing above the 3% agreed in the Lisbon Strategy., 7116=Guy Verhofstadt Group Leader of the Alliance of Liberals and Democrats for Europe To proceed reading the full ALDE EU 2020 Strategy, 6810=In March 2010 the Commission will present its final \"EU 2020\" strategy. By coming forward with bold proposals to put the European Commission in the driver seat of economic growth and jobs in the next decade, it will find a strong ally in the Alliance of Liberals and Democrats for Europe.}",
    "textBeforeTable": "2012.05.21 AGENDA         31 30 29 28 27 26 25 24 23 22 21 20 19 18 17 16 15 14 13 12 11 10 9 8 7 6 5 4",
    "textAfterTable": "Search Stay Connected    ",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}