{
    "relation": [
        [
            "Condition:",
            "Material:",
            "UPC:"
        ],
        [
            "New with tags: A brand-new, unused, and unworn item in the original packaging (such as the original box or bag) and/or with the original tags attached. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "Leather",
            "886350525345"
        ],
        [
            "Shoe Type:",
            "Brand:",
            ""
        ],
        [
            "Sneakers",
            "New Balance",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.com.au/itm/Cheap-New-Balance-Mens-Wide-2E-Leather-Tennis-Shoes-Sneakers-MC549WP/190904722980?_trkparms=aid%3D222007%26algo%3DSIC.MBE%26ao%3D1%26asc%3D20140106155344%26meid%3D8270777140540079075%26pid%3D100005%26prg%3D20140106155344%26rk%3D1%26rkt%3D6%26sd%3D181339935419&rt=nc",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00089-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 425768283,
    "recordOffset": 425729773,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  14 Aug, 2014 15:06:08 AEST  Seller assumes all responsibility for this listing. 190904722980 eBay item number: Postage and payments Description current Report item - opens in a new window or tab Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window or tab",
    "textAfterTable": "  Not getting the results you expected from your current tennis sneakers? Upgrade to a pair of the New Balance® MC549 and see what they can do for your game! Perforated leather upper is lightweight and breathable. Padded collar and tongue offers enhanced cushioning and added comfort. Mesh lining and a cushioned insert for all-day comfort. ABZORB® cushioning in the midfoot provides exceptional shock absorption. Long-wear drag toe-tip helps protect the toe box area. Ndurance® rubber compound for maximum outsole durability. Herringbone tread pattern allows increased traction for lateral motion and quick pivoting. Non-marking rubber outsole. Measurements: Weight: 360 g Product measurements were taken using size 10, 2E - Wide. Please note that measurements may vary by size. Questions and answers about this item No questions or answers have been posted about this item. Ask a question - opens in a new window or tab Seller assumes all responsibility for this listing.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}