{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Security always on watch.",
            "None",
            "SCORPION GOLF!!!",
            "Someone who is looking for a relaxed enviroment and willing to study. Social life is not the primary focus here, it is more about the studies.",
            "It is located on an old battle site, supposeably haunted.",
            "Really affordable and cheap for all students.",
            "The beach is just a few minutes away!!!",
            "Only one restaurant on campus and is fairly expensive.",
            "The dorms looked gorgeous. They are extremely spacious and have a lot of character to them",
            "From what I hear, the course work is not the toughest but does require some effort.",
            "Be prepared for any tasks given to you. Make sure to complete and turn in any forms as soon as possible.",
            "The University is beautiful and full of life. It has a lot of historical value to it. I know I will enjoy my time here"
        ]
    ],
    "pageTitle": "The University of Texas at Brownsville Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-University-of-Texas-at-Brownsville/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00192-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905461115,
    "recordOffset": 905388675,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17391=There are several traditions we have that most of other parts of the nation don't even know about. For example, Charro Days is a very fun and exciting festival we celebrate at the end of February each year. Students are actually out of school for a couple of days due to this holiday. We have parades, small concerts, carnivals, and many more stuff. This area is highly influenced by the Mexican culture since we are only five minutes away from Mexico., 134920=Yes, students would be curious as to how and why these practices take place. Also, we get to have three mini carnivals, two circuses, and quite a few parades in town. Parades are around mid February and the other parade in December., 272323=The University of Texas at Brownsville, has a very important place in my life, it means the opportunity for a better tomorrow. Nowadays,it is extremely important to have a college degree or technical certification, in order to find a well paid job. I would describe my life in two phases, before and after UTB, my life is better unfortunatelly, I didn't had the money to attend last semester Spring 2013, but hopefully I can attend this Fall 2013., 338562=There are tons of activites and charity organizations on campus! We have outdoor movie nights with free munchies, parties at the doorm pool, and something us ocelots like to call Orange Crush. It is a party the first week of school with games, free food, music, and many other things. Not to mention, we have the 2013 NAIA Volleyball Champions!, 203430=I personally don't live at the dorms, but they used to be an amazing apartment complex that I used to constantly be at, and it was built in 2011., 399742=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/31/2011 Reviewer is A current student here. 6 out of 7 people found this review useful. 1 of 107 Eric from Brownsville, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\");",
    "textAfterTable": "Am learning a lot Despite what many people say about the teachers at this University, I truly believe that I have received a quality education here thus far :) Login to rate or flag the reviews Liz from Brownsville, TX 07/22/2011 Reviewer is A current student here. 4 out of 5 people found this review useful. 3 of 107 Categories Comments Great for these types of students Anyone who wants to save some money. Tips for prospective students There are many scholarships available and a lot of opportunities for financial aid. Stay informed! Bang for the buck Tuition and fees are lower than other places. Am enjoying being here The campus is beautiful. Am learning a lot The professors do their job.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}