{
    "relation": [
        [
            "Particulars",
            "To Opening Stock To Purchases To Direct Expenses To Gross Profit",
            ""
        ],
        [
            "Amount (in Rs)",
            "20,000 2,48,000 54,000 1,08,000",
            "4,30,000"
        ],
        [
            "Particulars",
            "By Sales By Goods Unused By Closing Stock",
            ""
        ],
        [
            "Amount (in Rs)",
            "3,80,000 14,000 36,000",
            "4,30,000"
        ]
    ],
    "pageTitle": "Ascertainment of Cost of Goods Sold. Trading account : Direct Incomes/Expenses",
    "title": "",
    "url": "http://www.futureaccountant.com/final-accounts-financial-accounting/study-notes/trading-account-cost-goods-sold-ascertainment.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 457821199,
    "recordOffset": 457804805,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31034=The accounting period ends on 31st December 2006.}",
    "textBeforeTable": "Cr Trading a/c Dr Such an ascertainment of Gross Profit is done in the Trading and Profit and Loss account. Thus we do not specifically need to calculate the value of cost of goods sold for finding gross profit, only its affect is to be brought into account. (Sales + Closing Stock + Stock Unused for trading) − (Opening Stock + Purchases + Direct Expenses) = Sales − Opening Stock − Purchases − Direct Expenses + Closing Stock + Stock Unused for trading = Sales − (Opening Stock + Purchases + Direct Expenses − Closing Stock − Stock Unused for trading) = • Gross Profit Substituting this in (1) we get, • Bypassing finding Cost of Goods Sold Cost of Goods Sold = Opening Stock + Purchases + Direct Expenses − Closing Stock − Stock Unused for trading ⇒ To obtain the value of gross profit we need the figures of cost of goods sold and sales. By definition Gross Profit = Sales − Cost of Goods Sold   ← (1) • Gross Profit = Sales − Cost of Goods Sold    ",
    "textAfterTable": "\"Purchases a/c\" is a nominal account with a debit balance and is a direct expenditure (for stock). Since Purchases a/c is closed by transfer to the Trading a/c, it appears on the debit side of Trading a/c. Transferring a debit balance from one account to a second results in the second account being debited and the first account being credited. Thus, all the accounts representing the figures that are added to purchases appear on the debit side \"Sales a/c\" is a nominal account with a credit balance and is a direct income. Since Sales a/c is closed by transfer to the Trading a/c, it appears on the credit side of Trading a/c. Transferring a credit balance from one account to a second results in the second account being credited and the first account being debited. Thus, all the accounts representing the figures that are added to sales appear on the credit side » Finding Cost of Goods Sold in such cases Cost of goods sold is a figure that is not straight away available in the books of accounts used in financial accounting. That figure can be obtained either from the \"Trading a/c\" or by preparing a separate ledger account to specific account which",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}