{
    "relation": [
        [
            "First Name",
            "Aaron",
            "Alfred"
        ],
        [
            "Last Name",
            "Harris",
            "Campos"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=06C2B138-C248-436D-9C18-986D660DF678&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00222-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 238505130,
    "recordOffset": 238496928,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12225=302(b) allocations, budget, FY 2014, Education Funding, Immigration, DofEd budget Duncan testifying, Ed & Workforce questions for Sec. Duncan, Fiscal Cliff, Sequester, Tax Reform, FY 14 Education Funding, FY 14 Funding, House Approps, Labor-HHS-Education, Opposing defunding the Deferred Action for Childhood Arrivals Act, POTUS Budget proposal, Sec. Duncan hearing, Swearing in open house, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 52173=Social Security Fairness Act, ESEA, GPO/WEP, HR 1795, S 896, HR 566, Pensions, Retirememtn Security, 16985=S. 123, HR 1755, ENDA, Voting Rights, Election Reform, 24909=General Education Issues, Fiscal Cliff, ESEA, Sequester, Eduation Legislation, CIR, Charter Schools, School Saftey, Immigration, STEM, ESP of the Year Award, Gun Saftey, Gun Violence Prevention, HR 1977, HR 1470, HR 1565, HR 2317, HR 2515, HR, 2669, HR 551, HR 5, HR 1763, HR 1947, HR 1967, HR 167, Schools of the Future, Mental Health Awareness and Improvement Act of 2013, Schools of the Future, DOD School furloughs, S 1094, S 1101, S Res 126, S. 1003, S. 649, S. 744, S. 953, Student Loans, 33274=Perez Nomination, General Labor Issues, HR 1120, HR 2342, ESEA,}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20036 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mrs.  MARY KUSLER  2028227031  mkusler@nea.org 5. Senate ID#  27731-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}