{
    "relation": [
        [
            "Parameter",
            "server",
            "debug",
            "uid",
            "token",
            "secure",
            "usessl",
            "allow_alert_only",
            "allow_attachments",
            "enable_moderator",
            "messenger_bean",
            "domain",
            "gateway_url"
        ],
        [
            "Default Value",
            "127.0.0.1",
            "FALSE",
            "",
            "",
            "FALSE",
            "FALSE",
            "FALSE",
            "TRUE",
            "TRUE",
            "",
            "null",
            "null"
        ],
        [
            "Description",
            "The Instant Messaging server host and port.",
            "If this parameter is set to true, the applet records all the task performed on java console.",
            "This parameter is used for SSO.",
            "This parameter contains the SSO token and is used for auto-logon.",
            "Indicates to the Instant Messenger that it is run in SRA mode. It displays a security indicator.",
            "Tells Instant Messenger to use legacy SSL when connecting to multiplexor.",
            "Tells Instant Messenger to let end user display neither the contact list nor the news channel. This parameter is used in CHAT and POPUP flavors.",
            "Allows file attachment and transfer.",
            "If set to true, enables the moderated conference feature.",
            "This parameter contains a list of messenger beans to be used. You can enter multiple factory class names with each separated by a comma.",
            "This parameter is used in multidomain Sun Java System Access Manager deployments. The value of this parameter should be the logical domain name of the organization in which this end user is present.",
            "This parameter contains the URL of the gateway component of portal SRA."
        ]
    ],
    "pageTitle": "Chapter 15 Managing Instant Messenger (Sun Java System Instant Messaging 7.2 Administration Guide)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19566-01/819-4412/6n6ikpt44/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00122-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 72669147,
    "recordOffset": 72650165,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 27 Jan 2011 01:19:54 GMT",
    "textBeforeTable": "im-svr-base/html Table 15–1 Instant Messenger Resource Files in Table 15–1 contains the list of Instant Messenger files in the resource directory (im-svr-base/html). It also contains the description and customization information for these files. Within the resource directory, the /locale subdirectory is represented generically in a directory path as lang, but specifically as abbreviations of languages, such as, en_US, jp, and fr_FR. The Instant Messenger resource files are located within a directory referred to as the resource directory or im-svr-base/html. Instant Messenger Resource Files This section describes the Instant Messaging server files you can modify to customize Instant Messenger. The files that you can customize are all located in the resource directory im-svr-base/html directory. See Table 3–1 for information on default directory locations. Customizing User Name and Group Name Display Rebranding Instant Messenger Customizing the Application (Java Web Start) Launching Instant Messenger Using Sun Java System Access Manager SSO Customizing the index.html and im.html Files Instant Messenger Resource Files You can customize Instant Messenger to meet your requirements in the following ways: Instant Messenger is customizable. HTML and JNLP files can be customized to suit an organization's specific needs. If you want to customize the resource files for your deployment, you should run the configure utility (if you",
    "textAfterTable": "jnlpLaunch.jsp If an end user is already logged into Sun JavaTM System Access Manager, this file can be used to allow single sign-on and to launch Instant Messenger using Java Web Start. Yes  pluginLaunch.jsp If an end user is already logged into Sun Java System Access Manager, this file can be used to allow single sign-on and to launch Instant Messenger using Java Plug-in.  Yes  index.html The splash page for an LDAP deployment. It contains links to im.html and im.jnlp, as well as documentation links to windows.htm, solaris.htm, and quickref.htm. You can customize this page for your site’s requirements. Yes  index.html.template The template version of index.html. No  lang/imhelp/SunONE.jpg The image used by quickref.htm, solaris.htm, and windows.htm. Can be replaced, but not modified.  quickref.html solaris.html windows.html Located in lang/imhelp/, these files provide documentation on getting started with Instant Messenger. Yes  lang/imhelp Instant",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}