{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Make sure you look up all the different programs and opportunities Duke has to offer!",
            "This university is one of the best well-rounded university. With renowned professors in every field, students are able to gain helpful mentoring through their dreams and aspirations. The student body consists of students who love to be active in social issues, basketball games, and community service."
        ]
    ],
    "pageTitle": "Duke University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Duke-University/reviews?_escaped_fragment_=/show/16597",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00176-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892119591,
    "recordOffset": 892058050,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39332=In general, dorm life is pretty standard. There is a new housing model (will be starting in the 2012-2013 school year) that is intended to foster stronger bonds between people living in the same dorm. There is also a brand-new dorm on West Campus with beautiful rooms that people are very excited about., 109436=First of all, Duke is a very difficult school to get admission into. This school is the most selective university in the Southern United States. If you are submitting SAT scores, you MUST submit results of SAT II Subject Tests (2 tests required.) Failure to meet this will potentially jeopardize your application. To get in, you should have a consistent record of high academic achievement and perfect SAT scores for a competitive application. At the same time, don't worry if you don't have a 4.0 GPA and a 2400 SAT score - Duke's admissions are entirely holistic and are really much concerned who you are as a person. Strengths in other areas will compensate for grades that are less than ideal. Duke loves the academically motivated and intellectually curious student who is often willing to undertake challenges. That student should be able to be challenged by their peers/professors as much as they are willing to challenge them. Last of all, you should dedicate yourself to one or two activities you love and demonstrate only one thing: Impact. Remember that Duke, along with other universities such as Princeton, Yale, MIT all look for future leaders who are willing to make a difference in their community., 268411=- Go to the activity fair to see what is available for you to join on campus, and you get a lot of cool free stuff - Join Greek Life! - Go to as many sporting events as possible. Even if you are not that into sports, the energy and vibe at the games is something that makes Duke unique. - Try to ration your food points Freshman year, in March when you just can't possibly eat at the Marketplace any more you will be happy to still have another option -If you have a car, bring it. It's sometimes nice to get off-campus to go grocery shopping at the nearby Target or Kroger, and there are two malls about 10-20 minutes away, 222739=Tenting: http://en.wikipedia.org/wiki/Krzyzewskiville http://dukegroups.duke.edu/kville/k-ville-tenting-policy-2010-2011/, 280710=© 2015, Cappex.com, LLC, 201991=Use your AP and IB credits; Duke is not somewhere you want to retake a course. Be prepared to be in the midst of literally 1500 high school valedictorians in your class alone. Everyone works hard and really cares about their performance, so don't think you'll be able to breeze through.}",
    "textBeforeTable": "08/16/2009 Reviewer is A current student here. 61 out of 68 people found this review useful. 1 person found this inaccurate. 1 of 70 Student at Duke Check out reviews left by other students or leave your own review. You could win a free scholarship. Duke University Reviews Duke University › North Carolina › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck It's a brand name college. Once you climb those college rankings, the price is inescapable. Duke provides lots of great services and opportunities that you might not find elsewhere, but I wouldn't value it at $50,000 a year. Am enjoying being here At Duke I feel like there are so many opportunities waiting for me. There's a very active student body involved in all sorts of activities like sports, community service, publications, etc. The campus feels alive. As for the social atmosphere, it's pretty diverse. People have many different sides. For example, you can have intellectual conversations with the same person who plays beer pong with you every weekend. Bookworms aren't afraid to party hard, though sometimes people who like to party aren't receptive to academic talk outside of the classroom. If you don't like the party scene, you can definitely find your niche, though it may take a semester or even longer. Am learning a lot Duke is well-rounded and has many great departments, so you don't need to come in knowing what you want to do. Duke is a great place to explore your passions and discover things you never knew about yourself and the world.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}