{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There have been some incidents at ISU, but for the most part it is very safe. I always felt safe walking home, even at night- though I don't recommend it. Campus police send out notifications every time there is an incident and state where the incident happened. You will know the places NOT to go. Always have a buddy, though, no matter what. Because no matter the place you are, you just never know what people are going to do.",
            "I was not part of a fraternity or sorority, but I saw many people who were, and heard many stories about the things that happened. If that is your forte, GO FOR IT. Illinois State's Greek organizations will welcome you with open paddles...I mean arms.... ;)",
            "There is something for everyone, always.",
            "All students can make a home here. Illinois State is welcoming, inviting, and loving. I am so glad I spent my time here. I highly recommend the English department if you are interested in anything of the sort. Most of my classes were in English and the teachers are just phenomenal. Philosophy students raved about their teachers as well. Come to think of it, I hardly ever heard a bad word about a teacher of any subject. I think they probably all just seriously rock.",
            "Oh, you'll see. Illinois State is very unique.",
            "You can have fun even without a buck. There is always something to do around campus, always free shows and events, and always people looking for friends to have some fun with.",
            "Go out! There are ridiculous amounts of extracurricular activities that you will LOVE to do! Some are school oriented (like a French group) and some are definitely not (like a comedy group). No matter what you like, there's always a group or a person who will want to do it with you. Also, when you turn 21, the bars are super.",
            "Most of the food on campus is amazing, even the dorm food. The cooks like to change it up so you never get bored with the menu.",
            "Depends what dorm you live at. Atkin is quiet, small, and good for someone who wants to know all the people on their floor. It's more of a relaxed, laid back dorm. Some of the other dorms, especially Watterson, are more party oriented. Choose what type of college lifestyle you want to live, and then do your research to pick which dorm is right for you.",
            "The teachers know what they are talking about, and they want you to learn and grow as a student and an individual. Some classes are tough, but always worth it. As long as you show that you are trying, almost all of the teachers are willing to give you extra help, advice, or whatever you need. They care about your education just as much as you do.",
            "Go to the quad as much as humanly possible. Every single type of tree that exists in Illinois is on the quad; read a book under one of them. Don't party too much, but don't be a hermit either: be a good student but remember to have fun as well, because college is about the experience and the people you meet. Treat every class you take like it is a gift. Your time here goes by so quickly, and you're left wishing you could have savored the moments more deeply.",
            "Illinois State University is the most beautiful school in all of Illinois, and I'm not talking only of the gorgeous, inviting campus. ISU's professors care about their students in a way I have never before experienced, and they are constantly trying to make a positive impact in the lives of their students and in the surrounding community. Illinois State changes your life forever, and makes your perspective of the world just a little bit more wonderful."
        ]
    ],
    "pageTitle": "Illinois State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Illinois-State-University/reviews?_escaped_fragment_=/show/83533",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00162-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902717403,
    "recordOffset": 902594143,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29830=I will be a sophmore in the fall of 2012 . I attended last year and my colledge experience has changed my life! I just love it , I work really hard and enjoy going there!, 273931=In the Fall of 2012, one of the dining centers was shut down, but it doesn't take away from the fact that we have some of the best food on a college campus of course the typical burgers, fries, chicken patties, and such are always available, but our trayless dining centers provide full course meals. From the Mongolian grill, to the Chinese Wok, to the Fresh Bites, the grill, and the Italian station, it is a buffet which widely opens the eyes of every incoming freshman. Also, we have ,any restaurants on campus that accept our Redbird card flex dollars to pay for our food. But even staying for 4 years, you will never try everything in Bloomington-Normal. This twin city set has the more restaurants within its area than any other US city. I found this out my freshman year. It is truly an awesome provider of dining experiences., 439674=its not my thing but march madness is fun to attend. -->a dance off between the sororities and fraternities., 275049=The dorms here are always lively. People keep their doors open for nosy students (like how I was in my freshman year) to pop in and check out their room or just to say hey. There's cable, free wired and wireless connections, and there's even a phone hook-up. The dorms provide singles, double, quads, and suites. I absolutely love living in the dorms but there are also student apartments that the school provides including the new ones, Cardinal Courts, which were built for the Fall of 2012., 409230=Club Milner--during finals week they hand out a bunch of free stuff in the library and at 10:00 pm on the Sunday before finals week they have a 10 minute dance party where students get wild!, 47108=Fill out your application early if you want to be accepted into a competitive degree program. Most scholarships must be applied for and are not just awarded when you apply to the college. Most scholarships have a April deadline., 310249=As of 2012 all of the Residence halls at Illinois State are remodeled. There most populated building Watterson towers offers suite living, and has marble bathrooms and showers. Dorm life would have earned five stars had the elevators not been such a pain., 510752=I cant actually rate the school academically because I have not taken a class there yet but I will be attending in the fall of 2013., 710043=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "09/20/2009 Reviewer is A current student here. 24 out of 24 people found this review useful. 1 person found this inaccurate. 1 of 167 Kaylyn from Normal, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. Illinois State University Reviews Illinois State University › Illinois › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot Really great school for many different majors. I am a business major, and could not be happier with the professionalism and personal attention for all of the professors in the college of business. When here that Illinois State is a big school with a small school feel its not just a line to get you to come here. It's true you are not a number at Illinois State University. Login to rate or flag the reviews Becca from Carol Stream, IL 07/17/2009 Reviewer is A current student here. 11 out of 13 people found this review useful. 3 of 167 Categories Comments Great for these types of students If your someone who enjoys a big school with a small school feeling you will get it here. Tips for prospective students You should get involved, there are clubs, sports, and activities for everyone. You meet so many new people and just enjoy the four years you have here. It's a great",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}