{
    "relation": [
        [
            "Abbreviation",
            "v., vacc.",
            "V:a, v:a, v",
            "välb."
        ],
        [
            "Term",
            "vaccinera",
            "västra",
            "välboren"
        ],
        [
            "Definition",
            "(to) vaccinate",
            "west, western",
            "honorable"
        ]
    ],
    "pageTitle": "Swedish Abbreviations",
    "title": "",
    "url": "http://www.genealogi.se/swedish-abbreviations",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00268-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 467364813,
    "recordOffset": 467348847,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "A A B C D E F G H I J K L M N O P Q R S T U V X Y Z Å Ä Ö   This is a guide to help you understand the most commonly used abbreviations that you fill find in the Swedish Church records. This section lists key abbreviations in Swedish and the English words with the same or similar meanings. For example, in the first column you will find the Swedish abbreviations, in the second column you will find the Swedish word and in the third column the definition/translation.  Swedish Abbreviations / Swedish Abbreviations Hem Du är här: Breadcrumbs",
    "textAfterTable": "abs. absolvera (to) absolve a.d. anno domini (latin) in the year of the Lord adm. admitterad confirmed afg. afgång decease, depart to, departure afl. afliden (to) expire, die afsk. afskedade discharged, resigned a.n. ante nuptius (latin) illegitimate, birth before marriage anm. anmärkning remark, annotation arb. arbetare worker, laborer arb.bet. arbetsbetyg work permit arrend. arrendator tenant farmer, leaseholder afskr. afskrift transcript B Abbreviation Term Definition b. bonde farmer, peasant backst. backstugesittare owner of a small cottage and a small piece of land B.B. bär barnet carried the child at christening beg., begr. begraven buried bg., blg. bergslag region abounding in mines; mountain district bl.a. bland annat among other things bond. bonde farmer, peasant farmer, peasant brukare user, employer; farmer, tenant C Abbreviation Term Definition c:a, ca. cirka about, approximately caut. cautionister witness cop., copul. copulerad married cr. crono pertaining to the crown (government), crown owned cr.h. crono hem crown owned home D",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}