{
    "relation": [
        [
            "Program name",
            "aligncopy",
            "aligncopypair",
            "biosed",
            "codcopy",
            "cutseq",
            "degapseq",
            "descseq",
            "entret",
            "extractalign",
            "extractfeat",
            "extractseq",
            "featcopy",
            "featmerge",
            "featreport",
            "feattext",
            "listor",
            "makenucseq",
            "makeprotseq",
            "maskambignuc",
            "maskambigprot",
            "maskfeat",
            "maskseq",
            "newseq",
            "nohtml",
            "noreturn",
            "nospace",
            "notab",
            "notseq",
            "nthseq",
            "nthseqset",
            "pasteseq",
            "revseq",
            "seqcount",
            "seqretsetall",
            "seqretsplit",
            "sizeseq",
            "skipredundant",
            "skipseq",
            "splitsource",
            "splitter",
            "trimest",
            "trimseq",
            "trimspace",
            "union",
            "vectorstrip",
            "yank"
        ],
        [
            "Description",
            "Read and write alignments",
            "Read and write pairs from alignments",
            "Replace or delete sequence sections",
            "Copy and reformat a codon usage table",
            "Remove a section from a sequence",
            "Remove non-alphabetic (e.g. gap) characters from sequences",
            "Alter the name or description of a sequence",
            "Retrieve sequence entries from flatfile databases and files",
            "Extract regions from a sequence alignment",
            "Extract features from sequence(s)",
            "Extract regions from a sequence",
            "Read and write a feature table",
            "Merge two overlapping feature tables",
            "Read and write a feature table",
            "Return a feature table original text",
            "Write a list file of the logical OR of two sets of sequences",
            "Create random nucleotide sequences",
            "Create random protein sequences",
            "Mask all ambiguity characters in nucleotide sequences with N",
            "Mask all ambiguity characters in protein sequences with X",
            "Write a sequence with masked features",
            "Write a sequence with masked regions",
            "Create a sequence file from a typed-in sequence",
            "Remove mark-up (e.g. HTML tags) from an ASCII text file",
            "Remove carriage return from ASCII files",
            "Remove whitespace from an ASCII text file",
            "Replace tabs with spaces in an ASCII text file",
            "Write to file a subset of an input stream of sequences",
            "Write to file a single sequence from an input stream of sequences",
            "Read and write (return) one set of sequences from many",
            "Insert one sequence into another",
            "Reverse and complement a nucleotide sequence",
            "Read and count sequences",
            "Read and write (return) many sets of sequences",
            "Read sequences and write them to individual files",
            "Sort sequences by size",
            "Remove redundant sequences from an input set",
            "Read and write (return) sequences, skipping first few",
            "Split sequence(s) into original source sequences",
            "Split sequence(s) into smaller sequences",
            "Remove poly-A tails from nucleotide sequences",
            "Remove unwanted characters from start and end of sequence(s)",
            "Remove extra whitespace from an ASCII text file",
            "Concatenate multiple sequences into a single sequence",
            "Remove vectors from the ends of nucleotide sequence(s)",
            "Add a sequence reference (a full USA) to a list file"
        ]
    ],
    "pageTitle": "EMBOSS: seqret",
    "title": "",
    "url": "http://emboss.sourceforge.net/apps/cvs/emboss/apps/seqret.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00137-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 78772603,
    "recordOffset": 78749806,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "See also Known bugs None. Exit status It always exits with a status of 0. Diagnostic Error Messages None. Warnings None. References None. When the -stdout qualifier is used, the user will still be prompted for all the info that is required, but will write to standard output by default. The user will also still be prompted for an output filename, in case the user wants to save the output to a file. When the -options qualifier is used and not all the parameters are given on the command line, it will query the user for those parameters. It will not only query the user for the required parameters as it would do without the -options qualifier, but it will also query the user for the optional parameters. The example shows the application seqret being run with the -filter qualifier. The input file is 'piped' into the program using the unix command cat and the output is 'piped' directly to the unix program lpr, which will print it on the printer. % cat sequence.seq | seqret -filter | lpr   Example:   The filter qualifier makes the program behave like a filter, reading its (first) input 'file' from the standard input, and writing its (first) output 'file' to the standard output. The -filter qualifier will also invoke the -auto qualifier, so the user is never prompted for any missing",
    "textAfterTable": "Valid names of the databases set up in your local implementation of EMBOSS can be seen by using the program 'showdb'. Author(s) Peter Rice European Bioinformatics Institute, Wellcome Trust Genome Campus, Hinxton, Cambridge CB10 1SD, UK Please report all bugs to the EMBOSS bug team (emboss-bug © emboss.open-bio.org) not to the original author. History 1999 - Written by Peter Rice Feb 2002 - '-feature' qualifier added by Peter Rice Target users This program is intended to be used by everyone and everything, from naive users to embedded scripts. Comments Fasta output format Question When i tried to convert the EMBL format file into fasta format using the program \" seqret\", I found that the Access.no appears twice...  >AF102796 AF102796 Homo sapiens alphaE-catenin (CTNNA1) gene, exon 11. Answer \"It is not a bug ... it is a feature\" There are many \"FASTA formats\". EMBOSS uses the format that ACEDB and the EBI genome projects use. The first field after the ID is the accession number, so that accession numbers can be kept when sequences are converted to FASTA format, without using the NCBI format (with '|' characters in the IDs). Your EMBL format file has IDs that look like accession numbers, so EMBOSS fills in the accession number for each sequence, and reports it in the FASTA format.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}