{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Lateline",
            "World News Australia",
            "My Kitchen Rules",
            "Lethal Weapon 3",
            "Ten Late News"
        ],
        [
            "Time",
            "10:30 pm - 11:07 pm",
            "10:30 pm - 11 pm",
            "9 pm - 1 am",
            "10 pm - 12:30 am",
            "10:30 pm - 11:15 pm"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/pm/2013/02/01/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00182-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 714022511,
    "recordOffset": 713948322,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{24032=The Ocearch Shark Tracker has kept track of a 1.6 tonne great white shark named Mary Lee since she was tagged off the US coast in September. (02:21), 86576=A fortune has been added to the value of the nation's 200 top companies since the start of 2013., 99263=Two of history's most famed tank commanders go head-to-head in Tunisia in 1942.}",
    "TableContextTimeStampAfterTable": "{249739=hired goon, Feb 1, 2013, 8:30PM, 250563=RubyT, Feb 1, 2013, 9:16PM, 123212=February 1 - 16 A bride...a shattering secret...should you tell her?, 247022=PM announces election for September 14, 102212=Start your training for Run Melbourne 2013, to be held on Sunday, July 21., 124204=February 2 A free event is being held in WA's South West to celebrate the best food and wine of the region., 263422=February 01 2013, 240804=Total votes: 42747., 125186=February 3 Freo will have an extra attraction, with a flashmob to descend on unsuspecting masses.}",
    "textBeforeTable": "12am 11:30pm 11pm 10:30pm 10pm 9:30pm Skip to: The Teen Dad series studies the life of a teen father in England, and judging by this episode, it's bleedin' 'orrible. Teen Dad What's on TV Tonight A place to express personal views on local news. Gathering of the minds Our local experts give you the advice you ask for. Good Advice Opinion Book your tickets now and win an art adventure in Paris. Line up your laughs Brisbane Comedy Festival Learn to paint like a Tibetan at the Brisbane Powerhouse.",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD ABBA: Bang a Boomerang 9:28 pm - 10:30 pm SBS ONE Queensland D-Day: The Soldiers' Story 9:35 pm - 10:30 pm Channel Seven Brisbane My Kitchen Rules 9 pm - 1 am Channel Nine Brisbane Lethal Weapon 3 9 pm - 11:30 pm Network TEN Brisbane Glee 9:30 pm - 10:30 pm Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Lateline 10:30 pm - 11:07 pm SBS ONE Queensland World News Australia 10:30 pm - 11 pm Channel Seven Brisbane My Kitchen Rules 9 pm - 1 am Channel Nine Brisbane",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}