{
    "relation": [
        [
            "Domain Created On",
            "unknown",
            "unknown old"
        ],
        [
            "Last Modified On",
            "unknown",
            "unknown ago"
        ],
        [
            "Expires On",
            "unknown",
            "unknown from today"
        ]
    ],
    "pageTitle": "rdis.ir .:سازمان بورس و اوراق بهادار:. | SEOCert",
    "title": "",
    "url": "http://www.seocert.net/analyzer.rdis.ir",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00101-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 700398222,
    "recordOffset": 700381828,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3578=IP address of rdis.ir is : 46.209.126.131. The domain rdis.ir was created on unknown and it is 45 years, 205 days old. It will expire on unknown which is -46 years, -206 days from today. The homepage of website rdis.ir has a size of 19582 bytes, and a text size of 1697 bytes, its Text to Code Ratio is 9.49% Homepage of rdis.ir has 58 links, 54 link to internal pages, while 4 link to pages on other websites. It takes 0.80 s ( 24.61 Kb/s ) to load the website rdis.ir.}",
    "textBeforeTable": "Total Terms Count: 1 It is nice! the word density is quite ok. : Top 20 Keywords english  This keywords cloud gives your an idea of what are those important keywords appears in your website. : Keywords Cloud 4. put your most important word or phrases at the beginning of your list. 3. do not repeat words or phrases. 2. separate the words or phrases using a comma (you do not need to leave a space between words separated by commas). 1. keep your list of keywords or keyword phrases down to 10 - 20 unique words or phrases. Tips: Meta keywords should not be ignored, though they are not a major ranking factor for most of search engines nowadays. A Meta keywords tag is supposed to be a brief and concise list of the most important themes of your page Words count: 0    Length: 0 characters    keyword phrases count : 0 Meta Keywords is not set. [ To optimize the meta keywords, Use this SEO Meta Keywords Optimizer ] : Keywords 2. make sure the description is relevant",
    "textAfterTable": "1 100.00% keyword density can be used as a factor in determining whether a web page is relevant to a specified keyword or keyword phrase. Tips: 1. the optimum keyword density to be 1.0% - 3.0%. Using a keyword more than that could be considered search spam. 2. overuse of keywords, a practice called keyword stuffing, will cause a web page to be penalized. Highlight : <H1> <H2> <H3> <H4> <H5> <H6> <B> <U> <I> <EM> <STRONG> Total 0 0 0 0 0 0 0 0 0 0 0 0 Excellent! The page is using HTML headings (<H1> - <H6>) and inline emphasis tags (<EM><B><I><EM><STRONG>) HTML headings and emphasis tags are the most basic forms to indicate important content. Tips: 1. use your keywords in the headings and make sure the first level heading (<H1>) includes the most important keywords. 2. never duplicate the title tag content in the heading tags. 3. for more effective SEO, use only one <H1> tag per page",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}