{
    "relation": [
        [
            "Fireplace:",
            "Pool:",
            "Hot Tub:",
            "View:"
        ],
        [
            "Wood",
            "Yes",
            "Complex",
            "Partial Mountain views"
        ],
        [
            "TV in Master Bedroom:",
            "Washer/Dryer:",
            "High Speed Internet:",
            "Unit Code:"
        ],
        [
            "Yes",
            "Unit",
            "Yes",
            "Alpblick3"
        ]
    ],
    "pageTitle": "Alpenblick Unit 3",
    "title": "",
    "url": "http://www.friasproperties.com/store/p2details408.php",
    "hasHeader": true,
    "headerPosition": "FIRST_COLUMN",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00120-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 459509371,
    "recordOffset": 459490370,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Additional Details: (Passes to the Aspen Club & Spa can be obtained from any Frias Properties front desk during regular business hours.) All Frias Properties of Aspen guests receive complimentary passes to the Aspen Club & Spa, the valley’s premier full-service spa and workout facility. Complex amenities at the Alpenblick include free Aspen airport transfers, on-site free parking, ski lockers and free wireless internet access. Bedding is King (master), two twins (1st guest), Queen (2nd guest) and two twins (3rd guest). The optional 4th guest bedroom/den has a full-size pullout sleeper. This unit can sleep 10! The first guest bedroom is highlighted by a deck with residential and mountain views. This townhouse features an open floor plan with a wood-burning fireplace and a den, and an upgraded kitchen with a dishwasher and granite countertops. This three level 4-bedroom, 2.5-bath standard townhouse features an expansive guest bathroom with a sauna and is only two blocks to the Silver Queen Gondola and downtown Aspen. Alpenblick Condo Complex: Contact Us",
    "textAfterTable": "Property Location: Check-in Location: 747 S. Galena Street Reviews for Alpenblick Unit 3 Average Rating: 4.5 of 5 1 of 2 reviews Next > \"Great Location and Unit\" 5 of 5 This was a good unit with a great location in Aspen. 2 blocks to the gondola, 2 blocks to the buses for transport to other ski areas. We had 8 men and it fit our group (barely). There are 7 beds including a pullout in the den, which is a lot of beds for a 4 BR unit. The living area is a bit tight, and it would have been tough to eat meals there with a group our size, but it was good for our trip and group. Frias provided great service which",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}