{
    "relation": [
        [
            "Date",
            "30 Jun 2003",
            "2 Dec 2005",
            "1 Oct 2008",
            "6 Nov 2008",
            "7 Sep 2010",
            "1 Oct 2012"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "CC",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Certificate of correction",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: ARRAYCOMM, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:PETRUS, PAUL;UHLIK, CHRISTOPHER R.;TROTT, MITCHELL D.;REEL/FRAME:014219/0200;SIGNING DATES FROM 20021030 TO 20030111",
            "Owner name: ARRAYCOMM LLC.,CALIFORNIA Free format text: CHANGE OF NAME;ASSIGNOR:ARRAYCOMM, INC.;REEL/FRAME:017034/0620 Effective date: 20051116",
            "Owner name: ARRAYCOMM LLC.,CALIFORNIA Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE NATURE OF CONVEYANCE PREVIOUSLY RECORDED ON REEL 017034 FRAME0620. ASSIGNOR(S) HEREBY CONFIRMS THE NATURE OF CONVEYANCE IS AN ASSIGNNMENT AND NOT A CHANGE OF NAME;ASSIGNOR:ARRAYCOMM, INC.;REEL/FRAME:021619/0313 Effective date: 20051116 Owner name: ARRAYCOMM LLC., CALIFORNIA Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE NATURE OF CONVEYANCE PREVIOUSLY RECORDED ON REEL 017034 FRAME0620. ASSIGNOR(S) HEREBY CONFIRMS THE NATURE OF CONVEYANCE IS AN ASSIGNNMENT AND NOT A CHANGE OF NAME;ASSIGNOR:ARRAYCOMM, INC.;REEL/FRAME:021619/0313 Effective date: 20051116",
            "Owner name: INTEL CORPORATION,CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ARRAYCOMM LLC;REEL/FRAME:021794/0107 Effective date: 20081002",
            "",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US20030169722 - Frame structure for radio communications system - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US20030169722",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00103-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 492625767,
    "recordOffset": 492579260,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6188=[0138] In one embodiment, there are 9 different modulation classes as shown in Table 17. The different modulation classes differ in modulation scheme as well as in encoding. The encoding can include error detection and correction, puncturing, block coding and block shaping. Other types of modulation and encoding can be used depending on the needs of a particular application. The bit per symbol rates are approximate in Table 17 but provide an indication of a range of data rates that can be accomplished using the same number of symbols. Using the values in Table 15 of 182 uplink and 460 downlink information symbols per burst, a modulation class 0 burst would carry 91 or 230 bits, respectively. A modulation class 8 burst on the other hand carries 728 and 1840 bits, respectively.}",
    "TableContextTimeStampAfterTable": "{53629=[0001] The present application is a continuation-in-part of prior commonly-owned applications, Radio Communications System With a Shared Broadcast Channel, U.S. Ser. No. 09/675,274, filed Sep. 29, 2000; Closing a Communications Stream Between Terminals of a Communications System, U.S. Ser. No. 09/813,194, filed Mar. 20, 2001; Spatial Processing and Timing Estimation Using a Training Sequence in a Radio Communications System, U.S. Ser. No. 09/841,456, filed Apr. 24, 2001 the priorities of which are hereby claimed., 195890=[0139] The modulation classes can also be adjusted to achieve a particular data rate ratio between uplink and downlink as well as to accommodate the greater capabilities of a base station as compared to a remote terminal. The ratio of downlink symbols per uplink symbol is approximately 2.5:1. This is believed to be a practical data rate ratio for many Internet applications. If the base station and the user terminal use the same modulation class, then the data rate ratio will also be about 2.5:1. However, by using different modulation classes, the data rate ratio can be varied between about 0.32:1 (UT at modclass 8, BS at modclass 0) to about 20:1 (UT at modclass 0, BS at modclass 8). In some applications, the BS will frequently transmit user data using a modulation class that is one step higher than the modulation class of the user terminal. This provides a data rate ratio of from 2.9:1 to 3.8:1. As can be seen, the modulation classes provide a great amount of flexibility in setting the operating parameters of the system., 174671=[0128] Similarly, FIG. 2 shows a standard downlink burst of 1090 μsec, the components of which are a short 10 μsec ramp up 201, a 68 μsec training sequence 202, and a 32 μsec FACCH 203. The training sequence can be selected in any of the different ways as described above or others. These sections are followed by 920 μsec of information symbols 204. The information symbols will depend on the nature of the burst and can be registration, assignment, control or user data among others. The burst closes with a 36 μsec tail training sequence 205, a 10 μsec ramp-down 206 and a 14 μsec interburst guard time 207. In the frame structures of the present invention, the interburst guard time will be followed either by another ramp-up for the next burst, a transition guard time preceding downlink bursts or an interframe guard time., 183833=[0132] The example frame of FIG. 3 has three adjacent 545 μsec uplink slots 301, 302, 303, in a single time sequence. The uplink slots are followed by a sequence of three adjacent 1090 μsec downlink slots 305, 306, 307. In FIG. 3, there is no gap between each uplink slot nor between each downlink slot, however, as shown in FIGS. 1 and 2, each slot includes an interburst guard time. This interburst guard time can instead be characterized as belonging to the frame and not to the slot, in which case there is a gap between each slot. In addition, between the uplink slots and the downlink slots an additional 10 μsec uplink to downlink transition time is provided. This time can be used by terminals to switch between receive and transmit modes or transmit and receive modes., 199454=[0143] Estimates of parameters such as signal power levels, DOAs, and TOAs can be determined using known training sequences placed in digital data streams for the purpose of channel equalization in conjunction with sensor (antenna) array information. This information is then used to calculate appropriate weights for spatial demultiplexers, multiplexers, and combiners. Techniques well known in the art, can be used to exploit the properties of the training sequences in determining spatial parameters. Further details regarding the use of spatial division and SDMA systems are described, for example, in U.S. Pat. Nos. 5,828,658, issued Oct. 27, 1998 to Ottersten et al. and U.S. Pat. No. 5,642,353, issued Jun. 24, 1997 to Roy, III et al., 109120=[0057] CR is sent on the control carrier, as an example, exactly 2265 μsec after receipt of a downlink BCH burst. In this way, an otherwise uninitialized user terminal can send CR without any knowledge of the frequency hopping sequence parameters. The CR burst is shorter than a standard uplink time-slot to allow for unknown time-of-flight from the user terminal to the base station and typically arrives late in the uplink time-slot receive window.}",
    "textBeforeTable": "Patent Citations [0165] It should also be appreciated that reference throughout this specification to “one embodiment” or “an embodiment” means that a particular feature may be included in the practice of the invention. Similarly, it should be appreciated that in the foregoing description of exemplary embodiments of the invention, various features of the invention are sometimes grouped together in a single embodiment, figure, or description thereof for the purpose of streamlining the disclosure and aiding in the understanding of one or more of the various inventive aspects. This method of disclosure, however, is not to be interpreted as reflecting an intention that the claimed invention requires more features than are expressly recited in each claim. Rather, as the following claims reflect, inventive aspects lie in less than all features of a single foregoing disclosed embodiment. Thus, the claims following the Detailed Description are hereby expressly incorporated into this Detailed Description, with each claim standing on its own as a separate embodiment of this invention. [0164] Many of the methods are described in their most basic form, but steps can be added to or deleted from any of the methods and information can be added or subtracted from any of the described messages without departing from the basic scope of the present invention. It will be apparent to those skilled in the art that many further modifications and adaptations can be made. The particular",
    "textAfterTable": "Intel Corporation Slot structure for radio communications system US7603141 * 2 Jun 2005 13 Oct 2009 Qualcomm, Inc. Multi-antenna station with distributed antennas US7817534 * 10 Nov 2003 19 Oct 2010 Motorola, Inc. Method and apparatus for interrupting a transmission of a multicast signal US7876716 * 16 Apr 2002 25 Jan 2011 Panasonic Corporation Base station apparatus and radio communication method US7974252 * 4 Aug 2008 5 Jul 2011 Electronics & Telecommunications Research Institute Error control method, medium access control (MAC) frame designing method, and terminal registration method in wireless communication system, and recording medium US7986682 * 24 Oct 2008 26 Jul 2011 Electronics & Telecommunications Research Institute Error control method, medium access control (MAC) frame designing method, and terminal registration method in wireless communication system, and recording medium US8009667 30 Aug 2011 Wi—LAN, Inc. Packing source data packets into transporting packets with fragmentation",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}