{
    "relation": [
        [
            "PLAYER",
            "DB Duke Williams",
            "RB Kerwynn Williams"
        ],
        [
            "NFL TEAM (ROUND)",
            "Buffalo (4)",
            "Indianapolis (7)"
        ],
        [
            "COLLEGE",
            "Nevada",
            "Utah State"
        ],
        [
            "HIGH SCHOOL (CITY)",
            "Hug (Reno)",
            "Valley (Las Vegas)"
        ]
    ],
    "pageTitle": "CHANDLER HIGH SCHOOL IN ARIZONA LEADS ALL HIGH SCHOOLS WITH THREE PLAYERS SELECTED IN 2013 NFL DRA",
    "title": "",
    "url": "http://prod.www.colts.clubs.nfl.com/news/article-1/CHANDLER-HIGH-SCHOOL-IN-ARIZONA-LEADS--ALL-HIGH-SCHOOLS-WITH-THREE-PLAYERS-SELECTED--IN-2013-NFL-DRA/b0dae4bc-7728-446f-90b7-2327e1a696f5",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00042-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 197562547,
    "recordOffset": 197530000,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{73883=DB Jamar Taylor, 39754=STATES WITH MOST NFL PLAYERS DRAFTED IN 2012 PER CAPITA, 28950=With rookie minicamps now complete, the 2013 NFL Draft class has experienced its first taste of NFL life., 35031=Miramar (Miramar, FL), 225741=Highlights from Erin's 2016 Colts Cheerleaders Swimsuit Calendar Shoot.(Iberostar Paraiso del Mar, Riviera Maya, Mexico), 54401=Some interesting notes on high schools in the 2013 NFL Draft:, 219384=The Colts Cheerleaders recently revealed the 2015-2016 Colts Cheerleader Swimsuit Calendar at Latitude 360 in Indianapolis., 56385=The 2013 NFL Draft broken down by state listing of high schools:, 33035=Jamar Taylor (Miami/2); Levine Toilolo (Atlanta/4), 224707=A look back at the first practice of the Colts 2014 Training Camp., 32208=Dutchtown (Geismar, LA), 29374=The 2013 drafted rookies range from Punahou High School in Honolulu, Hawaii to Karksi-Nuia High School in Karksi-Nuia, Estonia. A total of 236 high schools contributed to the 254 players selected in the seven rounds of the 2013 NFL Draft on April 25-27, USA Football announced today. Chandler High School in Chandler, Arizona led all high schools with three players selected., 218155=Get to know veteran Colts Cheerleader Erin from Carmel, during her shoot for the 2015-16 Colts Cheerleader Calendar., 84091=Miramar, 191595=About USA Football: USA Football leads the game’s development, inspires participation and ensures a better and safer experience for all youth, high school and other amateur players. The independent nonprofit is the official youth football development partner of the NFL, its 32 teams and the NCAA’s Atlantic Athletic Conference. USA Football (www.usafootball.com), endowed by the NFL and NFLPA in 2002, provides more than $1 million annually in equipment grants and youth league volunteer background check subsidies., 30261=Seventeen schools had at least two players selected, with four of those schools producing a first-round choice – Chandler in Chandler, Arizona (defensive end Dion Jordan by Miami); Dutchtown in Geismar, Louisiana (safety ERIC REID by San Francisco); Miami Norland in Miami, Florida (cornerback XAVIER RHODES by Minnesota); and Newnan in Newnan, Georgia (linebacker ALEC OGLETREE by St. Louis)., 27716=Posted May 15, 2013}",
    "textBeforeTable": "  ARIZONA (5)   Minor (Adamsville) Samford Pittsburgh (7) DE Nicholas Williams Pickens County (Reform) Alabama Detroit (7) TE Michael Williams Bibb County (Centreville) Vanderbilt St. Louis (5) RB Zac Stacy Stanhope Elmore (Millbrook) Alabama New York Jets (1) DB Dee Milliner Hazelwood (Town Creek) Arkansas State Miami (7) DB Don Jones Andalusia Alabama Kansas City (4) LB Nico Johnson Foley Alabama San Diego (1) T D.J. Fluker Clay Chalkville (Pinson) Alabama San Francisco (5) DT Quinton Dial HIGH SCHOOL (CITY) COLLEGE NFL TEAM (ROUND)",
    "textAfterTable": "Mountain Ridge (Glendale) QB Sean Renfree Atlanta (7) Duke Notre Dame Prep (Scottsdale) WR Markus Wheaton Pittsburgh (3) Oregon State Chandler   ARKANSAS (2)   PLAYER NFL TEAM (ROUND) COLLEGE HIGH SCHOOL (CITY) TE Chris Gragg Buffalo (7) Arkansas Warren QB Tyler Wilson Oakland (4) Arkansas Greenwood   CALIFORNIA (27)   PLAYER NFL TEAM (ROUND) COLLEGE HIGH SCHOOL (CITY) LB Kinko Alonso Buffalo (2) Oregon Los Gatos G Jeff Baca Minnesota (6) UCLA Mission Viejo T David Bakhtiari",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}