{
    "relation": [
        [
            "RUSHING",
            "Jake Sharp, RB",
            "Angus Quigley, RB"
        ],
        [
            "GP",
            "7",
            "7"
        ],
        [
            "ATT",
            "88",
            "44"
        ],
        [
            "GAIN",
            "397",
            "230"
        ],
        [
            "LOSS",
            "11",
            "3"
        ],
        [
            "NET",
            "386",
            "227"
        ],
        [
            "AVG",
            "4.4",
            "5.2"
        ],
        [
            "TD",
            "5",
            "2"
        ],
        [
            "LONG",
            "26",
            "20"
        ],
        [
            "AVG/G",
            "55.1",
            "32.4"
        ]
    ],
    "pageTitle": "TheWolverine.com - 1nside the Numb3rs: Kansas",
    "title": "",
    "url": "https://michigan.rivals.com/content.asp?CID=866573",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00123-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 884795343,
    "recordOffset": 884777462,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1928=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 TheWolverine.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{36910=October 22, 2008, 43077=Kansas' offense is very similar to the first three teams that Texas Tech has played in conference. All of them have had great success through the air while struggling to get much going in the running game. For Kansas, this is starting to change as in the last two games they have been able to get Jake Sharp over the century yard mark. His 8.6 yard per carry average against the Sooners last week is an impressive feat against a defense that has only given up 3.3 yards per carry on the season. With a run to pass ratio of 46/54 running the ball is critical to the success of the offense as it opens up lots of room for Dezmon Briscoe and Kerry Meier to utilize. Against the Red Raiders finding running room may be tough as they feature the Big 12's second best rushing defense. They have been suffocating opponent running backs only allowing 82 yards per game in conference and less than a three yard per carry average. The passing game for the Jayhawks is clearly their strong suit. Led by stellar quarterback Todd Reesing, Kansas is throwing the ball for 335 yards per game. Against Oklahoma and South Florida, two very strong defenses, they were able to pass for over 340 yards in both games. One area that the passing game has been very efficient in is picking up first downs. On the season the offense is converting at an astounding 50-percent clip. The passing game is responsible for 102 of these, compared to only 57 rushing. One area that the offense has struggled with is giving up sacks. While this could be a result of Reesing trying too hard to make a big play, the offensive line has given up 3 sacks per conference game which is second to last in the Big 12. This has led to six turnovers in three conference games which places them near the bottom of the league in turnover margin. The Kansas rushing defense was starting to dominate until last week when they faced one of the nation's best offensive lines in Norman. The Sooners ran all over them for 206 yards. In the previous three games, the defense did a standout job allowing only 76 yards per contest. Their season average of 109.7 yards per game is good for 29th in the nation. Slowing Baron Batch and Shannon Woods without having to stuff the box will benefit a Jayhawk secondary that has been picked apart by quarterbacks far inferior to Graham Harrell. The aforementioned secondary has had major issues this year, and it is evident in most statistical categories. They rank 99th in the nation in pass defense and only have two guys in the top 21 in the conference in pass breakups. However, they have made up for it by intercepting 9 passes on the season. In passing situations the defensive line has also not had the most success with only two sacks per game. If they are forced to blitz to get pressure, it could be a long afternoon for an inexperience secondary that is coming off a game in which they allowed 468 yards passing. According to Kansas head coach Mark Mangino his special teams units are coming off their best game of 2008. Against the Sooners the special teams averaged over 41 yards per punt including two inside the twenty, were 1-1 on field goals, and had a net kickoff average of 44 yards. On the season the Jayhawks have been very good returning punts with Daymond Patterson averaging 14.92 yards per return. Punter Alonso Rojas has also been steady with an average of 42.15 per punt. One area they have struggled in kickoff returns where they are last in the Big 12. Opponents are also a perfect 18-18 on extra points. Stat Leaders, 65780=Trout a big fish in 2018 class}",
    "textBeforeTable": "Kansas' offense is very similar to the first three teams that Texas Tech has played in conference. All of them have had great success through the air while struggling to get much going in the running game. For Kansas, this is starting to change as in the last two games they have been able to get Jake Sharp over the century yard mark. His 8.6 yard per carry average against the Sooners last week is an impressive feat against a defense that has only given up 3.3 yards per carry on the season. With a run to pass ratio of 46/54 running the ball is critical to the success of the offense as it opens up lots of room for Dezmon Briscoe and Kerry Meier to utilize. Against the Red Raiders finding running room may be tough as they feature the Big 12's second best rushing defense. They have been suffocating opponent running backs only allowing 82 yards per game in conference and less than a three yard per carry average. The passing game for the Jayhawks is clearly their strong suit. Led by stellar quarterback Todd Reesing, Kansas is throwing the ball for 335 yards per game. Against Oklahoma and South Florida, two very strong defenses, they were able to pass for over 340 yards in both games. One area that the passing game has been very efficient in is picking up first downs. On the season the",
    "textAfterTable": "TD LONG AVG/G Jake Sharp, RB 7 88 397 11 386 4.4 5 26 55.1 Angus Quigley, RB 7 44 230 3 227 5.2 2 20 32.4 Jake Sharp has finally jump started a sluggish KU running game. His ability to make people miss in space as well as make sharp cuts have led to his two consecutive 100 yard performances. Angus Quigley is more of a power back at 222 lbs. He also has the ability to catch the ball out of the backfield and did so 3 times last game RECEIVING GP NO. YDS AVG TD LONG AVG/G Kerry Meier, WR 7 57",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}