{
    "relation": [
        [
            "ATTRIBUTE TYPE",
            "Availability",
            "Interface Stability"
        ],
        [
            "ATTRIBUTE VALUE",
            "SUNWperl584core, SUNWperl584usr, SUNWperl584man, SUNWpl5u, SUNWpl5v SUNWpl5p, SUNWpl5m See below.",
            "See below."
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19253-01/816-5165/6mbb0m9nd/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00237-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74280771,
    "recordOffset": 74267887,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{15692=Begun in 1993 (see perlhist), Perl version 5 is nearly a complete rewrite that provides the following additional benefits:, 17492=POSIX 1003.1 compliant library Described in POSIX.}",
    "lastModified": "Thu, 06 Jan 2011 11:30:06 GMT",
    "textBeforeTable": "See attributes(5) for descriptions of the following attributes: Attributes Locations of Perl libraries \"@INC\" Files If your Perl success stories and testimonials may be of help to others who wish to advocate the use of Perl in their applications, or if you wish to simply express your gratitude to Larry and the Perl developers, please write to perl–thanks@perl.org . Larry Wall, with the help of oodles of other folks. AUTHOR See also the perlrun mapage. Notice that the Perl utility scripts such as perldoc and perlbug are in the /usr/perl5/bin directory, so if you wish to use them you need to include /usr/perl5/bin in your PATH environment variable. Any additional modules that you choose to install will be placed in the /usr/perl5/site_perl/5.8.4 directory. The /usr/perl5/vendor_perl directory is reserved for SMI-provided modules. The Perl shipped with Solaris is installed under /usr/perl5 rather than the default /usr/local location. This is so that it can coexist with a customer-installed Perl in the default /usr/local location. Environment Variables Okay, that's definitely enough hype. POSIX 1003.1 compliant library Described in POSIX. Enhanced debugger and interactive Perl environment, with integrated editor support. Described in perldebtut, perldebug and perldebguts. Regular expression enhancements. Described in perlre, with additional examples in",
    "textAfterTable": "Perl is available for most operating systems, including virtually all Unix-like platforms. See \"Supported Platforms\" in perlport for a listing. The Script interface is Evolving. The XSUB interface is Evolving. The Binary interface is Unstable. The Directory layout is Evolving. See Also a2p awk to perl translator s2p sed to perl translator http://www.perl.com Perl home page http://www.perl.com/CPAN The Comprehensive Perl Archive http://www.perl.org Perl Mongers (Perl user groups) Diagnostics The `use warnings' pragma (and the -w switch) produce some lovely diagnostics. See perldiag for explanations of all Perl's diagnostics. The `use diagnostics' pragma automatically turns Perl's normally terse warnings and errors into these longer forms. Compilation errors will tell you the line number of the error, with an indication of the next token or token type that was to be examined. (In a script passed to Perl via -e switches, each -e is counted as one line.) Setuid scripts have additional constraints that can produce error messages such as \"Insecure dependency\". See perlsec. Did we mention that you should definitely consider using the -w switch? Notes Perl 5.8.4 has been built to be largefile-aware and to use 64–bit integers, although the interpreter itself is a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}