{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "363.72",
            "357.08",
            "361.33",
            "354.87"
        ],
        [
            "NSE",
            "363.88",
            "357.27",
            "361.58",
            "355.00"
        ]
    ],
    "pageTitle": "Tube Investments of India Stock Price, Share Price, Live BSE/NSE, Tube Investments of India Bids Offers. Buy/Sell Tube Investments of India news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/miscellaneous/tubeinvestmentsindia/TII",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00160-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 591763275,
    "recordOffset": 591710719,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{135596=JSWSteel Jul Fut, 213584=Tube Investment is in the Miscellaneous sector. The current market capitalisation stands at Rs 7,158.79 crore. The company management includes M M Murugappan - Chairman, L Ramkumar - Managing Director, C K Sharma - Director, Hemant M Nerurkar - Director, Madhu Dubhashi - Director, Pradeep V Bhide - Director, S Sandilya - Director, N Srinivasan - Director. It is listed on the BSE with a BSE Code of 504973 and the NSE with an NSE Code of TUBEINVEST. Its Registered office is at 234, Dare House, NSC Bose Road, Chennai (Madras),Tamil Nadu - 600001. Their Registrars are Karvy Computershare Private Ltd., 134889=UnitedBrewerie Jul Fut, 212273=Zensar Technologies Recommended on Mar 24th 2015, 134378=28 July 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}