{
    "relation": [
        [
            "",
            "Red",
            "Green",
            "Blue"
        ],
        [
            "Form Area",
            "255",
            "255",
            "0"
        ],
        [
            "Recessed",
            "0",
            "255",
            "255"
        ],
        [
            "Button Area",
            "255",
            "0",
            "0"
        ],
        [
            "Flat Area",
            "255",
            "0",
            "255"
        ],
        [
            "Display",
            "0",
            "255",
            "0"
        ],
        [
            "Text",
            "0",
            "0",
            "255"
        ]
    ],
    "pageTitle": "StyleSkin Tutorial ~ User Interface/Menu Graphics Designing Software ~ Pollen Software",
    "title": "",
    "url": "http://www.pollensoftware.com/styleskin/sttutor1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00084-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 649317999,
    "recordOffset": 649306707,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{44213=© 2009 POLLEN SOFTWARE, ALL RIGHTS RESERVED.}",
    "lastModified": "Wed, 09 Nov 2011 05:35:25 GMT",
    "textBeforeTable": "The colors that Styleskin uses for rendering shapes are set to the key colors shown on the tool palettes bar. When designing your template in another graphics package, you will need to use these colors. Each color is made up of the following red, green, blue values as follows: l StyleSkin offers a button exporting feature which automatically cuts around and saves a copy of each button. This feature does not operate for imported templates. If you need separate button images then we recommend that once you have rendered your output graphic, copy the graphic (click on edit on the menu bar and select copy) and paste it back into your graphics package. Use your graphics package to select around each button and save them as new images. l Points to note when creating your template outside of StyleSkin     To open a template you have created click \"File\" on the Menu Bar and Select \"Open Template\" or click the",
    "textAfterTable": "l  If you are including text in your non-native template, you will need to turn off screen font smoothing before pasting your image into the StyleSkin template area. Screen font smoothing is a windows operation which shades around the text to make it look less jagged. StyleSkin caters for font smoothing in native templates but may have difficulty assigning a key color to all the varying shades around a font which can result in unrendered pixels. l StyleSkin includes an automatic \"Export to Autorun Maestro\" feature. Autorun Maestro is software that we provide to create autorun menus for CDs. This feature will not operate for imported templates. Do not be concerned if you would like to use an imported template for an Autorun Maestro menu. Simply render your graphic and save the image into the same directory as Autorun Maestro. If you have buttons, use your graphics package to select around each of your button images for up, mouse over and down positions and save them also into your Autorun Maestro directory. Run the Maestro editor (MaestrEd.exe) in your Autorun Maestro directory to create your menu.      ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}