{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Great UPD is on a 24/7 watch",
            "It's just a long process but it's pretty good from what I've seen. Can't really speak much of it because i haven't pledged.",
            "Good amount to choose from. I'm on the cheer leading team and that is going pretty well so far :)",
            "Having the chance to actually be off campus using your school id bus pass to go to Albany mall, parties off campus, restaurants in town , Just being off campus period is fun or just another great experience. Being on campus there is something everyday going on so you will never be bored.",
            "I rate it a 4/5.. Why because its good when you first try it of course they switch up the meals here and there but after awhile you get tired of the food.Be careful for freshman 15 /",
            "Just the set-up is so weird and i personally don't like it. All the money i pay for my attendance is not worth what the freshman dorms look like.",
            "I personally love the small class environment. Haven't actually been in a class that was really large so that's good for those who like the attention in the class where the professor will notice you attend cobleskill. Professors are very understanding and they work with you whenever you need the help and they have office hours that helps a lot.",
            "Apply even if your not 100% sure visit if that helps you to change your mind.",
            "I Love the diversity The library is the best place to go for academic help with studies. Picking my own classes that suite my major helps a lot."
        ]
    ],
    "pageTitle": "SUNY College of Agriculture and Technology at Cobleskill Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/SUNY-College-of-Agriculture-and-Technology-at-Cobleskill/reviews?_escaped_fragment_=/show/12412",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00180-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906255479,
    "recordOffset": 906223139,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{88828=The town of Cobleskill is beautiful and peaceful, I had visited on an accepted students day on May 3rd and it was a windy and warm day. The land around the college is big and breath taking. It is perfect if you want to get away from all the noise if you are from the city., 101490=© 2015, Cappex.com, LLC, 98792=I visited during November 2014 and was very impressed by the school. The campus is absolutely breathtaking, and snow was falling during my tour; the sight was picture perfect. Even though it was beautiful, I do not believe it will be the right choice for me as a student who is looking for a rigorous pre-vet program.}",
    "textBeforeTable": "06/16/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 5 out of 5 people found this review useful. 1 person found it offensive. 1 of 26 Jessica from copenhagen, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. SUNY College of Agriculture and Technology at Cobleskill Reviews SUNY College of Agriculture and Technology at Cobleskill › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest)",
    "textAfterTable": "Mary from Jefferson, NY 03/06/2012 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 26 Categories Comments Campus Safety i've been here nearly four years, and know of no serious incidents on campus. upd are strict enforcers. Greek Life no greeks. Clubs and Activities wide variety of clubs campus wide. something for everyone. Great for these types of students students of all ages who really want to learn something that they can use in real life. Share any unusual traditions or locations on campus you may just see a professor walk through your lecture with a piece of aluminum foil on his head, looking for the mother ship........... Bang for the buck other colleges and many government and private companies favor cobleskill students due to our well-rounded, practical education.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}