{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3"
        ],
        [
            "Command or Action",
            "enable Example: Device> enable",
            "show ssh Example: Device# show ssh",
            "exit Example: Device# exit"
        ],
        [
            "Purpose",
            "Enables privileged EXEC mode. Enter your password if prompted.",
            "Displays the status of SSH server connections.",
            "Exits privileged EXEC mode and returns to user EXEC mode."
        ]
    ],
    "pageTitle": "Secure Shell Configuration Guide, Cisco IOS Release 15E - Secure Shell Version 2 Support [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/sec_usr_ssh/configuration/15-e/sec-usr-ssh-15-e-book/sec-secure-shell-v2.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00175-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 358351471,
    "recordOffset": 358315934,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{8911=The Cisco SSH implementation has traditionally used 768-bit modulus, but with an increasing need for higher key sizes to accommodate DH Group 14 (2048 bits) and Group 16 (4096 bits) cryptographic applications, a message exchange between the client and the server to establish the favored DH group becomes necessary. The ip ssh dh min size command configures the modulus size on the SSH server. In addition to this, the ssh command was extended to add VRF awareness to the SSH client-side functionality through which the VRF instance name in the client is provided with the IP address to look up the correct routing table and establish a connection.}",
    "textBeforeTable": "DETAILED STEPS 8.    exit 7.    ip ssh version [1 | 2] 6.    ip ssh [time-out seconds | authentication-retries integer] 5.    crypto key generate rsa 4.    ip domain-name name 3.    hostname name 2.    configure terminal 1.    enable SUMMARY STEPS Configuring a Device for SSH Version 2 Using a Hostname and Domain Name Monitoring and Maintaining Secure Shell Version 2 Verifying the Secure Shell Status Verifying the Status of the Secure Shell Connection Enabling Secure Copy Protocol on the SSH Server Starting an Encrypted Session with a Remote Device Configuring the Cisco IOS SSH Client to Perform RSA-Based Server Authentication Configuring the Cisco SSH Server to Perform RSA-Based User Authentication Configuring a Device for SSH Version 2 Using RSA Key Pairs Configuring",
    "textAfterTable": "Step 4 ip domain-name name Example:  cisco7200(config)# ip domain-name example.com   Configures a domain name for your device.   Step 5 crypto key generate rsa Example:  cisco7200(config)# crypto key generate rsa   Enables the SSH server for local and remote authentication.   Step 6 ip ssh [time-out seconds | authentication-retries integer] Example:  cisco7200(config)# ip ssh time-out 120   (Optional) Configures SSH control variables on your device.   Step 7 ip ssh version [1 | 2] Example:  cisco7200(config)# ip ssh version 1   (Optional) Specifies the version of SSH to be run on your device.   Step 8 exit",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}