{
    "relation": [
        [
            "Element",
            "Document Storage Volume",
            "Supporting Content Storage Volume"
        ],
        [
            "Description",
            "Specify where documents will be stored. This may be a file system or a database, depending on how the Content Server repository is configured. Note that volume status is not indicated here.",
            "Specify where annotations and supporting content will be stored. This may be a file system or a database, depending on how the Content Server repository is configured. Note that volume status is not indicated here."
        ]
    ],
    "pageTitle": "A User Interface",
    "title": "",
    "url": "http://docs.oracle.com/cd/E14571_01/admin.1111/e12782/e01_interface.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00179-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 69933591,
    "recordOffset": 69900331,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{131320=Month (full month name): MMMM - Sample: January, 131214=Month (abbreviated month name): MMM - Sample: Jan, 47599=Use the Create Search Properties page to start creating a search that will be used more than once. If the Accounting department often searches for all Invoices during a specific year, create a search that specifies Invoices between the desired dates, such as January 1, 2008 and December 31, 2008., 130938=Year (4 digit): yyyy - Sample: 2010, 132435=For example, if the Format Value field were populated with yyMMMdd - HH:mm:ss, the Sample Date would display 10Jan01 - 15:16:59 for a date and time of January 1st, 2010 at 5:16 and 59 seconds PM, based on the following Format Values being added in the following order:}",
    "lastModified": "Wed, 13 May 2015 05:13:39 GMT",
    "textBeforeTable": "The following table describes the elements available on the page. Access the Create Application Storage Policy page by clicking Next on the Application Document Security Page or by clicking Storage Policy in the Navigation Train. Changing the Storage Policy in an existing application affects future documents only. Existing documents maintain the Storage Policy that was in place at the time they were uploaded. WARNING: On this page, specify the location of storage for the documents in this application. A.27 Application Storage Policy Page Grants a group the right to create and manipulate annotations classified as hidden by the annotator. Annotate Hidden Grants a group the right to create and manipulate annotations classified as restricted by the annotator. Annotate Restricted Grants a group the right to create and manipulate annotations classified as standard by the annotator Annotate Standard Grants the selected group the right to unlock documents locked by users other than themselves within this application. Lock Admin Enable to grant the user or group the",
    "textAfterTable": "A.28 Application Workflow Configuration Page Workflow enables your organization to automate its business processes by orchestrating services within the process flow. Click Add to create a workflow process to define an integration to an existing workflow process. A new instance of this process will be created each time a document is created within this application. Access the Create Application Workflow Configuration General Properties page by clicking Next on the Application Storage Policy Page. The following table describes the elements available on the page. Element Description Add Click to add a new workflow configuration. Modify Click to modify an existing workflow configuration. Remove Remove the configuration from the application. A.29 Workflow Server",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}