{
    "relation": [
        [
            "Classification",
            "Indicated",
            "Inferred"
        ],
        [
            "Old Mineral Resource (koz)",
            "84",
            "188"
        ],
        [
            "New Mineral Resource (koz)",
            "348",
            "135"
        ],
        [
            "% Change",
            "314%",
            "-28%"
        ]
    ],
    "pageTitle": "Lachlan Star Ltd. : Lachlan Star Announces 314% Increase in Indicated Mineral Resource Ounces for the Toro Deposit | 4-Traders",
    "title": "",
    "url": "http://www.4-traders.com/LACHLAN-STAR-LTD-769727/news/Lachlan-Star-Ltd--Lachlan-Star-Announces-314-Increase-in-Indicated-Mineral-Resource-Ounces-for-th-13966312/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00140-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 268747787,
    "recordOffset": 268723905,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{78645=The information in the news release that relates to the Mineral Resources of Tres Perlas, Chisperos, Las Loas, El Sauce, Churrumata and Toro is based on information compiled by David Slater, who is a Chartered Professional Member of The Australasian Institute of Mining and Metallurgy. Mr. Slater is employed full time by Coffey Mining Pty Ltd. The information in the news release that relates to exploration results is based on information approved by Declan Franzmann, who is a Chartered Professional Member of The Australasian Institute of Mining and Metallurgy. Mr. Franzmann is employed by Citraen Pty Ltd and is an officer of the Company. Each of Mr. Slater and Mr. Franzmann has sufficient experience, which is relevant to the style of mineralisation and type of deposit under consideration and to the activity which he is undertaking, to qualify as a Competent Person as defined in the 2004 Edition of the \"Australasian Code for Reporting of Mineral Resources and Ore Reserves\" and to qualify as a \"Qualified Person\" under NI 43-101. Each of Mr. Slater and Mr. Franzmann consents to the inclusion in the news release of the matters based on his information in the form and context in which it appears., 72453=The aim of the 2011 drill program was to expand the resource base, and to upgrade the Inferred mineral resources to Indicated category to enable their use in mine planning and mineral reserve estimation. This has been achieved, with a 314% increase in the Indicated category contained ounces., 72776=Drilling in the 2012 program is planned to infill the area between the Toro Central and Socorro pits to prove the concept of a single large pit at Toro, as well as extensional exploration on the near surface open mineralisation., 71854=The new mineral resource for the Toro deposit is the first of the 2012 mineral resource updates for the CMD Gold Mine. The Toro deposit is open along strike to both the north and south, and across strike to the east and west in several areas. Work is continuing to update the resources at the other CMD Gold Mine Projects. In addition, there remains substantial potential to expand the mineral resources through infill drilling between the Toro Central and Socorro pits, where there is currently insufficient drilling data to extrapolate the resource between the pits., 76115=Mineral Resource - January 2012, 76156=Toro - Coffey 2012 - Reported above 0.15g/t Au, 73403=Declan Franzmann, Managing Director, commented \" the first of the 2012 mineral resource estimates show an encouraging increase in both overall ounces of gold and confidence level, and will provide a better platform for our mine planning work this year. The approximate 78% increase in total gold ounces is in line with what we have seen in the pits, where we have mined approximately two thirds of our ore in 2011 from outside the old mineral resource.\"}",
    "textBeforeTable": "Table 1 - Comparison of New and Previous Toro Mineral Resource Estimates The new Toro deposit mineral resource contains 348,000 ounces of gold in the Indicated category, which is a 314% increase over the previous Indicated mineral resource (84,000 ounces). In addition, a further 135,000 ounces of gold are contained in the Inferred category, which is a decrease of 28% compared to the previous Inferred mineral resource (188,000 ounces) as shown in Table 1. Perth, Western Australia: Gold miner, Lachlan Star Limited (\"Lachlan\" or the \"Company\") (ASX and TSX: LSA) is pleased to announce an updated mineral resource for the Toro deposit at its 100% owned CMD Gold Mine in Chile. IN WHOLE OR IN PART, IN OR INTO THE UNITED STATES NOT FOR DISTRIBUTION TO UNITED STATES NEWSWIRE SERVICES OR FOR RELEASE, PUBLICATION, DISTRIBUTION OR DISSEMINATION DIRECTLY, OR INDIRECTLY, mineraL resource ounces for the toro deposit at cmd goLd mine LachLan star announces 314% increase in indicated 12 January 2012 Lachlan Star Limited *Required fields Message : (You can enter multiple email addresses separated by commas) To* : From*",
    "textAfterTable": "Table 2 contains a summary of the updated Toro deposit mineral resource. The new Toro mineral resource has been estimated at a 0.15 g/t Au cut off grade (previously 0.3 g/t Au) to enable mine planning utilising the lower grade material to be processed via a Run of Mine (ROM) dump leach method. The lower grade mineralisation is currently mined as waste and the initial ROM leaching trials indicate that it will be economic to recover gold from this material, which will have a positive impact on both cash flows and gold output. Total mineral resources for the CMD Gold Mine now contain 725,000 ounces of gold in the Indicated category and 923,000 ounces of gold in the Inferred category as shown in Table 3. The new mineral resource for the Toro deposit is the first of the 2012 mineral resource updates for the CMD Gold Mine. The Toro deposit is open along strike to both the north and south, and across strike to the east and west in several areas. Work is continuing to update the resources at the other CMD Gold Mine Projects. In addition, there remains substantial potential to expand the mineral resources through infill drilling between the Toro Central and Socorro pits, where there is currently insufficient drilling data to extrapolate the resource between the pits. The aim of the 2011 drill program was to expand the resource base, and to upgrade the Inferred mineral resources",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}