{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Will enjoy being here"
        ],
        [
            "Comments",
            "Those who can deal with hot and humid weather, and also can spend their winters without snow.",
            "Visit the school!",
            "The city of New Orleans offers students countless opportunities. Since Tulane is also conveniently located across the street, students have options to take classes at either school.",
            "It is in a beautiful area."
        ]
    ],
    "pageTitle": "Loyola University New Orleans Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Loyola-University-New-Orleans/reviews?_escaped_fragment_=/show/57342",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00233-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 916095263,
    "recordOffset": 916043548,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{97024=Apply before December 1 for the best scholarships. Apply for the FAFSA early. Take a campus tour before May 1 and you'll be eligible for a on-time only $1,000 scholarship. Visit campus because the pictures on thei website dont do Loyola justice. Campus is BEAUTIFUL!, 143237=Every December, the school manufactures snow in the front of the campus for students and anyone who can make it. Its a fun time in the snow before the holidays start ., 110539=There are four dorms to choose from throughout your stay at Loyola University New Orleans. Each dorm as it's perks. Biever Hall's perk is as an incoming freshman, you live with all freshman! It's the easiest way to meet people in your grade who are going through the same thing as you. Biever was also recently updated. The perks to Buddig hall is the guarantee to having a double room (you and one other roommate, whereas Biever has half triple rooms). Another perk in Buddig is having your own bathroom. Bievers are communal. Carrolton Hall is for upperclassmen and here you have the opportunity to live in apartment style rooms with 4-5 other people. Cabra Hall, located on the Broadway Campus is for upperclassmen as well and is shut down for the 2012-13 year for reconstruction. They should be very nice once they reopen for the 2012-14 year., 58277=The food is awesome. There is an on-campus dining hall, also many Cajun food shops on campus as well. Loyola also shares a dining hall with Tulane, and Loyola students are allowed to eat on Tulane's campus., 65543=The dorms are pretty bad, but everything about Loyola makes it worth it 1000 times over. If you want a big, fratty school-- this is not he place. However, if you want to go to a college with a vibrant, diverse student body, a beautiful but modestly sized campus in the heart of an electrifying city--this is your school!, 212446=© 2015, Cappex.com, LLC, 3042=Loyola wants its students to be well-rounded. So you learn many things while you are there... about different cultures, religions, ways of thinking. Also even though Loyola is a Jesuit University religion is never something that is forced upon you. Coming here has helped me become more open-minded. Also student teacher ratio is 1:11, 129519=Depending on where you live, you will get mixed reviews. I resided on 10th floor Buddig Hall. I was not impressed at all with the dorms, but they are being redone as of 2012, so prospect students will enjoy a new building.}",
    "textBeforeTable": "07/10/2009 Reviewer is A current student here. 16 out of 16 people found this review useful. 1 of 52 Zaina from Metairie, LA Check out reviews left by other students or leave your own review. You could win a free scholarship. Loyola University New Orleans Reviews Loyola University New Orleans › Louisiana › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot Loyola wants its students to be well-rounded. So you learn many things while you are there... about different cultures, religions, ways of thinking. Also even though Loyola is a Jesuit University religion is never something that is forced upon you. Coming here has helped me become more open-minded. Also student teacher ratio is 1:11 Login to rate or flag the reviews Brandon from Kenner, LA 07/08/2009 Reviewer is A current student here. 13 out of 13 people found this review useful. 2 of 52 Categories Comments Great for these types of students Loyola is big on community service, the focus on the individual through mind and soul. Each individual aspect of a person is looked upon. Happy college searching! Tips for prospective students Visit the school during the school year, not during the summer. Sure, the buildings are nice, but as in all colleges, thats not what you are really looking for. As a prospective student you need to pick a school",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}