{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Santa Clara is not in the best area, so campus safety always has a strong presence, making the campus a very safe place to be.",
            "Although the school does not officially recognize Greek life, there are a few sororities and fraternities off campus, and while it is not necessary to join the greek system, many who do find it an extremely rewarding experience.",
            "Great club atmosphere, if you can imagine a club, you can make it happen. Santa Clara is a perfect school for clubs and events.",
            "If you love being a part of student government, or any club or organization, you will love Santa Clara. It will provide you will all sorts of ways to get involved, and I guarantee that you will find one that suits you perfectly, be it Rugby club, or even the Associated Student Government.",
            "The lawns around the library are perfect for tanning, and the unofficial trip to bay to breakers is an age-old tradition, one that must be seen to be understood.",
            "Expensive, but an amazing school. The opportunities you will get here are priceless, and i ugre you to take advantage of as many as possible. You won't regret it.",
            "Although Santa Clara is not a college town per se, there are plenty of places near enough that you will never get bored. If you want to go to the beach, Santa Cruz is only half an hour away. But if you crave a trip to the city, San Francisco is only 45 mins, making it an excellent weekend destination.",
            "Here is where Santa Clara falters slightly. although they have a variety of choices available, they get tiring and boring after awhile, and the food is very, very expensive. I would recommend the dining plus plan, which gives you more points per semester.",
            "Dorm life is great, every dorm becomes like a family, due to the tight-knit communities Santa Clara cultivates. Living in a dorm on campus has been one of the best experiences of my life.",
            "Courses here are difficult, but not overwhelming. Obviously this can change due to the multitude of majors here, but overall, I have found the coursework to be sufficiently challenging.",
            "Make sure you stand out in your high school class. Santa Clara University looks for leaders, so being one will greatly improve your chances of admission.",
            "A beautiful amazing midsize school in Northern California. I love everything about it, but the best part is the people you will meet."
        ]
    ],
    "pageTitle": "Santa Clara University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Santa-Clara-University/reviews?_escaped_fragment_=/show/83785",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00002-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899688047,
    "recordOffset": 899642387,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{190225=© 2015, Cappex.com, LLC, 182853=We do have Greek life, but it's technically not associated with the school. All houses are off-campus and are not your traditional sorority mansions or giant frat houses. They are normal houses, and the frats almost always have more than one. As of Winter 2015, we have 6 fraternities and 5 sororities. Everyone you talk to will have different opinions on Greek life, so take what you hear with a grain of salt., 166893=I feel safe walking outside at 2:00 am.}",
    "textBeforeTable": "08/10/2009 Reviewer is A current student here. 28 out of 28 people found this review useful. 1 of 40 Bao from San Jose, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. Santa Clara University Reviews Santa Clara University › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot I am currently going into my second year of college here at Santa Clara and we are on a quarter system so classes go by fast and therefore I have already taken about 12 different classes. You can take up to 18 units per semester and most classes are 4 - 5 units each. The best thing about Santa Clara's educational management system is that once you apply in a direction of a certain major, it is required for some upperclassmen to volunteer to guide all freshmen in picking all these classes and organizing what you will be doing for the year. So, the stress of picking classes is greatly decreased. Login to rate or flag the reviews Stephanie from Los Gatos, CA 05/26/2011 Reviewer is A current student here. 9 out of 9 people found this review useful. 3 of 40 Categories Comments Great for these types of students If you work hard, you do well in your classes by virtue of effort, and you understand the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}