{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Food is not that great at Los Angeles Pierce College. It has a mini Cafe where students can get the basic drinks, and a few actual foods such as pizza, bagels, sandwiches, and hot wings. If it had fast food restaurants, it would be awesome! There are couple restaurants not far from the school students go to because of the poor food and dining; if not that, students simple bring their own lunch",
            "There is no Dorms available at Pierce College; therefore living with the parents and or living with a friend(s) will be the choice to go with. I think that dorms at Pierce College would be a great thing to have; maybe students will study more and feel that they have a purpose since they will be close to school.",
            "This issue is everywhere; some students do well in school while other tend not to. I believe it is the students responsibility to do well if they want to succeed. As of reviews, I have noticed Los Angeles Pierce College has pretty high rates on transferring rates; therefore, academic rigor should be a plus!",
            "As any student entering a college or university, they should be aware that it is up to the student to keep tract of their schedules at all times. Nobody will be pushing you to get good grades like counselors at high schools do. Self motivation will be the number one tip for a student entering college.",
            "Los Angeles Pierce College is an amazing school filled with friendly and dedicated professors who will go beyond to give their students the education they need. This School also has counselors, health offices, and what not for all students who need that extra boost. Although Pierce College can use some remodeling for bigger class rooms, this school is perfect for any student who wants to achieve in life."
        ]
    ],
    "pageTitle": "Los Angeles Pierce College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Los-Angeles-Pierce-College/reviews?_escaped_fragment_=/show/17078",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00084-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901123695,
    "recordOffset": 901057535,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{297307=There is a Halloween Carnival in October. There are also sports events that students can go to. Students can also join clubs or be a part of the Round Up Newspaper published every week during the Fall and Spring., 284219=The Los Angeles Pierce College is an excellent institution. The have several students offices, where they help us all students to reach our goals and success in our studies. I will be graduating in the spring of 2014., 176308=When I first started in 2010 tuition was about $26 and two years later it's about $46..., 23592=May sure you always Visit a College before accepting. Check to see if there is a way to get around., 247280=Pierce College has academically prepared me for my fall 2013 admission to Mount st. Mary's college and I'm forever grateful. This 2 year college saved me financially and got me all the classes needed to transfer. Now I'm ready to start my new journey at a University to receive my bachelors in Sociology, 120032=A new cafeteria is being constructed and will open for the Fall of 2012. Food is available at the student store, food trucks, and cafe. The cafe food is somewhat overpriced for the quality but it is a convenient option for many students., 43962=Pierce college has some pretty good sports teams. They always have football and basketball games to watch on campus. They also have a cheerleading squad which is fun to watch while the game is going. Pierce college also has an amazing halloween festival in October. They use the money for admission, games, and food to go back to the school. It's a great creative way for the community to come together and enjoy a fun family atmosphere that is safe for all ages., 351661=© 2015, Cappex.com, LLC, 27377=The food court is currently closed for remodeling as of spring 2012, but there is a well-stocked coffee shop, the bookstore has microwaveable goodies and other snacks, and there's very high quality food trucks strewn throughout the campus. (there are also copious vending machines), 328098=As mentioned above, during this year, (specifically in the beginning and end of Spring 2014 semester) all staff and professors have made it a priority to discuss safety matters in class, by e-mail, via text, as well as sending automated phone calls to keep students updated on matters concerning the campus, and most of all to maintain calm.}",
    "textBeforeTable": "07/19/2009 Reviewer is A current student here. 3 out of 4 people found this review useful. 1 of 85 Dustin from West Hills, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Login to rate or flag the reviews Student 07/26/2012 Reviewer is A current student here. 3 out of 3 people found this review useful. 2 of 85 Categories Comments Campus Safety The campus is very safe, there are officers on the campus and the professors are always there for help along with the counselors who are great. Clubs and Activities There are clubs and organizations for every ethnic backgroud and group which is fantastic. The community is huge and fitting in isn't a problem at all. The school is very active and there are activities going on throughout the year. Great for these types of students This school is perfect for anyone who wants to save money and enhance their skills before moving on to a University. The school helps everyone regardless of the background and doesn't deny anyone an education. The staff members are so helpful and it's perfect for all types of students. What to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}