{
    "relation": [
        [
            "Date",
            "Nov 1, 2007",
            "Dec 13, 2010",
            "Apr 7, 2014",
            "Apr 17, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: CASABI, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:POUNDS, GREG;KUSUMI, TIMOTHY;MAXWELL, GARY L.;AND OTHERS;REEL/FRAME:020049/0510 Effective date: 20071018",
            "Owner name: BROADSOFT CASABI, LLC, MARYLAND Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:CASABI, INC.;REEL/FRAME:025496/0606 Effective date: 20101012",
            "Owner name: BROADSOFT, INC., MARYLAND Free format text: MERGER;ASSIGNOR:BROADSOFT CASABI, LLC.;REEL/FRAME:032617/0837 Effective date: 20140331",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7856471 - Method and apparatus for binding multiple profiles and applications to a ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7856471?dq=7,103,380",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00334-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475724751,
    "recordOffset": 475675368,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6552=FIG. 30 is a detailed flow diagram showing voicemail integration according to the invention. In FIG. 30, network integrations for voicemail use are shown. In the example of FIG. 30, it is assumed that the voicemail message store supports the IMAP4 protocol, as well as the RFC 2177 extension (IMAP4 IDLE command). RFC2177 allows a mail client to get real-time updates for a selected mailbox, in this case the arrival of new messages.}",
    "TableContextTimeStampAfterTable": "{45346=This application is a divisional of co-pending U.S. patent application Ser. No. 11/745,888, filed 8 May 2007, which claims priority to U.S. provisional patent application Ser. No. 60/870,349, filed 15 Dec. 2006, and is a continuation-in-part of co-pending U.S. patent application Ser. No. 11/175,991, filed 5 Jul. 2005, which claims priority to U.S. provisional patent application Ser. No. 60/585,375, filed 2 Jul. 2004, each of which is incorporated herein in its entirety by this reference thereto.}",
    "textBeforeTable": "Patent Citations Although the invention is described herein with reference to the preferred embodiment, one skilled in the art will readily appreciate that other applications may be substituted for those set forth herein without departing from the spirit and scope of the present invention. Accordingly, the invention should only be limited by the Claims included below. As also discussed above, user gestures are used to determine the portion of the address book that the user wants to access. The system renders only that portion of the address book that the user appears to need. In this way, the user only receives the portion of the address book that he is currently navigating. Thus, the invention provides a means for interpreting navigation to provide a limited portion of the address book consistent with the navigation. For example, if the user is scrolling very quickly through the alphabet, the system would render portion of the address book that corresponds to the letters of the alphabet, e.g. A, B, C and so forth, on the user device when the user stops scrolling. Until the user stops scrolling, the system skips the list of contacts associated with each letter of the alphabet. As the user slows down the speed at which he is scrollingt, for example, scrolling through D, the system starts rendering more information to the user device. Thus, there are any number of heuristics involved in interpreting user",
    "textAfterTable": "US6826597 Dec 6, 1999 Nov 30, 2004 Oracle International Corporation Providing clients with services that retrieve data from data sources that do not necessarily support the format required by the clients US6871236 Jan 26, 2001 Mar 22, 2005 Microsoft Corporation Caching transformed content in a mobile gateway US7027818 Apr 10, 2002 Apr 11, 2006 Alcatel Method, telecommunication framework network and user equipment for provisioning of subscribed quality of service guarantees to subscribers of a network when they have to communicate by means of another network US7035923 Apr 10, 2002 Apr 25, 2006 Nortel Networks Limited Presence information specifying communication preferences US7298702 Dec 20, 2002 Nov 20, 2007 Sprint Spectrum L.P. Method and system for providing remote telephone service via a wireless local area network US7543034 Jun 8, 2004 Jun 2, 2009 Sharp Laboratories Of America, Inc. Instant messenger reflector US7610328 * Jan 23, 2003 Oct 27, 2009 Alcatel-Lucent Usa Inc. Methods and apparatus for a multi-technology subscriber",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}