{
    "relation": [
        [
            "Relationship",
            "Birth - no info",
            "Marriage - no info",
            "Birth of Daughter",
            "Death - no info"
        ],
        [
            "",
            "",
            "",
            "June 10, 1905",
            ""
        ],
        [
            "Jennie Konechny is a parent or ancestor of a spouse of one of my relatives. Because Jennie is not a relative of mine I am not actively researching her.",
            "I have no information on the date or place of birth for Jennie Konechny.",
            "She married Joseph Maxbauer. I have no information on the date and place of the marriage.2",
            "Her daughter Rose was born June 10, 1905 in Traverse City, Grand Traverse County, Michigan.2",
            "I have no information on the date and place of Jennie's death."
        ]
    ],
    "pageTitle": "Relatives, In-Laws, and Possible Cousins of Gary Kueber - Person Page",
    "title": "",
    "url": "http://kueber.us/p822.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00169-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 138812567,
    "recordOffset": 138799646,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 15 Apr 2015 16:27:46 GMT",
    "textBeforeTable": "Female, #16421 Mary Tack1 Credits Calendar Master Place Index Surname Index Master Index Search Main Page Person Page - 822 Relatives, In-Laws, and Possible Cousins of Gary Kueber",
    "textAfterTable": "Last Edited Mar 23, 2006 Citations [S3041] Cynthia Reed Snook, Snook family history information. Do not accept the accuracy/validity of any of the information on these pages without verifying it yourself. Please study my sources carefully before relying on the information. If you notice any problems or errors in the information or the display on these pages, please e-mail me (see bottom of page). Angela Dawn Miller1 Female, #16422 Relationships 7th cousin of Garril Louis Kueber 6th great-granddaughter of Johan Willem Snoek Father Leonard J Miller1 Mother Cynthia Susan Reed1 Last Edited Feb 21, 2004 Citations [S3041] Cynthia Reed Snook, Snook family history information. Do not accept the accuracy/validity of any of the information on these pages without verifying it yourself. Please study my sources carefully before relying on",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}