{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "In three sentences"
        ],
        [
            "Comments",
            "sports",
            "passion, dream, career"
        ]
    ],
    "pageTitle": "Embry-Riddle Aeronautical University-Prescott Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Embry-Riddle-Aeronautical-University-Prescott/reviews?_escaped_fragment_=/show/19072",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00163-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892679147,
    "recordOffset": 892610239,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{75847=Food and Dining at Riddle is controlled by Chartwells, a prison food service... YUCK! They have mediocre food, but luck fully this upcoming fall 2012 semester SODEXO is taking over the campus dining and bringing in stores like Starbucks. I believe that the food should definitely be better this next upcoming semester., 298200=© 2015, Cappex.com, LLC, 3100=Embry-Riddle Aeronautical University, Prescott has a huge advantage when it comes to classroom learning. The university is fairly small, an estimated 1500 students total which provides a small faculty-student ratio. Many of my fellow peers who attend other universities dislike being known as a number in their huge auditorium classes and feel they don't learn as well because they cannot freely ask questions. At Embry-Riddle, not only do the professors know your name, but also assist in campus events and dine in the cafeteria amongst other students. Classrooms are course specific, so a math class will not take place in a physics or materials classroom. Professors also have a wide range of their own credible experience in the field, so students are given life experiences in addition to the course outline., 120443=A school that is primarily focused on aviation, with the two biggest majors being aerospace engineering and aeronautical science (pilots). It's a pretty small campus with only 1800 students, and small, manageable class sizes. Students seem to be more focused on their education here, as compared to having a social life or partying., 112304=I have attended the Accepted Students Reception. I cannot wait to visit the Prescott campus in April. I think Embry-Riddle is the one for me., 145422=Getting better, a new contractor for 2012 will bring changes to the campus food.}",
    "textBeforeTable": "08/29/2009 Reviewer is A current student here. 35 out of 35 people found this review useful. 1 of 66 Anna from Fountain Hills, AZ Check out reviews left by other students or leave your own review. You could win a free scholarship. Embry-Riddle Aeronautical University-Prescott Reviews Embry-Riddle Aeronautical University-Prescott › Arizona › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck Embry-Riddle Aeronautical University is not the cheapest university, but the education received is worth the tuition. The professors are experienced, the campus is small, and the quality of information given is top notch. One in every four pilots are said to be an Embry-Riddle graduate. The education here is not standard by any means. It is all hands on, detailed information and students must be willing to work hard to succeed. Am enjoying being here At Embry-Riddle, I feel like I'm a part of a great family, not a school. Since the campus is small, faces become very familiar quickly, and everyone is very friendly. There are few disturbances in regards to alcohol on campus since Embry-Riddle is a dry campus and the majority of students are very focused on their studies. The students are serious about their education and realize the potential they earn by attending this highly accredited university. Am learning a lot Embry-Riddle Aeronautical University, Prescott has a huge advantage when it comes to classroom learning. The university is fairly small, an estimated 1500 students total which provides a small faculty-student ratio. Many of my fellow peers who attend other universities dislike being known as a number in their huge auditorium classes and feel",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}