{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Take advantage of school sponsored activities, go out and explore with friends.",
            "live on campus, leave your door open, go out and meet people",
            "I am a freshman at UNCC. I love this school and have met a lot of great people and really enjoy my time here. I hope to get the financial aid I need to return in the fall"
        ]
    ],
    "pageTitle": "University of North Carolina at Charlotte (UNC Charlotte) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-North-Carolina-at-Charlotte/reviews?_escaped_fragment_=/show/104994",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00105-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901637724,
    "recordOffset": 901474598,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{70124=I will be enrolled in Jan 2013 so I'm not familiar with UNCC unusual tradition yet. I did go to UNCC Global festival this year. I found the event is amazing. It give the opportunity for students and public to know different culture from all over the world. Beautiful performances accompany by delicious international food., 435848=We have a Culture Club, and activites such as a upcoming football team in 2013, 705017=UNC Charlotte is a medium-sized school, with a friendly staff and student population and a beautiful green campus which is unexpected from a campus so close to such a major urban hotspot as Charlotte. UNCC has a ton of school spirit, which will only grow with the introduction of football in the fall of 2013. UNCC is home to many award-winning and world-renowned faculty, and I am proud to be attending., 36062=Charlotte offers its in-state residence around 2000 a semester and out of state is around 8000., 55903=If you are certain that you want to attend this college, be sure to apply super early. The early admission deadline is in October (I think it's October 5). If you apply early you can be eligible for merit aid and UNCC has a lot of merit aid., 719652=I loved my dorm life, although I know live off campus. My roommates are the girls I met in the dorms. The dorms are small, but they are building brand new dorms for the upcoming 2013-2014 school year which is going to be amazing because the dorm I stayed in was outdated...Otherwise GREAT!, 137019=This school is an exceptional learning opportunity with a beautiful campus. There are always events going on and free prizes. Most of the buildings are new and the rest is kept clean in 2013 we will have a football team!, 390019=I am a transfer student coming from the University of North Carolina at Pembroke. However, I truly have a great vibe about the University of North Carolina at Charlotte, because I have visited numerous times and each time I love it even more! The Summer of 2010 I attended this law program at UNCC and I just feel that there is more opportunity there to fully fulfill my desires in completing my degree in Pre-Law., 897447=Tuition, both instate and out of state, is relatively low when compared to universities of its caliber. It is ranked third in the top colleges in the UNC system, only behind NC State and Chapel Hill. It is an ever expanding college, expected to enroll 35000 students by 2020, while Chapel Hill is projected to enroll 33000 by the same time. My major is engineering, and upon discussing preferred majors from different engineering firms around North Carolina, the only engineering degrees most consider come from UNCC or NC State. All others get thrown out. The education at Charlotte is of high quality and a low cost and low hype., 346190=The University of North Carolina is a very beautiful school, with many buildings, an awesome student union, and a decent gym. The teachers are decent, depending on you get, some will help a lot more than others. The school will be getting a football team in 2013, but the basketball games are fun!, 38596=The University of North Carolina at Charlotte has a home atmosphere. It is on a beautiful 1000 acre land located near Concord. It is only 10 minutes away from the city., 44060=I am an out of state student which means I have to pay a lot more than in-state students. Tuition is very good compared to a lof of other schools. We have Division I NCAA basketball teams and a ver good soccer team. It is worth it to watch winning sports teams. Charlotte is also getting its first football team Fall of 2014., 575035=Its a modern school, especially the engineering college. It also is getting a football team in 2013. A school that should not be overlooked., 870492=One of the best features about this campus is dorm life. UNCC offers a variety of different housing to accommodate your stay. For incoming freshman i would suggest either a high-rise dorm or lynch hall. The high-rises are probably one of the best places the campus has to offer where you can meet new people. Each room will have you and another roommate, each given your own bed, closet, and desk. Each floor has four public bathrooms with multiple showers and toilets, so you will never have a concern for privacy. The high-rise also will accommodate a new dining hall in Fall 2014 which by the looks of it it looks phenomenal. Another good housing option for freshman is Lynch hall. Each dorm has four occupants given there own separate room. However all of the four occupants must share a bathroom and shower. This is an ideal spot if you like to have a bit more privacy. This building is located right next to the student union and is close to all the academic buildings, so it is not a hassle to walk to class everyday. Lynch also is a great place to make friends., 868633=They are all kinds of activities you can do around campus. There are numerous clubs you can join, and intramural activities you can play on as a team. Also the student union has a movie theater which if your a student you can get into for free. UNCC is now newly home to the Charlotte 49ers football team which just kicked off its first inaugural game Fall 2013. The basketball and soccer games are really cool to go to as well., 596392=At this school, I feel like you truly get what you pay for as far as academics and student life goes..and it'll be more worth it once football starts in Fall 2013. For all this school has to offer for under $20,000, I think it's a great place to be, 214055=The college has great overall quality in terms of all educational departments. The college lies within a great a wonderful city full of many compelling extra-curricular activities. The college also has a good sports organization. However, they lack a football team until the year of 2013., 612882=There is always something going on on campus! Basketball games are popular, and starting Fall 2013 Niner Football will be here! The National Whitewater Rafting Center is close by, as well as Crowder's Mountain State Park for those who like hiking and other outdoor activities. If you like going out on the town, Downtown Charlotte is a short drive away from the University and party buses regularly go from campus to various nightclubs., 51055=Something is always going on, on campus you just have to be willing to get involved. There are hundreds of clubs to choose from and several sports teams (including club/intramural). Football will be coming fall of 2013, 925883=© 2015, Cappex.com, LLC, 508555=UNC Charlotte is a rapidly growing University. Additional buildings are shooting up daily as the prospective Fall 2013 football stadium is nearing a finish. As of now, UNC Charlotte is primarily a commuter school. However, in the next few years I expect to see this drastically change as we form one team for Charlotte, NC., 677583=The campus is located in the midst of 1000 acres of wooded area. There are some cool trails to walk and bike and the campus even as its own Botanical Garden that tourist enjoy coming to see., 692196=There are very few times which students feel unsafe on the campus. There are many emergency lights/buttons around the campus. There is also safe ride which runs until 2:00 AM, if a student calls the bus will pick them up and transport them to any place on campus. There is also a large population of police on campus., 96667=Since I became a UNCC student in August of 2009, I have learned a great deal. In addition to the daily rigors of academic life that being a student at UNCC brings, I have learned how to adjust from a small, private high school to an enormous (by comparison) public college. Perhaps the most important thing that I already knew and my experience at UNCC has confirmed is the importance of getting involved in campus life. In order to get something out of it, one must in turn put something into it, and in no arena have I seen this fact validated more than in my experience at UNCC., 611595=UNC Charlotte hosts all kinds of events throughout the year, though I don't think any of them are particularly unusual. We host a 5K run in February, Feisty's holds a hot dog eating challenge, and there is a semi-annual international party held in the student union welcoming the international students each semester. We also hold service events such as the day when we make 1,000 sandwiches for the homeless, and blood drives., 850009=I am a commuter because i live close to campus but i've heard dorm life is fun. My friends who live on campus say they have made a lot of friends that live in their dorm. They say that they enjoy the closeness of everything because they live on campus. Also, there are many options to housing and off campus living. UNCC is actually building new off campus housing to be ready for the 2014-2015 school year., 220108=The campus encourages everyone to take precautions. If it is late and dark outside, one can call safe ride, which will come pick one up and take one to their desired destination. It runs until 2:30 am. Also there are poles with blue lights that are like a tracking device. If one is in a dangerous situation, then one just touches the button and the police are able to track where one is at and come provide assistance., 335657=Classes can be hard, especially chemistry. Don't let them demoralize you, although it can seem like they were designed to be that way. Adapt to each professor's teaching style. Keep up with your classes. Engineering program is extremely frustrating in 1201, but once you get through that you get to play with lathes and mills. Math department has pretty good teachers, can't say the same for physics., 110410=There is great security on this campus. There are lit up emergency poles through out the campus. You will always see campus police riding around. At night there is Safe Ride transportation to get you to your destination safely. It runs from 4:30 pm-2:30 am, and you can just call it whenever you need it between those hours.}",
    "textBeforeTable": "06/09/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 36 out of 38 people found this review useful. 1 of 209 Bethany from Poughkeepsie, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. University of North Carolina at Charlotte Reviews University of North Carolina at Charlotte › North Carolina › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var",
    "textAfterTable": "Categories Comments Great for these types of students Everyone, all needs are usually met. Tips for prospective students Make sure that you look at the school before you come! It is a commuter school so on weekends a lot of people go home, but there is always something to do. The advisors are helpful too if the major you want isn't offered or you are undecided. Bang for the buck In-state tuition is extremely low, and even out-of-state tuition isn't terrible. Apply for residency and you'll definitely be getting your moneys worth. Am enjoying being here I've met the nicest people down here, and have rented out an apartment because the atmosphere is so great! Am learning a lot The teachers are always available to help and utilize online resources often during class to keep things from getting dull. The general education classes can be a pain but the more specialized your classes become the better the teachers become. Login to rate or flag the reviews Nicole from Waxhaw,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}