{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "13.67",
            "13.58",
            "14.40",
            "15.00"
        ],
        [
            "NSE",
            "13.65",
            "13.57",
            "14.40",
            "14.99"
        ]
    ],
    "pageTitle": "Ballarpur Industries Stock Price, Share Price, Live BSE/NSE, Ballarpur Industries Bids Offers. Buy/Sell Ballarpur Industries news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/paper/ballarpurindustries/BI12",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00128-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 593131271,
    "recordOffset": 593076971,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{216304=Zensar Technologies Recommended on Mar 24th 2015, 133732=28 July 2015, 134950=JSWSteel Jul Fut, 134243=UnitedBrewerie Jul Fut, 217613=Ballarpur Ind is in the Paper sector. The current market capitalisation stands at Rs 993.77 crore. The company management includes Gautam Thapar - Chairman, R R Vederah - Non Executive Vice Chairman, B Hariharan - Group Director - Finance, Sanjay Labroo - Director, A S Dulat - Director, Ashish Guha - Director, Nandini Adya - Addnl. & Ind.Director, B Venugopal - Nominee Director. It is listed on the BSE with a BSE Code of 500102 and the NSE with an NSE Code of BALLARPUR. Its Registered office is at P O Ballarpur Paper Mills, Ballarpur, Chandrapur District,Maharashtra - 442901. Their Registrars are RCMC Share Registry Pvt. Ltd.}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}