{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Catholic",
            "Black Protestant",
            "Other",
            "None"
        ],
        [
            "Adherents",
            "28,690",
            "4,749",
            "900",
            "802",
            "1",
            "31,141"
        ],
        [
            "Congregations",
            "92",
            "25",
            "1",
            "5",
            "1",
            "-"
        ]
    ],
    "pageTitle": "Ridgetop, Tennessee (TN 37072) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Ridgetop-Tennessee.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00001-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 366582631,
    "recordOffset": 366458514,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{28187=On 12/24/1988, a category F4 tornado 25.3 miles away from the city center killed one person and injured 7 people and caused between $5,000,000 and $50,000,000 in damages., 5316=Educational Attainment (%) in 2013, 13990=Sulfur Dioxide (SO2) [ppb] level in 2012 was 2.30. This is about average. Closest monitor was 5.7 miles away from the city center., 4918=School Enrollment by Level of School (%) in 2013, 165744=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!, 1184=2008 Presidential Elections Results, 614=Graphs represent county-level data. Detailed 2008 Election Results, 12565=Particulate Matter (PM10) [µg/m3] level in 2012 was 19.3. This is about average. Closest monitor was 13.3 miles away from the city center., 13265=Ozone [ppb] level in 2012 was 31.9. This is about average. Closest monitor was 12.3 miles away from the city center., 2042=1996 Presidential Elections Results, 45289=According to our research of Tennessee and other state lists there was 1 registered sex offender living in Ridgetop, Tennessee as of August 04, 2015. The ratio of number of residents in Ridgetop to the number of sex offenders is 1,930 to 1. The number of registered sex offenders compared to the number of residents in this city is a lot smaller than the state average., 14726=Carbon Monoxide (CO) [ppm] level in 2006 was 0.692. This is significantly worse than average. Closest monitor was 13.3 miles away from the city center., 1470=2004 Presidential Elections Results, 15371=Air Quality Index (AQI) level in 2012 was 88.4. This is about average., 64109=Incorporated in 1935, 28503=On 4/27/1970, a category F4 (max. wind speeds 207-260 mph) tornado 20.2 miles away from the Ridgetop city center killed 3 people and injured 85 people and caused between $500,000 and $5,000,000 in damages., 11815=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 9.48. This is about average. Closest monitor was 9.5 miles away from the city center., 1756=2000 Presidential Elections Results, 898=2012 Presidential Elections Results, 11065=Lead (Pb) [µg/m3] level in 2004 was 0.00568. This is significantly better than average. Closest monitor was 5.7 miles away from the city center.}",
    "TableContextTimeStampAfterTable": "{42377=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 11730=7.16% of this county's 2011 resident taxpayers lived in other counties in 2010 ($34,257 average adjusted gross income), 13560=7.11% of this county's 2010 resident taxpayers moved to other counties in 2011 ($33,931 average adjusted gross income)}",
    "textBeforeTable": "Religion statistics for Ridgetop city (based on Robertson County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Fuel oil, kerosene, etc. (1%) Bottled, tank, or LP gas (3%) Utility gas (41%) Electricity (55%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 11 Robertson County: 1.74 / 10,000 pop. Tennessee: 1.99 / 10,000 pop. Number of supercenters and club stores: 1 This county: 0.16 / 10,000 pop. State: 0.17 / 10,000 pop. Number of convenience stores (no gas): 4 Robertson County: 0.63 / 10,000 pop. Tennessee: 0.65 / 10,000 pop. Number of convenience stores (with gas): 30 Robertson County: 4.75 / 10,000 pop. State: 5.16 / 10,000 pop. Number of full-service restaurants: 23 Here: 3.64 / 10,000 pop. State: 6.56 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}