{
    "relation": [
        [
            "Team #1",
            "Aberdeen",
            "AEK Athens",
            "Bolton Wanderers",
            "Zenit St. Petersburg",
            "Galatasaray",
            "Anderlecht",
            "Brann",
            "Zürich",
            "Rangers",
            "PSV Eindhoven",
            "Slavia Prague",
            "Rosenborg",
            "Sporting CP",
            "Werder Bremen",
            "Benfica",
            "Marseille"
        ],
        [
            "Agg.",
            "3–7",
            "1–4",
            "1–0",
            "2–2 (a)",
            "1–5",
            "3–2",
            "1–8",
            "1–3",
            "1–1 (a)",
            "4–1",
            "2–3",
            "1–3",
            "5–0",
            "4–0",
            "3–2",
            "3–2"
        ],
        [
            "Team #2",
            "Bayern Munich",
            "Getafe",
            "Atlético Madrid",
            "Villarreal",
            "Bayer Leverkusen",
            "Bordeaux",
            "Everton",
            "Hamburg",
            "Panathinaikos",
            "Helsingborg",
            "Tottenham Hotspur",
            "Fiorentina",
            "Basel",
            "Braga",
            "Nuremberg",
            "Spartak Moscow"
        ],
        [
            "1st leg",
            "2–2",
            "1–1",
            "1–0",
            "1–0",
            "0–0",
            "2–1",
            "0–2",
            "1–3",
            "0–0",
            "2–0",
            "1–2",
            "0–1",
            "2–0",
            "3–0",
            "1–0",
            "3–0"
        ],
        [
            "2nd leg",
            "1–5",
            "0–3",
            "0–0",
            "1–2",
            "1–5",
            "1–1",
            "1–6",
            "0–0",
            "1–1",
            "2–1",
            "1–1",
            "1–2",
            "3–0",
            "1–0",
            "2–2",
            "0–2"
        ]
    ],
    "pageTitle": "2007–08 UEFA Cup - Simple English Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://simple.wikipedia.org/wiki/2007%E2%80%9308_UEFA_Cup",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00036-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 887058043,
    "recordOffset": 887019084,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{322079=The final was contested by Russian side Zenit St. Petersburg and Scottish side Rangers on 14 May 2008 at the City of Manchester Stadium in Manchester, England. Zenit won the match 2–0, with goals from Igor Denisov and Konstantin Zyryanov coming in the last 20 minutes of the game to give Zenit their first UEFA Cup title., 269311=The draw for the round of 32, which was conducted by UEFA General Secretary David Taylor and Michele Centenaro, UEFA's head of club competitions, was held on Friday, 21 December 2007 at 13:00 CET in Nyon, Switzerland. The eight group winners were drawn against the eight third-placed teams, while the eight second-placed teams were drawn against the eight teams who finished third in the Champions League groups. Teams from the same group or the same country cannot be drawn together., 15023=The draw was held on Friday, 29 June 2007 at 13:30 CET in Nyon, Switzerland. It was conducted by UEFA General Secretary David Taylor and Michele Centenaro, UEFA's head of club competitions. The matches were played on 19 July and 2 August 2007.[2], 79637=The draw was held on Friday, 3 August 2007 at 13:00 CET in Nyon, Switzerland. It was conducted by UEFA General Secretary David Taylor and Giorgio Marchetti, UEFA's director of professional football. The matches were played on 16 August and 30 August 2007.[6], 198363=The draw was held on Tuesday, 9 October 2007 at 12:00 CET in Nyon, Switzerland. It was conducted by UEFA's director of professional football Giorgio Marchetti and Michele Centenaro, UEFA's head of club competitions., 295663=The draw for the Round of 16, which was conducted by UEFA General Secretary David Taylor, was also held on Friday, 21 December 2007 at 13:00 CET in Nyon, Switzerland. The first legs were played on 6 March 2008. The second legs were played on 12 and 13 March 2008. Unlike the previous rounds, teams from the same group or country may be drawn together from the round of 16 onwards., 347986=Sources: Top Scorers Final - Wednesday 14 May 2008 (after match), 309777=The draw for the quarter-finals, semi-finals and final, which was conducted by UEFA General Secretary David Taylor and Denis Law, the ambassador for the final in Manchester, was held on Friday, 14 March 2008 at 14:00 CET in Nyon, Switzerland. The first legs of the quarter-finals were played on 3 April and the second legs were played on 10 April 2008., 3364=The 2007–08 UEFA Cup was the 37th UEFA Cup. It is UEFA's second level club football tournament. The final was played at the City of Manchester Stadium, Manchester, England on 14 May 2008. The final was played between Rangers of Scotland and Zenit St. Petersburg of Russia. Zenit won the match 2–0, with goals from Igor Denisov and Konstantin Zyryanov. It was their first UEFA Cup title. The first qualifying games were played on 19 July 2007. The main tournament began on 20 September 2007. A total of 123 football clubs took part in the tournament (including its qualifying rounds)., 317656=The semi-final matches were played on 24 April and 1 May 2008., 131711=The draw was held on Friday, 31 August 2007 at 13:00 CET in Monaco. It was conducted by UEFA General Secretary David Taylor and Gérard Houllier, the winning coach in the 2000–01 tournament. The matches were played on 20 September and 4 October 2007.[7], 270144=The first legs were played on 13 February and 14 February 2008. The second legs were played on 21 February 2008.}",
    "lastModified": "Fri, 24 Jul 2015 02:56:56 GMT",
    "textBeforeTable": "The draw was held on Friday, 29 June 2007 at 13:30 CET in Nyon, Switzerland. It was conducted by UEFA General Secretary David Taylor and Michele Centenaro, UEFA's head of club competitions. The matches were played on 19 July and 2 August 2007.[2] First qualifying round[change | change source] 2007–08 UEFA Cup qualifying rounds Main page: Qualifying stage[change | change source] Final in Manchester 14 May 2008 Semi-finals, second leg 1 May 2008 Semi-finals, first leg 24 April 2008 Quarter-finals, second leg 10 April 2008 Quarter-finals, first leg 3 April 2008 Draw for remaining rounds 14 March 2008 Round of 16, second leg 12 March / 13 March 2008 Round of 16, first leg 6 March 2008 Round of 32, second leg 21 February 2008 Round of 32, first leg 13 February / 14 February 2008 Draw for Round of 32 and Round of 16 21 December 2007 Group stage, 5th matchday 19 December / 20 December 2007 Group stage,",
    "textAfterTable": "3–3 (a) Zimbru Chişinău 1–1 2–2 Banants 1–5 Young Boys 1–1 0–4 Nistru Otaci 2–2 (4–5p) Budapest Honvéd 1–14 1–1 (aet) Ried 4–3 Neftchi 3–1 1–2",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}