{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "176.82",
            "174.98",
            "169.29",
            "166.49"
        ],
        [
            "NSE",
            "176.89",
            "175.06",
            "169.39",
            "166.56"
        ]
    ],
    "pageTitle": "Idea Cellular Stock Price, Share Price, Live BSE/NSE, Idea Cellular Bids Offers. Buy/Sell Idea Cellular news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/telecommunications-service/ideacellular/IC8",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00034-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 587234115,
    "recordOffset": 587178907,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{219955=Zensar Technologies Recommended on Mar 24th 2015, 221264=Idea Cellular is in the Telecommunications - Service sector. The current market capitalisation stands at Rs 61,430.02 crore. The company management includes Kumar Mangalam Birla - Non Executive Chairman, Himanshu Kapania - Managing Director, Sanjeev Aga - Non Executive Director, Rajashree Birla - Non Executive Director, Shridhir Sariputta Hansa Wijayasuriya - Non Executive Director, Arun Thiagarajan - Independent Director, Gian Prakash Gupta - Independent Director, Mohan Gyani - Independent Director, Tarjani Vakil - Independent Director, P Murari - Independent Director, R C Bhargava - Independent Director, Madhabi Puri Buch - Independent Director. It is listed on the BSE with a BSE Code of 532822 and the NSE with an NSE Code of IDEA. Its Registered office is at Suman Tower, Plot No. 18,,Sector-11 Gandhinagar,Gujarat - 382011. Their Registrars are Bigshare Services Pvt. Ltd., 134546=28 July 2015, 135057=UnitedBrewerie Jul Fut, 135764=JSWSteel Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}