{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus is safety is taken very seriously at Baylor. There are multiple security posts around campus, all you have to do if you feel threatened is hit the button and the police will show up immediately. There are always Baylor police walking around campus, driving around campus, their headquarters is even right on campus. If you need to go somewhere on campus at night, but don't feel comfortable walking by yourself, call them and they will have someone come pick you up and drop you off. The Baylor police meet with students in their dorms at the beginning of the year and go over safety rules, guidelines, the buddy system. I am 100% positive that Baylor is the safest place in all of Waco. The one thing to always remember though is never go around Waco at night, especially by yourself. Baylor truly has it's own bubble, never forget that.",
            "Personally, I'm not in a sorority, but from friends that are part of the Greek Life of Baylor i hear it's fun. They do become brothers and sisters, and they help each other and they have their own activities. The greeks build the homecoming floats, they host and participate in Sing and Pigskin Revue. Though they may be a small group on campus, the greeks are very involved in the school.",
            "Anything and everything honestly. If you want to be part of something, just join. The first friday of the first week of classes every club that Baylor has sets up a booth somewhere on campus and the students walk around to any building and talks to the club members, gives em their e-mail, and joins the club. Whether a sport, or a choir, or an academic club or anything that you would want to join will be available for you on that Friday night ready to welcome new members.",
            "Baylor University is a very faith based, community centered school that is really interested in the experience of the student. If you want a family during your college years Baylor is the best school for you. The school not only wants you to learn as a student, they want you to grow relationships and have experiences as a person and future leader in the world.",
            "Tortilla tossing, fountain running, hammock swinging, campus golf, Baylor has so many traditions we have our own bucket list. You have to run the line at a football game as a freshman, you have to go to Dr. Pepper hour at the SUB, build the bonfire as a Freshman, if you don't then you just haven't experienced Baylor.",
            "Baylor may be an expensive school, yes, but it is worth every penny. I have met people I will know for the rest of my life. I have met professors that will help me in my future career. I have gained experiences that will fill memory boxes. Baylor University is the best decision I could ever make for a University, it has given me knowledge and contacts and everything I could ever ask for a University to give me to prepare me for my future.",
            "Baylor students often refer to the Baylor bubble, that once you step out of it, off campus, you know you're definitely not in the bubble anymore, and it's true. Baylor offers specific things for students to do, and Waco offers specific things, but more often than not these activities are interchangeable. Baylor's many things to do have to do with helping the community. Whether Habitat for Humanity, Special Olympics, or the ever famous Steppin' Out. Waco also has it's own volunteer group that is mostly made up of Baylor students, but there is also more to do than volunteering. Baylor has a long list of traditions that a student simply must participate in to have any fun. Homecoming, Running the Line as a freshman, Welcome Week, Line Camp, Christmas on 5th, Island Party, Diadeloso, basically anything you can think of. An all school favorite is tortilla tossing, where you throw a tortilla shell off the bridge in town and try to land it on the pillars in the river, it's good fun and feeds some local ducks. There's also many sports, intramural, even dorm groups get together and they basically play anything you could think of. There's band and choirs and Quidditch and, of course, the SLC. Basically, if you think something is a fun activity, then I'm sure Baylor probably has it.",
            "Baylor has many options for eating on campus, whether in the student union building, in the science building, or the fine cuisine of Penland, Memorial, Collins, Brooks or the new East Village. The key to eating at Baylor is to find a dining hall that you really like, and sticking with it, or whichever one is more convenient for where your dorm is. Each dining hall is different, they offer different food options, different specials throughout the week and different foods their known for. All you have to do is sample the food and pick which one you like. Personally, my vote is for Collins.",
            "Who doesn't love living in a tiny room for a year with someone you've never met? Honestly, personally, I got lucky freshman year to room with someone as wonderful as my roommate was. For everyone else I knew it was really just a matter of communication. Dorm life at Baylor can be amazing, there are CL's (community leaders) ready to help with anything, activities planned throughout the year to bring people together, it's really just up to the residents to get involved. Dorm life is amazing at Baylor, a real community, you just have to communicate with your roomy and meet the people in your hall, and hopefully they don't like loud hard metal music at 3:00 in the morning.",
            "Classes are hard, I'm not gonna lie, but you can have fun learning too. To succeed at Baylor be prepared to work hard and spend many hours with a pencil in your hand, but get a study group together. Find some friends or classmates and meet at the library Starbucks and fill out some notecards, or work on a study guide together. College may be about doing your best in classes you need, but there's no reason you can't have fun doing it. Also, professors are very good here at Baylor at making even classes you might not need in your future fun, and interesting, so never be afraid to also ask your professor for study suggestions or to have a review in class, which most often than not they already have scheduled. But classes are hard, some more than others, find a way of studying that works for you and stick with it, it'll work wonders.",
            "Participate, though classes and homework may take much of your time and energy, there's always something to do on the weekends or during the week, the best way to meet people is to get involved in anything. Don't be afraid, run onto the football field as a freshman, raise your hand and ask the question in class, hang a hammock on a tree at the SUB, jump in and take it all in. Also, get to know your professors, Baylor is just small enough that if you know your professor, they'll know you, talk to them if you see them on campus, answer questions in class, one day you'll need that recommendation letter, or that final grade bump at the end of the semester.",
            "A wonderful family. Though the classes may be difficult and the heat overwhelming, this is a wonderful school for experiences that will change your life, and an open door to meet people you will know for the rest of your life. Baylor University is really a community of students and faculty that work together to create an atmosphere that helps the student achieve what they came here for, and much more."
        ]
    ],
    "pageTitle": "Baylor University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Baylor-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00259-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898081923,
    "recordOffset": 897866347,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{572062=There is always something going on at Baylor, and you'll never go bored if you just put yourself out there. I've been to various different events- from homecoming, to parades and a carnival, and have never had a poor experience. (Though Diadeloso 2012 was definitely not my favorite experience, but I have heard that Diadeloso is usually a lot better.), 30369=It depends on what courses you take. If you took AP language don't bother with a 2320 level class. I learned all of that in 10th grade. Baylor has these Great Texts courses where you read ancient literature and delve into the deep meanings and themes and reflect on human nature. In High School The Odyssey put me to sleep but my professor's discussions about all the material were fascinating. I also learned much in my Honors calculus based physics class. Honors courses are small and personal., 512994=Dia del Oso is a Baylor sponsored day in April where students get the day off and there is a carnival and concerts on campus. Freshman get to run the line, or run on the field before the football team, at every home football game. Before graduating, it is a tradition that students must run through the fountains near the science building and sit on the lap of the statue of Judge Baylor., 806953=Make sure that you get your application in as soon as possible, you want to have it in by the November 1st early action deadline. Come take a tour of the campus before committing to any school. Taking a tour while school is in session helps you to get a feel for the atmosphere of the campus and the students on a regular day, intern helping you know if this university is the right fit for you., 1102367=Baylor has a holiday celebrated on April 18 called Diadeloso, it means day of the bear in Spanish. Its a day for students to relax and have fun before the hectic finals arrive. Its filled with activities for students and a lot of different types of food is available from local restaurants., 41872=The first step is to get into Baylor is to do the requirements (excellent course selection, grades, rank, SAT/or ACT, and extracurricular activities and community service) and apply as early as August. Apply to other schools as well because you can negotiate prices. Apply for FAFSA as early as possible along with extra scholarships. The summer before school starts learn what type of learner are you (auditory, visual, kinetic or a combination). Make sure you are able to take good notes because not all teachers allow laptops in class. Lastly, visit Baylor for yourself so you know where your classes will be and the location of help centers. Once accepted visit bubooks.com to give you an idea the teaching style of the teacher and student’s opinions on that teacher. I have found it is better to judge the teacher by how they teach instead of the teacher’s ranking. Ask yourself, does he or she use power points or just lectures? Does he or she give pop quizzes or only exams? Will he or she require a heavy load of homework or independent studying? By having the teachers you prefer in mind map out the times for the classes. As a freshman your counselor will help you fit the classes you want but they do not consider the best teachers. TRY to pick one of the sessions for advisement during the summer, classes get filled fast!!! You can use bubooks to also buy and sell textbooks, do not bother buying books from the bookstore. You can log onto your bearweb account, sign in, click on student service & financial aid, next click registration and lastly on purchase your books to see what books you need for the upcoming semester. Lastly, on the first day of school exchange numbers with your peers., 168459=I am an international student from Asia and my initial doubts of whether I would fit in at Baylor were dispelled as soon as I arrived. The community was very welcoming and hospitable, and were genuinely interested in getting to know you. I too became more sociable and friendly as a result of this and I am always eager to meet and welcome new students. The campus is beautiful with great weather all year round. The city of Waco is small enough to keep you occupied but not large enough to where you find yourself going out on every school night. Besides, there are plenty of on campus events and activities to participate in. There is a broad selection of clubs, organizations, and sports to fit anyone's interests. The Greek Life at Baylor is quite vibrant and active with many events hosted each week. You meet a lot of new people from attending these events and becoming involved, and pretty soon you will see a lot of familiar faces on your way to class. There are a number of sporting events that fans can attend and usually the whole school rallies at the home games to support the players and show our school spirit. Baylor sports teams are among the top teams of the nation. Our women's basketball team is ranked number one while the men's basketball team is ranked sixth. Also, the 2011 winner of the Heisman trophy is Baylor's very own Robert Griffin III ! In spite of all of this, the atmosphere at Baylor is also very study friendly and academically oriented so there is no fear of being absorbed and completely distracted by the social aspect of college. Tip: Go visit the marina and take a kayak out to the lake.(The most relaxing thing ever), 216861=over 200 clubs and 1000 activities, 747832=There is a day in April that all organizations come and celebrate with booths, a race, dancing, live music, and all around fun. This also takes place during a school day, so all classes are cancelled that day. Sadly I cannot spell the name of this day on this website, as it does not see them as real words., 648893=One of the main unusual traditions on campus is called Diadeloso, which means day of the bear in Spanish. It is a day in April right before finals when everyone gets the day off and it is a campus-wide celebration. Students flood 10th Street and have a great time dancing up and down the street and meeting people you have not met all year. As for the activities on-campus, there are camel rides and bands that play all day long just to name a few. Diadeloso was a great day that will never be forgotten., 1089184=Who doesn't love living in a tiny room for a year with someone you've never met? Honestly, personally, I got lucky freshman year to room with someone as wonderful as my roommate was. For everyone else I knew it was really just a matter of communication. Dorm life at Baylor can be amazing, there are CL's (community leaders) ready to help with anything, activities planned throughout the year to bring people together, it's really just up to the residents to get involved. Dorm life is amazing at Baylor, a real community, you just have to communicate with your roomy and meet the people in your hall, and hopefully they don't like loud hard metal music at 3:00 in the morning., 1111406=How great food tastes, depends on the dining hall you go to. Since I stayed in North Russell, I spent most of my time in Penland which wasn't even that bad. The food there is probably the worst on campus, and pretty unhealthy, but on some days it can be really good. Collins has the best breakfast, and has pretty good meals all-around. Memorial is pretty good, but it lost its touch towards the end of the year. Most professors eat there. The sub just has restaurants like chick-fil-a, and ninfas. Starting in 2013, there should be a new dining hall in East Village if I heard correctly, but I'm pretty sure the food will taste great there., 649687=I have to say, Baylor does a really good job at providing quality food. There are four dining halls: Memorial, Collins, Brooks, Penland. Out of all of these dining halls, Memorial had the best food. The reason being they have quality ingredients and a plethora of food to choose from. Each dining hall has their own specialty, so it all depends on what you feel like eating that day. Collins has the best Mexican food, Brooks has the best burgers and Penland has the best breakfast and chicken wings. Lastly, another place that a student can get food from is the Student Union Building (SUB) inside they have Mooyah's Burgers, Ninfa's Mexican food, Chick-fil-A , and a small sushi bar. I believe in Fall 2012 we will also be getting a Panda Express. So the possibilities are endless!, 277081=If you plan to attend Baylor and will take the PSAT, designate Baylor as your first choice. If you are a Finalist, you'll earn a full tuition scholarship. If you aren't a National Merit Finalist, take the SAT or ACT as many times as possible before you enter Baylor for the first time and you can earn up to $117,280 for an SAT score of 1500+. As I said before, they will combine your highest score from each attempt to determine your composite score. Only reading and math (not writing) scores are counted towards the 1500. Apply early for the best housing choices. Consider an Engaged Learning Group or one of the other opportunities to meet students and engage one on one with professors. I participated in an ELG and really benefited from the relationships formed and contact with my professors., 88492=Baylor has a rolling application deadline. Submit your application in as soon as possible. You don’t want to be clueless at the end of May as to where you are going in two months. You also have a better chance of getting the dorm of your choice. Baylor emphasizes SAT scores. Take the SAT early, if need be take it twice place yourself in the best position possible. Plan for orientation: How many days will you stay? Where will you stay? What questions do you have? What opportunities interest you? You will register classes at orientation also, be sure to pick an early orientation to better your chances of a great schedule. The first to register have the first pick at times. Make sure to become acquainted with Robinson Tower where help with financial aid, records, transcripts, etc can be found. Use facebook to find your roommate(s) and coordinate living together for the year to come., 197642=We all know that Baylor is a private university. As with all private institutions, since they are privately funded, the tuition is higher than public institutions. Fortunately, the value of a Baylor education and all the benefits that come with a Baylor is so worth the price! Also, Baylor offers tons of financial aid and scholarships. In fact, for the sixth year in a row, The Fiske Guide to Colleges 2012 has named Baylor a “best buy, one of just 43 colleges and universities in the country to be so honored., 905590=Baylor has multiple options for students to live in dorms and there are more set to open in Fall of 2013. Freshmen are required to live in dorms but most students stay on campus following their first year., 432079=This university has been in TX since 1845. There are families that have many generations that have attended Baylor which shows the pride students share when attending this school. The community embraces Baylor and their students., 822400=Opening a new dining hall in 2013-2014 year, but campus food is still campus food. There are a lot of restaurants nearby though. Waco seems small, but it can be pretty convenient if you know where you're going., 136614=I just finished my first semester at Baylor University. In that short time period from August to December I learned a lot more than I expected to. I expected my semester to be a breeze and fast paced review of everything I learned in high school and with the possibility of learning a few new things. It turns out that I actually learned everything I had learned in High school with an entirely new understanding and then some. Study skills being one of them. I truly appreciate all of the things I have learned at Baylor, and expect to learn a lot more during my time here., 454416=With four dining halls and various restaurants in and around campus, there is never a shortage of food. Unique to Waco, Baylor is the talk of the town 24/7, just a short walk across the street and around 20 restaurants are available at your fingertips. One of our dining halls are even open until 12:30 on the weekdays to aid for the student who is pulling an all nighter., 253256=The dining halls are open at reasonable times on weekdays - early enough for someone to get some breakfast before an 8:00 class, and usually close enough to reach on foot in decent time. As for the selection, it's not exactly great, especially if you're a picky eater., 667901=I fell in love with Baylor on my first visit during orientation of Summer 2011. It is such a beautiful campus and everyone is so friendly and welcoming, no matter who you are. I am entering my sophomore year as a Baylor Bear and I could not picture myself at another university.}",
    "textBeforeTable": "07/17/2009 Reviewer is A current student here. 68 out of 68 people found this review useful. 1 of 295 Meaghan from Keller, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Login to rate or flag the reviews Nathaniel from Cypress, TX 07/18/2009 Reviewer is A current student here. 26 out of 26 people found this review useful. 1 person found this inaccurate. 3 of 295 Categories Comments Great for these types of students Students that like a rigorous academic community. Baylor University may be one of the easier private schools to get into, but don't let that fool you. If you are accepted Congratulations!!, but be prepared for a good amount of work ahead of you, including life decisions. I know I don't want to make them either, but life decisions come in the package of going to college so be prepared to make some. Also Baylor University is good for students that want to be well rounded. All students are required to take Religion classes, but the Professors never really try to push any one Religion on you. The required Religion and Chapel classes are not supposed to become a burden for the Freshman, but more of an experience to become a more well-rounded individual that will leave Baylor University with much more than they",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}