{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "edison has security around the campus and there is a blue pole in every parking lot where a person can go and call for assistance with anything from needing there battery in there car to be charged to even more severe emergencies.",
            "there are some sororities at edison that are involved with the community and helping college students to succeed more.",
            "there are many different clubs and activities at edison including: basketball, sga, hip hop dance team, soccor, key club, and etc.",
            "the different clubs and activities that edison have to offer are great fo students that want to reach more than just academic excellence, but students that want to be a success academically and as a human being through interacting with different people.",
            "when attending edison there are many clubs a person can join and even beyond that a person can come up with there own club/ organization to have at edison, but he/ she must go through some paper work to get it approved.",
            "edison has great food options from vegeterian style to the big meat eaters. there is a side where a person can get salads, soups, subs, and etc. then on the other side is fried food, pizza, and etc.",
            "the classes at edison are not extremely vigorous because even if a hard class is taken there with a professor there are different tutoring options for every subject as a way for a student to succeed.",
            "when attending any college get to know your professors because it is best to build a relationship with your professor before you attend class as a way for you to become comfortable with talking to your professor if you should need help or reccommendations later on.",
            "edison accepts a diverse group of students, which makes edison a shool of open opportunity no matter what the back ground of a student may be."
        ]
    ],
    "pageTitle": "Edison State College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Edison-State-College/reviews?_escaped_fragment_=/show/90084",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00079-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902036231,
    "recordOffset": 901945074,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{514397=I do not live in the dorms at Edison, but I do know students that say they enjoy living on campus. Edison is close to many restaurants, stores, and other businesses so it is easy for students to commute to school and work if they decide to pick up a part-time job while in school. The dorms are much larger than some I have seen at various universities. The dorms were built in 2012, so the building has many new features that some don't. There's a gym, free wifi, and a huge courtyard for sports that make student life much more enjoyable., 518579=There are no sororities or fraternities on campus, but there is talk of developing a few this coming 2014-2015 school year., 131649=During the time I attended Edison housing was not available. They are currently building the dorms and they will be brand new for summer or fall 2012 I believe., 53838=There are thankfully many clubs on campus. If and when there are students who wish for a club that is not presently offered, there have the open opportunity to begin their own. A recent example of this is a Hip-Hop dance, art, and music club that has only just become official this Spring 2014 semester. In this club, some students often breakdance, rap, beatbox, and sometimes observe and encourage each other towards further artistic expression. Besides these many clubs on campus, we have an Art Gallery (Bob Rauschenburg Gallery) that has open exhibits for most of the year. There is also the Barbara B Mann performance hall which shows a variety of plays, live music shows, and some other quality performances. From time to time, students are invited to free meal or snack events on campus to either celebrate certain organisations, raise awareness, or celebrate a particular event., 199904=There dorms will be opening in Fall 2012 so there is not much to say about them yet, But they are brand new buildings and I would expect them to be pretty nice looking., 206113=Still early to tell since i will not start until August., 373674=Campus safety is paramount here. I can honestly say that in taking late classes, that sometimes got out at 9:30 pm, I didn't fear for my safety. You can always see security guards on Segways or walking around or on golf carts., 271250=Edison has one dorm building called the Lighthouse Commons. It's opening date is August 2012. I will be living in the dorm this coming fall semester. I've been on all of the tours they've had, and gone to all of the meetings about them. The dorm is actually more of an apartment style more than a regular dorm style. Each student gets their own room. You can choose between a 4 bedroom/2 bathroom or a 2 bedroom/2 bathroom. Each dorm room is equipped with a kitchen, common area with furniture, a washer and dryer, cable, air conditioning, and free wifi. Each individual room has a full size bed, desk, nightstand, and closet. The dorm has 24/7 security, a 3rd floor study area equipped with computers, a fitness center, a recreational room, outside grills, and personal parking. The dorm is amazing, and I totally recommend living in them., 132097=Most of the classes here that I have taken are not very challenging. There are a few professors who live to make their class an exception and try their hardest to make your life miserable. I am transferring out for the fall of 2012 with my AA and have only had two or three hard classes., 534296=© 2015, Cappex.com, LLC, 90892=esc's new state-of-the-art dorm complex is slated to open fall of 2012., 6292=While there are clubs, they're a bit selective (2nd year students, Honor students). Also, if you have a hectic schedule, most clubs aren't flexible enough for you to join. There are some marathons and walking events for good causes (March of Dimes, Cancer Cure,etc). They do offer free ice cream almost every month. And, they have interesting plays and musical concerts annually., 377119=2012-2013 was the first year that Edison had dorms. I personally did not live in them but I have friends who are. The reviews that I have heard are excellent. They are new, clean and spacious. Which is something that can not be said for a lot of University's dorms. They are also affordable and you are in a great living environment., 203523=I am sure they have all type of clubs and activities, but it's still really earlier to tell at this time since i will not be starting until the fall of 2012., 130168=The tuition is super cheap! I took about 13 credits for one semester and the tuition and fees were about $1500. I had the bright futures scholarship and it brought my total for the semester down to $700. Plus the school offers financial aid to those who qualify and they accept bright futures., 107176=right now edison is working on getting dorm up and running. they said everything should be ready to go in fall of 2012., 19524=There are lots of clubs and activities happening all the time, which is great - I was worried that I wasn't going to get that whole college experience that I was expecting. The campus is pretty and the people at the registry are really kind, but I don't really know if I enjoy Edison as of yet. Based upon what my friends who managed to get their AA's through dual enrollment at Edison told me, Edison tends to lose track of information; they're not exactly organized. One of my friends actually had to fight with the school for her credits. She had received enough credits to get her AA, but they were trying to tell her that she was a few credits short. Oh, and this is personal experience - I'm supposed to be getting money from Bright Futures but I apparently am not going to get ANY of it until September 6th, but by that point I'll already have been in class for two weeks and have payed for my tuition and books...I'm really upset that I might have to pay out of pocket for my tuition and books when I HAVE money from Bright Futures I can use! Other than that, I'm still remaining a bit positive about school. It could be worse, honestly., 193213=The dorms are opening for the 1st time the 2012-2013 school year, 332279=While there are clubs, they're a bit selective (2nd year students, Honor students). Also, if you have a hectic schedule, most clubs aren't flexible enough for you to join. There are some marathons and walking events for good causes (March of Dimes, Cancer Cure,etc). They do offer free ice cream almost every month. And, they have interesting plays and musical concerts annually., 135589=Edison is currently building dorms which will be done by about Fall 2012.}",
    "textBeforeTable": "07/06/2009 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 134 Kayla from Port Charlotte, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Tips for prospective students Make sure you get all your paperwork in on time. The financial office tends to be a bit sloppy with your paperwork, so have copies of everything just in case. Financial aid seems to come in a couple weeks late (sometimes 1 month flies by), so brace yourself. Also, academic advisors tend to be extremely busy most of the time, so schedule a meeting with them well in advance (weeks ahead). If you have morning classes, come to school 30 minutes to 1 hour earlier so you can park closer to your classroom. Try not to fool around a lot; it's easy to get lost in your material. Bang for the buck Very cheap. Attend this college if you want to save money! Don't just jump into universities. Take the time to save money while you go to classes at Edison State College. Depending on which classes you take and how many, tuition can cost up to $2,000. If you have Bright Futures or any other scholarship, it will help tremendously with these expenses. Night and online classes are almost too convenient. Some professors have pdf files of their textbooks (depending on which professor you have), others don't even use the assigned textbook. Am enjoying being here While there are clubs,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}