{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They have a card if you need any assistance during anytime of the day.",
            "I would be in the library all day.",
            "They have tons, you can even make you're very own.",
            "I heard they have many and would love to be part of them.",
            "Work out in the Rec center or catch a movie on campus.",
            "The food is quite tasty from here.",
            "Its something new and I would like to experience it.",
            "I heard they have an amazing program in nutrition. Something I want to study.",
            "Very friendly environment.",
            "When I stepped foot on the campus its just felt so right, like home. Every person I met there is very friendly. I would love to attend here in the fall 2012."
        ]
    ],
    "pageTitle": "Texas A & M University-College Station Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Texas-A-M-University-College-Station/reviews?_escaped_fragment_=/show/71161",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00312-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900158075,
    "recordOffset": 900049343,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{550301=Out of state tuition is steep. If you apply for scholarships during the rolling application process and receive at least a $1000.00 award, the scholarship and financial aid office will possibly extend a waiver on out of state tuition., 81269=The connections you make and the Aggie network you gain is definitely worth the cost of attending; qualified Aggies are more likely to get hired by Aggie bosses than alumni from other colleges. A&M offers financial aid to almost every student and has fairly low tuition if you live in-state. A&M was also named #9 on The Princeton Review's top 100 best value public colleges in January 2010 based on financial aid, costs and other criteria (USA Today)., 552811=Wonderful atmosphere on campus. Just attended NSC in early June and enjoyed hearing about all the great programs and classes I will start in the fall of 2012. Enjoyed getting to know some of my fellow classmates. I am from out of state and they were extremely nice and offered assistance for a new found Texas lifestyle!, 548560=Attended the meeting for Greek Life during NSC. Nice presentation. Not all national sororities and fraternities are at TAMU. Rush begins in late August for women. Around 3700 students participate in Greek Life., 209862=Out-of-state tuition is a little high compared to those who live in Texas. It would not be awful if you have scholarships because if you receive a $1,000 scholarship from Texas A&M they will grant you in-state tuition. That being said, the University only gives roughly 600 scholarships (said in the 2011/2012 e-mail), so your chances are not extremely high., 542553=One tradition includes our mascot Reveille. If she ever attends your class and she barks then the professor must release the class, no questions asked. I'm happy to say that it happened in my class during the Spring 2012 semester., 486347=When I stepped foot on the campus its just felt so right, like home. Every person I met there is very friendly. I would love to attend here in the fall 2012., 594659=© 2015, Cappex.com, LLC, 551138=Freshman who live on campus are now required to have a dining plan beginning in the fall of 2012. TAMU has two large dining halls as well as other options throughout campus., 79520=If you're willing to work hard and go to a really large school, Texas A&M is for you. There is no specific type of student, because essentially everyone can find a place in College Station where they fit in. But if you love traditions, forget about every other school and go to A&M. It's firmly rooted in tradition, honor, and excellence, and has been since 1876. Also, if you're thinking about going into the military, join the Corps of Cadets of Aggieland and get an edge for a future career in the armed forces., 516443=As I said earlier Texas A&M is strongly rooted on traditions. Some of the major traditions are the bonfire memorial, muster, silver taps and Big Event. During the Bonfire Memorial students meet at 2 am on a cold November day to honor the students who died during the tragedy years ago. Muster and Silver taps is a cermony held on the first tuesday to honor past and present students who have recently passed away. Lastly, Big Event is the largest member activity in the nation. Last year we had about 40,000 students volunteer. During this event, students give back to the community by helping homeowners with household chores to say thanks for letting us be apart of their community., 385192=I love the school when i first visited the school. I feel excited and looking forward to this fall of 2012. I will a freshman in college, and longing to attend my first football game :], 8155=Apply early. I applied early December and got my acceptance letter in January. This gave me time to think about the decision I was about to make. Join the Corps. The scholarship, guaranteed on-campus housing, academic support only available to corps members, and leadership training, not to mention the friends you will make, are so very important. Also, Aggie traditions are all based in the Corps, and those not in the Corps don't understand some of the most important aspects of being an Aggie. Visit the college. I can tell you everything great about it, but you need to visit and make sure it fits you., 159467=The atmosphere at College Station is the best in the nation and we are know for being the friendliest college in the nation. We say HOWDY to everyone and are home of the 12th man. You will never be board at a football game or any other sporting even and there is more than a 1000 campus organizations to get involved with. This was the only college I applied to after one visit., 249858=Apply early. The earlier you apply, the better your chances of being accepted. Applications start on August 1 and continue into December. Don't worry about bad ACT or SAT scores. Just apply. You may never know.}",
    "textBeforeTable": "07/22/2009 Reviewer is A current student here. 83 out of 85 people found this review useful. 1 of 144 Bryn from Dallas, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\");",
    "textAfterTable": "Login to rate or flag the reviews Jacob from Fairfax Station, VA 07/22/2009 Reviewer is A current student here. 45 out of 46 people found this review useful. 3 of 144 Categories Comments Great for these types of students There is no one that A&M, and the Corps, is not perfect for. The reason I went there ultimately is that it was a huge school, and since I wasn't exactly sure what I wanted to major in, I knew I would find something if I stuck around long enough (and I have). Tips for prospective students Apply early. I applied early December and got my acceptance letter in January. This gave me time to think about the decision I was about to make. Join the Corps. The scholarship, guaranteed on-campus housing, academic support only available to corps members, and leadership training, not to mention the friends you will make, are so very important. Also, Aggie traditions are all based in the Corps, and those not in the Corps don't understand some of the most important aspects of being an",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}