{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are emergency poles set up all over campus in case of any type of emergency. Once the button is clicked the Tech police are notifies immediately and there to assist what might be going on. There are students who drink, and if someone has had a little too much there is a taxi service that picks you up for free to take you home safely. Something that is very important for the safety of yourself and others.",
            "I am not apart of the Greek Life, but I do have many friends who are and who love it. It is such a great way to meet new people and truly be apart of the campus. Each sorority or fraternity take place in a Philanthropy as well as keeping up with grades and GPA. Greek Life is something I would recommend for first year students.",
            "Texas Tech has close to 200 clubs and is filled with so many fun activities to get involved with. I walk around campus and see people shooting at each other for the most known Zombies v. Humans. There is also a different sport being played every night out by the rec. If there might be something you want to start up even you can make your own club!",
            "Texas Tech has interests for any type of student on campus. Whether it be study groups for the students who strive for excellence, Skydiving Club for the adventurous, or intramural teams for the athletic students. Texas Tech University has a wide range variety for anyone who wants to fully enjoy their college experience, and get involved with students who share the same interests.",
            "My favorite tradition at Tech is the wrapping of Will Rogers before every football game. The Saddle Tramps use red crepe paper and completely cover the Will Rogers Statue is all red. Driving by campus and seeing the statue just shows one fun tradition. Will Rogers is also covered in black anytime there might be a tragedy.",
            "College itself is always going to be an investment. It might sting a little at first, but the outcome at the end exceeds any amount you might pay now. The education you receive, connections you make, and life lessons you learn are well worth the investment you are making now.",
            "You can find pretty much anything to do for fun here that you are interested in. There are free live music bands who play at the sub. Also intramural sports for competitive or just love for the sport people. I would have to say my favorite is the rec and leisure pool that I can just lay out all day and enjoy the sun. If you are interested in something Tech has it.",
            "Making homemade meals has always been a passion of mine so I have missed not having a kitchen of my own. Thankfully the food here is a good substitute for anything you might be in the mood for. There also is a grocery area at SAMs place if you do end up wanting to check out the kitchen downstairs in the dorms.",
            "Of course everyone loves having their own space to live in. However, the dorm life is part of the full college experience. I was skeptical at first but I have met so many great people just by walking down my hallway and being friendly. It is a great way to met new people who are in the same boat as you.",
            "The professors here show interest with all their students. Of course the ones who put forth the effort and show themselves during office hours are just that much more ahead of the game. Even if you might be struggling there are paid tutors all over campus who can help out.",
            "For upcoming students I would just tell them that going to class should be first priority. Being able to attend college is a privilege and you are here to better your education. If you show interest with your professors they will be more than happy to help you succeed.",
            "I am a first year college student at Texas Tech University. My experience here has been exciting, life altering, and just overall exhilarating. I could not have chose a better school to have such caring professors and to learn and grow as a young adult."
        ]
    ],
    "pageTitle": "Texas Tech University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Texas-Tech-University/reviews?_escaped_fragment_=/show/86579",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907084779,
    "recordOffset": 906890289,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{837818=During orientation you have to sing the School song. Some of the students follow the Goin Band during their march to the stadium., 441075=Apply early! Usually around December and November. Don't think you don't stand a chance of getting in. Once admitted, check up on your ERaider and Admitted Student Dashboard for all info for orientation, housing, required tests and documents, and just about everything else!, 87017=Hi. Can someone please tell me what my chances are of being accepted to TTU? I have a 3.3 GPA (about an 88), but am barely in the bottom half of my class (top 51%). I live in the San Antonio area and attend Alamo Heights High School. In case none of you know, it's ridiculously competitive here and a good majority of the kids are in AP, which gets them more points right away. I'm not one of those kids. Plus my class is very small (only 374 people). At a normal school, a 3.3 GPA would put me well in the top half or maybe even top 25% of my class. Really, a 3.3 is not bad at all. So will Texas Tech take look at the kind of school I go to when they consider me, or will they look solely at my class ranking no matter what? Alamo Heights is among the best and most competitive schools in Texas so that immediately puts me at a disadvantage. I haven't taken the SAT, but I got a 1480 on the practice one I recently took. Let's just assume that's the score I send to TTU. Would that be good enough? Please tell me about my chances. I would greatly appreciate it!, 641541=The Carol of Lights in December is just breathtaking. The entire campus is lit up for the holidays. The architecture at Texas Tech is beautiful. Spanish influenced beautifully designed buildings and they just take your breath away during the holidays. And nothing beats the spirit that you'll feel when tailgating and walking into the Jones for home games! LOVE IT!, 566894=Texas Tech may be a fantastic university, but it is pretty expensive. The tuition for the 2012 academic school year is around $20,000., 705646=One of my favorite traditions on campus is Carol of the Lights in December, which is Memorial Circle and all of the buildings surrounding it are covered in Christmas lights and turned on at the same time. There is a choir and parade, and the entire event is one that students look forward to every year. I don't know any other school that has that tradition, and it's something that I love the most about Texas Tech., 1092619=Campus traditions are a source of pride for Texas Tech students. School spirit runs high and the student section is consistently loud and enthusiastic at sporting events. Every football game is a major campus event. The night before a home game, the Saddle Tramps, a school spirit franternity decorate the entire campus in streamers. On game day, Students and fans come out in large numbers to tailgate on campus, hear the famous Goin' Band from Raiderland, watch excitedly as the Masked Rider flies across the field on a black horse, and cheer wildly as the Red Raiders compete. Texas Tech also has several traditions that do not focus on athletics, the most notable being the Carol of Lights. Every December students, alumni, and locals gather in the center of the campus to sing carols together. The event culminates with a member of the vocal faculty singing O Holy Night as every building on campus is simultaneously lit with thousands of lights., 576770=The biggest tradition is Carol of Lights in December when all the science buildings are lit up and carols are sung. Another tradition is wrapping the Will Rogers statue before game day. Oh, and make sure not to step on the grass in memorial circle, it's a really big deal, and everyone will look at you if you do. Thankfully I learned that before coming here.., 961623=1. Lubbock has some crazy weather so plan on 95 degrees in August and -5 in January. 2. GET INVOLVED IN EVERYTHING! Lubbock can feel very isolated very quickly if you don't. 3. Definitely enjoy the Rec Center - the food here can be good but that Freshman 15 WILL get you., 415507=I have yet to attend a class at TTU. My first semester will be Fall 2012. However, I have talked to many current students and they have all referred to the classes here as challenging, but very worthwhile. Everyone has given positive feedback on the many professors and classwork., 193510=texas tech costs about the same as every texas public university. however, there are so many scholarships available to those willing to apply and plenty of financial aid is given every year. also, if you're a non-texas resident like me and are able to recieve a minimum of $1000 in scholarship money from tech out of state tuition will be waved and you can save even more. texas tech is definitely worth the money., 828539=Before every football game the Raider statue is wrapped in red paper streamers. It is a simple tradition, but after seeing it a few times it will bring pride into new Tech students' hearts. Also, the Carol of Lights is something beautiful that Tech campus does every December. They decorate the buildings on campus with Christmas lights and put up an enormous tree and wreath. Then they sing carols for a while before turning all the lights on. That tradition is one of the most beautiful sights to be seen by new Tech students., 1128682=© 2015, Cappex.com, LLC, 1022516=Point your 'guns' up around town. Boots and hats are almost mandatory. Learn all the football songs and get ready for football season. Come in November to watch the Carol of Lights., 765290=Texas Tech dresses up the school each football game day! The Saddle Tramps (a sort of mens pep group) wrap the main statue of our campus with black and white streamers before all football games. Texas Tech also has the Carol of Lights in December every year. This tradition is when the students gather to watch Tech turn on their extensive Christmas lights for the first time. There is also a concert and lots of hot chocolate and fun., 796846=I would suggest high test scores if your class rank is lacking. I would suggest a Critical reading and Math score of 1100 combined. I never took the ACT so can't speak on it., 169104=steps: 1) start taking the sat and act early your junior year 2) visit the campus during your junior year 3) apply early your senior year 4) get accepted and visit the campus again your senior year 5) attend red raider orientation 6) move-in to your dorm in august and have a great year!!, 355183=Go see your advisor and listen to them. but don't always take there word for it. they said it was impossible for me to graduate in december. but i took it upon my self to talk to the Dean and overload for summer classes and fall and now i will be graduating this december, 163528=texas tech actually throws tortillas at football games. actually it was banned and can result in a 15 yard penalty against tech. but at the texas vs. a&m game in 1992, espn commentators said lubbock only has tech football and a tortilla factory. this didn't settle well with the student body. so when tech played a&m they protested by flinging tortillas into the air and onto the field., 918620=Very rural, much school spirit. Secluded by which I mean it's in the middle of East Texas. Many groups or sororities or fraternities to join. I feel very much like a Red Raider. Study hard and work hard. Ask lots of questions. I attended here Spring of 2013 and will be returning for Fall of 2013., 596839=Will an 1100 in Critical Reading and Math tech shouldnt be to hard to get into.}",
    "textBeforeTable": "07/08/2009 Reviewer is A current student here. 56 out of 61 people found this review useful. 1 of 249 Samantha from Katy, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. Texas Tech University Reviews Texas Tech University › Texas › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Kellie from Little Elm, TX 07/29/2009 Reviewer is A current student here. 24 out of 27 people found this review useful. 3 of 249 Categories Comments Great for these types of students The spirited and the driven. Tips for prospective students Bring rain boots! When it rains it usually floods and if you think the guy in the F-150 is going to have no pleasure whatsoever in splashing you, you are in for a rude awakening! Am enjoying being here About every aspect of Tech and Lubbock I enjoy! Everything from the people to the dust storms, this place has character and charm. Am learning a lot The professors and the people are among the most helpful! They'll even appreciate the stupid questions, everyone has always been more than happy to help! Login to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}