{
    "relation": [
        [
            "First Name",
            "Steven E.",
            "David H.",
            "Philip E."
        ],
        [
            "Last Name",
            "Bachmann",
            "Morrison",
            "Ruter"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=D4DFF0DD-0678-43B7-B028-CB93587D418F&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 216381512,
    "recordOffset": 216365601,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{56173=H.R. 2892, S. 1298, Department of Homeland Security Appropriations Act for 2010, Homeland Security Appropriations Programs. H.R. 2200, Transportation Security Administration Act of 2009, Security Programs. H.R. 2868, Chemical Facility Anti-Terrorism Act of 2009, Security Programs. Border Security. Homeland Security Technology. Maritime Security. Container Security. Aviation Security. Cyber Security. Bioterrorism., 70437=H.R. 422 and S. 1203, Amend the Internal Revenue Code of 1986 on Alternative Simplified Research Credit, R&D Tax Credit. H.R. 2438, Amend the Internal Revenue Code of 1986 on Temporary Bonus Research Credit for Energy-related Research, Tax Issue. Renewable Energy Production Tax Credit. Exercise Tax on Self Funded Health Plans. Domestic Manufacturing Deduction., 29009=H.R. 3326, Department of Defense Appropriations Act, 2010, Defense and Intelligence Appropriations Programs. H.R. 2647 and S. 1390, National Defense Authorization Act for Fiscal Year 2010, Defense Authorization Programs. S. 454, Major Weapon Systems Reform Act of 2009, Defense Acquisition. Export Controls. Foreign Military Sales. Airborne Tanker. Air Mobility Programs. Defense Aviation Logistics Services and Maintenance Support. Unmanned Systems. Navy Tactical Aviation Shortfall. Defense Cooperation Treaties. Military Satellites Communications Programs. Communications Science and Technology. Manufacturing Research and Development., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 72868=H.R. 1, American Recovery and Reinvestment Act of 2009, Buy America Provisions. Support for Commercial Aircraft Sales in Pakistan, Turkey, Turkmenistan, Algeria, Thailand, New Zealand, Russia, Ethiopia, Trinidad, Mexico, Azerbaijan, Bangladesh, Qatar, and Saudi. Support for Free Trade Agreements with Panama, Colombia, and Korea. H.R. 2194 and S. 2799, S. 2799, Comprehensive Iran Sanctions, Accountability, and Divestment Act of 2009, Trade Provisions. H.R. 2410, Foreign Relations Authorization Act, Fiscal Years 2010 and 2011, Trade Provisions. H.R. 3642 and S. 1707, Enhanced Partnership with Pakistan Act of 2009, International Trade. S. 1631, Customs Facilitation and Trade Enforcement Reauthorization Act of 2009, Trade. Support for U.S. case at World Trade Organization against EU subsides to Airbus. Export Controls on Commercial Satellites and Civil Aviation. Trade related aspects of climate change. China Trade Issues. Miscellaneous Tariff Bill and Import Issues. Support for Arms Sales Overseas. Customs Issues., 23667=H.R. 3081 and S. 1434, The Department of State, Foreign Operations and Related Programs Appropriations Act, 2010, Export Issues. H. CON. RES. 85 and S. CON. RES. 13, Concurrent Resolution on the Budget for FY 2010, Budget Levels. H.R. 2346 and S. 1054, Supplemental Appropriations Act, 2009, Defense Issues. Export - Import Bank Issues. 150 International Affairs Budget., 53315=H.R. 3200 and S1679, America's Affordable Health Choices Act, Healthcare Reform. H.R. 1897 and S. 803, Health Workforce Act of 2009, Employee Health Care. America's Healthy Future Act. House Tri-Committee Health Reform., 12234=H.R. 915, FAA Reauthorization Act of 2009, FAA Funding. H.R. 1962, American Space Access Act, Space Shuttle Extension. H.R. 1105, Omnibus Appropriations Act, 2009, NASA Funding. H.R. 2847, Commerce, Justice, Science, and Related Agencies Appropriations Act, 2010, NASA Funding. H.R. 3819, To extend the commercial space transportation liability regime, Space exploration. International Space Station Funding and Safety. Aeronautics. Commercial Space Launch. Next Generation Air Traffic Management. Science Education. Space Exploration. Science Programs - NASA. Science Programs - NOAA. Economic Recovery Spending. Space Shuttle. Space Station. Constellation Program., 19091=H.R. 3288, Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2010, Air Traffic Management. H.R. 915 and S. 1451, FAA Reauthorization Act of 2009, FAA Reauthorization., 48249=H.R. 1886 and S. 962, Pakistan Enduring Assistance and Cooperation Enhancement Act of 2009, US - Pakistan Relations. H. J. Res. 60, UAE 123 Agreement, US - UAE Relations. .H.R. 2194, Iran Refined Petroleum Sanctions Act of 2009, Financing Issues. S. 2799, Comprehensive Iran Sanctions, Accountability, and Divestment Act of 2009, Financing Issues. H.R. 2410, Foreign Relations Authorization Act, FY2010 and 2011, State Department funding. H.R. 3642 and S. 1707, Enhanced Partnership with Pakistan Act of 2009, International Trade.. Export Administration Act. US - Turkey Relations. US - Russia Relations. US - Saudi Relations. US - India Relations. US - China Relations. US - Denmark Relations. US - Libya Relations. US - Thai Relations. US - Greece Relations. US - New Zealand Relations. US - Turkey Relations. US - Azerbaijan Relations. US - Turkmenistan Relations. US - Japan Relations. US - Qatar Relations. US - Brazil Relations. US - Algeria Relations. US - Ethiopia Relations. US - Nepal Relations. US - Taiwan Relations. US - Egypt Relations. US - UK Treaty. US - Australia Treaty. Congressional Export Working Group., 68012=H.R. 4674, Modify Provisions of Harmonized Tariff Schedule of U.S. relating to returned property, Tariff issues. H.R. 4675 and S. 1839, Provide for Duty Free treatment of certain U.S. government property returned to U.S., Tariff issues. S. 1842, Modify provisions of the Harmonized Tariff Schedule of the U.S. relating to returned property, Tariff issues., 78339=H.R. 2710, Enhancing Science, Technology, Engineering, and Mathematics (STEM) Education Act of 2009, Workforce Education. Workforce Investment Act. America COMPETES Reauthorization and Elementary Secondary Education Act., 42200=H.R. 2454, American Clean Energy and Security Act of 2009, Clean Fuel. S. 1733, Clean Energy Jobs and American Power Act, Clean Fuel. Climate Change / Environmental Issues / Bio-Fuels. Renewable Energy Production Tax Credit Expansion., 45649=H.R. 977, The Derivatives Market Transparency and Accountability Act of 2009, Financial Institutions / Investments / Securities. S. 272, The Derivatives Trading Integrity Act of 2009, Derivatives. S. 1074, The Shareholder Bill of Rights Act of 2009, Say on Pay/Proxy Access. H.R. 3795, Over The Counter Derivatives Market Act of 2009, Derivatives. H.R. 4173, Wall Street Reform and Consumer Protection Act of 2009, Financial Institutions / Investments / Securities. H.R. 3996, Financial Stability Act of 2009, Financial Stability., 63725=H.R. 1409 and S. 560, Employee Free Choice Act of 2009, Immigration. H.R. 3042 and S. 1374, Forewarn Act, Employment Issues. OSHA Related Issues. Deferred Compensation issues related to pension plans. S. 2901, Acquisition Workforce Improvement Act of 2009, Workforce Issues. S. 2901, Federal Acquisition Institute Improvement Act of 2009, Federal Workforce Issues. Defined Contribution Pension Issues. Defined Benefit Pension Issues. Executive Compensation., 60424=H.R. 2701 and S. 1494, Intelligence Authorization Act for 2010, Intelligence Community Issues.}",
    "textBeforeTable": "",
    "textAfterTable": "State VA Zip Code 22209 Country USA 3. Principal place of business (if different than line 2) City  Chicago State  IL Zip Code  60606 Country  USA 4a. Contact Name b. Telephone Number c. E-mail  Mr.  RICHARD F. SCHWAB  7034653686  richard.f.schwab@boeing.com 5. Senate ID#  6597-12 7. Client Name Self Check if client is a state or local government or",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}