{
    "relation": [
        [
            "Season",
            "Arena Season 9",
            "Arena Season 10",
            "Arena Season 11"
        ],
        [
            "Color",
            "purple",
            "brown with silver accents",
            "dark green, purple, brown, olive"
        ],
        [
            "Name",
            "Vicious Gladiator's Vestments",
            "Ruthless Gladiator's Vestments",
            "Cataclysmic Gladiator's Vestments"
        ]
    ],
    "pageTitle": "World of Warcraft: Warlords of Draenor News",
    "title": "",
    "url": "http://www.wowhead.com/news&tag=pvp&p=5",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00194-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 840800819,
    "recordOffset": 840704312,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Tyrannical Gladiator's Dreadplate Shoulders Tyrannical Gladiator's Dreadplate Legguards Tyrannical Gladiator's Dreadplate Helm Tyrannical Gladiator's Dreadplate Gauntlets Tyrannical Gladiator's Dreadplate Chestpiece Note: Sets currently have bugged pants. Check out the full set here. Tier 15 Itemsets. Season 13 Weapons and To learn more about 5.2 items, check out our preview of Conquest Points. As we've noted before, there are different colors for ilvl 493 Alliance and Horde sets, as well as an ilvl 512 Elite set. In contrast to past seasons, S13 Elite armor can be purchased without rating--but only after you've accumulated 27,000 All Season 13 gear is now purchasable for free on the 5.2 PTR and we've got all of the items in our database! We've made a preview of all the new sets including their 3D models, updated set bonuses, and links to all items organized by type. //]]> Markup.printHtml(\"[db=ptr]All Season 13 gear is now purchasable for free on the 5.2 PTR and we've got all of the items in our database! We've made a preview of all the new sets including their 3D models, updated set bonuses, and links to all items organized by type.\\n\\nAs we've noted before, there are different colors for ilvl 493 Alliance and Horde sets, as well as an ilvl 512 Elite set.",
    "textAfterTable": "Tyrannical Gladiator's Dreadplate Gauntlets Tyrannical Gladiator's Dreadplate Helm Tyrannical Gladiator's Dreadplate Legguards Tyrannical Gladiator's Dreadplate Shoulders Gladiator's Desecration: 2 piece: Runic Power Back on Snare/Root: Whenever you are struck by a movement-impairing effect, you will generate 3 Runic Power every 1 sec for 5 sec. 4 piece: Relentless Grip: For 3 sec after casting Death Grip, you may cast the spell a second time without regard for its cooldown. Wyrmhide: Tyrannical Gladiator's Wyrmhide Gloves Tyrannical Gladiator's Wyrmhide Helm Tyrannical Gladiator's Wyrmhide Legguards Tyrannical Gladiator's Wyrmhide Robes Tyrannical Gladiator's Wyrmhide Spaulders Alliance Horde Elite Wyrmhide: Tyrannical Gladiator's Wyrmhide Robes Tyrannical Gladiator's Wyrmhide Helm Tyrannical Gladiator's Wyrmhide Gloves Tyrannical Gladiator's Wyrmhide Spaulders Tyrannical Gladiator's Wyrmhide Legguards Wyrmhide: Tyrannical Gladiator's Wyrmhide Gloves Tyrannical Gladiator's Wyrmhide Helm Tyrannical Gladiator's Wyrmhide Legguards Tyrannical Gladiator's Wyrmhide Robes Tyrannical Gladiator's Wyrmhide Spaulders Dragonhide: Tyrannical Gladiator's Dragonhide Gloves Tyrannical Gladiator's Dragonhide Helm Tyrannical Gladiator's Dragonhide Legguards Tyrannical Gladiator's",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}