{
    "relation": [
        [
            "First Name",
            "James N.",
            "David",
            "Lisa"
        ],
        [
            "Last Name",
            "Arbury",
            "Cardwell",
            "Blackwell"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "Senior Policy Advisor, Senator Donald Riegle, Jr.",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=2FA9707D-191D-42EE-AFB4-6BAC867ED720&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00267-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 225018407,
    "recordOffset": 225002498,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{32182=H.R. 4154, FY10 Budget Resolution S. Con. Res. 13, An original concurrent resolution setting forth the congressional budget for the United States Government for fiscal year 2010, revising the appropriate budgetary levels for fiscal year 2009, and setting forth the appropriate budgetary levels for fiscal years 2011 through 2014. S.A. 873, To create a deficit-neutral reserve fund for estate tax relief. H.R. 1935, To amend the Internal Revenue Code of 1986 to provide for the treatment of partnership interests held by partners providing services. H.R. 4213, Tax Extenders Act of 2009 H.R.3440, To amend the Internal Revenue Code of 1986 to allow dealers in real estate to use the installment sales method. H.R.4109, To amend the Internal Revenue Code of 1986 to allow the low income housing credit to be carried back 5 years, and for other purposes. H.R.3590, To amend the Internal Revenue Code of 1986 to modify the first-time homebuyers credit in the case of members of the Armed Forces and certain other Federal employees, and for other purposes. H.R.3640, To amend the Internal Revenue Code of 1986 to extend and expand the first-time homebuyers credit and to provide a loss deduction on the sale of a principal residence. H.R.3659, Amend the Internal Revenue Code of 1986 to allow a credit against income tax for amounts paid for energy efficient property placed in service in commercial buildings pursuant to an approved energy efficiency plan. H.R.3660 , To amend the Internal Revenue Code of 1986 to promote tax parity between the residential and business fuel cell tax credits. H.R.3670, To amend the Internal Revenue Code of 1986 to expand the incentives for the rehabilitation of older buildings, including owner-occupied residences. H.R.3761, To amend the Internal Revenue Code of 1986 to extend the first-time homebuyer tax credit, and for other purposes. H.R.3773, To amend the Internal Revenue Code of 1986 to extend the first-time homebuyer tax credit, and for other purposes. H.R.3812, To amend the Internal Revenue Code of 1986 to encourage businesses to purchase commercial and residential property in distressed communities by providing an exclusion from tax on certain gains. H.R.3901, To amend the Internal Revenue Code of 1986 to enhance the administration of, and reduce fraud related to, the first-time homebuyer tax credit, and for other purposes. H.R.3919, To amend the Internal Revenue Code of 1986 to provide for the designation of Clean Energy Business Zones and for tax incentives for the construction of, and employment at, energy-efficient buildings and clean energy facilities, and for other purposes. H.R.3921, To amend the Internal Revenue Code of 1986 to extend for 90 days the first-time homebuyer credit for taxpayers who have entered into a binding contract before the termination of such credit. H.R.3929, To provide an extension of the low-income housing credit placed-in-service date requirement for certain disaster areas. H.R. 4256, Sustainable Property Grants Act of 2009 H.R. 4226, Expanding Building Efficiency Incentives Act of 2009 S. 2899, Renewable Energy Incentive Act S. 1637, Expanding Building Efficiency Incentives Act of 2009 H.R. 4256, Sustainable Property Grants Act of 2009 H.R. 4213, American Jobs and Closing Tax Loopholes Act of 2010 -- Sections 412 and 413 H.R. 5297, Small Business Lending Fund Act of 2010 -- Section 2101, 45558=P.L. 102-550, Residential Lead Based Paint Hazard Reduction Act 15 U.S.C. Sections 2681-2692 Renovation Repair and Painting Rule (Section 402(c)), 40344=P.L. 102-550, Residential Lead Based Paint Hazard Reduction Act, Section 402 (c) Renovation Repair and Painting Rule and Lead Safe Hoousing Rule, 24 U.S.C. Section 35.1320 (b) \"Big Buy Program\", 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 49033=S. 3217, Restoring American Financial Stability Act of 2010 H.R. 4173, Restoring American Financial Stability Act of 2010 - clarify financial institutions subject to derivatives requirements and oversight; requirements for risk-retention, requirements for commercial mortgage securities and guidance to regulators on underwriting and subordinate investor rights; provision to establish reasonable credit and ebot card interchange fees; provision to improve transparency and oversight of rating agencies; provisions establishing HUD program for the transfer of troubled multifamily mortgages and properties; provisions extending the mandatory acceptance of the housing assistance payment contract at sale of property until 12/31/2014., 15190=H.R. 2454, American Clean Energy and Security Act of 2009, Title II, Subtitle A S. 1462, American Clean Energy Leadership Act, Title II, Subtitle C S. 3464, Practical Energy and Climate Plan of 2010, Title II S. 1637, Expanding Building Efficiency Incentives Act of 2009, A bill to amend the Internal Revenue Code of 1986 to improve and extend certain energy-related tax provisions, and for other purposes. S. 1733, A bill to create clean energy jobs, promote energy independence, reduce global warming pollution, and transition to a clean energy economy. H.R. 4226, Expanding Building Efficiency Incentives Act of 2009, all provisions S 3079, Building Star Energy Efficiency Act of 2010, all provisions H.R.5019, Home Star Energy Retrofit Act of 2010, all provisions S.3177, Home Star Energy Retrofit Act of 2010, all provisions H.R. 2336, GREEN Act of 2009, , all provisions H.R.4106, To authorize the Secretary of Housing and Urban Development to make grants and loans to owners of federally assisted housing projects for costs of making green retrofit improvements to such projects. H.R.1908, To amend the Internal Revenue Code of 1986 to provide a credit for property certified by the Environmental Protection Agency under the WaterSense program. S.1321, A bill to amend the Internal Revenue Code of 1986 to provide a credit for property labeled under the Environmental Protection Agency Water Sense program., 43339=H.R. 1409/S. 560, Employee Free Choice Act-all provisions, 19431=H.R. 384, TARP Reform and Accountability Act of 2009 H.R. 2336, GREEN Act of 2009, multifamily mortgage provisions; assisted housing porvisions H.R. 3068, TARP for Main Street Act of 2009, multifamily mortgage provisions H.R. 1778, Retrofit for Energy and Environmental Performance (REEP) Program Act H.R. 2246, Community Building Code Administration Grant Act of 2009 S.1379, A bill to encourage energy efficiency and conservation and development of renewable energy sources for housing, commercial structures, and other buildings, and to create sustainable communities. H.R. 3045, Section 8 Voucher Reform Act of 2009- assisted housing provisions, multifamily owner provisions, foreclosure provisions H.R. 3288, Transportation/HUD Appropriations-assisted housing provisions, energy performance provisions H.R. 4173, Wall Street Reform and Consumer Protection Act of 2009, mortage reform provisions, mortgage lending provisions, foreclosure provisions H.R. 476, The Housing Fairness Act of 2009 H.R. 3527, FHA Multifamily Loan Limit Adjustment Act of 2009 Housing Finance-What Should the New System Be Able to Do?: Part I-Government and Stakeholder Perspectives (House Committee on Financial Services Hearing) H.R. 4868, Housing Preservation and Tenant Protection Act of 2010-ivestor/owner provisions, tenant access provisions H.R. 4851, The Continuing Extension Act of 2010 H.R. 5028, Right to Rent-all provisions H.R. 5297, Small Business Lending Fund Act - commercail real estate issues H.R. 5361 Responsible GSE Affordable Housing Investment Act-overall, Fannie Freddie as it relates to multifamly housing PETRA, Preservation, Enhancement and transformation Rental Assistance-assited housing provisions H.R. 4099, the energy Efficiency Modernization Act of 2009-provisions on assisted housing, Wall Street Reform H.R. 5072, the FHA Reform Act-multifamily mortgage provisions H.R. 3527, the FHA Multifamily Loan Limit Adjustment Act- all provisions FY 2011 HUD Appropriations-FHA multifamily commitment authority, assisted housing provisions H.R. 476, Housing Fairness Act-Section 2 Testing for Discrimination, Section 3 FHIP Funding, Section 5 Studies, 29226=H.R. 2555, Homeowner's Defense Act of 2009; specifically Sect. 502 Study of Commercial Residential Lines of insurance H.R. 5114, Flood Insurance Reform Priorites Act of 2010-Section 3 Extension, Section 4 Max Coverage Limits, Section 5 Phase In Rates, Section 17 Notice to Tenants, 12253=Clean Water Act: Section 308, Sections 402 (p)(3)(A) and (4); Section 502 (12); Section 404 Federal Water Pollution Control Act, 33 U.S.C. Section 1318}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20036 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  JAMES N. ARBURY  2029742321  mcherry@nmhc.org 5. Senate ID#  28220-12 7. Client Name Self Check if client is a state or local government or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}