{
    "relation": [
        [
            "First Name",
            "Catherine",
            "David"
        ],
        [
            "Last Name",
            "Pinkerton",
            "Golemboski"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=898CAF49-E502-49F9-ACE0-1AA04098B39E&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00116-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 227228358,
    "recordOffset": 227220156,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{15038=H.R. 3626 Exemplary Breastfeeding and Support Act - Support S 1313 \"Hunger Free Schools Act\" - Support, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 30492=H.R. 2269 \"Gulf Coast Civic Works Act\" - support - coastal restoration - green jobs training - green jobs H.R. 2454 American Clean Energy and Security Act of 2009 - Support a comparable in the Senate Met with Senate leaders on the environment, connecting the need for more environmentally sound construction with job training and jobs for low-wage workers., 32935=H.R. 2269 - Support the Gulf Coast Civic Works Act. H.R. 3548 - Support Unemployment Compensation Extension Act H.R. 2460/S. 1152 Healthy Families Act - Support - paid family sick leave for full- and part-time workers., 23530=United Nations Convention on the Elimination of All Forms of Discrimination Against Women - Support Targeting of Guatemalan trade unionists - Oppose H.R. 2567 - Latin America Military Training Review Act - Support the study, and cessation of courses until the study is complete., 21088=Housing Trust Fund - Support funding of the trust fund from any available sources - now S. 1619 - the Livable Communities Act of 2009 - Support H.R. 3766 Main Street TARP Act of 2009 - Support, as source of funding for Housing Trust Fund S. 1731 - Support, as source of funding for Housing Trust Fund H.R. 2269 - Support the Gulf Coast Civic Works Act., 27652=S. 678 Juvenile Justice and Delinquency Prevention Reauthorization Act of 2009 - support increased funding for delinquency prevention programs. S 714 \"National Criminal Justice Commission Act of 2009\" - support, 17196=H.R. 2454 the Patient Protection and Affordable Care Act - Support a stron pubic option, expansion of Medicaid, prhibit exclusions, provide subsidies for those in need, cover all children H.R. 3926 Affordable Health Care for America Act - Support widespread coverage, affordability, stronger Medicare Amend # 2790 - H.R. 3590 the Patient Protection and Affordable Care Act - Support Sen. Casey's Children's Health amendment H.R. 3590 - Support specific aborthion language, remove assured availability, prohibit discrimination against all health care providers, include conscience clause H.R. 3590 - Support Sen. Casey's alternative abortion language, 43481=Reauthorization of Temporary Assistance for Needy Families (TANF) - support strong reauthorization S. 1859 - Child Support Protection Act - Support}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20001 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  Marge Clark  2023479797  mclark@networklobby.org 5. Senate ID#  63495-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}