{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I feel very safe here at Lander and walk around freely on the campus.",
            "I have belonged to a fraternity, radio club, rugby club and a band. There is something for everyone there at Lander.",
            "Lander is great for the type of student that enjoys seeing people they know and not just being another face walking by you. Lander is what you make of it and you should make it memorable.",
            "Lander as many on campus social events going on all the time. Whether you are into theater, music or athletics, there is always something going on to see. Also, they have many off campus activities to attend. There are a few cities outside of Lander that are alsy great to go to for the weekend for nightlife.",
            "I was on the food plan for a few years at Lander. During this time, I realized I had some food allergies that I was not aware of. The staff there were great and ordered special diet food for me and always asked if I was getting the special food that I needed. They treat you like family there and get to know you. The food is really good also and they have a great variety.",
            "My dorm life was alot of fun as a freshman. I spent much time with my suite mates thinking that they would end up to be my best friend. As I spent more and more time outside of my dorm and more time with my classmates, I realized that their is so much more social fun when you broaden your horizon of friends.",
            "My first year of college was an eye opener on how to keep organized and ahead of my classes. I was challenged in some of my academic classes but found tutors and asked for help from my professor. I suggest you take advantage of any academic help you can if you feel yourself falling behind as soon as possible.",
            "My tip for prospective students is to be prepared that you are the leader of your destiny and time management is a must.",
            "Lander is a great school because the classes are small, you really get to know your professor and he actually knows your name. The campus is beautiful and close to bustling cities. Lastly, I feel the education I am getting will launch me into the career I am striving for."
        ]
    ],
    "pageTitle": "Lander University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Lander-University/reviews?_escaped_fragment_=/show/12740",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00138-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901522279,
    "recordOffset": 901477195,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{182760=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/10/2009 Reviewer is A current student here. 18 out of 18 people found this review useful. 1 of 45 Jessica from Anderson, SC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Tips for prospective students You have to be open-minded, energetic and ready to learn. It is best to be prepared for your classes, on time, and ready to do the very best job posssible to get ahead. Login to rate or flag the reviews Ellaina from Loris, SC 05/13/2011 Reviewer is Researching this school. Reviewer has been to campus. 6 out of 6 people found this review useful. 3 of 45 Categories Comments Tips for prospective students Be sure that you want to attend a college of this size. Although the campus seems small and you don't really get to see the amount of students on campus, this is a relatively good sized school. Bang for the buck Tuition is relatively cheap. Those coming from SC high schools having obtained the LIFE or Palmetto Fellows will be pleased to know that Lander has its own scholarships associated with the same requirements for state scholarships. Will enjoy being here",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}