{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They have some cool events on campus.",
            "People who like to have fun and meet new people.",
            "Whenever someone says Hawk Pride!, you have to yell Catch It! and clap your hands in the air.",
            "Parties, Hang with friends",
            "Stay focused on your studies because it is very easy to get distracted down there. It is a lot of things going on during campus.",
            "The University of Maryland Eastern Shore is a great institution. It will prepare you for the real world of whatever field you are in. I look forward to learning more."
        ]
    ],
    "pageTitle": "University of Maryland Eastern Shore (UMES) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Maryland-Eastern-Shore/reviews?_escaped_fragment_=/show/100272",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00277-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900897959,
    "recordOffset": 900832286,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{113764=Homecoming is held in January rather than right when school starts., 326017=© 2015, Cappex.com, LLC, 221715=The School Cafeteria does not stay open late it closes early and if you do not eat by 7:45 you can't go in the cafeteria. You have to go to the Hawk's nest but it be too crowded. The food in the school cafeteria has laxative in it., 162685=As of 2012, we have 6 of the divine 9 at UMES. We have all the fraternities and only one of the sorority of the pan. We also have a couple of social fellowships and a christian based Greek organization., 296421=Greek life is 50-50, right now because the sororities are not active on campus just yet. All sororities will be back on campus Spring 2014 and everyone is so anxious for their return.}",
    "textBeforeTable": "12/12/2009 Reviewer is A current student here. 16 out of 16 people found this review useful. 1 of 82 DENEEN from Washington, DC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Login to rate or flag the reviews Brittney from Felton, DE 06/18/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 11 out of 13 people found this review useful. 2 of 82 Categories Comments Tips for prospective students Apply early. don't procrastinate Login to rate or flag the reviews Cherise from Fort Washington, MD 12/09/2009 Reviewer is A current student here. 9 out of 9 people found this review useful. 3 of 82 Categories Comments Great for these types of students If you are into the Criminal Justice major, this is your place. The Criminal Justice here is amazing! As well as the Math and Computer Science department!...This is the best place to come if you",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}