{
    "relation": [
        [
            "Symbol",
            "0",
            "9",
            "C",
            "D",
            "EEEE",
            "G",
            "L",
            "MI",
            "PR",
            "PT",
            "S (before number)",
            "S (after number)"
        ],
        [
            "Meaning",
            "Digit. Each explicitly set 0 appears, if no other number occupies the position. Example: Format mask: 00.0000 Data: 1.234 Display: 01.2340",
            "Digit. Returns value with the specified number of digits with a leading space if positive or a leading minus if negative. Leading zeros are blank, except for a zero value, which returns a zero for the integer part of the fixed-point number. Example: Format mask: 99.9999 Data: 1.234 Display: 1.234",
            "Returns the ISO currency symbol in the specified position.",
            "Determines the placement of the decimal separator. The decimal separator symbol used is determined at runtime based on template locale. For example: Format mask: 9G999D99 Data: 1234.56 Display for English locale: 1,234.56 Display for German locale: 1.234,56",
            "Returns a value in scientific notation.",
            "Determines the placement of the grouping (thousands) separator. The grouping separator symbol used is determined at runtime based on template locale. For example: Format mask: 9G999D99 Data: 1234.56 Display for English locale: 1,234.56 Display for German locale: 1.234,56",
            "Returns the local currency symbol in the specified position.",
            "Displays negative value with a trailing \"-\".",
            "Displays negative value enclosed by <>",
            "Displays negative value enclosed by ()",
            "Displays positive value with a leading \"+\" and negative values with a leading \"-\"",
            "Displays positive value with a trailing \"+\" and negative value with a trailing \"-\""
        ]
    ],
    "pageTitle": "Creating RTF Templates - 11g Release 1 (11.1.1)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E29505_01/bi.1111/e22254/create_rtf_tmpl.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00301-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 73858823,
    "recordOffset": 73778035,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{228544=format - The Oracle number format to apply to the value at runtime. This property is optional, but if you want to supply a format mask, you must use the Oracle format mask. For more information, see Section 4.15.12, \"Oracle Abstract Format Masks.\", 357792=Friday, December 31, 1999 6:15 PM GMT, 406250=<?namespace:fsg=http://www.example.com/fsg/2002-30-20/?>, 357086=Friday, December 31, 1999 6:15 PM, 329865=2005-01-01T09:30:10-07:00, 356407=Friday, December 31, 1999, 357558=Dec 31, 1999 6:15 PM GMT, 202604=The template lists the accounts and their credit and debit values. The final report will highlight in red any cell whose value is greater than 1000. The template for this is shown in figure Figure 4-51:, 249624=2000, 317061=Display: 01.2340, 344878=Century. For example, 2002 returns 21; 2000 returns 20., 33512=1000.00, 206353=This field holds the code to highlight the cell red if the credit amount is greater than 1000., 32605=1-Jan-2004, 356861=Dec 31, 1999 6:15 PM, 330122=If the time component and time zone offset are not included in the XML source date, then BI Publisher assumes it represents 12:00 AM UTC (that is, yyyy-mm-ddT00:00:00-00:00)., 205448=This field holds the code to highlight the cell red if the debit amount is greater than 1000., 174457=For example, the following statement tests the AMOUNT element value. If the value is greater than 1000, show the word \"Higher\"; if it is less than 1000, show the word \"Lower\"; if it is equal to 1000, show \"Equal\":, 357328=12/31/99 6:15 PM GMT, 356195=Dec 31, 1999, 207509=The \"if\" statement is testing if the debit value is greater than 1000. If it is, then the next lines are invoked. Notice that the example embeds native XSL code inside the \"if\" statement., 317951=Data: 1234.56, 224747=1-Jan-2005, 418517=BI Publisher supports native PowerPoint charts for certain chart types rendered in PowerPoint2007 output. When the chart is inserted as a native chart, you can modify it in PowerPoint. If the chart is not inserted as a native chart, then BI Publisher inserts a PNG image that cannot be updated., 418824=The following chart types can be rendered as native PowerPoint charts in PowerPoint2007 output:, 329903=The data after the \"T\" is optional, therefore the following date: 2005-01-01 can be formatted using either date formatting option., 105880=Microsoft Word 2000 Users: After you add the background map and overlay the shape group, use the Grouping dialog to make the entire composition one group., 407118=For more information on XSL-FO see the W3C Website at http://www.w3.org/2002/08/XSLFOsummary.html, 360626=Enter the format-currency command in the RTF template to apply the format to the field at runtime, as described in Section 4.15.15, \"Applying a Currency Format to a Field.\", 106090=Microsoft Word 2002/3 Users: These versions of Word have an option under Tools > Options, General tab to \"Automatically generate drawing canvas when inserting autoshapes\". Using this option removes the need to do the final grouping of the map and shapes. You can now generate a visually appealing output for the report as seen in Figure 4-27., 419697=Note that when Enable PPTX native chart support is set to false, all charts are rendered as images in PowerPoint2007 output. Therefore, set this option to false only when a report includes the non-native chart types., 404878=You could also access all the CD tittles released in 1988 using the following:, 325349=Determines the placement of the decimal separator. The decimal separator symbol used is determined at runtime based on template locale. For example: Format mask: 9G999D99 Data: 1234.56 Display for English locale: 1,234.56 Display for German locale: 1.234,56, 324265=Digit. Each explicitly set 0 appears, if no other number occupies the position. Example: Format mask: 00.0000 Data: 1.234 Display: 01.2340, 402701=The pipe (|) is equal to the logical OR operator. In addition, XPath recognizes the logical OR and AND, as well as the equality operators: <=, <, >, >=, ==, and !=. For example, you can find all CDs released in 1985 or later using the following expression:, 313227=To use the Oracle format mask or the Microsoft format mask, the numbers in the data source must be in a raw format, with no formatting applied (for example: 1000.00). If the number has been formatted for European countries (for example: 1.000,00) then the format does not work., 103412=The shape-size command is used to stretch or shrink the cylinder based on the values of the elements SOFTWARE, HARDWARE, and SERVICES. The value is divided by 1000 to set the stretch or shrink factor. For example, if the value is 2000, divide that by 1000 to get a factor of 2. The shape generates as twice its current height., 211850=Oracle-number-format is the format you want to use to for the display, using the Oracle format mask (for example: 'C9G999D00'). For the list of Oracle format mask symbols, see Section 4.15.12, \"Oracle Abstract Format Masks.\", 145292=http://myserver.domain:8888/CustomerReport/cstid=1234, 326042=Determines the placement of the grouping (thousands) separator. The grouping separator symbol used is determined at runtime based on template locale. For example: Format mask: 9G999D99 Data: 1234.56 Display for English locale: 1,234.56 Display for German locale: 1.234,56, 331000=If you do not specify the mask in the Date format field, then the abstract format mask \"MEDIUM\" is used as default. See Section 4.15.12, \"Oracle Abstract Format Masks\" for the description., 353051=If you do not want to specify a format mask with either the MS method or the Oracle method, you can omit the mask definition and use the default format mask. The default format mask is the MEDIUM abstract format mask from Oracle. (See Section 4.15.12, \"Oracle Abstract Format Masks\" for the definition.), 356638=12/31/99 6:15 PM}",
    "lastModified": "Thu, 13 Jun 2013 20:44:16 GMT",
    "textBeforeTable": "Table 4-22 Supported Oracle Number Format Mask Symbols Table 4-22 lists the supported Oracle number format mask symbols and their definitions. Description of \"Figure 4-70 Form Field Help Text Entry\" Figure 4-70 Form Field Help Text Entry Figure 4-70 shows an example Form Field Help Text dialog entry for the data element \"empno\". 999G999D99 is the mask definition. fieldname is the XML tag name of the data element you are formatting and where In the Form Field Help Text field, enter the mask definition according to the following example: <?format-number:fieldname;'999G999D99'?> Set the Type to \"Regular text\". Open the Form Field Options dialog box for the placeholder field. To apply the Oracle format mask to a form field: 4.15.6 Using the Oracle Format Mask Subpattern boundary: A pattern contains a positive and negative subpattern, for example, \"#,##0.00;(#,##0.00)\". Each subpattern has a prefix, numeric part, and suffix. The negative subpattern is optional. If absent, the positive subpattern prefixed with the localized minus sign (\"-\" in most locales) is used as the",
    "textAfterTable": "4.15.7 Formatting Dates BI Publisher supports three methods for specifying the date format: Specify an explicit date format mask using Microsoft Word's native date format mask. Specify an explicit date format mask using Oracle's format-date function. Specify an abstract date format mask using Oracle's abstract date format masks. (Recommended for multilingual templates.) Only one method should be used. If both the Oracle and MS format masks are specified, the data is formatted twice, which causes unexpected behavior. 4.15.8 Data Source Requirements To use the Microsoft format mask or the Oracle format mask, the date from the XML data source must be in canonical format. This format is: YYYY-MM-DDThh:mm:ss+HH:MM where YYYY is the year MM is the month DD is the day T is the separator between the date and time component hh is the hour in 24-hour format mm is the minutes ss is the seconds +HH:MM is the time zone offset from Universal Time (UTC), or Greenwich Mean Time An example of this construction is: 2005-01-01T09:30:10-07:00 The data after the \"T\" is optional, therefore the following date: 2005-01-01 can be formatted using either date formatting option.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}