{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "It is a small enough campus that it is safe to get around. AT night we usually walk around in a group guys and girls together.",
            "Freshen orientation - at the end all of the incoming students line up on Appian Way together. Next time we do this is graduation. Again Pumpkin weekend in the town of Keene. I have never seen so many pumpkins before.",
            "My roommate got me into long boarding, which works out great to travel around campus or downtown. There are some cool shows that come to campus. Best is Pumpkin weekend held in Oct.",
            "Weekend Brunch is great. I like that I can use my food money in area outside of the cafe. I now love paninis.",
            "Keene's rooms are a little bit larger then some of the other school I have seen. I had no issues with my roommates my freshmen year. Bathroom are clean except you have to travel to a different floor 1/2 of the year.",
            "My first year I had to take the basics, so I consider it average currently. I expect this to change in a few months.",
            "Professors are willing to help you succeed. The smaller class sizes helped me succeed my first year of school.",
            "Keene has smaller class sizes than other schools my friends/family attend. Very easy campus to navigate around. It has many sports/activities for students to participate in."
        ]
    ],
    "pageTitle": "Keene State College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Keene-State-College/reviews?_escaped_fragment_=/show/93060",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00090-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 922027127,
    "recordOffset": 921980382,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{83240=My roommate got me into long boarding, which works out great to travel around campus or downtown. There are some cool shows that come to campus. Best is Pumpkin weekend held in Oct., 80604=Keene State College is a small school located in a town similar to that of Twilight's setting. Don't underestimate the school because of it's size, great men and women have come from this school. The teacher student ratio 1:30 makes it easy for those students who want more individualized attention from their teachers instead of being considered just a number., 191778=© 2015, Cappex.com, LLC, 170986=Every October Keene celebrates Pumpkin Fest. This is mainly a large fair where Keene sets the record for most Jack-O-Laterns in one town. There is also winter and spring weekends, where the college hires artists for concerts or famous comedians., 130317=If you ever visit Keene State during the week you should go to the Night Owl CafÃ?Â© in the Student Center (between 11:30 and 2:15pm) and try a Sizzler. It is one of the best tasting meals on campus!}",
    "textBeforeTable": "01/05/2010 Reviewer is A current student here. 6 out of 8 people found this review useful. 1 of 47 Kelley from Springfield, VT Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Tips for prospective students Doesn't take much to get in... at all. I always thought before coming here keene was a pretty good school. Attending here makes me double think that, there are so many dumb kids here. & it's because Keene is money hungry and accepts way more kids then they have housing available for, pretty much screwing all upperclassmen out of housing Bang for the buck I am an out of stater, 26,000 is affordable, but not worth it Did enjoy being here Great party scene, that's all that is going for Keene. No one participates in school functions, the only way to get someone to go to events is if they are giving away free t-shirts Did learn a lot Most of my classes I felt were easier than high school. It's very easy to get by without trying. So I have decided to transfer to a better school Login to rate or flag the reviews Danielle from Londonderry, NH 11/17/2010 Reviewer is A current student here.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}