{
    "relation": [
        [
            "Afford the care you need",
            "Employer coverage",
            "Marketplace Coverage",
            "Medicaid",
            "Uninsured",
            "Get high quality care",
            "Employer coverage",
            "Marketplace Coverage",
            "Medicaid",
            "Uninsured"
        ],
        [
            "Not at All Confident",
            "8%",
            "18%",
            "25%",
            "53%",
            "Very difficult or impossible",
            "7%",
            "9%",
            "15%",
            "35%"
        ],
        [
            "Not Very Confident",
            "10%",
            "12%",
            "13%",
            "20%",
            "Somewhat difficult",
            "9%",
            "18%",
            "16%",
            "27%"
        ],
        [
            "Somewhat Confident",
            "36%",
            "34%",
            "31%",
            "15%",
            "Somewhat easy",
            "38%",
            "38%",
            "39%",
            "24%"
        ],
        [
            "Very Confident",
            "45%",
            "36%",
            "29%",
            "10%",
            "Very easy",
            "46%",
            "33%",
            "26%",
            "13%"
        ]
    ],
    "pageTitle": "Affordable Care Act Tracking Survey :: The Commonwealth Fund",
    "title": "",
    "url": "http://www.commonwealthfund.org/acaTrackingSurvey/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00031-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 370019447,
    "recordOffset": 369997195,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{16352=Rating experience with the marketplace October 2013 to Apr–June 2014 (percent) see details, 19637=More than two of five adults who are potentially eligible for coverage had visited a marketplace by June., 2103=Confidence in ability to… Apr—June 2014 (percent) see details, 22855=Percent who are aware of financial assistance, July–Sept. 2013 to March–May 2015 see details, 23061=Fewer than half of uninsured adults are aware that financial assistance for health insurance is available under the Affordable Care Act, unchanged from April–June 2014., 33205=The percentage of adults ages 19–64 who are uninsured fell to 13 percent in March–May 2015, down from 20 percent in July–September 2013. This represents an estimated decline of 12.1 million uninsured adults since the coverage expansions took effect., 31827=In March–May 2015, the uninsured rate among older adults ages 50 to 64 continued to decline. While young adults have made dramatic gains in coverage since the law took effect, in this wave of the survey there was no significant change from the prior year in the uninsured rate among adults under age 50., 17302=*Only asked of respondents who tried to find out if they were either eligible for financial assistance to help pay for their plan, or if they were eligible for Medicaid (63% in Apr–June 2014), 23909=Percent who are aware of marketplaces, July–Sept. 2013 to March–May 2015 see details, 14906=Ability to afford premium costs Apr–June 2014 (percent) see details, 19284=Percent who visited marketplace, Oct. 2013 to Apr.–June 2014 see details, 30297=Uninsured rates continued to fall among adults with incomes between 138 and 249 percent of poverty. In contrast, the survey findings indicate no further declines in uninsured rates among people with incomes under 138 percent of poverty in 2015., 19461=Visits rose from 17 percent in October to 24 percent in December. By June, 43 percent of the potentially eligible population had visited a marketplace., 33466=The survey finds declines in the rate of uninsurance among U.S. adults since the law’s major reforms took effect in 2014., 38977=The latest wave of The Commonwealth Fund's Affordable Care Act (ACA) Tracking Survey indicates that the share of working age adults who are uninsured was 13 percent in March—May 2015, compared with 20 percent just before the law’s major coverage expansions went into effect. ACA coverage is helping people gain access to health care: more than six of 10 adults who used their marketplace or Medicaid plans to obtain care reported that they could not have afforded or accessed it previously., 28496=Status of current marketplace and Medicaid enrollees prior to getting new plan (Mar–May 2015) see details, 24435=While awareness of the marketplaces and financial assistance to help pay for health insurance rose significantly among uninsured adults from 2013 to 2014, it did not change between 2014 and 2015.}",
    "TableContextTimeStampAfterTable": "{28005=QUESTION WORDING: The enrollment period for health insurance in the marketplaces ends March 31, 2014. How likely are you to go to/go back to the marketplace by March 31, 2014, to enroll in a health plan or find out if you are eligible for financial help to pay for your plan or for Medicaid?}",
    "lastModified": "Thu, 11 Jun 2015 20:59:24 GMT",
    "textBeforeTable": "How easy or difficult was it to find [INSERT]? (Among those adults who are uninsured or have individual coverage. A plan with the type of coverage you need, a plan you could afford.) QUESTION WORDING: How easy or difficult was it to compare the [INSERT] of different insurance plans? (Among those adults who are uninsured or have individual coverage. Benefits covered, premium costs, potential out-of-pocket costs from deductibles and copayments.) QUESTION WORDING: How Easy is it for People to Use the Marketplaces? 54% 24% 18% 50–64 33% 25% 22% 35–49 41% 24% 14% 19–34 Age 43% 24% 17% Total n=1497 n=622 n=682 April–June 2014 December 2013 October 2013 Percent responding \"Yes, visited marketplace\" QUESTION WORDING: Are Americans Using the Health Insurance Marketplaces? Have you gone to this new marketplace to shop for health insurance? This could be by mail, in person, by phone, or on the Internet. (among those adults who are uninsured or have individual coverage)",
    "textAfterTable": "Compare the premium costs 23% 18% 30% 21% Compare the potential out-of-pocket costs from deductibles and copayments 27% 26% 22% 16% Find a plan with the type of coverage you need 33% 27% 19% 17% Find a plan you could afford 39% 19% 20% 17% Find out if you are eligible for financial assistance or for Medicaid* 20% 26% 20% 33% October 2013 Very difficult or impossible Somewhat difficult Somewhat easy Very easy Compare the benefits covered of different insurance plans 33% 25% 19% 11% Compare the premium costs 27% 25% 21% 16% Compare the potential out-of-pocket costs from deductibles and copayments 31% 20% 14% 19% Find a plan with the type of coverage you need 38% 19% 16% 21% Find a plan you could afford 40% 21% 14% 16% Note: Segments may not sum to indicated total because of rounding; bars may not sum to 100 because of \"don't know responses\" or refusal to respond * Only asked of respondents who tried to find out if they were either eligible for financial assistance to help pay for their plan, or if they were eligible for Medicaid (63% in Apr-June) ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}