{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2008-07-01T00:00:00",
            "2008-07-15T00:00:00",
            "2010-06-01T00:00:00",
            "2011-06-20T00:00:00"
        ],
        [
            "Description",
            "A Terrascan macro was used to classify the Lidar points inside rivers and lakes from class 2 to class 9. This classification was visually inspected by comparing the bare earth class against the hydro breaklines. Then the elevations were converted from feet to meters to meet the final delivery specifications.",
            "Leica software was used in the post processing of the airborne GPS and inertial data that is critical to the positioning of the sensor during all flights. This software suite includes Applanix's PosPac and Waypoint's GrafNav solutions. PosPac provides the smoothed best estimate of trajectory (SBET) that is necessary for Leica's post processor to develop the point cloud from the LiDAR missions. The point cloud is the mathematical three dimensional collection of all returns from all laser pulses as determined from the aerial mission. At this point this data is ready for analysis, classification, and filtering to generate a bare earth surface model in which the above ground features are removed from the data set. The point cloud was manipulated within the Leica software; GeoCue, TerraScan, and TerraModeler software was used for the automated data classification, manual cleanup, and bare earth generation from this data. Project specific macros were used to classify the ground and to remove the side overlap between parallel flight lines. All data was manually reviewed and any remaining artifacts were removed using functionality provided by TerraScan and TerraModeler. The project was tiled adhering to the State of New Jersey 5000'x5000' tile schema and each tile was saved in LAS format 1.1 including GPS time. Note: The Julian date and year written in the LAS header is actually the file creation date and has no connection to the acquisition date. However the GPS time (second of the week) is registered for each point in the LAS file and the week of acquisition can be deduced from the file name which include the GPS week (1474 = week starting 04/06/2008; 1475 = week starting 04/13/2008). When an area includes data from flightlines acquired over two different GPS weeks, separate files for the data captured in each of the weeks are delivered. For example tile B18D14 has data from both weeks; therefore there are two separate files: B18D14_1474.LAS & B18D14_1475.LAS.",
            "The NOAA Coastal Services Center (CSC) received files in LAS format. The files contained LiDAR intensity and elevation measurements. CSC performed the following processing on the data to make it available within Digital Coast: 1. The data were converted from New Jersey State Plane coordinates to geographic coordinates. 2. The data were converted from NAVD88 heights to ellipsoid heights using Geoid03. 3. The LAS header fields were sorted by latitude and updated.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Components NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2008_NJ_CapeMay_m541.xml",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2008_NJ_CapeMay_m541.xml&view=ISO19115Components-HTMLTable&title=Components%20NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2008_NJ_CapeMay_m541.xml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00298-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 610860478,
    "recordOffset": 610852276,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:2008_NJ_CapeMay_m541Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "1 2008 USGS South New Jersey County Project Lidar: Cape May County 2010-01-01 2 None 1 North American Datum 1983 2007-01-19 Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 NOAA CSC (originator) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov originator http://coast.noaa.gov 1 NOAA CSC (publisher) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov publisher http://coast.noaa.gov",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}