{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Evangelical Protestant",
            "Other",
            "Mainline Protestant",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "280,324",
            "221,258",
            "63,064",
            "53,412",
            "17,866",
            "5,648",
            "1,106,494"
        ],
        [
            "Congregations",
            "47",
            "701",
            "143",
            "88",
            "45",
            "16",
            "-"
        ]
    ],
    "pageTitle": "Weston, Florida (FL 33327) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Weston-Florida.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00050-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 370280363,
    "recordOffset": 370141736,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{132593=Weston: Storm front moving in from the west just before sunset on August 18,2010, 7609=According to our research of Florida and other state lists there were 2 registered sex offenders living in Weston, Florida as of July 31, 2015. The ratio of number of residents in Weston to the number of sex offenders is 33,821 to 1. The number of registered sex offenders compared to the number of residents in this city is a lot smaller than the state average., 133166=Weston: August 18 Sunset following a quickly moving. glow is over the lake reach out toward the west and everglades.}",
    "TableContextTimeStampAfterTable": "{55359=1996 Presidential Elections Results, 34962=Sulfur Dioxide (SO2) [ppb] level in 2012 was 0.0434. This is significantly better than average. Closest monitor was 9.5 miles away from the city center., 33511=Carbon Monoxide (CO) [ppm] level in 2008 was 0.362. This is about average. Closest monitor was 12.3 miles away from the city center., 55931=2004 Presidential Elections Results, 29151=Hotel: Amerisuites (2201 North Commerce Parkway)., 52160=Educational Attainment (%) in 2013, 56503=2012 Presidential Elections Results, 73972=7.20% of this county's 2010 resident taxpayers moved to other counties in 2011 ($37,956 average adjusted gross income), 52558=School Enrollment by Level of School (%) in 2013, 34229=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 4.99. This is better than average. Closest monitor was 9.5 miles away from the city center., 32864=Air Quality Index (AQI) level in 2012 was 65.1. This is about average., 36416=Particulate Matter (PM10) [µg/m3] level in 2012 was 14.1. This is significantly better than average. Closest monitor was 8.0 miles away from the city center., 157701=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 35711=Ozone [ppb] level in 2012 was 25.1. This is better than average. Closest monitor was 3.9 miles away from the city center., 55645=2000 Presidential Elections Results, 56787=Graphs represent county-level data. Detailed 2008 Election Results, 71739=8.22% of this county's 2011 resident taxpayers lived in other counties in 2010 ($37,316 average adjusted gross income), 56217=2008 Presidential Elections Results, 16631=On 2/23/1965, a category F3 tornado 13.6 miles away from the city center injured 6 people and caused between $50,000 and $500,000 in damages., 37185=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 7.51. This is better than average. Closest monitor was 9.5 miles away from the city center., 156400=Total of 466 patent applications in 2008-2015., 16350=On 4/10/1956, a category F3 (max. wind speeds 158-206 mph) tornado 12.3 miles away from the Weston city center injured 20 people and caused between $500,000 and $5,000,000 in damages.}",
    "textBeforeTable": "Religion statistics for Weston city (based on Broward County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Utility gas (1%) No fuel used (3%) Electricity (96%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 359 Broward County: 2.05 / 10,000 pop. Florida: 2.04 / 10,000 pop. Number of supercenters and club stores: 15 This county: 0.09 / 10,000 pop. State: 0.11 / 10,000 pop. Number of convenience stores (no gas): 268 Broward County: 1.53 / 10,000 pop. Florida: 1.28 / 10,000 pop. Number of convenience stores (with gas): 391 Broward County: 2.24 / 10,000 pop. State: 3.04 / 10,000 pop. Number of full-service restaurants: 1,399 Here: 8.00 / 10,000 pop. State: 7.45 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}