{
    "relation": [
        [
            "Milestone",
            "Substantive discussions regarding project",
            "Pre-feasibility study",
            "Feasibility study",
            "Project development (including construction and/or setting up on-site offices, purchase of lands, etc.)",
            "Project operations (including starting management practices, distributing information, training, purchase of operating equipment, etc.)",
            "Sequestration or reduction of GHG emissions",
            "Project financing obtained",
            "Other (please specify)"
        ],
        [
            "Date Initiated (if applicable) (month/year)",
            "March 1995",
            "",
            "July 1998",
            "Lands were purchased in August 1993. Carbon project development began in July 1998",
            "October 1999",
            "October 1999",
            "Final financing will not be secured until GHG emissions reduction credits are sold",
            ""
        ],
        [
            "Date Completed (if applicable) (month/year)",
            "",
            "",
            "August 1998",
            "Continuing",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "CC:INFO/AIJ: REPORT",
    "title": "",
    "url": "http://unfccc.int/kyoto_mechanisms/aij/activities_implemented_jointly/items/1808.php?plus=j",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00181-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 239815895,
    "recordOffset": 239784072,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{34067=January 1998, 36095=The Project area is located between the cold steppes (grasslands) and the rugged, glaciated mountains that respectively occupy the northern and southern halves of Tierra del Fuego. Topography in the Project area is mountainous, with moderate slopes and broad flat valley bottoms. Since the Project area is located at 54 degrees south latitude, the maritime climate is cool to cold, wet and windy (Arroyo et al. 1996). Mean annual temperatures are 2.5 to 3.0° C and monthly temperatures vary from means around –4.0° C in July to about 9° C in January. Annual precipitation declines from about 1000 mm in the west to 500 mm in the east., 44326=October 1998, 126224=© 2014 United Nations Framework Convention on Climate Change, 57657=Specifically, the baseline scenario entails an average annual harvest of approximately 1200 hectares of forest over the 110 year cutting cycle, bringing the total area under management to approximately 134,698 hectares (this is a net figure and excludes legally required watershed protection measures; calculated using Forestal Savia’s GIS). It is assumed that this management would have been done in full accord with Chilean law and in a manner that would ensure sustainability., 120291=No net emissions occurred from the property in the year prior to the commencement of the project because no significant human activity occurred during that period. The carbon project achieves emissions reductions by reducing the area harvested as part of the Río Cóndor forestry project, which began harvesting operations in October 1999., 19704=21 de Mayo 1668, 30036=31-0-181-69-33-33, 110062=In January 2000 SGS International Certification Systems completed their final assessment of the Río Cóndor Carbon Sequestration Project. They are currently completing an internal review process and should be issuing a certificate of project design along with a schedule of projected emission offsets in July 2000., 20281=56-61-241434, 101701=Wind is by far the most common disturbance agent on the island, but usually is limited to small (<1 hectare) events [Reburtus, A.J., T. Kitxberger, T.T. Veblen, and L.M Roovers. 1997. Blowdown history and landscape patterns in the Andes of Tierra del Fuego, Argentina. Ecology 78(3):678-693]. This disturbance regime is built into the models that estimate per-hectare carbon stores. Larger windfall events are very rare and would not result in a major carbon emission due to the slow decay rate of the down material and the strong regeneration that is characteristic of lenga forests., 34286=January 2058, 30238=31-0-181-69-35-72, 109901=Project operations began in October 1999, and USIJI approved the proposal on March 29, 2000, subject to agreement with CONAMA on the baseline scenario., 62242=The per hectare models were developed primarily by Dr. Mark Harmon of Oregon State University. Data for the original carbon stocks is from statistically robust inventories carried out by Forestal Savia and by CFix. Estimates of the amount of carbon removed at harvest come from observations of yields from initial harvesting. Growth data is based on extensive studies carried out in similar forests throughout southern Chile and was compiled by Professor Patricio Nuñez of Universidad de la Frontera in Temuco, Chile. Decay data is from a statistically robust peer reviewed study done in similar forests on the Argentine side of the island of Tierra del Fuego (Frangi, J.L., L.L Richter, M.D. Barrera, and M. Aloggia. 1997. Decomposition of Nothofagus fallen woody debris in forests of Tierra del Fuego, Argentina. Canadian Journal of Forest Resources 27:1095-1102.). Mortality was estimated by Drs. Jerry Franklin, Mark Harmon, and Juan Armesto, all of whom are well regarded forest ecologists with extensive experience in the Río Cóndor forests. Conversion factors used to convert biomass and necromass to carbon are based on widely accepted values. All modeling was reviewed by Dr. Sandra Brown of Winrock International and by SGS., 38459=Some human disturbance of the landscape has occurred. A small percentage of the forest—primarily in areas immediately adjacent to the coast or sheep ranches—was logged in the first half of this century. Selective logging of individual trees was the most common method, and there is still evidence of these activities in the form of blazed trees and cut logs. Fires of human origin have also killed forests in some areas. Nothofagus forests in general—and lenga forests in particular—are not well adapted to fire and fail to regenerate in its wake. This failure is probably due to the fact that natural fires seldom occur in the region. Most of the fires probably occurred in the middle of the century. North American beaver, introduced to Tierra del Fuego in 1946, have dammed streams and flooded some areas of riparian forest.}",
    "textBeforeTable": "4. Participants: The Río Cóndor Carbon Sequestration Project is reducing carbon emissions from a 272,880 hectare forest management project in Tierra del Fuego, Chile. The land is owned and managed by Forestal Savia Ltda., a Chilean company. CFix, L.L.C., a Washington State Limited Liability Company, is managing the carbon offset opportunity in partnership with Fundación Chile, a Chilean non-profit organization focused on technology transfer, new business development and sustainable development in Chile. The Project will achieve additional carbon storage by preserving old growth forests that would have been converted into young, managed stands in the baseline scenario. Sustainable forest management will continue on the lands not protected by the carbon project. In the future, the project will reduce emissions by preserving sphagnum bogs that are found on the property and that are vulnerable to third-party concessionaires. The forest preservation measures will result in approximately 15,469,278 million metric tonnes of avoided CO2 emissions over the 60-year life of the project. Emission reductions over the life of the project will increase by 20,247,390 tonnes to 35,716,668 tonnes when the bog component is incorporated into the project. All measures are dependant on the eventual sale of carbon offset credits at a price that justifies the forgone revenues associated with limiting harvest. Furthermore, Forestal Savia, Fundación Chile, and CFix reserve the right to alter the carbon project in the future. Brief project description:",
    "textAfterTable": "Country Chile World Wide Web-URL address www.fundch.cl Administrative Officer Responsible for the Project Surname Bitran First name, middle name Eduardo Job title Director General Direct telephone 56-2-241-9362 Direct fax 56-2-241-9386 Direct e-mail ebitran@fundch.cl Contact Person for AIJ Activities (if different from the Administrative Officer) Surname Morales First name, middle name Eduardo Job title Jefe de Proyectos (Project Manager)",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}