{
    "relation": [
        [
            "Transaction Code",
            "468/469",
            "488/489",
            "480/481/482/ 780/550",
            "500/550",
            "500",
            "520/521 or 550",
            "520/521 or 550",
            "520/521",
            "520/521 or 520/550/521",
            "520/550/521",
            "520/521 470/472",
            "520/521",
            "520/521",
            "550",
            "550",
            "550",
            "550",
            "550",
            "971/972",
            "971/972",
            "971/550"
        ],
        [
            "Closing Code or Definer Code",
            "n/a",
            "n/a",
            "definer 07",
            "cc 51 (cc 50 was used prior to 2004) and definer 06",
            "cc 52,54, or 56 (enter) and 53, 55, or 57 (exit)",
            "cc 60 - 67, 81, 83 and 85 - 89, definer 03",
            "cc 76 or 77 and 70 (TC 520 only), definer 10",
            "cc 73 (MFT 55 and MFT 01 ONLY)",
            "cc 76 - 80, definer 04",
            "cc 80, definer 02",
            "cc 82 (TC 520) or cc 95 (TC 470)",
            "varies",
            "varies",
            "definer code 01",
            "definer code 08",
            "definer 08",
            "definer 09",
            "",
            "AC 043/063/163",
            "AC 065",
            "AC 99/98 and definer code 05"
        ],
        [
            "Description",
            "Estate Tax Lien",
            "Estate Tax Lien",
            "Offer In-Compromise",
            "Military Deferment",
            "Combat Zone",
            "Bankruptcy",
            "Collection Due Process",
            "Litigation",
            "District Court Litigation/Judgment",
            "District Court Litigation - Assets in Control of the Court",
            "Civil Penalty with Appeal Rights",
            "Summons Enforcement",
            "Third Party Summons",
            "Installment Agreement with Form 900, Tax Collection Waiver",
            "Wrongful Levy (Seizure)",
            "Wrongful Lien",
            "Taxpayer Living Outside of the US",
            "Enforcement of the Two-Tier Tax Scheme (Exempt Organization Only)",
            "Installment Agreement - Pending, Rejected or Appealed",
            "Innocent Spouse",
            "Taxpayer Assistance Order"
        ],
        [
            "Suspension Time Frame",
            "Suspended from the TC 468 to the TC 469 IDRS does not update the CSED",
            "Suspended from the ST 14 date (TC 488) to the TC 489 date",
            "For specific guidance, follow, Exhibit 5.19.10-6 and Exhibit 5.19.10-7. TC 481 (rejected OIC) dates include the 30 days and any appeal period or If Offer is returned and TC 481 is input, the 30 days does NOT apply",
            "Suspended for the period of military service plus an additional 270 days TC 500 definer code 06 will be entered with the correct CSED",
            "Use the TC 500 dates on CC IMFOLE to compute the CSED Suspended from the date of entry to the date of exit plus 180 days For multiple overlapping periods, 180 days is added to the last exit date See IRM 5.19.10.4.4.1, CSED Considerations, for additional guidance when computing CSEDs with Combat Zone suspensions.",
            "Suspended from the TC 520 to the TC 521 date plus six months If a TC 520 date is within six months of a previously posted TC 521, compute the suspension from the first TC 520 to the last TC 521 and add six months to the end. TC 520s dated after July 1986 and TC 521s dated after January 1987 are systemically computed in most cases. A TC 521 with statistical indicator 999, will reverse all open TC 520s in the module for closing codes 81, 83, 85 through 89 and 60 through 67 cc 84 does not suspend the CSED TC 522 is input to remove a TC 520 and does not affect the CSED",
            "Suspended from the TC 520 to the TC 521 date If the recalculated CSED is less than 90 days from the TC 521 date, then the CSED extends to 90 days from the TC 521 date CSEDs are automatically calculated for TC 520/521s posted as of 01–01–2001, except when only one spouse requested the hearing Prior to January 2000, TC 520 cc 70 was used for all hearing requests and reversed with TC 521 no closing code Closing codes 70 through 75 do not suspend the CSED. Note: cc 73 suspends the CSED for MFT 55 and MFT 01. See below.",
            "Period is from TC 520 date to TC 521 date. CSED is suspended for TC 520/521 posted cycle 200002 or later for tax periods 199901 and subsequent Prior to cycle 200002 cc 73 did not suspend the CSED.",
            "Suspended from the TC 520 to the TC 521 date unless a new TC 550 is posted with a later transaction date If the tax liability is reduced to judgment, the CSED is extended indefinitely until satisfied (TC 550 definer code 04) cc 84 does not suspend the CSED",
            "Suspended from the TC 520 to the TC 521 date plus six months",
            "Suspended from the TC 520 to the TC 521 date May be suspended with TC 470 cc 95. A new TC 550 should be input when the TC 470 is reversed. See IRM 5.19.10.4.4.1, CSED Considerations.",
            "Period is from the date the suit is filed until the proceeding is resolved",
            "Period is from six months after the service of the summons and ending on the date of the final resolution of the summoned party’s response",
            "Accept the CSED date input with TC 550 definer code 01 as valid. Refer to IRM 5.19.10.4.4.3, for additional guidance. ONLY Field employees have the authorization to secure Form 900 Waivers",
            "Suspended from the date property is wrongfully seized or received to the date it is returned or the date a wrongful levy judgment becomes final, plus 30 days",
            "Suspended from the date any person becomes entitled to a certificate of discharge of lien until 30 days after the earlier of the earliest date on which the Service no longer holds any of the amount as a deposit or bond or the date a judgment concerning the value of the Service’s interest in the property becomes final",
            "Suspended while the taxpayer is outside the U.S. if absence is for a continuous period of at least six months CSED does not expire until six months after the taxpayer's return to the country",
            "For specific guidance refer to the IRM references.",
            "Effective for transactions dated 3/9/2002 and after From the TC 971 AC 043 to the TC 971 AC 063 dates for pending IAs For 30 days following a rejected IA. TC 971 AC 043 to the TC 972 AC 043 dates. The transaction date of the TC 972 AC 043 includes the 30 days For 30 days following termination. Master File adds 30 days to the TC 971 AC 163 date. except when TC 971 AC 163 is generated by ST 12 During the appeal of the terminated or rejected IA. If the TC 971/972 AC 043 dates are the same, the CSED is not suspended TC 972 AC 043 dates include the 30 days.",
            "Suspended from the TC 971 AC 065 to the TC 972 AC 065 date TC 971/972 AC 065 with the same dates does not suspend the CSED",
            "Suspended from the TC 971 AC 99 to the TC 971 AC 98 dates. Until Information System computer program changes, the TC 971 AC 99 and 98 will not suspend the statute. Statute must be revised using TC 550 definer code 05."
        ],
        [
            "IRM References",
            "IRM 5.1.19.3.12 IRM 5.5.5.2",
            "IRM 5.1.19.3.12 IRM 5.5.7.9.1",
            "IRM 5.1.19.3.4 IRM 5.8.10.7 IRM 5.19.7.3.7 IRM 8.21.5.4.3",
            "IRM 5.1.19.3.9 IRM 5.4.12.2.3",
            "IRM 5.1.7.9.3 IRM 5.1.19.3.8 IRM 20.2.7.7.1",
            "IRM 5.1.19.3.1.1 IRM 5.9.4.2 IRM 5.9.5.6 IRM 5.9.5.6.1 IRM 5.9.5.6.2 IRM 5.9.17.19 Document 6209 11.8.8",
            "IRM 5.1.9.3.6 IRM 5.1.9.3.6.1 IRM 5.19.8.4.10 Document 6209, 11.8.8",
            "",
            "IRM 5.1.19.3.2 IRM 5.1.19.3.2.1 IRM 5.5.1.9 IRM 5.9.6.7 IRM 25.3.5.6 Document 6209, 11.8.8",
            "IRM 5.5.1.9 Document 6209, 11.8.8",
            "Document 6209, 11.8.8 IRM 5.19.14.1.5 Note, TFRP Statute of Limitations",
            "IRM 25.6.1.12.2.1",
            "IRM 25.6.1.12.2.1",
            "IRM 5.1.19.3.5 IRM 5.14.2.1.3 IRM 5.14.2.2.2",
            "IRM 5.1.19.3.10 IRM 5.10.6.15",
            "IRM 5.1.19.3.11",
            "IRM 5.1.19.3.7.1",
            "IRM 5.1.19.3.14 IRM 7.27.15.3.4",
            "IRM 5.14.2.1 IRM 5.14.2.2 IRM 25.6.1.12.2.1",
            "IRM 25.15.1.8 IRM 25.15.2.4.2",
            "IRM 13.1.14.3.1 IRM 13.1.14.4.2 IRM 13.1.14.4.2.2"
        ]
    ],
    "pageTitle": "Internal Revenue Manual - 5.19.10 Collection Operations Transcript Processing (Cont. 2)",
    "title": "",
    "url": "http://www.irs.gov/irm/part5/irm_05-019-010r-cont02.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00100-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 512478111,
    "recordOffset": 512435097,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5230=EFT 1240 are assessed on control-D by CSCO on a daily basis and must be worked within one day of receipt., 36301=This listing allows CSCO to verify the information on the EFT file corresponds with the IA file on IDRS. The listing is created semi-annually, in April and October and must be processed within 30 days of receipt., 110254=Partial Payment Installment Agreements: ALN \"12\" : See IRM 5.19.10.10.4.4, Defaulted with Backup 53 (ALN XX53), 109568=Continuous Wage Levies: ALN \"XX08\" : See IRM 5.19.10.10.4.2, Defaulted Continuous Wage Levy, 36605=The DDIA liaison notifies the Computer Branch to run the EFT 2811 Listing in April and October., 68529=Follow procedures for computing and assessing accruals in IRM 5.19.10.10.2.1, Full Paid Restricted Interest and Penalty Accounts., 5365=CSCO contacts Computer Services immediately if the EFT 1240 listing is not received., 218041=IRM 13.1.14.4.2.2, 220072=Exclude the days from 12/21/2000 through 03/08/2002, 199425=TC 520s dated after July 1986 and TC 521s dated after January 1987 are systemically computed in most cases., 50398=The above guidelines exclude the MFT 31 category: see IRM 5.19.10.10.13, MFT 31 Category on the IAAL., 204535=IRM 5.1.19.3.2.1, 214870=From the TC 971 AC 043 to the TC 971 AC 063 dates for pending IAs, 207809=IRM 25.6.1.12.2.1, 217993=IRM 13.1.14.4.2, 224389=Compute the number of days from 01/01/2000 to TC 481/482/780., 66445=Prepare a release of the levy on wages, Form 668-D, Release of Levy/Release of Property From Levy. For levy release procedures, see IRM 5.19.4.4.10, Levy Release: General Information., 217511=Suspended from the TC 971 AC 99 to the TC 971 AC 98 dates., 193367=IRM 5.1.19.3.12, 22252=When this occurs, a one-sided Form 2424, Account Adjustment Voucher, is prepared to manually reverse the taxpayer’s credit., 204488=IRM 5.1.19.3.2, 122474=All others, input STAUP 2200 and ASGNI \"0120\" ., 206920=IRM 5.19.14.1.5 Note, TFRP Statute of Limitations, 32003=EFT 14 also displays a list of \"Expected Deposit Dates Not Sent to Bank\" ; for related instructions see: IRM 5.19.10.9.2.2, EFT 12 Expected Deposits Not Sent to Bank - CSCO Processing., 168585=On return delinquencies for 2001 and subsequent period, the taxpayer will be given 180 days plus 105 (106 leap year) if the taxpayer was in the CZ for the entire filing period from the transaction date of TC 500 closing code XX (exit date). The 105 (or 106) days only applies to the filing of a tax return and is not used to compute the new CSED. See IRM 5.19.10.6.4, Combat Zone Computation of Suspense Period., 217602=Until Information System computer program changes, the TC 971 AC 99 and 98 will not suspend the statute. Statute must be revised using TC 550 definer code 05., 191087=Use the information in the \"Suspension Time Frame\" column to compute the CSED. See IRM 5.19.10.4.4.1, CSED Considerations and subsections for additional guidance., 21043=When they are unable to correct this condition, CSCO prepares a one-sided Form 2424, Account Adjustment Voucher, for each affected taxpayer, to reverse the credit, attaching a copy of the EFT 18 with the appropriate taxpayer underlined in RED as backup documentation., 216513=Suspended from the TC 971 AC 065 to the TC 972 AC 065 date, 223035=Use the following table to compute a CSED when an OIC is pending prior to 01/01/2000 but accepted, rejected or withdrawn 01/01/2000 or later., 27608=Pull EFT 18 and correct the prenote information. See IRM 5.19.10.9.3, EFT 18 Listing - CSCO Processing., 187900=EFT 1240, 209954=IRM 5.1.19.3.5, 196890=IRM 5.1.19.3.9, 63035=It is imperative the wage levy is released immediately when the account becomes full paid. Whenever possible levy releases should be faxed to the employer to prevent collection of excess levy proceeds. See IRM 11.3.1.11, Facsimile Transmission of Tax Information, for guidelines., 133129=Input STAUP 2201 to issue the TDA., 104604=Input STAUP 2200, 4062=The EFT 1240 also generates a listing posting the TC 670 to affected taxpayer accounts on IDRS. DDIA TC 670 transactions use a special blocking series and DLN., 200310=IRM 5.9.17.19, 198382=IRM 5.1.19.3.8, 53355=Re-input the EFT indicator on DDIA. For additional information see IRM 5.19.1.10, DDIA Monitoring Procedures - CSCO Processing., 224483=Exclude any days from 12/21/2000 through 03/08/2002., 197930=See IRM 5.19.10.4.4.1, CSED Considerations, for additional guidance when computing CSEDs with Combat Zone suspensions., 48485=The IAT tools as listed in IRM 5.19.10.1, Compliance Services Collection Operation Transcript Overview must be used by Campus Compliance employees for procedures outlined in this IRM. When an action must be taken and an IAT tool is available, Campus Compliance employees with access to the tool are required to use it to complete the action., 70364=Use the appropriate ALN; for additional information See IRM 5.19.1-11, ALNs., 103718=If there is no indication the new debit was included in a PPIA, default the account using CC IADFL and input STAUP 2201, allowing the case to go to ACS., 215143=For 30 days following termination. Master File adds 30 days to the TC 971 AC 163 date. except when TC 971 AC 163 is generated by ST 12, 201471=Prior to January 2000, TC 520 cc 70 was used for all hearing requests and reversed with TC 521 no closing code, 53831=Update the appropriate User Fee code. For additional information see IRM 5.19.1-13, IA User Fee Codes., 214071=IRM 7.27.15.3.4, 214786=Effective for transactions dated 3/9/2002 and after, 110032=Currently Not Collectible (CNC): ALN \"XX53\" : See IRM 5.19.10.10.4.4, Defaulted with Backup 53 (ALN XX53), 92169=Prior to reinstating the agreement you must check the CSED to determine if the module(s) will full pay before the existing CSED expires; for additional information see IRM 25.6.1.12, Collection Statute Expiration Date (CSED)., 210959=IRM 5.1.19.3.10, 144033=Compute and assess restricted interest and/or penalty accounts with ALN \"XX27\" ; for procedures to compute restricted interest and/or penalty: see IRM 5.19.10.10.2.1, Full Paid Restricted Interest and Penalty Accounts., 187936=EFT 1825, 201313=CSEDs are automatically calculated for TC 520/521s posted as of 01–01–2001, except when only one spouse requested the hearing, 212063=IRM 5.1.19.3.11, 224857=Compute the number of days from TC 480 date to 12/31/1999, plus 1 year and add to the original CSED., 216604=TC 971/972 AC 065 with the same dates does not suspend the CSED, 190034=Suspended (ST61), exception: June, July, December and January: 20 working days, 215396=If the TC 971/972 AC 043 dates are the same, the CSED is not suspended, 128498=Input STAUP 2206., 195657=IRM 5.1.19.3.4, 224990=Then, add the number of days from 01/01/2000 to TC 481/482/780 date., 220722=Stop at the later of the original CSED or 12/31/2002, 225091=Exclude any days from 12/21/2000 through 03/08/2002. This is the new CSED., 235168=See IRM 5.19.10.4.2, Transaction Codes and Case Actions that Suspend or Extend the CSED for situations that extend the CSED., 145542=For any module in ST 61, with no pending or posted TC 520 with a bankruptcy closing code, default the agreement using IADFL, with default category \"OTHER\" and input STAUP 2200., 109776=Cross reference Accounts: Identified as \"CR TINS\" , ST 63: See IRM 5.19.10.10.4.3, Defaulted Installment Agreement with Cross Reference TIN, 200081=IRM 5.1.19.3.1.1, 3734=The EFT 1240 is a computer system run generating our DDIA payment requests and prenotes to the correspondent bank on a daily basis. This listing must be processed within 5 working days of receipt. Prenote and payment requests look the same; however, prenotes are always for \".00\" dollars., 93410=If none of the conditions in (4) are met and the assessed balance, including the new debit, meets streamlined criteria, follow IRM 5.19.10.10.3.2(2), Suspended for New Assessment., 104653=ASGNI/ASGNB 0120; for input procedures see IRM 2.4.27, Command Code ASGNI/ASGNB formerly TSIGN., 195704=IRM 5.8.10.7, 73113=Process these accounts per established guidelines: see IRM 5.19.10.10.3.4, Anticipated Debits on the IAAL., 196937=IRM 5.4.12.2.3, 8618=Transaction Codes 671 and 280 are identified by special blocking series and document codes as described in IRM 5.19.10.9.2, EFT 1240 Listing - CSCO Processing:, 206441=May be suspended with TC 470 cc 95. A new TC 550 should be input when the TC 470 is reversed. See IRM 5.19.10.4.4.1, CSED Considerations., 190205=June, July, December and January: 50% in ten business days, 215499=TC 972 AC 043 dates include the 30 days., 102593=Input STAUP 2209., 109320=Payroll Deduction: ALN \"11XX\" and \"91XX\" : see IRM 5.19.10.10.4.1, Defaulted Payroll Deduction Agreements/Payment Missing, 209546=Refer to IRM 5.19.10.4.4.3, for additional guidance., 214023=IRM 5.1.19.3.14, 53138=Re-input a three-year review date on IMF only, BMF Trust Fund. see IRM 5.14.11.5, Considerations after Default or Termination, Including Reinstatement., 188305=EFT 1823, 213185=IRM 5.1.19.3.7.1, 214968=For 30 days following a rejected IA. TC 971 AC 043 to the TC 972 AC 043 dates. The transaction date of the TC 972 AC 043 includes the 30 days, 217945=IRM 13.1.14.3.1, 211007=IRM 5.10.6.15, 60317=Assess accruals or correct the penalty or interest using CC ADJ54 in blocking 05 (unless you ordered the document from files.) and HC 0. Do not create a balance due on the tax period of less than ≡ as described in IRM 21.3.1.4.51.2, Adjusting CP 86 Accounts., 202172=IRM 5.19.8.4.10}",
    "textBeforeTable": "The following are associated RCs and resolutions: When working this listing, ensure the taxpayer is allowed a skip if you reinstate the agreement. The Non-Payment Problem Register generates whenever a payment is not received from the financial institution; work this problem register within ten days of receipt. 5.19.10.9.3.1  (02-01-2014) Non-Payment Problem Register Non-Payment Problem Register The EFT 18 Listing consists of: EFT 18 generates a hard copy listing received daily in CSCO. The second TC 671 causes the agreement to default The first TC 671 generates CP 57, Taxpayer Inquiry, Notice of Insufficient Funds, and turns off the Skip Indicator Transaction Codes 671 and 280 are identified by special blocking series and document codes as described in IRM 5.19.10.9.2, EFT 1240 Listing - CSCO Processing: It is put in EFTAD and indicates rejected by bank. TC 670 posts without a TC 280 and is given a skip and turned off and is then treated as a skipped payment, but the DDIA does not default unless the skip was previously used. If the original documents must be secured",
    "textAfterTable": "The status on the EFT file does not agree with corresponding status on the TIF An active account on the TIF is not on EFT file The taxpayer is on EFT file, but not on the TIF 5.19.10.9.9.1  (02-01-2014) Status on EFT File Differs from TIF – CSCO Processing When the status on EFT file differs with TIF data, this indicates the IA displayed on CC EFTAD does not agree with the EFT Indicator displayed on IADIS. Check the ALN displayed on IADIS. It is not necessary to also check EFTAD for this, and: If... And... Then... The account is an active DDIA, not full paid or defaulted Intentionally left blank Ensure the EFT Indicator is \"[1]\" . If not, change the EFT indicator to \"[1]\" .",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}