{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Other",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "153,400",
            "144,147",
            "105,457",
            "42,560",
            "19,363",
            "5,360",
            "693,127"
        ],
        [
            "Congregations",
            "51",
            "462",
            "230",
            "102",
            "54",
            "11",
            "-"
        ]
    ],
    "pageTitle": "Gahanna, Ohio (OH 43230) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Gahanna-Ohio.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00058-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 361828591,
    "recordOffset": 361686766,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7935=According to our research of Ohio and other state lists there were 19 registered sex offenders living in Gahanna, Ohio as of July 31, 2015. The ratio of number of residents in Gahanna to the number of sex offenders is 1,780 to 1. The number of registered sex offenders compared to the number of residents in this city is a lot smaller than the state average., 26802=Incorporated in 1961}",
    "TableContextTimeStampAfterTable": "{17032=On 4/3/1974, a category F5 (max. wind speeds 261-318 mph) tornado 39.4 miles away from the Gahanna city center killed 36 people and injured 1150 people and caused between $50,000,000 and $500,000,000 in damages., 57449=School Enrollment by Level of School (%) in 2013, 170741=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 43884=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 9.98. This is about average. Closest monitor was 4.9 miles away from the city center., 57051=Educational Attainment (%) in 2013, 60265=1996 Presidential Elections Results, 40870=Air Quality Index (AQI) level in 2012 was 96.3. This is worse than average., 60837=2004 Presidential Elections Results, 42417=Ozone [ppb] level in 2012 was 34.5. This is about average. Closest monitor was 6.2 miles away from the city center., 35685=Tourist attraction: Carlson Wagonlit Travel (Recreational Trips & Guides; 1131 N Hamilton Rd)., 61409=2012 Presidential Elections Results, 169456=Total of 265 patent applications in 2008-2015., 43116=Particulate Matter (PM10) [µg/m3] level in 2012 was 29.0. This is significantly worse than average. Closest monitor was 6.8 miles away from the city center., 83049=5.52% of this county's 2010 resident taxpayers moved to other counties in 2011 ($46,047 average adjusted gross income), 17354=On 2/22/1971, a category F3 (max. wind speeds 158-206 mph) tornado 2.1 miles away from the city center injured 7 people and caused between $500,000 and $5,000,000 in damages., 60551=2000 Presidential Elections Results, 61123=2008 Presidential Elections Results, 61693=Graphs represent county-level data. Detailed 2008 Election Results, 80836=5.74% of this county's 2011 resident taxpayers lived in other counties in 2010 ($38,420 average adjusted gross income), 41692=Sulfur Dioxide (SO2) [ppb] level in 2008 was 1.84. This is about average. Closest monitor was 5.1 miles away from the city center.}",
    "textBeforeTable": "Religion statistics for Gahanna city (based on Franklin County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Bottled, tank, or LP gas (1%) Electricity (20%) Utility gas (80%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 251 Franklin County: 2.25 / 10,000 pop. Ohio: 1.89 / 10,000 pop. Number of supercenters and club stores: 11 This county: 0.10 / 10,000 pop. State: 0.13 / 10,000 pop. Number of convenience stores (no gas): 146 Franklin County: 1.31 / 10,000 pop. Ohio: 1.25 / 10,000 pop. Number of convenience stores (with gas): 285 Franklin County: 2.55 / 10,000 pop. State: 2.93 / 10,000 pop. Number of full-service restaurants: 730 Here: 6.54 / 10,000 pop. State: 6.25 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}