{
    "relation": [
        [
            "Date",
            "Every Monday during term time",
            "to Sun 20th September 2015",
            "From October 2014",
            "From March 2015"
        ],
        [
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Event",
            "Creation Station Little Explorers Suitable for 1-5 years. 10.30am - 11.30am",
            "Life on the Edge: Ice Age Frontier",
            "Traces of Empire: Decoration and Design in Roman Britain In 43 AD, Britain was invaded and became a province of the Roman Empire. However trade, population movement and political alliances meant links had been forged before the invasion. This new display looks at the change in decoration and style during this period using significant archaeological finds from Museums Sheffield’s collections.",
            "Over south yorkshire skylines"
        ]
    ],
    "pageTitle": "What's On Sheffield & District - Concerts, Theatre, Events Information",
    "title": "",
    "url": "http://www.sheffieldontheinternet.co.uk/events.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00170-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 725329531,
    "recordOffset": 725295434,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{215081=Abbeydale Industrial Hamlet, Abbeydale Road South - schools' educational trips are available. Schools may enquire re availability by ringing 0114 2367731. Kelham Island Museum, Alma Street Most Sundays - Small scale events. Steam engine usually fires up on Sundays at 12 Noon/2pm/4pm & Mon-Thu 11am and 2pm. Elsecar Heritage Centre and Workshops, Wath Road, Elsecar, Near Barnsley Tel: 01226 740203. Open 10am to 5pm seven days a week. Elsecar Steam Railway runs most days - Check first. Online information:- Alive web site for a comprehensive guide to gigs, clubs and theatres in South Yorkshire. Itchy Sheffield Gig Guide The Lantern Theatre - Sheffield's only small Victorian beautiful theatre set in the heart of Nether Edge. Leadmill - web site with details of live bands & club nights. Rotherham Arts Centre web site for the latest events in Rotherham. Rotherham Council - forthcoming events/what's on RSS feed. Sheffield Students Union - more events Web Site. Site Gallery, Brown Street University of Sheffield Drama Studio}",
    "textBeforeTable": "Western Bank, Sheffield, S10 2TP 0114 278 2600 WESTON PARK MUSEUM Top of Page other venues Tickets or sarah millican at Sarah Millican Wed 27th January 2016 Rumours of Fleetwood Mac   Tue 26th January 2016 Milton Jones   Sun 4th October 2015 other venues Tickets for alan carr at Tickets for Sat 22nd Tickets for Fri 21st Alan Carr Fri 21st & Sat 22nd Aug 2015 Event   Date 0845 127 2190 Water Street, Buxton, SK17 6XN BUXTON OPERA HOUSE",
    "textAfterTable": "Top of Page OTHER EVENTS IN THE AREA Tickets For Events At Plug Tickets For Events At Octagon Tickets For Events At Corporation Tickets For Events At Magna Centre Date   Event Venue Fri 24th July 2015   Alabama 3 Corporation Fri 24th July 2015 Tramlines Festival Featuring Buzzcocks, Martha Reeves, The Charlatans, Ghostpoet, Basement Jaxx, De La Soul Various city centre venues Sat 25th July 2015 Larry Miller Tickets for larry miller at other venues Leopard, Doncaster Wed 29th July 2015 Blitz Kids Tickets for blitz kids at other venues Corporation Sat 1st & Sun 2nd Aug 2015   World of Superheroes Convention - WOSCON Sheffield Students Union",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}