{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "It's an open campus, always be aware of your surroundings anywhere; being on a campus is no excuse to not protect yourself at all times.",
            "Greeks always fun.",
            "The campus is literally great for all races and nationalities. Very diverse even though it's an HBCU.",
            "There is always club events and campus parties and neighborhood pool parties. You can go eat, bowl or run over to Frankie's fun park and go cart it up.",
            "There are several wonderful affordable places for students to eat. A restaurant called Gigi's has the best meals for about $6.00, um um good. There is a restaurant called Bowicks Arch on the same street as the University that have the best soul food for the lowest prices. And of course there are the popular restaurants like chili's an applebees with the two for twenty's and half off appetizers. Really great food around campus; you will not starve.",
            "Dorms can be tricky; it is an open university and NCCU has had it's share of neighborhood altercations that have spilled onto campus a few times. NCCU has a shortage of dorms and upperclassmen are forced to find housing around Durham. Some apartment complexes offer good housing at affordable prices, but rent is more than mortgage payments so be aware of what your getting for the money.",
            "Excellent programs and courses to help you graduate with the best up to date knowledge.",
            "My biggest tip for prospective students is to quickly get out of university college. All transfers and incoming freshman need to learn there course schedule and the proper advisers and professors to associate themselves with once you enter the university to ensure you only spend four years at NCCU.",
            "NCCU gets a rating of 4 stars. They have teachers who honestly want to see you succeed. NCCU gives you the resources to excel after your college career."
        ]
    ],
    "pageTitle": "North Carolina Central University (NCCU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/North-Carolina-Central-University/reviews?_escaped_fragment_=/show/81884",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00279-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 885907099,
    "recordOffset": 885825434,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{111254=Predawns, night clubs, game rooms, cookouts, events from greek life, SGA and SAB parties, 10:40 break (music, fun and sometimes food in the morning and sometimes at night), basketball, footbaal, softball, baseball, tennis, volleyball, swimming, weight lifting and so much more., 430351=© 2015, Cappex.com, LLC, 143655=North Carolina Central University deserves a grade of a B. Reason being is because faculty, staff, and administration are working to expand the university, as well as, diversity and student morale. NCCU has been the number one HBCU since 2009 and we are struggling to keep it that way with all the changes and advancements., 308883=North Carolina Central University does offer a thing called the 10:40 break. It is where no one has class at that time and people meet in the the student union to relax in between classes., 382404=I really enjoy socializing. The small campus makes it easy to catch up with your friends. Attending organized events on campus keeps things interested. There is a DJ during our 10:40 break and off campus activities that are safe to attend., 139640=An unusual location on campus would be the founders house and the NCCU centennial garden. The founder's house was burned down before my attendance and now they have and exact replica. It's kinda creepy when entering, because everything in their is designed the way he had it. Remember, the school was founded in 1909, that many years ago and the house stands as a representative. The garden just enhances the houses features., 178804=North Carolina Central has several different Clubs and Activities that I have heard about. I will be attending this Fall of 2012, so I plan to get involved in the ones that is right for me!, 142089=Dorm life can be very strict for Freshmen entering into the university; however, your RA will assist you with almost everything. It's fun at times when students get together and have study sessions with one another. however, co-ed visitation ends at 12:00 A.M., therefore, you must plan ahead.}",
    "textBeforeTable": "07/20/2009 Reviewer is A current student here. 37 out of 37 people found this review useful. 1 of 105 A Proud Eagle from Raleigh, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Tips for prospective students Study hard, then have fun. Bang for the buck After scholarships and grants, the costs of tuition and books should be extremely manageable. Am enjoying being here NCCU always has lectures, plays, athletic events and more, so to try and take part in whatever you can to help you enjoy the college experience. Am learning a lot First tip: Get to know your professors and don't be afraid to ask questions. That's what they're there for. Login to rate or flag the reviews Betty from Durham, NC 07/15/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 12 out of 17 people found this review useful. 3 of 105 Categories Comments Great for these types of students Great for students who are serious about their studies.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}