{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Really close to downtown. Night can be a little dangerous (if you aren't smart about what you're doing). On the other hand, police presence is great and most people look out for both themselves and others.",
            "Lots of options. Some of the frats definitely haze (people have gotten hurt). Greek life's not for me (can't stand some of the people), but if it's your thing, this is the place to go.",
            "There are over 100 student orgs on campus. Multiple clubs meet on a daily basis. You can always find people playing frisbee, football, baseball, and other sports. The university sponsors multiple activities. Usually dorms have special activities. There are plenty of volunteer opportunities. Finally, of couse, the parties are world-class.",
            "Open-minded Adventuresome Out-going Curious Academically-minded The list goes on. Check it out.",
            "Some traditions: PRT cram, football games, diversity week, couch burning (considering the $1000 fine, this isn't a good idea), etc. Great locations: stadium, coliseum, woodburn circle, free-speech area, etc.",
            "In-state tuition is outrageously cheap. Can't beat the price. Financial aid from the state and university covers my tuition and some.",
            "Food, friends, sports, shopping, outdoor leisure, parties, volunteering, and campus organizations are just a few of the options you'll have in Morgantown.",
            "Universities dining halls aren't amazing, but then no one's are usually. Great little cafe's and such all around campus. If you go downtown, there's some awesome local dining.",
            "Haven't lived in a dorm yet, but I hear it's fairly acceptable in terms of normal dorm life.",
            "From experience, I can attest to the fact that engineering courses are difficult (but rewarding). Some of the electives are a little too watered down, but they're still a blast.",
            "Take a trip down and check out the campus and surrounding area. You'll fall in love with it immediately.",
            "WVU exemplifies a great atmosphere. Its diverse culture gives you a sense of adventure and acceptance. Academic culture thrives here among other, similarly important aspects of life."
        ]
    ],
    "pageTitle": "West Virginia University (WVU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/West-Virginia-University/reviews?_escaped_fragment_=/show/24674",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00158-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 928652255,
    "recordOffset": 928530630,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{622196=Diverse Environment and a good atmosphere for education . The campus is beautiful covering over 1000 acres and transportation is great , buses and trains (PRT) carries people all over the campus . Transportation is free and tution fee is average , take a campus tour and visit West Virginia University , Lets Go Mountaineer's :), 151166=the backyard brawl is when wvu plays it's biggest rival, pitt. however, 2012 may be the last year for the famous backyard brawl. with both teams switching divisions it is unknown if the games will continue between the two teams., 9410=Learn from my mistakes! I did not decide on WVU until late, as a matter of fact I was set on attending West Virginia Wesleyan College until financial aid fell through I had to re-evaluate my situation. In July I transitioned to WVU. My advice is to apply early and commit early. This will allow you the greatest opportunity to capitalize on all WVU has to offer. Believe me, being the last to schedule and waiting for them to make a room for you is no fun. You will end up with 8am classes and classes at 9pm, you will live in Evansdale and have all your classes downtown. It’s been a hectic first semester, one that you can avoid by committing early., 704435=© 2015, Cappex.com, LLC, 678161=Nestled in the hills of north central West Virginia, WVU is a land-grant university that has served the state since 1867. Despite having a population of over 30,000 students, one can still feel the tie associated with a small school while still living in a modern, urban area. A very diverse social and cultural atmosphere blends with academics that provide opportunities beyond what one can imagine, harboring an environment of creativity while fostering a future of success., 503150=Some traditions: PRT cram, football games, diversity week, couch burning (considering the $1000 fine, this isn't a good idea), etc. Great locations: stadium, coliseum, woodburn circle, free-speech area, etc.}",
    "textBeforeTable": "07/22/2009 Reviewer is A current student here. 47 out of 47 people found this review useful. 1 of 163 Mary from Chapel Hill, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. West Virginia University Reviews West Virginia University › West Virginia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Kayla from Clarksburg, WV 10/14/2010 Reviewer is A current student here. 14 out of 14 people found this review useful. 3 of 163 Categories Comments Great for these types of students Wow, with a campus like WVU it is great for any type of student. Seriously, any stereotype, any click from the athlete to the nerd, from the music major to the chemistry loving geek, from country to hard rock, white, black and every color in between you will fit in at WVU. The diversity here is amazing. I frequently spend my lunch just people watching and enjoying all the variety WVU has to offer. I myself have been challenged to look beyond who I am and reinvent who I will become. At am a musician, playing in the orchestra, a nerd in the honors program, an athlete running and attending spinning classes daily, a teacher working with students at a local school, a mentor for teenagers at the rec center, a room mate and friend to several girls from all over the country. WVU is great for all",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}