{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The IUPD is Indiana's own police department, and can be seen patrolling any given day. There are also emergency phones located around campus that can used to call for help. All dorms require either a key or student ID to access, and are secure 24 hours a day. There are also transportation options available at night: the Night Owl bus,in conjunction with the Campus Bus system, offers late night rides, and so do taxi companies that are available at reasonable rates. The IU Notification system alerts students to severe weather conditions, as well as safety or crime threats. IUB also has resources for those who have been assaulted or who need vehicle assistance.",
            "Greek life has a big presence on this campus. About 17% of students are involved with Greek life, and there is ample opportunity to join, with more than 40 chapters on campus. Greek life is heavily involved with the Little 500 and IUDM, and offers students the chance to get involved within their chapters. If you're not interested in Greek life (and we're talking about 83% of the students now), there are plenty of other ways to get involved and meet people. Be aware, though, that there is a slight divide between those who aren't Greek and those who are.",
            "With more than 750 student organizations, there's no shortage on activities for students to get involved in. There are volunteering groups, advocacy groups, professional/academic groups, ethnic groups, and political groups. IUB also has a wide range of club and intramural sports to join. For more on what's offered, visit: http://www.iub.edu/student/activities/clubs.shtml",
            "1. Big-school fans. If you're looking all that a big school offers -resources, lots of people, tons going on - then you're in the right place. 2. Those looking for a liberal arts education. The requirements for a degree demand that most students take a broader spectrum of classes. If you're looking for a well-rounded education, you're in the right place. 3. Those looking for a competitive edge while applying to grad school or the job market. The Kelley Business School is consistently ranked as a top business school, and our academics are nationally recognized. With plenty of career advising resources, IUB is a good place to go to achieve those future goals.",
            "The Little 500 and IUDM require special mention here as strong traditions to IUB. Other traditions include: laying on the ground and watching the lights change at the IU Museum; posing for a picture by the statue of Herman B. Wells, a revered past president of the university; running the Nearly Naked Mile (for a good cause); eating Pizza-X breadsticks; getting made-to-order cookies from Baked; kissing someone special at the Rose Well House at midnight; painting the Jordan Bridge to promote events or say happy birthday; realizing we have no mascot As far as unusual locations, we have: 1. the Showalter Fountain; it'Ã??Ã??s tradition to steal a stone fish from the fountain when our MenÃ?Â¢Ã??Ã??s Basketball team wins the NCAA Championship. One fish that was taken after our 1987 victory was never found and has since been replaced. Speculation tells us that the original must still be on campus. Somewhere. 2. the Indiana Memorial Union. It'Ã??Ã??s one of the largest student unions in the world. ItÃ?Â¢Ã??Ã?? s also haunted. There are lots of accounts of people hearing things, seeing things, having lights go off, and sometimes just getting the feeling that youÃ?Â¢Ã??Ã??re being watched. 3. the Kirkwood Observatory; during good viewing months, one of the schoolÃ?Â¢Ã??Ã??s older telescopes is open for public viewing once a week 4. the IU Museum; contains no 90 degree angles (except for some stairs) and was designed by I.M. Pei, famous for, among others edifices, the Louvre Pyramid 5. Dunn Meadow; itÃ?Â¢Ã??Ã??s a great place to relax and throw a Frisbee; protests have and will be held here from time to time, like during the Vietnam War",
            "The response to this one depends on where you live. In-state students definitely have it better: they pay in-state tuition, and there are scholarships and research programs that are only offered to in-state students. If you live in Indiana, then you're definitely getting a bang for the buck by attending IUB. Out-of-state students are different. As one, I can say from experience that the tuition is pretty high, and while there are plenty of ways to finance your education, be aware that you are not afforded some of the same financing opportunities that in-state students are.",
            "There is never a shortage of fun things to do on this campus. Parties are ever-present yes, but if that's not your thing, don't worry. There are club and intramural sports teams for one join, and the Sports and Recreation center offers free exercise classes that any student can go to, as well as lap pool and racquetball courts. There are also more than enough events to go to to keep busy. Sporting events happen year-round (most of which are free), and the IU Auditorium hosts musicals, comedians, and musicians all year. A free movie plays at the student union every weekend, and the Jacob's School of Music ( one of the top music programs in the country) puts on weekly performances, from concerts to operas. Each residence hall/themed floor hosts its own array of events, and a lot of the extracurricular clubs you can get involved in have their own as well. There are museums to visit, lectures to see, festivals to attend, and shopping to do. Greek life is pretty big here, so there are a lot of fraternities and sororities to pledge/rush. Let's not forget the Big Events: Little 500 and Dance Marathon (IUDM). These happen once a year, but are huge on campus. Visit : http://admit.indiana.edu/life/index.shtml to look around at what you can do around campus.",
            "On campus, there are some good food options. Each neighborhood has a food court, so there is always food within walking distance. Each food court offers a decent variety: sandwiches, Italian, Mexican, a bakery, breakfast food, a salad bar, etc. There are a couple places that students can go to for more variety too: the Southwest neighborhood has a great Bistro for more gourmet sandwiches, along with an all-you-can-eat buffet. The Hoosier Cafes are open late for those students are up past ten (i.e.: everyone). The Northwest neighborhood has a good ice cream shop. There are also convenience stores in each neighborhood that also accept meal points. Like a convenience store, packaged foods are sold (chips, ice cream, frozen dinners, etc.). Your food points are kept on your student ID, which is handy. As far as off campus dining goes, you really couldn't ask for anything better. Downtown Bloomington has dozens of restaurants and cafes, and offer pretty much any type of food you could look for. Along with the popular chain restaurants (Chipolte, Subway, Noodles & Co., Potbelly, Jimmy John's, etc.) there are countless other places to eat. Buffa Louie's is a popular wings place, the Village Deli offers breakfast, and 4th street has more international restaurants than you'll ever see in a three-block radius. That's to name a few. There a pizza places galore, but maybe one of the best things about Bloomington dining is the delivery services. Not only are tons of places open very late (think 3, 4am) but there are delivery services that offer to bring food right to you from restaurants that normally don't deliver.",
            "As with everything else here, you have plenty of options when it comes to dorm life. If you want a social, true-to-expectation college dorm, head to the Northwest neighborhood. This neighborhood fills up the fastest, and for good reason. It's known for its social atmosphere (think dorm parties every weekend), and there's always plenty of people ready to live up the weekends. The Central neighborhood, while slightly more low-key, offers a great location on campus as well as plenty of socializing itself. The Southwest neighborhood is a little more eclectic, and Collins is definitely for more artsy, creative people. All dorms are within walking distance to food courts or cafes, and convenience stores. Each dorm has activities year-round that the residents can go to, from 5K runs to midnight movies in the quad. There are also a lot of themed floors in each neighborhood. From Health Professions to Outdoor Adventures to Business to Honors Floors, students have the chance to live on floors with other people who share their interests and classes, which is a great way to meet people who have similar interests. Each neighborhood also has computers and printers for student use. Word to the wise: submit your housing application soon after you're accepted to ensure you get one of your preferences. A lot of students put this off and end up unhappy. Go about it the right way, though, and dorm life (despite its communal bathrooms) can be a blast. Visit here: http://admit.indiana.edu/life/housing.shtml for more reading on dorm life.",
            "This school offers students the chance to truly shape their education into what they want. The academic rigor spans a difficulty rating to prove just that. There are plenty of easy classes and even more hard ones, and the ones you take are up to you. How hard your classes get depends on what major and college you choose to enter. The multitude of honors tracks and programs offer a challenging course load to those ambitious undergrads, and there are also plenty of fun classes to take as well (History of Rock and Roll anyone?). With the vast number of classes offered, students can adjust the rigor of their academics to a level that suits them and their goals. The great thing, too, is that there's always help when you need it. Writing services, free tutoring services, preprofessional aid, there are many resources available to help students do well. The academics are nationally recognized as top-notch, and IUB offers plenty of programs to help students achieve: study abroad programs, research opportunities, and freshman seminars, just to name a few. Visit here: http://admit.indiana.edu/academics/index.shtml for even more on academics at IUB.",
            "Explore what IUB has to offer. Get online, visit campus, and see for yourself what makes this a great school. Look at what courses are offered, browse through the student organizations we have. Remember, you're not in class all the time, so look for opportunities to relax and have fun that appeal to you. Be open to new ideas! I hated the thought of a big school when I first started my college search, but when you start focusing on what you like instead of what you don't, I think you'll be pleasantly surprised at what sort of options that opens up. Also, ASK QUESTIONS! Don't be shy: ask current students, former students, the Office of First Year Experience, anyone about what IUB has to offer. We love the opportunity to brag.",
            "The very best of what a Big Ten school can offer: competitive academics, hundreds of student organizations, and great athletics for sports fans. IUB has enough resources to make your education exactly what you want it to be. The school is nationally recognized for its top-notch academic programs, culture, and music and art, not to mention its location on a beautiful campus in a quintessential college town."
        ]
    ],
    "pageTitle": "Indiana University-Bloomington (IU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Indiana-University-Bloomington/reviews?_escaped_fragment_=/show/83425",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00133-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903566467,
    "recordOffset": 903360772,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{315172=There is the Lotus Fest, in downtown Bloomington, where international traditions are celebrated in October, the Little 500 during an entire week in April, the Nearly Naked Mile Run in October, IU Basketball season from November to March, and the drumline playing in random places on campus the weekends before football games, among other things., 1094235=Food and dining can be found at almost every dorm on campus, though the hours and type of food available will vary from dining hall to dining hall. Some dining halls have a food court-type setup, where several places within the hall will be available everyday, while other halls have more of a buffet setup whose menu changes from day to day. Many dining halls offer food all day, serving breakfast, lunch, and dinner, while others will open later during the day. Another convenience is late-night eating. Some dining halls will offer a smaller section of the building late at night to serve for food service; some might be open as late as 2:00 a.m., 579844=The Little 500 and IUDM require special mention here as strong traditions to IUB. Other traditions include: laying on the ground and watching the lights change at the IU Museum; posing for a picture by the statue of Herman B. Wells, a revered past president of the university; running the Nearly Naked Mile (for a good cause); eating Pizza-X breadsticks; getting made-to-order cookies from Baked; kissing someone special at the Rose Well House at midnight; painting the Jordan Bridge to promote events or say happy birthday; realizing we have no mascot As far as unusual locations, we have: 1. the Showalter Fountain; it'Ã??Ã??s tradition to steal a stone fish from the fountain when our MenÃ?Â¢Ã??Ã??s Basketball team wins the NCAA Championship. One fish that was taken after our 1987 victory was never found and has since been replaced. Speculation tells us that the original must still be on campus. Somewhere. 2. the Indiana Memorial Union. It'Ã??Ã??s one of the largest student unions in the world. ItÃ?Â¢Ã??Ã?? s also haunted. There are lots of accounts of people hearing things, seeing things, having lights go off, and sometimes just getting the feeling that youÃ?Â¢Ã??Ã??re being watched. 3. the Kirkwood Observatory; during good viewing months, one of the schoolÃ?Â¢Ã??Ã??s older telescopes is open for public viewing once a week 4. the IU Museum; contains no 90 degree angles (except for some stairs) and was designed by I.M. Pei, famous for, among others edifices, the Louvre Pyramid 5. Dunn Meadow; itÃ?Â¢Ã??Ã??s a great place to relax and throw a Frisbee; protests have and will be held here from time to time, like during the Vietnam War, 155785=the showalter fountain, located in front of the iu auditorium is home to a statue of venus surrounded by fish. after iu's ncaa men's basketball championship in 1987, the very heavy fish were somehow stolen by revelers. all were returned except one, which has since been re-created. legend has it that the fish will reappear when bobby knight is asked to return as iu's basketball coach. we might be waiting a long time for that!!, 570746=-Get involved right off the bat! Go to all the welcome-week events and feel free to introduce yourself to anyone you meet. Everyone feels vulnerable at first, but if you just put yourself out there you will feel right at home in no time. -Be smart when scheduling classes. If you can't be productive early in the morning...don't take a math class at 8:00 AM. On the other hand, if you start class at noon every day your class schedule might run into dinner time. I hated having late classes because I had less time in the afternoon to study and work on homework. -HAVE FUN! I'm a huge proponent of working hard, but at IU we live by the motto, work hard, play hard. -Go to all the sporting events you can (yes, even football games). You'll be glad you went, trust me., 490324=Although everyone has heard about the missing Indiana University student from last June, Indiana University is safe. They offer safe rides (they come pick you up and take you to wherever you need to go) that are offered every night I think. There are also emergency lights every couple hundred feet around campus. The emergency lights have phones and buttons on them to contact the police., 1138365=Campus is beautiful, so walking across campus and visiting the art museum on campus are very enjoyable for the artistic. Many events occur on and off campus are also fun. Lotus festival in September is a great, local festival that focuses on connecting the world through music. If you come to IU for schooling or visiting, be sure to check this event out. Many events also go on during welcome week before classes start. These are all really fun to enjoy., 974085=Little 500 is a week in April that has so many events and concerts., 721696=IU is an awesome school and has an awesome legacy that follows. Herman B. Wells was the 11th president of IU College and passed away in 2000. He has the biggest library on campus named after him, called the Wells Library. He was the President and Chancellor of IU until his death. There is a granite statue of Dr. Wells on the campus of IU that has his hand out as if shaking someones hand. It gets a lot more handshakes than I do; they say that if you shake Dr. Wells hand you will be very successful at IU. I have just about broken his wrist I have shaken it so many times. So far, predictions are good., 159395=yes, it's a state school, but that doesn't mean you can skate. iu is home to some of the most academically acclaimed programs in the nation. the kelley school of business is renowned nationwide, and attracts top students from all over the globe with its rigorous business curriculum and fortune 500 contacts. in fact, kelley business grads enjoyed about 96% job placement within the first three months after graduation in 2011. the very selective jacobs school of music holds the distinction of one of the best fine arts programs in the u.s. in fact, i am told it recently surpassed the juilliard school of music in a reported ranking. another example of academic excellence is the college of informatics, a relative newcomer to the iu campus. the college was established only 12 years ago, as the first of its kind in the u.s., and now shares the field with just 19 other universities. informatics is the study of relating computer applications to real world situations. sure, you have to learn a bit of programming, but it is the application that is the key. cognates include bio informatics, environmental informatics, medical informatics, computer security, artificial intelligence, and more. it's a wide open field, with more openings than people to fill them (unheard of in our current economy!), and iu is one of a select few schools to offer this major. lookout facebook and google--here come the iu students!, 307164=IU's Welcome Week is a huge thing. It's where you learn the chant for basketball games, where you experience different cultures, get a lot of free stuff, and get to view some performances. Also, Bloomington has a downtown where there is a 4th street where there are literally almost every culture of food in existence. They have Thai restaurants, Chinese, Mexican, Cajun style, and many more!, 847794=Apply by November 1 in order to qualify for Automatic Academic Scholarships! All you do is apply for the school and they automatically check to see if you qualify for scholarships ranging from $4,000-$40,000. No extra costs, no essays. Simple, free, easy., 976751=Workout or participate in some type of sport at either the HPER building or the SRSC. If you're a foodie you can find a very wide variety of food near Kirkwood. Obviously they have the normal college food like pizza, burgers, etc. But I'm talking about Turkish, Tibetan, Cajun, Thai, Afghani, etc. There are a wide variety of clubs to join and there's always something going on on campus!, 291723=not much to report negatively. there was national news in the summer of 2011 but that is the exception and not the rule., 347286=One thing I found a little unusual was the Naked Mile Run at IU. Students all gather in October with as little as clothes as possible and do the run. You would think that it would be painfully cold, but everyone is always having such a good time while breaking a sweat that they barely notice., 737129=Little 500, which is a bike race held every year in April, is known as the biggest college party in the country. I can't wait for my first one., 448180=We have been missing a student since June of 2011 named Lauren Spierer. The Police here in Bloomington are always out patrolling in search to get kids who are drinking. Drinking tickets and Pre-Trial Diversion account for 37% of Monroe County's Circuit Court revenue., 411018=I spend over $1200 per class to not learn much., 141263=I'm an out-of-stater, so it is a tad expensive (but nothing compared to NYU, which was my second choice!). They are great with financial aid - I got a fairly hefty merit scholarship renewable for 4 years when I applied. My main point of advice on this topic is apply EARLY! Its rolling admissions, but you still don't have to commit until May. I applied in November just to get one application out of the way early, and I think in doing that I was able to get my scholarship because they still had the money to give out, so take full advantage of that!, 292059=little 500 bike race in april is lots of fun.}",
    "textBeforeTable": "07/26/2009 Reviewer is A current student here. 35 out of 35 people found this review useful. 1 of 268 Alicia from West Chester, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. Indiana University-Bloomington Reviews Indiana University-Bloomington › Indiana › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot The professors at Indiana University are accommodating to their students. If for any reason your schedule conflicts with office hours or review sessions most professors are willing to set up other meeting times for your benefit. There are many tutoring centers located in different parts of the campus, so picking one near your dorm is easy and convenient. If you are thinking of majoring in business the Kelley School of Business (KSB) is ranked one of the top in the nation; and their School of Public and Environmental Affairs (SPEA) is tied at number two with Harvard. The facilities are one of the top in the nation and anyone should take advantage of all the Indiana University has to offer. Login to rate or flag the reviews Alana from San Francisco, CA 12/05/2009 Reviewer is A current student here. 6 out of 6 people found this review useful. 3 of 268 Categories Comments Great for these types of students People looking to major in business or music; people",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}