{
    "relation": [
        [
            "Attribute",
            "all",
            "durableTopicPrefetch",
            "inputStreamPrefetch",
            "maximumPendingMessageLimit",
            "optimizeDurableTopicPrefetch",
            "queueBrowserPrefetch",
            "queuePrefetch",
            "topicPrefetch"
        ],
        [
            "Type",
            "xs:integer",
            "xs:integer",
            "xs:integer",
            "xs:integer",
            "xs:integer",
            "xs:integer",
            "xs:integer",
            "xs:integer"
        ],
        [
            "Description",
            "",
            "",
            "",
            "Sets how many messages a broker will keep around, above the prefetch limit, for non-durable topics before starting to discard older messages.",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Schema for namespace: http://activemq.apache.org/schema/core",
    "title": "",
    "url": "http://activemq.apache.org/schema/core/activemq-core-5.3.2-schema.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00163-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 3089007,
    "recordOffset": 3057670,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 31 Jan 2013 19:46:16 GMT",
    "textBeforeTable": "Root Element",
    "textAfterTable": "authorizationPlugin An authorization plugin where each operation on a destination is checked against an authorizationMap org.apache.activemq.security.AuthorizationPlugin axionJDBCAdapter Axion specific Adapter. Axion does not seem to support ALTER statements or sub-selects. This means: - We cannot auto upgrade the schema was we roll out new versions of ActiveMQ - We cannot delete durable sub messages that have be acknowledged by all consumers. org.apache.activemq.store.jdbc.adapter.AxionJDBCAdapter blobJDBCAdapter This JDBCAdapter inserts and extracts BLOB data using the getBlob()/setBlob() operations. This is a little more involved since to insert a blob you have to: 1: insert empty blob. 2: select the blob 3: finally update the blob with data value. The databases/JDBC drivers that use this adapter are: org.apache.activemq.store.jdbc.adapter.BlobJDBCAdapter broker An ActiveMQ Message Broker. It consists of a number of transport connectors, network connectors and a bunch of properties which can be used to configure the broker as its lazily created. org.apache.activemq.xbean.XBeanBrokerService brokerService Manages the lifecycle of an ActiveMQ Broker. A BrokerService consists of a number of transport connectors, network connectors and a bunch of properties which can be used to configure the broker as its lazily created. org.apache.activemq.broker.BrokerService bytesJDBCAdapter This JDBCAdapter inserts and extracts BLOB data using the setBytes()/getBytes() operations. The databases/JDBC drivers that use this adapter are: org.apache.activemq.store.jdbc.adapter.BytesJDBCAdapter commandAgent An agent which listens to commands on a JMS destination org.apache.activemq.broker.util.CommandAgent compositeDemandForwardingBridge A demand forwarding bridge which works with multicast",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}