{
    "relation": [
        [
            "",
            "a) Total number of instructional faculty",
            "b) Total number who are members of minority groups",
            "c) Total number who are women",
            "d) Total number who are men",
            "e) Total number who are non-resident aliens (international)",
            "f) Total number with doctorate or other terminal degree",
            "g) Total number whose highest degree is master's (not terminal)",
            "h) Total number whose highest degree is a bachelor's",
            "i) Total number whose highest degree is unknown or other",
            "j) Total number in stand-alone graduate/professional programs"
        ],
        [
            "Full-time",
            "170",
            "29",
            "84",
            "86",
            "8",
            "160",
            "8",
            "2",
            "0",
            "0"
        ],
        [
            "Part-time",
            "63",
            "9",
            "37",
            "26",
            "2",
            "39",
            "16",
            "7",
            "1",
            "0"
        ],
        [
            "Total",
            "233",
            "38",
            "121",
            "112",
            "10",
            "199",
            "24",
            "9",
            "1",
            "0"
        ]
    ],
    "pageTitle": "Macalester Common Data Set",
    "title": "",
    "url": "http://www.macalester.edu/ir/institutionaldata/cds2011.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00296-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 580050889,
    "recordOffset": 580035253,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29743=Does your institution have an application closing date? Yes. Application closing date (fall): January 15 Priority date: None., 66944=Priority date for filing required financial aid forms: February 8 Deadline for filing required financial aid forms: March 1, 13215=29 September 2011, 32044=D2. Provide the number of students who applied, were admitted, and enrolled as degree seeking transfer students in fall 2011., 30973=If yes, please complete the following: First or only early decision plan closing date: November 15. First or only early decision plan notification date: December 15 Other early decision plan closing date: January 2 Other early decision plan notification date: February 7, 6436=Total all undergraduates: 2005, 67489=Students must reply by (date): May 1., 37088=25 October 2011, 21121=E. Latest date by which SAT or ACT scores must be received for fall-term admission: January 15. Latest date by which SAT Subject Test scores must be received for fall-term admission: N/A., 72114=I-1. Number of Instructional Faculty for Fall 2011, 51524=20 February 2012, 71934=11 January 2012, 29991=C16. Notification to applicants of admission decision sent: by March 30., 51265=Books and supplies: $1050 Transportation: $100 to $1200 Other (personal) expenses: $924, 41825=F1. Percentages of first-time, first-year (freshmen) students and all degree-seeking undergraduates enrolled in fall 2011 who fit the following categories:, 75705=Fall 2011 student to faculty ratio: 10.4 to 1. (based on 1987 students and 191 faculty), 75865=Fall 2011 Number of Class Sections with Undergraduates Enrolled:, 9778=B3. Persistence - Degrees Awarded from July 1, 2010 to June 30, 2011., 13509=Total first-time, first-year (freshmen) men who applied: 2488 Total first-time, first-year (freshmen) women who applied: 3623, 14258=If yes, please answer the questions below for fall 2011 admissions:, 2714=29 September 2011, 75527=Report the fall 2011 ratio of full-time equivalent students (full-time plus 1/3 part time) to full-time equivalent instructional faculty (full-time plus 1/3 part time)., 62865=For graduates and loan types for questions H4 and H5: Include: 1) the 2011 undergraduate class who graduated between July 1, 2010 and June 30, 2011 who started at your institution as first-time students and received a bachelor's degree between July 1, 2010 and June 30, 2011 2) only loans made to students who borrowed while enrolled at your institution 3) co-signed loans Exclude: 1) those who transferred in 2) money borrowed at other institutions, 13651=Total first-time, first-year (freshmen) men who were admitted: 884 Total first-time, first-year (freshmen) women who were admitted: 1253, 6533=GRAND TOTAL ALL STUDENTS: 2005, 1625=Name of college or university: Macalester College Mailing address: 1600 Grand Ave, St. Paul, MN 55105-1899 Street address (if different): same as above Main phone number: 651-696-6000 WWW home page address: www.macalester.edu Admissions phone number: 651-696-6357 Admissions toll-free number: 1-800-231-7974 Admissions office mailing address: same as above Admissions fax number: 651-696-6724 Admissions e-mail address: admissions@macalester.edu Is there a separate URL application site on the internet? No. Do you have a mailing address other than the above to which applications should be sent? No., 77403=2 November 2011, 52535=Indicate academic year for which data are reported: 2011-2012 estimated, 48=Macalester College 2011 Common Data Set, 30080=C17. Reply policy for admitted applicants: must reply by May 1. Deadline for housing deposit: May 1. Amount of housing deposit: $300 Refundable if student does not enroll? No, 19981=If yes, reflect your institutions policies for admission for Fall 2013 below:, 10889=For the Fall 2005 cohort:, 20499=B. If your institution will make use of the ACT in admission decisions for first-time, first-year, degree seeking applicants for Fall 2013, please indicate your institution's policies, regardless of whether the writing score will be used in the admission process: ACT with or without Writing component accepted., 49266=G1. Undergraduate full-time tuition, required fees, room and board for 2012-2013., 31612=11 May 2012, 67274=Students notified on or about (date): April 1 Students notified on a rolling basis: No., 77575=Degrees conferred between July 1, 2010 and June 30, 2011., 31278=For the Fall 2011 entering class: Number of early decision applications received: 227 Number of applicants admitted under early decision plan: 115, 48803=NOTE: Undergraduate full-time tuition for 2012-2013 is available after February 1, 2012. Tuition for 2011-2012 is available in the 2010 Common Data Set.}",
    "textBeforeTable": "Instructional faculty is as defined by the American Association of University Professors (AAUP) in its annual Faculty Compensation Survey. I-1. Number of Instructional Faculty for Fall 2011 I. INSTRUCTIONAL FACULTY AND CLASS SIZE 11 January 2012 --> Back to Contents H15. If your insitution has recently implemented any major financial aid policy, program, or initiative to make your institution more affordable to incoming students such as replacing loans with grants, or waiving costs for families below a certain income level, please provide details.   ----------   ROTC     State/district residency     Job skills     Religious affiliation     Athletics     Music/drama     Art     Minority status    X Alumni affiliation     Leadership     Academics    X   Need -based Non -need based   Need -based Non -need based H14. Check off criteria used in awarding institutional aid. Check all that apply. NEED-BASED: Federal Pell SEOG",
    "textAfterTable": "I-2. Student to Faculty Ratio Report the fall 2011 ratio of full-time equivalent students (full-time plus 1/3 part time) to full-time equivalent instructional faculty (full-time plus 1/3 part time). Fall 2011 student to faculty ratio: 10.4 to 1. (based on 1987 students and 191 faculty)   I-3. Undergraduate Class Size Fall 2011 Number of Class Sections with Undergraduates Enrolled:   2-9 10-19 20-29 30-39 40-49 50-99 100+ Total Class Sections 61 243 98 22 6 2 0 432 Class Sub-Sections 58 71 12 0 0 0 0 141 --> Back to CDS Contents 2 November 2011 J. DEGREES CONFERRED Degrees conferred between July 1, 2010 and June 30, 2011. Percentages of degrees awarded are based on number of majors, not headcount (e.g. students with one degree but a double major will be represented twice). Percentages are calculated using the sum of first and second majors in each area of the IPEDS",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}