{
    "relation": [
        [
            "Cat. No.",
            "62500-W",
            "62500-A",
            "62500-B",
            "62500-G",
            "62500-GR",
            "62500-P",
            "62500-O",
            "62500-Y",
            "62500-L",
            "62500-T",
            "62500-R"
        ],
        [
            "Tissue-Tek",
            "4170",
            "4120",
            "4157",
            "4119",
            "4156",
            "4155",
            "4117",
            "4154",
            "4154",
            "4154",
            "4154"
        ],
        [
            "Description",
            "White",
            "Aqua",
            "Blue",
            "Gold",
            "Green",
            "Pink",
            "Orange",
            "Yellow",
            "Lilac",
            "Tan",
            "Red"
        ],
        [
            "Pack",
            "1500/cs",
            "500/cs",
            "500/cs",
            "500/cs",
            "500/cs",
            "500/cs",
            "500/cs",
            "500/cs",
            "500/cs",
            "500/cs",
            "500/cs"
        ],
        [
            "Price",
            "240.00",
            "86.00",
            "86.00",
            "86.00",
            "86.00",
            "86.00",
            "86.00",
            "86.00",
            "86.00",
            "86.00",
            "86.00"
        ],
        [
            "",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart"
        ]
    ],
    "pageTitle": "Tissue Embedding, Tissue Processing, and Biopsy Cassettes from Tissue Tek, Sakura Finetek",
    "title": "",
    "url": "http://www.emsdiasum.com/microscopy/products/histology/cassettes.aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00112-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428320291,
    "recordOffset": 428293195,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7620=View Cart || Request a 2015 Catalog, 117=Ordering: Each case contains two dispenser boxes of 500 cassettes and one dispenser box of 1000 lids.}",
    "TableContextTimeStampAfterTable": "{26872=Made from acetyl polymer This new version of Micromesh™ offers 1676 square openings (0.38 mm) allowing for a greatly improved fluid exchange without having to use the biopsy pads. Large anterior and posterior slots in both cassette and cover ensure that the Micromesh™ biopsy cassettes will sink rapidly (far better than cloth mesh cassettes). A large square compartment measuring 27 mm is perfect even for needle biopsies. The cover does not protrude above the cassette, a great space saving feature allowing more cassettes to be stacked in automatic labeling machines and tissue processors., 173049=© 2015 Electron Microscopy Sciences, 172219=P.O. Box 550 1560 Industry Road Hatfield, PA 19440 Tel: 215-412-8400 Toll Free: 800-523-5874 Fax: 215-412-8450 E-Mail: sgkcck@aol.com, 33380=This model is similar to the one above – single compartment – but cassettes have four square compartments each measuring 13 mm. Cover and base have about 1676 square openings maximizing fluid exchange and ensuring proper drainage. Each case contains four dispenser boxes of 250 cassettes with covers}",
    "textBeforeTable": "Ordering: Each case contains two dispenser boxes of 500 cassettes and one dispenser box of 1000 lids. A. Lids are packed separately 1. Slotted Cassettes Available in 11 different non-cytotoxic, non-metallic colors. Anterior writing area is at 45° angle to make the cassette universal. Made from Acetyl Polymer, which is a special high density polymer that keeps specimens safely submerged in solution. These cassettes are totally resistant to most histological solvents and their slots offer maximum flow through for good fluid exchange and proper drainage. The lids either come attached to the cassette or are packaged separately. The lids can be opened and closed as often as necessary and they always relock securely without danger of specimen loss. Large labeling areas are located on three sides of the cassette for your convenience. Each slot measures: 1x5mm, total 128 slots per cassette. Tissue Processing Embedding Cassettes All histology cassettes are specially made to be used either manually or in any leading cassette labeling instrument. Tissue Embedding and Processing Cassettes Histology and Light Microscopy",
    "textAfterTable": "70071-GR Slotted Cassette, Gray 3x500/cs 166.00 Add to Cart 70071-G Slotted Cassette, Green 3x500/cs 166.00 Add to Cart 70071-L Slotted Cassette, Lilac 3x500/cs 166.00 Add to Cart 70071-O Slotted Cassette, Orange 3x500/cs 166.00 Add to Cart 70071-PE Slotted Cassette, Peach 3x500/cs 166.00 Add to Cart 70071-P Slotted Cassette, Pink 3x500/cs 166.00 Add to Cart 70071-T Slotted Cassette, Tan 3x500/cs 166.00 Add to Cart 70071-W Slotted Cassette, White 3x500/cs 166.00 Add to Cart 70071-Y Slotted Cassette, Yellow 3x500/cs 166.00 Add to Cart Square Mesh Cassettes Biopsy Processing Embedding Cassettes Similar to the above slotted cassettes but especially designed with 1mm square mesh for small biopsies. A. Lids are packed separately Ordering: Each case contains two dispenser boxes of 500 cassettes and 70072-A Square Mesh Cassette, Aqua 2x500/cs 133.00 Add to Cart 70072-B Square Mesh Cassette, Blue 2x500/cs 133.00 Add to Cart 70072-GR",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}