{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Catholic",
            "Other",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "52,345",
            "34,074",
            "22,861",
            "13,169",
            "262",
            "103",
            "193,422"
        ],
        [
            "Congregations",
            "171",
            "52",
            "5",
            "25",
            "8",
            "1",
            "-"
        ]
    ],
    "pageTitle": "Chester, Virginia (VA 23831, 23834) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Chester-Virginia.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00138-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 366633091,
    "recordOffset": 366501494,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1187=2008 Presidential Elections Results, 46359=On 5/8/1984, a category F3 (max. wind speeds 158-206 mph) tornado 8.3 miles away from the place center injured 15 people and caused between $500,000 and $5,000,000 in damages., 20084=Particulate Matter (PM10) [µg/m3] level in 2012 was 13.3. This is significantly better than average. Closest monitor was 5.7 miles away from the city center., 617=Graphs represent county-level data. Detailed 2008 Election Results, 28833=Tourist attraction: Oopey The Clown (Arcades & Amusements; 12802 Captain Drive)., 2045=1996 Presidential Elections Results, 23639=Air Quality Index (AQI) level in 2012 was 88.8. This is about average., 19316=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 8.35. This is about average. Closest monitor was 5.7 miles away from the city center., 5390=Educational Attainment (%) in 2013, 60009=According to our research of Virginia and other state lists there were 33 registered sex offenders living in Chester, Virginia as of July 30, 2015. The ratio of number of residents in Chester to the number of sex offenders is 636 to 1. The number of registered sex offenders compared to the number of residents in this city is near the state average., 1473=2004 Presidential Elections Results, 21530=Sulfur Dioxide (SO2) [ppb] level in 2012 was 0.651. This is significantly better than average. Closest monitor was 5.7 miles away from the city center., 46677=On 8/6/1993, a category F4 (max. wind speeds 207-260 mph) tornado 9.4 miles away from the Chester place center killed 4 people and injured 246 people and caused between $5,000,000 and $50,000,000 in damages., 22994=Carbon Monoxide (CO) [ppm] level in 2012 was 0.281. This is about average. Closest monitor was 9.8 miles away from the city center., 20783=Ozone [ppb] level in 2012 was 27.4. This is about average. Closest monitor was 8.7 miles away from the city center., 901=2012 Presidential Elections Results, 18566=Lead (Pb) [µg/m3] level in 2012 was 0.00264. This is significantly better than average. Closest monitor was 9.1 miles away from the city center., 28699=Hotels: Courtyard by Marriott (2001 West Hundred Road), Hampton Inn Richmond-Chester (12610 Chestnut Hill Road), Fairfield Inn by Marriott (12400 Redwater Creek Road), Hampton Inn (12610 Chestnut Hill Road), Comfort Inn Chester (2100 West Hundred Road), Clarion Hotel Chester (2401 West Hundred Road), Holiday Inn Exp Chester (1911 West Hundred Road), Holiday Inn Express-Chester (1911 West Hundred Road), Homewood Suites by Hilton Chester- VA (12810 Old Stage Road)., 4992=School Enrollment by Level of School (%) in 2013, 22277=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 9.53. This is significantly worse than average. Closest monitor was 11.2 miles away from the city center., 1759=2000 Presidential Elections Results}",
    "TableContextTimeStampAfterTable": "{7503=7.11% of this county's 2010 resident taxpayers moved to other counties in 2011 ($44,368 average adjusted gross income), 5283=7.21% of this county's 2011 resident taxpayers lived in other counties in 2010 ($47,059 average adjusted gross income), 101395=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 100070=Total of 167 patent applications in 2008-2015.}",
    "textBeforeTable": "Religion statistics for Chester CDP (based on Chesterfield County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Wood (0%) No fuel used (1%) Bottled, tank, or LP gas (1%) Fuel oil, kerosene, etc. (5%) Utility gas (18%) Electricity (76%) Most commonly used house",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 43 Chesterfield County: 1.44 / 10,000 pop. Virginia: 2.03 / 10,000 pop. Number of supercenters and club stores: 4 This county: 0.13 / 10,000 pop. State: 0.17 / 10,000 pop. Number of convenience stores (no gas): 22 Chesterfield County: 0.74 / 10,000 pop. Virginia: 1.43 / 10,000 pop. Number of convenience stores (with gas): 107 Chesterfield County: 3.58 / 10,000 pop. State: 4.03 / 10,000 pop. Number of full-service restaurants: 180 Here: 6.02 / 10,000 pop. State: 7.65 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}