{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Security guards and police on campus at all times. They also have an office on the second floor.",
            "There is a lot to get involved in. There are boards posted all over the school that showcase different things going on.",
            "Great for students who really want to learn and meet new people. Maybe not so great if you're scared of heights.",
            "The Human Growth and Development teacher, Dr. Mallory, puts on a comedy show every year. Be sure to take his class. You learn through stories and he is so understanding and funny.",
            "For the tuition you pay, the teachers are amazing. I can't say enough about the majority of the teachers employed here.",
            "There is a comedy show put on every year and many really good plays that the students put on. It's located in Tuscaloosa, so there are a lot of options for a fun afternoon!",
            "Unfortunately, they only have one place to eat. So, if you don't like Chik Fil A, pack a lunch.",
            "There are no dorms.",
            "Most of the teachers are extremely good at what they teach and are willing to help you if you ask in advance. It is easy to learn here.",
            "Be on top of your financial aid and really get to know your teachers. There is tutoring available on campus and the staff is really willing to help.",
            "This school really does have some amazing teachers. Don't disregard it because it is a community college. It is affordable to attend this school and the teachers are great."
        ]
    ],
    "pageTitle": "Shelton State Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Shelton-State-Community-College/reviews?_escaped_fragment_=/show/54898",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00226-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892800787,
    "recordOffset": 892773315,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{43461=The Prices for classes are unbelievably awesome. 15 credit hours is around $2000 where as 4 credit hours at the University of Alabama is $2000., 14013=Shelton is only $1600 for full time you can not beat that., 98523=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/14/2011 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 25 Hannah from Lake View, AL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Am enjoying being here My teacher is very laid-back and she is there to help us and make sure we actually UNDERSTAND the material. She has plenty of resources posted to her online website that further illustrate what she teaches in class and helps to make things even more simple for us. The students here are all nice and friendly and willing to help each other which makes Shelton a comfortable learning environment. Am learning a lot At this point, I am only taking one course because I do not qualify for financial aid but I am learning more at faster pace than I ever have. I am taking Math 112-06 (Pre-calculus Algebra) and I am catching on much more quickly and easily than I did to the same material in high school and the new material does not seem as daunting. Login to rate or flag the reviews Female freshman from Northport, AL 02/17/2012 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 25",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}