{
    "relation": [
        [
            "Title",
            "Cane Toads: The Conquest",
            "Jandamarra's War",
            "Lachlan Macquarie: Father of Australia",
            "The Silent Epidemic"
        ],
        [
            "Composer",
            "Martin Armiger",
            "Ash Gibson Greig, Petris Torres",
            "Matteo Zingales",
            "Christopher Elves"
        ],
        [
            "Result [30][34]",
            "Nominated",
            "Nominated",
            "Won",
            "Nominated"
        ]
    ],
    "pageTitle": "APRA Music Awards of 2011 - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/APRA_Music_Awards_of_2011",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 852547183,
    "recordOffset": 852511347,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{2464=The Australasian Performing Right Association Awards of 2011 (generally known as APRA Awards) are a series of related awards which include the APRA Music Awards, Art Music Awards, and Screen Music Awards. The APRA Music Awards of 2011 was the 28th annual ceremony by the Australasian Performing Right Association (APRA) and the Australasian Mechanical Copyright Owners Society (AMCOS) to award outstanding achievements in contemporary songwriting, composing and publishing.[1] The ceremony was held on 21 June 2011 at CarriageWorks in Sydney, Australia. The Art Music Awards were introduced in 2011 to replace the Classical Music Awards (last held in 2009) and were distributed on 3 May. They are sponsored by APRA and the Australian Music Centre (AMC) to \"recognise achievement in the composition, performance, education and presentation of Australian music\".[2] The Screen Music Awards were issued on 14 November by APRA and Australian Guild of Screen Composers (AGSC) at the City Recital Hall, Sydney which \"acknowledges excellence and innovation in the genre of screen composition\".[3], 4700=On 26 May nominations for the APRA Music Awards were announced on multiple news sources, with John Butler Trio being the most nominated artist.[4][5][6] This ceremony was hosted by comedians Andrew Hansen and Chris Taylor. Also featured in the ceremony were cover versions of nominated works.[7] A total of 12 awards were presented.[8] Paul Kelly was honoured with the Ted Albert Award for Outstanding Services to Australian Music.[9] Angus and Julia Stone tied with Jet for the most awards won that evening, the former winning both the Songwriter of the Year and the Song of the Year awards and the latter winning Most Played Australian Work and Rock Work of the Year for their song \"Seventeen\".[7]}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "Blues & Roots Work of the Year[edit] APRA Music Awards[edit] This section is empty. You can help by adding to it. (February 2013) Performances[edit] This section is empty. You can help by adding to it. (February 2013) Presenters[edit] 6.2 References 6.1 Footnotes 6 Notes 5.12 Most Performed Screen Composer – Overseas 5.11 Most Performed Screen Composer – Australia 5.10 Best Television Theme 5.9 Best Soundtrack Album 5.8 Best Original Song Composed for the Screen 5.7 Best Music for a Television Series or Serial 5.6",
    "textAfterTable": "John Butler Family Music Nominated \"Walking\" – Ash Grunwald Ash Grunwald Mushroom Music Nominated Breakthrough Songwriter of the Year[edit] Title and/or artist Writer(s) Publisher(s) Result[8][11] \"Plans\" – Birds of Tokyo – Birds of Tokyo Anthony Jackson, Ian Kenny, Adam Spark, Adam Weston Mushroom Music Nominated Dark Storm – The Jezabels Nikolas Kaloper, Samuel Lockwood, Hayley McGlone, Heather Shannon Mushroom Music Nominated InnerSpeaker – Tame Impala Kevin Parker Sony/ATV Music Publishing Australia Nominated \"Letter\" – Get Out While You Can – Dan Sultan Dan Sultan, Scott Wilson Mushroom Music Nominated I Believe You Liar – Washington Megan Washington",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}