{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "While Taylor University is a relatively expensive college, it does provide quite a bit of financial aide and its benefits are certainly worth the investment.",
            "Taylor is located in a very small town. This does not mean there is no entertainment, but that students through the years have been forced to be creative about finding recreational activities. From pick-a-date events to on-campus parties and competitions, Taylor's students have no shortage of fun.",
            "The dining commons provides a wide variety of food. Students may mix and match meals, selecting from international foods, pasta, a Mexican bar, salads, a deli bar, and more.",
            "Dorm life varies depending on the residence hall. With intentions of drawing student closer together, dorms sponsor events such as wing retreats, brother/sister floor dates, floor dinners, and dorm open houses. Floormates generally get along well, with rules designed to help students respect each other while enjoying each others' company and living as responsible, independent adults.",
            "Taylor's programs are rigorous and include quite a lot of general education, but the professors are eager for students to succeed and willing to put in time and attention to help. Because of Taylor's focus on holistic education, students are exposed to a wide range of academic studies and are expected to put in the effort to learn the material. The major programs force students to work hard to learn the material but well prepare students for their chosen careers.",
            "Meet with your prospective major and minor department faculty. They can answer your questions and explain requirements, as well as helping come up with creative solutions to make your college experience personally suited to you. Be ready to step out of your personal comfort zone. Besides focusing on interpersonal relationships on campus, Taylor is deeply committed to reaching out to the community and the world.",
            "Taylor is an incredible college where professors and faculty care personally about their students, and excellence is a goal in every endeavor. With a focus on intentional community and relationships, students are encouraged to get to know each other and support each other as well as succeeding in the classroom. Each major has a wide variety of training in and out of the classroom, ranging from lectures to practicums to study abroad opportunities."
        ]
    ],
    "pageTitle": "Taylor University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Taylor-University/reviews?_escaped_fragment_=/show/91233",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00275-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 885593851,
    "recordOffset": 885542598,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{91331=Taylor is a good match for any student that wants a good education and wants experience before they graduate from college. If you want to be educated well before you get into the work force Taylor is definitely a good place to be. Elementary education is definitely one of the more common majors at Taylor, but there are also a lot of pre-med students and a very good new science building that will be open Fall 2012., 216916=© 2015, Cappex.com, LLC, 75194=Since its founding in 1846, Taylor University has been an outstanding institution for learning and growing. It is unlike any other college experience I have had. Taylor University isn't someplace you can describe, it must be experienced., 204777=Silent night. So much fun. Everyone dresses up crazy and attends a basketball game the first weekend in December. At the beginning of the game, everyone is silent until the 10th point is scored. Then everyone breaks out into loud cheering and it is crazy. At the end of the game, everyone holds hands and sings silent night. After the game, students head over to the dining commons for cookies, games, and the Christmas story read by the President and first lady., 47337=dress warm for winter and pack big boots! january gets cold with blowing winds. fall and spring rain is craaaazy., 169671=Pick a dates, where you go on a big group date and ask someone to go with you. Silent Night is a huge basketball game in December right before finals where no one says anything until the 10th point is scored, and then everyone goes wild, Taylathon is an extremely competitive bike race that happens each year, and Airband/Nostalgia Night/My Gen are all musical shows that the students perform (intended for humor).}",
    "textBeforeTable": "08/06/2009 Reviewer is A current student here. 20 out of 20 people found this review useful. 1 of 44 Heidi from Upland, IN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Categories Comments Great for these types of students Taylor is an excellent school for Christian students looking to push themselves academically and spiritually. No matter your walk of life, there is something for everyone at Taylor. It's not a bunch of rich 'perfect' Christian people. They are people like you who make mistakes and are trying to have the best college experience they can! Tips for prospective students One of the best tips to pick up on quickly is to talk to students when you visit. Find out about daily life at the school. What is the typical life of living in ---- Hall? What types of clubs and organizations can I get involved with? Are classes hard? What's your favorite thing about Taylor? What's your least favorite thing about Taylor? Don't be afraid to ask questions! People will gladly open up to you about living at Taylor. My second tip is this: don't be afraid to talk to professors about a major you are interested in. Be sure to get as much information as you can about the major before you decide on it! Acknowledge there will be parts about every major that you will like and you will dislike. Bang for the buck A discouraging aspect about Taylor is how expensive it is. However, I feel",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}