{
    "relation": [
        [
            "Skill Name",
            "Expert",
            "Swimming",
            "Eating",
            "Recovery Speed"
        ],
        [
            "Skill Points",
            "+12",
            "+10",
            "+10",
            "-10"
        ],
        [
            "Active Skill",
            "Critical Eye +1",
            "Olympic Swimmer",
            "Speed Eating +1",
            "Recovery Speed -1"
        ]
    ],
    "pageTitle": "Armor - Monster Hunter 3 Ultimate Wiki Guide - IGN",
    "title": "",
    "url": "http://www.ign.com/wikis/monster-hunter-3-ultimate/Armor",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 514366559,
    "recordOffset": 514341041,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{318639=Copyright 1996-2015 Ziff Davis, LLC An IGN Entertainment Games site}",
    "textBeforeTable": "Slots: 2 single Base Defense: 1 Leather Slots: Many armors have open slots in which you can set a decoration to add more skill points to a particular Armor Skill. Some armor pieces can have double or even triple open slots so we'll tell you how many of each.  For example: \"Slots: 2 single, 1 double\" means two of the pieces have single slots and one piece has a double slot. Base Defense: Each armor set has a Base Defense. This can be improved by upgrading the individual armor pieces with Armor Spheres.  Armor sets that have the same skills for its Blademaster and Gunner versions will denote the difference in Base Defense with a fraction.  For example: \"Base Defense: 16/8\" means the Blademaster set has a Base Defense of 16 and the Gunner set has a Base Defense of 8. As you grow as a hunter, it is vital to your success that your armor grows with you. Your defense is only as high as the armor you're wearing so make sure to upgrade your old armor and forge new armor sets when possible to ensure you have maximum protection from the monsters you're gonna be hunting. Having more armor sets allows you to tailor your equipment for a hunt to compensate for each sets elemental weaknesses. Also keep in mind that all armor sets have certain skills that can",
    "textAfterTable": "Note: Can not be crafted. Can only be purchased in Tanzia Port. Skill Name Skill Points Active Skill Wide-Range +10 Wide Range +1 Sense +10 Sneak Protection +10 Divine Blessing Piscine Base Defense: 3 Slots: 1 single Skill Name Skill Points Active Skill Current Resistance +10 Current Resistance (Lo) Swimming +10 Olympic Swimmer",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}