{
    "relation": [
        [
            "Patent application number",
            "20110206662",
            "20140178371"
        ],
        [
            "Description",
            "ANTI-ANGIOGENESIS THERAPY FOR THE TREATMENT OF OVARIAN CANCER - This invention concerns in general treatment of diseases and pathological conditions with anti-VEGF antibodies. More specifically, the invention concerns the treatment of human patients susceptible to or diagnosed with cancer using an anti-VEGF antibody, preferably in combination with one or more additional anti-tumor therapeutic agents for the treatment of ovarian cancer.",
            "ANTI-ANGIOGENESIS THERAPY FOR THE TREATMENT OF OVARIAN CANCER - This invention concerns in general treatment of diseases and pathological conditions with anti-VEGF antibodies. More specifically, the invention concerns the treatment of human patients susceptible to or diagnosed with cancer using an anti-VEGF antibody, preferably in combination with one or more additional anti-tumor therapeutic agents for the treatment of ovarian cancer."
        ],
        [
            "Published",
            "08-25-2011",
            "06-26-2014"
        ]
    ],
    "pageTitle": "Cornelia - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/cornelia-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00005-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440504439,
    "recordOffset": 440473120,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Cornelia Irl, Basel CH 12-16-2010 COMPOSITIONS AND METHODS FOR TREATMENT OF ANGIOGENESIS IN PATHOLOGICAL LESIONS - Treatment of lesions of pathological angiogenesis, especially tumors, rheumatoid arthritis, diabetic retinopathy, age-related muscular degeneration, and angiomas. A conjugate is used comprising a molecule that exerts a biocidal or cytotoxic effect on target cells in the lesions and an antibody directed against an extracellular matrix component which is present in such lesions. The antibody may be directed against fibronectin-2 (IL-2), doxorubicin, interleukin-12 (IL-12), Interferon-γ (IFN-γ), Tumor Necrosis Factor α (TNFα) or Tissue Factor protein (which may be truncated). 20100316602 02-05-2009 CONJUGATE FOR TARGETING OF DRUG - Conjugate for targeting therapeutic or diagnostic agent or drug to cells or tissues in a body, e.g. areas of neoplastic growth or angiogenesis. Use of conjugate for in vivo diagnosis or therapy e.g. inhibiting tumour growth or metastasis, inhibiting angiogenesis and/or treating cancer. Conjugate comprises therapeutic or diagnostic agent as oligomeric protein e.g. heterodimeric protein, wherein first and second subunits of protein are each conjugated to a specific binding member e.g. an antibody fragment such as scFv. Subunits of oligomer may be conjugated to specific binding members as fusion proteins. Conjugate may comprise IL-12 heterodimer having two subunits, each subunit fused to scFv L19 or TN11 for targeting IL-12 to extracellular matrix components associated with neoplastic growth and angiogenesis. 20090035255 Published Description Patent application number Cornelia Halin, Zurich CH 02-25-2010",
    "textAfterTable": "Cornelia Kluin, Dusseldorf DE Patent application number Description Published 20100184121 Removal of by-products from crosslinkable preparations - The present invention relates to the use of enzymes and/or whole-cell catalysts for the removal of undesired by-products from crosslinkable preparations. 07-22-2010 Cornelia Kruse-Müller, Edewecht DE Patent application number Description Published 20100136519 Determination of a specific immunoglobulin using multiple antigens - The invention concerns a process for the immunological determination of a specific antibody in a fluid sample. The process involves incubating the fluid sample in the presence of a solid phase with two antigens directed against the antibody whose presence is to be determined; the first antigen carries at least one marker group, while the second is either (a) bonded to the solid phase or (b) present in a form in which it can bond with the solid phase, and betrays the presence of the antibody being sought by showing the presence of the marker group in the solid phase and/or in the fluid phase. The proposed process is characterised by the fact that at least one of the two antigens has several epitopic regions which react with the antibody to be determined. 06-03-2010 Cornelia Kruse-Müller, Edewecht DE Patent application number Description Published 20100136519 Determination of a specific immunoglobulin using multiple antigens - The invention concerns a process for the immunological",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}