{
    "relation": [
        [
            "Field renamed",
            "Changed definition",
            "Renamed and redefined subfield"
        ],
        [
            "",
            "",
            "‡a"
        ],
        [
            "Associated group. Formerly, Affiliation.",
            "Information about a group, institution, association, etc., that is associated with the entity in the 1xx fields. This can also be a group with which a person is or has been affiliated, including dates of affiliation. The field is repeated if the person has multiple affiliations for different time periods.",
            "Associated group. Formerly, Affiliation. A group that is associated with the entity in the 1xx or with which the entity is affiliated or has been affiliated through employment, membership, cultural identity, etc."
        ]
    ],
    "pageTitle": "Technical Bulletin 261: OCLC-MARC Format Update 2012",
    "title": "",
    "url": "http://www.oclc.org/support/services/worldcat/documentation/tb/261.en.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00112-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 624386595,
    "recordOffset": 624365742,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3897=New fields, subfields, and indicators: These may be used in both Connexion interfaces when announced by OCLC in May 2012, with the following exception:, 1937=Hours: 7:00 am–9:00 pm U.S. Eastern time, Monday through Friday, 4226=New searching and indexing capabilities: All new searching and indexing capabilities can be used in both Connexion interfaces (client and browser) when announced by OCLC in May 2012., 2455=New codes: These may be used in both Connexion interfaces when announced by OCLC in May 2012. New Country Codes have been added to the Connexion client 2.40 Ctry fixed field dropdown., 4634=May 2012, unless otherwise noted. Installations of this OCLC-MARC Update may occur in stages, which OCLC will announce via logon Messages of the Day, Connexion News, and the OCLC-CAT listserv.}",
    "TableContextTimeStampAfterTable": "{105080=© 2015 OCLC Domestic and international trademarks and/or service marks of OCLC Online Computer Library Center, Inc. and its affiliates}",
    "lastModified": "Fri, 31 Jul 2015 09:24:51 GMT",
    "textBeforeTable": "DtSt Type of Date/Publication Status (008/06) Yes Yes Yes Yes Yes Uncontrolled Related/Analytical Title 740 Yes Yes Yes Yes Yes Varying Form of Title 246 Credit for edit Credit for add Edit if present Add field if present Add field if not present Field description Field tag The fields below are now available for database enrichment. For the full list of database enrichment fields, see Bibliographic Formats and Standards, 5.3 Database Enrichment. Fields added to Database Enrichment Database enrichment changes 1 Bibliographic Record Changes Throughout the technical bulletin, R = Repeatable and NR = Nonrepeatable. The blank character may be represented as . Conventions Authorities: Formats and Indexes, Bibliographic Formats and Standards, Connexion browser Help, Connexion client Help, OCLC-MARC Records, and Searching WorldCat Indexes. Documentation affected E-mail: support@oclc.org International: 1-614-793-8682 USA: 1-800-848-5800 Hours: 7:00 am–9:00 pm U.S. Eastern time, Monday through Friday Contact OCLC for support in English, Spanish and Portuguese. Support OCLC will convert data to its appropriate new format to the extent that is possible. Database scans New codes: These may be used in both Connexion interfaces when announced",
    "textAfterTable": "Changed definition for VIS format   Text below added to definition. For visual materials, coding depends on the type of material. For moving image materials, the language content is defined as the sound track, the accompanying sound, or sign language. For moving image materials with no sound or sign language content or, if with sound, no narration, use zxx (no linguistic content). For filmstrips and slides, code for the text on the film, the accompanying sound or the accompanying printed script (for works with no sound or, if with sound, no narration). For all other still images, including original or historical graphic material and opaque and non-opaque graphic material, and three-dimensional materials, the language content is that associated with the material, i.e., captions or other text associated with the item or collection that are part of the chief source of information. 034 Coded Cartographic Mathematical Data (R) New subfield ‡0 Authority Record Control Number or Standard Number (R) Subfield ‡0 contains the system control number of the related authority record, or a standard identifier such as an International Standard Name Identifier (ISNI). The control number or identifier",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}