{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Security is always around, its kind of annoying sometimes...",
            "there is no greek life here.",
            "The social, friendly, outgoing person will fit in good here. Most people tend to find friends of their own major and things work best like that.",
            "The campus is literally all over the city. SCAD owns like half of Savannah, its crazy!",
            "Its expensive. I'm not going to lie. I don't know if I'll still be able to go next year, depending on what scholarships I get...",
            "Go to the pool, walk around downtown Savannah with friends. Eat! Do artsy things with artsy people.",
            "They recently remodeled their SCAD Cafe, and it's now called the Hive. The food is AMAZING. Its buffet style, so you pay when you entire, and you can eat til your hearts content! They have everything ranging from pastas, to the salad bar, to fish, to burgers. Everything changes day to day, so always expect something amazing there. They have a fro-yo machine as well, and a bunch of delicious desserts to chose from. It's also vegetarian and vegan friendly. All their meat is cagefree and grass fed beef.",
            "You're basically living in a motel freshman year. You can't keep your dorm room open because if you do that, you're outside then and the heat and bugs come in. Leave your dehumidifier on, ALWAYS, along with the A/C. Dyson and Turner Annex have pools so thats nice. Oh each dorm has their own bathroom so thats really good too. The dorms are spacious and you can fit a ton of stuff in them, might be hard to put things on the walls but most students find ways.",
            "Depends on your classes, but freshman year with the foundation courses, it should be fairly simple. Classes are 2 and a half hour long, so take that into consideration. Teachers then expects hours of work to be put in outside of class and then materials can start adding up to costs over $20 a project...",
            "Look for scholarships. ALWAYS be looking for scholarships, because this school is expensive.",
            "the students are nice there, the teachers are very informative and helpful. The campus is all over the city of Savannah, so getting to places might be difficult if the buses are late."
        ]
    ],
    "pageTitle": "Savannah College of Art and Design (SCAD) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Savannah-College-of-Art-and-Design/reviews?_escaped_fragment_=/show/90487",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00293-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897472847,
    "recordOffset": 897290490,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{679714=Bring appropriate clothes. Savannah is very warm. It's January right now, and the lowest 57 degrees. Also, work hard. You will surely flunk out if you slack on your work., 1008370=© 2015, Cappex.com, LLC, 665532=The dorm got broken into and robbed at 6am the first week of the fall quarter in 2012. SCAD tried to cover it up, and none of our parents knew about it. But it was all over the news; unfortunately local news only. And nothing happens to the security guards who are always sleeping. My friend forgot her ID and flashed up a Pokemon card and was allowed access into the dorm., 29011=SCAD is an absolutely amazing school but just make sure you get more scholarships than the ones they provide. The grading there is a B- or B+ is the same as a B and a 3.5 G.P.A. is an average of an A (this is what you'll usually have to maintain to keep the scholarships they give to you. Basically be careful, it's hard to keep your grades in this category and they're sneaky and you don't find out what your grades are really going to have to be before you go there. Again, go to community college first, get the easy stuff over with. I can't imagine getting the things like english and math over while I'm there. It's the quarter system (you have three quarters/semesters in a year (fall quarter goes from September to November, Winter is January to March and Spring is from March to June.)) Everything is really fast paced and intense so you'd be better of going somewhere else first and transferring. SCAD is usually really good about how things transfer and you'll be more likely to get good scholarships that way as well., 254795=I visited the Atlanta campus back in January and it was beautiful. Unfortunately we were not able to view the freshmen dorms. Hopefully I will be able to view those soon., 36939=Savannah is truly the City of Hospitality. It is a beautiful, quaint town, with all the charm and allure of a big city. Broughton Street has every place you could hope to shop (and more!), and exploring the many side streets and lovely squares will yield hidden antique shops and thrift stores, perfect for rummaging through for the next art project. If you don't enjoy the heat, don't worry! Savannah cools off around November, and it's like most temperate places' autumn. The sunsets are glorious., 933985=These aren't really any traditions but usually Fall quarter students seem to have a lot more fun, and it's usually the time when students tend to slack off quite a bit. After winter break everyone's typically pretty calmed down and focused on their school and just trying to finish out the year. But for an FYI, most SCAD kids live in the apartment complex right next door to school- 1660 Apartments.}",
    "textBeforeTable": "07/25/2009 Reviewer is A current student here. 77 out of 77 people found this review useful. 1 of 218 Julia from Evans, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. Savannah College of Art and Design Reviews Savannah College of Art and Design › Georgia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am enjoying being here It is a wonderful environment, all of the new people you meet are amazing and SCAD offers so much to do, a lot of clubs and events. Am learning a lot The teachers are awesome, they really know what they are doing and really want to help you learn. I have learned so much already and am only in my first year, they have the best equipment and cover so much information. Login to rate or flag the reviews Sebastien from Hinesville, GA 12/23/2009 Reviewer is A current student here. 32 out of 32 people found this review useful. 3 of 218 Categories Comments Great for these types of students Anyone who has the money to attend first of all. I wouldn't have gone to SCAD if I didn't have to financial aid to back me up. If this is a problem and you really want to go to SCAD, I recommend transferring like",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}