{
    "relation": [
        [
            "",
            "Certainly Support",
            "Support",
            "Oppose",
            "Certainly Oppose",
            "No opinion"
        ],
        [
            "Total",
            "4.2%",
            "31.1%",
            "42.1%",
            "16.1%",
            "6.6%"
        ],
        [
            "West Bank",
            "3.7%",
            "34.2%",
            "45.8%",
            "11.9%",
            "4.4%"
        ],
        [
            "Gaza Strip",
            "4.9%",
            "25.9%",
            "35.9%",
            "23.0%",
            "10.2%"
        ]
    ],
    "pageTitle": "Palestinian Opinion on Peace Prospects | Jewish Virtual Library",
    "title": "",
    "url": "http://www.jewishvirtuallibrary.org/jsource/Society_&_Culture/palpopeace.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 533361842,
    "recordOffset": 533346218,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{116035=Do you think that the USA and the European countries have a duplicity of standards when they support the demands of the popular revolutions in the Arab countries and do not support similar Palestinian demands? (Al-Najah poll, October 17, 2011), 107783=Do you think the USA is an impartial broker in the peace process between the PA and Israel? (Al-Najah poll, October 17, 2011), 82333=There is a proposal that after the establishment of an independent Palestinian state and the settlement of all issues in dispute, including the refugees and Jerusalem issues, there will be a mutual recognition of Israel as the state of the Jewish people and Palestine as the state of the Palestinians people. Do you agree or disagree to this proposal? (PSR, March 17, 2012), 8955=Do you think that in the near future a new war will break out between Israel and Hamas in the Gaza Strip?             (IMRA, March 31, 2015), 45663=Do you agree or disagree that recent efforts by President Obama demonstrate that the U.S. is more serious than ever about mediating a solution to the Palestinian-Israeli conflict that is mutually acceptable?              (Gallup, July 26, 2013), 128304=Do you believe that the American government is a neutral party in the negotiations between Palestinians and Israelis? (AWRAD, October 13, 2011), 52821=Do you think the President Abbas' decision to participate in exploratory talks with Israel was right or wrong?                (PSR, March 17, 2012), 69890=Now more than 40 years after the Israeli occupation of the West Bank and the Gaza Strip, what in your view are the chances for the establishment of an independent Palestinian state next to the state of Israel in the next five years? Are they high, medium, low, or non existent? (PSR, March 17, 2012), 120265=Do you personally support or oppose a two-state solution (Israel and Palestine - in the West Bank including East Jerusalem)? (AWRAD, October 13, 2011), 117993=Do you support or reject the rise of an armed uprising (intifada)? (Al-Najah poll, October 17, 2011), 103505=Now that negotiations between Palestinians and Israelis have stopped, would you support or oppose the following option in the search for achieving Palestinian rights: return to armed intifada and confrontations? (PSR, January 11, 2012), 78999=According to the Saudi plan, Israel will retreat from all territories occupied in 1967 including Gaza the West Bank, Jerusalem and the Golan Heights, and a Palestinian state will be established. The refugees problem will be resolved through negotiation in a just and agreed upon manner and in accordance with UN resolution 194 which allows return of refugees to Israel and compensation. In return, all Arab states will recognize Israel and its right to secure borders, will sign peace treaties with her and establish normal diplomatic relations. Do you agree or disagree to this plan? (PSR, March 17, 2012), 72898=To what extent are you worried or not worried that you or a member of your family could be hurt by Israel in your daily life or that your land would be confiscated or home demolished? (PSR, March 17, 2012), 23337=How would you evaluate the role Benjamin Netanyahu played, and still plays, in the Israeli-Palestinian peace process ? Was his role constructive or non-constructive?              (PCPO, February 10, 2015), 63290=Some believe that the two-state solution, an independent Palestinian state alongside the state of Israel, is no longer viable due to settlement expansion while others believe that it is still viable today as settlements can be dismantled or evacuated when an agreement is reached. What do you think? (PSR, March 17, 2012), 10721=Do you consider yourself an optimist or a pessimist in reference to reaching a peace agreement with Israel?             (IMRA, March 31, 2015), 135215=Copyright © 2015 American-Israeli Cooperative Enterprise; New Site Design: Elie Berman, 114057=Do you support or reject holding talks between the PA and the Israeli government if Israel continues its settlement activities in the West Bank? (Al-Najah poll, October 17, 2011), 28291=Do you believe that the German government is actively helping Israel \"behind the scenes\"?              (PCPSR, January 19, 2015), 119338=Do you support or reject the rise of nonviolence and unarmed popular resistance? (Al-Najah poll, October 17, 2011), 111753=If a Palestinian State is recognized in the UN, how will this recognition influence negotiations on the issue of Jerusalem? (Al-Najah poll, October 17, 2011), 66667=Talk has recently increased about the inevitable failure of the two state solution and the need to demand the formulation of a solution based on the establishment of one state in all Palestinian areas and Israel, one in which Arabs and Jews enjoy equality. Do you support or oppose this view? (PSR, March 17, 2012), 59620=What do you expect to happen between Palestinians and Israelis after the exploratory talks in Amman have stopped?                (PSR, March 17, 2012), 36893=Do you think that a permanent peace between Israel and Palestine will ever be achieved?              (Gallup, July 31, 2013), 12502=Do you expect the United States to exert pressure on Israel to return to the negotiating table and accept a two-state solution?             (IMRA, March 31, 2015), 19830=Are you in favor of a two-state solution to the conflict?              (PCPSR, March 25, 2015), 126493=In your opinion, which of the following is the best means to end the occupation and establish a Palestinian state? (AWRAD, October 13, 2011), 16200=After Netanyahu and the Likud victory during the recent Israeli elections, do you expect a return to the negotiation table?             (IMRA, March 31, 2015), 117080=Do you expect an erruption of a third intifada in the Palestinian Territories? (Al-Najah poll, October 17, 2011), 122161=Do you believe that the following parties are serious about peace negotiations leading to the establishment of an independent Palestine? (AWRAD, October 13, 2011), 56138=Given present conditions, do you support or oppose resumption of the Amman exploratory talks without Israeli preconditions?                (PSR, March 17, 2012), 47289=How much trust do you have in President Obama to help Israel and Palestine negotiate an equally fair peace treaty?              (Gallup, July 26, 2013), 101933=There is a proposal that after the establishment of an independent Palestinian state and the settlement of all issues in dispute, including the refugees and Jerusalem issues, there will be a mutual recognition of Israel as the state of the Jewish people and Palestine as the state of the Palestinian people. Do you agree or disagree with this proposal? (PSR, January 11, 2012), 33642=Will the majority of Palestinians vote in favor of a peace agreement reached between Abbas and Israel in the current negotiations?              (Palestinian Center for Public Opinion, March 22, 2014), 104935=Do you think that the USA will pursue every possible way that is within its reach to salvage the peace process? (Al-Najah poll, October 17, 2011), 30063=Do you believe that Germany is an \"honest broker\" between Israelis and Palestinians?              (PCPSR, January 19, 2015), 109651=Do you think that the International Quartet is an impartial broker in the peace process between the PA and Israel? (Al-Najah poll, October 17, 2011), 17981=In your opinion, what is the most effective means of ending the occupation and building a Palestinian state next to Israel?              (PCPSR, March 25, 2015), 31841=Do you believe that the German government is committed to working towards a lasting peace between the Israelis and Palestinians?              (PCPSR, January 19, 2015), 25820=How would you evaluate the role the US played, and still plays, in the Israeli-Palestinian peace process ? Was its role constructive or non-constructive?              (PCPO, February 10, 2015), 14287=After Netanyahu declared during the recent Israeli elections that he does not support a solution based on the creation of a Palestinian state alongside Israel, do you support or reject a return to the negotiation table?             (IMRA, March 31, 2015), 35180=Should the negotiations continue?              (Palestinian Center for Public Opinion, December 15, 2013), 105881=Do you think that the Palestinian State can only be established through negotiations? (Al-Najah poll, October 17, 2011), 108709=Do you think that the European Union is an impartial broker in the peace process between the PA and Israel? (Al-Najah poll, October 17, 2011), 6363=If the Palestinian leadership is able to negotiate a 2-state solution with Israel, do you think that...?             (The Washington Institute, July 2015), 130513=Do you have more or less hope for the peace process now compared to one year ago? (AWRAD, October 13, 2011), 85436=Now that negotiations between Palestinians and Israelis have stopped, would you support or oppose the following option in the search for achieving Palestinian rights? (PSR, March 17, 2012), 131423=20 years agter the negotiations started, do you feel that Palestinians are closer or farther from achieving their goal of establishing a Palestinian state? (AWRAD, October 13, 2011), 49121=For the following actions, please say if this should be considered a precondition to negotiations or a top priority during negotiations?              (Gallup, July 26, 2013), 115065=Do you think that it is possible to reach a lasting solution for the Palestinian Israeli conflict in view of the current circumstances? (Al-Najah poll, October 17, 2011), 112906=If a Palestinian State is recognized in the UN, how will this recognition influence negotiations on the issue of borders? (Al-Najah poll, October 17, 2011), 110601=If a Palestinian State is recognized in the UN, how will this recognition influence negotiations on the issue of refugees? (Al-Najah poll, October 17, 2011), 125349=Do you support a return to the negotiations between Palestinians and Israel at this time? (AWRAD, October 13, 2011), 40616=How important is achieving peace between Israel and the Palestinians to the following?             (Gallup, July 31, 2013) Numbers reflect percentage of Palestinians saying \"very important\", 106801=Do you think that there will be any use from negotiations without acceptable frames of reference and without the freezing of settlement activities? (Al-Najah poll, October 17, 2011), 21353=Given the outcome of the 2015 Israeli election, do you support a return to peace negotiations with Israel?              (PCPSR, March 25, 2015), 75836=What do you think are the aspirations of Israel for the long run? (PSR, March 17, 2012), 129419=In general, do you believe that President Obama is capable of establishing a Palestinian state? (AWRAD, October 13, 2011)}",
    "textBeforeTable": "Do you agree or disagree that recent efforts by President Obama demonstrate that the U.S. is more serious than ever about mediating a solution to the Palestinian-Israeli conflict that is mutually acceptable?              (Gallup, July 26, 2013) 79% 77% 74% 76% 70% International respect for Palestine 78% 82% 78% 83% 77% Economic prosperity in Palestine 80% 83% 77% 82% 78% Safety & security of Palestinians 85% 85% 77% 80% 75% Future facing you & your family 2013 2012",
    "textAfterTable": "Palestine Recognizes Israel as Jewish State 5% 52% Palestine Gives up \"Right of Return\" 6% 53% Palestine Agrees to not pursue Israel at ICC 9% 58% Israel Freezes All West Bank Settlement Construction 86% 95% Israel Commits 1967 Borders as Basis for Two-State Solution 80% 95% Israel Releases Palestinian Prisoners 93% 99% Do you think the President Abbas' decision to participate in exploratory talks with Israel was right or wrong?                (PSR, March 17, 2012)   Total West Bank Gaza Strip Certainly right 4.9% 3.1% 7.9% Right 43.2% 49.1% 33.6%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}