{
    "relation": [
        [
            "Payment method",
            "",
            "Visa/MasterCard, Amex, Discover"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/PULSATING-3157-RED-LED-TAILLIGHT-BULB-FOR-2003-2012-HARLEY-BIG-TWIN-MODELS-/360899330314?pt=Motorcycles_Parts_Accessories&hash=item540746c10a",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00064-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 423580579,
    "recordOffset": 423539740,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details Please contact us as soon as possible if you want to return a product due to shipping damage and/or any other type of issue. Please make sure to keep the original packaging the product came in!!!! Choppers Cycle stands 100% behind our customers and we will work with you to overcome any and all problems! Please note that when ordering online, it is the buyer's responsibility to know their motorcycle and to make 100% sure of the fitment of parts / accessories you purchase. Please verify from the manufacturers labeling and installation instructions that you have the correct part before installing!! If you are not sure, please contact us and we will be happy to assist you!! Buyer Satisfaction is provided by: All returns accepted with return authorization via email. Buyer should contact us within 14 Days after receiving the item. Refund given as Money Back via Paypal. Return shipping will be paid by buyer. Restocking fee may not be charged if item can be resold as \"new\" with all original packaging. With the exception of Windshield purchases!! Installed or used parts will not be accepted as returned except for in the case of manufacturer defects. RMA AUTHORIZATION PROCEDURE: Please email us with all",
    "textAfterTable": "time left Current bid amount + Shipping amount Bid Count time left current bid + shipping bids Approximately: Current bid amount Approximately: + Shipping amount Approximately: Import charges:",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}