{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "on campus police and security and its numerous phone stations around campus makes pomona a very safe area",
            "clubs, and inter mural sports",
            "not your cheap type of food or just fast food, great cooking.",
            "rooms itself is not the best, but the people definitely make up for this.",
            "be on top of your game",
            "don't be afraid of walking up to people and making friends, and don't be afraid to ask help either.",
            "friendly people and enjoyable atmosphere. liberating but close knit community. everyone is helpful, smart and talented."
        ]
    ],
    "pageTitle": "California State Polytechnic University-Pomona (Cal Poly Pomona) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/California-State-Polytechnic-University-Pomona/reviews?_escaped_fragment_=/show/21994",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00067-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899850907,
    "recordOffset": 899693088,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{178558=I am an African American, and being here made me realize that I am really one of less than 1000 Black students attending this school. It was a major culture shock to see no one in my class look like me, and it is still something I am not used to yet. My advice for other Black students would be to find other black students on campus. Everyone is in the same situation you are in so you don't have to feel alone. Don't only hang out with your specific race, but make sure you can count on them to understand how you're feeling., 322749=Dorm doesn't cost as much as other universities. Can even live in a single dorm for 12000 bucks a year. Also there are buses and shuttles if you don't have a car. And there is many places to see and love., 174124=If you commute, it's roughly $2000 per quarter, and if you dorm, roughly $5000. That's really good, considering that there are so many other schools that are much more expensive, but have the same quality of education. Cal Poly churns out brilliant students and many of them do get hired in their industry because this school has so many great programs. So a top-notch quality education, with a high guarantee for being hired because of the great programs, at only $2000-5000? Why not?, 826105=In comparison to UCs and Out of State Schools the Cal-State Tuition is Very well priced. I'm a commuter, so I don't pay for rent or dorms making my tuition especially low. I think I pay right around $2000 a quarter for Tuition, which comes out to about $6000 a year if you don't do Summer Session. Summer classes tend to be Very expensive because the government doesn't fund us well for Summer Classes. Books are reasonable, if you rent. Rent from anyone, Amazon, Chegg you name it. It's always cheaper than the on campus Book Store. Personally I'm not a believer in the big-name college. So just in general, I'd like to think I'm getting the same education that my friends that are going to UC's are, but at a cheaper price. Also CPP is California PolyTECHnic University at Pomona, which means we're all about hands-on education. For example, as a Hospitality Major one of my classes is working at the on campus restaurant or hotel for a quarter. I'm also required to have 800+ hours of Professional Work Experience in order to get my degree. Cal Poly also hosts job fairs, their own Career Center and an online job board to help you with your resume or set you up with different job opportunities. So if you look at it that way, I think we're just as good as any UC. It's also not about What school you go to it's about what you Do there... That's the big idea., 135358=Though Pomona isn't the safest city in the area ironically I feel really safe on campus. Taking a night class for the first time and getting out between 9:00-9:30 pm I was shocked to see how many students were still on campus. The great thing about having classes after 5:30 pm is that students are able to park in the faculty parking lots which is much closer to the classrooms making it much safer for the students., 702814=Poly Nights, clubs, campus sports, game rooms and looking forward to the 3 level recreation center which will be completed in 2014. Also the Rose Bowl Float is a big event on campus., 665296=Tuition has been steadily rising since I have been enrolled in Cal Poly Pomona and my friend, a junior, has told me that the total tuition for one quarter used to be less than $1000 when he was a freshman...whereas now it is over $2000. Lots of services are included in tuition fees, such as access to the wellness center, but most students don't take advantage of such services anyway. The only consolation for blowing away all of one's money on expensive textbooks, tuition, parking permits, etc. is that the money is going into a college degree., 884390=© 2015, Cappex.com, LLC, 84694=It really is money efficient, tuition is about 2200 for a full time quarter but you take as many classes as you want to (within limits of 20 credits). So you can get done fast and efficiently., 760121=The Bronco Student Center is meant for students to relax and enjoy in between class. This is where our gym is located along with our games room and study rooms as well. There is also about 4 different food places. Opening in Fall 2014 we will have a recreational center that will several other things to do for fun on campus.}",
    "textBeforeTable": "01/17/2010 Reviewer is A current student here. 19 out of 19 people found this review useful. 1 of 203 Beau from Napa, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Categories Comments Great for these types of students For any student willing to put a bit of their time and effort to have a joyful college experience, studying their favorite career and meeting all sorts of people in a beautiful environment. Especially those always looking to thrive in life. Tips for prospective students If you know the college you really want to go to, get involved right now. It is never to early. I advise you to look out for the programs like Upward Bound and apply for EOP if you can, it will help you a lot. Find out about this college as much as you can through their website- csupomona.edu Will enjoy being here I am already really comfortable with the school since I was and am part of their Upward Bound program, and I already feel like a student there because I'm so familiar with people there and with some friends who are going to join me. Will learn a lot I have a hunger for what I want to learn and I believe Cal Poly will feed me properly as long as I put my part. Login to rate or flag",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}