{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is small and I feel safe walking around at all hours. However, if you do not you can always call campus security and get an escort around campus.",
            "There are a plethora of clubs to get involved in on campus. These range from the usual clubs on campuses like Biochemistry club or Spanish club to the more bizarre clubs like the Beekeeping club.",
            "Because of its origin from the Benedictine values, where bold hospitality is always expected, I think that anyone will fit in at Scholastica.",
            "I always love hiking around in the 200+ acres of woods in the back of campus. Especially while in the valley of silence, you just feel like you are in the middle of nowhere and not in the middle of Duluth.",
            "There are a lot of options you could take for fun. You can get involved in different clubs, go watch sports games (the hockey games at Mars Arena are always a blast), or go to various activities on campus. There are often movies, plays, or concerts going on in the Mitchell Auditorium. If you want to get off campus you can just take the bus downtown or to the mall and wander around Canal Park and find stuff to do there.",
            "The food is usually pretty good, but this summer (2014) they are doing a complete overhaul of the food services so it should get even better.",
            "The dorms are fun. You are close to food, the gym, and classes. Plus, there is always something fun going on somewhere in Somers.",
            "Classes can be challenging, especially for nursing and pre-med majors, but they will push you to discover your true potential. Plus, if you do not understand something professors are very flexible about meeting with you and getting you to understand.",
            "If you come here make sure you get involved. College is ultimately what you decide make it. There are a ton of clubs and organizations to get involved in here, and the organizations are one of the things that will truly define your college experience.",
            "The College of Saint Scholastica is a very warm and welcoming community that is steeped in the Benedictine heritage from which it was founded. It has small class sizes and is a small campus, so you get to know your classmates and professors very well. When you come here, you truly feel like you are at home and that you belong."
        ]
    ],
    "pageTitle": "The College of Saint Scholastica Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-College-of-Saint-Scholastica/reviews?_escaped_fragment_=/show/55462",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903735247,
    "recordOffset": 903686203,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{135002=St Cloud Post Baccalaureate Nursing Program, 0 out of 10, F. This a new program and they have failed to work out the kinks or deliver effective education to nursing students. Half of the students in this program failed their final test out exam and had to go through remediation in 2011., 197107=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/21/2009 Reviewer is A current student here. 10 out of 10 people found this review useful. 1 of 39 Krystal from Scandia, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. The College of Saint Scholastica Reviews The College of Saint Scholastica › Minnesota › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck Sure its expensive, but I feel the education we are receiving is definitely worth it. Theres a sense of safety, security and pride when you go to CSS. You know you are paying for a brighter and more successful future being there... its not like you're simply paying the school.. you are paying to be a CSS Saint. Am enjoying being here I love the professors, the benedictine value system, and the entire atmosphere. Everyone holds the door open for one another. We all genuinely care for each other. The teachers are very involved and the students are just amazing... best place to learn and make life long friends. Am learning a lot I find the lectures intellectually stimulating. I am learning a lot this semester, along with the last one. I felt the professors were very understanding and they often went above and beyond to help everyone undertand the material to the best of their ability. The homework is a way to reinforce what you learned in class, it never comes across as busy work, I actually find my time in class very enjoyable. Login to rate or flag the reviews",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}