{
    "relation": [
        [
            "Type of Object",
            "Tire Tread",
            "Parallel Pedestrian, Black Clothing",
            "Perpendicular Pedestrian, Black Clothing",
            "Cyclist, Black Clothing",
            "Child’s Bicycle",
            "Parallel Pedestrian, White Clothing",
            "Cyclist, White Clothing",
            "Perpendicular Pedestrian, White Clothing",
            "Static Pedestrian, White Clothing"
        ],
        [
            "Detection (ft)",
            "210",
            "249",
            "268",
            "409",
            "440",
            "814",
            "842",
            "866",
            "925"
        ],
        [
            "126 ft at 25 mi/h",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "197 ft at 35 mi/h",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "278 ft at 45 mi/h",
            "X",
            "X",
            "X",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "370 ft at 55 mi/h",
            "X",
            "X",
            "X",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "474 ft at 65 mi/h",
            "X",
            "X",
            "X",
            "X",
            "*",
            "",
            "",
            "",
            ""
        ],
        [
            "529 ft at 70 mi/h",
            "X",
            "X",
            "X",
            "X",
            "*",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Discussion - Enhanced Night Visibility Series, Volume III: Phase II—Study 1: Visual Performance During Nighttime Driving in Clear Weather, December 2005 - FHWA-HRT-04-134",
    "title": "Table 27. Detection distances by type of object and potential detection inadequacy when compared to stopping distance at various speeds: five UV–A + HID.",
    "url": "http://www.fhwa.dot.gov/publications/research/safety/humanfac/04134/discussion.cfm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00223-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 446140015,
    "recordOffset": 446114165,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{196375=U.S. Department of Transportation Federal Highway Administration 1200 New Jersey Avenue, SE Washington, DC 20590 202-366-4000, 107361=The current results dispute this finding; however, a comparison of similar trials from both studies can provide some information on the reasons for the apparent decrease in performance of UV–A technology in the current study. One reason why UV–A configurations did not result in a 200 percent improvement over HLB in this study might be that the halogen headlamp technology used was dramatically different from the one used in the Mahach et al.(28) study (figure 30). For example, the static pedestrian was a common object in Mahach et al.(28) and the current investigation. Note that static pedestrian detection distances obtained for Mahach’s “HLB-May 97” were 191.4 and 176.2 m (628 and 578 ft) smaller for the HLB and HLB–LP systems, respectively, than the ones tested in this study. While an improvement in detection distance occurred with the UV–A technology used in the current study (compared to the UV–A technology used for the Mahach et al.(28) study), it was not large enough for the UV–A technology to maintain the advantage over the HLB and HID systems used in this study. Another possibility is that given the limited amount of environmental exposure time in the Mahach et al. study (2-s window exposure every 30.5 m (100 ft)), those distances represent less of an absolute threshold, whereas the focus of the current investigation is to identify the exact distance that will produce detection during a dynamic condition.}",
    "textBeforeTable": "The calculations represent a simple and ideal condition, but the formula allows for some visualization of the capabilities VES has. Based on these calculations, the average detection distances for each IR–TIS and HLB VES (table 17) provide enough time to react and brake up to speeds of less than approximately 105 km/h (65 mi/h). HID configurations supplemented with UV–A, HOH, and HHB show detection distances that will allow braking for up to 89 km/h (55 mi/h). The only two VESs that seem to be ineffective at more than 89 km/h (55 mi/h) are HID and HLB–LP; however, some caveats apply. First, these distances were obtained while drivers were moving at approximately 40 km/h (25 mi/h), and their ability to detect objects will not necessarily remain the same as speed increases. Second, VESs that are currently close to the stopping distance or that need a larger stopping distance (e.g., HID, HLB–LP) might quickly become more ineffective when conditions worsen (e.g., wet pavement, worn tires, downhill condition). Third, and most important, when detection distances are analyzed in more detail by examining the significant (p < 0.05) VES by Object interaction, different conclusions can be reached. (In table 20 through table 31, an “X” means the stopping distance might be compromised; an asterisk means the same thing, but in an unlikely scenario.) Several VES and object combinations resulted in detection distances that might compromise stopping distances.   1 ft = 0.305 m",
    "textAfterTable": "  X = stopping distance might be compromised   * = exceeds distance, but the scenario is not likely   1 ft = 0.305 m   1 mi = 1.6 km Table 21. Detection distances by type of object and potential detection inadequacy when compared to stopping distance at various speeds: five UV–A + HLB. Type of Object Detection (ft) 126 ft at 25 mi/h 197 ft at 35 mi/h 278 ft at 45 mi/h 370 ft at 55 mi/h 474 ft at 65 mi/h 529 ft at 70 mi/h Tire Tread 220     X X X X Perpendicular Pedestrian, Black Clothing 382         X X Parallel Pedestrian, Black Clothing 395         X X Child’s Bicycle 469         * * Cyclist, Black Clothing 569             Static Pedestrian, White Clothing 856          ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}