{
    "relation": [
        [
            "Str.",
            "1",
            "3",
            "5",
            "9",
            "11",
            "14",
            "17",
            "21",
            "24",
            "26",
            "30",
            "33"
        ],
        [
            "Autorzy",
            "I. Szczerbal, B. Budaj, M. Świtoński",
            "T. Nałęcz-Tarwacka, B. Dembińska",
            "A. Siekierska",
            "M. Wieczorek-Dąbrowska, P. Wójcik, E. Malinowski",
            "A. Rekiel, J. Więcek, J. Kulisiewicz, M. Batorska",
            "E. Fiedorowicz, W. Sobotka",
            "D. Kowalska",
            "H. Bernacka, P. Niedźwiecki, D. Kasperska, E. Peter",
            "Ł. Majka, M. Zabłocka",
            "M. Borucka, B. Ślaska",
            "M. Szwarc, W. Będkowski, A. Kupczyk",
            "R. Skrzypek"
        ],
        [
            "Tytuł",
            "What information about pigs have we got after sequencing of its genome?",
            "The influence of some factors on somatic cell count in milk of high yielding cows (Summary)",
            "List of the best 100 cows in Poland",
            "The role of cow colostrum and the factors, determining its quality",
            "The selected factors, affecting the body weight of piglets and its relationships with growth traits of the young pigs",
            "Extraction soy meal and alternative sources of vegetal protein for nutrition of pigs",
            "Possibility of applying byproducts from biofuels’ production in rabbit nutrition (Summary)",
            "The behavior of breed sheep Wrzosówka on the xerothermic grasslands (Summary)",
            "Nosemosis – still dangerous disease of honey-producing bees",
            "Eurasian lynx – from biology of the species to molecular genetics",
            "Biogas production in agriculture – is it a profitable undertaking? (Summary)",
            "Posthumous tribute to Prof. Dr hab. Antoni Kaczmarek"
        ]
    ],
    "pageTitle": "Numery Przeglądu Hodowlanego | Roczniki Naukowe Polskiego Towarzystwa Zootechnicznego",
    "title": "",
    "url": "http://ptz.icm.edu.pl/category/numery-ph/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00230-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 202005839,
    "recordOffset": 201934203,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{230995=WSPOMNIENIA Wspomnienie o Profesorze Bogusławie Barabaszu (1949-2010) – J. Niedziółka; s. 32-33, nr 11, 233178=Sprawozdanie z działalności Polskiego Towarzystwa Zootechnicznego w kadencji 2007-2010 – Z. Litwińczuk; s. 12-16, nr 10, 212881=Spis treści „Przeglądu Hodowlanego” – rocznik 2010, 221122=Kubacki S., Drewka M.: Zaobserwowane zmiany w podstawowych wymiarach biometrycznych koni małopolskich w latach 1975-1996; s. 17-19, nr 4, 96329=* Publikacja została opracowana w ramach Projektu i zawiera wyniki Realizacji Projektu Optymalizacja produkcji wołowiny w Polsce, zgodnie ze strategią „od widelca do zagrody” współfinansowanego ze środków Europejskiego Funduszu Rozwoju Regionalnego w ramach Programu Operacyjnego Innowacyjna Gospodarka 2007-2013 (POIG.01.03.01.-00-204/09)., 214084=Blicharski T.: Aktualny stan i wyniki użytkowości świń w Krajowym Programie Hodowlanym w 2009 roku; s. 17-20, nr 12}",
    "textBeforeTable": "Spis treści PH 4/2015 4/2015 (lipiec-sierpień) Wpisy będące osobnymi numerami Przeglądu Hodowlanego Archiwa kategorii: Numery Przeglądu Hodowlanego Dla Autorów Numer Specjalny Prenumerata Archiwum Bieżący numer Kontakt Redakcja Przegląd Hodowlany Przeskocz do widgetów Przeskocz do tekstu Menu główne Szukaj Dla Autorów Numer Specjalny Prenumerata Archiwum",
    "textAfterTable": "32 Z. Sobek Z działalności Poznańskiego Koła PTZ Contents PH 4/2015 Page Author Title 1 I. Szczerbal, D. Mróz, M. Świtoński Monoallelic gene expression – an important mechanism affecting variability of traits 3 Z. Litwińczuk, J. Barłowska The dairy cattle population in Poland and its suitability for dairy production 10 M. Uciński Together anything is possible 11 J. Wierzbicki A voice in the discussion. Monumental progress… cont. in reply to Professor Wajda 13 J. Wierzbicki A voice in the discussion. Monumental progress… cont. in reply to Professor Jasiorowski 15 A. Rekiel, J. Więcek, M. Sońta Scientific and practical aspects of optimization of the birth weight of piglets 17 S. Milewski The results of a comprehensive study on the use of dried brewer's yeast Saccharomyces cerevisiae in feeding sheep (Summary) 21 T.M. Gruszecki, M. Pięta Science in support of sheep breeding in the Lublin region 24 K. Roman Basic principles of hygiene and prophylaxis in rabbit farming 26 M. Smugała, R. Pikuła Assessment of damage caused by Polish konik horses in forested areas (Summary) 28 J. Wojtaś, M. Karpiński, M. Goleman, P. Czyżowski, K. Tajchman Analysis of the work of rescue dogs based on examination results (Summary) 30 E. Jastrzębska, K. Wolińska The role of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}