{
    "relation": [
        [
            "Poster",
            "Dak",
            "Not too shy to talk Joined: 2005/9/7 From: Maryland Posts: 29",
            ""
        ],
        [
            "Thread",
            "Posted: 2008/1/9 20:24 Updated: 2008/1/9 20:24",
            "Re: Hummer HX Aimed Squarely at Wrangler dang.. and here I was thinking Izuzu already did this, didn't they ? I believe they called it the Amigo. Maybe GM was trying to make a cross between the Amigo and a Jeep so they could be 'like nothing else' ???... AGAIN.",
            ""
        ]
    ],
    "pageTitle": "mike's totally free jeep news now - News",
    "title": "",
    "url": "http://www.jeepnewsnow.com/modules/news/article.php?storyid=2727",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00239-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 530946599,
    "recordOffset": 530931745,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "It's hard to come out with something original and separate from Jeep when you try to build a direct competitor to Jeep based in a vehicle lineup who's original design appearance was built by Jeep LOL  Re: Hummer HX Aimed Squarely at Wrangler Posts: 124 From: Kelowna, BC Joined: 2006/6/30 Just can't stay away Updated: 2008/1/9 15:57 Posted: 2008/1/9 15:57   trevorj Thread Poster And when they actually try to get off the pavement (other than parking on the grass in front of their time share) , somebody with a Jeep will be there to pull the wundercar and the pathetic driver from the mud. Let 'em build it. It will be at least 2x the cost of a Rubi, most will",
    "textAfterTable": "Poster Thread 01TJ Posted: 2008/1/9 15:11   Updated: 2008/1/9 15:11 Just can't stay away Joined: 2006/8/25 From: Posts: 109  Re: Hummer HX Aimed Squarely at Wrangler Let's see... High reving V6 with no guts on the low end Heavy All wheel drive, weak! IFS, even weaker! FAKE air drop hooks on the hood, blocking most of the view from the golf cart size windshield. ... i don't think Jeep has anything to worry about. This Hummer, like others is as much competition as a yugo. Poster Thread RUBICON Posted: 2008/1/9 10:11   Updated: 2008/1/9 10:11",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}