{
    "relation": [
        [
            "Rule",
            "No Obvious Typos",
            "General Contact Info Provided",
            "Telephone Contact Info Provided",
            "Physical Address",
            "About Us w/ Team Member Bios",
            "Team Member Bios have Direct Contact Information",
            "",
            "Total",
            "Credibility"
        ],
        [
            "Value",
            "+0.15",
            "+0.175",
            "+0.175",
            "+0.25",
            "+0.125",
            "+0.125",
            "",
            "",
            ""
        ],
        [
            "Before Changes",
            "no",
            "no",
            "no",
            "no",
            "no",
            "no",
            "",
            "0",
            "None"
        ],
        [
            "After Changes",
            "yes",
            "yes",
            "yes",
            "no",
            "yes",
            "yes",
            "",
            "0.75",
            "Average"
        ]
    ],
    "pageTitle": "credibility | The Product Guy",
    "title": "",
    "url": "http://tpgblog.com/tag/credibility/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00235-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 235099027,
    "recordOffset": 235053784,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14187=Growing in popularity by leaps and bounds since its original posting in 2008, this posting has earned prime placement amongst other, more recent, articles that made this year, 2009, SUPERFINE., 5335=And, as 2009 comes to a close, as I did last year, let’s take a brief look at the top posts that made this year on The Product Guy so totally superfine…., 16098=This year also saw the launch of The Product Group (sponsored by Balsamiq Studios) in NYC as an opportunity for Product People of all sorts and levels of experience to meet, interact, and network, in a laid-back, conversational environment.  I am certain 2010 will bring many more exciting gatherings, discoveries, and opportunities; and for those reasons, this too, also helped make 2009 for both Product People and The Product Guy, superfine!, 4704=The Product Guy had another superfine year in 2009, sharing and exploring products, their experiences, and many innovative startups and the founders behind them, while getting to meet and speak with many of The Product Guy’s steadily growing readership., 8389=Many online social products, and more continue to, avoid a formal timestamp format… 2009-10-10 23:14:17 and Thu, October 29, 2004 12:14:19 PM … opting for more user friendly, \"warm and fuzzy,\" human-readable styles… 9 days ago and 5 years ago., 30603=If you would like to attend our next meet-up, RSVP today or visit our group webpage to learn about Holiday Drinks with the Product Group on December 17th at…, 30397=Thursday, January 7th @ 7PM @ Wonderful @ 172 8th Avenue (bet. 18th and 19th St) NYC}",
    "textBeforeTable": "… to which I could do nothing short of taking an eager look at the latest improvements. The results of the evaluation and side-by-side, before and after, comparison follows. CEO @ Likexo.com \" Cristian Ventura Regards, Thanks for get the time to inspect Likexo and give us our feedback. If you got more things to comment about Likexo or how can we improve some things, are you free to contact us. :-) In this week (with other features) we improved the \"about us\" of our site, and we like to show you the new info about us. We are a really early Start Up, and we know that we have a lot of work to do to improve our site, but we are really passionate about our job! :-) Reading your post was very hard, but as any member of the Likexo team, I really appreciate all the feedback that help us to grow (at least) any little step. I’m Cristian Ventura, from Likexo (yes, i am a real person! ;-)) and i have read your blog post about Credibility (that one in that you kill us ;-)), and I wanna thank you about that. \"Hello Jeremy, I received heartfelt email from Cristian Venture, CEO at Likexo.com… The earlier state of the Likexo product resulted in an",
    "textAfterTable": "The before and after results are as different as night and day. Likexo went from a product presenting an air of dubiousness to one emanating solid credibility. Not only do all the previously found typos appear to be eliminated, but… …general and telephone contact information is readily accessible on the ‘About us’ page, and… …background and direct contact information for the Likexo team is provided. Somewhat Direct The downside to the direct contact information is that you have to be logged-in to see and avail oneself of it. Such a direct means of contact is borderline acceptable in meeting the requirement for ‘team member bios with direct contact information’ (It would be much better to always see the ‘Contact’ button, even if the non-logged-in user, upon clicking this button, is immediately prompted to log-in. Even better — let people, logged-in and not, be able to directly contact team members.) Awesome! This outstanding improvement is a great demonstration of just how easy, with passionate and eager people behind a real product, it is for products to create that sound foundation of Credibility upon which to build a company and a brand. I am, for one, looking forward to many new and exciting developments coming out of Likexo as they evolve and grow. And perhaps best summed up in the words of Cristian Ventura, Likexo’s CEO, “Quick-UX in particular is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}