{
    "relation": [
        [
            "Code or Value",
            "0 to 189641.11483",
            "."
        ],
        [
            "Value Description",
            "Range of Values",
            "Missing"
        ],
        [
            "Count",
            "688",
            "1036"
        ],
        [
            "Cumulative",
            "688",
            "1724"
        ],
        [
            "Skip to Item",
            "",
            ""
        ]
    ],
    "pageTitle": "NHANES 1999 - 2004: Los Angeles County, California Demographic File: Demographic Variables and Sample Weight Data Data Documentation, Codebook, and Frequencies",
    "title": "",
    "url": "http://www.cdc.gov/nchs/nhanes/limited_access/LA_DEMO.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00252-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 362133623,
    "recordOffset": 362108035,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{2566=Please refer to the Analytic Guidelines for further details on the use of sample weights and other analytic issues. The Analytic Guidelines are available on the NHANES website. http://www.cdc.gov/nchs/nhanes/nhanes2003-2004/analytical_guidelines.htm., 15676=All Sample Persons (SP) selected from Los Angeles County who completed the household interview have a Demographics file record. Some questions are asked for all SPs, whereas others are asked for a particular subgroup; please refer to the NHANES website to review the questionnaires used during NHANES 1999-2000, 2001-2002 and 2003–2004., 17843=Title: Los Angeles County, California Demographic File: Demographic Variables and Sample Weight Data (LA_DEMO ) Contact Number: 1-866-441-NCHS Years of Content: 1999 - 2004 First Published: August, 2008 Revised: NA Access Constraints: RDC Only Use Constraints: RDC Only Geographic Coverage: National Subject:This demographic file contains the household interview and examination status variables, sample weights, and selected demographic variables such as gender, age, race/ethnicity, education, country of birth, pregnancy status, total family and household income, and poverty income ratio values for participants selected from Los Angeles County. Record Source: NHANES 1999 - 2004 Survey Methodology: NHANES 1999 - 2004 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files, 14535=The NHANES 1999-2000, 2001-2002 and 2003–2004 interview and examination procedures manuals and questionnaires are posted on the NHANES website., 3397=The following six year weights are based on population estimates for Los Angeles County, California, during 1999-2004. Analysts should use the following weights to appropriately analyze the combined six year dataset., 7343=INDFMINC: This variable is the total family income variable and is released as an income range value. NCHS used the U.S. Bureau of the Census Current Population Survey (CPS 2004) definition of “family” to group household members into one or more families (US Census 2003a). The CPS defines a family as “a group of two people or more (one of whom is the householder) related by birth, marriage, or adoption and residing together”; all such people (including related subfamily members) are considered to be members of one family. Approximately 90 percent of the NHANES 2003–2004 households were single-family households; the remaining households were comprised of two or more families.}",
    "lastModified": "Tue, 25 Jun 2013 12:27:52 GMT",
    "textBeforeTable": "Both males and females 0 YEARS - 150 YEARS Target: Interview and Examination Status of the Sample Person. English Text: Interview/Examination Status SAS Label: RIDSTATR Variable Name: RIDSTATR - Interview/Examination Status Both males and females 0 YEARS - 150 YEARS Target: Respondent sequence number. English Text: Respondent sequence number SAS Label: SEQN Variable Name: SEQN - Respondent sequence number Codebook and Frequencies U.S. Department of Health & Human Services. Poverty Guidelines, Research, and Measurement. Washington, DC: U.S. Department of Health & Human Services, January 2011. http://aspe.hhs.gov/POVERTY/ [Accessed on: 02/14/2013] U.S. Census Bureau. Current Population Survey (CPS) Definitions and Explanations. 2003. http://www.census.gov/population/www/cps/cpsdef.html [Accessed on: 06/24/2008] References The Los Angeles County Demographic microdata is available only through the NCHS Research Data Center (RDC). For analysis of the national survey, the stratum variable is SDMVSTRA. The comparable variable for the L.A. sample is WTSVSTRA. Similarly, the PSU variable for the national survey is SDMVPSU, and the comparable variable for the L.A. sample is WTSVPSU. Please refer to the Analytic Guidelines for further details on the use of sample weights and other analytic issues. The Analytic Guidelines are available on",
    "textAfterTable": ". Missing 0 1724 RIAGENDR - Gender - Adjudicated Variable Name: RIAGENDR SAS Label: Gender - Adjudicated English Text: Gender of the sample person Target: Both males and females 0 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 1 Male 804 804 2 Female 920 1724 . Missing 0 1724 RIDAGEYR - Age at Screening Adjudicated - Recode Variable Name: RIDAGEYR SAS Label: Age at Screening Adjudicated - Recode English Text: Best age in years of the sample person at time of HH screening. Individuals 85 and over are topcoded at 85 years of age. Target: Both males and females 0 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 0 to 83 Range of Values",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}