{
    "relation": [
        [
            "Soil Name",
            "Alpha",
            "Beta",
            "Gamma*",
            "Udorthents"
        ],
        [
            "Family or Higher Taxonomic Class",
            "Coarse-loamy, mixed, active, frigid Aridic Haploxerolls",
            "Fine-silty, mixed, active, frigid Cumilic Epiaquolls",
            "Coarse-loamy, mixed, active, frigid Dystric Eutrudepts",
            "Udorthents"
        ]
    ],
    "pageTitle": "NSSH Part 609 | NRCS",
    "title": "CLASSIFICATION OF THE SOILS OF ANY SURVEY AREA, ANYSTATE",
    "url": "http://www.nrcs.usda.gov/wps/portal/nrcs/detail/soils/survey/partnership/ncss/?cid=nrcs142p2_054218",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00210-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 616625115,
    "recordOffset": 616574712,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{154790=Indicate the reference to prior soil survey publications that will appear in the introduction of the published soil survey. A prior published soil survey is a literature citation in the soil survey publication. For example: “The first soil survey for Any Survey Area, Anystate, was published by the U.S. Department of Agriculture in 1903. Maps were printed in 1905. This soil survey is on an aerial photography base and contains more interpretative information.” Enter “None” if there is no prior soil survey publication., 146804=In this paragraph cite persons participating in the correlation, the date, the location, data reviewed, the basis for the correlation, and other items if pertinent. For example: “John C. Smith, soil data quality specialist, and David G. White, MLRA soil survey leader, of the Natural Resources Conservation Service and Joseph I. Black, associate professor, Anytown State University at Any Town, Any State, prepared this correlation the week of October 21-25, 2000. The soil survey database, soil survey publication, field notes, interpretations, laboratory data, correlation samples, field map sheets, and materials from the adjacent soil surveys provide the basis for this correlation.”}",
    "textBeforeTable": "This table is the classification of the taxonomic units that are used in the survey area. Classify taxonomic units that are named at a level above the series as precisely as the data permits. Designate taxadjuncts with an asterisk only if the representative pedon is a taxadjunct. Address map units with major components that are taxadjuncts in the “Notes”. Do not list miscellaneous area names in the classification table. For example: 18. Classification of the Soils. A correlation note for soils that are slightly outside the official series range but are not taxadjuncts. For example: “Beta soils in this survey have a redder subsoil and are slightly more acid throughout than those defined in the official series description. These differences do not affect taxonomic placement or use and management. The official series description was not revised because the color and reaction differences are due to the inherent characteristics of the Theta geologic formation in which these soils formed and which is not the typical formation in which the Beta series formed.” How taxadjuncts differ from the series concept. For example: “Gamma Taxadjunct. This soil is a taxadjunct to the Gamma series because it contains less than 15 percent sand that is coarser than very fine. The soil classifies as coarse-silty.”   Pertinent information about series being established. For example: “Alpha Series. The Alpha series is established by this correlation for soils that were formerly mapped as Beta but that have mixed mineralogy rather",
    "textAfterTable": "* Taxadjunct.  See “Notes to Accompany Classification and Correlation of the Soils of Any Survey Area, Anystate” for details. 19. Join Statement The join statement prepared at the final field review is included that explains where an exact join was not achieved. It should identify what map units need to be reviewed and their joins resolved. 20. Certifications. The correlation document is to contain certification of the following: Mapping is complete. For example: “Mapping completed in June 1999.”   General soil maps and detailed maps are to exactly join with those of adjacent survey areas, and detailed maps join within the survey area. Discrepancies in the join of maps with those of adjacent areas are documented, and a detailed statement of join differences is referenced and included in the correlation document. The reason the maps cannot be joined is given in the join statement.   Databases and interpretations are coordinated and complete. For example: “Databases and interpretations are coordinated, map unit lines of adjoining surveys are continuous across and along the shared borders and the joined map units share basic soil properties and selected soil qualities. All data elements are populated and no obsolete terms are used.”   Type locations are in soil areas that have the referenced names, and location descriptions are correct. For example: “The locations of all typical pedons used in this survey are within the major land resource area and are",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}