{
    "relation": [
        [
            "TRIP",
            "3 Days, 2 Nights",
            "3 Days, 2 Nights",
            "4 Days, 3 Nights",
            "4 Days, 3 Nights",
            "7 Days, 6 Nights",
            "7 Days, 6 Nights",
            "7 Nights, 6 Nights",
            "7 Nights, 6 Nights",
            "7 Nights, 6 Nights"
        ],
        [
            "DEPARTURE",
            "Friday or Saturday",
            "Saturday",
            "Monday",
            "Tuesday",
            "Friday",
            "Saturday",
            "Sunday",
            "Monday",
            "Tuesday"
        ],
        [
            "RETURN",
            "Sunday",
            "Monday",
            "Thursday",
            "Friday",
            "Thursday",
            "Friday",
            "Saturday",
            "Sunday",
            "Monday"
        ]
    ],
    "pageTitle": "Grand Sierra KL",
    "title": "",
    "url": "http://www.canyon-country.com/mohave/grand_sierra_kl.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00033-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 349985961,
    "recordOffset": 349970007,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20255=$2550, 23154=HOUSEBOATS are rented by the DAY not by the night. The houseboat must be fueled and back by 4:00 p.m. on the last day of rental.  Houseboats may only be operated during daylight hours., 21975=$2450, 5508=HOUSEBOATS ARE NOT BEING OFFERED AT KATHERINE LANDING IN 2013. Houseboats are available at nearby Cottonwood Cove. , 21545=$2050, 24637=HOUSEBOAT BOARDING begins at 7 a.m. in the summer season and 8 a.m. September 5th to June 10th. For scheduling, check with marina office upon  arrival. Houseboats must be returned, fueled and unloaded by 4 p.m. on the afternoon of the last day. They offer several boating schedules to accommodate your vacation needs. Please refer to the chart below to plan your vacation., 19825=$2250, 17823=SUMMER RATES May 27-30 June 13 - September 5, 17447=Grand Sierra Rental Rates - 2011, 37913=Rates and Amenities subject to change. © 1999- 2012 Shelly James All Rights Reserved Canyon Country Online, LLC  , 18037=VALUE RATES January 1 - June 12 (EXCLUDING MEMORIAL WEEKEND) September 6 - December 31, 21115=$1850}",
    "lastModified": "Fri, 21 Jun 2013 22:51:18 GMT",
    "textBeforeTable": "Rates subject to change with National Park Service approval.  Rates do not include deposits, fuel or oil. IMPORTANT INFORMATION! HOUSEBOATS are rented by the DAY not by the night. The houseboat must be fueled and back by 4:00 p.m. on the last day of rental.  Houseboats may only be operated during daylight hours. MINIMUM RENTAL is 3 days, 2 nights for houseboats during the  summer season. Shorter rentals are available with marina approval during the value season. During the Value Season, boarding is available any day of the week except Wednesday and Thursday. The rate will be determined at the time of  booking. EARLY BOARDING: For a $200 fee plus tax, you may load and sleep on  your houseboat the night prior to your departure. YOU MAY NOT LEAVE THE MARINA .  On the day of your arrival, you will receive instruction on operating the boat  and you may depart first thing in the morning, after your official checkout. WE  HIGHLY RECOMMEND THIS OPTION. It will save you a great deal of time in loading  your boat and money on the cost of hotel rooms should you have a large group. HOUSEBOAT BOARDING begins at 7 a.m. in the summer season and 8 a.m. September 5th to June 10th. For scheduling, check with marina office",
    "textAfterTable": "GENERAL FEATURES include air conditioning, 110 volt power, 1  propane refrigerator (2 on board the Grand Sierra), blender, toaster, coffee  maker, microwave, AM/FM cassette radio, 4 burner propane stove with oven, gas  barbecue, deck chairs, pillows, paper towels, toilet paper and eating/cooking  utensils. There are no VHF (marine) radios on any boats, it is highly  recommended you bring a cellular telephone (there are cigarette plug-ins for  recharging). A complete list is available below for each houseboat type. For other important information, PLEASE READ THE FAQ  CAREFULLY! CONFIRMATION DEPOSIT: A booking deposit of $300.00 per boat is required within 7 days of our making your reservation and will be applied to your rental fee. The balance of the rental, plus a $500.00 security deposit is due 45 days prior to your scheduled boarding date. The security deposit will be  refunded when the houseboat is returned undamaged and with the inventory intact, and fully refueled.  Reservations that are booked within 30 days of arrival must be paid in full  within 3 days of our making your reservation. FULL HOUSEBOAT PAYMENT is required 45 days prior to departure date.  Visa, Mastercard or Discover accepted.  American Express is not accepted, including the fuel docks. CANCELLATION POLICY:- If you must cancel, notify us in  writing. Any cancellation, which is, received 45 or more days prior to the  scheduled boarding date will result in a refund of your booking deposit,",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}