{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "",
            "",
            "",
            "",
            "",
            "2011-03-01T00:00:00",
            "2011-04-28T00:00:00"
        ],
        [
            "Description",
            "ALTM range files were downloaded from the Optech ALTM 1225 system and decoded using Optech's REALM 3.0 tape decode program.",
            "Raw GPS data were downloaded from three Ashtech Z-12 GPS receivers. One receiver collected in-flight aircraft data; the other two collected data during flight time at separate base stations. The GPS data were converted into RINEX2 format with pseudorange smoothing applied. The National Geodetic Survey's PAGES-NT software was used to compute double differenced, ionospherically corrected, static GPS solutions for each GPS base station with precise ephemerides from the International GPS Service (IGS) with respect to selected CORS sites. As part of the solution tropospheric zenith delays were estimated and L1 and L2 phase biases were fixed as integers. Aircraft trajectories were estimated with respect to all base stations using National Geodetic Survey's Kinematic and Rapid-Static Software (KARS) software. Trajectories were double-differenced, ionospherically corrected, bias-fixed GPS solutions computed with precise IGS ephemerides. Coordinates for base stations and trajectories were in the International Terrestrial Reference Frame of 2000 (ITRF00). Aircraft trajectories were transformed from the ITRF00 to North American Datum of 1983 (NAD83) using the Horizontal Time Dependent Positioning (HDTP) software (Snay, 1999).",
            "The 1 Hz GPS trajectory and 50Hz aircraft inertial measurement unit (IMU) data were combined in Applanix's POSProc version 4.2 to compute an aided inertial navigation solution (INS) and a 50 Hz, smoothed best estimate of trajectory (SBET). The POSPac software employs a Kalman filter to obtain a blended navigation solution. Afterwards, smoothing was applied to the solution to obtain the SBET for the aircraft.",
            "The SBET, laser range observations, scanner position information, and GPS/internal clock files were processed in the Realm 2.27 software suite to generate uncalibrated lidar data points in the Universal Transverse Mercator (UTM) projection. Lidar point data were compared to 1998 ATM LIDAR data over several cross-track piers and roads to estimate lidar instrument calibration parameters: roll and pitch biases, scanner scale factor, and first/last return elevation biases. An iterative, least-squares methodology was used to estimate calibration parameters so as to minimize differences between lidar and ground GPS data. Samples of lidar data were used to create high-resolution digital elevation models (DEM); these DEMs were inspected for horizontal or vertical anomalies. Data collected on September 30, 2008, were compared to kinematic GPS points collected along the E. Pacific Coast Hwy near Laguna Beach. Data collected on September 29, 2008, were compared to kinematic GPS points collected in a parking lot near North Torrey Pines Road. After system calibration and initial quality control step, the adjusted lidar x,y,z-point data were generated by REALM software and output using the UTM Zone 11 coordinate system with elevations being heights above the GRS-80 reference ellipsoid (HAE). The output format from REALM 2.27 is a headerless space-delimited 9-column ASCII file that contains: Column 1 = the point time tag in seconds in the GPS week; Columns 2-4 = the UTM Zone 11 North easting, UTM Zone 11 North northing and height above ellipsoid (HAE) of the first lidar return; Columns 5-7 = the UTM Zone 11 North easting, UTM Zone 11 North northing and HAE of the last lidar return; and Columns 8 & 9 = the laser backscatter intensity of the first and last returns.",
            "Heights above the GRS80 ellipsoid (HAE) were converted to orthometric heights with respect to the North American Vertical Datum of 1988 (NAVD88), using the GEOID99 model. GPS time tags were used to separate the data collected on a single day into distinct passes. The resulting pass data sets were then parsed into 3.75-minute USGS quarter-quadrangle components containing the complete point cloud. Each output file includes data points found within a 20 meter buffer area surrounding each quarter quadrangle. Outlier data points that exceeded designated elevation thresholds (< -20 m or > 250 m) were eliminated during the parsing process.",
            "The NOAA Coastal Services Center (CSC) received the lidar files in ASCII format. The files contained lidar intensity and elevation measurements. CSC performed the following processing for data storage and Digital Coast provisioning purposes: 1. Data converted from UTM coordinates to geographic coordinates. 2. Data converted from NAVD88 heights to ellipsoid heights using GEOID99. 3. Data converted from dual return xyz format to xyz text format with return numbers to las format. 4. The LAS data were sorted by latitude and the headers were updated.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/200810_SCRIPPS_m571.xml&view=ISO19115Components-HTMLTable",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00257-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 618893095,
    "recordOffset": 618876735,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:200810_SCRIPPS_m571Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "1 GPS Continuously Operating Reference Station (CORS) at Pinyon Flats, CA 3 None 1 North American Datum 1983 2007-01-19 1 September 2008 Scripps Institute of Oceanography (SIO) Lidar of the Southern California Coastline: Long Beach to US/Mexico Border 2011-03-01 Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 5 Bryan Riel Center for Space Research, University of Texas at Austin GRA, Aerospace Engineering info@csr.utexas.edu processor 1 Bureau of Economic Geology, University",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}