{
    "relation": [
        [
            "Feature",
            "OpenView Performance Agent (OVPA) HP OpenView Performance Agent (OVPA) is the collection, logging, and alarming component of the HP OpenView Performance family. With its powerful end-to-end application response measurement capabilities, OVPA is the core enabling technology in any performance management, resource planning, and service management strategy.",
            "WBEM Infrastructure and nPAR Provider Required for iCAP, TiCAP, and PPU Web-Based Enterprise Management (WBEM) is an industry standard for monitoring and controlling resources The nPar WBEM Provider supports initial and ongoing configuration of cellular systems"
        ],
        [
            "Benefit",
            "Low overhead, continuous collection and logging of more than 300 global process, application, and system metrics Sophisticated alarming on combinations of metrics, user definable symptoms, and by the length of time a threshold value has been exceeded Full support for the Application Response Measurement (ARM) standard for end-to-end management Easy integration of data from any external source using built-in Data Source Integration (DSI) technology Ability to export data in several standard formats, to generate and send SNMP based alarms, and to generate local actions triggered by alarms. Provides a standalone solution with OpenView Performance Manager and OpenView Reporter Provides integration with OpenView Operations and Network Node Manager",
            "Provides flexibility to configure and re-configure computing resources based upon changing needs and requirements"
        ]
    ],
    "pageTitle": "OpenVMS on HP Integrity servers",
    "title": "",
    "url": "http://h71000.www7.hp.com/openvms/integrity/v83features.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 110892163,
    "recordOffset": 110877711,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16872=OpenVMS Version 8.3 began shipping in H2 2006, and is a replacement for OpenVMS Version 8.2 on Alpha and Version 8.2-1 on Integrity servers. Standard support for OpenVMS Version 8.2 on Integrity systems ended on December 31, 2006. OpenVMS Alpha Version 7.3-2 began Prior Version Support (PVS) on December 31, 2006., 17456=Dated: June 01, 2007}",
    "textBeforeTable": "Warranted Pairs, Migration Support, and Upgrade Paths HP OpenVMS Version 8.3 introduces support for the newest entry-level, mid-range, and high-end Integrity server systems based on the latest generation of Industry standard Itanium processors from Intel, including the BladeSystem c-Class (BL860c). This new release continues support for all of the Integrity servers and options supported in OpenVMS Versions 8.2 and 8.2-1. OpenVMS Version 8.3 includes all the capabilities of OpenVMS Version 8.2 and Version 8.2-1 plus new features added to the OpenVMS operating system. OpenVMS Version 8.3 includes expanded cluster configuration support as well as performance and scalability enhancements. OpenVMS Version 8.3 also includes updates for security and standards, and enhanced Adaptive Enterprise support. OpenVMS Version 8.3 began shipping in H2 2006, and is a replacement for OpenVMS Version 8.2 on Alpha and Version 8.2-1 on Integrity servers. Standard support for OpenVMS Version 8.2 on Integrity systems ended on December 31, 2006. OpenVMS Alpha Version 7.3-2 began Prior Version Support (PVS) on December 31, 2006. This document describes the new features",
    "textAfterTable": "System Support Feature Benefit OpenVMS support for the newest Integrity server systems including new entry level, mid-range, and high-end systems, which are based on the latest generation of industry-standard Intel Itanium 2 processors. BL860c Server Blade (2P/2C;2P/4C); 1.6Ghz/6MB; 1.4Ghz/12MB; 1.6Ghz/18MB rx2620, 2P/4C;2P/2C; 1.4Ghz/12MB; 1.6Ghz/18MB; 1.6GHz/6MB rx2660, 2P/4C; 1.4Ghz/12MB; 1.6Ghz/18MB rx3600, 2P/4C; 1.4Ghz/12MB; 1.6Ghz/18MB rx6600, 4P/8C; 1.4Ghz/12MB; 1.6Ghz/18MB; 1.6Ghz/24MB rx4640, 4P/8C; 1.6Ghz/18MB; 1.6Ghz/24MB rx7640, 8P/16C; 1.4Ghz/12MB; 1.6Ghz/18MB FAST Bundle: rx7640 2-core, 4 core, 8-core, 12-core and 16-core SMP Base Systems rx8640, 16P/32C; 1.4Ghz/12MB; 1.6Ghz/18MB; 1.6Ghz/24MB FAST Bundle: rx8640 4-core, 8-core, 16-core, 24-core and 32-core 1.6Ghz/24MB SMP Base Systems Superdome/sx2000, 64P/128C—maximum nPAR partition size 4 Cells; 1.6Ghz/18MB; 1.6Ghz/24MB; maximum 126Gb memory per cell Provides customers with the ability to run their OpenVMS applications on the latest industry-standard HP Integrity servers Runs increased workloads compared to earlier versions of Integrity servers Provides ability to consolidate systems and reduce footprint in labs",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}