{
    "relation": [
        [
            "Harga",
            "Status Harga",
            "Kondisi",
            "Kilometer"
        ],
        [
            ":",
            ":",
            ":",
            ":"
        ],
        [
            "",
            "Nego",
            "Mobil Bekas",
            "km"
        ]
    ],
    "pageTitle": "Harga-harga Mobil Toyota Kijang Rover - Page 1",
    "title": "",
    "url": "http://www.mobilbekas.co.id/harga-harga_mobil_t.php?s_model=1049=Toyota%20Kijang%20Rover",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00242-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 590090791,
    "recordOffset": 590072011,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{42746= Mobil bekas di Karawang Toyota Kijang Rover th 1990, 54526=jual Toyota kijang Rover tahun 1991 KF40, mesin 5k, Manual 6 speed, 5 pintu, cat bodi masih mulus warna abu-abu metalik, retak-retak dikit maklum mobil udah berumur yang penting mesin sehat halus dan kering, interior bersih rapih, Surat lengkap, pajak masih panjang bulan 1-2016. Lampu nyala semua, AC dingin, radio tape CD. BU segera mau jual apa adanya, masih boleh nego tapi dikit aja, 59729= Toyota Kijang Rover Long warna Hijau Tua tahun 1987 kondisi masih mulus dan normal semua Kenyamanan masih terjaga dan bandel, untuk jarak jauh siap gak ada masalah Harga 32jt, 75853=Mobil bekas toyota kijang rover bodi mulus, alamat bogor tahun 1990, mobil dipakai hanya dalam kota, 42811=AC dingin double blower, jok baru diganti/embitec, kaki2 masih bagus, mesin kering, 1500 CC, power window, pajak panjang, STNK an sendiri. Siap dipakai untuk keluar kota., 70964= Mobil bekas Toyota Kijang Rover, tahun pembuatan 1990, Power Steering,  Mesin Ori, Power Windows. Harap hubungi 0816 73 0464}",
    "textBeforeTable": "",
    "textAfterTable": "Home Pasang Iklan Mobil Cara Pasang Iklan Iklan Mobil Terkini Berita Otomotif Join Facebook Daftar Mobil Dicari Contact Us Pencarian Semua Merk Mobil Audi Bentley BMW Chery Chevrolet Chrysler Citroen Daewoo Daihatsu Datsun Dodge Ferrari Fiat Ford Hino Holden Honda Hummer Hyundai Infiniti Isuzu Jaguar Jeep Kia Lamborghini Land Rover Lexus MAN Maserati Mazda Mercedes-Benz Mini Mitsubishi Nissan Opel Peugeot Porsche Proton Rolls-Royce",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}