{
    "relation": [
        [
            "Skin Name",
            "SKT T1 Jax",
            "SKT T1 Lee Sin",
            "SKT T1 Vayne",
            "SKT T1 Zed",
            "SKT T1 Zyra"
        ],
        [
            "Cost",
            "750",
            "750",
            "750",
            "750",
            "750"
        ],
        [
            "Availability",
            "05-May-2014 - 19-May-2014 17-Sep-2014 - 31-Oct-2014",
            "05-May-2014 - 19-May-2014 17-Sep-2014 - 31-Oct-2014",
            "05-May-2014 - 19-May-2014 17-Sep-2014 - 31-Oct-2014",
            "05-May-2014 - 19-May-2014 17-Sep-2014 - 31-Oct-2014",
            "05-May-2014 - 19-May-2014 17-Sep-2014 - 31-Oct-2014"
        ]
    ],
    "pageTitle": "Champion skin - League of Legends Wiki - Champions, Items, Strategies, and many more!",
    "title": "",
    "url": "http://leagueoflegends.wikia.com/wiki/Champion_skin?page=8",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00009-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 145233531,
    "recordOffset": 145184199,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{52286=As of June 3rd 2013, RiotGames implemented flexible cost bundles where it will adjust its cost for content you already own. They also permanently removed the Gamer's Choice Pack and  Huntress Sivir was included in the Champions Bundle.[1]}",
    "TableContextTimeStampAfterTable": "{298716=From June 12th to July 13th, 2014, this skins were re-released, after which they became classified as \"legacy skins\"; and as such may return in the future:, 224084=26-Aug-2014 - 1-Sep-2014, 99621=10-Feb-2015 - 23-Feb-2015, 78521=24-Oct-2014 - 04-Nov-2014, 319199=* This skin was released after Riot introduced \"Legacy\" skins and retired \"limited edition\" skins. However, due to the skin's announcement being \"unclear\", Riot erred in favour of not re-releasing the skin in 2013 and has not re-released it since. That said, Riot has stated they will likely re-release the skin at the end of Season 2016 (Season 6), as part of a 5-skin Championship bundle. [10], 244217=These holiday skins were released as limited edition, but were later re-released in December 2013 for a limited time and reclassified as Legacy Skins:, 97146=The following skins were first available during the Lunar Revel event of 2014 and were made available for purchase again during the Lunar Revel event of 2015., 269668=05-May-2014 - 19-May-2014, 282743=The release of these skins coincided with the 2010 Vancouver Winter Olympics. They were originally released as limited edition, but were later re-released in February 2014 for a limited time; after which they became classified as \"legacy\" skins and as such may return in the future:, 67359=17-Sep-2014 - 31-Oct-2014, 304863=Originally, there were certain \"limited edition\" skins in this category that were available from the League of Legends store during seasonal or special events and then removed once the event was over. It was stated that these skins were not to be released from the vault for further purchasing to retain their value to the players that owned them. However for a short time between October 2013 and June 2014, these skins were put back on sale. These re-released skins include those from major events in the years 2009 to 2011: the Harrowing, Snowdown Showdown, the Winter Olympics and the World Cup. These champion skins are now classed as legacy skins and may be released again from time to time., 87660=The following Halloween skins were released as limited edition, but were later re-released in October 2013 for a limited time and reclassified as Legacy Skins:, 60688=The theme of these skins marks the beginning of the new competitive season, just as the Victorious-themed skins celebrates the end of a season. Unlike victorious skins, challenger skins are available for purchase by anyone for a limited time. The first skin of this theme was released in 2015, at the start of season five., 283054=They were first available from February 12, 2010 to March 2, 2010. They were later re-released from February 7, 2014 to February 23, 2014., 78441=29-Oct-2013 - 12-Nov-2013, 298451=These skins were released during the 2010 FIFA World Cup, the male ones on June 22, 2010 and the female ones on June 28, 2010. All of them were released as limited edition skins and removed from the store on November 1, 2010. They were originally, 217555=11-Dec-2014 - 6-Jan-2015}",
    "lastModified": "Mon, 03 Aug 2015 05:37:36 GMT",
    "textBeforeTable": "These skins are a tribute to a champion that underwent a significant visual upgrade to remember their old aesthetic look. They were released with the Champion's relaunch and were free for owners that had owned the champion before hand. If the champion was not previously owned it was put on sale for two weeks before being retired to the Legacy Vault. Traditional Lee Sin is available in the League of Legends store as a permanent skin. Note: Traditional Skins 11-Dec-2014 - 6-Jan-2015 19-Dec-2013 - 2-Jan-2014 23-Dec-2009 - 27-Dec-2009 520 Old Saint Zilean 11-Dec-2014 - 6-Jan-2015 19-Dec-2013 - 2-Jan-2014 31-Dec-2009 - 03-Jan-2010 520 Earnest Elf Tristana 11-Dec-2014 - 6-Jan-2015",
    "textAfterTable": "Availability SKT T1 Jax 750 05-May-2014 - 19-May-2014 17-Sep-2014 - 31-Oct-2014 SKT T1 Lee Sin 750 05-May-2014 - 19-May-2014 17-Sep-2014 - 31-Oct-2014 SKT T1 Vayne 750 05-May-2014 - 19-May-2014 17-Sep-2014 - 31-Oct-2014 SKT T1 Zed 750 05-May-2014 - 19-May-2014 17-Sep-2014 - 31-Oct-2014",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}