{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "You receive what you invest. And if you invest all of yourself, you will get back so much in return!",
            "Evangel is an amazing environment to pursue both your studies and your relationship with God. The three-days-a-week chapels give you an opportunity to delve deeper into worship. Evangel provides the opportunity to truly grow with others on your floor both relationally and spiritually."
        ]
    ],
    "pageTitle": "Evangel University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Evangel-University/reviews?_escaped_fragment_=/show/85825",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00206-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898904919,
    "recordOffset": 898861077,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{178693=© 2015, Cappex.com, LLC, 72507=Dorm life is awesome! All the dorms will have been renovated by the fall of 2013. They are nice with the option of having your own room for a fee of course. They are suite styles with one bath. So, two bedrooms with a bath and shower in between that they share. There is no kitchen area, but most people eat in the Cafeteria. It's a great place to build relationships and meet new life long relationships.}",
    "textBeforeTable": "01/14/2010 Reviewer is A current student here. 15 out of 15 people found this review useful. 1 of 38 Ashley from Kirkland, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Bang for the buck Coming from Seattle, the tuition at the other schools I considered was the same or more than the tuition plus room and board at Evangel. It is about 20,000 a year for tuition, room and board. Which makes it one of the most affordable private colleges. In addition, Evangel has many scholarships that students can apply for and a helpful financial aid team that will quickly answer any questions. Am enjoying being here There are so many activities, sports, and ways to get involved. Living in the dorm provides a sense of community and there are always things going on. People are friendly and it is an easy adjustment from high school to college. Am learning a lot There are more than 100 graduate programs and with an average class size of 25 (many of my classes are smaller) you are able to have a lot of interaction with the professors. Login to rate or flag the reviews Autumn from Freeland, MI 12/22/2009 Reviewer is A current student here. 9 out of 10",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}